[
    {
        "title": "Trump has become a major C-PTSD trigger for me.",
        "author": "alwaysbluelobsters",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/4afm86/trump_has_become_a_major_cptsd_trigger_for_me/",
        "text": "[removed]",
        "created_utc": 1457996314,
        "upvote_ratio": ""
    },
    {
        "title": "In last two days I binged Breaking The Faith",
        "author": "ShojiAn",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/4afg93/in_last_two_days_i_binged_breaking_the_faith/",
        "text": "I am from the other side of the world but I feel similar. Everyone outside feels scary. At the moment whenever I feel afraid of someone I am starting to be able (after three weeks being around strangers) to observe it and slowly calm the fear down. \n\nThere are some similarities between my experience and theirs. There were no/very few explicit bans. Growing up with my mom there were few things that were explicitly allowed and if I tried to venture out and try new things I knew that it may be used against me. Even food.\n\nWell, it seems that it's a good time to buy some new clothes but I will rant about it in r/aspergers ;D As someone [posted](https://www.reddit.com/r/LifeAfterNarcissism/comments/4a3wlp/the_mind_control_methods_of_cults_see_link_sound/) couple of days ago cults and narcissists are similar.\n\n(Aunt warned me before cults, I wish she warned me about my mother. But she probably didn't know as she lives/lived in another country.)",
        "created_utc": 1457994039,
        "upvote_ratio": ""
    },
    {
        "title": "I dont even know what to do! Advice needed! Public defender called me?",
        "author": "Waitwhatdidijustsay",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/4af2nq/i_dont_even_know_what_to_do_advice_needed_public/",
        "text": "It sounds court related. But I really have no idea... I'm 22 and I've never had to deal with anything like this. \nI got into minor trouble for arguing with my grandma.\n\nI hope I didnt forget my court date... O.O \n\nAnyways, she said I need to call her back.\nI *need* to.\nHas my anxiety up a bit and now I'm putting it off.",
        "created_utc": 1457989100,
        "upvote_ratio": ""
    },
    {
        "title": "my grandfather just died &amp; my nfather won't stop calling me. (Support)",
        "author": "Retrobebe83",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/4ad9nw/my_grandfather_just_died_my_nfather_wont_stop/",
        "text": "My grandfather passed away early Sunday. My probable n grandma called me that night. My aunt called me too (she's the only normal family member). My nfather called Sunday morning and again today. I have his number blocked so it doesn't ring but he can leave a message. The first one (which I had my husband listen to) just asked me to call him. \"Hi Retrobebe, it's Dad. I need to talk to you. Call me at ###-###-####\". That was it. When I spoke to both my probable n grandma and my aunt, they both brought up my dad trying to get in contact with me (one in a nice way and one in a not so nice way). I told them both I would not contact him. Sorry, N's use tragedy to try and get their insidious claws back into you. I've been NC for almost two years. Not breaking it. Sorry not sorry. \n\nI slept horribly last night. Lots of PTSD dreams and restlessness. Today I woke up to another VM from him. This time I listened to it myself. \"Hi Retrobebe. It's Dad. I tried to call you yesterday. I hate to do this over VM but your grandfather passed away yesterday. I think you knew he has been very sick lately. His viewing is **** and his funeral is **** in [different state]. I hope you can make it. Call me at ###-###-####. Bye\".  \n\nA couple things strike me:\n1. No \"I love you\" or some attempt to play on affection  (which I'm fine with. No love here)\n2. No mention of my pregnancy (which is why I \"can't\" go). I know they know about it. \n3. It was very business like. And he sounded horrible. I know this is rough on him bc he was the GC but I'm not breaking Nc. \n\nI also know what's gonna happen next. He'll probably try and call me at least one more time before the funeral. I will then either get a nasty email or phone call after the funeral about what a horrible person I am. My probable n grandma will also call to yell at me and tell me what a horrible person I am. I'm not answering any of it. I'm tempted to post it all on Facebook too when it happens. I just want to grieve in peace &amp; they will do everything they can to make it about anything but my grandfather's passing. Classic N move to use propriety and expectation to try and wiggle their way back in and stop me from saying the things that need to be said (bc then they can say \"my father died and Retrobebe was sooooooo rude/inconsiderate/nasty/uncaring/etc.\" and paint themselves the victim. Hence the not responding from my end. \n\nThank god I'm looking for a new therapist today! I'm hoping to try EMDR. This trauma stuff is for the birds.  ",
        "created_utc": 1457965380,
        "upvote_ratio": ""
    },
    {
        "title": "Finally have a plan to move on, just need a lot of help carrying it out",
        "author": "butteflyadder",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/4abqni/finally_have_a_plan_to_move_on_just_need_a_lot_of/",
        "text": "My dad was very, very emotionally abusive. I'm working through that. Anyway, I have three months in Alabama on a $700/month income (I work). I have no car. I'm going to Pensacola by bus. I want to be in Pensacola, that's where my boyfriend and friends are. I'm going to go to mental health services because I've been hospitalized upwards of five times so I qualify for \"free healthcare\" (I know this from social workers, and it has worked before). I have people who will let me stay with them. I have most of the big things worked out.\n\nHowever, I'm scared of the deep, dreadful dreadful anxiety that will come with anxiety and missing my dad. I don't know why I miss him and crave his presence. I want to leave and never come back. How do I ensure that? (I don't currently live with him, away from him for 4 months). How do I ensure I make it through this alive?",
        "created_utc": 1457931069,
        "upvote_ratio": ""
    },
    {
        "title": "keep self harming remembering ex craziness",
        "author": "bombow",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/4aaj2b/keep_self_harming_remembering_ex_craziness/",
        "text": "my ex used to go nuts about celebrities and question me over and over again if she saw a woman on tv or in a magazine she was jealous of..i saw something about kim kardashian on facebook and it made me self harm remembering my ex screaming for days  about being jealous of how kk looks...\n\nshe used to be obsessed with other peoples relationships and scream for days about why people were in ploy relationships and \"how can they do that\"..she used to read poly forums to make herself angry then yell at me for long time..i just saw post about poly relationship and make me hit self..\n\n",
        "created_utc": 1457910712,
        "upvote_ratio": ""
    },
    {
        "title": "I just found of my grandfather died and my Ngrandma tried to make me break NC with my Nfather (support)",
        "author": "Retrobebe83",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/4aagee/i_just_found_of_my_grandfather_died_and_my/",
        "text": "My probable n grandma literally just called me moments ago to let me know my grandfather passed away peacefully this morning. He has been sick for a long time and in and out of the hospital since Christmas. I've been able to prepare for this and the following N shit storm. I am not going to the funeral because I am 7 months pregnant &amp; even if I wasn't- it would be so toxic for me. The pregnancy is a very convenient excuse. \n\nOf course when telling me, my probable n grandma brought up how my nfather has been trying to contact me (I do have a VM from her m under my blocked messages. I don't think I'm gonna listen to it. I'll let my husband do it. Idk). She kept telling me he is extending an olive branch and I should respond. She asked me if I would do that for her and I said \"no, I can't.\"  I refuse to let life events and tragedy be the vehicle for them to get their insidious Nclaws back into my life. She kept going about my dad and I kept saying stop. Three times I had to say it. she kept going. I finally said \"Grams, I'd hate to hang up on you because you won't drop this, especially considering why you called.\" She finally dropped it. \n\nLater in the conversation I told her that I was glad she would be surrounded by everyone and that I'm sorry that I am unable to travel to be there. She said \"it's because of the pregnancy right?\"  Even in her grief of the man she was married to for 60 years, she's still plotting and trying to catch me in ulterior motives. God my family is so fucked up. I just reiterated that my midwife said I can't travel beyond an hour away in my condition. (They live 6 hours away).  Which is true but I made her tell me that lol. Self preservation! \n\nOver all I'm just sad about his passing. My grandfather and I didn't have much of a relationship but he was the only one I have. And man, both of my pregnancies, someone close to my grandma died (last time my great uncle-her brother, this time her husband). Watch that be my fault.  But I don't feel bad about not going to the funeral or for maintains my boundaries. \n\nI just feel sad about his passing and morbidly intrigued by my nfather's voicemail. ",
        "created_utc": 1457909618,
        "upvote_ratio": ""
    },
    {
        "title": "Learning Disability",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/4a9bua/learning_disability/",
        "text": "[deleted]",
        "created_utc": 1457893276,
        "upvote_ratio": ""
    },
    {
        "title": "Writing the Dysfunctional Family - I saw this and wished I was a writer! So I'm sharing for those of you who are so good at telling our stories.",
        "author": "Wildkittten",
        "url": "https://www.iowasummerwritingfestival.org/workshop/writing-dysfunctional-family",
        "text": "",
        "created_utc": 1457891880,
        "upvote_ratio": ""
    },
    {
        "title": "Is it me or movies and TV shows valorize Narcissism?",
        "author": "mpierre",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/4a7vfz/is_it_me_or_movies_and_tv_shows_valorize/",
        "text": "I feel like more and more movies and TV shows valorize Narcissist characters who are not necessarily portrayed as evil.\n\nI mean, I can understand when the leader of the evil army is a narcissist. \n\nBut I feel like more and more, Narcissist are painted as people trying to get the job done, that their sickness is for the good of others.\n\nLet me give you a clear example, the trigger that started this post.\n\nWe finally watched Whiplash yesterday. I know, we are late watching it, but we were afraid the movie would trigger us, and it almost did at some point (we had to take a breather a few times).\n\nSpoilers below...\n\nEveryone said how great it was and when Andrew decides to fight back, I was so excited!\n\nFinally, the Narcissist would be hit, but later in the movie, they make a point he didn't learn anything, which in a way, I was fine with: they never learn.\n\nAnd the Narcissist gets back at the character, fine, they almost all do.\n\nSo, Andrew leaves... but he gets back, and he takes controls of the shows and get back at the Narcissist!\n\nThat's wonderful! \n\nAnd then, the Narcissist and the lead character connect and it implies that the Narcissist was RIGHT to put Andrew that far, that he was JUSTIFIED.\n\nWhat the hell?\n\nAnd more and more movies do that!\n\nI mean, I really enjoyed the TV series Parenthood, but everyone loved the slightly narcissist grandfather who was so love-able in how he could be cranky from time to time.\n\nIt just boils my blood. Granted, in Parenthood, he was mostly bening, but in Whiplash, he actually caused a suicide!",
        "created_utc": 1457863536,
        "upvote_ratio": ""
    },
    {
        "title": "A Youtube channel that I watch that has been good for motivation. It has worked for me at times...",
        "author": "saddetective87",
        "url": "https://www.youtube.com/watch?v=jxQChTCOwT4",
        "text": "",
        "created_utc": 1457854622,
        "upvote_ratio": ""
    },
    {
        "title": "Idealized, Devalued, Discarded? (Long Post!)",
        "author": "SS465",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/4a6qj5/idealized_devalued_discarded_long_post/",
        "text": "Hi all, I'm new to the forum and am seeking some clarity on a recent experience. I think that what happened to me is that I was \"love bombed\" -- idealized, and then began the process of devaluing me (I pulled the plug before I let it get any further). I would really appreciate any advice or information on this, as it just happened and I am left reeling and still very confused.\n\nAbout six months ago, I met a guy whom I'll call David. We became friends, and then after about 4 months of a flirtatious friendship we became romantically involved. It was like nothing I'd ever experienced before -- as soon as we revealed our feelings for each other, it went from zero to sixty. David started calling and texting me constantly. Good morning texts, mid-morning texts, sometimes we would exchange 100 text messages a day. All of his were filled with hearts and kissy-face emojis, everything he said was so incredibly sweet -- how beautiful I am, how much he cares for me, how lucky he is to have me, how special I am to him, how I'm the most amazing woman he's ever been with, he's never met a woman like me before, etc, etc. We talked on the phone every night. The sex was absolutely incredible, and it was near constant. \n\nDavid had some pretty sadistic sex fetishes -- immediately, he bought kinky sex toys for us to play with, including a leash and dog collar for me to wear. I didn't read much into it at the time, because I do believe that such fetishes can be practiced in a healthy way, but looking back I wonder if this desire of his was rooted in something darker than simple fantasy. He would pull me around on the floor by my chainlink leash, call me his \"bitch\" and tell me he was my \"master,\" and basically engage in a lot of violent BDSM with me. We did agree on a safe word, which he always honored. David did not get physically violent with me, at least not in any way that I did not consent to, and as soon as I rescinded my consent (i.e. when he hit me too hard during sex) he would apologize and discontinue the behavior. So even though we had kinky, violent sex, I do not feel that he violated me in that way. I consented to everything, and on the occasions when I told him to stop, he stopped. However, this relationship only lasted a grand total of two months. For about six weeks, David idealized me and treated me like a queen. He said \"I love you\" within a month, and he told me we were \"meant to be\" and \"made for each other\" and I was \"The One.\" I felt so complete. I felt like I had finally found the person I was meant to be with, the love of my life. He told me to start picking out engagement rings and planning our wedding. He started talking about moving in together, and ideating about the life we would share together in the future. It all sounded like such a fairytale, and I was deliriously happy. It felt like David and I had been together for years, even though I had only known him a few months, and all of our mutual friends were so happy for us and cheering us on, so I felt that any concerns of mine were allayed by our friends' support. I didn't even have a moment to catch my breath and look at the relationship from a distance -- I couldn't see that it was moving way too fast, and it should have been a red flag, but I didn't even notice. \n\nAbout three or four weeks ago, David's contact with me lessened slightly. He stopped sending me good-morning texts, although we still talked on the phone every night. We virtually stopped having any sex at all. It didn't necessarily alarm me -- I thought that maybe the initial love-fest was starting to wear off and we were finally settling into a normal routine. I thought it would be good for us; that we would finally fall into a comfortable rhythm together now that the initial euphoria had begun to abate. Then two weeks ago, David stopped talking to me entirely. Two days went by with no phone calls and no texts at all. I thought it was odd, but maybe he was busy. So I texted him simply saying, \"Hey, how was your day?\" No response at all. He sent me a half-assed response about 12 hours later with some crap about how busy he was. He told me that he would also be busy for the rest of the next day, so he wouldn't be able to talk to me at all that day either. This was very unusual. I thought maybe something bad had happened in his personal life, but then I saw him screwing around on Facebook all day so I knew everything was fine. I figured I would give him some space. Another three days go by and still nothing from David. Finally, I texted him saying that I didn't understand his silence and he was hurting my feelings. I thought that if he knew he was hurting me (since he had literally said to me, \"I'll never hurt you\") he would be concerned and want to talk about it with me. His response was so cold -- \"I can't talk right now, sorry.\" That was all he said. I responded, \"If you continue on like this, you're going to lose this relationship.\" His response was just one word: \"Fine.\"\n\nI wasn't down for being treated like that -- once David revealed how cruel and heartless he was capable of being toward me, I knew that my trust in him was shattered and I had to walk away.\nI texted David back telling him that if he wanted to break up with me, he should have told me. I told him he was really hurting me and that he violated my love and trust for him. No response. Some hours later, I removed our relationship status from Facebook. About an hour after that, he unfriended me and then actually blocked me. No phone call, no text, no further contact. This was a few days ago, and I haven't heard from him since.\n\nIs this Narcissism? What is going on here? It's like David just turned on me, out of nowhere -- Dr. Jekyll and Mr. Hyde. I have done some Googling and the results seem to come up mixed between NPD, psychopathy/sociopathy, and various \"cluster B\" personality disorders. I know that David has had a very difficult life -- he endured relentless bullying due to a physical disability, and he comes from a very broken home. I want to be understanding, but I just can't be with someone who tells me he loves me and then, mere weeks later, seems not to care about me at all. My head is spinning and I am still so confused from it all. I just don't understand, and I feel like I was just spun around and around and I've finally fallen to the floor and am now left asking myself, \"What the hell just happened?\"\nIf anyone has any insight or thoughts of any kind to share, I would really appreciate it! Thank you.",
        "created_utc": 1457837540,
        "upvote_ratio": ""
    },
    {
        "title": "For those who have gone from NC to LC or VLC, what was your experience?",
        "author": "ajd011394",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/4a5izm/for_those_who_have_gone_from_nc_to_lc_or_vlc_what/",
        "text": "Hi. I'm a 22-year old ACoN with a NDad. Seven months ago, I moved from Massachusetts to Colorado just to get away from him. (I have SC with my EMum, who my NDad is still married to.) Now, I'm moving back to Massachusetts- about a half hour away from where NDad and EMum live- because things haven't really been working out here. I'm mainly worried about seeing NDad; I will be living at my terminally ill aunt's home, and NDad visits her occasionally. I have been thinking I need to develop a strategy until I know what exactly to say to him, if anything at all.\n\nThank you! AJD",
        "created_utc": 1457817243,
        "upvote_ratio": ""
    },
    {
        "title": "The mind control methods of cults (see link) sound remarkably like the methods of narcissistic parents. What do you know (intense sarcasm)....",
        "author": "saddetective87",
        "url": "https://www.freedomofmind.com/Info/BITE/bitemodel.php",
        "text": "",
        "created_utc": 1457791001,
        "upvote_ratio": ""
    },
    {
        "title": "DAE have habit of EXTREME self-deprication?",
        "author": "clutch_purse",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/4a33dr/dae_have_habit_of_extreme_selfdeprication/",
        "text": "And find it almost impossible to control??\n\nI like many of us (I'm pretty sure I've heard this mentioned by other CoN's) have a hard time taking compliments. But my wounded psyche takes it one step further. If someone says something nice about me, or something not so nice for that matter, my automatic reaction is to like verbally stab myself in the face. Tear my shirt off and beg others to flog me. Piss on the carpet and beg to be kicked. WTF. So so so so so so so so so so so so SICK OF THIS\n\n*Example (which may qualify as a long self-pitying rant):*\n\nAt a new job. Now it's a tense environment mind you. Me being hired was apparently controversial or at least got tongues wagging for various reasons. Random person asks me in the (totally crowded and full, I'm sitting alone because I don't have any buddies yet) lunchroom, \"So are you finding many challenges?\"\n\nOr something like that. It was NOT a neutral question. He actually was a sweet guy but now I realize (and I realized then, but I could not consciously process this quick enough...) that he was responding to some of the negative buzz. He really wanted to ask something else but he couldn't. This was his way of planting a suggestion and also...simply breaking the ice at some level, I suppose. \n\nAnyway, me being the codependent slave that I am, worried about displeasing the difficult personalities who were not happy that George hired me (an outsider, as opposed to an internal hire) into such a coveted position right off the bat-- well, I decided to show everyone that I'm basically a gaping wound in human form and wld they pleas please please be so kind as to not feel threatened by me. \n\nSo I answer, \"Yeah, I'm fucking up left and right!\"\n\nDripping with self-loathing. Perplexingly, unnecessarily self betraying and inappropriate :(((( Unable to have a facade of togetherness and simple self protection, which everyone deserves. \n\n\n\nUgh. I can't even go on about this anymore. Hope this makes sense. Point is it was a dumb dumb move in a tricky climate in a very competitive environment. Ended up quitting a few months later. \n\n",
        "created_utc": 1457770391,
        "upvote_ratio": ""
    },
    {
        "title": "[Trigger warning] Not to say that one person's pain is worse than another, but for male ACON does it seem that stigma of recovering from narcissistic abuse is worse for them than for female?",
        "author": "saddetective87",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/4a1u81/trigger_warning_not_to_say_that_one_persons_pain/",
        "text": "Again, not to say one person's pain and history is worse than another - but recently the knowledge that I was abused and have received treatment of depression has resulted in me being forced to 'take a leave of absence' from my employment. It seems that because I am male, that the fact that the abuse was psychological and was at the hands of a physically frail NM it makes me seem 'weak' and 'other'. So now I am trying to repair the damage. And it sucks.\n\nEDIT: The interesting thing is two female colleagues I know are quite open about their past problems with depression and anxiety, and nothing has happened to them professionally or personally. My situation comes to light and I am asked to leave and become a pariah. That seems somewhat unfair.",
        "created_utc": 1457746648,
        "upvote_ratio": ""
    },
    {
        "title": "Nmom took her controlling bullsh*t all the way to my underwear drawer",
        "author": "lil_chilty",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/4a19x0/nmom_took_her_controlling_bullsht_all_the_way_to/",
        "text": "My mom was always very fearful of disorder to a disturbing degree, in part because she grew up with neglectful alcoholic parents but also because of her neurotic, controlling, drill-sergeant personality. I'm pretty sympathetic so honestly her quirks wouldn't be an issue but she habitually excused herself to be overly controlling and aggressive towards me and my father. When I was sixteen or seventeen, my mom decided that I owned too many pairs of panties, and it made her uncomfortable seeing so many pairs circulating through the laundry. So, naturally, she decided to throw away all but 12 pairs of my underwear, and number them on the tags with a black sharpie. It's funny to look back on now, but at the time I had never felt so demeaned and disrespected. Has anyone else experienced something like this?",
        "created_utc": 1457737887,
        "upvote_ratio": ""
    },
    {
        "title": "After NC, at what point did the FMs and the Ns themselves give up on harassing you?",
        "author": "throwawaynpd16",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/4a15y2/after_nc_at_what_point_did_the_fms_and_the_ns/",
        "text": "Just curious of others' experiences. \n\nWe'll have some beautifully peaceful lulls, then one of them will swoop in and toss us back into turmoil for a week or two. It's getting easier to move on after one of these episodes but it's still more than we want to deal with. It's been 6 months for us and we average one to two FM or attempted N episodes per month, does it ever slow down to a full halt?",
        "created_utc": 1457736199,
        "upvote_ratio": ""
    },
    {
        "title": "They say Ns are like toddlers. Looks like my 2-year-old has surpassed my Nparents",
        "author": "ShirwillJack",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/4a0ot2/they_say_ns_are_like_toddlers_looks_like_my/",
        "text": "I changed jobs recently. My new job is at a different city and that means my appointments with my therapist have moved from the afternoons to the evening. A few weeks ago was the first time I explained to my daughter (almost 2.5 years old) I couldn't put her to sleep that night, because I was going to see a doctor. She asked if I was sick, so I told her I was going to talk to the doctor, because that helps mommy. She wanted to come too and talk to the doctor too and was disappointed she couldn't.\n\nThe first thing my daughter did when she saw me in the morning was to ask how my appointment went (in a 2-year-old's way of course). My Nparents never managed to do what my 2-year-old managed to do right off the bat. Puts things into perspective.",
        "created_utc": 1457729690,
        "upvote_ratio": ""
    },
    {
        "title": "I have had a shitty day (support/venting)",
        "author": "Retrobebe83",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/4a09e2/i_have_had_a_shitty_day_supportventing/",
        "text": "I am 7 months pregnant and getting over a nasty 2 week cold. I have had a shitty two days at work where a coworker threw me under the bus, my supervisor made it sound like it was my fault, and the client we work with keeps talking trash about me to said coworker (even though I have done my job). Then in talking to my coworker today about our shared case, she majorly overstepped a professional boundary despite knowing I was upset/angry and that I told her that multiple times. I told her that I was too angry/upset to respond appropriately right now and needed time and she kept pushing until she crossed that line. She accused me of some things that she had no right to accuse me of. So cue triggers of my C-PTSD and making me feel like it's all my fault. (Thankfully my husband and work BFF helped me out and helped me stand up for myself with the supervisor and I have requested to be removed from the case. So yea for taking back control and setting boundaries).\n\nI also just found out that the new job I REALLY wanted (great pay, security, stability, great benefits) that I interviewed for 2 months ago was filled. Im so crushed. It would have made such a difference for my family.\n\nI then heard about another job (again better pay and hours than i have now-we are really struggling financially and my job is a lot of grunt work and super tiring) and bc I am 7 months pregnant, I would not qualify for FMLA (aka maternity leave and the guarantee that my job will still be there after wards). It's illegal in the US to not hire a woman because she is pregnant but it is legal to not offer maternity leave and job security unless she has been at the company for over a year. So I basically can't help my family and get a new job until after I have this baby/finish maternity leave.\n\nSo today just really fucking sucks. I have been working so hard the last few years to rid myself of the Nabuse, go NC, quit the field I hated to go into the new one I always wanted to, pay my dues in this shitty, thankless, low paying job, and right when I am just about to make it all worth it, I'm fucked because Im pregnant. \n\nPlease send hugs (and mini quiches...those sound really good right now).",
        "created_utc": 1457723922,
        "upvote_ratio": ""
    },
    {
        "title": "[Support] Shitty dreams last night, hard to move on.",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/49zu2x/support_shitty_dreams_last_night_hard_to_move_on/",
        "text": "[deleted]",
        "created_utc": 1457718284,
        "upvote_ratio": ""
    },
    {
        "title": "Seeing nDad at my wedding rehearsal (haven't really spoken to him since last summer). Any advice for today or tomorrow?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/49ztoj/seeing_ndad_at_my_wedding_rehearsal_havent_really/",
        "text": "[deleted]",
        "created_utc": 1457718122,
        "upvote_ratio": ""
    },
    {
        "title": "x-post from /r/raisedbynarcissists. Anyone know any good anger management or conflict mediation books?",
        "author": "ijoju",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/49wg99/xpost_from_rraisedbynarcissists_anyone_know_any/",
        "text": "Just wanted to post here and get more recommendations.\n\nBecause of my mom's argument tactics (which I now know is gaslighting) growing up I have developed strategies to combat her verbal abuse. Unfortunately I feel myself using these whenever I have arguments at work. Something about the person's tone or attitude just brings these defense mechanisms out.\nDoes anyone know any good books for handling this anger or developing better strategies?",
        "created_utc": 1457657714,
        "upvote_ratio": ""
    },
    {
        "title": "Why do you think the majority of us are so quiet and to ourselves?",
        "author": "hunterismia",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/49w9r9/why_do_you_think_the_majority_of_us_are_so_quiet/",
        "text": "",
        "created_utc": 1457654816,
        "upvote_ratio": ""
    },
    {
        "title": "Your thoughts on self destructive behavior?",
        "author": "hunterismia",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/49w8mv/your_thoughts_on_self_destructive_behavior/",
        "text": "It's a huge problem for me. I'm trying to make sense why I tend too downward spiral once I'm close to completing a goal or milestone. It's frustrating. \n\nWhat do you guys think?",
        "created_utc": 1457654395,
        "upvote_ratio": ""
    },
    {
        "title": "Advice please when N Mother instigates No Contact",
        "author": "Friendclare",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/49v5d6/advice_please_when_n_mother_instigates_no_contact/",
        "text": "My N parents ( whom I have only recently realised have been N's all of my life ) advised me in an email 7 weeks ago that in their opinion \"it would be best if we did nt Skype or speak on the phone for the time being \" . This was in answer to me questioning why they seemed so angry about something . Admittedly it was an emotive question but one I felt I had a right to ask. \n\nThey had responded very badly to my eldest sons need to get married quickly so that his girlfriend could obtain a USA visa. Whilst my son and his gfriend phoned them to tell them the day before and also told them at the same time that the big 'wedding ' would still go ahead as planned in August my parents had responded by questioning whether they would still come in August . Their reticence had shocked and astounded me ( naive looking back ) as we are a small family and I thought I could rely on them coming ( I am their only daughter and have never been a Mother of the groom before .It is a big wedding and I really thought they would want to be there . The quickly arranged Visa Wedding took place with only myself and my husband there and the brides parents . My Nparents were not included and it was a small no-fuss do as they were only doing it for the visa . It was a magical ceremony tho and one of the happiest days of our lives . ( i prob made the fatal mistake of telling my Nparents thats ) \n\nHowever it seems that my questionning has \"injured\" them as they have decided No More Skyping and their reasons are \n1. its winter and they dont go out very much \n2.  its winter and their friends dont visit as much \n3. they dont have much conversation because its WINTER \n\nAs you can all imagine I saw through all this as they are still Skyping my brother weekly and winter has never stopped them talking before .(  We have historically Skyped twice a week , at regular times and on the same days for an hour each time . ) . My Nparents didn't mention whether we were \"allowed \" to email so a week into the ban I sent them a friendly message .( I didn't feel friendly - I felt very angry but thought it was best to keep a line of communication open ) . I had one back a few days later with a further explanation to the No Skype rule ( because its winter ) . We have exchanged 3 messages each in the now 7 weeks period mostly aboit the weather and she has mentionned that we might resume Skyping when i return from my holiday ( we always used to Skype from our holidays as well ) \n\nI am on holiday now and have read and read as much as I can about N's and they are text book cases . \n\nI would like some advice please . \n\nI am almost 60, my lovely husband of 34 years has parkinsons disease . We live 100 miles from N parents and have them visit us a couple of times a year . They came for Christmas . Everything is \" fine \" if we toe the party line. \n\nI return from holiday in 1 weeks time but have no idea whether she is going to wish to resume Skyping and I suspect she will behave as tho nothing has happened but I still feel very cross . \n\nPlease can anyone advise how i should handle them . Do I tell them that I am angry to have been dropped , that if a friend did that to me , they would nt be a friend any more . \n\nI would really welcome your comments . \n",
        "created_utc": 1457639709,
        "upvote_ratio": ""
    },
    {
        "title": "I was thinking about trying to contact one of my cousins but I don't think I will",
        "author": "ShojiAn",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/49ul7z/i_was_thinking_about_trying_to_contact_one_of_my/",
        "text": "I am not in contact with anyone from my mother's family because I don't know. My whole teenage years I've been listening to my mother talking about my cousins when they were you. When I was at uni I had to listen to her what she is doing with them at that time. \n\nI admit I am jealous because I remember my mother working away, working at home or sitting on the couch telling me that she can't stay sober because of my brother and I. I had to go theater with her because she was able to get cheaper tickets that way and was angry when I wanted to know what we are going to see every single time. Luckily only once I had (as in 'you're coming with me, no discussion', not 'do you want to come with me?') to an exhibit opening.\n\nIt sucks to know that I was forced to be her partner and then listen to her how awesome aunt was/is she to my cousins. I know that it's not my cousins' fault but it still hurts. I don't think I want to be in contact with them at the moment. It hurts too much.",
        "created_utc": 1457632670,
        "upvote_ratio": ""
    },
    {
        "title": "How to tell if someone is a narcissist or just kind of a jerk?",
        "author": "Ekatarinabelekovka",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/49ton0/how_to_tell_if_someone_is_a_narcissist_or_just/",
        "text": "I'm familiar with the characteristics of narcissism...but I'm wondering if someone I know is actually a narcissist or just has some narcissistic tendencies...\n\nThis person is:\n\n-deeply insecure yet very vain\n\n-lies compulsively\n\n-brags periodically about being able to manipulate people/be good at lying (they are, in reality, actually pretty bad at lying)\n\n-expresses little empathy, and claims not to feel empathy for most people\n\n-is extremely sensitive to criticism\n\n-was something of a \"player\"\n\n-doesn't ask friends or family about their lives/well being\n\n-seems to feel like successful people just \"know\" someone\n\n\nSo that all seems pretty close to a narcissist. Is there a real way to know? Obviously there isn't some way test strip I can just use on them that will give me a yes or no, but I'm getting close to this person (I know, red flags everywhere, I probably have my own issues but that's besides the point for the purposes of this post), and I want to know if I'm dealing with a full blown narcissist or just someone who is kind of selfish/immature. Any advice would be great.\n\nI don't feel like I'm being used, or that this person is trying to hurt me...but some of the signs I'm seeing make me wonder if there's a massive issue here that is bigger than anything I'm prepared to deal with.",
        "created_utc": 1457620893,
        "upvote_ratio": ""
    },
    {
        "title": "So, NSister (NC) had her baby...",
        "author": "s00tball",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/49tno0/so_nsister_nc_had_her_baby/",
        "text": "This previous post provides a little background if you're unfamiliar with the epic story of my manipulative NSister and my EParents.\nhttps://www.reddit.com/r/raisedbynarcissists/comments/3nkphx/how_my_nsister_will_kill_my_eparents_and_destroy/\n\n\nI received a text from my kind-of-N/EDad, telling me that my NSister had delivered her baby by C-Section today:\n\n\"Thought you should know NSister has just managed to produce her baby. She had a hell of a struggle and ended up with a section. She's in recovery in hospital, so not contactable until later. Love, Dad xxx.\"\n\nMy initial reaction was physical - that terrified, nauseated-on-a-rollercoaster rush of adrenaline feeling I've come to associate with my family.\nNow I'm just considering what to respond with.\n\nUltimately, I'm NC with NSister for over a year now, and there's been no effort on her part to change that, of course. I am in (irregular) contact with my parents, and we're otherwise on good terms, though they continue to try to blithely throw me under buses for NSister and their own peace of mind. Maybe not overtly, or even necessarily intentional, but consistently. \n\nI've come to see that my own feelings have seldom factored, and whether intentional or not, never when she's been part of the equation.\nStandard stuff.\n\nBoth parents have been told repeatedly the reasons why I'm not in contact with NSister, but refuse to accept or remotely validate them in any form. They still try to drag me back into having a relationship with NSister for the sake of the family as a whole.\n\nAnyway, I'm not a cold bitch, and I think I need to balance a friendly but flat impression (for the sake of a half-decent relationship with my parents), and the NC, on which I will not defer - not even for her child (sadly).\nEvidently they expect the birth of their first grandchild to suddenly change everything and bring us together again (read \"s00tball stop being selfish and over-dramatic\").\n\nI'm hesitant to involve the word \"congratulations\" in reply, which is sad in itself. It's a social norm, but my situation is not socially normal. I'm worried about allowing myself to become a source of attention for NSister by default. Realistically I know that anything I say will be relayed to her by my parents, regardless.\n\n\n**Edit:** I settled on \"Ok, thanks for telling me. Happy that everyone is doing well. Love, s00tball x\"\n\nI suppose we'll see what happens, but this is going to be a weird time.\n\nAnyone who's had this, or similar, experience?\n\n\n\n**Edit2** Thanks for everyone's responses. It's been great to see this with fresh eyes and hear how you've experienced similar situations. I feel better about dealing with Round 1. ",
        "created_utc": 1457620474,
        "upvote_ratio": ""
    },
    {
        "title": "50 Important Life Lessons You Must Learn",
        "author": "saddetective87",
        "url": "http://liveboldandbloom.com/05/self-awareness-2/50-important-life-lessons",
        "text": "",
        "created_utc": 1457614401,
        "upvote_ratio": ""
    },
    {
        "title": "Entropy: How to fight procastrination and get your life on track",
        "author": "rottenx51",
        "url": "https://personallibertyblog.wordpress.com/2016/03/10/entropy/",
        "text": "",
        "created_utc": 1457574388,
        "upvote_ratio": ""
    },
    {
        "title": "Some Progress...",
        "author": "throwawaysifl",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/49rb3h/some_progress/",
        "text": "[Obligatory backstory](https://redd.it/3qvt36).\n\nAfter 6 months of waiting, I finally received paperwork documenting half of the judge's order today. My child support has been officially ended.\n\nNow, if they'd just send me the custody order - because that's going in a frame!",
        "created_utc": 1457573615,
        "upvote_ratio": ""
    },
    {
        "title": "Couples Therapy",
        "author": "Wildkittten",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/49r31g/couples_therapy/",
        "text": "I want to go to therapy with my boyfriend so we can both learn better ways to be in a relationship than we saw modeled by our parents. Therapists keep recommending \"Imago Therapy\" but I bought the Harville Hendrix book and I really didn't like it. Has anyone found a certain kind of therapy that makes you better at being in a relationship?",
        "created_utc": 1457570241,
        "upvote_ratio": ""
    },
    {
        "title": "Anxiety Disorder from N/OCPD Father - Trying EMDR therapy to overcome - AMA",
        "author": "albagaty",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/49qv2n/anxiety_disorder_from_nocpd_father_trying_emdr/",
        "text": "Anything i can do to help others helps myself",
        "created_utc": 1457566956,
        "upvote_ratio": ""
    },
    {
        "title": "Abandonment issues",
        "author": "onepennythrowaway",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/49qa41/abandonment_issues/",
        "text": "I think I might have some pretty bad abandonment issues. I've avoided these issues for most of my adult life by not making friends, keeping to myself so that no-one can disappoint me.\n\nI made a friend a few months ago, from Reddit actually. He lives in a town 4 hours drive away so we talk online and sometimes on the phone. He just told me he's getting a new job and moving to a new town that is 5 hours drive from me. \n\nI started crying as soon as he said (typed) it. I feel like he's leaving me, abandoning me. He has wanted to move to the new town for ages and he's really happy and excited. I should be happy and excited with him, instead I feel sick and lonely. I didn't tell him that of course, I pretended to be happy for him. I'm not sure if he could tell I was pretending.\n\nIt makes no sense, we only talk via technology anyway so wherever he is makes no difference. Even if we met face to face it's only 30 minutes extra drive each. I have no reason at all to feel like this.\n\nWhat's wrong with me? Why do I feel so hurt?\n",
        "created_utc": 1457559017,
        "upvote_ratio": ""
    },
    {
        "title": "\"Why?\" Is something I've been hugely struggling with lately. This helped a lot.",
        "author": "throwawaynpd16",
        "url": "http://narcissistschild.blogspot.ca/2015/12/the-folly-and-futility-of-asking-why.html?m=1",
        "text": "",
        "created_utc": 1457557320,
        "upvote_ratio": ""
    },
    {
        "title": "On avoiding fandom communities to avoid conflict",
        "author": "agent_skullz",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/49purn/on_avoiding_fandom_communities_to_avoid_conflict/",
        "text": "I just had such a lightbulb moment. So I'm a media critic semi-professionally and have intense subject knowledge about weird things like sci-fi, pop culture, adaptation, cultural and narrative theories etc. Literally the biggest way I connect to people in real life is by having intense in-depth conversations about things like Marvel movies or sci-fi TV shows. I used to be really active in fandom but I had to quit, particularly Tumblr because it was—I kept saying—\"toxic.\" I can't follow other fans or critics on Twitter or anything because I can't emotionally deal with hearing their opinions. If I start getting a lot of hits on my blog I get *super nervous* for no discernible reason since comments are turned off. It's all so bizarre because the entire point is for people to read these critiques and to have conversations!\n\nI just realized that I can't deal with it because I've been trained to consider any disagreement to be the end of the world. There was never any space for dialogue when I was growing up, so someone expressing a different opinion clams me right up as if they walked in and threatened to punch me. I immediately fawn and just acquiesce to a differing viewpoint even when I think it's wrong or misguided because I actively avoid conflict. It's like if someone expresses an opinion authoritatively enough I immediately just think \"well, obviously I'm wrong so I'd better shut up and agree or else I'll get in trouble and look stupid!\" It's so strange to completely avoid people with the same interests, but I kept feeling like otherwise my headspace would get \"tainted\" (it literally felt malformed somehow when it scraped against something I disagreed with, like I *had* to change what I thought or else) and I'd lose the things I loved. It also really didn't help that the culture on Tumblr turned into people shaming and flaming *everyone* as horrible and \"problematic\" to shut down dissent and win themselves social capital (&lt;&lt;--this sociological crap is why no one talks to me (this is hyperbole, people talk to me)).\n\nAnyway, I only noticed this because someone linked me to a really smart video review of TFA that said everything I wanted to say unabashedly because the reviewer was completely unafraid of getting flamed for not liking something so universally loved. That, in combination with having some really great Twitter conversations last week, *plus* my editor telling me that I had to write a nice review about a TV show that *I* didn't like but that was critically acclaimed because otherwise it \"made them look bad\" made me just stop and be like \"no. Wait. I won't. It sucked. And I'm going to tell you why I think so even if everyone else *does* love it.\" Kind of liberating! I'm going to work on not letting people influence me so much.",
        "created_utc": 1457553966,
        "upvote_ratio": ""
    },
    {
        "title": "We're on the front page!",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/49mzj8/were_on_the_front_page/",
        "text": "[deleted]",
        "created_utc": 1457507028,
        "upvote_ratio": ""
    },
    {
        "title": "We're on he front page!",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/49mzb9/were_on_he_front_page/",
        "text": "[deleted]",
        "created_utc": 1457506914,
        "upvote_ratio": ""
    },
    {
        "title": "Went NC with N Ex-GF and I am not feeling good about it",
        "author": "VulnerableBear",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/49lw5d/went_nc_with_n_exgf_and_i_am_not_feeling_good/",
        "text": "To preface, I was diagnosed with codependency or SLDD (Self love deficit disorder) and through much information to my therapist we found out that my ex is a Vulnerable Narcissist.\n\nPardon my grammar for I really need to vent.\n\nI found out that my ex was cheating on me and confronted her about it, of course she denied it and blamed all of the suspicion on me and how I will not allow her to have friends, that I am being suspicious for no reason, and that I am being jealous for no reason.\n\nShe wanted to remain friends afterwards and being that I did not know how to create healthy boundaries for myself I let her tell me about the \"new\" guy and attempted to be her friend. I soon realized that this is not what I wanted, I took most of my belongings from the apartment and went NC. Needless to say she was very upset and put all the blame on me instead of realizing that what she was doing and asking was inappropriate. I have been NC for about 2-3 weeks.\n\nSkip to today, I don't feel good about what I did. I feel like I should have continued to try harder for my relationship and that I was the one who failed. I know that no matter how hard I tried to reach her goals the goal would then change and would never be fully attainable. I feel like I stuck in a whirlpool of dark feelings and emotions and cannot seem to bring my head up for air. I wonder if my decision was the right one or if I should have dealt with it. Rationally I know it was correct and I know that my feelings to take care of her come from my upbringing with N step-father and codependent mother and have no root in actually needing to continue being there for her. I just feel so alone and like I am never going to be able to have a normal relationship. I am afraid of people taking advantage of me and not respecting me for who I am. I am afraid that I don't know who I am any longer, all of my goals were her goals, my views her views, and lifestyle was her lifestyle.\n\nWho am I? Where am I going? Why did this happen? These are all things I still trying to figure these out.",
        "created_utc": 1457489710,
        "upvote_ratio": ""
    },
    {
        "title": "Disturbing fantasy about Nmother",
        "author": "hunterismia",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/49lqkl/disturbing_fantasy_about_nmother/",
        "text": "Curb stomping her, choking, pissing on her, hitting her with a car, running her over with a car, scratching her eyes out, scratching her face off, dragging her by her hair down the street and then swinging her around by her hair like in Matilda, suffocating, water boarding, nail gun, fire, water, guns. Anything that would harm her. Physically and preferably mentally would bring me great satisfaction. Am I okay? I'd never actually do these things to her. It's nice to imagine though... \n\nHave you now or in the past had a fantasy of hurting your Nabuser? ",
        "created_utc": 1457487416,
        "upvote_ratio": ""
    },
    {
        "title": "My mother is still grieving my abuser and I am getting very tired of hearing about it",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/49hrml/my_mother_is_still_grieving_my_abuser_and_i_am/",
        "text": "[deleted]",
        "created_utc": 1457429474,
        "upvote_ratio": ""
    },
    {
        "title": "I want to start discovering what music I like, recommend some songs please",
        "author": "Narcissisticsucks",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/49h1yn/i_want_to_start_discovering_what_music_i_like/",
        "text": "Hi all, I'm glad to say things been going through well, since then, I want to know some music that I like. I figured there are lots of types of music, and guess what, the playlist previously on my list doesn't suit me at all. It was not surprising. \n\nNow, I want you to recommend some songs to me, so I can choose what I like from these songs. \n\n(I used to listen to emotional songs, jazz, high tiers like classical, which does not express myself at all. )\n\nHow is this related to RBN? Well, self-discovery in music it is. I'm down-to-earth, kind of realistic, kind of stoic (endurance and faith in my heart) person.",
        "created_utc": 1457415926,
        "upvote_ratio": ""
    },
    {
        "title": "Feeling frozen",
        "author": "TheTartanDervish",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/49gvei/feeling_frozen/",
        "text": "[removed]",
        "created_utc": 1457413156,
        "upvote_ratio": ""
    },
    {
        "title": "I don't know why, but this always makes me feel a bit better about my struggle. Shout out to Star Trek fans! Other videos included in list.",
        "author": "saddetective87",
        "url": "https://www.youtube.com/watch?v=Qe7axuTmoUg&amp;index=51&amp;list=PLCA9692B956DDC79C",
        "text": "",
        "created_utc": 1457394984,
        "upvote_ratio": ""
    },
    {
        "title": "Analyzing my operating system, finding my avoidant areas",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/49f68b/analyzing_my_operating_system_finding_my_avoidant/",
        "text": "[deleted]",
        "created_utc": 1457389568,
        "upvote_ratio": ""
    },
    {
        "title": "resources on social skills for adults?",
        "author": "8pointsforgryffindor",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/49eofz/resources_on_social_skills_for_adults/",
        "text": "Hey does anyone know of any helpful resources like books, blogs, podcasts, or audiobooks that are dedicated to helping adults build social skills?\n\nI was fairly isolated as a kid with alcoholic, hermit parents, so there are a lot of important social milestones and skills I missed out on because a lot of life happens after happy hour. I'm looking for something that is pretty basic. \n\n(example... I would like to learn the basic social ettiquette of how to have guests over and invite people to my house. It's something I'm extremely uncomfortable with right now but I want to work on it.)\n\nJust wondering if you all know of any good resources!",
        "created_utc": 1457383402,
        "upvote_ratio": ""
    },
    {
        "title": "Is it possible for us to have healthy, functioning relationships?",
        "author": "worriedaboutlove",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/49e6sy/is_it_possible_for_us_to_have_healthy_functioning/",
        "text": "My boyfriend of 6 months just broke up with me (on our anniversary). This is probably going to turn into a bit of a rant.\n\nI've been going through a hard time recently. In my quest for LC from my parents, I moved cities about 7 months ago for a kind of crappy job. Lost that crappy job, and spent the past two months looking for work. I'm set to start my new job soon, and I'll hopefully be getting my own place soon (live with family).\n\nI met my boyfriend at this transition, and I was upfront with him about all of this, and my parents. He seemed to take it well. He would repeat mantras like, \"We're a team\". He talked about how he wanted to stay with me for a long time, as recently as last week.\n\nBut then, out of nowhere, he broke up with me, and stated that we were too different, he didn't care about what I talked about, and I didn't care about what he talked about. I told him that I thought this was the result of my life stressors, and I would double down to make sure we were enjoying each other's time again. He told me that he thought this was actually my personality. I told him I would work on improving my coping skills, and that I was looking forward to the positive change the next weeks would bring. He told me that he \"doubted\" I could change.\n\nWe actually met online, and I discovered that he immediately reopened his account, and changed his profile to reflect (for lackof a better phrase) how he changed during our relationship. Meaning, his favorite food listed is now mine, which I introduced him too. And, he has changed his career goals to what I do/want to do.\n\nWith all that being said, now I am doubting my ability to find someone who can \"deal\" with me. It seems like I'm too much for everybody. ",
        "created_utc": 1457377684,
        "upvote_ratio": ""
    },
    {
        "title": "The line between codependency and having no friends because your standards are too high",
        "author": "otwu",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/49dbvb/the_line_between_codependency_and_having_no/",
        "text": "Hi all,\n\nRecovering 25yo SoNM here, low contact since November 2013 and no contact since January 2015. I have clinical depression and run my own business.\n\nPrior to my therapy journey and my insights about narcissism, I had no standards at all for the people I let into my life. I guess my therapist would say that I had no boundaries. This is true for all areas of my life: romantic relationships, friendships and even the sort of work I did. If someone wanted to be in a relationship with me in either of those areas, I was so needy that I always accepted. I was like this until around October 2012, when a bad experience at work made me think about my standards and start to question my direction in life.\n\nHere are some examples:\n\n* A few years ago, I got into pick-up artistry. My standards were so low that I did sexual things ranging from making out to having sex with any female that was interested. Two one-night stands come to mind where I didn't even find the woman attractive. Pretty sad, looking back on it.\n* My first serious romantic relationship started after a very attractive girl I had been seeing dumped me. The same night, I had a fling with another girl from my social group, who I wasn't even interested in as a person. It was all about having someone else there to fill the emotional void inside me - something I now recognise as a codependent trait.\n* I have a long-term \"friend\" from my pick-up days who I find objectionable in many ways. He is a serial player and cheats on his girlfriend (also on his ex-girlfriend, dozens of times, about 25% of which she knew about). He has political views I find offensive. He is the sort of person who gives unwanted advice and rarely empathises with my feelings. The things that connect us are 1) we have been in regular contact for 6 years and 2) we are both small business owners and musicians. \n* When I started my career, I had the approach of take anything that was offered to me, rather than choose a direction that suited my personality and go for that. This led me to some terrible corporate jobs with some truly awful managers. The jobs might have been fine for other people, but the drudgery of office work was basically torture for me. \n\nI am much more self-aware than a few years ago, but I still feel that I have this problem to an extent. I like aspects of my current girlfriend's personality and find her ok-looking, but I don't think I would have pursued her if she hadn't pursued me. I like that: we are both musicians, we are both interested in freelancing, we are both INFJs, she is a good listener, we are both interested in psychology, she is able to take criticism, she comes from a much more sane family than I do, she is very physically affectionate. I dislike: how she stonewalls me sometimes when she is angry, how she can be needy if I don't speak to her for a few hours, the fact she is slightly overweight.\n\nSometimes I feel like I should end the relationships I have with her and my other pick-up artist friend. I often have the feeling that I give more emotionally than I get back. There are also aspects of each that annoy me, sometimes to the point of anger and anxiety. Then again, to an extent, I have this issue with everyone in my life. I have a good relationship with another ex. She is an amazing listener and we always have loads to talk about. The challenge is that she is very mercurial and I often resent that I am always the one who contacts her. I have a good relationship with my brother overall, but I wish that he listened to me better and empathised better. Despite a N upbringing and being the GC, he is not abusive, although he does say hurtful things occasionally. The good thing with him is that (unlike my Nmum) he is always open to constructive criticism.\n\nAs I learn to have boundaries, sometimes I think that I would have no friends at all if I was completely honest with everyone around me all the time. Perhaps it's because I was raised by a hypercritical parent, but I often see the flaws in other people - and, of course, myself. I long for contact with someone who has all their issues resolved and accepts me as I am all the time, but I am aware that such a person does not exist. My therapist thinks that this need is like a ACoN's illusion of a perfect parent realised in adulthood; no-one will ever compare to the perfect image projected by my mum. I also think that I still struggle with the effects of overparenting. Since my mum did everything for me as a child and young adult, I look for people who always manage to meet my every need - and am invariably left disappointed. \n\nI'm not quite sure what I'm looking for by posting this, but if my story resonates with anyone, I would welcome insights and empathy. ",
        "created_utc": 1457367350,
        "upvote_ratio": ""
    },
    {
        "title": "My Nmom has been faking her new ugly appearance...",
        "author": "craaackle",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/498ier/my_nmom_has_been_faking_her_new_ugly_appearance/",
        "text": "I'm VLC with my Nmom because my grandma, who I want to keep in touch with, lives with her. I go over to visit my grandma once a week and it's usually in the daytime so running into my mom has never been a problem. This means that I see my mom once a month at my extended family's place when she's invited for family events. I call them my extended family but they have been more like parents to me then my own parents were - just last weekend they said we (their kids, my husband and I) are all their children.\n\nSo anyway, this week I went to see my grandma. She showed me a picture that was taken a little while ago at some church social and my mom looked great! My mom has always been good looking so it wouldn't have been surprising. EXCEPT! At every family event she's been to recently she shows up looking old and disheveled. Like bags under her eyes, her hair messy, no makeup, ugly clothes. She's very vain so this was a stark difference from how she presented herself before I cut contact. In the picture she looks great and well put together!\n\nI don't know what the deal is with that but my gut is telling me she's been doing it to get sympathy from me or my extended family. That would, sadly, not be beyond her. The hilarious bit is no one has taken the bait and I was actually pretty happy that she's been looking so awful. I felt like her outside finally reflected her inside. To see her looking normal again didn't undo that happiness. I thought \"oh great she looks good and healthy\" and I moved on.\n\nEither way I win...",
        "created_utc": 1457289225,
        "upvote_ratio": ""
    },
    {
        "title": "My family can't handle Happy, Independent Me.",
        "author": "CallMeValiant",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/4964u7/my_family_cant_handle_happy_independent_me/",
        "text": "Just realized something... my Golden Child brother basically think I'm a selfish person who \"embarrasses\" the family. Apparently independent me who stays away from my Nmom is too obnoxious.\n\nAnyone else find this same thing happens when they break away?",
        "created_utc": 1457243610,
        "upvote_ratio": ""
    },
    {
        "title": "Can you guys recommend podcasts about being an ACON?",
        "author": "PrancerPrancer",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/4927eg/can_you_guys_recommend_podcasts_about_being_an/",
        "text": "I'm signed off work with a nasty illness for at least a few weeks. TV and reading are tiring, so I can only watch/read a few hours each day. But podcasts and audiobooks are great and don't tire me. LAN, can you guys recommend any good podcasts you've found about being an ACON or being RBN? Because I'd love to discover some new shows to listen to. Thanks so much for any suggestions.",
        "created_utc": 1457180111,
        "upvote_ratio": ""
    },
    {
        "title": "51 Age Quotes - Quotes about Age, Aging and Youth",
        "author": "Adinamada",
        "url": "http://ddquotes.com/age-quotes/",
        "text": "",
        "created_utc": 1457162814,
        "upvote_ratio": ""
    },
    {
        "title": "Finally doing some things for myself... rambling",
        "author": "riparianlorax",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/491dyz/finally_doing_some_things_for_myself_rambling/",
        "text": "I am a mid twenties survivor of abuse by my Nmom who I am LC/NC with. I have recently taken up fitness kickboxing at a local karate place. This is the first time I've ever joined a fitness program like this. When I was little (kindergarten or so) I wanted to take ballet classes but I was always afraid to ask my Nmom because of the perceived expense - we were always \"too poor\" for things like that.\n\nSometimes I show up about ten minutes early to class and watch the kids karate classes wrapping up. Some of them are little kids and some of them are teenagers. The instructors are really supportive at the karate place and I can't imagine having that kind of support when I was a kid. This is a family-oriented place so sometimes they even have the parents participate in the class with the kids. The instructors have little pep talks at the end of the classes about how family and friends are really important and it is surprising to me that for those kids it rings true.\nAll I think about when I see this is how I wish I had this when I was a kid, but how terrible it would have actually been if I did. My Nmom would have made it all about her and would have guilted me into wanting to go at all. She talked me out of taking marching band in high school because she was so upset she wouldn't be able to come see me play at the football games (who cares?!), and I feel like something similar would have happened if I tried to get involved in something else.\n\nI guess what I've been thinking is how fucking sad it is that kids have to deal with having shitty parents. And how totally different my life would be if I had gotten involved in fitness activities earlier on.\n\nBut I am doing something for myself. I am taking these classes to better myself and learn some self-defense. I like it. I like being around the instructors since they are so supportive and nice. I'm still struggling keeping up, fitness-wise, but I haven't fallen out yet!\n\nIt's been a real bittersweet experience, for sure.",
        "created_utc": 1457158948,
        "upvote_ratio": ""
    },
    {
        "title": "Getting triggered at work, what do I do?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/4918ta/getting_triggered_at_work_what_do_i_do/",
        "text": "Hi,\n\nI was going to post this on RBN, but most of the posts on there are about the family stuff, and this - well, this is about the family stuff, but the current situation is work.\n\nI have a customer service job that I don't care much for, but the hours work with my schedule (it's a second job) and I do need the extra cash.\n\nThe training is not very good - nor is it bad, it's just not very good. I've been there 3 weeks. Some of my managers are condescending (or I think they are! I can't tell!) and they speak patronizingly to me, get frustrated with me, and aren't always around to train me or available to help me, and sometimes act like I am inconveniencing them by asking questions or for help. This is triggering on many levels:\n\n1. The authority issue: my managers are above me, and the power imbalance already makes me uneasy.\n\n2. The mistrust issue: I already don't trust them, because they are people.\n\n3. When I need to do something but I don't know how - this can trigger me all by itself.\n\n4. Then when no one is around to help me, I feel unhelped.\n\n5. Then when they do \"help\" but seem frustrated or patronizing.  \n\nSo this is very triggering for me.  I don't think I want to quit this job, because it is likely I will need to do customer service as my side-job, because of the weekend hours.  And I do not believe I would have a better time in a different work place.  This is because these issues I've listed have come up before in past jobs. Now, I'm in a better place than in the past, but far from above getting triggered.  I doubt this would be better somewhere else (past experiences tells me no) and I do need a week-end job and there are not many jobs around where I am right now.  \n\nAnd I have to learn how to manage these issues at some point.  I have already had issues with two managers at this place, and I've only been there for 3 weeks.  I've already spoken to the main manager about these issues; she is telling me she understands the problem, and regrets that there is not currently better training/support available to new people at the moment.  (Truth be told, these managers are not very good managers - but like I said, this is a random side-job, the place is in transition, and yeah, I feel confident enough to say that some of the managers are actually not good at managing. Problem is, I'm not good at managing myself with managers who are not good at managing - due alot to the triggering situation.) She told me that within the next few weeks, they are hiring on another manager, which will help everyone have more time and availability, and less stress and frustration. She said but for now, these issues need to be addressed - and they have been addressed, albeit very recently (today) so I am really not sure how this will pan out. I don't know if I will see a difference, and mostly, I don't know how I will manage this.  I got really upset the first time, and less upset today but still upset.  I spoke up both times, but it does not seem resolved to me yet.  What do I do? How do I manage this? I don't want to up and quit right now and just bail, but at the same time, I don't trust myself to handle these situations if/when they keep coming up. Plus, I don't want to put myself through that kind of stress unnecessarily.  If nothing changes, then it was unnecessary. But if something changes, then it was not unnecessary.  I guess I'm worried about what will happen though, and what I'll do if/when it happens again, as it really upsets me in those moments.  But it upsets me alot less in those moments than it used to.  So while I am seeing progress, I'm not sure it is enough to feel I can handle getting triggered.  \n\nWhat do I do?",
        "created_utc": 1457155936,
        "upvote_ratio": ""
    },
    {
        "title": "Today Was Interesting, or, How My NDad Outed Himself And Broke His Relationship With His Parents",
        "author": "StoneColdSteveRogers",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/490doa/today_was_interesting_or_how_my_ndad_outed/",
        "text": "I apologize in advance, because this is going to be long.  \n\nContext: In May of 2015, I finished my Bachelor's degree.  Ever since, I've been coping with student loan debt that I was told I wouldn't have, until my parents changed their minds in my last semester.  At the same time, bouncing around from one temp gig to the next in a struggling job market and treading carefully as my father threatened me with homelessness over jobs I applied for.  On January 8th, 2016, I moved to live with my grandparents in another state.  Since then, I've had better luck in finding work, and have been getting back into my hobbies and reconnecting with family I haven't seen in a while.  \n\nFast forward to today: My father comes to visit at my grandparent's house for lunch.  After spending the entire meal not talking to me at all, he wants to start a conversation without my grandparents present.  To this end, my grandparents go sit in their office (which is right next to the room this conversation is occurring in).  As the conversation proceeds, with various insults and threats, including confiscating the car I use to go to and from work, all the other stuff I'm used to at this point.  At this point, my grandparents intervene.  This is where my father crosses a line that even I didn't expect him to.  He goes verbally on the attack at my grandparents for taking me in and helping me with financial burdens such as my student loan and insurance costs.  He even went so far as to tell them that he's essentially walking away from relationships with them for the time being.  After this point, he just walked out.  But yes, he's so determined to keep his fingers meddled in my life, that he will put his relationship with his parents on the ropes over helping me stay away from him.\n\nAgain, sorry for the length, but I just had to put this out there.",
        "created_utc": 1457140670,
        "upvote_ratio": ""
    },
    {
        "title": "DAE have trouble with the fact that do many people dont see the Ns for what they are, or at the very least don't say \"enough is enough\"?",
        "author": "throwawaynpd16",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/48zirp/dae_have_trouble_with_the_fact_that_do_many/",
        "text": "I don't understand how people continue to put up with their behaviour and dictatorship. We had family members tell us in the beginning that they knew what we were going though etc etc. These people turned into flying monkeys pretty quickly and have now ostracized me for having the audacity to try and change the status quo.\n\n\nWhy can no one see that Ns are so very wrong? Why do people blindly follow them? Has anyone had any experiences with family members or friends who did eventually see the light, so to speak?",
        "created_utc": 1457128367,
        "upvote_ratio": ""
    },
    {
        "title": "Some advice I found ... Complex Post Traumatic Stress Disorder (C-PTSD)",
        "author": "saddetective87",
        "url": "http://outofthefog.website/toolbox-1/2015/11/17/complex-post-traumatic-stress-disorder-c-ptsd",
        "text": "",
        "created_utc": 1457125111,
        "upvote_ratio": ""
    },
    {
        "title": "Avoident personality disorder - advice please",
        "author": "Noisntyes",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/48wzsu/avoident_personality_disorder_advice_please/",
        "text": "Hi!\n\nWent NC for a year, been figuring out a lot of things.  Currently working out the issue of working for a boss.  I tried working in a restaurant, and I loved it, but working for a narcissistic sociopath doesn't appeal to me anymore so I quit my job and I figured I will allways have trouble working for someone.  \n\nSo thats why I started to work for myself, I went to the chambre of commerce, talked to different people and I now have the oppurtunity to start on my own. \n\nSo, I am on the point of starting my business, and, I still have some work to do on my business plan and I have to make some appointments, buy some machines and so on... \n\nBut the problem is, I get distracted SOOOO easily,  I can't seem to go further, it feels like I am stuck, nothing is happening, when I want to work on my plans, I feel anxiety, I am distracted, I go on facebook, reddit, whatever and at the end of the day I haven't done anything.  I just can't seem to take responsibility and go for it.  It's weird. \n\nMy questions are: Does anyone else experience this?  How do you handle things that are important?  How do you define avoident personality dissorder?  How do people with this condition heal or improve?  I want to know everything about this. ANY help is appreciated.  Thanks for listening",
        "created_utc": 1457091678,
        "upvote_ratio": ""
    },
    {
        "title": "I don't know how to keep friends.",
        "author": "uuntzuuntz",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/48uycp/i_dont_know_how_to_keep_friends/",
        "text": "Hi, I'm new to this whole \"Raised by Narcissists\" concept but I think my concerns are better suited for this sub.  Sorry if this post gets really long.\n\nI am from the USA but now I live and work in Asia. There are a lot of reasons for that, but a humongous part of that is wanting to get away from someone I now understand is my narcissistic grandmother.\n\nI'm out of that environment -- for the most part, at least -- but I guess I'm still dealing with the effects of being raised by her.  My situations with relationships has been awful.  I've been here about nine months, give or take, but I feel I have *less* friends than when I first arrived in this country.\n\nAdapting to a pretty different country with a different language, having my first *real* full-time job, it's been a challenge.  I've had stress regarding these things; I expected this.  But what I didn't expect was having so much trouble with *people*.\n\nI feel like I have no real friends.  *At all.*  Before this I dealt with depression and anxiety and was stuck with my N-granny in the countryside, and had lost a lot of contact with people from school, for instance (there was an *x*-year gap between my uni graduation and this job).  But I had friends on the Internet and stuff.  People from my uni and hometown that have moved to this current country.\n\nI guess these were people that I mostly supported, listened to their problems and things like that, offered advice when I could.  But now that I am here having my own problems, it feels like many people are \"ghosting\" (I think that's the correct way to use that word?) on me.  I don't dump them all on people at once, but it feels like just implying that I might have my human feelings and concerns is too much.  Due to my upbringing, when I was *reprimanded* for reaching out emotionally, in addition to my natural introversion and shyness, this is so crushing and demotivating.  Every effort to reach out is calculated, heavily debated in my mind, but I'm always turned down, it seems.\n\nAlso from my upbringing, I've adapted a \"caretaker\" kind of mentality.  I love to try to help people out when I can.  I don't expect anything in return for it; I always try to empathize: \"what if I were in this situation? how would I want someone to help me?\" But I feel like I never get that consideration in return.  I've dipped into some toxic relationships because of that, and have been trying to cut them out.\n\nHowever, now I'm horribly lonely because I have no one left, it seems.  Everyone is walking out, and there is something undeniably *wrong* with relationships that are left.  I find myself missing the codependent relationships I had with people who took advantage of me because *at least someone was there*, at least *I could help someone*.  \n\nI've been through some stuff recently and I don't have anyone here.  I don't have anyone back home.  My job is stressing me out and life is isolating.  I feel like I have no one to turn to and I am reaching the end of my rope.  I just don't know what I should try doing next; this loneliness has been suffocating me lately and I'm running out of air.\n\nThanks for anyone who read that.  I would really appreciate and insight or advice.",
        "created_utc": 1457052450,
        "upvote_ratio": ""
    },
    {
        "title": "Just went NC with my NMom and did a little dance I was that happy",
        "author": "snikpohelocin",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/48uwz2/just_went_nc_with_my_nmom_and_did_a_little_dance/",
        "text": "Yup. Made the decision yesterday. Took action today. There was no official declaration to her as I didn't think after everything she's put me through I owed her that. \n\nAnd now I'm free. And dancing. And it feels damn good.",
        "created_utc": 1457051865,
        "upvote_ratio": ""
    },
    {
        "title": "Another hurdle in the year of NC firsts (cross post from rbn)",
        "author": "3RBN6349",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/48u8sq/another_hurdle_in_the_year_of_nc_firsts_cross/",
        "text": "It's my mom's birthday today and I'm not contacting her for the first time in my life. It's not as easy as I'd thought, and so I just wanted to put this somewhere.\n\nI can hear it... \"You could at least wish her a happy birthday.\" \"She is hurt and doesn't understand why you won't contact her.\" \"She got you a gift this year for your birthday.\" \"Wow, ignoring your own mother? That's harsh. A text or card wouldn't cost you anything.\"\n\n\nHang in there, me. Hang in there.\n\n(I hope it's ok to post this here and in RBN. I value the different tone of responses in both places.) ",
        "created_utc": 1457042382,
        "upvote_ratio": ""
    },
    {
        "title": "Exercise Can Boost Brain Chemicals Sapped by Depression",
        "author": "BluePetunia",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/48tww6/exercise_can_boost_brain_chemicals_sapped_by/",
        "text": "Here's an article on a recent research study on how vigorous exercise helps boost production of some neurotransmitters.  \n\nhttp://psychcentral.com/news/2016/02/28/people-who-exercise-have-better-mental-fitness/99703.html\n\nI think just about any exercise is helpful, but I have noticed in my workouts that the more effort is involved, the more I feel like I get a mood boost both immediately afterwards, and into the next day.  \n\nThe important caveat, though (which is not mentioned in the article) is that if you are already completely exhausted, this may just make things worse.  I've struggled with chronic exhaustion for years, and this can be a really delicate line to walk.  So the general advice I would offer is do as much exercise as you can tolerate, and no more!  Listen to your body, and recognize that rest is also critical to good health.  And especially if you are ACoN, you may need a lot of rest.  \n\n",
        "created_utc": 1457037743,
        "upvote_ratio": ""
    },
    {
        "title": "How do you get past being dragged through the mud because you stood up to your abuser?",
        "author": "throwawaynpd16",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/48tbu1/how_do_you_get_past_being_dragged_through_the_mud/",
        "text": "I've been lurking this thread for a while but felt I should post as I'm struggling a bit. \n\nMy husband and I stood up to his mother (my MIL) and his enabling father for their narcissistic behaviour and abuse towards us. This abuse has gone on within his family circle for his whole life, and started up with me when we had a son and became our own family unit of 3. She started losing her grip on him and that drove her crazy, so the subtle mind games, twisting of words and actions started. She tried to pit my husband and I against each other, she lied, she fabricated, she did whatever she could. Im sure you have all experienced narcissistic rage and smear campaigns so you'll know. We spoke to her rationally more times than I can count and we got nowhere, we tried to save the relationship but it was her boundaryless way or no way. We eventually we had to implement no contact as a last resort after seeing a counselor. \n\nGoing NC unfortunately affected the rest of the extended family who we often saw. They sided with her after she quickly got to work discrediting me. Not us, just me. I was the evil bitch who took her son away, who brainwashed him, she has never done a thing to him or me, shes innocent. I'm sure she used my own words and twisted them against me, and I know she made up whatever she could because the family has completely ostracized me and me only. It's been made clear they want my husband back but refuse to see or even acknowledge me unless it's to discredit me further. Nothing I've done in this life can warrant that behaviour towards me so I can only speculate that information has been fabricated.\n\nI know I have done nothing other than alert my husband to the abuse that was now affecting our young family.\n\nI've been to therapy, I know we're safer and better off NC with these toxic people, extended family included. But I cannot shake the knot in my tummy. I can't get past the lies being spread about me and the attacks against me for \"brainwashing\" my husband. 6 months of no contact and my husband is still being ambushed by their lies about me.\n\nHow do you cope with being the target of a vicious and vindictive smear campaign that never seems to end? How do you let that go and move forward?\n\nAny advice or shared experiences are so very welcome!",
        "created_utc": 1457030404,
        "upvote_ratio": ""
    },
    {
        "title": "DAE have trouble telling the difference between when a person likes you as a friend or is just tolerating you?",
        "author": "kudzujean",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/48tbh0/dae_have_trouble_telling_the_difference_between/",
        "text": "I can think of times when I thought somebody liked my company and then in retrospect, I found out or realized that they didn't, they had just tolerated me.\n",
        "created_utc": 1457030279,
        "upvote_ratio": ""
    },
    {
        "title": "The downsides of being NC",
        "author": "Retrobebe83",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/48sdah/the_downsides_of_being_nc/",
        "text": "Foremost, let me say- going NC almost two years ago WAS THE BEST DECISION OF MY LIFE. I don't regret it at all. The following stuff I'm gonna \"complain\" (lol) about is really minor and none of it is worth breaking Nc for. These are just some things I've noticed. \n\nSo nothing is perfect and there are downsides of going NC:\n\n- I have no one to call to come watch my kid for the day if I'm super sick. I used to be able to have my n/emother Come get him, bring me lunch and give me a break. I don't have anyone who can do that for me (that I wouldn't feel indebted to or feel like I'd have to pay). \n\n-I don't have a safety net financially. We're in a bad place financially (and slowly working our way out of it) and my n/emother would have helped us out in the past (with a massive guilt trip of course). Of course I realize now that there were strings attached, but I do miss having the safety that a family provides. So that makes it scarier. \n\n- I can't call my aunt or grandma sometimes if my parents are visiting. My grandpa is dying and I can't call to talk to him or my grandma bc my nfather is there with them. \n\n-I don't have a free babysitter whenever I need one. \n\n-I do miss that my n/emother would buy me whatever I wanted or needed. Groceries, clothes, things for the baby etc. \n\nThose are just a few things and really mostly minor and none worth going back to them and their abuse. I think it boils down to just missing what a family SHOULD offer (support, safety, unconditional love) and how hard it is to do everything on my own, just me and my husband. But it's worth it to not be abused!!! ",
        "created_utc": 1457018009,
        "upvote_ratio": ""
    },
    {
        "title": "Does this ever go away?",
        "author": "TheElectricMistress",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/48r078/does_this_ever_go_away/",
        "text": "I hate the constant \"Am I a good person/am I a narcissist?\" battle in my mind over everything I do and say.  Does it go away?  Do I ever get to just be a person without the anxiety? \n\n\n",
        "created_utc": 1456990102,
        "upvote_ratio": ""
    },
    {
        "title": "I don't laugh as much as I used to...",
        "author": "Swipe_Right_Here",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/48qb16/i_dont_laugh_as_much_as_i_used_to/",
        "text": "I've never posted here before but have lurked and been a member for quite some time (new account).\n\nI'm just having a difficult day and want to get something off my chest. Even if nothing comes back from it.\n\nI had a very difficult, but very liberating year last year. I quit school and decided to truly pursue my passions as an artist, and began to take my work much more seriously... but in order to do that, I had to remove myself from many of my friends and support system... but the truth is, they never really offered support... I openly battled with issues of depression and anxiety... none of my so called best friends were ever really there for me. Whether that was talking things through, or just genuinely trying to help in some way.\n\nI had this one friend in particular. Grade A narcissist. But I didn't really understand that until I distanced myself from him, especially him... he would come over, eat my food, smoke my weed (which he always said he would hit me back on, and did not - it's the only thing that really helps my anxiety and depression), talk only about himself, and so on. Think of a narcissistic person and that's him. The world revolved around him, and I was simply a pawn.\n\nI used to have a good time with him, and my friends in general. But I have distanced myself from all of them... life is better now... they were all greedy and just took from me. Whether that was stuff, time or energy, and never really gave me anything tangible back...\n\nBut I still think from time to time about how I just can't seem to laugh and enjoy myself anymore like I used to. Does anyone have this problem? \n\nI removed myself from the grips of the N. We used to laugh. But idk if it's me dealing with all this change or what, but I just can't seem to get back certain good aspects I had when I was living in denial of the crappy relationships I had...\n\nIt got to the point where I had anxiety just when he would call my phone. And boy would he really be all up in my grill. Trying to come over to my place every night, not respecting it when I told him I was trying to go to the gym or do art to work on myself.\n\nBut I used to laugh. Especially with him... I used to make jokes... I used to be a more light hearted person... I feel so serious about things now... I don't laugh as much as I used to. I don't make people laugh as much as I used to... I went through 6 long years of that friendship. It wasn't so bad at first, but eventually I just felt like a tool in his game.\n\nAnyone else have trouble laughing after life with a narcissist? \n\nSorry if this is incoherent. As I said, I'm having a rough day.",
        "created_utc": 1456978499,
        "upvote_ratio": ""
    },
    {
        "title": "I found a match on this site who has become very special to me. TGAKhj",
        "author": "relonnyaslug1988",
        "url": "http://1stchoicefinancialgroup.com/bxbW15asbyX9OaN",
        "text": "",
        "created_utc": 1456947564,
        "upvote_ratio": ""
    },
    {
        "title": "[Support] Life complete?",
        "author": "leslieknope3",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/48nl1w/support_life_complete/",
        "text": "I’m having a rough year or maybe two years. I quit my job, went through a bad breakup. I got a new job, was fired. \n\nI hesitate to call my ex a narcissist only because the relationship &amp; the ensuing breakup has left me in a permanent state of self-invalidation of myself and my own feelings.\n\nI moved back home, not really so much to heal as because there just isn’t anything left for me anymore. It feels like both me and the forces that be have finally destructed my life into the un-resuscitable vacuum I always knew it could be.\n\nI don't have any friends, and it’s anyone's guess as to why that is. \n\nI don’t have much of an idea of what to do now, or where to go from here. I’m not suicidal - I’ve struggled with depression &amp; suicide in the past and I know it when I see it, and I know that it’s not in me right now (which I guess is a plus, right?).\n\nI’m at home now though there isn’t anyone here I can talk to. My mother is notoriously bad at providing emotional support to me during the hardest times in my life, at times making things colossally worse, unfortunately. I don’t know how I would be able to handle that, at the moment.\n\nI think because I’ve struggled with depression for so long, I understand the value of a support system, and all that nonsense, which is why I’m here, instead of just alone in the world (the way I usually prefer it). But, there isn’t anything here either.\n\nI did very much love my job, and my work. It was kind of where I belonged, and I always did it just out of sheer enjoyment (I was a programmer). I was making six figures when I was working, which was important, since both my parents are unemployed and disabled.\n\nI can’t seem to make myself want to do it anymore - programming, my job, or anything really. All of the ideas I've ever had, all the things I've wanted to do, all my plans for the future, seem useless now. It feels like all the hope, all the promise of a better life someday, is finally snuffed out.",
        "created_utc": 1456944832,
        "upvote_ratio": ""
    },
    {
        "title": "I dragged myself out of my passport country a month ago",
        "author": "ShojiAn",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/48n1zz/i_dragged_myself_out_of_my_passport_country_a/",
        "text": "Since then I am homeless but I always have a bed to sleep. I have always considered myself as someone who is weak but everyday challenges made me realize how strong and capable I am. I learned that challenges can be solved easily even if they look scary. (Buying a smart card reader in a foreign country is scary a lot. At least for me it was at that moment.)\n\nThis is not about getting out of comfort zone. I don't have one because my senses are oversensitive almost always. This is about getting out of zone of influence where I feel safe from my mother.\n\nAfter continuously traveling for this long, vacations at my dad's place abroad don't count, made me to look at my life in a different perspective. I am not sure why but at the moment I feel most confident to say that things will be OK in the long term. I have a bumpy road ahead :)\n\nI also found out that I am afraid of other people. I'll work on that.\n\nTake care of yourselves.",
        "created_utc": 1456938496,
        "upvote_ratio": ""
    },
    {
        "title": "I still have feelings of guilt after years of NC",
        "author": "hazelniffler",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/48mjj2/i_still_have_feelings_of_guilt_after_years_of_nc/",
        "text": "I went NC with my parents 3 years ago, and it has been pretty great so far, but I still struggle with left over feelings of guilt from my childhood with Nparents.\n\nI was raised as an only child, and regardless of anything that happened in my household everything was always my fault. No matter how big or small the issues, it always was somehow a reflection of how I was as a child and person, and not just circumstantial or accidental or in any way my parent's fault. Even if I so much as spilled a glass of water, I was just a stupid worthless person who shouldn't be so clumsy. I was overall treated like my life and actions were a travesty, even as a little child.\n\nMy parent's overall treated me like I was the worlds hardest child to rear, and granted there were some times where I was a bad child, I by no means was the worst child. I always used to express how badly I wanted to have a healthier relationship with my parents to their faces or over the phone or in letters or to teachers and therapists who would tell them that, and my issues would be brushed off. \"Maybe we could have a better relationship if you weren't such an awful, bad person!\"\n\nIt never once mattered how much effort I put in to please them or to be complacent with what they wanted from me in life, they made up all the rules as they went which made it impossible for me to catch up. At the end of all this, I ended up moving out at 15 years old and went full-on NC when I was 21. After being told how worthless and \"bad\" I was as a person for my entire life, I was pretty tired of constantly being blamed for everything.\n\nMy life has been pretty good so far, LAN! I have worked really hard to get to where I am now in life and overall have an improved life quality, but at 24 years old I definitely still notice that I feel overwhelming guilt for no reason sometimes. It's like I have a reason to be guilty or feel ashamed just for existing, even after all of the efforts I have made to make a better life for myself.\n\nAm I the only one who feels like this? Am I wrong or stupid for feeling like this? What are some methods to work on overcoming the residual feelings of guilt from my childhood?",
        "created_utc": 1456931760,
        "upvote_ratio": ""
    },
    {
        "title": "Depression is more than a mental disorder: It affects the whole organism | Depression scientifically proven to be a reversible disease that can be cured",
        "author": "saddetective87",
        "url": "http://www.eurekalert.org/pub_releases/2016-03/uog-dim030116.php",
        "text": "",
        "created_utc": 1456891384,
        "upvote_ratio": ""
    },
    {
        "title": "Why Narcissism Is Our National Mental Disorder",
        "author": "hunterismia",
        "url": "https://soundcloud.com/crackedpod/why-narcissism-is-our-national-mental-disorder",
        "text": "",
        "created_utc": 1456884183,
        "upvote_ratio": ""
    },
    {
        "title": "My Beauty Is The Reason For Existence",
        "author": "WhiteHarem",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/48gx7g/my_beauty_is_the_reason_for_existence/",
        "text": "[removed]",
        "created_utc": 1456845694,
        "upvote_ratio": ""
    },
    {
        "title": "Parenting without fear",
        "author": "Beatrixa",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/48giye/parenting_without_fear/",
        "text": "I don't have kids of my own, but I'm coming into an increasingly parental role with my (non-N, non-E) mom as she is developing some dementia.  And it scares me.  Because all my parenting training came from a narcissist.  (Mom pretty much checked out and left me to be raised by Ndad.)  So every instinct I have, I search for whether it came from Ndad.  And if I find even the slightesr resemblance (like, I'm momentarily impatient with my mom) I get smacked by shame.  I'm doing pretty well with how I interact with myself these days, but interacting with others, particularly in something of a parenting mode, brings out the anxiety and shame.  I figure others on here must be dealing with these questions.  Any guidance -- thoughts, books, stories, resources -- on parenting without fear of recreating the dynamic that was modeled for me?  Thank you.",
        "created_utc": 1456840769,
        "upvote_ratio": ""
    },
    {
        "title": "Can't distinguish what's real, am I making this N thing up!? (long, sorry)",
        "author": "lunasoule",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/48f9zd/cant_distinguish_whats_real_am_i_making_this_n/",
        "text": "I \"discovered\" that my mother was N around a year ago in hopes of trying to figure out what was wrong with me after a particularly bad argument we had (Google Search: Why does my mother hate me? Results: *shows a couple articles on narcissistic mothers* Mind: blown). However, ever since then I have been going back and forth on whether or not I am correct since I am by no means a doctor and my mother has her alright days once in awhile. She has been diagnosed with depression and bipolar disorder and she does shows signs of narcissism when I choose to look for for it or remember, but often times I am confused since I'm not an expert.\n\nRecently, she kicked me out over financial matters (or that's how it seemed on the outside, yet she was already mad at me and starving me out for over a month because she has these jealousy fits over me and my sister being close and wanting to celebrate my birthday without her). We had agreed to rent being 80 dollars and then she got upset over something else (before birthday fit) and made the rent 200 which I didn't agree to because at the time I wasn't getting paid enough. When I told her that she couldn't kick me out just for not being able to pay because I would be homeless, she said it wasn't her problem and that it was all my fault. As is our relationship, but whatevs. So obviously I went NC right then and there.\n\nIt took me a week to reconnect with my uncle who has been living away from my mother and LC with very little to no visits for at least ten years now. Thankfully I was able to stay with him for a month, which was decided the same day I moved all my stuff into a storage. I was literally considering sleeping in an IHOP that night.\n\nWhen I lived with my uncle and his gf's family, it was very triggering because he is my mom's younger brother and shares similar experiences with me, so it was easy to be mad at her and to keep up being NC. My hurt was fresh. And it was nice feeling a part of a family that took the time to help me find a place to stay. I find a roommate and all is good in the world.\n\nThree months NC, two months with new roommate away from everyone else in my life, and I am already questioning myself. Maybe it is because I'm lonely? Or because it is the first time I'm actually on my own? Or maybe because there hasn't been anything to make me furious enough to fuel me? I don't know, but yesterday mom texted me, \"Hope you are well,\" which threw me more than I thought it would. The last conversation we had was when she kicked me out, ranting on how I was a terrible daughter and wasn't a decent human being at all because of my attitude. She kept saying I was childish and hurtful with no respect and was burning bridges. In fact, our last few conversations, she had obvious intent on hurting me emotionally. (However, isn't that what arguments are? Saying hurtful things to someone who has hurt you? Now that I think on it, she does this a lot when we fight and never apologizes for it).\n\nI'm only 22. I am confused, scatter brained, and scared now. I don't know what I'm doing. I haven't talked to my uncle since I moved out (I have problems keeping in touch with anybody except my sister, as I am afraid of disappointing people or hurting them, ironically, and vice versa). Although my sister knows my mother can be quite unreasonable, she still finds a way to work it out. She visits and they text and stuff. I don't know how. I guess what I'm looking for is a second set of eyes? I don't really have anyone in my corner nowadays, especially since I sort of hide from everyone but only because no one really understands my decision, which makes me question myself even more. NC is unheard of amongst most the people I know. I am committing family sin. So now I fear I am making things up because things were never \"THAT bad\" with mom. Everyone else seems to be able to handle her fine. Starting to lose confidence in my thoughts.\n\nIs mom narcissistic or am I reaching because of my own problems? Mother once told me she could \"see through me\" and could see that I was very mean and manipulative..so can I even manipulate myself!? I can't afford a therapist but I really wanna know if there is something seriously wrong with my brain? Its like when a child is scared of a monster in their room only to find out its just a silly shadow. Is my mother just a shadow? Or is she really the monster and this is a natural feeling? Has anyone else felt like this?\n\nHope I'm making sense. Again, totally all over the place on this. Sorry for rambling.",
        "created_utc": 1456820349,
        "upvote_ratio": ""
    },
    {
        "title": "Weird dynamic w my boss. Advice?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/48eki3/weird_dynamic_w_my_boss_advice/",
        "text": "[deleted]",
        "created_utc": 1456807388,
        "upvote_ratio": ""
    },
    {
        "title": "Say and do...",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/48ei9a/say_and_do/",
        "text": "[deleted]",
        "created_utc": 1456806402,
        "upvote_ratio": ""
    },
    {
        "title": "I wonder if other people find me boring.",
        "author": "kudzujean",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/48c2ys/i_wonder_if_other_people_find_me_boring/",
        "text": "I personally don't think that I'm boring, but I think that other people might perceive me that way.\n\nAnyone else feel that way?\n",
        "created_utc": 1456776097,
        "upvote_ratio": ""
    },
    {
        "title": "Lawyer difficulties",
        "author": "daphnes_puck",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/48amg0/lawyer_difficulties/",
        "text": "I contacted a lawyer in the middle of January about writing a cease &amp; desist to Ndad, barring any future contact. She responded to my inquiry immediately, was friendly, and understood the pattern of the situation. While she couldn't do the letter the next day, she figured she could get it out early the next week. \n\nIt's now the last day of February and I haven't heard word one from her. Not an email acknowledging the materials I sent, not a bill and a copy of a letter, not a message saying she got bogged down and will get it done in *x* days. I called three weeks after our agreement, and again last week, and she hasn't responded to these either. The first message was very simple, the second was detailed, both professional. \n\nNone of this feels good. I feel anxious about the letter having not been sent, I feel self-loathing about maybe her not believing me or dumping me when she found out the exact nature of the situation, I'm angry that she can't even say that she can't or won't do it, and I'm reluctant to turn to a phone book suggestion when this practice had come personally recommended. \n\nAm I not being patient enough? Have I been plenty patient? I'm working on agreeing with myself that if I haven't heard from her by the end of today, I'll tell her tomorrow not to bother and try to hunt down someone new. ",
        "created_utc": 1456758641,
        "upvote_ratio": ""
    },
    {
        "title": "I wish that someone had been strong enough to say this to my NP when I was getting my ass kicked by her.",
        "author": "saddetective87",
        "url": "https://www.youtube.com/watch?v=hqoVsldU0BE",
        "text": "",
        "created_utc": 1456752796,
        "upvote_ratio": ""
    },
    {
        "title": "I am good hearted person with strong mind and kind heart with pj58WML2yCo",
        "author": "ambaving",
        "url": "http://nationalenergyderegulation.com/3720160226.php#aYBhkVqX7p",
        "text": "",
        "created_utc": 1456707213,
        "upvote_ratio": ""
    },
    {
        "title": "Pussy needs hard touch! Join to me and call me a bitch, baby! rTsp6HFC8U",
        "author": "trescontluc",
        "url": "http://tiredarguments.com/14120160226.php#qf4WaSAN",
        "text": "",
        "created_utc": 1456699717,
        "upvote_ratio": ""
    },
    {
        "title": "I gonna do whatever you want! Join me, please NPuTXsaXS1",
        "author": "lareges",
        "url": "http://ticketpup.com/6520160226.php#5QDWf53SQl2",
        "text": "",
        "created_utc": 1456693989,
        "upvote_ratio": ""
    },
    {
        "title": "Call me a bitch and see what happened! Only here, only zxD5pq0D72",
        "author": "bradlearlo",
        "url": "http://mentalcrafts.com/12520160226.php#AkxXBx7S",
        "text": "",
        "created_utc": 1456691027,
        "upvote_ratio": ""
    },
    {
        "title": "RBN has taught me to spot FM bullshit from a mile away.",
        "author": "cooking_question",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/484zo2/rbn_has_taught_me_to_spot_fm_bullshit_from_a_mile/",
        "text": "I used to be a pushover.  \n\nI was always doing nice things for people, then getting shit on and wondering why I deserved such treatment. I have been focusing on myself for the past six months, learning to say no and getting very good at spotting the Narc behaviors.\n\nI had a \"friend\" of 20 years that was probably the most selfish person I ever met. Jane lives in a world of \"not enough\" where if someone else has something, then it is unavailable to her. Whether it is food, money, friends, men -- she feels like everything is a competition. I pretty much ignored it and chalked it up to some sort of abuse in her childhood, and through love and patience, I could help her see that there was, indeed, enough.\n\nJane was invited into my family and I defended her to anyone who found her abrasive and irritating, which was quite a few people.\n\nI cannot even begin listing all the shit I did for Jane, and you probably wouldn't believe it. I am talking a very one-sided relationship for two decades where I gave her all kinds of support, sympathy and help.\n\nAt one point, she needed to escape where she was living, but couldn't get out because it would require she find another job, sell her house, get a new place to live, etc. and she simply didn't have the funds to do all that. She was horribly depressed and would call me daily in tears. This went on for two years.\n\nI found her a job where I was living that paid her 50% more than she was making (she didn't even have to interview for it), helped her sell her house, moved her, and let her live with me -- rent and expense free, for one entire year. This is just one example of the kinds of things I did for her. This isn't even the biggest thing.\n\nOh God, the money I spent on that woman.  But I was happy to do so because I made triple what she did, and I felt like she needed to see that there was enough of everything in the world.\n\nShe ended up living with me for several years, but paid a prorated portion of the expenses. My world collapsed in one dramatic fell swoop. I lost my house, had to get two jobs just to make ends meet, had to find a place to live, move, my car was totaled by someone else and I was going through severe mood swings due to menopause.  I got into a protracted legal battle (I won) which cost me thousands that I didn't have. I was severely depressed, physically ill and pretty much suicidal.\n\nAt one point, I was almost homeless.\n\nAt the start of all this, Jane met some guy and just up and left.  She didn't even take all her shit, she just took the stuff she wanted and left me to deal with all her discards. She refused to answer my phone calls or contact people like the pest control company to switch accounts over to my name. \"I don't live there any more, this is not my concern.\" She refused to file paperwork with the mortgage company for my hardship application telling them she had moved and was no longer helping with the payments.  \n\nIn short, Jane just abandoned me because she found a better meal ticket.  She told my family and friends that it was time for her to be happy.  (Turns out the guy was immediately diagnosed with a serious, terminal illness, and she had to take care of his ancient mother who is a hoarder.  So karma.)\n\nThe worst part is that people just piled on and it seemed like they were lining up to kick me in the teeth.\n\nI got through it ALL, found a decent paying job and my life steadily (but slowly) improved.  Now my child is about to graduate and Jane wants to go to the graduation, but doesn't want to confront me.  So she contacted the child and did the FM routine.\n\n\"Jane wanted me to relay a message that she feels terrible about things ending between you two on a bad note,\" my child told me. \n\nI said, \"Let me guess, this was during a conversation about her coming to your graduation, right?\"\n\n\"Yeah, how did you know?\"\n\n\"Because she is using you to run interference.  She's faux apologizing *to you*, not me, and only because she wants you to fix it so she can attend your graduation.  She is not actually apologizing to me, she is sort of apologizing by proxy. Jane is only doing this because she wants something.  It's been five years of her bad-mouthing me.\"\n\nGod love my child.  \"You know what, that is exactly what happened. This celebration is as much for you as it is me.  Jane isn't part of our family any longer, so she doesn't need to be there.\"\n\nA year ago, I would have felt sorry for Jane and forgiven her just to watch her walk all over me again.  \n\nThanks RBN.\n\n",
        "created_utc": 1456688797,
        "upvote_ratio": ""
    },
    {
        "title": "Worst Move in day ever.",
        "author": "ZeTeslaCat",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/484n8r/worst_move_in_day_ever/",
        "text": "I've been having a really rough last couple of weeks. Essentially there's an issue with the airflow in my fuel injector, and I don't even know how much that's going to cost. Work has been work. And just stress.\n\nSo yesterday was move in day. I didn't have everything packed, which is always an amazing way to start. The person who agreed to help move furniture (had a truck), ended up being late because it was his grandfathers birthday. I felt horrible, because he didn't tell any of us about that. Well, my boyfriend has been having back issues so it was up to me and a friend I recruited to move my furniture. While moving the heavy as hell dresser down the stairs in the studio, I slipped and it scraped my knee open. Nothing serious, but it was annoying as hell. \n\nSo then we get furniture going. We hear the truck popping. guess whose ball bearings were screwed up? So we had to move the smaller furniture without him (I have a hatchback and my friend an SUV, so that's ok.\n\nSo we started (technically 3 days ago) at about 4 pm. It's now 8 pm. Finishing up, getting everything in. I hear the dreaded words...\n\n\"I can't find the cat.\"\n\nThere's no furniture left in the apartment to hide under. In addition, despite numerous times telling them, the men kept leaving the door open. She was insanely stressed and I anticipated this as a possibility. I call my mom bawling my eyes out, running around the complex, checking everywhere. \n\nAfter a few min, I get a call saying that she was found. When I ask where she was, he responded that my boyfriend just forgot to check on the balcony under the window unit. I was so livid. I lost control. I go to my car insanely silent, and slam my hatchback shut. \n\nWell....guess what? I didn't have the coffee table fully in. I hear glass shatter. I need a new rear windshield now. I had some packing tape to temporarily keep it together...but it's screwed.\n\nOne of my cards is close to maxed out, and the other doesn't have much left either. I have just enough money in my account to cover my deposits. I don't even have gas or food money.\n\nI did promise chinese for the help, so I figured just use a credit card. We eat and it's all good...until I go to pay. Guess whose a cash only place?\n\nI had to borrow almost 200 from my parents and do a cash advance for another 75. I tried to do another cash advance to avoid asking parents but it won't be available for 5-7 days, which doesn't help at all.\n\nMy boyfriend was upset at himself for my outburst, so I feel really guilty about that.\n\nWe go to move the cats and that went as well as you'd expect. I have gouges in my arm and that's just peachy.\n\nWell, at least I'm moved in I guess. I get paid in a couple of days but most of it's being eaten by bills.",
        "created_utc": 1456686122,
        "upvote_ratio": ""
    },
    {
        "title": "Lonely girls wait for you here. Free registration. 0HF2kU",
        "author": "coosumi",
        "url": "http://somuchwong.com/16920160226.php#6PUaMCrVbH",
        "text": "",
        "created_utc": 1456679434,
        "upvote_ratio": ""
    },
    {
        "title": "Here lonely girl looking for fun with the guys EFYwvt",
        "author": "eswagua",
        "url": "http://hedefkariyer.com/8220160226.php#X4z8gOWmwD",
        "text": "",
        "created_utc": 1456677109,
        "upvote_ratio": ""
    },
    {
        "title": "I'm quite proud of myself (happy)",
        "author": "Retrobebe83",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/483iu2/im_quite_proud_of_myself_happy/",
        "text": "One of my best friend's birthdays is in a few days. She loves Harry Potter and Snape so I just sent her an \"always\" necklace and Snape print from etsy. I'm having them directly mailed to her. I know she doesn't expect anything because I'm broke, so it'll be a nice surprise for her.\n\nPart of me wants to tease her with a text that doesn't quite reveal what I did and part of me wants to say nothing and just let her be super surprised! I'm not sure what to do!! I'm so bad with surprises lol",
        "created_utc": 1456676567,
        "upvote_ratio": ""
    },
    {
        "title": "Get free webcam show! Just for registered users. MzzOPmD",
        "author": "rembcapmick",
        "url": "http://unicomputadoras.com/53720160226.php#Zk9oVoIw",
        "text": "",
        "created_utc": 1456675243,
        "upvote_ratio": ""
    },
    {
        "title": "Third update - on telling work about my anxiety [support]",
        "author": "PrancerPrancer",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/483at9/third_update_on_telling_work_about_my_anxiety/",
        "text": "TLDR: The stress of dealing with my N Manager bullying me became too much this week. I ended up in hospital with chest pains and palpitations. Got diagnosed with inflammation of the lining of the heart (pericarditis). Now I'm signed off work long-term until it is better. At least I won't have to see her for a while. \n\n(If you want to see the back story: [post 1](https://www.reddit.com/r/LifeAfterNarcissism/comments/446x62/dr_advised_me_to_tell_colleagues_about_my_anxiety/), and [post 2](https://www.reddit.com/r/LifeAfterNarcissism/comments/47bj39/second_update_on_telling_work_about_my_anxiety/).) \n\nSo, since The Meeting, in which I was forced to confront my N line manager on her inappropriate behaviour, I had one week in the office without her while she was on annual leave. This week was bliss, I got plenty done, I got on well with my colleagues, I went for a few lunch dates with a couple of women in my team. I felt fairly calm and all was good. \n\nMy line manager returned to work, and the first day was okay. She made it clear she wasn't going to apologise to me, and instead she was pulling the super-friendly routine. The second day wasn't great - I had a project meeting with her and a colleague, and she very subtly undermined both myself and the colleague in this meeting. Extremely subtly, like you would only notice if you'd been raised by Ns. It was all extremely subtle N tactics: subtle gaslighting; rushing people in conversations and interrupting; playing at best friends and then questioning our judgement on a project decision with a concerned and condescending look; giving me an impossible task; answering my questions with more questions; creating uncertainty by not allowing either of us to finish a sentence or train of thought. The usual. \n\nHad there been no history at all with this woman, I'm sure I would have coped fine. But, given the history, I felt very panicked by this. I realised that clearly the nasty behaviour was going to continue, but in much more subtle ways. \n\nI went for a walk at lunchtime with a friend, and had to give up and go back to the office because I was having chest pains and feeling faint. I thought it was a panic attack, I tried to calm down and go back to my desk. The pains just got worse through the afternoon and I ended up going to hospital.  \n\nThey've told me that I have pericarditis, which is inflammation of the lining of the heart. It's not a serious condition, provided that I rest completely until the inflammation has gone. I can't go back to work for the time-being, and I mustn't do anything that raises my heart rate, as this makes the inflammation worse. They also picked up something \"borderline\" that they were a bit concerned about on my ECG, and they've referred me to Cardiology for more tests, to get that checked out. \n\nI'm normally a pretty healthy person, (physically at least!) and I am convinced that the pericarditis has happened because I've been so stressed and distressed by my line manager's nasty behaviour. I can't help feeling like she has won somehow. Like she's beaten me. \n\nOn the other hand, I have some hope that this illness will mean that when I get back to work, I'll be able to negotiate moving to a different client/s and a different manager. The current clients I'm with are widely acknowledged to be the 'most difficult' that our team works with, and also my manager is the only part-timer. All the other managers work full-time. Basically, out of all the people on my same paygrade, who do the same job as me, I have what is widely acknowledged to be the hardest job. (Aside of the fact that my boss is a bully, and I'm now pretty sure she is a full blown N too.)\n\nGiven that I have a history of anxiety, and now a heart problem, I'm thinking that it would be pretty impossible for management to refuse to shift our team around and move me to some easier clients, and a full-time manager - like everyone else on my same paygrade. I can't really see that they could say no to this request. If they said no, I imagine that would count as constructive dismissal, and/or disability discrimination.\n\nAnd of course, in the long-term, I still want to move to a new job. I think my current work environment is toxic, and I won't stay in a toxic workplace. \n\nI'm not even thinking about the cardiology referral just yet. One thing at a time. \n\nSupport and suggestions welcomed. Thanks if you read this far!  \n",
        "created_utc": 1456674764,
        "upvote_ratio": ""
    },
    {
        "title": "Not busy today? Its show time! Join to me, registred and only ypgOo7z6eRM",
        "author": "fenriecryp",
        "url": "http://frankbeckett.com/50920160226.php#soICFXOoB",
        "text": "",
        "created_utc": 1456669646,
        "upvote_ratio": ""
    },
    {
        "title": "Married and tired of it..Do you want to have fun too? plz ZAypTMv9bLB",
        "author": "ortuweb",
        "url": "http://water4food.com/7520160226.php#eLuOJMH",
        "text": "",
        "created_utc": 1456668598,
        "upvote_ratio": ""
    },
    {
        "title": "[Support] I just realized my current career path was just a glorified way of figuring out my own problems.",
        "author": "Throwaway3248374827",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/480rmm/support_i_just_realized_my_current_career_path/",
        "text": "I heard the joke today that psychologists are people who are messed up and are trying to figure themselves out. Since Psychology is my major, and counseling seemed of interest to me in the future, I took offense at that comment, denied it and walked off.\n\nHours later, after having gone to therapy myself that day, I thought about it, and thought about it. And then I realized that maybe it's a correct observation. After all, I had a screwy childhood with a Narcissistic father and a hysterical mother and had trouble figuring myself and others out. And here I am, taking it as a major.\n\nNow I am having trouble thinking that it was anything but a glorified way of figuring myself out. If I fail at doing that, what business do I have trying to help other people? My own therapist said whatever career I pursued I would focus on figuring myself out first. \n\nI was a fool to think this was my life's career. It's too late to change majors, having done so once before. I am now trapped in a major I should have no business being in.\n\nI feel like I have no idea what I want from life, or the means to pursue it. I don't know what I want from relationships, which hobbies I should pursue, and whether any of it is worth a lick of respect for pursuing. Any hobbies I tried I gave up on because I didn't see success.\n\nWhat a fool I was. \n\nAll I have done is wasted everyone's time, and money. \n\nI'm beginning to think my ills would best be cured with a rope at this point. I just don't see myself anywhere in the future. \n\nEdit: Thank you for the replies. To clarify, I do love the field, and find it fascinating, perhaps I was concerned that my decision was influenced by my broken past, and any therapy I could offer would be tainted, something I refuse to allow.",
        "created_utc": 1456644560,
        "upvote_ratio": ""
    },
    {
        "title": "Tips/tricks/advice on shaking this nagging guilt?",
        "author": "Poodoody",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/480cd7/tipstricksadvice_on_shaking_this_nagging_guilt/",
        "text": "Hey, everyone. I have an Nmom and have long since come to grips with her sickness and severed contact. Her weapons of choice were always anger and guilt (as so many are) and the long term effects of this is something I can't seem to shake. \n\nI'm possessed by a constant feeling of \"just got away with it\"-ness. The feeling that at any moment someone is going to come collect on a mistake or misdeed I've done. Seeing police officers in completely mundane scenarios (like at a diner or beside me at a stop light) makes me deeply uncomfortable. Most of my dreams are of escape, running, hiding and the inevitability of being found out. Every choice I make is hedged by thoughts of whether I am doing something \"wrong\". Instances of poor health are punishments for not taking care of myself, not sleeping enough, eating poorly, etc. If someone points out my necklace or shoes or whatever, I assume it's to accuse me of something (even if it's only ever been a compliment). \n\nIt's all very irritating. I feel like I'm being hounded by Nmom's shitty ghost, always waiting to find me out. But Nmom is gone. It's just me and myself and these kinds of thought patterns are undermining my own confidence. \n\nI want to shed the guilt. What are some tricks? What do you tell yourself when you find yourself in these negative mindsets? Surely there's little exercises or something I can work on to break these bad habits.",
        "created_utc": 1456636708,
        "upvote_ratio": ""
    },
    {
        "title": "Advice needed, life and mental health falling apart after moving out of Nmom's house 4 years ago",
        "author": "Quarterlife22",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/4801x0/advice_needed_life_and_mental_health_falling/",
        "text": "Here's a big one: I have been out of my Nmom's house and living independently for about 4.5 years now and I feel like my entire life is falling apart. In high school I always managed to appear to have my shit together in high school and was active, generally happy, had lots and lots of supportive friends, I had straight A's, played on three sports teams, and had fun and enjoyed life as long as I wasn't at home.\nNow, I've been in college for 4 years, with another 1.5 years left to graduate. I feel like I have hit rock bottom. I am depressed, anxiety ridden, I have nightmares and insomnia, I have lost most of my good friends due to falling out/them moving away. I feel like an absolute wreck and the only consistently caring person in my life is my boyfriend, who happens to be moving away in one month after he graduates.\nI used to love running but when I got into college I started gaining weight and now I weigh 216 lbs, when I used to weigh 128 in high school (i am 5'2 so this is obese) I see a counselor and she is decently helpful but it still doesn't fill the void I have that comes with not having a caring or supportive family or close friends.\nI try to get involved on campus but every time I meet someone new I feel like they get scared away because of all of my stupid mental health issues.\nWhat can I do at this point? I have literally never been so helpless or hopeless in my entire life. I have \"sought help\" and it doesn't ever seem to do any good. I am open to any kinds of suggestions, what has worked for other people? how did you overcome trauma or start to feel happy and sane again? how do you be a normal adult and keep a job and keep your grades up when your mental health is deteriorating? I have panic attacks and cry constantly. I literally feel insane.\nTL;DR: I have become a depressed, fat, anxious and suicidal after moving out of my Nmom's house and now my life is falling apart. How can I get happy again?",
        "created_utc": 1456631918,
        "upvote_ratio": ""
    },
    {
        "title": "Advice needed: I moved out of Nmom's house 4.5 years ago and suddenly everything has caught up with me",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/4800mm/advice_needed_i_moved_out_of_nmoms_house_45_years/",
        "text": "[deleted]",
        "created_utc": 1456631283,
        "upvote_ratio": ""
    },
    {
        "title": "PTSD resurfacing/general mental health woes",
        "author": "palebluestars",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/47zumq/ptsd_resurfacinggeneral_mental_health_woes/",
        "text": "I'm 17 and I've been NC for a year and a half. \n\nWhen the abuse was at its worst, I was 12 and I flat out wanted to die. I had severe social anxiety, was cutting myself and very suicidal. I used to blame myself for this, but I can now forgive myself when I view the context of the situation. I was abused, not crazy. \n\nEvery year since then, I have distanced myself from my mother more and my life has improved more. That is, with the exception of this year. Maybe I'm just depressed or maybe PTSD can strike any time but I'd really like to hear if anyone's gone through anything similar. \n\nThis year has sucked. I've been in a partial hospitalization program for depression/anxiety/ptsd. Just when I thought I was getting better, I lapsed and now I'm headed back there. My problem is mostly anxiety surrounding school. I cry in class and I can't do any homework and instead the suicidal ideation has returned for the ifrst time in years. I stopped cutting years ago and my social anxiety is near gone now. \n\nAny thoughts on this sudden downturn would really be appreciated.\n ",
        "created_utc": 1456628597,
        "upvote_ratio": ""
    }
]