[
    {
        "title": "Funeral",
        "author": "SirGrinchPSN",
        "url": "https://www.reddit.com/r/LifeProTips/comments/11bd9ab/funeral/",
        "text": "[removed]",
        "created_utc": 1677303623,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT Request - New Home, looking for recommendations",
        "author": "heretolearnlady",
        "url": "https://www.reddit.com/r/LifeProTips/comments/11bd4h3/lpt_request_new_home_looking_for_recommendations/",
        "text": "What things should I get or prepare for a new home. First time home buyer!",
        "created_utc": 1677303173,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT: Keep a pair of scissors or knife with you when moving, this way you can actually unpack.",
        "author": "tootieClark",
        "url": "https://www.reddit.com/r/LifeProTips/comments/11bd45g/lpt_keep_a_pair_of_scissors_or_knife_with_you/",
        "text": "",
        "created_utc": 1677303143,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT Request: How to lose emotions from your face permanently?",
        "author": "todiecena",
        "url": "https://www.reddit.com/r/LifeProTips/comments/11bd3cr/lpt_request_how_to_lose_emotions_from_your_face/",
        "text": "I'm sick of being a sensitive person. I cry easily, never faked emotions, tried to spend happiness as much as I can. I find it really hard to hide emotions. I'm sick of being made fun of because of being sensitive. Please help me out here if anyone has few ideas.",
        "created_utc": 1677303069,
        "upvote_ratio": 1.0
    },
    {
        "title": "Before you make any decision, ask your self this: what are the consequences of this decision?",
        "author": "poyuki",
        "url": "https://www.reddit.com/r/LifeProTips/comments/11bcdn0/before_you_make_any_decision_ask_your_self_this/",
        "text": "[removed]",
        "created_utc": 1677300747,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT: You can use 3 chopsticks to shovel in more food",
        "author": "metalliska",
        "url": "https://www.reddit.com/r/LifeProTips/comments/11bcbxl/lpt_you_can_use_3_chopsticks_to_shovel_in_more/",
        "text": "",
        "created_utc": 1677300596,
        "upvote_ratio": 1.0
    },
    {
        "title": "LifeProTip : You can use 3 chopsticks to shovel in more food",
        "author": "metalliska",
        "url": "https://www.reddit.com/r/LifeProTips/comments/11bcbi3/lifeprotip_you_can_use_3_chopsticks_to_shovel_in/",
        "text": "",
        "created_utc": 1677300555,
        "upvote_ratio": 1.0
    },
    {
        "title": "Card skimmers are rampant at gas stations. Use Alexa+Amazon account to pay for gas.",
        "author": "dj1200techniques",
        "url": "https://www.reddit.com/r/LifeProTips/comments/11bc178/card_skimmers_are_rampant_at_gas_stations_use/",
        "text": "[removed]",
        "created_utc": 1677299620,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT - Tell those that give you a gift card what you purchased.",
        "author": "resjudicata1",
        "url": "https://www.reddit.com/r/LifeProTips/comments/11bbw9f/lpt_tell_those_that_give_you_a_gift_card_what_you/",
        "text": "People like to hear follow-ups about their gifts.  When you get a gift card to someone, they don't know what you might buy with it and it's essentially cash that disappears into oblivion.  Instead, associate that gift with something (that hopefully is useful, nice, whatever).  It is meaningful to the giver and also gives you another opportunity to thank them.\n\nThis LPT also applies to other gifts, but rather than saying what you purchased, tell the giver when or how you used their gift.\n\nE.g. \"I used the gift card to Old Navy and bought these lovely gloves that I've been wearing all winter!\" or \"I've been wearing the ugly sweater you got me and it saved me from getting hit by a car when someone yelled, 'hey, you're sweater is ugly!'\" /s/",
        "created_utc": 1677299206,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT: If a small business gives you discounts or free item/service to resolve a genuine issue you had with them, don't mention it in public reviews/forums, people will try to take advantage, they'll use your review as precedent and an excuse to be a shitty customer",
        "author": "InevitableNothing460",
        "url": "https://www.reddit.com/r/LifeProTips/comments/11bbh5t/lpt_if_a_small_business_gives_you_discounts_or/",
        "text": "",
        "created_utc": 1677297864,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT: When you’re training a new employee at your position, don’t be afraid to show them the \"real game\". Don’t look at them as a competition; take it as motivation to stay on top of your game.",
        "author": "WallStreetDoesntBet",
        "url": "https://www.reddit.com/r/LifeProTips/comments/11bb0z7/lpt_when_youre_training_a_new_employee_at_your/",
        "text": "Will this rookie potentially replace you in the future? Perhaps. But that shouldn’t be your focus. As long as you are handling your business, you don’t have to worry about the next one… Be the best one!",
        "created_utc": 1677296503,
        "upvote_ratio": 1.0
    },
    {
        "title": "Request: How to give someone a gift they are to proud to take",
        "author": "BiteMyHooker",
        "url": "https://www.reddit.com/r/LifeProTips/comments/11ban0o/request_how_to_give_someone_a_gift_they_are_to/",
        "text": "[removed]",
        "created_utc": 1677295307,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT: Nice people don’t finish last, they just feel like they do because they’re running the wrong race.",
        "author": "Dark_Selah",
        "url": "https://www.reddit.com/r/LifeProTips/comments/11bagc9/lpt_nice_people_dont_finish_last_they_just_feel/",
        "text": "This is more for dating. If you feel that being an authentically nice person means that you’re ignored, then you’re filtering people according to your values, not losing out on amazing opportunities.",
        "created_utc": 1677294763,
        "upvote_ratio": 1.0
    },
    {
        "title": "What do you do to not repeat mistakes?",
        "author": "nobody202342",
        "url": "https://www.reddit.com/r/LifeProTips/comments/11ba7d7/what_do_you_do_to_not_repeat_mistakes/",
        "text": "[removed]",
        "created_utc": 1677294037,
        "upvote_ratio": 1.0
    },
    {
        "title": "Honesty is the key to success",
        "author": "Taylorray3",
        "url": "https://www.reddit.com/r/LifeProTips/comments/11ba2w1/honesty_is_the_key_to_success/",
        "text": "[removed]",
        "created_utc": 1677293675,
        "upvote_ratio": 1.0
    },
    {
        "title": "life suggestion",
        "author": "OkPriority5027",
        "url": "https://www.reddit.com/r/LifeProTips/comments/11b9mmu/life_suggestion/",
        "text": "[removed]",
        "created_utc": 1677292358,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT request",
        "author": "keywsync",
        "url": "https://www.reddit.com/r/LifeProTips/comments/11b8xz4/lpt_request/",
        "text": "[removed]",
        "created_utc": 1677290425,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT Request: how do I let people down easy?",
        "author": "Bray_Jet",
        "url": "https://www.reddit.com/r/LifeProTips/comments/11b8vvw/lpt_request_how_do_i_let_people_down_easy/",
        "text": "I’m 27 and still struggle a lot with this. Someone will ask me out and I don’t feel a connection, or ask to see me again after a first date that didn’t work for me. \n\nI don’t want to hurt anyone, you know? How do I make it as painless as humanly possible?",
        "created_utc": 1677290265,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT Request: A long list of true stories that are motivating",
        "author": "inland-taipan",
        "url": "https://www.reddit.com/r/LifeProTips/comments/11b8d6u/lpt_request_a_long_list_of_true_stories_that_are/",
        "text": "I came across this a few days ago:\n\nColonel Sanders (KFC) had his fried chicken recipe rejected by more than 1,000 restaurant before it was accepted.\n\nI couldn't verify if this is true, but if it is, I find it quite motivating.\n\nMade me want to have a list of stories like that in order to feel inspired when I feel depressed.\n\nBut I want stories that are true, short (like a couple of paragraphs at most), and motivating. More importantly, I am looking for stories about people that are not terrible people or did not succeed by cheating and taking advantage of others. They don't have to be great people (who is?) but not awful either.\n\nThey could be famous (e.g., Edison, Michael Jordan), or just regular folks who did not give up in life despite illness, poverty, mental health issues, difficult childhood, and so on.\n\nCould you help me with this?",
        "created_utc": 1677288824,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT: Just a friendly reminder to clean your phone today. It's most likely been a long time, and everytime you wash your hands you most likely touch your germy phone in the next few minutes.",
        "author": "shipskelly",
        "url": "https://www.reddit.com/r/LifeProTips/comments/11b7edw/lpt_just_a_friendly_reminder_to_clean_your_phone/",
        "text": "",
        "created_utc": 1677286212,
        "upvote_ratio": 1.0
    },
    {
        "title": "Affordable custom logo designs starting at 15",
        "author": "WestPalpitation0",
        "url": "https://www.reddit.com/r/LifeProTips/comments/11b6xdv/affordable_custom_logo_designs_starting_at_15/",
        "text": "[removed]",
        "created_utc": 1677284985,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT: If you are experiencing any accident, threat, fire, injury etc.",
        "author": "Ikswoslaw_Walsowski",
        "url": "https://www.reddit.com/r/LifeProTips/comments/11b6rz6/lpt_if_you_are_experiencing_any_accident_threat/",
        "text": "1. Don't panic",
        "created_utc": 1677284584,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT Request-How to get rid of cigarette smell?",
        "author": "Accomplished_Low_265",
        "url": "https://www.reddit.com/r/LifeProTips/comments/11b6rhj/lpt_requesthow_to_get_rid_of_cigarette_smell/",
        "text": "I live in apartment and  someone who lives downstairs keeps smoking in their bathroom. And the smell spreads  through the ventilator to my bathroom. My husband smoke thiugh but he never did it indoor and I don't smoke at all. I can't tell them they don't smoke their bathroom and don't turn their ventilator on.  I've tried turning my ventilator on all day long, but it doesn't work.",
        "created_utc": 1677284548,
        "upvote_ratio": 1.0
    },
    {
        "title": "If you are experiencing any accident, fire, danger, threat etc.",
        "author": "Ikswoslaw_Walsowski",
        "url": "https://www.reddit.com/r/LifeProTips/comments/11b6qpj/if_you_are_experiencing_any_accident_fire_danger/",
        "text": "[removed]",
        "created_utc": 1677284490,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT if having to euthanize your pet, and wanting an impression of their paw, buy the kit and do it yourself",
        "author": "pnyluv16",
        "url": "https://www.reddit.com/r/LifeProTips/comments/11b6g14/lpt_if_having_to_euthanize_your_pet_and_wanting/",
        "text": "A few weeks ago, I had to put my almost 20 year old dog to sleep. I wanted him cremated, so I got a package deal through my vet, which was to include a box, the ashes, a small urn necklace, a clay or plaster paw print impression, and a name plate for the box. \n\nThe paw impression is huge, and definitely not his paw print (he was a small dog)\n\nThey also misspelt his name on the name plate. I ended up just buying a new name plate, but it’s too late now for a redo of the paw print. \n\nDon’t buy the package folks. Do the impression yourself, buy your own name plate and box. Just ask for only the ashes back. \n\nNow something that was supposed to be a nice thing to remember him by, that I spent a lot of money on (which I thought “he is worth it”) only makes me feel bad when I see how it turned out. \n\nR.I.P Tazz\n2003-2023",
        "created_utc": 1677283726,
        "upvote_ratio": 1.0
    },
    {
        "title": "If you're the type of person to keep your phone on your pocket, Make sure the shopping carts in your apps are empty.",
        "author": "Longjohn14",
        "url": "https://www.reddit.com/r/LifeProTips/comments/11b6ekp/if_youre_the_type_of_person_to_keep_your_phone_on/",
        "text": "",
        "created_utc": 1677283625,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT: Open glass jars with metal lids by taking a butter knife and smacking the ridge of the lid a few times with the side of the knife. I hit the 3, 6, 9, and 12 positions first then add a few more hits when needed.",
        "author": "LlamaMiaLetMeGo",
        "url": "https://www.reddit.com/r/LifeProTips/comments/11b5h76/lpt_open_glass_jars_with_metal_lids_by_taking_a/",
        "text": "",
        "created_utc": 1677281262,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT Request: How to prepare for the best tax refund next year",
        "author": "PeachyQuiinn",
        "url": "https://www.reddit.com/r/LifeProTips/comments/11b5djv/lpt_request_how_to_prepare_for_the_best_tax/",
        "text": "I heard somewhere that you should save every single receipt of every expense you ever have (i.e. restaurants, groceries, clothes, etc). Last year I saved only medical, cell phone, house improvement receipts, and auto. But my tax preparer didn’t really ask to see any of the receipts, just to tell them an estimate of how much it was. \n\nSo, what receipts should I keep or what kind of expenses/income should I write down for next year. I was thinking about starting a spreadsheet summarizing every single expense I have every month so I can just give that to them and they can report accordingly. \n\nAnd how detailed should I write down each expense? Last year I had my basement completely renovated and only had receipts from hardware stores and labor but they asked how much were the doors, how much was the flooring, insulation, walls, counters, appliances, etc. all individually. I was like idk I just know all these receipts were from basement expenses! \n\nTLDR; what receipts and/or documents should I have ready to get the best refund next year’s tax season?",
        "created_utc": 1677281006,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT: Women struggling to find good sex, you can build your boyfriend",
        "author": "seriousgentleman",
        "url": "https://www.reddit.com/r/LifeProTips/comments/11b3v25/lpt_women_struggling_to_find_good_sex_you_can/",
        "text": "Steps for women seeking men:\n\n1. Find a not-too-attractive geek/nerd (especially one that has poor hygiene, is socially awkward, and gets anxious as you approach him), then ask if he wants sex. A good starting place is a library at a nearby college. Yes, seriously, ask the stranger with no context, “Hey, want to fuck?” or “Hey, want to have sex?” If he says “yes”, stammers without knowing how to respond, is silent, or (best of all) has a panic attack, then get his number to start texting. (He might say “no”, so this is a good prescreen.) It doesn’t matter if he’s neck-deep in a book or a game, his mind frequently wanders to sex anyway and your question will be very welcome.\n2. Text casually with him and, when he asks about the sex, say there’s a few things he has to do beforehand. He may have a lot of problems texting, e.x. excessively long texts or demanding a response by a certain time. Know you may be the first woman he’s ever texted. Point out his mistakes, explain proper texting etiquette, and set the bar high for how you expect to be treated. Clarify you want a man, not a child: you expect him to be independent, self-sufficient, and self-motivated. If he doesn’t work his ass off to improve himself, just dump him and back to step #1.\n3. Tell him he needs to become handsome before he gets sex. Meet with him and show him your skincare routine, how to apply makeup, and every other part of your beauty routine. Have pencil and paper to give him in case he forgets to bring his. I’d also recommend asking him to teach himself massaging some weeks beforehand and get a massage during this visit. If it’s a good massage, that shows his ability and dedication to learning new skills. Otherwise, if not a good massage, then dump him and back to step #1.\n4. Next, tell him he needs to get muscular and athletic before he gets sex. If you go on runs, have him go on runs with you; he’ll sooner drop dead from exhaustion than fail to keep up with you on the run. \n5. Next, tell him he needs to learn romance and how to pleasure a woman with slow incremental foreplay prior to slow easy sex. Recommend “women’s anatomy of arousal” to him and expect him to plan out and prepare every detail of the experience.\n6. Next, tell him he needs to go on a series of dates and you’ll be the judge of when he’s ready. Have these regular (e.x. every 2 or 3 weeks) dates so he can practice and refine what he learned in his studies; he’ll be extremely rough and they won’t go well at first, but he’ll quickly improve. When you feel he’s ready, do not take him to the bedroom. Instead, tell him to prepare for sex on the next date or the one after.\n7. Profit: sit back, relax, and enjoy the best sex you ever had. And, you now have a wholesale supply of mind-blowing sex whenever you want.\n\n\n(I speak this all from experience as a that gross nerd who got an amazing girlfriend who transformed into a romantic jock. I couldn’t be happier.)",
        "created_utc": 1677277164,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT: To skip watching/seeing ads on your smart TV YouTube, click back right after clicking the video. Repeat about 3x and instead of waiting you can see your video almost instantly.",
        "author": "Fluid-Decision-1103",
        "url": "https://www.reddit.com/r/LifeProTips/comments/11b3gpr/lpt_to_skip_watchingseeing_ads_on_your_smart_tv/",
        "text": "",
        "created_utc": 1677276156,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT: To skip watching/seeing ads on your smart TV YouTube, click back right after clicking the video. Repeat about 3x and instead of waiting you can see your video almost instantly.",
        "author": "Fluid-Decision-1103",
        "url": "https://www.reddit.com/r/LifeProTips/comments/11b3ezo/lpt_to_skip_watchingseeing_ads_on_your_smart_tv/",
        "text": "",
        "created_utc": 1677276047,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT: to skip watching/seeing ads on your smart TV YouTube, click back right after clicking the video. Repeat about 3x and instead of waiting you can see your video almost instantly.",
        "author": "igothergood",
        "url": "https://www.reddit.com/r/LifeProTips/comments/11b3c5h/lpt_to_skip_watchingseeing_ads_on_your_smart_tv/",
        "text": "",
        "created_utc": 1677275857,
        "upvote_ratio": 1.0
    },
    {
        "title": "Advice on Salary negotiation and fair pay?",
        "author": "Ok-Equipment-5345",
        "url": "https://www.reddit.com/r/LifeProTips/comments/11b2f79/advice_on_salary_negotiation_and_fair_pay/",
        "text": "[removed]",
        "created_utc": 1677273583,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT- Make disposable razors last by drying them after using them",
        "author": "dan_arth",
        "url": "https://www.reddit.com/r/LifeProTips/comments/11b0z9c/lpt_make_disposable_razors_last_by_drying_them/",
        "text": "",
        "created_utc": 1677270015,
        "upvote_ratio": 1.0
    },
    {
        "title": "Don't trust drivers beside you -create an escape window while you are driving",
        "author": "trywungolf",
        "url": "https://www.reddit.com/r/LifeProTips/comments/11b0ts7/dont_trust_drivers_beside_you_create_an_escape/",
        "text": "[removed]",
        "created_utc": 1677269634,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT: Stop Taking Your Phone Into The Bathroom",
        "author": "hunterries",
        "url": "https://www.reddit.com/r/LifeProTips/comments/11b0tc6/lpt_stop_taking_your_phone_into_the_bathroom/",
        "text": "[removed]",
        "created_utc": 1677269601,
        "upvote_ratio": 1.0
    },
    {
        "title": "Arbitrum $ARB Airdrop New rewards. Rewards 24.02.23",
        "author": "Prior-One5349",
        "url": "https://www.reddit.com/r/LifeProTips/comments/11b0ns6/arbitrum_arb_airdrop_new_rewards_rewards_240223/",
        "text": "[removed]",
        "created_utc": 1677269211,
        "upvote_ratio": 1.0
    },
    {
        "title": "Lpt: please help me to fight ticket please",
        "author": "InternalRush5783",
        "url": "https://www.reddit.com/r/LifeProTips/comments/11b0gz8/lpt_please_help_me_to_fight_ticket_please/",
        "text": "[removed]",
        "created_utc": 1677268753,
        "upvote_ratio": 1.0
    },
    {
        "title": "High beam ticket Help?",
        "author": "InternalRush5783",
        "url": "https://www.reddit.com/r/LifeProTips/comments/11b0e93/high_beam_ticket_help/",
        "text": "[removed]",
        "created_utc": 1677268552,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT: The Instacart app is a quick and easy way to find out what grocery stores have specific/specialty items in stock.",
        "author": "SmokeWeedEveryGay",
        "url": "https://www.reddit.com/r/LifeProTips/comments/11b0a4c/lpt_the_instacart_app_is_a_quick_and_easy_way_to/",
        "text": "Don't know where to buy plain whole fat milk greek yogurt? Just search it up on instacart and it'll tell you all the nearby stores that carry it and a rough price!\n\nYou can also use doordash for the same thing dor restaurants.",
        "created_utc": 1677268260,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT: In Times New Roman, 12 pt font, MLA formatting, 6 0’s in a row (000000) is equal to one tab. Type 6 0’s, change text to white, and it looks like it’s tabbed. Saved my butt during last-minute formatting for a paper.",
        "author": "bestaquaneer",
        "url": "https://www.reddit.com/r/LifeProTips/comments/11b04w8/lpt_in_times_new_roman_12_pt_font_mla_formatting/",
        "text": "[removed]",
        "created_utc": 1677267899,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT: The tip \"just be yourself\" isn't supposed to win over all your dream girls or guys, it's meant to find you the person that loves you for you, and not the fake personality you think you have to be to win them over.",
        "author": "YellowB",
        "url": "https://www.reddit.com/r/LifeProTips/comments/11b01h1/lpt_the_tip_just_be_yourself_isnt_supposed_to_win/",
        "text": "",
        "created_utc": 1677267655,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT: You don't need to wait for water to boil before adding dried pasta. Add it while the water is cold and keep the pan on (the pasta will begin to rehydrate in the cold water). Overall it will take half the time to cook.",
        "author": "Aphelion7711",
        "url": "https://www.reddit.com/r/LifeProTips/comments/11azy37/lpt_you_dont_need_to_wait_for_water_to_boil/",
        "text": "Source: chefy friend has been giving me quality of life tips for the kitchen.",
        "created_utc": 1677267409,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT: Some home and contents insurance policies cover you for food spoilage due to an unexpected power outage. In my case the policy paid $500, without charging an excess.",
        "author": "_unknown_username",
        "url": "https://www.reddit.com/r/LifeProTips/comments/11azsg2/lpt_some_home_and_contents_insurance_policies/",
        "text": "While I was away there was a power outage at my place which resulted in my chest freezer not turning back on. Everything that was in it had to be thrown out, a quick call to my insurer to *just ask the question* resulted in me getting a $500 payment.",
        "created_utc": 1677267023,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT: don't use laser pointers with dogs",
        "author": "dnm8686",
        "url": "https://www.reddit.com/r/LifeProTips/comments/11azrl8/lpt_dont_use_laser_pointers_with_dogs/",
        "text": "I keep seeing videos of people using laser pointers with dogs and it's just breaking my heart. \n\n14 years ago my ex and I got this AMAZING dog from a shelter. Jake was likely a border collie mix and was incredibly smart. He knew so many tricks with verbal and hand commands. At one point we split up and I got my own place but we shared custody of Jake. I didn't have any furniture yet so the place was pretty empty and as I was checking out of the grocery store I saw a laser pointer and thought it would be fun for him. I was laughing so hard. He was running and playing like crazy. Then I noticed the red splotches on the brand new carpet. He was chasing the laser so hard and fast that when he put on the brakes he was ripping his pads open and bleeding. I felt so awful, but that's not even the worst part.  \n\nFrom then on he was a different dog. There was a door wall to the balcony that had vertical blinds with a vent underneath them. When the heat was on it would move the blinds a little and make the sunlight dance around on the floor.  He became obsessed with it, always pouncing on the moving lights. At night, he would jump on our shadows cast from the lights. Intangible lights became his top priority. He just had to try to 'catch' them. \n\nPlease please PLEASE don't use laser pointers with dogs. It quite literally drives them crazy.",
        "created_utc": 1677266965,
        "upvote_ratio": 1.0
    },
    {
        "title": "Don't use laser pointers with dogs",
        "author": "dnm8686",
        "url": "https://www.reddit.com/r/LifeProTips/comments/11azqi5/dont_use_laser_pointers_with_dogs/",
        "text": "[removed]",
        "created_utc": 1677266886,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT: If you’re searching for something on social media, try to stay focused on the object of your search; companies deliberately put trending/algorithmic content right below the search bar to distract you and keep you on the app longer.",
        "author": "opteryx5",
        "url": "https://www.reddit.com/r/LifeProTips/comments/11azk73/lpt_if_youre_searching_for_something_on_social/",
        "text": "[removed]",
        "created_utc": 1677266430,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT: When taking painkillers for a headache, drink a full glass (8-10 oz) of water with the medicine. Dehydration is often a source of headaches, and more water is always good.",
        "author": "S2kDriver",
        "url": "https://www.reddit.com/r/LifeProTips/comments/11azioo/lpt_when_taking_painkillers_for_a_headache_drink/",
        "text": "",
        "created_utc": 1677266331,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT: Chocolate chips are candy.",
        "author": "CrazieCayutLayDee",
        "url": "https://www.reddit.com/r/LifeProTips/comments/11ayqv5/lpt_chocolate_chips_are_candy/",
        "text": "Distressed over the price of your favorite chocolate candy? Head to the baking aisle. Chocolate chips come in all sorts of flavors and some are made by higher quality mass market chocolatiers like Ghirardelli. Sometimes, especially around the holidays, the baking aisle will also have mini peanut butter cups or Twix chips as well. Comparing a 10.5 oz bag of M&amp;Ms and an 11 oz bag of milk chocolate chips, the store brand pure milk chocolate chips are about half the price of the M&amp;Ms per ounce and taste great. Just think of them as mini Hershey's kisses.",
        "created_utc": 1677264410,
        "upvote_ratio": 1.0
    },
    {
        "title": "Treat your supervisors and managers with respect and show them a good work ethic",
        "author": "feel_me_bass",
        "url": "https://www.reddit.com/r/LifeProTips/comments/11ayoro/treat_your_supervisors_and_managers_with_respect/",
        "text": "[removed]",
        "created_utc": 1677264271,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT if you pass gas and quickly say, \"What's that smell?\" Whoever you're with will sniff your fart.",
        "author": "ChrisCWgulfcoast",
        "url": "https://www.reddit.com/r/LifeProTips/comments/11ayo5y/lpt_if_you_pass_gas_and_quickly_say_whats_that/",
        "text": "",
        "created_utc": 1677264228,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT: Maintain separate bank accounts when you get married",
        "author": "The_Stein244",
        "url": "https://www.reddit.com/r/LifeProTips/comments/11aym8a/lpt_maintain_separate_bank_accounts_when_you_get/",
        "text": "Instead create a joint account and both contribute say 80% to 90% of your income into the shared account. This will pay for rent/mortgage, food, utilities, house projects, cars, etc.\n\nBut keeping that 10% to 20% of your personal account allows the freedom to do whatever you want with YOUR money without having to explain your purchases. Both people are free to do as they please. It also helps make gifts feel more special instead of feeling like you bought it for yourself.",
        "created_utc": 1677264089,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT: Say weird things on the phone with automated systems to get to a person faster",
        "author": "Capital_Section6774",
        "url": "https://www.reddit.com/r/LifeProTips/comments/11aylbv/lpt_say_weird_things_on_the_phone_with_automated/",
        "text": "Saying things the system doesn’t understand like “I am a cat” or “banana” over and over gets you to an agent quicker.\n\nIt even works for the support chat bots!",
        "created_utc": 1677264029,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT: Do NOT use ChatGPT or any other natural language AI to learn scientific concepts",
        "author": "TheEarthIsACylinder",
        "url": "https://www.reddit.com/r/LifeProTips/comments/11aygv4/lpt_do_not_use_chatgpt_or_any_other_natural/",
        "text": " \n\nI come from a science background but this might apply to everything else.\n\nWhile these chatbots are very good at introductions and summaries, trying to bore deeper into the topic and asking for details or clarifications will only serve to confuse you. Or worse. ChatGPT will often just make stuff up and try to convince you that that's the right explanation. For example, it might give you a slightly incorrect or misleading explanation. Then, when you inevitably get confused and try to clarify or ask for details, it will make stuff up to further support its previous incorrect explanation. Rinse and repeat until nothing makes sense anymore and you are confused and frustrated. You don't even realize you're being fed complete nonsense because it explains everything so eloquently and with great confidence.\n\nIt's all fun and games when you know the truth and are just trying to confuse the AI but if you are a novice trying to learn a new subject you might get completely misled.\n\nJust remember that AI does not understand any of the concepts you are having it explain to you. It's just guessing the correct ordering of words.",
        "created_utc": 1677263716,
        "upvote_ratio": 1.0
    },
    {
        "title": "Do NOT use ChatGPT or any other natural language AI to learn scientific concepts",
        "author": "TheEarthIsACylinder",
        "url": "https://www.reddit.com/r/LifeProTips/comments/11ayg5x/do_not_use_chatgpt_or_any_other_natural_language/",
        "text": "[removed]",
        "created_utc": 1677263668,
        "upvote_ratio": 1.0
    },
    {
        "title": "Before traveling, fill a cup with water, freeze it, and stick a quarter on top. When you come back, if the quarter is still at the top of the cup, your food is safe to eat. If the quarter sank, it means that your freezer lost power and you should throw your food out",
        "author": "ohboy2020isshit",
        "url": "https://www.reddit.com/r/LifeProTips/comments/11ayfib/before_traveling_fill_a_cup_with_water_freeze_it/",
        "text": "",
        "created_utc": 1677263625,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT. To save money on fuel and maintenance on your vehicle practice these tips and you’ll save $1000s of dollars over the life of your vehicle:",
        "author": "woodbarber",
        "url": "https://www.reddit.com/r/LifeProTips/comments/11ay7cp/lpt_to_save_money_on_fuel_and_maintenance_on_your/",
        "text": "1. Avoid jackrabbit starts and stops. Accelerate slowly and evenly when starting. If you see a traffic light half a block away turn yellow, take your foot off the accelerator and coast to the stop.\n\n2. When going down hill and you want to slow down, gear down. This can be done on automatic transmissions as well as manual. Use the compression of the engine to help slow you down. Start braking well before the stop, this will greatly extend the life of your brake pads, callipers and rotors.\n\n3. Check your tire pressure regularly. Uneven or low pressure in your tires will make your engine work much harder to maintain constant speed.\n\n4. Do regular maintenance. Change your oil and filters regularly. Don’t skip on recommended maintenance cycles (steering, belts, linkage etc). It’s much cheaper to do preventive maintenance as opposed to breakdown maintenance.\n\n5. Carry breakdown insurance such as AAA (CAA here in Canada). A Tow charge over a long distance will cost much more then the a few years of Annual membership fees.",
        "created_utc": 1677263066,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT Request: helpful traits at job",
        "author": "Pitunk1989",
        "url": "https://www.reddit.com/r/LifeProTips/comments/11ay10e/lpt_request_helpful_traits_at_job/",
        "text": "I work in a service industry. The office I currently work at, I have been there for almost a decade. I have seen managers come and go. The one thing that has been very common is, everyone had high work expectations from me. \nI hardly procrastinate and have had very good relations with my colleagues. But I am expected to work over and above my pay grade. \nCurrently I am being dragged around regarding a project delay in which I didn’t have a major role. My superior had to monitor and report the completion in stipulated time but failed to do so. Now he is going on about how I failed at my job. \n\nI have authority issues. I cannot say NO. And I am a 100% people pleaser. I recognise these bad traits in myself. \n\nNow I am being transferred and do not want to repeat my experience. \n\nAny help is welcome!",
        "created_utc": 1677262625,
        "upvote_ratio": 1.0
    },
    {
        "title": "When taking painkillers for a headache, drink a full glass (8-10 oz) of water with the medicine. Dehydration is often a source of headaches, and more water is always good.",
        "author": "S2kDriver",
        "url": "https://www.reddit.com/r/LifeProTips/comments/11axvcx/when_taking_painkillers_for_a_headache_drink_a/",
        "text": "",
        "created_utc": 1677262225,
        "upvote_ratio": 1.0
    },
    {
        "title": "should I move?",
        "author": "Fil-pickle",
        "url": "https://www.reddit.com/r/LifeProTips/comments/11axrlt/should_i_move/",
        "text": "[removed]",
        "created_utc": 1677261961,
        "upvote_ratio": 1.0
    },
    {
        "title": "Beauty &amp; Fitness Tips",
        "author": "ThickEnd9953",
        "url": "https://www.reddit.com/r/LifeProTips/comments/11ax6gl/beauty_fitness_tips/",
        "text": "[removed]",
        "created_utc": 1677260466,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT: Use NATO phonetic alphabet while spelling your address or name to customer care professionals",
        "author": "EntropyProphet",
        "url": "https://www.reddit.com/r/LifeProTips/comments/11ax3cs/lpt_use_nato_phonetic_alphabet_while_spelling/",
        "text": " It's way easier this way. You don't have to think for words while spelling it out.\n\n[https://en.wikipedia.org//wiki/NATO\\_phonetic\\_alphabet](https://en.wikipedia.org//wiki/NATO_phonetic_alphabet)",
        "created_utc": 1677260239,
        "upvote_ratio": 1.0
    },
    {
        "title": "Beauty &amp; Fitness",
        "author": "ThickEnd9953",
        "url": "https://www.reddit.com/r/LifeProTips/comments/11ax1fh/beauty_fitness/",
        "text": "[removed]",
        "created_utc": 1677260104,
        "upvote_ratio": 1.0
    },
    {
        "title": "Use NATO phonetic alphabet while spelling your address or name to customer care professionals",
        "author": "EntropyProphet",
        "url": "https://www.reddit.com/r/LifeProTips/comments/11ax0ib/use_nato_phonetic_alphabet_while_spelling_your/",
        "text": "[removed]",
        "created_utc": 1677260040,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT: You wouldn’t care what people thought of you, if you knew how much they didn’t.",
        "author": "newherel",
        "url": "https://www.reddit.com/r/LifeProTips/comments/11awtii/lpt_you_wouldnt_care_what_people_thought_of_you/",
        "text": "For someone who has social anxiety, this has helped me a lot. I hope it can help someone else as well.",
        "created_utc": 1677259567,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT: There’s aluminum foil with non-stick properties",
        "author": "Zachhandley",
        "url": "https://www.reddit.com/r/LifeProTips/comments/11awsje/lpt_theres_aluminum_foil_with_nonstick_properties/",
        "text": "Idk how many people do or don’t know but there’s aluminum foil with non-stick sides and it’s like the perfect blend between parchment paper and aluminum foil. Let’s me cook anything on it in the air fryer and wrapping things with it they don’t get stuck!",
        "created_utc": 1677259505,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT: Secure passwords without having to remember or use a manager",
        "author": "Josef-Kafka",
        "url": "https://www.reddit.com/r/LifeProTips/comments/11awpx6/lpt_secure_passwords_without_having_to_remember/",
        "text": "[removed]",
        "created_utc": 1677259326,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT: Don't view kindness as transactional - do the right thing because it's the right thing to do. If you expect to be rewarded for your kindness, this will lead to a lot of disappointment in life and will eventually make you cynical.",
        "author": "zazzlekdazzle",
        "url": "https://www.reddit.com/r/LifeProTips/comments/11awelv/lpt_dont_view_kindness_as_transactional_do_the/",
        "text": "Doing the right thing is its own reward, and leave it at that.\n\nI know that, around here, being a cynic is considered a higher level of being. But being cynical is not the same as having healthy skepticism, it just makes you come across as bitter and damaged to anyone who isn't also a cynic. Surrounding yourself only with other cynics may seem like a good idea, but keep in mind that they will be just as cynical - distrustful and suspicious - of you and your actions.\n\nMeaningful human interaction is what makes life worth living, and surrounding yourself with mistrust and suspicion makes that impossible. This is how people feel lonely even when they have lots of friends.",
        "created_utc": 1677258560,
        "upvote_ratio": 1.0
    },
    {
        "title": "Need advice on Salary Negotiation",
        "author": "Ok-Equipment-5345",
        "url": "https://www.reddit.com/r/LifeProTips/comments/11awdop/need_advice_on_salary_negotiation/",
        "text": "[removed]",
        "created_utc": 1677258493,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT: If your toilet is about to overflow open the tank and push down the flapper valve. No more water will go into the bowl.",
        "author": "user_name_unknown",
        "url": "https://www.reddit.com/r/LifeProTips/comments/11aw9dd/lpt_if_your_toilet_is_about_to_overflow_open_the/",
        "text": "",
        "created_utc": 1677258187,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT Request - How should I answer \"Why should we hire you instead of using AI tools\" ?",
        "author": "madnerl",
        "url": "https://www.reddit.com/r/LifeProTips/comments/11aw00g/lpt_request_how_should_i_answer_why_should_we/",
        "text": "Little bit of context: I am a student about to finish studying Advertising major, and my specialty is copywriting. I am about to seek for jobs as a fresh grad advertiser / graphic designer / copywriter. I know very well my skill proficiency is not good enough to surpass AI, for example, ChatGPT and others. Furthermore, based on some gossips I heard hear or there with my peers, I know some advertising agency already implementing the use of AI. So how should I deal with the potential question of \"Why should we hire you, instead of using AI tools\"?",
        "created_utc": 1677257544,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT Request - How to prepare for a winter Power outage",
        "author": "heretolearnlady",
        "url": "https://www.reddit.com/r/LifeProTips/comments/11avzj0/lpt_request_how_to_prepare_for_a_winter_power/",
        "text": "Does anybody have tips to better prepare for winter storm power outages?",
        "created_utc": 1677257510,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT: Academic Research - Exercise on your period. I need your help for this ground breaking research!",
        "author": "ResearchUK",
        "url": "https://www.reddit.com/r/LifeProTips/comments/11avymd/lpt_academic_research_exercise_on_your_period_i/",
        "text": "[removed]",
        "created_utc": 1677257448,
        "upvote_ratio": 1.0
    },
    {
        "title": "Academic Research - Exercise on your period. I need your help for this ground breaking research!",
        "author": "ResearchUK",
        "url": "https://www.reddit.com/r/LifeProTips/comments/11avxhi/academic_research_exercise_on_your_period_i_need/",
        "text": "[removed]",
        "created_utc": 1677257372,
        "upvote_ratio": 1.0
    },
    {
        "title": "WHAT DO YOU WANT THE ILLUMINATI TO DO FOR YOU! All frequently asked questions are answered (+1706 871-4162 The road to enlightment, who do not wish to find out. https://wa.me/message/733NFULRW2Y7O1",
        "author": "Jonnyberton",
        "url": "https://www.reddit.com/r/LifeProTips/comments/11avvfc/what_do_you_want_the_illuminati_to_do_for_you_all/",
        "text": "",
        "created_utc": 1677257222,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT: That voice inside our head is not you. Those are just thoughts. You are your actions. Those thoughts are just from the processing center between your ears.",
        "author": "Potential_Meringue_6",
        "url": "https://www.reddit.com/r/LifeProTips/comments/11avv9t/lpt_that_voice_inside_our_head_is_not_you_those/",
        "text": " A lot of times people will have a thought that gets their ego riled up, but that doesn't mean you have act on that thought and yell at someone. Take a breath, let the thought wash through you and then give yourself 4 seconds to look for alternative reactions. Over time it will get easier and you will have less friction in your life.",
        "created_utc": 1677257212,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT: Improve cheap or oxidized wine with plastic wrap",
        "author": "CrookedGrin78",
        "url": "https://www.reddit.com/r/LifeProTips/comments/11av26e/lpt_improve_cheap_or_oxidized_wine_with_plastic/",
        "text": "Not sure where I learned this, but I've been doing it for years and it works very well. If you have some wine that's been open for a while, or was just cheap wine to begin with, try swirling some plastic wrap in it for 30 seconds or so. The unwanted flavor compounds will bind to the plastic, and when you pull the plastic out, the flavor of the wine should be dramatically improved. Try a side-by-side comparison if you don't believe me.\n\nI've tried this with a fair number of wines, and it always changes the flavor, but sometimes the original flavor is better. But it can transform a crappy or oxidized wine into something really drinkable.",
        "created_utc": 1677255155,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to get through in life is tough?",
        "author": "Tittynaing123",
        "url": "https://www.reddit.com/r/LifeProTips/comments/11auinm/how_to_get_through_in_life_is_tough/",
        "text": "",
        "created_utc": 1677253780,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT: When driving, avoid actions that force others to decelerate quickly; the more everyone prescribes to that effort, the less slow moving traffic there will be.",
        "author": "TabulaRasaRedo",
        "url": "https://www.reddit.com/r/LifeProTips/comments/11augiz/lpt_when_driving_avoid_actions_that_force_others/",
        "text": "Call it a brake bubble, or rubber band effect, whatever; when someone does something in traffic that makes the person behind them brake suddenly, the resulting slowdown cascades hundreds, even thousands of feet. \n\nThis happens countless times; we’ve all seen it, and we’ve all done it. But we can correct it. \n\nOne person’s selfish desire to shave SECONDS off their commute results in everyone behind them adding MINUTES. It doesn’t have to be that way. \n\nTraffic is an excellent example of how immediate the positive impacts of thinking about the whole over the part can be recognized.",
        "created_utc": 1677253622,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT Request: How do you convey to people, subtly that you never want to hear about their personal lives, ever? In a polite way.",
        "author": "xe36x",
        "url": "https://www.reddit.com/r/LifeProTips/comments/11augd1/lpt_request_how_do_you_convey_to_people_subtly/",
        "text": "",
        "created_utc": 1677253609,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT Request- Any body have any great ways to melt ice quickly off your car windshield?",
        "author": "bossandy",
        "url": "https://www.reddit.com/r/LifeProTips/comments/11aubl1/lpt_request_any_body_have_any_great_ways_to_melt/",
        "text": "I’m just looking for something I can put into a spray bottle to help melt ice in the morning. This morning my car was all ice and I tried scraping the back window and couldn’t get it off no matter how hard I scraped. My rear defroster is also broken so that did not help. Any tips?",
        "created_utc": 1677253262,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT: Use Hydrogen Peroxide to kill Cold, Flu and COVID at first sign.",
        "author": "BONERR4EVERR",
        "url": "https://www.reddit.com/r/LifeProTips/comments/11au59e/lpt_use_hydrogen_peroxide_to_kill_cold_flu_and/",
        "text": "If it doesn't all the way kill it,  it will at least shorten the length of your illness. I guarantee it!\n\nFirst, at first sign of sickness, put 1/4 tsp of Hydrogen Peroxide in your ears for 5 minutes each side or until the solution stops bubbling.\n\nNext, mix 1 part of Hydrogen Peroxide with 2 parts water and 1/2 tsp of salt. Gargle for 60 seconds\n\nFinally, mix 1 tsp of Hydrogen Peroxide with 8 oz of DISTILLED WATER and a saline packet (or 1/2 tsp of salt) to use in your neti pot. Make sure to spit out any that goes down your throat while you're using your neti pot.\n\nTo top it off, drink hot green tea with 1 tbsp of honey with 1/4 tsp of cinnamon. This is optional.\n\nDo all of this until your symptoms are gone. OR, do it on a daily basis to prevent getting a cold to begin with. I do it the night after I go out to a crowded place like a bar or a sporting event.",
        "created_utc": 1677252795,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT Request: how can I avoid capital gains tax (20%) on land sold (&lt;$500,000)?",
        "author": "ScrollinMyLifeAway",
        "url": "https://www.reddit.com/r/LifeProTips/comments/11au3xn/lpt_request_how_can_i_avoid_capital_gains_tax_20/",
        "text": "",
        "created_utc": 1677252696,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT: Four wheel drive vehicles dont matter on icey or slick roads. Driving normal like they can handle it puts you and others on the road at risk of injury or death",
        "author": "OlStickInTheMud",
        "url": "https://www.reddit.com/r/LifeProTips/comments/11atxyz/lpt_four_wheel_drive_vehicles_dont_matter_on_icey/",
        "text": "If you arent familiar or have much experience with driving on icey or slick roads and have a 4x4 vehicle. That 4x4 doesnt help. You will slide around as much as any other non 4x4 when you hit a patch of ice or other slippery spot on the road. Be safe dont over estimate and take it slow.",
        "created_utc": 1677252261,
        "upvote_ratio": 1.0
    },
    {
        "title": "Mobbing at work",
        "author": "Embarrassed-Room-648",
        "url": "https://www.reddit.com/r/LifeProTips/comments/11atvzd/mobbing_at_work/",
        "text": "[removed]",
        "created_utc": 1677252107,
        "upvote_ratio": 1.0
    },
    {
        "title": "Having a four wheel drive vehicle doesnt mean anything on icey or slick road conditions. Thinking so and driving like it puts you and others on the road at risk for injury or death.",
        "author": "OlStickInTheMud",
        "url": "https://www.reddit.com/r/LifeProTips/comments/11attf7/having_a_four_wheel_drive_vehicle_doesnt_mean/",
        "text": "[removed]",
        "created_utc": 1677251928,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT: Lowe's Home Improvement Stores Have Free Tire Air Stations",
        "author": "TlacuacheDelMuerte",
        "url": "https://www.reddit.com/r/LifeProTips/comments/11ata2w/lpt_lowes_home_improvement_stores_have_free_tire/",
        "text": "The title. I looked through LPT and didn't see this one, but Lowe's will have an air station located near their contractor entrance where you can fill your tires up with air for free. The few I've used always have a gauge on their as well to show pressure. Sub LPT if you need to know your appropriate tire pressure it's on your tire, usually above the rim and will say something along the lines of \"MAX PRESS 30 PSI\" or whatever your tires require.",
        "created_utc": 1677250518,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT Request Power Outage &amp; frozen food",
        "author": "Upstairs_Role_7602",
        "url": "https://www.reddit.com/r/LifeProTips/comments/11aswk3/lpt_request_power_outage_frozen_food/",
        "text": "Day two of winter power outage.  If I put my frozen food in a cooler with ice will it stay frozen for a couple of days?  I have both a 5 day Coleman and Blue coolers available.  It’s about 20-30 degrees outside.",
        "created_utc": 1677249491,
        "upvote_ratio": 1.0
    },
    {
        "title": "Power outage &amp; frozen food",
        "author": "Upstairs_Role_7602",
        "url": "https://www.reddit.com/r/LifeProTips/comments/11asqa5/power_outage_frozen_food/",
        "text": "[removed]",
        "created_utc": 1677249030,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT: Buy weird accessories to decorate on your car when you leave it somewhere it could be broken into, your car will be safe.",
        "author": "WardenWatcherISNOTME",
        "url": "https://www.reddit.com/r/LifeProTips/comments/11arydi/lpt_buy_weird_accessories_to_decorate_on_your_car/",
        "text": "",
        "created_utc": 1677246933,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT Request: How to be more photogenic?",
        "author": "Pigstorm",
        "url": "https://www.reddit.com/r/LifeProTips/comments/11arx1m/lpt_request_how_to_be_more_photogenic/",
        "text": "",
        "created_utc": 1677246821,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT: If a task will take you 15 minutes or less to complete, do it in that moment before they begin to add up.",
        "author": "NeatEhEff",
        "url": "https://www.reddit.com/r/LifeProTips/comments/11arrsh/lpt_if_a_task_will_take_you_15_minutes_or_less_to/",
        "text": "It's easy to become overwhelmed with menial daily tasks and chores when it feels like they're never-ending - dishes, laundry, organizing your things, making a phone call, making the kids' lunches. \n\nLPT: If the task will take 15 minutes or less to complete, complete it in that moment instead of pushing it off for a later time.\n\nAt first, it will feel like you're playing \"catch-up\" and you may need to spend a day or two to reach the maintenance stage. Once you reach this stage, the rest feels attainable. \n\nYou may feel that you need to force yourself to do the task (and maybe you do), but after it's finished, you'll have a feeling of relief and a sense of accomplishment from productivity. \n\nNot only does it free up more of your personal time, but when you want to relax or have fun, you won't feel guilty about enjoying yourself!\n\nYou deserve to ENJOY your free time, future you will thank you.",
        "created_utc": 1677246405,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT Request: About to turn 18, any money, college or household tips from the masters? (Europe/Asia)",
        "author": "Terrible-Ninja-6557",
        "url": "https://www.reddit.com/r/LifeProTips/comments/11arrs4/lpt_request_about_to_turn_18_any_money_college_or/",
        "text": "[removed]",
        "created_utc": 1677246405,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT: Every time you add your mailing address anywhere, write down what it’s for so if you move you can remember what to change.",
        "author": "Turfgoon675",
        "url": "https://www.reddit.com/r/LifeProTips/comments/11aqxgh/lpt_every_time_you_add_your_mailing_address/",
        "text": "I already moved and by the grace of god I was able to retrieve my bachelors diploma!! I completely forgot to change my mailing address from my university to my current home. Now I can’t remember what else to change now that I’ve moved 🤦🏽‍♀️🤦🏽‍♀️ if anything pops into mind please comment. Even if it’s for a subscription service.",
        "created_utc": 1677243869,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT: Treating and Preventing Dehydration",
        "author": "rockz3r",
        "url": "https://www.reddit.com/r/LifeProTips/comments/11aq86b/lpt_treating_and_preventing_dehydration/",
        "text": "[removed]",
        "created_utc": 1677241640,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT: Treating and Preventing Dehydration",
        "author": "krazykazk",
        "url": "https://www.reddit.com/r/LifeProTips/comments/11aq7fa/lpt_treating_and_preventing_dehydration/",
        "text": "[removed]",
        "created_utc": 1677241568,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT on Treating and Preventing Dehydration",
        "author": "krazykazk",
        "url": "https://www.reddit.com/r/LifeProTips/comments/11aq6jv/lpt_on_treating_and_preventing_dehydration/",
        "text": "[removed]",
        "created_utc": 1677241481,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT: Faded\\oxidized eyeglass frames can be polished to look brand new again",
        "author": "fantasifull",
        "url": "https://www.reddit.com/r/LifeProTips/comments/11apeho/lpt_fadedoxidized_eyeglass_frames_can_be_polished/",
        "text": "I own a pair of fairly expensive eyeglasses I purchased many years ago. After thousands of hours of use they were starting to look almost white as opposed to the tortoise look they originally had. I asked several local optometrists. Most of them recommended buying new frames.\n\nAfter visiting most of the optometrists in the city I finally found one that had a polishing machine. They said the result could vary, and depended on the quality of the plastics. Mine were fairly high quality acetate frames according to the cashier. They came out looking brand new, and still look great months later.\n\nThe polishing cost me ~$10.",
        "created_utc": 1677238815,
        "upvote_ratio": 1.0
    }
]