[
    {
        "title": "LPT: Condense a thought or an idea down to a single word, and make a mental list of these Individual words until they can be recorded elsewhere and cleared from the mind.",
        "author": "TheShaggyRogers23",
        "url": "https://www.reddit.com/r/LifeProTips/comments/116mr8n/lpt_condense_a_thought_or_an_idea_down_to_a/",
        "text": "Here is an example:\n\nI'm busy. I'm not able to use my phone or some other form of writing. But I've come up with several ideas in my head. Ideas I'd rather not forget about. And these are some rather complex ideas.\n\nSay I'm up to 4 ideas. I'm still not able to record them. Then another idea, or train of thought, pops in my head. Now I'm up to 5 ideas. \n\nNow I'm struggling to remember all of them. What was the first idea again? What was the second? I keep forgetting.\n\nIt is scenarios like this that I'll use a command I call \"Bookmark\".\n\nAs the title of this post suggests, I condense each train of thought down to a single word, and I create a numbered list of these words in my head until I can record them elsewhere.\n\nThis method also allows me to jump back and forth between numerous complex ideas without getting lost, confused, or disorganized.\n\nHere's another example:\n\nSay I come up with an idea on how to fix something. This idea, if fully written out, would require about 4 sentences to explain.\n\nThen a second later an interesting thought occurs to me. This thought is unrelated to the previous idea, but it's something I would like to delve more into later.\n\nThen I have a realization. This realization is unrelated to the first idea and the second thought, but I am also interested in delving more into it.\n\nMy memory bank is getting pretty full right about now, and I can feel I have more thoughts to generate. So I choose to \"Bookmark\".\n\n1. Idea.\n\n2. Thought.\n\n3. Realization.\n\nThen a forth idea is generated. I condense it down to a single word and add it to the list.\n\nI now have a mental list containing 4 words. Each word causes me to recall the thoughts associated with them.\n\nI decide that right now I'd like to prioritize the first thought. So I delve into it. Along the way I get another idea. This idea is associated with the first idea, but they're not really alike. So I condense it down to a single word and make it the 5th word on my mental list of bookmarks.\n\nNow I've arrived at my destination. This entire time I was walking, hense, I didn't have time to write my thoughts down.\n\nI am now able to write down these 5 words, and their associated thoughts, to clear them from my head.",
        "created_utc": 1676837752,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT: need to temporarily store something that needs refrigerating at work or someone else's place? Put your keys in there too.",
        "author": "Owlmoose",
        "url": "https://www.reddit.com/r/LifeProTips/comments/116mbt0/lpt_need_to_temporarily_store_something_that/",
        "text": "My wife needed to put some medicine for our daughter in the fridge at her work for a couple hours. Her boss came by and saw what she was doing and suggested she puts her keys in there too - Can't drive away without your keys, and won't forget the medicine when you get 'em. Plus it's an odd thing to do, and you're more likely to remember where they are.",
        "created_utc": 1676836688,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT: Use the Talk-to-ChatGPT chrome extension to talk to ChatGPT hands-free",
        "author": "thehangoverer",
        "url": "https://www.reddit.com/r/LifeProTips/comments/116mbe2/lpt_use_the_talktochatgpt_chrome_extension_to/",
        "text": "",
        "created_utc": 1676836659,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT request: what are some quick and easy at-home exercises to strengthen core, back, knee,... joints and muscles?",
        "author": "Electrical_Finding73",
        "url": "https://www.reddit.com/r/LifeProTips/comments/116m0gz/lpt_request_what_are_some_quick_and_easy_athome/",
        "text": "Have the bad habit of not doing any exercises because of time management. But woyld love to fit in a 5-10 quick exercise round in to strengthen my body.",
        "created_utc": 1676835893,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT: The most life trajectory-changing thing a person can do is focus on fitness in their 20s",
        "author": "IowaCreekJumper",
        "url": "https://www.reddit.com/r/LifeProTips/comments/116kham/lpt_the_most_life_trajectorychanging_thing_a/",
        "text": "You will be in a different galaxy of life experience in your 30s and beyond -even if you tone down the exercise in your 30s/40s as you develop a family. \n\nBuild the foundation now.",
        "created_utc": 1676832177,
        "upvote_ratio": 1.0
    },
    {
        "title": "Use ChatGPT for CYOA story building",
        "author": "aniperi",
        "url": "https://www.reddit.com/r/LifeProTips/comments/116kg04/use_chatgpt_for_cyoa_story_building/",
        "text": "[removed]",
        "created_utc": 1676832090,
        "upvote_ratio": 1.0
    },
    {
        "title": "Lpt: if multiple drivers are flashing their headlights at you, you may need to adjust the aim of yours.",
        "author": "Rilkespawn",
        "url": "https://www.reddit.com/r/LifeProTips/comments/116k8o9/lpt_if_multiple_drivers_are_flashing_their/",
        "text": "Some drivers flash, their brights, if they think yours are on as a way of letting you know. If yours are not on and they are doing this, it might be because yours are aimed too high and are shining in other drivers eyes.",
        "created_utc": 1676831600,
        "upvote_ratio": 1.0
    },
    {
        "title": "The most life trajectory-altering thing a person can do is spend their 20s focused on fitness and financial responsibility.",
        "author": "IowaCreekJumper",
        "url": "https://www.reddit.com/r/LifeProTips/comments/116k8i4/the_most_life_trajectoryaltering_thing_a_person/",
        "text": "[removed]",
        "created_utc": 1676831589,
        "upvote_ratio": 1.0
    },
    {
        "title": "If multiple drivers are flashing their headlights at you, you made need to adjust the aim of yours.",
        "author": "Rilkespawn",
        "url": "https://www.reddit.com/r/LifeProTips/comments/116k5h3/if_multiple_drivers_are_flashing_their_headlights/",
        "text": "[removed]",
        "created_utc": 1676831392,
        "upvote_ratio": 1.0
    },
    {
        "title": "[Request] How to deal with stress and imposter syndrome at work?",
        "author": "CareerCandy99",
        "url": "https://www.reddit.com/r/LifeProTips/comments/116iydu/request_how_to_deal_with_stress_and_imposter/",
        "text": "[removed]",
        "created_utc": 1676828489,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT Request: What are some verbal tricks I can use to always have the upper hand in any argument and never appear to be wrong, regardless of my actual positions or the facts?",
        "author": "xe36x",
        "url": "https://www.reddit.com/r/LifeProTips/comments/116idzw/lpt_request_what_are_some_verbal_tricks_i_can_use/",
        "text": "",
        "created_utc": 1676827130,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT: to get a better oven-cooked frozen pizza, you should take it out halfway through baking and lay a sheet of aluminum foil on top (with a hole in the center). This prevents cold centers.",
        "author": "katiecharm",
        "url": "https://www.reddit.com/r/LifeProTips/comments/116i16q/lpt_to_get_a_better_ovencooked_frozen_pizza_you/",
        "text": "[removed]",
        "created_utc": 1676826289,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT: With it being the middle of the winter, your skin becomes more sensitive to the soap/shampoo products you’re using. Make sure to wash/scrub the product out more thoroughly, even in places it “looks gone,” or you might confuse it for dandruff/dry skin.",
        "author": "Pun-kachu",
        "url": "https://www.reddit.com/r/LifeProTips/comments/116hzre/lpt_with_it_being_the_middle_of_the_winter_your/",
        "text": "",
        "created_utc": 1676826193,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT: For men, sit down and pee",
        "author": "mxexc",
        "url": "https://www.reddit.com/r/LifeProTips/comments/116hyo5/lpt_for_men_sit_down_and_pee/",
        "text": "[removed]",
        "created_utc": 1676826122,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT: Some useful tips to get out of the Rat Race.",
        "author": "Legitimate-Builder82",
        "url": "https://www.reddit.com/r/LifeProTips/comments/116gio2/lpt_some_useful_tips_to_get_out_of_the_rat_race/",
        "text": "[To escape the rat race, you must stop being a rat first.](https://yourgentleoverlord.blogspot.com/2021/12/win-rat-race-by-being-human-5-solutions.html)",
        "created_utc": 1676823238,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT there is an app called “slice” that lets you order from local Italian restaurants. Most of the businesses offer free or low cost delivery. The fee for using the app is minimal. A huge savings from the other delivery app services.",
        "author": "bigboat24",
        "url": "https://www.reddit.com/r/LifeProTips/comments/116gduv/lpt_there_is_an_app_called_slice_that_lets_you/",
        "text": "",
        "created_utc": 1676823049,
        "upvote_ratio": 1.0
    },
    {
        "title": "Some proper tips to get out of the rat race.",
        "author": "Legitimate-Builder82",
        "url": "https://www.reddit.com/r/LifeProTips/comments/116g8tq/some_proper_tips_to_get_out_of_the_rat_race/",
        "text": "[removed]",
        "created_utc": 1676822830,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT request: I’m a therapist, what is some boring language I can use to describe my job title instead of therapist so people stop asking me about being a therapist?",
        "author": "Lexafaye",
        "url": "https://www.reddit.com/r/LifeProTips/comments/116fwuu/lpt_request_im_a_therapist_what_is_some_boring/",
        "text": "When I’m a new social setting and people ask what I do, I tell them I’m a therapist then people wanna talk about therapist things and mental disorders and I literally hate talking about work/school in my free time. \n\nBut when they ask tech guy what he does he’s like “project manager for blockchain encrypting consulting firm” or some bs then no one asks about his job. How can I describe my job like that? Tips please",
        "created_utc": 1676822390,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT: for people with low self-esteem. Be as kind to yourself as you are to the people you love. You wouldn't humiliate them, so don't do it to you. You deserve respect as much as them.",
        "author": "dr-korbo",
        "url": "https://www.reddit.com/r/LifeProTips/comments/116fmxu/lpt_for_people_with_low_selfesteem_be_as_kind_to/",
        "text": "",
        "created_utc": 1676822004,
        "upvote_ratio": 1.0
    },
    {
        "title": "For people with low self-esteem: Be as kind to yourself as you are to the people you love. You wouldn't humiliate them, so don't humiliate yourself.",
        "author": "dr-korbo",
        "url": "https://www.reddit.com/r/LifeProTips/comments/116fius/for_people_with_low_selfesteem_be_as_kind_to/",
        "text": "",
        "created_utc": 1676821858,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT: Dropping college",
        "author": "Tall_Lawyer4615",
        "url": "https://www.reddit.com/r/LifeProTips/comments/116ff0o/lpt_dropping_college/",
        "text": "[removed]",
        "created_utc": 1676821715,
        "upvote_ratio": 1.0
    },
    {
        "title": "Dropping college",
        "author": "Tall_Lawyer4615",
        "url": "https://www.reddit.com/r/LifeProTips/comments/116f3lt/dropping_college/",
        "text": "[removed]",
        "created_utc": 1676821278,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do I end a long-term, childhood friendship ?",
        "author": "Emistief",
        "url": "https://www.reddit.com/r/LifeProTips/comments/116edam/how_do_i_end_a_longterm_childhood_friendship/",
        "text": "[removed]",
        "created_utc": 1676820281,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT When you’re traveling, bring a portable battery.",
        "author": "SpacePolice04",
        "url": "https://www.reddit.com/r/LifeProTips/comments/116edah/lpt_when_youre_traveling_bring_a_portable_battery/",
        "text": "Sometimes outlets aren’t convenient in hotels and you can use the outlets to charge your battery and then use the battery to charge your devices.  It can also help with unexpected waits like delayed flights, etc.",
        "created_utc": 1676820280,
        "upvote_ratio": 1.0
    },
    {
        "title": "When you’re traveling, bring a portable battery.",
        "author": "SpacePolice04",
        "url": "https://www.reddit.com/r/LifeProTips/comments/116e7zq/when_youre_traveling_bring_a_portable_battery/",
        "text": "[removed]",
        "created_utc": 1676820086,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT When a server is being slow say something like \"chop chop\" to make them move faster.",
        "author": "Unlucky_Low_6254",
        "url": "https://www.reddit.com/r/LifeProTips/comments/116deqd/lpt_when_a_server_is_being_slow_say_something/",
        "text": "",
        "created_utc": 1676818927,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT: Turn off response notifications if you find yourself getting into contentious argument on social media.",
        "author": "ttgx1000",
        "url": "https://www.reddit.com/r/LifeProTips/comments/116ddqx/lpt_turn_off_response_notifications_if_you_find/",
        "text": "If you can, turn off response notifications, that way you aren’t notified when someone responds to your posts. You’ve said your peace, you don’t need to argue with every person that disagrees, your mental health will thank you.",
        "created_utc": 1676818892,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT Request",
        "author": "Temporary-Law2456",
        "url": "https://www.reddit.com/r/LifeProTips/comments/116d1df/lpt_request/",
        "text": "[removed]",
        "created_utc": 1676818423,
        "upvote_ratio": 1.0
    },
    {
        "title": "Dropping college",
        "author": "Tall_Lawyer4615",
        "url": "https://www.reddit.com/r/LifeProTips/comments/116csb0/dropping_college/",
        "text": "[removed]",
        "created_utc": 1676818093,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do I move forward?",
        "author": "Temporary-Law2456",
        "url": "https://www.reddit.com/r/LifeProTips/comments/116crgq/how_do_i_move_forward/",
        "text": "[removed]",
        "created_utc": 1676818064,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT on how to lie and get away with it, begins with honesty",
        "author": "IManageACircus",
        "url": "https://www.reddit.com/r/LifeProTips/comments/116cay5/lpt_on_how_to_lie_and_get_away_with_it_begins/",
        "text": "If you want to get away with \"big lies\" be honest about the small details of your life. This builds trust with the people in your orbit.\n\nFor example: George Washington admitted to his dad that he indeed cut down the cherry tree, \"I cannot tell a lie, I did cut down the tree,\" he was known to have said which in turn made his father filled with pride that his son was not a liar.\n\nBut then, the next time he needed to wreak havoc on the world, and not get caught, all he had to do was say, \"I'm George Washington, remember when I was honest that time with the tree? See I cannot lie!\" \n\nAnd then they will believe you when you make a big lie.",
        "created_utc": 1676817405,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT to conserve toothpaste",
        "author": "IManageACircus",
        "url": "https://www.reddit.com/r/LifeProTips/comments/116c2qa/lpt_to_conserve_toothpaste/",
        "text": "Toothpaste (like everything else) is becoming increasingly expensive. \n\n-My first Pro Tip is to buy your toothpaste at the dollar store. Same name brands and way way cheaper.\n\n-My next Pro Tip is to use only the amount equal to the size of a pea. That's all you need to clean your teeth and leave your breath smelling minty fresh.",
        "created_utc": 1676817057,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT: Keep a bath bag ready and prepped for travel",
        "author": "bowl-bowl-bowl",
        "url": "https://www.reddit.com/r/LifeProTips/comments/116bds4/lpt_keep_a_bath_bag_ready_and_prepped_for_travel/",
        "text": "Having a bath bag, a bag with bathroom necessities, prepped and ready for travel has made packing so much easier. Having it equipped with a little shampoo, conditioner, a bar of oap, small toothpaste, comb, and face products makes it way easier to throw my toothbrush in and leave when I need to; from small trips like visiting a friend for the night or larger trips getting on an airplane with liquid restrictions. It's easy to do and something I didn't realize would make packing so much easier until recently.",
        "created_utc": 1676816108,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT: Stale bread lasts for a week after the best before date and you can make it soft again by dipping it in water and microwaving it!",
        "author": "thjmze21",
        "url": "https://www.reddit.com/r/LifeProTips/comments/116b6ew/lpt_stale_bread_lasts_for_a_week_after_the_best/",
        "text": "I volunteer at the food bank and we're allowed to take home bread that's become too hard to eat (because it goes to the pigs otherwise) . But really all you need to do is dip it in water and microwave for 30 seconds. Maybe more if your microwave is weak. The inside of the bread will become unimaginably soft and fluffy. I use this with baguettes but you can do that with almost any bread!\n\n\n\n\n\nI just wish more people would realize that and not waste so much food.",
        "created_utc": 1676815790,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT: easy way to clean a blender",
        "author": "LeiaO315",
        "url": "https://www.reddit.com/r/LifeProTips/comments/116b09u/lpt_easy_way_to_clean_a_blender/",
        "text": "Add soap to the pitcher and fill halfway with water. Turn it on for about 30 seconds. Dump the soup water and rinse with clean water. Voila! This cleans the pitcher and the blades.",
        "created_utc": 1676815391,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT Request: How do you keep your towels and sheets in the best condition?",
        "author": "Apendica",
        "url": "https://www.reddit.com/r/LifeProTips/comments/116aqw8/lpt_request_how_do_you_keep_your_towels_and/",
        "text": "",
        "created_utc": 1676814634,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT Should I ask my manager for another work?",
        "author": "PracticalDecision98",
        "url": "https://www.reddit.com/r/LifeProTips/comments/116anbw/lpt_should_i_ask_my_manager_for_another_work/",
        "text": "\nHi,\nI am fresh out of college and am working as an intern in a startup. I have only a month left in this internship and I do feel that I might be considered for a job. However, recently my manager gave me content writing work in which I am not interested and it was not included in the job description as well but it's something which he labelled as a priority work and would go on for 1-2 months.  Also, though I am applying to other jobs but I haven't heard till now from them. Should I ask my manager to give me another work or by asking this, do I lose my chance of getting a job? Any inputs would be highly appreciated.",
        "created_utc": 1676814331,
        "upvote_ratio": 1.0
    },
    {
        "title": "Should I ask my manager for another work?",
        "author": "PracticalDecision98",
        "url": "https://www.reddit.com/r/LifeProTips/comments/116akpe/should_i_ask_my_manager_for_another_work/",
        "text": "[removed]",
        "created_utc": 1676814112,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT Make declarative statements instead of question those who cannot answer simply",
        "author": "ComposerNate",
        "url": "https://www.reddit.com/r/LifeProTips/comments/116ajh7/lpt_make_declarative_statements_instead_of/",
        "text": "When  their reply is tangential enough you need guess their intention,  avoid asking follow-up questions but instead declare what you understand or will now do that they may correct you precisely.\n\n  \nFRUSTRATING Q: Shall I make dinner? A: I had Indian for lunch.  \nCLEAR  Q: Unless you have something else in mind, I will cook us rice stir-fry  for dinner. A: No thanks, I will make us salad and pizza.\n\nFRUSTRATING Q: Want to go to a comedy club tomorrow? A: I had a stressful day.  \nCLEAR  Q: Unless you stop me, I will now reserve us comedy club tickets for  tomorrow evening. A: That would be great, thanks, what time?\n\nFRUSTRATING Q: Which color should I paint this wall? A: All of this laundry needs put away.  \nCLEAR Q: These are the three colors I am trying to decide between to paint this wall.  A: The middle one is best.",
        "created_utc": 1676814015,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT: When pouring cereal out of the box, pull the bag up/out slightly past the cereal box flaps so loose pieces don't fall into the box.",
        "author": "stpatricksblue",
        "url": "https://www.reddit.com/r/LifeProTips/comments/116adjm/lpt_when_pouring_cereal_out_of_the_box_pull_the/",
        "text": "Bonus tip: Leave ice cream container lids in the freezer so the ice cream stuck to the lid doesn't melt and drip down the sides of the container when the lid is put back on.",
        "created_utc": 1676813528,
        "upvote_ratio": 1.0
    },
    {
        "title": "Make declarative statements instead of question those who cannot answer simply",
        "author": "ComposerNate",
        "url": "https://www.reddit.com/r/LifeProTips/comments/116a8xy/make_declarative_statements_instead_of_question/",
        "text": "[removed]",
        "created_utc": 1676813165,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT: Dont buy fake electric razor foils.",
        "author": "MarkZ",
        "url": "https://www.reddit.com/r/LifeProTips/comments/116a0y6/lpt_dont_buy_fake_electric_razor_foils/",
        "text": "I purchased a $6 razor head for my electric foil shaver on ebay. It looks identical to the original; but when I used it I was still left with stubble. Then I purchased an original replacement for $30 and it worked really well.\n\nFor this type of foil shaver; the foil and the cutting blades are all part of the same replaceable head.\n\nI zoomed in with a microscope on each and saw the problem. On the original; when I focus the microscope on the foil (1); the blade underneath is also in focus. On the fake; I need to focus separately on either the foil or the blade underneath - so they aren't touching =&gt; this is the problem.\n\n[https://postimg.cc/svzCvYZg](https://postimg.cc/svzCvYZg)\n\n[https://postimg.cc/kBy382xF](https://postimg.cc/kBy382xF)\n\n[https://postimg.cc/QKQLftvD](https://postimg.cc/QKQLftvD)",
        "created_utc": 1676812499,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT: If you don't want to get sick before an upcoming trip, don't use your tongue to press the buttons in the elevator",
        "author": "sketchybutter",
        "url": "https://www.reddit.com/r/LifeProTips/comments/1169nmo/lpt_if_you_dont_want_to_get_sick_before_an/",
        "text": "Seriously, most of the \"life pro tips\" here is just common sense",
        "created_utc": 1676811399,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT: Don't make toilet paper replacement something that is hard for guests to find",
        "author": "ras1304",
        "url": "https://www.reddit.com/r/LifeProTips/comments/1169d8a/lpt_dont_make_toilet_paper_replacement_something/",
        "text": "[removed]",
        "created_utc": 1676810466,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT: Socializing is all about attention",
        "author": "Nearby-Lime-8663",
        "url": "https://www.reddit.com/r/LifeProTips/comments/1168twy/lpt_socializing_is_all_about_attention/",
        "text": "[removed]",
        "created_utc": 1676808541,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT: Before you hit 'send' on that email, take a moment to make sure your emotions are in check. Even if you're feeling *ecstatic*, resist the urge to send it right away!",
        "author": "urosino",
        "url": "https://www.reddit.com/r/LifeProTips/comments/11683tc/lpt_before_you_hit_send_on_that_email_take_a/",
        "text": "When we're in a heightened emotional state, we tend to rush into decisions without carefully considering the consequences. Sending an email when you’re feeling \\*over-the-moon\\* could lead to some unintended consequences - like your words being misinterpreted or taken the wrong way. \n\nWhat do you think? Have you ever sent an email when you were feeling *too* emotional? 🤪",
        "created_utc": 1676805557,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT: Take a picture of your luggage’s lock cmbination after locking it. This way you know if someone attempted to open it.",
        "author": "Lopsided_Music4660",
        "url": "https://www.reddit.com/r/LifeProTips/comments/1165fce/lpt_take_a_picture_of_your_luggages_lock/",
        "text": "",
        "created_utc": 1676795399,
        "upvote_ratio": 1.0
    },
    {
        "title": "Take a picture of luggage’s lock combination after locking it. This way you know if someone attempted to open it",
        "author": "Lopsided_Music4660",
        "url": "https://www.reddit.com/r/LifeProTips/comments/1165eps/take_a_picture_of_luggages_lock_combination_after/",
        "text": "",
        "created_utc": 1676795330,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT: Archive chats in WhatsApp to reduce stress and overwhelm",
        "author": "FSGMC",
        "url": "https://www.reddit.com/r/LifeProTips/comments/11649e4/lpt_archive_chats_in_whatsapp_to_reduce_stress/",
        "text": "This is one of my favourite productivity life-hacks and I’d go as far as to  say it’s changed my life — as well as a few friends who have also taken it on. In addition to reducing phone screen time, the most significant  benefit is that it has made me a more efficient and effective communicator with the people who are most important to me.\n\nIf  you are someone that thrives in neatness, having a cluttered room is  the same as having a cluttered inbox. Even if you’re not, imagine  everything you own being laid out in a room and constantly being  shuffled around. There is another way; imagine the digital archive being  the same as a physical cupboard to keep everything in, ready for when  you need it. \n\nWhatsApp inbox zero is the idea of keeping your main message inbox close to empty, avoiding the feeling of overwhelm and  distraction that comes with having all chats and groups in one place at  all times. Think of it like being in a loud café with people talking, kids yelling, cars  screaming past outside, and then putting on some headphones and  quietening all the noise. Just you, and whatever you want in front of  you.\n\nWhen you archive a chat, it is simply hidden from the main view and nothing  more. It lives in the exact same page, just one layer back in the  archive, like a digital cupboard. When you need to message someone,  either click the ‘Archived’ button which opens the exact same looking  page with all chats and groups in to scroll through in the same order. Another quick way is to hit the search icon and start to type.\n\n**To begin, archive everything.**\n\nHow to do it: (Android) Three dots (⋮) &gt; Settings &gt; Chats &gt; Chat History &gt; Archive All Chats.   \n(iPhone) Settings &gt; Chats &gt; Archive All Chats\n\n**Then, archive as you go.**\n\nWhen  a message has been sent I immediately archive the chat, even mid  conversation. When someone sends you a message in a chat or group it reappears in the main window, ready for a reply and then an archive. It’s easy to archive quickly on an iPhone as you can swipe on a chat. On  Android just click and hold to select (multiple if desired, which is  fantastic) and then tap the archive icon that appears in the top bar.\n\nIf you’re on the computer it’s also very easy. WhatsApp web and desktop keyboard shortcuts to archive chats:  \nMac browser &amp; desktop app — CMD + CTRL + E  \nWindows browser — CTRL + ALT + E  \nWindows desktop app — CTRL + E  \nI use this after i’ve fired off a message; a quick shortcut and the chat is archived.\n\nWhatsApp won’t notify the other person if you archive the conversation, it’s just for you and your own peace of mind.\n\n***Important note:*** Make sure in settings you have ‘Keep chats archived’ set to off. Otherwise they just stay archived, forever, like the end of [*Raiders of the Lost Ark*](https://www.youtube.com/watch?v=TASlXWbMZyU).\n\nGo to: Settings &gt; Chats &gt; Keep chats archived (disabled)\n\nThere,  done. Freedom and inbox zero. Now when you open WhatsApp only new  messages and those who you need to message are there, everyone else is  neatly waiting in the background.\n\nAnd breathe.\n\nIf it’s not for you, **Settings** \\&gt; **Chats** \\&gt; **Unarchive All Chats** and you’re back to where you were. Give it a couple days though, I think you’ll be into it.\n\n**TL;DR:**\n\nArchive all chats in WhatsApp and have the main inbox as an unread &amp; 'need to message' inbox to reduce overwhelm and stress. Disable 'Keep chats archived' to make sure new messages come into the inbox.",
        "created_utc": 1676790847,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT Request: people often say \"learn self discipline\" but how?",
        "author": "SigKun",
        "url": "https://www.reddit.com/r/LifeProTips/comments/11646yc/lpt_request_people_often_say_learn_self/",
        "text": "Put in mind that I asked this question because I want to lose weight and make my own business, but I work 12 hours a day and take extra 2 hours of my day for the road from and to work. \n\nHow do I stay focused on my goal and not make my work an excuse for not working out and stay on a diet?",
        "created_utc": 1676790591,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT: You can skip any Youtube ad(on mobile) by opening and closing a Short.",
        "author": "8Koneri8",
        "url": "https://www.reddit.com/r/LifeProTips/comments/1163rrd/lpt_you_can_skip_any_youtube_adon_mobile_by/",
        "text": "",
        "created_utc": 1676788975,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT: When approaching an oncoming vehicle whose driver has forgotten the brights are on, direct your gaze to the white road line to the right (passenger side if in US.) You won't be blinded and you'll be able to maintain your bearings and stay within your lane.",
        "author": "messyhuman987",
        "url": "https://www.reddit.com/r/LifeProTips/comments/1163n1o/lpt_when_approaching_an_oncoming_vehicle_whose/",
        "text": "",
        "created_utc": 1676788468,
        "upvote_ratio": 1.0
    },
    {
        "title": "When approaching an oncoming vehicle whose driver has forgotten the brights are on, direct your gaze to the white road line to the right (passenger side if in US.) You won't be blinded and you'll be able to maintain your bearings and stay within your lane.",
        "author": "messyhuman987",
        "url": "https://www.reddit.com/r/LifeProTips/comments/1163lai/when_approaching_an_oncoming_vehicle_whose_driver/",
        "text": "",
        "created_utc": 1676788287,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT: When you make online purchases, look for promo codes before you click that buy button.",
        "author": "DonkeyTron42",
        "url": "https://www.reddit.com/r/LifeProTips/comments/1163jpl/lpt_when_you_make_online_purchases_look_for_promo/",
        "text": "There are many search engines that can save you 10% or more right off the bat.",
        "created_utc": 1676788136,
        "upvote_ratio": 1.0
    },
    {
        "title": "(LPT) How can I keep going",
        "author": "Other_State5817",
        "url": "https://www.reddit.com/r/LifeProTips/comments/1162a2d/lpt_how_can_i_keep_going/",
        "text": "[removed]",
        "created_utc": 1676783540,
        "upvote_ratio": 1.0
    },
    {
        "title": "How can I keep going",
        "author": "Other_State5817",
        "url": "https://www.reddit.com/r/LifeProTips/comments/11627bn/how_can_i_keep_going/",
        "text": "[removed]",
        "created_utc": 1676783277,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT: If you watch YouTube on your Android phone, disable the app and use the web version",
        "author": "kkauchi",
        "url": "https://www.reddit.com/r/LifeProTips/comments/1161d5y/lpt_if_you_watch_youtube_on_your_android_phone/",
        "text": " Disable the app in Android settings (can't be fully uninstalled) and use Chrome to watch YouTube.\n\n&amp;#x200B;\n\n\\- All ads are insta skippable: when the ad starts, simply refresh the page and it will start the video right away\n\n\\-  Watch or listen with your screen off without YouTube Premium: this is  because Chrome does not / can not know when your screen is off. Works great for music or podcasts.\n\n\\- YouTube shorts are not as predatory and annoying (esp helps if you are spending too much time swiping)",
        "created_utc": 1676780475,
        "upvote_ratio": 1.0
    },
    {
        "title": "Very cheap products https://www.shoplivegood.com/DF10",
        "author": "DiskNo6460",
        "url": "https://www.reddit.com/r/LifeProTips/comments/11619s4/very_cheap_products_httpswwwshoplivegoodcomdf10/",
        "text": "",
        "created_utc": 1676780179,
        "upvote_ratio": 1.0
    },
    {
        "title": "Zk-Sync Expected Airdrop",
        "author": "skykid71",
        "url": "https://www.reddit.com/r/LifeProTips/comments/11615h9/zksync_expected_airdrop/",
        "text": "[removed]",
        "created_utc": 1676779790,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT: Never ask a professional to do any aspect of their work for free if you're a friend or family... offer to pay the usual rate. Chances are they will give you friends rates or or no-charge at all - crucially, they'll feel respected by you not trying to get a freebie.",
        "author": "Tooleater",
        "url": "https://www.reddit.com/r/LifeProTips/comments/115zt5g/lpt_never_ask_a_professional_to_do_any_aspect_of/",
        "text": "",
        "created_utc": 1676775628,
        "upvote_ratio": 1.0
    },
    {
        "title": "Tip for parents: If you have a kid, buy them a piece of furniture with a secret drawer or compartment. It represents maturity, trust, privacy, and (if you have them figure out how to open it) mechanical thinking.",
        "author": "D34th_gr1nd",
        "url": "https://www.reddit.com/r/LifeProTips/comments/115z9dm/tip_for_parents_if_you_have_a_kid_buy_them_a/",
        "text": "[removed]",
        "created_utc": 1676774007,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT: As soon as you get out of school, start accounts with the big banks in your area. You will be listed as a long time customer if you ever need their services.",
        "author": "gentlemannosh",
        "url": "https://www.reddit.com/r/LifeProTips/comments/115z2yf/lpt_as_soon_as_you_get_out_of_school_start/",
        "text": "There is no need to put a lot of money into the accounts, $10 or $20 dollars is enough, but when you are looking for a loan, they will see that you started your accounts with them 5, 10, 30 years ago.",
        "created_utc": 1676773496,
        "upvote_ratio": 1.0
    },
    {
        "title": "If your SO does something really good sexually, don’t ask where they learned it. Unless you are fully prepared to know and accept the answer.",
        "author": "AnAltAltAcct",
        "url": "https://www.reddit.com/r/LifeProTips/comments/115z0lc/if_your_so_does_something_really_good_sexually/",
        "text": "",
        "created_utc": 1676773310,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT- Buy a second set of sheets for when your first ones are dirty",
        "author": "zack9123",
        "url": "https://www.reddit.com/r/LifeProTips/comments/115yn5c/lpt_buy_a_second_set_of_sheets_for_when_your/",
        "text": "A buddy of mine(29m) told me about this hack so I thought I’d share. My second set just arrived from Amazon, about to try it out for myself!",
        "created_utc": 1676772290,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT: When waiting for a Customer Care email response, don't follow-up in the same thread",
        "author": "Few_Palpitation1181",
        "url": "https://www.reddit.com/r/LifeProTips/comments/115yhzg/lpt_when_waiting_for_a_customer_care_email/",
        "text": "Most customer care departments will sort and respond to emails from oldest to newest. \n\nReplying or forwarding within your existing thread causes it to be moved up into the more recent messages, effectively putting you at the back of the line all over again. Think of it kind of like waiting on hold with the bank too long so you hang-up and call back. Now you're at the back of the queue. \n\nIf you haven't received a response yet and are looking to follow up, send an entirely new message instead of replying to your initial email thread. If you're looking to keep a record of the message trail, copy and paste the previous messages below your new follow-up message and change the subject line slightly.\n\nI have worked in customer care for longer than I would like to admit and see this all the time. When people don't get a response within a day or two they keep replying to their existing email and moving themselves farther and farther up the list making their response time way longer than it needs to be by days or sometimes up to a week. Most of the time if they hadn't replied to their own message, we would have gotten back to them days earlier.",
        "created_utc": 1676771897,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT: Don't be the person that posts advice when you've never followed it yourself. Talk about things you've DONE, not things you've READ.",
        "author": "the_original_Retro",
        "url": "https://www.reddit.com/r/LifeProTips/comments/115y63s/lpt_dont_be_the_person_that_posts_advice_when/",
        "text": "There's just so many advice suggestions here, there and everywhere from people who have not \"walked the walk\".   \n\n\nTrained health professionals get a pass, they can not possibly have experienced every single thing that their patients have. But everyday people don't and shouldn't just read something somewhere, say \"Hey, that seems right\" and post here.   \n\n\nDon't be the ass that tries to give advice on something that you really have no good experience with.",
        "created_utc": 1676770942,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT request: How to negotiate with contract vendor?",
        "author": "smithhover789",
        "url": "https://www.reddit.com/r/LifeProTips/comments/115y07d/lpt_request_how_to_negotiate_with_contract_vendor/",
        "text": "[removed]",
        "created_utc": 1676770481,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT Online Traffic School",
        "author": "luckeegurrrl5683",
        "url": "https://www.reddit.com/r/LifeProTips/comments/115x3d2/lpt_online_traffic_school/",
        "text": "I had to do traffic school and found many websites. Look for one that has notes about the information. Take a screenshot of every page. Take the test and look at your screenshots. 100%!",
        "created_utc": 1676767785,
        "upvote_ratio": 1.0
    },
    {
        "title": "Traffic School Online",
        "author": "luckeegurrrl5683",
        "url": "https://www.reddit.com/r/LifeProTips/comments/115x187/traffic_school_online/",
        "text": "[removed]",
        "created_utc": 1676767609,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT/unclog motor oil from pores",
        "author": "Remote_Panic5967",
        "url": "https://www.reddit.com/r/LifeProTips/comments/115ws5a/lptunclog_motor_oil_from_pores/",
        "text": "[removed]",
        "created_utc": 1676766852,
        "upvote_ratio": 1.0
    },
    {
        "title": "Need a great pro tip",
        "author": "Remote_Panic5967",
        "url": "https://www.reddit.com/r/LifeProTips/comments/115wo0p/need_a_great_pro_tip/",
        "text": "[removed]",
        "created_utc": 1676766517,
        "upvote_ratio": 1.0
    },
    {
        "title": "l approached a girl today but didn’t ask for the number",
        "author": "Exciting_Freedom_870",
        "url": "https://www.reddit.com/r/LifeProTips/comments/115wi9y/l_approached_a_girl_today_but_didnt_ask_for_the/",
        "text": "[removed]",
        "created_utc": 1676766052,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT request To get fresh French fried every time, order fries with no salt.",
        "author": "cccyclotron",
        "url": "https://www.reddit.com/r/LifeProTips/comments/115wd34/lpt_request_to_get_fresh_french_fried_every_time/",
        "text": "They have to make a new batch for you. Add your own salt after!",
        "created_utc": 1676765644,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT If you apply to Walmart, don't select weekend days on your availability, otherwise you're likely to *never* get a weekend off.",
        "author": "cS150",
        "url": "https://www.reddit.com/r/LifeProTips/comments/115w8x1/lpt_if_you_apply_to_walmart_dont_select_weekend/",
        "text": "You'll likely always get 2 weekdays off, and not back to back. With the 2pm-11pm shift and the 1 hour lunch, it will make you feel like you're always there, longer than you are at home.",
        "created_utc": 1676765310,
        "upvote_ratio": 1.0
    },
    {
        "title": "Start an account early with half a dozen large banks",
        "author": "gentlemannosh",
        "url": "https://www.reddit.com/r/LifeProTips/comments/115vtbt/start_an_account_early_with_half_a_dozen_large/",
        "text": "[removed]",
        "created_utc": 1676764130,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT How's it possible to have free time when you work 9 hours, have a wife, and raise 5 kids? Seems to be a losing situation no matter what angle I look at it at.",
        "author": "nerub3821",
        "url": "https://www.reddit.com/r/LifeProTips/comments/115vpfa/lpt_hows_it_possible_to_have_free_time_when_you/",
        "text": "",
        "created_utc": 1676763833,
        "upvote_ratio": 1.0
    },
    {
        "title": "How's it possible to work 9 hours, have a wife, raise 5 kids. and still have free time? Seems to be a losing battle no matter which angle I look at it.",
        "author": "nerub3821",
        "url": "https://www.reddit.com/r/LifeProTips/comments/115vn5h/hows_it_possible_to_work_9_hours_have_a_wife/",
        "text": "",
        "created_utc": 1676763651,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT: People wail and scream when a loved one passes away. If death affects someone you know, understand. If death affects you, understand that it's natural to feel that way and let it out.",
        "author": "release_the_hound",
        "url": "https://www.reddit.com/r/LifeProTips/comments/115vf5v/lpt_people_wail_and_scream_when_a_loved_one/",
        "text": "",
        "created_utc": 1676763041,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT: Get your Pizza $’s worth! When ordering minus a Topping on Half, ask to have it added to the other Half or On the Side.",
        "author": "OverLurking",
        "url": "https://www.reddit.com/r/LifeProTips/comments/115v9d1/lpt_get_your_pizza_s_worth_when_ordering_minus_a/",
        "text": "They won’t subtract the minus from total cost so might as well get what you paid for",
        "created_utc": 1676762604,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT: don’t be shy to try low or no rating restaurants.",
        "author": "whennoww",
        "url": "https://www.reddit.com/r/LifeProTips/comments/115v8xq/lpt_dont_be_shy_to_try_low_or_no_rating/",
        "text": "[removed]",
        "created_utc": 1676762569,
        "upvote_ratio": 1.0
    },
    {
        "title": "People wail and scream when loved ones pass away. If a death affects someone you know, be prepared. If it's you, understand that it's natural and ok. Let it out. You Are Heard.",
        "author": "release_the_hound",
        "url": "https://www.reddit.com/r/LifeProTips/comments/115v8sp/people_wail_and_scream_when_loved_ones_pass_away/",
        "text": "",
        "created_utc": 1676762557,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT: Last of the Chips w/ Dip. When you get to the scraps at the end of the chip bag, use a fork/spoon in the dip first then collect shards in the bag.",
        "author": "OverLurking",
        "url": "https://www.reddit.com/r/LifeProTips/comments/115v6kk/lpt_last_of_the_chips_w_dip_when_you_get_to_the/",
        "text": "",
        "created_utc": 1676762391,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT request: How to feel more comfortable around people?",
        "author": "Such-Break2997",
        "url": "https://www.reddit.com/r/LifeProTips/comments/115v66p/lpt_request_how_to_feel_more_comfortable_around/",
        "text": "I have this feeling always when I’m surrounded by people.\n\nI feel so hated, I feel hating vibes from people… I feel that I’m not welcomed.\n\nI feel that no girl wanna date me and that people wish death or bad things to happen to me.\n\nI’m a normal person though and I’m kind and respectful to everyone.. Are these feelings true or is it just me? I feel them and I smell them in the air!",
        "created_utc": 1676762363,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT - Fueling your car in the US",
        "author": "LuckyGirl1003",
        "url": "https://www.reddit.com/r/LifeProTips/comments/115v444/lpt_fueling_your_car_in_the_us/",
        "text": "\nIf you were raised in the city or suburbs, here’s a gas station tip. Leave the pumps with the green hose vacant (usually they’re the pumps on either end of a gas station). \n\nTrucks that use diesel use the end pumps and waiting for cars to pump unleaded at those pumps is a pain when there are free pumps through the rest of the station. \n\nThanks for coming to my TED Talk…sponsored by my rancher father and me (while I sit and wait for the Mercury Marquis to gas up their car as my cow dog and I wait for a spot). 🐕",
        "created_utc": 1676762207,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT: Stay away from absolute terms when speaking.",
        "author": "whennoww",
        "url": "https://www.reddit.com/r/LifeProTips/comments/115v2lo/lpt_stay_away_from_absolute_terms_when_speaking/",
        "text": "[removed]",
        "created_utc": 1676762102,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT Request: How to prepare yourself for business trip that involves a lot of drinking?",
        "author": "Th3Sim0n",
        "url": "https://www.reddit.com/r/LifeProTips/comments/115uzpx/lpt_request_how_to_prepare_yourself_for_business/",
        "text": "We are having a business trip with our company and most, if not all, participants are drinkers and enjoy spending each evening in pub, having lots of booze. I also enjoy having a drink every now and then, but those guys like to have a bit more than usual and are kind of forcing you to drink too. If you refuse, they would most likely treat you like an \"outsider\" and it might hurt your relations with them. How can I prepare for such an event and how should I behave, not to be treated like an outcast? Dropping the job is not an option as I get paid very well in this company and aside from those trips all the relations are very good.",
        "created_utc": 1676761892,
        "upvote_ratio": 1.0
    },
    {
        "title": "LFP: On mobile you can double tap comments to updoot. Now you dont have to have finger strain trying to give someone sweet karma",
        "author": "FeederNguyen",
        "url": "https://www.reddit.com/r/LifeProTips/comments/115utb7/lfp_on_mobile_you_can_double_tap_comments_to/",
        "text": "",
        "created_utc": 1676761417,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT: have a roll of good quality double sided tape in your place. It solves lots of problems.",
        "author": "william-t-power",
        "url": "https://www.reddit.com/r/LifeProTips/comments/115un3t/lpt_have_a_roll_of_good_quality_double_sided_tape/",
        "text": "In my experience, most people don't have double sided tape available.  I do, and it's very useful.  For example: the Roku is a tiny device that moves easily and the remote stops working, double sided tape keeps it in place.  Have a cable with a switch on your desk?  Double sided tape will anchor it in one place.  Need basically anything to stay in place that easily moves?  Double sided tape is the answer. \n\nThe roll I have is strong but I can peel it off with no residue.  It's awesome!",
        "created_utc": 1676760972,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT: How to keep ice cream softer",
        "author": "Lalalalazolz",
        "url": "https://www.reddit.com/r/LifeProTips/comments/115un3z/lpt_how_to_keep_ice_cream_softer/",
        "text": "Store your ice cream container inside a grocery bag in the freezer to keep it softer for easier scooping.",
        "created_utc": 1676760972,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to keep ice cream soft",
        "author": "Lalalalazolz",
        "url": "https://www.reddit.com/r/LifeProTips/comments/115uiwe/how_to_keep_ice_cream_soft/",
        "text": "[removed]",
        "created_utc": 1676760672,
        "upvote_ratio": 1.0
    },
    {
        "title": "Don't invest in a videogame if you are going to have a baby. You won't have time until it reach 3 or 4 years.",
        "author": "Rodan-Lewarx",
        "url": "https://www.reddit.com/r/LifeProTips/comments/115u0zg/dont_invest_in_a_videogame_if_you_are_going_to/",
        "text": "",
        "created_utc": 1676759372,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT Beating reddit advertisements",
        "author": "ReefJames",
        "url": "https://www.reddit.com/r/LifeProTips/comments/115tm9w/lpt_beating_reddit_advertisements/",
        "text": "[removed]",
        "created_utc": 1676758336,
        "upvote_ratio": 1.0
    },
    {
        "title": "Tax season LPT for americans: FreeTaxUSA does the same thing as TurboTax etc but its free and endorsed by the IRS",
        "author": "techsuppr0t",
        "url": "https://www.reddit.com/r/LifeProTips/comments/115sr2x/tax_season_lpt_for_americans_freetaxusa_does_the/",
        "text": "[removed]",
        "created_utc": 1676756548,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT Request: How can you muddy the waters of your personal data (e.g. DOB, address, etc)?",
        "author": "eggmaker",
        "url": "https://www.reddit.com/r/LifeProTips/comments/115sp1z/lpt_request_how_can_you_muddy_the_waters_of_your/",
        "text": "I'd like to muddy the waters of my DOB and address when/if someone googles my name on the internet. Surely there are some viable ways to muddy the water that won't be detrimental when you do need to prove your identity.",
        "created_utc": 1676756459,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT Request: How do I know when to stop messaging?",
        "author": "Usmellnicebby",
        "url": "https://www.reddit.com/r/LifeProTips/comments/115smoo/lpt_request_how_do_i_know_when_to_stop_messaging/",
        "text": "I am very good at understanding body language and when to stop talking in person. Over text, I message too much, which might be a turn-off for some people. How can I adjust where I need to see signs of when to stop texting or when to keep texting?",
        "created_utc": 1676756352,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT: Thinking about a work problem while lying in bed is not constructive; you need that time to recharge your battery.",
        "author": "lostpassword2",
        "url": "https://www.reddit.com/r/LifeProTips/comments/115r094/lpt_thinking_about_a_work_problem_while_lying_in/",
        "text": "[removed]",
        "created_utc": 1676753897,
        "upvote_ratio": 1.0
    }
]