[
    {
        "title": "What is the one habit that had the most impact on your life?",
        "author": "Zhenchok",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10t73xe/what_is_the_one_habit_that_had_the_most_impact_on/",
        "text": "[removed]",
        "created_utc": 1675492319,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT: 1 Hour Scary Background Music for Studying | Scary Classical Instrumental Song for Writing &amp; Reading",
        "author": "MusicEnergiser",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10t6hw8/lpt_1_hour_scary_background_music_for_studying/",
        "text": "[removed]",
        "created_utc": 1675490181,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT Request: What is the best way to wash white canvas shoes?",
        "author": "dontletmedaytrade",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10t6baq/lpt_request_what_is_the_best_way_to_wash_white/",
        "text": "",
        "created_utc": 1675489521,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is the best way to wash white canvas shoes?",
        "author": "dontletmedaytrade",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10t6an2/what_is_the_best_way_to_wash_white_canvas_shoes/",
        "text": "",
        "created_utc": 1675489455,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT Request: What should I do to calm down lost pets and coax them to safety?",
        "author": "chiiave",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10t69xs/lpt_request_what_should_i_do_to_calm_down_lost/",
        "text": "Hi folks,\n\nI live in an area where pets get lost very frequently.  The neighborhoods around me are majority senior living and assisted living facilities and 55+ communities. \n\nI often come across lost pets, mostly dogs and the occasional cat, and have about a 50/50 success rate at catching them. I use to volunteer at animal shelters so I know a lot about animal handling, but not in an uncontrolled environment. It depends a lot on the temperament and the situation. \n\nThese pets I come across are very blatantly loved - collars and well-groomed coats, and usually on the chunkier side. Tonight I came across a beautiful pup on my way home. He was full sprinting down the street, and I tried following slowly in my car and then on foot once I realized that freaked him out even more. I tried calming him down by crouching to his level and gently talking to and encouraging him, but nothing helped. He kept looking back, stopping for a moment, and then sprinted again. I attempted to earn his trust and get close enough to him as possible for about 20 minutes when someone revved their engine on the road over and he bolted.  Poor pup rounded a corner and was gone, I couldn't find him for the life of me. \n\nAfter another 15 minutes of searching under cars and in bushes in the dark, I went home. I can't stop crying because I truly wanted to help this animal, but I had nothing around me that could have helped in this situation. \n\nShould I keep certain items in my car? I'm thinking of a loop leash and treats, but obviously there's more to it than that. Is there certain body language and techniques I should follow? I felt so helpless tonight and I want to do my best to help these animals the best i can. \n\nThank you in advance",
        "created_utc": 1675489383,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT: For musical explorers. Music services make playlists for music festivals. Hit random, enjoy. Especially for festivals you cant make.",
        "author": "savethenaugs",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10t5w96/lpt_for_musical_explorers_music_services_make/",
        "text": "",
        "created_utc": 1675488061,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT: If you have a common insecurity (weight, acne, etc.), look into what causes it",
        "author": "jadeeyedcalico",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10t5jws/lpt_if_you_have_a_common_insecurity_weight_acne/",
        "text": "If you were to search \"weight loss,\" you would be bombarded with scams that say \"lose x amount in just one week!\" or similar potions and patterns that either don't work or aren't sustainable. To avoid this, it's important to understand *why* the problem is there. With acne, for example, it is typically caused by skin being too dry or too oily. You can then try to determine which category you fall into, and look into specific treatments from there. You may still encounter some scams or faulty products, but you're far more likely to find an actual solution.",
        "created_utc": 1675486876,
        "upvote_ratio": 1.0
    },
    {
        "title": "If you have a common insecurity (weight, acne, etc.) look into what causes it",
        "author": "jadeeyedcalico",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10t5in8/if_you_have_a_common_insecurity_weight_acne_etc/",
        "text": "[removed]",
        "created_utc": 1675486798,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT: If you want to stop and help after witnessing a motor vehicle accident, move your vehicle past the accident before you get out to help.",
        "author": "helaaspk",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10t55rg/lpt_if_you_want_to_stop_and_help_after_witnessing/",
        "text": "Why an LPT: If you don't pass the accident before getting out to help, you will be stuck behind the accident once you go to leave. If you are ahead of it, you should be able to pull away without being blocked.",
        "created_utc": 1675485591,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT: problems with big sweaty male privates leaving marks and generally uncomfortable - use female pads",
        "author": "metadataisnotreal",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10t4l2i/lpt_problems_with_big_sweaty_male_privates/",
        "text": "It's really absorvant, readily available and discreet.",
        "created_utc": 1675483735,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do I get rid of the extra baking soda that is now all over the bottom of my dishwasher and on the dishes I clean?",
        "author": "Terrible-Duck-6949",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10t4bw8/how_do_i_get_rid_of_the_extra_baking_soda_that_is/",
        "text": "[removed]",
        "created_utc": 1675482946,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT: what to say when someone’s having a bad day or having a panic attack",
        "author": "5nixxx",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10t3jbf/lpt_what_to_say_when_someones_having_a_bad_day_or/",
        "text": "All you need to do is ask one simple question “Do you want to rant to me, or do you want me to give you advice” \n\n\nEasy as you like will help people (from my experience anyway)",
        "created_utc": 1675480492,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT: Call your credit card company and say you lost your card every 6 months.",
        "author": "thejedipokewizard",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10t38as/lpt_call_your_credit_card_company_and_say_you/",
        "text": "It’ll weed out all of those sneaky monthly subscriptions on your card and you can choose what your really need.",
        "created_utc": 1675479568,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT: Make sure to become friends with your elders, and treat them with utmost respect. They can and are willing to teach you light-years of advice to advance you forward, in exchange for your young fresh knowledge/services.",
        "author": "PillboPackins",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10t2ynr/lpt_make_sure_to_become_friends_with_your_elders/",
        "text": "Older folks want to be friends with us younger folks, I'm 27, and just met a 93 year old man who happens to own my entire company, and I've been hired by him on a house call to fix the computer, as all privileges have been lowered to a point that remotely, I could not obtain administrative access with a 93 year old man, they do not understand tech lingo, and that's OK, because that's what I'm there for, made my plan, executed it with the utmost respect and precision to where he didnt get confused, and now, I've already been promised a substantial raise, bonus, promotion, and my own fucking office, for offering to fix the damn thing on my own time, when all my coworkers say \"not my problem\". I guarantee over time I'm gonna absorb so much life advice wisdom from this dude it'll be insane, we're friends and business partners, I'm his personal consultant, and now I'm my bosses new boss 😎, it was apparent to him that I know my shit. Be friends with old people, and they will help you in ways you can never imagine, especially the rich old businessesman who doesn't know a damn thing about computers, but knows a hell of a lot of business sense and life advice, aka wisdom. Mutually beneficial exchange of services and knowledge, I consider that payment enough, but continue getting Benjamin's slipped to me under-the-table. Old people are amazing, especially the smart ones that still have the mental fortitude.",
        "created_utc": 1675478732,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT: when selecting text with your keyboard arrows, use Ctrl+arrows to move to the next or previous word, use Shift+arrows to highlight text one letter at a time, and Ctrl+Shift+arrows to highlight full words at a time.",
        "author": "23eulogy25",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10t2odu/lpt_when_selecting_text_with_your_keyboard_arrows/",
        "text": "",
        "created_utc": 1675477853,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT: you can use ChatGPT to help you prepare for job interviews",
        "author": "steezasaurus69",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10t2lnc/lpt_you_can_use_chatgpt_to_help_you_prepare_for/",
        "text": "Last week, I had an interview and realized that chatGPT may be able to help. I’m not the best at wording professional responses but I had the barebone bullet points for what I wanted to talk about. Therefor, I typed in something like:\n\nWrite a job interview response to the question “tell me about yourself” that uses the following points:\n\nThen I would list 5-10 things that summed up my recent career experience. It generated some very well worded responses that I could in turn generate back into bullet points to look at while responding in the interview. And this worked for every typical interview question without a hitch. Give it a try to get ahead of your job applicant competition!",
        "created_utc": 1675477630,
        "upvote_ratio": 1.0
    },
    {
        "title": "Men, if you’re going to walk a girl home from a group gathering, do things to make her feel as safe as possible.",
        "author": "pommedeterredors",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10t2hbm/men_if_youre_going_to_walk_a_girl_home_from_a/",
        "text": "[removed]",
        "created_utc": 1675477263,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT: Keep a change of clothes in your vehicle",
        "author": "VinceBrogan8",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10t27ch/lpt_keep_a_change_of_clothes_in_your_vehicle/",
        "text": "Your 'Trunk Bag' depends on what your day-to-day life is, and the bag should be the opposite. \n\n* If your daily life is as a suit or dress person, then have a set of crappy clothes in the bag in the event you have to get dirty\n* If you get dirty for a living, have a nice set of clothes in case you have to go to an event that requires nicer attire\n\nI'm well above average in height, so running into the local Kohl's or TJ Maxx last minute isn't an option. I keep a nice change of clothes available, as I can't count the number of times I've been away from home and get invited to an upscale event",
        "created_utc": 1675476457,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT: Library cards have multiple uses",
        "author": "SrCouchSpecialist",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10t26nm/lpt_library_cards_have_multiple_uses/",
        "text": "Now I haven’t dug into exactly EVERYTHING you can do with a library card, but aside from checking books out, here are my favorite perks:\n\nHoopla: A streaming service where you can view/borrow music, ebooks, movies, among other things. The movie collection is obviously impressive, and it’s completely free with a library card, which you can get 100% free at your local public library. I’ve been able to eliminate Netflix from my spending because of this.\n\nEducate yourself: Lynda courses on LinkedIn are completely free with a library card. I’ve taken random courses in business already, with no plans to slow down.\n\nVisit museums: I wasn’t going to make a separate bullet for this one, but I am a huge (!) museum lover, and most museums in the North Eastern US have accepted my library card for free entry. (Bonus perk: I get into my local zoo with it as well!)\n\nMeet new people and learn new things: this one is pretty cliche but I could not omit it from the post. I’ve met wonderful friends at my library that help tutor the locals, and host craft nights, etc. I rarely attend these as my schedule is usually pretty packed, but these are great resources for our children.\n\nGet out there and get that library card! It’s free, and there’s so many more places and websites that accept it than you think.",
        "created_utc": 1675476401,
        "upvote_ratio": 1.0
    },
    {
        "title": "For musical explorers. Music services make playlists for music festivals. Hit random, enjoy. Especially for festivals you cant make.",
        "author": "savethenaugs",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10t20zs/for_musical_explorers_music_services_make/",
        "text": "",
        "created_utc": 1675475967,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT: Put a decent set of jumper cables and a tow rope in all of your vehicles..",
        "author": "Biteysdad2",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10t1tgh/lpt_put_a_decent_set_of_jumper_cables_and_a_tow/",
        "text": "People are generally willing to help but aren't always equipped for your situation.",
        "created_utc": 1675475363,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT: Don’t take financial advice from Redditors.",
        "author": "John-Crimson",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10t1qjd/lpt_dont_take_financial_advice_from_redditors/",
        "text": "",
        "created_utc": 1675475129,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT: ran out of black ink, how to print?",
        "author": "Akashh23_pop",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10t18h9/lpt_ran_out_of_black_ink_how_to_print/",
        "text": "I have old printer that's HP touchscreen but I ran out of black ink and I never installed color ink. How can I print? Do I have to buy a new ink?",
        "created_utc": 1675473665,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT request: How to repair luggage wheels, what is the approach?",
        "author": "Vegeta543",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10t142b/lpt_request_how_to_repair_luggage_wheels_what_is/",
        "text": "[removed]",
        "created_utc": 1675473317,
        "upvote_ratio": 1.0
    },
    {
        "title": "Instead of food, take an out to eat gift card to your friend/loved one who recently suffered a loss.",
        "author": "AskTheRealQuestion81",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10t1111/instead_of_food_take_an_out_to_eat_gift_card_to/",
        "text": "[removed]",
        "created_utc": 1675473070,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT: CUT MOST OF YOUR COLLEGE OUT BEFORE YOU GO.",
        "author": "lancelah",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10t0yqm/lpt_cut_most_of_your_college_out_before_you_go/",
        "text": "[removed]",
        "created_utc": 1675472889,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT: Use this tool to make transferring files from your Phone to PC so much easier",
        "author": "reflp",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10t0wo2/lpt_use_this_tool_to_make_transferring_files_from/",
        "text": "[removed]",
        "created_utc": 1675472728,
        "upvote_ratio": 1.0
    },
    {
        "title": "Life Pro Tip: Always find yourself using Google Drive or emails to get photos to your phone from your windows PC and vice versa?",
        "author": "reflp",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10t0vsf/life_pro_tip_always_find_yourself_using_google/",
        "text": "[removed]",
        "created_utc": 1675472658,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT: Bring an empty water bottle with you in case you need to pee but can't find a toilet.",
        "author": "feb2023project",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10t0e0x/lpt_bring_an_empty_water_bottle_with_you_in_case/",
        "text": "[removed]",
        "created_utc": 1675471265,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT: For pet parente, save the nearest 24-hour emergency vet as a 'saved places' on Uber so you can use Uber Pet in case of emergencies.",
        "author": "mightyhorrorshow",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10t024w/lpt_for_pet_parente_save_the_nearest_24hour/",
        "text": "If Uber Pet isn't available in your area you can contact your Uber (or Lyft) driver to see if they'd be able to transport your pet.  Uber does recommend bringing a towel or something to cover the seat, and they mention there could be a cleaning fee. \n\nI have my dogs primary vet, physical therapist, neurologist and the nearest emergency vet saved to Uber if I'm unable to drive and to Google Maps if I'm able to drive.\n\nBeing prepared is one of the best ways to cope ahead and remain calm in a stressful situation.",
        "created_utc": 1675470337,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT: Traveling without your car and need a way to get around town? Rent a U-HAUL Van! The rates are much cheaper than a Hertz rental! (Mileage rates vary)",
        "author": "PapayaHoney",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10sz4b4/lpt_traveling_without_your_car_and_need_a_way_to/",
        "text": "",
        "created_utc": 1675467842,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT request: How can I be more quiet as an upstairs neighbor?",
        "author": "The_One-n-Only_Zmall",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10sz07z/lpt_request_how_can_i_be_more_quiet_as_an/",
        "text": "The situation is as follows. We just moved into a new apartment and the landlord lives right under us. Because they are really nice and we don't want any trouble we want to keep it down. Are there any options which prevent noise to the lower apartment? First thoughts were carpet or house shoes",
        "created_utc": 1675467528,
        "upvote_ratio": 1.0
    },
    {
        "title": "Crap Insurance, any tips?",
        "author": "bsobi",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10sykah/crap_insurance_any_tips/",
        "text": "[removed]",
        "created_utc": 1675466386,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT Save the beer!",
        "author": "aDrunkSailor82",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10sy8wm/lpt_save_the_beer/",
        "text": "It's cold in the north right now so my beer stash is outside on the porch.  I noticed that the cans sides were very easy to compress when I grabbed one, meaning the temperature of the beer inside was below freezing, and it would turn to ice as soon as I popped the top.  \n\nI saved it by giving it a little tap water bath to raise the temperature for 45 seconds before opening.\n\nIf your beer (or carbonated whatever) is somewhere very cold, give it a little squeeze to make sure it doesn't freeze.",
        "created_utc": 1675465567,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT: Call your insurance agency (car) ask them what your insurance rating is (lexisnexxis score) running it may be able to lower your premium. Especially if your credit rating has improved",
        "author": "Alexxdlr",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10sy7v3/lpt_call_your_insurance_agency_car_ask_them_what/",
        "text": "",
        "created_utc": 1675465495,
        "upvote_ratio": 1.0
    },
    {
        "title": "Save the beer!",
        "author": "aDrunkSailor82",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10sy79n/save_the_beer/",
        "text": "[removed]",
        "created_utc": 1675465451,
        "upvote_ratio": 1.0
    },
    {
        "title": "Dignity",
        "author": "Icemannvc",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10sy3b6/dignity/",
        "text": "[removed]",
        "created_utc": 1675465198,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT: Don’t cheat on your hair stylist",
        "author": "spectatingumbrella",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10sy05h/lpt_dont_cheat_on_your_hair_stylist/",
        "text": "Lesson learned.",
        "created_utc": 1675464973,
        "upvote_ratio": 1.0
    },
    {
        "title": "Do not cheat on your hair stylist",
        "author": "spectatingumbrella",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10sxzjq/do_not_cheat_on_your_hair_stylist/",
        "text": "[removed]",
        "created_utc": 1675464932,
        "upvote_ratio": 1.0
    },
    {
        "title": "THC cleanse",
        "author": "Blackfoot-1492",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10sxhyv/thc_cleanse/",
        "text": "[removed]",
        "created_utc": 1675463712,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT: Reddit Pro Tip for finding the right furniture for you.",
        "author": "OlleyfromIndi",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10sxcja/lpt_reddit_pro_tip_for_finding_the_right/",
        "text": "[removed]",
        "created_utc": 1675463351,
        "upvote_ratio": 1.0
    },
    {
        "title": "A pot will boil faster if you center it on the burner",
        "author": "Litterboxbonanza",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10sxcat/a_pot_will_boil_faster_if_you_center_it_on_the/",
        "text": "",
        "created_utc": 1675463334,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT: Practice doesn’t make perfect, it simply reinforces the thing your are doing repeatedly. If you are aiming for perfection, try to strive for continual improvement of your actions.",
        "author": "wandrlusty",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10sx5o8/lpt_practice_doesnt_make_perfect_it_simply/",
        "text": "",
        "created_utc": 1675462886,
        "upvote_ratio": 1.0
    },
    {
        "title": "Always Accept Free Installation",
        "author": "dlinders10",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10swrzq/always_accept_free_installation/",
        "text": "[removed]",
        "created_utc": 1675461979,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT request: Car insurance dispute",
        "author": "HelloThereBrotha",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10swjqx/lpt_request_car_insurance_dispute/",
        "text": "My brother is irresponsible, very inattentive to finances and bills, has everything on reoccurring payments and forgets about it. He was thinking about buying a car 2 years ago, negotiations on the price went through but for some reason he already purchased insurance for the vehicle. He just found out that he’s been paying $300/month and has paid 8k already. Any chance he gets his money back? The vehicle was never bought by him nor was it on any title associated with him whatsoever. Someone else is probably already driving the thing and bought some other insurance on it. I don’t know where else to ask.",
        "created_utc": 1675461444,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT: Make your socks last longer but cutting your toe nails regularly and loosening your socks from the toes after putting them on",
        "author": "hamzie11",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10swb74/lpt_make_your_socks_last_longer_but_cutting_your/",
        "text": "Delays the toe holes from forming particularly with the cloth fibers not being stretched over the toes",
        "created_utc": 1675460868,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT: If you have a substantial amount of money in a bank account right now (&gt;$5,000) you should check your account’s APY",
        "author": "Ninder975",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10svzxg/lpt_if_you_have_a_substantial_amount_of_money_in/",
        "text": "With the federal lending rate as high as it is right now, some banks are offering as much as 4% APY (Annual Percentage Yield). This is the interest you get from the bank for keeping your money there. On $5,000, a 4% APY is $200 a year. While this may not be a lot of money, if your current bank account is only offering 1% APY (and many accounts still are), you can get $150 a year just for switching banks. Of course, this is using $5,000 as an example, the more you have, the more you get!",
        "created_utc": 1675460119,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT request: How to create balance in your life \"all or nothing\" person!",
        "author": "thelastbanana1",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10svmqo/lpt_request_how_to_create_balance_in_your_life/",
        "text": "[removed]",
        "created_utc": 1675459247,
        "upvote_ratio": 1.0
    },
    {
        "title": "Quitting current job while on Short Term Disability for new job (British Columbia - Canada)",
        "author": "psoddy",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10svi8g/quitting_current_job_while_on_short_term/",
        "text": "[removed]",
        "created_utc": 1675458939,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT: Never steal from estrogen lab because I stole and the polike came to my home",
        "author": "Najimifan",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10svg1p/lpt_never_steal_from_estrogen_lab_because_i_stole/",
        "text": "",
        "created_utc": 1675458802,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT: In a power outage, if you need to charge your cellphone, you can use your laptop as a powerbank",
        "author": "SauloJr",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10svdv6/lpt_in_a_power_outage_if_you_need_to_charge_your/",
        "text": "",
        "created_utc": 1675458655,
        "upvote_ratio": 1.0
    },
    {
        "title": "If you have a substantial amount of savings right now (&gt;$5,000) in a bank account, you should check your APY",
        "author": "Ninder975",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10sv9qe/if_you_have_a_substantial_amount_of_savings_right/",
        "text": "[removed]",
        "created_utc": 1675458377,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT Job-winning Resume and Cover Letter For You! 🚀",
        "author": "jack_bolton39",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10sv2t5/lpt_jobwinning_resume_and_cover_letter_for_you/",
        "text": "[removed]",
        "created_utc": 1675457941,
        "upvote_ratio": 1.0
    },
    {
        "title": "[LPT] Job-winning Resume and Cover Letter For You! 🚀",
        "author": "jack_bolton39",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10sv1m1/lpt_jobwinning_resume_and_cover_letter_for_you/",
        "text": "[removed]",
        "created_utc": 1675457859,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT: When you need to do your business, line the inside of the toilet bowl with a few squares of toilet paper first. Not only will your poop flush cleanly, but you'll also leave the bowl spotless.",
        "author": "lovelybliss",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10sv0se/lpt_when_you_need_to_do_your_business_line_the/",
        "text": "",
        "created_utc": 1675457805,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT: trying to reset your sleep schedule to wake up early? instead of going to sleep late and then try to wake up early, which is hard, stay awake for a few more hours, your schedule will shift forward in a few hours. because you wake up later, you'll also be tired later. 3-4 nights and you're set",
        "author": "amplez_amplez",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10su8pv/lpt_trying_to_reset_your_sleep_schedule_to_wake/",
        "text": "",
        "created_utc": 1675455898,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT request: What would you do if you were stuck in a house with a schizophrenic person?",
        "author": "RaspberryTechnical90",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10su0wq/lpt_request_what_would_you_do_if_you_were_stuck/",
        "text": "This person is very kind, and I mean no disrespect by this post…I simply want advice on how to best navigate the situation and make the best of things for us both.\n\nBasically, I’m pet sitting for a very old man with some issues. I was unaware until I arrived that his schizophrenic wife would be here this weekend. She has been very sweet to me so far, but VERY angry when talking to her hallucinations. \n\nHow the hell would you guys manage this? I want to help this family out, but I have no experience with schizophrenia, and I’m a little nervous.",
        "created_utc": 1675455376,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT: Ask your partners what makes them feel loved and cared for. Write it down. Keep that list handy and try to do as many of those things as possible. Periodically, ask them if they have anything new to add to that list and update it as needed.",
        "author": "EtOHMartini",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10sttjh/lpt_ask_your_partners_what_makes_them_feel_loved/",
        "text": "[removed]",
        "created_utc": 1675454890,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT: The easiest way to check if an email is a phishing scam is by viewing \"message source\" then Ctrl+F \"From:\" (without quotation marks) and look for the sender's email.",
        "author": "Abad_Cal_Gawayam",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10sto3x/lpt_the_easiest_way_to_check_if_an_email_is_a/",
        "text": "I just got a totally legit email from Coinbase asking me to verify my ID for security reasons and when I checked the sender's address in the message source (look up how to do it because each email provider has a different way of checking, but more often than not, you can simply right click on the email message and the option is there), it was an email from this domain: se7rek.net\n\nWhich points to some Arabic website. Nice try Al-Qaeda. You're not getting my $90 worth of crypto.",
        "created_utc": 1675454520,
        "upvote_ratio": 1.0
    },
    {
        "title": "Parent passed",
        "author": "sunnyflow2",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10st375/parent_passed/",
        "text": "[removed]",
        "created_utc": 1675453074,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT: Trying to reset your sleep schedule to a one aligning with the sun? don't try to wake up early, try to stay awake for longer. you'll wake up at the evening, then at night, and after 3 days you're waking up with the sun.",
        "author": "amplez_amplez",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10ssohv/lpt_trying_to_reset_your_sleep_schedule_to_a_one/",
        "text": "",
        "created_utc": 1675452056,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT: if you have a finger or toe swelling into a ring go to the fire department, they’ll cut it off for you.",
        "author": "gothiclg",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10sso8r/lpt_if_you_have_a_finger_or_toe_swelling_into_a/",
        "text": "In the USA this is even a free service. They’ll have 0 issues helping you out. My mom was the local “time to cut a ring off” lady because she took herself and multiple neighbors to our local fire station to have a ring cut off, saving a finger or a toe.",
        "created_utc": 1675452037,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT: Fun fact: people will read your comments if you start with \"fun fact\"",
        "author": "Rod_cts",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10ssi5o/lpt_fun_fact_people_will_read_your_comments_if/",
        "text": "",
        "created_utc": 1675451627,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT request - financial advisor",
        "author": "robster1112",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10ssfv8/lpt_request_financial_advisor/",
        "text": "\n\nWhat are some things that I can do as a 17 year old to sell myself up for financial stability once I turn eighteen and later on in life?",
        "created_utc": 1675451460,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT request:",
        "author": "robster1112",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10ssej9/lpt_request/",
        "text": "[removed]",
        "created_utc": 1675451376,
        "upvote_ratio": 1.0
    },
    {
        "title": "Financial stability",
        "author": "robster1112",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10ssdwf/financial_stability/",
        "text": "[removed]",
        "created_utc": 1675451331,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT: when you are figuring out the cost of getting a pet, make sure to consider the cost of care during the day if your circumstances change and you can't care for the pet during the day because of a new job, change in work/school schedule, etc.",
        "author": "thetearinsound",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10ssd22/lpt_when_you_are_figuring_out_the_cost_of_getting/",
        "text": "Case in point, when I adopted my dog, I was working at an office that allowed me to bring him to work everyday. Fast forward 3 years, and I took a different job where I couldn't bring him to work and I had to hire a pet sitter to take him for a walk at lunch time while I was working. This created a big difference in how much money I had to allocate each month to pet expenses. Dog walk at $25 per walk, 5 walks a week = $500 a month just on a pet sitter.",
        "created_utc": 1675451274,
        "upvote_ratio": 1.0
    },
    {
        "title": "When considering getting a dog or other pet that requires care during the day, make sure you factor in the cost of a petsitter for your budget. It's a good idea to do this even if you currently don't need a pet sitter, because your circumstances might change.",
        "author": "thetearinsound",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10ss8vi/when_considering_getting_a_dog_or_other_pet_that/",
        "text": "[removed]",
        "created_utc": 1675450991,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT: When cleaning the toilet, make sure to clean UNDER the toilet lid cover.",
        "author": "marshspice22",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10ss4rh/lpt_when_cleaning_the_toilet_make_sure_to_clean/",
        "text": "[removed]",
        "created_utc": 1675450741,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT: Don't kill yourself. Kill your Ego. Stop comparing how you see yourself to how you think other people see you, and start comparing yourself to your Ideal Self. Appreciate what you DO have and living authentically will be more satisfying.",
        "author": "FOlahey",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10sr5yo/lpt_dont_kill_yourself_kill_your_ego_stop/",
        "text": "When life is getting really hard and reality sucks, bad thoughts come to mind.\n\nThose bad thoughts are your Ego getting hurt, but your Ego is only one part of you. You are feeling protective of the only thing that still privately makes you unique. Stop unconsciously or consciously assuming Personas or Masks around other people. Let other people see who you truly are, so they can feel comfortable doing the same thing.\n\nInstead of comparing yourself against how you think that other people view you (external self-awareness), start comparing yourself to an ideal version of you (inner self-awareness). Then when you start feeling inner monologue it is because you will be out-of-sync with your goals in life, not feel like you do not belong in this world.  \n\nInstead of identifying yourself as your occupation or social engagements, try identifying you by what makes you unique: what are you interested in? what do you like to learn about? what do you like to create? do you care about other people? can you empathize well with others?",
        "created_utc": 1675448307,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT: you may be able to temporarily cure tinnitus by placing your hands over your ears and drumming your fingers on the back of your head",
        "author": "sunsongdreamer",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10sqnhc/lpt_you_may_be_able_to_temporarily_cure_tinnitus/",
        "text": "[removed]",
        "created_utc": 1675447077,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT request: how to completely clear personal account and data from google chrome on a work laptop?",
        "author": "DJBeckyBecs",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10sqkv8/lpt_request_how_to_completely_clear_personal/",
        "text": "[removed]",
        "created_utc": 1675446896,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT : Tear paper towels from the bottom up when dispensed vertically",
        "author": "BuddyHemphill",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10sq7vz/lpt_tear_paper_towels_from_the_bottom_up_when/",
        "text": "Somehow this prevents an incomplete tear off from the perforation. Not sure how exactly. Top down tearing almost always leaves a little corner at the bottom that doesn't tear off.",
        "created_utc": 1675445997,
        "upvote_ratio": 1.0
    },
    {
        "title": "To have an argument, there must first be an opponent; don't be the opponent!",
        "author": "Mr-Garrison",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10sq6v6/to_have_an_argument_there_must_first_be_an/",
        "text": "",
        "created_utc": 1675445926,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT: List of quality of life Purchases made by chatGPT + Reddit",
        "author": "Mythic_in_games",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10sptb3/lpt_list_of_quality_of_life_purchases_made_by/",
        "text": "[removed]",
        "created_utc": 1675444995,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT BAGELS",
        "author": "CallMeZiipy",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10spsll/lpt_bagels/",
        "text": "[removed]",
        "created_utc": 1675444945,
        "upvote_ratio": 1.0
    },
    {
        "title": "My Parents are Poor How can I Make Money?",
        "author": "Lolipop-kitkat",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10spl67/my_parents_are_poor_how_can_i_make_money/",
        "text": "[removed]",
        "created_utc": 1675444439,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT: drinking fountains swivel for bottle filling",
        "author": "beeeeeeeaaaaaaan",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10spcle/lpt_drinking_fountains_swivel_for_bottle_filling/",
        "text": "The spigot of drinking fountains often spin around, allowing you to fill a water bottle. No need for anymore half-filled bottles because of the angle of the water flow.",
        "created_utc": 1675443859,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT: The active ingredient in Head &amp; Shoulders (zinc pyrithione) is antifungal, antimocrobial, and antibacterial.",
        "author": "barukspinoza",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10sohbn/lpt_the_active_ingredient_in_head_shoulders_zinc/",
        "text": "Why this is a LPT, if you have a yeast infection on your body (only externally) washing with Head &amp; Shoulders will remedy this. There is also a type of body acne that is due to a fungal infection so if you have body acne it may help that as well. \n\nIf you are larger, sweatier, or hairier you probably have had a yeast infection in folds or other areas. No embarrassing doctors visits, expensive creams, or weird smells.",
        "created_utc": 1675441737,
        "upvote_ratio": 1.0
    },
    {
        "title": "If you’re driving behind someone at night",
        "author": "tedyesca",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10sog29/if_youre_driving_behind_someone_at_night/",
        "text": "[removed]",
        "created_utc": 1675441647,
        "upvote_ratio": 1.0
    },
    {
        "title": "Gas or Kerosene Heater?",
        "author": "The_Trade_Table",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10so8so/gas_or_kerosene_heater/",
        "text": "[removed]",
        "created_utc": 1675441147,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT Request: How do I decline this invitation?",
        "author": "berriesday",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10so061/lpt_request_how_do_i_decline_this_invitation/",
        "text": "My friend asked me if I'll be free tomorrow morning and I said yes.\n\nThen she invited me to eat together at my other friend's house because she has cakes and pudding to share with us. I am not comfortable meeting my other friend, but since I already said I will not be going anywhere tomorrow now I don't know how to politely turn it down without being so obvious that I just don't want to go. I feel bad because I know she means well as far as wanting to meet and share food with us.",
        "created_utc": 1675440564,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT Request: How do I turn down this invitation?",
        "author": "berriesday",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10snzej/lpt_request_how_do_i_turn_down_this_invitation/",
        "text": "My friend asked me if I'll be free tomorrow morning and I said yes.\n\nThen she invited me to eat together at my other friend's house because she has cakes and pudding to share with us. I am not comfortable meeting my other friend, but since I already said I will not be going anywhere tomorrow now I don't know how to politely turn it down without being so obvious that I just don't want to go. I feel bad because I know she means well as far as wanting to meet and share food with us.",
        "created_utc": 1675440509,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT: Buy short jars of peanut butter so you can reach your finger to the bottom without getting peanut butter on the rest of your hand.",
        "author": "Solid-Cod8402",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10snz5y/lpt_buy_short_jars_of_peanut_butter_so_you_can/",
        "text": "Inspired by last week’s LPT to not stir your coffee and save washing a spoon.",
        "created_utc": 1675440494,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT: Regardless of how righteous you think your point is, if your post on Reddit is meant to shoot down someone else's ideas, appearance, lifestyle, politics, etc., you are part of the problem that's destroying peace in the world.",
        "author": "Darnitol1",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10snu7m/lpt_regardless_of_how_righteous_you_think_your/",
        "text": "[removed]",
        "created_utc": 1675440170,
        "upvote_ratio": 1.0
    },
    {
        "title": "Regardless of how righteous you think your point is, if your post on Reddit is meant to shoot down someone else's ideas, appearance, lifestyle, politics, etc., you are part of the problem that's destroying peace in the world.",
        "author": "Darnitol1",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10snmy2/regardless_of_how_righteous_you_think_your_point/",
        "text": "[removed]",
        "created_utc": 1675439698,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT: Getting a new internet router isn’t as big of a problem as most people think. Just change the network name and password to match your old router and everything will connect to the new router.",
        "author": "prolurkerest2012",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10snmsy/lpt_getting_a_new_internet_router_isnt_as_big_of/",
        "text": "",
        "created_utc": 1675439686,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT: Waffle weave microfiber towels give you an easy, streak free clean on car glass, mirrors, and most other glass or stainless surfaces.",
        "author": "77ZZ77ZZ7",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10snipt/lpt_waffle_weave_microfiber_towels_give_you_an/",
        "text": "Good quality waffle weave towels pick up dirt and grime very well, don't leave lint or fibers, and are lower friction than a standard cloth when you are wiping smooth surfaces.  They are also available in a big selection of sizes for different applications, and they aren't overly expensive.  No more fibers from high pile towels or bits of paper towel on your mirrors and windows.\n\nCaveat: You have to wash them properly to maintain their absorbency.  Cold water, light on detergent, no fabric softeners and as little heat as possible when drying.",
        "created_utc": 1675439403,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT If the YouTube Live stream you're watching is lagging behind because you joined late, increase the speed to 1.25x or 1.5x. It'll eventually catch up and playback speed will automatically reset to 1x.",
        "author": "hronak",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10snga7/lpt_if_the_youtube_live_stream_youre_watching_is/",
        "text": "",
        "created_utc": 1675439229,
        "upvote_ratio": 1.0
    },
    {
        "title": "Renting tips",
        "author": "Positive-Rich255",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10snedg/renting_tips/",
        "text": "[removed]",
        "created_utc": 1675439094,
        "upvote_ratio": 1.0
    },
    {
        "title": "LTP If the YouTube Live stream you're watching is lagging behind because you joined late, increase the speed to 1.25x or 1.5x. It'll eventually catch up and playback speed will automatically reset to 1x.",
        "author": "hronak",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10sncl9/ltp_if_the_youtube_live_stream_youre_watching_is/",
        "text": "",
        "created_utc": 1675438966,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT Bi-Weekly Mortgage Payments",
        "author": "tomlapse",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10sn6cq/lpt_biweekly_mortgage_payments/",
        "text": " \n\nThis may seem like common sense to some, but after living in my house for almost 4 years now, I just realized that my mortgage company offers an automatic **bi-weekly** mortgage payment option. I always found myself having to pay my entire mortgage and daycare bill out of the same paycheck, which would leave me with next to nothing to get by for two weeks. Well, by doing the bi-weekly payment option, I cut my mortgage payment in half, and it allows me to have more breathing room to get through the month!\n\nJust thought I would share this in case any of you find yourselves a little more strapped for cash when the mortgage payment is due.",
        "created_utc": 1675438509,
        "upvote_ratio": 1.0
    },
    {
        "title": "Bi-Weekly Mortgage Payments",
        "author": "tomlapse",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10sn5gc/biweekly_mortgage_payments/",
        "text": "[removed]",
        "created_utc": 1675438444,
        "upvote_ratio": 1.0
    },
    {
        "title": "369 MANIFESTATION CODE",
        "author": "Wrong-Macaron-4375",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10sn33c/369_manifestation_code/",
        "text": "[removed]",
        "created_utc": 1675438276,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT request: How to protect your back when you sit in awful chairs at work all the time?",
        "author": "kohitown",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10smusj/lpt_request_how_to_protect_your_back_when_you_sit/",
        "text": "My workplace has the most awful chairs and I work a desk job. Lately I've noticed my back is aching all the time from sitting in these chairs without back support for prolonged amounts of time and I'm wondering if anyone has any tips for making un-ergonomic chairs more comfortable for my back!",
        "created_utc": 1675437694,
        "upvote_ratio": 1.0
    },
    {
        "title": "become rich",
        "author": "InterestingMath1156",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10smnq5/become_rich/",
        "text": "[removed]",
        "created_utc": 1675437204,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT Request: good resume.",
        "author": "Meanderthaller",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10smi5x/lpt_request_good_resume/",
        "text": "Today I decided to redo my resume because I got tired of the layout and it seemed like a fun thing to do. Two hours in, I want to throw my laptop out of the window and smash my head against the wall.\n\nEditing Word templates is absolute hell. The templates I like have invisible table structures which fuck up the text indentation, which in turn makes customization virtually impossible. \n\nFree template websites are a sign-up/clickbait cesspool and horrible to navigate. Once you get a template after giving up your email (which inadvertently will result in spam mail), the templates have the same impossible table scheme which makes editing impossible.\n\nAm I missing something or is making a nice-looking resume by default a pain in the ass?",
        "created_utc": 1675436809,
        "upvote_ratio": 1.0
    }
]