[
    {
        "title": "Do Narcs post things on social media to mess with their exes?",
        "author": "Mcginty74",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/8zaz79/do_narcs_post_things_on_social_media_to_mess_with/",
        "text": "I dumped my N (woo hoo!) almost 7 weeks ago for the second time. The first time I left him, he uploaded a new Facebook profile pic after six weeks. The second breakup, he did the same thing, almost to the day. We are no longer FB friends, so his profile and cover pics are literally the only thing I can see.\n\nThis is a man who would normally pass long periods of time (a year or two) without changing his profile pic. He's not very active on social media. Now he does it twice in four months, and both times after he's been dumped by yours truly. Of course, in the updated pics, he's looking happy as a clam, in outdoorsy vacation spots. I wasn't snooping and only stumbled on this by accident when I was doing a search for someone else on FB. \n\nMy friend says he's sharing the new pic to get supply in the form of positive comments and likes from his FB audience, but if that's all it was, he could have just shared it as a regular post. Instead he chose to share it as a profile pic, which is public and anyone will see it. It's the only thing his ex girlfriend (me) is going to see online of his life after the breakup. His other social media is private. If he posted the same pic elsewhere, I wouldn't see it.\n\nI have this nagging feeling that it's partially aimed at me, and that it's aimed at me bc in the pic he's beaming so happily at whoever is holding the camera. He is incredibly controlling about having his picture taken, and I'm even wondering if he planned the whole time to have someone take this pic, where he is radiating happiness, and he's in this cool outdoor destination, bc he wanted to share it so his ex (me) would see. Like giving me the finger... look how awesome I'm doing without you!\n\n**Do Narcs post things like this on social media to provoke or mess with their ex?**",
        "created_utc": 1531748316,
        "upvote_ratio": ""
    },
    {
        "title": "I have so many things, it’s almost overwhelming. But I feel like I have nothing.",
        "author": "emmathegreedycat",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/8z61u6/i_have_so_many_things_its_almost_overwhelming_but/",
        "text": "",
        "created_utc": 1531697569,
        "upvote_ratio": ""
    },
    {
        "title": "How long did it take you to get on your feet?",
        "author": "IBakeDaCakes",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/8z5xxd/how_long_did_it_take_you_to_get_on_your_feet/",
        "text": "I'm moving away in two months to go back to school. My school is more affordable than most, but I am on a visa and can only work part time during the school year. I am very worried about not having a family to fall back on. My hope is that I can be so in tune with myself that I enjoy it all, and that the struggle isn't much of a struggle. But parting with my family has left me a shell of a person. My mother has blamed me for her poor health and told me to let her finish her short, miserable life alone. She told me I am trying to take her down with me, and that I have drained her, abused her, and that I have pissed her money away. I feel overwhelming shame, and just cold. I don't know how to be my own cheerleader when my mind is saying \"she's wrong\" and yet I still feel this shame and self doubt. I was truly reckless as a teen. I was an uninformed, traumatized teen and I didn't take care of anything I had. I did stupid shit and it did cost her money. Now I'm 26, and I work like a horse trying to save money for school. I've been sober and in therapy for years. I've lost plenty as a result of meddling in my adult life. My body is enflamed from the stress she has caused me in the last year. \n\nPeople keep telling me going to school is great and leaving the country is great but I feel shame and I don't know how I can push myself through what I am going to need to go through with this shame. I should be able to enjoy myself regardless of my financial issues but I feel like I should have to pay some kind of \"price\" before I am truly allowed to enjoy anything. I have lost my connection to myself and my future. \n",
        "created_utc": 1531696623,
        "upvote_ratio": ""
    },
    {
        "title": "It's Hard not to be Hard on Oneself in the End",
        "author": "christyoftheforest",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/8z4j9y/its_hard_not_to_be_hard_on_oneself_in_the_end/",
        "text": "For as long as I can remember, the end of a relationship has always been an especially painful experience for me. The end of this particular one does not seem to have gone much better. Despite our both being cautious to start for a good 6 months, after just under 3 weeks the actual relationship officially ran its course. \n\nThough the reason I am compelled to write here is specifically 2 things:\n\nOne: I recognize my anxious attachment to relationships more profoundly than I have my entire life. When people pull away, I tend to subconsciously hold tighter. Somehow that seems against what should happen. And ...\n\nTwo: In one of our final conversations I was accused of gas lighting because I was explaining that in a previous argument that he claimed not to 100&amp;#37; grasp, I thought that he might have in fact forgotten that I had spoken with him about a particular plan while we were on a trip. I cited, as we previously attended a class together, that on more than 1 occasion he had forgotten that he had been taught something in a previous class. And I went on to say I knew I had spoken with him about plans while we were out of town (visiting friends) which he would later say he did not agree to. \n\nBasically, we both remembered what happened differently and were passionate about our points of view. I even tried at one point to explain that perhaps we were just too focused on our own interpretations of how the trip might go instead of focusing on the relationship aspect ... but was basically shut down. \n\nMy after narcissism mind can't help but feel the need to play things over in my mind, and try to find what else I should be taking from this. I feel like things ended prematurely, but also resent being accused of trying to manipulate someone I was really seriously trying to resolve things with. I feel like maybe I pushed too hard by coming over unannounced when I wasn't getting a response as it may have appeared hostile, even though I was really just concerned about things going wrong. I suppose I accidentally pushed things too far in that regard. Just overall feeling low, as I really cared deeply for this person. Am I too toxic? Could I ever truly tell if I was? ",
        "created_utc": 1531684842,
        "upvote_ratio": ""
    },
    {
        "title": "Advice needed: Navigating triggers in talking to nMom again",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/8z4bev/advice_needed_navigating_triggers_in_talking_to/",
        "text": "I'm also cross posting in r/raisedbynarcissists since I think the topic fits both subreddits. \n\nThis is going to be a long post, so I'm going to try to condense it. A bit of background: I'm a 38-year old female who has an nMom. I'm currently in therapy for trauma  and have experienced both complex and acute PTSD. I have two older sisters - one is still living and the other was murdered in 2005. My highly enabling dad died of cancer in 2006, so right now it is just my older sister and I navigating how to deal with my nMom. I experienced physical, emotional, and sexual abuse when I was a child, and much of my adult life has been focused around trying to understand how complex and acute trauma has impacted me, why I truly am my own worst enemy by being self-destructive and self-hating, and how to heal and rebuild from it. \n\nI went no contact from my mom in 2016, where I told her that I was unhappy, needed to focus on myself and my healing, and couldn't talk to her while I was doing so. It's been ongoing boundary work since then, and it's been complicated by the fact that my sister still wants a relationship with my mom. Her and I are extremely close (we are each other's primary support system), and we work hard to be supportive of each other even though we want different relationships with my mom (me: no relationship at all, her: a semi-distant/semi-supportive relationship where she sees my mother 1-2 times per month). \n\nMy mom is having surgery next week, and I have broken NC with her in order to help see her through the surgery. I do not not want to do this, as seeing her reminds me of all of the abuse I endured at her hands when I was a child.  However, my sister has decided that she wants to support my mom through her surgery, and as her primary support person, I want to be there for her, which means I am talking to my mom again, answering her emails, taking her to doctor's appointments, and generally acting like a good, dutiful daughter to someone who has caused me extreme emotional anguish, panic attacks, suicide attempts (the last one was in 2007), and has generally left me feeling like I am unworthy of love or happiness. If it wasn't for my sister, I wouldn't be talking to my mother at all, and would leave her to deal with this on her own, but since the deaths of my other sister and dad, my living sister and I have been an army of two working our way through our family wounds. I don't want to abandon my sister at the time that she needs me most, and have made the decision to support both her and her mother during this time (yes, I may also struggle with issues of codependency and enmeshment). \n\nI've been in an acute PTSD trigger state for about three weeks now, and it has been marred by anxiety, panic attacks, nightmares, flashbacks, insomnia, and overwhelming feelings of self-hate and self-loathing. I've had three instances where going out with friends/the new person I'm dating for drinks to decompress and blow off some steam have turned into me getting super drunk and either having panic attacks or verbally attacking them for not being supportive enough. I have learned that I need to lay off the booze right now, as I can't control my drinking and it essentially leaves me in a full-blown trigger state where I can't access any coping mechanisms. \n\nMy therapist has been less than helpful during this time, as my next appointment to see her isn't until August and she has told me that she doesn't have any openings until then but to keep checking to see if she has any cancellations (I have asked her if there is anyone else I can see in the interim, and she hasn't gotten back to me yet). I have been prescribed an antianxiety medication which I am using at night to help me sleep. I have also been trying to use all the other coping mechanisms I have in my arsenal: yoga, meditation, journaling, talking to friends, exercise, but nothing can seem to help me shake these feelings of anxiety, panic, self-hate, and self-loathing I'm experiencing. I feel like I am barely keeping my head above water, and am slowly drowning. \n\nI could really use some advice on how I can support myself through re-establishing contact with my mom again. It's so triggering to spend time with her. It's so hard not to think about all the horrible things she did to me growing up when I was just a kid, and all the horrible things I did to myself when I was older because I didn't think I deserved any better. The worst part is, I know this isn't going to end when her surgery is complete and she has recuperated. Now that I have opened the door to her again, I know it's going to take a ton of boundary work to close it and re-establish less contact with her. \n\nThanks everyone. You have no idea how much better I feel just by writing this all out. This thread has been so helpful. It's nice to know that I am not alone in this journey. ",
        "created_utc": 1531683138,
        "upvote_ratio": ""
    },
    {
        "title": "A vent about a deadbeat biodad",
        "author": "PrincessTigerLillie",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/8z45b9/a_vent_about_a_deadbeat_biodad/",
        "text": "To sum up the background: I left an emotionally and physically abusive long term relationship with my son’s father when my son was 2. Leaving that relationship triggered C-PTSD not only from the DV but also from childhood abuse from a narcissist mother.  With therapy and self reflection it has become apparent to me that my own trauma is why I refuse to allow my son to be in an abusive situation. \n\nWhen I first left my son’s bio dad I put in a lot of work to keep him in my son’s life while he acted totally apathetic about it. Only a month after we broke up he got another girl pregnant, and months later they moved in together. Once they moved in together he was finally able to do weekend visits with my son and his gf told me that he was making her take care of my kid and not communicating anything I said to him to her.\n\nA few months later he started using my child to further abuse on me and my son, who had Autism, was regressing in school after weekends at his dads house. After several chances that turned into several warnings I stopped weekend visits for my son’s best interest.\n\nI heard nothing from him for 6 months. I contacted him around my son’s third birthday to ask him if he would be willing to pay directly to the gym for my son to be in a gymnastics class and in return I would give him supervised visits. He refused but told me that my son would probably be “ecstatic” to see him and I second guessed myself wondering if that was true. I also didn’t want it to seem like I was leveraging visits for money so I asked him if he’d like to meet us at the park and he said yes.\n\nWhen we met at the park my son got very anxious and afraid of him. After a while when he saw I wasn’t leaving he interacted a little with him but the entire visit was mostly my ex just following my kid around the park not talking to him or playing with him. After that I decided that if he made an effort for more visits I would give them to him but I wasn’t going to make the offer again. \n\nMonths passed and we heard nothing from him.\n\nYears passed and we heard nothing from him.\n\nLately my son, who is now almost 6, has been asking about his Dad, which breaks my heart. One day I told him he could call him on the phone. The conversation was literally nothing. My kid asks questions like, “what is your favorite color/ ice cream/ game?” And his father gives him answers like “idk” or one word answers without asking anything back, he is a void of personality. The phone calls last about 45 seconds before my kid gets bored and hangs up to talk to Siri instead. But after the first call I was contacted by my ex’s gf and she asked if  they could see my son. I agreed and we set up a time and place, fast food lunch and a popular children’s museum.\n\nThe day before I text my ex and asked his intentions and he said all the right things; he’d changed, he wasn’t an abuser anymore, he wanted to be there for my kid, he wanted regular visits. I didn’t believe him but I told him I’d give him a chance.\n\nThe next day we met for lunch. He said exactly two words to my kid: “Hi, *child’s name*”. My son was too nervous to eat his food at the same table as his biodads family so we had to move to another table. When we left the restaurant he didn’t even say goodbye.\n\nThen we went to the museum, first thing I took my son to the restroom. Then we sat by the door and waited. 10 mins went by and they didn’t show up. I texted my ex and took my squirmy son into the gift shop to keep him occupied. Another 15 mins passed and now my kid had a small toy to play with while we waited. I texted his gf, tried to call him and when I hadn’t heard anything in 5 mins I just started walking around the museum.\n\nAbout a half hour after we got there, just after I gave up on waiting for them, I got a text from the gf telling me they were at an exhibit well inside the museum. I told her we had been waiting for them and I had texted my ex and she said she didn’t see us and it was loud.\n\nThat was 3 days ago and the last I have heard from either of them. We ended up walking through the museum just the two of us and never saw their family there. \n\nI think what’s going on is that he doesn’t care and doesn’t want to be a part of my son’s life. I think he is deliberately letting my son down knowing that it will make me withdrawal my offer to give him a chance because he wants to be able to point at me and call me the bitch that is keeping his kid from him. I did tell my son we would see his father (we did at the fast food place) and he thought he would be at the museum as well but I purposely didn’t get his hopes up because I didn’t trust my ex. I seriously didn’t expect that he would go and not attempt to meet up with us, that’s a level of rude and stupid I didn’t expect.\n\nThis is probably a non issue since I doubt that his father will ever contact me again and the amusement of calling him on the phone has worn off for my kid. I’m mostly just sad my kid has such a dirtbag father and I blame myself for having a child with an abuser.",
        "created_utc": 1531681826,
        "upvote_ratio": ""
    },
    {
        "title": "Looking for support: nSister, Eparents",
        "author": "princessgnocchi",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/8z3ruh/looking_for_support_nsister_eparents/",
        "text": "Long time lurker on the many various Narcissist related subs, first time poster. I've been looking for a while for other people's stories that match my situation but have had trouble finding them. I was verbally and physically abused by my nSister as far back as I can remember in my childhood. It was reading these various subs that allowed me to understand her behavior as such. For years I was told it was just \"normal sibling fighting,\" especially since we are about a year apart, but I know now that's bullshit. Among many things we've had the cops called on us, numerous physical injuries, broken belongings, she's posted false and demeaning things about me on her private instagram, and she outed me in high school when she walked in on my first girlfriend and I (I thought it was pretty funny retribution at first for her to experience that after so many years of her barging into my room without knocking despite being asked to, but got MUCH less funny after being outed since I grew up in a small conservative beach town in Southern California). \n\nI've been NC with her for almost 8 months now, after an argument we got into over the holidays where she stole my car keys and when I tried to get them back, screamed at me about how I'm a failure and I'm wasting my parents money in school (I'm a Literature major she's Electrical Engineering) and having been away from this for some number of months it hit me by surprise and I had a panic attack and fell to the ground, at which point she told me to \"get up and stop faking it.\" My dad was in the room the whole time. My parents gave up disciplining her a long time ago. Following this I went into outpatient treatment, and in this time my dad admitted to me my nSister's behavior was abusive (but I guess you couldn't do anything about it when I was a kid? okay) but has gone back and pretended he never said this. I wouldn't say my dad is N, but he's certainly pretty closed off emotionally. My sister feels that because my parents never bowed down to worship her, they love me more than her. They didn't make her the GC by any means but their strategy was to have us \"fight it out\" rather than intervening. I think this is why I have anxious attachment: I knew my parents loved me, but I also knew they could never really protect me from my sister.\n\nI go to college 8 hours drive away from home, she's 2 hours. She visits home semi-regularly and in these visits has occasionally gotten physical with my parents when she hasn't gotten what she wants from them, since when she returns home she's always looking for something: she is an athletic 19 y/o, my parents are in their early 60's. She's ripped one of their closet doors from their hinges, broken glass, slashed a painting I made for my mom for mother's day with a knife, and PUSHED them. My mom and I did family therapy together when she visited me when I was at outpatient, and when I tried to talk about how I was afraid of her hurting them physically, she tried to pretend it didn't happen and said something about how she only saw my dad pushed when he tried to break up a fight between my sister and I, and insinuated she didn't reealllly know which one pushed him (this is bullshit and she knows it they didn't break up our fights). \n\nUpon going NC with my nSister and talking to childhood friends about it I very much got the message that this was a dynamic people could see for many years, and many were in shock by what they witnessed my parents and I put up with from her. I'm making real inroads to healing (SHOUTS OUT TO EMDR) but I'm afraid of what my sister will do as my parents get older. She's also going to a very expensive school, and has told me she's gonna \"make them pay for all of it\" even though they told her she needed to take out loans (I go to a UC and this was under the condition they would be able to pay for it w/o me taking out loans due to money they had saved in a trust, for which I am VERY grateful, but my sister also got into a UC and was told the same thing and still chose the more expensive school ofc). She was an RA last year but isn't this year, and my parents have refinanced our house and the apartments they rent out to afford the tuition because they \"don't want her to be stuck with loans.\" She WILL be able to pay off loans if she were to get them, but I know she just feels entitled to the money (she's essentially stealing from their retirement fund at this point). I'm terrified my nSister will leave them broke and injured the longer I live farther away from home and she lives closer, and I don't know how to proceed. What to do, what to do. ",
        "created_utc": 1531678932,
        "upvote_ratio": ""
    },
    {
        "title": "How to prepare for lifetime with narc",
        "author": "skyline85",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/8z3msa/how_to_prepare_for_lifetime_with_narc/",
        "text": "Need to vent and any advice is helpful.\n\nI was with my ex for 4 and a half years. The first couple years of it I was incredibly broken and vulnerable from my past and he became my everything, subtly and slowly destroying everything about who I was, morphing me into this machine that catered to his emotional wellbeing. Every day was like walking on eggshells to not upset him with things like my needs or feelings, and constantly feeling like I was insane/controlling/abusive for being upset over his clear and pretty terrible \"mistakes\" (the one that really opened my eyes was when he was texting from the parking lot of the ER about how he was tired/how much longer was this going to take/he has work in the morning/why aren't you responding I need to know how much longer I have to sit here- when I was IN THE ER ROOM, while pregnant, because they thought I might be having a stroke, which ended up being a stress induced visual migraine). It wasn't until the last couple years of the relationship that I started realizing the way I was feeling wasn't normal or okay, and started standing up for myself, at which point I was discarded. We have a child together so I can't completely cut contact. \n\nIt's been 2 years now since the discard and the more I detach the more he goes onto the attack, and it has been so hard to stay factual and cold over emails with him. \n\n6 months ago he started seeing someone. I knew immediately because our son became a non-priority and his personality completely changed. He often would add little things into our messages like about how I \"cheated\" as if it was a fact (I never did and he knows this) as if someone was reading our conversations along with him. If I defend myself I'm lying and he ramps up the attacks until I'm emotionally drained, if I don't defend myself its assumed what hes saying is true and he rubs it in and I feel like shit, so there is no winning. He NEVER came out and mentioned he was seeing someone, so I figured it was maybe a casual thing.\n\nThat brings me to this month... He messaged me out of the blue one night that he had a girlfriend, they were looking for a place together, and he'd give me the address. Although I wanted to go off about how as his son's mother I deserve a little respect and to know who this person is, I sucked it up and just responded \"Ok, good luck.\". Apparently that bothered him, because now it's constant little emotional jabs that I feel may be intentional. He started taking the new gf on romantic trips to ALL of the specific places we have memories- but I ignored it. I have an older son from a previous relationship, who my narc ex has had no interest in communicating with since meeting his new girlfriend. I'd tried to push him to keep in regulated contact since he was going to be in my younger son's life, but any time I pushed it I was \"trying to manipulate him into getting back with me.\" Eventually I figured, even though my older son was pretty upset any time his name came up, we were working through it in therapy and it would end up for the better. Then I find out my narc ex called up my older son's dad (who he has never really spoken to), gave some sob story about how he missed my son so bad and I wasn't letting him see him, and my older son's dad ended up bringing him to hang out with my narc ex while I was working. I ended up overreacting about it and emailing him that I was completely creeped out and that if he tried to sneak visitation with my son behind my back again I would be taking legal action, which he spun around into \"so you're using your child as leverage?\". I eventually just had to stop responding. The next day when I went to pick up my son, narc ex's new girlfriend (who I still had never met or been told anything about) was sitting in the passenger seat giggling as if it was hilarious that they'd surprised me by her being there. I picked up my son and walked away without a word. Yesterday I had to work but he was going to a show, which is much more important than my career, and dropped my son off at my work a half an hour before my shift ended. If I make a point about something, for instance if I said he should have dropped him off at 5 not 4:30, he will soon after purposely do something that messes up my day and state that I can't be mad because \"that time\". \n\nIt feels like he specifically sets situations up so that I either have to take being disrespected, or stand up for myself and have it spun into \"shes so mean, see!\". I've been completely incapable of forming new relationships these past 2 years and I'm a nervous wreck most of the time. He knows my insecurities and he knows my buttons. Any time I feel like I'm starting to be happy with myself, he springs something on me. I don't know how to make it stop.\n\nI've tried opening up to the few people I still talk to, but I can tell they're thinking I'm being melodramatic and need to move on and stop being jealous. But in all honesty, there are other feelings far outweighing a reasonable amount of jealousy. I snooped through his new gf's social media to see who she was. She dyed her hair from blond to black a month ago. He INSISTED I always kept my hair black, and actually yelled at me for saying I wanted to change it. Next I'm sure he will be telling her \"no offence but you would be my dream girl if you lost weight!\", slowly beginning the break down of her self esteem. I can see the romantic side of him that trapped me, and I remember how evil I thought all his exes were to such a sensitive sweet man. But the absolute worst is that she has kids, too. The same age as my older son. I know I can't say anything but I'm mentally screaming GIRL WHAT ARE YOU THINKING! Although I know exactly what she's thinking, really.",
        "created_utc": 1531677876,
        "upvote_ratio": ""
    },
    {
        "title": "I suspect Nmom siphoned money off my student loans, how can I prove this?",
        "author": "IBakeDaCakes",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/8yy6wd/i_suspect_nmom_siphoned_money_off_my_student/",
        "text": "Nmom has always insisted she deal with my student loans because I am “incapable”. I ended up in and out of school before dropping out, and have recently discovered that I owe TONS in loan debt. It isn’t adding up, based on tuition estimates from the year I entered college.\n\nIs there a way to get an itemized list of loans, and where the money was dispersed? If so, what would I call this document and who do I contact to get it?\n\nNmom claims this document exists but has no name for it and is allegedly in possession of it. I am leaving the country to make a second attempt at school this fall and I am horrified by the idea of paying down this much debt plus what I need to get my new degree. I am trying to gather documents before I leave but she has zero sense of urgency and won’t speak in detail, unsurprisingly.",
        "created_utc": 1531618156,
        "upvote_ratio": ""
    },
    {
        "title": "Others either don't understand, or do not want to understand",
        "author": "fresh--tendril",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/8yvdur/others_either_dont_understand_or_do_not_want_to/",
        "text": "Ever since I have fallen out with my dysfunctional family of origin, I have sought validation \n\nAt times I have been too outspoken to people I don't know well enough. Sometimes my emotions have just not been calm enough to keep a cool head. And the very people I would ordinarily go to for help are the people who have caused me such deep upset. \n\nI have more or less kept myself away from people, put work on hold (although am due to go back now soon) - but in terms of the people I have approached there seem to be two types: 1. The first type say they'd like to help, or to meet, yet surreptitiously melt into the horizon and thereby not meet. 2. The people who do meet and have a talk about things - and these people tend to be people who have had their own fair share of family trouble. Yet their advice is generally to go back to my family, take them out for dinner, or be more assertive but go back. And, who knows? Maybe they are right, and maybe in the long term that might make sense. But in the short to medium term I really need to hear people hearing me, validating the fact that I just got cold-heartedly screwed over by my own flesh and blood.\n\nSo it would seem that people are very loathe to see people's parents as being to blame - I can only presume because they have not themselves fronted up to unfairnesses in their own families. \n\nOf course, other friends, in realizing I have copped on to Narcissism have very hastily receeded into the background, knowing that I would now cop on to their game-playing too. So no point in attempting to confide in those types. Jesus this has been some year. \n\nHave you had a similar experience in attempting to seek validation from surrounding people? ",
        "created_utc": 1531593299,
        "upvote_ratio": ""
    },
    {
        "title": "I'm being manipulated so badly and I'm struggling",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/8yu7oj/im_being_manipulated_so_badly_and_im_struggling/",
        "text": "[deleted]",
        "created_utc": 1531583713,
        "upvote_ratio": ""
    },
    {
        "title": "Why cleaning and tidying is so hard for survivors of narcissistic abuse",
        "author": "PrancerPrancer",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/8yu2pp/why_cleaning_and_tidying_is_so_hard_for_survivors/",
        "text": "Big thank you to everyone who was so encouraging and supportive about my writing...   thanks to all the lovely feedback you gave me, I am continuing to write about the process of healing after narcissistic abuse.  \n\nA redditor and fellow survivor mentioned they wanted to live in a cleaner, tidier home, but somehow never managed to. This is soemthing I struggled with, and eventually overcame, so I decided [to write about that](https://healingafternarcissism.wordpress.com/), in the hope it might be useful to others.\n\nI'm 5 years NC, writing about the process of healing from being raised by a NPD parent, and the anxiety, depression, low-self-esteem, flashbacks and PTSD that come with being an ACoN. If you think my writing might be helpful to you in your healing, please read and follow my blog - [healing after narcissism](https://healingafternarcissism.wordpress.com/) \\- and Follow me on twitter [@healingafternar](https://twitter.com/healingafternar)   \n\nif you have a suggestion for a theme you'd like me to write about, please let me know!  I want to write about things that will actually be helpful to survivors.  I will also take guest posts occasionally.   \nLove to all xx",
        "created_utc": 1531582524,
        "upvote_ratio": ""
    },
    {
        "title": "How I feel today...",
        "author": "Aziara86",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/8ytm6n/how_i_feel_today/",
        "text": "https://i.redd.it/p8bnoul6bx911.png",
        "created_utc": 1531578365,
        "upvote_ratio": ""
    },
    {
        "title": "DAE have parents that protected each other, over the expense of their children? [trigger warning] [Vent]",
        "author": "cantseeyounow",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/8yso1o/dae_have_parents_that_protected_each_other_over/",
        "text": "I just have to vent because I'm struggling really hard right now, because my parents are moving away. It reminds me of how they just discarded me, when I moved the first time. (My parent's moved us when I was a young teen, not caring a single iota about how it would affect my development, and 15 years later, I'm still struggling with it. Thanks Mom &amp; Dad /s)\n\nMy parents never fight, always take each other's side, and protect each other at (my) expense.\n\nI've never had my Nmother take my side, and she said I \"deserved it\" when my Nfather railed into me. She won't hear a word against him.\n\nThey seem to be so wrapped up in each other's lives, and ignore the emotional life of their children. Now, practically all their kids are estranged.\n\nIt's so frustrating, because they made out like they \"wanted kids\" so bad, yet, didn't seem to like us at all when we were there. She makes herself out to be the perfect mother, yet did almost absolutely nothing, and I've scarcely met someone so cold and ill-suited to motherhood.\n\nIt's nauseating to play into this game. I marked her email as spam, because hearing her talk about me, and her husband/my father moving, when I'm broke and struggling to eat, and discarded, and struggling to stay alive through addictions, poverty and whatever else they heaped on me - since I've left \"home\" I've been sexually assaulted and worse - and having her sign emoji hearts with her email sendoffs is worse. I moved away, because I felt alienated from them moving us the first time. And now they're moving again like it's nothing (they're moving to another state, btw, so it's not like down the street). It's like they don't care about how anything affects anyone at all. And they're matter of fact with the love-heart emojis, and I'm thousands of miles away, crying in my room I can barely afford and can't stay in for long.\n\nI'm so angry, but there's no place for it to go. I'm nothing to them - nothing. How can they just...leave places? It doesn't make sense.\n\n(Sorry for the vent/rant btw. I'm really struggling right now and can't sleep)",
        "created_utc": 1531568126,
        "upvote_ratio": ""
    },
    {
        "title": "Lack of Concentration (how it got me fired, and how it's my mother's fault)",
        "author": "OlMonsterFace",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/8ys0ht/lack_of_concentration_how_it_got_me_fired_and_how/",
        "text": "So. Got fired from my job the day before yesterday. It's for the same reason I got fired from the last one, and the one before that, I think - and I'm stumped as to how to break the cycle.\n\nWhen I was a primary-school kid, my NMum tells me she'd look over the school fence and see me wandering around by myself on the playground, pacing up and down. She thought I was sad and isolated, but I was happy and engaged - creating imaginary worlds, and when I later made friends, we connected through playing around in these worlds. I have always lived in a stressful and traumatising family environment, because of my NMum - but also one full of books. My coping mechanism is imagination.\n\nBut that has led to bad effects elsewhere. Through the many schools they took me in and out of, and the many jobs I've had since University (not to mention potential Post-Grad situations I almost got into), I have had the same problem - I got distracted. In school, I thrived at English Lit., Art, Drama - things which grabbed my interest - and then elsewhere, when I should have been memorising test answers or doing exercises I had my eyes fixed on a book or my mind lost elsewhere. \n\nSo for certain subjects my grades suffered. So, more shouting and violence and trauma. So - fully against my parents' wishes and counter to their actions - I got more deeply embedded in escapism. Closely monitoring my internet, taking my electronic devices away, forcing me to rip up one of my comic books and burn it; all of these punishments just pushed me further.\n\nWhich leads me to my bad employment history. This is the first time I've lost a job since walking out on my family, and thus the first time I didn't go back to NMum to be told exactly why it happened and exactly which hackneyed direction I ought to take my life now (previous ideas: Lawyer! Illustrator! Accountant! Archivist!, etc). So this is the first time that I've realised that the reasons I went from school to school and the reason I go from job to job are *the same*. \n\nMy little exit interview, they told me that I doodled at my desk, that I had non-work-related tabs open, that I seem like a good guy but I'm just not the right fit; but they don't understand that I deal with stress by distraction. The only way I could perform as well as I did was because just doing call-centre work hour after hour, with no reprieve of news or drawing or something to distract, felt like *agony*.\n\nSo now I know this is my problem, and it will always be my problem. So what do I do next? Is this a trait endemic of people who have escaped abusive families, or is it my singular burden to bear? Do I try to find a way to stop it, or go about finding a job where it won't get in the way? What would that job look like?",
        "created_utc": 1531559035,
        "upvote_ratio": ""
    },
    {
        "title": "The cycle of addiction in Narcissistic relationships...",
        "author": "Mcginty74",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/8ykxh3/the_cycle_of_addiction_in_narcissistic/",
        "text": "N relationships are so addictive. They move in a cycle, idealize-devalue-discard, and the idealize phase is the \"high.\" Everything that comes after is the horrible comedown.\n\nI have had two back to back N relationships, and was never discarded. I would get so strung out and sick of the comedown, that I would finally hit bottom and leave. It took me a lot of therapy to realize that me leaving was really just taking a break, not actually breaking up for real. I call it Idealize-Devalue-Detach.\n\nAfter a while of the Detach phase and not having contact with the N, the addiction starts coming back, and the cycle wants to start over. I start feeling the urge to use again. Instead of being angry and disgusted with the N, I start feeling longings to talk to him, and any exposure at all to his life after the breakup (such as thru looking at social media), is a huge emotional trigger and so painful.\n\nI start wanting to get \"high\" again, by contacting the N and potentially starting the honeymoon phase over. Those brief periods of ecstasy, when your N is loving you back and you feel so close to them, it makes you willing to \"forget\" the abuse that's coming, the comedown.\n\nI started another Detach phase with N #2 six weeks ago, and I can feel the addiction starting to tug at me again, wanting me to relapse and contact him to get my \"fix.\" But this time I am determined not to give in. I know in my head of course that I am so much happier when the N is *not* in my life. But this is addiction we're talking, and it is more powerful than your thoughts and intentions.\n\nI just wondered if anyone else related to the addictive nature of these relationships?",
        "created_utc": 1531495886,
        "upvote_ratio": ""
    },
    {
        "title": "Inability to feel Joy",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/8yesoj/inability_to_feel_joy/",
        "text": "I’m now NC from my N parents. Only a few months. Long story that will unfold as I write more here. What I am finding I struggle with the most is the ability to feel true emotion. I believe so much is repressed as for all these years my N mom made it impossible for me to develop decent self trust into what I felt is right or wrong. \n\nI know this is vague. But do any of you struggle with similar. Almost an envy for others who feel satisfaction, contentment and joy!",
        "created_utc": 1531437718,
        "upvote_ratio": ""
    },
    {
        "title": "New to NC with N parents",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/8yepxw/new_to_nc_with_n_parents/",
        "text": "Hello,\n\nI am new to reddit and glad to find this community. I went NC from my N parents a few months ago. I know now is where the real work begins. Rebuilding. Releasing emotional repressed pain. Learning to think with new positive pathways. I hope to share this journey here!",
        "created_utc": 1531437110,
        "upvote_ratio": ""
    },
    {
        "title": "Want to change up the hairstyle I've had my whole life... no idea what to do with it. Suggestions?",
        "author": "Aziara86",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/8ydm80/want_to_change_up_the_hairstyle_ive_had_my_whole/",
        "text": "I've had very long hair for my entire life. It was layered at one point, but I lost much of my hair at 17 (stress maybe, or genes, I dunno) and lost the layers. I don't really have enough hair for layers. Don't want to get bangs for the same reason.\n\nIt's thin, fine, and tangles super duper easy. I have some vague waves, but otherwise mostly straight. It alternates between being frizzy right after washing to being limp the next day. I'm currently losing even more of it (not like I need to) over the stress of attempting NC... and being denied that option.\n\n So what can I do with it? I don't really want anything high maintenance, (blow drying and curling/flattening are too tedious for me) I want something wash-n-wear and completely no-fuss. I also barely use any product other than a detangler because I'm sensitive to smells/chemicals.\n\nHonestly, I don't think I was ever really taught how to take care of my hair. It was a snarled mess most of my childhood because my scalp is too sensitive for ties/clips/ponytails. (As you can imagine, getting those tangles brushed out hurt terribly.) And the ties would have just slipped right out anyhow because of how fine and silky the hair is. \n\nI had a few instances in my childhood where I developed a snarled matt/almost dreadlock at the nape of my neck because my hairbrush had very shallow bristles and it didn't reach.\n\nI've been having this really anti-conformist thought of just going with the tangles and getting dreads (\"you wanna tangle?? I'll give you tangles you stupid hair\")... but I'm white and I'm not sure I want to deal with jerks yelling about appropriation..\n\nThis whole topic makes my husband kinda sad because he loves my long hair... But I really feel like it's time for a change. ",
        "created_utc": 1531428812,
        "upvote_ratio": ""
    },
    {
        "title": "Was it right of me to encourage my husband to go NC with his mom?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/8yctiu/was_it_right_of_me_to_encourage_my_husband_to_go/",
        "text": "[deleted]",
        "created_utc": 1531423293,
        "upvote_ratio": ""
    },
    {
        "title": "True.",
        "author": "Malonlon317000",
        "url": "https://i.redd.it/lcst7se0fk911.jpg",
        "text": "",
        "created_utc": 1531422222,
        "upvote_ratio": ""
    },
    {
        "title": "Nmom trying to contact",
        "author": "dancingfusion",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/8y8is4/nmom_trying_to_contact/",
        "text": "So I will try to give just a little background so that this makes sense.\n\nI have been NC for a few months now. My GC sister who is now 18 has lived with me for a year and a half. Nmom flipped over this and the event of her moving out of her house and into mine is what lead to a lot of situations and what eventually lead to both of us plus our other sister being NC. So all her children are now NC.\n\nI am a dance teacher. My GC sister is also a dancer. (At the school I teach for.) Nmom showed up to our annual show uninvited. It being a public event, we couldn’t have her removed. We did keep her away from the backstage/dressing room areas. She spent a significant amount of time in the audience talking during performances/complaining that we wouldn’t acknowledge her/generally being very rude. One of my friends that she doesn’t know was sitting nearby and overhead everything, which is how I know this happened. \n\nLater today our school leaves for a national competition. It is not very far from our home location- about 2 hours or so.\nSomehow nmom knows this (probably from some people in our school who are still fb friends with her who make posts and she stalks them.) and sent me a message at 5am yesterday. The gist of the message is that she’s down in that area with some friends (who she described as a group of people who support each other through their death aka “next stage of their journey” ???) and that she plans on bringing some of these said “friends” to the event (again, a public event.) and asking me for our schools performance times, and saying if I don’t respond she will ask someone in our school. She also goes on to tell me that I need to be nice to these people she’s bringing and “not treat them like they don’t exist like I do to her.” (I’m NC...of course that’s how I treat her.) \n\nI guess my questions are a) is she that delusional to think I’m going to talk to these people or her? At an event that I’m bringing my students who who are kids? Or at all?? Or that I’m actually going to take time out of this event that I am WORKING at for her nonsense? \n\nAnd b) do I respond and tell her not to come? Or tell her not to bother any of my students families? Most of them know enough to not give her any info. Some are new and happen to come from the town I grew up in (they drive about 40 mins to train at our school) and because they’re from my hometown some of them know her. Since they’re new this season and have no idea about the situation and I haven’t had a reason to tell them anything. I also don’t want to invite a thousand questions either if I have to tell them not to give her any info. \n\nWhat should I do? I don’t want her showing up there. My sister is competing and if she even sees nmom from a distance, she goes into panic mode. \n\nThanks for any advice you may have!",
        "created_utc": 1531391021,
        "upvote_ratio": ""
    },
    {
        "title": "Ppl who were in romantic relationships- when did you realize they weren't normal?",
        "author": "toobadiremember",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/8y6c1s/ppl_who_were_in_romantic_relationships_when_did/",
        "text": "As in, how long did it take you?\n\nMy mom is a covert N, but my dad is a diagnosed malignant narcissist. It came out in therapy aimed at 'fixing their marriage'. They were together 13 years, and my mom said **there was never any problems until they had kids** nearly 10 years into their relationship. I cut my dad off at 11 years old. He's that bad. I can't imagine not only no red flags, but no issues at all. I'm trying to wrap my head around it. ",
        "created_utc": 1531366782,
        "upvote_ratio": ""
    },
    {
        "title": "I summarized what I learned from this subreddit and what I learned to heal",
        "author": "sadhelga",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/8y5lwj/i_summarized_what_i_learned_from_this_subreddit/",
        "text": "I basically posted a rant last weekend that I felt [I can't comprehend the idea that people might like me](https://www.reddit.com/r/LifeAfterNarcissism/comments/8wyfe1/i_cant_comprehend_the_idea_that_people_might_like/), and I got way more support and resonance than I expected. What was really inspiring was that I received a few really great tips! So now I'm thinking, since we are in the subreddit r/LifeAfterNarcissism, it would be really helpful if we try to summarize the important tips as to healing, grieving and self care. So here I will list a few things. I don't think I will be able to make a comprehensive list, so feel free to add what you think is helpful/important.\n\nhere they are:\n\n**1.** **Seek professional help**\n\nIf you are feeling depressed/anxious/lonely, try to see the **therapy**. I know there are a thousand self care method out there and they are all more or less useful, but help from a professionally trained therapist is still irreplaceable. I have been seeing a therapist for almost a year and the experience has been wonderful. Not that they would be the silver bullet and all of a sudden my life became perfect, but it feels really good to have someone to listen, to reassure, or even just to talk with. Since I'm from a dysfunctional narc family, I don't really get emotional support from my family. My therapist feels like my real family member, because she is always there for me stably. She always listens, she has patience, she sees the good in me, she encourages me, she's supportive.... And I know if I need medication my therapist will know my condition. I know it's really scary to reach out for therapy, but once you are hooked with a therapist, things will start to get way better.\n\n**2. Take care of yourself physically**\n\n**2.1 Eat good food**\n\nWhat I found significantly improved my mood and energy level was when I shifted my dietary habits. Eating salad for dinner made my sleep quality way better than before. With greasy food in my stomach I just found it hard to fall asleep. Healthy food doesn't have to be expensive or all those organic stuff. Check out r/EatCheapAndHealthy for recipes! I also found cutting off gluten made my mood way better than before.\n\n**2.2 regular exercise**\n\nExercises really improved my energy level, and also my self esteem! Through regular workouts I started to have more confidence in myself. I felt like \"I can do this!!\" or \"lemme give this a shot\" way more often than before. That satisfaction, after a workout session when I really tried... that felt like I'm the king of the world and I could do anything. Also, physical exercises are just satisfying by itself. Getting my heart pounding makes me feel so alive. It's a good feeling. And it's not like you have to be super good at it. Taking a walk outside is anyway better than sitting on the couch.\n\n**3. Self care techniques**\n\n**3.1 Connect with your feelings**\n\nAs survivors of narcissist abuse I wasn't very connected with my feelings, because whatever I felt was always ignored or denied. So I never learned how to even recognize my emotions, not to mention dealing with them. I even felt indifferent when I was reading or watching TV because I couldn't relate to the emotions the people were having. It takes time and exercise. Try to \"feel\" what you feel like, use words to describe it. Try to imitate how friends/people from TV talk about their feelings. Gradually I could talk more about what I was feeling and have more empathy towards other people.\n\n**3.2 connect with reality**\n\nAlso because the narcs always deny what I feel and sense, I always felt like I don't believe in what I feel. It's almost like, there must be someone, who knows better than me, can tell me what I should feel and what I should think. The moment  I realized that I should just trust whatever I was feeling was a huge relief. I started seeking less affirmation and trust more in my decisions.\n\n**3.3 take baby steps**\n\nWhat I mean by baby steps is that it's not always all or nothing. What really matters is you need to make a good decision at the moment. And if you couldn't make it, just move on and try to make a good decision at the next moment. The accumulation of baby steps will bring you to a different place.\n\n**3.4 80/20 rules**\n\nWhat I mean by 80/20 is that you don't have to be successful all the time. Try to do it, for the 80&amp;#37; of the time, and for the 20&amp;#37;, if you feel really tired or afraid, allow yourself to take a break.\n\n**3.5 it doesn't hurt to try**\n\nIt's really easy to feel this way when we are trying - what if I failed? what if all my effort went in vain? Try to think about it this way: if I didn't try, there's no chance I could make it; but if I tried, there will be a chance, which might be very small (actually bigger than what we think most of the time), but at least it is better than no chance, right? And I started to think, the people who never give up trying are the real heroes, because they kept breaking their limitations and thus they grow the fastest.\n\nIf you are trying to move on with your life after surviving narcissism, I hope this post will be helpful with you. If you think something is really helpful, please feel free to add it in the comments!",
        "created_utc": 1531360292,
        "upvote_ratio": ""
    },
    {
        "title": "So tired",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/8y19r2/so_tired/",
        "text": "[deleted]",
        "created_utc": 1531327982,
        "upvote_ratio": ""
    },
    {
        "title": "\"not that bad\" rant",
        "author": "knottblue",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/8xzr4b/not_that_bad_rant/",
        "text": "Lately I've been reading the top horrifying stories from /r/JUSTNOMIL and it's got me thinking about my nmum and how she wasn't as bad as some of the mothers there and I know that I'm reading the worst ones and even more than that, it's not a game between who has the worst and she was still bad in her own right, but like, every time i meet my sister and we talk about nmum she's like \"Mum isn't that bad, she does this \\[good thing?\\] and she could be worse\" and it's really frustrating because yeah I said that stuff to myself for ages and drove my down into an unhealthy ditch.   \nRealistically it doesn't matter how bad she is compared to other people!! I'm more terrified of her than I am of death! So what if she didn't do this or that or isn't as bad as other people, the person who she's supposed to love most and care for is terrified of her. \n\nIt's annoying to still have these thoughts and I know because I'm no longer living under here that I'm second guessing myself like \"was it that bad,\" and I know it was!! But I don't remember!! Because the mental illnesses that resulted from her actions are screwing my memory! \n\nShe's bad! She's not the worst! She provided for me perfectly financially that she doesn't have to do, it doesn't make he ra good mother! It doesn't erase the emotional abuse! I'm not saying she's the worst I'm not even saying she's irredeemable or whatever but she hurt me! It doesn't have to be on purpose. When the number one thing in the word that a child is scared of is their mother they shouldn't have to justify not liking her as their mother! So what if she did this or that for me or tried her best to be a mother! She f\\*cked up! And now I have to pay for it. \n\nrant over\n\nit's annoying. My stupid brain barely remembers what she did because it can't remember what happened three goddamn days ago. Why can't it forget the consequences of her actions instead of just her actions. &gt;:(",
        "created_utc": 1531317159,
        "upvote_ratio": ""
    },
    {
        "title": "Struggling with potentially toxic friend due to past issues?",
        "author": "imalwaysonline",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/8xzcuf/struggling_with_potentially_toxic_friend_due_to/",
        "text": "Hi, I'm 30, I have been lurking on this forum for over a year now, and you all have helped me identify issues and recover from the N ways of both of my parents. Sorry for the long post!\n\nI am having an ongoing issue with one of my best friends. So this is it - we always have the same argument that boils down to me being unhappy with her expressing a negative opinion on many many things I like, do or say, from music taste to the way I look on photos, to really trivial things, like saying she doesn't like someones NAME. She obviously has a right to her opinion, but this seems to be more often than not negative and directed towards something I like or am doing, like there is a massive personality gulf between us. It's causing more arguments now because I'm not letting things go like I have in the past.\n\nI guess I'm questioning whether I have a right to be upset when she expresses her opinion? I dunno, that sounds ridiculous. We all have many faults, and this one seems trivial, but over time, the situation has gotten worse because it feels very personal.\n\nI do take things personally, and I don't know if I'm being irrational about these things above, or it's just fallout from my difficult childhood. I'm trying to decipher everything. I would really appreciate the insight from all of you lovely helpful people. I notice she is like this with others, but as we spend a lot of time together, it is directed at me because she knows more of my preferences and things I like, and she feels comfortable to \"be herself\" with me - which means she can criticise me all she likes.\n\nI'm feeling worried and drained when I'm around her - so I know that I gotta go something. I am parenting now, my social time is becoming a lot more scarce and I want to be having fun, not defending myself on everything I say or do.\n\nLets call her L. \n\nL is very critical with everyone and herself, and very demanding in group situations and one-on-one. So, we clash. I'm very similar. I rescue her ego a lot of the time and I think she feels like she's reciprocating by spending time with me.\n\nI'm thinking I should cut ties for a while and see how things go, as we have known each other over 10 years, its a big decision. Please let me know if this sounds like an over-the-top reaction on my part, I don't feel I could get any impartial advice really from people I could speak to. \n\nA bit of background...\n\nI have been working hard to become NC with my father, and my mother I am slowly distancing myself from. Over the last year though, I have been gaining insight into myself and mentally trying to carry on the good work I did with a therapist, to build up my sense of self worth outside my parents' wishes. I'm becoming unable to deal with more bullsh\\*t than necessary. I am slowly coming to terms with the fact that my childhood was lacking in any emotional warmth and happiness. There are several reasons for this, also, outside my parents control - but I have been gaslighted so I still don't trust my own judgements sometimes. Sometimes I feel gaslighted by the person in question, as she calls me \"mad\" in arguments, for reacting badly to her negative opinions -mostly joking but recently she said it in all seriousness.\n\nI have a medical issue since birth that's not life-threatening, but it's a deformity that has always affected my confidence with people, so I think this is relevant too. Feeling alienated by people isn't new to me. Ending the friendship would result in \"making things awkward\" for other friends, like we are all planning a trip together next month, for example, and \"drama\" between us would affect other people in our group. I am confident in my other relationships with other friends, and I'm not worried about being alienated further. Thanks therapy! But I do care about L, I just can't handle her anymore. It makes me so sad though.\n\nI have been good friends with L since we both were 17, both from the same town, and met through a mutual friend. We still share the same friendship group, many of the people have moved on from our home town, including both me and my friend, but all keep in touch and see each other as often as possible with all of our increasingly busy lives. She was the closest friend I had for years, and we have had lots of fun times together. She even recently lived with me for two months when she was in-between houses, and I didn't ask for any rent.\n\nOutside of this, there has always been a \"clash\" - people say we're \"too similar\" therefore we argue and bicker. We didn't have these problems when she stayed with me as I made more of an effort not to react badly to her. It has got to the point now where I am increasingly noticing her negative attitude towards everything (she has anxiety issues around her body and needs a lot of reassurance from people, online and in person but hasn't had any therapy) and she takes things I say to heart, and vice versa so talking to her about deep things is very very difficult. I have tried to encourage her to go and speak to a therapist but she has been defensive about this.\n\nI feel like I have gained a lot of insight over the last few years, and I'm learning to be less defensive and take responsibility for my words and feelings more. It is difficult with her because I don't see her growing in the same way, and she still responds like a child sometimes. Other friends have noticed this and because we are so vocal in our opinions, other friends have come to me and said they felt that she is selfish and demanding in friendships. She is a very headstrong person and generally fun to be around because of this, but I don't really feel a strong connection has grown over time with her, like I do my other friends.\n\nSo I'm hoping anyone has been through something similar and can offer any words of wisdom? \n\n**TL;DR - Having trouble with my friend being expressing negative opinions on me, and seeking advice if I should cut ties.**",
        "created_utc": 1531314005,
        "upvote_ratio": ""
    },
    {
        "title": "\"Private and confidential\" means open it, right?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/8xz6oe/private_and_confidential_means_open_it_right/",
        "text": "[deleted]",
        "created_utc": 1531312476,
        "upvote_ratio": ""
    },
    {
        "title": "Im afraid I will miss my mom.",
        "author": "CityGirlofReddit",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/8xxo9b/im_afraid_i_will_miss_my_mom/",
        "text": "I just turned 20, and will be moving on from my mom. I do love my mom and she has not been a awful parent my entire life just after my parents divorce and her remarriage she changed. That was about 4 years ago. I will be leaving the state into a new city about half way across the country. I am even getting a bit of extra cash from her to help with costs and to get settled in the city. Its less than a week until I'm leaving but I know that this is what is best for me, and for her, I'm just so afraid I'm going to be miserable on my own. I have been so controlled by my mom in everything I do and I worked really hard to have the ability to branch out and move on but now the small bit of stockholm syndrome eats away at me and make me sad and miss her. \n\nHas anyone else experienced this after moving on. I feel so unprepared to live life on my own, especially in a big city, I'm from the country. Any advice to calm my nerves. I feel like I will adjust over time, but that contentment seems so far away. ",
        "created_utc": 1531295251,
        "upvote_ratio": ""
    },
    {
        "title": "Afraid of Building Relationships",
        "author": "applesandpeas",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/8xxdz3/afraid_of_building_relationships/",
        "text": "So here's my deal: I'm low contact with my n-mom, and no contact with my n-dad. My ex keeps thwarting my attempts at a divorce, but we live hundreds of miles apart and don't speak. It's not perfect, but enough space to heal. \n\nThe problem I'm having now, is that I'm terrified of getting close to people. I really thought I was in an equal, respectful relationship, and I gradually realized how toxic and damaging it had been for me.\n\nBeing so horribly wrong has deeply shaken my confidence in my ability to vet people. I went into my marriage aware that my relationships with my parents were bad, and thinking that I had the tools to find the right people for my life. I was so, so wrong.\n\nI've been on my own for years now, and my social circle is still severely restricted. I'm fortunate to have a few close friends from my pre-marriage life that I still talk to. But anyone we knew as a couple is unsafe. Aside from flying monkeys attracted to the charisma, there were straight up accomplices. I still live in the area where we lived together, and I worry about making friends and running back into old contacts I don't want to see. \n\nIt's been so long, and I feel like I'm still hiding. I don't trust my judgements of people. I've been seeing a therapist for a couple of years, and it has really helped with some things, but not this. I'm never sure where exactly to draw the line between normal disagreements, normal human flaws, and willfully harmful and dangerous behavior. My ex was so skilled at hiding abuse in confident delivery and reasonable explanations. I feel like I don't know how to relate to other people anymore. Has anyone else felt like this? How do I get past this?\n\n ",
        "created_utc": 1531292123,
        "upvote_ratio": ""
    },
    {
        "title": "Just moved back in with nmother",
        "author": "freemia",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/8xsuqw/just_moved_back_in_with_nmother/",
        "text": "Please, any tips on how to survive this. She's already used help paying my phone bill against me after I snapped at her for trying to make me literally do her job for her. Part of me wants to use her for cheap rent so I can go back to school. ",
        "created_utc": 1531253659,
        "upvote_ratio": ""
    },
    {
        "title": "Nmom got me into debt, can I ever just live normally?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/8xsncm/nmom_got_me_into_debt_can_i_ever_just_live/",
        "text": "[deleted]",
        "created_utc": 1531252246,
        "upvote_ratio": ""
    },
    {
        "title": "I wish I didn't respond to her text.",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/8xs2ti/i_wish_i_didnt_respond_to_her_text/",
        "text": "While I was at work yesterday, I received a text from my nAunt asking me for a favor. I used to rent a room at my nAunt's home, along with my FMcousin, for a few years and I moved out earlier this year because of the toxicity there. I’ve been VLC with my nAunt and FMcousin ever since I moved out. The reason why I haven’t gone NC is because I’m concerned about the retribution I may get for doing so. No one in my family knows about what has gone on between my nAunt and I’m keeping quiet to not cause an uproar. It’s already bad enough that my nAunt is already turning my father into a flying monkey as well.\n\nMy nAunt would probably be described as a covert narc. She portrays and prides herself as one who is self-sacrificial, caring, generous, and a savior to her loved ones. In reality, this is all used to feed her ego and martyr-savior victim complex. She's frequently complained how no one appreciates her sacrifices and how she gets f\\*cked over by everyone (her words). I find it ironic how she's condemned other people in the family for being holier-than-thou, but she's gone on about how pure her actions are.\n\nAnyway, I texted my nAunt back to see what was up. I did this out of the ingrained habit of helping out another family member, despite any personal issues. Also, my nAunt’s health isn’t that great, so a part of me still had some compassion for her. My break time arrived and I didn’t get a response, so I decided to call her just to kill the suspense. She picked up the phone. \n\nIt turns out that my nAunt wanted me to encourage my younger FMcousin to move out of her home because she thinks my FMcousin looks up to me. My nAunt rambled for 4 -5 minutes about how my FMcousin is irresponsible, hasn’t paid rent, keeps quitting her jobs, etc. Basically, my nAunt was trying to drag me into her drama, which is one of the main reasons why I left her home in the first place. What really bothered me is that my nAunt seemed oblivious to the things she said in the confrontation that lead me to make my decision on moving out. During that particular confrontation, I had to listen to my my tearful and angry nAunt's hour-long and over-dramatic rant about how selfish and spoiled I am, how much she's given and sacrificed for me since I was born (most of the things she's done have never been asked for), how socially inept I am, how my cousins talk to her about me behind my back (hence why my cousin is a flying monkey), etc. Now why would she approach someone who’s supposedly so “selfish and spoiled”? Furthermore, she angrily yelled at me during our confrontation that she would never ask for my help again because she thinks I complain behind her back and I don’t help “from the heart” like she does. And for some reason, she’s asking for my help like she never meant or said any of those things during that confrontation. Imagine that.\n\nFor the most part, I stopped caring about any personal affairs involving my nAunt and FMcousin. I considered them as far removed from my life as I possibly and comfortably can. Even though I told my nAunt that I’ll think about contacting my FMcousin, I never had any intention of doing so. I especially didn’t want to give my FMcousin more ammo for my nAunt to use against me in the future. My words were what triggered my nAunt once before and JADEing was supplying my nAunt’s arsenal. That’s why I never even bothered telling her that about going VLC/NC because my words would be twisted and she would gaslight me when confronted.\n\nAfter I hung up, I felt a sick feeling in my stomach and told one of my coworkers about what just happened without getting into too many details. My coworker simply just told me to block her and it doesn’t matter if she’s family. With the encouragement of my co-worker, I finally decided to block my nAunt’s number from my phone. That phone call was not worth getting the upset stomach I literally got after speaking to her. Now if I can just find the courage to delete and block her from Facebook where many of my other family members are.\n\n**tl;dr - My nAunt decided to text me for a favor, after I've been VLC with her after a fallout. Out of weakness, I call her to see what's going on. The favor was to encourage my FMcousin to move out of my nAunt's home because she's irresponsible, doesn't pay rent, quits her jobs, etc. This is coming from my nAunt who once raged at me for being \"selfish and spoiled\" and how she would never ask for my help again because I don't help others \"from the heart\" like she does (whatever that means). After I hung up, I had a stomach ache from the conversation. With my co-worker's encouragement, I decided to block my nAunt's number.**",
        "created_utc": 1531248252,
        "upvote_ratio": ""
    },
    {
        "title": "قاب دی وی دی دوتایی",
        "author": "parsacd",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/8xps8m/قاب_دی_وی_دی_دوتایی/",
        "text": "[removed]",
        "created_utc": 1531233843,
        "upvote_ratio": ""
    },
    {
        "title": "Emotional incest?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/8xopqw/emotional_incest/",
        "text": "[deleted]",
        "created_utc": 1531226530,
        "upvote_ratio": ""
    },
    {
        "title": "He’s now fucking with my career",
        "author": "NeverUsedReddit7623",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/8xk35z/hes_now_fucking_with_my_career/",
        "text": "I worked for a guy for three years and although we had quite a ‘firey’ working relationship, we got on well and he asked me to come with him when he left our company and moved to a new one which I did. Shortly afterwards, we both separated from our long time partners, turned to each other for support and ended up in a relationship (I know, I know, who would have ever predicted that sleeping with your boss two months after you get divorced would backfire?!?)\n\nIt was great at first but he quickly became controlling and in constant need of reassurance, praise and attention, whilst not giving a shit about my feelings. I now recognise all of this as narcissistic behaviour but wasn’t aware at the time. \n\nI always thought he had an inappropriate relationship with his PA and he used her to make me jealous. 5 months into the relationship, there was an incident with her  where they got drunk and stayed at a friend’s house together, and he didn’t tell me she’d been there till the next day. I got upset and he decided that the best way to fix that was for me to quit my job and leave the company (the twisted logic you allow yourself to believe when you’re vulnerable and think you’re in love!). I have therefore been job hunting for the last 6 weeks \n\nI ended the relationship two weeks ago as I realised his behaviour was not normal and I had hoped we would remain amicable and go our separate ways. However, this was my first experience of a narcissist and was t prepared for how low he would go and the games he would play. He got wind of one of the companies I was interviewing with and called their CEO and told him a bunch of lies about me which resulted in them revoking the job offer. He has also met with some of my ex colleagues who I’m still close to and told them I’m unstable and can’t be trusted. I’m completely ignoring him and he doesn’t know that I know he’s done all this as I’ve not reacted to it. \n\nHowever, I’ve just accepted a different job offer and I’m terrified he’s going to find a way to ruin it for me and destroy my reputation within the industry until I become unemployable. He’s too clever to take legal action against, nothing is in writing and it would all be very hard to prove. It’s difficult when you’re not a manipulative person to try to guess the next move of manipulator will be. \n\nHow long does it normally take for a narc ex to run out of steam and just leave you alone? Has anyone had one try to damage their reputation and career and how did you handle it?\n\nI also got a call from the PA today - they’re officially ‘seeing each other’, less than two weeks after we split up. Does that make him more or less likely to lose interest and leave me alone?",
        "created_utc": 1531190828,
        "upvote_ratio": ""
    },
    {
        "title": "What does closure look like after blocking your narcissist?",
        "author": "financebro91",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/8xibv9/what_does_closure_look_like_after_blocking_your/",
        "text": "(crosspost from another forum. I wonder if the answers here will be different.)\n\nFrom what I've read so far, it's not realistic to assume that the narcissist will change, feel sorry for you, or come to regret his actions in any lasting way. \n\nSo what is the ideal end-game here? As I'm recovering and rebuilding from a narcissistic relationship, what hope or happiness or solace can I find in the future? How can I start winning again in life?",
        "created_utc": 1531181955,
        "upvote_ratio": ""
    },
    {
        "title": "Know of any books about healthy people and relationships?",
        "author": "icecreamsandwichcat",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/8xfq1d/know_of_any_books_about_healthy_people_and/",
        "text": "I’ve been reading a lot and it has helped me immensely. I was wondering if any of you guys know of any books that are specifically about identifying healthy people, how to respond and socialize like a healthy person, and about healthy relationships in general and how they work. You know, the stuff we didn’t learn/experience by being raised around Cluster Bs. ",
        "created_utc": 1531167410,
        "upvote_ratio": ""
    },
    {
        "title": "Relationships forever lost [TW: Death]",
        "author": "elizabeth-san",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/8xaoc0/relationships_forever_lost_tw_death/",
        "text": "Edit: This got very long, sorry guys.\n\nAt the end of high school, I pre-emptively cut off all of the \"friends\" that I had. Due to my covert Ndad's particular brand of narcissism (high level of enmeshment/control, religious &amp; emotional abuse), I was only allowed to have school friends whom I rarely saw after hours/on weekends when the real friendships are being made. I was the only person in my class going to an out of town university, so I made the decision to reject them before they rejected me. I knew that I would never be \"allowed\" to see them again, so I ghosted them all.\n\nI felt justified as I watched on Facebook over the years as they all remained friends (to varying degrees) without me. People I had introduced to each other were now closer than I had ever been to them. They all partied and posted pics, while I sat in my dorm room avoiding everyone. I had no idea that my approach to friendships was unhealthy - Ndad would always tell me we didn't need friends, only our FOO and God (ugh). To be fair, not a single one of those close friends (5 - 10 year friendships) reached out to me after I simply stopped responding to texts. \n\nExcept one. If you can picture a tall teddy bear, that was him (I will refer to him as Teddy for the rest of this post). We were friends for a few years, but became very close when we served on a school committee together. Teddy had lots of friends, yet he always made time for me. We had a lot in common, and there was a short period where things were on the verge of developing into something more. Looking back, I can see from the outside it would have looked like I was \"friend-zoning\" him, but the reality is that i knew my Ndad would never accept him as a \"good-enough\" partner so I shut those feelings away. He kept being there for me despite this.\n\nAnyway, Teddy was the only one to message me a couple of times after I went full recluse. He wanted to know how things were going, since I was all alone on campus, and if I wanted to catch up when I was back in town. I knew that wasn't possible, because even though I was back in town every weekend (controlling father would bring me back from campus), I wouldn't be able to leave the house. Also, my avoidant tendencies really ramped up during my university years, and I didn't want to face what was now my past, or answer any deep questions.\n\nI chatted to him online for a little while before basically ghosting him. We'd exchange a message once every other year or so, but that was it. I bumped into him 3 or 4 times out in the shops with my now husband, he was always cheerful and so happy to see me. Each time he made me promise that we would hang out at some point, but I never followed through. Since going NC with my FOO, I've been thinking a lot about what relationships from the past I would like to repair. Teddy was the only one I could think of. I kept attempting messages to him, before putting it off. My husband has told me multiple times that I may be very different now to how I was \"before\" when Teddy knew me because of everything I have had to process after going NC, but at the same time I am more \"me\" than I ever was, and Teddy would accept that.\n\nThis morning, I found out that Teddy died yesterday. He had some health issues which had escalated dramatically in the last few months, but because he had actively changed his lifestyle and other habits, no one realised how serious it was. His Facebook page is absolutely flooded with tributes, because he touched so many people's lives. I went to dig up the old photos from over a decade ago, of us doing committee activities together, hanging out in the school hall etc and cried for my friend, because he was my friend.\n\nMy NC with my FOO is permanent for many reasons, but once in a while I think, even if I managed to somehow \"forgive and forget\" the more \"minor\" things my Ndad has done to me, I still wouldn't break NC because of the specific issues he caused which impacts my marriage to this day (DH is my rock). Today, I added another reason - my inability to form lasting, meaningful friendships at a time in my life when friendships are most important. Through therapy, I've managed to develop some healthy friendships over the last 2 years, but now I will never be able to repair my friendship with Teddy.\n\nEdit because I hit post too soon - RIP Teddy. Gone far too soon.",
        "created_utc": 1531135391,
        "upvote_ratio": ""
    },
    {
        "title": "Smear Campaigns",
        "author": "fresh--tendril",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/8x07bz/smear_campaigns/",
        "text": "I have to say out of all aspects of Narcissistic Abuse the idea of smear campaigns really does not bode well with me. Maybe it is my ego kicking in not wanting to be bad-mouthed and put down via smears and lies. In any case this is not the point of the post I just wanted to mention it. \n\nThe point is to pose the potential difficulty the Narcissitic parents are in when they attempt to smear their scapegoat child. To the extent that they smear their child are they not also smearing themselves - given that everyone around them knows they were the primary agents in the child's development? Aren't they indirectly implicating themselves in the smear? \n\nDoes this restrict the extent to which they can smear the name of the scapegoat child? Or are they too emotionally clueless to realize this? \n\nI can only suppose some people buy their false smear stories, and other, more emotionally together people see through it. \n\nWhat are your thoughts and suppositions on the attempted smear campagins waged by dysfunctional parents on their now health-bound children?",
        "created_utc": 1531039611,
        "upvote_ratio": ""
    },
    {
        "title": "Feeling like you don't \"deserve\" nice things.",
        "author": "cantseeyounow",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/8wyqar/feeling_like_you_dont_deserve_nice_things/",
        "text": "I bought a pair of Vans for $40 yesterday - I literally have no shoes - I've been wearing $10 converse that I got a thrift store six+ months back and an old pair of boots that are ripped. I'm pretty broke, but \"splurged,\" getting the nice, new popular shoes that I see all the \"cool\" kids around here wearing.\n\nWell, I feel like trash and they're still sitting in the box. It feels like I don't deserve nice things. I had this problem a lot - an eating disorder I got treated for a while back had this same major theme. I have trouble going into grocery stores, buy and return things a lot, and basically ruminate on every choice I make, until I feel incapable of buying anything and have literal panic attacks when I'm in line for stuff.\n\nI know I need to budget. My parents had major problems with money &amp; addictions. I was also a sufferer of neglect, and frequently went with bad/shitty clothing to school, where I would just wear old things or with holes because no one noticed and I hated myself.\n\nI also have trouble telling if things fit. I wore baggy clothing because my mother insisted I was a larger size or would \"grow.\" I didn't know that I was a size smaller and have only just begun wearing fitting clothing.\n\nI had to return my shoes because I couldn't tell that they were a size too big.\n\nI have trouble feeling my body and what suits me, and that contributes to my shopping distress. I also don't know when it's appropriate to buy things, and what counts as necessities. I guess technically food, but clothing seems \"extra,\" yet I can't go to work naked lol\n\nI was told I didn't deserve anything so maybe that contributes to my confusion. Everything is distressing and I'm afraid all the time.  In hindsight, these problems aren't bad (picking out the wrong pair of socks or shirt or something isn't the worst thing in the world), but they loom so large in my head. Please help.\n\nThanks for listening.",
        "created_utc": 1531020218,
        "upvote_ratio": ""
    },
    {
        "title": "I can’t comprehend the idea that people might like me",
        "author": "sadhelga",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/8wyfe1/i_cant_comprehend_the_idea_that_people_might_like/",
        "text": "It still feels like people generally don’t like me. I must have done something bad that I’m not aware of and people are silently calling me a terrible person. And when people are kind with me, I feel all weird. They must have some hidden bad intentions. Something bad is about to happen and I just shy away. If I chose to stay, one day they will discover how despicable a person I am and I will be all doomed.\n\nEdit 1: typo.\n\nEdit 2:\nThanks guys for being so supportive! I didn't expect more than a handful of replies, so this is really astonishing with me. I feel so much warmth in my heart. And I feel less lonely on this healing trip. I want to write down the tips that I read here as well as the lessons I learned along the way, which might be useful for people facing the same situation as us. \n\n",
        "created_utc": 1531017015,
        "upvote_ratio": ""
    },
    {
        "title": "Need advice on dealing with Triangulation with a Nrelative.",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/8wvz1a/need_advice_on_dealing_with_triangulation_with_a/",
        "text": "[deleted]",
        "created_utc": 1530994245,
        "upvote_ratio": ""
    },
    {
        "title": "Procrastination",
        "author": "failedcheerleader",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/8wv5lq/procrastination/",
        "text": "If it's okay I'd like to share this article. It was written by a psychotherapist from Los Angeles. I'm not promoting him (although I did have a session online with him via skype when my partner and I were going through a hard time). (He's not super cheap FYI but excellent as you may surmise from the writings here)\n\nI just think this article is really helpful &amp; on point. \n\nhttp://www.billcloke.com/writing-samples/procrastination/\n\nSome highlights:\n\n* \"Poor concentration, negative internal messages, unrealistic expectations, and the inability to organize and work constructively are present with procrastination. It is a part of an inner system that has many parts to it.\"\n\n* \"Children identify with distant, critical and unloving parents by blaming and criticizing themselves\"\n\n* \"The child feels hurt and angry because he is not receiving the love, affection and attention that he needs. The anger that he feels cannot be expressed for fear that the parent will be more critical or withdraw even further. So, the anger is pulled back into the self for safe keeping\"\n\n* \"Psychologically, perfectionism begins as a result of an attempt on the part of the child to draw closer and gain approval from a distant or critical parent.\" \n\n* \"The attempt to be perfect causes the child to create an idealized or perfect self to replace or to hide the inadequate true self.\"\n\n* \"Self criticism is an effort to magically change ourselves into a better person and to make us more acceptable to others.\"\n\n\nI hope people find this beneficial. I did. The other articles on the sidebar of his website are excellent as well. ",
        "created_utc": 1530987395,
        "upvote_ratio": ""
    },
    {
        "title": "Looking for guidance/support",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/8wu5x5/looking_for_guidancesupport/",
        "text": "[deleted]",
        "created_utc": 1530979340,
        "upvote_ratio": ""
    },
    {
        "title": "An Open Letter To My NParent",
        "author": "Anagharose",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/8wt94n/an_open_letter_to_my_nparent/",
        "text": "You birthed me and kept me alive, but I don't recall ever feeling like I belonged. You did not accept me as I grew to be my own person and instead tried to change me to be like you. Everything I did was wrong and needed \"correcting\". My hobbies, my interests, and even my friends. I was never enough. Too stupid. Too fat. Too many pimples. My clothes were wrong to you. My thoughts and feeling brushed aside and dismissed. My cries were silenced by your emotional distance from me. You called me selfish for them. And I believed you. I began to notice that all I did was to gain your approval. To earn your love. I did not know who or what I wanted to  be. \n\nI hated myself.\n\nThat hatred only grew. Every day and night was a struggle and I even wondered \"why do I even bother? Why should I continue to live?\" I hid these thoughts from you, afraid you would only scold me for having them. I was not meant to have those thoughts. I was only there to make you look good.\n\nAnd I was failing.\n\nI'm a failure and some days, I'm happy with that. Some days I say \"good!\" Other days I remember. I remember the shame. I remember the embarrassment. I remember the loneliness. Feeling like O was growing up all alone. \n\nKids whose parents loved them as they were didn't look like normal kids to me. The looked like \"perfect kids\" who were growing up like their parents wanted.\n\nI was the weed that grew instead of the flower you planted.\n\nA lot of days, I want to give this to her. To tell her, but I know it would 't change anything. It would make things worse. She would see it as me attacking her. Claim that it wasn't true. Then start the pity party and fake, empty apologies.\n\n I don't know if this is exactly where something like this should go and I can remove it if anyone wants me to.\n\nThat said, I hope that anyone reading this that can relate to the above letter will understand one thing: it can get better. For me, it meant cutting her out of my life as a mother and trying to get to know her as an adult. Like that, I don't feel obligated to stay in a conversation with her and even if it takes 20 minutes to do so, I will end the call (as I do not see her in person and have not in nearly 5 years).\n\nThis solution is not for everyone, I know. The best anyone can do for themselves is see a professional about their past abuse and learn how to heal from there.\n\nIt CAN get better, but not alone.",
        "created_utc": 1530970979,
        "upvote_ratio": ""
    },
    {
        "title": "Anyone else end up a germophobe and maybe a little OCD because of nparents?",
        "author": "dancingfusion",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/8wsxek/anyone_else_end_up_a_germophobe_and_maybe_a/",
        "text": "My nmom always had poor hygiene and forced us to share food/drinks with her, kiss her, sit by her, hug her etc. it really grossed me out to the point that now I cannot share anything with anyone. I can’t have anyone’s face near my food and I also have issues hearing people chewing- if there’s no other noise to drown it out I get unreasonably angry. \n\nI also have to always be clean...which is something I always felt the need for even as a little one, my grandma told me if I was dirty I would cry until someone cleaned me up. Some things don’t bother me- like at the gym I know I’m gonna sweat. That’s fine. But if a machine is gross? I have to clean it a couple times before I’ll touch it. And maybe not even then. \n\nI can’t have certain people stand too close to me. People I’m not close with, people I might not like a whole lot, people who might have poor hygiene, and strangers make me the most uncomfortable and I always feel that I need a personal space bubble around them. \n\nKids don’t bother me. I work with them for a living and I know they’re gonna be sick, or bleeding, or crying, or have food on them (age dependent of course) and that doesn’t bother me. They can jump on me, I’ll pick them up, they can hug me...whatever. It doesn’t bother me. It’s weird how certain things do and others don’t. \n\nI also have to have certain things a certain way. Nobody else will touch the kitchen in my house because I’m the only one who cooks dinner, I do all the grocery shopping and I organize the kitchen. People don’t even help with dishes (I’ll leave that one alone because it’s just annoying) but I also have to have things in specific places. I have to have a few other things in my life a certain way as well.\n\nThe more I read into it, the more it seems like the way my nmom forced certain things on me caused these issues. ",
        "created_utc": 1530967684,
        "upvote_ratio": ""
    },
    {
        "title": "Dysfunctional extended family stories",
        "author": "Blobbo7",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/8wqwwd/dysfunctional_extended_family_stories/",
        "text": "Hello all,\n\nmy extended family on my mum's side is extremely dysfunctional. Can we share some dysfunctional extended family stories? I will go first. My aunt faked being terminally ill for 5 years straight. Now she's anorexic and has borderline personality disorder. ",
        "created_utc": 1530941089,
        "upvote_ratio": ""
    },
    {
        "title": "Every time I drink I want to tell people about my past and why I'm NC",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/8wque2/every_time_i_drink_i_want_to_tell_people_about_my/",
        "text": "[deleted]",
        "created_utc": 1530940299,
        "upvote_ratio": ""
    },
    {
        "title": "Changing first name legally",
        "author": "Kaylani321",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/8wqf6x/changing_first_name_legally/",
        "text": "Has anyone done this. I have always disliked my first and middle name. They are weird spellings, hard to pronounce and about 50%of people say my name wrong. \nI always kept the name out of respect for my parents, whole lot of worth that was. (NC). \nAlso this is a bit silly but feel like you can't say my first name with out sounding condescending or like you hold me in contempt or like you are asking me a question.\n\nI just want to change the spelling of my first  name which will change the pronunciation and shorten my middle name, not give myself a whole new random name.\n\nHas anyone done this? How did you go about it.  Did you have issues with people who've known you a long time  and made the effort to say it right adapting to your new spelling and pronounciation. \nWhen I mentioned it to my bf of two yrs he told me \"but I just learnt to say your name properly...!\"\n\nAnd more importantly did you have legal issues. I have been putting it off as my passport does not expire for a few years and my house car etc are all in my born name.",
        "created_utc": 1530935790,
        "upvote_ratio": ""
    },
    {
        "title": "I'm Scared",
        "author": "3maryllis",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/8wqe58/im_scared/",
        "text": "I moved out, hoping to cut all ties with nmom and ndad. I didn't give them my address. The person I hired to help me move said that he saw my nmom following our vehicle, I thought he was bullshitting.\n\nMy nmom continuously texted me the past days trying to get me to visit her, because my cousin (whom I don't even speak to) came, with his family. I blocked her number, along with my sister's, and their facebook accounts.\n\nJust now, out of the blue, my aunt shows up, knocking on my front door, with my sister.\n\nAt first, I don't know how to react. \n\nMy natural disposition is to let her in, because that feels like the normal thing to do, right?\n\nAnd then, slowly, it sinks in.\n\nMy mother really had followed me, the other day.\n\nMy aunt talks to me about gifts that my mom brought to me, and I'm disgusted. Of course, she's using my aunt as a tool to win me over.\n\nI can't tell my aunt, who is, uninvolved in all of this, to go away because then I'll seem like a terrible person.\n\nAnd then, I realize, how incredible fucked up all of this is.\n\nMy mother had gotten my address by stalking me. \n\nAnd my aunt just showed up, at my door, without my consent.\n\nI tell my aunt, she didn't exactly tell me, she would show up.\n\nShe says, she had gotten my sister to call me. (Of course, I didn't answer for obvious reasons)\n\nMy aunt continues to talk, like everything is normal, and I'm left in a state of shock.\n\nI'm confused, perplexed, and unsure how to handle the situation. I started texting a friend, but she doesn't respond. Was going to call her, but she doesn't answer. My brain is screaming I DON'T KNOW WHAT TO DO.\n\nPanic sets in.\n\nI want to hide in my room, and cry, while I figure this out.\n\nThis isn't okay.\n\nMy aunt, doesn't seem to care, about how I'm freaking out.\n\nI tell her nicely, to leave.\n\n\"If you care about me, you would leave. You do realize my mother and I are on bad terms, and she's using you to get to me right? Do you have any idea how difficult you're making things for me?\"\n\nShe goes on about how it's all a mis-understanding, and how my nmom has cried over me. (Of course, she's lost her supply, and her control)\n\nI start screaming that my mom doesn't give af about me. IF she did, she wouldn't have treated me like shit, while I was living under her roof. If she did, why would I even move out, and make things difficult for myself, when I'm already struggling financially? \n\nI just...I ended up tell the aunt to leave, assertively. \n\nShe says my nmom was being considerate of me by not calling me and I'm like....LOL\n\nFirst of all, she doesn't have a RIGHT to infringe upon my space, by calling/harassing me when I want nothing to do with her, or showing up at my door when I never said it was okay...\n\nIt's really fucked up how, she sees nmom NOT infringing upon my rights as being considerate of me....\n\nI realized my aunt is just as disgusting as my mother. She was okay, with showing up on my door, without my consent. Like how is that okay? And going along with my mom's charades -.-\n\nMost likely, the rest of my relatives are, as well. \n\nWhenever I tried to tell any of my relatives and that's just to vent, how fucked up my nmom was, no one even made an effort to listen or understand my point of view. The way I see it, bystanders that have never sided with me, aren't likely to ever believe anything I say. Trying to persuade just creates un-necessary drama. ",
        "created_utc": 1530935503,
        "upvote_ratio": ""
    },
    {
        "title": "Is there such a thing as Life After Narcissism? The more I understand the more I see it everywhere and I’m confused.",
        "author": "JJSings",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/8wnzl3/is_there_such_a_thing_as_life_after_narcissism/",
        "text": "Was raised by covert narcissists. \nMarried a man who was raised by overt and covert narcissist. \n\nMarried almost 25 years, both sober 3.5 months, both in counseling. I’m an XNFJ and a giver. He’s a skeptic, very focused on right and wrong. At times I feel like I’ve been gaslighted in my marriage but I also know there is a lot of work DH needs to do and some of what I feel may be symptoms of his abuse or mine. \n\nI keep finding myself trying to explain myself with DH and yet getting accused of the things I’m trying to express. I feel like I have to prove I have the right to my feelings and am constantly judged. \n\nIs there life after narcissism or do we take on some of the characteristics of  those who hurt us?  Could my DH be projecting his narcissistic tendencies onto me?  \nAs survivors of abuse and narcissism, how do we deal with a world of people where narcissism is the norm?\n\nAm I crazy or is this just part of the process of getting healthier?",
        "created_utc": 1530913336,
        "upvote_ratio": ""
    },
    {
        "title": "Visited my hometown last weekend",
        "author": "Vavamama",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/8wntjy/visited_my_hometown_last_weekend/",
        "text": "Husband was with me, thank goodness. My goal was to photograph places I’ve lived, then print and frame. \n\nIt was harder than I thought. We drove past elderly cNM’s house, and she’s moved on. Someone else is there now. I didn’t ask, don’t want to know. Most likely she’s with GCbro in another state. \n\nI doubt we’ll ever go back, but I’ve been a bit down since we got home. We adopted a new kitten, and that helps. ",
        "created_utc": 1530911966,
        "upvote_ratio": ""
    },
    {
        "title": "What was the custody process like for you?",
        "author": "funfunfun4321",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/8wl9ul/what_was_the_custody_process_like_for_you/",
        "text": "I separated from my Nex two years ago and officially divorced early last year. It was hellacious. He threw everything he could at me, including heaping amounts of legal abuse. His lies and deception are now a bit more clearly visible to the local legal system but I'm still concerned about the custody situation for our child. We ended up with a 50/50 split, but I don't think it child's Guardian Ad Litem (GAL) was in agreement with that.\n\nI would really appreciate hearing if any of you have gone through custody-related cases in court, either as a parent or as a child, and what your general recommendations are. If you feel comfortable sharing more complex details, I'd appreciate that, too. \n\nThanks in advance ♥️",
        "created_utc": 1530893081,
        "upvote_ratio": ""
    },
    {
        "title": "Met someone, and here come the old anxieties and doubts",
        "author": "devilkitteh",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/8wl25f/met_someone_and_here_come_the_old_anxieties_and/",
        "text": "Met a great guy, NOT a narcissist, seems healthy. But I get all uneasy when I don't hear from him. He is not a big texter and is away from his phone a lot at work. I know he likes me back, but I have been on pins and needles all week because he barely texts me, and although he said he was looking up some fun activities for us to do, I have heard nothing about it and today and tomorrow are his days off. I'm chilling, not going to text him or push. But the old triggers are totally happening. Wondering if he is with someone else (Nex was of course); I worry he changed his mind and is going to back off or give me the \"you are great but I don't see this working out\" message. \n\nI worry and wait and its an old unhealthy pattern that I am very much struggling with right now. If he does contact me and ask me out I'll be so happy. Its a rollercoaster and I want off. I can go back to being alone and hiding after my Nex... it was easier being alone and thinking that I would be alone forever, than to start caring for and wanting this person. I'm so terrified. He knows I'm scared. Maybe he thinks I'm just not worth it, too damaged. I don't know. All I know is within the next few days these are the possible outcomes 1. He ghosts 2. He gives me the \"i don't see us going further\" dumping 3. He  wants to keep seeing me and we keep going out, and I still feel all insecure \"waiting for the shoe to drop\".\n\nHow do I made the fear stop!? I just want a healthy and happy relationship and I want this guy to want me back, and I feel him pulling away ( or its just my paranoia). And I'm playing it cool, I'm not being clingy... but in my own head I'm tortured.",
        "created_utc": 1530891509,
        "upvote_ratio": ""
    },
    {
        "title": "It gets better. Keep going.",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/8wjs0z/it_gets_better_keep_going/",
        "text": "[deleted]",
        "created_utc": 1530881191,
        "upvote_ratio": ""
    },
    {
        "title": "Need support atm...family stuff. Guilt, emotional conditioning, etc",
        "author": "icecreamsandwichcat",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/8wil3v/need_support_atmfamily_stuff_guilt_emotional/",
        "text": "To start, my whole family is dysfunctional. Every single person. Bunch of narcs, enablers, toxic people, religious fanatics. We even have alcoholics. However, I constantly have this war in my head...about who was the least dysfunctional. The least helpful and/or kind despite the dysfunction. I’m getting ready to go full NC because I need it for my own well-being. My N-aunt (with savior complex) took me in from my N(worse than her)/BPD dad who was horrible and ruined my childhood. My aunt and my mom’s family would have me over often for summers and weekends. They were better than my dad (I got fed better food, was actually taken out to places/bought me things), but still abusive (gaslighting, shaming, emotional abuse, scapegoating). I was cyclically scapegoated by them for years. I vowed to leave the family since I was 9. But they “rescued” me from my terrible dad and gave me (materially/nutritionally) a “better” life. They’ve spent so much money on me and took me in...but the whole family was also terrible to me and extremely toxic...I’m feeling so much turmoil over it all...I logically know this is pure BS, but they emotionally conditioned me so hard...to feel guilty for speaking out and calling them out...to feel guilty for pointing fingers because “after all they’ve done for me” and all that BS...feel like trash.",
        "created_utc": 1530867745,
        "upvote_ratio": ""
    },
    {
        "title": "I was conditioned not to talk about my childhood",
        "author": "littleduck_14",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/8whz0f/i_was_conditioned_not_to_talk_about_my_childhood/",
        "text": "I never realized this until my counselor pointed it out. We were talking about things and she said something along the lines of \"how do you feel when you share things like this?\" I mentioned to her that I didn't have a particularly easy childhood and if friends are sharing stories than I usually try to stay quiet. I feel if I share something then it will ruin the mood of the conversation. \n\nSo, she went on to ask me about it and I told her about an incident in high school when cps was called and there was a home visit. After they left my sister and I weren't allowed to talk to each other and whenever we would come home from school we get yelled at because \"they can't keep their mouths shut\". Anyway, that's when my counselor said \"and there's the reinforcement not to talk or say anything\" and that's when it clicked. \nffs. I have spent YEARS listening to my friends \"normal\" (because there isn't really normal. There's just better) childhoods and refusing to share or omitting a lot of information because I still feel as if I CAN'T say anything. ",
        "created_utc": 1530860081,
        "upvote_ratio": ""
    },
    {
        "title": "Advice please? The rug has been pulled out from underneath and I don't know what to do.",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/8wecum/advice_please_the_rug_has_been_pulled_out_from/",
        "text": "[deleted]",
        "created_utc": 1530826482,
        "upvote_ratio": ""
    },
    {
        "title": "I was sent to a psychologist when I was a kid. Today, 13 years later, I called him.",
        "author": "LilaTookbank",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/8w9f0g/i_was_sent_to_a_psychologist_when_i_was_a_kid/",
        "text": "When I was in high school, my parents sent me to see a psychologist. My grades were slipping and they had no idea what to do with me. I think it must have been because I was becoming an embarrassment to them. But in reality, I was very depressed and unhappy. I saw the therapist every week for a year or so, and we ended up talking about my life at home. \nHe met my parents for a session or two, as they would provide the background information of my life from their perspective, and of the years I couldn't remember (e.g. being born). \nAfter meeting them, he took me aside and said: you are not supposed to be here, they are. Your mom needs therapy, not you. I've told her this and they both refused to consider it. But I want you to know that you don't belong here and she does.\n\nIt's 13 years later. I don't live in that country anymore, I am NC and I am going through therapy now. I'm finding more memories of what they did to me, and one of the things that I held onto was what this man told me back then. I am trying to piece things back together, and after a difficult night, I called him up.\n\nGuys, it was so validating. He was really happy to hear from me, asked me many questions about what I was doing now (and expressed how proud he was of how far I'd come) and if I was okay. When I told him why I called (I want the notes and records he kept back then), he said: *oh yes, I remember your situation, it was disastrous. Yours was the prime example of a parent who needs therapy instead of the child.* \n\nI got to thank him for what he said to me, something I've been wanting to for a while and was afraid to do. But his exclaimed happiness about how I'd overcome all that to go to the place I am now, and his validation of that time has made me feel like it wasn't just all in my head. \n\n\nI just wanted to share this with you, because I've been someone who has questioned and doubted themselves about what happened to me so much, and I know many of us still do. I would have never thought about calling people from the past (psychologists, doctors) but when I did, I found that my feelings now are completely valid. It wasn't me, it's always been them. And that applies to you too. I hope you can find the validation to keep yourself from doubting, because you shouldn't doubt yourself. It can come from an old friend, a professional, or just us here on the forum. \n\nAnd I want to thank all of you, for always helping me when I needed it, and offering me a safe place and a community here. I hope I can mean the same to you &lt;3 ",
        "created_utc": 1530786686,
        "upvote_ratio": ""
    },
    {
        "title": "How do you get past the addiction of the narcissist? The loneliness feels painful.",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/8w6jfc/how_do_you_get_past_the_addiction_of_the/",
        "text": "[deleted]",
        "created_utc": 1530752880,
        "upvote_ratio": ""
    },
    {
        "title": "Been NC for two years, LAN still feels like hell to me",
        "author": "RegalRegalis",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/8w533j/been_nc_for_two_years_lan_still_feels_like_hell/",
        "text": "I feel so incredibly isolated. I have a good support system and all the reason in the world to keep going. Still, at times I feel like all I see is hatefulness and abuse. I know that isn’t true, it just hits me like a ton of bricks. \n\nFor the last two years I’ve worked my ass off to learn to manage my c-ptsd and dissociative disorder. I’ve made great strides but I’m completely raw without dissociation. The pain and fear is so intense but any happiness or peace is barely registered. I know two years is nothing when you’re recovering from decades of psychological and physical abuse, and things can continue to get better. Sometimes it’s so incredibly difficult.",
        "created_utc": 1530738916,
        "upvote_ratio": ""
    },
    {
        "title": "When do NPD's lose their ability to convince people of the seeming veracity of their false self?",
        "author": "fresh--tendril",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/8w2h3g/when_do_npds_lose_their_ability_to_convince/",
        "text": "If NPD's gradually lose their ability to convince others of their magnificence and greatness, when does the tide actually turn? When do people start to notice abnormalities? I have gone no contact, and I presume they have put on a smear campaign. Maybe there are one or two that see through their smear campaign, maybe there aren't.. \n\nBut I would like to know if there will come a time when people see that I did have a very sound reason for leaving the Narcissitc family unit. Will they see through the holes in the Narcissist's false self? Will they see I was saving my own sanity by leaving? \n\nIs there an age after which Narcissists cannot maintain the illusion of their false self? \n\nMY father is obnixious and disturbed, after time away from it all I can see that now. I do wonder if or when others will see it also. These Narcsisists are going around disturbed, presenting an air of charm and masterfulness. While their agenda is to disturb the ones who just want some peace on this planet. \n\nI just want others to see him for who he is. Does this happen, from your experience?  ",
        "created_utc": 1530718142,
        "upvote_ratio": ""
    },
    {
        "title": "Does this sound suspicious to you?",
        "author": "Mcginty74",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/8w295c/does_this_sound_suspicious_to_you/",
        "text": "I've been NC with Narc #2 for over a month now, and was doing really well. Then yesterday, wouldn't you know, something happens. Just when you think you're out of the woods...\n\nHe always had his phone on lockdown, but one day in the spring, he was sitting next to me and he had his phone open, and I happened to glance over and see a woman's name in the call log, immed before my name. I'll call her \"Florencia.\" It was a Spanish name. He was so private and guarded about his life, and kept me completely compartmentalized, so I really had no idea who his friends were, or if he had a friend named Florencia. He is from India, and almost all of his close friends are Indian.\n\nI asked him who that was, and he said Florencia was a woman who gave him Spanish lessons when he was living in X City. He said that she was calling him to try to get him to sign up for Skype lessons.\n\nFlash forward a few weeks, and he suddenly mentions (very casually, as though it's no big deal) that he's got X City on his list of upcoming places he intends to visit. He moved to my city from X City, and told me he didn't like living there. It didn't suit him. He was only there a year for work. But that's where he met his ex before me, and she remains the one person in the relationship that I was always jealous of.\n\nI called his ex Miss Fabulous, bc she would be described in these glowing terms. He told me that he always got the sense that he was more into it than she was, and that he had really liked her. I got the impression that he had been enamored with her.\n\nSo all of a sudden, this spring, he mentions wanting to visit X City. He didn't like X City. He doesn't have any close friends there. He has a million other places he wants to travel that he's never been. Why go back there? The only draw to X City is Miss Fabulous, his ex, who he's told me he isn't in contact with since the breakup 1.5 years ago.\n\nThen last night, out of the blue, it hits me... Florencia and Miss Fabulous are the same person. There was no Spanish teacher. That story was bullshit. I knew that Miss Fabulous was from Mexico, and I figured out after a little bit of googling, that Florencia is a common female name in all Spanish speaking countries, including Mexico.\n\nHis comment about suddenly wanting to go to X City is what sealed the deal for me, bc that is where she lives. He has no other reason to want to visit there. Of course now all I can think about is how long was he talking to her while we were together, and how angry I am at uncovering yet another layer of his shady behavior.\n\nDoes this sound like a coincidence, or am I onto something?",
        "created_utc": 1530716368,
        "upvote_ratio": ""
    },
    {
        "title": "DAE have problems with flying monkeys within their circle of friends?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/8w0iwi/dae_have_problems_with_flying_monkeys_within/",
        "text": "[deleted]",
        "created_utc": 1530698790,
        "upvote_ratio": ""
    },
    {
        "title": "Has LAN forced major life change for you?",
        "author": "fresh--tendril",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/8w0h3e/has_lan_forced_major_life_change_for_you/",
        "text": "Maybe forced is the wrong word, but necessitated..\n\nI'm still in the middle of an overwhelming amount of confusion and hurt - so there is little point in making some major life moves presently, I suppose. Part of me feels I should just leave the country, and move somewhere anew - make a new life, in a new world. Another part of me feels like I should devote my life to helping others who have been broken down by Narc abuse. \n\nMy employers have kept my job in place for a long time now - but I don't know that I can go back to a job I was half-hearted about. Yet getting back onboard with a group of humans/colleagues again might be just what I need. \n\nIt is so difficult to be decisive when in emotional turmoil. \n\nBut bringing it back to the original question, how much did life after narcissism change things for you? When you got back into the flow of life amongst people again (if you did) how were things different for you? Or did you make a totally new turn in your life trajectory? And did that new way forward go towards making you life more rewarding?  \n\nCheers",
        "created_utc": 1530698174,
        "upvote_ratio": ""
    },
    {
        "title": "How do you handle the guilt for cutting the narcissist out of your life?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/8vxfb9/how_do_you_handle_the_guilt_for_cutting_the/",
        "text": "[deleted]",
        "created_utc": 1530665297,
        "upvote_ratio": ""
    },
    {
        "title": "Tomorrow Morning: an open letter to a childhood friend, and sweetheart, who grew into a N.",
        "author": "lostantares",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/8vvckv/tomorrow_morning_an_open_letter_to_a_childhood/",
        "text": "Dear A,\n\nIn the next coming months, I will be disappearing from your life.  From what I understand of Narcissists, I was discarded finally, but part of me (delusion?  fear?  sadness?) doesn't believe it. A part of me thinks that this is just another one of our phases, and eventually, you may come to your senses, one day.  The bigger, wounded part of who I am, knows that this needs to stop.  So I will be moving nearly 3,500 miles away, with a changed number, a changed internet alias, different emails, different contact methods, different person.  I am doing the hardest thing I have ever done in my life: leaving you, behind.\n\nPeople see how horrible you treat me because of how broken I am in the aftermath.  It's hard to communicate that I once knew who you were before your narcissism reared its ugly head.  How you were once a little boy, full of dreams, full of passion, excitement, and so eager to love.  You kept your abuse hidden with downplayed words.  You kept it hidden by being busy.  You spoke of your neglect with cool verve, you spoke about yourself and your \"garbage brain\" with great disdain.  There was something always a little off: you wouldn't ever talk about it in the open.  In fact, whenever I mentioned it, your reaction would be violently snapping out and shutting me out.  I learned that it was the pink elephant: I had to pretend whatever was happening, didn't exist, with you.\n\nI was in a lonely place, too.  My mother had passed away at a young age, I was getting into alcohol when I shouldn't have, my father gone at work and never home, and my brother disappeared without a trace.  You were my company, for many years, as we kept the loneliness at bay together.   I remember long stretches of nights being up till 1-2AM when college classes were a thing.  When I graduated shortly after and I would show up to work exhausted, because I was till 2AM talking to you about Neil DeGrasse Tyson, or programming, or showing each other stupid YouTube videos to each other.  I loved those nights.  I loved being your friend.  I loved that we were each other's... something.  We were survivors, together.\n\nYou showed me worlds and I learned so much from you.  I wish I could have provided more intellectually for you.  You were brilliant: a child prodigy.  Your mother kept you homeschooled, and you were so quick to learn and understand.  There was so much you tried to talk me into and explain.  You were exciting, and I was luckily along for the ride.  You were there when my Dad got cancer, and you were there for every heart break I went through.  You were there when I did well in school, when I got my job, when you got your first job.  When you got your driver's license, when you were finally salaried, when you griped about University, when I griped about University.  You were at the same level as me, mainly because you graduate high school at 15.\n\nThere's an entire tapestry of who we are, intertwined, in the most important parts of our lives.  The ones where we survived our homes, worked hard with our dysfunctions and made ourselves to be successful.\n\nSomehow, for some reason, you developed a crush on me.  You were persistent for two years before I finally gave away, and dated you.\n\nIt was like our friendship, but with the warmth of fire.  I had never known love like that.  When people say they're in love with their best friend, I had not known what that was like, until you.\n\nYou started to change then.  I was starting to notice the little things: the snark, the snapping, then escalated hostility.  The little cutting remarks.  The condescension.  The rift that was growing between us, where you were looking more and more below and I was starting to look up.  I tried my best to vocalize and fight it.  I was young; only 24, and you, 21.  We didn't last long despite our long-standing friendship.  You compared me with others, mentioned other women, often spoke of emptiness and suicidal thoughts that just never went away.  You spoke how you unintentionally would hurt me to deviate the pain you were feeling inside.  Things were messed up, and eventually came to a head, and we broke up.\n\nYou were shattered.\n\nI was shattered.\n\nWe moved on for half a year, and you pulled me back in.  You were changed even more now.  You seemed distant, detached.  You seemed emotionless, even though you spoke how much you missed me.  I later came to find out that this was \"hovering\", and you were having your first hover on me, your childhood friend.  There were signs of emotional and psychological abuse, the sense of feeling used for sexuality and how you would often forget the private details about me.  When I asked why you even liked me at all, why even come back, you shrugged your shoulders and said... nothing about me.\n\n\"I like your voice and I like how you feel when I touch you.\"\n\nWho are you?  Where is my friend?  Where is my friend who we spent nights talking about video games, talking about our dreams of growing up, about the bus rides home and how summer smelled and how ice cream always seemed to make the day brighter.\n\nWho are you?\n\nThis was a tug of war for three years.  Three years, it was a rollercoaster, as you became more and more detached.  I saw how you got worse.  You started to treat people like they were objects.  You scaled the corporate ladder with fearsome efficiency, and broke 100k in salary before you even hit 23.  I started to notice that you would \"farm\" attention from people, and have this falsified persona.  You would be cruel in private, but in public, be the little boy I knew.  You enjoyed people's blind admiration of you.  You would speak in public and over-complicate topics, just to appear smart.  You enjoyed how people had this god-like opinion of you.  That you were the all knowing, all intelligent, all together, all successful.  Everyone was at your beck and call to please you.  No matter where you went, you had a way of putting a spell on people, and you ate it all up.  It almost felt like I was watching someone desperately feed on others.  Before I knew what it was, I thought I was being jealous.  I didn't know that Narcs needed supply, or else they would spiral into depression.\n\nWhen you didn't have supply, you would get into depression.  You thought yourself bipolar, at some point.\n\nParts of who you are didn't match up: your words never matched your actions.  You would be wanting one thing intensely one moment and then change your mind the next.  Your friendships seemed to be trashed after only a year; the only ones that remained were lavished worshippers who assumed you were a descended God.\n\nI didn't understand.  I tried, desperately, to understand. I couldn't, for those three years.\n\nI tried.  I tried to reach you.  Each time you warmed up to me, I thought it was you slowly growing up, growing out of it.   I thought it was an asshole phase.  Then I thought it was money and power getting to your head.  However, after three years, watching you slowly descend into someone I would even call \"scum\", I can only sadly dread that it is what it could be: NPD.\n\nThese three years have been intermitted in our conversation.  Your abuse would send me off in a rage to fight back, and just as quickly as we would speak and be okay with one another, we would split just as quick.\n\nThis last time around, this year, it was going well.  I thought you really were okay, and coming around.  I thought...\n\nWell, no, you made me believe these things with your acting.  I know that now.  I know that you know I love you, deeply, and only want you safe.  So you used me, and tried to force me into sex.  You forced it three times, and it almost felt like you were ready to rape me the last time.  You didn't care that I kept saying stop - you were hoping that I would eventually \"give in\".  You didn't care when I said I wanted a real relationship with this, and if you wanted sex, a fling, a FwB, that I didn't want to give it.  You wanted me and how you wanted me, and it didn't matter if I was feeling, breathing, crying, anything.\n\nYou blocked me three weeks ago, upon finding out me drunkenly confessing how you nearly sexually assaulted me on our last date in March.  I didn't know she was your flying monkey.  But you have a lot of flying monkeys now, don't you?  I felt uncomfortable how much she knew about me, but I had hoped it was lucky guessing.  You also presented a habit of doing this to women the past year and a half.  It was how she could guess I was describing you, in between the large glasses of Tokyo Teas.  I'm apparently the third in line.\n\nI have educated myself with the habits you've presented over the course of three years.  You will be turning 26 and I, 29, this year.  A far cry from the 16 and 19 year olds we used to be.  \n\nI wish it didn't end this way.  I wish that I had what it took, or I knew the answer, to help you.  Even when you leave a trail of destroyed hearts, friendships, and scorched earth behind you: people see a pretentious, egotistical asshole.  If you truly have NPD, people will soon see you as something almost evil.  I can't see what you've become.  I can only see that young boy, just trying so hard to be normal, messaging me when I came home from school... \"how was your day?\"\n\nI wish I could be angry at you.  I wish I could say that this pain will fuel me into a better life.  I wish I could say that I am going off to better things and you will never be on my mind again.  The truth is, I think I will always think of you.  I think I will always miss you.  I know you were abandoned by your father, and your mother, and never really knew unconditional love.  I know that now, being older, and knowing what really was happening.  I'm sad that I will be one of those people who leave your life, reaffirming that narrative deep in that little boy's conscience.\n\nI will always remember you the way you used to be, the best and sweetest version of yourself, that I knew existed.  Even when many will curse out your name.  There comes a tomorrow morning, where I never existed in your life.\n\nGood bye.\n\n-R",
        "created_utc": 1530648196,
        "upvote_ratio": ""
    },
    {
        "title": "Relationship with FM brother - do you think he'll ever realise he was abused too? TW sexual abuse",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/8vuz35/relationship_with_fm_brother_do_you_think_hell/",
        "text": "[deleted]",
        "created_utc": 1530645309,
        "upvote_ratio": ""
    },
    {
        "title": "I don't trust myself in relationship. (Life after n/parents). Can u help?",
        "author": "BipolarOctober",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/8vstvi/i_dont_trust_myself_in_relationship_life_after/",
        "text": "# I never trust myself when I'm angry.. because I am an AcoN and a bipolar.... Can you help?\n\nI share a flat with BF. I have no money because of a financial strain... so I do my part by cooking, cleaning (deep cleaning sometimes) yeah, not ideal but anyways, he pays for gas &amp; water or whatever and I help. Temporary agreement. The flat is his, by inheritance, he pays no rent, and neither do I.**BUT THEN.... I left a fork on the counter.** \n\n&gt;partner- *never do that again.*  \n&gt;  \n&gt;Why?   \n&gt;  \n&gt;*Because the sink is just there.*  \n&gt;  \n&gt;Dude relax I'm doing the kitchen later. (like I do every single day)  \n&gt;  \n&gt;*yeah* (real \"sweet\" voice) b*ut it's* ***MY*** *house,* ***my*** *rules and you gotta respect that.*\n\nI pick up after him.. and he cannot pick up a spoon for me. So much for sharing a flat. I told him to keep his flat, do his own dishes and cooking. I left quite dramatically, but I was pissed and hurt...Am I being bipolarish, aCON or was I right? What would you do? Is this a red flag?  \n\n I'm actually thinking of moving back to my parent's because I felt just so unwelcome.\n\n*note: please don't comment if it's about my agreement w partner being really old fashioned.  YEAH, it is, yet I have no way of making money right now, and I think it's fine if he pays for gas &amp; water (not rent) and I help out around the house for a tiny part of my day, (apparently it ain't enough for him...)*  ",
        "created_utc": 1530629677,
        "upvote_ratio": ""
    },
    {
        "title": "Am I being a sensitive aCon twat in my relationship?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/8vsqq4/am_i_being_a_sensitive_acon_twat_in_my/",
        "text": "[removed]",
        "created_utc": 1530629027,
        "upvote_ratio": ""
    },
    {
        "title": "Flossing changed my life",
        "author": "PrancerPrancer",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/8vsghw/flossing_changed_my_life/",
        "text": "I’m 5 years NC and I want to share some of the things I’ve learned about healing after narcissism. I’ve started writing - here’s a short post about how flossing daily has had a huge impact on improving my self-worth and resilience:  [https://healingafternarcissism.wordpress.com/](https://healingafternarcissism.wordpress.com/)\n\nWhat do you think? \nWhat kind of resources and things do you think are useful when you’re escaping and trying to heal from narcissistic abuse? \nAlso what do you think of the name ‘healingafternarcissism’?",
        "created_utc": 1530626765,
        "upvote_ratio": ""
    },
    {
        "title": "Did anybody else have a specific time when they realised they have problems relating/trusting?",
        "author": "madeoneover",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/8vq8vd/did_anybody_else_have_a_specific_time_when_they/",
        "text": "I feel like I'm going through that now. I've always understood that my upbringing was horrifying, and that it has left me with a lot of sadness, and in a very theoretical way that it has meant I don't easily trust people. However over the last couple of weeks I feel like I have fully realised the extent to which that has affected my life and relationships. While I have had long term relationships and friendships I can only think of one person I have ever met that I have liked organically. She was lovely, and funny, and cool, and there was absolutely nothing in it for me to be friends with her, or vice versa, it was just a nice friendship based on mutual liking. \n\nI finally got round to comparing that to how I have felt with the other people I have let into my life, and it's SO different. Everyone else is someone I chose for one of the following reasons (although many of those relationships have developed into slightly healthier ones over time and effort)\n\n1. They have practical help that I need, and I trade friendship for access to that help\n\n2. They are supportive above and beyond what is healthy. Think hair-trigger codependent\n\n3. They are in desperate need of rescue themselves, and it makes me feel good to rescue them because it's a bit like rescuing myself by proxy. \n\nI'm not angry at myself, and I do believe that I've treated people with respect and goodness, but the issue is that I don't feel that I have (apart from that one woman) ever actually made a connection with another person. While I keep my relationships in one of these 'safe' categories I can't be hurt by them. But I think I am being hurt. I think that what's inside my head that tells me that people aren't safe it hurting me, and is going to keep on hurting me. \n\nAt the moment when I think of sharing my life with another person, or truly trusting them and compromising out of love I get irrationally angry, I'm CERTAIN that if I ever trusted someone they would use that against me. but that isn't necessarily true. Out of observing the people I do have in my life, even at arm's length, it's clear that people do have their own moral codes, and some people are good and not abusive. So it's just me getting in my own way by not addressing this inability to trust. \n\nHas anyone else gone through a period like this? Realising really truly and deeply how their upbringing is affecting them, in specific ways. If I'm honest what I'm feeling about it is mostly tiredness and fear, but I see that there's also a bit of hope. If I can realise it, then there's also a possibility that I can learn to do better, and maybe have a life with genuine affection or love in it. ",
        "created_utc": 1530602412,
        "upvote_ratio": ""
    },
    {
        "title": "Just lost my only real close female friend. My heart is breaking and I feel so abandoned yet at fault? Am I?",
        "author": "She1Flies2Free3",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/8vp8aq/just_lost_my_only_real_close_female_friend_my/",
        "text": "[removed]",
        "created_utc": 1530591150,
        "upvote_ratio": ""
    },
    {
        "title": "APPARENTLY i stole a prostetic bra",
        "author": "PiscesMermaid87",
        "url": "https://i.redd.it/vdo2k6a82l711.png",
        "text": "",
        "created_utc": 1530558337,
        "upvote_ratio": ""
    },
    {
        "title": "Text",
        "author": "AvalonAPV",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/8vl5ue/text/",
        "text": "This weekend i woke up criying. The dream was about her making fun of my looks and talking about stop paying for my school.\nToday he send me a message saying that she is sick and that i must talk again with her, that he didnt wanted to sent that message but she is really sick. \n\nWell, FUCK HER, when i was about to commit suicide she yelled at me every day, turn off the WiFi on several occasions (my only way of comunication), called me a good for nothing, got drunk every weekend and blame me for not doing anything with her life. I was fuckin dying in that room, bitch. The only reason i survived was spite, i wanted to have a nice life for you to have a real reason to be jealous. Be jealous now. \n\nIm remembering everything, everything, and i have no obligation with you.\n\nFUCK YOU.\n",
        "created_utc": 1530557263,
        "upvote_ratio": ""
    },
    {
        "title": "Being calm feels weird now",
        "author": "pepsi109",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/8vko59/being_calm_feels_weird_now/",
        "text": "I moved out of my mother's apartment into my own. I feel so calm that it's unnerving. I'm actually really bored. My hobby resources are low (no car, no extra money, and no internet except on my phone, friends that live farther away). We're going through a terrible heat wave too and I'm practically allergic to heat, so I haven't wanted to leave my house unless it's for work.\n\nI just feel like I'm barely alive. My mom isn't here to rile me up and I don't feel the despair I felt when I was around her. I'm not angry or sad or happy. I'm mildly annoyed at a bunch of \"first apartment\" things, but that will pass with time. I know this feeling will pass too. It's just so strange.",
        "created_utc": 1530553743,
        "upvote_ratio": ""
    },
    {
        "title": "Artist that asked questions for a painting: Here it is, I'm so nervous. You guys were such a great help.",
        "author": "[deleted]",
        "url": "https://i.redd.it/leruqgf0pf711.jpg",
        "text": "",
        "created_utc": 1530493855,
        "upvote_ratio": ""
    },
    {
        "title": "Thank you for letting me interview you guys. I have been nervous about sharing this piece.",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/8vem0j/thank_you_for_letting_me_interview_you_guys_i/",
        "text": "[deleted]",
        "created_utc": 1530493180,
        "upvote_ratio": ""
    },
    {
        "title": "Thank you for letting me interview you guys. I have been nervous about sharing this piece.",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/8vedmx/thank_you_for_letting_me_interview_you_guys_i/",
        "text": "[deleted]",
        "created_utc": 1530490992,
        "upvote_ratio": ""
    },
    {
        "title": "I started writing...",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/8vcwxk/i_started_writing/",
        "text": "[deleted]",
        "created_utc": 1530477779,
        "upvote_ratio": ""
    },
    {
        "title": "I feel like I am always the “angry shrew”.",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/8vcce4/i_feel_like_i_am_always_the_angry_shrew/",
        "text": "[deleted]",
        "created_utc": 1530473033,
        "upvote_ratio": ""
    },
    {
        "title": "Advice - Cutting Ties/Exposing?",
        "author": "princessentropy",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/8vc9zt/advice_cutting_tiesexposing/",
        "text": "Hey guys,\n\nSo, my father came up to visit me. I've been moved out for about 5 years, a few states away. I didn't know why he chose \\*now\\* all of the sudden, but I accepted it, since I thought he wanted to form an actual father-daughter relationship. It was a terrible visit. He actively made fun of my husband, me, and then ignored us when we spoke. I was relieved but a bit sad to drop him back off at the airport. I have some hope of him being more receptive and human to my emotions than my Nmother, but, he does quite a lot of things that turn me away.\n\nHe spoke to me and said, I wish you and your mother could have an actual relationship. I told him the tip of the iceburg and he still doesn't believe me. \"Hmm, yeah, well, it's still a shame.\" Or \"You know your mother is mentally ill right...?\" It's not an excuse! I know plenty of mentally ill people who don't outright try to verbally assault others, myself included.\n\nThey divorced a few months ago, yet he STILL wants to protect her, give her money, support her and cover for her. I cut ties with my mother for the most part, so I'm wondering... should I just cut ties with him too or give him an ultimatum? I began wondering if he might have some serious FLEAS or if he is a Narcissist himself. He never wants to listen to me when I tell him I have PTSD, how I never want to speak to my mother since all she does is continue to abuse me or blurb out small talk. It's a waste of my time to speak with her.\n\nI also want to be more open about my childhood but it still feels like a dirty secret I need to never air out. It's really halting my progress in healing. My therapist recommended I try forgiving myself but I still can't entirely point the finger at who is to blame, even if I already know. I'm nearing my 30s, I just want to move on in my life and it is absolutely frustrating how scared and frightened I feel towards people who genuinely care about me.\n\nI want to make a public blog detailing my life and trying to give others support who are in similar boats, but, I can't tie my name to it because I'm afraid both of my parents will go on an endless campaign to disarm, discredit and slander me.\n\nI guess, if I could get some advice as to how to approach sharing my story and if I should just go ahead and free myself of these shackles. Thank you all so much, even just for reading, it means a lot to me. I know I'm not wrong but all of the gaslighting always makes me think otherwise.",
        "created_utc": 1530472486,
        "upvote_ratio": ""
    },
    {
        "title": "What I struggle with the most is resentment of people with normal, supportive, loving families...",
        "author": "Mcginty74",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/8va14a/what_i_struggle_with_the_most_is_resentment_of/",
        "text": "I met a woman at a party yesterday and I was struck hearing her share about her life... she is in my city for an internship at a prestigious university, after which she will graduate and start her prestigious career. She is getting married in August, is close to her family, and in general radiated true health and happiness. I realized that she is one of those lucky people who comes from a supportive, loving family, and probably had a perfectly normal childhood.\n\nI do not begrudge other people their happiness and success, and am genuinely happy for friends when good things happen to them in life. Always.\n\nInstead I feel resentment bc it seems like they were launched into life with support that I never had. They were loved and cherished by their families. They were validated and respected as individuals. They were taught boundaries and how to thrive in the world, how to focus and set and achieve goals. They were taught how to be in happy healthy long term relationships. They were taught to never tolerate a partner abusing you.\n\nComing from an abusive family and childhood is its own special baggage. I've been realizing how much it can derail your adult life and cause failure to launch. I have this feeling like I was robbed of a normal childhood, and as a result I have adult issues that have held me back from really achieving anything.\n\nFor me, what really caused me to see my issues was two back to back N relationships, the first of which was very psychologically abusive. These relationships caused enormous suffering, and I was basically a train wreck for several years. Understanding that my having N parents is what led me into these relationships, and caused me to tolerate the abuse when someone mentally healthy would have walked away, has been life changing.\n\nI'm 43 years old and I see around me all the time the evidence of friends and acquaintances my age and younger who are accomplishing so much in life... marriage, children, home buying, career. Understanding how much their having been raised by at least one loving parent, probably contributed to their success, has been bitter for me.\n\nDo you ever feel like you were robbed by your N parents of a normal life? How do you deal with this feeling?",
        "created_utc": 1530453213,
        "upvote_ratio": ""
    },
    {
        "title": "I think my NMum sent me a text pretending to be my sister",
        "author": "OlMonsterFace",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/8v977k/i_think_my_nmum_sent_me_a_text_pretending_to_be/",
        "text": "I have an NMum, an NSis, an EDad and 2 younger, normal sisters. I have been NC for 3+ months.\n\nAfter a long while of hurtful emails/texts/attempted calls from my NMum and NSis, I very recently reached out to my youngest sister. This turned out to be a mistake; as she's 17 and lives with NMum, she very angrily parroted back everything that NMum has been saying, interspersed with some sweary language. So that was a non-starter; but during that period I told the 17-year-old that I have not been reading NMum's emails (partially true; I've read some of them and put the others in a junk folder).\n\nNSis jetted off to America a week ago. Knowing now that I'm not reading her emails, NMum sent a text demanding that I come and see NSis off - she has apparently always been the \"kindest\" person, my \"best friend\". (This is, of course, lies.) I did not comply. If I never see my NSis again, it will be too soon; she followed up that text by [sending me a video accusing me of being complicit in her sexual assault](https://www.reddit.com/r/LifeAfterNarcissism/comments/8t2hwq/shes_out_of_our_hairrr/).\n\nSo I reached out to my middle sister the other day - she's 19, and a level-headed, courageous, intelligent person. I thought it might be good to at least explain to her what's really going on. She sent back an articulate text message some hours later, telling me no, I did not get to choose which members of the family I speak to; that they are \"a package deal, all or nothing\".\n\nI read it again today, and it occurred to me: she couldn't have written it. It must have been my NMum.\n\nIt's laid out in several paragraphs, all of which have the same nasty rhythm and phraseology of NMum's emails. There is more of this \"NSis is your biggest ally and more kind and forgiving than anyone\" BS; more barely-veiled commandments (esp. to not contact 17-year-old sister again). It does not sound like her - I've never known her to send me more than a couple of sentences in communication, if that. Certainly she's never used phrases like \"folie-a-deux\" or \"disownment purgatory\" before.\n\nIt could be that NMum dictated it to her, or even grabbed her phone and wrote this without her knowledge. Or it could be that, like NSis, she's become a clone of NMum. But I don't want to believe that.\n\nI don't know what to do, except maybe wait - maybe for years - for her to see NMum's true colours.",
        "created_utc": 1530443068,
        "upvote_ratio": ""
    },
    {
        "title": "Feeling un-invested in life after N abuse?",
        "author": "throwaway7483673",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/8v94y8/feeling_uninvested_in_life_after_n_abuse/",
        "text": "**Content Warning: Mentions of suicide, suicidal ideation**\n\n\nDoes anybody else who grew up dealing with NParents feel generally un-invested in life? This is something I've been dealing with for a long time, but only recently have been able to put a finger on.\n\n\nThere are tons and tons of shitty people, abusers, in the world. Shitty people attract other shitty people. Sometimes, in fact a lot of times - these shitty people will get together and have a kid(s). The way I look at it: Two shitty people, my NParents, got together and created a body that I'm now in control of.\n\n\nThey treated me like shit, and robbed me of my childhood while I was too weak and vulnerable to do anything to fight back, leaving me with a ton of mental baggage to deal with for the rest of my life - not to mention a complete lack of a family and any parental support at all.\n\n\nWhat's the point of living? Who gives a shit? Simultaneously, what's the point of suicide? Why would I cut off my life early when I'm going to ultimately die anyway?\n\n\nDon't get me wrong - I have friends, I have hobbies, interests, etc. I'm not depressed, I went through that before and know what it's like. I do plenty of things in my life that bring me joy, and have some great, fun friends. But I'm not *invested* in it. I don't really have some kind of majestic, noble life goal or anything; because I don't give a shit. I didn't sign up for this. I didn't consent to being born here. I'm not motivated, and never will be, because there's no point.\n\n\nHas anybody else experienced feeling similar to this?",
        "created_utc": 1530442141,
        "upvote_ratio": ""
    },
    {
        "title": "My ex-friend may be a Narcissist...",
        "author": "shockinghillaryquote",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/8v86a6/my_exfriend_may_be_a_narcissist/",
        "text": "Very long friendship of 20 years, ended a few years ago. I think I may be damaged from it.\n\nI'm an introvert and rarely ever make friends with anyone, so naturally I tend to 'latch' onto who I do end up making friends with.\n\nAnyway, he was a loud-mouth, always putting me down, nitpicking my life endlessly over the years in subtle and not-so-subtle ways. A bit of a bully (and huge hypocrite, since he never lives up to the standards he preaches; this is not even my opinion, it is ostensibly true and he has agreed it is true when pressed but doesn't seem to care).\n\nThere came a point I ended up dating a girl, and he demanded I stop dating her. He had reasons, which I will explain below. He said I was \"disloyal\" and he became increasingly irate.\n\nThis pushed me to the edge, to where I finally stood up to him. He admitted I was right, but then blocked me on FB.\n\nI could never get past it, never feel right. I kept needling him. Would occasionally pop up on his FB and post something sarcastic. I felt like he walked away.\n\nI finally really pushed him, and he responded, and the anger and threats ratcheted up... he finally threatened me, and then I threatened him back, and then he backed down.\n\nWe talked a bit, and he sort of said, \"You're finally admitting your mistakes.\" I wasn't, really, admitting much of anything, but I think the threat I levied back at him made him think twice (he has broken federal law under many circumstances, and I have the \"goods\" on him and reminded him of that, after he threatened me).\n\nHe goes on, says I was disloyal.\n\nHe says how much it hurt him.\n\nThe issue was this girlfriend, years ago. It was the sister of HIS GF.\n\nThis gets a little complicated, but follow along if you can, as these little details are important:\n\nHis GF had broken up with him, left town and went to stay with her sister. His GF trashed him to her sister and other people. He got the impression his GF's sister had \"bad mouthed\" him, too, and that set him off. He hates her ever since.\n\nHe eventually got his GF back, after exploding and sending her a few long emails ranting at her. She came back to him and is still with him.\n\nYears later, I meet the sister, I like her, date her, and he goes ballistic over it. I come to learn it was a misunderstanding of sorts, and in my view, it was just a matter of blood supporting blood. His GF had gone off to her family, trashed him, and her sister just sort of sat back and supported her with expected things like, \"Well, if you're not happy, you should leave him.\" This absolutely set him off.\n\nI would explain to him, \"What did you expect? It's a third party who got dragged into this, of course they will defend blood over you. The issue is your GF, not anyone else who was involved, they just sat back and listened to all the drama and reacted as anyone would. They are not bad people, they have nothing against you, and still hating them after all these years is ridiculous.\"\n\nThat was not good enough for him, as far as he was concerned, I shouldn't date her -- period -- because he said so. \n\nIt should be noted the sister, who he hated, argued in her defense and said she had no \"designs\" against him, did not even KNOW him, she just offered advice to her sister. That's it. And it is true, that she never once said his name, brought him up, wrote her sister about him or meddled in ANY WAY, ever, not once.\n\nBut, he didn't care. The fact she said a few words of support in favor of her sister five years ago was unacceptable now.\n\nFor him, this is untenable, he gets nastier and nastier. I start to push back and call him out on the hypocrisy in his OWN life -- which is the size of a mountain. He's blindsided by it, admits I'm right, says it hurts, says it's \"too late\" to fix, calls me scum, then blocks me.\n\nI could never get past it. It felt all wrong. Like he first tried to control me and my life, then walked away when he got called out.\n\nSo, I needle him, and he finally responds, trashes me, says I was disloyal. I tried to explain I never intended to be disloyal.\n\nIt just seems like he's incredibly controlling. He went ballistic when his GF broke up with him years ago. He exploded at her. He ended up hating everyone who was involved -- particularly the sister, who was dragged into the drama, because they didn't \"side\" with him. Then he ends up hating me because I started dating the sister (who seemed to me to be a low-key, nice person, who did not even know him and never said a word about him after the incident). \n\nIf the sister was some nasty \"meddler\" I could understand his point of view, but she wasn't. At all. She didn't know him, never said a damn word about him, other than the few nights her sister showed up after breaking up with him, whereby she delivered what anyone would call \"sisterly\" advice.\n\nI felt like he was trying to control MY life... HER life...even his GF's life... it's like no one had a right to make any choices he didn't approve of. And he was paranoid of people talking \"bad\" about him, the GF, the sister, third parties involved. \n\nI feel like my mind is so twisted from all this. \n\nMaybe I am a bad friend and disloyal.... or maybe he's just a controlling a-hole. \n\nI never wanted to be disloyal, but I felt his claim of \"disloyalty\" was unmerited. \n\nHe also said he hoped to work things out, but everything is always on his terms -- I need to admit I'm wrong, and he never concedes ground. So the terms of the friendship, if they were to continue forward, it would appear would involve me being in the \"doghouse\" perpetually.\n\nI should add this guy is the biggest hypocrite I know on Earth. Constantly preaching about other people -- yet does all the things he complains about other people doing. Including meddling. \n\nHe'll occasionally, when pushed, admit all of it is true but then does nothing to change. \n\nSo, anyway, that's the story.\n\nPart of me misses the guy, part of me wonders if he's just so toxic and full of shit that having him as a friend would be detrimental. Maybe it was damaging for 20 years, too.\n\nIf he read this I think he would exclaim, \"There you go again, deflecting!!! Pushing it on to me!! No accountability!!! You'll always be garbage!\"\n\nI know it's just one side of the story but I think that's a pretty good picture of it. I'm not saying he is for sure a Narcissist... but something is off. He is, at least, very controlling. Loyalty, for him, means doing what he says or wants, no matter what.",
        "created_utc": 1530427285,
        "upvote_ratio": ""
    },
    {
        "title": "Does anyone else feel icky after phone calls with their N parents?",
        "author": "Mcginty74",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/8v3hh0/does_anyone_else_feel_icky_after_phone_calls_with/",
        "text": "Luckily Ndad and Nmom live 1000 miles away. I keep in touch with them via phone calls. Since coming out of the fog and realizing they are Ns, I have become much more aware of how interacting with them makes me feel.\n\nDuring phone calls, my father is not capable of showing much empathy at all. Instead, he assumes an interrogation style of questioning you about whatever you're talking about. He'll just keep hammering you with questions, instead of connecting with you. It's incredibly irritating.\n\nHe also talks to me and my only sibling using baby talk. We are both in our forties. Sometimes when he starts up with that high pitched voice, like people use to talk to their pets, I can literally feel my skin crawl. It's demeaning to be talked to like that.\n\nIf you actually say something meaningful, or share something of interest going on in your life, my mother likes to respond with an unrelated question:\n\nMe: \"I feel really frustrated that this is going on in my workplace and I'm not sure what to do about it.\"\n\nNmom: \"So... what are your plans for the weekend?\"\n\nI end up feeling dismissed and like she's not very interested in my life. I think there is *some* interest there, but it's very superficial. My mother is not someone you go to for emotional support - I literally have not ONE memory of her being a comforting, soothing, tender parent with me when I was growing up. Underneath the superficial relationship she wants to have with her children, she is very cold and rejecting. There have been times in my life when I've felt downright hatred from her.\n\nSometimes I hang up with them feeling icky and gross. I feel a shudder of revulsion go thru me, and am often vaguely angry and I think it's bc of their subtle disrespect.\n\nI was wondering if anyone else experiences anything like this after talking to your N parent or parents?",
        "created_utc": 1530380362,
        "upvote_ratio": ""
    },
    {
        "title": "Being pessimistic",
        "author": "failedcheerleader",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/8v1tdi/being_pessimistic/",
        "text": "Have people commented that you are \"too pessimistic\", cynical, jaded, etc, or something along those lines?\n\nI've learned over time that i have to put conscious effort into not voicing my sad, hardened take on everything. I've learned that \n\n1) socially speaking, it is punished. this behavior can really work against you.\n \n2) i must maintain near-constant vigilance in order to come across as 'normal' and not broken in mind and spirit. the effort required is not insignificant. it is worth it however because of how positively it's received socially/in relationships\n\nHow about other N survivors? Any tips or insights, experiences with this?",
        "created_utc": 1530364996,
        "upvote_ratio": ""
    },
    {
        "title": "I am trying to figure out the level of trauma I must have on my brains. Do you think this was \"pedophile\" type behavior from my mother's side?",
        "author": "MaxSteelMetal",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/8uyzxb/i_am_trying_to_figure_out_the_level_of_trauma_i/",
        "text": "I am a male in mid 30s, but I been thinking a lot about my porn addiction and sex addiction recently. I am not trying to shift the blame to anyone else , but at the same time there are some things I have never told anyone about my mother .\n\nWhen I was younger, me and my brother used to play with my mom by laying on her belly ( Exposed ) , but it was all in fun.\nBut when I grew older, she would always pretend to stay sick and would want me to give her a massage her legs all the time. She has done it far too many times. I have only massaged her feet once, but I stayed away from her \"requests\" like a plague because it just felt icky to me. \n\nShe always abuses me every chance she gets. Do you think what she did was not respecting my boundaries ? Something else I find weird about her is that she always talk on the phone with my friends . I find this extremely creepy since even I don't talk to any of them any more .\n\nMoreover, my father had sexual abusive tendencies and used to touch my bare bottom ( when I was a kid ) while sleeping with him . But when I brought this up with my mom, she always ignored it and yelled at me for even bringing it up.\n\n\np.s: I have been sober from porn and masturbation addiction for the past 330 days until this month when I had a relapse. But I am trying to get back on the wagon and this behavior from her keeps popping up in my mind for some reason.\n",
        "created_utc": 1530328216,
        "upvote_ratio": ""
    },
    {
        "title": "Is it worth contacting the golden child sibling to try to find a common ground?",
        "author": "fresh--tendril",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/8ul4eg/is_it_worth_contacting_the_golden_child_sibling/",
        "text": "As scapegoat I have tried with both dysfunctional parents - but they have just become increasingly nasty in subtle awful ways. \n\nSo I had to go no contact. But because the golden child sibling is still in close proximity to them, he is still presumably following the dictates and cult-like state of mind of them all. I presume. Or otherwise he might not be following that but has his own Narcissitic agenda. In any case I never hear from him, even though we never fell out at all. So it is the level of family dysfunction that has separated us - probably intentioned triangulation from the Narc parents. \n\nIs there any point in arranging to meet with this sibling? Or will I be just wasting my time attempting to explain the situation from my point of view? I would hope in time, once I have worked through my anger and emotions, to be fully able to wish all of them well - and perhaps even try to support them, in time. But they do not hae anywhere near the emotional maturity to see this. They have likely gone fully against me since I have insisited on no contact. \n\nWould you recommend contacting a golden child sibling? Or not? ",
        "created_utc": 1530204097,
        "upvote_ratio": ""
    },
    {
        "title": "Cycle of abuse continues but...",
        "author": "glimmerinthedust",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/8ul10w/cycle_of_abuse_continues_but/",
        "text": "I've been wrestling with this for a while, so any clarity to my thought process would be helpful :)\n\nI only know the past 6 or 7 years of his past, but the cycle my Nex puts girls through is that he dates a girl, abuse occurs, he becomes disillusioned, breaks up with them and dates the girl's best friend. Or close friend. This happened to the girl before me too. She was my mentor, and I was somehow convinced that it was okay to date him 2 weeks after they broke up. So there's like a chain of girls whose lives were ruined by this guy, and then had people they loved taken away from them. \n\nEveryone knew that he was a toxic person to date, but it was extremely confusing as to why exactly. Girls just kept assuming that they were going to be \"the one,\" his true soulmate, unlike his psycho exes that he would talk about. So after my breakup, I went straight into therapy because I knew he had a bad past and took a while to sort out what happened to me. Then I reconciled with and discussed with my mentor about what happened, and even wrote blog posts / told everyone around me my story so that they could actually be prepared to watch out for similar guys and avoid the tactics of this particular guy. I really wanted to end the cycle, or at least make it harder for him to continue it.\n\nOne of my close friends, however, told me that I was overreacting and was completely unreasonable. This girl, although she was a good friend of mine, has some issues of her own. She is a complete flirt and throws herself at guys to draw attention, but when guys actually show interest, she's disgusted. There were a few times where I gently confronted her about her behavior, but she would just say something like, \"Are you jealous?\" or \"I think you're the one who has the problem.\" There were also times such as when we were sharing a dance room with a dance club that was doing a dance cover that our group already did, and the whole time she was trash talking them and rolling her eyes at them, and dancing as obnoxiously as possible to intimidate them. She was generally really nice and treated you really well if you were her friend, but there were definitely times that made me uncomfortable.\n\nOverall, she lacked a lot of empathy towards me and others, and prided herself to be extremely logical and self-controlled. I had a feeling that she and my Nex would start something because of how she flirted with him so soon after our breakup, so it was no surprise to me when they actually started dating.\n\nI don't feel hurt at all...probably because I suspected this and long forgave them, but I do feel really disappointed by them. I thought that our friendship and all the evidence I acquired would alert her \"logical side\", but I think she just completely ignored it. She kept saying, \"I'm sorry...I really do feel your pain, but it just happened.\" \n\nPart of me thinks that she also has narc tendencies (or maybe she's just a shitty friend), but another part of me is like \"should I feel bad for her?\" because she could very well be the next victim. Because I and the other exes did the same things...but unlike her, we didn't know anything to begin with...\n\nI don't know. :x Thoughts? By the way, I have long cut both of them off. Just wrestling with these strange thoughts now.",
        "created_utc": 1530203467,
        "upvote_ratio": ""
    },
    {
        "title": "Life after narcissism in the workplace?",
        "author": "alexislynncatherine",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/8ukdjz/life_after_narcissism_in_the_workplace/",
        "text": "Hi everyone. \n\nI got out of my narc's household about 3.5 years ago when I left for college. I thought that I was doing well at college, and that I didn't really have any significant triggers/remnants of abuse left. \nHowever, in my internship this summer I've noticed that I fear both of my managers like I used to fear my parents: I fear messing up, I fear when my manager chastises me if I make a mistake, etc. \n\nI've also noticed that I reverted back to my \"walking on eggshells\" mode when my manager chastised me today. \n\nDo any of you guys have any tips or support? ",
        "created_utc": 1530199168,
        "upvote_ratio": ""
    },
    {
        "title": "How do a Narc and Inverted Narc couple survive together until the end?",
        "author": "fresh--tendril",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/8ujcgp/how_do_a_narc_and_inverted_narc_couple_survive/",
        "text": "If they have already been subtely hateful of each other all their lives - does the hate remain covert? Or does it bit by bit become increasingly overt abuse? \n\nI am glad to be out of the nuclear family, as they were steaming all their miserableness off onto me. \n\nIt seems they unconsciously feel that hate and put downs is all they deserve, so maybe they will just live out their lives 'happily'...\n\nBut they are only seeping out their unexpressed torment all these years - so is there bound to be an explosive release between them as they get into their 70's/80's?",
        "created_utc": 1530192058,
        "upvote_ratio": ""
    },
    {
        "title": "Just had my second child, this time no nFamily or nEnablers involved",
        "author": "raisedbyNParents",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/8udtrz/just_had_my_second_child_this_time_no_nfamily_or/",
        "text": "Though a part of me wishes there were reliable and loving blood/origin family members I could count on and share this moment with, I am much more stress free this time around. My family who I actually can count on consists of my kids, husband and in laws.\n\nThis time there is no subtle guilt tripping / pressure from relatives to reconcile with nMom and let her see the baby, and trying to make me feel bad that she is lonely because she's a widow. NOT my problem. Nobody from my family knows I was pregnant and had another baby. My kids will not be used as pawns or bargaining chips.\n\nI'm working on creating my family of choice, maybe connecting with other parents more. I'm catching up on socializing with others since they isolated me for so long. \n\nIt means a lot to me to have a daughter because i can give her what I didn't have - and make sure she never has body image or self esteem issues the way I did because of my parents, esp my mom's bullying.\n\nI've been to therapy, and I've worked hard to get better - I won't let them taint this moment again.",
        "created_utc": 1530137081,
        "upvote_ratio": ""
    },
    {
        "title": "Finding Myself For The First Time",
        "author": "AMothToACandle",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/8uc2y2/finding_myself_for_the_first_time/",
        "text": "Hello everyone, I feel like I need to express what I've been going through these past few months. Around March I began to listen to my intuition. And it was telling me to get the hell out of dodge. So I did. I moved to a new city, made healthy relationships with actual friends who actually have feelings, and I am determined to become more independent. \n\nI recently found out about the subject of narcissism and it has been a topic of research that has caught my eye for a while now because it's all beginning to make sense. All my past relationships have belittled me to the point where I completely lost my identity. I would question my own intelligence due to name calling and being patronized. I didn't know who I was, I still don't. I would always try and fit the needs of others without putting my own first because thats what I thought what was right. I feel like I'm being my authentic self for the first time EVER. \n\nIt's confusing. My life is completely disorganized. I sometimes feel like I have a difficult time socializing because I always lacked that authenticity. Not only that but I was extremely co-dependent because my Narcs would make me feel like I couldn't handle anything on my own. I just want to get my shit together and start living the life that I want to live. A more independent lifestyle. ",
        "created_utc": 1530124147,
        "upvote_ratio": ""
    },
    {
        "title": "Part of me pities narcissists",
        "author": "BipolarOctober",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/8uacgv/part_of_me_pities_narcissists/",
        "text": "This might be an unpopular opinion, but it's only a cold point of view to my personal experience. I *was* emotionally abused by a narc/parent. Strangely, empowering myself has made me pity some narcissists.\n\nIt's known that to a certain extent they are emotionally stupid. I think of them sort of like drug addicts, compulsive, wanting a dopamine rush that they get from their sadistic tendencies.\n\nSadism is pleasurable. If it weren't, narcissists and APD people wouldn't exist. (Sadism is even considered a normal part of neurotypical sex.)  What isn't normal, perhaps, is a person who can't get a grip and stop their underdeveloped &amp; addicted brains to being anal and shitty to people.\n\nNot to ruin anyone's entitled dislike of them. I think pity and antipathy towards them are compatible. They don't seem fucking happy.  Perhaps feeling pity means I am empowering myself.\n\nHave you had this experience?",
        "created_utc": 1530111962,
        "upvote_ratio": ""
    },
    {
        "title": "What are some good subreddits other than this one, for support?",
        "author": "Erratic85",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/8u3mbe/what_are_some_good_subreddits_other_than_this_one/",
        "text": "",
        "created_utc": 1530046498,
        "upvote_ratio": ""
    },
    {
        "title": "I'm going to divorce my narcissistic husband",
        "author": "nyskar",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/8u3le2/im_going_to_divorce_my_narcissistic_husband/",
        "text": "So...I'm not sure where to even begin.  Five years ago I married the man of my dreams.\n\nWe met ten years earlier.  He had always told me had never been close to his family, just his mom.  She lives in another state so I've hardly gotten to see her.  We don't spend holidays with his family (his choice) and I've always thought that was strange.  But hey, i guess not all families get along.\n\nWell fast forward to the end of 2017.  He just one day left me for another woman.  I felt so lost and confused.  There were no warning signs.  When I talked to him he just told me that this was my fault and I was to blame because I treated him like shit.  WTF??? When? How? What?  \n\nHis mom reached out to me about a month ago finally knowing what's going on.  We started talking about him.  And then it clicked.  He kept me away from his family because everything he has ever told me has been a lie.  Everything from where he grew up, went to college, past jobs, etc.  \n\nI feel crushed, embarrassed and broken.  \n\nDoes anybody have any advice or any way they can relate.  ",
        "created_utc": 1530046300,
        "upvote_ratio": ""
    },
    {
        "title": "Couples counselling",
        "author": "newthistle",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/8u2t4q/couples_counselling/",
        "text": "Holy crap. I’ve just attended a car crash of a counselling session that was so nasty the counsellor asked halfway though if we really wanted to continue.  I’m done with this and am embarking on my own psychotherapy programme which I’ve managed to get unlimited sessions for free.  Women’s aid in Scotland is truly amazing.  \nHurt again but I’m in my own flat and the door is locked and no one can take any of this away from me.\nLesson learne",
        "created_utc": 1530040595,
        "upvote_ratio": ""
    }
]