[
    {
        "title": "When walking tighten your core, it helps tremendously with posture and relieves pressure off the spine.",
        "author": "blueeyebling",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10yaslu/when_walking_tighten_your_core_it_helps/",
        "text": "[removed]",
        "created_utc": 1675987766,
        "upvote_ratio": 1.0
    },
    {
        "title": "[LPT Request] How to negotiate a staggering vet bill",
        "author": "Beautiful-Page3135",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10yaf8d/lpt_request_how_to_negotiate_a_staggering_vet_bill/",
        "text": "My dog is a rescue. He's 10 years old, 150 pounds, healthy as you could expect for a dog his age and size, sometimes he's still like a puppy. We've been having him checked for diabetes at his geriatric appointments for the past couple of years, the last being 2.5 months ago, and everything always came back normal; however, he went into DKA this week which, obviously, has required some emergency care. He's been in the hospital for 3 days, and the current estimate is $15,300 if we pick him up tomorrow.\n\nFor context, we told them right off the bat that he doesn't eat in strange places for strange people, and not to expect him to eat. When he wasn't eating they gave him an NG tube and used his anorexia as a reason to keep him under observation. When I told them I was picking him up tomorrow either way because he's stable and they have his insulin dose relatively dialed in, they asked if I wanted them to insert an esophageal feeding tube to help me feed him when he gets home--obviously, knowing my dog and his predilection to not eat unless he's home with us, I did not authorize that. It seemed like a cash grab more than anything.\n\nThis isn't about \"if you can't afford the pet, you shouldn't have it.\" We've paid everything out of pocket, including a $7200 cancer surgery two years ago. We have an emergency savings account, and we have pet insurance (ASPCA) that reimburses us up to $10k a year. Between the two we've never been in a tough spot. This is a bill we could pay--it would hurt like hell, but we can afford to pay it.\n\nThis bill, though...it seems *really* high. $15k for 72 hours of treatment? He was in the hospital after cancer surgery for an entire week and the whole thing cost less than half of this. Something isn't adding up.\n\nAnyone have advice on how to negotiate this down? Like I said, we can afford it thanks to saving an emergency fund, but we also don't want to clean out all our savings for this. We feel like we're being taken advantage of. Do I ask for their charge master and demand to be charged their cost for all medications and expendables? I don't know what to do other than be furious.",
        "created_utc": 1675986829,
        "upvote_ratio": 1.0
    },
    {
        "title": "[Request] Negotiating a staggering vet bill",
        "author": "Beautiful-Page3135",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10yae8t/request_negotiating_a_staggering_vet_bill/",
        "text": "[removed]",
        "created_utc": 1675986760,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT: GET LIFE INSURANCE AS SOON AS POSSIBLE",
        "author": "cleosmith",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10y9oze/lpt_get_life_insurance_as_soon_as_possible/",
        "text": "[removed]",
        "created_utc": 1675985019,
        "upvote_ratio": 1.0
    },
    {
        "title": "GET LIFE INSURANCE AS SOON AS POSSIBLE",
        "author": "cleosmith",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10y9mh4/get_life_insurance_as_soon_as_possible/",
        "text": "[removed]",
        "created_utc": 1675984843,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT: Linguistically speaking, there is NO SUCH THING as a \"common\" pronunciation or grammatical error. If it is common, it's not a mistake!",
        "author": "socess",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10y9iux/lpt_linguistically_speaking_there_is_no_such/",
        "text": "For example, *should of* and *could of* have been studied by linguists as new grammatical forms. (I'd link the papers, but the sub doesn't like links.)\n\nOnce you stop getting your undies in a twist over how other people speak and write, you can stop stressing and start being fascinated by the language variety all around you.",
        "created_utc": 1675984605,
        "upvote_ratio": 1.0
    },
    {
        "title": "GET LIFE INSURANCE AS SOON AS POSSIBLE",
        "author": "cleosmith",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10y9igb/get_life_insurance_as_soon_as_possible/",
        "text": "[removed]",
        "created_utc": 1675984577,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT: if you want your dog to look at the camera for photos, maintain eye contact with them. To a dog, looking at your camera viewfinder just looks like you are focused on your phone and not them",
        "author": "MKorostoff",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10y98dy/lpt_if_you_want_your_dog_to_look_at_the_camera/",
        "text": "They don't understand that there's a tiny image of themselves on the screen. All they see is that you're busy with your phone, not that you are looking at them through the phone.",
        "created_utc": 1675983907,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT Request: What is the best/safest way to jump out of the moving car?",
        "author": "HeadSpade",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10y90uj/lpt_request_what_is_the_bestsafest_way_to_jump/",
        "text": "",
        "created_utc": 1675983423,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT: Keep your cordial/squash/dilutes bottles in the fridge",
        "author": "nabster1973",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10y8xfe/lpt_keep_your_cordialsquashdilutes_bottles_in_the/",
        "text": "Keep your cordial/squash/dilutes bottles in the fridge\n\nI’ve been doing this for the last 10 years and it makes such a difference to the temperature of my drink once I’ve diluted it with water. Especially in warmer weather, where my tap water might not be so cold. \n\nIt also helps keep the bottles out of sunlight in the kitchen.\n\nAs an extra tip I keep filtered bottled water in the fridge anyway.",
        "created_utc": 1675983195,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT: Always Job Hunt Before Getting Laid Off",
        "author": "satans_toast",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10y8ui9/lpt_always_job_hunt_before_getting_laid_off/",
        "text": "Whenever you sense your company is in trouble, begin looking for a new job. It is SO much easier to find one while still employed. Pau attention to how your company is doing, at first sign of trouble, plot your exit.",
        "created_utc": 1675983001,
        "upvote_ratio": 1.0
    },
    {
        "title": "Keep your cordial/squash/dilutes bottles in the fridge",
        "author": "nabster1973",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10y8qol/keep_your_cordialsquashdilutes_bottles_in_the/",
        "text": "[removed]",
        "created_utc": 1675982752,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT: there's an app called 'Too Good To Go'. Restaurants sell surplus as \"surprise bags\" for cheap, reducing food waste and giving access to cheap meals for those that need them.",
        "author": "phlegmah",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10y896j/lpt_theres_an_app_called_too_good_to_go/",
        "text": "A friend just turned me on to it. Not sure how useful this is in less urban areas, but there are plenty of options in cities. \n\nYou purchase what amounts to a surprise bag, but it'll have food relative to the restaurant selling it. Example: a surprise bag of bagels from a bagel store, or a bunch of garlic knots from a pizza place, etc. \n\nGood deals, too, for people who might be looking for cheaper eating alternatives.",
        "created_utc": 1675981610,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT: Synthetic Oil Change Frequency (don't get ripped off)",
        "author": "Free_Solid9833",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10y7j2a/lpt_synthetic_oil_change_frequency_dont_get/",
        "text": "TIL  that synthetic oil changes should happen every 7500 miles (though my   owner's manual says 5k). Went to a Popular Oil Change place today and   the sticker they gave me was 3k (which is correct for conventional   oil). Synthetic oil is expensive. They're actively ripping you off if   you go by the sticker mileage. Question everything.",
        "created_utc": 1675979948,
        "upvote_ratio": 1.0
    },
    {
        "title": "Easy Amazon voucher earn today",
        "author": "Dependent-Ocelot-509",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10y7e9f/easy_amazon_voucher_earn_today/",
        "text": "[removed]",
        "created_utc": 1675979616,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT Request: Sleepy to the point where I can't get anything productive done even tho I get 7-8hrs of sleep daily.",
        "author": "why-doineedaname",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10y7bde/lpt_request_sleepy_to_the_point_where_i_cant_get/",
        "text": "Hello everyone!\n\nLately I've been having a lot of trouble getting anything productive done cause I'm way too sleepy and therefore can't concentrate on a particular task even though I get 7-8hrs of sleep regularly.\n\nI'd really like to know how to tackle this. Any explanations for why is it happening would be appreciated too.\n\nThank you! &lt;3",
        "created_utc": 1675979420,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT request: cheapest way to get prescribed medicine",
        "author": "T_Blatt",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10y6xo8/lpt_request_cheapest_way_to_get_prescribed/",
        "text": "[removed]",
        "created_utc": 1675978493,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT Requests: How can someone learn to respect themselves, balancing selfishness with selflessness?",
        "author": "lenimen",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10y6v7l/lpt_requests_how_can_someone_learn_to_respect/",
        "text": "[removed]",
        "created_utc": 1675978332,
        "upvote_ratio": 1.0
    },
    {
        "title": "Synthetic Oil Change Frequency (don't get ripped off)",
        "author": "Free_Solid9833",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10y6ujo/synthetic_oil_change_frequency_dont_get_ripped_off/",
        "text": "[removed]",
        "created_utc": 1675978294,
        "upvote_ratio": 1.0
    },
    {
        "title": "Oil Change Frequency (Avoid Ripoffs)",
        "author": "Free_Solid9833",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10y6t1d/oil_change_frequency_avoid_ripoffs/",
        "text": "[removed]",
        "created_utc": 1675978207,
        "upvote_ratio": 1.0
    },
    {
        "title": "If you would like to drive a Supercar or any other 600+ hp car, first try your hand at 400 hp RWD cars and make yourself accustomed to that power before you drive any other high HP car and end up wrecking it.",
        "author": "mbashs",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10y6qta/if_you_would_like_to_drive_a_supercar_or_any/",
        "text": "",
        "created_utc": 1675978065,
        "upvote_ratio": 1.0
    },
    {
        "title": "Smooth as a baby's...",
        "author": "steveblobby",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10y6ks5/smooth_as_a_babys/",
        "text": "[removed]",
        "created_utc": 1675977664,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT: The best thing you can do for yourself when you’re starting to work is getting a leadership role.",
        "author": "spicysenpai6",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10y6h5v/lpt_the_best_thing_you_can_do_for_yourself_when/",
        "text": "Given the type of job and company.  A leadership role teaches you a lot about yourself and how to properly interact and delegate tasks to people.  \n\nI started my management path with goodwill being a store supervisor.  It was actually kinda tough because I had to delegate tasks and/or talk to(or even discipline) people who were twice my age.  I had some pushback, but I didn’t falter and I gained their respect.  \n\nI was also a store manager for a shoe company, and having to hire, train, and evaluate younger employees was easier for me to do because I know they could either take my advice or not.  And if they didn’t I would coach them.  It just gets easier as you go.  \n\nEventually, I found myself out performing other people at other jobs because I had management experience where I was in a position where I was held to a standard and I had to abide by those standards, so it just taught me to become keen to work and to hold myself to my own standards and not deviate from those standards.  \n\nHaving leadership roles helps you in your career as well as your personal life.",
        "created_utc": 1675977430,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT: If you're one those people like me who kept using the spoon to drink the milk even after there was no more cereal - stop. Just directly chug it all in literally 5 sec. You're wasting your life. There are better ways to live. Thank you.",
        "author": "PedroRibs",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10y5za3/lpt_if_youre_one_those_people_like_me_who_kept/",
        "text": "",
        "created_utc": 1675976259,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT REQUEST: How to be a popular at university?",
        "author": "Coffeecup7",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10y5yon/lpt_request_how_to_be_a_popular_at_university/",
        "text": "",
        "created_utc": 1675976220,
        "upvote_ratio": 1.0
    },
    {
        "title": "Grow Your Online Business And Make $700/Day!",
        "author": "HappyJellyfish3263",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10y5xj8/grow_your_online_business_and_make_700day/",
        "text": "[removed]",
        "created_utc": 1675976143,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT: “should of” or “would of” does not mean anything and is wrong.",
        "author": "UrsaBeta",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10y5a0p/lpt_should_of_or_would_of_does_not_mean_anything/",
        "text": "For some reason this is becoming more and more common in recent times. \n\n~~Should of~~ - **Should have / should’ve**\n\nApplies to all…would, could, should, must, might and so on.",
        "created_utc": 1675974567,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT: Do not use companies that are not registered with the Better Business Bureau",
        "author": "RunRevolutionary9019",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10y55ui/lpt_do_not_use_companies_that_are_not_registered/",
        "text": "As much as people malign the BBB I have never had a negative experience with them IF the company in question was registered with them. \n\nChase Visa had an executive call within days when I complained that they had scammed me and ruined my credit and my credit was fixed within a month. U Haul gave me a free trailer hitch just this year. But if a company isn't registered with the BBB you will get no where because there is no one to defend you. The way I see it companies that register with the BBB care about their reputation and ones that don't couldn't give a crap. Namely Pacific Bell and Khols. Do not get Khols charge cards whatever you do unless you want to deal with lots of headaches and ruined credit.",
        "created_utc": 1675974295,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT: Your phone/laptop constantly broadcasts the SSIDs of every wifi network you've ever connected to. Delete the networks you will no longer use from your saved networks.",
        "author": "goodguybart",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10y53ja/lpt_your_phonelaptop_constantly_broadcasts_the/",
        "text": "If you've ever connected to the free wifi of a restaurant, hotel or other business, then your phone is constantly looking for that network to connect to it again. In theory someone could capture all those connection requests and extrapolate where you have been.",
        "created_utc": 1675974129,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT if petting a cat creates static electricity and shocks them and you, it is often due to low humidity in that area. You can temporarily get rid of the shock by having some contact directly with the cat, i.e. paws",
        "author": "AEVENOM",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10y4zdt/lpt_if_petting_a_cat_creates_static_electricity/",
        "text": "",
        "created_utc": 1675973861,
        "upvote_ratio": 1.0
    },
    {
        "title": "If petting a cat creates static electricity and shocks them and you, it is often due to low humidity in that area. You can temporarily get rid of the shock by having some contact directly with the cat, i.e. paws",
        "author": "AEVENOM",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10y4urj/if_petting_a_cat_creates_static_electricity_and/",
        "text": "",
        "created_utc": 1675973562,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT: Drink warm water when you’re drunk and trying to hydrate",
        "author": "twh0821",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10y45u9/lpt_drink_warm_water_when_youre_drunk_and_trying/",
        "text": "I used to drink a lot when I partied back in college. Every time my friends took care of me they would always give me cold bottled water. I would always refuse to drink it because it didn’t “taste” good to me for whatever reason. I had a friend who microwaved some water for me when I was drunk and I ended up drinking multiple cups. I woke up with no hangover. Ever since then, I’ve been doing that every time I drink with my friends. \n\nThere’s just something about warm water when you’re shivering from drinking too much water. Not sure what it is though.",
        "created_utc": 1675971967,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT: If you are new to ordering cocktails at a bar or restaurant and seek the lowest available price options, avoid the use of proper pronouns and learn the main category that your choice of spirits belong to.",
        "author": "PrismaticHospitaller",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10y3d6r/lpt_if_you_are_new_to_ordering_cocktails_at_a_bar/",
        "text": "[removed]",
        "created_utc": 1675970180,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT: If injections scare you then just imagine that you are being injected elsewhere on your body at that time and really concentrate on the fake area as if you really are getting a shot there.",
        "author": "TheMasterOfStuffs",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10y3a0a/lpt_if_injections_scare_you_then_just_imagine/",
        "text": "This helps as a way of distracting your mind. Makes you not clench point of injection. And if your doctor is really good then you'll not feel a thing.",
        "created_utc": 1675969980,
        "upvote_ratio": 1.0
    },
    {
        "title": "Finally trying to save up money",
        "author": "Hot-Butterscotch349",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10y334c/finally_trying_to_save_up_money/",
        "text": "[removed]",
        "created_utc": 1675969559,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT request: what to do when you are heartbroken &amp; are experiencing depressive days again while recovering",
        "author": "throwaway2727737",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10y2p2f/lpt_request_what_to_do_when_you_are_heartbroken/",
        "text": "i am trying to let the guy i love go i can’t get over him i realized being stuck on him won’t do me any good \n\ni am in a different country so i don’t have my antidepressant but i was still in my healing phase\n\njust when i thought everything was getting better, it feels like i am back in phase 1 \n\n\nplease help me out i can’t handle the heartbreak anymore, i feel like i am so dependent on guys for my happiness i try to spend time with myself but idk why i can’t be that happy :(",
        "created_utc": 1675968692,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT : use a 'Duty Free' bag to get extra allowance on budget flights",
        "author": "Ok_Stretch4818",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10y199b/lpt_use_a_duty_free_bag_to_get_extra_allowance_on/",
        "text": "[removed]",
        "created_utc": 1675965427,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT: You can sharpen the blades of a disposable razor by rubbing them with the grain, rather than against the grain, on a pair of denim jeans",
        "author": "sryitsdrunk",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10y0uy0/lpt_you_can_sharpen_the_blades_of_a_disposable/",
        "text": "Here are the first two hits when I searched for it on YouTube:\n\n&amp;#x200B;\n\n[\"Sharpening Disposable Razor\" - YouTube](https://www.youtube.com/watch?v=B3Kxiom83Js)\n\n&amp;#x200B;\n\n[\"How To \"Sharpen\" and reuse An Old Razor Blade Method\" - YouTube](https://www.youtube.com/watch?v=h-4bhVpfxJM)",
        "created_utc": 1675964517,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT: Don't ever tell anyone they look exactly like &lt;someone else&gt; (unless that someone else is hot and famous)",
        "author": "fphat",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10y0s4u/lpt_dont_ever_tell_anyone_they_look_exactly_like/",
        "text": "From your perspective, your friend Alice could look almost exactly like that person in front of you in the queue. Same hair, similar eyes, same nose shape, etc.\n\nBut from Alice's perspective, that other person is probably quite different from her. There's a certain hypersensitivity to minor differences that we perceive in people similar to us. We also tend to see our own features differently than we see them in others. This leads to us perceiving those features as uncanny.\n\nWhen you tell Alice \"you look just like her!\", you are bound to make her self conscious. She might even see the other person as ugly, due to the uncanny effect I mentioned.",
        "created_utc": 1675964341,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT: make a list for every different type of store you might go to, not only a grocery list",
        "author": "Kryptohs",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10y0pcq/lpt_make_a_list_for_every_different_type_of_store/",
        "text": "For example, when a remote runs out of battery, add it to the “Hardware Store” list so the next time you have to go, you don’t forget to get them.",
        "created_utc": 1675964166,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT Request - how can I avoid snoozing in the morning?",
        "author": "Yoshiomath",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10y066t/lpt_request_how_can_i_avoid_snoozing_in_the/",
        "text": "I'm  an avid snoozer - each morning I set my alarm for 6am when I should get  up and head to the gym, but instead, I may end up snoozing for up to  two hours.\n\nWhat are your absolute best tips for avoiding this horrible practice?",
        "created_utc": 1675962949,
        "upvote_ratio": 1.0
    },
    {
        "title": "LTP request - how can I avoid snoozing in the morning?",
        "author": "Yoshiomath",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10y05iy/ltp_request_how_can_i_avoid_snoozing_in_the/",
        "text": "[removed]",
        "created_utc": 1675962910,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT Request: How can I brush my tongue without gagging?",
        "author": "DiogenesDisciple_",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10y02w6/lpt_request_how_can_i_brush_my_tongue_without/",
        "text": "",
        "created_utc": 1675962737,
        "upvote_ratio": 1.0
    },
    {
        "title": "Protecting Your Tankless Heater from Hard Water",
        "author": "The_Trade_Table",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10xzwsh/protecting_your_tankless_heater_from_hard_water/",
        "text": "[removed]",
        "created_utc": 1675962341,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT: When your pet fountain's internal parts inevitably become gross and rusted, just remove everything and use only the cleaned basin.",
        "author": "pirpirpir",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10xzwqk/lpt_when_your_pet_fountains_internal_parts/",
        "text": "Your pets will still use it. The water will stay much cleaner if you're changing it frequently. You won't have to worry about the aged internal mechanisms polluting the water.",
        "created_utc": 1675962338,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT: When your children are born, reserve their name @ Gmail. Then, use that address to write occasional notes to them sharing unique memories or emotions before you get them. Long after you're gone, they will cherish those emails.",
        "author": "1entreprenewer",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10xzrwz/lpt_when_your_children_are_born_reserve_their/",
        "text": "",
        "created_utc": 1675962036,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT: How to market CSR/Supervisor skills for a different job?",
        "author": "Signal_Shower8461",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10xzoiw/lpt_how_to_market_csrsupervisor_skills_for_a/",
        "text": "[removed]",
        "created_utc": 1675961821,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT: No matter how many goals you achieve, or how much you improve yourself, there isn’t a magical threshold you achieve where life is free of discomfort or dissatisfaction",
        "author": "MO_drps_knwldg",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10xznl5/lpt_no_matter_how_many_goals_you_achieve_or_how/",
        "text": "The goal of self-improvement shouldn’t be absence of discomfort, or an expectation that life will be carefree once a certain goal is achieved. \n\nDiscomfort, dissatisfaction, difficulty, and unhappiness will always be part of life, no matter how much we improve ourselves.\n\nWe can be generally happier, healthier, and more successful, but there will never be a permanent state we can achieve where life doesn’t have difficulty. \n\nIn fact, the more you develop yourself and the more you achieve, the more adversity you will face. You’ll have more responsibility, you’ll face more criticism, more doubt, jealousy—others will rely on you more.\n\nSelf improvement is a path to a generally happier, more fulfilling life, but there isn’t some magical threshold that you will pass where everything in life is perfect.\n\nRe-evaluate your motivations if you are primarily seeking a life of comfort after you work to improve your yourself. Absence of discomfort over extended periods of time leads to atrophy of character and ability.",
        "created_utc": 1675961759,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT: when you're drunk and want to say something, try to say it in your head first. Could save you unwanted grief depending on your situation",
        "author": "Cloudninefeelinfine",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10xzl0j/lpt_when_youre_drunk_and_want_to_say_something/",
        "text": "",
        "created_utc": 1675961584,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to market CSR/Supervisor skills for a different job?",
        "author": "Signal_Shower8461",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10xzhuc/how_to_market_csrsupervisor_skills_for_a/",
        "text": "[removed]",
        "created_utc": 1675961365,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT: If legal where you live, use a call recording app for all \"life\" calls (i.e. doctors, insurance companies, mortgage lenders, apartment complexes, and so forth)",
        "author": "SpaceAndTheSea",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10xzb9b/lpt_if_legal_where_you_live_use_a_call_recording/",
        "text": "[removed]",
        "created_utc": 1675960905,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT: To maximize the amount of lime juice from a lime, don't cut it in half......",
        "author": "stylezLP",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10xzb0o/lpt_to_maximize_the_amount_of_lime_juice_from_a/",
        "text": "To obtain the most juice from a lime, slice it into 3 parts, then the middle part again into 3 parts. This way you'll get 100% of the juice.\n\nLearned in a helpful other post but r/LifeProTips doesn't allow cross-posting. Here's a picture with illustrations.\n\n[https://i.redd.it/7vcb5ezne8ha1.jpg](https://i.redd.it/7vcb5ezne8ha1.jpg)",
        "created_utc": 1675960888,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT: Use a call recording app for all \"life\" calls (i.e. doctors, insurance companies, mortgage lenders, apartment complexes, and so forth)",
        "author": "SpaceAndTheSea",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10xz99w/lpt_use_a_call_recording_app_for_all_life_calls/",
        "text": "[removed]",
        "created_utc": 1675960777,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT: Add years to your life by improving your sleep efficiency",
        "author": "tombnight",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10xyucz/lpt_add_years_to_your_life_by_improving_your/",
        "text": "[removed]",
        "created_utc": 1675959765,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT: When doing laundry, you turn nursing tops inside-out from the BACK.",
        "author": "stilettoblade",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10xyn1c/lpt_when_doing_laundry_you_turn_nursing_tops/",
        "text": "If you've ever been doing a load of laundry and had to deal with the sanity-destroying, non-euclidean madness of a \"simple\" nursing top that has turned inside-out, you know how frustrating they can be. You can turn them other-side-out 4 times, in 4 different ways, and still have it be wrong every time. \n\nThe trick is to take the inside-out garment, turn it till you find the tag (or however the back of the neck opening is marked), then reach a hand up from the bottom of the shirt, inside just the single back-most layer of fabric, grab the tag, and flip it down off your arm to turn the body of it properly right-side-out in one move. If there's sleeves, you can find them and pull them the right way from there. \n\nIt was life-changing when I figured it out - my wife and I would both get frustrated with every item when trying to hang her shirts, and now they just work as though they were normal clothes.",
        "created_utc": 1675959280,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT: Have bad handwriting? Slow down when writing to improve.",
        "author": "nlnj_a",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10xymsp/lpt_have_bad_handwriting_slow_down_when_writing/",
        "text": "At my job we have to write out things and all the employees take turns. On one particular occasion I was helping out, when the big boss came by. He made a note that whoever did this was banned from this assignment. I thought it was funny but improved over time by slowing down a tiny bit when writing. It has helped greatly and many people out there should do this too.",
        "created_utc": 1675959263,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT: Waiters / waitresses: Want better cash tips? give back change that allows the customer to give an appropriate tip assuming they have no other cash to work with.",
        "author": "defyinglogicsl",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10xy4ne/lpt_waiters_waitresses_want_better_cash_tips_give/",
        "text": "For example if the meal is $36 and they pay with a $100 bill.  If you give them back three $20s and four $1s then you will most likely only get a $4 tip. Unless service was incredible most people won't tip $20 on a $36 meal.  If you break one of those $20s down you're more likely to get a higher tip.",
        "created_utc": 1675958047,
        "upvote_ratio": 1.0
    },
    {
        "title": "I have a problem in using my time and I don't spend it correctly, any advices?",
        "author": "anvlv",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10xxxeq/i_have_a_problem_in_using_my_time_and_i_dont/",
        "text": "[removed]",
        "created_utc": 1675957529,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT: If you're wanting to cancel your Microsoft 365 account, there is an option on the unsubscribe page to extend your stay for a free two month period with no further commitment",
        "author": "g60ladder",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10xxw7t/lpt_if_youre_wanting_to_cancel_your_microsoft_365/",
        "text": "",
        "created_utc": 1675957443,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT REQUEST: how to make others feel like \"i'm really happy about your gift/news/surprise?\" i'm stuck in a loop",
        "author": "pinturhippo",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10xxv9e/lpt_request_how_to_make_others_feel_like_im/",
        "text": "So basically i'm someone that doesn't like to show his emotions a lot, and people around me got used to it, but sometimes when they drop something \"huge\" like a giga birthday party, buy me a present i wished for months/ages, give me great news, they still look like they want some \"reaction\" from me, and I'm at the point where even if i feel like letting out the burst of happiness it'd look like is a fake reaction, as that's something I wouldn't do... by the other side tho me saying \"wow thanks that's awesome\" sounds poor to them, cause ye, deep inside they wished this was the time i gave 'em the big reaction.\n\nand man this is getting a problem cause i can see on their faces that they are disappointed, not by me, but by the fact that they feel like what they did for me wasn't worth the effort / wasn't something i really wanted.\n\ni tried also the \"I'm really happy, you know I'm not the kind of guy that lets his emotions out. but i mean it I'm thrilled\"\n\nand usually the go like \"ok i get it, but you really don't look like someone that's actually happy about it\"\n\ntoday i heard a conversation between my mother and GF where my mom basically said that is not even worth anymore trying to surprise me, or make me happy cause they always fail.\n\nthe point is that THEY DONT FAIL. but they always feel this way and this is making me really sad as i feel like I'm the problem here.\n\nlittle context to clarify: both my mother and GF are over reacting people, i may gift them a flower and they'd start hugging me, smiling, telling everyone about it. so i can get how and why they are sad about me not reacting to things\n\nso ye, i need an LPT hero in comments :D",
        "created_utc": 1675957370,
        "upvote_ratio": 1.0
    },
    {
        "title": "Waiters / waitresses of reddit. Want better cash tips? Give customers change that allows them to leave a good tip.",
        "author": "defyinglogicsl",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10xxv8d/waiters_waitresses_of_reddit_want_better_cash/",
        "text": "",
        "created_utc": 1675957367,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT: When applying for jobs, don't use your personal phone number or email address.",
        "author": "Big_Turtle22",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10xxrw2/lpt_when_applying_for_jobs_dont_use_your_personal/",
        "text": "Many employers today check the social media accounts of job applicants. If you have linked your personal email and phone number to your social media accounts, the employer will have access to your past posts and activity, which could negatively impact your job application.\n\nYour social media accounts are a reflection of your personal brand, and it's important to be mindful of the content you share. If you have posted something in the past that is unprofessional, offensive, or goes against the values of the company you're applying to, it could hurt your chances of getting hired.\n\nBy using a professional email and phone number, you can ensure that your personal social media accounts remain separate from your job search and professional image, and you can protect yourself from any negative consequences that might arise from your social media activity.",
        "created_utc": 1675957131,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT: If pet sitting, send a regular stream of pictures to the owner.",
        "author": "RonNona",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10xxde4/lpt_if_pet_sitting_send_a_regular_stream_of/",
        "text": "The owner will have a more enjoyable time away knowing that you have not forgotten and that the cat, dog or other pet is happy and healthy.",
        "created_utc": 1675956111,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT: Crushing medical debt?",
        "author": "WhiteAssDaddy",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10xww9w/lpt_crushing_medical_debt/",
        "text": "Check out dollarfor.org",
        "created_utc": 1675954935,
        "upvote_ratio": 1.0
    },
    {
        "title": "Turkey has recently been struck by a earthquake with a magnitude of 7.8. If you want to make a donation AHBAP is the true foundation for that. Thank you for your kindness and support 🇹🇷❤️ Donate via Credit Card: https://bagis.ahbap.org/bagis Donate via Crypto: https://tinyurl.com/ahbapcrypto",
        "author": "Rizelileris2m",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10xwogj/turkey_has_recently_been_struck_by_a_earthquake/",
        "text": "",
        "created_utc": 1675954420,
        "upvote_ratio": 1.0
    },
    {
        "title": "Turkey has recently been struck by a earthquake with a magnitude of 7.8. If you want to make a donation AHBAP is the true foundation for that. Thank you for your kindness and support 🇹🇷❤️ Donate via Credit Card: https://bagis.ahbap.org/bagis Donate via Crypto: https://tinyurl.com/ahbapcrypto",
        "author": "Rizelileris2m",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10xwoa4/turkey_has_recently_been_struck_by_a_earthquake/",
        "text": "",
        "created_utc": 1675954407,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT: Managers/Team leaders. Need to asses or speed up a task?",
        "author": "Ill-Appointment6494",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10xwbqq/lpt_managersteam_leaders_need_to_asses_or_speed/",
        "text": "If you have a task that you need to cut down/make more efficient, give it to the laziest person on your team. Lazy people will often be good at finding a shortcut or simplifying a process.",
        "created_utc": 1675953536,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT: Your comfort and well-being are more important than being polite.",
        "author": "nanadoom",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10xvgvb/lpt_your_comfort_and_wellbeing_are_more_important/",
        "text": "If you are in a situation that makes you uncomfortable, and especially if you feel unsafe, leave. Don't worry about being rude or what others will think of you. Bullies and predators use social pressure to manipulate people, don't play their game. If they are physically forcing you to stay, say blocking the door or not giving you your stuff back, make a scene. Once people are watching, they are much less likely to be a dick.",
        "created_utc": 1675951287,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT: Get people to stop lying to you by giving them the book \"Never be lied to again\" by David J. Lieberman and telling them it's your favorite book and you've read it a lot of times.",
        "author": "NoAir4217",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10xve4v/lpt_get_people_to_stop_lying_to_you_by_giving/",
        "text": "",
        "created_utc": 1675951107,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT: If you can replace the word with “his” and “hers” use “its” and “whose” which also don’t have apostrophes. “It’s” and “who’s” are contractions of “it is” and “who is” like “she’s” and “he’s”.",
        "author": "theAusterityClinic",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10xvcoa/lpt_if_you_can_replace_the_word_with_his_and_hers/",
        "text": "",
        "created_utc": 1675950987,
        "upvote_ratio": 1.0
    },
    {
        "title": "how to improve how people look at you. or make your self seem smart or talented.",
        "author": "Drewbezy",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10xv6c1/how_to_improve_how_people_look_at_you_or_make/",
        "text": "[removed]",
        "created_utc": 1675950507,
        "upvote_ratio": 1.0
    },
    {
        "title": "question as a statement, confused, or sorta iffy or unsure.",
        "author": "Drewbezy",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10xuv0e/question_as_a_statement_confused_or_sorta_iffy_or/",
        "text": "[removed]",
        "created_utc": 1675949608,
        "upvote_ratio": 1.0
    },
    {
        "title": "how to shower steps. 1. rinse everything. 2. shampoo in hand apply to hair. 3. take soapy hands wash private parts and under arms, front and back. (dig in there good) don't rinse them, just let that marinate in smell good!! Then wash rest of body with soap and rag or... rinse head to toe.",
        "author": "JLRob1",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10xudtn/how_to_shower_steps_1_rinse_everything_2_shampoo/",
        "text": "",
        "created_utc": 1675948227,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT: Don’t ask questions that you aren’t prepared to hear the answer!",
        "author": "Basic-Ideal",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10xu1i0/lpt_dont_ask_questions_that_you_arent_prepared_to/",
        "text": "Some things are better left in the dark, ignorance is bliss! This is especially true in relationships about partners past , sometimes once things are known there is no going back to the way things were before!",
        "created_utc": 1675947232,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT: Check your college library before buying textbooks! I just learned (as a senior) that most textbooks can be checked out for free through the university library.",
        "author": "mcgarrylj",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10xtjx6/lpt_check_your_college_library_before_buying/",
        "text": "",
        "created_utc": 1675945721,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT: Don’t use actual names for family, children or pets when posting on social media",
        "author": "Tight_Meaning_3238",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10xtgma/lpt_dont_use_actual_names_for_family_children_or/",
        "text": "It protects you from scammers who might link your account to an email, and then have potential answers to security questions (first pets name, mothers maiden name, ect).  Also, it protects their privacy.",
        "created_utc": 1675945415,
        "upvote_ratio": 1.0
    },
    {
        "title": "If you want to post pics of your kids, family or pets, don’t use their real names",
        "author": "Tight_Meaning_3238",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10xte27/if_you_want_to_post_pics_of_your_kids_family_or/",
        "text": "[removed]",
        "created_utc": 1675945187,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT: powerbanks cause significant damage to iPhone batteries, probably some android batteries too, that will shorten their life span",
        "author": "iFoegot",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10xrwtk/lpt_powerbanks_cause_significant_damage_to_iphone/",
        "text": "Powerbanks use Direct Current to charge your iPhone, instead of Alternating Current which all electricity sockets provide. The voltage of powerbanks is also not stable, as can be confirmed by experiments. The less power it has, the lower voltage it charges your phone with, which causes Memory Effects.\n\nI have used several iPhones. At first I had a power bank just like many other people and I used it regularly. At first, my iPhone battery started to last shorter and shorter, then it became extremely sensitive to cold temperature. Whenever it became cold, my iPhone just showed me low battery or even shut down due to the so called low battery. I lived in a cold city at that time so I had to keep my iPhone in my inner pocket to warm it with my body to prevent it from shutting down. What pissed off is that one day I had to use it in cold weather but it just kept shutting down. I had a powerbank with me so I just connected it. Whenever it’s connected to the powerbank, it would show the correct amount of battery level it had, but whenever I removed it, it shut down due to “low battery”. I just kept it connected with my powerbank, and guess what, within one hour it consumed all the power from that powerbank (20,000 mAh).\n\nI googled the reason and found this out, so I just stopped using powerbanks and all my other iPhones never experienced the same problem. My iPhone 7 lasted 5 years (bought in 2016 and lost in 2011) and never had any problem, including the battery.",
        "created_utc": 1675940036,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT Request: I have some much work to do it's overwhelming and because I feel overwhelmed I can't work, more work adds up. Vicious cycle, help me out.",
        "author": "mercurysnowman",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10xr51p/lpt_request_i_have_some_much_work_to_do_its/",
        "text": "What the title says",
        "created_utc": 1675937162,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to negotiate salary raise?",
        "author": "Content_Annual_945",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10xqp7j/how_to_negotiate_salary_raise/",
        "text": "[removed]",
        "created_utc": 1675935505,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT: We need your attention",
        "author": "dgollert101",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10xqezv/lpt_we_need_your_attention/",
        "text": "[removed]",
        "created_utc": 1675934392,
        "upvote_ratio": 1.0
    },
    {
        "title": "we need your attention.",
        "author": "dgollert101",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10xqedi/we_need_your_attention/",
        "text": "[removed]",
        "created_utc": 1675934320,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT: My mums kicking me out and I desperately need advice",
        "author": "Maleficent-Coconut60",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10xqchy/lpt_my_mums_kicking_me_out_and_i_desperately_need/",
        "text": "[removed]",
        "created_utc": 1675934131,
        "upvote_ratio": 1.0
    },
    {
        "title": "My mums kicking me out and I need advice",
        "author": "Maleficent-Coconut60",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10xqb1d/my_mums_kicking_me_out_and_i_need_advice/",
        "text": "[removed]",
        "created_utc": 1675933969,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT: To easily situate a rug perfectly on a non-slip backing, flip the rug upside down, place the no-slip pad just right, then roll up the rug, place the end where you want and unroll it in position",
        "author": "WrinkleinTimeSD",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10xpoe1/lpt_to_easily_situate_a_rug_perfectly_on_a/",
        "text": "[removed]",
        "created_utc": 1675931587,
        "upvote_ratio": 1.0
    },
    {
        "title": "If you need to get a rug to sit on one of the no-slip pads nicely, flip the rug upside down, situate the no-slip pad perfectly, then roll up the rug, place the end where you want and then unroll it in position",
        "author": "WrinkleinTimeSD",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10xpmta/if_you_need_to_get_a_rug_to_sit_on_one_of_the/",
        "text": "[removed]",
        "created_utc": 1675931427,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT: One of the most “annoying” messages is “Why did you call me?” when you text someone right after the call instead of calling them back",
        "author": "Livebeam",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10xply5/lpt_one_of_the_most_annoying_messages_is_why_did/",
        "text": "[https://www.bustle.com/p/7-common-texts-that-are-unintentionally-annoying-8569249](https://www.bustle.com/p/7-common-texts-that-are-unintentionally-annoying-8569249)",
        "created_utc": 1675931345,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT Computer Mouse and carpal tunnel",
        "author": "AllTheSameSongsNovel",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10xpj8e/lpt_computer_mouse_and_carpal_tunnel/",
        "text": "If you’re using a computer mouse, use one hand to move the mouse around, and your other hand to click the buttons.\n\nThis simple change is easy to get used to and it will help you avoid aggravating your carpal tunnels.",
        "created_utc": 1675931032,
        "upvote_ratio": 1.0
    },
    {
        "title": "One of the quickest ways to overcome the fear of meeting new people is by talking to yourself in a silly voice. It can get you laughing and show how absurd your worries are",
        "author": "Livebeam",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10xpgms/one_of_the_quickest_ways_to_overcome_the_fear_of/",
        "text": "[removed]",
        "created_utc": 1675930742,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT: Never ask Someone for their Snapchat, They are going to think youre a pervert. Simply ask for their phone number and then maybe Just add them on Snapchat.",
        "author": "Sufficient_Cake_6771",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10xolpm/lpt_never_ask_someone_for_their_snapchat_they_are/",
        "text": "",
        "created_utc": 1675927549,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT Request: What are some tips for Bilingual Spanish Speakers looking to write grammatically correct emails in Spanish",
        "author": "intoodeep93",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10xo79k/lpt_request_what_are_some_tips_for_bilingual/",
        "text": "So I can speak Spanish well, growing up that was my first language. My grammar is decent, but when it comes to accents I'm terrible. Just curious for any tips on how to better recognize when to use accents? And if there are any systems or customizations that will review your (outlook) emails / documents? (Besides typing up on word and pasting it over) Let me know! Side note I am using an Intel Evo and for the life of me I can't type the ñ without copying and pasting ... my forefathers are turning in their graves. \n\nI appreciate the tips and advice!",
        "created_utc": 1675926153,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT: If the website you’re looking at has reviews, but there is no way to add a review, it’s all bullshit. Especially, if the website is for an insurance agent.",
        "author": "4lltomorrowsparties",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10xnzvz/lpt_if_the_website_youre_looking_at_has_reviews/",
        "text": "",
        "created_utc": 1675925458,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT: Set a 2-minute delay for every email you send",
        "author": "ThisNameIsMyUsername",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10xntz1/lpt_set_a_2minute_delay_for_every_email_you_send/",
        "text": "In Outlook (and most other standalone not-web email clients), you can set your outgoing email to be automatically delayed a couple minutes using the automation \"rules\". \n\nDoing so holds your email in your outbox however long you set, so if you hit send early accidentally or forgot to include an attachment, you can go to your outbox and edit the email before it actually sends.",
        "created_utc": 1675924885,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT: assume everything you do is being filmed and will be posted online",
        "author": "sh689x",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10xnlj7/lpt_assume_everything_you_do_is_being_filmed_and/",
        "text": "[removed]",
        "created_utc": 1675924078,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT: if you're going to take a Vitamin D supplement, do it in the morning. Any other time of the day might mess with your sleep schedule.",
        "author": "regice_fhtagn",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10xnaxx/lpt_if_youre_going_to_take_a_vitamin_d_supplement/",
        "text": "",
        "created_utc": 1675923128,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT - How to fix annoying weird characters in copied links",
        "author": "jubitips",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10xllcz/lpt_how_to_fix_annoying_weird_characters_in/",
        "text": "[removed]",
        "created_utc": 1675917721,
        "upvote_ratio": 1.0
    },
    {
        "title": "Tip to fix annoying weird characters in copied links",
        "author": "jubitips",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10xlgyn/tip_to_fix_annoying_weird_characters_in_copied/",
        "text": "[removed]",
        "created_utc": 1675917346,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT : Everyday you wake up is new chance to change your life for the better",
        "author": "I_am_Harley_Rogue23",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10xldqj/lpt_everyday_you_wake_up_is_new_chance_to_change/",
        "text": "",
        "created_utc": 1675917078,
        "upvote_ratio": 1.0
    }
]