[
    {
        "title": "I feel so bad about myself because I posted bikini pics on Reddit in a vulnerable time",
        "author": "Sad_Ad_5326",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/z0abed/i_feel_so_bad_about_myself_because_i_posted/",
        "text": "\nI’m feeling paranoid and hate myself so much. I’m shaking because I posted through another account bikini pics of myself after my abusive ex insulted my body.\n\nDo I deserve to beat myself up over it? :( I’ve deleted the posts but I feel so bad… I feel like a sl**, like a horrible woman and totally stupid. \n\nCan somebody understand what I’m going through? :( how can I deal with this?",
        "created_utc": 1668966421,
        "upvote_ratio": 1.0
    },
    {
        "title": "The best part is knowing you weren’t crazy",
        "author": "Jaded-Tiger3101",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/z09sij/the_best_part_is_knowing_you_werent_crazy/",
        "text": "After realizing he’s a narcissist and writing down all the things he did to me, I found it cathartic. I felt good that I wasn’t the one at fault, despite his objections and projections. I feel so much at ease. I remember recording myself and how anxious and hurt I was. He did it all through text maybe 3 messages. He blamed everything on me when he did so much to me. \n\nI’m glad I saved those recordings of the stuff he did to me. Now I look back and feel empowered that maybe he dumped me as a favor. I do not care about him. He was awful to me. I was nice. Not a single argument in 1.5 years. But my body understood something I didn’t. I knew I was disrespected. Yet, my body never shed a tear for him. He cheated or monkey branched. For perspective, I dated someone for 3 months and I cried over him for a month. But not a single tear for narc. \n\nThat list I made really showed how awful he was. I could only think of 2 good things, he was smart and attractive. But I came up with 45+ negative things, yet I was the problem, according to him. I don’t think anyone else would put up with him either or for how long I did. Personally, I think it didn’t work out with the other person and that’s why he apologized. It was a narcissistic apology and a poor Hoover attempt. Luckily, I had only stuck around for 1.5 years. I don’t think he has any “real” friends and that’s quite lonely. Deep down they hate themselves. \n\nI’m glad I’m myself again. I’m not anxious, I’m happy. :)",
        "created_utc": 1668965187,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to help",
        "author": "jegjd67",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/z06kmc/how_to_help/",
        "text": "hello. if you are abused (psychologicaly / physicaly) or if you know someone that is abused, or when you see people who are abused here :\n\nplease report yourself / the victims to the police / children social care... search on the internet how you can report to the police abuses that you see on the internet and also use : pharos (even if you are not french) ic3 and the fbi website.\n\non pharos there is a bug that don't let you report some links so if you have a message that is telling \"this content was already reported\" it can be a bug so report the link in the description part and choose the \"autre / other\" option to write the website.\n\nyou can also use crisis hotlines / websites to report these things search with reliables sources what hotlines and websites\n\nPlease Also Ask to people here if victims are Still with their abusers (for example if a child left abusive / narcissits parents, Ask them if the parents live with others children if they abuse these others children etc and report before and After having the answers.)",
        "created_utc": 1668957288,
        "upvote_ratio": 1.0
    },
    {
        "title": "If your friend seemed cried with you, can they still be a narcissist as they don't have empathy?",
        "author": "Hurdleflurdle",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/z04rq0/if_your_friend_seemed_cried_with_you_can_they/",
        "text": "I had an ex best friend of 5 years who ditched me a few months ago. We spoke everyday. My life revolved around her happiness. When I got a new job she kept saying my job was shit for me and it was 'swallowing me as a whole'. Mind you it had only been 3 weeks and I was still trying to adjust. We started having arguments about it a lot, and when I asked for space, she got angry and eventually I ended up apologizing for her not having the space to be angry at me. And for me to get some space she would first have to get a lot of space to be angry at me for all the things I had done, so she felt the space to give me space? Somehow it made sense then too. XD\n\nHowever, I wasn't able to manage this next to my new job, so I told her I needed a bit more distance for a bit. As I needed space, and making space for her anger was the opposite of that. \n\nShe didn't take it well. She got enraged and she told me her therapist was right about me and she told me to never message me again. She blocked me everywhere.\n\nI've been doing a lot of reflecting lately as this came as a huge smack in the face, but there have been many signs of manipulation and gaslighting I missed. I just keep going back and forth because I feel like she did seem to care sometimes too? \n\nNone of it makes sense. I keep going in circles and I'd really like my brain to just settle somewhere. For instance how it just wasn't right and she hurt me. But I keep going back to how I may have done things wrong too and I'll go back to me being the problem. Anyone else know how to break this?",
        "created_utc": 1668952654,
        "upvote_ratio": 1.0
    },
    {
        "title": "The worst part is when they feel supportive.",
        "author": "No-Nectarine6024",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/z028zh/the_worst_part_is_when_they_feel_supportive/",
        "text": "I found a support group online, a lot of nice people there. One would consistently respond to my messages, so I'd engage. Problem is, even the first few messages felt like condescending put downs even though she (probably)? wasn't even aware of them. I don't know if she'd qualify for the actual disorder, but so many of her responses felt self-congratulatory/self-involved/roundabout criticisms/backhanded compliments that I could tell my anxiety was increasing, and I really needed my confidence boosted in a particular area (competence). I mentioned that the friends I used to have said so many positive things in that area, but I was going through a rough period in my life and doubted myself.\n\nHonestly it felt like she could only give herself a genuine compliment, or for people with college degrees. I feel like the worst part is when they seem to have good intentions, and maybe actually do, but they're so incredibly condescending/self-absorbed/have that whiff of status absorption (with things that some people have no control over like being able to finish college because your life was stable enough, mine wasn't), they actually made things worse.\n\nPart of me feels guilty, but I think I made the right decision. It's been over a week now, yet those words still hurt when I think about them. She couldn't express any genuine admiration toward me, like she didn't respect me at all as a person, in any way. Or if she did, it was to a much lesser degree than herself.",
        "created_utc": 1668945185,
        "upvote_ratio": 1.0
    },
    {
        "title": "Should I meet up with nex’s mom?",
        "author": "b3uty98",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/yzv5io/should_i_meet_up_with_nexs_mom/",
        "text": "\nI reached out to her about a month after everything came crashing down. She’s a cool person and was wondering how she has been doing. \n\nShe is also a victim of narcissistic abuse.\n\nMeaning she knew the signs. She knew he wasn’t treating me good. She knew he was cheating and lying to me every night for about a week before she said anything.\n\nAnyway so now I’m just debating whether or not me and her should see eachother.\n\nPart of me feels like it would be a step back. He would most likely come up in conversation. Part of me genuinely cares for her though.\n\nThoughts?",
        "created_utc": 1668918805,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why does my narc ex pop into my life again and again? I think it was the final discard?!?",
        "author": "Sad_Ad_5326",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/yzrls0/why_does_my_narc_ex_pop_into_my_life_again_and/",
        "text": "If I’m so bad that he has to discard me so callously, why does he return each time?",
        "created_utc": 1668907362,
        "upvote_ratio": 1.0
    },
    {
        "title": "List to remind myself about narcissistic abuse",
        "author": "Jaded-Tiger3101",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/yzptq6/list_to_remind_myself_about_narcissistic_abuse/",
        "text": "1. 2 cell phone numbers. Maybe it was a work number. \n2. Manipulation \n3. Cheating - discarding for someone else. \n4. He lied.\n5. He wanted something serious then changed it to casual in his mind. \n6. He gave me a ring and asked me to move in, only to be met with “I don’t see this going anywhere.”\n7. Gaslighting \n8. Projection - he said I was unfit, he has a belly. \n9. I did all the work he never tried. \n10. Insulted my pay, degree, and job. \n11. Dictated what I should do with my dad - he’s disabled \n12. Confusion - Asked me to move in - yet he claims it wasn’t serious but that it was casual but that it was serious? \n13. Gave me a narcissistic apology - no accountability \n14. I have anxiety driving, yet I drove each time.\n15. When my dad had a heart attack he said “that sucks”. Yet, when his grandmother was in the hospital I was there for him. \n16. I felt alone, used, and not good enough after being discarded. \n17. Competitive - When I was winning in a game he took over 5 minutes to answer because he couldn’t handle me winning. \n18. He wanted me to move in and be able to afford things when I made less than he did. \n19. He’s privileged - he doesn’t know what it’s like to have to save money or work for it. \n20. His parents literally bailed him out from a legal accusation. Idk if I even believe what he said. \n21. Wanted me to travel at a moment’s notice like I don’t have responsibilities. \n22. Couldn’t have an actual conversation. He blamed it on me that I can’t hold one. He’s autistic. \n23. His parents pay for everything.\n24. He led me on for 1.5 years. \n25. Only ever wanted sex for me to come over. \n26. Then he discarded me for someone after saying he wants something serious with someone he just met, negating that we agreed we were serious. Then gaslit me and said it was casual. \n27. Ditched me for porn. While I waited outside for an hour. \n28. Asked me to take some weird exercise drug. I refused. \n29. He smoked - I have asthma. I don’t have a problem if he does it outside but he didn’t bother brushing his teeth afterwards. \n30. After running to go see him sometimes he’d fall asleep. While I waited. \n31. He didn’t brush his teeth when the mouthwash was right there. I managed to do like 5 things within 30 minutes but he couldn’t spend a few minutes? \n\n\nYet I was met with “you didn’t prioritize fitness, you didn’t talk, I did all the talking, you weren’t serious, I was for real.” \n\nMaking a list helped me realize I was not at fault. The narcissist was.",
        "created_utc": 1668902133,
        "upvote_ratio": 1.0
    },
    {
        "title": "Update on ex-best friend who is living a 'new' life in a different state",
        "author": "Wasvalya",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/yzmliu/update_on_exbest_friend_who_is_living_a_new_life/",
        "text": "How many of us ever get to find out exactly what happened to the narcissist after the relationship we had with them dissolved? It's been around 2 and a half years since I tried to quietly extract myself and step away from my narcissistic best friend, someone I really cared for.\n\nThis woman was subtly abusive towards me for many years, eroding my self-confidence and lying to me about a number of things. Eventually, due to my sleuthing, I uncovered her lies and exposed her to two of her closest friends. These two friends kept my confidence and agreed with my evaluation of the narcissist. One of them (friend 1) also distanced herself from the narcissist over time, incurring the narc's rage. The other friend (friend 2) remained close to the narc, confiding to me regularly about how frustrated and hurt she is with the way the narc continues to treat her.\n\nI sit back and let it all unfold. My life has improved month by month without the narc's influence. I have more confidence, more energy and I'm more motivated. I have met new friends, I have completed my PhD and I have an amazing new job.\n\nFriend number 1 recently reported to me that the narcissist also has a new job, a big promotion for her in her new chosen industry. The narcissist and her new partner are going to spend Christmas interstate with her parents. She has just met her new partner's parents, too, and she loves them. \n\nFriend number 2 recently reported that the narcissist wants to leave her new partner, as he is abusive. He got in a physical punch up with his best friend, and she is afraid of him. He refuses to get help for his anger management issues, She has her bags packed, but no-where to live. She is looking for a place to live, so as she can leave. She works two jobs to make ends meet, but doesn't have a lot of money. \n\nSo: two very different reports, both from close friends of the narcissist! Where does the truth lie? I'm guessing report number 2 is closer to the truth - but on the other hand, perhaps it is just a play at gaining sympathy and attention?  These type of people really are life's chameleons - it's impossible to tell where they are at.",
        "created_utc": 1668893251,
        "upvote_ratio": 1.0
    },
    {
        "title": "“Life is so short …”",
        "author": "christyoftheforest",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/yzeywe/life_is_so_short/",
        "text": "It had been several months this time that I had gone no contact from her. One of the more difficult things I had to wrestle with throughout my life. After all, how does one really completely dissolve oneself from their mother. I have been beaten, bitten, put in compromising/dangerous situations, forced to move back and forth from family to family and scapegoated as “the angry one” because heaven forbid I have emotions about what happened to me. \n\nYesterday morning I had a good cry with my therapist, as a clinician myself it felt much needed. Funny enough I had been discussing how I wrestled with the last no contact event because it felt like the culmination of everything. I lost access to my extended family in any meaningful way, my siblings and I are all estranged, and somehow forged by this I was moving on as something/someone new. \n\nI was headed to Target yesterday morning trying to get myself in the holiday spirit and prepare for one in which I alone (and my husband) were going to be celebrating. While on the way I was chatting with my supervisor about the week’s cases and how I felt I had been able to help others move through their feelings about live after cutting off toxic family. I kept getting calls from my husband towards the end of the call which felt strange because he knew where I was and that I was on the way back. I had also mentioned I had a call with my supervisor and he generally knows those are an hour long. \n\nAt the end of my call I received a FaceTime call from my husband in a panic. “Your mother is here, she forced her way in.” The light drained from my face. I heard a familiar voice in the background say “hi … I missed you!” I hung up. \n\n1. I’m not going to have this conversation in the middle of Target.\n\n2. I needed a moment to formulate what to do next.\n\nMy immediate thought was to reach out to my sister as she’s a neighbor of hers and in law enforcement. Despite having similar instances with her in the past where the police had literally been called and having had long moments of no contact herself, she literally moved across the street from her. At the very  least I thought she could assist with the issue at hand. This woman, who left me with her parents at 2 years old to pursue a slew of marriages and having 2 other children after me who suffered various levels of abuse was now writing to me from my husband’s phone saying I had a cute cat, she wanted to give me money and talk about my birthday, and in fact she “needs” me. \n\nMonths earlier, our no contact started with a similar disrespect of personal space. I had asked her repeatedly now that I was seeing my own case load, to please not call but text as I needed my phone for other things and it would draw me out of the moment while I was working. Dismissing this and calling me angry and crazy came at first to a warning and then a final disconnect. \n\nI wondered how she had gotten into my place being that there is a code at the gate and cameras. My instinct was to call my landlord as I know they knew each other as she had been his insurance agent for a time. His response left me in shock for a bit. “Yeah she’s my buddy, I gave her the code. I didn’t think it was a big deal. I don’t know what is going on, it’s none of my business of course but you know at the end of the day, that’s your mom.”\n\nWhen I arrived back home she was gone. I imagine voicing my concern to my sister held some weight. My husband was shaken, never having experienced someone loudly banging on the door not followed by “this is the police” his instinct had been to toss his phone and hide in the bedroom when it happened. So I came home to a traumatized husband, an apathetic landlord, and a dismissive sister who texted me “I really don’t understand what mom has done to you for you to be like this ? \n\nLife is so short and you choose to live in the past.”\n\nThis was not the past, this was happening now. I’m not mad 10 years later if a rattlesnake bites me, I just know to avoid rattlesnakes. \n\nNo one has the right to force themselves into anyone’s life, yet it has been so normalized to accept abuse despite the parts that break you. It’s all “that’s just you” until the point it happens to them. \n\nI now don’t feel safe in my home, and we can’t even afford to leave any time soon. Happy Holidays I guess.",
        "created_utc": 1668873169,
        "upvote_ratio": 1.0
    },
    {
        "title": "Burn Letter to My Narc",
        "author": "Reasonable_Serve8001",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/yzbsgm/burn_letter_to_my_narc/",
        "text": "Took my almost a year to wake up and see this man. The disillusionment I was clinging to about who he is is sad.\n\nI see you for the lying, cheating, manipulative con man you are. You are a parasite sucking off any willing host. You have no feelings for them only for what you can suck out of them. You say you want to better yourself but you mean to do so only through leeching off someone else. You want to just move right in to someone stable and successful so you can pretend to be those things. But you are only a black hole destroying everything you touch. You were never mine. You weren't commited for a single day. You are a shell of a man. You are afraid to love. You are afraid of life. I gave up the last shred of hope that it wasn't true. That the person you presented is really inside you. But that was just a mask you wore to manipulate and get what you wanted. Your alligator tears and apologies only come when you realize you can no longer feed off your host. You don't actually care about them. Yeah, you say you'll do anything for them. Maybe you'll make a meal or run an errand. Just barely enough effort to trick the host into thinking you care. If they have an unmet emotional need though, you turn into the black hole and seek to destroy them for having the audacity to want to be cared for. You split on them and turn them into the bad guy. You blame your host for why you slink off and suck on others hosts. You lie and manipulate so that you always come up the victim in the story. Your host that you are sucking life and resources off of us always to blame. My intuition told me from our first conversation something wasn't right with you. I wanted to see the good and believe the man in the mask was real so I made the mistake of brushing it under the rug. It's my fault I'm in this situation. I've never encountered someone who do cruely uses people and who could lie and cheat with no remorse. I have no experience with such a monster so I didn't trust what I was seeing. Now I do. I know the signs and I will never let a narcissist monster in my life again. I'm not a victim. I learned a hard life lesson and walk away a better person for it. You on the other hand are still the heartless, scared little boy you were the day I met you. ",
        "created_utc": 1668864221,
        "upvote_ratio": 1.0
    },
    {
        "title": "Walking in the desert",
        "author": "throwaway_2234566",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/yzbm9a/walking_in_the_desert/",
        "text": "Before I met him, I feel like I was walking in the desert starved for water (love, touch, sex, affection, connection). Then I met him, he offered me the water to drink, I was so happy and felt this part of me coming back alive. Until the water turned out to be actually poison. They run away from you waving the sweet water you need so much, in front of you, for you to come chase it again, offer you a little drop here and there and for the rest it's pure poison, with longer and longer stretches of thirst.\n\nThis comparison sounds a bit cheesy but still very accurate to me. There are people out there who will kindly offer you water only to fool you and make you more thirsty. That's the first painful thing. Second painful thing is I feel like I am back in the desert once again, and it keeps feeling so lonely.",
        "created_utc": 1668863680,
        "upvote_ratio": 1.0
    },
    {
        "title": "how do I distinguish dark humor from narcissistic abuse?",
        "author": "Medical_Tumbleweed92",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/yz8cs2/how_do_i_distinguish_dark_humor_from_narcissistic/",
        "text": "I've come out a relationship with a person who was a narcissist, at the very least. In my opinion he leaned more towards sociopathy.\n\nAnyway he made \"jokes\" to undermine me, I never stayed quiet and always had a come back because I don't accept any abuse, but it still impacted my self esteem and made me very paranoid now.\n\nI am dating a guy who is the first person I truly like since I was 15years old (I'm 30). However he has a very dark, witty sense of humour. I have a similar sense of humour but I can't stop but feeling he's wanting to provoke me on purpose.\n\nHe admits it, he does say that he likes provoking people (he's a bit of a character and he suspects he is autistic) , so he does not hide it but I told him re my history of abuse and he keeps doing it. He will apologize if I get offended, tells me he didn't mean it in a bad way, that it was a silly joke and he understands my reaction is a trauma response. \n\nIt happened a few times now already. Most often it happened over text, but I noticed it in person too. \n\nI don't know if I should just end it or I'm genuinely just traumatised and I can't handle this kind of humour.\n\nHow do you distinguish between genuine dark humor and abuse?",
        "created_utc": 1668851546,
        "upvote_ratio": 1.0
    },
    {
        "title": "Emotional setback after talking to the new supply",
        "author": "ShinyHappyPizzas",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/yz48re/emotional_setback_after_talking_to_the_new_supply/",
        "text": "I left my narcissist ex almost three months ago after 3.5 years together. We started as an affair and I kept taking him back after discards and going back to his wife until she divorced him and I was promoted to his main supply in 2021. Things went really downhill then and i finally took a job in another state to escape him, much as i loved him. Massive injury to him. \n\nSince then we’ve had this awful push and  pull where i said I’d come back if he went to therapy and got off the dating apps he joined immediately after i left him. He refused because he didn’t “want to be controlled by me” and we’d have to reconcile without my asking what happened while apart. Well… I found out from a mutual friend that he has been parading around a new girlfriend whom is apparently the One but whom he met … six days ago. He’s asked her to dogsit our dog, has had her over almost every night cooking her my favorite dishes… And she has the same first name as i do.\n\nMeanwhile he’s been harassing me by text, demanding to know whom I’m dating or sleeping with (while hiding this girl) so I reached out to tell her that her new boyfriend has been doing this to me while lovebombing her. She was very nice and horrified by what i showed her… thanked me for informing her. She did tell him and HE  blocked me everywhere — a total 180 — and now I’m completely backsliding from the progress I’ve made since August. I wish i hadn’t known he had literally slid my replacement into my old life. I feel tricked by his constant reaching out like he missed me even if he said he hated me for abandoning him but was meanwhile sleeping with one night stands and then rebounding.\n\nI hate him. I hate that I miss him even though he was awful to me. I can’t stop ruminating now.\n\nThanks for listening, if you’ve made it this far. ☹️",
        "created_utc": 1668834840,
        "upvote_ratio": 1.0
    },
    {
        "title": "Pursuing a relationship after narc…",
        "author": "hellabummed",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/yyv4i4/pursuing_a_relationship_after_narc/",
        "text": "Avoiding mutual feelings….\nSo I go into this liquor store  3/4x a week for almost a year now and Ive gained a (nervous)small talk relationship with one of the male workers there. He has given me free drinks and even marks my prices down. And sorry, I may be oblivious to it but after weeks of this giddy small talk with him and marking down my prices I found out he has a crush on me and he is now awaiting me for the next time he sees me to ask for my number. I found this out through a friend who also frequents the liquor store. Since I found out I have absolutely just wanted to never go into that liquor store again. Dont get me wrong he is CUTE! &amp; hes nice to me and sweet. It would be so nice to get to know someone again. But how do I get over my own nervousness. Reddit help me. I personally think that I struggle with opening up to people. But Im just so afraid what awaits the next time I see him again. What he could say and me not thinking clearly enough bc of my anxiety. This has happened to me more than just this time where I found out someone is interested in me and I just cant place myself in a situation with them. Its been 2 years since I left my narcissist and I just dont know how to get back out there and date people. Will i ever get over this. Do i need to push myself into these extremely uncomfortable situations to get over it?",
        "created_utc": 1668806948,
        "upvote_ratio": 1.0
    },
    {
        "title": "\"It's not my job to educate you\" is a narcissistic flag: Change my mind",
        "author": "idealistintherealw",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/yytp3h/its_not_my_job_to_educate_you_is_a_narcissistic/",
        "text": "I've been working on a list of idioms and terms that are \"tells\" that \"something is going on here.\" I'll give one example, explain why I think that, explain why I think it's relevant to survivors, and ask your perspective.\n\n**What:**\n\nLet's assume you're in a conversation with someone, perhaps someone on the internet, that you believe is civil. The person believes they've been slighted, or some injustice has happened. Now this person doesn't owe you anything, but they seem offended by your stance, and you try to problem solve and learn. Then you get \"It's not my job to educate you.\"\n\n**Why/How:**\n\nIt's fair that the person does not owe you anything. The strange thing is this is their hobby horse; you were likely responding to them. (If they are responding to you, dial it back. Consider how you brought them into the conversation.) That said ...\n\n* The comment is grandiose. It establishes them as superior to you.\n* The comment implies the conversation is part of *some greater conflict*. It is, in a way, a sort of covert version of the grandiose fantasies of traditional NPD. (\" fantasies of infinite success, control, brilliance, beauty, or idyllic love...\")\n* The comment allows the person to be *special or superior* without any effort\n* The comment defines an in group (those that \"get it\") and an out group (everyone else),\n* The comment may imply the person expects some special treatment, yet refuses to defend why they should get that special treatment.\n* The comment is not kind. This is probably the least compelling; unkindness is not a crime. On the internet, the ties that bind us are particularly loose. Yet still, given that a lack of empathy is a diagnostic criteria for NPD and BPD, I thought it was worth mentioning\n* ***Most importantly***, the comment make problem solving impossible. That may be by design. Narcissistic abusers *like* to create a scenario where they are superior and the other person \"inferior\", below, incompetent, owes them something, or is somehow in some sort of ethical breach. They don't want to solve the problem; they want to *have* a problem.\n\n In my codependence-ish phase, I would try so hard to please the person to show I was a good, educated person. Sometimes I would do my own research and come back in a week or two. That ... that never turned out well.\n\nI don't have a large number of data points to sample here; it hasn't happened to me a bunch of times. After the most recent time, though, I noticed the issues above. I'm not saying the phrase is 100% \"that person is narcissist!\" I mean, we all have bad days, maybe I was being overly familiar and demanding too much of their time. Maybe they were having a bad day; maybe the burden of their issue was just too much at that moment.  I am just saying the term is correlated with unhealthy thinking and behavior patterns. \n\nWhen you hear this term, the person is declaring they don't want a conversation about the topic. So don't give them one.\n\nAm I wrong? What do you think? I have maybe a dozen of these yellow-flag phrases but this is the first one I really broke down.",
        "created_utc": 1668803139,
        "upvote_ratio": 1.0
    },
    {
        "title": "They forget you completely",
        "author": "custardprincess",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/yynguq/they_forget_you_completely/",
        "text": "It hurts so much. You do everything you can to make them happy because you want to show them how much you love them and want them around. But they treat you like shit. And one fine day they’ve forgotten all about you. You don’t exist in their world at all. You feel tempted to check their socials if they mention you at all. Check with mutual friends. Nothing. Like you were never there. It just hurts so so fucking much.\n\nSometimes it really feels like I demonised him too much, read way too much into his actions, without giving him a chance to act right. Feels like I let my anxiety and fear of abandonment win by breaking up with him.",
        "created_utc": 1668787138,
        "upvote_ratio": 1.0
    },
    {
        "title": "I feel rejected by the whole world and wish I could figure out what is bad about me",
        "author": "Sad_Ad_5326",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/yy34q0/i_feel_rejected_by_the_whole_world_and_wish_i/",
        "text": "I don’t know, since my abusive ex dumped me in the worst way, I feel so ugly and undesirable and just disgusting. I didn’t have these feelings before. I find myself comparing to anyone on the street, wondering how they can be so happy and look wonderful and I look horrible from the outside and inside after this trauma.\n\nI wish I could know what is wrong about me. I’m already spending lots of money on hair care, skin care, make up Etc and am in very good shape. But I feel so horrible, thinking that I must improve something about my appearance.\n\n\nI feel like my abusive ex wouldn’t have dumped me if I had looked amazing. In reality, he dumps girls in only a few weeks or months.\n\nDo you think there’s something objectively wrong about my appearance? I feel so ugly that I don’t want to go on the street. My abusive ex told me that No attractive guy would ever be into me because attractive guys are out of my league. Yet he showed off how beautiful I was in the beginning of our relationship.\n\nAre my fears true? Is there something wrong about my appearance? Something that bothered him or wasn’t enough that he chose to abuse me and dump me?",
        "created_utc": 1668722895,
        "upvote_ratio": 1.0
    },
    {
        "title": "Another instance of indifference",
        "author": "throwaway_2234566",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/yxw2ue/another_instance_of_indifference/",
        "text": "I wrote a couple of weeks ago about how I feel totally indifferent about my ex of 8 years ago. If I would meet him now, I would walk away fast, but for the rest I wouldn't care. \n\nYesterday, I went shopping alone. I ran into a former friend of mine, who showed some very toxic behaviour to me as well at the time. Of course I don't know if she is an N as well, but her behaviour certainly points to it looking back. She 'broke up' with me in the most terrible way, one minute we were friends and then she just refused to speak to me even though she saw how terrible I felt. I did my best back then to just talk to her, even through a mutual friend. I was so hurt, she was one of my best friends. \n\nI saw her, and just thought, ah it's you. And walked past her, and continued my shopping. 5 minutes later, forgot all about her. She saw me, our eyes met but I put on my poker face and she didn't say anything. Honestly it felt empowering, I was like I don't give a crap about you anymore you are in my past and that's all. \n\nI hope I can get to that point with my ex as well, I am sure I will but I still feel far from it. But that day is coming closer.",
        "created_utc": 1668706095,
        "upvote_ratio": 1.0
    },
    {
        "title": "Being called \"Too Sensitive\"",
        "author": "SuperKingPapi",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/yxtzfz/being_called_too_sensitive/",
        "text": "I make art. It's therapy for me. I'm not sure if it's OK for me to post a link to my Instagram.\n\n https://www.instagram.com/p/Bx0vDQ1Ft4y/?utm\\_source=ig\\_web\\_copy\\_link",
        "created_utc": 1668700999,
        "upvote_ratio": 1.0
    },
    {
        "title": "Jean in the show Gypsy on Netflix seems like a narcissist",
        "author": "WillingnessRelative2",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/yxtoaw/jean_in_the_show_gypsy_on_netflix_seems_like_a/",
        "text": "i was just wondering if anyone else who has watched the show thought the same.",
        "created_utc": 1668700250,
        "upvote_ratio": 1.0
    },
    {
        "title": "People that can't be wrong",
        "author": "SuperKingPapi",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/yxtil7/people_that_cant_be_wrong/",
        "text": "Sheesh! So, this is not necessarily a new issue, I mean, I've always not really enjoyed being around people who can't be wrong, but after my experience with a BPD/NPD, it seems like my radar is on heightened alert. I always try to give the benefit of the doubt, but so many people put it upon themselves that they need to prove that they aren't wrong, and they do it in so many ways. Some ridicule, some lie, some tell \"proof\" stories, some blame circumstances or other people, some have a list of excuses. I think it might be because I don't really hide my reaction anymore, and that's new, and I feel like it will bring peace if I just let it all go, no reactions, not really care. I also don't want to fake a reaction. I'm just tired of it. Juggling conversations with my nex was exhausting, usually ending with me using humor, changing the subject, or just waiting til she got distracted by her phone and just snuck out of the room.\n\nWith my kids, they know the \"did you check your source\" look. I homeschooled them, so they know I'm all about critical thinking and deep detectiving. They will tell me something as fact, and I may not know if it's true or not, but you know, some things are just too unbelievable. I don't shit on them or anything, and I make sure they know I'm just skeptical (of TikTok being a source).\n\nObviously I'm not always right either, but I am first to admit it. \"Woah, yeah, I see that. I thought I knew what I was talking about. Thanks for showing me.\" \n\nBut it's when people have an opinion, and I play devil's advocate (which I realize I need to stop doing), or I tell them MY opinion. That's when it gets hairy. Why is it that everyone can have an opinion, but I can't.\n\nThings people hate:\n\n\"Where did you hear that?\"\n\n\"Have you looked that up?\"\n\n\"I thought you said \\_\\_\\_\\_\\_\\_\\_\\_!\"\n\n\"So, you changed your mind about \\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_.\"\n\nOne of my daughters came up with a super wise phrase: \"You don't have to have loyalty to any of your opinions.\" Something like that. I think that's pretty dang wise. It's something I have tried to live by, and am learning to not fight over. Opinions, facts, truths, etc. Yeah, it's sometimes difficult to wait and watch, and then super frustrating when they fight me about never actually having said or believed something.\n\nThere's just a ton of gaslighting in the world. Maybe it's just another thing I'm (frequency bias) noticing after my experience, but it sure seems rampant.\n\nI was gonna say \"I'm picking my battles\", but the truth is, I don't want to battle at all. I want to accept, love myself, be myself, \n\nSo, yeah, \"Life After Narcissism!\" Long, difficult, testing, frustrating, eye-opening, effort, painful, revealing, exhausting, but also growing.\n\nAlso: No one needs to hear my advice, no one wants to hear my unsolicited opinions, people like to talk.\n\nIt's really a bummer how my experience with a BPD/NPD has really opened my eyes to so much bullshit...and bullshitters.\n\nThis has been a rant. Stuff I'm processing.",
        "created_utc": 1668699854,
        "upvote_ratio": 1.0
    },
    {
        "title": "How can it be “it’s about him” if I was the one who wasn’t good enough?",
        "author": "Sad_Ad_5326",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/yxt4d6/how_can_it_be_its_about_him_if_i_was_the_one_who/",
        "text": "I failed him. I disappointed him. I was the one who wasn’t beautiful enough. Smart or interesting enough. I hear so many people say “if your abusive ex discarded you, that says nothing about you and everything about him.”\n\nIs that really true? In the end he was the handsome and cool guy and I was the one who is not gorgeous and not lovely. \n\nIt was my responsibility. I could have been more beautiful, more athletic, more “girly”, more sexy. And to be honest, at times I didn’t look very beautiful because I was so exhausted from the hell he put me through. At times I didn’t have the energy to do my make up or hair. \n\nIsn’t that all my shortcoming? Couldn’t I have prevented the discard by fulfilling his beauty standards? \n\nI know that many people tell me that I look like a model. But that is crazy. None of that would have happened with him if I had been attractive like a model!",
        "created_utc": 1668698842,
        "upvote_ratio": 1.0
    },
    {
        "title": "Was it narcissism or did I ruin him?",
        "author": "onemorethrowaway2000",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/yxntvn/was_it_narcissism_or_did_i_ruin_him/",
        "text": "TW: suicidal thoughts, guns\n\nI’m really struggling with something that happened before my husband of 14 years cruelly discarded me earlier this year. It will take me a minute to provide the context for this event so please be patient with me. \n\nAfter the discard and learning more about narcissism, I’ve come to realize my husband is very likely NPD. He also went to a handful of my therapy sessions with me (at their request so they could explain how I needed support for depression) and the therapist told me after he seemed highly narcissistic and abusive. But I keep feeling like maybe it was me that ruined it.\n\nAnyway, there was a really shitty work event earlier this year and I had a mental breakdown. I was afraid I would lose my job and it would screw up our life going to one income. I felt like such a dissapointment to myself and my husband. I started having suicidal thoughts and realized I needed help and that’s when I got into therapy (I was already medicated for depression and had those meds tweaked too).\n\nShortly after starting therapy and going on short term medical leave from my job, my husband revealed he had been chatting up a young, female, highly sexualized coworker outside of work. He had always made friends of his coworkers throughout our marriage, but I thought nothing of it before. I had access to his phone and email and most of his previous coworkers seemed harmless (older and married females, lesbians, or males). For the first time a friendship seemed like an affair brewing. \n\nHe showed me a “joke” she had sent him on his phone, and I scrolled up and saw photos of her and conversations that seemed too friendly and frequent. Then I found her socials and it’s littered with 98% nudes (covered up just enough that instagram won’t flag it). I asked him to block her outside of work. He said it meant nothing but he would block her for my sake. Then he didn’t and kept talking to her. \n\nWhen I found their conversations again I broke down. I had been cheated on by my ex-boyfriend (he knew this) before we were married and I felt it all coming back. I screamed at him why was he hurting me, why was he doing this when I loved him. He was detached and cold. He then threatened me saying he wouldn’t forgive me if I contacted her or his boss or affected his job in any way. I was sobbing and in despair at this point, and I said something like I’m going to kill her or myself and went towards a safe where we kept a firearm. (Neither of us have ever used the firearm, we got it years ago to go shooting with his dad and that never happened.) He grabbed me and pushed me down on the floor. \n\nThen he seemed like he was having a breakdown of his own. His eyes rolled in the back of his head and he was hyperventilating saying, “I didn’t think you would actually do it” (referring to suicide, I guess?) and then told me I “killed the love” and he “wouldn’t be in this marriage at gunpoint” and he would divorce me.\n\nAt the time I felt horrible seeing him like that, and it snapped me out of my own head. I tried to hug him and comfort him. I told him what one of my therapists said which is to not make a permanent decision for a temporary problem. I told him I loved him and to please stay with me. He recovered quickly after I said that. Looking back, I question now if his “breakdown” was an act because it was over so fast. He then said he would give us another chance so that I didn’t think he was divorcing me because of infidelity.\n\nIt would go on too long to recount everything that happened after  (in a previous post I detailed how he abandoned me), but it had the hallmarks of a narcissistic discard. He acted loving and wonderful and supportive for a time, all the while continuing on with the coworker and getting a divorce attorney behind my back. He told me how much he loved me on our anniversary. The next day he was sleeping on the couch because he “couldn’t do this anymore”. Then he says he wasn’t in love with me and had been unhappy our whole marriage. He rewrote history and blamed me for everything. He said he hated me and I ruined his life. He refused marriage counseling. He said he couldn’t trust me because I was mentally ill. I ran around desperately trying to fix things and he told me not to try, his mind was made up. He gave me the silent treatment and blackmailed me. He smeared me to others and blocked me from talking to anyone we knew.\n\nSince he left and filed for divorce, I’ve been deeply depressed more than I ever have been. I keep going back to this event thinking that if I hadn’t broken down that night I wouldn’t be separated from the man I love. Maybe he’s not a narc, maybe I broke him. Maybe he never had feelings for her. Maybe it’s my fault. I don’t know anymore.",
        "created_utc": 1668684460,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is this abusive, too?",
        "author": "Sad_Ad_5326",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/yxbvtb/is_this_abusive_too/",
        "text": "My abusive ex did this one or two times and I was wondering if that’s abusive actually..\n\nSo when this happened, it was in the morning and he told me in a very cold voice that HE would go downstairs to have breakfast and “that I should stay right there in his room and not go anywhere”. He didn’t say it directly but it felt like a threat. As if he said: “don’t you dare to leave this room.”\n\nWhat makes this hard to grasp for me is that it makes no sense. Why would he suddenly demand that I stay in his room and not have breakfast with him? And also I can’t tell if it was emotionally abusive because he didn’t lock me up in his room. \n\nI am wondering if that’s got something to do with the fact that minutes before this happened, I told him that I didn’t want to do a specific sex activity.\n\nWhy do you think did he do this? Was this emotionally abusive? Am I just exaggerating it? Maybe he didn’t mean it in a bad way?",
        "created_utc": 1668646657,
        "upvote_ratio": 1.0
    },
    {
        "title": "Ironically it feels like my life is over after going no contact with abusive ex",
        "author": "Sad_Ad_5326",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/yxbgiz/ironically_it_feels_like_my_life_is_over_after/",
        "text": "\nI mean, of course I’m healing. I’m aware that I’m slowly returning to my old self, actually more peaceful and wise old self but I feel like life is over. I will never be happy again.\n\nMy abusive ex was like my god until the abuse got so bad and I got wiser that I decided to distance myself from him. I did this by not giving him as much attention, adoration, Etc. And set boundaries. He perceived this as “rejection” although I was just trying to protect myself. \n\nHe then belittled me, told me the new women he found was much better than me and that I was never good enough for him. That hurt me deeply. He then dropped some hints that I should beg him for another chance but I just went no contact. \n\nSince then I’m pretty numb and heartbroken still. I can’t make sense of what happened. It feels like my life will never be as happy and exciting and adventurous again. I miss the lovebombing stage when I felt validated by somebody that I loved. At that time I always thought deep down that no attractive man (or any men) would be into me. \n\nSince I don’t have that validation by him any more, I feel like the whole world and life in general has abandoned me. I miss my abusive ex because he provided me with that rush.\n\nWould I have been happy if he had stayed with me and not left me? Would kids have been blissful? For some reason he made me believe that he was the only one who could provide that",
        "created_utc": 1668645522,
        "upvote_ratio": 1.0
    },
    {
        "title": "Was the new supply chosen because she has something that I lack?",
        "author": "Sad_Ad_5326",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/yx58qq/was_the_new_supply_chosen_because_she_has/",
        "text": "It doesn’t make any sense to me! I know how much he has abused me, how toxic he was, how he enjoyed my pain and threw me off the pedestal. How I became a pile of sh** after I was idealized and called a goddess.\n\nWhat in the world makes us victims think that the new partner is somebody better? That the new partner has something we don’t? How can we compare ourselves to another victim that will be abused? Deep down I think he wouldn’t left me for her if I had looked like her. \n\nI don’t know if it’s because I have autistic tendencies. I have days when I feel so sad and compare myself to his new partner. That she has something that I lack. It’s not true, right?\n\nHow can I stop feeling less than? Isn’t it so that abusive people are just looking for the next person to abuse? Isn’t it so that they can’t cherish neither their current partner nor the next?\n\nIsn’t it so that we all, including me and his new victim and his previous victims are just victims but not better or worse than one another? I always found myself comparing to his ex gf’s as well because he kept comparing me to them. But it’s not true that the new victims are better than the old ones, right?",
        "created_utc": 1668630622,
        "upvote_ratio": 1.0
    },
    {
        "title": "LC with Emom progress",
        "author": "Wrong-Owl-5858",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/yx4gz1/lc_with_emom_progress/",
        "text": "So, I wanted to kind of \"update\" on how LC is going in hopes other people can kind of see an example of what one person is doing to manage it and maybe take some of it with them to empower them. I also appreciate the advice I've been give from people who are also in LC with someone 🤍\n\nSo, long story short, my Emom enabled my Ndad throughout their marriage. Creating my GC/Nbro and I'm the scapegoat/black sheep. Parents miraculously divorced. I went NC with NDad and a few years later NC with Nbro. My Emom has remarried a nice person, but also isn't very emotionally intelligent (and he even said this himself). So take that as you will but this story focuses on my Emom because she is who I still talk to.\n\nOver the past few years I've gone through my own shit to deal with since I've moved out, and have a very rocky relationship with my Emom because  she is triangulating with Nbro, to get me to reinstate contact with Nbro.\n\nI'm trying very hard to keep this short, but basically I had to put some serious boundaries in place with her and the last time she broke it I went NC for like a week or so. It wasn't long, but I needed her to understand how serious I was about this boundary. If she couldn't stop talking about Nbro, I will effectively end OUR relationship and be done with it totally. \n\nThere is some other baggage here too but I won't get into it. Resentment and what not.\n\nSo, ever since that original NC for a week happened, my emom and I have been rebuilding. Slowly. Perhaps not surely. It's just what it is now. It was like after we got that major issue away (no talking about Nbro), we could finally actually work on other parts of our relationship that weren't working for me.\n\nI've been going to therapy for about 1 year and I believe I've made a lot of progress. I've officially been told by my therapist that I am in remission for depression, yay! So, things are looking up for me.\n\nNow on to the actual thing I wanted to talk about (haha sorry it's so hard to keep this shit short).\n\nSo my mom and I see each other like once a month. Minimal texting in between. I can tell my mom has been a bit more...open with me since she's been texting little things here and there. Like sweet and cute things. But as a survivor, I still know better. I just kind of let it be and don't engage much.\n\nSo, I was feeling good and 2 weeks ago I was like, \"Mom I want to learn how to cook the food you make\" because she has a bunch of recipes she doesn't write down. She just knows them from memory and the food is really good. And I had began to think, man when she dies her recipes go with her (morbid I know). \n\nSo I thought maybe I would go to visit her to learn how to make those recipes over time and write them down.\n\nSo something I mentioned to my therapist is I started to notice that I need some type of distraction with my mom. I absolutely cannot just sit in a room with her and *talk* casually. So that's why I don't do phone calls or text messages. But I can be in the same room with her if we are both focused on something else (movies, other people, pets, shopping).\n\nSo this is literally how I even hangout with my mom now. I never go to her house without a plan now, and I make damn sure I only stay about 3 hours. Never ever stay longer. This was a slow buildup. Because at first it was very hard to just be like, \"Okay I'm leaving!\" Because well you all know. They say, \"No stay longer\" etc and try to make me stay.\n\nSo overtime I began telling her, \"I will be there at X and leave at Y\" and we will discuss if it doesn't work with her schedule, but I ALWAYS tell her I will leave at a certain time, before I ever get to her house. So she isn't surprised when I say I'm going to leave.\n\nThis has been great since this also allows me to then practice holding boundaries in general. So when she does try to keep me longer, I say, \"I Want to go home\". It's kind of like saying, there's nothing that can convince me to stay.\n\nSo back to asking about visiting her. It's scheduled for 2 weeks to learn some recipes from her that day. It's already planned.\n\nMy mom texted me yesterday that she was making a reservation for a Country Club she's a member at, for Xmas dinner. I simply responded, \"No thank you\"\n\nBut let me tell you the anxiety I used to feel when shit like this happened was not as strong as it used to be. It was honestly fucking great.\n\nPartly because my husband helped me say no to my parents during Thanksgiving too. It was easier then because they are traveling somewhere, and we didn't want to travel. So his encouragement got me to say no.\n\nCause like in the past when my mom would ask about holiday/family stuff, I'd always get this pang in my chest from anxiety. The knowing that I am about to do something I don't actually want to do. However this has been my fucking year of \"NO\".\n\nSo when she asked about Xmas, I felt that pang, but I remembered the feeling from when she asked about Thanksgiving and how I felt so much better after saying no. So I had the strength this time to say no to xmas.\n\nYay! Victory! Right?\n\nSo, my mom does text more. She says, \"why?\" And you know what I did? I ignored her message and still am btw 🤭 I've already set a precedent that I won't text her every time she sends one. So too bad.\n\nSo aside from just not liking the idea of family dinners anymore (no distractions!), I also don't like the Country Club. My mom still has some FLEAS from Ndad, so she still likes to pretend she's a rich person and wants to hangout with rich people at their exclusive club where all the rich people gather. This has been a consistent theme with my mom since before the divorce. So I KNOW she likes this place because it makes her feel like she's doing well with herself. You know what, that's fine, but I don't like it and I don't live my life like that.\n\nI got a message about 40 minutes later saying she made the reservation, and hopes I change my mind because, \"I will be living in a trailor and it would be nice to have a nice family dinner\"\n\nLike this is fucking hilarious to me now being on the otherside of my brain fog. Like mother you are so self-absorbed you just have to try and guilt trip me so you can feel better about yourself having \"family\" altogether, and you really are trying to tell me woe is you?\n\nI should add btw, that my parents will be living in a trailer that is in their giant backyard, because the $1 million home she bought will be seriously renovated. 🤣\n\nLike that is hilarious to me that she does that now. Like MOTHER are you serious? 😂 it's moments like this when I really see how her emotional growth stopped around the time she got married because she sounds like a high schooler (arranged married at 18).\n\nAnyways, I'm still ignoring her and my husband and I have decided that when we do see her in a couple weeks, we will deflect by saying we plan to have Covid during Xmas, that why we can't go. Ultimately its just we don't want to go and that's basically how I will try to leave it at. Or maybe we won't I'm not certain yet.\n\nThanks for reading \n\nHappy healing🤍",
        "created_utc": 1668629027,
        "upvote_ratio": 1.0
    },
    {
        "title": "I don’t understand how in the world I can be jealous of his new partner",
        "author": "Sad_Ad_5326",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/yx3hxq/i_dont_understand_how_in_the_world_i_can_be/",
        "text": "It doesn’t make any sense to me! I know how much he has abused me, how toxic he was, how he enjoyed my pain and threw me off the pedestal. How I became a pile of sh** after I was idealized and called a goddess.\n\nWhat in the world makes us victims think that the new partner is somebody better? That the new partner has something we don’t? How can we compare ourselves to another victim that will be abused?\n\nI don’t know if it’s because I have autistic tendencies. I have days when I feel so sad and compare myself to his new partner. That she has something that I lack. It’s not true, right?\n\nHow can I stop feeling less than? Isn’t it so that abusive people are just looking for the next person to abuse? Isn’t it so that they can’t cherish neither their current partner nor the next?\n\nIsn’t it so that we all, including me and his new victim and his previous victims are just victims but not better or worse than one another? I always found myself comparing to his ex gf’s as well because he kept comparing me to them. But it’s not true that the new victims are better than the old ones, right?",
        "created_utc": 1668626951,
        "upvote_ratio": 1.0
    },
    {
        "title": "Holy shit, covert narcissists are the absolute worst.",
        "author": "prdmn",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/yx1a9m/holy_shit_covert_narcissists_are_the_absolute/",
        "text": "This is going to be a semi-vent, semi-”things to look out for” post (and definitely don’t click on my profile if you’re not willing to see NSFW content–it’s filled with asscheeks). I'd rather not expend energy going into further discussion about it, but I wanted to throw this all out there into a space that might be able to relate/use any of this for insight.\n\nSurvivor of parental narcissistic abuse here–sadly ended up in two established abusive relationships with narcs in my early 20s (both short-lived, and I’m realising part of why they were short-lived is because I had already started setting boundaries, becoming worse at taking shit, and shying away from bluntly holding people accountable when they cause harm and narcs *do not* like that shit). I’ve done a ton of work, healed so much and made light years of progress in the past (hell, I managed to recover from and be in remission from c-PTSD, which is a massive feat imo). Unfortunately, I just got out of a short, thankfully not-yet-established-relationship stint that sucked my soul out during it and it’s hitting me really hard that this guy is a covert narcissist, and all the signs were–albeit covertly (hah)--there. I think after my biological n-mother and my first abusive ex who were both overt narcissists, I got so hyperfixated on looking out for signs of overt narcissism that I failed to realise a far worse evil exists on this earth; namely, covert narcissists. The inevitable discard made me spin out because it seemed to come out of nowhere, but now it makes perfect sense–he was starting to get really stressed out by me making boundaries/expectations clear and holding him to task for his fuck-ups. And looking back…oof, this man wasn’t just a few red flags, he was a whole damn Formula One racetrack. What follows is a non-chronological assortment, not the whole list, and for preface–this is a grown adult man (definitely not newly adult either) and I gave him *way* too much leeway as a survivor of ongoing parental trauma (will get to this later):\n\n* HUGE red flag that I brushed over right at the beginning–he kept doubling down on something harmful, I outlined and explained why that was harmful and hurtful, and he sort of…went quiet? Then came back and resumed conversation like nothing had happened. I asked him why he doesn’t apologise when someone explains to him how he has caused hurt and harm (wtf kind of adult doesn’t apologise?! Right, yeah, fucking narcs), and his response was “I only apologise when *I* think I’ve done something wrong” (this is such a textbook narc thing to say that I wanna scream-laugh looking back on it) followed by “what could I have said that would make you stay?” I was incredulous and said it’s not about saying “something someone wants to hear” but rather genuinely apologising, listening and making repairs. This was, of course, a massive narcissist flag re: looking to manipulate and say the right things with an agenda and without sincerity. He made stray statements about how he feels unable to make friends and just 'acts a certain way that makes people like him'. He said this sort of stuff sandwiched in between some sob story or self-pity parade, but whew that's just plain manipulation.\n* Absolutely no stable sense of self–which I now recognise to be the narcissist's lack of selfhood. One day he'd be talking about how he 'can't really make friends' and doesn't have close relationships; another day he'd be talking about how his 'only safe and close relationships are his friendships'. One day he'll go on about how he's \"cheap and frugal as shit\"...a couple weeks later he's blowing thousands of dollars in making redundant upgrades to his computer while unemployed with no source of income lined up and harping on about how he's bad with money. I had first chalked it up to trauma (like I did with many, many other things), but now within the larger context–nope. He also constantly talked about feeling empty and hollow, and packaged it into the 'I'm so sad and helpless' facade–which is also a textbook narcissist trait.\n* Somehow every bad thing (including interpersonal things) that has ever happened to him has “somehow happened to him”--everything he can’t access like friendships and care is in no way on him; that everyone at nearly every place he's worked at either disliked or outright hated him–and the constant undertone of how it’s all *just so unfair* (mind you, this is a white cis man who benefits from and has access to nearly every system of power in society–as a multiply-marginalised person, I’d get this grievance if it were someone multiply oppressed and being hit with violence and horror at all times). There was also a constant tone of envy and jealousy that permeated his grievances, and bloody hell holding space for his million insecurities that he didn’t do a single thing to address by himself  ran my energy levels to the ground. Again, in retrospect–very typical narc trait.\n* Extremely exploitative relationship with human beings in general. It was subtle at first and because it's a covert narcissist than an overt one, quite a bit of it came couched in fake benevolence–primarily in the form of a dominant saviour complex and 'caretaking'. He never talked about a single person in his life as autonomous human beings with inner lives, selfhoods, and personalities of their own–he just excused all their inexcusable actions and talked about them as infantilised helpless objects that he was using to validate himself by being 'useful' to them–because they just can't exist without his 'help'--or talked about what they did for him (i.e. how they enabled and coddled his patterns). The exploitative trait becomes far more apparent later–strap in for the ride.\n* The “I’m so sad and lonely, nobody wants me, I can’t make friends” act, and blaming it on shit like his appearance and “shyness” (because of course these are easier things to blame). Homie, it’s not your face or your body or your “shyness”--it’s you being an insufferable shitbag of a manchild.\n* He hardly ever asked me about myself, my story or my opinions–nothing beyond infantilising me and 'caretaking' for me to make himself feel good. For context: I've lived a heck of an adventurous life and definitely have a lot of stories to tell, and experiences to share. \n* He puts up a front that he's very attuned to all things sex (most of his 'validating experience' it turns out is getting off random horny guys from reddit through text) but everything to do with sex was this contrived exhausting performance with him. I was trying my best to make him feel safe enough to just enjoy and explore how he wanted to, but it was never enough unless it was feeding his need for validation and insatiable ego. I'm very confident in and comfortable with my sexuality and eroticism, but this experience genuinely ran me down. \n* I'm also starting to drill it into my head that narcs cannot maintain long-term relationships with anyone who aren't similarly cruel and dysfunctional, or at the very least people who don't enable their bullshit. Lo and behold, his only two 'friends' are pieces of work (yet another red flag–how do you claim you hung out in alt-right circles as a teenager before 'seeing the light' and still have the same friends from that period of values in your life?). One of them is a racist misogynist who made rape jokes for years and is deliberately extremely cruel to people as a 'form of banter', and this guy has had women come up to him to tell him about horrible shit this friend had done. Apparently he had 'yelled and cut ties'. Why is he back now? Oh, because he 'has a boyfriend now and he's better' (spoiler alert: he had done no actual material work or accountability holding'). I also pointed out that that's a messed up way to conceptualise relationships–where someone swoops in and makes an atrocious person 'all better' (turns out this is pretty much how he views partnerships anyways–as people to exploit for gain). The other friend generally sounded like an unpleasant and unkind person and from what I gathered, has very unhealed BPD. I had to have a short chat with her after the discarding to give her a heads-up about something (I did this only after determining this was a possible serious safety issue) and that conversation was eye-opening. I felt like I was talking to an AI chatbot trained on the cruelest posts on Reddit and twitter trollbots who had never interacted with another person while considering them a human being, it was extremely up-and-down and volatile, and there was a lot of the undertone of 'I have mental health issues and therefore everything I say and do, however I do it, is valid' (horrible lot, zero accountability). It sounded eerily identical to how this guy communicated with me while stonewalling during the discarding process (in retrospect, the devaluation had started far earlier), and I've honestly never spoken to someone at length who communicates in such a disgusting, dehumanising way in my adult life. I don't know a single person around me who wouldn't check someone for speaking and communicating this way either. This did confirm one of my gut hunches though–I was worried about being controlling somehow in how I judged these friends and the boundaries I laid down around it, but of course it's a circle jerk of narcissists and cluster Bs with no sense of accountability, all of them moving through the world like wrecking balls and destroying people (including themselves) in their path and cheering each other on as they do. \n* Pathological lying, and writing it off as 'panic'/accompany with sob story around why the lying needed to happen. (More on this later) I found a stray post he'd deleted tagging himself as a trans woman and I'd gently asked if he wanted to talk about it, but that we absolutely don't have to if he'd rather not. He told me an elaborate story about how a man on reddit had forced him into feminisation for sexual reasons for months and how he was still reeling from it. Meanwhile, I stopped looking too much into his deleted post history out of respect because that's an incredibly traumatic thing to happen, and shifted towards trying to be as supportive as possible. Later, when his own story wasn't holding up, he tells me he has something to confess that he feels bad about–he had made up the whole entire thing; there was no man and no forcible feminisation. I was flabbergasted, and asked him why he felt the need to lie. His response was 'I used to lie for attention in the past and that's been coming up' and 'it was just easier to offload the responsibility away from myself' 🙃\n* Wild levels of projection–even early on I'd paused about this a little (I didn't read it as projection as first, but rather immaturity because it was a single observation back then), but his undeleted posts were about how his DnD DM might be playing favourites and deliberately sabotaging his gameplay. The whole thing is a ranty list of conspiracy theories and projections based on seemingly innocuous things (something about his characters not having magic items), and when everyone replied asking if he'd talked to the DM–nope! He just cooked all that shit up without bare minimum communication, and this is someone he'd been playing with for months and purported to 'get along with' (more to the projection bit later as well). \n* Holy shit, reading every problem I’d bring up as an attack on his character and hypersensitivity to anything, and bringing up fucked up shit he’d done in the past only to sweep it under the rug after. One time he’d brought up how he’d overstepped someone’s consent as a teenager while drunk and felt guilty about it–later when I noted his drinking habits were a bit unhealthy and mentioned it might not be a bad idea to get a handle on it especially if there have been incidents of him acting in ways that contradicted his values (back when I was manipulated into believing his values weren’t cruelty, harm and feeding on people’s souls like Poundland Edward Cullen), he went on about how hurtful it is to even refer to it. I had brought up that being around and enabling racist misogynist people with a history of horrible behaviour makes people's lives unsafe for others and it would prevent genuinely safe people from being able to comfortably approach him and be friends (back when I was rooting for this dude and wanted his life to be filled with wonderful people–not at all just me). This was met with a disproportionate night of silence followed by 'this is what made me log out because it felt like you were saying it's my fault I don't have friends'. I immediately apologised and clarified what I meant, but honestly…what the fuck. If I brought up a worry about potential lying? \"Why would I lie?!\"...after literally feeding me a wild made-up elaborate story about trauma that never happened and admitting to lying for attention. \n* Every single conflict where I tried to address a recurring issue to try and solve the problem together spiralled into him conveniently 'panicking' and going on a self-pity tirade destabilising me about how 'he's not good enough' and so he 'can't do this anymore', followed by yo-yoing on it all and more conveniently timed \"panic episodes\". It was a ploy to both dismiss the original concern I'd brought up, avoid accountability or responsibility and centre himself, while also coaxing validation out of me for himself i.e. I'd need to soothe him and contradict his pity-party, in place of centring my needs and concerns and having them met/addressed for once. \n* One of my final synchronous video conversations with him during the discarding period is where I realize shit isn't just bad– it's a horrorshow. He fumbles, lets his facades drop some and lets a bunch of things slip that raise a million alarm bells in my head. It's following this conversation and the cues I picked up from it that I dug into that I made the bunch of horrifying discoveries in one go (as well as realising that Reddit archives all user-deleted posts publicly via Pushshift):\n   * I realise the thing I had mistakenly interpreted as kindness and grace during some of our conflicts was him dehumanising, stonewalling and ignoring me entirely because he didn't like hearing a word about what he'd done wrong. And there I'd been, blaming myself for getting a bit too reactive during conflicts (when it was my gut telling me I was actually being unheard, degraded and dismissed), bending over backwards to work on this on my end and making sure I stayed on top of my reactivity to make things safer for him.\n   * I asked why–he said he just figured I'd blow up and do xyz things anyways–things I had directly gone out of my way to do the opposite of at all times during my time with him to make him feel safe. I brought up concrete examples of these, and it basically lands on: he'd been projecting an absolutely demonic dehumanising construct onto me the whole time and projecting hard (mostly his own traits) so it'd be easier to dump and discard me when he was done using me. He said I'd \"blown up\" once…this was the time when he'd yo-yoed 4-5x within a span of a handful of hours on where he stood with me under the guise of panic and I'd rightfully called it out and expressed hurt–no yelling or outbursts involved, just pain. Expressing any sort of pain or outlining hurt he'd caused was, and continues to be, unacceptable to him.\n   * Everything was my fault, including all the things *I* was biting my tongue around and trying to accept on his end just because he was a 'trauma survivor' (I'd told multiple people fairly early on that I couldn't see myself standing for a lot of it for even a minute were ongoing parental trauma not involved–mistake on my end). He made it a point to not grow up or think about a single thing beyond surface-level juvenile analysis (either when it came to introspection or the world at large), so it was my fault for 'making things serious', despite me pointing out multiple times how his malignant spiralling during conflicts and inability to engage maturely made for a horrid and stressful dynamic. The worst of it was being blamed for all of his feelings and being blamed for bringing up things important to my life. he blamed me for making everything about '&lt;insert systems of oppression to do with racism etc'&gt; that had entirely altered the course of my life, and threw in some white supremacist talking points as well (then of course blamed me later for 'having presumptions about his white lens'...buddy, observations based on **your** words and **your** actions aren't presumptions). He had described dissociating his entire life, including at a job interview where I was nowhere near him, and because I had sent him an article on dissociation for support he went 'well I dissociated while we were together'. He talked about having anxiety all his life to the point of consistently getting nosebleeds (although, looking back, all his anxiety episodes also coincided with the bare minimum pointing out of something he'd done to cause hurt or harm), but \"I still have anxiety when we were together\". I replied that it's an inhumane expectation to put on someone to swoop in and fix all their mental health issues, but I asked him if there were specific things I'd done to make it worse because I'd love to do better and make him feel safer if so. Nope, according to him there were 'no concrete reasons' but if he still had anxiety while with me, \"what was *I* doing to make it happen\" (paraphrasing him in all these quotation-marked statements). Meanwhile he'd done everything and a half (so many of it completely unrelated to me or us) that he'd mentioned were lifelong anxiety triggers for him while we were a thing, multiple times. I asked him if he sat with his feelings to get to their root first before holding other people responsible for and...he looked like someone had told him you're *not* supposed to put the aluminum foil inside the microwave for the first time in his life. No work, no thoughts, just blaming everyone for all his internal responses and external failures. Absolutely heinous shit. I'm not a bloody endless SSRI supply and I'm not responsible for whatever happens inside the void black hole of a narcissist's innards (or other people's unchecked emotional responses, period). \n* The worst things though? Finally letting myself dig a bit further after he let some concerning statements slip and finding out absolutely horrific shit on the exploitation end:\n   * He had been catfishing as a trans man *and* a trans woman to lure in chasers for his sexual gratification, while also preying on vulnerable trans people by pretending to be one of them. He used posts in trans subreddits to bolster his case, scrubbed everything each time and started over so nobody would suspect anything. \n   * He had posted details of his \"close longtime friend's\" NSFW alt account on a dumpster fire subreddit against her consent (she didn't even want him to find it) for sexual clout. I wouldn't be surprised if he had shared/has been sharing the content non-consensually with others for clout as well. \n\nI'd done reactive maladaptive shit–yelled and fought back– in my second abusive relationship that I still struggle with a ton of shame around, and I was also severely gaslit both as a child by the supposed-parents and my exes–the fuckiest was being made to question my own intents and motives for malice for innocuous things like hanging out in the  kitchen and chatting. I'd try to defend myself and try to explain, but I'd get yelled at that I was 'subconsciously trying to manipulate and control, and just didn't know it'. I'm far from perfect, but if someone brings up that I'm being harmful, my initial response is to recognise it, hold myself accountable and try to make repairs and do better as much as possible. I still carry a ton of pain and sometimes self-doubt around my own intents from this. This recent guy also blamed me for how he felt 'swept up' into a thing with me. I felt awful and started questioning if I'd manipulated him somehow, if I'd lovebombed him without realising, if I was somehow a narc without realising it.  I profusely apologised and genuinely expressed regret that I wish I knew so I could have checked in more about pacing, left the conversation to look inwards and reflect on my actions but…hold on. I re-read some of the messages I'd been sending people close to me and I was barely interested in him for a good while at first.  \n\nThen I started reading up and watching videos on how covert narcissists lovebomb in subtler, different ways than overt narcissists do and I audibly gasped at how every single one of them checked out in terms of what he had been doing to me to rope me in:\n\n[https://m.youtube.com/@CommonEgo?itct=CJIBEOqeBBgCIhMIgbeX3Jaz-wIVDcRVCh1SSA\\_u](https://m.youtube.com/@CommonEgo?itct=CJIBEOqeBBgCIhMIgbeX3Jaz-wIVDcRVCh1SSA_u)\n\nHe fell into my life right after a devastating crisis I'd just had, so I understand how the boundaries I typically stick by these days became malleable. But I'm so annoyed, and still angry at myself for letting another narcissist into my life. I do not regret at all that I operated from a genuine place of deep care, nurture and a whole lot of heart for this person; I just know he didn't deserve even an ounce of any of it and I want to make sure I'm giving all of it to people who deserve it, and people who will return it (because I deserve it). This whole thing did help me realise how I need to be on the lookout for covert narcissists because they weaponise a lot of things I appreciate about myself and would never want to lose–I'm already doing intensive inner work to address and challenge some of these remaining patterns and the underlying internal narratives driving them. As harmful and dangerous as narcissists are, they're also…such pathetic losers, and I deeply pity them. I can't imagine a life lived and spent until death in the fucked up squalor of narcissism–without growth, without connection, without accountability, without ever being able to access the depths of life and the world, wreaking devastation and harm everywhere you go, with that black hole of a void where a selfhood and personality is supposed to be and needing to exploit use project and take take take to try and fill that void, always in vain. How utterly tragic. \n\nThings feel hard and it's hard not to feel shame around possible 'regression'. Any narcissist encounter–even ones like this case where the discard happened before it could escalate into a fullblown abusive relationship–always feel the same level of awful: like feeling bloated, exhausted and ill from endlessly sucking rancid farts out of the ass of an elephant with multiple peptic ulcers and a severely disturbed gut microbiome. But I'm already working on myself, and growing, and healing (I was extremely depressed during the whole thing and hadn't even realised it). It's been wild, being able to immediately jump back into a truer version of myself–making people laugh, having deep adult conversations, not feeling any pressure to stop talking about the things that matter to me and addressing systems of violence with the gravity they should be addressed with, being tested like a whole human being and appreciated and heard, having sex on my terms, dancing–you name it. \n\nThese fucked up, soulless narcissists might hurt me, but they will never have the power over me to take away my heart, my humanity, my commitment to growth and doing better, and the gallons of selfhood that I've cultivated for myself that my body can barely hold in on most days. \n\nSending love to you all, and sending nothing but a massive fuck-you to all narcissists, especially covert ones. They deserve nothing except for the consequences of their own actions, and the harm and destruction they cause.",
        "created_utc": 1668622380,
        "upvote_ratio": 1.0
    },
    {
        "title": "My Friend Is Still In Contact With Her Abuser's Family",
        "author": "Creative-Night-8166",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/ywuifu/my_friend_is_still_in_contact_with_her_abusers/",
        "text": "My friend recently left an emotionally/physically/financially abusive situation with her partner of 3 years (off and on). She moved to a new state so he didn't know where she was and she blocked his number. Lately, she's been in contact with her abuser's family. She goes to their family events even though there is the chance he might be there. They have a mutual friend who keeps relaying his messages to her. Yesterday he called her from an unknown number eight times in a row. She eventually returned the call. There was a death in his family now she's planning on going to the funeral even though she didn't have a particularly close relationship with the deceased family member. She says his family doesn't know what he is and they have never harmed her themselves. So she doesn't see why her relationship with them would be a problem.  She's even still in contact with his ex-wife.\n\nI know I haven't done a good job in reacting to this situation. I thought I could help her see she was putting herself in danger again. Now she no longer feels comfortable talking to me about him because I \"don't understand\". I love her and I want her to be safe and happy. I ultimately realize I have no control over her actions. But should I try to be more understanding and I guess trust that she knows what she's doing?",
        "created_utc": 1668608012,
        "upvote_ratio": 1.0
    },
    {
        "title": "Missing narc ex after 11 months No Contact",
        "author": "FunnyManufacturer357",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/ywlf5r/missing_narc_ex_after_11_months_no_contact/",
        "text": "I haven’t spoken to my narc since last December on my birthday, roughly 11 months ago. I blocked him on every social media platform since then and was doing really well the first 9 months but then in the past two months I’ve found myself missing him a lot. He’s been in a new relationship since I cut him off and I don’t find myself comparing myself to her or jealous of her. I’m not sure why but I haven’t been able to get him out of my head recently, wondering if maybe I was the problem. If he can make a relationship work with someone else for this long, what was wrong with me? Was I not patient enough, not nice enough, too emotional? I know that I shouldn’t let him determine my self worth, but it’s been very hard still missing someone who I don’t even speak to anymore.",
        "created_utc": 1668578285,
        "upvote_ratio": 1.0
    },
    {
        "title": "Sorry for being so pathetic and stupid",
        "author": "Sad_Ad_5326",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/ywgcls/sorry_for_being_so_pathetic_and_stupid/",
        "text": "But I am still wondering if my abusive ex would have been better towards me and not dumped me if I looked like his new girlfriend.\n\nShe looks like the exact opposite of me. That makes me even more insecure. It really feels like I should have looked like her and then everything would have been great.\n\nI’ve seen him on dating apps and some common friends told me that he’s cheating on his new girlfriend with several girls.\n\nI don’t know what all of this says about me. Is his new partner perfect for him? Her looks, personality, everything?\nIs she better than me because she was chosen?",
        "created_utc": 1668563681,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why am I having panic attacks over small stuff?",
        "author": "Sad_Ad_5326",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/ywbimo/why_am_i_having_panic_attacks_over_small_stuff/",
        "text": "I started developing insecurities and panic attacks after a two year long abusive relationship with a narc. I didn’t have those panic attacks before.\n\nI feel like I’m looking like a clown. When I apply make up or do my hair, I feel so pathetic, like I’m doing everything “wrong” (although it looks absolutely normal in the mirror) and that I’m too stupid to do my make up right Etc.\n\nMost days I’m having panic attacks because I think that people will laugh about me and my pathetic make up and hair and small breasts.\n\nWhy? I didn’t worry so much about these things before. I was more chill and easy going. What is going on with me?",
        "created_utc": 1668551059,
        "upvote_ratio": 1.0
    },
    {
        "title": "Afraid of lashing out if I enforce boundaries",
        "author": "runnerman2",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/yvt0wu/afraid_of_lashing_out_if_i_enforce_boundaries/",
        "text": "When I was a teen/kid, my parents bullied me for drama. When I had enough of this I became angry and said no, like I won't do some errand that they force me to do \n\nI can't explain extent of abuse. They perversed normal home errands, like cooking, washing clothes. Also those errands are sporadic, there are no schedule, like cook in the morning and do laundry in the evening. They could catch you mid gaming session or watching some series when it's most inappropriate for you, like when you are in the zone of chilling. \n\nWhen they throw temper tantrum with drama, like you did that and said that. And then if I refuse to participate then will say things like \"I can say no to you as well\" (like they are altruists). And will start cutting down on my needs, like saying no to cooking for me, washing my clothes, so they refuse to help with my needs, trying to show me the message that they can deny too. Later they supplemented this excuse with my age, like I can satisfy my needs myself, If I'm in my adult age, so they are not obligated to cook for me or give me allowance for needs like canteen in uni or bus.\n\n\nSo, my question is: What if I enact my boundaries and other person starts enacting boundaries two times stronger than mine? So more like trying to control me with manipulations presented as boundaries, sprinkled with guilt tripping, like it's my fault that I don't want to suffer\n\nI'll give hypothetic situation. What if some abusive pos person insults me for something small. For example I broke some software on abuser's PC and after that I offered to fix it.\n\nBut let's say abuser keeps guilt tripping me and insults me even if it's easily remediable. And let's say I'm sick with it and walk away and/or refuse to help after such treatment\n\nAnd then let's imagine such person will go to boss talking smack about you and then making interactions with you impossible, like stonewalling, blaming you for something which you couldn't do because this abuser doesn't cooperates with you\n\nSo, again, I'm afraid that if I'll enforce boundaries, my situation will be worse. Give me advice or opinion on this, please",
        "created_utc": 1668507419,
        "upvote_ratio": 1.0
    },
    {
        "title": "Narcissist or something else?",
        "author": "dirtyaught-six",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/yvme8t/narcissist_or_something_else/",
        "text": "Last year l met some new people who had a small friend group of 5-6 people. \n\nThings have been really good for the most part but I’ve noticed some red flags and a pattern with one person in the group. \n\nWe will call this person “A”\n\nA is in their early twenties and has a hard time keeping a job. In the year I have know them they have worked at 3 different places.\n\nThey seem to go through a cycle of;\n\n1. Everything &amp; Everyone is wonderful! \n2.Let’s make poor choices.\n3. Oh no! Consequences!!\n4.Quits job or gets fired. \n5.Stays with friend for a week/goes on vacation. \n6.Gets referred to a new job by mutual friend and restart at step 1. \n\nAt first I spent a few times listening to them vent about what was going on, and encouraging them, but I’ve noticed they don’t seem to ever really take a step forward, it’s the same process over and over.\n\nMore red flags have come out specifically we were all out a social gathering and I was talking to another one of our friends who was going through a hard time and A made a point to interrupt us talking several times to make comments about “Feeling dead inside.” &amp; “I’m downing in anxiety.” It felt very childish and I think they were upset that the focus wasn’t on them. \n\nThis behavior reminds me very much of my father. Self-centeredness and refusing to grow. Using pity as a way to garner attention and sympathy. \n\nLooking back on everything I’ve wrote I think I’ve answered my own question but I’d be curious if anyone else wanted to weigh in?",
        "created_utc": 1668485374,
        "upvote_ratio": 1.0
    },
    {
        "title": "nex's new recycled supply is also a narc. will they last forever?",
        "author": "abyssiniana",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/yvmdrr/nexs_new_recycled_supply_is_also_a_narc_will_they/",
        "text": " My nex of almost 3 years left me for his ex (with whom he cheated on me with in the past). It was blindsided and not to forget, he brutally discarded me through a one-line text. The new recycled supply is also a narcissist, I don't know which though. I'm just jealous of her and wonder if 2 narcissists can make it work for a long time?",
        "created_utc": 1668485337,
        "upvote_ratio": 1.0
    },
    {
        "title": "They’re ‘right’ because they FEEL right. We are horrible because they feel horrible.",
        "author": "Scared_Many_2301",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/yvl259/theyre_right_because_they_feel_right_we_are/",
        "text": "I realised something about my narc ex. She could obviously never admit fault, but I think it’s because they don’t understand the difference between feeling something and it being right. If they feel hurt by you, it MUST BE because you did something bad and are a bad person.\n\nWhen you ask them to actually explain the actions you took that were so bad they can’t really.\n\nI have a recording of my ex justifying why she broke up with me once a month every time we argued starting 4 months into a 3 year relationships; she kept saying “I do it because of YOUR BEHAVIOUR”, and i kept asking her to define what this behaviour was, what were the actions.\n\nShe would say it’s always the same behaviour and then list out the instances where we fought because of “my behaviour” (AKA me enforcing boundaries). I would keep asking what actions I took that were always the same, and then I’d describe our actual arguments and she would say I’m twisting things. So I’d ask her to tell me what happened and she would say she can’t remember…\n\nInteresting though, my whole existence was to serve her and air her happy 100% of the time. If I failed it was bad behaviour and deserved a breakup, because she felt horrible, ergo I was horrible.",
        "created_utc": 1668481533,
        "upvote_ratio": 1.0
    },
    {
        "title": "Just banned from another narc sub",
        "author": "HeyokaRising",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/yvh2a6/just_banned_from_another_narc_sub/",
        "text": "This is clear abuse and I would like you guys opinion of if the ban was called for - mind you I have been banned from EVERY SINGLE SUB here from house plant tips to Uber eats where I work to narcissism support groups - I was added to the terror watchlist after whistle blowing on a pedophile and have been targeted since 1993 blocking all communications and support and if I do get a comment made here I am immediately hit by trolls talking about my mental health issues …..the ban is always immediate and permanent SO I CAN NEVER COMMENT BACK - the comments will not be downvoted they will have actual human engagement and agreement in all cases AND YET I AM ALWAYS BANNED AND CUT OFF FROM ALL SUPPORT AND HUMAN INTERACTIONS- so please if I can get opinions of this latest ban here I would really appreciate it I need support and it is not available here on any sub so far ……",
        "created_utc": 1668470691,
        "upvote_ratio": 1.0
    },
    {
        "title": "What if I could go back in time? And not mess up?",
        "author": "Sad_Ad_5326",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/yvgbfn/what_if_i_could_go_back_in_time_and_not_mess_up/",
        "text": "There‘s still this stupid voice in my mind that says: “if I had been exactly the way my ex wanted, he would have still been with me”\n\nIn the beginning, my ex found me so gorgeous, intelligent and creative - in the end he called me ugly and shallow. So it feels like I disappointed him and like I messed up. It feels like he abused me for two years because I proved to him how inadequate and worthless I was.\n\nHe was obsessed with beauty. But I was at my worst when we met - when he lovebombed me. He abused me in the following two years. But he always maintained that image of being an innocent young man who’s just looking for love. \n\nMany people told me so far that they think I look like a model - but my narcissistic ex told me I wasn’t as desirable and attractive as I thought. I didn’t think that because I’ve always found myself unattractive.\n\nDo you think he would have not abused me and that he would have stayed longer with me if I had been exactly what he wanted? If I had done and been what he wanted ? He treated me with so much hate and contempt and sadism that I wouldn’t even treat my enemy like that..",
        "created_utc": 1668468741,
        "upvote_ratio": 1.0
    },
    {
        "title": "There‘s still this stupid voice in my mind that says: “if I had been exactly the way he wanted, he would have still been with me”",
        "author": "Sad_Ad_5326",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/yvfl85/theres_still_this_stupid_voice_in_my_mind_that/",
        "text": "I know it doesn’t work like that. But there’s still that voice in my mind that says: “if you had been exactly the way he wanted you to be and if you stayed that way, he would have been happy and stayed with you.”\n\nMy narcissistic ex has high standards. Or so he seems. I was at my worst when we met - when he lovebombed me. He abused me so badly afterwards - in the following two years. But he always maintained that image of being an innocent young man who’s just looking for love. \n\nI feel like I disappointed him badly. In the beginning, he said he found me so gorgeous and intelligent and creative - in the end he called me ugly and shallow. So it feels like I disappointed him. \n\nDo you think he would have been not abusive towards me and that he would have stayed longer with me if I had been exactly what he wanted? If I had done and been what he wanted ?",
        "created_utc": 1668466936,
        "upvote_ratio": 1.0
    },
    {
        "title": "Did he dump me because he realized that I wasn’t good enough for him?",
        "author": "Sad_Ad_5326",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/yva9pb/did_he_dump_me_because_he_realized_that_i_wasnt/",
        "text": "I’ve been afraid all my life that people would leave me when they saw that I wasn’t good enough. I idealized my abusive narcissistic ex a lot and although he abused me for two years straight, on many levels, I was still the defective one in my eyes.\n\nThe abuse escalated when I started setting boundaries and once, after I set boundaries and distanced myself from him (we were not in a relationship), he lured me back in only to discard me on his terms. \n\nHe asked me out only to discard me.\nAnd when he did, he said that he always knew that I wasn’t good enough for him.\n\nthis seems to validate my perception of myself and my deepest fear. That I’m not good enough: especially for him.\n\nIs it true what he said? Or was it said to hurt Me? \n\nMy abusive ex is very sadistic by the way.",
        "created_utc": 1668454959,
        "upvote_ratio": 1.0
    },
    {
        "title": "Never seek closure from a narc",
        "author": "Background_Crew_3914",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/yv2910/never_seek_closure_from_a_narc/",
        "text": "I wanna share this, knowing it looks bad. But it’s my story and I’m happy to finally get it off my chest. \n\nI was 19 when I met my first narc boyfriend. It was the standard: love bombing, grand gestures, fast paced love story. He moved into my apartment after only dating for a month. The next five years of loving him were hell: proving my love to him while he cheated, degraded, and emotionally (sometimes physically) abusing me. All the while making me feel like his love withholding was -my- fault. \n\nI never got over him completely when I met my second narc, my most recent ex. I thought it was different, because on the surface they seemed so different. But while his manipulation was more subtle, I realized after five years with this guy (I may have a 5-year pattern here!) that he was the same wolf in a different sheep’s clothing. \n\nI truly believe narcs have a sixth sense of when it is time to try and make their way back in. The first, after years of no/minimal contact, emailed me. It was simple, kind, no fluff. We chatted a bit, discussed our regrets, said how much we’ve grown. Eventually he invited me to a show. I saw this as an opportunity to discuss the unsealed wounds I held onto from being with him. There was so much I needed closure from that I felt I could ask now—I mean, we weren’t in love anymore right?\n\nLet me fast forward to this warning: please assume a narc will never change. \n\nI got involved in a whirlwind fling with him, all while trying to figure out how to effectively get out of it without getting hit by his wrath. Turns out, that’s impossible. No matter what you do, a narc will always respond as they know best—selfishly. \n\nI’m in a better position than before, so the experience didn’t leave me hurt sans my ego. I held my head high and left the situation and looked great while doing it. In the end, it answered a decade of questions I had for myself in just a month’s time. \n\nI say all of this to say, do not expect a narc to become better. They will always, always, come back and start the whole cycle over if you let them. You deserve more than putting yourself through the insanity that is trying to love a narc. \n\nI didnt have a specific goal with writing this, except possibly to publicly allow myself to be free. I hope you all receive the love you want for yourself today. Keep going.",
        "created_utc": 1668438756,
        "upvote_ratio": 1.0
    },
    {
        "title": "Was I Really never good enough for him?",
        "author": "Sad_Ad_5326",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/yut2ff/was_i_really_never_good_enough_for_him/",
        "text": "I have a long story with my abusive ex and the cycle of abuse repeated itself countless times. Whenever I left him or tried to left him, I was torn down, insulted, stalked and lured back into the relationship. He used different tactics each time.\n\nIn the end, when I had enough, I set boundaries and I guess I accidentally hurt his ego a lot. Then, he actually told me I should call him up if I felt like giving him another chance for a date and I did. When I did, he belittled me, compared me to other women and said that I have never been good enough for him. And that he knew that from the start.\n\n\nIs that true? Did he really mean that? If so, why did he lash out and say that I’ve never been good enough for him AFTER I became wiser and started setting boundaries? Why not before? Was that said to hurt me or because it’s true?",
        "created_utc": 1668415117,
        "upvote_ratio": 1.0
    },
    {
        "title": "Constantly giving and taking away validation",
        "author": "LaNaivite",
        "url": "/r/abusiverelationships/comments/yug7ew/constantly_giving_and_taking_away_validation/",
        "text": "",
        "created_utc": 1668377659,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why does my mind live in a constant state of replaying my worst moments?",
        "author": "Jemarqus_07",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/yuf2ah/why_does_my_mind_live_in_a_constant_state_of/",
        "text": "Why is it like this and have any of you found out how to make it stop? It's like I have 2 channels. If one channel is what I'm doing in real life, there's always this other channel at the same time in my mind that loops all my worst memories and experiences.",
        "created_utc": 1668375218,
        "upvote_ratio": 1.0
    },
    {
        "title": "Sexuality after the narc",
        "author": "throwaway_2234566",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/yu72ix/sexuality_after_the_narc/",
        "text": "I struggle with it to be honest. I am celibate for a couple of years as I'm not into hookups at all and was single for this period. He was the first I opened up to again and I felt so sexy and desired by him, even though we didn't even proceed past kissing and some touching. I remember I was glowing, like others were complimenting me. \n\nNow, I feel below desirable, I feel dim, just without any energy. My smile is gone most of the time, though it's coming back a bit. I see other people being sexual, but I feel like I'm outside of it somehow. I see other younger beautiful women everywhere, and compare myself to them like he used to. I feel like I'm just one of many, doesn't matter who to have sex with anyway, women are interchangeable and disposable to him, and it's a terrible feeling. I really don't hope this second narc experience didn't do any serious damage, I don't want sexuality to be linked to these thoughts. \n\nI know it's a sensitive topic but I think it's an important one, and am curious about if anybody feels similar.",
        "created_utc": 1668358175,
        "upvote_ratio": 1.0
    },
    {
        "title": "Covert",
        "author": "FeedbackEuphoric",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/ytvie1/covert/",
        "text": "If you've experienced a narcissist - think never again and you meet a covert and doubting yourself. Please tell me not to again and experiences you have had?",
        "created_utc": 1668327171,
        "upvote_ratio": 1.0
    },
    {
        "title": "I think my narcissistic mom and relationship with a psychopathic led to my own toxic behaviour. Please help.",
        "author": "muffincat1987",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/ytugnz/i_think_my_narcissistic_mom_and_relationship_with/",
        "text": "I was around the behaviour so long that I frequently find myself doing things I hate. I don’t want to blame my mom for my current behaviour but when I was growing up I was never allowed to have any space. She’s definitely a narcissist but maybe more on that later. \n\nWhen I was 19 I ended up in an extremely psychologically abusive relationship with a psychopath that became physically violent at times. I had a child with this man. And I left him after two years after a friend told me she was calling child services or I was leaving. I’m very grateful to her. \n\nLater when I was in my late 20’s I married a man for 5 years and this relationship was also filled with turmoil and he was not very accountable for his behaviour either. I also had another child with this man. He has since seemed to have changed and become accountable for his behaviour and my current partner and I have a friendship with him. In arguments with my recent ex, I frequently responded to his manipulation with my abandonment issues from my mom and my ex from when I was younger. I could not leave him alone when he wanted to be left alone and I followed him around and did toxic things I am ashamed of. He frequently stonewalled conversations and I wanted to force him to talk and work it out with me but that was wrong as well, despite his behaviour. I became genuinely scared I was going to commit suicide and I told him so but sometimes I felt like I was threatening him with it even though I was afraid. We were unkind to each other and I think we were both manipulative but I had trouble seeing my behaviour because my mom was so abusive and my first ex I mentioned was genuinely insane. So when my second child’s father did anything remotely narcissistic I painted him life them. I see now that he has issues from his own childhood and is not a genuine narcissist but a person with problems.\n\nFast forward to today and my current partner and I had a fight. I followed him and took a door off the hinges because he locked it. I know this is unacceptable behaviour. I was triggered because things have been great but he threatened to hit me with a pillow because I was being an asshole. Then I got scared and crazy. I came downstairs and didn’t want the neighbours to see me crying so I had to go to the basement to get to the garage to smoke. When I took the door off some of  the hinges he came running up the stairs yelling (understandably) he then opened it and realized the noise was me using a knife to pop the hinges off. He screamed and grabbed me and pushed me and then grabbed by face and yelled in it. Then I hit him once and he pushed me again and left the house. The neighbours called the police. It was awful.\n\nI am afraid that I am permanently broken from being raised by a mother that never let me have space. She followed me around constantly and tried to make me angry so she could claim victim. I know I should leave people alone but I struggle and am afraid, I don’t want to be like her. I don’t know how much in the wrong is my current partner and how much it’s me. I don’t know if I should leave or if I should just simply learn to leave him alone and everything will be okay. I’m scared because he keeps telling me pushing me was justified. \n\nI have had extensive counselling but don’t know how much I’ve benefited from it because going deep is hard. I just need some help with my own toxicity and advice on how much accountability is appropriate. I know I need to leave people alone.",
        "created_utc": 1668323176,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can't stop thinking about the \"good memories\" please help",
        "author": "TraditionUnable9770",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/ytuge0/cant_stop_thinking_about_the_good_memories_please/",
        "text": "I keep on replaying and thinking of the good memories, they were to intense i know it wasn't real love and all that but i jjust cant stop thinking about it and how i felt over and over again its drivign me nuts and i feel super deprssed how can i stop?",
        "created_utc": 1668323146,
        "upvote_ratio": 1.0
    },
    {
        "title": "Holidays are hard [support]",
        "author": "888frog",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/yto6ku/holidays_are_hard_support/",
        "text": "I have not seen surviving nparent in 4 years. It's the seasonal \"you gonna see your folks\" comments for the holidays I get from work people or others who I have not told (since it's a downer tbh). I just remind myself it is just small talk even if it feels big to me because of the lack of a relationship given the no contact. I feel sad, but it's better then feeling trapped, small, and scared all the time. I would not have the life I have now if I stayed. My marriage would fall apart. All we can do is pick our problems (if we are lucky). I wish everyone peace during this sometimes lonely time.  I do have a chosen family yes, but that ain't on Hallmark lol.",
        "created_utc": 1668302690,
        "upvote_ratio": 1.0
    },
    {
        "title": "Spiraling because I realize that I wasn’t good enough for him",
        "author": "LaNaivite",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/ytmun6/spiraling_because_i_realize_that_i_wasnt_good/",
        "text": "He chose so many new supplies after I set boundaries. After I didn’t let him use me as supply any longer. But it still hurts that I meant nothing for him, that I was worthless the moment I stopped being a source of supply.\n\nBut still, I’m still broken, although I was the one who went no contact after he told me that I was not worth his time any longer. Before I met my ex, I already had this nagging feeling that I wasn’t good enough &amp; that everyone was better than me.\n\nAnd he ultimately proved this theory! He called me unattractive in the end and I knew deep down that I was unattractive. Other people tell me that they thought I was a model and I don’t understand it. \n\nI just wish I could get his validation back. I’m wondering if he is happy with his new supply although he keeps finding a new supply every 2 weeks. \n\nI really wonder if it’s got something to do with my looks, my personality or anything like that. I just know that I always have him the benefit of the doubt, was nurturing and caring and sweet towards him. \n\nWhat do these new girls have that I lack? I wish I could have that as well :(",
        "created_utc": 1668298842,
        "upvote_ratio": 1.0
    },
    {
        "title": "He hoovered me until he realized that I wouldn’t let him use me",
        "author": "LaNaivite",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/ytikxe/he_hoovered_me_until_he_realized_that_i_wouldnt/",
        "text": "\nAnd when he realized that, he told me that he had moved on to a new superior level that I couldn’t measure up to, that he was chasing so much better girls than me after I rejected him (he means when I didn’t fall for his hoover attempt). I told him that I was tired of his bullshit and that I saw through him. Afterwards I ghosted him.\n\nLater, when I maintained no contact, I saw on Instagram (I KNOW I SHOULDNT HAVE!) that he’s taken previous ex girlfriends and fwb’s off the shelf, recycled them and is love bombing all of them at different times on social media.\n\nDoes that mean that these old supplies that he has now recycled are worth more than me? Are they better? Or am I the bad one because I called him out, hurt his ego and ghosted him?",
        "created_utc": 1668287729,
        "upvote_ratio": 1.0
    },
    {
        "title": "Did anyone else run away from Nparents and was homeless? I did.",
        "author": "TrainingHeron",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/ytielu/did_anyone_else_run_away_from_nparents_and_was/",
        "text": "Was homeless for 2 months and have been poverty stricken since. Homelessness was rough, was mugged twice, but no matter how bad homelessness was, it beat living with my Nparents. \n\nEx I was only mugged twice, whereas my parents did a lot more damage with emotional abuse, also parents were more physically violent than my attackers. Like with one of the attackers, they held me up with a knife but pissed off once i gave them my wallet, whereas I could never bribe my Nparents into leaving me alone.\n\nI'm not sure if i'll ever be not poverty stricken",
        "created_utc": 1668287288,
        "upvote_ratio": 1.0
    },
    {
        "title": "When did you realize the person you had a relationship was a narcissist?",
        "author": "Turbulent-Treat-8512",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/ytdv70/when_did_you_realize_the_person_you_had_a/",
        "text": "",
        "created_utc": 1668275577,
        "upvote_ratio": 1.0
    },
    {
        "title": "i might have made a new friend today!",
        "author": "Chewwwster",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/ytcz9m/i_might_have_made_a_new_friend_today/",
        "text": "I met this girl who could be a friend. It felt so good. For years i was told i was antisocial by my nex. That i needed him, i took no initiative, i was too demanding. No fun to be around. \n\nWell, i am talking to a few promising new people, i have found love again. \n\nHis words were so mean, false. And above all, not true! \n\nI feel good. Today is a good day!",
        "created_utc": 1668273395,
        "upvote_ratio": 1.0
    },
    {
        "title": "Just feeling sad again today",
        "author": "throwaway_2234566",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/ytcuqx/just_feeling_sad_again_today/",
        "text": "I'm having my period and I know I'm always more emotional then, maybe it's that. But I just feel terribly sad and the loneliness is crushing me today. Went and did some shopping for myself, bought some nice clothes and things for my home, went to the gym as well but nothing could chase it. The songs at the gym were all about missing someone and hearbreak, it made me tired and made me want to run away and go cry. I hardly could finish my workout but I did.\n\nIt was so nice and sunny out, I saw people holding hands and I just remember how it all felt so natural with him at first. These small gestures like carrying my coat in his bag. I felt so seen and loved, and now nobody sees me, it's just me back to my old lonely life again. No matter how fulfilled I am with other things, and I do love my life... it's there like a dark cloud today. Going out to a party, I don't want to, I want to curl up next to him and just do nothing.",
        "created_utc": 1668273104,
        "upvote_ratio": 1.0
    },
    {
        "title": "Been living with my uncle and aunt for 2 days",
        "author": "AMaidenofIron",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/ytaev8/been_living_with_my_uncle_and_aunt_for_2_days/",
        "text": "I escaped from my NMom two days ago while she was at work. In that time, she has called anyone and everyone she can get her hands on. I wiped my iphone clean and turned it off, so she hasn't been able to contact me. But she is trying to - and begging my uncle to let me talk to her. He has yelled at her loudly and repeatedly that I don't want to, but she won't respect my boundaries. She even showed up twice and had a domestic incident report filed against her yesterday morning (by me) because she wouldn't leave yesterday morning. \n\nAs I'm typing this, she called my uncle again for the second time this morning and my cousin. I can't wait to be a whole border away from her.",
        "created_utc": 1668267665,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to not let an online bully/possible narcissist get to me? Feeling a bit triggered and so sad because of it",
        "author": "throwawayxlost",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/yssvry/how_to_not_let_an_online_bullypossible_narcissist/",
        "text": "I feel so disturbed he used all my insecurities and trauma against me .met one of the most disgusting people on the internet. im a 27 year old woman and this man in his 40s tried to befriend me online. He was a bit too friendly,.He was too friendly and touchy feeling at first with me saying \"like getting hugs from you, i know they are warm i can feel them from here in this cold, i only need your warm hugs, wtf.’’ ‘’My sweet and special girl’’. ‘’I love you friend’’ , i will wipe your tears away and pinch your cheeks in real life, ‘“you are cute”, “such a sweet girl like you shouldn’t be cursing’’,, ''do you still have bruises? if you were here, id pull you close and massage them!!!\" ’you are very special , i treasure you, you are my blessing’’. just cause i told him happy birthday\n\nMy mom got sick with covid and i was very worried about her and im in school, i let this person know. he offered to hug me and hold my hand i told him, i dont feel comfortable with holding hands. he still sent me a picture of his hand anyway and then 5 days after, i didnt respond because i was sick with covid, he got offended and wrote :\n\n\"I guess this is it. 2 to 3 days within my last short.message checking on you, I have not gotten any response. On top of that, 5 days since I wrote the message with the photo. I'd go straight to the point. Part of me feels more worried that something might have happened to you, but a big part of it also felt I'm ignored. I know and understand you may be busy between taking care of mom and school or finding a job, but it's not thar hard to say/write a thought or a simple response to make a friend feel at ease. Also your silence most likely means you have issues with me sending that picture. I am sorry. To be honest, I have the purest of intentions. I don't need to explain myself over and over. I initially thought you'd be happy, or at least feel comfort reading thar message. How would you feel if you send someone a photo and youbget no response? I know it's not as important as sending the photo of someone's face. But still, it's personal for me. This is honestly the first time after 2 months I felt something wrong about this friemdship. I don't want to be attached to this any longer. It's sounding like my online friendship recently and the others in the past. I should just probably be thankful this did not drag on for long. Less time to be attached, less hurt. I guess I value friendship or any.kind of relationship differently than most people. I male them feel uncomfortable.Thank you Best wishes for you and mom, and take care. \"\n\nI told him i didnt feel comfortable with holding his hand and not sure why he sent the picture of his hand to me and that i was sick with covid, forget about that he didnt care about that, he cared more that i was ignoring him than my mother or me being sick.\n\nHe got very very very nasty with me and thought i insulted him when i told him i was not comfortable with holding his hand and why he sent a picture he sent me statements such as ''No wonder people do not like you, you are weird', ''dont flatter yourself why i would like you, keep dreaming. i had many relationships and you never had one, maybe because guys dont like you psychically, even your friend wanted to change how you looked and was indecisiveness about your looks lol he brought up my crushes and how they never took a second look at me or even talked to me and how they were just nice to me because it was their jobs'' it seems he took pleasure in trying to humiliate me in the sensitive things I opened up to him about\n\nI told him about my grief about an online friend who died from alcoholism in the past and he was messed up to actually bring it up and write \"\"Please just shut up whenever you say, \"I could relate about grief\". Or anything of that kind. You will never understand that because you have never really been in that situation and perhaps, will never be. Losing a partner that you've been living with for long years, and you compared to an online guy friend? With all due respect to him, it's not the same feeling. Not even close. Also with the way you lashed out at me and treated me after, do you think I'd still believe that you felt sad when he left? That's funny.\"\n\nhis last statement to me was \" 'you are 27 and never had a true friend or a proper relationship ' lol. dont worry this is the last time you will hear from me, i just wont let your personal insults slide good luck finding someone who will accept you\n\nHe also told me how his ex gf was beautiful and that, comparing you to her would be an insult to her, i can show you a picture of her'' he has never ever seen a picture of me ever and randomly bring this up to boost up his ego. he triggered me so much. His ex gf hated him by the way and made sure to separate her daughter from him when she died to live with her family. His daughter does not like him either and he\n\ni never had anyone say so much abuse in a span of paragraph. it triggered me and made me suicidal and confirming my thoughts of all my abusers in the past maybe im really ugly and thats why no one likes me and i will never have a relationship like he said because im too ugly and weird as he put it and he keeps denying that he is talking about me and how the world does not revolve around me and tells me how i never talked about the good people in my life, and basically said im a loser that no one likes with no friends or BF and how i kept venting and venting, even though he reached out to me to talk and he vented so much about his ex gf who died in a very bad way,to me, his daughter, his other friend who broke it off with him because he was creeping her out as well and said disgusting things to her as well, and she is younger than me\n\nI still feel so hurt and shocked over what he told me and it triggered lot of bad feelings within myself. I reported him to the mods on the forum but they just gave him a warning and didnt ban him so he is still on there, so i dont go on there as much anymore but still feeling angry and shaken up over it. i warned a lot of people especially on women on the forum about that narcissist predator it seems he has a new victim now saying the same things to her. i also found out he had a relationship with a 14 year old girl when he was 35 how disgusting.\n\nexcuse the length, i didnt realize it ended up this long",
        "created_utc": 1668215931,
        "upvote_ratio": 1.0
    },
    {
        "title": "11:11 Mental Anchors, Monopolization of Time, and Manipulation of the \"LOVE\" Fantasy. The use of Superstition and Mental Anchors for INTENTIONAL Manipulation",
        "author": "kintsugiwarrior",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/ysrlnq/1111_mental_anchors_monopolization_of_time_and/",
        "text": "This may sound both, old and new to many.   Today is November 11, or (11/11).   Many people believe in numerology, and have the belief that these numbers represent \"your guardian angels sending you a message that is connected to your destiny\", and that things are supposed to be positive for you; or that you can make a wish at 11:11 AM, or 11:11 PM.\n\nWell, I didn't have social media for a while, and it turns out that this was a thing even before I married my ex-narc (around 2015), and I pathetically have to admit that I fell for this manipulative tactic.  Here are some guys explaining how it works:\n\n\"**Text her at 11:11 to make her think it's a sign from the universe**\"\n\n*Examples*:\n\n|[VIDEO 1](https://www.tiktok.com/@brando/video/6993057614284279046?is_from_webapp=v1&amp;item_id=6993057614284279046)|[VIDEO 2](https://www.tiktok.com/@howieazy/video/7078834238589701422?is_from_webapp=v1&amp;item_id=7078834238589701422)|[VIDEO 3](https://www.tiktok.com/@mdfaiz11_/video/7004120353693895941?is_from_webapp=v1&amp;item_id=7004120353693895941)|\n|:-|:-|:-|\n|[VIDEO 4](https://www.tiktok.com/@taysmcr/video/7103632509874818310?is_from_webapp=v1&amp;item_id=7103632509874818310)|[VIDEO 5](https://www.tiktok.com/@tinyoddguy/video/7090148730804030766?is_from_webapp=v1&amp;item_id=7090148730804030766)|[VIDEO 6](https://www.tiktok.com/@.its.justbrian/video/6969537266884562182?is_from_webapp=v1&amp;item_id=6969537266884562182)|\n\nBy now it is well known, that it'd be hard if you haven't heard of this tactic.   Well, this was the downside of not having social media at the time.\n\nAnyway, so once the technique worked on me, and my ex-husband declared his love for me too fast... he gradually \"trained\" me to receive this text message (\"I love you - heart\") in the morning (AM) and at night (PM) at 11:11.  Within time, this turned into our thing (or part of the cult), and he used it to control me and monopolize my time and my mind.\n\nMany people continue to believe in love, in finding the one, in marrying for life... and this belief is exploited during the \"Love Bombing\" stage.  I honestly feel a little ashamed sharing this, but I wanted to put this out there, as **not only narcissists use it**\\--  pretty much anyone (especially in PUA communities).  And the repetition of these patterns at a specific time creates a \"**Mental Anchor**\" which is hard to break, even after escaping.  I've looked into different mind programming techniques to re-wire the brain, but it might just be a matter of time, as the mental control pretty much crumbled once I did some therapy to dissolve the cognitive dissonance.  I'd like to read your comments :')",
        "created_utc": 1668212186,
        "upvote_ratio": 1.0
    },
    {
        "title": "Strange realizations after the discard - Did they have any real close friends? and what was their characfter?",
        "author": "TraditionUnable9770",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/yso4v7/strange_realizations_after_the_discard_did_they/",
        "text": "Two strange things I have realised post discard\n\n1 - I have realised now, that despite how social they were and how many friends they were.. they actually had no real close friends. Their 'best friend' lived in another country and their two other 'close friends' they'd see once a year. They also were not close to their family at all. Anyone else's nex like this? They actually had no real close friends. But they had lots of acquaintances. \n\n&amp;#x200B;\n\n2- When I think of their character I have also realised some things which has helped me move one. I realised that \n\na) They are not kind \n\nb) They are not honest\n\nc) They are not compassionate \n\nd) They have no empathy\n\ne) They do not have integrity\n\nf) They are not responsible \n\nI could go on and on, long story short, is it normal for them to virtually have no morals, ethics and virtues? Like none?",
        "created_utc": 1668203135,
        "upvote_ratio": 1.0
    },
    {
        "title": "Feel like a joke",
        "author": "grasshopper099",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/ysjpxe/feel_like_a_joke/",
        "text": "It's been 2 months since the final discard and I've been nc so far. today i went to a concert with friends and met new people who had also recently gone through breakups. They asked the name of my nex and upon hearing the name they both went silent for a while and then said that he's known as the whore of the city and is known for lying, twisting stories, and fucking people over.   I feel like a joke, everyone knew all of this and I didnt. I was so blind, I just feel so played and used",
        "created_utc": 1668193527,
        "upvote_ratio": 1.0
    },
    {
        "title": "Discard",
        "author": "Jaded-Tiger3101",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/ysj1v9/discard/",
        "text": "The last time we saw each other he asked me to move in. He gave me a ring and told me I was his special person. He is autistic. After everything that I helped him with when he had no job, I paid for food, I drove immediately after work, despite being exhausted and helping a disabled parent. I still made time for him. “I met someone.” Just out of the blue he sent that. Then 2 months later he gave me an apology. For awhile I considered accepting it. I answered “if you have guilt that is not my problem.” I was nothing but nice and I felt so used. I know now it wasn’t my fault but I can’t help but feel that I cared so much for a farce. I think his apology came because either it didn’t work out or guilt set in. For 2 months I thought I was at fault. I thought I had done something wrong for him to leave me. I was the one doing all the efforts and I was treated that way. He said I was on the low end of the scale and so was he. He has autism so he assumes everything is on a scale I guess. For awhile I felt like I wasn’t pretty enough, or smart enough. He said I was unfit. I didn’t grow up with rich parents like he did. I wasn’t a gold digger, hell I paid for most of the dates! I have empathy I considered saying I forgive him. But then I recall how bad he made me feel, how insulted I felt, how rude he was. “I worked and made time to see you after making sure my dad was ok.” “Yeah and?” “I don’t see this going anywhere.  I met someone else.” “You were on the low end of the scale and so was I.” “I wasn’t feeling 100%. I was for real. I didn’t lead you on.”  2 months of no contact - “I manipulated you, I didn’t mean to but that happened. Sorry I hurt your feelings, forgive me.” I was nothing but kind. I brought food and gifts. I never argued I’m a peaceful person. I thought I was the problem. He said maybe I was autistic. I told him that I was exhausted after work, that’s why I didn’t talk much. I used all my energy at work and immediately drove over. He had time to at least brush his teeth but he couldn’t even do that. After I told him wtf what happened I remember he said “clearly I upset you.” I don’t get whether that was autism or narcissism but either way he has no emotional quotient. Sometimes I just want to know why did he waste my time? Why hurt me? I was never mean or argumentative. I know I’m not at fault. I think he cheated or the guilt got to him.",
        "created_utc": 1668192132,
        "upvote_ratio": 1.0
    },
    {
        "title": "More confirmation",
        "author": "Least_Call_160",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/ysffhh/more_confirmation/",
        "text": "It's been a month since I met my nex in my therapist's office for some final thoughts. She came to validate her discard of me. But, having dealt with two previous narcissists, I confronted her on every lie. Which, of course, she *hated*. She didn't get her validation, I exposed her instead. She was absolutely furious by the end of the session, but being covert, all that anger was bubbling right below the surface. I realize that everyone says \"no contact\", but I had an issue to finalize with her and contacted her by phone last night. I admit, I was testing the waters too, but I feel strong enough. I had no idea if she'd answer or not, and the first call just rang and rang, and the second did the same, finally going to some partial vm message, so I assumed I was blocked. I left a short vm and just decided to email her. Then she calls back. I answer and she says, \"Are you OK, what's wrong?\". I replied \"What?\", and she repeated it. I said no, I'm fine, and brought up the subject matter (kinda grey rocked it, not much emotion). She then said, \"Your voice sounds good, so you must have recovered well.\" When she discarded me, I was out of town and experiencing heart issues, which she has *never* asked me how I was doing. I had one surgical procedure, and had to be taken by ambulance back to the hospital two days later due to complications. Its been 2.5 months and she *still*  has never asked me anything about what happened . I realized then she must be with someone else or a group, and was putting on a big act of empathy / compassion for a show for them. 🙄 I didn't want to give her any satisfaction or reaction, so I simply replied, \"I don't know yet\". She then said she needed to go, and I said goodbye and hung up. It was classic narcissism. Putting on a show for others about how nice, kind, and compassionate she is, when I know damn well from her (lack of) action that she doesn't care one way or the other. Just further confirmation of her narcissism. But it still amazes me these creatures (I can't call them human) are so cold and heartless. It's like her evil twin moved from out of state to live with me (that lasted a week), because I don't recognize this creature at all. So I tested the water, and it was ice cold. Doesn't really depress me any further. Just wonder on my behalf of how cold and self-centered these creatures are.",
        "created_utc": 1668184317,
        "upvote_ratio": 1.0
    },
    {
        "title": "Indifference",
        "author": "Jaded-Tiger3101",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/yrzfwi/indifference/",
        "text": "Just when I was feeling better I received a bs apology. I remember all the days I was sad but my body never produced a tear. I felt so used. I told him how could he use me like that when I made all my efforts to see him. I worked, helped a sick parent, and still prioritized him. He said “yeah and?” When he had no job I paid for dates and drove. I have anxiety driving. He used me and it hurt so much. These days I’m over it but it isn’t fair how he just used me and probably cheated as he left me for someone else. I personally think it didn’t work out and that’s why he apologized. “I apologized because that’s what adults do.” I laughed. That’s the most childish thing I read. I realized I was traumatized. How could I be so dumb? All I did was be nice! Not a single argument from me. I’m laid back. For awhile, I wanted karma. Then I just stopped caring that’s when I got the “apology”. I let so used after the discard.",
        "created_utc": 1668135560,
        "upvote_ratio": 1.0
    },
    {
        "title": "I feel like no one is ever going to love me because I have so many problems",
        "author": "softscalp",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/yrxbpd/i_feel_like_no_one_is_ever_going_to_love_me/",
        "text": "I feel like a “thing” that people don’t even want to touch with a 10 foot pole. I do believe that I’m lovable. But people want easy and my life has been anything but easy. I have so many problems because of trauma.  No one wants to get involved because it’s not their responsibility and everyone has their own issues to deal with or because it would just be too depressing for them. It’s similar to how when I was being abused as a child no one tried saving me. I try working on my problems but they’ll never be able to be truly fixed until I have a support system, which is something I’ve never had. It all feels like an impossible situation.",
        "created_utc": 1668129140,
        "upvote_ratio": 1.0
    },
    {
        "title": "This time I want to let him go for good.",
        "author": "custardprincess",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/yrr9dy/this_time_i_want_to_let_him_go_for_good/",
        "text": "The constant threats to leave. The actual packing of bags and leaving every time we have even a minor disagreement. The entitled, arrogant, dismissive attitude. The leeching behavior. The abusive language. The indifference. The utter lack of empathy. \n\nHe (25 M) packed his bags for the umpteenth time and left my (27 F) ‘s house, saying I’m the one who keeps calling him back even after he treats me poorly. In a pretty mocking tone. \n\n\nThis time I didn’t stop him. The last two times he left, it was me who kept calling him back, out of pure lust and loneliness. But this time when he was back, I actively tried to practice detachment from him so that when he inevitably leaves again due to some argument or disagreement, I have the necessary headspace to let him go for good. \n\n\nMy question - is this constant threat and action of leaving me during an argument a form of abuse?",
        "created_utc": 1668112939,
        "upvote_ratio": 1.0
    },
    {
        "title": "Struggling with an acceptance",
        "author": "Angellama76",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/yrmni1/struggling_with_an_acceptance/",
        "text": "So I left a narcissistic marriage 8 months ago. He wasn’t my first abusive relationship, he was my 4th. He was however the most violent and rage filled of them all. I had been single 7 years when we got together. \n\nWe were only together 3.5 years, but it seemed like a lifetime. My childhood as very  abusive, sexual, emotional, verbal and physical abuse. \n\nI thought I had handled this. I had been going to therapy for several years about 10 years ago after the last abusive fellow. Issues with my mom arose in therapy. While she didn’t sexually abuse me, she would fly into crazy drunken rages and terrify us. She was the most terrifying person I knew. She was more terrifying than my dad who sexually abused us. \n\nSo now, after this relationship she says to me “I just don’t know why you choose these men?” It fucking makes my blood boil…she has never acknowledged the shit she’s did and said. She always says I’m making it up, or my favorite..”it wasn’t that bad”. \n\nI finally freaked out and point blank told her that “you abused me, you and dad abused us, and that you may  not remember, but it is the truth”. \n\nShe of course flew into a rage about how I want people to feel sorry for me and that I need to just forget. \n\nI have cut her off for now. Blocked her etc. \n\nI don’t know what I’m looking for here. I just want all this toxic shit out of my life. I can’t do this shit with anyone anymore. I’m not a doormat, I’m not a liar, I’m not crazy, and I sure ain’t looking for pity….\n\nI feel I did the right thing, it felt good to tell her that. \n\nAnyway. So yeah. It’s been a helluva year. But I have grown…..so I’m good…\n\nWith that I pass",
        "created_utc": 1668102858,
        "upvote_ratio": 1.0
    },
    {
        "title": "Being validated",
        "author": "grasshopper099",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/yraq2e/being_validated/",
        "text": "While talking to my therapist last night I mentioned how my last relationship traumatized me and I did research and it fell on the pattern of lovebombing- devalue - discard. Upon which he said that it's interesting that I mentioned it because he noticed elements of narcissistic abuse during my first session with him after the breakup. He said that narcissism is at an all time high these days.\n\nHe said that since my ex isn't his client or anything so he wont be diagnosing him but it's important that I recognize the abuse and show grace to myself. He identified so many instances of gaslighting in my last relationship. I feel relieved that I wasn't\nmaking this in my head and validated. \n\nSo whoever went through narcissistic abuse but is just not sure about it 100%, you don't need to be because it is a spectrum. And identifying that you were abused is in your realm of assessment so if it feels like abuse it is abuse. (if it walks like a duck and talk like a duck, it is a duck). Be kind and patient with yourself",
        "created_utc": 1668074849,
        "upvote_ratio": 1.0
    },
    {
        "title": "Anatomy of a scandal",
        "author": "grasshopper099",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/yrameb/anatomy_of_a_scandal/",
        "text": "I watched this show recently on netflix and I think it really encompasses narcissistic abuse and how they employ gaslighting and manipulation to confuse their victims. \nI related to the show on so many levels and it gave a very eye-opening perspective",
        "created_utc": 1668074447,
        "upvote_ratio": 1.0
    },
    {
        "title": "I miss my ex-bestfriend.",
        "author": "alienboy222",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/yr5oy6/i_miss_my_exbestfriend/",
        "text": "We were friends for 20 years, saw each other through everything. We grew up together, saw each other through graduation, through my transition, through breakups. We have so many laughs and memories. 20 freaking years worth.\n\nI know if I apologized it would all go away. But what do I have to apologize for? \n\nShe’s the one who got mad when I didn’t have gas money to come see her and had to work anyways. She’s the one who was calling my work every time her and her bf broke up. She’s the one who texted me paragraphs about every little thing I did wrong, and when confronted later said she didn’t remember &amp; she would never do that. She’s the one who told me I have never done a single thing for her in our entire friendship. She was the one gas-lighting me for years. She’s the one who ghosted me for 6 months &amp; then reaches out to apologize hours after her boyfriend broke up with her.\n\nYet, 20 years of memories. How do you forget that? How do you move on?",
        "created_utc": 1668055947,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do you build emotional resilience?",
        "author": "Jemarqus_07",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/yqxms5/how_do_you_build_emotional_resilience/",
        "text": "Hey. I'm posting this here because I'm not sure where to put it, and I am an adult child of a narcissistic father. \n\nHow do you personally, or how does one, build emotional resilience - toughness, grit, ability to manage what life throws at you, ability to be in control of your feelings. Things like that.\n\nI've done alot of things, not with this purpose in mind, but things I would think would bring me a stronger sense of this. I went no contact, and willfully left my parents along with their upper middle lifestyle, to live on my own and support myself and make my own way. I filled my free time with difficult hobbies. For example, mixed martial arts, and open mic stand up comedy. I've had relationships, and chose to end them when I wasnt happy with them and accepted aloneness. I've had difficult jobs, and have pushed myself to move on to better one's.\n\nI know none of these things are golden tickets for something like this, but I guess what I'm saying is none of my life experiences brought me any lasting significant level of mental or emotional security.\n\nAs a disclaimer, I imagine some would say to seek therapy. I've been in therapy with multiple kinds of therapists. This isn't the type of conversation road I'm trying to go down right now. I'm also not trying to evoke the idea of \"manning up.\"\n\nSo what's brought you a greater sense of a \"emotional resilience\"? Or how do you think a person build such a thing?",
        "created_utc": 1668033007,
        "upvote_ratio": 1.0
    },
    {
        "title": "Feeling Like I Was In Trouble",
        "author": "St_Virgo",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/yqufr5/feeling_like_i_was_in_trouble/",
        "text": "Feeling like I was in trouble was a constant in the relationship. I was constantly trying to make up for perceived mistakes I was unaware I had made or was about to make. The reactive abusive only amplified this feeling. This was the feeling of shame put on me by the narc and I still carry it around with me. Alone in my apartment, when I walk into work, driving in my car, I feel like I'm in trouble. It's the shame. It's not my shame, it's theirs.",
        "created_utc": 1668025346,
        "upvote_ratio": 1.0
    },
    {
        "title": "Lies",
        "author": "Jaded-Tiger3101",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/yqt2ng/lies/",
        "text": "Him: I never met your friends or family. \nMe: You cancelled twice when I invited 10 people. \nHim: Move in with me. \nHim: I don’t see it going anywhere. \nHim:You wouldn’t talk. \nMe: You gave me a ring, I met your mom, and we spoke for an hour in front of you while you were on your phone the entire time. \nHim: You aren’t fit enough. (For context I’m a size 6.)\nMe: I didn’t say it - but he has a belly. \nHim: None of that ever happened. \nMe: we discussed moving in and having a serious relationship.\nHim: I met someone else, sex is great but I want more. \nMe: WTF?\nHim: I didn’t lead you on, I was for real. \nHim: (2 months later no contact) It was wrong of me to lead you on.  Please forgive me.\nMe: Would you forgive you?\nHim: Yes\nMe: I don’t. If you have guilt that is not my problem. \n\nThat was an earlier text exchange. I knew I wasn’t crazy. I have good memory and I hate being gaslit. I was nothing but nice and he just used me. Personally, I don’t think it worked out with the girl that’s why it took so long to apologize. I’m better these days but sometimes feel low about the treatment I was given. I made all the effort.",
        "created_utc": 1668022486,
        "upvote_ratio": 1.0
    },
    {
        "title": "Still trying to make sense of it all...",
        "author": "gordon-annie",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/yqncth/still_trying_to_make_sense_of_it_all/",
        "text": "Late last year, we discovered that my BIL had been physically torturing our 1 year old son. The initial shock and betrayal has been very difficult to sort through, but what has been (in some ways) even more difficult to process and deal with is that his wife never left his side (or his home) despite having small children as well.\nShe keeps reaching out with small texts, apologies and even a gift all while insisting that he's penitent and that he's a good husband and father. Is that even possible??\nMy husband and I have pieced together other red flags from the past and are quite sure he's a malignant narcissist, but we have no idea what their marriage looks like and are completely dumbfounded she would choose to stay with someone capable of such disturbing behavior.\n\nAnyone have any ideas of how we can help?? What should we do (if anything at all)?? Any ideas/insights would be appreciated!",
        "created_utc": 1668010374,
        "upvote_ratio": 1.0
    },
    {
        "title": "Was my ex a narcissist?",
        "author": "Euphoric-Mountain-32",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/yqlvqq/was_my_ex_a_narcissist/",
        "text": "I just ended a relationship of 9 months.\nI know it's the right decision.\nWe had too many differences in opinion, behavior, moral values.\nI was inexperienced, it was my first relationship in my life.\nIn the beginning everything was ideal..\nAfter the first sexual intercourse, very frequent criticism began due to my inexperience, while I did not receive a single compliment even when I tried at least a little.\nHe knew about my inexperience, and about ADHD and anxiety, and since he found out, he kept saying that something was wrong with me.\nHe also criticized the fact that I am a only child.\nI let him know that he is colder, but he made excuses that he is like that and that he won't change.\nHe claimed that he didn't want to change me and that he liked me, but he continued to criticize me anyway, and when I  asked him what he liked about me, he would say that I'm a fine person, there's nothing wrong with me..\nI never got direct and precise answers, and he claimed that it could not be explained to me.\nAnd he claimed that it was all for my good and that he didn't mean anything bad.\nMy mother is a psychotherapist, but I wanted to seek professional help from another psychotherapist, thinking that the problem was with me, but that didn't suit him either, he said why don't I go consult my mother.\nHe said that he would never go to a psychotherapist because, like his mother, they didn't help her with depression.\nHe also liked to hunt animals and threw a cat out the window of his ex-girlfriend.\nHe constantly criticized his exes and never himself.\nWas I in a relationship with a narcissist? Or was he egocentric or something else?\nOne evening he just suddenly got up and left and didn't answer until I called him.\nThen we broke up and he told me to find someone similar to me and not to judge me.\nI'm interested in the opinion of others because I keep spinning in my head why this happened and what kind of person I was with.\nKind regards",
        "created_utc": 1668007239,
        "upvote_ratio": 1.0
    },
    {
        "title": "Light-hearted joke about gaslighting to make you guys smile",
        "author": "VulcanHumour",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/yq3i0t/lighthearted_joke_about_gaslighting_to_make_you/",
        "text": "So I've been with my fiance for 5 years, and during that time he's helped me learn about narcissistic abuse, gaslighting, listened to me talk about the self help books I've read and therapy I've gone to, etc.\nSo tonight we're laying in bed, and I let out a little fart. I playfully started acting like he was the one who did it, not me, and surprisingly he said \"omg I'm so sorry that noise must have come from my stomach I swear I didn't fart\", like he didn't notice that I blamed him for my fart lol. So I immediately told him \"oh hey I'm just teasing you, it was me\" and he said,\n\"You're actually GAS- lighting me!\" :P\nSorry for the gross story, gnight lol",
        "created_utc": 1667953792,
        "upvote_ratio": 1.0
    },
    {
        "title": "New relationships",
        "author": "Itsoksometimes",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/ypdqym/new_relationships/",
        "text": "Finally being away from the n relationships, I find myself dealing with struggles in new friendships.  I always feel like a burden, that I’ve made them mad, that I’m the cause of chaos to them. \neven when they affirm that I am not, I think they could be lying. \n\nI know this will get better over time. I’m grateful for my new friends, as I didn’t think I’d ever have any again.",
        "created_utc": 1667890299,
        "upvote_ratio": 1.0
    },
    {
        "title": "Remembering gaslighting",
        "author": "Jaded-Tiger3101",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/yp8ccq/remembering_gaslighting/",
        "text": "“I never led you on, I was for real.” Apology - 2 months later “it was wrong of me to lead you on.” \n\nHim: That never happened, I never met your friends or family.\n\nHim: My mom liked meeting you.\n\nHim: I was for real. I don’t see this going anywhere.\n\nMe: You asked me to move in and I met your mom. You gave me a ring. How is that not serious? \n\nI swear I thought I was going crazy. I know I’m not crazy, he’s manipulative.",
        "created_utc": 1667873773,
        "upvote_ratio": 1.0
    },
    {
        "title": "Just fleed from family of narcs. Next steps?",
        "author": "artistic23",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/yp89cm/just_fleed_from_family_of_narcs_next_steps/",
        "text": "Hi all, to keep things short, I recently had fleed from a family of narcs but have been struggling to take care of myself in the process (though, my depression has been almost non-existent since I left). I’m planning on seeking mental help through someone who understands the lens of narcissism and take care of myself the best I can. What are some good next steps from here? I feel like I’ve healed quite a bit already but have plenty of healing to go.",
        "created_utc": 1667873544,
        "upvote_ratio": 1.0
    },
    {
        "title": "feeling paranoid",
        "author": "grasshopper099",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/yovvsg/feeling_paranoid/",
        "text": "i feel really paranoid ever since my breakup if I'm being watched or talked about. My nex had a whole smear campaign against me which thankfully i ignored to the best but we share a small community so words spread. I didnt engage \nHe ran into one of my male friends whom he thought i might be dating or interest in (im not) and tried to intimidate him. I'm being increasingly spammed by weird men from different numbers. I just block them but it all has got me super paranoid. I know if I ever actually date someone again I'll be scared if my nex is friends or acquaintance with them. I just feel scared and on guard i don't know how to cope",
        "created_utc": 1667846062,
        "upvote_ratio": 1.0
    },
    {
        "title": "Found out my aunt needs a transplant",
        "author": "ligwa",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/yorans/found_out_my_aunt_needs_a_transplant/",
        "text": "I haven't spoken to my aunt since she yelled and swore at me on my cellphone while I was visiting my grandmother in ER. My grandmother was having seizures and trouble breathing. My aunt was demanding that I find the doctor and make them tell her exactly what was happening. Me trying to explain that that's not how ERs work didn't go well and I eventually hung up on her. My grandmother passed away 4 weeks later, my aunt never apologized or admitted her behaviour was not appropriate. In fact she leaned into it, saying that I wasn't following her instructions and she was allowed to speak like that because she was upset about my grandmother was sick. This was 6 years ago.\n\nI found out yesterday that my aunt needs a liver transplant. I also found out that I'm the same blood type as her. I'm having a weird mix of glee and sadness for what could have been.",
        "created_utc": 1667836882,
        "upvote_ratio": 1.0
    },
    {
        "title": "Week 1 of freedom",
        "author": "ghostcat_crafting",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/yoowdj/week_1_of_freedom/",
        "text": "I feel like an entirely different person. I feel like the little kid that got left behind is coming out more and more. One week ago my wife and I moved out of the MIL suite at my nm’s house. We moved out into a woodsy area, and I now spend the vast majority of my time outside. (I’ve been hiding in the house for years to avoid contact. COVID was a blessing for me - nm wouldn’t physically interact with us at all, but she would always call out to us out the window and make my dumb ass stand there for 30+ minutes as she rambled about herself.) \n\nOver the weekend, I met my new neighbors: wild animals. I started my Saturday watching deer run around in the field across the street. (2 bucks and 3 does total.)A few hours later, two black vultures were cruising low looking for a snack. If I was on the roof at the time, I could’ve reached up and touched their bellies. (Single story house.) I spotted a Cooper’s hawk yesterday after hearing her calling most of the day. I think I heard an owl last night, too, but I couldn’t see anyone around that might’ve been hooting. I planted meadow flowers around the property, raked the leaves, fixed a few loose floorboards, hung string lights, replaced lightbulbs, found some beautiful mushrooms growing on an old piece of wood. \n\nWhen I was growing up, I loved being outside. I was outside from first light to last. In middle school we lived in the woods, and while I was being homeschooled through a cyber charter school, I typically would spend hours wandering around the woods. I was heavily interested in biology and geology. I’d spend my time following whatever animal tracks I came across, identifying skeletal remains of whatever I found. I was a naturalist before I knew that word. Being kept inside for weeks or months was one of the favorite punishments for minor infractions. But now that we’re away from the black hole vortex of hell… I found my peace. \n\nI got so excited to see the black vultures I started jumping up and down and half-yelling random facts about them. (Did you know their sense of smell isn’t very good? They find carrion by spotting other scavengers eating.) I apologized for acting crazy at seeing birds, but my wife just smiled and asked what else I knew about them. I really do feel like a new man. My back doesn’t hurt at all. My stomach isn’t acidic anymore. No more random migraines, phantom aches, nothing. I just sit on my porch at the end of the day and watch the trees breathe in the wind. I breathe with them. In the morning, I watch the dew begin to burn off and rise into a mist. It’s so peaceful here. It’s been way too long since I breathed.",
        "created_utc": 1667831997,
        "upvote_ratio": 1.0
    },
    {
        "title": "Divorce??",
        "author": "Icy-Lettuce1419",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/yod5ap/divorce/",
        "text": "Has anyone gotten out the other side of divorcing their ex? An attorney is out of the question. I can’t afford it with having to move across country soon. Ex negotiated taking all our furniture for HIS debt he wracked up while we have been separated. We discussed this in mediation and signed off on it but now I regret it :(. Trying to work with him to provide financial support for 6ish months so I can finish school I started but at the same time it gives me a lot of anxiety to go by his word or have any contact with him. I know it would be easy to say to cut my losses and not keep contact in any way but I want to be able to finish school. Idk. Someone please tell me it gets better once they’re finally gone. I’ll likely have to have some contact, by email at the least for the next 6 months. I wish I never got involved with him in the first place… :( he really tricked me. Pushed dating right away, pushed marriage right away. My dumbass fell for it all. That was the most confusing 3 years of my life and I just want it to be over. :(",
        "created_utc": 1667796912,
        "upvote_ratio": 1.0
    },
    {
        "title": "1st date after ex",
        "author": "throwaway_2234566",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/yo27s2/1st_date_after_ex/",
        "text": "Had my first date tonight. It was very strange in a good way, turned out this person had been hurt by narcissistic abuse as well and I believe more so than I was even. So was able to open up to each other a bit. But at the same time, I see both he and also myself are totally not ready to date. It was a good mirror for me, \n\nI want to date but seeing him and how stressed he still is, was a good mirror for myself. Am I ready to offer something to a new man, no I'm just not. As crazy as it's sounds I'm still too traumatised and 'in love' aka trauma bonded to the other person, not ready to let anybody new in. Would I run back to my tonights date? No. Would I crawl back on bare knees to my ex, yes. I know it's fucked up but it's the truth. \n\nI was in the car to my date thinking exactly this, if there would be a way to make it work with my ex I would and I would still do anything. It's unfair to be dating a new guy like this so I plan to just stay alone for a while.",
        "created_utc": 1667767622,
        "upvote_ratio": 1.0
    },
    {
        "title": "Tips?: Sometimes I feel like a compass with a magnet under it.",
        "author": "Hurdleflurdle",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/ynz1pw/tips_sometimes_i_feel_like_a_compass_with_a/",
        "text": "Anyone relate to this feeling? I now recognise it as a triggered state of confusion that was necessary to remain safe and adjust to the expected reality.\n\nBut now it happens to me at random times and it's so difficult to deal with. I'll just lose my sense of self completely, unable to make any decision, not knowing my values anymore. I do not know how to find myself back when that happens. Do you?",
        "created_utc": 1667760962,
        "upvote_ratio": 1.0
    },
    {
        "title": "Am I becoming like my nex",
        "author": "grasshopper099",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/ynyrza/am_i_becoming_like_my_nex/",
        "text": "\nI've realized I now have very low tolerance for other people burdening me. It's just whenever someone, an acquaintance or relative is ranting (not healthy venting but dumping on me) I get annoyed and want them to go away. And if someone is being insecure of something I have I just get frustrated. \nI dont know if it's a good or bad thing but I feel guilty when I get annoyed by someone because I fear karma or something will hit and I will be in their position with other people being annoyed by me. My nex misunderstood me in a lot of situations and also was very impatient with me. Am I becoming like him? I wonder if this means that I'm not understanding of others or just am prioritizing myself. Any thoughts?",
        "created_utc": 1667760392,
        "upvote_ratio": 1.0
    },
    {
        "title": "Low tolerance for others",
        "author": "grasshopper099",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/yntibj/low_tolerance_for_others/",
        "text": "I've realized I now have very low tolerance for other people burdening me. It's just whenever someone, an acquaintance or relative is ranting (not healthy venting but dumping on me) I get annoyed and want them to go away. And if someone is being insecure of something I have I just get frustrated. \nI dont know if it's a good or bad thing but I feel guilty when I get annoyed by someone because I fear karma or something will hit and I will be in their position with other people being annoyed by me. I wonder if this means that I'm not understanding of others or just am prioritizing myself. Any thoughts?",
        "created_utc": 1667749506,
        "upvote_ratio": 1.0
    },
    {
        "title": "He Reached Out",
        "author": "thewaymylifegoes",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/ynfn6s/he_reached_out/",
        "text": "Narc just reached out to me the other day: “That’s part of life, we had spiritual lessons to learn. You have a lot of traumas you have to heal from. Hope you’re working on yourself and stick to your values. Wish you the best from afar” he dumped me 3 months ago, and had me apologizing for my reactions to his withdrawal. He kept sending late night drunk texts the past few months but acts so over me. I sent him love, I still have love for this person. Spiritual lessons? Working on myself? He’s so cold and mean, it’s dramatic. So condescending like he’s above me and so mature. It doesn’t feel like a kind message. Feels so mean and like he looks down on me. \n\nHis initial hoovers were in stark contrast. He rescinded his \"love\" so quickly, within weeks. I'm still struggling to move on while he is out living his best life. I keep kicking myself for how easily he moved on and how I'm still hurting so deeply 3 months later, I barely leave my house. I still miss the person he showed me before, I feel so broken. He flipped the script and blamed me for everything. \"If you weren't so toxic, I wouldn't have to lie to you.\" When dumped me he said, \"Stop acting like I did something to hurt you, you're not the victim here. I already moved on a long time ago, I just felt bad you couldn't live without me. I can't keep living a lie anymore, I can't be someone I'm not. You make men feel trapped, no man will want to stay with you. You're too attached.\" He trapped me in the relationship devoid of his commitment. Just three weeks ago he texted me he \"still missed\" me and \"Hope your beautiful soul is flourishing more.\" Now he's cold and mean. None of it feels genuine at all, but my heart still loves him. \n\nI hate that I still feel so cut up over this. Why can't I move on? Is this proof he is a narcissist?",
        "created_utc": 1667705937,
        "upvote_ratio": 1.0
    },
    {
        "title": "Left my Nex but still have to deal with my sisters Narc. Not sure what to do. Help",
        "author": "findingself1984",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/ynef7x/left_my_nex_but_still_have_to_deal_with_my/",
        "text": "\nSo my sister has been with her Narc for over 20 yrs. I try to keep my distance but it’s difficult sometimes. Recently, I left my Nex of 10yrs and stayed with my sister and her Narc SO for a few weeks. Everything was good until I left. The whole time I was there with my daughter they were super nice and supportive and I made sure to tell them how appreciative I was.  He usually triggers me with his outbursts but it wasn’t bad this time. The day I left I called my sister to tell her thank you and that I was going home because my Nex finally left. Her spouse got mad that I didn’t text him when I left.  So I text him later that day or the next day (can’t remember) but it was too late. He never replied. Soon after was my sister bday. I text her in the morning and got busy with my day and was planning to stop by to see her but my day got away from me and I just text her again that night. She was mad at me for not going to see her and I apologized profusely. He then text me a long text few days later about how ungrateful I am that I didn’t thank him when I left and how I am a bad mom and sister. Long story short-my sister was on his side and we didn’t talk for a couple months. I recently made up with my sister but not him. She asked me to contact him to “make up” so we can have thanksgiving together with our dad at her house. I am trying to keep my peace and stay true to who I am but I love my family and have never missed a holiday with them. I’m struggling with this. Am I being stubborn and should fake-apologize to him or would that be betraying myself?\n\nI’ve done a lot of work on myself and am so much stronger now. I finally love myself and am getting better at boundaries. This has kind of thrown me for a loop. 😬",
        "created_utc": 1667702261,
        "upvote_ratio": 1.0
    },
    {
        "title": "CMV, the best way to drop any friendship with any suspected N is to gray rock them until they stop texting you.",
        "author": "TrainingHeron",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/ynbzm5/cmv_the_best_way_to_drop_any_friendship_with_any/",
        "text": "Gray rocking if safe since it wont make them rage as hard. Even if you don't suspect the 'friend' is N, gray rock them just in case? Like putting on a seat belt.",
        "created_utc": 1667695358,
        "upvote_ratio": 1.0
    },
    {
        "title": "facing the harsh facts",
        "author": "throwaway_2234566",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/yn8low/facing_the_harsh_facts/",
        "text": "I knew this all along in my heart but now I am able to feel it and thankfully with some more emotional distance. He never cared in the way I cared for him. Refering a couple of times to other friends in our group who have a friends with benefits. This is what he wanted for him and me as well. Tried to get it, never got to have it because I had such strong boundaries which I'm so happy and proud of. Then tried to make me believe he missed me and wanted more, but all the  time he just wanted my attention to play with me a bit more. Like a damn toy. \n\nAnd here I was being so happy with those first dates, feeling that his touch, physical closeness, kisses, wanting to hold hands... that it all meant equally much to him as to me. Wake up, it didn't. It was just a crazy game and seeing the red flags, I should have known and never let him come back to me. But I'm worth so much more than this. This whole fwb arrangement, it's not for me in general anyway. He is for sure out there seducing the next woman, chasing his next high. He can go and party without me, I'll be at home peacefully,",
        "created_utc": 1667687660,
        "upvote_ratio": 1.0
    },
    {
        "title": "feeling really lonely and bored",
        "author": "wandering__witch",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/yn5v0m/feeling_really_lonely_and_bored/",
        "text": "It's been about two years since I went NC with the whole family as well as many friends. I some people I talk to occasionally and I'm making a real effort to bring people into my life but those people either don't talk much or are far away so essentially I have a dearth in my life of just people I can chat to. \n\nI have a real problem with trusting literally anybody. I've been scrolling through this sub for other lonely posts and it seems common to see narc traits really early on in lots of people and I would clearly rather be alone than deal with more narcs close at hand. I'm trying to find people to chat to that I know from the past but I have so few of them. I have one friend I'm talking to from high school and I feel like it's like water in a desert, I've been so *starved* of social interaction and feeling known. \n\nI've also seen a lot of people talking about grieving the family we never got to have and I think that's what I'm going through. It's a real mental health issue and it has kind of taken over my life, I feel lonely and bored but it's like, monumental, insufferable, I don't understand why it's so painful and difficult to overcome. Maybe on some level I feel guilty for feeling this way because I find it very difficult to talk about it with anyone. But I don't *talk* to anyone so it's kind of a loop. \n\nI also guess I have to heal from all of the trauma I went through which is also something I have to deal with. It's all just so hard. Grieving the family I left. Healing from them. Making new non-narc connections.  It all seems so insurmountable. So I just stare at the wall with my heart hurting, feeling like I can't turn anywhere. \n\nAny help? Thank you xx",
        "created_utc": 1667681677,
        "upvote_ratio": 1.0
    },
    {
        "title": "[Rant/Vent] I saw my abuser for the first time in a while at a family members house.",
        "author": "jadedbeetle",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/ymwuau/rantvent_i_saw_my_abuser_for_the_first_time_in_a/",
        "text": "My abuser is my old step dad. My mom broke up with him about 6 years ago now and I havent spoken to him since. He is a terrible person, the type of guy who screams at children every day till his face is red and voice is squeaking. \n\nMy grandparents live in a small town, and a bunch of family were there to celebrate a few birthdays that were close together. I arrived with my mom and her partner, and I guess her ex had come to drop off his daughter (my half sister). I didn't even realize it was him until I was already walking a few feet away from him. I was shocked and went inside avoiding anyone and locked myself in a bedroom. I have nightmares, that may sound silly but are really upsetting and make me feel sick. Basically these nightmares usually involve a family event, where he is present, people are being nice to him, and upset at me for being upset. So I didn't want that dream to become even more of a reality because I knew people would tell me I'm out of line or something for being terrified of my abuser 🙄 because that exact situation has happened multiple times in the past. \n\nI don't understand why he thinks he can be around my family? He doesn't belong. He's an asshole and did horrific things to my family, yet they still let him around. I know a big part of it is because they are scared of him. They don't want to deal with the blowup that would happen if anyone went against him in any way. Because he is emotionally pathetic and will just try and tear people down to get his way. It was painful feeling trapped in my own family's home and peaking out the window to see him happily talking to someone like he's a part of us. I wanted to go run and hide outside so no one could talk to me, but he would've been able to see me leave out the door.  I feel angry with my family for letting him around in any way. I never wanted him to see me ever again. I never wanted him to hear my voice. That was also violated when my sister once was speaking to him on speaker phone in my apartment when I didn't know. \n\nIm sick of feeling like I can't feel safe around my own family because I don't know when someone will bring him up or allow his energy to stain everything. I'm sick of being seen as over reacting or whatever the hell they must think, when my life has been ruined from the age of 8. I have to work so hard to fix what he damaged, and it hurts so much to not have my own family see that he is harmful and did this to us. I just wish he would dissappear and leave my family alone.",
        "created_utc": 1667661374,
        "upvote_ratio": 1.0
    },
    {
        "title": "What're some good questions for a new therapist?",
        "author": "Jemarqus_07",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/ymnbu8/whatre_some_good_questions_for_a_new_therapist/",
        "text": "I'm seeing a new therapist tomorrow. What are some good questions to vet a therapist, especially as the adult child of a narcissistic parent?",
        "created_utc": 1667633762,
        "upvote_ratio": 1.0
    },
    {
        "title": "What do you think about these statements?",
        "author": "Working-Science2357",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/ymb3uz/what_do_you_think_about_these_statements/",
        "text": "People have written these comments under my posts about leaving an abusive partner and also under other redditor’s posts. These posts are about the fear that they changed for the new partner which mostly haunts victims of narcissistic abuse. \n\n“You don’t know what the abusive ex partner’s new partner brings on their table and what the abusive ex is giving them. Could be way better than with you”\n\n“Just because he abused you, doesn’t mean he will abuse others”\n\n“He was abusive because you two were not a good match” \n\nWhat do you think about those comments? Especially about the first one? \n\nIf you have experienced how your abusive ex treated his new partner the same way/ or worse than they treated you, feel free to share if you like! \n\nI feel very broken after this whole experience, luckily I finally got out but I didn’t stick around long enough to experience how they treated others.",
        "created_utc": 1667597566,
        "upvote_ratio": 1.0
    },
    {
        "title": "knowing what you know now, if you had the chance to see your nex again with your new perspective, would you?",
        "author": "WillingnessRelative2",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/ym9x16/knowing_what_you_know_now_if_you_had_the_chance/",
        "text": "maybe this is a stupid question, but for some reason i have this belief that if i see him again i can “rewrite” the ending. our breakup was traumatic and i feel like even though it’s only been a couple months, it would help to see him and feel like i am the one choosing to end it (bc he’s a horrible person ofc). but to him it would just be to “catch up”. i would have the opportunity to see him in this new light and know that what he says is all BS. it’s like closure, except he would never give me closure…so he wouldn’t know that’s why i want to see him. it makes sense in my head, i hope someone else can relate. i just want some control of the situation and to feel less like a victim.",
        "created_utc": 1667594729,
        "upvote_ratio": 1.0
    },
    {
        "title": "Gaslighting",
        "author": "Jaded-Tiger3101",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/ym89gg/gaslighting/",
        "text": "I believe I was gaslit. He asked me to move in and gave me a random ring and I met his mother. Then he randomly said he met someone else. He said none of that ever happened. “We never talked about that.” “You weren’t fit enough.” “You didn’t change.” There was never a single argument. I have no idea what he meant by change. He was just looking for excuses. I have really good memory when I experience it and when I write things down. He made me question my own sanity and fitness. I believed I was fat. I am not. I ended up using the treadmill twice a day. I felt worse. After 2 months of NC I received an unapologetic “apology”. It was the most narcissistic thing I’ve read. I was surprised he somewhat acknowledged what he did.  I knew I wasn’t crazy. I believe it didn’t work out with the other girl and so he tried to relieve his guilt. I still exercise and I look fine. I’m just so anxious, but I am better these days.",
        "created_utc": 1667590799,
        "upvote_ratio": 1.0
    },
    {
        "title": "what is consistency?",
        "author": "grasshopper099",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/ym7p8o/what_is_consistency/",
        "text": "Everyone says look for consistency not frequency, I want to ask what is consistency in a relationship. \nHow did you know there's consistency in your healthy relationships that you went to after dating narcs?\nCan some of tell by examples or explain it to me",
        "created_utc": 1667589455,
        "upvote_ratio": 1.0
    },
    {
        "title": "Never again",
        "author": "Sincere_420",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/ym7474/never_again/",
        "text": "https://imgur.com/a/jEsfQaQ",
        "created_utc": 1667588077,
        "upvote_ratio": 1.0
    }
]