[
    {
        "title": "Lies and myths we tell us to get us trapped.",
        "author": "Free-Force-3076",
        "url": "/r/TrueNarcissisticAbuse/comments/10tpfhg/lies_and_myths_we_tell_us_to_get_us_trapped/",
        "text": "",
        "created_utc": 1675540240,
        "upvote_ratio": 1.0
    },
    {
        "title": "I wish there was a LifeAfterNarcissism subreddit for people raisedbynarcissists?",
        "author": "SpiritualCyberpunk",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/10tctf0/i_wish_there_was_a_lifeafternarcissism_subreddit/",
        "text": "There's so many people talking about their ex here. I just can't relate to that (much). In Raisedbynarcissist I can't relate to most posts as it's usually younger people still having trouble setting boundaries with their parents.\n\nWhy don't you guys use /r/ExNoContact? there's literally a specific group for you guys, and /r/raisedbynarcissists tells us /r/LifeAfterNarcissism is for people raised by narcissists who are along in putting boundaries.  \nI respect your struggles, but it's a waste of time for us all not to use the disambiguation offered.",
        "created_utc": 1675505515,
        "upvote_ratio": 1.0
    },
    {
        "title": "Not about any specific person, but is it typical for people with narcissistic traits to be upset if you aren’t impressed by their achievements?",
        "author": "Due-Cat-9888",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/10su38c/not_about_any_specific_person_but_is_it_typical/",
        "text": "I was rarely impressed and thus called arrogant by that person (which I found ironic as they were obsessed by status). I wonder a bit about the general tendency in this regard.",
        "created_utc": 1675455534,
        "upvote_ratio": 1.0
    },
    {
        "title": "flying monkeys+hoover: what to do",
        "author": "ConstructionNo7665",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/10sl9ow/flying_monkeyshoover_what_to_do/",
        "text": "I forgot to block my nex on instagram. They sent a message last night \" are you still mad at me or can we talk. I am stupid and sorry for what i did\".\n\nI want him to prove me right of how useless he actually is. Yet another apology of \"poor me\".\nDo i let him talk? Is it worth it? \nI know blocking him would be the best answer. But i am human... we split 5 weeks ago...\n\nAdvice needed",
        "created_utc": 1675433544,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do you cope with finally realizing your parent is a narcissist",
        "author": "CountryAlive",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/10sgq4e/how_do_you_cope_with_finally_realizing_your/",
        "text": "Hi everyone! First post here but I figured no one else would understand it if not for people who’s been through it. I (25F) have recently come to realize my father is an NPD after my therapist had hinted at it in numerous sessions. I’ve been trying to process this for the past few weeks and still having troubles. The anger and sadness come in waves and are so overwhelming sometimes I feel like I can’t take it/can’t ever get over it. \n\nA little backstory, my NPD dad divorced my mom when I was 4. I’ve been living with my grandparents since and he sporadically visits. Growing up, he was always very controlling (when he’s home) and is very clear about what he wants me to be. I felt like his love had to be “earned” by being a good kid. I started rebelling against him when I hit teenage years and obviously that led to him using guilt-tripping, gaslighting, triangulation, all sort of classic NPD tactics to control and manipulate me. All of these I never realized till I went into therapy in my early 20s (for generalized anxiety) and finally making sense of why I always felt “crazy” or “my truth are distorted” when I talk to him. My mom is a great mom for the most part - she listens and is supportive &amp; open-minded, but she can be a victim to him too. He love bombs her (still, after their marriage had been over for years) in order to control me through her. He’s obviously successful because she acts as his proxy sometimes, telling me these sob stories and getting me to “take care of his feelings.” She’s gotten more self-aware but it takes me actively calling her out when the old habits resurfaces.\n\nI guess I’m really struggling with the fact that my dad really never loved me. All my intuitions growing up were true - he was only obsessed with me because I’m an extension of him, I make him look good (being smart &amp; in a top college etc). I’m basically a prop. I feel like I knew all of these things all along but somehow it still feels so hard to accept. I don’t know how to go about my life maintaining healthy distance from him considering he’ll inevitably be there at my important life events: wedding, graduation, when I have a child. I don’t really know how to face him anymore after finally realizing how vile his narcissism is. I keep getting sucked into these memories episodes where he used to manipulate and control me, put on these grand shows, distort narratives and driving me literally crazy. I just feel so stuck. \n\nI’m lucky enough to be far far away from him rn. I live in the US, happily married and have two adorable dogs while he lives in China. I really felt like my life was turning around - I got an offer to a law school I wanted with scholarship, a guy who loves me and have a healthy relationship with me &amp; finally some proper distance from my abuser. But somehow truly facing the fact that he is beyond help and that he never did or will love me is breaking me apart.",
        "created_utc": 1675418442,
        "upvote_ratio": 1.0
    },
    {
        "title": "how do you trust?",
        "author": "AdventurousBall2328",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/10scjaj/how_do_you_trust/",
        "text": "I've only trusted one of my exes.  I recently have been in an on-and-off relationship with a very unstable person.  I don't trust him at all and he did nothing to make me trust him more. He lied and violated my boundaries.  I'm getting older and I don't think romantic relationships are for me, I get paranoid when I start to like someone... I only trust my close relatives, friends, and animals. That's about it.  Has anyone eventually overcome the paranoid feeling through therapy or did you just meet someone that fit you so well?",
        "created_utc": 1675403172,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do you know when you're loved?",
        "author": "Valuable_Language_41",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/10rv4wh/how_do_you_know_when_youre_loved/",
        "text": "I had a narcissistic father and an emotionally neglectful mother. I've never been into a romantic relationship.\n\nAbout an year ago, I started falling in love with my boss because he made me feel loved. I thought he liked me back. He was gentle, patient, funny, supportive and affectionate. Like, physical affectionate too. He would casually massage my hands sometimes, or ask me to massage his. Apparently, he does that to every single woman he interacts with, but I thought he liked me. We talked a lot about many personal things, like mental health, sex, relationships... I felt loved for the first time in my life.\n\nAfter months of liking him in secret, I asked him out, and he told me he never thought about me \"that way\".  It's been months since I was rejected and I still can't get over him. I'm leaving my job this month because I can't even stand looking at him.\n\nHow could I have been so mistaken about what I felt? I was sure he was into me. It doesn't seen normal to me that he touches his friends like that. I really thought we had something. Now I don't know if I felt this way because he was leading me on or if I'm so love deprived that I mistake politeness for love.\n\nMy friends are tired of me constantly talking about him. But it's hard for me to even make sense of my feelings when I have such a heavy baggage of past traumas. How do you guys now if you're loved? How do I avoid being mistaken about stuff like this again?",
        "created_utc": 1675358109,
        "upvote_ratio": 1.0
    },
    {
        "title": "The latest breadcrumb",
        "author": "kwanthony1986",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/10ru02p/the_latest_breadcrumb/",
        "text": "Saw an email in my spam folder from her. Figured that it was her letting me know that she's coming back to my town for work. Instead it was a link to YouTube with the Journey remix two hearts by Dj Trashy. After looking at the lyrics, I had to laugh.. when they say \"I wonder who's crying now?\" Not sure who she's referring to. But the lyrics are interesting, kinda reminds me of how I felt about the relationship when I was drinking.  I finally feel like I'm getting some relief from the trauma bond and I'm 2 months sober today!!",
        "created_utc": 1675355383,
        "upvote_ratio": 1.0
    },
    {
        "title": "How did you realised you were dating with a new narc?",
        "author": "Hot_Contribution_371",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/10rsr66/how_did_you_realised_you_were_dating_with_a_new/",
        "text": "Last weeks i was talking and dating with a guy who i', almost sure is a new narc.\n\nLovebombing too soon, high and lows, asking for money, idealizasing me, insulting me, always wanting control and proyecting me the guilty about his bad actions and mistakes.\n\nI felt like when i was with my nex, and it was like being at the point when i began no contact with my nex. Really crapy. And now i have some bad habbits i had at the begining of mi no contact journey with my nex. So i'm quite sure this new guy is a narc too.\n\nHow has been your experiences? How did you felt with the new narc? What did you do to stop attracting them?",
        "created_utc": 1675352351,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to let go , move on and avoid self sabotage",
        "author": "Free-Force-3076",
        "url": "/r/TrueNarcissisticAbuse/comments/10rrbr9/how_to_let_go_move_on_and_avoid_self_sabotage/",
        "text": "",
        "created_utc": 1675348690,
        "upvote_ratio": 1.0
    },
    {
        "title": "Covert narc’s appearance",
        "author": "Spicepumpkin66",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/10rothg/covert_narcs_appearance/",
        "text": "My narc is never confident about his appearance, he loves to photoshop every photo he posts on social media to the extent that in each photo he looks a bit different.\n\nHe is also a demanding model, every time he asked me to take photos of him, it takes way too many photo from the same angle and it’s a really long time to fit in all the content he wants.\n\nEvery time I tell someone that we were dating(usually his friends would be like omg I never knew your existence and I never knew you were dating!), people all consider him as a man with plain look, and to be fair, I look above average and look much better.\n\nWhat’s more confusing is he’s playing his role as an ordinary look man with honesty and fidelity, which he is nothing like that deep down.\n\nSo I guess it’s difficult to tell a covert narc simply by their appearance, they are good to hide.",
        "created_utc": 1675341356,
        "upvote_ratio": 1.0
    },
    {
        "title": "If your narc parent was hyper obsessed with vanity and public opinions",
        "author": "teaforsnail",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/10riy1z/if_your_narc_parent_was_hyper_obsessed_with/",
        "text": "Do you find that you're really unconcerned with all of that stuff now? My mom would act like a crazy person over the smallest detail,  she'd even lie to me saying that the teachers in school were complaining about how bad I stunk or that they were coming over to dinner to talk about it. Lots of rants about how the fire department says my room is a fire hazard and I'm an embarrassment to women, or something similar. Even very humble commentary from even I was 8 when she'd go \"I used to be much better looking than you at your age, no offense\". Now as an adult I just don't care about any of that stuff. I'm not slovenly but I seriously couldn't be bothered with fancy name brands or decorating in a certain style or anything, only the bare minimum for me.",
        "created_utc": 1675319247,
        "upvote_ratio": 1.0
    },
    {
        "title": "How long should I stay single?",
        "author": "j_aden",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/10riugf/how_long_should_i_stay_single/",
        "text": "I (35m) managed to escape from my narc-ex (31f) on Aug 30, 2022. We were together for close to 8 years. I'm not going to go into all the details of how awful it was - almost unimaginable, at times. I had tried to get away several times before, but she was skilled at reeling me back in and I was mostly uneducated about narcissism at the time. It's like she just let me go this time .. I can't tell if it was her arrogantly believing that she could just get me back whenever she wanted, or if she thought she didn't need me anymore because she was getting her master's in special education, but all I got after going was some photos of the dog\\* looking sad texted to me before I just blocked her and never looked back.\n\nIt's been 5 months. I've been slowly repairing myself. I got my drivers license shortly before I left and have since purchased my first car (&lt;3 the newfound freedom and autonomy). I've lost \\~20 pounds with intermittent fasting. I joined a gym and am slowly but steadily making progress to new powerlifting PRs -- my old ones are about a decade old. I'm employed and making a lot more than I actually need. I have my own apartment for the first time in my life -- no roommates, no partner. I should be feeling great, but .. \n\nIt's been extremely difficult socially. It may be hard to believe, but I've had 0 desire to talk to narc-ex at all during this time. All I want to do is meet new people, but .. Wtf has happened to the world? Has it always been this way? Everything seems broken, socially -- especially me. It was so easy to make new friends, meet new people, etcetera 10 years ago. I never pursued romantic relationships and was turning girls away (not always consciously) . Now I feel like a leper. Like I make a horrible first impression that can never be recovered from, or like I'm subconsciously seeking out someone who .. can do even more damage to me. I'm definitely not looking for another narcissist, but it's a zoo out there. Maybe it's just fully eroded self-esteem and difficulty with rejection. I rarely if ever pursue women (narc relentlessly pursued me and I caved), but when I have I've generally had some kind of strong intuition guiding me .. I guess others just don't see that .. I don't know what I'm saying anymore.\n\nMy cousin kept warning me that I wasn't \"out of the woods\" yet - that narc-ex would try her best to get me back. That won't happen, but I'm more worried about myself and how fresh the trauma is and how hard I should be pursuing new relationships, romantic or otherwise. Some have recommended at least a year of not trying to date anyone but .. Damn. It's almost been half that and things aren't getting better?\n\n What have I not been told or what am I not understanding about this process of healing? I'm not in therapy. I've tried to pursue mental health stuff but the wait times are into multiple months, expensive, and I'm planning to quit my job anyway and lose health insurance.\n\n\\* Losing the dog seriously broke my heart. It was likely triangulation from the beginning. Narc brought the puppy home randomly one day and I spent all day every day with her for 2 years. Still mad about this ..",
        "created_utc": 1675318889,
        "upvote_ratio": 1.0
    },
    {
        "title": "I am not feeling well. Had someone break up with me today and I don't know what to do. Can anyone help?",
        "author": "MaxSteelMetal",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/10rb5nh/i_am_not_feeling_well_had_someone_break_up_with/",
        "text": "Hi everyone,\n\nI just had someone breakup with me and I don't know how to feel about it. \n\nI feel so lost and alone and I feel like it's all my fault.\n\nShe is in Europe right now and we were supposed to have a call on FB 2 weeks ago on Sunday.\n\nBut about 10-15 mins before the call, she send me a long message saying she had a stressful day and she had a 2 hr call with her mentor and now she's really tired to speak and she wants to sleep and get prepared for the upcoming week. And that she hopes I understand \n\nI told her \"I understand and to take her time\"\n\nBut it just wasn't sitting well with me since the day prior to that she said she had a great time watching a 3 part movie with her friends. \n\nSo I was a bit stand offish with her. Also because I myself was under great stress because of the crazy cold winter weather we've been having here in the Midwest.\n\nSo I asked her 2 days ago finally, what happened on Sunday and she send me a message reassuring me to trust her and that nothing happened and things like that. But that wasn't even in my mind..which got me even more confused. I mean I was just enquiring what happened. But her side was that she noticed how I was responding to her late to her messages.\n\nShe apologized. And said she's sorry if she hurt me.\n\n\nBut me being the stupid person I am still kept wondering about what happened and so I told her, going forward, it's better if we space out the conversation if you are supposed to be talking to a mentor right before \"our\" conversation.  I don't know if that was a dumb thing to say but I said it as kindly as possible.\n\nLong story short, today morning I woke up with a message from her saying that It seems I have some thoughts and doubts about what happened on Sunday and this won't work out.\n\nShe also gave 2 other reasons. But I just don't know how to feel. On one hand I feel like she was a really kind and gentle religious girl. But on the other hand I feel like I messed up my chances by not trusting her enough.\n\nShe told me she would explain what happened on Sunday which is why I even asked her. \n\nWhat do I do? Did I do the right thing by asking her all those questions or was that a stupid mistake on my part?",
        "created_utc": 1675297360,
        "upvote_ratio": 1.0
    },
    {
        "title": "HG Tudor",
        "author": "belefa7488",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/10quab9/hg_tudor/",
        "text": "Whichever Reddit person mentioned this guy to me, I am ETERNALLY grateful.\n\nPretty sure his video \"Why Am I Behaving Like the Narcissist\" just saved me quite a few years of therapy.  He's extremely intelligent and cuts right to the chase.  Amazing.",
        "created_utc": 1675256786,
        "upvote_ratio": 1.0
    },
    {
        "title": "Another song about abuse",
        "author": "ContributionJolly634",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/10q9s23/another_song_about_abuse/",
        "text": "Hello. I love these lyrics, it's from Chimaira and the song is called Cleansation. It's been like 4 years since I went NC with my Nex and these lyrics still feel, well, cleansing lol. Enjoy.\n\nWhat do you expect from me\nWill I ever be who you want me to be\nWill I ever live up to your standards\nWill you always look down on me\nMaybe I'm not who you are\nMaybe I want to be myself\nLive the life I've always dreamed about\nThis is not your path to choose\n\nYes I taste it\nYes I breathe it\nYes I hate it\nYes I feel strain from\nOur separation\nBut\nThis is my life, this is my life\nMy cleansation\nOur separation\nThis is my life, this is my life\nIt's not yours anymore\n\nWhy did you insist on ruling\nWhy did you try and control\nWhy didn't you ever listen to me?\nIgnored me, like a dog\nMaybe I'm glad we're apart\nMaybe I'm glad we don't speak anymore\nI feel better now\nNow that you are gone",
        "created_utc": 1675197551,
        "upvote_ratio": 1.0
    },
    {
        "title": "Need someone to talk to...",
        "author": "beauty4ashes627",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/10q2ce8/need_someone_to_talk_to/",
        "text": "It's been over a month now and his Christmas gift was abandoning me and filing for divorce. I was blindsided. He tricked me to get me out of the house and once he drop me home to my family's place he went straight to his parents place and told me he will filed. He said he told his folks he will divorce me otherwise he will lose them. I doubt that's the only reason cause he was dropping hints of finding someone better and spending his money on her. \nI stupidly chase nonstop for straight a month. Texting him from apps since he blocked me on my real number and refused to give me closure. Well perhaps he did since he said move on and move forward but will not give me the closure I want and that's him answering if he has someone new and there's no way of getting back later. He showed some signs of a covert narcissist but I was never too sure. It's sucks cause I feel very lost without him. I cling to God praying and asking to take this feeling away but to no avail. Morning is worst cause I get really bad urges to reach out to him even though I know he won't respond. He just lets his lawyer speaks for him. I have anxiety but now I am depressed  too. I feel so alone. My family doesn't understand and expect me to bounce back. The only 1 friend I have doesn't talk at all and hanging out feels like I'm with a rock. I have nobody for emotional support. Therapist isn't much of a help and I already change 3times cause they all suck. They care more about legality of the divorce or will stall time or just let me talk but won't say anything then will end session 15 mins earlier. I can't get a break. I don't work my husband was the breadwinner and he always wants to do everything for me even filling out forms at the dr office. When I would not need his help or be independent he would seem displeased. I blame myself for a lot. I can't seem to move forward and I can't stop missing and wanting him back. I hate myself for it. I have a dog that is everything to me who depends on me that I have neglected. Memories keep haunting me and I deleted all photos. I have beg pleaded for an entire month for him not to go thru but he ignores me. He blocks my real number and email Apple ID anything tied to that number but he will not block the text apps or new Apple ID account I made to text him. I have no income so when I ask him to put some $ for food in our joint account he would so that's how I know he reads my texts from text app or new Apple ID account. I really want to stop hurting and my health wasn't in the best to begin with now it just made it worse. I have applied at jobs but I'm not getting anything. I feel hopeless. Please help me.",
        "created_utc": 1675179980,
        "upvote_ratio": 1.0
    },
    {
        "title": "When my father died",
        "author": "Justagirl729",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/10pkszr/when_my_father_died/",
        "text": "I went back and forth for years, and the things you did, they were indescribable, but that’s for another day, because they were still forgivable, maybe not for some, but for me... because I saw you. But when my dad died, that was it for me. When I needed you the most, because I lost the one person in the world that really understood me, you weren’t there. I remember calling you, I didn’t even have words, I could barely breathe, “come home.. Please, I need you to come home” and in your coldest “what’s her problem now” voice, you said “what’s the problem, what is it” I couldn’t say it out loud, I was still trying to process what had just happened in my head, hyperventilating and trying to breathe I could hear you aggravated and just so annoyed on the other line. Finally the words poured out, “my dad died can you please come home.” My children, YOUR children, were sitting here watching their mother fall apart, watching the one person who’s suppose to be strong for them completely lose it. It took you hours to get home, you walked in smelling like booze and told me to get off the bathroom floor and not to let my kids see me like that. I remember you leaving for work the next day and then coming home shortly after and saying “i couldn’t leave you like that” and for a brief second, it was like you had humanity in you. But you kept your distance all day, you went outside, and barely paid me any mind, then had the nerve to say that night “well you didn’t say two words to me and I stayed home for you” SAY TWO WORDS TO YOU, I couldn’t even think two words, I was numb, my body was numb, my heart was broken, my mind wasn’t even putting words together at that point. The next few days were such a blur, but I know, you weren’t there, rolling in drunk at 2am from whatever bar you were at with whatever girl you were with. The day my grief turned into anger, I remember starting to empty the dishwasher, and being so mad the plates weren’t clean, emotions just took over my body, I started smashing dishes and just uncontrollably yelling, no words, just sobbing screams. I needed you, I needed someone, I needed to know I wasn’t alone. But you walked in and asked me “what the f**k was wrong with me”, I packed my kids up to take them on a plane for my fathers funeral, their grandfather, and now that I’m writing this, I don’t think you ever once asked them if they were ok. But we asked you to come, begged you, and you claimed you couldn’t take the time off. But while I was there I would watch you stroll into MY house with MY car at 1am, 2am, 3am, on the cameras, so intoxicated you could barely stand, months later I found out you took that time that I was away grieving the most unbearable loss, to spend time with the girl next door, just living your best life, while your family was falling apart. Those few weeks were such a blur to me, but what I do remember was being more alone than I’ve ever been in my life, being so numb I didn’t ever know what was happening, and you making it about you. Accusing me of seeing people while I was helping my grieving mother, yelling at me if I didn’t answer the phone, the times you even bothered to call. I remember telling myself the only thing my father ever wanted was for me to get away from you forever because HE SAW YOU, not the way I saw you, but for the way you really are and now this was my chance. I remember you not being there, when I needed you, I just needed anyone, to make me feel like life was worth living.  When I needed to grieve but I couldn’t because I needed to be a mother, you weren’t there. After a few months of pushing my emotions so deep inside that quite honestly I never dealt with them, I tried to see past it, but that was it for me, my father dying was my wake up call that I would NEVER be able to love you again, that you would never be the person I needed you to be, that a narcissist can never be a decent human, no matter how hard they try. Time after time, that I took you back, that I tried again and again, after the mental, the physical, the emotional, the financial abuse, who would have thought this is what would do it. The pain I felt, I never felt pain like that, but I think feeling something at all was what got me here. And all I can do is be grateful, grateful that I’m free from someone who will never see past themselves.",
        "created_utc": 1675129801,
        "upvote_ratio": 1.0
    },
    {
        "title": "Boundaries in place, but can’t tell if this is a Hoover attempt",
        "author": "ShinyHappyPizzas",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/10pje2b/boundaries_in_place_but_cant_tell_if_this_is_a/",
        "text": "Hi! I’m five months out of a nearly four-year relationship with a likely narcissist (literally checks all of the grandiose and some covert boxes) — I left and he took it very badly. Started dating and sleeping around immediately until he found a codependent new supply (creepily with the same first name as me — this matters for my question below) and he’s regularly thrown in my face how much nicer she is, how much happier he is with her now, he took her across the country to meet his family after a month of dating her (took me two years with him to get there) etc. He’s been with her 2.5 months, during which time he reached out to the person I am now dating (!!) to smear campaign me, forced mutual friends to pick sides and demand that they unfriend me on social media. In other words: semi regular jabs to hurt me for abandoning him (in his words).\n\nI have him blocked on social media but didn’t on my email account. Well, today I got an email forwarded from him with an order receipt for tickets to a play or musical or something with the line “Looking forward to our big date Friday…” which I assumed might have been an accident because again, his new supply has the same first name as I do. I ignore it and then a few hours later I get a follow up email saying “oops, sorry. I sent it to you by mistake.”\n\nWas this a hoover attempt and if so… what’s his goal here? I am no contact and try not to look at anything regarding him though mutual friends have mentioned to me that both he and his new supply flaunt their relationship in weird ways (he brings her to places and social groups I was a part of, etc). He hasn’t accidentally sent me an email or text meant for the new supply before, but maybe it was genuinely a mistake. Still, it’s gotten in my craw and is messing with my happy No Contact!",
        "created_utc": 1675125902,
        "upvote_ratio": 1.0
    },
    {
        "title": "EMDR and Dreams",
        "author": "ImpressiveSentence26",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/10phlgu/emdr_and_dreams/",
        "text": "I was just wondering if anyone here has done EMDR, and if so, do you have vivid dreams after a session?  \n\nI'm asking this, because prior to EMDR, I rarely dreamed (or had dreams I could remember).  Now, after a session, I usually have very vivid and intricate dreams that are connected in some way to whatever issue I'm processing.",
        "created_utc": 1675121220,
        "upvote_ratio": 1.0
    },
    {
        "title": "Some of the horrible things he’d said to me",
        "author": "im_n0t_y0ur_star_x3",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/10p7tbq/some_of_the_horrible_things_hed_said_to_me/",
        "text": "[removed]",
        "created_utc": 1675098022,
        "upvote_ratio": 1.0
    },
    {
        "title": "Since Leaving",
        "author": "beherenowremember",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/10p3ful/since_leaving/",
        "text": "I decided to make a list of all of the things I am grateful for since getting out of an abusive marriage with my ex-wife/narc. \n\nI am grateful for: \n\nNot being filled with anxiety every time I leave the house\nNot being filled with dread every time I come home\nNot being subject to someone else’s unpredictable moods/behavior\nNot having to think of an explanation as to why I didn’t get back at an exact time\nNot having to decide on whether or not it’s worth it to see a friend, knowing I’d have to deal with the fighting that would always ensue and accusations \nBeing able to buy myself a meal without being attacked for not getting her and the kids food as well\nNot cleaning up after everyone else with zero thanks from anyone\nNot worrying if I’ve done enough that day to please her and earn her approval which I never had anyway\nNot having to grey rock each attempt to manipulate and emotionally harm me with verbal abuse and intimidation \nNot having to dissociate from verbal abuse and, bullying and malice \nBeing able to accept that I’ve been abused for many years\nAllowing myself adequate time to heal \nForgiving myself for allowing it and staying even when my instincts were screaming at me to run like hell\nGod for pulling me out of the water when I was drowning and didn’t even realize it\nFriends/family for helping me stay afloat and loving me when I did not feel lovable\n\nI know I have a long road ahead but I am choosing to celebrate my progress/recovery today!",
        "created_utc": 1675087861,
        "upvote_ratio": 1.0
    },
    {
        "title": "He made His own mother text me",
        "author": "ConstructionNo7665",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/10oy5w1/he_made_his_own_mother_text_me/",
        "text": "His mother is an angel... Also a good contributor to why my ex is a narcisisst, however: \n\nI am 1 month NC since our breakup. His family has always been kind and loving towards me, more than the man himself somehow. His mom had texted a week after our breakup checking in on me, and now, after a month she just wrote me basically \n\n* asking how i am (usual)\n* that my ex found some jackets of mine that he wants to drop at his mothers place so I can pick it up\n* and that he is looking for his luggage and wants me to bring it back when i come to get my clothes ( i do not have his luggage but i responded where it is)\n\nIt really pissed me off that he would use his mother for even this communication. He is so superior to everyone that he makes his mother do his dirty work. Although, because he is blocked everywhere he would not be able to reach out to me anyway. \n\nI feel like I am reading too much into this. He is trying to check me or he is simply getting rid of me.  Is this flying monkeys?\n\nWhat do you think?",
        "created_utc": 1675072426,
        "upvote_ratio": 1.0
    },
    {
        "title": "Nex keeps competing with me on social media 5 months after last contact. Why?",
        "author": "Kitty8670",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/10ol93u/nex_keeps_competing_with_me_on_social_media_5/",
        "text": "Hello. My Nex and I parted ways in Sept 2022 after he brutally discarded me. I felt used. He financially and emotionally abused me to the point that I had no option but to stay silent after discard. It was ultimately his decision to walk away rather than meet my needs. I assume he thought I would chase him like I always did (and respond to his provocative) but this time I didn’t. I had enough. \n\n Since then I have blocked him on social media but not WhatsApp in the unlikely hope he would recognise the errors of his ways and apologise oneday. I realise now that will never happen.\n\nMy Nex always felt the need to compete with me during our relationship and was envious of my lifestyle and career without seeing the hard work I put in to get there. He used this as justification for abandoning me during two miscarriages emotionally and financially ( despite being responsible for 50% of the pregnancy he said he had no moral obligation to support me  because I earn more and so I am a 100% responsible for the medical bills). He ultimately left me because he didn’t want to contribute and wanted to live it up at cocktail bars instead and asking him to be responsible and accountable was something he saw as me burdening him with. \n\nSince we have parted ways he has never directly reached out but every single time I post a status or change my profile photo he does the same as if he is trying to say I’m having a great time too. Except all I am doing is simply posting my career achievements and authentic experiences I’m not doing it do get a reaction out of him. It’s like he does not understand what he has done and how we are not the same. If I am healing or enjoying my successes it’s because I have never used anyone or left them in the lurch financially. He sees it as a completion. He has taken zero accountability for his actions. There’s been zero self reflection and  he is as usual being selfish.\n\nI just don’t understand why if he isn’t intending on reaching out directly then why does he insist on these constant games where I post something he has to try one up me 5 minutes later. Also he knows whilst I can see his statuses I haven’t clicked on them to view because I have no interest in knowing. Because it hurts to know someone doesn’t understand the devastation they have caused. It’s like he wants a reaction or to “win” at something. If he doesn’t want to do right by me or be with me just leave me alone. I know the real answer is that I should block him on WhatsApp but I don’t want to give him a reaction.\n\nTLDR: Nex constantly views my posts on WhatsApp and immediately posts something to one up me. But never directly reaches out. Why? What does he want?",
        "created_utc": 1675032686,
        "upvote_ratio": 1.0
    },
    {
        "title": "I just realised how dealing with all that trauma during childhood, robbed us of Learning ..",
        "author": "____sway",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/10oiux7/i_just_realised_how_dealing_with_all_that_trauma/",
        "text": "To children of Nparents. I mean when we are kids we were supposed to Learn. Learn how to deal with the world, people, how to handle life and mistakes etc. We knew nothing  and the point was to learn. \nInstead , even though we knew nothing, we were asked to solve the adult's problems, deal with their big emotions etc with no tools. Now just living life gives me so much anxiety because I didn't get to learn and become confident about normal stuff. Habits, discipline, even education. \nIt's okay, a bit sad, but we can heal and get over it . What are some things you feel you missed out learning ?",
        "created_utc": 1675026938,
        "upvote_ratio": 1.0
    },
    {
        "title": "how to constructively talk about something negative",
        "author": "RainyRenInCanada",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/10ob35t/how_to_constructively_talk_about_something/",
        "text": "Hey you survivors! You're all giving amazing support when it comes to our Nex, or current N person in our lives. But I got something different to ask.\nI'm in my first healthy relationship since my Nex split 6 yrs ago. I did date and had some relationships but this one is the real deal for me. \n\nAnd now im at a spot where my anxiety is taking over, and there are some things that I want to bring up to him that bothers me and I. Am. Terrified.\n\nIt's nothing serious. He is a hyper person, up st 6 am everydya and go go go , when he can't sleep he will cuddle me and tell me he loves me and kiss me gently. Sounds sweet, right? But it's 4 am lol  \n\nAlso, he likes to wake me up on the week end mornings with a little kiss and say \"lazy\" or something like that. I'm pretty sure it's meant as a  tease but it really hurts me. This morning , after he couldn't sleep from 4 am to what ever, and woke my up several times during the night, he woke me.up and said lazy, with a little kiss.  But i was cranky and didn't respond, I just rolled over in my blanket and asked what the time was. He said it's time to get up. I checked and  It was 8 am. \nThat's when I said pfff it's 8 am on a Sunday morning. A Sunday morning when I don't have my kid. It's not \"time to get up\" . Anyways I got up lol I was at his place. At least he had  coffee ready. \n\n\nBut you know. It's not a big deal right.? I'm just annoyed by something he think is cute.  \n\nThe issue is that I had sleep issues all my life. I oversleep all the time. I have hypersomnia. I need 9 hrs of sleep to function. And i discovered 3 yrs ago that I also have pretty sever sleep apnea.\n\nSince then, I sleep with my CPAP machine, it's amazing how much it helps. But I'm still very  low energy.  I found a good \"sleep routine\" and I'm stricted about it. It' doesn't take much to throw me off, and I  fall into extreme fatigue easily. \nOf course, my Nex would call me lazy and slob etc etc use it against me all the time.  \nThat's why it bothers me so much and I think that's why fight or flight is taking over. I just realised that It's a trigger. \n\n\n\nBut I'm terrified to bring it up to him. I'm scared of what his reaction will be. It's been 6 months or so, and he never gave me a reason to be scared of his reactions as of yet, so I'm pretty confident it's my past trauma.a that is causing this fear. \n\n I know I need to stand up for myself, small and big things. It is who I am, it is a problem and I refuse to hide it. He needs to see the whole me and not just the part I know he will like.  It's just so scary. \n\nAny advice?",
        "created_utc": 1675008253,
        "upvote_ratio": 1.0
    },
    {
        "title": "A good relationship after 13 years of mental and emotional abuse issues. HELP!",
        "author": "cicciacarina",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/10oa7x0/a_good_relationship_after_13_years_of_mental_and/",
        "text": "",
        "created_utc": 1675006015,
        "upvote_ratio": 1.0
    },
    {
        "title": "I see it all - the big puzzle piece finally gets put together. Light bulb moments and family history",
        "author": "ymasu",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/10nvcno/i_see_it_all_the_big_puzzle_piece_finally_gets/",
        "text": "It's scary really..now having educated myself about this topic, having flashback memories pop up from years ago I'm thinking wow that was it. All these toxic people in my life. And now realising my parents aren't even better. My last nex reminded me very strongly of my mother and I wondered why is that now realising she shares a lot of similar narc traits. I don't date to diagnose my mother as I feel she has a lot of baggage but u realise now being raised in such an environment no wonder I felt \"comfortable\" around all these toxic people it didn't bother me until I met my last nex during covid time. I literally thought he broke me. I'm growing back to myself again...I did bump in to my nex Gosh that was some experience. 3 weeks later I've been ruminating about him...as soon as my full time job begins that will.be over. I have family and friends coming over and hope I will manage another year successfully with nc. I'm starting the clock again..BREATHING",
        "created_utc": 1674955590,
        "upvote_ratio": 1.0
    },
    {
        "title": "What are the stages of grief after an abusive relationship?",
        "author": "ConstructionNo7665",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/10npvj5/what_are_the_stages_of_grief_after_an_abusive/",
        "text": "We all know the 5 stages of grief that is normally after the loss of a person, a thing, or anything important to us.",
        "created_utc": 1674940776,
        "upvote_ratio": 1.0
    },
    {
        "title": "I’m trying to leave my narcissistic /possibly psychopathic landlord tommorow",
        "author": "corey124555",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/10nnsyz/im_trying_to_leave_my_narcissistic_possibly/",
        "text": "He has been pushing my boundaries by showing up to the door, first he came to the door with his belt undone, next his belt and fly.  i believe he is a “flasher” and i have also searched online and found that he has a criminal record ( for other things, like dealing drugs, the search didnt show complete results)\n\nIm moving out tommorow but first i have to visit his door to get legal proof that hes recieved my letter of notice for moving and to get a reciept. A friend will be coming with me. I am very nervous\n\n(police cant do much unless he actually shows his man parts) \n\nany words of encouragement or ideas how to mentally handle this or behave towards him are appreciated",
        "created_utc": 1674935467,
        "upvote_ratio": 1.0
    },
    {
        "title": "I always suppress how I feel because of past gaslighting. Advice?",
        "author": "anonymousalligator25",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/10nmtce/i_always_suppress_how_i_feel_because_of_past/",
        "text": "So before dealing with many partners/male friends who were narcissistic, I used to be very communicative about my feelings. However, after being told I was “overreacting” or “crazy” for calmly expressing how I felt after someone treated me badly (which took a lot of courage) I’m struggling to be open about my feelings.\n\nCurrently my life is narcissist-free. I am in an extremely healthy and loving relationship. But when something happens that unintentionally upsets me, I shut down and pull away. Often, I will repress it and then when I get home ask to speak on the phone and divulge how I feel. It’s really hard for me to express my feelings face-to-face. Or if I’m angry at a non-relationship situation, I judge myself for being rationally angry and try to suppress it.\n\nI want to see my therapist again but I’m having insurance issues right now. For now, any support or advice or similar stories would be helpful!",
        "created_utc": 1674932963,
        "upvote_ratio": 1.0
    },
    {
        "title": "Sex and the cluster B , and the mistakes we make",
        "author": "Free-Force-3076",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/10nlorq/sex_and_the_cluster_b_and_the_mistakes_we_make/",
        "text": "Today , I want to talk to yall about sex and the cluster B .My experiences and what I have read. First thing , is that I want to say is trigger warning, what I am going to say is about psychological aspects of sleeping with your cluster B. That is it. \n\nFirst thing, Triangulation with another person is about control. Nothing else. If that former partner was so great , why did they leave and have you noticed that you are only the problem when you go off the cluster Bs script and wishes. \n\nThe if I was a little bit blank myth , they would come back. First of all, I get it you might want to think about therapy that is not a diss, you should be go enough as you are, Also a little trick , If your cluster B or CB for. short, is like I wish you were a little bit, This is about control. Lets say there were like I wish you were a red head, you become a red head , If you think that is going to make them permeantly happy , they will change their criteria a little farther away, they do that for two reasons, controlling, and possible cheating. Or both.\n\nSleeping with them one last time. CBs in sex do not mean the same thing that it does for you . Sex for a CB is about several things, there pleasure , and control . You do what I want you get sex. Sleeping with a CB thinking that it will fix the relationship is just wrong as soon as they get what they want, they either devalue you or ghost you. REMEMBER , sex with a CB is about their enjoyment or control. Its NEVER about connecting with you \n\nBecareful , A lot of CBs are like hey , I got a new partner want to join in., DO not . Here is why, Open relationships are a myth , you have to have clear rules, clear communication and clear boundaries for them to actually work. These are not in CB mental warehouse, And truthfully , when they cross another boundary, they have a built in excuse, Do not alter your sexual identity just to please them, it will not last, It is setting yourself up for abuse.\n\n, The I wish you were more like the Instagram hoes myth. Most people in porn, be it only fans, pornography are in a business, And if they engage with your partner it is transactional. Its not love, My Ex sent me a message from Only fans worker, Its was meant to imply this is the type that he is into. If the person changes their preference like we change our underwear it is about control. It was degrading at first, But than I am like ,I was okay 8 months in , And news flash, As as long as the card clears the sex worker will tell you what you want to hear,. \n\nAnd finally porn . This is not a judgement so do not come at me. Porn for a cluster B, is about getting off safely, meaning they do not have to please anyone other than themselves, its not about love. ITs about control . If they are paying for it , they can control it. Also beware , of porn addictions because \n\nPorn is about them not wanting to face their issues be it\n\nlack of connection with current partner. \n\ncontrol \n\nor in some cases some NOT ALL , have issues with their sexual orientation that they want to suppress so they will watch extra degrading straight porn",
        "created_utc": 1674930095,
        "upvote_ratio": 1.0
    },
    {
        "title": "is Narcissists paranoid of their ex partners about the truth?",
        "author": "lovelybirdlady",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/10nl3wz/is_narcissists_paranoid_of_their_ex_partners/",
        "text": "In end of Januray 2021, my ex fiance kicked me out unexpectedly, and he packed my things overnight while I was asleep then woke me up in rude way (turned the light on and kicked the mattress hard. He coerced me to sign my life away on the prenuptial agreement in October 2020 to December 2020, to make sure I get nothing even get my two pet birds (two boys) that I was primary caregiver to them. I took my female girl with me, it was soooo heartbreaking to see my girl to say goodbye to the two boys. She passed away in May 2022 due to the grief loss from the boys. He never have been taking care of them and loved to use me as a maid for 5 years. I took care of everything while he was working on the computer and always loved to be playing on the computer, sat on his lazy butt all day and evening. He didn't really spend a lot of time with me. Also took advantage of my disability for many years included the taxes, as I am profoundly Deaf I decided to have no contact with him, but he kept trying to harass me through texts and emails after separation. Even tried to threaten me during Christmas 2021. Had to take screenshots to prove to my lawyer that my nex who is the bully and wanted to be controlling. So my lawyer and I decided to add few sentences in the separation agreement such as he shall not contact their ex spouse and her family via vice versa. Fast forward to November 2022, I was looking up on my nexs schedule that he forget to remove my access that we used to share for few years. Then I found out that my good friend was planning to go on the date with my nex and my heart told me to tell her. She didn't realize that was my nex who is the abuser to me such as mentally, emotionally, physically, spiritually, and the list goes on. She thanked me and my nex found out that was me who told her plus the woman who he have been seeing for a year and half. I even gave that woman warning to not to be romantically involved with him but she is blinded that he was cheating and playing games on her while he was hooking up with different women. She took my nexs words that I was the crazy one. He even told her that I broke the separation agreement but I didn't because the sentence is he shall not contact their ex spouse and her family via vice versa. Immediate family is the formal word in the separation agreement. It didn't say about friends or relationships or stepsisters. I did talk to my lawyer and she said yes I can contact the stepsister and others who isn't involved with him because nex barely talks to them. He always talk badly about them. He got so angry and decided to find the way to get through my new boyfriend that I have been dating for almost 9 months. He was flabbergasted and played the victim in those messages even tried to put all of the blame on me. Typically he twisted the stories about me, how I \"ruined\" his life because he wanted to be very controlling and wouldn't want to treat me like a real person. My boyfriend knew that wasn't true and can see how I am still fighting with the trauma and PTSD included my emotional wounds that caused from my nex. It is funny how he assumed that I did use my phone to record him but I didn't as my friend was chatting with me. You might tell that my nex was so paranoid because he doesn't want to show who he really is. He twisted all of the words in the texts. That shows he is very controlling and wants to get sympathy from everyone especially someone who I know. He tried to put the restraint order on me but I knew that wasn't successful with the judicial justice of peace. The queens bench didn't send the formal papers to me. How did I find out? I was browsing through the queens bench online and typed my nexs name, and saw my name there. But I was really happy to see how the plan got backfired in front of him. I didn't even try to harass or try to ruin his life. Heard that he is getting so paranoid as the truth kept coming out and I am letting Karma to do the job on him. I am still waiting patiently for my boys to come back to me, its been two years since I saw them. \n\nIs that true narcissist will get paranoid and try to cover their tracks every time they meet new supply or new people?",
        "created_utc": 1674928659,
        "upvote_ratio": 1.0
    },
    {
        "title": "Did I date a narcissist?",
        "author": "luislara2011",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/10ng60i/did_i_date_a_narcissist/",
        "text": "Things started off great, we went on dates, he stayed over a lot, we talked everyday, he complimented me and sent me texts about how he used to be so sad from past relationships and how ours was going great and that his friends noticed he was happy.\n\nWe started hanging out more casually, the dates stopped after about 2 months.\n\nHe would come over after work and constantly talk about his job and his experience at work and never ask about my day or anything about me. He started drinking with me and having these crying fits, he would only slightly open up to me about his past relationships and how hurt he was. I had to take care of him while he was in this state and it started to become burdensome that he was coming over to drink and cry about (what I assumed was his ex, because he would never tell me why he was crying).\n\nThen the insults started. He commented always about how my clothes were too small, I didn’t know how to manage money, I was dirty (my apt is always spotless).\n\nHe became more angry as time progressed, we got into an argument one night (I forgot about what) and he smashed a plate on my floor one night of food I cooked for him. I grew up watching domestic violence, and this absolutely terrified me.\n\nHe had a god complex (even other people that met him only once, like my friends, told me this). He was never wrong about anything, he was the best at his job in the world and would constantly brag about compliments he got and how if anyone critiqued him, they were “this and that”. No one could critique him, ever. He could not handle any criticism from anyone, anyone that critiqued him was beneath him and he would absolutely berate them.\n\nHe would say and do mean things to me, I would address them and he was always “right”, he always had a defense ready. He told me I was too emotional anytime I told him about things he said or did that were hurtful to me.\n\nHe was emotionally distant and cold, we cuddled once when we first met and then never again. I told him that I needed physical intimacy and he said I was like a “leech” and again, too emotional and that he just wasn’t into that. I tried to ask for compromise and he would not. He never touched me or said nice things to me. Always “joking” about things I did wrong or shortcomings.\n\nHe never met any of my needs and we simply had “different love languages”, but he would always tell me “I think we are compatible” after I would tell him that maybe we weren’t.\n\nHe refused to introduce me to his friends, roommates (never even invited me to his place) or family, even after about 4 months.\n\nHe would purchase groceries and wine and other things for me, willingly, and then tell me about how he did “this and that” for me (I never asked, I had my own money but he insisted always on paying) and that I never did anything for him. Rubbed his feet and gave him back massages almost daily after he would come to my apt from work, complimented him often, offered to pay for dates and such.\n\nI would ask to go on dates and he told me I only wanted to go out to be seen with him.\n\nIdk it was just aweful and I ended up resenting him but I was scared to break up with him. I started cheating. He caught me and didn’t break up with me but instead would tell me how aweful and disgusting of a person I was. I told him it was because I felt unloved and empty, he would never accept responsibility for anything, it wa stalwarts 100% my fault. Even when I told him how he hurt me, he would twist it into it being an issue with me. Never once got an apology from him.\n\nI finally broke up with him and he started stalking me on hookup apps and messaging me nasty things and telling me he wanted closure and to meet him to talk. I went and he just berated me and so I left. He kept stalking me online and messaging me on fake profiles, told me to kill myself, and indicated he wanted to kill himself.\n\nI almost had to get a PPO on him, and even reached out to one of his few friends to tell her I was concerned about him wanting to harm himself and she sided with him and blocked me.\n\nIs this typical of a narcissist? I am a very loving and giving person, but I also suffer from codependency, do narcissist prey on that?\n\nI felt absolutely liberated when I broke up with him. But I’m left feeling like an awful terrible person for cheating. He drilled it into my head that I was a vile disgusting piece of shit (he said that many times). I have never cheated, and I should have broken up with him, but I was scared of how he would react, and I felt so lonely and unloved in the relationship.\n\nI never once thought about the relationship after he finally stopped reaching out to me, but I also know that I repress trauma and recently had a dream about missing him. Maybe I’m traumatized?",
        "created_utc": 1674915638,
        "upvote_ratio": 1.0
    },
    {
        "title": "60 more days before my narcissists landlords are out of my life for good, any tips on how to deal with any incidents that arise?",
        "author": "Ghertquxx",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/10n7tun/60_more_days_before_my_narcissists_landlords_are/",
        "text": "My plan is to call police if the landlords, or other tenants even fart near me.",
        "created_utc": 1674885861,
        "upvote_ratio": 1.0
    },
    {
        "title": "It's taken me idk, 5-10 years to accept mom has uNPD and that I can't change her or \"fix\" things",
        "author": "SpiritualCyberpunk",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/10n58js/its_taken_me_idk_510_years_to_accept_mom_has_unpd/",
        "text": "The more you start to think about how she makes you feel, and what she does. The more it becomes evident. \n\nLike, I will be on top of the world one morning, I meet her, start talking to her, clean her table for her (she has a habit of not doing this) and I feel like my brain is being invaded meanwhile. After this I hate myself for weeks, and it's so strange because nothing happened except she was doing some kind of covert narc manipulation it seems. It's not normal to just randomly start hating yourself after talking to people. \n\nShe subtly mentioned things that I feel insecure about, or that would make my life seem like a failure. She may have been covert for decades, but I am starting to see what moves she makes.",
        "created_utc": 1674877514,
        "upvote_ratio": 1.0
    },
    {
        "title": "Things have become more interesting",
        "author": "Spicepumpkin66",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/10n17ju/things_have_become_more_interesting/",
        "text": "Say I have deleted and removed the narc’s IG account, and I thought that was it. And I just remembered he has another account(using the same id name basically) followed the account he used to contact me.\n\nFasted forward to today, when I was checking the likes of his open account friend(bad habit I’ll blame to the insecurity after been in a relationship with him), I noticed another account of him which has even more followers than all the another two accounts combined, and he was using the photo of us leaning back to back(but you can’t recognise any faces).\n\nJesus that’s so weird, I don’t think he liked me that much to use that photo as a sign of affection, if so why not use in the account he added me? He never exposed me to any of his social media platforms at all. And he has been very stingy and mean to me to a degree that was so disrespectful and hurting every minute (he said that photo was really nice taken tho, that’s the only reason I can guess).\n\nAnd man, why the hell can a guy run so many accounts at the same time, he really knows well about time and energy management.\n\nI must control myself not to dig into it, I know I can’t because they are private accounts, but this guy has been living triple life, how impressive!",
        "created_utc": 1674866207,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is your narc a seemingly successful person?",
        "author": "Spicepumpkin66",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/10mzvme/is_your_narc_a_seemingly_successful_person/",
        "text": "Mine has been well educated and is good at going through debates/public speaking things(we are still uni students), and he’s quite skillful to leave a good impression with people so it’s easy for him to stand out in job interviews. It feels like they are going to have a place in society someday.\n\nBut those are just another side of them being super dominant and toxic in relationships which I don’t deny them, I am just curious is your narc a seemingly successful ppl as well?",
        "created_utc": 1674862888,
        "upvote_ratio": 1.0
    },
    {
        "title": "We're fucked",
        "author": "hornygreek1234",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/10mu8hb/were_fucked/",
        "text": "https://www.reddit.com/r/ThatsInsane/comments/wm3nes/onlyfans_model_attacks_boyfriend_two_months/?utm_source=share&amp;utm_medium=android_app&amp;utm_name=androidcss&amp;utm_term=1&amp;utm_content=share_button",
        "created_utc": 1674849127,
        "upvote_ratio": 1.0
    },
    {
        "title": "I can't get over a trigger",
        "author": "Ok-Particular2010",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/10mon2o/i_cant_get_over_a_trigger/",
        "text": "Now I'm just getting really p***** off at myself. I can't get myself to go downstairs and sit at the same computer to work for myself or my son because that's where I used to manage the company and books of my narcissist ex to be husband.  I really need to function. I can function in every other situation except for this one.",
        "created_utc": 1674835902,
        "upvote_ratio": 1.0
    },
    {
        "title": "Did your body send any signals?",
        "author": "Spicepumpkin66",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/10mlcxu/did_your_body_send_any_signals/",
        "text": "When with my narc, I was in a poorer health condition then ever before, and some of the problems are just not imaginable. \n\nI literally vomited after he gave me a sugar bomb smoothie, and I caught a terrible flu which then triggered my asthma after spending our holidays together(He caught a high fever after the first days and I began to feel bad then as we were sharing a bed together, so I was guessing he passed me this flu). \n\nWhen I look back, i assume these are the signals that my body is warning me that I should get away from this guy. I was physically, emotionally and spiritually damaged spending time with him.\n\nJust wanna hear your story if you feel the same.",
        "created_utc": 1674827624,
        "upvote_ratio": 1.0
    },
    {
        "title": "if you're reading this",
        "author": "TraditionalFigure26",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/10mftxh/if_youre_reading_this/",
        "text": "My recent ex narc is texting me things that are scaring me. \"This is the night you shouldn't have ignored me\" etc. I live in a rural area, in what was our fanily home, i only finally left him 2 weeks ago. The police take like 45 mins to arrive on a good day, worst case scenario. I'm alone here with my three kids. I don't know if this is a suicidal type threat or a threat to our safety. What should I do?",
        "created_utc": 1674807390,
        "upvote_ratio": 1.0
    },
    {
        "title": "I'm still so angry.",
        "author": "considerthepangolin",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/10mfph9/im_still_so_angry/",
        "text": "It's been a year since I went NC with a friend I'd had for ten years, and I still get moments of intense frustration and anger that leave me scrolling their social media, looking for... *something.* \n\nProof that they're a bad person? Proof of them talking shit on me? I don't know. I can't see much because I blocked them and they blocked me, and I know that's for the best, and I shouldn't be looking at all.\n\nI want to leave them in the past and stop dragging around what happened. But I'm so angry that I let them treat me like they did for so many years. It took a lot of therapy to finally realise that I deserved more, and now looking back at it it all seems so blatant. \n\nAnd then sometimes I doubt that things were that bad and wonder if I'm exaggerating their actions to make myself feel better about my decision to cut contact.\n\nI know these are all part of processing it, and that the best cure is to move on with your life and enjoy it and treasure the healthy, loving relationships that you have now. And I am doing that. Without all the toxicity holding me down, I really am thriving. \n\nBut I'm still angry, and it still hurts, and I still wish they'd been able to love me.",
        "created_utc": 1674806885,
        "upvote_ratio": 1.0
    },
    {
        "title": "Their arrogance, smugness and social media displays make me so infuriated",
        "author": "TraditionUnable9770",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/10m931z/their_arrogance_smugness_and_social_media/",
        "text": "I am NO CONTACT and no longer look but after the cheating/break up i can't believe how cruel they were, how smug they were. I can't get that image of their smugness out of my head. THen they started boasting on social media. It just unfurates me and makes me so angry.  I hope karma get them. :(",
        "created_utc": 1674784725,
        "upvote_ratio": 1.0
    },
    {
        "title": "Advice please (+ long post): once out of the fog, I realized many of my 'friends' were horrible users.",
        "author": "pnas-acon",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/10m81y0/advice_please_long_post_once_out_of_the_fog_i/",
        "text": "Trigger warning: if you don't like people with money or don't like to talk about money or if you think money is evil, then this post is not for you. Please be kind, I am new to the 'what next' from narc abuse. I am being honest here, an open book, and I have been staring at my screen for an hour debating whether I should post this or not, but going with my gut, I am going to post it anyway. I am looking for sincere advice for how to find a chosen family. If you judge me negatively because you have some negative view about people with money, then that's on you.\n\n\\-----\n\nAfter going NC with family and accepting reality for what it is, it saddens me that I let so much BS into my life: bad friends, gossip girls, jealous and competitive colleagues, and overall most people just wanted a piece of my time to look good, to get some kind of money whether that be to be employed by me, to have a business deal or possibility of partnership with me, or simply to just take selfies while riding in my car or standing near it, or take any opportunity to attend events I host in my neighbourhood or places of business I find myself in.\n\nI honestly thought I was being the bigger person because it was clear to me I have more than those I hung out with because they seemed like real people. But it turns out they were only in my life for some kind of sick and twisted version of financial abuse or, I'm going to coin it \"clout abuse\" so they feel special. Once I started to hold boundaries (i.e. asking them to reciprocate the time and effort as I put in) people just ignored me or didn't bother to acknowledging me. Sometimes they blatantly ghosted me for either accomplishing something \"again\" or \"more of\" in their eyes or when I am going through a bad patch in my life.\n\nIt really didn't dawn on me the insidiousness of these people until I accepted my family of origin for who they are. And interestingly, money was a way my mother controlled the family. She and her side of the family began stealing millions from my enabling dad even before I was born. Also, I was always taught, and so did our Filipino culture, that those with money is responsible for those who don't have money. So in a way, the culture perpetuated that money == control and money == you deserve love and respect *but only* if you sacrifice it unconditionally to those who you want love and attention from. And on the flip-side, ingratiate yourselves so deep to this wealthy person, even if seemingly, to get any kind of recognition, including faking yourself, being a yes person when you mean no, and becoming severely codependent, all in the name of a promissory monetary award.\n\nTo be honest, I am embarrassed to say that, until a few years ago, I didn't even know that my net worth was a lot in comparison to the general public. My accountant was the one who shed light on this. And to be frank, it never dawned on me that I'm someone better than anyone because of my accumulated wealth, because storing money in the bank to me is just like storing food in my fridge. It is something that I made on my own, put a lot of hard work into, and I am just thankful to have some in the bank. I am no multi-millionaire by any means but I assumed everyone had the same healthy financial habits I did because, just like everyone else, I too started my career with a modest $30k/yr job.\n\n... But to allow myself to be abused like that by so-called 'friends' under the name of \"'being the better person' because of \"those friends didn't have as much as me\" is nothing but one big gaslight from, not only my culture, but also from my family of origin, where there is distinct and disparate financial levels of security and financial autonomy amongst siblings and extended family members. I got the same higher education as my siblings, I didn't go to a better school than any of them, and I didn't get any help in funding my own my businesses, not even the bank. I was legitimately taking calculated risks and being responsible with my finances at the same time.\n\nI am letting go of the idea that my culture and family make me somehow responsible for the less fortunate, for their own feelings of insecurity, for guilting me into helping them when I have the right to say no, and on some occasions, there was no clear evidence they even needed the financial help, or more recently before final NC, making me feel guilty and ashamed for being financially independent or to refuse to help anyone at all. It's a damned if you do help financially and damned if you don't help financially.\n\nI asked myself earlier, what did I sacrifice in the last 2 decades of my life to achieve such financial independence? For what exactly? In hopes to get my mother's love and approval i.e. money == I could finally be loved by my mother, she could finally accept me, she can finally be authentically proud of me...but at what cost? At the cost of selling myself out to a mom that never actually existed, a mother of my fantasy, a phantom parent.\n\nShe treated me like my father, a walking ATM. She was thankless, unacknowledging and always wanted more and more and more. Every gift and request became bigger and bigger. Her last request was to take her on a Safari, buy her a condo to retire in and, worst, to lie to my own half-siblings for her in hopes that they never question where their inheritance went after our shared father died.\n\nAnyway...I believe I attracted people in my life who are like my mother. Ladder-climbing, gold-digging, and clout-chasing people. I hope I find friends who want me for me and not just looking for a chance to feel special because they are acquainted with someone like me. I also don't really like high society people because it's just another narcissistic cult. I am also fearful of hanging out with everyday people because I've been judged for driving the car I drive, the way I speak (for e.g. too formal), or the choices I make in life because they're almost always jealous of me.\n\nI honestly don't know where to find people who are as financially independent, as educated, as business-ambitious, yet at the same time as modest and not pretentious (other than the car I drive or neighborhood I live in, you couldn't tell me apart from everyday people by the way I dress, which is respectable but never with designer logos), as understanding of my choices in life, has a love for life for the sake of loving life with all its miracles *and* disasters, who is LGBTQ+ safe, who is child-free safe, who is POC-safe, and has a deep respect for neurology, psychology, and becoming ones' true self.\n\nAre there even people like me that exist? Any advice how I can find and forge at least one friendship with similar to me, please? Are there people who will love me for me and not what I have or do? :(",
        "created_utc": 1674781645,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does your narcissist live a good life now after discarding you?",
        "author": "sittinonnatoilet",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/10m713h/does_your_narcissist_live_a_good_life_now_after/",
        "text": "I'm healing. But slowly. It's been over 3 years since my former close friend did severe damage to my life. I have healed significantly in that time. But I still get stricken by flashbacks occasionally and can't break out of it. It was so painful and I still carry trauma. \nI've been NC for almost 3 years now. 2+ for all of my former friends who probably still associate with him. \nI wonder if he's happy or not. I wish I could know. Does anyone know if their narcissist did well without you?",
        "created_utc": 1674778733,
        "upvote_ratio": 1.0
    },
    {
        "title": "Here to help",
        "author": "tonertony84",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/10m4o4b/here_to_help/",
        "text": "Hey all! A good friend of mine and I are now hosting a podcast speaking out about narcissism, it’s affects on family’s and those around you, asks here to support you as a community. \n\nHer father was a unhealthy narcissistic individual, and my ex wife was a narcissistic individual as well. \n\nHere is a link of the podcast we are hosting. We are happy to collect your questions and try to answer them to the best of our abilities. \n\nContinue to reach out to each other, to me and my friend, and let us heal ourselves individually and collectively. \n\n[Hair of The Dog: a family’s memoir dealing with narcissism](https://linktr.ee/hodpodcast?fbclid=PAAaYEqgCU5KIjSGjFTOow7yw4OUgGNWYgQymf0Bvf1YQ1xqJr7UvX1R8oLXo)",
        "created_utc": 1674772468,
        "upvote_ratio": 1.0
    },
    {
        "title": "Did yours do this? Weird smile and making me feel guilty",
        "author": "LilSeed92",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/10m4iaj/did_yours_do_this_weird_smile_and_making_me_feel/",
        "text": "He would want us to get pictures together and he shared our pictures a lot but it wasn't until after that I noticed even in those moments he was all \"let's get a picture\", he would look sort of angry in his smile ? \n\nIt was like \"I don't want to be in this picture\" , other must have thought he looked like he was maybe forced into the pictures but in reality HE was the one asking for them.\n\nIn those moments I thought we were both happy but he had what I can only describe now as contempt.\n\nAlso times when he would go silent and I'd ask what was wrong but he would say things like \"just feeling quiet \" then sort of walk around and look at me now and again, then stay silent   sort of made me feel like I had done something wrong but he always said \"I'm fine\".",
        "created_utc": 1674772078,
        "upvote_ratio": 1.0
    },
    {
        "title": "breaking up with my brief narcissist boyfriend",
        "author": "hotcowz",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/10m1h7j/breaking_up_with_my_brief_narcissist_boyfriend/",
        "text": "it lasted only a month, but my gut caught on so fast to what you were doing to me. \n\ni'm still processing what happened between you and i, because i'd never been around someone that made me laugh as much as you did.\n\ni sincerely thought we'd go the extra mile, b/c you and i were like best friends before we dated.\n\nbut then it started happening. the independent girl you were first attracted to no longer felt independent. \n\nshe started doubting her concerns within the relationship b/c you kept telling her that she was 'overthinking' and to 'just be positive'\n\ni started feeling so alone. who was i in the relationship if i felt so alone? what happened to my 'no bs' attitude? that's what attracted you about me, but you were slowly erasing that part of me.\n\nnow i'm left here without my closest friend. and it sucks. i hope you sincerely get better. you have such a good heart but your history and trauma got you so fucked up.\n\ni hope you follow through on those therapy appointments. goddamn it, kurt.",
        "created_utc": 1674764580,
        "upvote_ratio": 1.0
    },
    {
        "title": "\"Why have you stopped contacting me? I'm your mother\"",
        "author": "TraumaPerformer",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/10m101b/why_have_you_stopped_contacting_me_im_your_mother/",
        "text": "Translation: As your mother, I am entitled to your presence. How dare you prevent this!",
        "created_utc": 1674763371,
        "upvote_ratio": 1.0
    },
    {
        "title": "Narcissistic Parents?",
        "author": "Primary_Somewhere_76",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/10m0876/narcissistic_parents/",
        "text": "I’ll try to keep this one short but it’ll probably be long. But I have had years and years of trauma from my parents. I am 36 now, with one daughter who is 8. I’m in a great marriage and have boundaries with my dad and step mom. \n\nI was 12. My parents divorced. I had a really hard time processing that at that age. I was involved in their divorce and sent to talk to many different professionals and asked questions. Then…I had to do the back and forth thing one week at my dads…one week at my moms…\n\nMy mother worked all the time. She was never home because she was busting her ass trying to make a living. My dad has money and remarried right away. Still processing the divorce I had a hard time with him getting married. This situation was the Cinderella story. Wicked step mother with two girls of her own my age. I was instantly casted out. My grades started dropping and instead of being supported and talked to. It was your grounded. The cold shoulder. One time my dad said “if your photo was in the dictionary it would be under the word stupid”. He bought the two step sisters a Lexus and Acura. I was forced to take the bus. My step mom would watch me walk down the road to the bus stop. I was never really bad but I was starting to become angry and confused. I had a really good relationship with my dad and when he remarried he completely changed. So I used that void of “not having my dad” anymore to replace that with boyfriends. Some good and some bad. I was followed by my step mom on days to be with my moms house. She would yell obscenities through her window and I would run into my moms house and hide. Step mom convinced my dad to send me away to one of those schools for troubled kids halfway across the country. I was out on a plane without knowing where I was going and lived in this random place for three months…force fed pills…(if you’ve seen the Paris Hilton documentary and what happened to her that’s basically what happened to me) so after three months I come back home. I have the door taken off my wall…”privacy is a privilege”. Meanwhile my step sisters have their own home line upstairs and phones in their room. I was not allowed to leave my house on my birthdays. I was accused of taking my step sisters jeans…and I told them no I didn’t take her jeans. I was grounded until I confessed. 9 months went by….and a friend of hers dropped the jeans off and said she left them at her house. I was still grounded after that. I was talked bad about…my step mom called her mom friends and one daughter of the mom said “your step mom talks so much shit about you”. I was belittled. I had no support. The only thing that was bad that I did was try weed and have sex for the first time at 16. My dad decides not to pay for my college. He pays for my other step sisters to go to university of Texas. They pay for their apartment etc etc etc. Fast forward to 21. I was in a physically abusive relationship. I called them and said he’s beating me I need help…they said “you’re probably antagonizing him.” I decided to join the Marine Corps to get the hell out of my town. My step mom called everyone in the family and said “we don’t think she can do it”. Well I did. I served 5 years. I used my GI Bill and got my bachelors degree…on my own. However, During those 5 years I had bad ptsd…not to mention a rape that my step mom decided to tell her family about. I finally met my husband now back in 2013. My step mom calls him right after we got married to tell him “oh don’t you know she’s bipolar?” Out of nowhere. No I am not bipolar. Luckily he’s already aware of her toxic behavior and brushes her off. No reason for her to try to say that after I am married. I find out I’m pregnant. I fly in and visit everyone. Step mom starts a fight with me and makes me cry and then instead of being like “oh it’s horomones” she walked by and just glared at me across the room while I was crying. Never apologized. My dad says I can’t have a relationship with him unless it’s both of them “it’s a package deal”. \n\nI could go on and on. But year after year…on birthdays…I give them gifts. I say happy birthday. I still care and show my love to them. But I only feel like the only reason she ever calls is to use me to get information about my other siblings who were out of the picture when they got married. Like she calls only to gossip. But if I don’t, I’m shunned so to speak. \n\nPoint is, I feel like now at 36…no matter how much therapy I’ve had because of them it will never go away. I randomly will have like a scenario come up in my head if something bad she’s said or done. Like nothing was ever good enough. The random thoughts at how my step mother treated me are burned into my brain. She never once apologized. She says things like you’re too sensitive if I try to have an adult conversation about how their decisions impacted me as an adult. (My dad has since apologized). She purposely cut me out of their wedding photo and showed my daughter. “Where is my mommy?” My daughter asked. And she said oh she’s right there. And points to someone else. I said you took me out of the photo?! And she never said anything. I still to this day don’t know what I ever did to be treated this way. By my dad or step mom. I had a happy childhood before he got divorced and remarried. I’ve been reading a lot on narcissistic traits of parents and came to this forum for some guidance and insight on if any of this sound like traits of one. \n\nCurrent situation: I am now a stay at home mom. I love my life. My husband is in law enforcement and we have a great circle of friends. Bought a big beautiful house. Drive an Infiniti I bought with my own money..which is paid off. My daughter is happy and healthy. Life is good. I busted my ass after my degree and worked in oil and gas for years. I decided to be at home and not travel. Basically be the mom I never really had to my girl and be present with her. If she’s upset, I listen to her and ask her how it makes her feel or give her hugs. Play games with her. Get off electronics just to spend quality time. I’m trying to be the best I can be for her because i didn’t have that kind of support. I will not let my past get to me or dent the life I have now. I look at what I have and think “I did this”. Not…”my dad bought me my degree or car”. I appreciate what I have more because of the hard times and the struggle I went through to be here today. The life I built on my own and then with my supportive husband. I do have days like I said where I replay stuff in my head and it’s so traumatic what they did. My dad has apologized, step mom hasn’t. Does any of this sound like narcissistic parents?",
        "created_utc": 1674761437,
        "upvote_ratio": 1.0
    },
    {
        "title": "One of my favorite heavy metal bands just released a video about narcissism. Please enjoy Cyborg Octopus - \"The Projector\". Lyrics and video in text.",
        "author": "JeFX",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/10lkm59/one_of_my_favorite_heavy_metal_bands_just/",
        "text": "https://www.youtube.com/watch?v=x03No5xrazo\n\nBehold the projector\n\nReplaying wretched scenes within your mind\n\nResentment is rehearsed to unfortunate perfection\n\nYearning for script correction, Rapture is lost in time\n\n\nBehold the projector\n\nSpin those rusty reels until you find\n\nYour favorite lines of misery, edit for continuity\n\nThis is the pain of your design\n\n\n\nProject the past unto me\n\nDescend to bitter familiarity\n\nGratitude can be so challenging\n\nWhen despair of the past becomes comforting\n\nNo longer the man you once knew\n\nType casted into the role that you're used to\n\nAct your way out of responsibility\n\nProject your pain unto me\n\n\n\nViolent outbursts you forgot, I have not\n\nCarved in my memories your insecurities forced upon me\n\nLet your petulance flow from my temples\n\nWring my neck with abusive indulgence\n\n\nAs I behold the projector, films of wrath and anger fill my mind\n\nBut I direct which part I play and I will learn from your mistakes\n\nLying to family and friends, this cycle ends\n\nRefusing to make amends, this cycle ends\n\nCoping within delusion, this cycle ends\n\nThe stage is your only redemption, this cycle ends\n\n\nMonologues prepared with resentment\n\nFalse apologies meant for excellence\n\nTake a bow it must be quite the challenge\n\nPlaying both the victim and the villain\n\nWhatever it takes to save face\n\nAs if you weren't full of hate in the first place\n\nAct your way out of responsibility\n\nProject your pain unto me\n\n\nProject your weakness with vengeance and regret protecting the depths of your scars\n\nProtect the coarseness while building your fortress to hide from the coward you are\n\n\nToo vain to see the cruelty that you boast\n\n\nIt twists and contorts you into the monster you hate the most\n\nProject, abuse, deny, doomed to deceit\n\nReject accuse lie, choose to repeat\n\n\nChoosing to project\n\nAbuse\n\nDeny\n\nChoosing to repeat\n\nReject\n\nAccuse\n\nChoose\n\nThe films of your history, are not doomed to be your destiny\nBut you must choose\n\nBehold the projector",
        "created_utc": 1674711366,
        "upvote_ratio": 1.0
    },
    {
        "title": "After leaving, I can’t even tell if what I’m getting upset about is even a valid reason. I feel like I’m overreacting but I can’t even tell",
        "author": "ghooosst",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/10ljuj5/after_leaving_i_cant_even_tell_if_what_im_getting/",
        "text": "Like with this new guy I’m dating, I start crying over something I shouldn’t cry about with and instead should be understanding for",
        "created_utc": 1674708757,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does anyone have an article or website to show to a partner that does NOT have NPD parents what we go through trying to go NC from our narc parents?",
        "author": "terminallypreppy",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/10liabq/does_anyone_have_an_article_or_website_to_show_to/",
        "text": "I feel i try to explain the mindfuckery and difficulty leaving narc parents, but unless you have been brainwashed ans systematically abused your whole life, you cant understand from the outside what it is really like, how we keep hoping, trying, and find it so hard to go NC. \n\n&amp;#x200B;\n\nHas anyone got a helpful article / post / website they can suggest to help explain to them what we go through?  \n\n\nThanks in advance",
        "created_utc": 1674703778,
        "upvote_ratio": 1.0
    },
    {
        "title": "Vunerable Narcissist Mother in Law?",
        "author": "rayraybeezy",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/10lh80v/vunerable_narcissist_mother_in_law/",
        "text": "I am having a difficult time with my mother in law and haven't been able to figure out their personality. My husband has had this issue his whole life and has seemingly dealt with it the best way they could. In the words of my husband, he has already mourned the death of having a real relationship with his mother. Over the course of twelve years, I've noticed very strange behavior from her that I haven't been able to pin point. A personality dysfunction. She constantly lies about the weirdest things to each of his siblings about the other and things they have done or said about the other. The most recent incident happened at my sister in laws bridal shower. My husband's sister came up to me(in a concerned but loving way), asking me if I \"embarrassed\" them. Not really knowing what she was talking about I asked her what she was saying. I was truly taken back. She said that her mother mentioned that I was embarrassed by her because of her stressing for the bridal shower.\" Confusing statement? Ya, I didn't understand either. Not only did this statement not make sense, I had no idea why my mother in law would lie about something so weird. I let her know that was simply not true and don't know why she would say that. I saw it on her face that she believed me and wasn't really suprised. It was actually really sad. There were many times when I feel like the siblings were triangulated and honestly, at this point where do I draw the line? I grew up with strong relationships with my siblings and I haven't dealt with this before. Obviously I want my husband to be able to have a relationship with his sister, but it seems like the MIL has gotten everyone on that side to feel sorry for her. That everyone else is constantly \"mean\" to her. The term mean is constantly used by her which is why I use it. In the beginning she was overly generous, genuine, and loving. I feel like if someone brings up something that calls her out (not in a mean way but in a communicative way) she stonewalls them. She uses the silent treatment every few years I feel like and it doesn't make any sense. The other sibling(my husband's other sister) has decided to cut ties after my MIL tried to lie to her children and stated she wasn't invited to our \"party and it made her sad\". WHICH WE HAVE PROOF NEVER HAPPENED! What do I do here, my husband doesn't want to deal with her but I feel like siblings need siblings in their life? I've tried to research different things and came across the vunerable narcissist. I feel like it checks a lot of lists. Has anyone dealt with this? It feels awful. How should this person get away with this, it feels like psychological abuse. I can't believe my husband's dealt with this his whole life. It really makes me cherish my family more.",
        "created_utc": 1674700570,
        "upvote_ratio": 1.0
    },
    {
        "title": "Complete Removal of Narc and Reevaluation of my life",
        "author": "SubzeroCalm",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/10lh0sz/complete_removal_of_narc_and_reevaluation_of_my/",
        "text": "After 20 days NC, I still found myself digging through my POF to see if Nex had clicked on my profile again.  So, I decided to delete every single one of them.  Even ones he wasn't on.  \n\nI had already blocked him on fb, but after having a weird interaction with someone else who was my friend on fb, who was giving off serious narc vibes, I decided to just deactivate fb too.\n\nI still have insta and messenger and noticed that one of my community groups had the Nex in it so I had to log back on, unfollow that page, and deactivate again.  \n\nNext, I blocked his number in my phone and saved it blank so it wouldn't be listed.  \n\nI have a graduate degree in an education field and decided today to apply to a school to pick up a masters in counseling.  I've thought about doing this for a while but these encounters have helped me recognize other people in my life with problematic behaviors.  \n\nToo, I see my own behaviors and realize that I will probably need to spend quite a bit of time working on myself in order to get to a point where I can have anything near a functional, healthy relationship.",
        "created_utc": 1674699987,
        "upvote_ratio": 1.0
    },
    {
        "title": "I unfollow&amp;remove my narc on IG",
        "author": "Spicepumpkin66",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/10ldrhw/i_unfollowremove_my_narc_on_ig/",
        "text": "It was not a tough decision, as I’ve been wanting to do this for a long time.\n\nThis dude watches everything I posted but seldom react anything, but he would like&amp;comment on other girls posts on and off at a much higher frequency.\n\nI am tired of this manipulation game and I don’t want to feel devalued anymore.\n\nFo narcissism and I will move on!",
        "created_utc": 1674690845,
        "upvote_ratio": 1.0
    },
    {
        "title": "Would your parents give you money then later on, blame their financial problems on you?",
        "author": "BiteMyWolverine",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/10laole/would_your_parents_give_you_money_then_later_on/",
        "text": "I’m finally an adult so I can share my experiences without worrying about CPS getting involved! There will be more to come.\n\nAnyway…\n\nIn high school, my mom would give me money to buy stuff online or Uber to stores I like or to the mall to shop, but then days later would yell at me, say that I’m financially abusing her and would tell me we’re gonna end up on the street and says I’m “starving her” because she can’t food, even though she LET ME, it’s not like I was taking her credit card and using it without asking:",
        "created_utc": 1674683124,
        "upvote_ratio": 1.0
    },
    {
        "title": "I asked ChatGPT to write a poem about gaslighting",
        "author": "SuperKingPapi",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/10l7n4w/i_asked_chatgpt_to_write_a_poem_about_gaslighting/",
        "text": "Gaslighting, a subtle art   \nOf twisting truth and playing smart   \nA manipulation, a cruel game   \nTo make the victim feel insane\n\nThey plant a seed of doubt and fear   \nAnd then they disappear   \nA whisper here, a hint there   \nMaking you question what you're aware\n\nThey make you doubt your own mind   \nAnd leave you feeling blind   \nA constant battle, a war within   \nLeaving you confused and spin\n\nYou try to speak, but no one hears   \nThe gaslighter's facade, it endears   \nAnd soon you're trapped in their web   \nFeeling alone, feeling unwell\n\nBut know this truth, you're not alone   \nAnd your reality is your own   \nBreak free from the gaslighter's hold   \nAnd trust yourself, you'll be bold.\n\nIt's important to note that gaslighting is a form of emotional abuse and should be taken seriously, if you or someone you know is experiencing this, reach out to a professional for help.\n\n(btw, it added the note at the end)",
        "created_utc": 1674675790,
        "upvote_ratio": 1.0
    },
    {
        "title": "This guy feels like deja vu",
        "author": "calculated-mind",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/10l7ivn/this_guy_feels_like_deja_vu/",
        "text": "I went out with someone who broke my trust and had a few narc traits. But we are on talking terms and we aren't as close as we were for practical reasons but he did try to build my trust in him again.\n\nI haven't seriously dated anyone for a while and so I have decided to actively look for something longterm as short term flings have started to be more hassle or harm than good. \n\nSo in comes X who is very similar to the last guy. Which I immediately adore because he reminds me of the other guy but at the same time I'm unsure because so many people on here have horror stories where they met a guy and then they ended up being awful, or of course vice versa. \n\nI feel like I am becoming judgemental and probably more narcissistic than the possible people I am suspicious of. I think it's protection but its too an extreme where it's stopping me meeting people and making me avoid social interaction/moving my love life forward just incase i meet someone awful.\n\nWhat characteristics have you found in narcs but also other people where they overlap? for example if someone is pessimistic if they were a narc would it be \"woe is me\" for every conversation? Or what about sarcasm or confidence?\n\nI just like men who can have a laugh, quick wit, ambitious, self assured etc without worrying they're going to be a narcissist!",
        "created_utc": 1674675515,
        "upvote_ratio": 1.0
    },
    {
        "title": "The judge told the Narcissists that they have to follow the law, and he responded by asking the judge \"what about my rules\"",
        "author": "Ghertquxx",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/10koij9/the_judge_told_the_narcissists_that_they_have_to/",
        "text": "HHe responded by asking \"what about his rul",
        "created_utc": 1674616268,
        "upvote_ratio": 1.0
    },
    {
        "title": "Did they ever cheat and lied, but gave hints that they did?",
        "author": "kwanthony1986",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/10kj4q9/did_they_ever_cheat_and_lied_but_gave_hints_that/",
        "text": "During a discard or time apart but still in a relationship (or so you thought), did they ever do something that seems really suspicious but you can't prove it? Then they turn around and drop a few more subtle hints that really mess with your head and you just know? They are such good liars and you really want to believe them too. \n\nMine was out with two of her coke head friends and she sent me a picture of her and this good looking dude who was about my age(mid to late 30s). She said \"omg I just met Joey Fatone\". I didn't even need to google him to know that it wasn't him. I said that ain't the backstreet boy, but thanks for showing me who you're really out with tonight! \n\nShe kept the lie going about how her friends bf said he checked his id and it was really him, but he was just messing around.  She ended up staying out all night and supposedly slept at her friends place.. bull shit!! Now that I'm sober and away from it, I can think of multiple times something similar has happened. Ugh, it's embarrassing.  I could've got her back, but didn't want to use another person like that.",
        "created_utc": 1674601382,
        "upvote_ratio": 1.0
    },
    {
        "title": "\"I Want Out\" - Guide to go NC and heal in the aftermath, written by a clinical psychologist, on sale at $0.99 until January 31st",
        "author": "Effetetob4",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/10kejs4/i_want_out_guide_to_go_nc_and_heal_in_the/",
        "text": "I'm a clinical psychologist and former victim of narcissistic abuse, and I have recently published for Kindle \"I Want Out: Go No Contact From Toxic Parents, Keep It That Way And Heal From The Narcissistic Abuse\". The book intends to help people who has had to go no contact, providing support and validation by addressing the most usual traps a narcissist plants in your mind, and the best strategies and exercises to move on from them, obtain validation and heal.\n\nThe book is on sale for $0.99 this week until next Tuesday. Check it out if you're in need of support after taking the difficult step, or simply if you want a good read that summarizes the basics about narcissistic personality disorder and how to deal with narcissists...\n\nhttps://www.amazon.com/dp/B0BSG4L4GS\n\n\nThank you to everybody who has already checked the book, and expressed that it was helpful. It really means a lot to me.\n\nReader comments:\n\n\"The author (...) analyses the mind of the narcissistic parent with both the cold precision of science and the warmth of someone who understands through firsthand experience. Books like this are exactly the thing I need to remind myself I’m not alone on this journey and it is the right choice.\"\n\n\"Brief and to the point, with lots of helpful information! I've read a lot of books on survive and recovering from narcissistic abuse, and was pleasantly surprised to find some new issues I hadn't considered.\"\n\n\"Well written, empathetic, educated author with first-hand experience so very good advice.\"",
        "created_utc": 1674590311,
        "upvote_ratio": 1.0
    },
    {
        "title": "Signs of a big company that is Narcissistic",
        "author": "OkAvocado7",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/10k5jjw/signs_of_a_big_company_that_is_narcissistic/",
        "text": "I think one sign of a Narcissistic company is that the employees, especially those on the bottom, are treated badly\n\nSigns of a big company or organization that is Narcissistic:\n\n\\- Employees, especially lower rung, are treated disrespectfully and even abusively. They can serve as the scapegoats.\n\n\\- Upper level management is not accountable and never wrong (like the Narcissist).\n\n\\- If employees complain, management turns the tables and blames the victim.\n\n\\- The company makes itself inaccessible by hiring overseas call centers to deal with customers. The call center employees read from scripts, have little to no power, and there may be a language barrier.\n\n\\- Customers realize they don't matter to the company when they are never able to speak to actual employees of the company and attempts to do so trap them in a maddening loop of different overseas call centers. They are transferred to different departments, each time having to start over and explain their issue.\n\n\\- Long hold times even though the company clearly has resources to hire adequate customer support. This is to frustrate you into hanging up.\n\n\\- Sometimes customer support is only reachable through messaging, again with overseas call centers. The support staff can only communicate in scripts. \n\n\\- The relationship between management and employees is very top-down, with the employees being in a completely powerless position and having to endure disrespect and abuse if they want to keep their job (same as in a Narcissistic relationship).\n\n\\- The company never apologizes for mistakes, however obvious or big. If a customer attempts to address a complaint and escalate their issue higher up the chain, and the company is clearly in the wrong, the customer may be met with any of the following: evasions, word salad messages, blameshifting, being ignored, passive aggressive moves like hanging up on the customer, retaliation, transferring the customer to another department, using a condescending tone, lack of empathy. It is the same when trying to resolve an issue with a Narcissist.\n\n\\- Lower rung employees may be paid as little as the company can get away with (reinforcing the message that their needs don't matter and the company wants them in a submissive obedient role). Employees may be denied basic needs like a fixed schedule or breaks.\n\n\\- Employee attempts to address a valid issue with management that can be reasonably resolved, are instead a trigger for drama. The employee is treated punitively and blamed for the issue. Management's goal is not to fix the problem but to remind the employee that they are a peon and have no voice and how dare they ask for anything or imply management made an error.\n\n\\- People promoted to management fit into the toxic culture with its heavy emphasis on control and punishment, the same as in a Narcissistic relationship. These managers are cold hearted and lack empathy and want blind obedience and butt kissing. They play favorites, setting up some employees as GCs and others as SGs.\n\n\\- Employees feel powerless and demoralized, the same as if they were with a Narcissist. They may even internalize the company's message that they are worthless and become passive and forget that they deserve better.\n\n\\- Employees, especially long time employees, may even experience Stockholm Syndrome and deal with the company's abusive practices, by siding with the company and defending them, becoming Yes men and Yes women. \n\n\\- Trying to address a complaint or problem with management\n\n\\- The company is all about the chain of command and a rigid focus on hierarchy. If an employee ever tries to go around this (usually if their direct superior is abusive) their issue won't be heard but instead the employee will be punished for stepping outside their place. \n\n\\- Good people don't survive.\n\nAre there any not listed here?\n\n\\-",
        "created_utc": 1674567089,
        "upvote_ratio": 1.0
    },
    {
        "title": "Please help me stay No Contact",
        "author": "SubzeroCalm",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/10jwdn8/please_help_me_stay_no_contact/",
        "text": "Been NC for 2 weeks with Nex.  Feeling a moment of weakness.  He's still my number one match on all of the dating apps.  Just knowing that he's there is a trigger.  I got stood up tonight by another guy and it made me sad and want to reach out to Nex but I need to not do that.  I need to completely ignore.  I may need to get off of dating apps for a while.  Okay, thanks.",
        "created_utc": 1674532171,
        "upvote_ratio": 1.0
    },
    {
        "title": "therapist suggested an ssri",
        "author": "kwanthony1986",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/10juxsa/therapist_suggested_an_ssri/",
        "text": "\n\nHe wants me to get off clonazpam because he says it's \"alcohol in a pill\". Thinks that an ssri like Prozac will help with anxiety and the trauma bond. I've taken Paxil in the past, definitely hard to get off of. I'm all over the place. I get fixated on the shit she put me through and it's hard to focus at work. \nAnyone here get on anti depressants after leaving the narcissist? Did it help?",
        "created_utc": 1674527710,
        "upvote_ratio": 1.0
    },
    {
        "title": "Are all the good guys taken ?",
        "author": "ymasu",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/10jmuxm/are_all_the_good_guys_taken/",
        "text": "Not that I’m on the hunt for a good guy but literally every guy who seems kind sweet friendly…is taken. Married got kids. It bugs me when I realise how many toxic men I let in to my life thinking how could I have over seen the good ones?! I guess time will tell. \n\nI just find it interesting that once I start dating I notice pretty quickly that all the men that I meet are not available for commitment. And the ones who seem kind and sweet are just not my type so well.. it makes me wonder some times",
        "created_utc": 1674506428,
        "upvote_ratio": 1.0
    },
    {
        "title": "I keep getting people being nasty to me but also saying that its to help me toughen up. Im not sure if its help or just a clever way to hurt someone and get away with it more easily, can you tell me?",
        "author": "Sophy_19",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/10jiymk/i_keep_getting_people_being_nasty_to_me_but_also/",
        "text": "Whats more likely and why?",
        "created_utc": 1674497031,
        "upvote_ratio": 1.0
    },
    {
        "title": "[TW: Suicide] [Progress] I'm finding my new normality as an adult, but flashbacks of what I went through transport me back to being a scared child",
        "author": "socarates",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/10it9mv/tw_suicide_progress_im_finding_my_new_normality/",
        "text": "It's been nearly 6 years since I left my NMum's house, we have been LC for about 3 years.\n\nEach passing year feels better than the last - I'm in my late twenties and I can look around my life and see things that make me feel proud. I'm in my first long term relationship that brings me so much joy, I have friendships that fill the gap my family left, and I've made good strides in my career. More importantly, I recently spent two years in group therapy which helped me in ways I can't even describe. I haven't had a depressive episode since I finished 18 months ago.\n\nMore recently, life has changed for me. I moved to a new city and have found myself with more time to myself than I've had in quite a while. For the most part, I've found a way to sit with the trauma I carry. I've told myself for so long that I had at last processed it and it's manageable now. But increasingly I've found that it is too big for the compartments that I put it in. \n\nFor example, tonight I was sat by myself and my inner voice said to me: 'isn't it odd that you went through all of that, and you're still here?'. I had a flashback to a time where my mum was livid with me, and demanded I get in the car to go for a drive with her so we could talk. I remember as I sat in the car that the veil had lifted, and I was looking at this person who very much intended to harm me at that moment, so I jumped out the car and ran when it paused. It's so alien to me now, it feels like some kind of dream I've made up. But when these memories come back to me, it's like living through it all over again and I find myself pulled into a great sadness.\n\nAdmittedly, this year also marks 10 years since my suicide attempt. It was during the worst phases of my relationship with my NMum, where she had gaslit me to the point I didn't know if I was real anymore. I have nightmares where it happens all over again, and this time she manages to have me sectioned and takes control over my whole life. That dream often feels so real that I wake up sobbing.\n\nI keep asking myself: why now, when you have so much distance - both in terms of time and location - from her? Or I have feelings of frustration that after so much time in therapy, I am still unable to detach myself from those experiences. The conclusion I come to every time is that this trauma is so complex and knotty, I don't think I can ever expect myself to lock it away and never think about it again. It is agonising knowing that this will be part of me for the rest of my life. But the good news is that slowly, but surely, the tidal wave of emotion ebbs away and I feel relief wash over me that my life these days is entirely my own. She didn't win.",
        "created_utc": 1674419167,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is that possible , the narcissist ex becomes so controlling and more manipulative with their new parnter?",
        "author": "lovelybirdlady",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/10ibtdc/is_that_possible_the_narcissist_ex_becomes_so/",
        "text": "When my ex fiance ended the relationship with me back in January 2021 as he kicked me out unexpectedly. He kept making accusations in 2019 after we got engaged till late 2020. Always say oh you must have cheated on me and I was very hurtful as he didn't trust me. Called me a b word and name calling etc. I said I always have been loyal and faithful to you. Did put a lot of effort in the relationship but he wasn't satisfied. The cycle of abuse kept going for 5 years. He gave me that superior attitude, said you need to stop lying so much and he kept antagonizing me to try to piss me off. Then he acted so weird after engagement in June 2019, I tried to find answers but I was so afraid to ask for help because he often threatened me if I said something about him included the prenuptial agreement. I was so scared and became so isolated. After separation,  I found out that he was having sex with many women as he was  dating me, like he often said he wanted to try to have prostitutes with me and he also posted weird stuff on reddit, I realized that I had to take the pap test and so glad that I am clean and disease free. A year and half later, I saw that my good friend were planning to go on the date with my nex and I warned her to not to go with him. She realized that was my ex who I told her and she rejected him before he got the chance to date her. Then I felt obligated to protect any women from him because never wanted any women to suffer like i did. I found out that my nex was dating that woman for a year and half while he was on the different dates and had sex. The woman who currently dating him is blinded,  I had to find the way to contact her to warn but she actually told my nex and he manipulated her that I am the bad person and she decided not to take my words as a warning. She recently moved in with him. My nex tried to scare my boyfriend over the messages of facebook but my boyfriend didn't let him to play the victim as he knows who I am. Also tried to put the restraint order on me as he thinks I was stalking him. He wanted to ruin my good reputation and played the games with me. I had to end his games by backed off and didn't want to mess my new life.\n\nDo you think that narcissist ex will always become worse as getting  older? Like become more controlling, playing the vicitm and the list goes on.",
        "created_utc": 1674364595,
        "upvote_ratio": 1.0
    },
    {
        "title": "Self-Sabotage.Inner Child Healing. Raising an inner parent.",
        "author": "SilencerSerhii",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/10i3gak/selfsabotageinner_child_healing_raising_an_inner/",
        "text": "Hi there,dear members! Could you suggest good books on reparenting, please? I was  raised by an absent, competitive, perfectionistic father and both a  hyper-protective mother and grandmother(seems borderline as she fears   abandonment and is a cold&amp;hot complainer). Father was always   competing with me. I couldn't express anger, because my father punished  me for it. Now I often feel that I don't deserve love and alienate good  people on purpose by thinking: \"I don't deserve to be successful or  have  good relations\".  I suffer from self-sabotage, a sense of not  being  good enough, avoidance of uncertainty, and taking risks. A strong  inner  critic and poor concentration intensify the traumas. I don't  have a  developed inner parent who filters out information, criticism,  and  emotions. -Whenever people criticize me, I feel like a hopeless  child  that is responsible for their reactions. It's hard to  differentiate  their opinions from mine. I need external validation and  permission from  someone to act and use my abilities. On top of that,  when I was 3y.o.I  have witnessed a terrible airplane crash and wounded  people. Plus, I'm  often \"lost\" and stuck in life, not belonging  anywhere, and mostly a  passive observer(perhaps dissociation). But what  can you recommend?-I  cannot afford a good psychotherapist now.(Already read The Toxic Parents&amp;The Blackmail,but it would be better to have something more practical:)",
        "created_utc": 1674339801,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to deal with blame being put on you?",
        "author": "Sad_Apple_1911",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/10i39fs/how_to_deal_with_blame_being_put_on_you/",
        "text": "So first of all, I know that narcissism is not only a diagnosis, and I'm not necessarily claiming a person has NPD - but just clearly above average on the trait narcissism. \n\nI've been a very functioning individual, had a normal life (drama free!) and I usually get along with people. I've often been seen as a diplomatic person, and tend to have more patience dealing with those people that act antagonistically than others. That's, I realize, an issue with me, I have so to speak been my own enabler. People high in agreeableness indeed tend to be more prone to experiencing abuse. I am not trying to \"victim blame\" myself, rather I recognize I have agency, and I realize I have been at fault by putting up with it - most people don't turn \"emotionally unstable\" because they just cut these people out of their lives. I have felt pity towards these people or did not want to hurt them. Often at my own expense. \n\nHowever, there are two people that acted in a way that for both of them is a criminal offense - have ended up putting blame on me... in the sense that they treat my reaction to them or their abuse as a character trait. Besides ascribing me weird antagonistic motives more in line with their personality, they also treat any sort of boundaries as me being \"dominant\" (that is still with them being way more controlling than the average person would put up with) and there is a fundamental lack of respect. These people end up being not so functioning themselves in regards to people around them, and they don't get along with others (in general, meaning the average normal person, one of them has a circle with social misfits). You are ascribed all sorts of weird character traits that you normally would not be called. Or be called \"emotionally unstable\", when any sort of behaviour called that was generally as a result of their abuse. Ironically since they threatened to jump out of the window and often complained I was to calm and not upset or non expressive. \n\nBut how do I deal with the mental aspect of this? To know that I am not indeed crazy so to speak, that their behavior is wrong, and so on. How do I not shift the blame to me?",
        "created_utc": 1674339300,
        "upvote_ratio": 1.0
    },
    {
        "title": "Now that he's old, NDad wants a relationship? He's gonna find out what he's asking for...",
        "author": "TransPetParent",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/10hx0gk/now_that_hes_old_ndad_wants_a_relationship_hes/",
        "text": "NDad and I have been VLC since a fiasco at my wedding back in 2006. He called just before the holidays this winter and said that he wants to have a relationship again. He's 75 and I think he's realizing that he's alone and miserable and is going to die that way if he doesn't do something about it. I have been going to therapy for years now and am in a place where I was able to say :\n\n\"Okay, here's the deal. I'm going to write you a letter and tell you all the reasons we don't have a relationship. I'm going to tell you things about me that you have never earned the right to know, because I couldn't trust you. If you read this letter and still think you want to have a relationship, I'm open to starting to rebuild - however if you're going to critique me, my life choices, or anything else, you're formally disinvited from calling me ever again.\" \n\nIt took almost a month (and a few panic attacks) but I managed to write a 5 page google document detailing all of the main points and issues that his narcissism caused. A lot of it was in relation to his transphobic, racist, and downright shitty beliefs. He'll be the last in my family to know that I'm trans, and he'll get a solid reminder of all his transphobic bullshit that he was preaching to me since I was 3, so he can't come back and pretend that he was never \"that way\".  As an added bonus, he'll also get a page from my therapy notebook detailing the ways that adult children of narcissists struggle as a result of being terrorized by a narcissist. \n\nTalking with my spouse about it, even though this letter is giving me anxiety, it's also giving me a firm sense of closure. What we've had in terms of a VLC relationship is phone-calls 2-3 times a year that are generally polite, with me hanging up if he starts getting political (he's learned his lesson mostly), and him complaining about how bad his life is while I  make non-committal noises in return. \n\nIt feels good to know that no matter what his reaction will be, I'm okay with the outcome. If he doesn't want to talk to me, I can block his number with no issues, and if he wants to have a relationship, I'll know that he's working on himself, and be willing to start to work up to something approaching a father-child relationship. \n\nIt feels really good.",
        "created_utc": 1674323485,
        "upvote_ratio": 1.0
    },
    {
        "title": "What happens when two narcissists combine?",
        "author": "ninjanups",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/10hvcjn/what_happens_when_two_narcissists_combine/",
        "text": "My STBX is definitely a narc. I mean its so textbook that I read lundy bancroft's \"why does he do that\" and its 90+% our relationship described. I know its normal to question yourself, whether you're the problem, but i REALLY am. i'm genuinely wondering whether I'm the narc. Whether we're both narcs. \n\nI filed for divorce back in August. Since then he has been asking me to brunch or getting me christmas gift (all initiated by him). He asked me to take the kids to he zoo. And of course, being dumb and desperate, I did. Obviously those events were positive enough to fool me into thinking he will take things seriously and get help for abuse (silly me). We got into a fight about him ignoring me when I said I felt unsafe in the car (he was putting eye drops in his eyes and driving with his knees and got upset that i was overreacting) and he completely withdrew all affection because we fight too much. Said our relationship was toxic and how he wouldn't get back on this disaster train. I was left completely confused because he violated my boundaries, dismissed them and projected. When he withdrew, I imploded. I got so upset and ugly cried that he misled me. I kept begging him to reconsider and talk to me. That was then. Since then, I got my shit back together. Blocked him again. Went minimal contact again (we have kids). \n\nI'm reflecting on our dynamic because I can't get over how he keeps saying its an \"us\" problem. I do think I do things wrong in a relationship but none of them are in the same league as the things he's done. And he buries all responsibility so naturally the conversation is about his behavior disproportionately. \n\nI guess this is a really long winded way of saying that I feel like I'm exhibiting narc behaviors (when i ugly cried and begged him to talk to me... that was hoovering...wasn't it?). I dont know whether or not reactive abuse excuses the way i've treated him near the end... near the end, i stopped giving any and all fucks and was not kind, was not patient. Did not ignore anything, especially if it violated my boundaries. \n\nMy therapist would say that I'm internalizing the blame he would project onto me. But sometimes I genuinely wondering if I'm a narc too.",
        "created_utc": 1674319217,
        "upvote_ratio": 1.0
    },
    {
        "title": "Holy narc-fail, Batman!",
        "author": "Standard-News-4829",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/10hcx5g/holy_narcfail_batman/",
        "text": "We don’t get to enjoy a ton of victories in this healing process, at least none that feel immediately clear, so I thought I’d share one.  Using a throwaway account for reasons that will become obvious.\n\nRecently, I was wrapping up a regular weekly meeting with my supervisor at work.  As we were closing, she told me she needed to share something: “You’re not in any trouble, but…” She went on to share that both the HR department and CEO of the company where I work had been receiving “weird anonymous emails” about me.  I stopped her right there, because I already knew who they were from.\n\nMy nex’s girlfriend, who slightly surpasses him as far as aligning with DSM IV criteria for NPD, found my Reddit account over a year ago.  She tracks my history on seemingly a daily basis, invades all the subs I use, and has made countless posts either directly smearing me or trying to push my buttons with detailed information she believes will make me jealous about their life together (spoiler alert: it doesn’t).  While she’s also taken the opportunity to make fun of my income and insult my line of work, she’s also explicitly threatened to sabotage it several times.  Please note that this an abridged summary of what she and my nex have put me through in the last couple of years; he’s been behind it, but has a track record of relying on women to do his dirty work for him.\n\nSo there was absolutely no question in my mind as to who was sending this emails, nor any surprise to learn that a) they were sent from multiple, untraceable accounts, or b) that they concerned my Reddit account, with allegations of misuse of client information.  I work in mental healthcare, so that’s a pretty serious allegation to make.\n\nThankfully, the stalker in question is apparently too dumb to know how HIPAA laws work, because HR actually reviewed my main account and found nothing wrong.  Furthermore, because they are mental health professionals (and because they’ve dealt with people like her before), they immediately flagged the sender as potentially suspicious.  She certainly didn’t strike them as anyone who has our organization’s best interests in mind.\n\nI was almost a little too eager to share all of my stalker (and nex’s) information and background with both my supervisor and HR rep, who both offered to coordinate legal help if anything escalates.  The CEO neither took her seriously, nor appreciated the waste of his time.  I also made some of my co-workers aware; all of them were aghast, although a few whom I’m close friends with helped me find some humor in it (we made a lot of jokes re: Eminem’s “Stan” that day).  And now I’m back to basically cruising at a job where I’m successful, respected, and protected…all of things that pissed my nex and his narc girlfriend off enough to try to take them away.\n\nLong story short, I occasionally see posts from people whose abusers have discovered their Reddit account; know that there is no limit to what they will do to destroy your happiness, especially if your anonymity is compromised, so be really, really, really careful about your online footprint.  And to my stalker/nex, if you found this post:\n\nTL:DR- Nex’s narc girlfriend has stalked me relentlessly and tried to get me fired from my job, instead wound up looking like a complete fool to total strangers, and is now red-flagged as a potential threat after my workplace chose to protect me.",
        "created_utc": 1674258205,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is it normal to feel sad for a narcissist when you find out they’re still ruminating over the same falsehoods they tried to tell you (or others about you)- years after the relationship is over?",
        "author": "pimms_pup1993",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/10h84k6/is_it_normal_to_feel_sad_for_a_narcissist_when/",
        "text": "I know a lot of you often caution about feeling sorry for them, but I can’t help but think it must be absolute torture to get stuck in this endless loop, constantly trying to convince everyone that you’re a good person and a victim when you know the truth. \n\nI’m aware that this is how they generate supply, but is it not at some points exhausting to fight a self-created battle that never really existed in the first place? \n\nI guess it’s more pity than sadness. I’m just curious if anyone else here has reached the “I hope they figure it out of their own sake and that of the greater good” phase of post-narcissism.",
        "created_utc": 1674248710,
        "upvote_ratio": 1.0
    },
    {
        "title": "Nex is making me feel crazy!! Desperately need some moral support",
        "author": "goldcandleheart",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/10h7k3j/nex_is_making_me_feel_crazy_desperately_need_some/",
        "text": "Okay I will try to keep this as concise as possible.\n\nHave a 4 month old baby with my nex. I ended it with him when I was 9 months pregnant, after finding him cheating. He begged to me to be with him after the baby was born and I’ve been grey rocking him since then.\n\nA week ago he told me he had a new girlfriend. I didn’t react just said ‘good luck to you’.  Saw him today, and after going on a rampage about how he’s moved on and doesn’t have feelings for me anymore, he told me he loves me so much and wants to be with me.\n\nI said ‘I don’t think you’re girlfriend would be too happy if she heard you saying this’ and he said ‘you know I would leave her for you in a heartbeat’. The rest of his visit he went on about how he loves his new girlfriend, but he loves me more. And he needs to know if he has a chance with me, and if I take him back he will break up with his girlfriend. I just said I don’t want any part of this love triangle and he should have a fresh start with this new girl, that I’m never going to be with him so he should move on.\n\nMy head feels so scrambled. It’s so much to take in. He said he thinks about me all the time even though he loves his girlfriend. I’m just trying to process all of this bullshit, but one thing I know for sure is that I’m never letting him in again. I’ll tolerate him so my daughter can know her dad but these games are really wearing me out. Every time I feel peaceful he finds a way to drag me back into his drama. He told me his new girlfriend is super insecure about me and wants to meet me?? I just said for his sake he probably shouldn’t introduce us because I will be entirely honest with her.\n\nPart of me wants to tell his new supply. But also I know it’s probably best to not get involved, as my child is my focus and I don’t want to be drawn any more into this madness. I feel like she should know what’s going on though!! \n\nIt hurts, to be told your ex has moved on with someone else after a few months, but then I can’t even just accept it for what it is because he’s telling me he loves me more than her?! Oh god he’s insane. And he does everything he can to draw me into his insanity.\n\nI just need some moral support as I’m feeling worn down. Someone please give me a reminder of how to stay strong when the narcissist is playing their mental games",
        "created_utc": 1674247261,
        "upvote_ratio": 1.0
    },
    {
        "title": "She didn't notice me (and I'm fine with that)",
        "author": "SuperKingPapi",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/10h3vgg/she_didnt_notice_me_and_im_fine_with_that/",
        "text": "So, It's been almost 2 full years since the discard. We both work on a campus, so I see her every once in a while. Mostly I notice her and get anxious as to what I'm gonna do or say or whatever. I've been No Contact for many months (we have kids, so sometimes it's unavoidable).\n\nThis morning was the closest though. I was pulling up to a crosswalk and saw her walking toward it to cross. Mind you, I'm on a motorcycle that's got stickers all over it, some spikes on the front fender and even a fluffy tail. The only one in town like it. I also have straight \"drag\" pipes installed, which makes it pretty loud, even at idle.\n\nI began to make up my mind to maybe just \"nod\" if she attempted to greet me. But one thing I noted was that I wasn't anxious. No sinking stomach, no uptick in heartbeat, no racing thoughts. That was nice. Previously, this sort of thing messed me up a bit.\n\nShe walked right in front of me. I saw her glance up, but just barely, no eye contact. I don't think she noticed me. I left and didn't look back.\n\nSo, couple things here, 1. I'm getting better. 2. She doesn't care about anything/anyone but herself. \n\nPretty big moment for me I think. I've felt a change lately in my feelings about the whole thing, and this proved some stuff to me. I am very happy about it. Hopefully the \"ruminating\" and \"detectiving\" will taper off too. I don't want her in my head, but with 32 years of memories and promises and kids that are learning how to understand who this lady is now makes it still something I am processing. I don't expect it to be gone, but less often would be nice.\n\nSo, take this as a hopeful thing. Probably depends on how long you were in the situation, but it takes time.\n\nI believe it also has to do with my understanding of NPD, BPD, trauma bond, regaining self confidence, realizing that my dad was NPD,  and that the ex probably has no idea what's going on. And that comes from reading on this sub, watching youtube vids (lately Grannon/Varkin), and allowing myself to process, make decisions, and shrug.",
        "created_utc": 1674238252,
        "upvote_ratio": 1.0
    },
    {
        "title": "Recovering from Workplace-Narc Abuse: Afraid to Speak Up in Meetings/Anxiety",
        "author": "SilverCirclet",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/10gbeds/recovering_from_workplacenarc_abuse_afraid_to/",
        "text": "Hi -- I'm in recovery from a narc workplace. It's been a long road, but through therapy, I finally found my confidence at work again after having work-related PTSD at my new job for the first few years. However, I had a bit of a setback today and I'm having some issues with self-soothing. \n\nBasically, I used to be quiet in most meetings unless I methodically and slowly expressed my opinions on things, being extremely careful to choose each word carefully. I did this because, in my last workplace, any opinion or idea expressed in a meeting was either met with immediate criticism/yelling or otherwise used against you at a later date. My former narc boss would also repeatedly ask us our opinions, and the first one who spoke up was the immediate target for snide comments about how stupid and wrong they were. \n\nAs I mentioned recently, through therapy I've recently felt great about myself and my work, and I've started to speak more freely. \n\nToday, I listened to a colleague's suggestion for something regarding my project, and though I liked the idea and expressed that I would use some of their suggestion, I also said that I wasn't on board with making the full change they suggested, and I explained my reasoning. I tried to be as kind as possible, but afterward, I felt really scared. I don't know how I sound, and what if I hurt them? I wasn't policing my words the way I usually do, and what if I came off like a jerk?\n\nAfterward, I messaged the project team in chat and reiterated that I appreciated my colleague's point of view, expressed how I would integrate their idea, and thanked them for their insight. They didn't respond. Which... I know from therapy I can't expect people to soothe my anxieties, that has to come within, but I'm feeling so down after feeling SO confident the last few weeks. \n\nI don't want to be the one to hurt people the way my narc did with their constant criticism and I'm always afraid of doing so unintentionally. \n\nAny support or stories of your own recovery are welcome. Thanks for reading.",
        "created_utc": 1674158060,
        "upvote_ratio": 1.0
    },
    {
        "title": "\"I Want Out\", a guide on how to go NC from narcissists and deal with the aftermath, written by a Clinical Psychologist, for free in Amazon this week",
        "author": "Effetetob4",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/10g47kl/i_want_out_a_guide_on_how_to_go_nc_from/",
        "text": "Hello everybody, I'm a Clinical Psychologist and former victim of narcissists (I went NC from my toxic family a year ago). I've written this book to help other people who is in the process or has recently gone no contact, to help cope with such traumatic moment, and deal with the aftermath advancing towards healing and self realization. The book is mostly focused on the inner aspect, addressing the most usual themes of fear, obligation, guilt, left in our minds by the narcissists, and how to deal with the trauma bond...\n\nI've structured the book around the most asked questions in this and other subs, questions I've had to answer again and again, and where I was told the information was most helpful, what made me think that there's a certain demand for these contents. The book is also useful for people who isn't in a NC status but wants a quick primer on narcissistic personality disorder.\n\nYou can get the book for free in Amazon this week. I hope you find the book empowering and useful in your own healing process. Best wishes to all...\n\nhttps://www.amazon.com/dp/B0BSG4L4GS",
        "created_utc": 1674141369,
        "upvote_ratio": 1.0
    },
    {
        "title": "What was your late convo like before NC?",
        "author": "Spicepumpkin66",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/10g3n0x/what_was_your_late_convo_like_before_nc/",
        "text": "Been thinking how to end this shit relationship for a long time. If not we still have financial issues to deal with, I would go NC with him right away. \n\nAfter reading this sub for sometime I already knew who he is but am struggling to reveal that I’ve already unmasked him and can dig out his dark secrets. \n\nI’m thinking for the last convo maybe just keep short and plain and return everything he lend me as Hoovers and say we’ll never contact again.",
        "created_utc": 1674139974,
        "upvote_ratio": 1.0
    },
    {
        "title": "Dreamed about they dating others",
        "author": "Spicepumpkin66",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/10fzu1j/dreamed_about_they_dating_others/",
        "text": "Maybe it’s because I was thinking about it during the days that it eventually become subconscious and went into my dreams.\n\nNightmare, hair-loss, exhausted and bad mood bc of them.",
        "created_utc": 1674129271,
        "upvote_ratio": 1.0
    },
    {
        "title": "What are they thinking when silent-treating us",
        "author": "Spicepumpkin66",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/10fntdg/what_are_they_thinking_when_silenttreating_us/",
        "text": "I know it’s insane to use a normal logic to get through what cluster b people are thinking, but I just can’t stop wondering about it. \n\nI was so confused when he started to give me the silent treatment, and it was hurting as well considering his formal loving behavior and the way he’s totally neglecting me now.\n\nI’ve never seen such a person who can be so unpredictable and can change himself inside out for bad.",
        "created_utc": 1674089451,
        "upvote_ratio": 1.0
    },
    {
        "title": "Do vulnerable narcissists truly believe the fake story they wrote in their heads?",
        "author": "[deleted]",
        "url": "",
        "text": "[deleted]",
        "created_utc": 1674079260,
        "upvote_ratio": 1.0
    },
    {
        "title": "mistakes you make to slow down your healing and why",
        "author": "Free-Force-3076",
        "url": "/r/TrueNarcissisticAbuse/comments/10fichy/mistakes_you_make_to_slow_down_your_healing_and/",
        "text": "",
        "created_utc": 1674075102,
        "upvote_ratio": 1.0
    },
    {
        "title": "People who had few or no way to leave toxic parent but were able to leave, how you did it?",
        "author": "SingularityAI2025",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/10fd5of/people_who_had_few_or_no_way_to_leave_toxic/",
        "text": "",
        "created_utc": 1674062926,
        "upvote_ratio": 1.0
    },
    {
        "title": "I don't know if this former friend is a narc or just delusional, but the red flags are suddenly obvious now that I have educated myself. Either way, I need to rant. If it's not appropriate, feel free to delete it.",
        "author": "EssentialIrony",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/10fd4d1/i_dont_know_if_this_former_friend_is_a_narc_or/",
        "text": "So I have an old \"friend\" (male), let's call him Bob. We started talking online around 7 years ago, met up at social events a couple of times, flirted a bit, even kissed. I realized I wasn't interested and told him and he had a hard time accepting that, and kept telling people there was more to the situation than there actually was. It was incredibly awkward. He kept trying to pressure me into a relationship and did not respect my constant rejection of that. In hindsight I see how messed up that is, but I didn't know as much then as I do now. I've always had an \"ick\" feeling when being around him IRL. Can't explain it.\n\nEventually I stopped talking to him for a year, because we had a huge disagreement. I realized I did not want him as a friend anymore. He resurfaced and we had a talk about it all. He apologized. I told him how I did not think our friendship was equal or necessarily healthy, as he was constantly overstepping the flirty boundaries and I only kept talking to him due to my people-pleasing and I also admitted to him that I felt like an asshole for it, and for also trauma-dumping my then relationship issues on him. Told him I felt bad and that I realized my behavior was absolutely selfish and abhorrent.\n\nBob said it was fine and he didn't experience it like that.; said we were close friends after all (which was not my reality) which also made me super uncomfortable; I just told him why I think it's an unfair friendship, how I took advantage of his \"shoulder to lean on\" and he either completely ignored all that or genuinely didn't care. He wanted to start talking again and I said we could play some online games and chat casually and see how it would go, and that I made no promises due to all the reasons above and I didn't want to restart a new one-sided friendship.\n\nMeanwhile he was in a relationship with an abusive woman. We didn't really chat at all after our \"talk it out\" session which was absolutely fine with me. Then he wanted to meet one day. I reluctantly agreed (we hadn't met in about 2-3 years) and the whole time I was just reminded why I didn't want to be friends. The ick feeling returned full force, he was only talking about his relationship, talked over me, etc. I had to force him on a bus to leave and when he was gone I was so mentally exhausted I decided I don't want to hang out with him IRL ever again, and only to play some online games once in a while. He wrote me how awesome it was to \"catch up\". :')\n\nMonths passed without much contact and I had finally gotten out of my own terrible relationship last winter. Bob would every now and again dump his own relationship issues in a text (like I had done in the past). I told him my honest opinion; said that it was a waste of life to be in an abusive relationship, speaking from experience. Bob's girlfriend was absolutely wild; she has never met me and he told me she had called me the n-word. I told him straight up, that I didn't care to know what this random woman called me. I told him to either leave her if he was unhappy or find someone else to rant to, because I am not the one to give advice on how to stay in an abusive relationship, let alone with some stranger calling me the n-word because she got jealous of the (nonexistent) friendship I have with Bob. **It felt like triangulation and I'm not about that life.**\n\nBob apologized and time passed without much contact. Eventually they broke up, got back together and broke up again. He gave me these updates randomly, still not understanding I did not give a shit. I told him several times. Eventually they broke up for good during november or december 2022, and Bob decided to come back full force with the friendship agenda, ranting on and on about all kinds of weird stuff. I've said multiple times that I am not interested in hearing about his ex, his turbulent neighbors and whatever else. I just want to play online games. He keeps \"forgetting\" no matter how often I simply don't respond or shut down the conversation.\n\nHe also has a habit of finding old screenshots of our flirty conversations from way back (he has a fucking folder?!), reminiscing the past and I'm just ignoring it because it's creepy and cringe as heck. Today he says he's going to my neck of the woods next month and if I wanted to go out for a beer. I told him no, that I'm not very social these days, which is true. He then said it didn't have to be a \"big event\" out on the town, but that we could just hang alone doing whatever. I said I also meant that aka no. He said that he'd tell me when he gets around and I can decide if I'm up for it on the day. I just said ok. But seriously, I just said no twice?! :')\n\nThen he proceeds to once again send me a cringe as fuck thing I've said back in the day, and I told him how uncomfortable it makes me feel that he is living in the past, sending me these things. (He has done it multiple times before where I told him not to). He seemed confused. I said I know he means well, but it's awkward af. Then he said he'd stop and then started questioning why, because in his mind \"it's reminiscing a nice past, and usually when people say something is uncomfortable, it's because they regret something or feel dislike\" and I thought 'ding, ding, ding, Sherlock' but I just didn't respond because I have realized I don't have to keep explaining to people why I don't want something. Also, he is the type to keep arguing for the sake of arguing and I am not taking the bait anymore. He then added \"At least you're honest, and I appreciate that. People don't work like that anymore.\" and I said \"You're welcome.\" and he responded with an obviously offended response.\n\nI really needed to rant about this. I know the obvious thing to do, is to block him because his delusion is so severe and annoying. I so hoped we could just keep it to playing games (minimal interaction) because that's actually super fun, but he doesn't seem to understand or respect that I am not interested in a \"close friendship\", let alone receiving old flirty texts.",
        "created_utc": 1674062833,
        "upvote_ratio": 1.0
    },
    {
        "title": "How long you lived with toxic parent?",
        "author": "SingularityAI2025",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/10fd2tx/how_long_you_lived_with_toxic_parent/",
        "text": "",
        "created_utc": 1674062731,
        "upvote_ratio": 1.0
    },
    {
        "title": "Dating a Narcissist - BDSM, D/s, Attachment Theory. A personal story",
        "author": "SubzeroCalm",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/10fa5v6/dating_a_narcissist_bdsm_ds_attachment_theory_a/",
        "text": "[removed]",
        "created_utc": 1674055863,
        "upvote_ratio": 1.0
    },
    {
        "title": "anyone turn step kids/kids against you",
        "author": "Few_Psychology_",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/10f3lo4/anyone_turn_step_kidskids_against_you/",
        "text": "looking for support if anyone has been in this situation it's SO hard &amp; literally no one understands. Most of the survivors I talk to just unfortunately have to deal with co parenting their bio kids.\n\nMy ex was a single full custody father. I met his kids and took them in full stay at home caregiver to them for 5 years now. They eventually started calling me mom their mother isn't active/won't follow the court order. I had the most beautiful relationship with them truly. I didn't notice then but he would agree we should give them rules then nag at me about the rules infront of them basically unparenting. Now it is full on alienation , they would  ignore me when I'm talking literally act like I'm not in the room I bring it up to him he says I'm crazy, so many other things. He's told them I'm jealous of them, I've cheated on him,  says I threatened to take their siblings away. He encourages them to bully my kids his other children... They still call me mom and it is so truly hard I am accepting it little by little just would love to hear ANY EXPERIENCES also like this.\nP.s. I just moved out.",
        "created_utc": 1674035835,
        "upvote_ratio": 1.0
    },
    {
        "title": "Nex is having a baby with new gf",
        "author": "unadonna87",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/10evdzu/nex_is_having_a_baby_with_new_gf/",
        "text": "I feel sorry for her and the baby. I know that if it had been me it would have been horrible. I just hear how people think he’s changed but I know he hasn’t. He kept trying to get me pregnant but then would freak out when I had a scare. He’d been with her only a few months then got her pregnant. He’s 41 now so I guess he thought it was his last chance. Seems he couldn’t hold on to a relationship obviously. Why do narcs breed except for their ego?",
        "created_utc": 1674008858,
        "upvote_ratio": 1.0
    },
    {
        "title": "Building up confidence",
        "author": "abrakadabra2022",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/10eu8wf/building_up_confidence/",
        "text": "For all the ones who survived narcissism and were able to get back their life, their confidence - how did you do it ? \n\nAfter all the narcissistic gaslighting that I went through, my confidence has been so badly shattered that it’s taking me hard time to get it back. I understand all the pep talks n self help books, but nothing is helping much at this time ! Seeking advice from those who went through similar situation !",
        "created_utc": 1674005803,
        "upvote_ratio": 1.0
    },
    {
        "title": "Narcs and fake accounts",
        "author": "ellew1990",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/10er4ky/narcs_and_fake_accounts/",
        "text": "This is a bit of an odd one but have any of you experienced your nex creating fake accounts to get in touch with you/keep tabs on you when you're in no contact? Or have you experienced other narcs trying to contact you after posting about narc abuse? \n\nWhen my relationship ended I blocked my nex everywhere (or I thought I had - turns out if you delete and block them on the book of face they can still contact you on messenger). I recieved the holiday hoover where after numerous letters he'd posted to my home, knocking round after I told him for months to leave me alone I recieved numerous messages online from him. Each saying how he loved me, missed me, this'll be the last time I hear from him, he's in therapy, he's not a narc and he wants me to know his story etc. I blocked and reported each of these accounts - must have been about 3 or so in total. Block one, he makes a new one, block that one, cycle repeats etc. For now he has stopped. \n\nRecently I had a follower request on Instagram\n(every other social of mine is private but my Instagram isn't as its for the photography I do) from a guy who's username included the year that my nex was born and the account itself was private but I could see the bio which included \"narc survivor\". I was curious so accepted and followed back - I usually do as its not a personal account as such. Got a DM pretty quickly which I never replied too. The photos have only been posted since the end of November and included selfies of a guy who looked much older than 29/30 if I'm going by the number in the username and some help quotes about narcs and a picture of sunflowers which are one of my faves. The posts had next to no likes and this guy seems to only follow women. I figured it's a fake or troll account so I blocked it. \n\nIt freaked me out as the posts from this account started around the time I got the holiday hoover and initially I wondered if it could possibly be my nex. I have been posting about narcissistic abuse to my story for for past 6 months or so so my other thought was could I be making myself a target to actual narcissists/toxic people by posting about narc abuse?\n\nHave any of you experienced this?",
        "created_utc": 1673997984,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do I help my GF process the abuse?",
        "author": "Justmehere123456",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/10ej1jy/how_do_i_help_my_gf_process_the_abuse/",
        "text": "Hi all. I hope you can give me some help with something. \n\nMy girlfriend and I have been together for nearly 2 years. She is 7 months pregnant with my baby and we have a mostly happy relationship. \n\nMy gf was in a relationship with her ex that ended about 4 years ago. But he is a narcissist. \n\nI always felt uncomfortable with their relationship as he was always interjecting in to our lives. \n\nShe would make excuses for him and hid the real extent of their relationship. During our arguments, I was gas lit in to thinking that I was the one with the issues. That I was jealous and being controlling. \n\nHe would intimidate and threaten her and then act nice and apologise and the cycle continued. \n\nHe would call her everyday to speak to their son and she would step over my boundaries and lie to me about it. It got to the point where I no longer wanted to take her out because he would constantly text her and had to be home before a certain time for his daily phone call. \n\nIt came to a head last week and she finally had enough. She is getting a restraining order against him and ensuring he cants get to her though the kid. \n\nShe admitted some of the things that has been going on with him but my trust in her has been smashed to pieces. \n\nI feel relieved that it’s over and I am taking steps to help her sever all ties with him. \n\nI’m helping her with the legal side to make sure our family are safe. But when that’s out the way, I know all these feelings will come to the surface. \n\nHow can we even begin to heal?",
        "created_utc": 1673979118,
        "upvote_ratio": 1.0
    },
    {
        "title": "Helping you understand why you think you may be still in love with your abuser.",
        "author": "Free-Force-3076",
        "url": "/r/TrueNarcissisticAbuse/comments/10ef0ad/helping_you_understand_why_you_think_you_may_be/",
        "text": "",
        "created_utc": 1673969388,
        "upvote_ratio": 1.0
    },
    {
        "title": "the narcissist doesn’t have the capacity to replace you",
        "author": "QuietWest3764",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/10eesoi/the_narcissist_doesnt_have_the_capacity_to/",
        "text": "they can’t create the same amount of fuel from this new person that they got from you. \n\nyou have to understand your power and your worth. \n\nremember, you’re gone. you left. with you being gone, there’s a gaping hole and a gaping void no one can fill.  they will attempt to fill this hole, don’t break down over it. its all they can pull. it’s just a temporary distraction to mask the fact they lost you while they can also create a game plan to get any reaction from you. \n\nyou gotta be a special type of stupid to lose your gift. someone who was loyal to you, always there for you, someone who truly loved you. the light was on but nobody was home. but your light is on, you’re home, present and it’s filled with gorgeous furniture. focus on yourself.",
        "created_utc": 1673968815,
        "upvote_ratio": 1.0
    },
    {
        "title": "Debunking , the Am I the Narc myth because i am miserable and nex is happy and successful",
        "author": "Free-Force-3076",
        "url": "/r/pnsd/comments/10edcy6/debunking_the_am_i_the_narc_myth_because_i_am/",
        "text": "",
        "created_utc": 1673965166,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is it normal to want to scream at him and break things?",
        "author": "Southern-Put-6887",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/10e7rcb/is_it_normal_to_want_to_scream_at_him_and_break/",
        "text": "When my ex abuser threatens me or is being nasty, I get such urge to scream at him, curse and break things. I feel like abuser myself when I have these thoughts. \n\nThe thoughts are scary to me and I know if I would act on it, it’d be over the top and it scares me.\n\nIs this normal?",
        "created_utc": 1673946646,
        "upvote_ratio": 1.0
    },
    {
        "title": "First flying monkey",
        "author": "throwaway_2234566",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/10e4opt/first_flying_monkey/",
        "text": "After 4 months of not seeing or speaking to him, I was at a drink last weekend that he also attended. We saw each other shortly, but I walked along back to the friend I was with. He eventually went home without saying goodbye. I know it pisses him off that I don't want to talk to him anymore but so be it. To me honestly it feels like the most unnatural thing to do to somebody, I just want to talk to him and for things to be ok but I know they can never. I still felt bad for doing this, but well... I'm just not normally that person and I do really care. But I guess when I try to show it in some way, he will find his way to reel me back in or hurt me more.\n\nI was approached by a woman I don't even know well, never spoke to her before, that I saw him speaking to as well. In the past he has said nasty stuff about her as he had about other people. She randomly starts talking about dating and asking who in the group of people attending have I dated in the past. I told her nobody, only some guy in the very far past who she doesn't know. Why the hell is it any of her business anyway. I'm not in gossip high school anymore. \n\nI think we passed into the next stage now, where he knows he can't get to me and will start to smear me to people.",
        "created_utc": 1673935558,
        "upvote_ratio": 1.0
    },
    {
        "title": "Anger and pity. The conflicting feelings",
        "author": "im_n0t_y0ur_star_x3",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/10e2xpx/anger_and_pity_the_conflicting_feelings/",
        "text": "My narc brought up divorce in June, moved out in August, divorce finalized in October and house was sold last month. It’s been a whirlwind. He cheated on me countless times. After he first mentioned divorce, he slept with someone else within 10 days of that. For all I know really it could’ve been the very same day. There is a specific date I suspected but he never confirmed it. \n\nAnyway. That one didn’t work out. He tried to reconcile. We slept together again. I was really torn and confused. Then he got into a new relationship within 2 weeks of us sleeping together. Moved out a month later. \n\nIt’s been hell. Many days I just wanted to die. He’s been so cruel it was shocking and unbelievable to me. He has so many health issues - TBI, bipolar, schizoaffective and he’s an addict. It’s really hard for me to figure him out most of the time. I do know this situation has given me a lot of narc vibes… being discarded, triangulation, gaslighting, being replaced so fast like he was so desperate to not be alone. \n\nHis thing is he says the divorce is my fault because I filed. He asked for it, he wanted it, and he cheated but didn’t know how to file and I did it. I begged him to reconcile for months but he rejected it. He uses this to play the victim and blame everything on me. Wants to sue me over it even. Yet is still in this relationship he started when we were married…\n\nOn one hand I feel pity for him. Was he really this mixed up and confused? Or… is this another manipulation tactic? He’s brain damaged, but he’s not stupid. What is there for him to gain by playing victim at this point?",
        "created_utc": 1673930130,
        "upvote_ratio": 1.0
    }
]