[
    {
        "title": "Ex rubbed new girl in my face and said how happy he is, but gets drunk every night?",
        "author": "Moon_Yuna",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/zfokpe/ex_rubbed_new_girl_in_my_face_and_said_how_happy/",
        "text": "My ex was extremely controlling, manipulative and paranoid. We were long distance though. He would continuously gaslight me into thinking that my reactions were the problem and that I was blowing things out of proportion. He would accuse me of cheating continuously without any evidence. If I showed evidence I wasn't cheating, he would say I erased the proofs. Nothing appeased him, but I was loyal and committed, never cheated on him. At some point, I left the relationship. I couldn't take his demands and restrictions anymore, he wasn't changing. He made me stop posting pictures on my social media, erase old ones, stop going to celebrations where there could be men, not go to the gym, get mad at my clothes even if they weren't revealing. He would also threaten suicide if I left and punch his own face, crying and reacting desperately if I tried to leave. \n\nFrom that moment on, some sort of switch went down in his brain and he literally despised me. In literally two days he started dating a girl he met on a dating app and in a month he called her his girlfriend. \n\nHe still tried to maintain me in his life saying that he wanted to restore our relationship because he loved and missed me, but if I said something he disliked or brought up the past, he would bring up the new girl and say how much better she was in comparison to me, how loving and respectful she was and that he didn't have the same control and trust issues he had with me. However, he still wanted me to accept that we could work on the relationship once he moved back to his country (we were long distance) and that it didn't make sense now.\n\nI was still in love and I wanted to work on the relationship, but I told him that I didn't want to be waiting for months until he moved back to his country and that I didn't want to be a second dish and I didn't want to be with someone who was risking losing me. Then, he turned it all against me, and said that he \"had been thinking a lot these weeks and he realized that we were incompatible anyway because I blow things out of proportion\". Subtly implying that the new girl was and is compatible. I then tried to explain that we were compatible but I didn't want to endure his controlling behaviour, and that I couldn't understand how he moved on so quickly, to which he started yelling in the phone that he loved this new girl. He hung up the phone and blocked me on Telegram.\n\nI couldn't bear it anymore. I went NC and blocked him too. He, then, sent a Gmail message saying that \"it was wrong to end it like this, but that he had to respect the girl he was with because she was committing a lot to him, so we should stop talking\". I realized some days later he had unblocked me from Telegram, but I decided to go silent. He humiliated me so much that I didn't want to expose myself to that again. I didn't answer. I just couldn't take it anymore. It was too painful. \n\nHe sometimes streams and plays video games while drinking beer. For a long time, he didn't stream, only a week after I went no contact he started streaming. He is drinking every day and gets really drunk at night. After some weeks, curiosity got me, I was stupid. He knows I sometimes watch his streams, but of course he can't see if I'm actually watching or not. And he just casually mentioned that the girl was with him in his house during the video game stream. She seems to be staying in his house, only 4-5 months after our breakup. It really affected me. I know, no contact means no contact, but I got curious. \n\nDeep down, all of this is weighting on me tremendously. I keep thinking that maybe now he'll be happy, maybe she is actually more compatible, maybe all my sacrifices and effort didn't matter, maybe he actually changed for her... It really affected my self worth. I feel worthless. But then, I see him drinking heavily every day, playing video games for hours while the new girl can't appear on the camera, he looks absolutely bored, she stays in the other room, and I don't really know what type of relationship they have. It doesn't help me much though and I've never felt such punch in my stomach like this one. \n\nHowever, if someone was actually happy, would he drink so much? I remember only drinking a lot when we were in the relationship and had an argument. After I left the relationship, I only drink with friends in some social gathering, never alone.",
        "created_utc": 1670472815,
        "upvote_ratio": 1.0
    },
    {
        "title": "And somebody give me insight into how to deal with a narcissistic landlord",
        "author": "Ghertquxx",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/zex41o/and_somebody_give_me_insight_into_how_to_deal/",
        "text": "I believe that my landlords show signs of narcissistic traits. I am being evicted by them just because I won't pay rent whenever they demand it. If I'm evicted I'm going to end up homeless. I need some sort of assistance on how to deal with these individuals.",
        "created_utc": 1670406458,
        "upvote_ratio": 1.0
    },
    {
        "title": "Where lies the line between boundaries and selfishness/arrogance?",
        "author": "runnerman2",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/zewkqn/where_lies_the_line_between_boundaries_and/",
        "text": "For example if I ignore someone dying, assuming I can easily help them. It will be selfish, I think. But that person doesn't entitled to my time. Or ignoring someone who I can help easily\n\nAnd sometimes some assholes try to guilt trip me into doing something, under premise that I'm selfish or asshole if I don't\n\nSo I want to grasp on ideas, to stop acquiescing into doing what I don't want, in spite of manipulations, guilt tripping, covert basis that I'm selfish, etc",
        "created_utc": 1670404333,
        "upvote_ratio": 1.0
    },
    {
        "title": "Am I the narc or is this narcissistic DARVO?",
        "author": "Awildnoraappears",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/zetfxh/am_i_the_narc_or_is_this_narcissistic_darvo/",
        "text": "So my ex had put spyware onto my devices and methodically psychologically toyed with me until I had a full-blown mental health crisis. He then took the journals (video and digital) showcasing my mental health struggles and blasted them off to paint me as crazy and toxic. I ended up lashing out at him in return and wrote a lot of words I'm not proud of. Unfortunately, he also released revenge porn of me. I wrote a letter to his ex about things he said and did and then he doxxed me and sent people to come harm me.\n\nEver since, I bounce between thinking \"it doesn't matter what I journal, that was none of his business and releasing my nudes is never okay\" and \"maybe I am the narcissist for journaling toxic things and lashing out at him. maybe I'm the bad one for writing the letter.\"\n\nI apologized several times but he never once apologized to me. Am I the narcissist or is this part of his DARVO? I feel guilty all the time and wonder if maybe I should've just not journaled toxic things to begin with. But I also read \"a perfect victim is a dead victim.\" What else was I supposed to do?",
        "created_utc": 1670392208,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do you deal with rejection while dating?",
        "author": "man_eating_chicken",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/zepl16/how_do_you_deal_with_rejection_while_dating/",
        "text": "Even before I approach a girl, I worry that I'll end up with a narcissist because I tend to be attracted only to them.\n\nIf I approach a girl and I get a non-reply, I justify the rejection by estimating that she's a narcissist and I just dodged a bullet.\n\nBut once I break out of that pattern and get a non-reply, I give her the benefit of the doubt that she's being polite and perhaps, I'm just not her type. But that also makes me lazy about self-improvement.\n\nHow do you not operate in this pattern?",
        "created_utc": 1670380040,
        "upvote_ratio": 1.0
    },
    {
        "title": "I should have believed him when he showed me who he truly was the first time, the second time, the third time (insert palm emoji here)!",
        "author": "Iknewbetter2point0",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/zek174/i_should_have_believed_him_when_he_showed_me_who/",
        "text": "Buckle up. This is one hell of a ride of red flags. I'm (42) female engaged to a (51) male for almost 2 years coming up this New Years Eve. It took him 8 years before he proposed. Before I dive into the reasons why I'm struggling with my decision to officially stay or go, let me paint the positive before the negative, so you have a better view of why I am where I am. Here's the glue that keeps me where I am: We're both previously divorced and share 4 children. Two of his children are in college and one is in his senior year finishing up high school. My daughter is in her 8th grade year. They've been in each others lives for 10 years, so their relationships are good and close. They've never seen us argue. They've also never seen us lay on a couch together like most couples do and they don't witness PDA since we're careful not to make them \"uncomfortable\". Ironic since affection is a healthy sight to see for children growing up. A year ago, we both sold our individual homes and bought a home together since we purchased land and planned to build. We put that on hold due to the recent hike in construction costs and interest rates. I've been sleeping upstairs in the guest room when our children are in our home half of the time, so they don't see us sleeping together before marriage; Otherwise, we share our bed when the kids aren't home. We both have successful jobs. We're both financially stable. We had a healthy sex life. When things are good, they're really good. Now that you have a pretty stable introduction, let me spill the tea in very short details since there's so much to cover:\n\n**Red flags before \"us\"**\n\n1. He was married for 16 years. Beautiful, sweet wife. Beautiful home. Seemed to have it all.\n2. He confessed that he cheated on his wife with another woman he worked with in a hospital. She lived nearby in his neighborhood and he used to \"run\" for exercise, but would also \"run\" to her apartment nearby. This \"other\" woman ended up emailing his wife and confessing everything to her. His wife stayed and forgave him. This affair lasted for 1 year? Claimed he didn't have sex with her (insert eye roll here). I've never asked her name. Still don't know who she is.\n3. He confessed that on another occasion another man called his wife (at the time) and told her that he was exchanging inappropriate emails with another woman he worked with. He claims they really weren't that \"inappropriate\" and again, his wife forgave him.\n4. They have a good co-parenting relationship now. I've never had any negative interactions since we've been together with his ex-wife or his children. Peaceful and Stable.\n\n**Red flags since our relationship started in 2013**\n\n1. On Valentine's Day in 2016: Spent Valentine's Day alone. Had a \"gut\" feeling while he was working in the ER and checked his iwatch. Found random numbers and discovered they were escorts he was contacting while he was traveling for work paying some upwards of $300 hr.(Scott was his fake name). He claims he just received \"erotic\" massages from those escorts. I don't believe that for one second! I was having sex with him for FREE and should have been charging $300 hr!!!!!\n2. During this discovery, I also find texts between him and the same woman that he previously worked with (the woman his ex-wife found out about where her husband called about emails). This woman starts the convo out of the blue (you could tell they had not had contact in a few years) about a patient that unraveled into her sending semi-naked pictures later in the convo followed by her telling him to \"delete, delete, delete\" after sending them knowing that he was in a relationship with me. I confront him about everything I found. He denies it of course, but when he realizes I have proof, he confesses. He claims he never had sex with those escorts (insert another eye-roll here). He claims he never had anything physical with the girl he previously worked with. It was all over emails or texts. Whatever.\n3. I leave him. Yes I get tested. Weeks go by and I ignore all communication from him. He begs me to go to counseling and eventually I go to hear his confessions. I still keep my distance except for walks, random dinners, and counseling sessions. I know, I'm stupid.\n4. He confesses that his first encounter with an escort was when he was married back in 2003 and the encounters randomly continued throughout his marriage. His ex-wife never found out and she still doesn't know. He also confesses that he randomly visited massage places for erotic massages.\n5. He confesses he has a porn addiction and he gets his thrill in chat rooms.\n6. He attends some SAA meetings. He pays a crap load of money to go to a 1-week sex addiction in-patient stay in Arizona. He randomly attends counseling sessions with and without me.\n7. I did work on forgiving him. I tried to have some kind of \"understanding\" and I did briefly go \"bat-shit\" crazy, but I also remained calm to try and understand and figure out the clinical reasoning behind his history of cheating. He says he's never been sexually abused. He's always said stress and being overworked in the ER has contributed to his selfish and self-destructive behaviors.\n8. Obviously, trust is gone. I made a deal with myself. That I was going to be the best version of myself. Not going to check his phone. I can't control his decisions. I was a prisoner in my own head.\n9. Somehow we maintained a healthy sex life thru all of this.\n\n**The biggest red flag of them all**\n\n1. 2020 arrives. I'm traveling pre-pandemic in Feb. 2020. I'm in a hotel, have a stupid argument with him over a call and he was an asshole on steroids. Mean in ways that were very clear that gave me an overwhelming \"gut\" feeling. He's screaming at me. Annoyed with my insecurities of me being away in a hotel in D.C. and being forced to \"trust\" him.\n2. I hired a PI the very next morning while I was out-of-town. The PI drove over and watched his house. He didn't see movement for hours and never did.\n3. I fly home. I go over to his house. He acts normal. I ask to use his car to go get food. I meet the PI and he legally places a tracker inside of his Audi ( I felt guilty for lying and doing this!). The PI monitors this device and alerts me to a few places and I try and catch him, but I find nothing. I spent $1500 on this PI over a 3 day period.\n4. Two days later I drive over to his house while he's 2 hours away for work to let our dog out. My \"gut\" tells me \"check his iPad\". I open it. Pretty normal apps. There's one random file on his iPad and I open it. It then leads me to a gmail login and BAM!!!!! the shock of all shockers. I guess my \"gut\" is a better detective than any PI.\n5. I find emails from a secret gmail account and a google voice phone number from google for calls and google chats.\n6. This time it's with MEN. I find craigslist ads. I find chats with other married men that he'd been jacking off with in the sauna at our local YMCA? When I thought he was working out? I find emails when he was traveling meeting up with men in their homes. I find emails that inquire male massage therapists who also give erotic massages. I find emails with random men that he planned to meet up with him at his hotel while he's away at work. I find emails with random married men in the town that we live in and their meetup locations. There's too many stories to list here in what I found. He claims the thrill was in exchanging emails and chats with them and that he's only \"jacked off\" with men in person.\n7. In the emails with the other men, I find that he lies to them too with statements like \"I've never done this before\", etc. etc.\n8. I take pictures of every email I found. I don't forward anything. I calmly kiss our dog that I dearly love a last goodbye. I grab my crap that I left over there for overnights and I calmly leave his house. I was definitely shaking, but I never cried. I felt relief proving myself right once again. Don't get me wrong, I was completely devastated and so confused. I never thought in a million years I'd ever discover anything with men. Heck, I never thought I'd discover anything that I've listed above.\n9. He calls me like he normally does and I lost my crap BUT I never told him what I found. He tried to make me feel crazy. He denied that anything was going on, etc. Like usual, full denial.\n10. I get a sitter for my daughter and I go over to his house that night to \"talk\". He goes into this full pitty party about how depressed he is and a full on show of being a victim, but NEVER confesses to anything and tries to place blame on me. At this point, I stand up and ask for the key to his car. He asks why. He follows me out. He watches me retrieve the tracker device from his car from the PI. I had to get this back or I would have owed $500! and he's pissed. I throw the key back at him and said \"have a great life, Devin!\" Devin was his alias for men. I watched his face turn from red to white. I unleashed a verbal disclosure of everything I found and he just stood there in shock. It was a freaking slam dunk to witness. I walked out.\n11. He blew my phone up. He emailed and texted me non-stop and he begged me back to counseling once again. I show up again just to hear his confessions and work with my emotions and try to wrap my head around what I just found.\n12. He confesses that he's had sexual encounters with other males in his adolescence. He confessed one with a best friend from his childhood. He confessed one with a guy in college. Who knows who else over the years. Again, another secret. So now I deal with everything else above and now that he's secretly bisexual? This isn't about him being bisexual. This is about holding HUGE secrets and never disclosing them and living a double and triple life throughout our relationship.\n13. Pandemic is in full-swing. We were apart for 5 months besides random walks with the dog. This put me in a difficult position. I had so much anger and hurt, but I'm also forced to hold my crap together and be a \"friend\" holding his biggest secret while he's seeing patients thru a pandemic. Not really an opportune time to be a raging woman. I worked from home and there wasn't travel or normal things I could do to get away from it all or move on. I was stuck dealing with all of this during a pandemic. I once again found myself being the supportive \"friend\" to him.\n14. July 2020 rolls around and our friendship obviously finds its way back romantically although not physical.\n15. He attends some counseling, but nothing different than before. Months go by and he proposes on New Years Eve. I know, I know.\n16. Months go by and it's been 8 months of things being the best they could be considering. I could get an academy award for keeping my crap together physically and emotionally.\n17. Here comes February again. It's the month I never look forward to since it certainly has a reoccurring theme and reminder of the previous years.\n18. I get another horrible \"gut\" feeling. This time it's different. I can't pinpoint how I got to this point, but I'll just say that my \"gut\" is the true legend here!\n19. We're best friends with our neighbors. My daughter and their daughter are best friends. We do everything together. We travel together. We spend holidays together, etc. They are the only people who knew about his previous cheating minus the men part. Things are normal and awkward at the same time with them. With everything I've been thru, I can read him and other people like a damn detective. It's a talent I wish I never knew.\n20. This \"gut\" feeling just keeps nagging me, so I start to interrogate without any evidence other than what my gut wanted me to find out. This time I'm wondering-- is it with her or him? or both? Suddenly I find myself wondering if I should be jealous over a woman or a man? I've got double the insecurity in a way I can't explain. And now with our best friends? Craziness.\n21. He denies, denies, denies. But the awkardness continues. Almost like all 3 are putting on a show for me while hiding a secret. I won't let this go and tell him I already know and he has no other option other than to tell me. He interrogates me to try and find out what I know. I actually know nothing other than my \"gut\" feeling.\n22. I don't give up. He finally confesses that while we were \"off\" during those months of not being \"together\" he got naked in their hot tub, playfully kissed my BFF neighbor, and touched her breasts while her husband watched??? He swears it was a drunken night and it didn't go any further. He also confessed that he had chat room like experiences with them? What does that mean? Like you watched them have sex? but you didn't participate? I must be SO STUPID!\n23. I send them all a group text and I demand answers. Our BFF neighbors are in full denial while I hold them accountable with my fiancé's confessions. They still deny everything even with me telling them what my fiancé had already confessed. I still don't know the whole truth. I haven't spoken to them in 2 years since he sold his house next to them almost two years ago.\n24. I lost a best friend. My daughter lost her best friend. We lost our best friends, but here I am still with him? I'm an idiot.\n25. He came into our engagement with yet another secret that he would hold. Even after all the above, he still chose to keep a secret. He came into our engagement with more hiding. I still don't have any of that full truth.\n26. In June 2022, I had my IUD removed to help manage my hormones and get myself as normal as possible both emotionally and physically. I asked him to get a vasectomy. He waited 4 months to actually do it.\n27. Besides frequent oral sex, I haven't had \"sex\" with him in 6 months. He never bought condoms and seems completely fine with just oral sex even though I thought we had a really good sex life. I can't believe I'm even able to type this after the risk I know I take!\n\n**So here I am...**\n\n1. I live in this house with him and my sweet teenager who thinks he's the best thing ever. My daughter has a horrible home life with her Dad and Stepmom and I know I've stayed to keep peace for her since she loves my fiancé. We have a peaceful home. She has no idea the hell he's put me thru. She's extremely mature emotionally. She can see that I'm struggling even though I think I'm the best actor. If she knew everything above, she wouldn't want me to stay, but yet I can't explain the real reasons why.\n2. We live life like nothing has ever happened. We've had a few blow up arguments, but there's only been 3 in two years. We don't go to counseling. He has no accountability. He doesn't see a counselor and since the BFF discovery, he's only confessed to watching porn. He claims he's doing \"well\".\n3. Since I've been engaged, I've never planned a wedding even though he will randomly ask when we are getting married. He would have married me yesterday if I would have planned it, but yet again, my GUT won't let me plan a wedding.\n4. We tried to build a house. That door was shut. We've put in offers on beautiful million dollar homes. That door gets shut every time. I went as far as trying to plan a destination wedding a few weeks ago for after Christmas--and I can't follow thru. My gut won't let me.\n5. I continue to hold these secrets from her and everyone else in my life.\n6. Ironically, I love him. How is that possible? It's like a love addiction with so much commitment. I struggle using the \"I'm being emotionally abused\" card, but I have no other way to describe this situation I'm in.\n7. I've been 100% faithful to him thru all of this. Not a single thing even happened while we were apart during our breakups. I'm BEYOND committed to someone who's shown me he isn't committed to me.\n8. I have so many good days. I have so many bad days alone inside.\n9. I make six figures, I'm educated, I'm not sitting around crying. In fact, I just never cry anymore. I'm just numb and going thru the motions while trying to have the most normal, best life possible with what I know and have been thru.\n10. You know what I'm not going to do? Play detective again. My \"gut\" feeling is back and I don't have the energy to chase it. I also don't have then energy to leave.\n11. I know that my daughter would lose the only siblings she's ever known and a stepdad she loves dearly. Turning her life upside down again after my divorce from her father feels absolutely devastating for her. I don't want that for his 3 children either.\n12. Just writing this out to see the unreal stuff I've been thru has been therapeutic in itself!\n13. Narcissist. Manipulative. Emotionally abusive. What. AM. I. DOING???\n\nAnd the question everyone keeps asking is \"when are you going to get married?\" I must be CRAZY!",
        "created_utc": 1670365393,
        "upvote_ratio": 1.0
    },
    {
        "title": "will i ever get my old self back",
        "author": "grasshopper099",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/zegh81/will_i_ever_get_my_old_self_back/",
        "text": "I was going througb videos of earlier this year before I dated my narc and I was so fearless in them and so happy. I wasn't scared of how I was being perceived and I remember how it was not feeling like my every move is being watched. It's being 3 months since the final discard, been in therapy for 2 months but it just doesn't look like I'll get her back, I might become a different person but not her, i guess.\nA friend randomly mentioned, 'when you'll fall in love again' and my response was that 'i dont want to fall in love like I've before again'. I've become so calculated, so cautious. I have cptsd from an N-dad but my Nex just enhanced it all i dont know. But will I ever become the full of life/joy person again?",
        "created_utc": 1670357020,
        "upvote_ratio": 1.0
    },
    {
        "title": "Ex MIL reached out through my adult child.",
        "author": "Brixton75part2",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/ze4yn4/ex_mil_reached_out_through_my_adult_child/",
        "text": "My ex-mil, mother of the narcissist has sent me a message through my adult child. \nThis woman stood behind her son in family court when I got an oop after he told me he would kill me after forcing his way into my new home. \nThis woman was also the only one who stood up for me when her son would rage often taking on the abuse for doing so.\nThis woman also has access to 2/3 of my kids who are alienated from me and as far as I know has done nothing about it.  \nI am conflicted.  I am angry.  I am sad. \nI believe I should respond but I am a huge tangle of emotions and do not know how to proceed.  \nPart of me wants to tell her to foad part of me wants to write her part of me wants to just ignore it all and wish she would go away. \nCan anyone offer advice, please?",
        "created_utc": 1670328461,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to deal with gf's narcissistic friend?",
        "author": "Peanut4334",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/ze19ql/how_to_deal_with_gfs_narcissistic_friend/",
        "text": "On Saturday I had to spend five hours with a narcissistic ex-friend who my gf is still friends with. Having to tolerate N's cruel sense of humour, negative remarks and distortion of reality (where she's the smartest, most attractive and most amazing person in the room instead of a mean borderline alcoholic and a gambling addict with a trail of broken relationships behind her and a body that shows her unhealthy lifestyle) left me feeling angry, hopeless and trapped. She doesn't even try to hide these behaviours, but sadly my gf believes N's words instead of her actions so N can behave as badly as she wants but according to my gf \"she didn't really mean it\", \"it was a joke\", etc. I've seen my gf in tears twice because of this person and frustrated countless of times, but it's like the dots don't connect in her head. She still thinks N is a good friend of hers.\n\nMy gf is amazing and we have a great relationship, but N's presence in our life is driving a wedge between us. To keep the peace I've stopped trying to get my gf to see my side of the story and I've given N several chances, but it's killing me inside. I don't want this person in my life but it's impossible since my gf doesn't take her toxic traits seriously. I keep my distance and see N maybe 3-4 times a year at parties, but each encounter leaves me reeling for days. I keep my feelings locked inside because I can't talk to my gf like I normally would.\n\nAny advice on what to do?",
        "created_utc": 1670317714,
        "upvote_ratio": 1.0
    },
    {
        "title": "is it just my experience or are narcissists…not funny?",
        "author": "WillingnessRelative2",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/ze0sbt/is_it_just_my_experience_or_are_narcissistsnot/",
        "text": "i’ve dated overt and covert narcs over the years. you’d think i’d be an expert at this point but i fell really hard for the last covert narc and refused to acknowledge the red flags and he didn’t follow the pattern i was looking for in the beginning: mostly the fact that there was no love-bombing so i assumed i was safe. jokes on me, it ended up being one of the most painful experiences of my life.\n\nreflecting on my time with them, i realize that none of them were very funny. they don’t have a good sense of humor and if they find something funny it’s usually very dark. \n\nhave y’all experienced this too?\n\ni thought about this because my best guy friends make me laugh SO hard and i want that in a partner as well. i actually just got home from a first date and i don’t think i’ve ever laughed so hard so many times. it was really fun. \n\nanyway, what are y’all’s experience with narcs and their sense of humor (or lack thereof)?",
        "created_utc": 1670316203,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do you deal with friends in your life that still engage with their narc parents despite moving out?",
        "author": "vfcspider",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/zduny7/how_do_you_deal_with_friends_in_your_life_that/",
        "text": "I get that no contact isn’t a viable option for everyone. But I have this friend who moved out to a completely new city and who told me all about how their mother is a narc. Then I see on instagram that they’re spending time quality together. I get social media can be fake. But it makes me uncomfortable.\n\nI already set boundaries with them , telling them I have no emotional capacity to support them with this and asked them if they wanted resources on narcs and they said yes so I sent them all. I’m concerned for them. Honestly more then anything but it doesn’t feel like my place to say anything anymore and maybe they were wrong about the mother being a narc.\n\nIts true I don’t have the emotional capacity. I’m going through my own shit right now so I’m just watching everything unfold from a distance and I’m putting distance from myself and this friend once while I figure things out\n\nI only met the mother once, but they practically ignored me the entire visit and I had a weird feeling about it. If they’re a narc maybe they sensed I could see through their bullshit? And thats why they distanced themselves from me. I told my friend how sometimes their parents behaviour seems like a red flag to me but thats all I said.\n\nAnyone have advice for this situation ? Wondering if its okay if I just don’t engage with it at all. My friend and I don’t generally talk about these things anymore. Since we have lots of mutual hobbies, thats what we talk about instead nowadays",
        "created_utc": 1670299390,
        "upvote_ratio": 1.0
    },
    {
        "title": "Boyfriend doesn’t want to educate himself like I do",
        "author": "Different-Eye-1061",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/zdu56o/boyfriend_doesnt_want_to_educate_himself_like_i_do/",
        "text": "My boyfriend and I both divorced from cluster b spouses. His ex wife in particular has NPD. I have healed (am still healing) largely because I have thrown myself into learning about NPD and BPD for the past couple years now. He has been receptive to much of what I’ve learned and has woken up due to it (to better boundaries, etc) but overall would rather not read about it, think about it, discuss it, put time on the matter. He and his ex are actively part of the same social circle and end up at many social events together. His ex hates me. For me, the more I learn and read and think about it, the better armed and protected I feel. And I want to talk about it with him so we are prepared. He wants me to forget about her, ignore her, and just have a good time. I can’t really seem to be able to do that. I can of course choose not to go to any events she is at,  but that would mean that my very social and fun loving boyfriend would go to nearly every social event alone and I feel badly about that. I want to support him and enjoy his friends with him (though I personally don’t care to go for my own sake). I don’t really know how to just forget about it and not worry. And part of how I protect myself is to obsess over the information about NPD so that I’m “ready”. I guess I don’t have a question but just want to vent. How would you all handle this?",
        "created_utc": 1670298105,
        "upvote_ratio": 1.0
    },
    {
        "title": "Triggered by a Movie",
        "author": "ImpressiveSentence26",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/zdrj8y/triggered_by_a_movie/",
        "text": "I've been NC with  Nmom and Enabler Dad for 4+ years. I left my NEx 1.5 years ago.  I did EMDR and have been feeling great.  I processed through the trauma triggered me today. \n\nI watched The Luckiest Girl Alive on Netflix.  There was a rape scene that resonated with and bothered me.  However, I've seen similar scenes before and have been able to handle them.  The scene that really got to me was when the victim's (Mila Kunis) mother (Connie Britton) blames her daughter for getting raped and is more worried about her image than the fact that her daughter was raped.  The words that the mother said to her daughter in this movie were almost identical to what my mother said to me 32 years ago when I was raped.  I got teary eyed and had to stop watching.  I'm handling it better than I would have pre-EMDR.  But, I'm just sad, a little angry and emotionally drained.  \n\nI have a therapy appointment next week.  I'll call if I need to go before then.  Thank you all for the space and opportunity to vent and discuss this.",
        "created_utc": 1670291658,
        "upvote_ratio": 1.0
    },
    {
        "title": "They’ve Started to Try and Get me Back",
        "author": "Soggy_Lavishness_273",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/zdlzt8/theyve_started_to_try_and_get_me_back/",
        "text": "Think it finally hit them I’m not returning. \n\nThey were clever tho, they sent a letter with no return address (intentional probably) \n\nLuckily for me tho the PO office is 3 minutes away from me, so I went there, they said the best they can do is trash it, so every letter without an address is going to be opened, confirm the sender, taken photos of. \nIn case I need to build a Restraining Order case for later \n\nReading stories here and in other narc abuse survivor Reddits has helped me to expect this, and know how to prepare, should it escalate. \n\nSo thanks all.",
        "created_utc": 1670278909,
        "upvote_ratio": 1.0
    },
    {
        "title": "Any good books on how to get over the \"fawn\" response?",
        "author": "Amelora",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/zcorx1/any_good_books_on_how_to_get_over_the_fawn/",
        "text": "",
        "created_utc": 1670194748,
        "upvote_ratio": 1.0
    },
    {
        "title": "Dating a non abusive and loving person is incredibly triggering",
        "author": "taway7440",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/zclsle/dating_a_non_abusive_and_loving_person_is/",
        "text": "My parents are Narcissists and I'm recently out of a relationship with someone who had very toxic patterns of abuse. My previous dating experience with men has been mostly negative as well. Probably because I was seeking out men who were toxic due to my trauma bonding, abuse and neglect in childhood.\n\nI'm now dating a guy who has a healthy attachment style and is showering me with love, care and affection.\n\n\nAnd spending time with a loving, nice person has been extremely triggering to the point where I want to stop seeing him.\n\nI don't understand WHY he is being so nice to me. \n\nI constantly keep waiting for the other shoe to drop and devaluing the nice things he says and does in my head, thinking I'm going to see \"the real him\" later. I'm not enjoying falling in love because I'm literally terrified I'm going to get hurt again.\n\nI don't know how to cope with this and am scared I'm damaged for life.",
        "created_utc": 1670188231,
        "upvote_ratio": 1.0
    },
    {
        "title": "Question - An acquaintance I've spent 4hours with, has called me and cried their heart out on my sleeve for over an hour. Is that a red flag?",
        "author": "FinallyFreeFromThem",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/zcgntt/question_an_acquaintance_ive_spent_4hours_with/",
        "text": "This is just someone I know through a group of friends, much younger than me, and we've legit spent like a part of 2 afternoons around each other before this happened.\n\nAsking because trying to prune out all Ns from my life, but have been surrounded by Ns until now, so not sure what \"normal\" looks and feels like.\n\nBTW, this experience left me emotionally drained like when Nsis used to hurl abuse at me during hours on end, but this wasn't abuse per se (no insults directed at me), just one person feeling very sorry about themselves on many accounts of their life (some are legit, some seem odd, like when an N doesn't tell the complete nor accurate story), and spilling it. At minimum they have zero boundaries. But even so, isn't it strange that they'd act like this?\n\nRed Flag? Should I keep that person at arm's distance?",
        "created_utc": 1670177014,
        "upvote_ratio": 1.0
    },
    {
        "title": "Narc admitted to his abuse",
        "author": "Amboose123",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/zcedme/narc_admitted_to_his_abuse/",
        "text": "My ex just admitted to his abuse through our coparenting app. He said he watched the Maid on Netflix and realized how I could feel like he was abusive, that he could do better, and how sorry he was that I felt scared. He also said that it doesn’t absolve me from my part in the situation. I feel like this is a form of manipulation. I want to give him the benefit of the doubt, but that always gets me nowhere. What would you do? Should I even respond?",
        "created_utc": 1670171929,
        "upvote_ratio": 1.0
    },
    {
        "title": "I still miss her after a year, what should I do?",
        "author": "jaydalogar",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/zbtnom/i_still_miss_her_after_a_year_what_should_i_do/",
        "text": "I got out of a toxic relationship around a year ago and have been missing my ex a lot lately.  \n\nI see her around as we live close to each other, we first together 5 years ago but I broke it off as I found out she was engaged to someone else. During that time she got divorced and I stupidly took her back a few years later, she did admit to being in multiple relationships and talking to other guys since then. \n\nBut I broke it off a year ago We got close and had some nice moments but I kept noticing how open she is with other guys and how she'd claim that every other guy was interested in her, she kept pushing me for marriage and kept blaming me for moving too slow just because I didn't want to rush in to marriage. \n\nEverytime we'd argue about it, she would always say that it's my fault that things are moving slow and that she doesn't like being with someone who can't commit.\n\n She would always say how she wants someone who loves her more than she loves themselves, that's not normal right?? And She always used to say that she wanted me to open up to her and tell her how I feel and that I can talk to her about anything if I'm ever upset. \n\nSo I did when I mentioned that I didn't like how open she is with other guys, she said that she didn't want to be with anyone that's insecure just like her ex husband was (even though she'd already cheated on her ex husband with me which was unknown to me at the time, so he had a reason to feel insecure). \n\nI don't get why she'd tell me to talk to her about anything then end up throwing it back in my face! I told her I'm not happy so we agreed to end it, I was confused at first cos she used to tell me that she misses me everyday and after that conversation she ended up blocking me off everything at the startwhich I thought was childish. \n\nAfter we broke up she messaged me on Christmas day saying: 'I just wanted to message you to say that I hope you’re okay and that I feel as though I’m ready to stay as friends with you if that’s what you wanted.. I didn’t think I would ever be able to say that we could stay as friends but I feel like I’m in a good place and I know everything has worked out for the best and I would be really happy to have you as a friend But if you don’t want to hear from me that’s okay too just let me know x' I did reply to her saying that I don't think it's a good idea and I wished her well. She just replied with a simple 'that's fine no worries x'. \n\nI'm trying to not think about her messaging me, but I feel like I was really getting in to the healing process and was really focused on other aspects of my life such as my career. I know I deserve better but I see her quite often as we live near one another and I can't help but still feel hurt and a part of me still misses her. We were quite sexually active together and i think thats whats making me miss her more. \n\nI know I won't probably move on straight away but I don't know why I'm still hurting over someone that is so toxic for me. I blocked her on social media a few months back but was debating to whether unblock her or not. \n\nI do feel like I have enough anger for the way she treated me to be able to ignore her. I do still feel angry over the situation, not sure if that's normal or not. I have my own auto detailing business which I run on the side of my career and on the weekend, I have a social media page for it and I have set it as a public profile because it is only for business content and I never out anything personal on it. \n\nA few days ago I put up a story on that page regarding a job I was working on and noticed she had viewed all of the stories that I posted, I found it weird that she did this because she unfollowed my business page when we broke up and hasn't paid attention to it in the last 11 months. \n\nI sometimes feel sad as I'm alone and haven't dated anyone since her, I often see her around and feel as though I miss her but I know those feelings are only from loneliness so I have every intention of staying away from her. \n\nI've tried keeping myself distracted by focusing on my career and business, she has tried messaging me a couple months back by sending some charity chain messages although they could be her way of breadcrumbing? I always see her around as we live near one another, there were times where I used to try and get her attention because I missed her but now I just feel angry because I feel like I let her get away with a lot. \n\nI saw her a few days ago and she saw me too and she messaged straight after saying 'hope your good', i don't understand why would she do that I keep seeing her around and I know deep down I know I shouldn't let her get away with treating me do badly, I miss her and sometimes feel stuck. I miss her, should I get in touch with her",
        "created_utc": 1670108909,
        "upvote_ratio": 1.0
    },
    {
        "title": "I'm supposed to be happier...",
        "author": "FukudaSan007",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/zbqtcb/im_supposed_to_be_happier/",
        "text": "I'm supposed to be happier without my former narcissists but I'm not. I was married to one for 10 years and only 5 months after we split (nearly 4 years ago) I got into a relationship with ANOTHER one. I didn't know she was for a long time. After our first argument (a minor one) she became a different person. Completely unhinged. Rages. The whole nine yards. I eventually ended it. That was two years ago. Now I'm divorced. Completely alone. No friends. No support network. Severe depression and heavily medicated with several pills a day that don't seem to do anything. Middle aged. What a cliche. I work from home and I rarely leave. It's like being on house arrest. Isn't life supposed to be better without your narcissist(s)? When I think back on those relationships I was much happier than now. Don't get me wrong- I don't want to date or marry another narc. But at least back then I had companionship and a sex life. I realize that sex is about the only thing a narc brings to the table but it's at least SOMETHING. Now I just have endless days alone with only my cat for company.The only people I interact with in person are cashiers. \n\nAm I alone in this? DAE feel that life was better WITH your next? \n\nTL;DR Isn't life supposed to be better without your narcissist(s)?",
        "created_utc": 1670101879,
        "upvote_ratio": 1.0
    },
    {
        "title": "Received birthday gift from nDad 1 yr after no contact, felt nothing, threw it out",
        "author": "msmintcar",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/zbhent/received_birthday_gift_from_ndad_1_yr_after_no/",
        "text": "Just wanted to share and hopefully encourage others to take care of themselves, maintain the boundaries they set and that it does get easier.",
        "created_utc": 1670077342,
        "upvote_ratio": 1.0
    },
    {
        "title": "Seething with anger at possible N landlord",
        "author": "ElevenForPresident84",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/zbfdxz/seething_with_anger_at_possible_n_landlord/",
        "text": "I wrote about him recently here. He owns a condo and is renting out his two extra rooms to me and another woman. He lives here with us. The other night he absolutely blindsided me when he announced that my tenancy (I am not on a lease) has been always expected to end in mid December. I moved in in mid September of 2022. He says that his two daughters and granddaughter are coming for a month long visit and he needs my room. The other tenant has been here longer and is apparently being allowed to stay.\n\nWhen I protested in shock that I had NO IDEA I am supposed to move in 2 weeks, he \"generously\" extended this date to early January. According to him the ad he posted included that the rental was very short term, 1 to 3 months. I think he is blowing smoke up my butt bc he doesn't want to be accountable for making such a dick move. He is rewriting what happened so that he is not the bad guy and I can't be mad at him.\n\nThe more I process what is happening the more his story doesn't add up. His two daughters live across the country. He just visited them in October so it's not like they haven't seen each other in a long time. One has a school age child. Doesn't the child have school? How are these two women able to leave their lives and responsibilities for a month (\"or so\" he says) and who does this kind of travel in January? My bedroom is small and I wonder how the 3 of them are going to fit in here. His story just doesn't hold water.\n\nHere is what I suspect is the true story. While his family may be coming for a visit, I think there is another person coming for a longer undetermined time and that is why I am being told to go. He has a couple of long distance romances with women overseas, one in China and one in Paris. He's told me before that both want to come to visit him and possibly move here. The one in Paris he is more involved with and she is the one I think was suddenly able to arrange a long visit and he offered my room so she has space and privacy while she is here. It makes so much more sense. He may not want to own the truth to me bc then he would look like a real asshole.\n\nThis has created an urgent situation for me but he seems cheerfully oblivious. I think he's been quite selfish about the whole thing but I don't pick up any genuine remorse. I had to explain to him that even if I wanted to move it would be very tough bc this is the worst time of year to find a rental. It's the holidays and property owners are wrapped up with their families and traveling etc. They don't have time to find tenants. Our city has a very competitive rental market anyway and finding a place can take time. He has put me in a very bad situation. He offered to contact a friend who owns a few Airbnbs to at least secure me a temporary place to stay but then said he may not remember so I should text him a reminder. I wanted to throttle him.\n\nThe way he has rewritten things in order to shield himself from any blame is something I have seen him do this before but on a much smaller scale. I have had to accept that I cannot expect honesty from him or accountability. I don't trust him. He is now saying I can come back once his visitors leave but won't give me a date. I am not in a financial position to move right now, at all. The dishonesty is the worst part and it confirms all of my worst suspicions about him. He is showing his true colors.\n\nDoes this sound Narcissistic to you? Have you dealt with a Narcissistic landlord?",
        "created_utc": 1670071279,
        "upvote_ratio": 1.0
    },
    {
        "title": "Never again",
        "author": "ludabote",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/zb7qzw/never_again/",
        "text": "I made a friend recently, super nice and sweet person… and then I met their spouse. \nTheir spouse is basically my nex. I felt like I was in his presence: the way they diminish, insult, boast about themselves, constantly talk about how much money they have and their credit score, how much better they are than everyone else, and how my friend has nothing in their name bc they are bad with finances. ALL THE 🚩🚩🚩🚩 and the some of the exact ones I missed with my nex. And my friend just nodded and smiled. No voice. Emotionally and financially abused. My poor friend. I truly hope one day, they see the light and break free. \nWhen the narc left the table for a second I wanted to say: RED FLAGS! \nBut I couldn’t.\nThey both wanted to meet up again, but I can’t. I cannot be in another narc’s presence again. I just can’t. I can’t do that to myself. \nMy friend seems like such a nice person. But I can’t. \nI feel paralyzed and sick. And angry. All over again",
        "created_utc": 1670042276,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why does it feel so excruciating when your narcissitic partner moves on so easily and falls in love again?",
        "author": "Lalalagem",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/zb2vin/why_does_it_feel_so_excruciating_when_your/",
        "text": "I could understand every wrongdoing in the relationship. I could understand his extreme control towards me and him making me give up on my social media, clothes or celebrations, getting mad if I wanted to start something new like going to the gym or doing my master's degree. I could understand his paranoia and rages when he was accusing me of cheating or hiding something, just because I didn't have time to update him with pictures throughout the day or my phone got suddenly muted. I could even understand how he started punching his own face, bruising it, when I tried to leave him. There were so many indicators and red flags to leave earlier, and I didn't do it.\n\nBut believe it or not, I ended up thinking that all of those symptoms he was having were a consequence of his intense love for me. After I couldn't take it anymore and I left, it only took him 2 days to get over me when I left after being manipulated, controlled, gaslighted and accused unfairly for two years. He loved me intensely, he said. He loved me more than anyone, he said. His threats of suicide after I left, even if they were extremely scary, reminded me that deep down this person may love me very intensely to have this reaction. \n\nBut in only two days I was replaced. In a month that girl became his girlfriend and he fell in love with her, while getting filled with resentment and hate towards me for leaving. He would constantly remind me how good she was just because I made the mistake of engaging with him after the breakup. He would continuously remind me how better and more loving and sacrificial she was when he was upset because I tried to make him accountable for his mistakes with me, while also telling me he wanted to restore our relationship (but without leaving the new girl). If he was upset, he would tell me things about the new girl, that he loved her and she was committing so much to him. \n\nThe only times he would do that where when I would get fed up with his false promises and future faking and decided to cut him off. \n\nI feel it killed me. When he shouted on the phone \"I LOVE HER\" just because I tried to point out how hurtful it was for me to see him moving on in two days. When he was threatening to hang up the phone if I denied how he rewrote the past or reminded him of how he controlled me. He didn't want to have that burden, or that shame. He told me my resentment was a burden on him, but I was just discussing the past, not even being resentful.\n\nHe fell in love in a month, I became a selfish, incompatible in his eyes, and absolutely replaceable. He talked about \"how we need to stop communicating because he needs to respect the new person\" only when he was getting angry at me. Only a week before he was telling me he wanted to restore our relationship once he moved back to his home country, but now he \"loves this girl and needs to respect her\", only because I didn't accept his narrative of what happened. \n\nFour months after the breakup and I haven't had the opportunity to find a connection with another person. I honestly feel destroyed.\n\nI thought all we had was real. I got attached, I loved him with every piece of my being. I don't understand how people can fall in love so easily. Why is he doing all of this?",
        "created_utc": 1670027507,
        "upvote_ratio": 1.0
    },
    {
        "title": "Anyone's narc started collecting evidence to use against you from day one?",
        "author": "Zealousideal_Top1715",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/zb1m9c/anyones_narc_started_collecting_evidence_to_use/",
        "text": "From the day I started dating my ex, he would secretly record our conversations and then after the breakup used every conversation that makes me seem gross, crazy, or toxic to smear campaign me and spread it out publicly. People started coming after me to harm me and make fun of me.\n\nI just don't understand why he ever dated me of his goal from day one was to just gather evidence to destroy me with and paint me as the abuser.",
        "created_utc": 1670024050,
        "upvote_ratio": 1.0
    },
    {
        "title": "Debating whether I should break no contact and go back to living with my parents",
        "author": "SoybeanVee",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/zarr8d/debating_whether_i_should_break_no_contact_and_go/",
        "text": "My lease with my roommate is ending soon. I can’t find any place to live. Theres a housing crisis and the rental market is insane where I live. Everyone I know, is in a similar situation as me or have tiny places and can’t take me in. Most places I apply too reject me because I’m on social benefits and I’m not a student or working currently due to disability. I’m supposed to start school in January, just for 3 months. I thought that would make me eligible to get student housing. But I called the office and they said since its only going to be for 3 months. They can’t help me find anything.\n\nI’m in this position because my parents kicked me out in 2020 because they wanted to break lockdown and not follow covid regulations. They wanted to travel abroad during lockdown. I told them that it wasn’t a good idea and they would spread covid to everyone else living in the house. I got kicked out as a result. Stayed with a family friend who turned out to also be a narc, then I couchsurfed and lived in a shelter before finding my current place. I’ve been looking for places since. Since this was supposed to be a short term solution but I got the lease renewed for 2 years and now the landlord said they will not renew my lease anymore. There was a period of time when I moved out from this place but I needed up having a narc roommate so I came back to live here. \n\nI’m debating now whether I should go back to my parents home and break no contact. Theres no guarantee they won’t kick me out again. I don’t want to end up living on the streets. I’ve tried to apply to some shelters but they have super long waiting lists. This is so stressful",
        "created_utc": 1670001556,
        "upvote_ratio": 1.0
    },
    {
        "title": "triggers",
        "author": "grasshopper099",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/zagjge/triggers/",
        "text": "it's been 3 months since the final discard and the smear campaign against me is still ongoing v strong. it takes everything in me to not engage with it but everytime someone reaches out asking about it i get palpitations. I've to set a boundary with a new person every other day, to not tell me anything about me and that I've no story to tell and don't have the energy to defend myself.\nit's exhausting and triggering, why is he not leaving me alone.",
        "created_utc": 1669971490,
        "upvote_ratio": 1.0
    },
    {
        "title": "is this an emergency or a hoover?",
        "author": "Inside-Huckleberry80",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/zaevrr/is_this_an_emergency_or_a_hoover/",
        "text": "Hello everyone,\n\nI am 3 years no contact and then I wake up to an email subject heading saying \"urgent\" and I go to open it and it's my ex's sibling saying they need to talk to me and call me at this number. This was so out of the blue and I just panicked, because I got triggered with the urgent headline and started to worry that something happened. 3 days later my mom told me she got a text from my ex's sibling saying if I could contact her but it didn't indicate any urgency like it did in the email. \n\nIs this a hoover attempt??  I didn't respond but I am riddled with anxiety and worried if something happened. Why didn't my ex just contact me directly which is where the confusion lies.\n\nThank you",
        "created_utc": 1669965779,
        "upvote_ratio": 1.0
    },
    {
        "title": "Not sure if no contact was the right choice :/",
        "author": "SoybeanVee",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/za4p5f/not_sure_if_no_contact_was_the_right_choice/",
        "text": "I grew up rich, I was essentially a trust fund kid, everything in my life was set. University was paid off, my parents owned rental properties I could live in, money and had loads of connections, etc. But it came at a cost. They were severely abusive to me in all aspects. I was the black sheep of the family. In 2020, during lockdown they kicked me out. It was then I went no contact and I lived in a shelter and couchsurfed until I found the current place I am currently living in. I got on social welfare and disability. I gave up my trust fund when I cut ties so I am poor.\n\nBut now I’m faced with reality. If I go study in university, I have to pay for it myself and I also have to deal with all my expenses, a job, while managing multiple chronic illnesses with basically no support since I had to cut almost everyone out. I will be starting school soon though, but it’s not a university. Just a trade school that caters to the disabled.\n\nI’m also at the threat of constantly being homeless. Theres a housing crisis where I live and the rental market is crazy. I got lucky where I currently live but now I have to find a place to live. My lease is ending and I’ve been looking for places to live. Its so hard to find something. No one wants to take someone who’s on social welfare. I keep applying to places and keep having the same problem. I even once tried to stop telling people about it. But realised it was a waste of time because as soon as I visited a place and told them I’m on social welfare. They reject me anyways. I don’t know what I will do once the lease ends. Everyone I know is also in a similar situation and struggling with housing. So no one can take me in. I guess I’ll go back to the shelter. I’m going to continue looking regardless of everything but its a struggle.\n\nThroughout this whole process I keep thinking of my abusers and wondering if I should break no contact and go back. I question my decision to go no contact. If I go back, at least I won’t be homeless? But it comes with a significant cost to my mental well being and they kicked me out once already. They might just do it again…\n\nJust wanted to vent about this somewhere. I do see a therapist regularly.",
        "created_utc": 1669939295,
        "upvote_ratio": 1.0
    },
    {
        "title": "The emotional needs I learned after moving out",
        "author": "Imconfident1001",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/z9wgom/the_emotional_needs_i_learned_after_moving_out/",
        "text": "1)vulnerability about sensitive topics without fear or judgement. \n\nfor example, \nI can easily talk about to one of my friends why i don't follow my current religious beliefs anymore although she isn't agnostic. \n\n\n\n\n2)non judgmental\n\nFor example ,i can express myself without second guess to her about my opinions \n\n\n\n\n3)support my decision no matter what \n\nFor example, i did a wrong decision not like purposefully but when i told her she took my side and like i don't have to over - explain she just understand naturally. \n\n\n\n4) priority \n\nLike when we plan to meet on last minute she doesn't make excuses so here i understand that thing called priority \n\n\n\n5)Mental peace \n\n\n\n6)real praise, compliments not love bombing \n\nFor example, i did light makeup but she just said to me like i look pretty in this outlook in this weather. \n\n\n\n7)Feeling energetic or feeling emotionally fulfilled after \n\nFor example, i met her at 4.30 pm we talked and talked like it's 8 pm in the blink of eye .\n\n\n8)Laughing or jokes \n\n\n9) Accept me for who I am and appreciate me\n\n\n10)Happy / peaceful vibe/welcoming energy. \n\n\n11)Argument can be solved respectfully. \n\nLike ,once i had conflict with my roommate but she didn't shout at me or didn't did any verbal abuse or wasn't passive aggressive, she just said things assrtively so from next time i try to maintain that\n\n\n\n\n12) open minded or open to new ideas \n\n\n13)Support my goals or vision \n\n\n14)Respect boundaries naturally \n\nlike when my friend ask something i said right now i don't want to talk she didn't force me to know about the topic, she just said oke let's talk about other topics.\n\n \n\n15)Equal give and take of effort. \n\n\n16)Forgiveness \n\n\n17)Can express playful self around them easily. \n\n\n18) emotionally safe \n\n\nThose things i learned from my emotionally available friends who actually helped me to understand my own emotional needs .",
        "created_utc": 1669921502,
        "upvote_ratio": 1.0
    },
    {
        "title": "Sappy",
        "author": "Mindbodyconnection3",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/z9vjih/sappy/",
        "text": "Y’all I’m finally ending the relationship with my narcissistic mom. \n\n25 years of abuse. Abuse from her and abuse from me. Boy has it been a journey. \n\nI have not been able to end the relationship because there has always had residue feelings for her I couldn’t let go of. Guilt, hatred, responsibility, fear. \nI have finally worked through the worst of them, and that was acknowledging my part in the abuse. I was using her for money knowing dam* well I didn’t like her. The guilt and denial from this has kept me stuck in the relationship for an overdue amount of time. \nLooking my own abuse of power straight in the face was one of the scariest things I’ve ever done. I’m not religious, I’ve never really believed in the idea of good or bad, but the force that drives people to abuse their power is evil, and it’s terrifying. I am so glad that I was able to look at myself honestly, without shame, so that I can finally release this toxic relationship with my mom that has drained me for decades. \nThank you guys for listening ❤️",
        "created_utc": 1669919539,
        "upvote_ratio": 1.0
    },
    {
        "title": "Did your hair grow back after leaving the narcissist? What other positive bodily changes did you have?",
        "author": "ASG0303",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/z9vddb/did_your_hair_grow_back_after_leaving_the/",
        "text": "I am finally moving out of my house and hometown after spending 22 ridiculous years with my narcissistic mother. I had great hair growing up but it gradually started to worsen and get thinner when I was 16. Sometime in 2020, I lost a major chunk of my hair and had a very visible scalp around the top of my head and overall my hair was a lot thinner. I did everything under the sky to fix it and even though it is not as bad anymore, no amount of oiling and good hair products are giving me the hair density that I should have. It's not like I have bad genetics for hair. \n\nIs it possible that I might see a stark difference in my hair after moving out? I am also expecting better digestion and lesser joint pain. Please share your experiences.",
        "created_utc": 1669919188,
        "upvote_ratio": 1.0
    },
    {
        "title": "Toolbox to sooth and comfort yourself after abuse",
        "author": "quisieravolver",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/z9u2s8/toolbox_to_sooth_and_comfort_yourself_after_abuse/",
        "text": "I thought it would be interesting to share which methods you use to calm yourself down when you feel ptsd or fall into rumination.\nThe little remedies in everday life.\nI would love to hear yours!!!\n\nFor me it is:\n\n*Walking through nature until I suddenly realize thw beauty around me (takes an hour)\n\n*going to a place with a view and trying to put myself into perspective\n\n*Listening to podcasts that emphasize  emapthy with oneself like the dear-sugar-podcast\n\n*Reading memoirs of people who survived trauma like \"wild\" \"slow motion\" and recently \"I am glad my mom died\"\n\n*establishing a soothing routine: ordering sushi, taking a bath\n\n*actively thinking about things I am greatful for when rumination starts.\n\n*smelling essential oils like lavander or eucalyptos to get me out of rumination.\n\n*watching/listening to youtube videos on narcissistic abuse while doing household shores, that validate my experience.\nI loved the video \"why there is no closure after the narc\" by balance psychologies. \n\n\n\n(I don't mean these things to substitute therapy. I needed a lot of emdr)",
        "created_utc": 1669916483,
        "upvote_ratio": 1.0
    },
    {
        "title": "Feeling angry and resentful. Not sure why ?! any advice?!",
        "author": "Free-Force-3076",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/z9p7so/feeling_angry_and_resentful_not_sure_why_any/",
        "text": "This is embarrassing. I am kind of mad at myself, Last night , I was invited to a symposium that a professor of mine was chairing. Because I that is where I meet my Ex. who stalked me almost six and seven months post breakup. I opted not to go. I think i lied to myself , and was like I am not going because I had a falling out with an adjunct professor who was rude to a friend of mine and i disagreed with a lot of his politics (the adjunct professor)\n\nI did not go because of the fear that it would put me in my Ex orbit, I do not  have feelings for my Ex, Nor do I care what he is up to,  Nor do I want to engage with my Ex, it would all be a lie, and half truths or deflection, and I have made peace with the fact that he never cared about me. And truthfully as mean as this is, I really do not care who he is seeing, for two reasons, 1) its not me, so that means I do not have to deal with the lies, games ,and drama. 2)and whether its a guy or girl that he is seeing, or his exwife, I know what is in store for them based on my experience with him, And on the off chance that he becomes aware, the fact that he has shown me no remorse another reason why I do not want him in my life . My Ex would throw anyone under the bus that really loved him instead of dealing with his issues, His parents, his exwife, god only knows what he has said about me. And vile stuff like My blank are so fill in politicial party, that is why I only email them and do not do social media (unless it is a bogus account for stalking and cheating) Or I am glad that my blank is gone maybe now i can get that promotion and focus on you. He did not get it and he lied about the later.\n\nPost Breakup, I have learned how to maintain boundaries, and for that I am greatful it is a lesson that I needed to learn , but there are lot of characterstics and traits that I have now that is a direct result of the breakup. I used to post a lot on social media, and i would interact with everyone. Nothing sexual, now I am like lot more cautious who i interact with , This has been a mixed bag, I have been called a cold Beeyatch, but It also has prevented me from getting involved and cutting off possible two toxic AF people . While i am greatful for the boundary lesson, I am resentful that I have to guard what I say on social media or have had to deal with prank calls both the hang up and paying some1 to send me dirty messages. Any advice",
        "created_utc": 1669904835,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to move past the unfairness of it all",
        "author": "anonmeplsthrowaway",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/z9ninh/how_to_move_past_the_unfairness_of_it_all/",
        "text": "I can now clearly see I was in a relationship with a highly toxic person, which could make him a narcissist but he hasn't been diagnosed.\n\nWe were together for 4 years. Things were great at the start, he came across as very sensitive and sweet and told me about how his friends had abondoned him, his parents were always harsh to him and how his ex cheated on him. Looking back now, this is what drew me in. \n\nThings changed a few months in, he had issues with me using Instagram. He didn't like it when I went out with my friends without him, he told me he would unalive himself when I went on a trip with my siblings without him. I'm working through this with my therapist to understand why I even stayed after all of this.\n\nThe last 2 years of our relationship he was very critical of me, everything I did was criticized and not good enough. He made mean 'jokes' about my job, intelligence and looks. I often even wondered if he liked me.\n\nI was often very anxious about every little thing and didn't know why. Looking back he made me question myself and rely on him for advice and guidance to the point where I couldn't even trust myself. The one good thing about leaving him was I only have one voice in my head now which I'm trying to trust again. I feel less anxious than before.\n\nFunnily enough, I was away from him for a month earlier this year and I actually felt weird that I felt good without his voice over me constantly criticising me. Even then, I stupidly told him I felt disconnected from him and thought maybe this was a sign to work on our relationship.\n\nThe end of our relationship was messy. He started getting hot and cold on me, becoming secretive with his phone and I eventually caught him lying to me about where he was. He was out with a female coworker and she posted him on her instagram but he told me he didn't know her or ever talk to her. He never once apologized for his lies, instead he gaslit me to tell me I was crazy for accusing him that it could be him in the picture (he later admitted it was him) and just wanted me out of his life.\n\nI spoke to him last weekend in stupid attempts to get him to acknowledge how hurtful his lies were and to get him to 100% clear with me about what was actually going on. He admitted he's friends with her this time around but gave me another excuse like it was justified to lie. He was so cold and dismissive.\n\nEven after this, I'm grieving our relationship. I don't want him back but I can't get over how little our time together meant to him. I gave this person my all. How does someone switch like that? \n\nHe seems to be doing fine with work and going out with her and other friends while I'm in therapy, losing weight because I can't eat and hardly sleeping.\n\nIt's been 2 months I just want this to be over.",
        "created_utc": 1669900286,
        "upvote_ratio": 1.0
    },
    {
        "title": "Anyone else dealt with a N roommate?",
        "author": "ElevenForPresident84",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/z9ndo2/anyone_else_dealt_with_a_n_roommate/",
        "text": "I moved to a new city this year where the cost of living is high and therefore can't afford to live alone just yet. I have had to live with roommates for the first time in many years. The first one turned out to be a N and I spent the summer tip toeing around her volatile moods and passive aggressive behavior. It was a huge weight lifted getting out of there.\n\nWith the N roommate, we had a couple of blow out arguments. I figured out quickly that she regarded the apartment as \"hers\" and I was just allowed to live there. I was treated often like an unwanted guest whose overstayed their welcome. She was just another tenant but had lived there for several years so clearly considered it her turf.\n\nOne of the first things that tipped me off that she might be a N is how insanely controlling she was over the space. For example, only SHE was allowed to put her things on the bathroom counter. If I put anything there it was a problem. She would move it or \"accidentally\" knock it over.\n\nAnother tip off was her sense of entitlement. She was entitled to leave massive piles of dirty dishes collecting in the kitchen and some of them would stay for weeks. One evening soon after moving in I gathered her dirty dishes that were collected around the sink and put them on the kitchen table and covered them with a towel bc they were attracting flies. It was my kitchen too and I needed access to the sink but she didn't see it this way. When she came home and saw what I had done she flew into a fury at me because I had \"touched her things,\" getting in my face in a threatening way. Her argument was so unreasonable and self serving and lacking empathy that my N radar started going off.\n\nNow I have a different roommate. I don't think this one is a N. I have lived here for over 2 months and I have found with N roommates that they start showing their colors quickly. The continual drama and tension in the house because of them starts fast. Things with this roommate have been peaceful so far. I have noticed that she is an alpha dog but is polite and does her own thing.\n\nWhile the N roommate was a filthy f\\*cking pig, this roommate is on the other end of the spectrum. She likes everything spotless and is extremely clean. We share a bathroom and she prefers that it be cleaned 2-3 times per week, which seems a little overboard to me but she isn't pushy about it. She has the large nice bedroom full of light and I have the small dark bedroom in need of a paint job. When I do laundry there isn't space in my room at all to hang garments to dry. I do my best but a couple of times I have hung a few in the bathroom, removing them at night so that in the morning when she showers they won't be in her way. Then I put them back.\n\nWell last night I found out she does not like me doing this at all! She was yet again cleaning the bathroom and pointed to a dress of mine that was hanging on the back of the bathroom door to dry (a space that she never uses). She told me in a bossy tone that \"we don't leave clothes in the bathroom\" and then she told me to hang them instead outside where there is a rusty dirty metal railing exposed to the rain. When I said no and explained that that would stain my clothes, instead of backing off she seemed hostile, as though I was the unreasonable one not her.\n\nMost of all I didn't like her bossy tone. She was giving me orders instead of treating me like an equal. I thought it was disrespectful and condescending and that I would never speak to her in this way. I explained again why I have to hang my clothes there occasionally and it didn't make a dent in her attitude. She seemed to want immediate compliance and when I wasn't giving it it pissed her off. It came out when I inquired why this was such an urgent matter to her that my clothes there \"don't look good.\" She walked to the dining room table and in an impatient annoyed way started gesturing for me to hang the clothes instead on the back of the chairs. She continued with the bitchy attitude to the end.\n\nI have been triggered by this interaction bc it reminds me of my N roommate, who also gave orders and who also considered the space as HERS. With my current roommate, I noted that she does not consider care of the shared bathroom as a collaborative decision between equals, rather that she is in charge of it and I do as I am told. The feeling that I was being disrespected and talked down to also brought back unpleasant memories. She chose not to *ask* me about the garments and why I hung them there nor did she explain her problem with it. She just told me to remove them and don't do it again and even told me to hang them on that rusty railing outside and seemed pissed off when I told her no.\n\nI am more upset by what happened than is warranted and I know it's bc of N roommate. Have you also dealt with a N roommate?",
        "created_utc": 1669899907,
        "upvote_ratio": 1.0
    },
    {
        "title": "When other people trigger you because of what you went through with the N",
        "author": "[deleted]",
        "url": "",
        "text": "[deleted]",
        "created_utc": 1669897230,
        "upvote_ratio": 1.0
    },
    {
        "title": "Final discard but Narc came calling after?",
        "author": "luckya93",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/z9m19g/final_discard_but_narc_came_calling_after/",
        "text": "Had usual fights with Narc after his temper outbursts and he again asked for breakup which I complied and walked away to go home. He stopped me and brought me to the riverside for a talk. The talk eventually led to me crying and being frustrated, he too teared up. It eventually went into a breakup decision.\n\nHe stood up and told me he is going for a walk and “will not be coming back”. I said okay and left after.\n\nAn hour later he started calling and texted asking if I’m home.\n\nI really don’t understand what’s going on? Is this a final discard?",
        "created_utc": 1669895911,
        "upvote_ratio": 1.0
    },
    {
        "title": "Taking my narcissistic landlord to court, any tips",
        "author": "[deleted]",
        "url": "",
        "text": "[deleted]",
        "created_utc": 1669880837,
        "upvote_ratio": 0.5
    },
    {
        "title": "Body Changes I’ve seen only about a week after moving out",
        "author": "Soggy_Lavishness_273",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/z8w95n/body_changes_ive_seen_only_about_a_week_after/",
        "text": "Bodily Changes: \n\n-my stomach is growling again\n-tension in my eyelids is gone\n-blinking more often \n-which has resulted in some clearing up of my myopia\n-better sleep \n-more energy \n-I’m more physically relaxed resulting in my double jointedness returning\n-my skin looks brighter \n-some of my spider veins are fading\n-a lot of bloating is gone\n-food tastes better \n-ear tension has lessened so I can wear earplugs more comfortably\n-my blood sugar is more stable \n-less swelling and redness in the face \n\nJust setting this here cause uh,,,, some of these things were deemed purely genetic. \n\nAnd I’m beginning to see that it had some other variables in mind that maybe had nothing to do with genetics, but rather stress from a generationally traumatic family. \n\nWhich tracks.",
        "created_utc": 1669826666,
        "upvote_ratio": 1.0
    },
    {
        "title": "In my \"new\" phase which is anger and resentment, I'm terrified I'll never love that way again.",
        "author": "Stupid_Situation83",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/z8uwnd/in_my_new_phase_which_is_anger_and_resentment_im/",
        "text": "Right now being happy in a relationship seems like such a distant light that I could see myself letting go of relationships forever. I never want to feel this pain again! \n\nIt was such a captivating love. I did things for this person that I didn't even think were in me and now I'm just supposed to forget them? \n\nI used to bite her cheeks all the time whenever we hugged. She would come out of the bathroom after her shower with her little pink hair straightener and sit on the floor in front of me and ask me a 38-year-old bald male to straighten her hair with her. I hate feet absolutely hate them they're disgusting but she have the cutest little feet and I would massage them while we were watching movies. The pet names, the TikTok video she made with country music songs in the background, I hate country. The way she would prevent me from eating McDonald's french fries out of the bag just so that she could feed them to me and mess them all up so they would go in my beard. I hate being touched when I'm sleeping because I'm already hot but how she would always cuddle up to My back like a little backpack and steal my heat. \n\nFuck today man. Fuck this snow. Fuck the holidays.",
        "created_utc": 1669823452,
        "upvote_ratio": 1.0
    },
    {
        "title": "I got discarded a month ago and this is what strikes me most in hindsight about this kind of person",
        "author": "OkAvocado7",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/z8ri3f/i_got_discarded_a_month_ago_and_this_is_what/",
        "text": "He doesn't have a conscience. It's just not there. He is a brutal emotional and psychological abuser who discarded me finally in the most unfeeling way then ghosted. The sad part is that I actually left *him* back in June. We lived together then and I moved out when he was at work. Leading up to this things were obviously becoming intolerable and I was miserable. My life revolved around his moods and he was showing me more and more of his dark side. It was time to go.\n\nOver the summer after I went NC I had the bad luck to move in with a roommate who I firmly believe is a N too. I had other serious stress going on too including financial problems and I felt very alone. My life began to revolve around the roommate N's moods and I was often walking on eggshells. For this reason the trauma bond got to me and I went back to my Nex.\n\nFrom the get go, once we were back together, I realized two things:\n\n1) This time the devaluation was going to be worse.\n\n2) He felt no remorse whatsoever for how he had treated me.\n\nI found out he ran a smear campaign with his family &amp; friends, painting me as a crazy person with \"multiple personalities.\" In fact this was something I said about HIM before I had moved out and he stole it and used it as part of the smear. I was the villain of the whole thing and he had done nothing wrong. He even said he thought I left bc of some other guy.\n\nI quickly learned that I was not allowed to throw any shade on him about what happened or try to hold him responsible. I wasn't allowed to acknowledge his role or I would suffer the consequences (told to leave and then silent treatment).\n\nHe rewrote the narrative so that I was the guilty party and he would treat me coldly and dismissively until HE decided to forgive me and let me get close to him again. He withdrew all affection and warmth and treated time with him like a privilege I had to earn. It was awful. If I called him out on this he would flip it around and say that it was warranted bc I had the audacity to leave him. Me leaving was the problem, not his treatment of me leading up to it.\n\nThe devaluation got worse and he began treating with a sneering dismissiveness that I hated. There was also a new indifference that had never been there before. He would casually cancel plans, showing that spending time with me was no longer a priority. This is generally how a guy behaves when he has lost interest in you. Then I got discarded over text message very suddenly and I haven't spoken to him since. It's like Game Over and I have been erased. No normal guy would treat you this way unless you did something unforgiveable like steal from him or sleep with his best friend.\n\nThe thing now that is most helpful to me is seeing in hindsight that this man does not have a conscience. The lack of conscience is what enabled him to be so unfeeling and even sadistic at times. I don't recall ever hearing him express guilt or remorse over anything, including with other people, not just with me. One of his sisters told me that he is \"never wrong.\" This is bc he does not experience any pangs of conscience and has no empathy. He is a selfish being down to his core.\n\nI have been reading the excellent book The Sociopath Next Door by Martha Stout, which is all about the lack of conscience being central to this kind of personality. My Nex could do whatever he wanted in his relationship with me, no matter how heartless or selfish, bc he is never wrong. He even told me once that \"he is perfect.\" Because he is perfect, if I complained or called him out then I was automatically the problem bc how dare! He was the Prince and I was the peasant.\n\nSeeing that he has no conscience is helpful now in wrapping my mind around his depraved corrupted mind and understanding his personality. Everything he did stemmed from this. The only relationship in his life where he seemed to experience guilt was with his mother. He was the golden child and she raised him with the Prince treatment and created a codependency that is unhealthy. I saw guilt and obligation in his behavior with her, like he regarded himself as being obligated to take care of her needs.\n\nAnyway this realization that at his core he has no conscience and experiences therefore zero guilt and remorse, especially with female partners who are automatically his inferior and punching bag, has been very helpful. I have known that this is one of the traits however really taking it in on a deeper level is new for me.\n\nIs this something that has been helpful to you as well?",
        "created_utc": 1669814883,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does the loss of self worth cause narcissistic traits as a result of abuse?",
        "author": "Sad_Apple_1911",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/z892ls/does_the_loss_of_self_worth_cause_narcissistic/",
        "text": "I wonder whether narcissistic abuse might lead to the person subjected to it showing narcissistic traits as a result? With that I mean that the person in question might need a ”supply” to lift themselves up. Using outside sources (being liked, admired etc) to feel better about themselves. \n\nI’d argue that a healthy sense of self is both stable (i.e. not relying on outside sources) and flexible (affected by our surroundings). \n\nYet I notice myself needing more validation and support from others than what is probably normal. I notice some N like traits in myself and it makes me uneasy.",
        "created_utc": 1669762641,
        "upvote_ratio": 1.0
    },
    {
        "title": "No Contact but relatives still send me mail",
        "author": "OpeningSand1037",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/z86pby/no_contact_but_relatives_still_send_me_mail/",
        "text": "I have been No Contact with my whole family of origin for almost a year. My mom is the main Narcissist but the family is very enmeshed and dysfunctional. They are blocked on email, phone, social media and I have told them not to come to my house in person. They have stopped coming in person, possibly because they realize I could call the cops on the for trespassing. \n\nSo, members of my family of origin send me letters and cards in the mail containing manipulative messages trying to guilt me back into contact with them. I either throw the mail away or write Refused on it with sharpie and have the mail carrier pick it up from my mailbox. But it keeps coming - mostly just at holiday times ... So I get mail from them on my birthday and on the mainstream holidays that they celebrate (many of which I don't celebrate which shows that they are self-centered). \n\nI try not to read any of the letters, but some are on postcards which makes it hard to avoid. Even throwing the mail away or writing Refused is upsetting because I still have to see their handwriting on the mail and see that they sent me mail. \n\nDo you have this same problem? Have you found a way to handle it?",
        "created_utc": 1669757152,
        "upvote_ratio": 1.0
    },
    {
        "title": "Anyone else hate how \"narc abuse\" became ableism term and if you use it you'll get harassed and people are saying that narcissism is a disability....?",
        "author": "m4lw4r3_404",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/z856pe/anyone_else_hate_how_narc_abuse_became_ableism/",
        "text": "Wherever i go (except for reddit) I Get harassed by tons of angry snowflakes by using \"narc abuse\" and being called \"ableist\" they told me that narc abuse isn't real thing and that I'm just ableist and that saying narc abuse is like saying adhd abuse and that narcissism is a disability and deserves love and that narcissist people are sweet people and just because there's narcissist abusers doesn't mean all narcissist are bad and that That's literally just abuse. Them being a narcissist has absolutely nothing to do with it. and they tell me \"I have narc friend/sister and she's so sweet\" or something like that , and that narc abuse is manipulating tactic , I got traumatized from tons of harassment \n\n&amp;#x200B;\n\nman I'm genz and I hate my generation",
        "created_utc": 1669753848,
        "upvote_ratio": 1.0
    },
    {
        "title": "Has anyone managed to build a life without narcissists?",
        "author": "qwerty1qwety2qwerty3",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/z7xdlb/has_anyone_managed_to_build_a_life_without/",
        "text": "Has anyone managed to get all the narcissists out of his/her life and managed to find good friends/partners? How does it feel?\n\nWith my mother, brother and many relatives being narcissists, I was surrounded by narcs all my life and then surronded myself with narcissistic friends and partners to this day even after going no contact withe worst of them.\n\nI now mostly have lower grade narcissists in my life and limit my time with them and it feels a lot better but how does life feel if you have only good people in your life and only occasionally meet narcs (for example at work) but never get close to them?",
        "created_utc": 1669736320,
        "upvote_ratio": 1.0
    },
    {
        "title": "Were you invalidated and gaslight by other people in the N's life viewing them as a nice person?",
        "author": "OkAvocado7",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/z7t1zw/were_you_invalidated_and_gaslight_by_other_people/",
        "text": "I find that one of the things that keeps you stuck in a N relationship is other people continually invalidating your perceptions of the N and who they really are. Other people see the N in a positive light and think they are normal, a good person. They see Jekyll while you see hide. It's like a collective gaslighting that causes you to doubt yourself. It's also painful to see how to N treats others so well while you are their doormat and emotional punching bag. They withhold their validation and positive attention from you while freely giving it to others, causing you to pine for their love. This also keeps you stuck.\n\nSome Ns are toxic in that they don't have as much control over themselves and they act out and alienate others in addition to their partners. There are other people around who don't like them. I find that the more sophisticated and dangerous ones have a lot more command over themselves so that they can turn off and on their different personas. They choose who to show Jekyll and who to show Hyde and they do it skillfully. This kind of N starts to take on traits of psychopathy if they are far enough to the right on the spectrum. Many serial killers fit this description, which is why people who know them seemed shocked and confused when the truth comes out and they tell the media that the serial killer seemed like a nice guy, a normal person. The notorious BTK killer, Dennis Rader, is a great example. He was so good at hiding his bloodlust and sadistic compulsions that even his own family was deceived.\n\nWith my Nex, while he wasn't in the category of full blown psychopath, had a lot of control over who he showed his true colors. His immediate family seemed fond of him and I remember one of his sisters referring to him as a \"kind person.\" Ha! He is one of the least kind people I've ever met. He had a close relationship with his mother in particular and was generous with her. He was charming and funny with friends. With me, behind closed doors, is when Hyde emerged.\n\nThe way he was Jekyll with everyone but me gaslit the fuck out of me and caused me to feel isolated. Standing confident in my own perceptions of him, which I knew to be the truth and that it was his network of family &amp; friends who were deceived not me, was very difficult. I knew my view of him was the truth but it had little sway over my behavior with him. I fell right into the trap of longing for his attention and chasing after him for it and letting my emotions around him control me instead.\n\nI now view Jekyll and Hyde as one of the foundations for how they mindfuck you and create the trauma bond. Another is intermittent reinforcement. Other people around them treating them as normal and likeable is the cement. They were Jekyll in the beginning and then Hyde over time became the norm and you pine for Jekyll to return. This longing is reinforced by seeing Jekyll when they are interacting with others. You see Jekyll but he is withheld from you. This in turn causes cognitive dissonance.\n\nHave you had experience with this type of N?",
        "created_utc": 1669725842,
        "upvote_ratio": 1.0
    },
    {
        "title": "I don’t panic when I can’t find things anymore",
        "author": "mcribfarts",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/z7l5m0/i_dont_panic_when_i_cant_find_things_anymore/",
        "text": "Yesterday at work, I was subbing at another store for my company and couldn’t find a product for a customer. In that moment, I realized how calm I felt, despite the discomfort of not knowing where that item was. \n\n\nAs a kid, this was a very daily fear of mine as my dad would go ask me to get random tools etc for him. He insisted that he was very organized (he could be, but in a very unorthodox, potentially ADD fashion) and that I was never paying attention when he instructed me on various types of tools (Dad, I was six). \n\n\nDad would instruct me on something once and then expect me to lock it all in and then he’d get progressively more angry as I seemed to have blocked it all out and learned nothing. Thus, when I’d go on the fool’s errand of tracking down his shit, I’d get incredibly scared and freeze up, either picking up the wrong tool hastily or going through the motions of finding the right one for so long until he’d storm to wherever I was and yell at me.\n\n\n\nIt’s been 7 years since I moved away from home, 6 since I went no contact with him, and I’m blown away with how much more confident I am in being able to find and seek stuff out. A large part of that has been noticing that any decent coworker, boss, or human being in general, isn’t going to make me feel small when I can’t find something the first, or even tenth time. I can ask questions - I’m actually expected to ask questions - of coworkers and bosses, and they’ll do the same with me. Because life is complicated and God knows we can’t be expected to be perfect robots.",
        "created_utc": 1669701606,
        "upvote_ratio": 1.0
    },
    {
        "title": "Boundaries Set- And Kept!",
        "author": "Im_invading_Mars",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/z7dfxt/boundaries_set_and_kept/",
        "text": "I suffer greatly from PTSD. It was so bad that I had to quit jobs where people were too abrasive or seemed mean. Since I began healing, I have found where my boundaries lie. Today, a coworker at my new job was getting very aggressive because I was l was taking so long to learn something. He and the other guy were very loud  and shouting COME ON COME ON GET IT DONE HURRY UP!  And I panicked. I couldnt do it. They had to help me. After everything calmed down, I approached the dude and said I  have PTSD and what you did really stsrtled me, and I didn't like it. I realize you were just having fun but it freaked me out. We talked about it and we both came to an agreement. Thats the first time Ive ever set a boundary, said what I felt in a calm and rational manner, and solved the issue. Im so proud of this moment!",
        "created_utc": 1669680478,
        "upvote_ratio": 1.0
    },
    {
        "title": "ATTN: Displaced/Scapegoated/Gaslighted People",
        "author": "ImageAintAThang",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/z785vm/attn_displacedscapegoatedgaslighted_people/",
        "text": "\"Injustice anywhere is a threat to justice everywhere.\"\n-- MLK Jr.\n\nDid you remove yourself from your roots in pursuit of life experience to find you've lost connection with any kind of support network?\nDid you find that those who may have especially AVOIDED life experience intend to reduce you to stereotypes that are more convenient or simple for them to understand, most often characterizing you as being lesser to them?\n\nIf you've become displaced (immigrants, migrants, veterans, ex-convicts, homeless persons, etc), or if you were betrayed by your home-of-orgin or the support system with which you expected to reconnect, then please recognize the importance of validating each other's experiences.\n\nIf you've experienced any societal dysfunction and it seems to threaten your ability to reclaim your dignity as a citizen, it is important to your own story that anyone who has experienced something similar is taken seriously.\nThe more often someone is stereotyped and written off as deficient, the more your own credibility is injured, for you sharing anything in common with those marginalized people.\n\nThere seems widespread evidence of an undefined correlation between the language proficiency of the truth-teller and the unfair misrepresentation that afflicts our scapegoated people. If you have done your damnedest to communicate your truth until you realized your supposed \"support system\" doesn’t WANT to understand, no matter how clearly you can articulate it, then help me represent.\n\nI want to collect your stories and present them as undeniable behavioral trends that degrade the fabric of our society; writers are especially welcome to share, maybe even help package the information.\n\nThe problem seems to be that people in groups embolden each other's nasty behavior as something valid, while the outnumbered person gets disregarded without anyone TRYING to understand; it's easier to blame the odd-one-out and move on, so that the group's stereotypes and simplification, or shared delusions, are assumed valid and the outnumbered individual goes unheard from. Well, what if all those people found each other?\n\nThe patterns are there. How did you get edged out? Was there an initial incident or did you just not recognize soon enough that your \"support\" was not seeing your relationship the same, just because you wanted someone to talk to?\n\nDon't exhaust yourself; please work from the most simple points in your story. You can remain anonymous, but the goal is to identify the patterns or trends and find a good example in you, so people have to update their judgment and even recognize their OWN behaviors as stereotypical.",
        "created_utc": 1669668802,
        "upvote_ratio": 1.0
    },
    {
        "title": "Revenge on a narc?",
        "author": "Jaded-Tiger3101",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/z77ojs/revenge_on_a_narc/",
        "text": "This time the apology sounded authentic. I almost believed it for a second. It actually sounded remorseful except it took 3 months to come up with it. I didn’t budge. I called him out and deconstructed what he said. I read in between the lines. He got mad that I called him out on his behavior and said “you’re not over it” I said that I was I’m not the one begging for a booty call. He got mad. Narcissists hate it when you call them out on their game. I ignored his Hoover attempts. He said he missed me then I was skeptical. He even admitted he wanted a booty call. \n\nNarcissists are quite easy to read once you see the signs. I told him I do not want him. I blocked him. I feel so vindicated. My friend said I shouldn’t have done that because narcissists can be erratic and do something. Am I in danger? I don’t think he even remembers where I live because I drove all the time. (He was lazy af.) I feel vindicated. I knew I was never the problem. I am so relieved. I think he’s mad or stewing. Well now he knows what it feels like to be discarded. :)\n\n“I DO NOT WANT YOU. DO NOT CONTACT ME.” I then blocked. I was patient and kind the entire time and he belittled me and said I wasn’t it. I wonder what a narcissist does when you call them out on their gaslighting and projection. I said I wasn’t the one begging for sex. I think that hurt his ego. I kind of wish I knew what he was ruminating on. He treated me terribly and just expected me to show up to his place like I’m some sort of dog.",
        "created_utc": 1669667761,
        "upvote_ratio": 1.0
    },
    {
        "title": "wanting to break no contact",
        "author": "arulzokay",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/z76iq8/wanting_to_break_no_contact/",
        "text": "I have no idea what’s wrong with me this is month but I’ve been so angry and sad over my ex narc. I have been no contact since September. I sent him an email stating how betrayed I felt and how I knew he was cheating while my mother died. He replied with a blank email in return which I did not answer and then in October he sent another message at midnight on my BIRTHDAY asking me why I emailed him.\n\nI didn’t reply. He has ruined so many of my birthdays and I didn’t want him to ruin yet another one.\n\nBut I am angry. I am furious and I have been ruminating and going in my mind events and instances that didn’t make sense but now they do because I see who he is.\n\nI want to tell him how much I hate him and how much of me he’s destroyed. Luckily I keep squashing that idea because I know if I do he will consider that a win and that I’m still thinking of him.\n\nI am constantly but he doesn’t deserve to know that.\n\nI know he’s suffering from this because the three years I was with him he was chronically depressed and drank too much to tamp his thoughts and momentarily forget about the women he’s hurt. And i’m glad it haunts him. I hope he feels like that forever.\n\nMy depression is peaking I believe because of the holidays and my mother’s birthday coming up. I feel so alone and so stupid and a part of me still loves him and I want him to email me again.\n\nI’m also terrified that he has broken me and that I will never be able to fully trust or love somebody again.\n\nHow do we get out of this mood? How do we stop ruminating on the past discretions and good times?I hate that he’s happy with my replacement while I am absolutely miserable.",
        "created_utc": 1669665266,
        "upvote_ratio": 1.0
    },
    {
        "title": "How does a narcissist react when their non-narcissist partner cheats on them?",
        "author": "abyssiniana",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/z74sn8/how_does_a_narcissist_react_when_their/",
        "text": "\nJust wondering. If a non-narcissist cheats on their romantic narcissistic partner and the latter gets to know, would they fly into narcissistic rage? Is cheating on a narc causing them narcissistic injury? My NEx is with his recycled new supply who has a reputation of being a serial cheater, might be a narc herself but I'm not sure. I am wondering how this whole situation would play out.",
        "created_utc": 1669661490,
        "upvote_ratio": 1.0
    },
    {
        "title": "Narcissist/ Narcissism",
        "author": "GinaM23",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/z6zayc/narcissist_narcissism/",
        "text": "[removed]",
        "created_utc": 1669649078,
        "upvote_ratio": 1.0
    },
    {
        "title": "It's still abuse...",
        "author": "Stupid_Situation83",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/z6yxc2/its_still_abuse/",
        "text": "This is a phrase I've adapted the past couple of days. You HAVE to put your ego aside before you can move on and heal.\n\nI am a 38-year-old bald, bearded tattooed man and I was abused. I think my good natured spirit kept me in this relationship longer than it needed to. \n\nSomething I put off for so long doing was making a list of all of the reasons why I left, because I knew it would be too easy. And just as I suspected, as soon as the pen hit the paper both the tears and the words poured out.\n\nIt's still abuse if they had good days, it's still abuse if they bought you things or took you places, it's still abuse If every fiber in your body tells you it wasn't abuse. \n\nSOMETHING brought you to the subreddit, it's called your gut. Good hearted people like us sometimes ignore our gut and run with our heart.\n\nDo you think your ex is searching for any answers? Do you think they're posting on subreddits? Do you think they're in therapy?\n\n\"A person in therapy is often in therapy to deal with the people who won't go to therapy\"\n\nDrink water today, look up into the sky and realize what you are. Love you.",
        "created_utc": 1669648115,
        "upvote_ratio": 1.0
    },
    {
        "title": "The more toxic ones acquire so much power over you that they can provoke you into acting completely out of character. They feed off it.",
        "author": "OkAvocado7",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/z6wh1u/the_more_toxic_ones_acquire_so_much_power_over/",
        "text": "I got discarded a month ago by a N I now consider to be one of the most toxic I've ever known. There was a brutality in him, carefully hidden of course, a void where all human compassion and caring should be. He took sadistic pleasure in causing me pain and would literally manufacture offenses so that he would have a reason to \"punish\" me. Anything would do. His style of love was all about control and punishment and it intensified the longer we were together.\n\nThe discard was done in the most hurtful way, no surprise there. I know rationally that I am very lucky that this man lost interest in me and released me from his little prison. I think that's what a N relationship is - you basically become a prisoner in their life.\n\nThis man was very dangerous to me because he was a threat to my sanity, my mental health, my reputation and even my freedom. He was extremely skilled at pressing my buttons and triggering old wounds so that my reactions to his abuse because increasingly unhinged. I began acting out of integrity, which would then be pointed at by him as the problem. He would speak to me in the most contemptuous, dismissive way, and hearing this tone felt like he was waving a red flag in front of a bull.\n\nThe last time I saw him was a month ago today. He had been disrespectful and cold towards me throughout the day, following months of devaluation. With him, devaluation felt like he was trying to kill my spirit through 1000 paper cuts. His casual rudeness and disregard of my feelings had become infuriating but the trauma bond kept me locked into his little prison. I felt simultaneously desperate to leave him and desperate for his attention and validation. He was very skilled at sucking me into rage tunnels in response to his abuse where I would scream and yell and act out of character.\n\nHe loved to order me out of his sight in the most scornful way, like I was shit under his shoe, and it used to make me so angry. He would do this I know intentionally to get a rise out of me, cutting off convos way too early before anything was resolved, shutting me down dismissively and telling me to leave, as though whatever I had to say was of no importance to him at all. He would say things like \"Blah blah blah\" or mock me, a couple of times recording me with his phone while I was in a rage at him.\n\nOn the last night I saw him he provoked me in this way, canceling at the last minute a plan we had and dismissing me from his presence when I protested, as though my complaining justified him canceling bc what a nuisance I am!\n\nWell I lost it.\n\nA spectacular fight ensued that I cringe thinking about. It had been coming for a long time but still. I let this man, this N, get that deeply into my psyche that I wasn't in control of myself. I was completely controlled by rage and by old abandonment wounds caused by my N parents. I felt so demeaned by the way he was ordering me out of his sight, like if I complied and walked away that I would feel I was submitting to his imaginary authority. The feeling of being so small and disrespected was intolerable to me, so I pushed back and refused to go, screaming back at him like a crazy person. The fight played out indoors and then throughout the neighborhood, with me jumping into his car and refusing to get out bc I was so triggered. Now these memories haunt me.\n\nHe ended up threatening to call the police on me, something that he had done before, and he might have actually done it but I left before they showed up, so I will never know. What I think about now is that if I wasn't discarded by him after this and the relationship continued, he would have used his power over me to potentially get me in trouble with the law, which would have many consequences like with my ability to get a job. He would have destroyed my reputation in doing so and that's not even including the smear campaign with his family. He would have painted me I can see now as some kind of stalker who is obsessed with him. He would have destroyed my mental health and my sanity, triggering me so badly I would behave like an unhinged lunatic. He was so cold hearted and cruel that I can see him using this to press charges against me and doing it without remorse, feeling no pangs of conscience even if I was arrested right in front of him.\n\nI am lucky that he discarded me and hasn't messed with me further. He is dangerous because he has that kind of power over me and I allowed it to happen. My story is like Exhibit A on why No Contact is so important because their power makes them dangerous to you in every way.",
        "created_utc": 1669641781,
        "upvote_ratio": 1.0
    },
    {
        "title": "Did my abusive ex dump me so viciously because I am unattractive?",
        "author": "CluelessGirl98",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/z6ko3m/did_my_abusive_ex_dump_me_so_viciously_because_i/",
        "text": "\nFYI: he sexually, emotionally and psychologically abused me throughout the entire relationship.\nMy ex tried to use me for sex outside of a relationship. When I told him that I was worth more then booty calls, he became quiet. Then told me I should let him know when I was free again to go out for a really fun date. \n\nHe was so charming and sweet that I felt all the happiness that I had faelt in the beginning and I called him 2 weeks later\n\nHe was creepily calm during the phone call. Initially. Until I started explaining myself and being confused because I felt like something was wrong. I asked him if something was wrong and then came the worst shock of all.\n\nHe calmly told me how so much had changed in the last few weeks. That he had someone that he cared about for the first time. That he decided that I was just somebody from the past and that I belonged there. He basically gaslit me and told me he was the one who first dumped me back then. Told me I have never been good enough for him.\n\nHe told me he was confused and mad because I had rejected him before (he means the night when he wanted to sleep with me). And that he decided he deserved better. He told me he deleted Tinder for his new supply because for the first time, he had found love, but one day after discard I kept seeing him on ALL dating apps and he was active on them. He changed the pics every day or so and he kept showing up all the next weeks too\n\nBut still he said that he didn’t want to lose me. He said that chasing somebody long enough is many times successful.\n\nHe burst out laughing when I was shaking and crying like a small kid\n\n\nWhat have I done to deserve all of this? Was it because his new supply is better? Was it because I am so unattractive? Is that why the discard was so cruel?",
        "created_utc": 1669603698,
        "upvote_ratio": 1.0
    },
    {
        "title": "Finding my voice could save my life",
        "author": "Highinthe505",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/z6jbnl/finding_my_voice_could_save_my_life/",
        "text": "I have anaphylactic’s due to food allergies. One is a very common allergy and the other one is uncommon. I’m allergic to shellfish and anything in the mint family, i.e. Lamiaceae.\n\n I have to stay extremely vigilant during the holidays, checking the ingredient list and informing food service workers of my allergies. Peppermint and mint-flavored foods/drinks are incredibly popular in my area. If I come in to contact or cross-contamination, it causes life-threatening reactions. I was recently in the hospital for an exposure to mint oil that was hidden in the ingredients of a small batch root beer. \n\nI’m struggling with self advocacy. I have a very difficult time finding a comfortable approach for me to ask for special accommodations at restaurants and coffee shops. I always apologize for any inconvenience I’m causing. I explain that I am responsible for being allergic and I’m sorry for being a pain when asking for special treatment.\n\n I enjoy being able to take part in the flow of life by not causing a problem via my demands or disorganization. I do not enjoy speaking to a stranger about my personal needs. I believe in equality for all, it’s my personal calling to take part in mutual respect and mutual aid for all. I do not have a desire for special treatment. Fairness is a very attractive quality to me. \n\nHere is the reasons behind my current struggles and my long held personal beliefs. I was raised by narcissists. My n-parents are known for being rude, demanding and disrespectful to customer service employees. They both marched through stores, supermarkets, restaurants, movie theaters demanding special treatment. \n\nI’m not joking. My nmom will go into a mall and demand that every shop turn down the music, yelling at the cashier to turn up the heat, turn off the air conditioner. Of course, the employee will try to resolve the situation, stating the facts that “they” do not control the temperature or the music that is playing in the store, they will state the facts that everything comes down from management. This will send my nmom into a tailspin of abusive behaviors. \n\nI’ve witnessed her disregard for human life by yelling at a cashier and telling them to smile at her while she abused them. It’s absolutely horrible to be a witness to. I have placed myself between my parents and employees more times than I can express. I would be called “spoiled, ungrateful, a horrible little child” by my parents when intervening. I would be called a horrible little child even as an adult in these situations. For transparency's sake, I must mention that they do love the bomb certain industry workers and restaurant managers. If they think the people will be an asset, they will go overboard with love bombing. Buying restaurant management oil paintings, high end wine and so on. This action is very rear.\n\nI’m completely nocontact with my abusers. They’re now free range narcissists out in the world abusing cashiers, servers and anyone working in the service industry. \n\nHere’s my issues, I hate being them. I hate being demanding. I run from people who are very demanding from the moment we met. I verbally say no to high maintenance people who want to be friends. I’m struggling with entering a place and being a \n\nhigh maintenance customer. \n\nMy husband was a server for years and he has told me that restaurant employees are usually very concerned with customers allergies and it’s important to inform them of my allergies. I’m just really struggling with this.",
        "created_utc": 1669599844,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do I teach myself wants versus needs?",
        "author": "yo_guck_fourself",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/z697w4/how_do_i_teach_myself_wants_versus_needs/",
        "text": "To this day I have to question whether I actually need certain things, but usually if I ask someone else \"do I really need this\" I'm Immediately told this is in fact something that I need. So how do I teach my brain to not question my needs?",
        "created_utc": 1669575231,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do you deal with a scar your narc ex left?",
        "author": "Lola_Moore",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/z64bwd/how_do_you_deal_with_a_scar_your_narc_ex_left/",
        "text": "I was left with a scar on my face in a very obvious spot. I know the rest of the world doesn’t know any different, but how do I stop thinking about my ex every time I see that scar every time I look in the mirror. I try makeup but it’s there at the end of the day when my makeup wears off. Or when I take it off. I don’t miss him and I know I never loved him (it was trauma bonding) and I’m only 5-6 mos into this after a terrible three year lie. But every time I look in the mirror and see that scar, I’m flooded with all the bad things he did. I don’t want to give him one more minute of my life. \nIf you have the same experience, how do you cope? \nSide note, I have a therapist and several close friends, but they don’t really understand the narc abuse cycle. I was isolated from family and friends and are just getting back to my family and having a hard time making friends as it has been so long since I had them. And I’m trying to get out of the isolation thing as well.",
        "created_utc": 1669563807,
        "upvote_ratio": 1.0
    },
    {
        "title": "My narc ex was a dietician",
        "author": "IamDisapointWorld",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/z60k61/my_narc_ex_was_a_dietician/",
        "text": "I've always been fluctuating and my mental health is actually correlated to my weight.\n\nThen it hit me. Looking at my history, it's clear that I was mentally unstable, because I grew SO FAT.\n\nI met this guy when we moved in the same shared flat. He was a personal trainer and a dietician. I was a healthy 71 kg when I met him (24 bmi, small muffin top). I had lost the Covid hard lockout fat over the summer, which was about 6 kg.\n\n*171 cm / 35yo /* \n\n&gt;sep 2020 : 24 Bmi / 27%fat / 71 kg  \n&gt;  \n&gt;dec 2020 : 27 bmi / 30%fat / 78 kg  \n&gt;  \n&gt;may 2021 : 28 bmi / 33% fat / 82 kg  \n&gt;  \n&gt;june 2021 : 29 bmi / 34%fat / 84 kg\n\nI was officially obese. All we talked about was cooking and what changes were necessary in order to lose my weight, build my muscle, etc. I was distraught by the figures on the scale, so I stopped looking at them. I ate too much, with him (he was a powerhouse).\n\nDuring this time that he promised me he would help and I was doing OK, he also love-bombed. Early on, he told me I was dead wrong about calorie counting and that is wasn't the way, etc. \n\nSo, because I had him close by, I didn't follow the myfitnesspal journaling technique. I didn't want to aggravate the pro. But then the pro said he wasn't really willing to take me on. I started lifting and eating, and got bigger, but also fatter. I was a mess.\n\nThen I appealed to my narc ex, saying that I needed my body to not look too bad for the summer holiday we were planning together, and he scoffed and told me it was too late, a month prior. I said I'll starve myself then and he said that's unhealthy, only eat vegetables and chicken for a whole month and that'll be OK. The only advice he gave.\n\n I couldn't do it. I had started eating konjac noodles what tastes horrendous, everything he said to try had failed. So I picked up myfitnessal afain and lost 6 kilos the first 3 weeks. I said I'm sad I can't loose another six before the holiday (I was still fat). **And he said it was because I didn't do as he said. I got to obesity under his watch.**\n\n**The devaluation started the moment I started losing weight, doing it on my own terms.**\n\nI'm now 69 kilos, the slimmest I've been in YEARS. And I actually weigh less than HE did last time I saw him (grantes, he is dry and musclar)...  I can put on clothes I couldn't don anymore (but he left with my clothes because they fit HIM at the time.",
        "created_utc": 1669553724,
        "upvote_ratio": 1.0
    },
    {
        "title": "Revenge of the Narcissist",
        "author": "melekinh",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/z5pv8i/revenge_of_the_narcissist/",
        "text": "I had a former close friend I knew for three years. I’ll call him V. (He was dating my best friend from high school- who I’ll call J here, and we became a trio for a time.) We wound up moving in together towards the end of our friendship, and in the 3-4 ish months I lived there he really showed his true colors and it was awful. V would scream at both me and his partner when we didn’t cater to his every whim, and was constantly passive aggressive. I once asked him not to yell at me or slam doors because it reminded me of my traumatic childhood, and he flipped it back on me and accused me of calling him an abuser/vilifying him for his mental illness that caused his outbursts. (At the time he was diagnosed with schizophrenia and BPD)\n\nI realized it was time to get out after a really bad blowup between us, and unfortunately lost J in the process, but it was worth it to not have to live with someone I had to walk on eggshells around for fear of being yelled at. \n\nTwo weeks later I was still feeling terrible, but I finally told one person what had happened. V had driven all of mine and J’s other friends away over the years, so I didn’t really have any close friends to vent to, but we had a mutual friend via twitter (who I’ll call H) who asked me what was going on, and I explained it to them. At the time I was struggling with second guessing myself due to V’s gaslighting, but H recognized it for what it was very quickly and reassured me I wasn’t the guilty party. They tweeted a joke about people with abusive personalities, which I retweeted- and then all hell broke loose. (Mind you, I never once mentioned V by name, and I had blocked him and J at this point.)\n\nMyself, V, and J had all been very active in an online fandom community, and I had refrained from saying anything aside from the basics- that we had had a falling out, and were no longer roommates, because I didn’t want to make drama, and it was a private matter anyway. People didn’t need to know. But after I retweeted that joke, V enacted his revenge by posting a lengthy, and false, callout post about me. \n\nHe accused me of ableism for being afraid of him, made up lies about me being abusive to animals and said something that I think implied he was calling me a ped*phile? Which is absolutely foul, and everyone I know in real life can attest that I’ve never shown any indication of harming animals or children. But he had seen that I had found a small amount of support in our online community, and he had to take that away from me. Ironically, he warned people that I was “mentally unstable” and people should be scared of me. But me being afraid of him when he behaved erratically and violently was ableist, apparently.\n\nBut yeah- there were a lot of people who reached out to me to hear my side because they knew it sounded wrong, but there were also people who believed him, and it still haunts me that there are people who believe that’s who I am. \n\nI’ve had a really hard time trusting people since then, and even though I’ve made some amazing friends, I haven’t gotten as close to anyone since then as I was with those two- not even close. I just have a hard time believing it’s genuine after the behavior I witnessed/was subject to, and the attempt to ruin my life even further after I finally got out. I really trusted both V and J so much, and had so much thrown back in my face. Does anyone have any advice for dealing with the trauma from the blowup/revenge period, or opening up to others after?",
        "created_utc": 1669518353,
        "upvote_ratio": 1.0
    },
    {
        "title": "Coparenting with narcissists",
        "author": "Glitterbug__",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/z5lm0q/coparenting_with_narcissists/",
        "text": "Does anyone have to coparent with a narcissist? It’s a special kind of hell.",
        "created_utc": 1669506250,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why do narcissists like to dig and snoop into someone's traumatic past?",
        "author": "Competitive-Table371",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/z5eyi6/why_do_narcissists_like_to_dig_and_snoop_into/",
        "text": "",
        "created_utc": 1669488996,
        "upvote_ratio": 1.0
    },
    {
        "title": "Exhusband will not go away ruined thanksgiving",
        "author": "Raindrop663",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/z58o34/exhusband_will_not_go_away_ruined_thanksgiving/",
        "text": "I’m getting really frustrated and I’m really upset that my exhusband won’t leave me alone. I have been divorced for 2 1/2 years I didn’t want to get divorced, I was still in love with him and wanted to make our marriage work. He really asked me for a divorce via text message on his way to his last deployment and went months and months without speaking to me and eventually we got divorced once he came home. I was devastated I felt so abandoned and so worthless and sad. \n\nHe told me I was worthless to him that he could do better then me and I was a terrible wife and my body disgusted him. I did love him i know I wasn’t a perfect wife we were young but I loved him and I was loyal to him and I believed in us and I was trying. But as time has passed I have learned to be ok and live my life even though we still live in the same town. Sense our divorce I have never called him 1 time, I didn’t text him, I don’t follow him on anything I prefer to pretend he doesn’t exist. But for the past year and a half he won’t go away. \n\nHe will Facebook me even though I have blocked him and asked him many times to leave me alone begged him. He’s messaged me on snap chat from different accounts. he tells me that he’s rode past my house. He says he doesn’t miss me he doesn’t apologize he says he doesn’t want me. He tells me how happy he is now that we’re divorced. He tells me how great his life is now and what I should have done to keep him. I don’t care honestly I’ve accepted what happen and I’m ok but I don’t want to be reminded that you didn’t want me. It hurts me and I’m ok until I hear from him and then I spend the next several days sad. it’s happening every 3 months on average everytime I start to relax and feel happy it’s like he knows. I can’t ever talk about being happy or post pictures when I feel pretty. I’ve tried ignoring him blocking him being mean being nice it doesn’t matter. It’s so cruel not only did you destroy me and abandoned me and break my heart you won’t let me forget it. Why is he punishing for something he wanted?  \n\nHe started up again this week because he knew I’d be sad because I don’t have family like he does he knew reminding me that he has family here and he’s happy and wasn’t alone on thanksgiving like me would cut me. He knew how important it was to me to be liked and accepted by his parents. And even though I hate it it does hurt me. And I’m sad today. He’s just so cruel. I don’t wish bad on him I just want him to go away.",
        "created_utc": 1669472502,
        "upvote_ratio": 1.0
    },
    {
        "title": "Thanksgiving win",
        "author": "Ok_Screen_8739",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/z4pnj2/thanksgiving_win/",
        "text": "I made an entire Thanksgiving dinner (all the staples and then some) by myself with 3 kids in tow. All the stress was there. I burned stuff, set off the smoke detectors, spilled turkey juice, etc- all the normal stuff that goes wrong. Here comes the win- I did all this without anyone yelling, crying, humiliating, blaming, throwing things, hitting things, drinking too much,  etc. I finally got my magic holiday with all the traditions I enjoy and none of the drama I don't. Fewer faces maybe, but safe ones. It's so amazing to be able to show my kids that we can have what we want without sacrificing our safety.",
        "created_utc": 1669413921,
        "upvote_ratio": 1.0
    },
    {
        "title": "An apology without change is just manipulation. Read that again!",
        "author": "Stupid_Situation83",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/z4ikf3/an_apology_without_change_is_just_manipulation/",
        "text": "Go get a glass of water. Love you.",
        "created_utc": 1669396314,
        "upvote_ratio": 1.0
    },
    {
        "title": "No Hoover or Contact",
        "author": "LovelyEgg2022",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/z4hzi7/no_hoover_or_contact/",
        "text": "Hi everyone,\n\nMy ex who I firmly believe to be a \"vulnerable/covert narcissist\" discarded me 4 months ago and I think he had already been grooming someone else for about a month before.\n\nI've went NC but I am not going to lie to you, I left one line of communication open because EVEN THOUGH I KNOW that hoovering or contacting me will not change anything or validate anything. I still feel the want of at least knowing I crossed his mind because he threw me away and I can't come to terms with just being thrown away and forgotten. I absolutely loved him with all my heart.\n\nI just wanted to be able to say \"no I know what you did\" and to take my power back somehow.\n\nThere's been nothing, which is also making me feel like maybe I was the problem.\n\nAt the end of the relationship I begged and said \"I feel like I wasn't enough and I'm so hurt I don't want to lose you, I'm so hurt\" and he replied with \"I haven't even considered how you're feeling\"\n\nIt's 4 months and absolutely nothing, as if I never existed.\n\nDo the more shy/withdrawn Ns not hoover? \nWill he hoover? \n\nHow do I give myself the closure I desperately need if he doesn't speak to me again ? I need help, I'm driving myself insane.",
        "created_utc": 1669394886,
        "upvote_ratio": 1.0
    },
    {
        "title": "Two drama free thanksgivings!",
        "author": "theangryhiker",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/z4fhmv/two_drama_free_thanksgivings/",
        "text": "I did it! Two drama free thanksgivings in the last two years, shared them with friends, are good food, laughed, and didn’t feel like a stifled forced smile robot!! I’m so genuinely grateful.\n\nThat’s it!\n\nYay!",
        "created_utc": 1669388630,
        "upvote_ratio": 1.0
    },
    {
        "title": "Did you ever feel that one moment when you’re brain “broke”. I remember mine- it was wild. Did you guys experience that? A moment where you literally felt your brain break?",
        "author": "Lilmissthangthang",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/z4002p/did_you_ever_feel_that_one_moment_when_youre/",
        "text": "",
        "created_utc": 1669338939,
        "upvote_ratio": 1.0
    },
    {
        "title": "When is the hoovering going to stop?",
        "author": "frankincenser",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/z3zwlx/when_is_the_hoovering_going_to_stop/",
        "text": " Context is I went NC w narc ex after he used my CPTSD (from narc abuse) to threaten police violence against me via saying false info, sometimes during moments of distress or because he didn't want to do something like pick me up from the airport.\nDrunk EMAILED me making fun of my trauma related amnesia and i went NC after that. Our whole relationship, if he felt wronged (even if him being 'wronged' was me asking him to stop, say, gaslighting me or pointing out other shit behavior) he would latch onto that and act with resentment towards me. \nToday i get a call from a blocked number and its them asking to have loving discussion. I kept asking for calm conversation before we broke up and am too angry and exhausted to respond now that they all of the sudden show up asking to talk and a hug and all the things i was asking for when they were acting so resentful to me??? Whu do narcs do this? \n\nAs long as they've decided I'm their current 'best' (most easily accessible or manipulatable) supply they won't give up?",
        "created_utc": 1669338661,
        "upvote_ratio": 1.0
    },
    {
        "title": "Looking for confirmation that some soul searching happens for those we put in low or no contact. Or just some comfort in general.",
        "author": "OkTackle4",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/z3z1al/looking_for_confirmation_that_some_soul_searching/",
        "text": "I’m a spiritual person and my only spiritual comfort right now is being overwhelmed by angel numbers for months. (Which basically means one is on the right path). the last 24 hrs it’s only been 4’s which is financial success. I know that bodes well for Black Friday but it’s still pretty pathetic that even the angels can’t come up with more. ‘At least you have money??? (Should shrug)’  Additionally struck by some really really horrible epiphanies (downloads) in the last 24 hours of how my family and peripheral actors/predators) treated me my whole life. I can feel the energy of people returning to our hometown and things getting stirred up. I am told that even if they are having epiphanies they are ignoring them. I know they falsely comfort theirselves with idea that I push people away. Every single person I have known my mother has told me to discard instead of helping me find a solution or comforting me when I went to her for help. She often said ‘well you must’ve done somethinga’ including about someone who later suffocate raped me. And now she sits around believing it has always been me acting alone. And she has convinced my sisters. I have even been attacked by people that barely know me asking ‘why do you seek advice from strangers instead of going to your mother for help’ that’s how far her and my flying monkeys sisters’ slander has reached - what a fucking joke this life is. What. A. Fucking. Joke.",
        "created_utc": 1669336018,
        "upvote_ratio": 1.0
    },
    {
        "title": "NPD vs. BPD",
        "author": "Least_Call_160",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/z3x125/npd_vs_bpd/",
        "text": "I have been getting posts from a BPD group also. And I dated a BPD with narcissistic tendencies, but didn't realize that until much later. I did read that there is an overlap, that perhaps 40% of BPD would also be classified as NPD. My question is... what's the difference? So many posts in the BPD group could be posted word for word in this group. The only difference I've noted is a BPD person very strongly will go ftom one extreme to the other, day to day, or even the same day or conversation. I love you, I hate you. I love this, I hate this. I know this was the main symptom of the BPD woman I went out with. The more I have thought about my nex, I realize she meets some BPD symptoms also. Any other significant differences that people have noted? Why would a person be classified as one, and not the other?",
        "created_utc": 1669330383,
        "upvote_ratio": 1.0
    },
    {
        "title": "OMG! It has taken me forever to finally realize that I have COMPLEX Trauma, and this led me to develop CODEPENDENCY on the narcissist(s). Someone needs to have this to ATTACH to the narcissist in the first place: The Root of the Problem in toxic relationships",
        "author": "kintsugiwarrior",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/z3vrhu/omg_it_has_taken_me_forever_to_finally_realize/",
        "text": "**Long story short**:  I grew up with a narcissistic father + a codependent (enabler) mother.   I didn't know that this family system was abnormal, and moved away in my early 20's (subconsciously I wanted to escape without knowing what was wrong).  I had several relationships with narcissists, but I never knew what was narcissism.  I ended up marrying a Covert Narcissist, stayed throughout the abuse trying to fix him / heal him for 6 years, and was discarded a year ago.  I went completely No Contact, filed for a divorce, and since then I've been in therapy trying to become functional again and heal.  My divorce was finalized 5 months ago.\n\n&amp;#x200B;\n\nOkay, I tried to make it as short as possible above.  And the most important part is the **AWARENESS**, as I finally found out that I've been looking for answers in the wrong places.... as the problem was not the narcissist, the problem has been the \"unresolved trauma\" within me all along.  This makes me feel mixed emotions, as I feel sad about this; but also hopeful that at least now I know what the problem is, and now I can start to look for solutions.\n\nSo, I was very lucky to find **Tim Fletcher's channel on YouTube**,  Not even sure why we don't talk more about his channel in these communities, but it opened my eyes to the main problem I've been dealing with.  I'm only sharing this here, in case it might help someone else become aware of the root of the problem:\n\n**1)** Complex Trauma always happens in a situation (usually home), where the person with the most power is a narcissist.\n\n**2)** A child with a parent that is a narcissist is SHAMED for having \"needs\" as being selfish... and this causes the child to self-blame, and develop SHAME.\n\n**3)** The core belief growing up is that we are \"not good enough\", and that we need other people's approval, and positive feedback to feel better.\n\n**4)** This creates a Codependent, who will caretake the needs of a narcissist, neglecting oneself.\n\n**Codependency IS an Addiction.**\n\n&amp;#x200B;\n\nOf course, this realization is too painful, and I believe this is why we repress this childhood COMPLEX trauma in order to cope.  After all, we come from a similar family system to the narcissist ... but their trauma was more severe.  With this information, I truly hope to research more and find ways to heal this trauma to be able to have better relationships.\n\nTim Fletcher:  Highly recommended\n\n[Codependency and Complex Trauma - Part 1/10](https://www.youtube.com/watch?v=yesXC_ibRKE&amp;list=PLpvbEN3KkqoIyWivHmFps-KFpJkMlkcZN&amp;index=2)\n\n[Shame and Complex Trauma - Part 1/6 - What is Shame?](https://www.youtube.com/watch?v=IOQTfqUdypc&amp;list=PLpvbEN3KkqoJItM9a3-8kqr9zC73fwJPP&amp;index=2)\n\n[Anger and Complex Trauma - Part 1/11 - Intro](https://www.youtube.com/watch?v=kaku_qI_GYI&amp;list=PLpvbEN3KkqoL2RXPaiWc8q1yl68f6E40w&amp;index=2)",
        "created_utc": 1669327044,
        "upvote_ratio": 1.0
    },
    {
        "title": "IMO the #1 biggest sign you are dealing with a toxic person, using my current roommate as an example",
        "author": "ElevenForPresident84",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/z3qms7/imo_the_1_biggest_sign_you_are_dealing_with_a/",
        "text": "They don't like being told no, which is really you setting a boundary. Some of them will pretend to accept the no, then become passive aggressive about it afterwards, which brings me to my current roommate, M. M actually owns the condo so I am renting a room from him. It doesn't take long living with a passive aggressive person with boundary issues to start to see what they're about.\n\nThese are the early things I've been picking up about him, which I think is true of fake manipulative type people in general:\n\n*1) Doesn't respond well to being told no* \\-- Numero uno. He will eat or throw away my food without asking me first. When I protested and complained it came back to me later as sarcastic jabs and digs, as though I am unreasonably rigid around food and me not wanting to share is the problem.\n\n*2) Passive aggressive* \\-- He had some over ripe fermenting bananas turning soft that I asked him if he wanted to throw out. I assumed that he did and he had just forgotten about them. He ended up somehow taking offense to this and debating me whether they were edible. He went into passive aggressive mode, commenting how he guesses he's been wrong his whole life and that's how his parents taught him to eat them and on and on. These things are always said with a faux cheery voice but you can pick up the subtle hostility underneath. He then went on, laughing and smiling, to make a smoothie with all the rotting bananas and he drank it announcing loudly many times it was the best smoothie he ever had in his life! Then he offered to pour me some so I could see for myself. I realized he was trying to prove me wrong and annoy me and the best thing I could do was not react. \n\n*3) You have to ask for common courtesy --* Please don't eat my food, please don't throw anything of mine away without checking with me first. I shouldn't have to ask for these things like special favors.\n\n*4) May use generosity as a means of control* \\-- Truly generous acts don't ask for anything in return. When a toxic person is generous, there are usually strings attached. M on the surface appears quite generous, and wants to be seen this way, but when he is generous, I've noticed it is more about him than about the recipient. He will buy you gifts for example that you can't use. Say you don't eat sugar and you've told him this several times, but then he magnanimously brings home sugary desserts and keeps offering them to you. It's like the statement that you don't eat sugar is seen as a challenge bc they don't respect boundaries.\n\n*5) Hidden agenda* \\-- M's generosity and friendliness seemed lovely at first but over time I have realized that there is a hidden agenda involved. You can live in his house but you must be his friend and part of his entourage. He doesn't want a tenant who does their own thing and wants space. \n\n*6) Not accountable* \\-- The frig is overflowing with all of his food so that his two tenants only have a small amount of space for theirs. One day I stored some food in a bowl but my small shelf was completely packed. He happened to be standing there and said that I could squeeze it in on one of his shelves. It was food I've stored many times and it lasts at least a week. Two days later I was making dinner and couldn't find it anywhere. Sure enough he got rid of it. I was very annoyed. He pretended he \"forgot\" it belonged to me then started justifying it saying Well you know it was going bad and it didn't look good and you might have gotten sick. This was complete bs. But it told me that he is not honest and is willing to bend the truth so that he is not in the wrong. \n\n*7) Pushes boundaries* \\-- Soon after I moved in he started talking openly about his sex life to me in a way that made me uncomfortable. He inserted comments about sex in general into our convos that seemed unnecessary and it made me uncomfortable. One time he snuck up behind me in the kitchen, first thing in the morning, to playfully \"scare\" me. I have PTSD and startle very easily and I did not find this funny at all. He seemed amazed that I didn't find it hilarious and seemed to take offense, making comments about how sensitive I must be and it was just a joke. Needless to say, sneaking up behind his female tenants to scare them as a joke, is totally inappropriate, but I was the problem for not finding it funny.\n\n*8) Doesn't give you space and ignores social cues* \\-- M is an everloving talker who will pounce on you and trap you into conversation whenever you happen to cross paths. I find this draining and frustrating, especially when it's the evening and I'm tired from work and don't want to talk. Convos with him are usually him talking AT you not with you. He doesn't seem to read social cues and see that you want space, or he ignores this and keeps on talking. He has literally followed me out to my car, still talking while I'm getting in and about to drive away to work. I sense if I say something and ask for space that it will be a problem.\n\n*9) Uses generosity as a means of control* \\-- He likes to buy too much food then offer the rest to me and his other tenant (he buys foods I've told him multiple times I can't eat but never remembers). The string attached to this that he is then free to help himself to our food whenever he feels like it without asking first. He is also free to throw away food of ours without checking first.\n\nDoes any of this sound familiar?",
        "created_utc": 1669313270,
        "upvote_ratio": 1.0
    },
    {
        "title": "The sky isn't green because our eyes see blue- a potent realization",
        "author": "frankincenser",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/z3cm21/the_sky_isnt_green_because_our_eyes_see_blue_a/",
        "text": "Damn is there something absolutely unquestionably disgusting about the Entitlement! of believing let alone leveraging leveraging with an internal understanding that every other human being is less worthy of respect down to the most basic levels / is so unworthy that they instead are merely bouncing boards for flexing the narc's \"\"\"\"\"\"superior abilities\"\"\"\"\"\"\" , gaining validation/reputation, or otherwise are \"of use\" (supply). Wow these people really believe that the only heart that truly beats is theirs.\n\nThink about how difficult it would be to fully convince you (reader, empathetic person) that only you- one singular person on earth  - is worthy of basic human recognition/respect, and rights. Not going to happen. \n\nIt's like trying to convince us the sky is green. These people will really never change because their truths are partially based in these neurollgical capacities. Willingness to change interferes with the narc's self narrative around their own ego. This realization helped me a lot tonight- passing along to help us all release and foster our greatest strength as a collective here- our commitment and  encouragement of the well being of all others.",
        "created_utc": 1669271749,
        "upvote_ratio": 1.0
    },
    {
        "title": "How come only predators are attracted to wounded people?",
        "author": "softscalp",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/z35esl/how_come_only_predators_are_attracted_to_wounded/",
        "text": "I’ve noticed this pattern where healthy people don’t really seem to be interested in people with “problems”. Usually it’s only predators and they come disguised as a savior.",
        "created_utc": 1669249863,
        "upvote_ratio": 1.0
    },
    {
        "title": "If he hoovered me many times, does that mean that I’m not the problem?",
        "author": "ThatsTheGame99",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/z2f4xl/if_he_hoovered_me_many_times_does_that_mean_that/",
        "text": "I’ve been worried for a long time that the relationship failed because of my shortcomings. That I wasn’t beautiful, interesting, cool enough for him. He actually fed this insecurity a lot by constantly criticizing something about me and keeping me in a state of trying to always please him.\n\nThis belief that I’m not good enough for him has destroyed most of my self confidence. Now, after the breakup, he has hoovered many times, either by calling me “honey” or “darling” like he used to and telling me how he just wants to see me again. \n\nDoes his hoovering mean that the problem wasn’t me? That I was in fact good enough, worthy enough, also for him?",
        "created_utc": 1669177297,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why the hell did he flirt with me months after the discard ?",
        "author": "Working-Science2357",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/z29eur/why_the_hell_did_he_flirt_with_me_months_after/",
        "text": "\nTwo days ago, he surprised me at a local event. He actually lives eight hours away from me so I have no clue why he attended that event.\n\nJust for your information, when we were broken up, he had lashed out at me because he wanted to sleep with me and I said that he should find somebody else to use for his sexual urges. I had had enough. \n\nHe then belittled me, called me only to put me down, told me he knew that I was never good enough for him. And said that he didn’t care about me anymore because I wasn’t worth it.\n\nI went no contact after this. He texted me that he didn’t want to lose me and I didn’t reply. I’ve maintained no contact since then. \n\nWhen I saw him at this event two days ago, I caught him staring at me like a hungry lion. I had managed to put myself back together in the last few months and learned to do my hair, to eat and look healthy, to do make up the right way. At this event, I totally looked my best. I’m not sure if I ever looked as radiant and beautiful .\n\nHe kept staring for half a minute straight (!) and in the end winked at me. He became shaky and started trembling and after a few minutes, he walked past me and whispered „looking gorgeous…“\n\nAnd I just ignored him. My friends who were at the party as well never left me because I didn’t want my narc ex to talk to me. According to them he kept staring at me and checking me out and trying to meet my gaze..\n\nWhy the hell did he do this? Is this typical for narcs? I thought I was the most worthless and disgusting woman ever and that neither him nor any other man would even look at me after the discard.. I thought that I must be hideous and also ugly and that this is the reason why he discarded me.\n\nWhy did he flirt with me two days ago? Isn’t this contradictory to what he said? That I wasn’t attractive and good enough for him?",
        "created_utc": 1669161341,
        "upvote_ratio": 1.0
    },
    {
        "title": "Small disagreements in my new healthy relationship giving me ptsd",
        "author": "throwfarawayokokokok",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/z28pc7/small_disagreements_in_my_new_healthy/",
        "text": "I met my now bf 4 months after I finally escaped my narc ex. Everything has been great and we eventually moved in together which eventually brought in little disagreements about small things while getting to know each other better (preferences on food, level of competition while gaming.. small things). \n\nHowever… some disagreement become more intense and lead into arguments. As soon as an argument begins and we’re at odds, I get nauseated, it activates my ptsd and triggers my body to go into fight or flight mode (it’s been flight and fawn for me). \n\nIt’s the same feelings I had when my ex fought with me. My current bf doesn’t say or do anything to hurt me, he listens and is respectful and tries to understand and argues fair but my body reacts so violently internally that I can barely breathe. After, I have a hard time recovering. Is this normal? When will it go away?",
        "created_utc": 1669159567,
        "upvote_ratio": 1.0
    },
    {
        "title": "Prevented from reminiscing on deceased grandparents around nparents",
        "author": "kariflack",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/z27cqb/prevented_from_reminiscing_on_deceased/",
        "text": "I've been thinking a lot especially about my maternal grandma who died 10 years ago and whose birthday is coming up soon after mine. I didn't even have a way to be around her in her final days, there was my nmom and her insane youngest sister just hovering. Out of her six surviving children, these two were thick as thieves financially abusing her and I was not in a super stable situation myself to try to prevent that, not to mention 1300 miles away. But in the midst of upheaval and having the only grandma I ever knew die, nmom was calling me and crying, just throwing all kinds of extra crap on me too. This is how the dynamic has ALWAYS been, until I went NC 7 years ago. And when I would bring up good memories about my grandpa as he was declining, she would shut me up by fake bawling until I dropped it. She was just mean as hell and acted as if none of this had any affect on me.\n\nA lot of this hit me today like a truck and just made me so sad. My body feels exhausted too. I've been thinking so much about my grandma and dreaming about her; she was so silly with me sometimes in unexpected ways and made stuff just she and I liked on Thanksgiving. She was so tender in watching over me in public unlike my parents -- in fact, they dropped me off with them so often it felt like shared custody sometimes (but they were always eager to drop us off for days with any friend whose parents could accommodate us). And they never complained about it. They were both great to me in ways my stupid selfish parents will never understand. \n\nI'm truly not sure why my nmom turned out the way she did. My grandparents never struck me as narcs. They survived the great depression and worked hard throughout their prime while investing wisely. Like insanely good. They had a good 25 years of straight retirement. They didn't live flashy lives but they loved going to Vegas to gamble which drove their two aforementioned fake righteous daughters nuts. Yet they funded everything for their kids if in a bind, and were generous to the grandchildren too.\n\nGod it's just all so sad and I truly miss them a lot.",
        "created_utc": 1669156423,
        "upvote_ratio": 1.0
    },
    {
        "title": "Confirmation NMom Hasn’t Changed",
        "author": "oldestofNmom",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/z25sk9/confirmation_nmom_hasnt_changed/",
        "text": "I have been LC for several years now. Since before the pandemic. The straw was when she fat fingered my email address and got an automated reply. She blamed me and wrote in our Christmas card how mean I was to do that to her. That’s just the straw of course. You all know the drill. We told her if she wanted to contact me, she could email DH and if he thought it was appropriate he would let me know. \n\nLately I’ve been sad, absorbing at another level that I may never see her again since she is in her 80s. But this week I got an email. She felt justified contacting me directly because “apparently,” she said, she no longer has DH’s email address. Turns out she fat fingered it, and seems to be blaming us again. \n\nThe pattern used to be that for the holidays she would needle me until I exploded and then get to play the poor, aggrieved victim. I am so glad I don’t play anymore.",
        "created_utc": 1669152884,
        "upvote_ratio": 1.0
    },
    {
        "title": "\"I once begged someone to love me the way I loved them, and that's the saddest thing I've ever done\"",
        "author": "Stupid_Situation83",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/z225p4/i_once_begged_someone_to_love_me_the_way_i_loved/",
        "text": "No fucking wonder I'm so full of shame.\n\nNever again!",
        "created_utc": 1669144560,
        "upvote_ratio": 1.0
    },
    {
        "title": "There is no closure, so if you're fresh into no contact quit thinking about getting closer. It will cause you to reverse Hoover and remove all of your fucking progress",
        "author": "Stupid_Situation83",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/z1xqx6/there_is_no_closure_so_if_youre_fresh_into_no/",
        "text": "The only closure you will ever get and this is very hard for me to even me to swallow, is knowing that you get to move on and heal and recover and be stronger and see these things before they get this bad again and grow into a beautiful human being. They will do no introspection they will do no healing they will do no changing and they will continue to do this copy paste relationship with all of their new supplies.\n\nI'm 5 months no contacts and I'm okay, I'm shameful because I stuck in it longer than I needed to. I'm a 38-year-old man and this is not where I thought I would be, but I have to understand my choices landed me here.\n\nGet a punching bag if you can It really helps to punch something non-human. Drink tons of water I know it sucks I hate fucking water but it helps and take care of yourself. Love you",
        "created_utc": 1669134076,
        "upvote_ratio": 1.0
    },
    {
        "title": "my grandmother just passed and bullshit from Nfamily has already started",
        "author": "wowlikeyikes",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/z1nz88/my_grandmother_just_passed_and_bullshit_from/",
        "text": "my grandmother just passed away tonight from old age. my Esister (possible N) tried calling me, called my spouse twice, AND THEN practically text-bombed my spouse begging to talk to me. i already heard the news from another family member at this time and i’ve been no contact with Esister since the pandemic, so i wasn’t going to change that now. plus i was still processing the fucking news. \n\nsince she wouldn’t stop texting my spouse, i texted her to tell her straight up that i went no contact with her and i can tell her why later, but i’m still processing and to please respect that. and what does she do? completely ignore me to ask if i wanted pictures of our grandma. i say no contact means i don’t want talk to her. again, she fucking ignores me and sends pictures anyway. i blocked her. \n\nNmom and Esiblings are all like this, always have been. they never fucking respected me or my boundaries, and i’m so not looking forward to dealing with their bullshit between now and the funeral. i do have Nmom blocked, but she does have her flying monkeys. and it fucking sucks because i’m sad about my grandma, but i can’t really process the news when i’m seething about the way my family treats me. UGH.",
        "created_utc": 1669104122,
        "upvote_ratio": 1.0
    },
    {
        "title": "My n husband unfriended me on Facebook.",
        "author": "Impossible-Case-2259",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/z1k1qe/my_n_husband_unfriended_me_on_facebook/",
        "text": "I finished my degree and got a new job. I got my own bank account to put my pay cheques in with the intention of transferring most of my money to our joint account for our family. I just need to be sure I can have a bit of my money to pay my credit card payment and get things I need like contact lenses and stuff for my kids. He has controlled our money the last year. It’s been so hard. He flew into a rage when he found out I got my own account. That was a couple weeks ago. I’ve just noticed he unfriended me on Facebook 🙄. He’s the most immature person in my life by far.",
        "created_utc": 1669090510,
        "upvote_ratio": 1.0
    },
    {
        "title": "The discard is when you really get to see their cold hearted inhumanity on display.",
        "author": "OkAvocado7",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/z1hxuq/the_discard_is_when_you_really_get_to_see_their/",
        "text": "My N discarded me the day before I flew back to our city after having cancer surgery. He wasn't my husband and we didn't live together and by that point I'd already been in deval for a while. It didn't happen out of the blue. But damn...\n\nHe told me over text message (!!) that he wouldn't be coming to get me from the airport the next day, and I realized this was actually him dumping me. I felt in my gut it was a discard not just another breakup or a silent treatment where I was being punished for some manufactured offense.\n\nI was *really* struggling financially at the time and had no extra money at all. He knew this but went ahead and told me to take an Uber. \n\nAnd he never checked in even once after I arrived home to see how I was doing post surgery. Not once.\n\nA few days after the discard I stupidly looked at his IG and saw that he had 4 new posts, including a couple of selfies the day after I flew in. He was all smiles, visiting an upscale part of our city. He even posted a photo he took of his meal at some restaurant. I was dying to comment \"Looking at this photo you would never know he left his girlfriend without a ride home from the airport when she flew in after surgery for cancer only one day before!\" I thought better of it.\n\nThe discard is when you really get to see their cold hearted inhumanity on display. I think he just didn't feel like picking me up at the airport bc it would have been a hassle, so this hastened me getting the boot. But in hindsight I think the worst was the IG posts. That level of insensitivity is downright sociopathic. Knowing that in reality this was how little I mattered to him... it was brutal.\n\nThe way they can decide they are done and then treat you like you are a stranger, really shows their lack of empathy. It's worse than a stranger bc at least with a stranger they can get acquainted, while with you you might as well be dead.\n\nWhat are your thoughts on the subject of discards?",
        "created_utc": 1669084289,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why did my narcissistic ex approach me months after saying that I wasn’t good enough for him?",
        "author": "Sad_Ad_5326",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/z1ck6z/why_did_my_narcissistic_ex_approach_me_months/",
        "text": "\nMy friends organized a party and since I have some common friends with my abusive narcissistic ex, he was also there. Which is weird because he wasn’t there the last few times but this time he drove 7 hours to come to the party.\n\nI had posted about my preparations for the party a few days before (I was responsible for the food). As soon as I was there, I noticed him, tried not to look at him and he just looked at me if I was food. He then kept staring and staring until he just approached me.\n\nHe acted as if nothing happened and complimented my hair and make up, asked me about my life ALTHOUGH he told me just a few months before that I was never good enough for him. Although he told me that he has always been out of my league. Although he laughed when I was crying because he broke up with me.\n\nWhat the hell? Why would somebody do that? I really believed that I’ve never been good enough for him, like he said, why did he approach me and compliment me and just wanted to be validated by me tonight?\n\nIn the end, when he became flirty, I told him that I moved on from him",
        "created_utc": 1669070062,
        "upvote_ratio": 1.0
    },
    {
        "title": "Teengers figuring things out",
        "author": "SuperKingPapi",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/z12q3u/teengers_figuring_things_out/",
        "text": "Divorced, coparenting (sort of...she doesn't parent them at all). They live with me, and visit her maybe every couple weeks. She lives with her boyfriend about 4 minutes away. They all think the boyfriend is  cool. \n\nMy teenage kids are putting it all together. \n\nThis weekend, they were having a massive conversation in the same room as me (I was trying to stay out of by playing a video game, but the truth is, they trust me, and they know i'm a safe place). \n\nIt was insightful and heartbreaking. They see her mask. They are confused by her \"pretending\". They see she is acting. They wonder why her \"friends\" don't see her for who she really is. The kids' friends who meet her say something is \"off\" with her. Like she's overly nice and acting like she is \"old friends\" with them, even if they just met her. She treats them like they are \"friends\", but they need(ed) a mom. They see that she was emotionally incapable. They see things that they are having issues with and connecting it to things they didn't get from their mom. Or should have gotten. They discussed the lack of connection.\n\nOne of the kids took her friend to the mom's apartment, and after they left, the friend was amazed at how my daughter could just flip a switch and be \"surface\" and \"friendly\" while around the mom. My daughter said it was a defense so she doesn't accidentally spill a feeling or issue and have to deal with the mom pretending to care. She said, \"She doesn't have permission to care about my life.\" This came about after so much effort and attempts to connect and have vulnerable and authentic conversations with the mom. Seems they've all given up on that being a reality.\n\nA couple of them said, \"I'm not angry with her, I'm sad for her.\" I chimed in with, \"I'm not sad for her, I'm sad for you guys.\" One daughter said, \"I'm sad for me.\"\n\nI'm so proud of them. They seem to be working out all this bullshit with insight and wisdom. I'm also heartbroken that they have to figure out how to shut off a part of their hearts.\n\nA few months ago I decided not to encourage them anymore to spend time with her. I was going off the idea that it was the right thing to do, but there's no point anymore. Maybe in the future, but the damage is done. They expected an apology or explanation or acknowledgement of the effects of her actions by now, but are realizing that it's probably not coming. It's been almost 2 years since she left us.",
        "created_utc": 1669046930,
        "upvote_ratio": 1.0
    },
    {
        "title": "Hoover attempt by snail mail",
        "author": "mother-of-vampires",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/z0x3fm/hoover_attempt_by_snail_mail/",
        "text": "I've been NC with my nex for about 2 months, after finding out he was cheating on me for 6/15 months we were together. I have him blocked on all social media. \nYesterday, I went to the house I bought and am renovating to prepare to move in, and found a box from him on my porch. The box contained a silk robe i had left at his place, some housewarming gifts, and a three page letter explaining how sorry he is and how he's changing and blah blah. I am not planning to respond to this in any way, but it's shocking how they're all the same....I was literally waiting for this to happen and told my therapist his MO seems to be around 2 months to try to rekindle contact. Also, the letter didn't explicitly mention his lies and cheating, just that he failed to be there for me when I needed him and didn't understand my feelings. That's true but uh, YOU CHEATED ON ME AND LIED ABOUT IT FOR SIX MONTHS? That's why I left!",
        "created_utc": 1669031529,
        "upvote_ratio": 1.0
    },
    {
        "title": "Hi and Sharing Some Challenging Workplace Experiences",
        "author": "Hairy_Tune_7962",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/z0ruds/hi_and_sharing_some_challenging_workplace/",
        "text": "Hi. I'm new to this subreddit and new to life after narcissism in general. I recently went through several toxic workplaces this year with narcissistic managers after vowing to myself I'd never allow anyone to treat me that way again. It seems that it is extremely challenging to heal from narcissistic abuse. The narcissistic individuals were good at hiding their intent initially. The worst part was each time, I ignored the subtle warning signal telling me \"no\" about a person or situation. I was in a tight spot financially each time and under extreme stress. I am again. I wish it was easier in general for everyone going through similar to find safe workplaces and the needed social networks and support. I was wondering if you've gone through similar and are willing to share what you did to stop the cycle. I hate the damage that narcissists do to us.",
        "created_utc": 1669012791,
        "upvote_ratio": 1.0
    },
    {
        "title": "Going home for the holidays…",
        "author": "yuletideclambake",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/z0fgvk/going_home_for_the_holidays/",
        "text": "…is never an option. Was never an option. Grief upon grief.\n\nMy Dad (an enabler, but also a victim), died from Stage IV cancer a week ago. His stomach ate itself from a lifetime of the stress. \n\nI just went no contact with my NMom and the dynamic has shifted for the first time, away from back-and-forth barbs to something much more final and a long time in the making. She finally has to sit in silence with herself and I’m not coming for her.\n\nIt’s all hard. I just want to go home, a home I didn’t have to labor over.",
        "created_utc": 1668978816,
        "upvote_ratio": 1.0
    },
    {
        "title": "When will it stop hurting?",
        "author": "Reasonable_Serve8001",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/z0f2ey/when_will_it_stop_hurting/",
        "text": "I'm on day 6 no contact. I'm in so much pain. I can't stop crying. I go from so sad to angry to longing to sad and angry. I have never been so hurt in my life. To find out the man I planned to marry never cared. He's never been mine. He's cheated and always kept accumulating ladies and mens numbers for when he needs a supply fix and I'm not around. I'm just here devasted while he's moved on within hours. It hurts so fucking bad. Please tell me stories of when it got better. Please tell me about your happily ever after bc right now I have no hope of getting over this.",
        "created_utc": 1668977869,
        "upvote_ratio": 1.0
    },
    {
        "title": "I got this apology",
        "author": "Jaded-Tiger3101",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/z0evy0/i_got_this_apology/",
        "text": "“It was wrong of me to lead you on, even if that’s what I felt in the moments, it wasn’t fair to lay a foundation. I didn’t mean to be manipulative, but that’s what ended up happening. I am sorry that I hurt your feelings and cut ties abruptly. That was mean. Please forgive me.” \n\nThis was after he asked me to move in and I met his mother. He then said he met someone else. I received this apology 2 months later of NC.\n\n“If you have guilt, that’s not my problem.” \n\n“I apologized because I’m an adult.” \n\nThat was the most childish thing I’ve ever read.",
        "created_utc": 1668977421,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to stop self-sabotage?",
        "author": "mindful-bed-slug",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/z0cz9f/how_to_stop_selfsabotage/",
        "text": "I was often a scapegoat, and my abusive parents tended to really ramp up the abuse whenever I was recognized as good at something in any way that wasn't purely academic or whenever a group of people liked me. It was usually intense psychological abuse that would last for days-- constant screaming, breaking objects, denying food and bathroom access until I abandoned the club or activity or friend group. Followed by mockery that could go on for years. \n\nOver the years, I've sabotaged several good career chances and isolated myself from friend groups that actually like me. I tend to work obsessively hard, so I was always great at getting to the first big sucess in a new field, but once people noticed me, I tended to just flee. Often blowing up my life dramatically and starting over. \n\nIt's when things get easy and suddenly a friendly crowd says \"join us,\" and \"you are good at this,\" and \"can you do more?\", that I feel overwhelming terror. Like existential terror. Like I start to self-harm if I can't get away from the situation. \n\nI went NC with my abusers four years ago when my health collapsed. I've been fighting to get my health back ever since. \n\nAnd now I've got an opportunity, unpaid work, but it's work I can do while disabled, and it's the most fun and meaningful thing I've done in years, and today the real terror hit. I can feel myself wanting to blow everything up. \n\nIt feels so overwhelming. I want to succeed. I like this work. I like the people I've met doing it. It fits my ethics, lets me be creative, and I'm good at it. I just need to put in the time and not sabotage myself. But I keep scrolling through social media during work time, or finding myself unable to make decisions about what direction to go, or obessing over tiny details and just re-doing the same work over and over without ever making progress and finishing a project to hand it in. \n\nPeople are contacting me to ask where my contribution is and I am ashamed because there is no \"real\" reason why I can't finish the work I committed to do. It's 90% done and I've spent the last 8 weeks just farting around while good ethical people who respect me are just waiting for me to be done. I don't know what to even tell them. Or how to finish the work. It feels absolutely impossible at this point. \n\nHas anyone worked through something like this? Can you cheer me on? Give me a mantra? Give advice? \n\nI've got a therapist, and I'm going to ask her for help, but this group often is better than my therapist at offering practical advice.",
        "created_utc": 1668972797,
        "upvote_ratio": 1.0
    },
    {
        "title": "The betrayal is overwhelming today",
        "author": "frankincenser",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/z0cnh0/the_betrayal_is_overwhelming_today/",
        "text": "They found out I had ptsd months ago and told a bunch of random strangers including once ditching me at the airport and calling airport police and falsely told them we were Out of contact and i was psychotic. Almost got me hospitalized. Our whole relationship was about how \"unwell \" i was\n\nThey finally caught on that I'm not in love with them anymore + sick of their bullshit and now they keep sending me emails like \"do you even remember when ..?\" And when I wrote back and said these were patronizing they drunk EMAILed me back \"cha\"\nAfter all that\nAfter all i DID get worse my mental health GOT SO much worse being with them\nAnd after all of that\n\"Cha\"\nJesus fucking christ",
        "created_utc": 1668971996,
        "upvote_ratio": 1.0
    }
]