[
    {
        "title": "[LPT] Intrusive thoughts",
        "author": "Empty-Dragonfly2941",
        "url": "https://www.reddit.com/r/LifeProTips/comments/11fje85/lpt_intrusive_thoughts/",
        "text": "I keep making myself scared with my thoughts I always say something in my head like “If I don’t win this game she’ll leave me” and every time I think something in my head it feels like it comes true like I’ll say I haven’t had somebody talk to me in a while or something happen then it comes true but these thoughts keep worrying me with things like this and I try to shut them out my head because my anxiety raises up when I don’t do something right by a certain amount of time when I say something is going to happen if I don’t do it any help?",
        "created_utc": 1677707749,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT Request: How to research conspiracy theories without alerting “the algorithm?”",
        "author": "vwlou89",
        "url": "https://www.reddit.com/r/LifeProTips/comments/11fi03z/lpt_request_how_to_research_conspiracy_theories/",
        "text": "I’m someone who has always liked learning and knowing things. I often hear people talking about what I would consider “conspiracy theories” but what they think are absolutely true facts. Given the state of technology, where I can’t even talk about a brand near my phone without seeing an ad for it that same day, can anyone give me tips on how to research some of the more “out there” conspiracy theories without being fed endless suggested ads, videos, etc. I don’t want my phone to think I’m “one of them” and try to sell me doomsday bunkers and freeze dried food and “tactical” gear and whatever else. \n\nAnd yes, I recognize there’s a reading of this as ironic: “he person who is so convinced ‘BiG tEcH iS wAtChInG’ and get not wanting to be pegged as a ‘conspiracy theorist.’” If you can’t understand the difference between digital advertising companies that track your online presence, and things like Flat Earth, Sovereign Citizenship, Q, etc. respectfully, I don’t think I’m interested in your advice on this topic.",
        "created_utc": 1677704619,
        "upvote_ratio": 1.0
    },
    {
        "title": "Request: How to research conspiracy theories without alerting “the algorithm”",
        "author": "vwlou89",
        "url": "https://www.reddit.com/r/LifeProTips/comments/11fhxbf/request_how_to_research_conspiracy_theories/",
        "text": "[removed]",
        "created_utc": 1677704454,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT: Press garlic vertically to squeeze it out like toothpaste with minimal waste",
        "author": "babydoll17448",
        "url": "https://www.reddit.com/r/LifeProTips/comments/11fghxd/lpt_press_garlic_vertically_to_squeeze_it_out/",
        "text": "Peel the garlic clove, cut it in half, then set each half upright into the press and squeeze. Voila, the skin doesn’t block the garlic from coming out, and the entire insides come out like play doh spaghetti factory!",
        "created_utc": 1677701693,
        "upvote_ratio": 1.0
    },
    {
        "title": "Chia seeds",
        "author": "UnabashedLiberal",
        "url": "https://www.reddit.com/r/LifeProTips/comments/11ff53u/chia_seeds/",
        "text": "[removed]",
        "created_utc": 1677700028,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT: If something does not work on your computer, even completely unrelated to graphics, you may try updating the graphics card driver.",
        "author": "JojoPalambas",
        "url": "https://www.reddit.com/r/LifeProTips/comments/11fc60p/lpt_if_something_does_not_work_on_your_computer/",
        "text": "Sometimes your PC stops properly working: application does not open, mouse disconnects, USB ports stop working, Wifi options disappear... It may be a good idea to update your GPU driver.\n\nA good friend of mine gave me this advice after fixing his computer this way. It saved me twice: once all of my 4 USB ports stopped working, once (today) my computer could not detect a single Wifi network. Both times updating the GPU driver fixed everything. I gave the advice to my father and he also fixed something (disconnecting Bluetooth I think) that way.\n\nI am not sure how it can mess up so many things, but an out-of-date GPU driver can cause many very various problems.",
        "created_utc": 1677696673,
        "upvote_ratio": 0.5
    },
    {
        "title": "LPT: Before throwing out old sneakers or shoes, consider donating them to organizations that recycle or repurpose them.",
        "author": "jda815",
        "url": "https://www.reddit.com/r/LifeProTips/comments/11fc2bi/lpt_before_throwing_out_old_sneakers_or_shoes/",
        "text": "Some organizations turn old shoes into playground surfaces, while others distribute them to communities in need. It's a great way to declutter your home while also helping the environment and those in need.",
        "created_utc": 1677696560,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT: When meeting new people, ask about what keeps them busy instead of asking what they do for a living",
        "author": "omaraltaher",
        "url": "https://www.reddit.com/r/LifeProTips/comments/11fbief/lpt_when_meeting_new_people_ask_about_what_keeps/",
        "text": "It can be less awkward with people who aren’t employed. More importantly, you get more interesting answers because not everyone wants to talk about their job",
        "created_utc": 1677695865,
        "upvote_ratio": 1.0
    },
    {
        "title": "Grammar fear",
        "author": "spinonkAlex",
        "url": "https://www.reddit.com/r/LifeProTips/comments/11fbe7z/grammar_fear/",
        "text": "[removed]",
        "created_utc": 1677695592,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT: Do not teach your SO how to do something you love.",
        "author": "HarryCaul",
        "url": "https://www.reddit.com/r/LifeProTips/comments/11far2o/lpt_do_not_teach_your_so_how_to_do_something_you/",
        "text": "This might seem cruel or selfish, but it's not. If you have a hobby, especially a physical one - like surfing, climbing, skiing, golfing, etc - do not try and teach your loved one how to do it. Instead, if they are interested, be supportive but tell them they should take a lesson and that you'll even help pay for it. Why? Because you are not an instructor, you're a hobbyist. I can't tell you how many times I've seen the worst pulled out of people as they try \"teach\" their partner how to do something they love. An instructor will be courteous, professional, and patient. You, on the other hand, will have to play the role of romantic partner and teacher at the same time; there's a reason most of us don't bang our teachers and vice versa, outside the world of fantasy: because it doesn't work. It's messy and you will annoy the crap out of each other and everyone around you. \n\nObviously this doesn't apply to those who are professional instructors, but I'd probably recommend those people get a friend to do it as well.\n\nAlso, I'm sure there will be lots of people who say things like \"teaching my girlfriend how to rock climb brought us so much closer together!!!\" That's great and I applaud you. However, for every one of those anecdotes, I'd wager there are untold thousands suffering the didactic idiocy of their partners in public spaces every single day.",
        "created_utc": 1677694134,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT: When you are learning a new langague, try switching the langague of all your apps",
        "author": "28nov2022",
        "url": "https://www.reddit.com/r/LifeProTips/comments/11fadq5/lpt_when_you_are_learning_a_new_langague_try/",
        "text": "",
        "created_utc": 1677693305,
        "upvote_ratio": 1.0
    },
    {
        "title": "Need Help",
        "author": "kirradawg",
        "url": "https://www.reddit.com/r/LifeProTips/comments/11fa6v1/need_help/",
        "text": "[removed]",
        "created_utc": 1677692847,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT: Covered in hundreds of seed ticks? Use a lint roller to get them off!",
        "author": "graywolf0426",
        "url": "https://www.reddit.com/r/LifeProTips/comments/11fa2k0/lpt_covered_in_hundreds_of_seed_ticks_use_a_lint/",
        "text": "This only works if the ticks haven’t attached themselves to you. It’s great at discovering and getting rid of ticks you can’t quite see. Often times seed ticks, those who haven’t had a first meal yet, sit in clusters and it’s extremely easy to walk into them and get covered. Stay safe and always check for ticks after hikes!!!",
        "created_utc": 1677692563,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT: Please please please understand that when starting to workout, CONSISTENCY is wayyy more important than a well chosen workout. And that you need to start really small at first to prove you can do it, then upgrade as youre months in.",
        "author": "ImPretendingToCare",
        "url": "https://www.reddit.com/r/LifeProTips/comments/11f9eev/lpt_please_please_please_understand_that_when/",
        "text": "**We have all planned to start a life changing routine at 1 point in our lives. If youve dropped it before, this is for you.**\n\n# HEAR ME OUT.\n\nLets say 1 day i wake up and i want to change my life. Go online, learn some things blah blah blah and BAM ive created a new workout routine.  \n\n\nMon: ..  Chest day - Triceps  \nTues: ..  Legs  \nWedn: ..  Biceps - Shoulders  \nThur: ..  Cardio (or whatever else you have planned)  \n\n\nIf its your FIRST time ever attempting to workout feel free to go try it. Some people succeed and change their lives.. over 99% do not stick with it for years or long enough to have life changing effects.  \n\n\nIf you are one of those who have stopped consistently doing your routine. This is for you.  \n\n\nCut that routine in half (ex.) Pick half of the most important workouts in that routine.   \nSo i would go..  \n\n\nMon: - **Chest**  \nTues: - **Squats**  \nWedn: - **Biceps**  \n\n\nAnd see if you can go 3 months in a row without missing a workout. If you can. add now a 4th exercise and see if you can go the 3 months.. If you cant, revert to the 3 exercises, complete the 3 months again, then try again to add the 4th after those 3 months again. Until you can complete the 3 months of ANY exercise DONT add anything else to it.. A LOT of the times youre gonna be feeling high energy and say \"*man this week i really want to try 7 all my workouts*\" **DONT .. ITS A SCAM.** Complete your 3 months then add 1 at a time no matter how good youre feeling that day.   \n\n\nLets say you revert to half and STILL cant complete 3 months consistently.   \n\n\nCut it again. Try doing any combo of a cut. Maybe you can just do 2 in 1 day, or 2 in 2 days.   \n\n\nSo example:  \n\n\nMon: **Chest**   \nTues: **Squats**  \n\n\nor  \n\n\nMon: **Chest - Squats**  \n\n\nGiving you 6 free days a week.  \n\n\nAnd thats it. Prove to yourself you can do that for 3 months.    \n\n\n# Working out should be a mental reach for consistency and not doing the most badass feel good pumped up workout for that week. Try to reach that 3 month period. \n\n# \n\nIf even 2 workouts is too much start with 1. Half of this comes from a video i saw on tiktok where a guy explained when starting to workout just do biceps curls for 30 days NOTHING ELSE he stressed, JUST bicep curls.. Youll see a noticeable difference and that confidence boost is huge when beginning to get into regular training.",
        "created_utc": 1677691013,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT Request: How I convince my dad that I worth more than an empty shop?",
        "author": "elyasabsz",
        "url": "https://www.reddit.com/r/LifeProTips/comments/11f8b38/lpt_request_how_i_convince_my_dad_that_i_worth/",
        "text": "Hello everyone, Hope you are having a great time.\nI don't know if it's the right place to ask this question or not.\nBut here's the deal, I am trying to work in CG industry and I am kinda good at what I am doing, And my problem is that currently I am not working because I am going to university and I can't focus on so many tasks at once.\nI mean I am trying to learn architecture in university, Learning 3d softwares by my self at home and I am trying to learn English language, Also last year I was busy to get my certificates for some of my skills.\nI am m/22 need a better computer to expand my skills and my current pc is holding me back. because of the situation of my country (I live in Iran) prices are very high and prices are rising daily. my father has the financial ability to provide me with a high-end workstation pc and it would be a small fraction of his wealth. He is willing to buy me car which I don't need at all but he refuses to buy me a graphics card which is not that expensive. yesterday he took me to an alley around city centre and showed me a empty shop which was around 10 square meters and he said his gonna buy it. that shop is at least 10 times more expensive than the graphics card. And I am 100 percent sure that in long term I will earn way more money than that mall shop which he is going to rent. It's not just this time, since I remember my parents didn't care for my education and stuff like that. I don't know how to convince him that I need that piece of hardware and I am serious with what I am doing.",
        "created_utc": 1677688454,
        "upvote_ratio": 1.0
    },
    {
        "title": "Its almost time yalll....dont wait until the last minute!",
        "author": "Willing-Ad-5083",
        "url": "https://www.reddit.com/r/LifeProTips/comments/11f89jq/its_almost_time_yallldont_wait_until_the_last/",
        "text": "[removed]",
        "created_utc": 1677688352,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT: Leave this sub and move on with your life",
        "author": "rasmus9311",
        "url": "https://www.reddit.com/r/LifeProTips/comments/11f7htl/lpt_leave_this_sub_and_move_on_with_your_life/",
        "text": "",
        "created_utc": 1677686545,
        "upvote_ratio": 0.43
    },
    {
        "title": "LPT: If you want portable access to ice-cold water the next day and have a freezer, pour a gallon jug about 1/4 full of water and freeze it overnight (leave the jug cap partially open.) Then, the next morning, fill the jug up 100% and slosh it around; the contents should remain cold the whole day.",
        "author": "n00chness",
        "url": "https://www.reddit.com/r/LifeProTips/comments/11f79z5/lpt_if_you_want_portable_access_to_icecold_water/",
        "text": "",
        "created_utc": 1677686051,
        "upvote_ratio": 0.75
    },
    {
        "title": "LPT: when cutting up a credit card, dispose of the bits in different garbage bins to deter reassembly.",
        "author": "icanhazglass",
        "url": "https://www.reddit.com/r/LifeProTips/comments/11f79yg/lpt_when_cutting_up_a_credit_card_dispose_of_the/",
        "text": "",
        "created_utc": 1677686050,
        "upvote_ratio": 1.0
    },
    {
        "title": "When cutting up a credit card, disperse the bits in different garbage bins to deter reassembly.",
        "author": "[deleted]",
        "url": "",
        "text": "[removed]",
        "created_utc": 1677685987,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT: Make sure your pets travel in the human section of the car",
        "author": "wattatam",
        "url": "https://www.reddit.com/r/LifeProTips/comments/11f71ul/lpt_make_sure_your_pets_travel_in_the_human/",
        "text": "The human parts of cars are much safer. Having a harness attached to seatbelts for larger dogs or a restrained/contained area for little dogs means they are much more likely to survive a car accident. It also makes things safer for first responders in the event of an accident as the dogs are restrained, makes things safer for you and your human passengers compared to being loose in the vehicle as they dont turn into heavy fur projectiles in a collision, and makes things safer for the dogs because they aren't launched into the windshield or able to escape. I take car accident calls and do not want anyone to suffer the way a recent caller did when her car was rear-ended with her dogs in the trunk.",
        "created_utc": 1677685501,
        "upvote_ratio": 0.25
    },
    {
        "title": "LPT: GETTING YOUR TECH GEAR IN ORDER AND GETTING YOUR TIME BACK!",
        "author": "Studentmindset",
        "url": "https://www.reddit.com/r/LifeProTips/comments/11f6cvi/lpt_getting_your_tech_gear_in_order_and_getting/",
        "text": "Let's face it, we've all been there - digging through a mess of tangled cords and wondering where the heck our phone charger went. To avoid this frustrating and time-consuming experience, it's time to get your electric components and cords organized.\n\nFirst things first, you gotta label your cords. I know, I know - you're probably thinking \"who has time for that?\" But trust me, it'll save you from the headache of trying to figure out which cord goes where. So grab some tape or a label maker and get to labeling!\n\nNext up, use some cord organizers to keep those pesky cords in line. I mean, they're like a bunch of unruly kids - they need to be corralled and kept in check. You can use zip ties, Velcro straps, or even clothespins to bundle those cords together.\n\nIf you're feeling fancy, you can even use cable sleeves to keep those cords hidden from view. It's like a little sweater for your cords - cute AND functional.\n\nAnd finally, keep those cords off the ground! You don't want them getting all tangled up with your feet and causing a major tripping hazard. Use hooks or clips to keep those cords elevated and out of harm's way.\n\nTrust me, your future self will thank you for taking the time to get those cords under control.",
        "created_utc": 1677683867,
        "upvote_ratio": 0.67
    },
    {
        "title": "LPT: headphones that can save your sanity",
        "author": "Studentmindset",
        "url": "https://www.reddit.com/r/LifeProTips/comments/11f6avl/lpt_headphones_that_can_save_your_sanity/",
        "text": "[removed]",
        "created_utc": 1677683732,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT: avoid all toll roads",
        "author": "Studentmindset",
        "url": "https://www.reddit.com/r/LifeProTips/comments/11f68i7/lpt_avoid_all_toll_roads/",
        "text": "If you want to avoid toll roads while driving, use the \"Avoid Tolls\" feature in your GPS app or map software. This will ensure that your route is free of tolls and will give you alternate routes to take instead. If you don't have a GPS or map software with this feature, try using Google Maps and toggle the \"Avoid tolls\" option under \"Route Options.\" This can save you time and money on your journey. Additionally, you can plan your route ahead of time and research toll-free routes in your area, so you can avoid toll roads altogether.",
        "created_utc": 1677683575,
        "upvote_ratio": 0.19
    },
    {
        "title": "LPT: If you ever accidentally delete a tab on your pc/computer, do this…",
        "author": "[deleted]",
        "url": "",
        "text": "[deleted]",
        "created_utc": 1677682291,
        "upvote_ratio": 0.33
    },
    {
        "title": "[LPT] Drying your white clothes directly in the sun is a very effective way to keep them perfectly white.",
        "author": "NorthBreton",
        "url": "https://www.reddit.com/r/LifeProTips/comments/11f59b3/lpt_drying_your_white_clothes_directly_in_the_sun/",
        "text": "",
        "created_utc": 1677681159,
        "upvote_ratio": 0.68
    },
    {
        "title": "[LPT] Drying your with clothes directly in the sun is a very effective way to keep them perfectly white.",
        "author": "[deleted]",
        "url": "",
        "text": "[deleted]",
        "created_utc": 1677681086,
        "upvote_ratio": 1.0
    },
    {
        "title": "Drying your white clothes directly in the sun is a very effective way to keep them perfectly white.",
        "author": "[deleted]",
        "url": "",
        "text": "[removed]",
        "created_utc": 1677680991,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT: When asked by an interviewer what your greatest weakness is, give a skill, not a trait.",
        "author": "VanessaCardui93",
        "url": "https://www.reddit.com/r/LifeProTips/comments/11f4809/lpt_when_asked_by_an_interviewer_what_your/",
        "text": "Giving a personality trait as a weakness (e.g. “I struggle with time management” or “I’m not good at working in a team”) is hard to measure in terms of progress/improvement and is also something that is more difficult to change as it’s an ingrained habit. \n\nYou also don’t want to give a fake answer like “I work too hard” or “I’m too much of a perfectionist.” This always comes across disingenuous. \n\nInstead, list a skill related to your job that you might be weaker in. Use the question to bring up an aspect of the role that you’d like to improve in and show you’re aware of the steps you need to take in order to improve. For example, you could list some courses you’d like to take, or talk about the information you have bookmarked/downloaded to improve your skills in this area. \n\nThis turns a potentially negative question into a positive answer that shows A) self awareness, B) understanding of how to improve your skills, C) willingness to learn and D) ambition to grow in your career without coming across as disingenuous, making any weaknesses into opportunities. \n\nHappy interviewing!",
        "created_utc": 1677678520,
        "upvote_ratio": 0.96
    },
    {
        "title": "LPT: A simple way to make a secure password that is easy to remember is to take a normal, familiar word and change some of its letters into visually-similar characters. For example, if your favorite food is cheese pizza, your password can be Ch33$3P!zz@.",
        "author": "Thunder-_-Bear-",
        "url": "https://www.reddit.com/r/LifeProTips/comments/11f3zqw/lpt_a_simple_way_to_make_a_secure_password_that/",
        "text": "",
        "created_utc": 1677677888,
        "upvote_ratio": 0.37
    },
    {
        "title": "LPT: When you need to remember to bring something with you, put your car keys on it the night before...",
        "author": "[deleted]",
        "url": "",
        "text": "[deleted]",
        "created_utc": 1677676730,
        "upvote_ratio": 0.72
    },
    {
        "title": "LPT: If you can’t find what you’re looking for on the internet, try adding reddit to the end of your google search. Chances are someone on reddit has asked the same question and got a decent response",
        "author": "[deleted]",
        "url": "",
        "text": "[removed]",
        "created_utc": 1677676594,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT: When buying new things (especially electronics) save your boxes",
        "author": "blanquito82",
        "url": "https://www.reddit.com/r/LifeProTips/comments/11f3hsu/lpt_when_buying_new_things_especially_electronics/",
        "text": "When moving time comes, all of your high value things will be shipped in an optimal way. Save the foam as well. Movers DGAF.",
        "created_utc": 1677676498,
        "upvote_ratio": 0.31
    },
    {
        "title": "How long should you try something before giving up?",
        "author": "LeLeofficial",
        "url": "https://www.reddit.com/r/LifeProTips/comments/11f3frc/how_long_should_you_try_something_before_giving_up/",
        "text": "[removed]",
        "created_utc": 1677676335,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT: If you can’t find what you’re looking for on google, try adding “reddit” to the end of your google search. Chances are someone on reddit has asked the same question and got a decent response",
        "author": "[deleted]",
        "url": "",
        "text": "[removed]",
        "created_utc": 1677676281,
        "upvote_ratio": 1.0
    },
    {
        "title": "How long do you wait before quitting?",
        "author": "LeLeofficial",
        "url": "https://www.reddit.com/r/LifeProTips/comments/11f3dmf/how_long_do_you_wait_before_quitting/",
        "text": "[removed]",
        "created_utc": 1677676172,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT: If you're looking to improve career opportunities, you need a library card. There are thousands of high quality courses",
        "author": "ZAYZDN",
        "url": "https://www.reddit.com/r/LifeProTips/comments/11f39gw/lpt_if_youre_looking_to_improve_career/",
        "text": "[removed]",
        "created_utc": 1677675843,
        "upvote_ratio": 1.0
    },
    {
        "title": "any online course is available best prices",
        "author": "ZAYZDN",
        "url": "https://www.reddit.com/r/LifeProTips/comments/11f35qn/any_online_course_is_available_best_prices/",
        "text": "[removed]",
        "created_utc": 1677675576,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT: Unlock Your Potential with Our Wide Range of Expert-Led Online Courses! 20$ Sorry, this post has been removed by the moderato",
        "author": "ZAYZDN",
        "url": "https://www.reddit.com/r/LifeProTips/comments/11f33wd/lpt_unlock_your_potential_with_our_wide_range_of/",
        "text": "[removed]",
        "created_utc": 1677675421,
        "upvote_ratio": 1.0
    },
    {
        "title": "Unlock Your Potential with Our Wide Range of Expert-Led Online Courses! 20$",
        "author": "ZAYZDN",
        "url": "https://www.reddit.com/r/LifeProTips/comments/11f32fi/unlock_your_potential_with_our_wide_range_of/",
        "text": "[removed]",
        "created_utc": 1677675308,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT: If your car's dashboard lights won't turn on for any apparent reason, check your tail lights.",
        "author": "79TranZam",
        "url": "https://www.reddit.com/r/LifeProTips/comments/11f2qsu/lpt_if_your_cars_dashboard_lights_wont_turn_on/",
        "text": "Many cars have their electronics set up so if the tail lights are having issues the dash lights won't turn on either to let you know something is wrong.",
        "created_utc": 1677674349,
        "upvote_ratio": 0.61
    },
    {
        "title": "LPT: Prioritize your opinion on yourself over other people’s opinion on yourself.",
        "author": "dominorr",
        "url": "https://www.reddit.com/r/LifeProTips/comments/11f21a0/lpt_prioritize_your_opinion_on_yourself_over/",
        "text": "It’s in our biology to care about other people’s opinion, because it brings social benefits. It’s also in our control to place our opinion on ourselves higher than other’s opinion on ourselves.\n\nI’m not saying to disregard feedback completely.",
        "created_utc": 1677672214,
        "upvote_ratio": 0.79
    },
    {
        "title": "LPT Request: Dating Anxiety: The 3 Dating Mistakes",
        "author": "Lorennmetz1010",
        "url": "https://www.reddit.com/r/LifeProTips/comments/11f1jvy/lpt_request_dating_anxiety_the_3_dating_mistakes/",
        "text": "[removed]",
        "created_utc": 1677670697,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT: To stop constantly interrupting people, try challenging yourself to listen for a certain amount of time before responding. For example, try listening for 30 seconds before you say anything. Gradually increase the time as you get better at controlling your urge to interrupt.",
        "author": "[deleted]",
        "url": "",
        "text": "[deleted]",
        "created_utc": 1677667974,
        "upvote_ratio": 0.44
    },
    {
        "title": "LPT when you’re in a hotel and watching TV at night you will rarely have any ability to turn down the brightness that is set for bright daytime viewing. Your best option might be to wear your sunglasses.",
        "author": "brickmadness",
        "url": "https://www.reddit.com/r/LifeProTips/comments/11f0pcb/lpt_when_youre_in_a_hotel_and_watching_tv_at/",
        "text": "",
        "created_utc": 1677667811,
        "upvote_ratio": 0.12
    },
    {
        "title": "LPT",
        "author": "[deleted]",
        "url": "",
        "text": "[removed]",
        "created_utc": 1677662229,
        "upvote_ratio": 1.0
    },
    {
        "title": "Make Money Watching Unlimited Ads with Our New App - VPN and Auto Clicker Friendly, Up to 100 Devices per Household Allowed!",
        "author": "starfall117",
        "url": "https://www.reddit.com/r/LifeProTips/comments/11ez5py/make_money_watching_unlimited_ads_with_our_new/",
        "text": "[removed]",
        "created_utc": 1677662023,
        "upvote_ratio": 0.66
    },
    {
        "title": "Alcoholism shrank my D",
        "author": "Bchamp78",
        "url": "https://www.reddit.com/r/LifeProTips/comments/11eyth8/alcoholism_shrank_my_d/",
        "text": "[removed]",
        "created_utc": 1677660752,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT: Here’s the best way to make money fast",
        "author": "bitcoininu",
        "url": "https://www.reddit.com/r/LifeProTips/comments/11eybdk/lpt_heres_the_best_way_to_make_money_fast/",
        "text": "[removed]",
        "created_utc": 1677658720,
        "upvote_ratio": 1.0
    },
    {
        "title": "Here’s the best way to make money fast",
        "author": "[deleted]",
        "url": "",
        "text": "[removed]",
        "created_utc": 1677658653,
        "upvote_ratio": 1.0
    },
    {
        "title": "I feel like I took the wrong path in life and ever since, everything feels wrong, as if I’m living a lie or in a parallel universe. How do I stop this feeling?",
        "author": "Inevitable_Ad5565",
        "url": "https://www.reddit.com/r/LifeProTips/comments/11exbd2/i_feel_like_i_took_the_wrong_path_in_life_and/",
        "text": "",
        "created_utc": 1677655025,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT: Use two different bank account/companies to create savings without realizing it. Simple and INCREDIBLY useful for frugal spenders. Also good for those that want to save to go back to school and not having to work, such as myself.",
        "author": "[deleted]",
        "url": "",
        "text": "[deleted]",
        "created_utc": 1677654803,
        "upvote_ratio": 0.43
    },
    {
        "title": "LPT: If you want to learn a language, learn vocabulary most of all first. No grammar speak possible. But no words no can speak.",
        "author": "[deleted]",
        "url": "",
        "text": "[deleted]",
        "created_utc": 1677654458,
        "upvote_ratio": 0.56
    },
    {
        "title": "LPT: Use AI to generate letters to your local elected official.",
        "author": "wild_heart_",
        "url": "https://www.reddit.com/r/LifeProTips/comments/11ewi33/lpt_use_ai_to_generate_letters_to_your_local/",
        "text": "I did this yesterday because the Mayor of my city voiced out that he wanted to take away telework. It was the first time I've ever sent a letter to an elected official, and seeing as how easy it was to have ChatGPT convey my stance and reasons, I will be doing this more often!",
        "created_utc": 1677652272,
        "upvote_ratio": 0.61
    },
    {
        "title": "LPT: Always have shoes on in the kitchen.",
        "author": "[deleted]",
        "url": "",
        "text": "[deleted]",
        "created_utc": 1677647554,
        "upvote_ratio": 0.55
    },
    {
        "title": "go to my discord and press on the link for a good surprise",
        "author": "gvuhchgfgffgfg",
        "url": "https://www.reddit.com/r/LifeProTips/comments/11euqkj/go_to_my_discord_and_press_on_the_link_for_a_good/",
        "text": "[removed]",
        "created_utc": 1677646672,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT: If you remember to zip up your full-zip sweatshirts before washing them, you will avoid the dreaded wavy appearance they obtain. Once is enough to ruin it though, so start this when you get a new one.",
        "author": "Foreignfig",
        "url": "https://www.reddit.com/r/LifeProTips/comments/11eukgn/lpt_if_you_remember_to_zip_up_your_fullzip/",
        "text": "",
        "created_utc": 1677646134,
        "upvote_ratio": 0.9
    },
    {
        "title": "LPT: If you want to save a screenshot of a long webpage, rotate your laptop screen from landscape to portrait and take a screenshot.",
        "author": "innocuous_path",
        "url": "https://www.reddit.com/r/LifeProTips/comments/11eu5ae/lpt_if_you_want_to_save_a_screenshot_of_a_long/",
        "text": "",
        "created_utc": 1677644830,
        "upvote_ratio": 0.47
    },
    {
        "title": "LPT - If you want to save a screenshot of a long webpage, rotate your laptop screen from landscape to portrait and take a screenshot.",
        "author": "[deleted]",
        "url": "",
        "text": "[removed]",
        "created_utc": 1677644673,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT: If you want to save a screenshot of a long webpage, rotate your laptop screen from landscape to portrait and take a screenshot.",
        "author": "[deleted]",
        "url": "",
        "text": "[removed]",
        "created_utc": 1677644590,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT: If you’re ever dropping someone off, especially after dark, always wait to leave until they’re safely inside their house, car, etc.",
        "author": "TheSovietSailor",
        "url": "https://www.reddit.com/r/LifeProTips/comments/11eu2cn/lpt_if_youre_ever_dropping_someone_off_especially/",
        "text": "",
        "created_utc": 1677644573,
        "upvote_ratio": 0.95
    },
    {
        "title": "LPT Request: Having Common Sense",
        "author": "Fun-Recover8211",
        "url": "https://www.reddit.com/r/LifeProTips/comments/11etzfn/lpt_request_having_common_sense/",
        "text": "How can I always force myself to have common sense and take precautions to avoid risks? I tend to not always make the best choices because I sometimes forget to think them through.",
        "created_utc": 1677644333,
        "upvote_ratio": 0.71
    },
    {
        "title": "LPT REQUEST : Flying In Business Class",
        "author": "RedoHawk",
        "url": "https://www.reddit.com/r/LifeProTips/comments/11etg2a/lpt_request_flying_in_business_class/",
        "text": "[removed]",
        "created_utc": 1677642761,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT: Brewing a cup of zinger tea cleans out all the green tea stains from your cup.",
        "author": "MikeOKurias",
        "url": "https://www.reddit.com/r/LifeProTips/comments/11etdl2/lpt_brewing_a_cup_of_zinger_tea_cleans_out_all/",
        "text": "I discovered this by accident a couple days ago and asked the pros over at r/tea and it turns out there is citric acid in the hibiscus leaves and, along with the hot water, it liberates the other tea stains from your cup.\n\nIf you have a \"hand-wash only\" only mug like me, this is an ~~~easy~~~ tasty way to keep it stain-free",
        "created_utc": 1677642560,
        "upvote_ratio": 0.73
    },
    {
        "title": "LPT: Want to read an article but don't want to pay for access? Copy/paste the URL into the Internet Archive's Wayback Machine.",
        "author": "DandelionsDandelions",
        "url": "https://www.reddit.com/r/LifeProTips/comments/11et8n0/lpt_want_to_read_an_article_but_dont_want_to_pay/",
        "text": "Obviously please support publications that offer reputable and quality journalism, but for those who want to read an article or two and can't afford to pay for access, this is a good once in a while alternative. It works best for older links obviously, I use it to read pieces from the NYT or The Atlantic and similar websites.\n\n\n(Seriously though, support your favorite online news and contents sources if you can afford to!)\n\nEdit: yes, it doesn't work for everything. It has to have been archived previously. Again, this works best for older links and articles, as well as very popular ones if you're looking for something more recent.",
        "created_utc": 1677642153,
        "upvote_ratio": 0.82
    },
    {
        "title": "LPT: You can better your 'Targeted Ads' by blocking the user attached to the Ad on reddit and 'up voting' any Ads that help with positive reinforcement of a 'Good Ad'",
        "author": "fishy2sea",
        "url": "https://www.reddit.com/r/LifeProTips/comments/11et7wb/lpt_you_can_better_your_targeted_ads_by_blocking/",
        "text": "",
        "created_utc": 1677642094,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT: Using roadside assistance via your car insurance may get your insurance canceled",
        "author": "mmmmpisghetti",
        "url": "https://www.reddit.com/r/LifeProTips/comments/11esemc/lpt_using_roadside_assistance_via_your_car/",
        "text": "LPT: Do not use roadside assistance through your car insurance company.  Every time you do it counts as a claim and your insurance may be canceled/ not renewed.  I saw a post on legaladvice where someone was having this issue with State Farm and it reminded me of having the same issue with them years ago.  I had a couple of lockouts and a tow, next thing I know I'm getting a cancelation letter as they counted all of those as claims!  Keep roadside services separate by getting AAA or something like that.  \n\nIt may be different with other companies, but as little as AAA costs especially if you drive the shit cars I used to have its best not to risk messing up your insurance.",
        "created_utc": 1677639805,
        "upvote_ratio": 0.77
    },
    {
        "title": "[LPT] WHAT IS LIFE ABOUT? Inspiring Messages, Quotes, Life Wisdom, Personal Growth",
        "author": "[deleted]",
        "url": "",
        "text": "[removed]",
        "created_utc": 1677639180,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT: As your female child develops/shows signs of puberty, discuss bodily changes and what to expect with menstruation",
        "author": "LabRatPerson",
        "url": "https://www.reddit.com/r/LifeProTips/comments/11es4np/lpt_as_your_female_child_developsshows_signs_of/",
        "text": "Pack a small bag with extra pads and underwear and explain how to use them for them to keep in their backpack. This helped my daughter immensely. She wasn’t scared and knew exactly what to do.",
        "created_utc": 1677639052,
        "upvote_ratio": 0.58
    },
    {
        "title": "LPT: If you return something, the refund counts towards your previous billed amount. You could use this to essentially get an interest free loan.",
        "author": "IPUPVP",
        "url": "https://www.reddit.com/r/LifeProTips/comments/11erczj/lpt_if_you_return_something_the_refund_counts/",
        "text": "Let's say you buy your normal life necessities and have a credit card bill of $2000. After the bill cycle closes, your billed amount is $2000.\n\nNow you buy a refundable airline ticket for $1500. Once that charge posts (2-3 days), you cancel the ticket. The money will go back to your card in 5-6 days. \n\nHere's the catch: that 1500 that went back counts towards your prior billed amount so now, you only need to pay 500 and your previous months bill is paid off. \n\nYour next months bill (assuming you make no other purchases) will be 1500. So essentially, you got an interest free 1500 loan. You could repeat this process ad infinitum. \n\nCaveat: I don't know if this actually can reduce your prior bill to 0 or only up to the minimum payment. \nCaveat: I have seen this on my Chase card - YMMV on a different issuer.\n\nEdit: typos/grammar",
        "created_utc": 1677636924,
        "upvote_ratio": 0.24
    },
    {
        "title": "[LPT] Never mix cold/flu medicines. Most acenocumarol (paracetamol) overdoses occur due to combine different products to ease the symptoms. Always check the label &amp; composition before taking a new one, or ask the pharmacist.",
        "author": "Volgrand",
        "url": "https://www.reddit.com/r/LifeProTips/comments/11erbfm/lpt_never_mix_coldflu_medicines_most_acenocumarol/",
        "text": "NOTE: I wrote \"acenocoumarol\" by mistake where I should have written \"acetaminophen\".",
        "created_utc": 1677636804,
        "upvote_ratio": 0.87
    },
    {
        "title": "LPT: If you're going to overdraft your bank account, do it once for more money than what your purchase is for.",
        "author": "Gracinx",
        "url": "https://www.reddit.com/r/LifeProTips/comments/11er21t/lpt_if_youre_going_to_overdraft_your_bank_account/",
        "text": "Former bank employee here, while I wasn't ever supposed to say this to a customer, I did.\n\nIf for some reason you're going to overdraft your account, say you're at Walmart and need to buy $100 groceries, and you only have $20 in your account. If your bank allows you to overdraft your account by making this purchase, then get cash back as well.\n\nSometimes, life sucks and financially, we get into tight spots. Every bank has overdraft fees, and they are set up to be charged out per transaction. So, if you make two overdraft purchases, they'll hit you with 2 separate overdraft fees. However, if you are aware you're going to overdraft, get the extra cash so you(hopefully) don't have to continue to rack up those individual fees.\n\nThe same applies to writing a check for those of you who still do that.",
        "created_utc": 1677636087,
        "upvote_ratio": 0.94
    },
    {
        "title": "LPT: You can save a lot of time updating your resume simply by asking ChatGPT to act as a Professional Resume Editing service",
        "author": "Powder9",
        "url": "https://www.reddit.com/r/LifeProTips/comments/11eqvro/lpt_you_can_save_a_lot_of_time_updating_your/",
        "text": "",
        "created_utc": 1677635621,
        "upvote_ratio": 0.75
    },
    {
        "title": "LPT: Wash your socks in a mesh laundry bag",
        "author": "alyakmi",
        "url": "https://www.reddit.com/r/LifeProTips/comments/11eqmo6/lpt_wash_your_socks_in_a_mesh_laundry_bag/",
        "text": "This way you don't have to waste time searching for that missing sock! All socks in one place. I keep mine clipped to the laundry basket until it has enough socks for a wash.",
        "created_utc": 1677634924,
        "upvote_ratio": 0.84
    },
    {
        "title": "LPT: Don't commit check fraud",
        "author": "[deleted]",
        "url": "",
        "text": "[deleted]",
        "created_utc": 1677634828,
        "upvote_ratio": 0.54
    },
    {
        "title": "LPT: When making the bed, sheets and blanket tag side goes face down, bottom right corner.",
        "author": "wesclub7",
        "url": "https://www.reddit.com/r/LifeProTips/comments/11eqjb9/lpt_when_making_the_bed_sheets_and_blanket_tag/",
        "text": "",
        "created_utc": 1677634669,
        "upvote_ratio": 0.7
    },
    {
        "title": "Don't commit check fraud",
        "author": "[deleted]",
        "url": "",
        "text": "[removed]",
        "created_utc": 1677634566,
        "upvote_ratio": 1.0
    },
    {
        "title": "pro tip",
        "author": "Soggy_Preparation472",
        "url": "https://www.reddit.com/r/LifeProTips/comments/11eqdpv/pro_tip/",
        "text": "[removed]",
        "created_utc": 1677634246,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT Request: How to Stop Getting Easily Annoyed by Other People",
        "author": "_outofcomfortzone_",
        "url": "https://www.reddit.com/r/LifeProTips/comments/11epds2/lpt_request_how_to_stop_getting_easily_annoyed_by/",
        "text": "Currently I work from home. I spend most working days by myself, not having face-to-face interaction. I feel so content about this. I can do whatever I want and without any intrusion from other people. On weekend though, I usually go out and hang out with my friends.\n\nI don't know, maybe I spend too much time on my own that when I have social interaction with people and they act slightly different from my liking I will get annoyed. \n\nFor example, when my friends say or post something  dumb, I have the urge the leave/block/mute them.\n\nHow do I stop getting easily annoyed by other people?",
        "created_utc": 1677631617,
        "upvote_ratio": 0.45
    },
    {
        "title": "LPT: you can pop a balloon with a lit cigarette",
        "author": "Sunstudy",
        "url": "https://www.reddit.com/r/LifeProTips/comments/11epc6z/lpt_you_can_pop_a_balloon_with_a_lit_cigarette/",
        "text": "",
        "created_utc": 1677631504,
        "upvote_ratio": 0.27
    },
    {
        "title": "LPT: If blankets and extra layers aren't enough to keep you warm, buy yourself a microwavable heating pad.",
        "author": "handcraftedcandy",
        "url": "https://www.reddit.com/r/LifeProTips/comments/11ep1wb/lpt_if_blankets_and_extra_layers_arent_enough_to/",
        "text": "Years ago I bought myself a microwavable heating pad to ease soreness but after one really cold winter day I got the bright idea to warm it up and just use it as a heat source. It's become my go to way to warm up along with extra layers. If you put the heating pad between your back and your backrest it retains heat for a long time. I never have cold fingers and toes anymore and I don't have to turn my heat up which we all know is super expensive these days.",
        "created_utc": 1677630740,
        "upvote_ratio": 0.76
    },
    {
        "title": "LPT Request: What skill should I learn that will still make money in the next 20 years? (tech industry)",
        "author": "wyntrson",
        "url": "https://www.reddit.com/r/LifeProTips/comments/11eozs4/lpt_request_what_skill_should_i_learn_that_will/",
        "text": "I was going to start writing blogs and stories, but AI now writes better than me and many others.  \nI was going to learn programming, but I'm sure AI will be doing at least 95% better than most programmers.  \n\n\nI was going to learn how to draw and animate, AI is gonna take over and it is on the right way already.  \n\n\n**I can't Think of anything, that if I devote myself to I will be one of the good ones, or at least pursue of becoming really good at it, because the machine will be always better.**  \n**Maybe you know something but I don't know or maybe you have a better perspective.**",
        "created_utc": 1677630593,
        "upvote_ratio": 0.75
    },
    {
        "title": "LPT: Clean your phone, glasses, earbuds etc",
        "author": "Discpriestyes",
        "url": "https://www.reddit.com/r/LifeProTips/comments/11eoo0i/lpt_clean_your_phone_glasses_earbuds_etc/",
        "text": "This sounds like common sense but so, so many people just don't.\n\n&amp;#x200B;\n\nYou handle their phone, it's a greasy mess that has never seen a wet wipe or an alcoholic wipe.\n\n&amp;#x200B;\n\nTheir glasses? How the hell do they see through them with that curtain of oil?\n\n&amp;#x200B;\n\nI know nobody who regularly cleans their stuff.",
        "created_utc": 1677629731,
        "upvote_ratio": 0.77
    },
    {
        "title": "LPT: Need that extra \"push\" while pooping? Just blow your nose!",
        "author": "Itreyo",
        "url": "https://www.reddit.com/r/LifeProTips/comments/11eo3vo/lpt_need_that_extra_push_while_pooping_just_blow/",
        "text": "I found this out on accident several month's ago, in a pretty obvious way, But it really works every time! I asked my wife if she had discovered this method and she had not so I thought might share my revelation with the internet in hopes of helping out my fellow slow poopers out there.",
        "created_utc": 1677628324,
        "upvote_ratio": 0.43
    },
    {
        "title": "LPT: introduce you kids to the ‘one day toys’ concept. If it breaks on the first day too bad and if it lasts longer they are lucky.",
        "author": "[deleted]",
        "url": "",
        "text": "[deleted]",
        "created_utc": 1677627392,
        "upvote_ratio": 0.27
    },
    {
        "title": "LPT: Keep microwave clean and mold free",
        "author": "[deleted]",
        "url": "",
        "text": "[deleted]",
        "created_utc": 1677627383,
        "upvote_ratio": 0.6
    },
    {
        "title": "LPT: How do you get rid of a bruise/black eye fast?",
        "author": "Striking-Artist8347",
        "url": "https://www.reddit.com/r/LifeProTips/comments/11enm9y/lpt_how_do_you_get_rid_of_a_bruiseblack_eye_fast/",
        "text": "(I’m not being abused, just hit myself in the face when I was upset, and my medication makes me bruise easily 😭 and I’m in therapy lol)",
        "created_utc": 1677627100,
        "upvote_ratio": 0.38
    },
    {
        "title": "How to get rid of bruise/black eye fast?",
        "author": "[deleted]",
        "url": "",
        "text": "[removed]",
        "created_utc": 1677626984,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT: if you see a deer crossing the road and you can't safely stop, keep driving!",
        "author": "Sirviantis",
        "url": "https://www.reddit.com/r/LifeProTips/comments/11enc7v/lpt_if_you_see_a_deer_crossing_the_road_and_you/",
        "text": "[removed]",
        "created_utc": 1677626399,
        "upvote_ratio": 0.38
    },
    {
        "title": "can a high school cert get a job at leadway assurance",
        "author": "mikkydoesit",
        "url": "https://www.reddit.com/r/LifeProTips/comments/11emx04/can_a_high_school_cert_get_a_job_at_leadway/",
        "text": "",
        "created_utc": 1677625364,
        "upvote_ratio": 1.0
    },
    {
        "title": "A fact on self-improvement",
        "author": "living-wealthy",
        "url": "https://www.reddit.com/r/LifeProTips/comments/11emv2f/a_fact_on_selfimprovement/",
        "text": "[removed]",
        "created_utc": 1677625246,
        "upvote_ratio": 1.0
    },
    {
        "title": "hi",
        "author": "living-wealthy",
        "url": "https://www.reddit.com/r/LifeProTips/comments/11emrqd/hi/",
        "text": "[removed]",
        "created_utc": 1677625030,
        "upvote_ratio": 1.0
    },
    {
        "title": "A fact on self-improvement",
        "author": "living-wealthy",
        "url": "https://www.reddit.com/r/LifeProTips/comments/11emqzo/a_fact_on_selfimprovement/",
        "text": "[removed]",
        "created_utc": 1677624982,
        "upvote_ratio": 1.0
    },
    {
        "title": "Here's a fun fact",
        "author": "living-wealthy",
        "url": "https://www.reddit.com/r/LifeProTips/comments/11emnw8/heres_a_fun_fact/",
        "text": "[removed]",
        "created_utc": 1677624776,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT: Never answer online security questions with their real answer. Use passphrases or number combinations instead - if someone gets your info from a breach, they won't be able to get into your account.",
        "author": "DweadPiwateWoberts",
        "url": "https://www.reddit.com/r/LifeProTips/comments/11elglm/lpt_never_answer_online_security_questions_with/",
        "text": "",
        "created_utc": 1677621910,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT: Instead of setting up your car or phone GPS home address to your home, set it up to a close location",
        "author": "doterobcn",
        "url": "https://www.reddit.com/r/LifeProTips/comments/11elblq/lpt_instead_of_setting_up_your_car_or_phone_gps/",
        "text": "That way, if somebody steals your car and you happen to have your home keys in it, they won't know where you live.  \nAnd since it's a close location, you would be able to drive easily to your place from there.",
        "created_utc": 1677621612,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT: You can delete a whole word on Windows with ctrl-backspace. Also, use ctrl-enter to move directly to the next line and/or avoid unintentionally submitting something.",
        "author": "jmancoder",
        "url": "https://www.reddit.com/r/LifeProTips/comments/11ekk3x/lpt_you_can_delete_a_whole_word_on_windows_with/",
        "text": "",
        "created_utc": 1677619828,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT: never taking time off, always emphasizing how late you work, sending emails at 2am on a Sunday - none of these indicate to your supervisor that you’re a hard worker. It says you don’t have balance and are insecure.",
        "author": "Level_Artichoke_9843",
        "url": "https://www.reddit.com/r/LifeProTips/comments/11ekc87/lpt_never_taking_time_off_always_emphasizing_how/",
        "text": "",
        "created_utc": 1677619300,
        "upvote_ratio": 1.0
    }
]