[
    {
        "title": "LPT: If you're considering adding a complete nutritional shake to your regular diet, add a teaspoon of high-fiber psyllium husk powder to it",
        "author": "KingCharlesMarlow",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10r1e12/lpt_if_youre_considering_adding_a_complete/",
        "text": "With food prices as high as they are, I've been drinking one nutritional shake a day at lunch and it's been a fantastic way to eat healthy on a budget. That said, drinking a large amount of your daily calories can be hard on your stomach, and I've recently found that a teaspoon of fibre rich powder goes a really long way to help that. To me, it's been a game changer and feels like it completely removes the only real downside.",
        "created_utc": 1675274700,
        "upvote_ratio": 1.0
    },
    {
        "title": "Persistent, worsening digestive issues",
        "author": "Marliemagill",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10r0u1j/persistent_worsening_digestive_issues/",
        "text": "[removed]",
        "created_utc": 1675273413,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT: Being a get away driver for a felony in many states gets you in as much trouble as the actual perpetrator. Don't let anyone talk you into it by claiming it will limit your liability - it wont.",
        "author": "sus-water",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10r0tzd/lpt_being_a_get_away_driver_for_a_felony_in_many/",
        "text": "",
        "created_utc": 1675273408,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT: Instead of adding +companyname to your email address when registering for anything, just get your own domain. Then use company_name@your_domain.com and have all emails to that domain fwd'd to your main account.",
        "author": "nunley",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10r0l5o/lpt_instead_of_adding_companyname_to_your_email/",
        "text": "The commonly suggested method is to add +companyname to your email address when you sign up (for example [me+amazon@gmail.com](mailto:me+amazon@gmail.com)).  This fails to work on a lot of sites.  Using your own domain will work anywhere.  Now, if your email gets sold, you'll know who sold it and you will be able to completely block that email and not miss any other emails.  The other advantage is, if the site gets hacked and spills your email and password, it's totally useless everywhere else.",
        "created_utc": 1675272829,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT: Loan Shark, Hard Money Lender",
        "author": "FunEntrance1413",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10r0ard/lpt_loan_shark_hard_money_lender/",
        "text": "[removed]",
        "created_utc": 1675272133,
        "upvote_ratio": 1.0
    },
    {
        "title": "Click to see horror",
        "author": "shahg213",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10r074x/click_to_see_horror/",
        "text": "[removed]",
        "created_utc": 1675271901,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT REQUEST: how do you get your partner's ring size?",
        "author": "AleksZag",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10r06au/lpt_request_how_do_you_get_your_partners_ring_size/",
        "text": "I have no idea on how to sneakily do that, he won't even take off his only ring to sleep, what do I do? \nThe only thing I know is that my thumb ring is the same size as his pinky, please help.",
        "created_utc": 1675271850,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT: For college students: Really do read the chapter before lecture every time! especially in Science and Math courses",
        "author": "Maybe_Intellect_554",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10qzuvu/lpt_for_college_students_really_do_read_the/",
        "text": "When you come to a lecture without that pre-read knowledge, it can be confusing bc lexture goes sooo fast and it's the first time you're learning about it.\n\nBut if you show up well read before the lecture, it's easier to follow, and you start to figure out why the instructor only goes over the most important and subtle parts of the chapter/topic, even giving hints on what to focus on, study for, so you can do well on the homework and the exams. Lecture is for reinforcing knowledge! \n\nSUPER PRO TIP: The best way to take notes while reading is to re-write (hand written) important statements, theories, equations, and examples in a way that makes sense to you. Copying and pasting or highlighting parts of the books doesn't make it knowledge. Rewrite it in your own voice in your own style of phrasing. This will make the lecture easier to follow as you review your reading notes with lecture notes to see if you got down the same info.\n\n**If you can't seem to focus or be able to make the time for reading, it might be time to delete or mute social media. It's a waste of time while in college and your real friends in college will just text/call/meet up to hang out, not expect you to follow their digital life. ENJOY IRL fun while you're young***\n\nHappy Spring semester and good luck!\n\nTl;dr: Read before lecture. take notes while reading. rewrite info from textbook in your own voice, not copy and paste style. If focusing on reading or making time for reading is hard, eliminate/mute social media to be able to focus and make time for reading.",
        "created_utc": 1675271123,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT: shyness looks like disinterest",
        "author": "MadMaddyEver",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10qz6bn/lpt_shyness_looks_like_disinterest/",
        "text": "Those people you think are being dismissive or snubbing you might just be nervous. If you’re shy, people might think you’re arrogant. Sounds weird but be aware!",
        "created_utc": 1675269508,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT Request: What small curtious change can I make to make everyone else's life a little better?",
        "author": "ExcursionSavvy",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10qz3hp/lpt_request_what_small_curtious_change_can_i_make/",
        "text": "My own tip is: use your blinker &amp; yield the left lane to people if you're not passing.",
        "created_utc": 1675269312,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT request: finding intervals between beats in songs.",
        "author": "emmpmc",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10qytug/lpt_request_finding_intervals_between_beats_in/",
        "text": "Hello! I do marketing for an environmental company and have recently been asked to start making reels for social media. I see all of these tutorials that give you a beat, and then tell you exactly how many seconds or milliseconds to make each clip, so that the videos or photos change at each beat interval. I would like to start creating these, but with popular online songs. Is there a website where I can enter a URL for a song, and then have it tell me the exact intervals between the beat? Any other advice to make this easier for myself is appreciated, but I think I would do fine if I could just figure out the length of each clip.",
        "created_utc": 1675268645,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT Request: how to make reels easier",
        "author": "PLAEXBuildingSystems",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10qyrjq/lpt_request_how_to_make_reels_easier/",
        "text": "[removed]",
        "created_utc": 1675268496,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT: Letting your motivation be decided internally rather than externally is the most important key to success.",
        "author": "Lesmayhem",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10qymii/lpt_letting_your_motivation_be_decided_internally/",
        "text": "I'm someone who has always loved to read self help books, and allthough there is some great information out there, the one thing that really made the world's difference for me was being able to find my motivation from within myself rather than from external sources.  \nWe all have some form of anxiety and you know what? It's understandable because the world we live in, we've all learnt that failing is a big no no.  \n\n\nBut ask yourself, what is failure?  \n\n\nA beautifully written quote that stuck with me was that people who fail are not the failures, it's those that refuse to fail that are. As cliche as it sounds, it holds a lot of truth.\n\nAs my wife who adores travelling once said, it's not just the trip that excites her, it's the whole process leading up to that moment. The research, discovering the beautiful parts of a country and so on..  \nLearn to become more comfortable making mistakes, and putting your focus on the process rather than the result, and the world around you will change completely.",
        "created_utc": 1675268165,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT - replace the license plate frame that came with your car",
        "author": "king10208",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10qydbl/lpt_replace_the_license_plate_frame_that_came/",
        "text": "There's no need to provide free advertising for the dealer that sold you the car. Replacing the frame(s) is a simple 1-tool job and you can then fly the colors of your favorite sports team, college, hobby, saying, whatever.",
        "created_utc": 1675267551,
        "upvote_ratio": 1.0
    },
    {
        "title": "I am here to help the youth and everyone else who sees this.",
        "author": "Hippo_888",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10qxuw3/i_am_here_to_help_the_youth_and_everyone_else_who/",
        "text": "[removed]",
        "created_utc": 1675266307,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT: Dark mode exists on Wikipedia’s desktop site if you’re logged in and enable it it in Gadgets section of Preferences",
        "author": "faiface",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10qxpis/lpt_dark_mode_exists_on_wikipedias_desktop_site/",
        "text": "",
        "created_utc": 1675265925,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT Request: Job searching/working tips for college students?",
        "author": "Lord_Lazignac",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10qxojo/lpt_request_job_searchingworking_tips_for_college/",
        "text": "Currently doing community college while also looking for a part time job, it's a bit difficult since I don't have much work experience and the experience/certifications I do have are in the same field I'm taking classes for (HVAC/R), any Pro Tips to be shared?",
        "created_utc": 1675265856,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPTR: Neighbor’s child cry moans incredibly loud while I am on webex meetings for work, thoughts on ways to make it less odd…",
        "author": "Boredummmage",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10qxcj3/lptr_neighbors_child_cry_moans_incredibly_loud/",
        "text": "[removed]",
        "created_utc": 1675265020,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT: Start saying/writing “For sure!” instead of “yeah sure”",
        "author": "benPaludan",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10qx4ez/lpt_start_sayingwriting_for_sure_instead_of_yeah/",
        "text": "1) This will make you seem more enthusiastic about plans/plan making.\n\n2) When compromising, you will portray yourself as open minded and positive instead of a sour nut with an attitude.",
        "created_utc": 1675264467,
        "upvote_ratio": 1.0
    },
    {
        "title": "LTP: Start saying “For sure!” instead of “yeah sure”",
        "author": "benPaludan",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10qx256/ltp_start_saying_for_sure_instead_of_yeah_sure/",
        "text": "[removed]",
        "created_utc": 1675264311,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT: Read the comments for the tip",
        "author": "inntee",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10qx1dz/lpt_read_the_comments_for_the_tip/",
        "text": "It’s not here.",
        "created_utc": 1675264260,
        "upvote_ratio": 1.0
    },
    {
        "title": "flipkart big billion days sale 2022 price reveal iphone 13 to sell at under rs 50000 iPhone 11 below rs 30000 other top deals/202/",
        "author": "youssefonline",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10qwvm6/flipkart_big_billion_days_sale_2022_price_reveal/",
        "text": "[removed]",
        "created_utc": 1675263865,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT: When you change the battery on your smoke detector, air-blast or vacuum it as well.",
        "author": "dickcheney600",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10qwu5q/lpt_when_you_change_the_battery_on_your_smoke/",
        "text": "Dust that gets inside can cause false alarms, but cleaning it when the battery is replaced should prevent this. Also do this after doing anything that creates or kicks up a lot of dust or particles in the room.",
        "created_utc": 1675263760,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT: If you feel the need to cough and would rather not, take a few deep breaths and this will eliminate the feeling of needing to cough.",
        "author": "Bystronicman08",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10qwia9/lpt_if_you_feel_the_need_to_cough_and_would/",
        "text": "I have been sick with a cold for a few days now and my ribs and chest are incredibly sore from coughing so much. My mom suggested I do this and it worked surprisingly well",
        "created_utc": 1675262941,
        "upvote_ratio": 1.0
    },
    {
        "title": "Click to see horror",
        "author": "shahg213",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10qwgfh/click_to_see_horror/",
        "text": "[removed]",
        "created_utc": 1675262806,
        "upvote_ratio": 1.0
    },
    {
        "title": "If you feel the need to cough and would rather not, take a few deep breaths and this will eliminate the feeling of needing to cough.",
        "author": "Bystronicman08",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10qwfw1/if_you_feel_the_need_to_cough_and_would_rather/",
        "text": "[removed]",
        "created_utc": 1675262767,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT: Keep your bathroom sink, vanity, mirror cleaner by using your toilet instead for your toothbrushing, mouthwash, and rinse",
        "author": "stubbynutz",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10qwecx/lpt_keep_your_bathroom_sink_vanity_mirror_cleaner/",
        "text": "[removed]",
        "created_utc": 1675262655,
        "upvote_ratio": 1.0
    },
    {
        "title": "Keep your bathroom sink, vanity, mirror cleaner by using your toilet for your toothbrushing, mouthwash, and rinse spittle",
        "author": "stubbynutz",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10qwbzq/keep_your_bathroom_sink_vanity_mirror_cleaner_by/",
        "text": "[removed]",
        "created_utc": 1675262480,
        "upvote_ratio": 1.0
    },
    {
        "title": "If you could give 1 tip to a person in the world… what would it be.",
        "author": "TheMahbFather",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10qw7vq/if_you_could_give_1_tip_to_a_person_in_the_world/",
        "text": "[removed]",
        "created_utc": 1675262179,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT: Why is it important to reflect on how you spend every day?",
        "author": "thoughtsaver",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10qw0gd/lpt_why_is_it_important_to_reflect_on_how_you/",
        "text": "How we spend our days is, of course how we spend our lives. What we do with this hour and that one is what we are doing.",
        "created_utc": 1675261641,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why is it important to reflect on how you spend every day?",
        "author": "thoughtsaver",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10qvzz2/why_is_it_important_to_reflect_on_how_you_spend/",
        "text": "[removed]",
        "created_utc": 1675261606,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT: Chipotle Hack",
        "author": "aphex____",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10qvtw7/lpt_chipotle_hack/",
        "text": "1.\t⁠Buy Chipotle burrito bowl, get extra beans and anything else that doesn’t cost extra\n\n2.\t⁠Buy two tortillas on the side ($0.50)\n\n3.\t⁠Roll two normal-sized burritos\n\n4.\t⁠Profit",
        "created_utc": 1675261161,
        "upvote_ratio": 1.0
    },
    {
        "title": "To maintain layout, structure, and typography, save your resume as a PDF before sending it out.",
        "author": "DaliaVA",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10qvgnb/to_maintain_layout_structure_and_typography_save/",
        "text": "",
        "created_utc": 1675260181,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT Request: How to feel everyday again?",
        "author": "bootycherios",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10quskq/lpt_request_how_to_feel_everyday_again/",
        "text": "Kind of a weird question, but me and my SO have talked about it and we've felt the everyday just kind of repeats and we don't get to enjoy it how we used to. We both graduated in December, and now work full time jobs, outside of that we have no obligations.\n\nI will admit I think part of that is that we are both in our phones much more than before and we are actively working towards restricting phone/tech usage. Some other things we are trying to do is get more sleep and go on more walks. \n\nThis isn't much a relationship issue as it is a life experience issue, we are in a stable committed relationship. I would love for some more ideas and advice on how we can kind of go back to enjoying our days and making everyday an experience rather than have it blended together.",
        "created_utc": 1675258298,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT: if your car has a backup cam, take a couple seconds to wipe off the lens.",
        "author": "imakenosensetopeople",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10qumd1/lpt_if_your_car_has_a_backup_cam_take_a_couple/",
        "text": "",
        "created_utc": 1675257815,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT: Many are familiar with how looking into a light can help you sneeze when you feel one coming on.",
        "author": "catinore",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10qulkr/lpt_many_are_familiar_with_how_looking_into_a/",
        "text": "But this effect can also work when you’re in the dark and simply imagine you’re looking into a light.",
        "created_utc": 1675257748,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT: Add a window punch and a seat belt cutter to your car's Keychain. Just might save yours or someone else's life in the aftermath of an accident.",
        "author": "TakeTT2",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10qttgm/lpt_add_a_window_punch_and_a_seat_belt_cutter_to/",
        "text": "Depending on the severity of the accident,  the door may be jammed shut and the car's electrical system could potentially fail, leaving the driver unable to roll down the windows.\n\n Nice to have the peace of mind knowing you'll be able to quickly break the side tempered glass if you found yourself or someone else trapped in a burning car.",
        "created_utc": 1675255439,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT: the singular most important key to success, happiness and fulfilment, is to spend more time in your life creating things rather than consuming things.",
        "author": "TheFalseProfessional",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10qtpac/lpt_the_singular_most_important_key_to_success/",
        "text": "",
        "created_utc": 1675255148,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT Request: How can I stop Google from collecting information about me via my phone?",
        "author": "Antidote_to_Chaos",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10qs1ge/lpt_request_how_can_i_stop_google_from_collecting/",
        "text": "I've already changed all my privacy settings. I don't use voice recognition software. Yet somehow random conversations that happen near me will result in topic specific ads.  I just want the Google stalking to stop!",
        "created_utc": 1675251925,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT On undervalued generic advice for your mind - why you should do your own research and explore what is possible, and what your mind is capable of",
        "author": "FenderHT",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10qrpfq/lpt_on_undervalued_generic_advice_for_your_mind/",
        "text": "If someone were to advise “do your own research”, or “have a better understanding of the way things work”, that is sort of analogous to “work out”, or “be successful” in its indispensable nature. It’s generic advice that is not tailored to any one person. However, these ventures relating to these first examples are less common, especially for people whose careers do not depend upon academic performance.  \nThe truth is, seeking a higher perceptive intelligence is time-consuming, brain intensive, overall uncomfortable, and offers few tangible rewards in exchange. Though I see no reason for people to not want to do this - discover, for themselves, the limits of what is possible in our universe. Delving into these mysteries is essential to the well-being and time span of a global civilization, yet most people rely on the work of others. An assumption that professionals in that field will have everything under control and make good progress - is wrong. In fact, there are many socio-economic and political problems with the academic industry. The illusion of progress through hyper-technical and sustainability-centered work draws attention away from what is really the most crucial for our development. There is not enough work and money being put toward certain sciences. At the end of the day, trying to become smarter is good for your brain, building healthy relationships, as well as contributing your efforts to our collective benefit. Research, reading books, but most of all, sharing what you learned and your personal experiences.",
        "created_utc": 1675251319,
        "upvote_ratio": 1.0
    },
    {
        "title": "On undervalued generic advice for your mind",
        "author": "FenderHT",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10qrhq9/on_undervalued_generic_advice_for_your_mind/",
        "text": "[removed]",
        "created_utc": 1675250948,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT: Microwave food instructions include a wattage that you have to convert for your own microwave. If the package says 5 and a half minutes at 1200 watts on high and your oven is 700 watts, you need to cook it for 9 minutes.",
        "author": "breaktime1",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10qq2jp/lpt_microwave_food_instructions_include_a_wattage/",
        "text": "",
        "created_utc": 1675247154,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT: Add +companyname to your email address when registering for anything e.g. first.last+companyname@domain.com. Your email address will work as normal but you will know who leaked your data when you receive scams / spam. You're welcome!",
        "author": "CurryMonsterr",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10qp95j/lpt_add_companyname_to_your_email_address_when/",
        "text": "",
        "created_utc": 1675243718,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT request - how can I solve this dilemma?",
        "author": "oneway_tickets_only",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10qo1kt/lpt_request_how_can_i_solve_this_dilemma/",
        "text": "So, I’m a freelance French translator, and recently started offering a new service.\n\nI’m working for 2 companies who are competitors, which doesn’t really matter as a translator. However, for this new service I am offering, I can’t really work for 2 companies who are competitors at the same time…\n\nNow, I didn’t really realise that until after I sent them both an offer for my new service, and they both said they are interested! \n\nOne company pays me more and I wish I only offered it to them unless they didn’t accept my offer. But I stupidly sent them both an offer at the same time!\n\nI kinda wanna retract my offer from the second company who pays me less, but I am still working with them for translation and I also like them so don’t want to cause any problems…\n\nHow can I retract the offer without telling them the reason is that I want to offer this service to their competitor instead of them?😭😭 \n\nThanks all for your help!",
        "created_utc": 1675238589,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT: Someone stealing food at work?",
        "author": "edensgreen",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10qnz7h/lpt_someone_stealing_food_at_work/",
        "text": "Feelings petty or pissed? Chop up or blend the seeds of one carolina reaper or some extra extra spicy (safe but painful) pepper you can get your hands on. Bake/Put into your food, with your name labeled on it. Keep your real lunch in your car with an ice pack/hidden elsewhere. Keep the spicy food in the break room, wait for the culprit to come out with a flaming mouth. Have fun!",
        "created_utc": 1675238358,
        "upvote_ratio": 1.0
    },
    {
        "title": "Someone stealing your food?",
        "author": "edensgreen",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10qnx0s/someone_stealing_your_food/",
        "text": "[removed]",
        "created_utc": 1675238114,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT: When you are talking to a non native English speaker, spell the names you mention in the conversation.",
        "author": "Lunatic_Dpali",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10qnwmn/lpt_when_you_are_talking_to_a_non_native_english/",
        "text": "Believe it or not, most of them won’t get you, because of the fact that those names are unfamiliar to them. They grew up in a different culture, and have got no idea about the names. \n\nNote: I, myself, am a non native speaker, and whenever I talk with my native mates, I ask them to spell the names they use whilst we are communicating. It helps me a lot.",
        "created_utc": 1675238073,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do I overcome social anxiety?",
        "author": "LoadAshamed2704",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10qnjpb/how_do_i_overcome_social_anxiety/",
        "text": "",
        "created_utc": 1675236608,
        "upvote_ratio": 1.0
    },
    {
        "title": "To find authentic tutorials/recipe of foreign dishes, Youtube the tutorial in the dish's native language",
        "author": "gavanization",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10qmds5/to_find_authentic_tutorialsrecipe_of_foreign/",
        "text": "[removed]",
        "created_utc": 1675232152,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT Request: How to counter \"Who asked?\", the ultimate tool to shut up an argument?",
        "author": "Tipic_a",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10qmbiw/lpt_request_how_to_counter_who_asked_the_ultimate/",
        "text": "[removed]",
        "created_utc": 1675231921,
        "upvote_ratio": 1.0
    },
    {
        "title": "If you have a job as teacher, always make sure your handwriting is legible",
        "author": "Atorpidguy",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10qlof6/if_you_have_a_job_as_teacher_always_make_sure/",
        "text": "[removed]",
        "created_utc": 1675229658,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT/Getting too lazy and lose interest in life",
        "author": "yamomsaidhello",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10qlnps/lptgetting_too_lazy_and_lose_interest_in_life/",
        "text": "[removed]",
        "created_utc": 1675229588,
        "upvote_ratio": 1.0
    },
    {
        "title": "Drink mint tea after dinner",
        "author": "krusha72",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10qkh44/drink_mint_tea_after_dinner/",
        "text": "[removed]",
        "created_utc": 1675225636,
        "upvote_ratio": 1.0
    },
    {
        "title": "If your arm is in a cast, try this.",
        "author": "OppositeOfKaren",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10qkebh/if_your_arm_is_in_a_cast_try_this/",
        "text": "[removed]",
        "created_utc": 1675225397,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT: Do Not Assume and Comfort People the Way You Want to be Treated. Ask How They Want to be Comforted and Supported",
        "author": "judyudy",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10qjv8q/lpt_do_not_assume_and_comfort_people_the_way_you/",
        "text": "\"Treat others how you want to be treated\" is a well-known phrase we often teach children as they learn more about the world around them during their egocentric developmental stage. However, as adults we must not continue to limit ourselves to an egocentric mindset. We must acknowledge that not everyone wants to be treated the same way we do, especially when it comes to needing comfort and support.\n\nMany (including myself) are often unsure about how to properly respond when someone shares bad news with us, like a job loss, cancer diagnosis, death, etc. We have a tendency to respond based on how we would like to be comforted because we assume that is the most appropriate. But that isn't always the case.\n\nFor example, I got diagnosed with cancer at 29. I am someone who does not find comfort in being overly positive and told that \"It's going to be okay.\" It makes me feel like my fears and concerns are minimized and not acknowledged. Instead, I want to be told that \"It's shitty and fucking sucks\" because that's how I feel, and my feelings get validated when others agree. But for some people, they want to be assured that things are going to be okay, and that's what comforts them.\n\nTLDR: If you truly want to know how to support someone and aren't sure, just ask them directly. You are making it about yourself when you assume they want to treated and comforted the same way you do because that is an egocentric way of thinking. You risk making them feel worse.",
        "created_utc": 1675223796,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT: Car Rentals",
        "author": "tykneedanser",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10qjl75/lpt_car_rentals/",
        "text": "When renting a car, break out your phone and take a video of the vehicle during your walk around (interior, too) with the rental person. Sometimes it’s easy to miss scratches and dings when the lighting isn’t great. Eliminates arguments upon return. I notice the rental folks tend to take their walk around notes a little more seriously when the video starts rolling.",
        "created_utc": 1675222934,
        "upvote_ratio": 1.0
    },
    {
        "title": "🙏Help Us to Save Someones Life🙏",
        "author": "shahg213",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10qjh4s/help_us_to_save_someones_life/",
        "text": "[removed]",
        "created_utc": 1675222595,
        "upvote_ratio": 1.0
    },
    {
        "title": "Car rentals",
        "author": "tykneedanser",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10qjf4r/car_rentals/",
        "text": "[removed]",
        "created_utc": 1675222433,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT request: How do I keep my noise down?",
        "author": "ThatGuyisonmyPC",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10qjbi1/lpt_request_how_do_i_keep_my_noise_down/",
        "text": "I stay up late from time to time, and I'd like to know how to avoid waking people up",
        "created_utc": 1675222143,
        "upvote_ratio": 1.0
    },
    {
        "title": "Life",
        "author": "snbrzostek",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10qiyyv/life/",
        "text": "What’s your biggest regret in life?",
        "created_utc": 1675221146,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT: If you want to get out of a situation, especially ones where you may be being pressured by opposing sides, I have found it useful to rapidly change your views and/or make no sense at all until the other person gets confused or frustrated. Also you have to have to be completely serious during.",
        "author": "DefaultyDaniel",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10qivu6/lpt_if_you_want_to_get_out_of_a_situation/",
        "text": "",
        "created_utc": 1675220892,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT Request: How to negotiate salary after job offer?",
        "author": "Wackypaki94",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10qiny8/lpt_request_how_to_negotiate_salary_after_job/",
        "text": "I received a job offer today for a CDMO based in Irvine, California. To give you some context, I am three years out of school and make $75,000 at my current role. The company offered me $85,000 and all advice I can find online suggests that I should negotiate. \n\nHow should I go about negotiating for the salary? I have the following email typed up.\n\n“I am really excited at the opportunity to work for abc and want to express my gratitude to you and the team for this offer.\n\nI believe my technical educational background, coupled with my experience working as a xyz in the CDMO space make me a great fit for the role.  \n\nIn regards to salary, I am looking for something around $94,000 for my next role. I hope you can bridge that gap.\n\nThank you once again for the offer and I hope to hear back from you soon.”\n\nPlease advise and critique.",
        "created_utc": 1675220269,
        "upvote_ratio": 1.0
    },
    {
        "title": "Living out of your home country with 0 dollars and no place to stay . What would you do if you had no choice but to stay there ?",
        "author": "nozer00",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10qhz33/living_out_of_your_home_country_with_0_dollars/",
        "text": "",
        "created_utc": 1675218296,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT Take clothes you buy off the rack to a tailor.",
        "author": "iknowimlame",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10qhek9/lpt_take_clothes_you_buy_off_the_rack_to_a_tailor/",
        "text": "",
        "created_utc": 1675216753,
        "upvote_ratio": 1.0
    },
    {
        "title": "LifeProTip: Take suits you buy off the rack to a tailor.",
        "author": "iknowimlame",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10qhdp8/lifeprotip_take_suits_you_buy_off_the_rack_to_a/",
        "text": "",
        "created_utc": 1675216685,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT Request:What should I start doing in order to stay young &amp; productive?",
        "author": "Nikki_iva",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10qfnb5/lpt_requestwhat_should_i_start_doing_in_order_to/",
        "text": "Hello beautiful people. I’m almost 24 and I’m starting to see the effects of aging. My hairline is receding and I’m starting to get wrinkles. \n\nI would like to know what I should start doing in order to keep my body in top shape (both physically and mentally)\n\nWhat stuff should I consume/do?\n\nI already work out 6 times a week and eat a fairly balanced diet, I also consume a stack of vitamins and take care of my teeth by flossing every day. Is there anything else I can do?\n\nThank you!",
        "created_utc": 1675211978,
        "upvote_ratio": 1.0
    },
    {
        "title": "Moving and Chasing Dreams",
        "author": "Excellent-Shape-2694",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10qesxe/moving_and_chasing_dreams/",
        "text": "[removed]",
        "created_utc": 1675209782,
        "upvote_ratio": 1.0
    },
    {
        "title": "Pls look this",
        "author": "danezi",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10qe42z/pls_look_this/",
        "text": "[removed]",
        "created_utc": 1675207987,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT — Your 3G phones, in the US, no longer work for calling 911.",
        "author": "751assets",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10qdvne/lpt_your_3g_phones_in_the_us_no_longer_work_for/",
        "text": "[removed]",
        "created_utc": 1675207401,
        "upvote_ratio": 1.0
    },
    {
        "title": "TimeSocial vous permet de gagner 500 $ par jour. Transformez votre temps en argent.",
        "author": "ConceptNo7325",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10qc672/timesocial_vous_permet_de_gagner_500_par_jour/",
        "text": "[removed]",
        "created_utc": 1675203193,
        "upvote_ratio": 1.0
    },
    {
        "title": "Candle",
        "author": "C2FUX1987",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10qc60a/candle/",
        "text": "[removed]",
        "created_utc": 1675203180,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do I ever be normal again?",
        "author": "Friendly_Purchase_82",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10qc2rz/how_do_i_ever_be_normal_again/",
        "text": "[removed]",
        "created_utc": 1675202961,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT: Want a really cool mailing address? Go ask your local post office what the lowest PO box they have available is. I now have PO Box 1 in my city.",
        "author": "HinsdaleCounty",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10qc0hy/lpt_want_a_really_cool_mailing_address_go_ask/",
        "text": "Someone I know has had his mailing address as PO Box 1 in a major city (100,000-ish people) for a long time. I recently asked him how he got it and he told me that he literally just went in and asked what the lowest available was. They initially told him 3, but then realized they actually had #1 free.\n\nI decided to try this and went to my own post office to inquire. They told me both #1 and #2 were available. Now, if you send me mail, it goes to PO Box 1.\n\nThere are multiple PO Box 1s in any given city — my understanding is one per zip code (someone please correct me if I’m wrong about that), but that means there are still only a few thousand in the country (which has millions of PO box numbers), and having one is certainly a status symbol.\n\nSo go check with your PO. You might surprise yourself!",
        "created_utc": 1675202804,
        "upvote_ratio": 1.0
    },
    {
        "title": "Only medical professionals can violate your HIPAA rights.",
        "author": "TradeMark310",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10qbxdw/only_medical_professionals_can_violate_your_hipaa/",
        "text": "[removed]",
        "created_utc": 1675202588,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT: Encourage good behavior easily by saying “You’re the kind of person whose performance improves under pressure”",
        "author": "__init__2nd_user",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10qbtle/lpt_encourage_good_behavior_easily_by_saying/",
        "text": "Studies show it can improve performance by 33 percent. It doesn’t matter whether the feedback is completely random. \n\nSource: https://files.eric.ed.gov/fulltext/ED566260.pdf",
        "created_utc": 1675202358,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT: Don’t ask someone that you aren’t very close to how they lost all that weight.",
        "author": "leolacakes",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10qbmi4/lpt_dont_ask_someone_that_you_arent_very_close_to/",
        "text": "Chances are it will put them in an uncomfortable situation. \nEither the answer is diet &amp; exercise, surgery, or something unhealthy. \n\nIt isn’t their job to build you a whole diet &amp; exercise regimen. There’s no “secret” to weight loss that your acquaintance suddenly found that they’re keeping from you. \n\nIf you notice that someone has lost a lot of weight, don’t treat them any differently. They’re the same human. Mind your own business and move on with your day.",
        "created_utc": 1675201871,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT: If you walk, day to day, if you balk, at the pay.",
        "author": "LohseBardBot",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10qbhj1/lpt_if_you_walk_day_to_day_if_you_balk_at_the_pay/",
        "text": "[removed]",
        "created_utc": 1675201521,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT: Just Because the Light is Green, Doens't Mean You Can Drive Through",
        "author": "Xiij",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10qbgde/lpt_just_because_the_light_is_green_doenst_mean/",
        "text": "The amound of times I've been in traffic, my light turn green and I can't drive because cars are stopped in the middle of the intersection because they started driving at a green light even though there was no room for them to fully cross the intersection,",
        "created_utc": 1675201442,
        "upvote_ratio": 1.0
    },
    {
        "title": "Rich dad Poor dad by Robert Kiyosaki II Money Mindset. #shorts #motivationmeditationmindset",
        "author": "uniquemotivation999",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10qbbj4/rich_dad_poor_dad_by_robert_kiyosaki_ii_money/",
        "text": "[removed]",
        "created_utc": 1675201128,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT request : How do I politely tell my neighbors that their dog's barking is annoying?",
        "author": "Hylianlegendz",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10qb57h/lpt_request_how_do_i_politely_tell_my_neighbors/",
        "text": "My neighbor's brought a dog about 2 months ago. It's never on a leash, they do not have a fence (maybe an invisible fence?). Although it never actually leaves their property, it always howls and barks, and it's especially annoying when it wakes me up at 6:00am. I have lots of neighbors with dogs and none of their dogs do this, if their dogs bark they bring them in the house. But these people just let the dog bark away whether it's 6am or 10pm (yes, at night too). \n\nI'd like to maintain a diplomatic relationship with them. We're not particularly close, but they've never been a problem til now. Any advice on how to tell them to please bring their dog in when it's barking like that.",
        "created_utc": 1675200717,
        "upvote_ratio": 1.0
    },
    {
        "title": "Look this pls",
        "author": "danezi",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10qb35c/look_this_pls/",
        "text": "[removed]",
        "created_utc": 1675200591,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do I politely tell my neighbors that their dog is annoying",
        "author": "Hylianlegendz",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10qb2k5/how_do_i_politely_tell_my_neighbors_that_their/",
        "text": "[removed]",
        "created_utc": 1675200552,
        "upvote_ratio": 1.0
    },
    {
        "title": "Best Life Advice",
        "author": "ELDIK123",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10qacew/best_life_advice/",
        "text": "[removed]",
        "created_utc": 1675198848,
        "upvote_ratio": 1.0
    },
    {
        "title": "Andrew Tate's Life Advice",
        "author": "ELDIK123",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10qabjh/andrew_tates_life_advice/",
        "text": "[removed]",
        "created_utc": 1675198808,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT : Take care of your final prearrangements NOW. If you are being cremated or buried or entombed in a Mausoleum… whatever. please , Get it out of the way.",
        "author": "Faze-3",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10q9ov3/lpt_take_care_of_your_final_prearrangements_now/",
        "text": "I highly recommend NOT burdening your family with those details or the expense.  Even if you try to rationalize : “ oh I have a life insurance policy”.     \nYou are still burdening them with the responsibility of the logistics and having to make financial decisions under emotional duress.   \n\nPreplan …., get a discount for preplanning , and that way you are leaving the most money to your loved ones instead of sticking them with a huge bill on the worst day of their life. \n It’s truly your final gift to them.",
        "created_utc": 1675197337,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT: First Job decisions",
        "author": "MaterialMediocre1287",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10q9n5y/lpt_first_job_decisions/",
        "text": "It has been my first week at an Orielly store. Getting payed $12.50 plus possible commissions. I genuinely like the atmosphere and employees I work with. Clocked 44.27 hours this first week as I don’t have to use lunch break with the long downtime we have. I got a call from Walmart yesterday though offering $14 as a mid shift stocker. It’s about 8 minutes further than my 10 minute drive to orielly. I genuinely don’t know what to do. I believe Walmart has more benefits but who knows how the atmosphere will be. Im currently going to RCC(18yearsold) with no over the counter experience to back me up. Have always worked for cash.",
        "created_utc": 1675197225,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT: Never underestimate the importance of a good pillow.",
        "author": "incredibleinkpen",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10q9j5l/lpt_never_underestimate_the_importance_of_a_good/",
        "text": "Recently figured I'd spend a bit to get a new one, and the difference is massive.\n\nWe all know how significant the mattress is, and it sure is crucial for good rest, but it's easy to forget how much a pillow can help too.\n\nProtect the head!",
        "created_utc": 1675196964,
        "upvote_ratio": 1.0
    },
    {
        "title": "Take care of all your final prearrangements! Whether you are going to be cremated or buried or entombed in a Mausoleum…",
        "author": "Faze-3",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10q9g8n/take_care_of_all_your_final_prearrangements/",
        "text": "[removed]",
        "created_utc": 1675196767,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT Request: From where can I learn more about Backend Applications Performance Optimization tools and how to use them.",
        "author": "Fabulous-Ant123",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10q8tro/lpt_request_from_where_can_i_learn_more_about/",
        "text": "So, Recently I have been learning Java Backend Development using Spring Boot, \nI wanted to learn more about Performance tuning like improve response time of APIs, How to detect memory leakage, How to detect Code errors and time it consumes, How to debug microservice based applications. \nHow to know when to add more servers to increase compute power.\n\nCan anyone help me with any place from where I can lern these things?",
        "created_utc": 1675195243,
        "upvote_ratio": 1.0
    },
    {
        "title": "Choosing to Live According to Your Values",
        "author": "trumpfamily2020",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10q8izg/choosing_to_live_according_to_your_values/",
        "text": "",
        "created_utc": 1675194502,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT request : How to get off the phone (games/social media/educational videos but not in context of what really matters) and do what matters most even if it's boring?",
        "author": "Redskull9099",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10q8ip8/lpt_request_how_to_get_off_the_phone_gamessocial/",
        "text": "",
        "created_utc": 1675194483,
        "upvote_ratio": 1.0
    },
    {
        "title": "It is better to remain silent, and have people think you are dumb, than to open your mouth and prove them right.",
        "author": "ebola_borialis",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10q876x/it_is_better_to_remain_silent_and_have_people/",
        "text": "[removed]",
        "created_utc": 1675193713,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT Drive your own vehicle to social gatherings so you can leave when you want to.",
        "author": "akumamatata8080",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10q82xb/lpt_drive_your_own_vehicle_to_social_gatherings/",
        "text": "",
        "created_utc": 1675193424,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT: HR is not on your side",
        "author": "BladeDOP",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10q7g0w/lpt_hr_is_not_on_your_side/",
        "text": "This is a reminder to everyone. Human Resources are not on your side. They are there to protect the business and the business only. Also, be careful for those anonymous surveys. They can narrow down who said what and take action if needed. \n\nI was in management for many years and the very best employee can be dismissed as a “non fit” or even an “organization restructuring”. \n\nI’ve known numerous HR reps/managers and a lot of them are great people - but the directive is the same. \n\nTake care of yourself. \n\nDon’t forget this, please.",
        "created_utc": 1675191894,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT: Don't install a \"mr cool\" or other diy mini-split because no one will service it and you won't be able to find replacement parts",
        "author": "Such-Track5369",
        "url": "https://www.reddit.com/r/LifeProTips/comments/10q7c9j/lpt_dont_install_a_mr_cool_or_other_diy_minisplit/",
        "text": "No HVAC technician worth their salt is going to touch your DIY abomination. I've seen so many people install these thinking they will save a few bucks, install it wrong, and then burn out the compressor.",
        "created_utc": 1675191635,
        "upvote_ratio": 1.0
    }
]