[
    {
        "title": "Do narcs have a problem with non stop talking?",
        "author": "Kielera71421",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/69bhgy/do_narcs_have_a_problem_with_non_stop_talking/",
        "text": "Next week I come back home from college and I dread my narc mother.SHe never gets the cue when a conversation is ended and complains endlessly about everything and tells every personal thought and detail about her life,her coworkers,her job ect. Eventually I enter a semi slumber in my bed to just to see if she shuts up but she doesn't!.She follows me too my room and keeps talking.And anything I care to add to the convo makes her irritated and she goes on talking.",
        "created_utc": 1493944251,
        "upvote_ratio": ""
    },
    {
        "title": "Ever heard of a narcissist wanting to be a clinical psychologist?",
        "author": "Kielera71421",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/699hxz/ever_heard_of_a_narcissist_wanting_to_be_a/",
        "text": "One of my main tormentors in highschool who is narcissist(ego off the charts and got off on stepping on other people in addition to ranting online about no one understanding how special she is 24/7) claims to want to be a clinical psychologist.",
        "created_utc": 1493923921,
        "upvote_ratio": ""
    },
    {
        "title": "first job- please help.",
        "author": "stressaccount",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/697k98/first_job_please_help/",
        "text": "i don't know if i can, or want to write my story.\n\ni'm a 20 yo DoNF. Mum's passed. (PS i'm not based in US).\n\n\nso in short the period between 2011-14 were some of the worst years of my life so far, mom had passed and i was living with my dad alone. lotta shit went down but at the end of it i got myself to another city, got into a college, and became an alcoholic and a stoner.\ni barely scraped through in my last semester, things got a little rough on the mental health side. (bpd, anxiety, c-ptsd)\n\ni am an introvert and (over)thinking is something i do pretty much 365 days.\n\nnow the situation is i got the joining date to my first proper job today. it's at a renowned consulting co. ive asked them about background checks or any kind of testing - waiting for the reply. \n\nas somebody without a social/support network and guidance, i'm asking you how would you prepare yourself a month in advance for thee biggest gig of your life so far when you're used to being (and still are) a screw-up? there's a good chance i'll crash out by the first month - i've done small gigs before where i never lasted beyond a month.\n\ni'm especially worried about how to prep myself for the first day. how do i continue working with the nagging feeling at th back of my mind that i'll be fired from here pretty soon?\n\n[ i've posted this to the allied subs as well- r/internetparents etc]",
        "created_utc": 1493905363,
        "upvote_ratio": ""
    },
    {
        "title": "Is going NC with my NMom and EDad really necessary for healing?",
        "author": "jyzhin",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/696svn/is_going_nc_with_my_nmom_and_edad_really/",
        "text": "Hello. I am 19, turning 20 next month. For years, my mom and I didn't have a healthy relationship. \n\nA little over two months ago, she and I had an argument over a very little thing, which was not very surprising because that was pretty much what we used to do every now and then. She got so mad that she asked me to leave home. It wasn't the first time. But it was the first time she told my younger sister (9 y/o) that she was very serious about kicking me out. So I left. Checked into a hotel and moved to my own apartment a day later.\n\nMy dad found out about it the same night I left. For almost three days, he kept asking me to come back home, telling me that there wasn't much I could do. He said that life with my mother may be very hard but life in the streets would be worse. I think he forgot the fact that I had been paying for my family's food, utilities, etc. since I was 16. I never really shoved to their faces that their kid was playing a huge role in keeping all family members alive.\n\nBut anyways, that had always been his line. He always asked me to just toughen up whenever my mom would hurt me physically, mentally, and emotionally. He asked me to understand that she had quite a bad childhood. Is that enough reason for her to neglect her own child's emotional needs though?\n\nMy dad and I didn't really talk a lot since he stopped begging me to come home because I pretty much avoided him when he tried to play with my guilt. He kept telling me that he was going to drink his life away if I don't go home. He said that if he stops working, my sister and my mom will not have any future ahead of them and it would be because of me. \n\nAs for me and my mom, we didn't talk every single day but we talk here and there. I feel like a part of me dies every single time I communicate with her but since my sister lives with her, I feel like it's just the right thing to keep being in touch. I don't want her to feel hurt or anything because of all this. Nothing is her fault. \n\nThis goes back to the title of this post. Is going NC with my NMom and EDad really necessary for healing?",
        "created_utc": 1493895458,
        "upvote_ratio": ""
    },
    {
        "title": "Motivation, inner child, all that",
        "author": "toomuchtooold",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/696qix/motivation_inner_child_all_that/",
        "text": "I was wondering whether any of you could recommend any resources, or have any insights, about getting back motivation? I feel like I've healed to the point where a lot of my motivations (people pleasing, being lovable, doing the right thing) have gone away but I'm not yet at a point where I have a clear view of what my intrinsic motivations are. I tried doing a goalsetting exercise this morning and I felt very anxious that I was getting it wrong - that the things I was writing, I had no feeling that they are anything I will actually enjoy doing! I feel like I need to just read and hear a bit about motivation and figure it out for myself. Does any of that make sense? ",
        "created_utc": 1493894401,
        "upvote_ratio": ""
    },
    {
        "title": "I'm out of sadness, I'm running out of guilt. What do I do with all this leftover rage?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/695bpd/im_out_of_sadness_im_running_out_of_guilt_what_do/",
        "text": "[deleted]",
        "created_utc": 1493869948,
        "upvote_ratio": ""
    },
    {
        "title": "Struggling with guilt after ndad text",
        "author": "idabakedacake",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/691c9p/struggling_with_guilt_after_ndad_text/",
        "text": "My ndad and I have been NC for 3 years. My family decided not to attend a bench dedication service at the school my deceased mom taught at. Ndad will be there and based on past experiences he won't likely just attend, he will take control. It might be a speech and/or an overly generous gift to the school. \n\nI got a text from him last night urging me to go for mom. Or at least send the kids with my gc sister. The grandkids? The ones he has not spoken to for 3 years because he would not apologize for or stop his cruel behaviour towards me. We should send them with her and the estranged grandparent??\n\nI grieve that we can't go. We should be able to go. The kids should be able to, they loved her. But we can't because we believe he will attempt to manipulate the situation in order to influence the kids. \n\nIt was not an easy choice and his text is stirring up the guilt over it. It is so hard  explain why we can't go to others without looking paranoid. I also think there will be fallout. Relatives who will be mortified we didn't go. \n\nI also feel angry as I read between the lines in his text.",
        "created_utc": 1493828230,
        "upvote_ratio": ""
    },
    {
        "title": "The RBN superpower",
        "author": "toomuchtooold",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/68zcn0/the_rbn_superpower/",
        "text": "I saw [this cartoon](http://theoatmeal.com/comics/believe) from [The Oatmeal](http://theoatmeal.com/). It's about the [backfire effect](http://rationalwiki.org/wiki/Backfire_effect) which is basically the idea that we experience challenges to our core beliefs as something as scary as physical attack, which we defend against, and therefore you can sometimes end up entrenching someone's views by arguing against them.\n\nI suspect RBNs are really good at not doing this. In fact, I think we probably suffer from the opposite problem that when we disagree with someone, we find it really hard to hold our position. Does anyone else relate? I think it's to do with the gaslighting - I was always wrong in any disagreement when I was a kid. Finding out I had it all wrong and I'd fucked up again was a daily occurrence.\n\nWhen I was about 7 I found my salvation. In school I had access to books - I remember reading things in the sort of ABC science books in school that contradicted my mother - like stuff about how colds are caused by viruses, not by getting a bit cold - and I was so happy with science, the idea that out of this gaslighting murk you could find the truth by actually testing things out, and not only that, but this method was an official thing at school that people approved of. I immediately ditched my ambition to be a dancer and declared that I was going to be a scientist. My primary 3 teacher was thrilled.\n\nOne of the things I learned about science was that everything was provisional. You formulate a theory, you test it, and if it explains the evidence you see better than any other theory and nothing contradicts it, then it stands. The price you had to pay to be a scientist was that you could never be entirely sure of anything, you always had to consider the other person's argument on its merits and be prepared to change if theirs was a better explanation. I was extremely happy to pay this price, I think not just because it meant that I could sometimes be right (I was never right when it came to my mother) but also because I had seen with my mother what a blind alley you come to live in when you let your emotions do your thinking and I didn't want to live like that.\n\nBut I think the intellectual commitment to think like a scientist was only half the story. I think as an RBN, when we start to heal from the abuse, we are carrying around profound trauma, and many of us have PTSD or CPTSD. The amygdala is firing all the time. We live with a state of constant stress, constant fear. And I think for many of us the first step to healing is learning not to listen to that overactive amygdala when we're making decisions. We learn intellectual rules of thumb to stop us using emotional reasoning. We entertain dissenting voices, we seek impartial advice, we double-check, and we try to imagine ourselves on the other side of the argument. These rules of thumb are no substitute for a real working intuition - see e.g. [Thinking, Fast and Slow](https://en.wikipedia.org/wiki/Thinking,_Fast_and_Slow) by Daniel Kahneman - but for people like us who grew up in a web of manipulation and lies, it's a first step at least to get us functioning in the world. And I think it can be our superpower, that practice in putting emotions to one side. Because hearing dissenting voices will put our backs up just like anyone else, but the difference is, we have practiced the conscious choice not to react, not to defend.\n",
        "created_utc": 1493804584,
        "upvote_ratio": ""
    },
    {
        "title": "I've fallen but I will get back up!",
        "author": "littlestghoust",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/68v8t3/ive_fallen_but_i_will_get_back_up/",
        "text": "Recently, my mental state has taken a dip for the worse. I can tell depression is creeping up since my anxiety has left the door open.\n\nI can't stop feeling disrespected, unlike, useless, etc. I keep repeating all the stupid stuff my nmom told me growing up. I can tell I'm digging this big negative hole in my mind, and I'm at the edge wanting to jump in.\n\nI finally told my SO about it, and we are trying to fix my mindset.  He tells me \"you're important\" and I have to respond \"I'm important\", along with trying to think of one good thing during the day.\n\nWhat other things do you folks do to try to starve of the self induced angst? I need more tools if I am going to be successful in fighting off the black.",
        "created_utc": 1493752593,
        "upvote_ratio": ""
    },
    {
        "title": "I thought I'd share a little triumph with you today",
        "author": "random_thot",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/68or8o/i_thought_id_share_a_little_triumph_with_you_today/",
        "text": "I had a ptsd flashback about 10 years ago that forced me to acknowledge just how bad things were for me in the past, and it started me on a very difficult path to healing, that has frankly been complicated by a series of, well, unfortunate events. \n\nDuring this time, I came to feel like I wasn't making progress, and I started using one of those \"send a message to your future self\" services. \n\nI got one from two years ago today, and for the first time, I have either solved or made headway or have an action plan for most of the issues in my letter! Progress is happening! :D",
        "created_utc": 1493672813,
        "upvote_ratio": ""
    },
    {
        "title": "I'm new here and just looking for some support",
        "author": "sheismysky",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/68jc6y/im_new_here_and_just_looking_for_some_support/",
        "text": "I don't know where to begin and mine is such a long story. I just need to tell someone who understands. \nI am a 42 year old woman, the single mother of an 18 year old daughter. \n\nI was raised by a diagnosed narcissist. I know this is kind of rare. My mother forced me out of family counseling when that diagnosis was made in regard to her. I'm an incest and rape survivor, by my older brother (who is the golden child). I have major depressive disorder and ptsd, and severe anxiety. I have regular suicidal tendancies for the last two years. I have only shared this with therapists, who then see me as a liability. \n\nTwo years ago, my teenage daughter, my whole fucking world, ran away to live with my mother. She was offered a lot of things I couldn't give her, materially. Our relationship was close, loving, and as stable as I could make it. I have a successful career and did provide well physically and emotionally. I just didn't know my mother had been kind of bribing my daughter behind my back, for years. She had always wanted her, I did know that. \n\nWhen my daughter left she felt extremely guilty, (it was Christmas, and came with no warning) but was feeling spoiled and happy by my mother. She couldn't face me, and wouldn't talk to me. She still barely does. I spend most days crying over this, the pain is actually physical, the missing her. The not understanding how she could just not need her mom anymore. \n\nI did wait for 2 years for my daughter to come home to me, I paid for her to go to counseling, I threw myself at her feet, as I am NOT a perfect parent or person. I wanted her to forgive me for any mistakes I made and come home, but she is truly happier, I guess.\n \nAfter those years I just can't deal with my mother anymore. The things that have gone on have been awful, just awful. I did try to get some help from my family doctor, and my mother was worried about me badmouthing her, so she then called him and expressed concern that I would perpetrate a murder/suicide. This horrified me, drove me into despair so low. I would never. hurt. my daughter. \n\nI moved out of the area six months ago, and got married to a wonderful man after being single for many years. I am now very low contact with my mother, and my relationship with my daughter is spotty at best. She will sometimes respond with an \"I love you too\" when I text her, but otherwise, I've completely lost her to my mom. I can't control the campaigning against me, the lies, the horrible manipulating. I am getting too old myself to be this raw all the time. It takes a toll on my whole body. \n\nMy daughter will graduate high school next month and the grief, the missing her, the wanting to right misunderstandings/misinformation, feels like it's killing me. I am tired. I can't fight these battles, and I don't want to get into all that with my daughter. I just want her to remember me being her mom, her only parent, for so long, and the love and closeness we had. I question constantly if I need to turn away from her too, as she knows how much pain I'm in, and is well aware how much I love her. I never wanted to be a person who gave up, but I don't think they love me, and before my husband, they were all I had. \n\nMoving on is hard and I'm afraid every decision I make will increase the likelihood that more pain is to come. If I disappear and go nc and turn away from the constant rejection, I may always feel like I abandoned my only child. If I don't, I may not survive any of this. \nI live in a very rural area now, with no ready access to the help that I need.\n\n So I'm away from them, mostly, but I feel very fragile and full of heartache every second. I have nightmares about fist fighting with my mother, which I would never do. But I am so fucking tired, and she took my daughter. The more time that passes without the daughter I had for so long, the angrier it makes me at my mother. Thanks for listening, I'm sorry it's all so long. I hope I can at least read your posts and find some more strength somewhere in my soul. ",
        "created_utc": 1493603724,
        "upvote_ratio": ""
    },
    {
        "title": "Getting over messed up gender bias after RBN?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/68eu0v/getting_over_messed_up_gender_bias_after_rbn/",
        "text": "[deleted]",
        "created_utc": 1493548176,
        "upvote_ratio": ""
    },
    {
        "title": "Quitting coffee to help with anxiety and panic attacks",
        "author": "rbnthrowmefaraway",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/68am5n/quitting_coffee_to_help_with_anxiety_and_panic/",
        "text": "Sorry of this gets kind of rambly, I'm just looking for some support right now in going caffeine-free.\n\nI had always noticed a link between getting anxious and having a lot of caffeine, and getting panic attacks, and I know a lot of ACoNs recommend quitting caffeine, but I had only ever succeeded in reducing caffeine, not quitting it entirely.\n\nI finally got serious about quitting caffeine in April, but it's been really rough going. I love energy drinks. I tried switching to kombucha for it's reputation of being \"naturally decaffeinated\", but a lot of brands of kombucha actually have added caffeine (including my favorite), and, since the tea that kombucha is made from has caffeine, it's impossible to know how much caffeine remains in the final product. So, I quit kombucha, too.\n\nI tried decaf coffee, but didn't find it helped, much. I don't like the taste of it. (Also, decaf coffee has a pretty surprising amount of caffeine in it.) I have a LOT of herbal teas right now, and I keep switching between them in an attempt to keep myself from relapsing.\n\nI tried reducing caffeine first by using green tea or jasmine tea, but I didn't find that worked. All it did was make me crave more caffeine.\n\nStill, every couple of days or so, I've ended up having a caffeinated pop, or something mildly caffeinated. It makes me feel better for a short period of time, and then I have trouble sleeping, I get anxious, etc. I find that diet&amp;caffeine free pop doesn't work, it just makes me crave \"real pop\", so I think I pretty much have to quit soda, too.\n\nCurrently, I am, no cheating and no pop, going on about 36 hours of no caffeine. I want to go all weekend, hoping that will set me up well for the following week. I don't feel like I need caffeine to wake up or stay up at all. I use it as a mood booster. I'm staying awake just fine and sleeping much better than when I drink caffeine, but I just stay in this lethargic, depressed state when I have no caffeine.\n\nI've heard that it takes some people months of zero caffeine before they recover. That sounds excruciating. Does anyone else have experience quitting caffeine? Any advice, or words of support?",
        "created_utc": 1493487734,
        "upvote_ratio": ""
    },
    {
        "title": "Can baby sleep in pack n play napper?",
        "author": "inboundjeams",
        "url": "http://omgstroller.com/can-baby-sleep-pack-n-play-napper/",
        "text": "",
        "created_utc": 1493457185,
        "upvote_ratio": ""
    },
    {
        "title": "NASA Discovers SEVEN Earth-like Exoplanets, THREE Could Hold Alien Life",
        "author": "ExcitingAds",
        "url": "https://www.youtube.com/attribution_link?a=Tl_15GMQVJI&amp;u=%2Fwatch%3Fv%3DiKv2lLUFdb4%26feature%3Dshare",
        "text": "",
        "created_utc": 1493426480,
        "upvote_ratio": ""
    },
    {
        "title": "Does it seem like Narcs are everywhere at times?",
        "author": "Kielera71421",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/682rjv/does_it_seem_like_narcs_are_everywhere_at_times/",
        "text": "It might be because i'm BPD and they are drawn to me but i've come across way too many in my 21 years on this earth that only 6/100 people have this illness.",
        "created_utc": 1493387674,
        "upvote_ratio": ""
    },
    {
        "title": "[Vent] One year anniversary from when Nex2 came along",
        "author": "Codependentte",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/68057w/vent_one_year_anniversary_from_when_nex2_came/",
        "text": "Exciting! Happy! What will happen next? Will we get along? Is this just a one night thing?\n\nYep. Well. Now I know.\n\nI so need to move on, but seem stuck. I've literally been on Reddit all day. I still think of all the dysfunction and lies and just generally being played. Ugh. \n\nSo I'm going to the doctor next week to see if there are any meds I can take to jump start things. Usually hitting the gym does it but this is taking too long.\n\nPlus I have a new hair color. :)",
        "created_utc": 1493343848,
        "upvote_ratio": ""
    },
    {
        "title": "((صباحيات الصباح ))",
        "author": "luayalshaheen",
        "url": "https://www.youtube.com/attribution_link?a=wCvODMLRk6M&amp;u=%2Fwatch%3Fv%3DZh4HMIVvgZM%26feature%3Dshare",
        "text": "",
        "created_utc": 1493255884,
        "upvote_ratio": ""
    },
    {
        "title": "Daily Nightmares. Resentment, guilt and anger. When will it stop?",
        "author": "s_t_o_r_m",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/67q47g/daily_nightmares_resentment_guilt_and_anger_when/",
        "text": "",
        "created_utc": 1493231777,
        "upvote_ratio": ""
    },
    {
        "title": "Why is narcissism glorified by society?",
        "author": "Kielera71421",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/67pmj2/why_is_narcissism_glorified_by_society/",
        "text": "It seems like the bigger an asshole someone is the more people want to follow you.Then we have the problem of hating the victim of Nabuse and feeling for a narc.Its a clusterfuck.Whats worse is so much of society thinks the symptoms of NpD are fucking positive and motivational",
        "created_utc": 1493227429,
        "upvote_ratio": ""
    },
    {
        "title": "Something Nwife said to me today.",
        "author": "dbthrowedaway2",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/67j34u/something_nwife_said_to_me_today/",
        "text": "She called me today. We were talking about her S-I-L, and Nwife was saying how she has complaints about S-I-L as a wife to her brother. I said \"well they both have problems that they've not addressed, ever\".  \n\nNwife then says \"yeah he's so resentful, and she's so hurt that I don't think they'll be able to fix it...I'm just glad that's not a problem that we have\"...in all seriousness. Like the last 14 months of therapy haven't even happened for her, and she's completely delusional about the status of our \"marriage\".\n\nI'm completely blown away.",
        "created_utc": 1493150462,
        "upvote_ratio": ""
    },
    {
        "title": "Why do I automatically hate the look of some people?",
        "author": "AlwaysNang",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/67gxq0/why_do_i_automatically_hate_the_look_of_some/",
        "text": "I want to get along with everyone but some people I just hate for no reason whatsoever other than I don't like the look of them? Is this normal or am I just a prick lol. How to grow past this?",
        "created_utc": 1493131045,
        "upvote_ratio": ""
    },
    {
        "title": "Update. We're beyond son's birthday. Now I actually have to focus on getting the divorce process started.",
        "author": "dbthrowedaway2",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/679ri8/update_were_beyond_sons_birthday_now_i_actually/",
        "text": "Birthday party came and went. Son had a great time. One thing Nwife does well, is she puts on a great children's party. Of course she guilt trips everyone with \"how hard\" she worked to set it all up, and expects heaping amounts of praise for it, but son had a great birthday party, and that's all that matters to me. For the record, I've always showed her gratitude for her hard work...however it's never enough. Nothing ever is for her. She has endless needs.\n\nNow the hard part begins. At some point, I HAVE to tell her that I want a divorce. We haven't even discussed it at this point. We don't talk, so there it is. \n\nI simply can't carry on in a relationship where I'm not valued, cared about, acknowledged...I simply exist as a means to an end (as an ATM) for her.\n\nThe next two weeks are going to be so difficult.",
        "created_utc": 1493047906,
        "upvote_ratio": ""
    },
    {
        "title": "Fresh out of a Nrelationship, still struggling.",
        "author": "pauly905",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/66z2tr/fresh_out_of_a_nrelationship_still_struggling/",
        "text": "I cut contact at the beginning of the week for the third or fourth time. This time around, I called him out on his behaviour, telling him I was tired of his abuse, and he said he never wanted to talk to me again. I guess part of me wanted him to fight for me. Part of me thought that if he heard the words, he would realize how his behaviour was coming across and really want to work to change. So I'm hoping that this time around it will stick.\n\nI am struggling with really accepting the relationship for what it was, with admitting to myself that he wasn't a nice person, that he was manipulating and abusing me. I keep thinking that I should just apologize and beg for forgiveness, try and fix things. That maybe if I can just explain how I'm feeling, if I can just get him to understand, he will stop acting the way he does.\n\nI bought a book, I wonder if anyone else has read it? It's called From Charm to Harm. It's really informal, not written by a doctor or a health professional, but by someone who experienced life with a N. It's amazingly validating, because I feel like I'm reading my own thoughts, and sharing an experience with someone who knows exactly how I am feeling. But it is very difficult to read because it means I am accepting the fact that the man I thought was the love of my life, who I would have done anything for, wasn't a good person, and definitely didn't feel about me the way I did about him.\n\nI guess I'm looking for advice. What do you guys do to stay strong, to find closure, to put yourself back together? Thanks for reading.",
        "created_utc": 1492903345,
        "upvote_ratio": ""
    },
    {
        "title": "3 months post breakup and fuck you...",
        "author": "BearyConfused",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/66yre2/3_months_post_breakup_and_fuck_you/",
        "text": "3 months no contact today and I miss you. 3 years together and it took me that long to see the emotional manipulation and abuse. \n\nYou've told everyone I was seriously mentally ill and that I caused you mental health problems. You messaged my sister saying I was deluded and you told me I was weird and a mess. \n\nThis week I did things I was never 'allowed' to do with you. An acquaintance approached me just to chat and be friendly as she'd discovered we had a shared interest. I added her to my Facebook, full of fear. Fuck you. \n\nI wore a hat today that you said made me look like a clone of my weird ex. It was sunny and my head was burning so I wore it. Fuck you. \n\nI agreed to meet up with two friends I haven't seen in years and who I wasn't allowed to see. Fuck you. \n\nI'm terrified, despite no contact and the fact i shouldn't be scared of you any more. You were never violent. But you live in this area and I'm still scared.\n\nAnd I still think you were the most beautiful woman I ever met. I can't imagine ever being with anyone else. I miss some things about us and youre still, annoyingly, my first and last thought every day. \n\nBut fuck you. I deserve better. I'm not where I want to be but I'm definitely on my way. \n\n\n\n",
        "created_utc": 1492899538,
        "upvote_ratio": ""
    },
    {
        "title": "Does this new-ish internet friend sound like a Narc?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/66yfko/does_this_newish_internet_friend_sound_like_a_narc/",
        "text": "[deleted]",
        "created_utc": 1492895834,
        "upvote_ratio": ""
    },
    {
        "title": "My laziness contributed to the family income through benefits we wouldn't have gotten otherwise.",
        "author": "25limes",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/66wlxz/my_laziness_contributed_to_the_family_income/",
        "text": "The ex actually stated this today to prove (likely more to delusion himself) he's contributed to our family income in the 5 years that I've paid all bills, including childcare because he couldn't be bothered to get work or be a SATP. He even did the math and presented me an exact amount of his contribution.\n\nIt's been a couple years now that we've split up. I see through his farces and games mostly, and I have become good at ignoring or dealing swiftly with no drama with his shenenigans it for most of the time, but this one got to me. \nHow in the world can someone even remotely feel good about themselves and then putting this statement into an email? How in the world is it possible to not see the cynicism? \n\nI'm baffled. \n",
        "created_utc": 1492875871,
        "upvote_ratio": ""
    },
    {
        "title": "Sometimes validation is a hollow victory",
        "author": "eelings",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/66urhj/sometimes_validation_is_a_hollow_victory/",
        "text": "My NMom has often presented well enough to family and friends that my statements about her horrific behaviour to me were dismissed or seen as me being overly sensitive. Today, a close family member disclosed that as a result of a situation where NMom had power over her, she now sees and believes that everything I have described is real. I feel bad NMom treated family member the way she did, it makes me sick and I am so sorry it happened. But I am so pleased finally a relative of mine believes my experiences and now is re-evaluating many of her historical observations (which NMom had made sure to make herself look like the victim, not the agressor). So why do I feel so drained and sad?",
        "created_utc": 1492845553,
        "upvote_ratio": ""
    },
    {
        "title": "Narc friend question: Does anyone recognize this phenomenon?",
        "author": "narcfriendquestion",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/66saht/narc_friend_question_does_anyone_recognize_this/",
        "text": "I do come from a Narc family and as such when I see someone outside the Nfamily sphere doing something shady, it piques my senses.  I have a \"friend\" (more on that later) who is most likely a covert narcissist. She's always been more of a frenemy (known her since elementary school) and I guess the sympathetic person in me wanted to believe she could grown up and stop being a pain in the ass. And she seems really attached to keeping me at least in her circle of friends, it's really weird, she always tries to suck me back in every year or so and I can't really figure out why. Because she's basically been a bitch to me since middle school. (If you don't like me, why stay friends with me when we don't have to be? Right?)\n\nSince I've woken up to my families' toxicity and Narc techniques, there is something she does that I've always found creepy but now has a more sinister tone.\n\nMy narc friend is NOT a nice person and it's catching up with her: Rampant jealousy, constant sarcastic remarks, no longer the biggest fish in her pond and takes it out on 'underlings.' Is also running out of underlings. I've had her in my life for over 20 years because of small town politics and also because I just didn't have it in me to battle a 'low level' narcissist when I had such fucking huge Narc family shit to deal with.\n\nHere's the thing she's been doing for a long time and I can no longer stand.\n\nCan anyone tell me if this is a narc \"feeding\" tactic or just a normal thing that normal people do and my spidey senses are just tingling too much. (Allergies, if you will, ha ha)\n\nShe instigates conversations with me only very sporadically, even though every year or so she says \"I really want a relationship with you, I want us to be close like when we were younger, you're my oldest friend.\" \n\nHere's the weird thing. SHE IS ALWAYS TRYING TO SHOW OFF HER \"FRIENDS\" TO ME, EVEN THOUGH I DON'T KNOW THEM OR THINK THEY ARE PARTICULARLY INTERESTING OR COOL.\n\nShe is all up on it if something bad or hard is happening in my life, but as soon as shit gets back to normal, she skeedaddles, or *can only talk to me about her 'interesting friends.'*\n\nShe sends me pictures and DMs of her 'friends' lives and tries to have big conversations about them and how accomplished they are. She even tries to have long conversations about people we knew in high school, who she KNOWS I wasn't friends with then, and am not friends with now!\n\nShe's been doing this for over ten years now that i think about it. I know almost NONE of these people, they weren't in my circle of friends when we were younger and I don't actually know or care about them now.\n\nAnd, when I actually try to do something to attempt (yet again) to build a functioning friendship with her, she actually ignores me. She never EVER instigates a conversation with anything friendly or positive, unless it's to brag about someone she knows going to China or something.\n\nIt's like she's hiding behind her 'interesting friends' and trying to live through them. To impress me or score points.\n\nI know none of this seems particularly malicious, but trust me, she's pulled some nasty shit over the last few years and I called her out on it because I was feeling a lot clearer about boundaries. \n\nShe's also recently suffered some 'life setbacks' that I know make her feel really insecure, and she's fishing through MY life to try and find faults or shit to feed off.\n\nI know this sounds petty as shit, but I'm noticing a pattern with her. She pretends like she wants to 'rekindle' the friendship when (it appears to me) that she has no one around her to feed off.\n\nAnd now that I don't tolerate her low level bullshit, she literally can't say anything to me other than \"look at a picture of my cool friend who lives in whereever and is winning an award.\"\n\nAre you kidding me?  These are people I've never met, there's no way she could think her friend winning an award is relevant to me or our relationship.\n\nIt's literally the ONLY thing she can do now that I've set up boundaries. Now that I've clocked her for her sarcasm and gossip and 'who me?' insults, it seems like she has nothing left to say!!\n\nI know this is not a high level dangerous or alarming thing, but I am starting to see thorough people's bullshit a lot more clearly since waking up to the abuse and toxicity from my narc family.\n\nTLDR: is this \"look how cool and amazing my friends are, because I can't think of anything else to say\" thing a legit narc tactic, or what?\n\nAnd, to those of you who think I'm just not being nice enough to my friend: TRUST, this girl is on her 5th second chance. She has pulled the nastiest shit and managed to weazel out of it by saying \"I just didn't *know* it hurt you that bad....\"  (Being friends with my abusive ex behind my back and gossiping with him about me, throwing a party for me and making fun of me *during* the party,      making sarcastic jokes about my mother in law IN FRONT OF ME, AT MY WEDDING, trying to set me up to talk to someone who she KNOWS I'm not friends with {she's done this on 3 occasions now that I think about it!} Also, she's a recovering drug addict and when she was active in her addiction she almost attacked me physically because I took her keys. That last one was a really long time ago though and I just chalked it up to 'stuff addicts get away with.'\n\nShe's NOT a totally stable or non-toxic person. [I hate that I have to spell it out, but narc is such a casually thrown around word these days, yennow?]\n\nI know I won't get universal agreement on this (alas, such is reddit) but I would like to hear from people who have seen this before. And I don't want to call her out on it because she has a history of doing low level annoying shit, and then when you call her out on it she turns it into some kind of 'look how hard I'm trying to act right, you should be proud of me for even trying, look, I'm crying now!' type thing.\n\nPart of me thinks she is doing this to see if I react or notice. IDK. \n\nedited to add: **Any and all Grey Rock success stories and/or techniques would be great!** (Not family so no family gatherings, also not in the same social circle so not likely to see her out anywhere. Also don't live near her.)",
        "created_utc": 1492811465,
        "upvote_ratio": ""
    },
    {
        "title": "Feeling awful for my daughter",
        "author": "htaylor393",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/66pgky/feeling_awful_for_my_daughter/",
        "text": "Background: my dad sexually, physically and emotionally abused me but thinks he was disciplining me so says he's done nothing wrong. His entire family (his parents, sister and 2 brothers plus their partners and their children) support him and think he's done nothing wrong. I cut them all out of my life awhile ago, had a wobble a few months ago and started email contact with NDad but couldn't hack it and stopped.\n\nMy life's pretty complicated as it is. My nearly 2 year old daughter has hip problems which meant she only started walking last month, she's Asthmatic and has regular eye appointments for a squint. She's also just starting to have hearing tests . I have appointments every few weeks with her for something. But we have a good life, she's in a Nursery 3 days a week and doing well. I still live near NDad and his family. I was careful to choose my daughters nursery, to try and avoid my aunt and cousin who have children born 4 and 2 weeks before my daughter. I've so far managed to do that.\n\nI organised my life so that I mainly avoid NDads family, however my husbands parents life next but one to my grandparents and my mum is still technically married to my NDad. My brother also still has contact with him so it can be difficult. They do mostly avoid me now (NDad and his brothers ignore me completely we do still have the odd problem with one of his brothers partners and his sister)\n\nOn a Thursday I go to a playgroup thing with my daughter. I love it. I've made a few mum friends with kids my daughters age. I've been going since September and it really makes my week. I look forward to going.\n\nYesterday my cousin turns up  at the group with her kids ones 2 weeks older than my daughter and the others a few weeks old (I don't know and I don't care really). It was awkward, my daughter and my cousins child have met when they were 6 and 4 weeks old but not since. They wanted to play together, every time my cousins daughter approached mine she'd take her child away and I did the same in reverse. It was awkward, confusing for the girls and made the whole experience awful. My cousin chatted to my friends and their kids, and I've always taken the approach that I'd never stand in the way if they wanted to be friends with members of my family instead I'd walk away as I don't want to drag people into the mess that is my past.\n\nBut I feel so defensive of them, I've worked hard since my daughters birth to make friends and enjoy myself. I just wanted to scream and take them away but I promised myself I'd not get them involved. Im surprised it's not happened before tbh, but now it has I'm so confused and angry. And I don't know what to do for the best?\n\nMy cousin and I clearly don't want to be friends and I like it that way. But I don't know whether to go back to the group or find a new one. It's the only one I go to with my daughter as it's close to home and pay as you go. But I suppose I could find something else she'd like to do. I don't want to confuse my daughter by changing her routine but she was so confused by not being allowed to play with this other child that I'm not sure which way to go for the best.\n\nSorry I'm rambling. My husband doesn't know any of this and I don't how to tell him or how to fix this.",
        "created_utc": 1492784271,
        "upvote_ratio": ""
    },
    {
        "title": "finally managed to put Nx divorce into words",
        "author": "TheTartanDervish",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/66jcra/finally_managed_to_put_nx_divorce_into_words/",
        "text": "it was today's Askreddit about the fastest fuck-up someone's made of their life.\n\n\nMine was getting married - I got conned, if you've read Caril Hiaasen's \"Skinny Dip\" then it's the same scenario minus having a trust fund... and I haven't had a relationship last more than a couple months-to-couple years since then.\n\n\nanyway I never talk about it, but today I managed to sum it up, that only took over a decade...\n\n\nAlso please don't judge me, I already spent  ages regretting and avoiding it, nearly lost my clearances over it, suffered 10 years of stalking (once I'd left town 2 hours before he arrived)... and internet background checks were $50 back then which would've been about 740 times cheaper than the divorce, which dragged on for ages because Nx kept bringing up stupid objections like he wanted custody of a houseplant but mama's lawyers were find with earning money to argue that... so yeah, already took the physical, mental, etc abuse from him and poor self-talk... \n\n\nSo here we go:\n\nExtremely late to the party: Take out $35000 credit card debt for online porn, pay the interest by borrowing from a Chicago gang, not tell his wife he's bisexual before she finds it, take out a big insurance policy on her while she's in Iraq thinking she'll die and he'll have $1mil to pay the card and the gang and live well, she doesn't die in Iraq so he tries to strangle her while she's cooking dinner, he breaks her hand but she chokes him out and escapes, he tries to fight police... he then tries to punch judges (got 2 days for that) but his mama knows the judges so the attempted murder as the domestic violence and the battery charges are dropped... then he hides in the woods to avoid the process server for the divorce... so he then threatens in writing to kill the now-ex-wife's XO and Chaplain, except now it's wartime so they throw him in the brig for military charges sinstead of civilian charges so mama can't buy him free, and in the brig he brags to everyone about how he tried to kill a sailor by flooding a ship's compartment years ago... so he gets charges of 1 sabotage 2 attempted murders 2 threatening murder and all sort of lesser charges... dishonorable discharge and just got out 14 years later. He managed all this in just four months. source: I'm the ex.",
        "created_utc": 1492710402,
        "upvote_ratio": ""
    },
    {
        "title": "Internship + Leaving(help!)=Ndad losing it?",
        "author": "lovelyturquoise",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/66j2lc/internship_leavinghelpndad_losing_it/",
        "text": "This is probably one of the most difficult things I've ever had the privilege to share with anyone. I have an escape plan to leave my ndad's home and I need advice concerning what I may be missing from this plan.\n\nThe plan entails using a possible internship (it doesn't really matter whether or not I get the internship) as a cover to move in with my boyfriend. These are the steps:\n\n1. Slowly move my items (clothing, books, etc) over to my boyfriends  home. This takes more planning that it seems.I have things scattered throughout the house.\n\n2. I will move in my clothes the last two days of the month before I get packing for an internship that \"starts\" the first day of the following month.\n\n3. During the last week of the month, the day my ndad leaves to visit my homeland ( the country of Turkey) for vacation, which would be a Wednesday. I will tell my mother that I will interview for said internship on Friday and that I will get a response the same day.\n\n4. On that Sunday or following monday of the following month, I will pack my suitcase (passport, important documents included) so that it looks like I'm going to head down to the airport but I'll be officially moving into my boyfriends place.\n\n5. A few days after that, I have plans to meet my boyfriends religious family in person. We will fly out to see them.\n\n6. When we return the following week, I may or may not hear back from the said internship for real or I'll be starting a new job that I applied for a few weeks earlier.\n\n7. Once my boyfriend and I return from seeing his family, we will still be continuing on the process of buying a home. We will be searching for homes and talking to lenders/real estate agents for another 3 and a half months.\n\n8. After the three and a half months, I will have to decide within that time frame whether or not to move in with my boyfriend permanently or return to my families home without taking my things back because we will still be in a relationship.\n\n9. Option 1: move back home and maintain my relationship with my boyfriend but feel miserable because I don't want to stay at my ndads home. And regretting that I didn't leave out of fear of what he might do to my mother and brother including his promise to never let me enter his home or see the rest of my family as long as he is alive (he doesn't want me to marry my boyfriend, which I intend on doing, someday).\n\n10. Option 2: After I return from my supposed internship, after the 3 and a half months, I will ask my mother and father to meet me not at the airport where they intend on meeting me but at a coffee shop with my boyfriend. We will break it to them that I don't intend on moving in because I will be engaged to my boyfriend (i won't actually be engaged but I need to use this terminology or else my conservative father will make it difficult for me and/or call me a whore). \n\nI don't know what my ndad will do. I don't know what I'll do. It is terrifying to choose between staying at home with him and the rest of my family or if its time to move on. I am a  26 years old female living in a conservative Turkish family home. If anyone can relate or would like to add to the plan please add comments and/or pm me!\n\nThank You for reading any of this!",
        "created_utc": 1492707931,
        "upvote_ratio": ""
    },
    {
        "title": "My parents are moving away and it really hurts for some reason",
        "author": "cantseeyounow",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/66i0vr/my_parents_are_moving_away_and_it_really_hurts/",
        "text": "They sent me an email, trying to get me to contact them again. They're thinking of moving away, out of this city to another state hundreds of miles away. I should be happy, that they are further away from me, but I'm upset and can't stop thinking about it. Maybe because they convinced me to come back here to see them again, but I realize that they don't care after all. Maybe I'm making a big deal out of nothing, but I can't describe how this feels to me and I don't know where else to go to understand the mixed feelings this brings up. Thanks for listening.\n\n**Edit** She (my Mom) also wrote this: \"I know you feel it is hard to reconcile issues, but it is not good to continue pushing people away and being isolated.  It only makes it harder for you.  No matter the past, for yourself please reach out and try to make amends. I am always here and willing to listen.\"\n\nShe seems so...nice? I can't help thinking she's changed, or I was just angry at the time, having no freedom and all, and it really is time to bury the hatchet on my shitty childhood, which no one cares about anymore anyway. Anyway...it's upsetting (obviously), but emails like these are the ones that make me come back. No reasonable person would deny that this person is ok, or at least cares a little. Maybe it is all in my head. Whenever I read her words I cry. ",
        "created_utc": 1492698441,
        "upvote_ratio": ""
    },
    {
        "title": "Still struggling with my self confidence, despite my impending exit.",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/66hzlk/still_struggling_with_my_self_confidence_despite/",
        "text": "[deleted]",
        "created_utc": 1492698094,
        "upvote_ratio": ""
    },
    {
        "title": "My Life",
        "author": "SenzikoTheYoutuber",
        "url": "https://www.youtube.com/watch?v=xmqLjG-qNig",
        "text": "",
        "created_utc": 1492669651,
        "upvote_ratio": ""
    },
    {
        "title": "Emotional sexual abuse. Advice.",
        "author": "celticluffy13",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/66fre8/emotional_sexual_abuse_advice/",
        "text": "Hi, first post on this subreddit. I'm a bit self conscious about what I'm about to speak about so bare with me.\n\nI've been in two narcissist relationship that damaged me pretty badly emotionally. My main focus was the more recent of the two. Essentially what he did was emotionally hurt me using sex and using my own body against me. Broken up he instigated sex knowing I didn't want to even though I was still emotionally attached to him. Basically manipulating  me for sex. It was very damaging and my self esteem was at an all time low, I even called a mental health hotline because I was very seriously considering suicide. I felt cheap and weak and hated myself because what I really craved was validation that he loved me because throughout our entire relationship, he would nag and complain about every little thing that was wrong with me while denying affection. The only thing he would compliment me on was that I was great at sex and that's were he mainly showed affection. What I want to know is if there is a subreddit for something like this? Is there anyone else that this happened to? I still feel so much shame for allowing myself to be in that situation. \n\nThank you all for existing so people can let things out.",
        "created_utc": 1492666112,
        "upvote_ratio": ""
    },
    {
        "title": "Anyone successful in making the nightmares stop?",
        "author": "babblepedia",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/66exuo/anyone_successful_in_making_the_nightmares_stop/",
        "text": "I've been NC from my severely abusive alcoholic Ndad for a little over five years. My childhood was absolutely hell and it's taken a lot of therapy and conscious effort to be a real functioning adult after growing up in that situation. \n\nBut I still have terrible nightmares almost every night. Sometimes they are close to memories, and sometimes they are highly exaggerated night terrors. \n\nIt's making me feel despair because it's feeling like I'll just never escape the experience of being abused. Even though I've cut off contact and moved away and have a great (waking) life... but it's like every night, the abuse is waiting for when I go to sleep. \n\nI've sought mental health help (they suggested meditation before bed, which I've tried and it has no effect) and physical health help (they suggested sleeping pills to just cause no dreams, but it didn't consistently work and it made me somehow more tired). \n\nHas anyone had success with this? ",
        "created_utc": 1492655489,
        "upvote_ratio": ""
    },
    {
        "title": "\"They both got what they wanted out of the relationship\"",
        "author": "Codependentte",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/66bsbf/they_both_got_what_they_wanted_out_of_the/",
        "text": "Ugh. That's how they give the N's -- who they know are total scam artists-- a pass. \n\nI stop them and say, \"No. It's fraud. And it's like a rape because there's no consent -- had I known what they really were like, I never would have consented.\"\n\nNow they think I'm bitter and angry.\n\nWhatever. It's sunny finally so I'm getting off reddit and going to be bitter and angry outside.",
        "created_utc": 1492623790,
        "upvote_ratio": ""
    },
    {
        "title": "An epiphany and looking for some perspective..",
        "author": "213throwaway321",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/66bopy/an_epiphany_and_looking_for_some_perspective/",
        "text": "I've recently come to the realization that my older sibling may be an N. I recently stumbled across some posts of this thread, and can't remember which but one triggered a flip to switch in my perception.\n\nWe have always bickered as (supposedly) siblings do, but I am always the one who needs to apologize and repair our relationship (says my parents). As she is just more needy, sensitive, and I need to be more cautious of that and support her. I have to walk on eggshells around her, as not to potentially offend her, and let her talk through \"all the drama she has going on\" despite the relationship not being reciprocated the other way. I always knew there was something off about her, but always thought she was just emotionally immature and self centered. Not to mention, she interjects herself to become the center of attention on all occasions, and steers the conversation that way at all times. \n\nOur relationship has naturally become more strained recently. I am getting married and am in the midst of wedding planning and everything. My SO and I decided to do a very small intimate wedding with just our closest family. My Nsis made the assumption that she could bring her new bf (I don't know him really and didn't want my wedding to be a venue for her to do her usual stealing my spotlight introducing her new bf to all my family on this day.) She has done this in the past on birthdays and other occasions, so naturally I wanted this to be focused on me and my SO. She was also not the only one going solo, and only family is going. I felt like this was reasonable, and she could suck it up. That's when my parents got really upset at me for this, saying it was unfair and this would ruin our relationship. After the guilt trip and me still standing firm, they decided to give my an ultimatum for something I had asked them to do during the wedding. I got extremely frustrated, and talked to my Nsis and tried to explain my perspective and came to a compromise on me and my SO getting to know the bf and he would meet some of the family beforehand. (I didn't think they were really serious enough to even do this). They met some family, but had not made any effort to get together with us or know him despite my insistence to try. I got frustrated since I was given an ultimatum, trying to be flexible, and being met with resistance on trying to make the peace. \n\nThen came the other day, where she flat out twisted my words and lied.  She said he was coming and had planned so already. Took bits of our conversation, and turned them against me (saying I only needed him to meet the family to go). I'm holding this over her head, and how dare I have so many stipulations and make her jump through hoops. Also, apparently I'm a liar since she claims I'm changing my \"requirements\". And said she doesn't know what's wrong with my and hopes I'm okay. \n\nFinally, I caved because regardless I'm the bad guy here now since she's made her own spin of the story that she believes in. I'm thinking this insanity is rooted in jealousy of me getting married, not being the center of attention, and needing sympathy from my parents.\n\nAnother instances that really depict why I think she is an N\n- My family took in extended family who was ill. I needed somewhere to live during college despite not being enough rooms at home and moved in with my sister. She was living for free in my parents 2nd home and paying utilities and cable. She had roommates here (2) even though it was a four bedroom. When I started dating my SO, I stayed at his house frequently. After two months, she decides to kick me out and forced me to move in with my SO so she can rent the 4th bedroom that had never been rented before, so she could pocket the cash. Keep in mind, this was not her house and I could not go back home with my parents due to ill family living there already. Also I was in a new relationship, so if we were to break up, I would have literally no where to go.\n\n- Whenever I make an achievement or do any monumental milestone if my life, she does as well during the same time. I bought a house, she bought a house. I bought a car and both times she did as well. I get a new job, so does she. I'm talking of having kids in the next year and now her and her new bf are also thinking the same timeframe. (Been together less than 6mo). \n\nI really am looking for perspective from others on if they think this is cause to believe she is an N. I feel kind of crazy thinking that no contact may be an option, but have guilt with what this will do to my family who has always been very close.\n\nAny perspective or advice on how to correct the relationship with her? \nWith my parents?\nHow to have a conversation with my parents about the above and help them understand my perspective here? \n\nThank you for your time reading this rant. I figured if anyone would have some understanding of this constant insanity, it would be you guys. \n\nEdit:: My parents, while enablers, I am sure have gone through their own issues with her. She stopped talking my mom for a while since my mom did not like her boyfriend for just reasons (drugs). This really hurt my mom, and she tried to fix the situation, however took a lot of time to get their relationship okay again. She uses her relationship with them and having one with the family at all a trigger she can pull, since she knows that will hurt them most. ",
        "created_utc": 1492622886,
        "upvote_ratio": ""
    },
    {
        "title": "Choosing your family?",
        "author": "PrancerPrancer",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/66b6ap/choosing_your_family/",
        "text": "Hi everyone\nHave you got a family of choice? Do they really feel like family? Like they've really got your back and are there for you? \n\nI struggle to trust people and open up to people. Apart from for all the obvious ACoN issues affecting my capacity to trust, I also went through a period of homelessness in my 20s. And at that time the people I thought were my friends all stepped away, except for one who stood by me and let me sleep on her bedroom floor. (Legend) That experience made me realize those 'friends' weren't trustworthy. When I got my life back together I distanced myself from the people I felt had let me down and abandoned me, and none of them are in my life anymore.\n\nBut, then I never actually replaced those friends. I have just one real friend who I trust (the legend!) And although I'm friendly with a lot of people and have a lot of people in my life. I don't let them in. I don't get close to them. And I don't trust them.\n\nBut I'd love to have a group of people I am really close with - a family of choice.\n\nIf you have a FOC how did you do it? And how do you figure out who is trustworthy and how *much* to trust??? ",
        "created_utc": 1492618211,
        "upvote_ratio": ""
    },
    {
        "title": "Narcissist in recovery",
        "author": "Luneux",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/668uii/narcissist_in_recovery/",
        "text": "[removed]",
        "created_utc": 1492588685,
        "upvote_ratio": ""
    },
    {
        "title": "Something positive",
        "author": "Retrobebe83",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/662jsy/something_positive/",
        "text": "Hey guys- I've not posted in a while. Things have just been super busy. Mostly good, just busy. But I did want to share this snippet of an email my MIL sent me yesterday. \n\nLittle background- I had a really intense last few days of the work week culminating in a client I didn't expect blowing up at me. It definitely triggered me (wanting to use things against me, calling me a lair, etc) but I handled it very well both personally and professionally. But man did it exhaust me. This weekend was Easter and I just didn't want to people! Plus the following week I have a trip for work and will be with people 24-7 for three days straight. The 10% introvert in me is exhausted thinking about it. So after talking to my husband (&amp; feeling guilty) we decided I should stay home from Easter dinner with his family. It was what I needed for sure. \n\nYesterday I got this email from my MIL:\n\n\"First, Retrobebe, I hope you are feeling less hectic.  We missed you but I wanted to let you know how overjoyed I am that you felt secure enough in our love for you, and acceptance of you, to be honest and say “I just did not feel up to it today” instead of coming “because you had to” and feeling uncomfortable or miserable!\"\n\nMy husband just told them the truth about why I couldn't make it and they were ok. Excuse me while I go cry tears of joy in a corner! \n",
        "created_utc": 1492518980,
        "upvote_ratio": ""
    },
    {
        "title": "What's the point of life?",
        "author": "Dlow_Stacks",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/661xdx/whats_the_point_of_life/",
        "text": "pls help",
        "created_utc": 1492510123,
        "upvote_ratio": ""
    },
    {
        "title": "Son's B-day is this week. Nwife's mom is coming, with other grandkids. Getting closer to the end. I want this over with already.",
        "author": "dbthrowedaway2",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/65x4r3/sons_bday_is_this_week_nwifes_mom_is_coming_with/",
        "text": "Apologies if this is sort of a stream-of-consciousness rant.\n\nNwife and I barely speak now, which is good...extremely sad, but good. We don't fight if we don't talk. She actually took time to watch two episodes of, what used to be, our favorite show last night w/me. How nice of her. Of course, it was done on her terms.\n\nI find myself asking, every single day, \"what the hell happened to us\"...then I remember that she's always been this way, she's just become terrible at hiding it over the last 6 years.\n\nAt it's core, our relationship was doomed to fail much sooner. I honestly think, unless she was married to a complete doormat, anyone else would've bailed years ago. I really believed she would \"grow out of it\", but the abuse/neglect just became worse and worse.\n\nI never really made the connection to narcissism until a few months ago. Then it hit me like a ton of bricks. My entire view of her came crashing down like a broken mirror. Now, I'm physically repulsed by the person I'm married to. All of the demeaning comments, the little \"digs\" she would take at my expense, all began to make sense. She once told people, that we barely knew, that I had recently lost a job because I looked at porn at work...I do not do that, and that was certainly not the case of why I lost that particular job (2008 economic downturn caused company wide layoffs including 2/3 of my dept). She said it was \"just a joke\"...the people she said it to obviously thought she was for real.\n\nI maybe shouldn't say this, but my mother has been telling me for a few years \"She either wants you dead, or she wants you gone\". I refused to listen to her. I always made excuses for Nwife's behavior, and tried to have empathy and compassion because of her familial circumstances (divorce at a young age, neglect, emotional abuse from parents/step parents)...but once I realized she's continuing that cycle with me, I had to stand up. Since I started doing that, she's been super resentful of me. She's openly trying to win the children over.\n\nAll this to say, I want this to be over with. I'm ready to move on. I stated in our last couples session, that I could not rebuild our marriage as it was. I can only rebuild this marriage if I am respected, treated with love, compassion, and empathy. After I said that, the counselor said \"I can do nothing more for the two of you. You need to figure out what you both want\".\n\nEDIT: a word",
        "created_utc": 1492451489,
        "upvote_ratio": ""
    },
    {
        "title": "Những câu nói hay về cuộc sống và bạn",
        "author": "Ngocanh3516",
        "url": "https://www.youtube.com/attribution_link?a=qhCIcDXU26s&amp;u=%2Fwatch%3Fv%3DMtc1Xpo1Gvo%26feature%3Dshare",
        "text": "",
        "created_utc": 1492436436,
        "upvote_ratio": ""
    },
    {
        "title": "car insurance folsom",
        "author": "male16buffer",
        "url": "https://www.statefarm.com/agent/US/CA/Folsom/Kyle-Middleton-GK5YZ1YS000",
        "text": "",
        "created_utc": 1492400104,
        "upvote_ratio": ""
    },
    {
        "title": "[Support] Possibly N and OCD Roommate",
        "author": "ms_abominable",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/65szed/support_possibly_n_and_ocd_roommate/",
        "text": "Not sure if my roommate is an N, but I've been having a really tough time dealing with her lately. She has admittedly struggled with OCD in the past and has a number of rituals in the house. \n\nI looked up OCD symptoms recently and was shocked to see needing constant reassurance was one of the red flags. She often looks to me to make decisions for her that are completely inappropriate for me to make, like long-term career choices or deciding her feelings on family issues. She literally said one day, \"Can you just tell me what to do? I need someone to just make the decision for me.\"\n\nTherapy has taught me how to navigate that a bit, so I've been able to say that is your choice and set boundaries. Unfortunately, she's constantly looking to me for attention and approval. It has gotten to the point where I've started going LC. She's not handling it well and has started some weird passive aggresive behaviors. Her childhood was abusive and we had connected on that earlier in our friendship, but I'm realizing now that might be exactly why she is toxic for me. \n\nLooking for advice from anyone who might have been in a similar situation. How do I navigate this and not make our apt a war zone? I've already started staying in my room more lately and she will literally come to the door and ask, \"What are you doing in there!?\" in a really fake friendly tone. Help!\n\nTldr; Clingy roommate is taking my LC personal and escalating passive aggresive behaviors. What do I do next?",
        "created_utc": 1492395852,
        "upvote_ratio": ""
    },
    {
        "title": "Neverwet Imprägnierspray ... das beste auf dem Markt! http://amzn.to/2pqn6lx",
        "author": "duldinger",
        "url": "https://www.youtube.com/attribution_link?a=KiYtflcu5KY&amp;u=%2Fwatch%3Fv%3DBvTkefJHfC0%26feature%3Dshare",
        "text": "",
        "created_utc": 1492357117,
        "upvote_ratio": ""
    },
    {
        "title": "I regret opening up to people who don't understand.",
        "author": "cantseeyounow",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/65oidr/i_regret_opening_up_to_people_who_dont_understand/",
        "text": "I feel like it \"taints\" the memory in some way. I doubt myself so much, that having someone else say it sounds like my parents care about me, or that they really do care about me but don't know how to show it feels like such a violation. I dunno maybe I'm not ready to talk because every time I talk and I don't get the response I want I regret it and feel like I'm giving away a piece of my soul. I can't help thinking about the therapist and the people I've confided in, even in a moment of desperation and how they know something about me that I don't want them to or I didn't want to tell. I wonder if they remember it and it's as important to them as it is to me. Maybe any act of telling is precious because for many years I told no one anything. I still feel like confiding in someone who doesn't understand takes my soul away. I look back in regret in this person who has a piece of me I can't take back. ",
        "created_utc": 1492338657,
        "upvote_ratio": ""
    },
    {
        "title": "[Question] Wondering about N-friends, and how to move on.",
        "author": "disappear_",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/65nj5i/question_wondering_about_nfriends_and_how_to_move/",
        "text": "I have two exactly two friends.  I have known these two for years; they were the ones I hung out with throughout high school, and they were the ones I sought out in a crowd.  But in the last few years, I have realized that being around them causes more pain than pleasure.  To  everyone who did not know them, they were sweet, quiet students who were misunderstood by their peers.  But in reality they are often quite the opposite.  \n\nFairly recently, I learned about vulnerable narcissism.  After going through some sites, I saw that some of the traits fitted these friends very well.\n\nAlmost every time they talk about other people, they spend it lamenting how stupid or illogical everyone is, or how much they hate humanity.  At least one of them said that she \"pitied humans\".  They never emphasize; in the times I sought them for comfort or advice after a series of extremely traumatic events, they almost always ignored it.  They struggle to understand how situations (or their own behavior) affect people emotionally, and in many cases they consider emotions to be absolutely nonsensical or unnecessary. \n\nI have known one of these friends for quite a few years.  When I made her upset after a small misunderstanding - I didn't sit in a chair beside her - she punished me by ignoring me for the entirety of the day.  She is a perfectionist; she has said that she does not feel that a talent is worth pursuing if she cannot be the one at top.  She mentioned times she wants people to feel that they must \"walk on eggshells\" around her, and that she seeks to manipulate and control people with her mental illness.  She has expressed concern that she does not seem \"sick enough\" to garner other people's attention; years ago, she said that she missed how people talked about how much they envied her body and wanted to starve themselves to look like her.  Throughout high school, she took pictures of me when I was not looking and expressed great pleasure in knowing that I was heavier than her.  On one occasion, she baked a few Christmas treats for a friend and I; much later, she told me that she baked the treats in hope of making that friend heavier.  The second friend has an extremely volatile temper and has been known to snap at people when they cause her distress (and to be absolutely endearing to the people she enjoys).\n\nBoth of these friends also have extremely low thresholds.  Smells, sounds, and sights that do not faze most people drive them to headaches and disgust.  When someone does something that trips these sensitivities, my friends are very prone to judging them harshly. \n\nI do not know if my friends truly qualify as narcissists, but at this point in my life, I wonder if it would be better if I stopped contacting them.  Both of these friends suffer from mental illness and have gone through their own painful circumstances.  But communicating with them has become painful itself - I'm constantly afraid of angering them in some way, and in the times that I do attempt to contact them, it almost goes ignored unless it somehow relates to their interests.  They have lashed and cursed at me, and they have almost never apologized for behavior.  I am tired of creeping on eggshells and apologizing for not being enough; I just don't know how to move on. \n\nIs there any possibility that I am misunderstanding my friends?  Is there a perspective I'm not considering?  I apologize if this is the wrong subreddit to post this sort of thing in.",
        "created_utc": 1492318451,
        "upvote_ratio": ""
    },
    {
        "title": "Hi fellow survivors, this is a good resource for you to learn more as well as cope with your post-narc encounter.",
        "author": "mavericksprout",
        "url": "https://youtu.be/jiDNJeUHG9c",
        "text": "",
        "created_utc": 1492290274,
        "upvote_ratio": ""
    },
    {
        "title": "How do you handle going NC?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/65ftbs/how_do_you_handle_going_nc/",
        "text": "[deleted]",
        "created_utc": 1492210506,
        "upvote_ratio": ""
    },
    {
        "title": "\"Call me when you have a chance today\"",
        "author": "peaches6666",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/65e70z/call_me_when_you_have_a_chance_today/",
        "text": "Does anyone else here flip out when someone writes this to them? At a minimum, I never simply call someone who **tells me** to call them without stating a good reason.\n\nIn this case, it's from my GF, who often acts entitled, and our relationship is on the rocks. She included a heart after the text: \"Call me when you have a chance today [heart]\". \n\nWhat's a good reply that preserves my dignity and boundaries but doesn't escalate this into an argument? (A little verbo judo, if you will.)\n\nEDIT: For anyone who's confused why this is rude behavior: it sets up a dominant/subservient relationship. Pretty much only bad bosses get away with this kind of thing. \"Come into my office for a sec., will ya?\" And they do because they can. But out in the real adult-adult world, manipulative people usu. don't get away with giving others orders like this.\n\n**I never do this to anyone, because it's disrespectful.**",
        "created_utc": 1492193721,
        "upvote_ratio": ""
    },
    {
        "title": "Found a month old voicemail from NC'd NSister.",
        "author": "marksolomon32",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/65e0xw/found_a_month_old_voicemail_from_ncd_nsister/",
        "text": "After looking at it tempted to just listen. I mean she's blocked anyways not like it would matter. I decided though that the fact that she decided to try to contact me while NC is not okay and I can't reward that even if she would never know. I've been NC with her since Dec of 2015. I decided to delete it. I will never know what she said, but that's fine. It's not like anything in there would have helped me.",
        "created_utc": 1492192080,
        "upvote_ratio": ""
    },
    {
        "title": "10 Absolute Truths of Narcissists",
        "author": "saphirbleu",
        "url": "https://i.imgur.com/rF3hC7Q.jpg",
        "text": "",
        "created_utc": 1492182867,
        "upvote_ratio": ""
    },
    {
        "title": "Tired of the sting",
        "author": "icicleridge",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/65amta/tired_of_the_sting/",
        "text": "It's been over a year since discard and it all still feels as bad as ever. Why can't I get over it? He was a jerk to us and spent 20 years eroding my self-everything. I should be rejoicing but I just can't, and I will never forgive him for doing this to our kids. God, it's crippling. 😡",
        "created_utc": 1492145288,
        "upvote_ratio": ""
    },
    {
        "title": "Having to grow up fast",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/651vqs/having_to_grow_up_fast/",
        "text": "[deleted]",
        "created_utc": 1492039962,
        "upvote_ratio": ""
    },
    {
        "title": "Is it a good idea to tell her(N) that I know what she is ?",
        "author": "narcissThrewMeAway",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/651imt/is_it_a_good_idea_to_tell_hern_that_i_know_what/",
        "text": "Hello,\n\nI was abused by a narcissit very badly, I'm currently in the discard phase.\n\nI only recently realized (after 5 years...) that she is a narcissist/sociopath due to this list:\n\nhttps://www.psychopathfree.com/articles/30-red-flags-of-manipulative-people.212/\n\nIt hits me like a rock, and I'm still shocked. So I went full blown no contact these last days.\n\nShe sent me an email (since I blocked her on my phone) to tell me this:\n\n\"According to your own choice, goodbye.\" (with a link to a youtube video to trigger some memories...).\n\n\nI really want to respond to her that now I know what she is. She will never use me against her current/ex/future target and what a horrible human being she is. And that she will never again manipulate and abuse me. Also the only solution to fight against narcissist is to have no contact.\n\nI really want to tell her that to have a sense of closure.\nIs this a good idea ?\n \n(Sorry for my english this is not my main language)",
        "created_utc": 1492036151,
        "upvote_ratio": ""
    },
    {
        "title": "Lawyer retained. Divorce is now imminent. This is my plan. I'm sure she already has one of her own. She's been planning life without me for at least 6 years now.",
        "author": "Kinglens311",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/650gmo/lawyer_retained_divorce_is_now_imminent_this_is/?ref=search_posts&amp;utm_source=ifttt",
        "text": "",
        "created_utc": 1492026388,
        "upvote_ratio": ""
    },
    {
        "title": "Lawyer retained. Divorce is now imminent. This is my plan. I'm sure she already has one of her own. She's been planning life without me for at least 6 years now.",
        "author": "dbthrowedaway2",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/650gmo/lawyer_retained_divorce_is_now_imminent_this_is/",
        "text": "I almost died in Christmas of 2012. I had a severe intestinal infection, due to an infected diverticulum in my large colon. It had spread to my bloodstream. We only caught it in the nick of time.\n\nInstead of spending time with me, Nwife chose to \"carry on with Christmas\", because \"the kids need to know that life goes on\"...those were her words. This is just some of the hurt I'm carrying around from her.\n\nShe pulled the \"abuse\" card on me last night in therapy. Turned everything around, and made me out to be the bad guy. Therapist told us to go home, that there is nothing more she can do to help us until we figure out what we want to do.\n\nI've retained my attorney. He's drafting up a separation agreement. I will present it to her. If she contests, I can only hope for the best.\n\nEDIT: changed \"she\" to \"Nwife\"\n\nEDIT2: I say 6 years because I was first hospitalized for my condition in 2011.",
        "created_utc": 1492025997,
        "upvote_ratio": ""
    },
    {
        "title": "Becoming a grandparent with N ex",
        "author": "wathrowaway385",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/64zycq/becoming_a_grandparent_with_n_ex/",
        "text": "Cross-posted to Nrelationships so hope that's okay.\n\nI'm writing for both those who are wondering what might occur when grandbabies arrive or have dealt with it and have commiseration/wisdom to share. Created a separate account because Nstalker/ex knows no bounds.\n\nXN and I divorced over 10 years ago after 10 years of marriage. I didn't figure out he was an N until years after the divorce, but was taught about boundaries during the marriage by a friend and that helped me save myself. I am extremely happily married now and N and his supply do their best to make sure I can't forget them.\n\nMy oldest from that relationship is about to have her first child/my (and N's) first grandchild. She (wisely) moved several states away as soon as she got married to escape the drama. My Ex N and his current supply/wife are obviously gearing up for making this all about them. \n\nMy daughter is relying heavily on me for motherly guidance regarding all things pregnancy and baby. She wants (and I plan) me to come visit for a few days as soon as baby arrives to help her and teach her. I warned her up front that she needed to set boundaries for when her N father would arrive/visit with his Supply. She set up boundaries and they were to come visit a month after baby was born so that daughter  and her hubby would have some recovery and bonding time with baby. \n\nShe's been having some minor signs that might lead to complications/early induction of labor if they get worse. However I advised her to take it easy to take care of baby (not full term yet) and she has slowed down. She wants baby to come when it's ready, not be induced.\n\nWell her Nfather caught wind of her possible issues and decided to book a flight so he and supply can be there the exact day the baby would be early full term. Obviously this is a ploy both to try to get me to react (we are VLC and have been for years) and to be \"first\" (because isn't everything in life a competition to N's?). Essentially, they are HOPING the baby comes early and plotting for that. That is not what daughter wants and not in the best interest of her or baby's health as things stand now. Sick, huh?\n\nDaughter told her Nfather that she planned on just she and hubby in delivery room (evidently she realized he'd try to barge in) if for some reason she went into labor when they are visiting. She also said they are NOT staying longer than their scheduled weekend and that they can come back later to visit. \n\nI told her she needed a birth plan and needed to distribute copies to everyone involved, from doctor to nurses. That way, when it says who is allowed in delivery and recovery rooms, they will enforce it and act as bodyguards to keep Nfather out. Can you imagine being a young adult woman having to worry about your Nfather barging in during your most exposed moment in your life up to that point? Poor kid.\n\nI have a close friend who lives near daughter, so when I go to help after baby is born, I have already set up a safe escape plan for myself. While daughter tried to contain Nfather and supply to coming a month after the birth, I don't count on it (he's never seen a boundary he could resist crossing). Friend has agreed to provide me with transportation and a bed to sleep in so I have a place to escape to at all times if crap hits the fan. \n\nI know this is just the beginning of Nex's and supply's efforts to try to rattle my cage and make everything about the grandbaby (who give the most gifts! who gets the most time with baby! Who the baby looks most like! etc.). I'm not going to react.\n\nAny comments/suggestions on what to expect next? I'm glad I have you all to remind me I'm not alone. Thanks for listening.",
        "created_utc": 1492021184,
        "upvote_ratio": ""
    },
    {
        "title": "I need a new reason to live. I used to live for the sake of overcoming the hardships set in my way by the narc, but now that it's done...? What next?",
        "author": "Felour",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/64vpii/i_need_a_new_reason_to_live_i_used_to_live_for/",
        "text": "Good evening. Now, don't worry, I'm not suicidal. I don't have a reason to die, either.\n\nBut, overcoming the barriers in my mind setup by my narcissistic mother was the only thing I lived for these past ten years. To live as I am, and be true to myself...\n\nBut now, I overcame this. I don't have any doubts, any doubts I have were dealt with upon discussing with an acquaintance who told me what things were like from an outsider's perspective (who couldn't do anything for multiple reasons).\n\nSo yeah. I feel empty. I'm not sure what I could do next. All my life I spent fighting against a narcississt, and then once she was gone, against the crap she put in my head. But now that it's dealt with, I lack motivation. My motivation was to overcome the struggles and make a life for myself... but now I've reached that goal.\n\nI keep having this feeling of dread.\n\nAnd with this... I see my father age, I see myself age, I regret the time stolen by my mother as a teenager I couldn't spend like I would have liked to, I regret the years lost trying to solve the issues.\n\nI'm turning 28 in a month and a half. 28 fucking eight. And I realize death may be just around the corner. Time flied! It's gonna be fast and I'm gonna be 56!  Then it's gonna fly even faster and I'm going to be 112! Most likely cremated before then. And what about all those terrorist acts, shootings, idiots driving under the influence... You can die by someone's will or stupidity.\n\nAnd dying means losing consciousness forever. To me, that's unacceptable. Consciousness is the best thing ever. To stop seeing this world, to just vanish.... I can't fathom it and I fear it a lot!\n\nThe things I want now... I would like to have a girlfriend. Forgot to fall in love these last few years. To travel. To finish up learning one or two more languages.\n\nBut... I feel unmotivated. I feel old. I feel society expects you to work, work work, and until you're 50 and old and then you hope for a few years of enjoyment, but you're not a kid anymore and doing it as a kid would be much better.\n\nAnyways, I'm not standing still doing crap and wallowing. I'm forcing myself to work on things that take little energy, like programming a game with my uncle. At least, helping him realize a vision he's had for a long time before he dies, I'll have done something worthwhile.\n",
        "created_utc": 1491966758,
        "upvote_ratio": ""
    },
    {
        "title": "Therapist won't see us any longer, after tonight.",
        "author": "dbthrowedaway2",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/64vcio/therapist_wont_see_us_any_longer_after_tonight/",
        "text": "Well this was our last session. I cried my eyes out. I stood up for myself, defended myself, maybe a little too much. Regardless, the therapist said she won't meet with us again until we decide what to do.\n\nOur sessions go nowhere because I refuse to play Nwife's game, and just let her walk all over me.\n\nNwife tried to bring up how afraid of me the children are, because I yell \"all the time\". I then said that I disagreed, and that I believe she's been really good at parental alienation with the kids. I then say how they give me a different answer when I talk to them.\n\nAnyway. I'm retaining the attorney tomorrow. I'm filing for divorce. I'm done. Completely and utterly done. I tried my best to fix this sinking ship. I refuse to continue to be in a relationship like this, and I refuse to perpetuate this crap to my kids.\n\nNwife has decided, without telling me of course, that all of the children will be sleeping downstairs with her, instead of in their beds, like they are supposed to. I can't wait to be free of this mess.",
        "created_utc": 1491962360,
        "upvote_ratio": ""
    },
    {
        "title": "Therapist called. I guess we do have an appt tonight after all. Now my stomach is in knots.",
        "author": "dbthrowedaway2",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/64stxs/therapist_called_i_guess_we_do_have_an_appt/",
        "text": "I can't wait for this feeling to go away. The feeling of \"what am I going to get hit with tonight.\" or \"what am I going to be accused of tonight\"...I realize that's all just my fear, but as many have said, couples therapy with a narcissist spouse is a joke.",
        "created_utc": 1491936517,
        "upvote_ratio": ""
    },
    {
        "title": "Do you attend important family events if you know your N will be there?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/64s8kd/do_you_attend_important_family_events_if_you_know/",
        "text": "[deleted]",
        "created_utc": 1491931241,
        "upvote_ratio": ""
    },
    {
        "title": "Remember Nex picking fights w me over the microwave oven",
        "author": "mavericksprout",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/64qvck/remember_nex_picking_fights_w_me_over_the/",
        "text": "We'd be at his studio and I'd open the microwave before the timer was up and he'd reprimand (I use this word because that's the tone and vibe he had) me for opening it without setting the timer to 0 first and opening it in the middle of the..rotation? \nFunny thing is it only started a few months in, by which time I probably has been doing so for a while. The first time, I said but it's fine I do it at home too. And I think this was the moment he set his easy pickings up for future arguments just to fuck w me, he lectured about how the radiation bla blah explode bla bla. Is this true guys?! \n\nAnyway, assuming it's not true, because shit hasn't exploded on me before. The arguments about the fucking microwave escalated in severity and his anger just boiled harder and harder with each successive episode till I was literally pavlov trained to think before I opened the microwave.\n\nScary shit isn't it.. the conditioning that they know they're executing so flawlessly. Fucked me over for a good few months. And now I open the microwave when and how I want to. #smallwins FUCK YOU ASSHOLE ",
        "created_utc": 1491918055,
        "upvote_ratio": ""
    },
    {
        "title": "our couples therapist has now cancelled our appointments twice...maybe I need to take the hint.",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/64qn2s/our_couples_therapist_has_now_cancelled_our/",
        "text": "[deleted]",
        "created_utc": 1491915390,
        "upvote_ratio": ""
    },
    {
        "title": "[Progress] I got a decent therapist",
        "author": "throwaway9347n33t",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/64pxju/progress_i_got_a_decent_therapist/",
        "text": "Some of you may have read my posts on here. I'm not proud of them. I wanted to say that I've gotten some decent help in the form of a therapist. She asked if I had an online support network for child abuse, and when I said yes she encouraged me to keep it up. \n\nI found her by calling back the program that I saw the not-good therapist with, asking to see one of their counsellors instead of a psychologist, and explaining that the other one was not a good fit. They were really understanding and got back to me right away with a counsellor, who's a psychotherapist, and they waived the fee on a sliding scale. \n\nToday was my first session. She's asked no questions about NC, and agreed to help me escape if that's where my heart is. \n\nI'm optimistic for the first time in a long while, and also a little scared. It's been a long time since I've spoken emotionally with anyone (a theme we've acknowledged) and engaging with a therapist like this is new. I'm hoping to learn to engage emotionally in a non-threatening way, so leaving and joining the 'real-world' to have relationships doesn't feel like drowning in an ocean and I won't resort to crawling back to shore (my toxic family), begging for help and in the same situation over and over again. Will keep you posted, but hopefully the support will mean I won't risk triggering you with upsetting posts (I'm really sorry if I've ever done that). \n\nI'm sorry for being so negative on this sub. The isolation and lack of support has probably gotten the better of me and made me angrier than I'd like to admit. ",
        "created_utc": 1491905144,
        "upvote_ratio": ""
    },
    {
        "title": "He revelled in watching suffering",
        "author": "mavericksprout",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/64p17u/he_revelled_in_watching_suffering/",
        "text": "We were on an amusement ride (the high drop kind) I hate adrenaline junkie type stuff but wanted to be all outgoing and shit \"up for anything\", screaming my head off w legit fear on my face, and he was just looking at me calmly. Later when he recanted the story to our (his) friends, he said he was just looking at my face screaming the whole time and it was just so funny. I nervously laughed along cuz isn't that shit weird?? But the smoothness he told the story, it just came off as funny.\n\nAlso he said he wanted to show me a hilarious video, and it was of a black man crying, like loud breaking down bawling crying - you can feel the emotion. (Can't rmb exactly, it was a YouTube vid where he was told the truth about something heartbreaking and he lost it). I watched it and I just looked at it, I was expecting to laugh and waiting for the trigger but like there's was absolutely nothing funny about raw emotion. Then I thought/rationalised he was testing me to see if I'd laugh at something cruel, because his family are religious (peaceful) and I was really drawn to the spirituality, maybe he was just testing me. Idk if he was, maybe? Either way it was cruel, but if he genuinely thought someone else's heartbreak was amusing- which I strongly feel was the case, then holy fucking shit, what kind a cold blooded Monster is that????? ",
        "created_utc": 1491889462,
        "upvote_ratio": ""
    },
    {
        "title": "Dealing with jealousy",
        "author": "clutch_purse",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/64nd8g/dealing_with_jealousy/",
        "text": "Or is it envy. I forget the difference.\n\nSpecifically I find I feel high levels of jealousy for women who have/had close relationships with their mom. And also whose mom's are/were good moms. Moms who encouraged them, supported them, made them feel loved, made them feel important, etc.\n\nDo other CoN's suffer from strong jealousy? For me it can sweep me away like a stormy wind, can't be present, can't focus on anything else. Sometimes the girl/woman will seem to flaunt it too, you know? Like she can see that I'm a shattered human who never really had anyone to care for her, and she's like, \"Hmmmph, glad I never had a sucky life like that....\"\n\nHow to deal with jealousy. I see now that it makes me isolate myself.  ",
        "created_utc": 1491868800,
        "upvote_ratio": ""
    },
    {
        "title": "can't wait to get the kids and I out of this hell hole.",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/64gyjb/cant_wait_to_get_the_kids_and_i_out_of_this_hell/",
        "text": "[deleted]",
        "created_utc": 1491790675,
        "upvote_ratio": ""
    },
    {
        "title": "something better than nothing",
        "author": "luuurrrch",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/64ebm2/something_better_than_nothing/",
        "text": "Hi and sorry if this is the wrong sub to post, but after reading so many of the posts here it feels like the right place as I am Edad and am struggling.\n\nI've been in a 20++ year marriage with a Narc.  Three children, two boys (~18) and an accidental girl (~6) whom completely I adore.  As the boys have gotten older, being an enabling-dad has become increasingly counterproductive and damaging to our relationship.  About 18 months ago I came to the realization that my relationship with my sons is more important than the fallout from \"disturbing the piece\".   I was in bad shape at the time; very dark thoughts, etc. and decided it was time to get away and fix the \"me part\" of the problem.  I took a job in a different timezone to heal and try to come up with a course of action.  This, of course, helped with a strategy of limiting contact.  (can't thank Reddit and this sub in particular enough for the enlightenment)\n\nAfter a year and a couple moths of \"just keep swimming, just keep swimming\" I am much better off.  I feel happy some of the time (didn't think that was possible); am thinking more clearly, and have started the divorce process. My plan is to be away for another year and let the divorce dust settle, then move back home.  I also see first hand how limited contact works.  It takes time to work, but it is a very effective tactic. It doesn't feel like a solid long-term strategy though.  It is this aspect of LC for which I have three areas I could really use help and ideas on:  \n\n1. Narc wife is using LC to impact interaction with my daughter (she knows it hurts). It went from facetime for breakfast a couple times a week to nothing and it's killing me.  I'm not making an issue out of it as I know that's the bait for the trap.  I try and cope by sending packages with fun things to her at least once a week so she knows I'm thinking about her.  I get no response, I feel like I'm abandoning her by not fighting over it.  In the end, I know the fight will only make it worse.  My fear is that the relationship with my daughter is being poisoned.  Rationalizing that I have no other option feels like a copout.  Any ideas on how to cope with this, or strategies/tactics for increasing the interaction?\n\n2. LC/NC clearly works as a tactic.  It's as if the Narc brain can't compute that there's just not a reaction to BS at volume 11.  It doesn't feel like it's helping her though, more like it's given me a BS shield I can throw up that makes it go away.  As completely wonderful as that is (and it is wonderful).  I don't think it's helping her much.  I know it sounds crazy, but now that I have \"my own oxygen mask on\", I am thinking about helping those around me.  ...\"Hey Honey, you really ought to see someone about that nasty narcissism problem you've got there.\" is probably not going to get the results I'm after.  Any ideas on how I can dovetail LC into something more constructive?\n\n3. Should I discuss this with the man-boys?  It's bad enough they have to live with the past and present.  I'm concerned that addressing this directly will be like trash talking their mother.  Regardless of whether she deserves it or not, no-one wants to hear that kind of thing, especially from their dad, about their mom.\n\nAnyone?  Anyone?  Bueller?  ",
        "created_utc": 1491760063,
        "upvote_ratio": ""
    },
    {
        "title": "Attending a formal event dateless and having to sit at the same table as ExN and new gf/fiancé",
        "author": "Codependentte",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/64a7kn/attending_a_formal_event_dateless_and_having_to/",
        "text": "So, title says it all.*\n\nLeaving in an hour. \n\nThought I'd post here just to show that N's just keep showing up. \n\n*Backstory has to do with charity I'm committed to, N got himself onto the leadership team, I was going to resign, but the chair talked me into staying for a year. I'm totally \"meh\" about N, but no contact with him, even in person. New gf apparently is cluster b, they are now engaged, and he's been hoovering me, on and on. I'm just trying to stay away from the both of them, don't want to get dragged onto the drama.",
        "created_utc": 1491695598,
        "upvote_ratio": ""
    },
    {
        "title": "Reading these articles made me feel like I am understood.",
        "author": "brokenkidofheart",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/649nrw/reading_these_articles_made_me_feel_like_i_am/",
        "text": "Particularly these two articles, (same name, different article)\n\nThe confession of a recovering narcissist:\nhttp://www.dowlingwriter.com/confessions-of-a-recovering-narcissist/\n\nConfessions of a Recovering Narcissist \nhttps://goodmenproject.com/featured-content/hesaid-confessions-of-a-recovering-narcissist/\n\nI want to know what do you think about this? You know, I almost feel eerily 'understood' by this article. (which is shameful)\n\nIf I were a narcissist, then, ~~I want to change at this point. I want to become a different person. I want to be in a different stage of life. I want to see myself shine in light.~~ I want to be burnt and reborn.\n\nDo you feel this article describes you? (serious question)",
        "created_utc": 1491688776,
        "upvote_ratio": ""
    },
    {
        "title": "What do you do when you need mom?",
        "author": "ShojiAn",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/649jkm/what_do_you_do_when_you_need_mom/",
        "text": "Recently I was in a state when I needed to talk to mom-person. I have, kind of, mom-person in my life but she lives in a different country and talking over the phone wasn't something I needed. I can't talk to my beloved mother because I am NC with for over a year and I don't think I would survive meeting her.",
        "created_utc": 1491687398,
        "upvote_ratio": ""
    },
    {
        "title": "Nwife picked a fight today over the car seat.",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/648m56/nwife_picked_a_fight_today_over_the_car_seat/",
        "text": "[deleted]",
        "created_utc": 1491676737,
        "upvote_ratio": ""
    },
    {
        "title": "Feel like I've forgotten how to care for myself, where do I even start?",
        "author": "applefae",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/6483bs/feel_like_ive_forgotten_how_to_care_for_myself/",
        "text": "I haven't posted my full story on Reddit just yet, I don't feel quite ready for it. I'm just under a month out of a relationship with a man who seems to be a narcissist. We were together for about 2.75 years, we lived together, the first devalue and discard cycle was brutal and unexpected. It revealed a lot about him I never realised and I'm still in shock. \n\nHis lack of empathy and compassion, his lies and abuse, the manipulation, his ulterior motives, cheating - it all seemed to come completely out of the blue. I scrambled to hold onto the relationship and the person I thought he was (I was really crazy in love with him) but eventually it was so toxic it had to end, I was a mess and he was no longer getting much use from me. \n\nI'm in therapy every two weeks, so I have that support. I also come read this and other subs a lot to see how others do it. I'm finding it hard to read books, but I have some lined up on recovering from abuse, self esteem, broken heartedness. I have some good family members to talk to about all this stuff, so I have people for support on my life which I'm grateful for. \n\nI think what I really want to ask about is how to start to take care of myself again. I feel so completely overwhelmed that I don't know where to start. I feel like I need instructions laid out for me daily that I can follow. \n\nI need to stress that this is not like me *at all*, I'm usually so good at self care and I've worked before in therapy  with things like CBT. I've read countless books, I'm usually so prepared and good at dealing with stress and anxiety. But this is different, this is crushing me. \n\nI'm eating a lot of bad food because it's one of the only things that makes me feel good. I go to work and then go to bed almost straight away when I get home in the evening. I cannot get organised, I can't remember or decide on things. I'm terrible at my job. My todo list is piling up. \n\nI find it hard to remember or have the will to do basic things like brush my teeth or take my pills. Drink water. Have a shower. \n\nWhen I go to try and organise myself I feel so utterly overwhelmed that even writing lists is hard. If I go into a supermarket to buy food I feel so stressed that I can't think straight. I hate being around people, I don't want them to notice me and of course in a busy city it's hard to avoid people. \n\nHow can I resolve this? I've never ever felt like this before, and I've already been through a divorce and survived that. \n\nI miss the man I thought he was so badly. Everywhere I go I see reminders of him and me when times were good. I live in our old home with our cat, he's moved out away from me now. I hate feeling like this about someone who treated me so badly, but it's how I feel and I can't deny it. \n\nI know there are others here who will have felt like this. How did you pull through? What helped? Where did you start? I can barely find the will to write this Reddit post, how can I find it to do basic self care every day again? ",
        "created_utc": 1491671051,
        "upvote_ratio": ""
    },
    {
        "title": "My post-NC relaxed-pace life feels uncomfortable after years of constant busywork.",
        "author": "MaxIrena",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/6456v0/my_postnc_relaxedpace_life_feels_uncomfortable/",
        "text": "I went NC about 20 months ago. I grew up in a family where everyone was always rushing around, keeping busy, running errands, working hard, it was just go-go-go all the time. Just a lot of busywork without actually accomplishing anything. \n\nNo one ever sat still or relaxed. I think my covertNmom kept herself busy so she wouldn't have to stop and think and face reality.\n\nFor the first few months after going NC, I continued life as normal. Then I took some time off work and it hit me that this frantic-pace lifestyle I had known just wasn't for me.\n\nFor the next year, I did nothing. Just absolutely nothing, except play games on my phone. \n\nPart of me was worried that this \"lack of interest in activities I used to enjoy\" was a sign of depression. Another part of me started questioning what activities I actually enjoy. \n\nI realized that a lot of my previous hobbies and interests don't actually interest me, they were just ways to keep busy. We were never allowed to play video games or anything \"lazy\" like that, so I never had the opportunity to discover that I like games.\n\nI feel like I haven't really moved forward with life after going NC, but I'm not really sure how. I laze around until I get worried about myself, then I have brief periods where I'm really active (trying new hobbies, going on outings, etc) until I realize I've slipped back into that pattern of being busy just for the sake of being busy. \n\nI feel lost without clear goals and tasks to do, but I think this is only because being busy meant being productive and now I don't think that way anymore. Even navigating my relationships with the Ns and plotting my escape kept me busy.\n\nAfter being told what to do my whole life, I guess freedom and a relaxed-pace life feels unsettling. \n\nHow do I find some balance here?\n\ntl;dr : I don't know how to relax because relaxing was never allowed before NC.",
        "created_utc": 1491624652,
        "upvote_ratio": ""
    },
    {
        "title": "I dissociate in public, any way to help?",
        "author": "rbnthrowmefaraway",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/644qmi/i_dissociate_in_public_any_way_to_help/",
        "text": "I've come to the realization that I still completely dissociate in public. I'm actually pretty fine at home and work, nowadays.\n\nBut, BAM, if I go out in public for any period of time longer than about 20 minutes, that familiar faded feeling comes back. I almost feel like I'm a ghost, or in a dream, or underwater. There is some part of me that's okay with feeling like this for a short period of time, because it reminds me of how far I've come, because I used to feel like that *all* the time, not just when I'm out in public.\n\nStill, though, I'd like it to stop. I don't think simple exposure is going to help. Lately, I've been trying hard to get clothes together that are appropriate in terms of my age and where I'm wearing them, and this has required me to go to malls and big department stores, and it doesn't seem to be getting any better. At some point, it's like my brain has completely shut down and I can barely even see anymore, everything just feels like it's through a foggy, distorted filter, if that makes any sense...\n\nAny advice?",
        "created_utc": 1491618156,
        "upvote_ratio": ""
    },
    {
        "title": "Next of kin for Nmom",
        "author": "shera85",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/643g5b/next_of_kin_for_nmom/",
        "text": "So, quick snapshot: I have an Nmom, slimy enabler step dad, no siblings, but several cousins who are GC to my scapegoat (children of Nmom's Nsister). I'm super low contact with all of them, but so far haven't gone NC. \n\nI was thinking the other day, I could still be the next of kin for Nmom. Now, if step dad is still around he'd likely be in charge of the funeral arrangements. However, he cheats like crazy and it's within the realm of possibility that he might be on one of his 6 month hiatuses when she dies. Also if he goes first I'd be in the same position.\n\nIn the past I've worried about being obligated to take on their financial debt after they go, but it seems that's not a legal obligation. So, yay. I'd likely *go* to the funeral, but jesus I have no interest in organizing a memorial of how great she was, let alone paying for it. However, if a hospital has a body and I'm listed as the next of kin, what are my options (legally, socially, and emotionally)?\n\nAny input appreciated. Thanks. ",
        "created_utc": 1491602336,
        "upvote_ratio": ""
    },
    {
        "title": "Looking for some insight.",
        "author": "78Fearmont",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/642wcc/looking_for_some_insight/",
        "text": "I left an N spouse last July 4th. We are in what I beleave to be the home stretch of the divorce....\nI have met someone new and I am worried about what kind of reactions I might need to prepare for. \n\nLittle background. N and I were married 17 years. I have been in NC since the end of July... (communication though lawyers is awful) Anyway, she moved on to the guy she had on the side... But the children, my step son 22 and daughter 20 (only using word step for the interest of clarity. They are my children) they have pretty well distanced themselves from her because of this. \n\nI have not considered introductions,  between kids and my new friend or anything.  Nobody is ready for that. But when the time comes, I will probably be back with more questions about that too.\n\nI haven't noticed any attempted hoovering,  but I also don't post this kind of a question on my regular account either\n \nShe is blocked by all other forms of contact, but I'm sure she has kept some tabs on me. She has a very distinct car, and I have happened to see it a couple times. Too many for the size of our town, in my opinion.\n\nSo, can you help me reddit?\n",
        "created_utc": 1491596595,
        "upvote_ratio": ""
    },
    {
        "title": "Another goal completed",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/642rcj/another_goal_completed/",
        "text": "[deleted]",
        "created_utc": 1491595219,
        "upvote_ratio": ""
    },
    {
        "title": "Ive gone NC and I have a feeling my Ngrandma told everyone she knew on my dad's side of the family. The blue is me letting the family know I wont be able to go their family reunion/get together in Mexio. See how everyone just kinda skips over me??? Guess you guys are on my NC list too!",
        "author": "[deleted]",
        "url": "https://i.redd.it/6xsadz7kv2qy.jpg",
        "text": "[deleted]",
        "created_utc": 1491547691,
        "upvote_ratio": ""
    },
    {
        "title": "I just had a flashback",
        "author": "mavericksprout",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/63yawj/i_just_had_a_flashback/",
        "text": "To when we were on a short trip with (his) friends at an airbnb and everyone was playing a multiplayer computer game at the dining table, and I was the only one without a laptop and was standing around awkwardly walking in an out of the room when one of the friends said he should let me play. To keep up with his nice guy facade he had to give in, but not for Long. It was ten minutes into the game that I had no clue how to work (and it had been a thing they've been doing tgt as an activity for a few weeks) and he just physically took over and pushed me out. \n\nSubsequently, I brought it up - that you don't want me to hang out with your friends, and you're keeping me around them but not letting me mix w them even tho I'm there. And all he said was \"yea I don't want you to mix with my friends\" and a look that said \"so what\". To which I gave in w my tail between my legs.\n\nLater on, he even said he discussed this w one of the guys who totally agreed. (Getting a flying monkey to back him up so he has even more legitimacy to the ridiculousness) \n\nI was so so confused at the time, that anyone could say that, and that if another person could agree then I must be thinking wrong.\n\nNow I'm looking at the whole charade and it looks like such a joke. Child's play - when you were kids and in a circular argument, just get a Friend to agree and say \"well  so-and-so agrees w me so that makes me right\". Child's play but much more sinister.\n\nThe whole thing was a lie, and his whole life was living lie after Lie!! \n\nEven though it was a tough lesson that's made me hella Lot more aware of asshole behaviour I can't help but feel sad about the girl who had to put up with all of it, and feeling quite a bit sorry for myself 😢. Sigh",
        "created_utc": 1491539612,
        "upvote_ratio": ""
    },
    {
        "title": "No one's ever cared about me in my life",
        "author": "throwaway9347n33t",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/63x1vf/no_ones_ever_cared_about_me_in_my_life/",
        "text": "And I'm angry about it. ",
        "created_utc": 1491525238,
        "upvote_ratio": ""
    },
    {
        "title": "Progress: not seeking positive attention/validation from Ns anymore",
        "author": "spaghettiwhoas",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/63w3vm/progress_not_seeking_positive_attentionvalidation/",
        "text": "A lil background: I've been NC with my entire family about over a year now. I wish I could say it has been all uphill from here and great and piles of healing, but this is not true. I lost a job when it ended last year and wound up homeless in a shelter and in my car (if this sounds familiar yes I used to post here, but left Reddit for a while). I'm still at that point. I tried renting a room here and there, but there are very few and these were people renting illegally and therefore also not caring to treat who they were renting to with any respect. I'm fearful that I won't ever get out of this hole, and because it's SO expensive where I live, I HAVE to leave and am following a temporary job that I don't even want to do, yet again, while job searching for something more permanent who-knows-where.\n\nAnyway, I had a 'friend' through my major hobby for a short while. Around the time I went NC, she started being subtly but increasingly verbally and emotionally abusive in EXACTLY the same way my Nmother was to me! When I went off to that job I lost I just didn't have time to talk to her for those months. \n\nWhen I lost that job, she claimed she would help me out if I came back to the area. I came back to find out she lied and had zero interest in what she said, leaving me homeless. I called her out on it over Facebook messenger and she got all heated and told me it's my fault because I never asked her for help, despite that she had repeatedly OFFERED until I got back. I unfriended her and never talked to her again in any other realm and fortunately, never ran into her through the hobby. \n\nI never actually blocked her and am quite aware of how Facebook works. She is mutual friends with a lot of people I still talk to regularly through that hobby. So certainly she sees when they like and comment on my things. And through all my mess over the past year I have seen a pattern of where she'll contact me out of the seeming blue, but it isn't. It has been only after something good has happened to me and friends remarked on it - finding a room to rent again, for example. \n\nI'm getting ready for and leaving for that temporary job. It LOOKS positive on Facebook, but I'm actually devastated in some ways - I'm leaving a job I love but it never paid enough, I'm leaving coworkers I love, I no longer want to work in the 'career' path this temporary job is in at all, I wish to find a steady job, etc...it's just high anxiety and despair for me right now. But it looks good on Facebook. Today she emailed me saying, \"Hey! Long time no see, how are you?\" as if she has never caused me major issues, never betrayed and lied to me, never treated me like everything is my fault, all because she wants to soak up the rays of something seemingly good happening in my life, so she can cut me down again when I struggle with whatever. \n\nIn the past I would have responded almost immediately in a happy, positive way, not seeing this for what it is. But homelessness and just watching how people really are and being treated pretty badly through struggling with homelessness has completely destroyed my desire and need for approval from anybody else. I am not desperate for validation from her anymore! I IMMEDIATELY recognized it as a power play, a need for N supply in a way, and a fairweather person. \n\nDespite feeling so badly about a lot of the big things, this to me is wonderful progress. ",
        "created_utc": 1491515312,
        "upvote_ratio": ""
    },
    {
        "title": "Daughter crying because she has to go back with her Nmother",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/63vjim/daughter_crying_because_she_has_to_go_back_with/",
        "text": "[deleted]",
        "created_utc": 1491509948,
        "upvote_ratio": ""
    },
    {
        "title": "MUST READ awesome article about estranged parents!",
        "author": "steelyeye",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/63udea/must_read_awesome_article_about_estranged_parents/",
        "text": "Absolutely LOVED THIS and felt SO validated by it. A++!\n\nhttp://www.issendai.com/psychology/estrangement/missing-missing-reasons.html",
        "created_utc": 1491499265,
        "upvote_ratio": ""
    },
    {
        "title": "Today I had a panic attack after correcting a lot of damage from the breakdown that my NP caused.",
        "author": "saddetective87",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/63rtm3/today_i_had_a_panic_attack_after_correcting_a_lot/",
        "text": "I took a massive step forward today by correcting a lot of financial damage that my NP caused me, and later I had a panic attack. These new parts of control of my life and my emerging personality and assertiveness is scaring the shit out of me, so does some other growing personal successes.\n",
        "created_utc": 1491469936,
        "upvote_ratio": ""
    },
    {
        "title": "Today I had a panic attack after correcting a lot of damage from the breakdown that my caused NP.",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/63rtbf/today_i_had_a_panic_attack_after_correcting_a_lot/",
        "text": "[deleted]",
        "created_utc": 1491469771,
        "upvote_ratio": ""
    },
    {
        "title": "Remembering catching N Mom smearing me to a neighbor",
        "author": "Codependentte",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/63r6ee/remembering_catching_n_mom_smearing_me_to_a/",
        "text": "Did anyone ever catch a smear in the wild? Did the N retract it? What was the N's true goal?\n\nThese memories pop-up, and now I'm analyzing them from the narc p.o.v.\n\nThe smear I overheard from N-mom:  Codependentte is ashamed of her father, so she took down his photos.\n\nNope. I put them away in special archival storage binders, acid-free, etc. Because photos of my father are important to me. \n\nN-mom just shook her head and walked away. \n\nNo, \"oh good, glad you did that.\" No \" really, can you make copies?\" That's what normal people would say, if they were concerned about the photos.\n\nNope. The photos were irrelevant. \n\nHer problem to be solved was how to prevent the neighbors from knowing what she was really like. My low contact, pretty much staying away from her, was making her look bad.\n\nHer solution was to make me look like a bad daughter.",
        "created_utc": 1491458406,
        "upvote_ratio": ""
    },
    {
        "title": "Nice little victory over Nex in court",
        "author": "steelyeye",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/63q20g/nice_little_victory_over_nex_in_court/",
        "text": "He had dodged service yet again, and at the hearing today he claimed he \"never got\" papers, even though I sent them to two of his known addresses. Sigh, we'll have to reset a third time to get him served properly.  Fine, whatever.\n\nBut then he launches into something he \"was really hoping to get settled today\".  Ah, no, the judge says, pretty skeptically if you ask me, \"we're *resetting* the hearing because you didn't receive anything. Right?\" Yes, he says, but it's not my fault I didn't get served so can't you just do this one thing for me pleeeease bc I'm on a deadline!\" \n\nJudge: \"Ah, no. If you're sure you didn't receive anything, we can't address your thing today either. Sorry.\n\nAlso, if you plan to ask me for something at the next hearing, make sure you're in total compliance in the interim. See you in two months.\"\n\nAnd the piece de resistance: he sounded genuinely upset. That makes me happy.  SHOULDA ADMITTED YOU GOT THOSE PAPERS, HUH BOSS?? :)",
        "created_utc": 1491443632,
        "upvote_ratio": ""
    },
    {
        "title": "Getting closer to the end.",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/63pc8c/getting_closer_to_the_end/",
        "text": "[deleted]",
        "created_utc": 1491435724,
        "upvote_ratio": ""
    },
    {
        "title": "How do I learn to trust people (including myself)?",
        "author": "psychoknotted",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/63ou9u/how_do_i_learn_to_trust_people_including_myself/",
        "text": "Going over the details of my childhood is exhausting so I'll just say my dad was such a narcissist that when he started nursing school he proudly declared himself as such to me. He was also pretty abusive. I left the house at 17 and at 23 I feel like I'm still uncovering ways my feelings and behavior have been shaped like this.\n\nOne thing I really want to fix is the lack of trust I have toward anybody, even people who I literally have no objective reason to not trust. I'm ruining all kinds of personal relationships because I panic when I want to open up to others; I don't really know how to do that since everything from what I wanted to wear to reading choices (dad banned all fantasy books, then books related to history, and so on all the way to bibles because they were \"keeping me from reality\") to friends got policed. Even after all this time I don't feel comfortable even talking about what I like since it was always used against me. \n\nI can go on and on but I hope that paints some kind of picture. I can recognize that I don't have to live in my mental walls but when I'm around people all that flies out the window. Is there anything I can do to train myself out of this? I'd love to see a therapist but I don't have the money for it.",
        "created_utc": 1491430350,
        "upvote_ratio": ""
    },
    {
        "title": "0",
        "author": "wzyg0513",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/63kawv/0/",
        "text": "[removed]",
        "created_utc": 1491381033,
        "upvote_ratio": ""
    },
    {
        "title": "Petrified",
        "author": "jeckylln",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/63k5op/petrified/",
        "text": "So having finally seen behind the mask of my now Nex... and realising that these people exist and how close I was to being sucked in and how vulnerable I still am to other unmasked Ns, I now just feel absolutely petrified. I feel unsafe. I feel super scared. Is this normal? How can I move past this?",
        "created_utc": 1491378350,
        "upvote_ratio": ""
    },
    {
        "title": "Have any of you even been contacted for support by the \"New Supply\" that replaced you once the N has discarded the \"New Supply\"?",
        "author": "clown-penisdotfart",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/63jiyf/have_any_of_you_even_been_contacted_for_support/",
        "text": "I'm trying to mentally prep myself in case New Supply guy ever reaches out to me to understand what truck just ran him over at some point in the future. If this happens, would it be a good thing or a bad thing to offer support?",
        "created_utc": 1491368108,
        "upvote_ratio": ""
    },
    {
        "title": "For those of you who tried confronting the the compulsive lying of your N's",
        "author": "Nerdalist",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/63ikm0/for_those_of_you_who_tried_confronting_the_the/",
        "text": "Hi, I'm very new to this after very casually dating someone I suspect is an N for only a few months, but despite the short exposure feeling like I emerged from an emotional spin cycle set to maximum speed. (I posted a long story about my suspected N [here](https://www.reddit.com/r/NRelationships/comments/63caa5/only_3_months_spent_seeing_a_suspected_n_but/))\n\n\nI feel pretty good about going no contact, but the final burning question I would have for this guy if I were to ever need to speak to him again would be about his compulsive lying. I've read the distinction between compulsive and pathological lying, and felt he switched between the two to suit the conversation we were having - he lied with cat-like reflex to uphold his social positioning and value if he felt those were being doubted or questioned, and he lied with elaborate, detailed and dramatic excuses for bad behavior or to explain a flaw and elicit sympathy. \n\n\nThe most dumbfounding thing to me about his lies was that he told me things that he KNEW I was one conversation or text message away from confirming through a mutual friend. \n\n\nSince I'm never planning on talking to my N again, I'm wondering if any of you ever confronted your N about the compulsive lying and what their reaction was - did they ever admit to it, or just fly into a rage? What happened when you presented cold, hard evidence of their lie?",
        "created_utc": 1491356242,
        "upvote_ratio": ""
    },
    {
        "title": "Trying to Break Free &amp; Dealing with Emotions",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/63i931/trying_to_break_free_dealing_with_emotions/",
        "text": "[deleted]",
        "created_utc": 1491352613,
        "upvote_ratio": ""
    },
    {
        "title": "How easy is it to fall back into narcissistic abuse once the mask is off?",
        "author": "jeckylln",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/63dpsj/how_easy_is_it_to_fall_back_into_narcissistic/",
        "text": "I just had my first run in with an N. Dated a guy for a year and honestly had no clue I was being so conned until a week ago when he slipped up and didn't love bomb me quickly enough during a down period and I managed to step far enough away to truly see what he is. I feel like I was at the theatre watching a show for the last year and suddenly I've seen behind the curtain and realised it was all fake. \n\nIt's been super freeing to realise that, and I now I feel like I'm wearing some special glasses that mean I can see all of N's behaviours for what they really are. However, I'm now super worried that the minute he realises I am not coming back he is either going to try and break me or reel me back in. I'm so petrified of both options.\n\nI was just wondering, now the mask is off, can I still be conned back in? He's already managed to confuse me and guilt me again since the breakup, but I don't know if he also still has the power to hoover me back? Am I safe now that I know, or am I really not?\n\nI can't beleive how stupid I have been to have not seen this before",
        "created_utc": 1491307908,
        "upvote_ratio": ""
    }
]