[
    {
        "title": "Social events with N?",
        "author": "wellnessinwaco",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/5ywma5/social_events_with_n/",
        "text": "My Nmom is being invited to a bunch of weddings that I've been invited to as well. I am currently NC with her and have not ben proactively telling people I am NC. I tell them if they directly ask, but I don't tell people when they invite me to their weddings that I'm not communicating with my mom. Until now, I've just skipped every wedding we were both invited to, but I feel like that's a cop out, because some of these people are my friends. I'm not sure; maybe they're not my friends if they invite her? I don't know how to think through this. I am currently not comfortable talking with her, let alone being in the same room. Please advice. Thanks in advance. ",
        "created_utc": 1489287463,
        "upvote_ratio": ""
    },
    {
        "title": "Vent: Nex's new gf thinks I'm no contact because she won and I'm scorned",
        "author": "Codependentte",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/5yvmgw/vent_nexs_new_gf_thinks_im_no_contact_because_she/",
        "text": "Urgh. A little NSFW.\n\nJust sat through a 2 hour meeting next to the new gf. (This is for a charity/social organization, no work.) Nex#1 won't actually do any work, the gf is there taking notes and keeping his calendar.  \n\nShe thinks I'm angry that she \"won\" him. She has no clue. I'm friendly to her, but not overly so.\n\nNex#1 and new gf are getting married in a few months, and she's floating on air. So happy. \n\nHe knows I know. Nex#1 sat there looking at both of us and getting N supply thinking about how he's fucked both of us. Sometimes in the same day. (Ugh, you know the drill, Nex#1 and his lying liar mcliarface during the devaluation and discard.)\n\nUrgh. I can't even do a TL;DR of the relationship because there's so much awful stuff. The relationship was the first with a blatant textbook remorseless narcopath, and I was spun, even though I wasn't in love at all. Most of the stuff I found out was afterwards, like addictions, suicides, criminal charges, tax fraud, bad credit, sleeping with everyone and anyone, on and on. Seeing this guy is like seeing my rapist. I never consented to being with him. I only consented to being with fake him. I feel like a crime victim, but how can you explain it?\n\nOne more thing:  Hats off to Redditors who helped me  last year, and who predicted that this guy would try to get back in my orbit if I ignored him. Yep. That's what he's doing. ",
        "created_utc": 1489274649,
        "upvote_ratio": ""
    },
    {
        "title": "Triggering housemates",
        "author": "throwaway9347n33t",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/5yscfs/triggering_housemates/",
        "text": "Hi guys-\n\nMy housemates I live with barely acknowledge me and I think it might be re-traumatizing or at least triggering me. I hear them eating, laughing, talking outside my door while I sit in my room and cry and it reminds me of everything I experienced growing up. I've been here a year and they've never asked if I wanted to watch TV with them, and we're friendly - share food sometimes and I helped her a little bit with her business. It just gets to me even though I have no right because I could imagine being them and if I lived with this lonely person for a year (me) I would at least have asked them if they wanted to watch TV. Maybe they're afraid I'll be around too much and because my housemate works from home he doesn't want that. No one cares about me. I'm anxious and angry all the time and I can't afford to move out. This is the cheapest possible place I could get and I barely made rent this month. If I do move, it would have to be with my Nfamily's help because they're the only practical support I have in this city. I can't bring this up to my housemates because they're worried about their business and because I can't move I can't make things awkward. I always feel like I'm encroaching on their space in their own home even though I pay rent and live here. \n\nI always end up in places that remind me of my N home even though I don't want to. Like do we subconsciously seek these places out???\n\nI don't know if this is all in my head or I'm being too hard on them because I'm anxious/angry all the time and it's hard to tell. \n\nThanks in advance for the help. ",
        "created_utc": 1489233613,
        "upvote_ratio": ""
    },
    {
        "title": "Falling backwards / I can't do this [vent] [support] [tw]",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/5ysbfz/falling_backwards_i_cant_do_this_vent_support_tw/",
        "text": "[deleted]",
        "created_utc": 1489233059,
        "upvote_ratio": ""
    },
    {
        "title": "\"I wasn't her friend, I was her audience\"",
        "author": "DarthJaneway",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/5yr6o3/i_wasnt_her_friend_i_was_her_audience/",
        "text": "My retrospective after breaking up with my N-friend.  \n  \nI thought think I was helping an N \"grow\". I would give her advice and let her cry on my shoulder and rant her paranoia. Years of drama and histrionics nothing of note has changed. She is still a narcissistic binge drinker who won't accept personal responsibility. I am now the villan because I set boundaries. In  a reality  I was never helpful. She doesn't truly believe she's the problem. I spent years in an interactive play that has no begining or end, just repeats itself with different actors. I was her audience, not her friend.",
        "created_utc": 1489210125,
        "upvote_ratio": ""
    },
    {
        "title": "After an N, how do you really trust in your relationship?",
        "author": "ti84pluss",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/5yoez9/after_an_n_how_do_you_really_trust_in_your/",
        "text": "I'm RBN and also dated an N a few years ago.\n\nI'm now in a healthy relationship with another RBN for over a year. We've decided to move in together and are starting to move toward engagement/marriage. A while ago, I started having uncontrollable anxiety and hating my job. My boyfriend is really fortunate to make a high income. He told me to just quit, figure life out and then take the next step whenever that is, six months, two years, whenever. Logically, it makes the most sense. I had a good job, but he was still making 4x my income. So I quit. I trust him completely and know that even if we broke up, he would still help me on my feet financially if needed. But I have been working since I was 15. As a lot of you can probably relate, money was SUCH a big deal for my parents. Money for field trips, city league sports, school supplies, etc. were just SUCH a big deal and involved inordinate amounts of guilting and begging. Since then, I've just worked and made my own money, and I never had to ask anyone for money since. It was nice. Not only that, I never had to justify my spending to anyone. Now, my SO and I are merging our finances and I'm not working. It just feels so...scary. I don't know how to shake this fear and I'm overly sensitive to any critique he makes of my spending. Once he asked how much I spent on something and after telling him the amount he said, *\"Oh that's a lot.\"* I got upset and felt like he was being judgmental. It reminded me of my dad's strange tendency to always fantasize that prices should be lower. My dad would make illogical comments like, *\"Oh you need a backpack? These Target backpacks are all $30?! No, we are going to find one for $5.\"* Then we'd look around for the nonexistent $5 back. My dad would be angry at me for needing something so expensive and would usually covertly punish me for it. I have this overwhelming fear that I need to protect myself and have my own money. The idea that someone would share their money freely with me and the money they earn would be \"our\" money is foreign to me. Can anyone relate? Does anyone know how to get beyond this?",
        "created_utc": 1489176865,
        "upvote_ratio": ""
    },
    {
        "title": "Isn't the dynamic of a family restaurant a deadly Ntrap? [rant] with hopefully nice [discussion]",
        "author": "TommyG3nTz",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/5ynkrf/isnt_the_dynamic_of_a_family_restaurant_a_deadly/",
        "text": "One of my favorite shows is Kitchen Nightmares, but what always bothers me is how in episodes involving family owned and operated restaurants, the children never care and have no desire to cook. They are in the restaurant because there parents force them to at a young age. And what does Chief Ramsey do? He makes them feel responsible to stay and fix the problems. \n\nEvery day I have to remind myself that I am not responsible to take care of my parents at every call. Yet we have a nationally syndicated program that promotes these toxic relationships. I really shouldn't be surprised by media doing this yet here I am. I really just want to know that I am not crazy for thinking like this. But in general we promote as a society so many toxic relationships it's scary. It gives the Ns their power that what they are doing is normal and just. What the hell",
        "created_utc": 1489168747,
        "upvote_ratio": ""
    },
    {
        "title": "In case you had any doubt: They're still the same with the new gf",
        "author": "Codependentte",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/5yk4zp/in_case_you_had_any_doubt_theyre_still_the_same/",
        "text": "Nex#1 went on a trip with some friends (not flying monkeys). They told me about it. \n\nSooo... he's still the same. \n\nDoesn't really say anything or participate in conversations, would be on his phone playing games during dinner parties, would always say he didn't have cash so she's  paying.  Same old, same old.\n\nHe's gotten fat. (Heh. I'm a gym rat and have toned up.)\n\nApparently he told her that I don't talk to him because I'm soo heartbroken and sooo wanted him. That makes him look in demand, like she won the \"prize.\"",
        "created_utc": 1489120598,
        "upvote_ratio": ""
    },
    {
        "title": "Why does it seem like they are so bulletproof?",
        "author": "icicleridge",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/5yjzvv/why_does_it_seem_like_they_are_so_bulletproof/",
        "text": "Why doesn't karma ever seem to catch up with them. Part of me just wants to see him burn (not literally). I want him to have to pay for all his selfishness and abuse and manipulation. I want them all to. \n\nEdit: My God. Reading all of this is staggeringly eye opening. Thank you all for the contributions and I hope it helps to be able to unload. I am still only just beginning to wrap my head around it all and realize what I have put up with for the last 20 years. AND now that the divorce process is underway, it is only getting worse, and I'm not even the one who wanted the divorce. ðŸ˜µ\n\nEdit 2:  I think I have figured something out. I don't want to see him burn, or revenge, or the bad karma to come back on him. No satisfaction comes from any of that. I think what I'm really wanting is for him to have some catharsis and realize what he's doing and his effect on us and himself and for it to be strong enough that he wants to do something about. I want him to change. I want him to want to change.That's a fantasy that only happens in movies. So now my challenge is to just let it all go. Try to find my own self-worth and self-respect and try to validate myself again and move on. It's been a struggle lately. ",
        "created_utc": 1489118697,
        "upvote_ratio": ""
    },
    {
        "title": "Things I'm still hiding a year after Ndad's death.",
        "author": "starshinedrop",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/5yh2lm/things_im_still_hiding_a_year_after_ndads_death/",
        "text": "A year after my ndad's death I'm struggling with a lot of conflict inside of me. One moment I miss him. Then I hate him and I'm glad he's gone. Then I'm crying and I feel like I have a hole in my life. Then I'm glad he is gone.\n\nToday I realised, things I hid because I feared his wrath his still hidden. He's gone but it's like this internal voice that's mimicking his mockerg and threats is still there. I don't know if anyone gets that?\n\nExample, I love men and women, but even sitting here, typing to reddit, where nobody knows me, it's awkward and tough and scary to say so because it is like he is standing next to me telling me I'll go to hell, he's embarassed of me, he'll disown me, he's ashamed of me.\n\nHow do I lose this internal voice?",
        "created_utc": 1489086956,
        "upvote_ratio": ""
    },
    {
        "title": "Making fun of Yourself. @niume_official",
        "author": "Freshyxxx",
        "url": "https://niume.com/post/277512",
        "text": "",
        "created_utc": 1489019846,
        "upvote_ratio": ""
    },
    {
        "title": "Mini Segway",
        "author": "Quorothyer",
        "url": "http://www.lifeoftrends.com/mini-segway-not-typical-hoverboard/",
        "text": "",
        "created_utc": 1488966622,
        "upvote_ratio": ""
    },
    {
        "title": "It's taking so long because the first two months were numbness",
        "author": "Codependentte",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/5y6yak/its_taking_so_long_because_the_first_two_months/",
        "text": "The Nex#2 was only about 7 month relationship, and it's been 4 months NC. So why am I still stuck?\n\nI just realized that the first two months I was pretty numb to the pain and disappointment of being discarded. Not sure why. \n\nI'm finally working through sadness, hopefully it won't last long, he's not worth it.\n\nEdit:eh, 7-8 months or so total",
        "created_utc": 1488964381,
        "upvote_ratio": ""
    },
    {
        "title": "Moving on feels so, so sweet.",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/5y5tvf/moving_on_feels_so_so_sweet/",
        "text": "[deleted]",
        "created_utc": 1488946747,
        "upvote_ratio": ""
    },
    {
        "title": "I called the Labour Board on my nbosses. Now they wsnt to write me up on a lie of omission.",
        "author": "HelnaHandbasket",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/5y4yo1/i_called_the_labour_board_on_my_nbosses_now_they/",
        "text": "Of course they knew it was me. I said i would do so if x happened again and it did. I want some editorial help with my written complaint in response to being asked to sign a write up which failed to mention the covert teasing that led to me saying \"You're fucking with me\" Also i shot myself in the foot by indulging in the statement \"I'm not giving you any narcissistic supply.\" and \"i know you're messing with me because I can see that sociopathic little smile while you do it.\"\nWriters unite! I will post my rough draft and welcome suggestions to lay it down brief, bold and effective. Since losing this job is a foregone conclusion, I fully intend to Bcc a copy to the director of human resources manager at the corporate level. I'm the oldest employee, i have more responsibility to protect the college and high school kids that are having panic attacks, migraines, and poor grades because every single manager is predictably hostile. It's a family owned franchise, so it has become a mirror of the shitty dynamics within this infantile, dishonest and exploitative \"family\". I'm dead sick of getting to work, entering the change room to find a a woman so young she's really just a girl, crying in dread of another shift where these animals do their level best to squeeze out fearful, angry or guilty reactions for their amusement.",
        "created_utc": 1488936462,
        "upvote_ratio": ""
    },
    {
        "title": "Nwife infuriates me sometimes...",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/5y4wsd/nwife_infuriates_me_sometimes/",
        "text": "[deleted]",
        "created_utc": 1488935852,
        "upvote_ratio": ""
    },
    {
        "title": "And another weird thing -",
        "author": "Codependentte",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/5y4sc5/and_another_weird_thing/",
        "text": "So one day he said:\n\n\"I would die if it would help  [our friend with cancer] live.\"\n\nHe talked about donating organs or whatever.\n\nHe said this about several people \"I'd die so ___ could live.\"\n\n(Oddly, as he knew he had significant liver damage from drinking excessively  for at least 30 years.)\n\nI replied ,\"So where does that leave me if you die?\" \n\nI'm not sure why I said that.\n\nI think he wanted me to say what an unselfish person he was.\n\nBut instead I turned it around so that he'd look selfish for \"abandoning \" me. \n\nSheesh only with an N do I have these weird assed conversations.",
        "created_utc": 1488934478,
        "upvote_ratio": ""
    },
    {
        "title": "Trying to move on from Nwife. Married for 15 years. It's so damn hard...",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/5y3dnd/trying_to_move_on_from_nwife_married_for_15_years/",
        "text": "[deleted]",
        "created_utc": 1488920171,
        "upvote_ratio": ""
    },
    {
        "title": "Dealing with loss",
        "author": "clutch_purse",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/5y22xj/dealing_with_loss/",
        "text": "How do you deal with loss, as a recovering CoN? \n\nGoing through this thing right now. A brief affair which I rekindled, only to be dropped again, even more harshly than before. It just makes me very sad to realize how seemingly little integrity I have. It's taking every ounce of restraint in me right now to not call him up and literally beg beg beg him to see me again. Who would do that? Only a sad, unattractive, lost person with no belief in her own worth, right? I shouldn't do it, right? ",
        "created_utc": 1488908983,
        "upvote_ratio": ""
    },
    {
        "title": "Is recovery possible? Yes!",
        "author": "WolfPerception",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/5y1mc4/is_recovery_possible_yes/",
        "text": "Coming to these threads brings up memories of a time where everyday was a challenge.  Instead of thinking about my future life and skills, I had to worry and analyze what my mom was feeling like that morning.  Was she happy or pissed? Did she accept my question for what it was or is she going to hit me because she's pissed for what she thinks it is supposed to mean?  My favorite \"if I come home and she's happy, I can play basketball.  If she's mad, i'll just lock myself in the room to \"do homework\" while trembling knowing she could come in at any moment being pissed off for  *insert reason here*.\"  \n\nThere are so many of these it makes me sick.  I spent years learning how to remove the emotion from these simple sayings so that I could see them for what they are.  I used EFT and had some people to lean on.  The problem was that even though I was removing the emotions of that situation, my brain had no other perception to pull from.  I needed to rebuild my foundation.\n\nI needed something to give me a perception shift. Something that changed my focus on my past to who I am, what I can do, what I have achieved to date (no matter how small), and give me a foundation to move forward.  I experimented with \"Hypnosis Downloads\" that I found on iTunes.  The pure change in my reality is increasingly evident that my life is moving forward.  I'm smiling all the time.  I'm more in tune with who I want to be.  The great thing is i'm discovering what I WANT. I never felt that way.  It's always been about what others want. Now it's about me.  What do I WANT?  I am exploring what I want every day. \n\nThe exact ones I listen to are \"Positive Thinking\", \"Stop Worrying\", \"Believe In Yourself\", and \"Overcoming Procrastination\".  I would not put my stamp on anything that doesn't work.  I'll experiment with anything that will lead me forward and remove all the remaining tendrils of fear and suffering i've endured.  I will NO LONGER ALLOW my life to be miserable. This has been a life changer and I hope this does something for anyone who tries it. Have a good day everyone.",
        "created_utc": 1488905374,
        "upvote_ratio": ""
    },
    {
        "title": "Still depressed 6 months after going NC.",
        "author": "still_struggling",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/5xy27q/still_depressed_6_months_after_going_nc/",
        "text": "So I have lurked in RBN for a long time but it was always enough for me to read, and not post. I got a lot out of just seeing there were so many people out there like me.\n\nRecently I've slipped into a major depressive episode. I started to get depressed within a few weeks of going NC with my whole immediate family, my mom, dad, brother and sister. Mom is the N, dad is the enabler, and my siblings are both turning into Ns I think.\n\nIt was absolutely the right decision, but it hasn't really improved my life at all. I figured there would be a period of grief, but this is just total numbness. I have a therapist and he thinks it's no coincidence I became depressed so soon after going NC. I just feel so stuck and alone.\n\nCan anyone else relate?",
        "created_utc": 1488857150,
        "upvote_ratio": ""
    },
    {
        "title": "Today I found out I was raised by narcissists: Where do I go from here?",
        "author": "ashe_irelia",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/5xxjxv/today_i_found_out_i_was_raised_by_narcissists/",
        "text": "By pure coincidence I stumbled upon an article about narcissistic parents. One thing led to another, and after hours of reading on the internet I realized that my parents fit every description I could find.\n\nIt was liberating, in a way. I have many mental disorders, an eating disorder, I always felt like there was something wrong with me because I had all these issues and a lot of them seemed to come out of nowhere. Reading all these things made me realize that my parents made me their scapegoat... There is nothing wrong with me. There is something wrong with THEM.\n\nAnd... Now what?\n\nHow do I learn to express my emotions to others without feeling vulnerable and weak? How do I learn to express my needs to others without feeling like I'm selfish? How do I learn to say no?\n\nAnd most importantly... How do I find out who I am? How do I find out what I want? I base so much around what others want, what others need, I neglect myself completely... Ever since I moved into my own apartment and cut off contact with my parents I've been wondering who I am. I struggle to find an answer.\n\nI have 1000 more questions but these were the ones that struck me as the most important",
        "created_utc": 1488851276,
        "upvote_ratio": ""
    },
    {
        "title": "Childhood eaters- the lot of them.",
        "author": "ketocamp",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/5xxcp0/childhood_eaters_the_lot_of_them/",
        "text": "I was looking through pinterest tonight and lots of vintage toys came up. Tons of toys that I had growing up and that my nmom gave me. \n\nI have been nc for over two years now and I had such a pang of regret and sadness when I looked at those toys.\n\nI felt confused and upset because hey it wasn't *so* bad- you had toys! There are kids who had nothing but dog shit to play with! \n\nThen I think of how I got rid of all of those toys- couldn't stand to look at them because the price I had to pay was too high. They didn't make me feel happy to look at them and remember getting them or playing with them. I just felt sick and wanted to vomit from all the lies and manipulation. \n\nI am so sad that I can't have happy childhood memories of things that normal people can look back on fondly. I have nothing back there. Even when my brain tricks me into thinking the abuse wasn't so bad because I got a toy once- I know the reality is that it was horrible. \n\nYou get a toy so no food tonight- have to learn you good. You think you're hot spit because it's your birthday- have to learn you good. You're such a brat thinking only about presents on Christmas! \n\nHave to learn you good. \n\nNarcs are like ink in water- they cloud everything, taint everything. She left me nothing of a childhood and I still hate her for it.\n\nTwo years and the grieving hasn't stopped. Two years of intense therapy, EMDR, meds- the grieving pops up when I thought it was gone. \n\nI don't even know if I have a question... I just wanted to see DAE I guess. \n\nAlso- it royally sucks to be triggered by something so innocent and sweet as a child's toy. ",
        "created_utc": 1488848895,
        "upvote_ratio": ""
    },
    {
        "title": "Frustrating weekend [Trigger warning]",
        "author": "TarnishedTeal",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/5xuy4n/frustrating_weekend_trigger_warning/",
        "text": "So on Saturday morning in the shower I started thinking about my nMom. I had all sorts of crap run through my head. How she broke her own rules while holding me to the letter. How she would scream in my face because she though I stole something. How she would flip out if I made her breakfast wrong, or with too much peanut butter. \n\nAnd then I started thinking, what would happen if the roles were reversed? What would happen if, just for a week, I treated her like she treated me. Every physical, mental, emotional abuse thrown at her. Not even multiplied, just 1 for 1. And I realized that she wouldn't last the week. What if I made her feel as powerless as she made me. Defenseless against huge amounts of abuse, just sitting there, taking it all, because you've got nowhere else to go? \n\nWhat if I called her the things she called me? What if I accused her of the things she accused me of? What if I rifled through all her stuff, looking for things that weren't there? What if I just randomly decided to \"help\" her clean, and look at every piece of paper, every piece of trash? \n\nWhat if I never let her go anywhere, and screamed at her if she made me wait 15 minutes after she got off work? What if I decided to call the police to go search for her because I wasn't sure she was where she was supposed to be, and I made a fool of her in front of all her coworkers? \n\nWhat if I stole all her stuff and ruined all her electronics because she stood her ground? What if I encouraged her to stand up to her grandmother and when she did the same to me, I hit her, screamed at her, and called her a worthless shit? \n\nWhat if I did everything she did to me? \n\nBut I wouldn't, because I'm not a narcissist. But it's almost...relaxing? To know that she'd get everything she deserved for abusing me as much as she could. \n\nI hope this doesn't break the rules. I'm really sorry if it does. ",
        "created_utc": 1488825371,
        "upvote_ratio": ""
    },
    {
        "title": "Literally rubbish",
        "author": "smileonamonday",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/5xu36r/literally_rubbish/",
        "text": "I just tried to put the rubbish out and the bag split and now there is crap all over my kitchen floor. It split because my boyfriend insists on hanging the bag on the cupboard door handle instead of putting it inside the trash can where it's supposed to go. It caught on the bottom of the door handle and ripped, so I basically had a bag that was open both ends and I tried one-handed to get another bag out of the cupboard but the second bag won't fit over the first bag even though they're the same size and the more I tried to stuff everything inside the second bag the more crap was falling out of the first bag.\n\nSo my reaction is to leave it all on the floor and storm upstairs away from it and give up. I want my boyfriend to have to deal with it and I want to shout at him that this is all his fault because he always puts the bag on the door handle. But I can't (because he's not here) and I won't (because it's not really his fault). I don't know what to do. Why does this make me feel bad? Why can't I just clear it up like a normal mature adult? It's like I'm panicky and angry and despairing and everything is ruined. I don't see the point of doing any more cleaning, there's just no point. I don't understand.",
        "created_utc": 1488817063,
        "upvote_ratio": ""
    },
    {
        "title": "How do you know if you're a good and worthwhile person?",
        "author": "totally_rocks",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/5xqvsd/how_do_you_know_if_youre_a_good_and_worthwhile/",
        "text": "It's something that has plagued me my whole life.  As a child I tried so hard to be what everyone wanted me to be.  But, one by one everyone that was supposed to love me, left.  Now that I'm an established adult the one thing that I still fret about is if I'm a good person or not.\n\nSo, what makes a person cherished?  How can I know if I'm good, if I'm enough?",
        "created_utc": 1488769058,
        "upvote_ratio": ""
    },
    {
        "title": "Falling backwards...",
        "author": "icicleridge",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/5xqe2u/falling_backwards/",
        "text": "And falling apart again. All I want to do is cry and hit things or break something. I can't imagine ever not being angry at my N STBXH. I hate having to have anything to do with him. I hate him for all the times he made me or the kids feel stupid. I hate him for being more committed to his ego than to his family. I hate him for the bait and switch that I got in the beginning. I hate that I can't tell him all of this, and that even if I could, he wouldn't care and wouldn't do anything about it. I hate that he has talked himself into believing that he's the hero for \"taking himself out of the equation\" in an effort to make things better for everyone, but really what he did is take me out of the equation because he's still the same condescending, show-off, asshole around the kids and has our son feeling sorry for him. But the thing I hate the most is myself for making 2 great kids the casualty of my shitty, fucked up choice and mistake. HE  WAS A COLOSSAL MISTAKE!!!\nAHHHHHHHHH!!!!!!!!!! ",
        "created_utc": 1488762950,
        "upvote_ratio": ""
    },
    {
        "title": "Problems with authority",
        "author": "fort_wendy",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/5xnkml/problems_with_authority/",
        "text": "Does anyone have problems with authority? These days, I hate being told what to do. I have this sense that if you're being told what to do authoritatively, it's more to feed his Narcissistic appetite. I'd rather do things because I wanted to and not because I was told to do it. \n\nOn the other hand, I overcompensate and can sometimes be a pushover when I don't hate the person giving orders.",
        "created_utc": 1488731250,
        "upvote_ratio": ""
    },
    {
        "title": "Should I get my enabler sister a birthday present?",
        "author": "cellists_wet_dream",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/5xjtfm/should_i_get_my_enabler_sister_a_birthday_present/",
        "text": "My sister's birthday is upcoming. Her N husband is a few days after. I typically give her a present and a small joint present for both of them.  \n  \nBut now I've gone mostly NC because of some major issues, the main one being that they are still deeply attached to my NEX who did some pretty nasty things to me. I am sure any of my actions can be and will be related to him (as they have been in the past).  \n  \nMy sister is not an N, I think, but she has a ton of fleas. Always has. I'm not convinced she's a full-blown N, though, for a number of reasons.  \n  \nThe reason I'm even considering getting her a gift is because, aside from her being my sister and loving her, I want her to know that I'm there for her if she ever decides she's had enough of her N husband. I want her to know that she's not alone if he tries to hurt her. I feel like completely cutting her off is only going to further entrap her in his snare, and he's already gotten her isolated and surrounded by his toxic family.  \n   \nHer husband is a nasty guy who is not unlike my ex, and I know how that manipulation can affect a person, even making them turn against their own family.  \n  \nIs it worth it?\n",
        "created_utc": 1488669710,
        "upvote_ratio": ""
    },
    {
        "title": "Do little bombshells go off as you remember yet another lie?",
        "author": "Codependentte",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/5xjjqa/do_little_bombshells_go_off_as_you_remember_yet/",
        "text": "That time he said his \"advisor\" was coming up from London, so he'd be busy.\n\nUh-huh.\n\nSo sick of thinking about this.",
        "created_utc": 1488666334,
        "upvote_ratio": ""
    },
    {
        "title": "Karma: Flying monkey harassment investigation.",
        "author": "Codependentte",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/5xi1s7/karma_flying_monkey_harassment_investigation/",
        "text": "One of Nex #1's friends acted extremely inappropriately in front of charity donors. The donors complained and want the guy reprimanded publicly. Conduct Unbecoming a member.\n\n(There's a whole shit show with Nex#1.)\n\nSoo. My job is to gather the facts. (I'm on the leadership team for this charity/social club.)  \n\nIn interviewing witnesses, I got a good idea on how this guy (who is a suburban family man) acts when he thinks no one is looking. Gross. Juvenile. Like the frat boy who no one likes.\n\nLol, the audio recorder was on as part of the charity function, so it's all on tape, too.\n\nKarma, yo.",
        "created_utc": 1488649249,
        "upvote_ratio": ""
    },
    {
        "title": "Attention-seeking idiocy",
        "author": "clutch_purse",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/5xh2w3/attentionseeking_idiocy/",
        "text": "I am officially sickened by the relentlessness of my attention-seeking behaviors. They have no strategic relational purpose other than to fulfill my apparently deep-seated need for attention and approval from other humans. I waste people's time and I make myself look bad. Do other Children of Narc's find this to be a problem? A common FLEA? I will be 40 this year. I have to stop this. And yet I can't. Maybe it will die off soon. It's so embarassing. Why does attention feel so good though? Can someone explain from a neurological/hormonal/physiological perspective? ",
        "created_utc": 1488637178,
        "upvote_ratio": ""
    },
    {
        "title": "I got a job [support]",
        "author": "throwaway9347n33t",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/5xgdcm/i_got_a_job_support/",
        "text": "So, I managed to get it together to go for a job interview and trial, and ending up getting a job 3 hours a day making coffee at a childcare place fairly close to where I live. \n\nI'm just worried at this point about self-sabotage. Every time I see my new co-workers I think 'oh shit they're going to fire me'. It was like this at my old job too. I have to make small talk with parents and children, and this has always been my weak spot. I'm uncommunicative, shy and cold. I've been fired in retail and customer service jobs before for this personality defect - granted it was while I was still enmeshed in my Nfamily, but I'm already anticipating the hurt, which is why it was so hard to apply for jobs in the first place, and why it took me so long to even get this. I don't know what else to put besides I'm freaking out a little because I don't want to lose this, don't think I can do it, and it's such a small thing that I'm probably supremely overqualified for, that it sends me into a spiral of hopelessness, thinking I'll be poor and underemployed forever, considering how long it took me to even get this job (almost a year, although I didn't put a huge amount of effort into applying to stuff) and that I won't be able to even do something like this, which should be really easy for anyone. \n\n",
        "created_utc": 1488624004,
        "upvote_ratio": ""
    },
    {
        "title": "243 days since NC: Update",
        "author": "dianamonster",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/5xfz7e/243_days_since_nc_update/",
        "text": "I'm feeling much better about my life. I was depressed and I met someone who I saw myself in. Except she did not have the drive to leave her parents, now did she see her parents the same way I did. Anyways, in her, I realized that I have potential and drive and I'm motivated. So I went back to school to take classes, so that I could get good grades and feel good like myself again. \n\nI have one family member who is not a flying monkey. She keeps my secrets and is supportive. Her mother also supports me. They recently proposed that I phone my mom (who has been calling everyone) when they are there. So that there is someone on my side. (I don't know how I feel about this)\n\nI originally, wanted to go NC for 30 days. Then it was 6 months. Now it's coming to be a year. I wished that I can have my family back. But I also want to be my own person. \n\nI think that perhaps if I don't try to mend the relationship, I will look bad to the rest of my family. And I don't see anything good coming out of trying to mend the relationship at all. \n",
        "created_utc": 1488615221,
        "upvote_ratio": ""
    },
    {
        "title": "64 days 100% no contact.",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/5xfuo9/64_days_100_no_contact/",
        "text": "[deleted]",
        "created_utc": 1488612707,
        "upvote_ratio": ""
    },
    {
        "title": "How do I make decisions? Paralysed often. Help.",
        "author": "spider_is_watching",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/5x2hry/how_do_i_make_decisions_paralysed_often_help/",
        "text": "Like... I'm not even talking about groundbreaking life-changing decisions. I kind of have an easier time with those. I'm talking about simple day to day shit. Choosing what to eat at a restaurant fast, independently of others, without regret. Choosing what to do today. Like... There's so much to do today. Work on my stupid thesis, clean my office, clean my bedroom, clean my kitchen, personal hygene stuff, going out for a walk, bicycle ride or a run?, Or do I do yoga or meditate or read or respond to emails I've been procrastinating on forever or reconnect with friends I've isolated myslef from or do I scrub the bathtub so I can soak in water later or should I go to the store now or what the fuck. There's just so much to freaking do, and even though my thesis should be my number one priority, I usually end up doing other stuff too that seems equally as important, but it's really not. But everything needs to be done at some point. \n\nI've tried making to do lists and marking items on an importance/urgency scale. But I end up marking everything as most important/urgent. Part of that problem is that I've been in the pits of depression for about two years, am currently not working, am living with my boyfriend who is amazing and supportive, and has a full time job. He's the one supporting us both right now. I have some savings left, but I'm not an equal contributor at all. I feel like a piece of shit for not being able to keep up with my own life. I feel guilty for not contributing more. I don't bring in any income yet, and I can barely manage to sort of keep our apartment clean. Sort of. \n\nSo under the burden of all this stuff to do and all these decisions and depression and anxiety feeling like shit, failure, inadequate, not good enough, and decisions and stuff to do and desisions and... Aaarrghhh! Most of the time I just end up doing nothing because I CANNOT DECIDE WHAT TO DO FIRST. Paralysed, wasting time online. How do I climb out of this and become a functional adult?! How do I make decisions and follow through? How the hell do people do this?!",
        "created_utc": 1488450360,
        "upvote_ratio": ""
    },
    {
        "title": "I think I don't know what real love is or should feel like.",
        "author": "icicleridge",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/5x15n8/i_think_i_dont_know_what_real_love_is_or_should/",
        "text": "",
        "created_utc": 1488428645,
        "upvote_ratio": ""
    },
    {
        "title": "My codependent ass is terrified of having to break up",
        "author": "kfghjkllll",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/5wvy14/my_codependent_ass_is_terrified_of_having_to/",
        "text": "Yikes.. so long story short I am but a tiny college freshman. My boyfriend and I met at the beginning of the school year and kind of never stopped hanging out. However, I'm starting to develop feelings for someone else and I feel IMMENSE guilt about it and I feel like I need to figure out this situation before something more develops. \n\nHowever, I don't even know if I can manage a breakup. Due to the abuse, my mental health last year was complete garbage, ultimately resulting in a suicide attempt. My mental health this year has been so much better though! I'm functioning in a school environment, and I'm able to do daily things to take care of myself. Therapy and meds saved me. I have my life back. \n\nI'm just scared though of how low I'll go if I break up with him. I'm afraid that I won't find anyone else who loves me, or like I'll be passing up something really good. I'm afraid to lose him and to have to reorient the relationships in my life to fill the gap that he'll leave. I'm worried I won't have enough support or like I'll feel lonely. I'm worried that my schoolwork will suffer, and right now I'm going through a very intense period schoolwork-wise, and I'm getting ready to apply to a few departments for next year. I really am just staying right now because I don't want to go through a breakup. I realize this is super codependent. Yayy being RBN. \n\nMy Nmom cheated on my dad and I was the first person to find it out when I was 12. It was such a formative experience, and I really saw how much it destroyed my dad. I never want to hurt someone in such a way that she did, I really need to figure this all out soon. \n\nAny advice would be very much appreciated. \n",
        "created_utc": 1488376760,
        "upvote_ratio": ""
    },
    {
        "title": "[35/f] He [40/m] Has a New Wife [24/f] -- Why Am I Still His Verbal Speed Bag?",
        "author": "KineticBlue",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/5wlpwo/35f_he_40m_has_a_new_wife_24f_why_am_i_still_his/",
        "text": "Cliff's Notes Version: Married to an NPD man for 6 years, gave up everything to move with him to a third-world-country to teach, got unceremoniously dumped for a much younger woman, whom he married within a year of our divorce. Crawled home, broke (I paid for the divorce at his insistence), tail between my legs, etc.\n\n**He still calls me.** I don't get it. He's got a new, pretty young wife for his NS (narcissistic supply). Why do I still get angry, hectoring calls late at night? Why the name-calling? Why the continuing insistence that I get breast implants? (FWIW, I'm a perfectly-lovely C-cup).\n\nYes, I finally blocked his calls and emails. But I'm trying to understand. I thought once a narcissist had dumped you and moved on to a fresh supply, that was it. What was going on there?",
        "created_utc": 1488253752,
        "upvote_ratio": ""
    },
    {
        "title": "YOU DONT KNOW HOW MUCH YOU CAN DO WITH SO LITTLE",
        "author": "YaminiNegi",
        "url": "http://postitwitty.blogspot.in/2017/02/how-can-you-create-better-life.html",
        "text": "",
        "created_utc": 1488223671,
        "upvote_ratio": ""
    },
    {
        "title": "This video helped me deal with the projected narcissism after the discard",
        "author": "[deleted]",
        "url": "https://youtu.be/D24Hp3kSZoA",
        "text": "[deleted]",
        "created_utc": 1488135479,
        "upvote_ratio": ""
    },
    {
        "title": "I have philophobia. Any advice?",
        "author": "MauroLopes",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/5waahp/i_have_philophobia_any_advice/",
        "text": "For a long time, I believed that I was too uninteresting to be lovable. Therapy helped me to understand that everyone can be interesting in one way or another, and now I feel very confident about myself.\n\nEven so, something still scares me badly about loving and, especially, being loved. I still have in my mind this association between love and abuse and I'm struggling to get rid of it. \n\nIt's so weird that I often prefer to be rejected (it doesn't scare me at all) than being told that someone is attracted for me. \n\nI took a break from my therapy before I could address this issue because I lost my job, so I have no money to pay for it. For this reason, I ask for some advice on how to deal with my phobia.",
        "created_utc": 1488119069,
        "upvote_ratio": ""
    },
    {
        "title": "Things I wish I could quit thinking about [vent]",
        "author": "kariflack",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/5w8mm4/things_i_wish_i_could_quit_thinking_about_vent/",
        "text": "NC since the end of 2015. Last saw nmom/edad earlier that year, and I can't get over nmom's sniping to edad just out of my earshot when I was just trying to take them to a nice lunch on the last day they visited. What an evil woman! She was extremely impatient as I took a whole two extra minutes to find the place, then angrily whispered to my dad but enough that I could see her doing it when I looked behind me as I led the way. I still don't understand why she was so mean then expected me to visit and phone regularly. It all just hurts still.",
        "created_utc": 1488086076,
        "upvote_ratio": ""
    },
    {
        "title": "Controlling behaviors, religion, and me",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/5w673b/controlling_behaviors_religion_and_me/",
        "text": "[deleted]",
        "created_utc": 1488055296,
        "upvote_ratio": ""
    },
    {
        "title": "It felt nice to have someone care for me.",
        "author": "hardenedtreesap",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/5w4dxl/it_felt_nice_to_have_someone_care_for_me/",
        "text": "I met a British boy on New Years Eve Eve and we hit t off. I was upfront about my fucked up family and traumatic past. He swore he would never judge me for things I can't control. I pick up in some red flags but kept trying to talk to him about it. Was discarded last night. He had berated me on Wednesday and I told him to stop and when he didn't I asked him to go home for a couple of days so I could think. He had been pretty much staying with me since we started dating. He cleaned and organized my entire house, he said because he was bored. He hugged and kissed me and told me I was pretty. He asked how my day was and seemed to sincerely care about me. \n\nWhen he yelled at me, I froze. I had panicked while he was driving and said stop. I scared him and he was startled. When he yelled and I said \"I've already apologized what more do you want from me over an instinctive reaction?\" He dialed it down for a second but started ranting again about how he's a better driver than me. \nI sat silently for a minute and then told him that what had just happened wasn't ok with me. Continuing to yell at me after I've apologized and making personal judgements/attacks is not appropriate. He told me 'that' was all in my head and something I should talk to my therapist about. I was sputtering, looking back I was definitely triggered by other anxiety factors. I tried to explain the anxiety/ptsd aspect the next day. He just sees me as fucked up now. \nHe used to tell me I was perfect and I always said, no I'm not. I have baggage to deal with like everyone else. \nHe always argued and said that it wasn't my fault that my family was abusive and set me up to be prey for abusive partners and he would never judge me for something that isn't my fault. \nI can't tell right now if I miss him or just miss having someone show affection. Or miss having someone. \nI talked it over with my therapist before we sat down to talk last night and she didn't think I was out of line and she definitely agreed with me on the red flag behaviors. \nI'm just so fucking sad. I have no family. I am still trying to build a family of friends by I still attract covert narcs so it's a work in progress. \nAnyway, no real point. Just sad and lonely and don't have anyone to talk to right now. \nIt wasn't a long relationship and I know it would hurt more the longer I stayed and tried to make it work, but I had literally just finally let my guard down enough to start to really fall for him. ",
        "created_utc": 1488034353,
        "upvote_ratio": ""
    },
    {
        "title": "A Year Out, Still Afraid to Date Again",
        "author": "Editorgirl2617",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/5w1uaq/a_year_out_still_afraid_to_date_again/",
        "text": "I'm a year removed from my third discard in four years with a guy I'm convinced was a narcissist. He cyberstalked me all summer (even though he's hooked up with another narc), I've blocked him everywhere but he was reading my blog (mostly fitness and positivity) 95 times a month. He still does it every couple of weeks or so, but I ignore it. \n\nI'm trying to date again, but I'm scared. Scared I'll fall for the guy and he'll do the same, and scared I won't fall in love because my brain is broken or something. Is this normal?",
        "created_utc": 1487990083,
        "upvote_ratio": ""
    },
    {
        "title": "Rembering how he acted when I caught him gaslighting",
        "author": "Codependentte",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/5vzlqu/rembering_how_he_acted_when_i_caught_him/",
        "text": "He said I was acting like I was disoriented, dazed, like hypothermia. (Wtf, no, it was 60Â°F.)\n\nI raised an eyebrow and said \"*Really.* I want a second opinion. I'll call my friend.\"\n\n\"No. Only listen to me. She's not going to know. Only I know these things, I have special training.\"\n\nI gave him the stink eye.\n\nHe then fell back to \"No really! This isn't a mind fuck!\" Ooo. Like,  What, innocent little *moi*? I would *nevverrr* try to make you question your perceptions.\n\nI looked at him sideways like, \"Really.\" \n\nThen he dropped it. Game over. \n\nWho *does* this?\n\nBut, he knew I knew. He ramped up his devaluation tactics and lining up new supply, and left the next week or so.",
        "created_utc": 1487965285,
        "upvote_ratio": ""
    },
    {
        "title": "I don't believe in family. Can anyone relate?",
        "author": "yoyo2016",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/5vsixh/i_dont_believe_in_family_can_anyone_relate/",
        "text": "Seeing how many people there are in my family who I cannot stand is kinda mind boggling. \n\nI was talking to a friend and I told him how I felt. He said he was really sorry I felt that way. I never asked for someone to apologize on behalf of my opinion. \n\nAnyway, I really don't have a lot of positive beliefs regarding family. What about y'all?",
        "created_utc": 1487878496,
        "upvote_ratio": ""
    },
    {
        "title": "So what did your Nex leave behind? What did you do with it?",
        "author": "Codependentte",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/5vs3pd/so_what_did_your_nex_leave_behind_what_did_you_do/",
        "text": "Nex#2 took all his stuff and left whe I was out running errands. \n\nYet, he left some small luggage type thing he said was soooo sentimental because it traveled the world with him. In it was a recreational item that he said was also sooo sentimental. \n\nHe told all kinds of stories about how emotionally meaningful these were, and how he emotionally bonded with others over the items.\n\nAnnnnd so that's what he ditched at my place. Lol. Sooo meaningfull.\n\nWtf. Was this a prop in his \"sincere goofy tech guy\" persona?\n\nIt's possible he just forgot it, as he was pretty far along in alcoholism. But I told out mutual friends I would send it to him, and never heard back.\n\nOf course he told them he didn't want me to know where he was because I'm a crazy bitch ex who would surely chase after him. \n\nI waited 30 days and tossed it on trash day.\n\nUgh. Have to get this stuff out of my system.",
        "created_utc": 1487874512,
        "upvote_ratio": ""
    },
    {
        "title": "So a question about what kinds of friends you let into your life.",
        "author": "yoyo2016",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/5vrvce/so_a_question_about_what_kinds_of_friends_you_let/",
        "text": "It's obvious that we shouldn't let anymore toxic people into our lives. But what about letting in someone who is awkward and uncomfortable around just because you're desperate? What about someone who relies too heavily on you? Someone who is flaky? Where do you stand?",
        "created_utc": 1487872317,
        "upvote_ratio": ""
    },
    {
        "title": "Freaking out! Need advice!",
        "author": "BabbitandBromide",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/5vrkzb/freaking_out_need_advice/",
        "text": "tl;dr - Adult Protective Services just called me (i did file a report, tbh, but i did so with a fake name so a FM must have given them my number), and asked me to call them back.  WHAT DO I DO?\n\nHey, I'm 34, I've been NC for THREE PRECIOUS YEARS.  Flying monkeys have recently been trying to drag me back (this is what they're doing to me http://outofthefog.website/top-100-trait-blog/2015/11/4/objectification )\n\nBut I've held my boundaries - thanks to many of you - and just said no, I've dealt with her for way too long, just because you all SUDDENLY REALIZE there's a problem doesn't mean anything's different than it has been for the last six years.   (alcoholic Nmom circling the drain)\n\nIf I call APS back, am I signing up for something I'll regret later?  ",
        "created_utc": 1487869575,
        "upvote_ratio": ""
    },
    {
        "title": "I'd like your take on a relationship of mine",
        "author": "juusukun",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/5vp1t5/id_like_your_take_on_a_relationship_of_mine/",
        "text": "With the person who actually led me to this subreddit, and RBN. \n\nShe had a very seriously wrong childhood. Her father molested and raped her, to the point where she thought it was normal. She ended up with some hardcore FLEAS,  if not full blown narcissism.\n\nShe would shut down whenever I tried to have real conversations with her, ie. not splashing water all over the bathroom or at least wiping it up when she was done.\n\nWe also had different kinds of friends. All of my friends were happy to have her come and hang out with us, whereas her friends really valued it just being girls.\n\nI feel that she used me and then tossed me away. We dated for 9 months. Shortly after we started dating, she moved out of her 3/4 bedroom apartment into a hotel room turned into apartment which was pretty much a glorified closet. We were crazy about each other, me in the sense that I wanted to spend my life with her, apparently her in the sense that she was infatuated, so it was only natural for her to spend as much time as possible at my apartment, a roomy bachelor apartment with everything we could ever need (computer, Kodi hooked up to a big screen TV,  decent sized kitchen and bathroom etc).\n\nShe kept me secret from the world pretty much. Didn't want any proof that we were together on Facebook. Also kept in touch whither her ex of maybe 1 or 2 years, which was odd. I didn't think it was fair to him for them to still be friends, and that it was weird for her to talk to him about me and make the guy jealous. Seems to me like she DGAF about anyone or comprehend that other people have feelings.\n\nMaybe about 6 or 7months into our relationship, she started talking about how she was bi (I had an idea because she talked about attractive female actors etc.). We did a lot of serious talking (funny how we would have serious talks about things that were important to her but not about things that were important to me). I wanted her to be happy, I didn't want her to feel trapped in our relationship, I knew I couldn't satisfy her sexual desires towards women. We were both seeking a monogamous relationship,  she was needlessly jealous that there were pretty girls in my university program (who wouldn't even talk to me, and I have no desire whatsoever to chase after stuck up girls, personality is super important to me). It only seemed natural that I give her the go ahead to explore her sexuality, but warn her if she started to develop feelings for someone else she would have to make a choice. We even reaffirmed my stance at couples counselling, where I got the feeling the counsellor was surprised that I had to make a point of it at all, and that she sort of tuned out / wasn't really all there when discussing it.\n\nShortly after she started to pursue someone she worked with, spent quite a bit of time with, who treated me like shit whenever she came over to my apartment. How can someone who loves someone else be attracted to someone who treats their loved one like shit? I just don't understand it, except if that person did not understand love, or was just extremely selfish.\n\nShe got turned down by her coworker, and bawled her eyes out. I had to comfort her... but I'm sure you can imagine how I felt. Invisible, worthless, a consolation prize. It's really appalling how insensitive she was, at least to me.\n\nShe eventually found a new \"friend\" in a new girl that started working with her as well. Unlike the first, I never met this person, never had the chance to be treated like crap by her (the main issue with the first girl was that she walked into my apartment and acted like it was her own place, I had a video game paused and instead of hanging her coat up on the rack she just tossed it on the chair I got up from to be friendly and greet them, and I had to hang it up like their butler...)\n\nShe started spending more and more time with this new girl, keeping her a mystery. One night she never came home when she said she would. At first I was worried something awful happened to her.  Then I thought maybe she just fell asleep with this new girl, after sex or something. The thought of that broke my heart... her having no desire whatsoever to come home to me. I wasn't angry. Just sad. I messaged her and told her I missed her and needed her. \n\nShe got upset. She said I was \"attacking her bisexuality.\" She stopped talking to me. I didn't want to see her or talk to her face to face because I was devastated. She said she wanted to get some of her things and take them to her closet sized apartment. Then she wanted to get all of her things. She even took her/our mattress (my futon broke from sex) and I was bedless, she didn't even have room in her apartment for it.\n\nMonths went by. I thought maybe she actually did love me, care about me. I sent her messages, letting her know how my life was going (shitty) letting her know I missed her and loved her.\n\nOne day she finally answered. She was weird. She said maybe we could be friends again in the future when we were more mature... I took offense to it. I felt and still feel that I was a lot more mature than she was. I called her out on her shit, how she didn't give a fuck about my feelings, how she cared more about friends who might as well be labeled as fake and plastic. Some time went by. I cooled down. I tried to apologize for getting upset (even though it was kind of reasonable for the way she was acting). She didn't even ask me to stop contacting her. She called the fucking police on me. Which is Bullshit,  since dating her, I dated a single mother who was abusive and violent, the police gave me a hard time when I was stranded out at this person's house in the middle of nowhere with no way of getting home, the police saying they weren't there to fix relationships. You'd think they'd ask the person if they at least made it clear that they didn't want to talk anymore, and at least warn about going to the cops. Maybe it's a gender thing, since I am a guy after all.\n\nEven after all this time, I still get calls from agencies (eg the ministry of finace) where my ex for some reason used my number without my permission. I HATE getting calls for her on my phone, I want to forget her and move on. All I did was send her a message about it, asking her to not use my number and remove it from any profile she had with any agency, and I don't get a response and get blocked.\n\nSo I need to know... am I a decent person? Or am I a horrible and insane person? Am I detached from reality, or is she?",
        "created_utc": 1487833867,
        "upvote_ratio": ""
    },
    {
        "title": "No contact in action: The Ex N wants our mutual friends to \"check in\" on me",
        "author": "Codependentte",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/5vmgl3/no_contact_in_action_the_ex_n_wants_our_mutual/",
        "text": "Nex #2 discarded me in mid- November 2016. \n\nI blocked him first week in December, after a number of texts and photos. I never responded to anything. \n\nSo there's been strict no contact, and there's no way he would know anything about what I've been up to. I've been away or otherwise invisible, and no public social media. (He lives in Europe, I'm US.)\n\nJust heard that he asked the only mutual friends we have to \"check in\" on me.\n\nThis guy. He can't stand it that he didn't get a reaction to his discard.\n\nAnd he wants to look sooo concerned, because after all, I am the crazy pathetic ex. (Ugh, too much to go into here.) \n\nAs someone said, \"Ex\" is Latin for \"not my problem anymore.\"",
        "created_utc": 1487807588,
        "upvote_ratio": ""
    },
    {
        "title": "What are some of the things you do for self-care?",
        "author": "clown-penisdotfart",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/5vlluq/what_are_some_of_the_things_you_do_for_selfcare/",
        "text": "Do you have a routine? How do you push through the downswings?\n\nYou deserve happiness.",
        "created_utc": 1487799479,
        "upvote_ratio": ""
    },
    {
        "title": "I'm putting myself out there repeatedly and haven't found a good friend yet. Anyone else in the same boat?",
        "author": "yoyo2016",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/5vktq2/im_putting_myself_out_there_repeatedly_and_havent/",
        "text": "I'm in my mid twenties and have depression so those 2 things are probably working against me but it's disheartening to see how hard it is to find good people....",
        "created_utc": 1487792005,
        "upvote_ratio": ""
    },
    {
        "title": "Feeling triggered - Getting passed over at work",
        "author": "PrancerPrancer",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/5vkjqn/feeling_triggered_getting_passed_over_at_work/",
        "text": "Hi everyone,\nI keep getting passed over for things at work and it's starting to get to me. \n\nIt's playing into my memories of being the black sheep and constantly being ignored and told 'no' to every request, so it feels really painful. \n\nColleagues on the same grade as me are getting opportunities and development that I'm not being offered. For example, a colleague has been invited to present at a client meeting (something I've requested many times, and always been told \"no, sorry, there will be too many people in the room if you come too.\")\n\nAnother colleague is getting graphic design experience, because he works on a pirated design programme and brings in his own laptop. (Which is really sketchy!) I can use graphic design programs myself, but currently it's too difficult to get a legal copy of InDesign on my machine - so no design experience for me! \n\nOther colleagues have been funded to take accredited qualifications, attend 3 day industry conferences, and take long term management training courses.\n\nI've asked for similar opportunities myself and have been turned down for budget reasons or because \"someone else needs the training more than you for a confidential reason.\"\n\nI recently returned to work after a 6 month illness, and have been mostly doing 'easier tasks' as I settled in at work. But I'm ready to do more now, and I've made that clear.\n\nAll my feedback and appraisals have been good or excellent, and I've never been given constructive feedback on what I can do to perform better and earn those opportunities. There's always a budget/admin/confidential reason I couldn't have those opportunities. My confidence was already low, and this is making it worse. \n\nOh, and I get on well with my colleagues, I'm definitely a team player, I complete projects on time and to budget. I'm not hugely sociable, but then I'm naturally an introvert and I have PTSD so no surprises there. But I do make an effort to go to most of the team socials. I also get on really well with the Head of Department.\n\nBeing passed over is starting to really get to me. And right now I'm feeling pretty triggered around memories of being the black sheep who could never do anything right and was always told \"no\". \n\nCan you guys give me advice on how I can raise this constructively with my manager, and start to develop my career. \n\nI've been in this role 3 years.\n\nAnd while I was off on sick leave a colleague who started a year after me was promoted ahead of me :( (And she's not very bright or very good at her job, as far as I can tell.) \n\nWhat can I try doing differently? How can I raise this in a constructive way with my manager? \n\n",
        "created_utc": 1487789401,
        "upvote_ratio": ""
    },
    {
        "title": "Improving my self-care habits (Habitica)",
        "author": "PrancerPrancer",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/5vhh2m/improving_my_selfcare_habits_habitica/",
        "text": "Hi everyone,\n\nI got the Habitica app a few weeks ago. I'm using it to work on my self-care, self-compassion and to help me work towards my goals. I often struggle to remember to take care of myself you see.\n\nI'm finding it really fun and I've already noticed my self-esteem and confidence have improved a bit too. And I'm doing so much better at self-care.\n\n(For those who haven't heard of it, Habitica is an app which 'gamifies' your daily tasks. I personally find it really fun :) ) \n\nI was wondering if anyone else is on Habitica? I'd like to join a 'Party', and I was thinking it would be nice to be in a group with fellow ACONs. \n\nThanks for reading guys :)",
        "created_utc": 1487750297,
        "upvote_ratio": ""
    },
    {
        "title": "[Light] Sometimes I go to /r/rbn and comment on stories.",
        "author": "littlestghoust",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/5vfe3n/light_sometimes_i_go_to_rrbn_and_comment_on/",
        "text": "It's nice to use my knowledge of all that is N to aid those in need. Sometimes when I feel down, or when I am feeling weak, I go there and try to help others out with their own N problems. \n\nOne on end, it's nice being able to see clearly through the bullshit and using this ability to guide others as well. But on the other, it's great to know that I'm am beyond all the N games and able to see through it all.\n\nHowever, I can only go to /r/rbn infrequently as some stories can trigger some of the more deep seeded issues I'm still working on, but it's great to help others after being helped so much by that subreddit.\n\nDoes anyone else do something similar?",
        "created_utc": 1487723355,
        "upvote_ratio": ""
    },
    {
        "title": "DAE regularly dream about their Ns or other people with whom they are NC?",
        "author": "homesickforfiction",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/5vcl4r/dae_regularly_dream_about_their_ns_or_other/",
        "text": "NC about 7 months with Nmom, enabler Dad, and siblings caught in NMom's web of lies. It's a continuous road to emotional recovery, though NC is undeniably better for my well-being. I am no longer thinking about them most of the time and I enjoy my day-to-day life. However, I still dream about my Nmom and/or younger sister most nights. (My sister surprised me with a nasty message the day after my wedding telling me to not contact her again until I \"learn to respect our mother.\" I've been trying to heal from that hurt ever since.) \n\nI'm not having nightmares about them anymore, per se. Usually in my dreams we just try talking things out, and I know that's because it's what my subconscious wants to do, in an ideal world without Ns. It's hard waking up emotionally tired. Does anyone else go through recurring dreams about their Ns?",
        "created_utc": 1487696162,
        "upvote_ratio": ""
    },
    {
        "title": "Reconnecting with sane family members after NC, NP has scurried off to China without a word, and other good news.",
        "author": "saddetective87",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/5vatpi/reconnecting_with_sane_family_members_after_nc_np/",
        "text": "[Edit: not sure why the downvotes, I thought we also were supposed to celebrate healing and progress here as well as be a source of support for those who haven't gotten that far yet. But to each their own. Good luck on your own journeys!]\n\nThings have taken an interesting turn. My NM has gone off to teach English in China without a word to the rest of the family. I think that has been the final nail in the coffin with the her and several of my relatives. I have no idea when or if she is going to be back, but I don't care. The other members of my family (father, aunt and uncle, cousins, and three brothers) have been very welcoming as I reconnected with them, and am now in regular contact. My twin brother is getting married and was very understanding when I told him that under no circumstances will I go to the wedding if our NM is going, and to avoid ruining him and his fiance's great day I would just send a nice wedding gift rather than make him choose between his brother and his mother (he was the GC in the family from my perspective but since our NM's absence it seems that the narcissistic tendencies - or my perceptions of them - have greatly diminished).\n\nIt was great talking with my father and getting parental advice when I needed it. I have a plan to finish my education and push on to hopefully to a few successes with a few projects that I have on the go at the moment. I am journaling more regularly now, and have found more job opportunities that I have forced myself to have moments of bravery and apply for (and again have reached some success with some of them). My memory is improving, my perspective has become both more realistic and more positive. \n\nWhile there is still much work to be done, there is more hope than ever before. To friends who are reading this and still continuing with their struggles, in the words of Winston Churchill (another person who struggled with depression and childhood abuse his whole life), \"Keep Buggering On\".\n",
        "created_utc": 1487673150,
        "upvote_ratio": ""
    },
    {
        "title": "Iâ€™ve tried for lots of dating site, but they asled me money for using. Iâ€™ve found free and well trusted dating website which helped me to find girls only for sex",
        "author": "dersprodlinspha",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/5v9eyk/ive_tried_for_lots_of_dating_site_but_they_asled/",
        "text": "[removed]",
        "created_utc": 1487649316,
        "upvote_ratio": ""
    },
    {
        "title": "Are their actions really that deliberate?",
        "author": "icicleridge",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/5v8ueo/are_their_actions_really_that_deliberate/",
        "text": "Everything I read makes the actions of the N sound so calculated and deliberate. My STBXH does a lot of the things I read about, but his angry outbursts and biting remarks all seemed so Impulsive and in the moment. He used to even recognize what he'd done and apologize (which eventually wore off). He didn't start blaming me for his actions until recently when I said something had to change. \n\nI'm having a hard time believing that he never really loved or cared about me. It didn't seem like that in the beginning, or maybe I didn't really know what real love and compassion was (maybe I still don't). \n\nAs I write this, though, I can think of more calculated manipulations. ðŸ˜•\nKicking myself a lot lately for letting all this happen and making two kids a casualty of it and feeling so duped. ",
        "created_utc": 1487642280,
        "upvote_ratio": ""
    },
    {
        "title": "Who was the last person you had to cut off?",
        "author": "yoyo2016",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/5v8lmn/who_was_the_last_person_you_had_to_cut_off/",
        "text": "",
        "created_utc": 1487639512,
        "upvote_ratio": ""
    },
    {
        "title": "I asked my N-mother why she was so manipulative once",
        "author": "Codependentte",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/5v8235/i_asked_my_nmother_why_she_was_so_manipulative/",
        "text": "She actually thought for a minute and said, \"power.\" \n\nShocked the hell outta me that she had that kind of insight.",
        "created_utc": 1487633789,
        "upvote_ratio": ""
    },
    {
        "title": "from the mouths of flying monkeys",
        "author": "BabbitandBromide",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/5v81g2/from_the_mouths_of_flying_monkeys/",
        "text": "(optional original thread here: https://www.reddit.com/r/LifeAfterNarcissism/comments/5unl5x/when_the_n_gets_old_poss_dying_share_your_stories/ )\n\ni've been NC for 3 years.  my aunt suddenly decided to start paying attention to the mess that is my mom, so suddenly i'm the bad guy.\n\nhere are a couple texts.  the [...] are me.\n\nmy aunt:  \"Nmom has made her bed and i do think she is dying, an event i may or may not be there for.  you are needed.  but i do think every living thing deserves kindness [hahahahahah] and your determination not to give her any is a decision you will regret.\"\n\ni wanted to text back, YOU clean up her vomit and whiskey bottles and rotting food for 4 years and get her through cancer, and get back to me about kindness.  also, my mom's not dying.  she's just doing her regular shit, which my aunt would know if she'd been listening to me for the last 6 years.\n\nmy cousin: \"I think you are needed, to have closure for yourself and move on from the past [is she my psychologist???] Also, I basically  can't stand the situation when you mom is obviously falling apart [that happened in the 90s] and wants to see you.  These are my feelings.\"  \n\nThank you for YOUR feelings and not acknowledging mine at all!\n\nand that's what being a scapegoat is like\n",
        "created_utc": 1487633605,
        "upvote_ratio": ""
    },
    {
        "title": "Show of hands of people in Seattle?",
        "author": "BabbitandBromide",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/5v7xey/show_of_hands_of_people_in_seattle/",
        "text": "Who might want to meet in person?  Feel free to PM me.\n\nI have found support group settings extremely valuable and, well, supportive!  I'm dealing with some flying monkey action right now and could certainly benefit from a room full of understanding ears.\n\n(hope i haven't broken any rules!)",
        "created_utc": 1487632430,
        "upvote_ratio": ""
    },
    {
        "title": "Why is life so hard?",
        "author": "spider_is_watching",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/5v6g8z/why_is_life_so_hard/",
        "text": "I mean seriously. I'm really fucking struggling to even get out of bed when the alarm rings. I don't know how to keep a routine going or establish one. I'm late for stuff, I have no clue how to do my hair  nicely, I suck at applying makeup despite taking classes for it. I was keeping a strict keto diet for over a month now, successfully avoiding carbs, but yesterday I had two muffins, and today I had another one. I don't want to eat carbs, but I do have this strong urge to put on clothes, go to the store, buy bags of candy and chocolate and just stuff my face. I don't exercise either. I feel like such a failure of an adult. I hate how hard this is for me. I hate that I am complaining when I do have a lot going for me. But I just want to run and hide in some hole until \"it\" passes. I don't even know what \"it\" is. It's just there, this unending mountain of work that I don't feel competent to tackle. Just keeping my apartment clean and finishing university is fucking driving me berzerk. And I already finished all my clases, I just have to write a thesis. I sit at home all day fucking procrastinating. I hate everything. How the hell am I supposed to be a functional adult?! How does this shit work?! I'm in therapy, reading lots of books on these subjects, taking antidepressants, for the record. But right now I feel like a useless fucking blob of slime stuck to the floor. Do I really have to deal with all this bullshit for the rest of my life???? If yes then that fucking sucks. Over and out. ",
        "created_utc": 1487617478,
        "upvote_ratio": ""
    },
    {
        "title": "Sex dating. Huge and good choice of girls",
        "author": "girdredoma",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/5v5eaf/sex_dating_huge_and_good_choice_of_girls/",
        "text": "[removed]",
        "created_utc": 1487607374,
        "upvote_ratio": ""
    },
    {
        "title": "nMother never cried",
        "author": "uber-blonde",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/5v5d5l/nmother_never_cried/",
        "text": "This must be the week of memories for me. Her birthday just passed, I think that's a trigger.\n\nThis morning I had another odd memory. I NEVER saw my nMother cry. Not once! Not when her parents and siblings died. Not when she divorced (twice) and not when her youngest (of 4) daughters was born severely handicapped. \n\nShe came from a family with 4 boys so maybe crying was discouraged. She was always stone-faced and unmovable. I cried all the time as a kid and she would make fun of me.\n\nAnyone else have a malignant narcissist for a parent who never cried?",
        "created_utc": 1487607082,
        "upvote_ratio": ""
    },
    {
        "title": "Poem for the narc - \"Not my species\"",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/5v5738/poem_for_the_narc_not_my_species/",
        "text": "[removed]",
        "created_utc": 1487605431,
        "upvote_ratio": ""
    },
    {
        "title": "I went back [support]",
        "author": "cantseeyounow",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/5v3uip/i_went_back_support/",
        "text": "In November 2015, I went back to my Nparents. I let them convince me it was 'safer' where they were, away from my new support network. Now, almost 1.5 years later, all I see looking back is lost time. The connections I could have made, the lost opportunities I could have forged. I need to get back to where I was, but I'm older now - more depressed, regretful, broken, even as I thought I was as broken as I could be at the time. The only thing I can learn from this is not to go back, but life isn't as forgiving of stupid mistakes as the  people on this subreddit are. I'm 27 now, older, more scared. Depression sucks the life from me, and I have to act without hope, knowing that if I 'fail' there might not be more chances again. How do I reach out to my old support network? I was the weird girl that disappeared. I doubt they'd have any interest in me now, if their motives were ever good to begin with because apparently I'm terrible at judging that sort of thing. \n\nI'd like to move away from my Nfamily again, and not run back in fear, guilt and shame, but how do I do this? I've been inoculated with their fear. The time that I have to heal is slipping away from me, and my head is in a fog of confusion. I have no relationships - nothing to show for my life. I'd essentially be starting new at 27 years old, after trying to start anew at 25 and 26. I don't understand why I keeping failing, but it seems like everyone here succeeds at escape but me. ",
        "created_utc": 1487586363,
        "upvote_ratio": ""
    },
    {
        "title": "Going NC",
        "author": "katamount9",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/5v271s/going_nc/",
        "text": "Tomorrow, I'm sending the final 2 letters to cut contact with 3 of my 4 parents and stepparents. I'm so incredibly nervous. My stepmom's dad died 2 weeks ago, which made me put this off longer than I wanted. He was such a good man and I'm pretty wrecked that he passed. Beyond my stepmom reacting horribly (I don't really care), I'm so worried about what my grandparents will say or do. I'm worried my dad won't understand. I'm worried something awful is going to happen to my dad, and I'll be wracked with guilt for the rest of my life. \n\nThis is the last step in the way of me hitting therapy hard. I'm already learning how to be assertive, how to talk about my feelings, what healthy relationships look like, and who the fuck I actually am. I know this will be good in the long run, but the guilt I've been programmed to feel is consuming me. What's it like on the other side? Did you open up communication later with those that didn't actively participate in the abuse?",
        "created_utc": 1487559745,
        "upvote_ratio": ""
    },
    {
        "title": "The Empress Had No Clothes",
        "author": "uber-blonde",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/5uywhb/the_empress_had_no_clothes/",
        "text": "Hey y'all- weird memory.\n\nGrowing up in Northern California, we had a beautiful, brand new home. Modern, airy, and spacious. Unfortunately that's also the house where the abuse started with me.\n\nAnyway, my mother had her own dance school and performing arts company. She had a 2-year waiting list so I would say it was successful.\n\nHowever- my mother HAD NO CLOTHES. Literally. She owned 2 pairs of ragged dance tights, 2 leotards (bodysuits), and a dance skirt to wrap around the leotards. She did not get her nails done and never wore makeup. She didn't own any! She had one day outfit. I remember it well. And one formal gown she wore to fancy dinners at the Officer's Club. THAT WAS IT.\n\nI wonder why she never cared about her appearance? Sure, she was pretty au natural, but not groomed or dressed- ever.\n\nI remember never having any clothes either.\n\nI know she spent every penny she made on elaborate ballet productions always starring the golden child (my sister) and I had to dance the villain or rat king. lol.\n\nBallet lessons and piano lessons were my after school activities.. I wanted to take acting, sports, anything else! but she said NO. She was too busy with propping herself up with endless ballet productions.\n\nSeems like she would have cared more about her appearance.\n\nHas anyone else had experience with a narcissist who didn't care about their personal appearance? \n\nETA: Thought more about this while running errands today. Perhaps she could only see herself through other's eyes? Was her self-worth that empty? Was it a symptom of neglect when she was a child? Total indifference to how she presented herself to the world, except through ballet expression? These questions puzzle me.",
        "created_utc": 1487520594,
        "upvote_ratio": ""
    },
    {
        "title": "My husbandÂ´s N-cousin is trying to destroy my marriage!",
        "author": "Lungano",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/5uxzuh/my_husbands_ncousin_is_trying_to_destroy_my/",
        "text": "My apologies for this long text, I think this is the first time I write so much here...  I am an ACoN and today I know perfectly the Ns around me and hopefuly how to keep them away,  but... Two years ago my husband found at Facebook a cousin he had not seen since childhood. I soon realized that they were flirting online, and I got involved in the conversation so that she would know that he was married. She ignored it and continued to look for him, asking for help with her masters project and other excuses. She is a forty-year-old woman in the fourth marriage, a doctor and mother of four children each from a different husband. With each new marriage she lost or gave custody of the child to the ex-husband. Finally my husband told me that he was in love with her, but that he did not want to part with me and that it was something fleeting. She would send gifts to him at our house, and make absurd requests, such as wanting him to teach math for one of her children, to attend her husband's birthday, or to leave the kittens she recently adopted at our home while on vacation, such as If I did not exist and were not there. I am an animal rights activist, and she started to adopt these animals and add my activism friends. I was living part of the time in another city, and I read her messages to my husband saying that she wanted to sleep in my bed while I was away. One day, without warning, she appeared at my door smiling and bringing her little son into the cart and asked to see my husband. I kicked her out and had a horrible fight with my husband, while she continued to send messages to his cellphone demanding that he come down to talk to her, which he did not do. After that he told me they were finished, but then I traveled and mistakenly took my husband's cell phone with me. I could not resist reading all the messages they exchanged and I had a shock: she seems to be much more interested in affecting me than actually being with him; she refers to me in a disrespectful way all the time, gave me nicknames and demands that he tells her if I am sad, if I am suffering, want to know everything I do or say. She also told him how she managed to separate the current husband from an ex-fiance by sending her pictures of her and the man together, and how the woman went into great depression and then died of cancer. The other husbands also had previous relationships that she claims to have destroyed. She seems to take great pleasure in stealing other women's partners and deceiving people, finds it fun to betray and mock without people knowing what's going on. She likes to show herself as an invincible, powerful, a very positive and independent person who conquers all the men she wants and makes other women fools, but she has been a failure in her career. She was furious when she saw that my husband was not going to leave me and demanded that he leave for a hotel. My husband is obviously not doing well, but he's a man in his 60s, very frail and frightened by Parkinson's, and an extremely naive and dreamy person, almost a borderline, a nerd who rarely leaves home. This woman would not have been able to live with him for a week, but she seemed determined to just separate us. I thought they had finally parted, but yesterday I was able to read messages they exchanged at Facebook and I learned that they were still close, and that she separated from the last husband, lost custody of her son - as always, but I believe she actually Has no desire to keep custody of the children - and that they have had a discussion where she claims to have attacked him with a knife in self-defense. In the fight, she ended up getting hurt in the hand, and of course now is being seen as the biggest victim. From the messages I saw she keeps mocking me and created a new profile to spy on my Facebook page. Everything she does seems fake and manipulative, facial expressions, the photo she posted on the pretext of showing the new cat she adopted in which her bandaged hand is the highligth, and a infinity of pathetic posts trying to gather simpathy on her but that sound very fake. For instance, a woman who is in despair coz she may loose her sonÂ´s custody does not take her time posting picture after picture of the baby with stupid emoticons! The woman is a complete psychopath and chose my Life to destroy. But I do not know how to get rid of this her. IÂ´d like to divorce, but it is impossible for practical reasons.",
        "created_utc": 1487506568,
        "upvote_ratio": ""
    },
    {
        "title": "In childhood, I surrounded myself by shitty friends who treated me just like my parents did.",
        "author": "yoyo2016",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/5uuyoh/in_childhood_i_surrounded_myself_by_shitty/",
        "text": "What the hell? :((",
        "created_utc": 1487456009,
        "upvote_ratio": ""
    },
    {
        "title": "The story took a turn. When you open an account in someone else's name...",
        "author": "Eclectix",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/5ur8bu/the_story_took_a_turn_when_you_open_an_account_in/",
        "text": "This is a continuation of my previous two posts, [here](https://www.reddit.com/r/LifeAfterNarcissism/comments/5tnx2i/had_enough_and_said_when_im_the_bad_guy/) and [here](https://www.reddit.com/r/LifeAfterNarcissism/comments/5u9m8j/i_thought_i_was_done_they_opened_an_account_in_my/).\n\nThe bank manager was very helpful and understanding. I was fully prepared to have to try to convince him that they had fraudulently opened this account in my name. I'm not even sure how you would go about proving something like that. However, he told me that the only way to remove my name from the account would be to just close it, and I asked him if we would have to zero out the account first. He said that we would. I told him that I don't plan to pay the amount that the account was in the negative. He said, \"It's not in the negative.\"\n\nApparently, between the time that I found the statement and the time that I got to the bank, they had deposited a rather large sum of money into the account. The bank manager said that he would have to give me the total amount in cash before they could close the account.\n\nApparently these people had not expected me to find out about the account, and had planned to just keep using it. I asked the bank manager what I should do with the cash, and he said that, legally speaking, since my name was the primary name on the account, I was free to do whatever I wanted with it. He suggested that I might use it to replace some of the things they had stolen and broken around our house but that legally it was entirely up to me. My name on the account meant that it was my money to do with as I please.\n\nI had gone in there worried that I would have to fight to get the account closed, and instead I got an envelop full of cash! \n\nMy wife wants to return it to them, because she believes the money is most likely a student loan for the daughter and even though the daughter did steal from us and treat us like crap, her dad was ultimately more responsible for the situation. I myself am torn on what to do but a large part of me feels that we should put it into a savings account in case we end up needing to use it to pursue legal action against them if something like this pops up again. Something tells me we aren't through with these people yet. \n\nHowever, it's sort of a moot point right now as I have no way of knowing where they are nor do I have a phone number for them, and they seem to have blocked us on social media. Something tells me, though, that as soon as they find out what happened to the money then they will be contacting me. You know, it may be a bit petty, but it feels good to have the tides turned for a change.",
        "created_utc": 1487399439,
        "upvote_ratio": ""
    },
    {
        "title": "Came to a point where I feel grateful of the past.",
        "author": "throwawayforrealuh",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/5uqqie/came_to_a_point_where_i_feel_grateful_of_the_past/",
        "text": "Seeing posts here, I guess that's not so normal for one to think of that in such way. \n\nIf I haven't been in that past, I would have never learnt to give emotional support, be skillful at listening to others, to assure myself and know what qualities I possess. Literally the things I learn through the way. If it hadn't been this, I wouldn't have such a deep understanding of the humane things in life. I have a great personality, which is all blessed by the things happening in the past. I don't mean I am stuck in my past, no, I mean I got the opportunity because of the past. \n\nI've learnt to be more caring of others, and offer support in the right way. ",
        "created_utc": 1487391150,
        "upvote_ratio": ""
    },
    {
        "title": "What should I do with these popping memories",
        "author": "throwawayforrealuh",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/5upmw3/what_should_i_do_with_these_popping_memories/",
        "text": "Lately I've realized there are some old memories popping up. I assume this is because I am healing. But then, I'm not sure what to do with these memories. Should I just let them be? You know, I want them to be refreshed --- seeing it in a different way, a different light. \n\nBut then, it's so hard. It's always tied to the abuse. Deep down thou', I can find some individuality.  (i.e. There was a memory where Nmom was playing little dolly toys with me. The purpose in her eyes was of course to accompany her only. However, I realized well actually I like small, delicate things. I like touching them, playing them on my hands, even thou' my Nmom was nagging me. Maybe that's how you extract individuality from an abused memory?)",
        "created_utc": 1487376342,
        "upvote_ratio": ""
    },
    {
        "title": "When the N gets old, poss dying - share your stories?",
        "author": "BabbitandBromide",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/5unl5x/when_the_n_gets_old_poss_dying_share_your_stories/",
        "text": "Hey LAN saviors of my life for all time.\n\nBeen NC for 3 years.\n\nNow my addict Nmom, who destroys my soul on contact, is 70.  Thanks to some flying monkey action I know she's been in and out of the hospital all month, she's drinking and driving, drinking and not paying her mortgage - like, all end game sounding stuff.\n\nI will CERTAINLY NOT be her legally guardian.  Or house her if she becomes homeless - the state can deal with all that.\n\nBut what if I hear she's in the hospital dying?   \n\nI don't even know what's wrong with her, my mind is just ruminating.  THANKS FLYING MONKEYS.\n\nETA: my aunt is texting me to ask me to do some legwork - find out what hospital they took her too, what her doctor's name is, etc.   arrrgghhh",
        "created_utc": 1487354431,
        "upvote_ratio": ""
    },
    {
        "title": "I experienced some boundary-enforcing today and I feel like a wrung out dishcloth",
        "author": "toomuchtooold",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/5unko5/i_experienced_some_boundaryenforcing_today_and_i/",
        "text": "I'm in the process of changing therapists at the moment. Today I contacted the old one to say I wasn't coming back, and why - that was my one boundary enforcement, coming from me. And I got a message from a therapist who I'd arranged to talk to - twice, and forgotten to phone, twice - saying they were no longer able to take me on as a patient (presumably because I've flaked not once but twice on contacting them).\n\nIntellectually I'm at peace with both these interactions. I'm sad to have flaked with the new therapist but I don't have a problem with them dropping me. And with the old one, it wasn't  working for me, and I'm really happy that I didn't remain and pay more money for three or four more sessions and then end up leaving anyway. \n\nBut... I've been practising feeling all the feels recently (reading Pete Walker's books, taking the advice that I need to stop clamping down on negative feelings) and Christ on a bus, how many bloody feelings can a person feel? I feel rejected, by both of them - I feel incredibly ashamed for having forgotten the call, and also for having ditched the old therapist - I feel scared and lonely and guilty about having enforced a boundary. I am having that feeling of I should just crawl under a rock and never speak to anyone again, I must be such an unacceptable person.\n\n*Over switching therapists*. I will never see either of these people in my life again, ever. They are not my friends, I wasn't even at a point where I'd really shared anything very big... it's all good, I think I'm just reeling at how many bloody *feelings* there are when you let yourself feel feelings. Dear christ, how do people *live* like this, you know?\n",
        "created_utc": 1487354301,
        "upvote_ratio": ""
    },
    {
        "title": "I don't know what I'm doing.",
        "author": "bananabrrad",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/5unjzq/i_dont_know_what_im_doing/",
        "text": "My NFOO has crippled me in every way and I'm just lost.  I can do basic stuff but managing my time between college and work is drowning me.  I literally stayed up late fell asleep trying to do homework and woke up at 1am lost and confused.  I just don't know where to start there is so much stuff I have to fix and have to complete and so many opportunities I don't even know what to do.  \n\nI am trying to take a deep breath and relax but every time I do the work just piles up.  I need better time management and to not fall into my Nparents way of coping with it.  I feel lost and scared after cutting everyone off.",
        "created_utc": 1487354110,
        "upvote_ratio": ""
    },
    {
        "title": "Free and good Internet sex dating website with many different girls. My real advice for guys",
        "author": "Adamnabvi",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/5uecub/free_and_good_internet_sex_dating_website_with/",
        "text": "[removed]",
        "created_utc": 1487245605,
        "upvote_ratio": ""
    },
    {
        "title": "I thought I was done. They opened an account in MY name and overdrew it.",
        "author": "Eclectix",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/5u9m8j/i_thought_i_was_done_they_opened_an_account_in_my/",
        "text": "For the back story, see my post in this subreddit from two days ago. \n\nWhen Winston moved in, he had several liens against him. His daughter needed to open an account because she had gotten a job at the local grocery store and they only did direct-deposit paychecks. However, since she was a month shy of turning 18 she needed someone to sign off on it. He couldn't sign off on it because his name would be associated with it and so any liens against him would be instantly taken from her account as soon as they deposited her paychecks. So they asked me if I would sign off on it. This was last year, before the SHTF.\n\nI agreed to see what I could do, but as it turned out the bank we went to wouldn't allow it because I was not a blood relative. Winston tried to encourage me to lie and tell them that I was actually related but I was not okay with that, and as a result the account application was denied. My wife, however, banked somewhere else where she knew they would allow her to sign off on an account, so she took her to that bank instead and set up an account with the caveat that as soon as the daughter turned 18, my wife's name would be removed from the account. And so that is what happened.\n\nWell yesterday I got a statement in the mail addressed to Winston's daughter AND myself, for an account they opened with the initial bank, in my name and his daughter's name. She has overdrawn this account by several hundred dollars and it is collecting fines.\n\nI know for a fact that they have, in the past, counterfeited documents, forging doctor's signatures to get their kids out of school, and he even bragged once about forging birth certificates. I believe that they simply returned to the bank with the form information I had already filled out and claimed that Winston was me and also a blood relative, and went ahead and set up the account in my name, forging my signature.\n\nI called the bank and explained what happened, and they said that I would need to visit a local branch and ask them to remove my name, but that they probably wouldn't be able to do so until the amount in arrears has been paid. They said that if it is in fact a case of fraud then I will need to go to the police.\n\nMy plan right now is to contact these people and give them one last opportunity to do the right thing and remove my name from this account, before contacting the authorities. Good grief; I thought I was done with these people forever. No good deed goes unpunished.\n\nEDIT: Everyone is telling me to just go to the police. That's probably the best advice. Right now I'm planning to talk to the bank manager and see what information they can give me. The thing that makes this difficult is the fact that I did try to help her open an account there, so it sounds fishy for me to say that they did this on their own without my knowledge, and while I know for a fact that this is what happened, I'm not sure how I will be able to prove that. But I'll talk to the bank manager and see if they have any suggestions in that regard, too. The idea of freezing my credit right now is a good one, too. Thanks for all of the expressions of concern as well. ",
        "created_utc": 1487186547,
        "upvote_ratio": ""
    },
    {
        "title": "I learnt what goes on in a narcissists head, and it is isn't \"I am better than you\".",
        "author": "mxdb",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/5u8t51/i_learnt_what_goes_on_in_a_narcissists_head_and/",
        "text": "[removed]",
        "created_utc": 1487179128,
        "upvote_ratio": ""
    },
    {
        "title": "I understand the necessity of no contact",
        "author": "clown-penisdotfart",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/5u6z4w/i_understand_the_necessity_of_no_contact/",
        "text": "I harbored insane fantasies of reconnecting with her (not to be with her as much, more just to be with my kids and tolerate her) up until last week, then the shit really hit the fan and I finally blocked her and stopped looking at old pictures.  It will be a long time until I can go full no contact because of the children, but this was a massive help... for a few days.  I got curious and unblocked her.  It was stupid.  I looked at a couple pictures.  It has really thrown me off.\n\nNow that I've experienced being unwound, I understand why no contact (or as little as possible) is required.  I'll never stop hating her, and I will NEVER stop fighting for my children, but I need to push her out of my mind somehow as much as possible, and as close to no contact as can be is the only way.",
        "created_utc": 1487160406,
        "upvote_ratio": ""
    },
    {
        "title": "24 Lauren",
        "author": "Masonstameg",
        "url": "http://imgur.com/1jFpZ97",
        "text": "",
        "created_utc": 1487097956,
        "upvote_ratio": ""
    },
    {
        "title": "Thirsty N",
        "author": "Wildkittten",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/5tyqrl/thirsty_n/",
        "text": "I guess my NDad did something at work last week that he thinks is a big deal. He's been emailing me articles he wrote himself about his accomplishments. I genuinely DGAF about his work, but it is trilling to be able to ignore him and not be on call to reassure his insecurities (which I think was my role as a child.)",
        "created_utc": 1487055604,
        "upvote_ratio": ""
    },
    {
        "title": "Extraction mission after NC",
        "author": "lastserenity",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/5tvlbi/extraction_mission_after_nc/",
        "text": "I am planning a trip to my NDadâ€™s house to recover old photos, videos, data, and other things of mine from childhood and adolescence he may have lying around. Iâ€™m trying to map out my past and what he has over there are my final clues.\n\nI have been NC with him for two years. He has hoovered with useless gifts and stalked me by sitting in at local coffee shops and who knows how else. I retch at the idea of ever having another conversation with him or giving him the satisfaction of seeing me show up on his doorstep, but filling in the gaps of my life with proof of what happened outside of faulty memories is more important to me now.\n\nThis is the absolute last thing Iâ€™ll ever need from him. I did not feel like those things mattered when I decided to go NC because I had such a weak sense of self being under his spell. It took this time to get to a point where I finally started feeling myself and giving value to the things that actually matter, like my own story, which I was never allowed to have because of him. I figure I have to do this sooner or later, with sooner being better because there will be more progress to lose the longer I wait, and as time goes on there will be less things left from those days as well.\n\nI am planning to show up unannounced so that he doesnâ€™t have time to devise schemes. I will not show emotion or be receptive to any conversation outside of what I came for. He will most likely try to \"affectionately\" touch me as well so I will have to be vigilant and nonchalantly dodge his attempts without otherwise showing any reaction.\n\nTruthfully, I'm quite terrified about the prospect. Can you advise me on how I should proceed? Any mistakes in my plan or thinking? Thank you.",
        "created_utc": 1487020461,
        "upvote_ratio": ""
    },
    {
        "title": "Mine and the girl he cheated with's impending births has shaken me up and feeling sad.",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/5ttbaq/mine_and_the_girl_he_cheated_withs_impending/",
        "text": "[deleted]",
        "created_utc": 1486998301,
        "upvote_ratio": ""
    },
    {
        "title": "Good to see you again",
        "author": "Gideonoven",
        "url": "http://imgur.com/HrcmIxx",
        "text": "",
        "created_utc": 1486943112,
        "upvote_ratio": ""
    },
    {
        "title": "Had enough and said \"When.\" I'm the bad guy?",
        "author": "Eclectix",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/5tnx2i/had_enough_and_said_when_im_the_bad_guy/",
        "text": "Obviously this is going to be a long post! I'll put the TL;DR at the bottom. I just have to type this all out so that I can see it. It's too much for me to keep it just swimming around in my brain. I am not worried about posting here because I am fully confident none of the people involved browse Reddit. But I won't use real names anyway.\n\nMy wife and I met a family a few years ago and befriended them. They were quirky, we are quirky; they had kids, we had kids; and so we sort of hit it off. This family consisted of a 50-year-old man and his two kids, a teenage girl and a boy. I'll call the man Winston.\n\nTo get to the meat of the story, Winston was unemployed and had been for several years. He blamed this on his ex-wife, who legitimately was crazy. I'm not sure how he figured she kept him from being employed, but he always had an excuse for everything and that excuse usually came back to his crazy ex-wife somehow. So he had been scraping by for years waiting for the kids to be old enough that he could go back to work (this is his reasoning). Now that his oldest daughter was about to graduate high school his plan was to be able to finally start his business and make lots of money (he always had a plan to make lots of money) and pay off his debts and they would finally have the wonderful life they always deserved.\n\nCue last November. He was about to be evicted from his house because he could not pay rent and had been late several times in the past. He had been putting off payments because he figured once he got his tax returns he could catch up again, but it was too little too late. His car had died and he couldn't get his kids to school. He was on the verge of being homeless with his two kids for Christmas. While he had family, they were not on good terms and would not help him. He had no other friends (he blamed his ex-wife for this too). He looked like someone who was hitting rock bottom. My wife and I had a car that we were not using; it needed new brakes, but it ran and everything so we straight-up gave them our car, knowing that he was capable of doing the work himself that it needed. We also paid for January's rent ($700) to keep them from being evicted. They said that they would pay us back; we told them that if they felt better paying us back then that's fine, but that we had no expectation for them to do so.\n\nBy the end of December they told us that they were being evicted anyway, regardless of whether or not they paid rent. They portrayed their landlord as a mean and terrible person, although he had been pretty patient from what we could see. This should have been a sign that there was something else going on, but hey, mean landlords do exist. However, my wife and I had already noticed that they weren't exactly great tenants either. They were very messy, left food out to rot all the time, generally trashed the yard, etc. Nonetheless, what kind of friends would we be if we let them become homeless? So we did what we felt we had to; we invited them to live with us, just for three months, until he could get a job and get back on his feet. We did this with the following conditions.\n\nCondition number one was that he get a job and save enough to get an apartment. \n\nNumber two was that they abide by our simple house rules (the same rules we had for our own kids, stuff like no name-calling, respect others, no food in the bedrooms) and contribute to the chores (the same chores we expect our own kids to do).\n\nI should also add that my wife and I do not life extravagantly. We both suffer from physical disabilities and canâ€™t work full-time jobs. Most of my actual work these days involves me caring for my wife, who is a disabled veteran. We make do but we usually are pretty tight for money by the end of the month as it is. However, we figured we could tighten our belts a bit more to help out a friend in need. But this explains the third condition of them staying with us, which was that he bring in food for the household through the public assistance programs he was already using, including going to various food banks.\n\nWe didnâ€™t charge them rent or ask for payment of any sort other than that they meet the above three conditions.\n\nThey agreed to our conditions and moved in last January. Now I'm an introvert and I like things quiet and calm, while Winston is a very high-maintenance person who exudes strong energy all the time. We knew it would be a challenge having his family in our home, but we really felt like we had to invite them to stay in order to be the kind of people we wanted to be. \n\nHowever, right from the start it was difficult getting him to respect our boundaries. He simply didn't understand the concept of personal space, and as a consequence neither did his kids. This was one of the most difficult things to deal with. This was the behavior which I think most exemplified his narcissism. For instance, he would often insist that you do something you had no interest in and would not take â€œnoâ€ for an answer. A typical morning conversation would be something like this;\n\nWinston: \"You look bright and sunny this morning, would you like some coffee?\"\n\nMe: \"No, thank you, I can't drink coffee, remember? No caffeine.\"\n\nWinston: \"Well I have this decaf coffee, would you like some of that?\"\n\nMe: \"No, thank you, I'm fine.\"\n\nWinston: \"But this is really nice coffee, it's not that cheap stuff.\" (He always had to have the \"best\" even though he was broke; he would use food stamps to get expensive shit nobody needed. However, his idea of the good stuff was very arbitrary. More on that later...)\n\nMe: \"That's okay, thank you anyway.\"\n\nWinston: \"You sure? We also have tea. Would you like some tea?\" \n\nMe: \"No, thank you; I can't have caffeine, remember?\"\n\nWinston: \"Well this is decaf coffee, you can have that, right? Here, I'll pour you a cup.\"\n\nMe: \"No, really, I'm fine, thanks though.\"\n\nWinston, already starting to pour a cup: \"You sure? It's the good stuff. And we have this great flavored syrup you can add. You want raspberry, or caramel?\"\n\nMe: \"No, I really don't want any. Thank you anyway.\"\n\nThis exchange would go on for a ridiculous amount of time and would repeat over and over again, in nearly every situation. He could not stand anyone expressing their own will. He was just like this with his own kids too; would not let them say no, ever, even to express whether or not they liked something. He would physically invade their boundaries, too; if his daughter (nearly eighteen years old) said that she wasn't hungry, he would literally push food against her mouth and say, \"Eat it. Eat it. Eat it. Eat it.\" Over and over until she would finally relent. He would poke at his kids playfully, but he wouldn't respect when they weren't having fun anymore and would just keep at it. \n\nWe struggled for months trying to help him understand what boundaries are and why they were important. He often talked about how he and his kids were special and how stupid other people were. In fact he often talked to his kids about an imaginary island that they pretended they were from, which is why they were so different (i.e., better than) everyone else, and also why they had so much difficulty getting along with other people and generally surviving in society. He even had a name for it, The Island of Wadda-wadda-bing-bang.\n\nBut before I get ahead of myself, let's get to why they stayed longer than three months (surprise, surprise).\n\nSo true enough he did get a job, at the Starbucks near where his kids went to school (about a half hour from our house). He worked there for about two months before he got extremely ill. He was coughing constantly. He looked like he was going to fall over anytime he stood up. We finally convinced him to go to a doctor and found that he was suffering from congestive heart failure. He needed to have several emergency procedures done right away. None of the procedures were effective and things kept getting worse and worse. By the time three months was up it was unthinkable that they could leave. Heâ€™d had to quit his job because he was in the hospital so much, and his doctor told us it would kill him to try to work with his heart the way it was. We simply had to wait until he could work before they could leave, which was always â€œjust a couple more monthsâ€.\n\nSo we extended our plans and let them stay while he went through procedure after procedure, none of them effective. This explains the length of their stay, but it doesn't even scratch the surface of the drama that was to unfold...\n\nSo when I said that he had to have \"the best,\" I mean he was extremely snobby about certain things like what brand of coffee to drink, but it was more than that. For instance, his family loved to watch Chef Ramsay and based on some tidbits they gleaned from his shows, they thought that they were gourmands. \"Did you use truffle oil to cook this? Chef Ramsay said that no true chef would ever use truffle oil.\" Seriously. More on that later...\n\nBut the thing is, that while they were so snobby, they simultaneously ate pure garbage 95% of the time. He would bring home food from the food bank, and it would be almost completely garbage. A typical week's haul would include two sheet cakes, three pies, two flats of cupcakes, four or five loaves of bread, a few boxes of cookies, a bag or two of candy, five gallons of milk, three or four cans of frosting, a few boxes of snack crackers, three or four canned soups, a bag of fruit, and a couple of cans of vegetables. \n\nNow I understand that you don't always get much choice at the food bank, but he would always bring home the most sugary junk that he was allowed, and only took the minimum that he was required to take of things like fruits, vegetables, and canned items. He would say that he just had to take what he was given and that he had very little say in what he brought home. However, they would complain about the food that we cooked because we used things like broccoli and mushrooms and peppers, and then they would open up a can of frosting and eat it like ice cream while watching a movie. And I don't mean that they would share a can; they would each get their own can of frosting and eat it with a spoon. This was their go-to movie-watching treat. They would eat cake and pie for breakfast. For dinner they would boil some pasta to a mush and pour a jar of sauce on it, along with some bread smothered with cheese that they usually burned to the point that our house reeked like a smokerâ€™s lounge, followed up with more cake and pie or another can of frosting. This was their typical diet, which might explain why he was suffering from heart failure.\n\nBut the conflict for us was that this was causing issues for our own kids as well. Try telling your kids that they need to eat healthy when other kids in your house are having chocolate cake and pie for breakfast every morning. We asked him repeatedly to try to not bring in so much junk food, we talked to him about how it was not good for his heart, talked to him about the bad example it set for our kids. He would agree to do what we asked, and then the next time we went to the food bank he would bring home a huge haul of vegetables. I mean massive, like five flats of onions and two dozen large spaghetti squash and bags of celery and tomatoes and flats of fresh strawberries. But then he would go right back into just bring home the same old junk food again. This only made us more annoyed, because it proved that it was possible to get vegetables from his sources, but that he didnâ€™t want to and was just making excuses.\n\nSo eventually he just started keeping all that garbage hidden in his room, where he and his kids would sit together and eat it while watching movies. This was of course a violation of our rule not to have food in the bedrooms, but he justified it somehow. He always tried to rationalize things away with obvious BS. \n\nI mentioned earlier how he trashed his old residence, but I never really got to the extent of it. They  left cooked food out, for weeks or even months at a time. Their garage floor was crunchy from mouse droppings and their air was thick with flies. Once we started noticing the smell and seeing the flies, we knew what they were doing. We were not about to let our house end up like his last home did. But every time we confronted him on this behavior, he kept trying to justify breaking our rules. Many times we told him that if he had a problem with our rules then he could talk to us and explain his case. But he wouldnâ€™t; he would just ignore them instead. And he encouraged his kids to do the same. They acted like we, and our rules, were simply beneath them.\n\nI realize now that this is turning into a small book, and yet I have only begun to record this whole ordeal. So to prevent his from becoming a novel, let me just list the highlights:\n\nHe downloaded a number of movies illegally and we ended up getting fined over $500 for them. Of course he could not pay for this. He did say that he was sorry and he never did it again, but stillâ€¦ Jesus, man.\n\nHe wanted to go to Florida because he wanted to establish residence there to get away from his ex-wife, so we paid for his family to go with us to Florida to join us on our family vacation; paid for them to go to Disneyworld, and took them to Key West. Took them to a fancy restaurant just because sometimes itâ€™s nice to splurge and we were hoping to give him a break from his stress. In return, he incessantly complained that the Florida Keys were not â€œas Florida Key-ish as he expected them to be.â€ Yes, he literally blamed the Florida Keys for not being as much like the Florida Keys as he wanted them to be. He criticized the four-star dinner that we bought him; â€œItâ€™s good, but it would have been better if the chef had done X and Y.â€ Disneyworld was, of course, way too hot. And he had a fit because his son lost his phone charger and my daughter was reluctant to share hers because she didnâ€™t want hers to get lost too. He actually ended up stealing her charger and then said that it was his charger. \n\nThey broke my wifeâ€™s ironing board and then hid it in their closet.\n\nThey lost most of our silverware because they would take it with them when they ate in their car.\n\nThey would take our tools and craft supplies without asking, and then say that they didnâ€™t know where they were and claim that they never touched them.\n\nThey never said thank you for anything. Never showed any appreciation. When this was pointed out, he would object and say that he really appreciated what we did, but that would literally be the extent of it.\n\nThey dropped my wifeâ€™s expensive embroidery machine (her only possession of any real value) down the stairs and broke it, then tried to brush it off as being fine and not really broken. If I had not been there and heard it then we never would have known what happened (just like the ironing board which they hid in their closet after breaking). The embroidery machine is worth over $3000. They did NOT have permission to use it.\n\nThe embroidery machine was the last straw. We told them that we had no more to give. They needed to leave. We had given them more than $500 to help pay their storage fees for all their stuff. We had given them free room and board for a year. We had bought them furniture that weâ€™d told them they could keep when they left. We had bought them each new cell phones and paid for their service. We had paid their various fines and late fees. We had paid over $500 for a lawyer so that they could claim bankruptcy. We bought them underwear for crying out loud because they didnâ€™t have any. We had shared our home with them and our vacation with them and in return they never showed us basic respect or appreciation.\n\nAnd now that they are finally gone, as we are repairing the damage they have done to our house, we have discovered that, really, we were the bad guys, donâ€™t you know? Yep. Mean old us. Their situation is now our fault, and they are telling the sob story of their mean landlords (us) who evicted them right after Christmas. When we found that they had left a book of checks behind, my wife messaged them and asked if they would like to pick them up. Their response? â€œJust throw them away youâ€™re good at that.â€ \n\nAnd so now we know why he had no other friends or family to support him, and we are simply the latest in a string of people he has used up and tossed away. \n\nTL:DR:  We paid for a friendâ€™s rent, gave them a car, let them move in with us rent-free for a year, drove his kids to school and back every day, took them to Disneyworld, paid over a thousand dollarsâ€™ worth of fines for them, bought them furniture, bought them phones and paid for their service, and in return they destroyed our property, stole from us, lied to us and about us, and generally treated us with disrespect. We finally said â€œenough,â€ so now we are the bad guys.\n\n\n\n\n\n",
        "created_utc": 1486931043,
        "upvote_ratio": ""
    },
    {
        "title": "How do you go NC when you have 2 kids together and still working out details of the divorce?",
        "author": "icicleridge",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/5tnjyg/how_do_you_go_nc_when_you_have_2_kids_together/",
        "text": "",
        "created_utc": 1486927900,
        "upvote_ratio": ""
    },
    {
        "title": "Healthy guilt and shame",
        "author": "toomuchtooold",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/5tml8h/healthy_guilt_and_shame/",
        "text": "I was thinking about stuff - well, I was thinking about my crisp habit really. How do I kick my crisp habit? My inner critic can supply lots of \"motivation\" in the form of searing character assassinations about how greedy, fat and unacceptable I am but I've been trying to move away from that sort of thing. It sucks the life out of you, anyway - to achieve things not for their own sake but because you're scared of the inner critic's reaction to anything less than perfection. When I went into recovery from my childhood with an abusive narcissist, I said I was finished with being motivated by guilt and shame.\n\nBut... some things that people do are shameful, aren't they? I mean there's big stuff, if you really hurt someone else, if you steal or kill or are cruel. It's appropriate to feel guilt and shame in those situations, isn't it? Couldn't it also be the same for smaller \"crimes\", for doing things that are not in line with one's own values?\nIDK but my new self-development goal is to read about guilt and shame and whether they have a healthy function, how that works, what I \"should\" feel guilty about as an emotionally healthy person. I've spent a lot of time rehabilitating sadness and anger, so maybe it's time for the other two negative emotions?",
        "created_utc": 1486920024,
        "upvote_ratio": ""
    },
    {
        "title": "Idk anymore. A huge rant?",
        "author": "throwawayforrealuh",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/5tlrqa/idk_anymore_a_huge_rant/",
        "text": "I feel incredibly drained this week. Actually, the whole entire time. I think up to some point I can't take this no more. It's been so wrenching(pardon me for my english).  On a random basis, or more like a daily basis? I don't know, I will just think of killing myself. Something shit will happen in life and I will just be start thinking of killing myself. I hate myself so much for this because the small shits that triggers me are so small that literally, it doesn't make sense at all -- I mean, my feelings doesn't make ANY sense. And by this, I do mean they don't make ANY. It shows how the abuse was instilled upon me the entire time.  Sigh. I can't believe it's been 2 years and I am still like this. I can't believe I'm typing like a drunk loser on reddit. I just flipped through the other page of this reddit and saw how everyone was titling so neatly. I think I'm a big fucking loser. Now I'm looking back at this pile of shit I just typed and think, my did I loose my consciousness when  typing all these things. \n\nReally, it's been so hard. I love my cat so dearly. I don't want to dig up more shits but then I have to. I can't believe this is happening. It breaks my heart to know he has been through that. I just wanna cry now this point. How can they do this to him ?? I just .. CAN'T BELIEVE... I don't want to forward the whole email but [this](http://i.imgur.com/mwOE0Yz.png) is what she wrote. WTF! WHAT THE BIG FUCK!! \n\n",
        "created_utc": 1486911365,
        "upvote_ratio": ""
    },
    {
        "title": "Survivor of Narc abuse - now I have regular thoughts of WANTING to be physically &amp; emotionally abused.",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/5tkxg0/survivor_of_narc_abuse_now_i_have_regular/",
        "text": "[deleted]",
        "created_utc": 1486899095,
        "upvote_ratio": ""
    },
    {
        "title": "Freaking out, would like some words.",
        "author": "pinkdaisytotheleft",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/5tkmu7/freaking_out_would_like_some_words/",
        "text": "Update 2/22:&amp;nbsp;\n\nAgain, thanks for everyone who responded back to me. I just came back from the dentist. Somehow my X-rays got lost, but I think they'll contact me when they find it.. Honestly, I'm a bit confused because I was damn sure that I had cavities, because when I bite sometimes, it sends shocks down my jaw (but I'm looking into it myself, to find what else it could be.. I forgot to mention it to the dentist..) Somehow, after 4 years of no dentist visit, there's no cavities in the \"bite\" or \"butterfly?\" x-rays. I was getting so many dreams about my teeth rotting and falling out.. so I guess I'm just stressed out cause I'm living with the Ns (a sort of redirection of fear/mind playing tricks?). But after 4 years, it took more than it usually took to clean. But anyway, I still have to see.. the x-rays aren't found yet, so yeah. Probably the main take away from this is, I'm a huge scaredy cat.. but I still appreciate people looking out for me, so thanks guys!\n\n&amp;nbsp;\n\nUpdate 2/15: &amp;nbsp;\n\nThanks to everyone who replied to my post. I feel the care through your words, which make me feel better. Still a bit nervous, as I have no idea how much the complete cost will be (by the end of all the dental visits I mean), and my appointment will be next week, but I found a dentist I think I'll like, so I'm kind of excited to an extent (but not THAT excited since I do have... a black line on the side of my molar,-- sorry for being redundant/repetitive.) Ah.. I'm expecting the worst, but hopefully I'll just get through it without too much stress. I've fucked up, that's for sure. &amp;nbsp;\n\n&amp;nbsp;\n\nTLDR:&amp;nbsp;\n\n- Found a cavity (not a surprise considering my dental hygiene habits, or lack of rather) And I'm trying not to freak out, but I'm seriously freaking out.\n&amp;nbsp;\n\n- Going to new dentist (need to make appointment), nervous (still under parent's health insurance).\n&amp;nbsp;\n\n- I'll be paying how much? Hidden fee? \n&amp;nbsp;\n\n- Living with parents still, and life sucks.\n&amp;nbsp;\n\n&amp;nbsp;\n\nLong Read:&amp;nbsp;\n\nHaven't gone to the dentist for I think it's been two or three years now. I haven't been taking care of my teeth that well. I'm under my parents health insurance, but I don't want to see the dentist, because it's the same one my parents use, and I don't want anything to do with them, even though at the moment, I have no choice but to still live with them. I'm trying to separate what I can, away from them, but to my expense apparently-- there's a black line on the side of my molar.. cavity. A very, very nice surprise indeed. I don't know what I really expected honestly, I've had a few tooth aches these past few months, but nothing that lasted that long or bothered me when eating, so I was really like meh, I still don't give a fuck. Except, now I do, because it looks like a cavity, what else could it be. I've never had one, so I've never had to endure any sort of pain in that way. Now, I feel like hitting myself in the head because. there. is. a. black. line. on. the. side. of. my. molar. Like, besides that fact that I want to curse and scream that I'm still living with my parents, I really want to curse and scream at myself. And I'm freaking out because I've never had to make a dentist appointment (at a new one.) I have no idea how much it costs. Like, what are the hidden fees or whatever they're called? Like, later on, they bill you for this unexplainable high amount for some reason they never tell you in the beginning? It'd be nice and I'd be grateful if someone could point me in a direction or explain. ",
        "created_utc": 1486892565,
        "upvote_ratio": ""
    },
    {
        "title": "The girl wants to blow job",
        "author": "Owencomjews",
        "url": "http://imgur.com/H38ULIR",
        "text": "",
        "created_utc": 1486806402,
        "upvote_ratio": ""
    },
    {
        "title": "What progress have you made since cutting out your nparents?",
        "author": "yoyo2016",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/5tc1nl/what_progress_have_you_made_since_cutting_out/",
        "text": "",
        "created_utc": 1486785504,
        "upvote_ratio": ""
    },
    {
        "title": "Post narc abuse",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/5t8w9b/post_narc_abuse/",
        "text": "[deleted]",
        "created_utc": 1486750491,
        "upvote_ratio": ""
    },
    {
        "title": "Victory yesterday!",
        "author": "failingstrength",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/5t7svk/victory_yesterday/",
        "text": "I went back home yesterday for my dad's birthday... My mom is usually the problem so I agreed to go out for a couple hours. During that time my Dad somehow brought up a time recently when I needed a small loan (I was hospitalized and needed a $300 to pay my rent). He made it sound like I never asked them. \n\nI found the strength to actually stop him, told him to not rewrite my history. Reminded him I did ask and HE SAID NO. \n\nI just had to share because I'm proud of myself for standing up for myself.",
        "created_utc": 1486739715,
        "upvote_ratio": ""
    }
]