[
    {
        "title": "TEDxNewy 2011 - Liz Mullinar - Treating the core problem of childhood trauma.",
        "author": "saddetective87",
        "url": "https://www.youtube.com/watch?v=svX3fEdVTLQ&amp;list=WL&amp;index=177",
        "text": "",
        "created_utc": 1452115861,
        "upvote_ratio": ""
    },
    {
        "title": "Why NP's cannot be reasoned with. \"Rage—Coming Soon From a Narcissist Near You\"",
        "author": "saddetective87",
        "url": "https://www.psychologytoday.com/blog/just-listen/201202/rage-coming-soon-narcissist-near-you",
        "text": "",
        "created_utc": 1452111216,
        "upvote_ratio": ""
    },
    {
        "title": "How to Train Your Mind to Think Critically and Form Your Own Opinions",
        "author": "strawberrymangopeach",
        "url": "http://lifehacker.com/how-to-train-your-mind-to-think-critically-and-form-you-1516998286",
        "text": "",
        "created_utc": 1452092281,
        "upvote_ratio": ""
    },
    {
        "title": "Cross post from /r/AbuseInterrupted: life lessons we were never taught.",
        "author": "saddetective87",
        "url": "https://www.reddit.com/r/AbuseInterrupted/comments/3mpdhd/what_is_a_sure_sign_of_maturity_collated_from_a/",
        "text": "",
        "created_utc": 1452077363,
        "upvote_ratio": ""
    },
    {
        "title": "[update]When NAunt blames you for her greeting",
        "author": "throwawayyy3421",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/3zpar3/updatewhen_naunt_blames_you_for_her_greeting/",
        "text": "So I got an email from her: \n\n\"On Sunday you mentioned if I want to know anything about you I should talk to you first. I thought it was a good idea as you now are a mature adult.\n\nI am taking time off from work for health treatments. I can take you out for coffee or lunch so we can talk and get to know one another during week days.\n\nI hope you know that I always want to be closer to you and support you but I just don't know how. Please forgive me for all the thing I have done that hurt you through out the years. Now it's your turn to tell me how you want to be treated.\n\nThis is my email and my home number is ____. I check email more often than cell phone and text messages. I am all booked this week. Hope to see you next week. If you need time to think about this, just take your time.\nLove,\nNAunt\"\n\n\nI really dont care for her at all. I think I am going to ignore her.",
        "created_utc": 1452076944,
        "upvote_ratio": ""
    },
    {
        "title": "Where's the the bathroom? (Mom visits)",
        "author": "_ism_",
        "url": "https://www.youtube.com/watch?v=VJg1zRgkbno",
        "text": "",
        "created_utc": 1452066792,
        "upvote_ratio": ""
    },
    {
        "title": "Decluttered my apartment - suddenly terrified there is 'nowhere to hide'",
        "author": "PrancerPrancer",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/3zosak/decluttered_my_apartment_suddenly_terrified_there/",
        "text": "Spent 3 whole days tidying, cleaning, and decluttering our apartment. It looks great, and everything will be easier to find now - really pleased I made the time and mental space for this. \n\nBut as I was falling asleep last night, I suddenly woke up feeling terrified. I had this strong sensation that there was nowhere to hide.\n\nI remembered that the Nrents would lay into me about how dirty and messy I was. But, when my room was clean and tidy, or I cleaned the house, then, they would lay into me instead. If they couldn't tear me apart for being messy, they'd tear me apart for being me (selfish, mad, uptight, cruel, calculating, judgemental etc)\n\nSo I've been deliberately a bit messy, still thinking someone might show up and lay into me. Of course I'm NC now, so that's not possible. I can have my home how I like, without fear of another character assassination. F*#k you NMom EDad. \n\nDAE relate?",
        "created_utc": 1452065455,
        "upvote_ratio": ""
    },
    {
        "title": "Feeling a bit stung by therapy words (rant/advice - wordy)",
        "author": "TheTartanDervish",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/3znfns/feeling_a_bit_stung_by_therapy_words_rantadvice/",
        "text": "Background: The epic battle against Uncle Sam is coming to a head, the USMC itself has sent an investigator who's on my side to fix and finalize my case.\n\nThe past 10ish weeks have been a shitshow of no sleep, three other cases on the go already (USMC will help with those too) - but no sleep, and especially no home help/aide despite all my doctors' many efforts because of one of my injuries continually ripping up since the VA stopped paying for therapy in July,  and I just can't keep up with this shit. It's taken me almost 2 months to pull together a 3-page form - all the spoons I have go to keeping my service animal fed/healthy, me doing laundry/food, and a lot less cleaning than I'd like. But all the social services are so overloaded that I can't get even a paperwork helper to do a session or three - last time I filed a case it took 25 hours to get everything documented, duplicated, cover letters written, everything bound, then mailed. If I use all my 3 spoons for nothing else for 8 straight days... not realistic.\n\nAnyway, most of you know the VA has fucked up my case in every possible way so I've been homeless a few times and now staring down medical bankruptcy soon-ish. Plus a sexual assault and negligence and malpractise and they really do NOT like women. Their behavior is pretty textbook \"Zersetzung\" which is an old DDR (East German) secret police tactic of making someone's life so thoroughly miserable that they break.\n\nACONs will be familiar with this since we grew up in it.\n\nThe USMC sees it, the doctors all see it, the dentist sees it (one of my Iraq injuries is dental and it was mostly fixed by fundraising last year, but there's more to do now), my social worker sees it...\n\nBut today my therapist said, \"So you're convinced that the VA is sociopathic - this Zersetzung - really?\"\n\nShe sounded very unconvinced and, since I haven't slept much in ten weeks, I may be overthinking that she's dismissing my concerns or that she thinks I'm getting paranoid - but I don't the the Corps itself would assign me an investigator if there wasn't a clear problem of no help and no hope here.\n\nSo I just wanted to check in - is this the tired talking? Am I overthinking my entire case (as ACONs tend to do having grown up with judges/interrogators for parents)? When I don't sleep then the pain and depression kick up, am I just feeling to negative/upset about this one remark? Is this just me feeling oversensitive to the \"crazy veteran\" stereotype?\n\nAlso I couldn't take S (my support animal) because the other therapist's client has his dog, my cat was rescued from a pit bull place (his trainer said that's why he's a natural for detecting my ptsd issues) so it was my week to go without.\n\nShe's on my side and very helpful, but this stung me and I can't think why. I know I was just circling around topics saying I was totally overwhelmed with just trying to keep the house   myself together, I'm despairing of doing all the tasks the USMC rep and my social worker and lawyer need me to do first.\n\nI just want to toss everything in a fire and then go live on a nice warm tiny island where nobody bothers me ever. I have so much more I can do - researching, writing, teaching, even parts of my old work - maybe it's the ten-year anniversary of my medical retirement upsetting me, but I feel like I've wasted ten years for paperchasing, like Kafka in his Trial. (written while he was a claims adjustor at a medical insurance company, haha)m\n\nAnyway I'd appreciate your insights since I can't think very well or objectively tonight. Thanks Lan!",
        "created_utc": 1452044246,
        "upvote_ratio": ""
    },
    {
        "title": "Covert Narcissism, DAE recognize this pattern?",
        "author": "oldestofNmom",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/3znd3r/covert_narcissism_dae_recognize_this_pattern/",
        "text": "Nmom likes to milk gift-giving for N-supply. If you want her gifts, you have to run her gauntlet of multiple emails discussing every aspect of the gift and when the discussion dies down, she offers to buy you something else and keeps the dance going. I decided not to play this year and sent a sarcastic email that shut the whole thing down. It was a good thing too because I heard from others that she really ramped it up this year.\n\nAfter Christmas we exchanged pleasantries and I went back to my standard boundaries of limiting my side of the conversation to the weather and her dog.\n\nShe mentioned my Christmas card, and I used the opportunity to mention that I would prefer not to exchange gifts anymore. That this year I would just send cards and she was welcome to do the same. I followed this with more chatting about the weather and the dog.\n\nWhat I got back stunned me. She sent a long email telling me how proud she is of me, mentioning stuff I've accomplished and things I've done for her. There was some stuff about how she learned from her parents to see good in bad, and how she was sorry for (unspecified) things she's done and she hopes we can get past it. That she continues to work on our relationship.\n\nI don't know if this resonates with any of you. I know it might seem like the kind of email we dream of getting. I thought so too when I first got it. But at the same time, it made me immediately furious and also guilt-ridden. And I finally figured out why.\n\nFirst, it was still all one way. She shows absolutely no interest in what our relationship or my life feels like to me.\n\nSecond, it was inappropriate in context. It's how she handles anger, weirdly. Which brings me to ...\n\nThird. Here are the dots she laid out for me to connect: I want to stop exchanging presents...but Mom thinks I'm wonderful...therefore any problems in our relationship must be in me....thus I must be mean to want to step back from a relationship with such a wonderful mother. \n\nI felt this...but had to work hard to explain it. And I am over 50 years old. No wonder my childhood was so emotionally painful. I didn't have a chance.\n\nNote: This is what I think of when the definition of narcissism starts with \"everything is deniable.\" It's so insidious. I know it's abuse because of the emotional and psychological injuries it causes to everyone who is around her, but it's almost impossible to explain to anyone else. I'm not really sure anyone here will understand either. Does anyone have a parent like this?",
        "created_utc": 1452043285,
        "upvote_ratio": ""
    },
    {
        "title": "At some point, you scream 'ENOUGH! I'm darn near forty years old. I don't need any more criticism from narcissists!",
        "author": "CottageDweller",
        "url": "http://www.lenorathompsonwriter.com/blog/thanks-for-the-criticism-but-ive-already-got-plenty-of-character",
        "text": "",
        "created_utc": 1452041998,
        "upvote_ratio": ""
    },
    {
        "title": "the importance of nutrition",
        "author": "candleflame3",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/3zmzrp/the_importance_of_nutrition/",
        "text": "This is a Life Pro Tip that we all know, but frequently forget.\n\nI got a reminder today.  I'm super-stressed as it is about my surgery on Thursday, and not having practical or emotional support.  And then today I forgot to eat a proper lunch, meaning not enough protein, and the downward spiral began.  Like thoughts of every. single. bad thing that has happened to me came barrelling in.\n\nNow I've had dinner, and I'm perking up, but I'll have a headache for the rest of the night.  Lesson learned - again.\n\nSo for any LANers feeling a bit wobbly, consider your food intake for the day and adjust as necessary.",
        "created_utc": 1452038214,
        "upvote_ratio": ""
    },
    {
        "title": "DAE feel like you went through too much and there's no end?",
        "author": "ShojiAn",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/3zlsrm/dae_feel_like_you_went_through_too_much_and/",
        "text": "After couple of years of being LC with my mother I am preparing to go NC. I will be moving out of the apartment before the end of the month and I will be on the road for some time before I settle somewhere else. At the same time I am trying to get on my feet which is not easy for a semi-verbal (most likely autistic) trans woman.\n\nMemories from the time when I was 13 are surfacing again which means that I am comparing first 13 years and 12 years between 14 and now (26). The reasons why I left the country the first time and why I want to leave now are the same and both times I don't plan to return to live here. This time there won't be any parent who would sent me back for a summer vacation. I don't have support system anywhere and I don't feel home here.\n\ntldr: I am working, packing, crying and wondering if I can handle everything",
        "created_utc": 1452023093,
        "upvote_ratio": ""
    },
    {
        "title": "My body is an ironic wonderland and a flippin' traitor (trying to cope with stress while body refuses to play ball)",
        "author": "ohhollyhell",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/3zlmi4/my_body_is_an_ironic_wonderland_and_a_flippin/",
        "text": "Moving back to the city I fled with my son about a year and a half ago to avoid being homeless.  Moving in with another single mom with an Nex and child the same age to lend a hand (essentially be her nanny) while I try to find work again.  It will (most likely) be a much more positive situation than the one we've been in, which hasn't been overtly unpleasant just that passive-aggressive crap we all know and love so well.\n\nWe're moving next weekend - fortunately I don't have a lot to pack.  Nevertheless the anxiety of it all has me in knots.  Usually I can \"pack it\" and push onward but my body has decided to override me. \n\nI developed this fun little side effect from a lot of anxiety and stress I couldn't/wasn't dealing with as it was happening as life was likewise happening:  vasovagal syncope most resembles my symptoms, but that usually happens in response to the body physically over-exerting.  With me, I will just be sitting and will suddenly be overcome with nausea, dizziness, light- headedness, will start just leaking sweat.  At first these episodes happened a few times a year and were of relatively short duration - maybe 5 to 20 minutes for the symptoms to abate entirely.\n\nNow, they seem to last for hours.  I know it isn't low blood sugar or anything like that because my eating habits (which admittedly suck) haven't changed.  \n\nI woke up this morning and immediately felt the need to throw up.  Periods throughout the day I've started to get clammy and dizzy.  This started over the weekend, and I know it isn't a flu bug or food poisoning because (a) the symptoms are sporadic, not constant and not getting worse or better and (b) this is precisely how I feel when I have my \"episodes,\" as I lovingly call them.\n\nI've moved more years than I've been alive on this earth, and excel at it; however, my MENTAL packing skills leave my practical skills in the dust.  I've put so much of the past few years away to deal with another time that I think my storage facility is full.  That, combined with the panic that *just going back to that city* causes in me, is just a gorgeous hot-mess cocktail.\n\nI'd hit myself but I think that's just what it wants me to do.....",
        "created_utc": 1452020917,
        "upvote_ratio": ""
    },
    {
        "title": "NSister just made life living hell (update to previous post)",
        "author": "grannymillenial",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/3zl86f/nsister_just_made_life_living_hell_update_to/",
        "text": "Previous post can be found here: https://www.reddit.com/r/LifeAfterNarcissism/comments/3wosfb/n_sister_never_gives_up_rantvent/\n\nWARNING: long post\n------------------ \n\nI have been trying to get into grad school and have taken the GRE a couple of times now. I took it again yesterday and was upset because I got the same scores. I was debating on whether or not to take it again, because it's $200 every time you take it, and I'd rather not rack up even more credit card debt to take the test a third time. \n\nMy uncle comments about how I need to take a prep course to which I reply \"they usually cost about the same as the GRE, and I don't have an extra $400 right now\" etc.\nHe makes a rude comment regarding a portfolio he gave me months ago (yes on Facebook; i deleted the comment). \n\nI call him and ask him about the Facebook comment because it seemed a little offputting and I wanted to know if he was okay. He then berates me saying that I'm ungrateful and that I'm lazy for not taking a look at it 7 months ago when he gave it to me. He pulled the \"I've been more of a father to you than your real father\" etc. \n\n7 months ago I was having suicidal thoughts, battling PTSD, an anxiety disorder, trying to find a place to live, and figuring out whether or not I had Crohn's disease (I don't thank god, just have stress induced IBS). The last thing on my mind was taking a look at a portfolio. \n\nI've been taking care of myself since then and have gotten my own place, started applying for grad school, gotten a job that pays decently, paid off my medical bills, and am now saving to move. I don't want to spend extra money more than I have to because I want to get away from where I am now. \n\nI told him this and he then tries to guilt me by saying \"that's the same thing your sister said and you hold it against her\" and it's not actually. She's just evil and i don't want her in my life. \nHe then proceeds to say more hurtful things (trying to shorten it up here). We ended the conversation shortly afterwards. \n\nI just don't get it. This is my sister weasling in YET again. she's planting little seeds and twisting the story, making it seem like I don't like her for her mental illnesses. That's not it at all. SHe's just an evil person who manipulates others (as you can see) to make them seem like the bad guy. My relationship with my uncle is now forever tainted because of her and because he's trying to guilt me because of the money he set aside. I had no control over his decision to do that.  Sure, it could reduce some credit card debt, I could use it to move, pay medical bills should they come up, etc. But I'm afraid to use it now because I'm afraid i'm going to get yelled at. I get yelled at no matter what now. \n\nI don't know what to do. What the hell should I say to my uncle? I told him to back off of the situation because it isn't his problem, it's between my sister and I. I've told him the truth. I just can't fucking win. ",
        "created_utc": 1452015865,
        "upvote_ratio": ""
    },
    {
        "title": "Book recommendation for ACON/ACOAs: Mindset",
        "author": "macarenaPistacio44",
        "url": "http://www.amazon.com/Mindset-The-New-Psychology-Success/dp/0345472322",
        "text": "",
        "created_utc": 1451998715,
        "upvote_ratio": ""
    },
    {
        "title": "Responsible",
        "author": "uber-blonde",
        "url": "http://imgur.com/1uzfzsA",
        "text": "",
        "created_utc": 1451969468,
        "upvote_ratio": ""
    },
    {
        "title": "DAE feel like they can't enjoy anything at all?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/3zhua7/dae_feel_like_they_cant_enjoy_anything_at_all/",
        "text": "So here I am reading the Silmarillion and I love the story and Tolkien in general but in the back of my head, I feel like a failure for not doing 'productive' things like studying or applying for jobs? Every time I go out to eat or for karaoke or the movies, I always have to prod myself to say \"Hey, it's okay. Just enjoy yourself. This is supposed to be fun.\" I don't recall the last time I had fun and I don't know if something is wrong with me or it's due to something else. :/\n\nEdit 1: I guess I have to add that growing up my family never did anything for fun and even if we went out to eat, someone would get mad and storm off or there would be a fight the moment we returned home. So movies, restaurants and parties with families was never fun and very very very rare. Also, I had this notion of high achievement instilled in me but I have become a chronic procrastinator so every time I do something fun, I feel like I should be doing something else. \n\nEdit 2: I just want to know how to go about enjoying myself instead of being overwhelmed and alarmed? ",
        "created_utc": 1451958105,
        "upvote_ratio": ""
    },
    {
        "title": "How To Drive Your Daughter Bat-Crap Crazy",
        "author": "CottageDweller",
        "url": "http://www.huffingtonpost.ca/lenora-thompson/drive-your-daughter-bat-crap-crazy_b_8908664.html",
        "text": "",
        "created_utc": 1451953204,
        "upvote_ratio": ""
    },
    {
        "title": "I think I've made too many mistakes in my life.",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/3zgwge/i_think_ive_made_too_many_mistakes_in_my_life/",
        "text": "[deleted]",
        "created_utc": 1451944769,
        "upvote_ratio": ""
    },
    {
        "title": "Valentine's Day (non-romantic) Card Exchange Sign-Ups!",
        "author": "wordtoyourmother8",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/3zgqyk/valentines_day_nonromantic_card_exchange_signups/",
        "text": "#####UPDATE: Sign-ups are now closed as of 1/23. Over the next few days, the mods will match people up and start sending the matches out. Expect PMs with information about your matches soon!\n\nWe had a lot of fun with the December holiday card exchange and there was a lot of interest expressed in doing more card exchanges, so here is another!\nIf you would like to exchange Valentine's Day cards (non-romantic only, please), ~~you can [sign-up here](https://docs.google.com/forms/d/17figwVidzZu1k0eE4xPt4VJ01gv1ty5mL-lsH5kGmwQ)~~!\n\nWe are going to keep sign-ups open for 2 weeks, because the mods have to vet all the people who sign-up. If possible, we may keep the sign-ups open for an additional week, but we can't make any promises. **If you really want to sign-up, sign up before January 18th to make sure you get in!**\n\nParticipants must have a Reddit account that is at least 6 months old with a clean (no trolling, etc.) history in RBN or in Reddit in general. Participants must have been active in RBN for at least a couple of weeks prior to **January 4th**.\n\nSenders do not have to write return addresses on the envelopes, but **we do ask that senders draw a big star on the back of the envelope** so card recipients know the card is from a RBN member.\n\nIf you are sending a card to someone that lives in the country where you live, please mail your card by **February 8th**. If you are mailing outside of your country, please note that it make take extra days or weeks for the card to arrive so please mail at least by **February 1st**.\n\nIf you sign-up, please note that you may receive more than one card because the mods enjoy sending cute cards to people. If you get an extra card (or 3) with stars on the back, it is because the mods picked a few random people to send cards to again.",
        "created_utc": 1451942717,
        "upvote_ratio": ""
    },
    {
        "title": "Big changes, and figuring out next steps...",
        "author": "PrancerPrancer",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/3zemch/big_changes_and_figuring_out_next_steps/",
        "text": "TLDR:  lots of changes going on with me - fully accepted I've got PTSD; not sure I'm ready to go back to work; have finally stopped making excuses for my father and have accepted he is a jerk, and it may be time for NC with him as well\n\nHi LAN, \n\nSome (big?) changes happening in me, I really wanted to share. Sorry it's a bit of an essay! \n\nAs some of you may remember, having made lots of progress over the past year or so, I hit a very rough patch this past couple of months (thanks to therapist pushing me too far too soon). \n\nI feel I'm on my way out of that rough patch now - thanks everyone here for your support and kind words, in particular thank you /u/falloutz0ne \n\nBut I'm not fully back to where I was, and I'm not sure if I'm going to get there. In fact, I feel like quite a different person now, to the person I was the other side of that rough patch. I've never in my life felt as anxious as I did during that bad time, and I still feel ongoing low-level anxiety and poor concentration like I've never experienced before. I've been signed off work by my Doctor, with anxiety, and I'm due to go back to work in 2 days, or see my Doctor again if I feel I need longer.   \n \nI feel like the main thing that has shifted with me is that I have really, fully accepted that I have PTSD, and everything that comes with that. I thought I probably did for a long time, but I wasn't really taking it seriously.  When I wasn't in a flashback, I felt like I couldn't imagine ever having a flashback again, it seemed so strange and silly (can anyone else relate?). So I didn't really used to do anything much that differently to manage or treat my PTSD (other than therapy of course). Now that the anxiety has really flared up big time, I've been forced to really I accept I have this. Like, if I had diabetes, I'd have to take it seriously and adjust my life accordingly. I have PTSD, and so I have to adjust my life accordingly. What does this actually mean? I'm not quite sure yet. But I've been reading up on trauma and looking at the research into what treatments work. And there is good evidence that EMDR, and IFS work very well for some people. So I'd like to try these. More immediately though, I have started doing a short meditation each day (I'm determined to stick to this) and I'm aware that exercise helps regulate my mood also. (However I have to be careful with exercise - I used to have an ED and an extreme exercise addiction, so I still never feel like I've worked out 'hard' enough.)\n\nSo, I'm making those changes. Yay me. Taking responsibility.\n\nBut, guys, what else can/could I do? Can I ask what kinds of pre-emptive measures people take to manage/treat their PTSD? (I realize this is maybe more relevant to the PTSD sub, but I feel I'd prefer to talk to people who get the specific kinds of traumas and coping mechanisms that Narcs create in their kids.) \n\nAlso, my other question. I'm not sure about going back to work in a couple of days. I already feel pretty nervous about it.  I'm still having issues with poor concentration, poor problem-solving and planning. (These are NOT problems I have ever had before.) I am feeling better than I did, but I don't feel great. But then, like I said, maybe I'm not going to get back to who I was before \"the mini-breakdown\". My instinct is to go back to work, I already feel guilty for having had some time off, and the longer I'm away the more out-of-the-loop I'll feel when I get back again. On the other hand, I genuinely feel like I've made some real progress in my overall wellbeing, self-image, and self-care these past couple of weeks, and I don't know if I can continue to make that kind of progress while going back to work full time.  Has anyone been through anything like this?  How did it work out for you? \n\nLastly, just one other thing I wanted to share. I've finally come to accept what a nasty, silly, irresponsible person my father is. For a long time, I told myself he really cared for me, and was sometimes kind to me, and his eccentric (schizoid?) behaviors and alcoholism were just because he'd had such a hard life. But that was just a lie I told myself (and he told me) in order to cope with my life. He's not kind to me. Most of his behavior towards me is indifferent at best, and disrespectful/cruel/volatile/unpredictable at worst. Sure, he finally divorced NMom, but it took him 27 years to do that, during which time he enabled her abuse, and delivered quite a lot of abuse and neglect of me and my siblings himself as well. He's never acknowledged or apologized for his bad behavior.  \n\nSure, he took me in and gave me a roof over my head when I was homeless. But he kind of trapped me living with him and working for him, for almost a year, in a quiet town with no public transport - he drove so he was my only means of transport. During that time, when I was in a *bad bad place*, he had just inherited a few $100,000s. He could have paid for me to see a therapist, he could have helped me to pass my driving test, he could have bought something nicer than the cheapest possible bed on sale in Ikea for me, he could have taken me to practice driving with him, hell, he could have bought me an apartment! (He didn't do any of those things, instead, he regularly picked arguments with me, talked to himself in a range of difference voices/characters, and refused to take any responsibility for his mental health or alcohol problems.) In the end, I 'escaped' by saving up the money he paid me for working for him, I literally did nothing in my spare time, and lived on the absolute bare minimum for 4 months. I had no life whatsoever at that time. I used the money I saved to put down a deposit on a tiny little room in a nasty, cold, run-down building, and I got a job waitressing, and moved out and somehow coped. He wasn't happy when I moved, he felt angry and abandoned. I always thought of him as my saviour because he gave me a roof over my head and a job - but I see now that he actually did very very little to help me. Having spent some time with SOs wonderful family, I can see that if SO had been in that situation his family would have done a *great* deal more to help him build a life for himself. \nI'm not sure what this means, it may mean that I'm going VLC / NC with my father too now. And I'm okay with that. \n\nThanks for reading if you made it this far! :) \n\n\n\n\n",
        "created_utc": 1451911143,
        "upvote_ratio": ""
    },
    {
        "title": "When NAunt blames you for her greeting",
        "author": "throwawayyy3421",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/3ze45j/when_naunt_blames_you_for_her_greeting/",
        "text": "So today I went to an extended family dinner, I havent seen most of my relatives due to being LC with FOO. So first i walked and took off my jacket my NAunt greeted me with this\n\n\"Do you have a baby?\" And she grabbed my stomach.\n\nI moved out with SO a few months ago to escape my crazy Nfamily. Of course no one really approve of me living with SO. I gave her a look and said no. She walked away and I decided im going to stand up for myself and said \"What's wrong with you? That was inappropiate\" \nMy Naunt look shocked and told me how it is. So i set the example and ask my sis if she has a baby. Naunt quickly apologize and left.\n\n\nLater on she stopped me when i was trying to get the cake cut and it went some thing like this:\n\nNaunt: Sorry I embarressed you\n\nMe: I wasnt embarressed.\n\nNaunt: You must be mad.\n\nMe: No. Im not mad. you were just rude.\n\nNaunt: I can see that you are mad. Your lips are a light color.\n\nMe:Nope I feel nothing towards you. You are just rude.\n\nNaunt:blah blah blah blah \n\nMe:Nope. Just rude.\n\n\nFor some reason she was so fixated on me being angry at her. and all i did is point out she was rude every time. \n\nNaunt: I only asked you this because you live with SO. I am sorry if I was rude to you.\n\nGreat way to blame me and give a half ass apology. She did went on about the fact I am living with my SO and something something my fault.blah blah\n\nMe:That's nice. I am needed elsewhere\n\nLooking back on it now she was trying to embarrassed me and insult me. I guess it didn't work.\n\nFor many year my family be trying to insult me by calling me obese and so forth. when I was really overweight due to depression. Not today, Satan.",
        "created_utc": 1451899550,
        "upvote_ratio": ""
    },
    {
        "title": "It's okay to be proud of your progress",
        "author": "nessytornado",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/3zdvow/its_okay_to_be_proud_of_your_progress/",
        "text": "It's even okay to be self congratulatory, despite what the N's in your life may say to the contrary.\n\nI have a good job, my own apartment with no roommates, no drama, and right now on this cold night I am grateful for everything I've accomplished.\n\nTake THAT, Ns!",
        "created_utc": 1451893966,
        "upvote_ratio": ""
    },
    {
        "title": "[Happy][Funny]The Joy of the Dishcloth and other Happy Sunday Stories",
        "author": "TarnishedTeal",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/3zddd3/happyfunnythe_joy_of_the_dishcloth_and_other/",
        "text": "Ok, so my grandmother refuses to get her dishwasher fixed. And she washes everything by hand, and usually roped me in to do it. (Sorry for the weird tense) \n\nShe called dish *towels* dish *cloths* and I never knew there was a difference. So when my fiance and I were at ikea yesterday, we saw their 4 pack of fiberous dishcloths and I was like, huh, weird. $2, I'll buy em, see what happens. And then I tried them today and HOLY SHIT. Washing dishes was so awesome. Even...fun. Like, for the first time in my life I had fun washing dishes. It was kinda funny. And then I dried them with a towel and it suddenly clicked into place. Dish towels...like a human towel. Dish cloths, like a human dishcloth. I suddenly felt really excited and really stupid at the same time. Lol\n\nAnd then the second thing, some of you may remember from my screenname that I moved in with my fiance recently. Well I was doing laundry and he had some stuff he brought over that was clean so we decided to hang those too. He has so many clothes. And then I remembered that thread a few months back about how many clothes is \"normal\" and turned around and looked at my clothes and realized that I had as many clothes right now as I ever had in my life. And he had more than I did. I was always guilted as a child for wanting so many clothes and what did I need TEN SHIRTS for and SO MANY PANTS. But then I realized in the past couple of months that no, it's not OK to just endlessly layer your clothes until you're warm enough. You have to actually have proper clothes for the season. In the last month my fiance and I went to target, costco, and Old Navy and basically doubled my wardrobe, and it's been amazing. I don't have to do laundry every 3 days and I don't feel like I'm wearing too-small, raggety, old, uncomfortable shit. It's a great feeling. Seriously, if anybody is reading this, and they have enough money to do it, go to your favorite clothes shop and buy yourself a new outfit. And then wear that motherf*er outside.\n\nHappy Sunday y'all. Stay healthy.  ",
        "created_utc": 1451883790,
        "upvote_ratio": ""
    },
    {
        "title": "Narcissism and psychopathy",
        "author": "sqqueen",
        "url": "http://samvak.tripod.com/narcissismdisorders.html",
        "text": "",
        "created_utc": 1451875190,
        "upvote_ratio": ""
    },
    {
        "title": "Shouldn't laugh but I am laughing",
        "author": "htaylor393",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/3zarky/shouldnt_laugh_but_i_am_laughing/",
        "text": "Been NC with my NDad and his family for nearly a year now. My brother is still in contact with them all.\n\nI posted previously about a letter I received from my NGM asking me to get back in touch with her which I haven't and will not do. There was no trouble from my NDads family on Christmas Day like I was expecting (ILs live NBO if you read my previous threads) which I thought was strange.\n\nWell now I know why, apparently an argument broke out between my uncle and my dad, I'm not sure what the argument is about but I can guess it was about me and my daughter (my uncle and aunt have tried several times to talk to me. They haven't really done anything wrong, i only went NC with them to prevent them persuading me to talk to my dad). The argument resulted in my uncle punching my dad in the face.\n\nNDad is fine apparently, he's been seen driving by my mum and brother. Not that I care. I just couldn't help laughing.\n\nI don't want to wish him misery but he's caused me so much that I can't help it.",
        "created_utc": 1451845021,
        "upvote_ratio": ""
    },
    {
        "title": "DAE feels like a fraud?",
        "author": "sharpclaws7",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/3z93s2/dae_feels_like_a_fraud/",
        "text": "I've been called a fraud so many times while growing up that I can't even identify any genuine emotion on myself. Always second guessing every thought, every feeling, every word I say or I type, even right now.\nMy parents always made up stories about themselves which I don't know - and never really cared actually - if it is/were true. \nWe moved around a lot. Different countries, continents, states, cities, and, until my sixteens, we never settled anywhere. I can't settle either. I'm always on the move. I feel wrong everywhere and I feel as I don't belong anywhere.  \nI'm always the outsider, the foreign, the person with the weird accent. I just want to get away. I always want to get away and when I do I want to get away from there too because, well, I'm a fraud.  \nWhen I was sick, for exemple, it was all just pretending for my parents. If I didn't broke a bone (even if I did I had to prove it), if I wasn't bleeding, I couldn't go to the doctor. Meanwhile my brothers were always taken care off. Everyone besides me (and my father but he never goes because he doesn't like hospitals and doctors). \nI was always neglected and my mother made it sure to show me how much energy, effort and money she was putting into me when I needed something. Could that be school, medicine, hospitalization, new clothes (they often were a freaking rag for which I was always yelled at because it was my fault that I been using the same 6 pieces for two years).  \nSorry, I'm missing the point here. I have so much to say but everything is so confusing now and I can't write a freaking sentence properly. I feel selfish, arrogant, a narcissist, a fraud, a liar. Well, I am a liar because I had to always lie to my parents because they wouldn't believe the truth which is really confusing. And also I suppressed so much. Was called crazy, called a liar for making things up and I don't trust my own memory. My brothers turned their back at me. Not the youngest one but he pretends everything is okay so he wouldn't get in trouble with Nmother. The middle one is the GC and he's totally blinded and blame me for his shit. The oldest gone totally NC and I was never close to him and, recently I figured out he blames me for a lot. Well, I actually don't know but my mother told me so so I don't know what to think.  \nAlso, I feel like I have no personality.I'm trying to change, to achieve that person I feel like I am inside but I'm afraid because every time I was myself I got shut down, called names, crazy, an idiot or irrational. But all this seems irrational. And damn, I'm feeling like I'm definitely a narcissist, I'm just seeking for attention. I wish people and specially my boyfriend were more open with me and tell me I'm wrong, I'm a bitch, I need to change this and this and this asap. See? See? How selfish all this sounds? All I'm saying \"me me me me poor me\", gosh.  I'm fucking crying now. Great. Such an emotional little bigot. Fuck. Sorry.  \n\n&amp;nbsp;\n\n**EDIT**: I wish to thank everyone's kind words and letting me know I'm not alone. Feeling a bit weird about the attention but greatly thankful for each thought and advice. You all helped a lot. \nI will take a look into further therapy, medication and self-improvement as recommended below and, honestly, you guys are awesome and beautiful. I'm feeling like a happy little kid wanting to run around and hug everyone here and thanking each one of you people! Seriously, thank you all. Peace and love.  \n- sharpclaws7",
        "created_utc": 1451808668,
        "upvote_ratio": ""
    },
    {
        "title": "Practical Healing: A Guide to Restore Your Life",
        "author": "Benevolent_Son",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/3z6irq/practical_healing_a_guide_to_restore_your_life/",
        "text": "Hey ya'll! It's MuffinFuhrer (changed the name since it doesn't suit me anymore) and I'm excited to bring you the news that I've recently published my second book titled **Practical Healing: A Guide to Restore Your Life**. \n\nNow the first one *Blessings from Our Mother* was more cathartic than useful, although Practical Healing is just that - useful. Why? Well I've included some exercises and techniques to help you remove emotional blockages (old pains from the past), and this in turn will help you anchor yourself to the present more. I.e. if you suffer from CPTSD, dissociative disorders, or schizotypal disorders, then you know what I mean when I use the phrase \"anywhere but here.\" \n\nI've personally suffered from each - I couldn't function and enjoy life because I was always treated like garbage and it's wasn't my fault, even though that's all I knew myself to be. So could I socialize? Nope! That is until I developed the techniques and exercises I alluded to earlier. Plus I included a guided meditation (to further help you with dissociating issues - i.e. collecting fragments to reintegrate them = wholeness as opposed to fractured and divided), tips for self-parenting (learning how to love the self), and a mythological take on the archetype of the hero (i.e. I tell you what it takes to become the hero of your story - no more abuse, no more dysfunction, etc.)\n\n What are you waiting for? Stop over and check it out today! \n\n http://www.lulu.com/spotlight/benevolentson",
        "created_utc": 1451765562,
        "upvote_ratio": ""
    },
    {
        "title": "How do you deal with the anger?",
        "author": "saddetective87",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/3z27s5/how_do_you_deal_with_the_anger/",
        "text": "For the last couple of weeks I have had unsurpressable boats of anger during yoga, weightlifting, and meditation sessions - and they are directed at my NM. As I become more functional it is becoming clearer the extent of the damage and the time she has cost me. I feel better than I have felt in years, but at the same time these bouts of anger are increasing. Perhaps its just a case of letting it out. \n\nHow do you deal with it?",
        "created_utc": 1451684624,
        "upvote_ratio": ""
    },
    {
        "title": "New Year, \"New\" Parent",
        "author": "uber-blonde",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/3z16zf/new_year_new_parent/",
        "text": "Happy New Year, everyone!\n\nLast night I told my stepfather I was legally adopted back by my birth father.\n\nAt first, stepfather laughed out loud, almost like he was offended.\n\nThen he listened carefully as I explained it was for genealogical purposes and to undo a decision my birth father has always regretted (allowing me to be adopted at age 8).\n\nStepfather finally said it was for the better. I also told him he no longer needs to consider me in his estate planning.\n\nGlad that is out of the way. And looking forward to the New Year, with the father I was born with!\n\nNote: I have thought and thought about it and if I WERE to assign blame it would be my nMother: 70% and my stepfather: 30%\n\nHowever, I do not have time to blame anyone. I will keep choosing to be happy and surrounding myself with positive people.\n\nWishing you all a peaceful, happy, productive New Year. Love to all!\n\neta: word",
        "created_utc": 1451668138,
        "upvote_ratio": ""
    },
    {
        "title": "Can somebody help me understand the difference between a narcissistic mother and a child of a narcissist?",
        "author": "topiramate",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/3yzs5f/can_somebody_help_me_understand_the_difference/",
        "text": "[removed]",
        "created_utc": 1451628031,
        "upvote_ratio": ""
    },
    {
        "title": "[trigger warning] Sexualized abuse",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/3yzdbe/trigger_warning_sexualized_abuse/",
        "text": "[deleted]",
        "created_utc": 1451617704,
        "upvote_ratio": ""
    },
    {
        "title": "Trouble breathing is a problem.",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/3yz5ri/trouble_breathing_is_a_problem/",
        "text": "[deleted]",
        "created_utc": 1451612816,
        "upvote_ratio": ""
    },
    {
        "title": "Revelations",
        "author": "itsonlyfire",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/3yyieb/revelations/",
        "text": "Hi! NC/VLC for 3, almost 4 years. I live alone in a small apartment. Since it's just me, dinner can go on my computer desk. This was fine until I upgraded the crappy desk I was using to something substantially nicer. Now, I worry for the finish, so I need coasters and such. \n\nThis has led to me looking into dinner trays as a cheap way to have a meal next to me while I'm using my computer. I wasn't expecting so many thoughts and images to come crashing through my brain, however:\n\nWhen I was growing up, my nparents sat in chairs in their bedroom (NOT the living room), watching television while eating off of cheap dinner trays just like the ones I was looking at. I did the same thing in my bedroom until I stopped watching TV, and ended up using my desk as a dinner table while using my computer (old habits die hard, I suppose).\n\nThe dining room table was reserved for special occasions. Holidays (you can imagine how much fun THOSE were). The living room was hardly used for anything at all. The kitchen was for preparing meals, which were typically placed onto dinner trays.\n\nThe ramifications of this are pretty profound. First, I should be (and am) grateful it meant a childhood of avoiding eating dinner with the psychotic people I used to call parents. Considering every christmas dinner seemed to involve verbal abuse, this was a blessing. But it also means I am absolved of any guilt I might feel about maintaining NC. That wasn't a family. They seldom even sat in the same room.\n\nNeedless to say, I am not getting those cheap tv trays that remind me of home so much. I'm either going to get nicer ones, invest in table mats, or perhaps get a small table and chair explicitly for eating. \n\nSo, my questions... and I realize I am asking a crowd which may not be able to answer properly because they might not know, themselves. ;)\n\nWhat the hell does any of this mean? Is it more normal than I think? What does this say about a family unit? What kind of effect would this have? Is the experience of eating at a table with your family on a regular basis something most people would have? In a non-narc family, is this something people look forward to? Is it just mundane? \n\nI have no context for any of this. It's really confusing. :)",
        "created_utc": 1451599660,
        "upvote_ratio": ""
    },
    {
        "title": "Spectrum of narcissism from normal to full blown narcissistic disorders",
        "author": "sqqueen",
        "url": "http://www.daughtersofnarcissisticmothers.com/narcissism-spectrum/",
        "text": "",
        "created_utc": 1451595285,
        "upvote_ratio": ""
    },
    {
        "title": "Why you can't just get over it and move on, for anyone who's ever been told to.",
        "author": "arcticfoxtrotter",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/3yw53c/why_you_cant_just_get_over_it_and_move_on_for/",
        "text": "This is for anyone who's ever been told any of the following, all of which are wrong. That they should get over it, move on, stop dwelling, put it in the past, stop over-thinking it, stop thinking about it so much. Sometimes by people who mean well and think they are helping. Sometimes by enablers and flying monkeys.\n\n**None of this is true, or good advice. Here is why.**\n\nFirstly, you have experienced trauma, which wounds the mind, body and soul. You cannot simply decide to just get over it, as if it is a tin can you are carrying around and just need to set down on a side. You need to tend to your wounds. \n\nYou wouldn't be expected to just get over it if you had been burned repeatedly, were physically wounded and needed extensive treatment at the burns clinic. This is the same. Your wounds are not there through choice. You did not decide to have them and you cannot simply will them away. The way you feel about them does not determine their presence. \n\nYou can tend to your wounds and heal from them but you don't do that by just deciding not to think about them. \n\nSecondly, trauma is not resolved through avoidance. Many of us spend years splitting off from and avoiding our feelings before things start leaking out through anxiety attacks or a breakdown or any number of other ways. Then we may be overwhelmed and flooded with intrusive thoughts, feelings and/or memories. \n\nBeing told not to think about it so much? It's like telling someone who has been stabbed not to bleed so much. \n\nAnd thinking about it, dwelling on it, being preoccupied by it, can be necessary. Because that pain you've been avoiding in order to survive, that story you haven't been telling, you may well find you need to feel it and tell it. There can be relief, comfort and catharsis in letting yourself acknowledge your story and your pain, when you are ready.\n\nYou are grieving. You can't just get over grief by simply deciding not to have it.\n\nThe paradox of change is that, in order to change, we must first accept what is. Learning to live with your pain is an eventual outcome of doing the healing you need to do. But first you need to be allowed to acknowledge that you are wounded. \n\nIf someone is crying, telling them to stop crying will make them feel ignored, will make them hurt worse. Allow them to cry and they'll probably stop more quickly.\n\nBut there's something else that people don't understand. Something I realised after reading a recent report about abuse that made this point. \n\nThe person you are may be an adjustment to the abuse you experienced, that you had to live with. This is the person you became. That doesn't mean that person is no good. It's just that you don't know who you would have been instead. You may not know what is really you and what is an adjustment, a flea or a wound. Maybe you do know that, but it can take time to learn about it. \n\nBeing told to get over it implies it was an event that occurred independently, externally, and not something that affected you deeply and profoundly. That 'it' is something you can choose not to think about. As if you can just move on from the person you had to become to survive. \n\nLearning to live with this is an outcome. Moving forward is an outcome. They aren't things you can just decide to do. The people who suggest otherwise may be defending against their own pain but whatever their reasons, they are dispensing bad advice. \n\nWouldn't it be weird if you could just move on, just like that, from being so profoundly hurt? Wouldn't it be weird if you could just shrug your shoulders and forget about it? You are allowed to be upset and in pain. It is an entirely proportionate reaction. And if the advice is no good for burns victims, then it's no good for you either. ",
        "created_utc": 1451551191,
        "upvote_ratio": ""
    },
    {
        "title": "the decision to have kids",
        "author": "topiramate",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/3yvo2j/the_decision_to_have_kids/",
        "text": "I've still got some time before I seriously ponder this question, but I feel kind of messed up due to the way I was raised. I don't think I am emotionally equipped to care for a child, because even with my significant other I notice that I take on some traits my mother had. It's sort of this \"I-see-it-coming-but-I-can't-quite-stop-myself-from-saying-it-and-being-really-mean-in-the-moment\". This worries me and I think it might actually be enough to lead me to the decision to not reproduce. If you have had this debate before and/or actually made a decision, what did you decide, and how did you arrive at that conclusion? And for those further along the journey, how did things turn out for you?",
        "created_utc": 1451540174,
        "upvote_ratio": ""
    },
    {
        "title": "Possible trigger, violence Has anyone ever fantasized about (doing bad bad things or bad bad things happening) to your narc? I do.",
        "author": "dictionnairedepoche",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/3yvkv2/possible_trigger_violence_has_anyone_ever/",
        "text": "10 months NC and I still can't help fantasizing about doing terrible things to my Ndad. Or rather, about bad things happening to him, or ways I could get away with killing him, or just to remove him. I've thought about feeding him ground glass, a hit and run while he's cycling, him having a car accident (he's an a**hole, aggressive driver), him eventually drinking himself to death (alcoholic in denial), getting some horrific STD or AIDS complication (he practices lots of unprotected sex with strange men, also in denial about it). \n\nI have been feeling and thinking things like this and feeling bad about it as far back as I can remember. I remember as a kid, my siblings used to toss their shoes down the stairs into the basement instead of walking down and placing them in cubby holes neatly. As the youngest, I copied them, and as the NT I was the only one to get in trouble. I was about 5 years old, and Ndad screamed at me \"ARE YOU TRYING TO KILL ME BY MAKING ME TRIP ON SHOES DOWN THE STAIRS??!!\" I cried so hard, feeling like I had tried to kill him, but when I finished crying I remember thinking about how much better things would be if he had tripped and died on the stairs. \n\nFar more often than wishing him harm, I've wished harm to myself. I've been suicidal as far back as I can remember (thankfully not very often these days), and remember telling my mom at a very very young age that I wish I had never been born. I struggled with anorexia as a teenager, always imagining that every inch of me was a waste of space, that me eating used up precious resources that someone else could use, feelings that were always rubbed into my brain by Ndad since I was born. He always told me that I was stupid, lazy, worthless, a waste of everything (time, energy, attention, etc.) I wonder if my wish that Ndad would die is a way to protect myself and take away his power. When I think about him dead, I don't think of myself as worthless and stupid, I think of myself as powerful. My mom (former emom, separated now) thinks I need to \"let it go,\" to stop dwelling on him, move on, etc. Either I don't know how, or this is just my way of moving on and letting go of any residual belief that he is, was, or will ever be any kind of father. ",
        "created_utc": 1451538437,
        "upvote_ratio": ""
    },
    {
        "title": "Stay positive, my friends",
        "author": "uber-blonde",
        "url": "http://imgur.com/PagV3pR",
        "text": "",
        "created_utc": 1451529547,
        "upvote_ratio": ""
    },
    {
        "title": "Sexual hypocrisy and controlling your sex life with narcissists?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/3yus1j/sexual_hypocrisy_and_controlling_your_sex_life/",
        "text": "[deleted]",
        "created_utc": 1451523924,
        "upvote_ratio": ""
    },
    {
        "title": "VALIDATION, SWEET VALIDATION",
        "author": "lungfish123",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/3yrapk/validation_sweet_validation/",
        "text": "I just got back from a Christmas visit to the birth family after about 8 months of NC with my deeply fucked up mother.  I had decided I'd had time enough to disentangle myself emotionally and wanted to see how things went and what level of participation in this family I wanted from now on.  I set boundaries by staying for less time than had been enough in the past to reduce me to mush, and by renting a car for the duration to be able to get out at any time and to not be forced to rely on parents for transportation to family events.\n\nDuring gather-round-the-tree-photo-time, my mother cupped my ass when she thought she could get away with it.  I pushed off, and stood uncomfortably until my dad joined for another photo.  She tried to tell me to stand next to her while I went to the opposite side of my father from her.  With my arm around my dad's shoulder, she squeezed her arm closer onto mine while I pulled away.\n\nDuring the rest of the visit, I noticed she was much less nagging toward me and drank much less and pushed alcohol on me much less than had been typical.  I think shutting off contact entirely and not playing into her fucking head games actually got through to them.\n\nAll the fucking years of guilt trips and manipulations and creepiness and never really being sure of my own perceptions are done with.  I don't give a shit what terrible things happened to this woman, she can goddamn well figure out to not grope her child and pretend like nothing happened.  I know that she is fundamentally untrustworthy, and that my father will always play along, and that my sister is still in this game enough to have her around.  \n\nGUYS I FOUND THE TRUE MEANING OF CHRISTMAS!!!\n\n",
        "created_utc": 1451459867,
        "upvote_ratio": ""
    },
    {
        "title": "trouble communicating with my partner. Can we fix this?",
        "author": "cyanoside",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/3yqyin/trouble_communicating_with_my_partner_can_we_fix/",
        "text": "I'm really stressed out right now. This is kind of all over the place. I have several problems in my life right now that I have no idea how to fix. I'm hoping to get some feedback on the partner issue.\n\nhe works nights and his sleep deprivation is driving me crazy. Also his messiness. He says I don't communicate well enough but I think he just doesn't listen. \n\nI say \"you need a regular sleeping patters\" for months and only when I'm at my wits end and have issued an ultimatum does he listen. Is \"you need a regular sleeping pattern\" a suggestion that can be ignored or should he have listened to me? I'm so confused.\n",
        "created_utc": 1451452936,
        "upvote_ratio": ""
    },
    {
        "title": "that !%&amp;$*# group project again!",
        "author": "candleflame3",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/3yqt0t/that_group_project_again/",
        "text": "Some of you may remember me posting about a month ago about a toxic group project I was in.\n\nhttps://www.reddit.com/r/LifeAfterNarcissism/comments/3ut2o7/finally_figured_out_why_the_group_project_is_so/\n\nSo, I got my individual grade and comments back from the prof today, and she made a comment about my part of the presentation being less than the other two group members.  Well, yes, Professor, remember how **I emailed you about how my contributions to the project kept being ignored and excluded?**  I literally told you:\n\n**Most of my work has been excluded, and some has been changed at the last minute, without explanation and for no apparent reason.**  \n\nThis problem didn't magically go away the day of the presentation.\n\nI'm gonna push back on this.  It's a bullshit thing to say to me in light of what I told her.  \n\nAs a side note: before I did this program one of its graduates warned me about this prof.  I do find her rather clueless.  This is another of her comments to me and I'm not sure it even makes any sense.\n\n-\tData table in the presentation could have ben revised from the final report to be more concise.\n\nThe data table in the final report was *bigger* than the one in the presentation.  The presentation version *was* the concise version.\n\nBloody hell.",
        "created_utc": 1451450125,
        "upvote_ratio": ""
    },
    {
        "title": "2016 Is The Year I Kick My Addiction To Work",
        "author": "CottageDweller",
        "url": "http://www.huffingtonpost.ca/lenora-thompson/workaholic-new-years-resolution_b_8879640.html",
        "text": "",
        "created_utc": 1451431800,
        "upvote_ratio": ""
    },
    {
        "title": "Christmas and the Cookie FLEA",
        "author": "Cranksta",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/3ypk60/christmas_and_the_cookie_flea/",
        "text": "This Christmas with my FOC was about as fun as it was exhausting for many reasons, but as my second Christmas with people who actually love me it was pretty awesome despite the frustration. Still, I found the day very difficult because of the way I grew up as an ACoN.\n\nI woke up in the morning and we had breakfast and I started to make chocolate chip cookies from scratch. I had used the same recipe a week before at a volunteer event and they turned out amazing so I was really excited. I had everything ready and put it on a tray and threw them in the oven. I came back when the timer went off and pulled them out...only to see that they were completely flat and spread out so much that they were all one mass on the tray. They weren't the perfect round cookies that I wanted.\n\nAnd I completely freaked out. I threw them onto the counter and tried desperately to cut them in a way that made them acceptable to me. My sister and her friend were trying to comfort me saying they still tasted good but I wasn't having it. They were disgusting to me, so much so that I threw the rest of the batter in the fridge and walked away and tried to forget about them. I was so angry and hurt and scared and I didn't know why.\n\nI tried to explain it by saying they didn't turn out how I wanted, and had seen before and that it made me feel like a complete failure that let everyone down. It didn't feel quite right, but that was the closest I got to. Everyone else ate the cookies but I didn't until that evening and it was still really upsetting to me. \n\nI've been mulling it over the last couple of days and I think I figured out what it was. I'd completely forgotten it, but it completely explains why I reacted the way I did.\n\nEvery year with my Nmom at Christmas, I'd be tasked to make cookies. They were the store bought dough, but I always managed to get something wrong. Every year they would get burnt, or left out too long or squished. Any number of disasters would befall me each year as these fucking cookies would turn out absolutely unedible. The worst years were when she didn't trust me to do them right so she would prep them with me (dough rolling, M&amp;M pressing, filled with all kinds of demeaning comments on how I couldn't even bake cookies right) then would sit there and literally force me to watch the cookies until the timer went off. They'd be doughy and she'd put the back in...and they'd burn. AND IT WOULD ALL BE BLAMED ON ME. I'd get beaten, Christmas would be declared canceled and I'd be left crying on the floor over a $8 set of cookies. \n\nEvery year, for a decade. I'd be attacked over goddamn cookies. So guess what happened when, once again, I fucked up the cookies. I freaked out. My mind went straight to fear and I tried desperately to keep everyone from seeing them. I wanted so badly to throw them out and forget the whole thing. All because of my Nmom. It tainted my whole day. I was in fear of something unknown for the rest of the day and it made it impossible to really enjoy the day. \n\nI guess the good thing is now that I know what happened, I can work on it. On the other hand though, it's just another way my Nmom has screwed with my life and happiness. Oh joy.\n\n",
        "created_utc": 1451428979,
        "upvote_ratio": ""
    },
    {
        "title": "Seriously getting bored with this",
        "author": "htaylor393",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/3yp1t5/seriously_getting_bored_with_this/",
        "text": "So I had a lovely Christmas with my fiance and ILs. If any of you remember my previous threads my ILs live next-but-one (NBO) to my NGrandparents.\n\nI thought my NDad and his family might try something over Christmas because I'm NC with them all and I spent Christmas Day evening with my ILs but apparently my FIL and their two large dogs are enough of a deterrent.\n\nAnyway, they haven't given up like I'd hoped. My aunt sent a Christmas present for my daughter through the post; my daughter's 6months old and has no idea whats going on so thankfully the cheap plastic bauble could just be slung in the bin.\n\nMy GM is disabled and knows my ILs don't like her so didn't try giving a present to them. She was even more sneaky. She gave the present to my NDad who in turn insisted that my mum take it and give it to me. I told my mum not to bother taking anything off him from him or his family for either me or my daughter. But my mum says \"she's not like that\" whatever that means.\n\nI was reluctant to take it but my mum wouldn't give it back or throw it away so I ended up taking it. I opened the presents for my daughter to find a frankly quite scary and dangerous toy penguin; it was made of a sort of fabric which came apart when I held it, it was covered in glitter and if my daughter had swallowed the fibres they'd have made her very ill. She also gave my daughter a ragdoll that I'm sure has an evil look on its face.\n\nThere was also a letter included in the card. My daughters name is spelt wrong several times but it's basically asking me to contact her again as she wants to see both me and my daughter without involving my dad. Tbh I'm not sure what to think; I've always felt second best to my snobby cousin who I posted about in a previous thread. And I'm sure my GM doesn't like my daughter; my daughter's name is Isobel (she spelt it Isabelle on the card and letter) and I used to have a cat called Bella whom my GM is insisting we named my daughter after (we didn't - fiance liked the name it was just a coincidence that my cat had a similar name) which she doesn't like, my daughter's middle name is the first name of my other GM who died in 2011 she was an amazing woman whom I miss every day and I know shed have loved both my fiance and my daughter so it seemed an appropriate and good way to remember my late GM, my GM hates this; thinks it's morbid and I should have given her a more appropriate name - both my daughter's first and middle names work well together even without the added bonus of the connections. GM also doesn't like the fact daughter has fiances surname and not mine (same as hers), to me she's being awkward for awkwards sake. \n\nI'm not rising to the bait, I'm not even going to dignify them with a response. If they text I'll just ignore them, kinda getting bored of their attempts to get me back. If this is the worst they have then I can cope and have absolutely nothing to worry about.",
        "created_utc": 1451421180,
        "upvote_ratio": ""
    },
    {
        "title": "And once again... not my circus, not my monkeys...",
        "author": "PrancerPrancer",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/3yolr1/and_once_again_not_my_circus_not_my_monkeys/",
        "text": "I'm still LC with a couple of siblings and an aunt/uncle (she/he is midway through gender reassignment surgery). \n\nOver the last week these people inadvertently tried to get me involved in their personal dramas.  I don't think they were deliberately trying to be manipulative, or deliberately trying to suck me into their dramas which are nothing to do with me. All the same, it was tricky not to get hoovered up. But, I think, I have succeeded in steering clear. \n\nFirstly, my youngest sister (GC, who has slowly turned into the SG since I went NC), is beginning to understand just how nuts NMom is. She's definitely not an N, she has gone more the co-dependent route - very much like me at her age. Anyway, she came to visit and over dinner she asked me for advice about something.  She explained to me that NMom who is now living abroad (with no job, sponging off her latest boyfriend) is renting out the family house to 3 tenants, along with my 2 sisters who still live there. Middle sister (GC) has been put in charge of running the house and collecting rent from the 3 tenants, rent gets paid straight into NMom's account to pay the mortgage on the house.  Because NMom has no money, the house is in bad disrepair.  Because the house is in such poor condition, they charge the tenants very low rent. In fact, the rent they charge is so low that it is not enough to cover the mortgage and household bills.  (Crazy right!?)  Both sisters pay towards bills, but don't pay rent.  SG sis (the youngest) was asking me for advice because GC sis (the middle one) had asked SG sis for extra money to cover the bills, which she'd paid her. When SG sis asked if she was getting it back, GC sis said no, because she had used some of it to pay her own personal tax bill. \n\nSo we talked some more and I asked some more questions, and basically the situation is that NMom is renting out the family home to 3 tenants, but she doesn't have a licence to do so (which you are legally required to do in this country) she hasn't complied with any of the health and safety legal requirements for private renting, none of the tenants have contracts, and she has put her dyslexic, depressed GC daughter in charge of running the house, and she's not paying her to run it either. Oh and because NMom lives overseas she isn't paying tax on the rent she's being paid, so she's also evading tax. So, I think she's breaking at least 3 laws and probably more. \n\nI advised youngest sister to just move out. She has a full time job, she doesn't have to stay there - living in that falling down house, paying her sister's tax bill for her. I also got *really* angry that this is happening, and started planning all sorts of ways to sort the problem out. And then the next day, I remembered... That is not my circus. And those are not my monkeys.  \n\nNone of that affects me. All the people involved are adults. They are responsible for themselves and their decisions. If they want to live in that way, that is their choice. No-one is forcing them to stay there. \n\nThe other thing that happened is, I've been allowing a certain relative (aunt/uncle) a bit more into my life. They are currently undergoing gender reassignment surgery - I've tried to be supportive without giving up too much of myself - as in, I'm not going to be this person's emotional caretaker, but I am being supportive. This relative asked if I was free on the 29th Dec because they were going to be in the area for a \"minor review operation\".  I said yep, sure, come visit while you are around, and if you'd like to stay over you are welcome to.  A few days ahead of the visit, I texted the relative to check what their plans were. The message I got back talked about how they had to be nil by mouth from midnight the night before and were feeling really nervous about the operation.  \n\nI talked to SO, and we both agreed that we didn't feel very comfortable with this. I'd got the impression that a \"minor review operation\" would be something like a quick check-up, maybe involving a local anaesthetic. But this was sounding like something more involved, nerve-wracking, and clearly involving a general anaesthetic (if they had to be nil by mouth).  I've been signed off work by my Doctor with anxiety for a few weeks. Me and SO agreed that it wouldn't be good for my own health to host a nervous, anxious relative I don't know very well, in our little 1-bedroom flat, the night before what could be quite a major operation. That all sounded pretty stressful, and I'm meant to be relaxing and de-stressing. So, I texted back the relative to explain my feelings - very diplomatically, but clearly, and not making them the 'bad guy' either. The response I got was all about 'thank you for explaining your feelings so clearly'.. 'I'm not that nervous, just the usual apprehension'.  In other words, I clearly explained the facts of my own situation, and the relative said a lot of nice words that didn't actually have any meaning, so I still didn't know any more about the situation or what the operation actually was.  I decided to leave it and not respond - I didn't know how serious the operation was, I didn't know if the relative had anywhere else to stay and was counting on me. So really it was up to the relative to either be honest with me about what was going on from their point of view, or make a decision. I didn't respond, and the next day the relative texted again to say a friend would drive them down the morning of the operation, and they wouldn't visit me after all.\n\nI'm proud of myself for policing my boundaries on this one. I didn't give in to a sense of obligation to look after my relative, at the expense of my own well-being. I looked after myself. Having done this makes me feel safer and like maybe I *am* able to protect myself.\n\nThe silly thing is, if my relative had been honest and open with me about what the operation was, and what their plans were, and how they were feeling, chances are I would have said 'yes, you are welcome to stay.' But the fact that at no point in the conversation was I told the truth of what was going on made me feel extremely uncomfortable and unsafe.  \n\nI don't know this relative particularly well, and I am keeping an open-mind towards them. I think they probably have FLEAS (as do I), but I'm giving them the benefit of the doubt that they can grow and become healthier.  \n\nHowever, the fact that they have chosen to undertake gender reassignment surgery is once again... not my circus... and not my monkeys.  I don't have an obligation to get involved and help if I don't want to, and particularly when the person in question is not being open and honest with me. \n\nBut, of course, there is a small part of me that is wondering if I'm being a nasty, selfish person. And really I should help my sisters and my relative somehow. But I don't think I am, I think I'm just looking after myself, and I'm allowed to do that. \n\n\n",
        "created_utc": 1451414495,
        "upvote_ratio": ""
    },
    {
        "title": "Flamed by Christmas Card!",
        "author": "ZiziGillespie",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/3yohbf/flamed_by_christmas_card/",
        "text": "I have gone extremely low contact with my mother. She gave me a Christmas card that was also a donation for the Benedictine monks to pray for me for one year because \"You're not happy, ZiziGillespie.\"\nThis one thing has blown my mind so hard that I am crying and feeling unhappy. It's almost as if she hexed me. \nI think I am unhappy because I don't like my job. But I never felt how unhappy I was until my mom sent that card. I'm kind of spiraling here. Please, explain some sense into me.  ",
        "created_utc": 1451412579,
        "upvote_ratio": ""
    },
    {
        "title": "Living in the present is scary",
        "author": "ShojiAn",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/3yoh9k/living_in_the_present_is_scary/",
        "text": "So I have done the work when it comes to recovering from growing up with my nmother. I understand that I will have to deal with things as they surface but the most debilitating stuff is processed and resolved. I have also found workarounds for my problems with learning disabilities and suspected ASD, my nmother still refuses to help me get an official diagnosis. I have somehow dealt with being trans, I want one more operation.\n\nI don't know if I am trying to do everything in one day, most likely, or being present is too intense and therefore scary. I am trying to find a way how to be completely independent despite not being able to speak sometimes and feeling exhausted after spending time around people, not just toxic ones.\n\nLast year and a half I felt overwhelmed in a different way. It was overwhelming because I wasn't sure if I can handle everything. Now I see a high probability that I will handle everything I will need to do but I still feel overwhelmed.",
        "created_utc": 1451412561,
        "upvote_ratio": ""
    },
    {
        "title": "How do you guys deal with opportunists?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/3yo761/how_do_you_guys_deal_with_opportunists/",
        "text": "[deleted]",
        "created_utc": 1451408229,
        "upvote_ratio": ""
    },
    {
        "title": "Relating to FLEAS siblings as a new person...a lesson I learned today",
        "author": "craaackle",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/3ykoxe/relating_to_fleas_siblings_as_a_new_persona/",
        "text": "My brother is back in town! \n\nWe're not very close and for most ACONS with siblings that's not a surprise. In my opinion, he is somewhat dysfunctional in a way similar to our parents. It hurts to make that judgement because the inevitable thing is that our relationship will never be more than superficial...if it exists in the future at all.\n\nAnyway, today we had a bit of a fight and I ended up apologizing because I had my husband read the texts and he thought I sounded judgmental and a bit of a know-it-all. I agreed (I trust my husband to be a outsider's perspective with my best interests) so I apologized. I told my brother that it wasn't fair of me to be bossy because I don't really know who he is or his thought process, I was just assuming he is the same person I *used* to know (aggressive, mean, \"my way or the highway\"). Which is hardly fair to him because we're not close. I've become a different person (he might've described the past me as annoying, backstabbing etc.), so has he.\n\nI guess I never really thought about that too much. But with that realization also comes the sad fact that if I can't accept him for who he is, as he is - if I just interact with him to change him - we can't have a relationship.\n\nWhen I decided to go NC with my parents it was to protect myself. But if I continue LC with my brother (not something new since as I mentioned we're not very close) it'll be because I respect him as a person. That gives me a little hope that I can have a relationship with my brother even if it's not the ideal relationship I(/we(?)) would've liked.\n",
        "created_utc": 1451339956,
        "upvote_ratio": ""
    },
    {
        "title": "Not getting stuck in one mentality, while at the same time not judging or dismissing it?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/3yk1iz/not_getting_stuck_in_one_mentality_while_at_the/",
        "text": "[deleted]",
        "created_utc": 1451330152,
        "upvote_ratio": ""
    },
    {
        "title": "Planet Money: Birkin Bag: N strategies as marketing ploy",
        "author": "Crossswampfast",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/3yjsmd/planet_money_birkin_bag_n_strategies_as_marketing/",
        "text": "I was listening to my morning podcasts with breakfast and heard the most recent Planet Money (here: http://www.npr.org/sections/money/2015/12/25/460870534/episode-672-bagging-a-birkin ) and was struck by the way Hermes uses N strategy to sell their exclusive bags. \n\nI happen to be a hobbyist sewist and have significant experience with both garment and bag construction, so I don't suffer from the basic informational deficit that most people have when it comes to made goods. I look at the bag as an object -- it's a couple hundred dollars of materials and 12-24 hours of skilled labor and tens of thousands of dollars of marketing. (it's also not a great functional or aesthetic object, but that's besides the point.) It might be worth $3K retail; not $20-60K. (My sewing skills are worth at least $50 an hour; I am a skilled artisan, but a generalist with a focus on garments, not bags. A master specialist artisan should be able to be paid commensurate with any other skilled knowledge worker like an attorney.)\n\nBut what caught my attention was the essentially N tactics used to convince people to buy them. Hermes withholds access, the bags are always out of stock unless the buyer performs a specific dance of building a purchase history and uses a Grey Rock persona (if you want the bag as an afterthought to other purchases, you can get it.) If the customer expresses a desire, they are denied. And this keeps people interested and coming back. But possession of one is a form of self-flattery and N-Supply, and promotes further N behavior. The bag is carrying FLEAS that it passes from manufacturer to consumer. The bag seems to confer N-GC status onto its purchasers through its artificial rarity and social signaling. \n\nThe more universal takeaway though is that N strategies are pervasive throughout the culture, and within our culture, many of us are programmed to crave and accept N behaviors as desirable signals. But when we recognize them, we can choose or not to participate. ",
        "created_utc": 1451326567,
        "upvote_ratio": ""
    },
    {
        "title": "Would anyone like to volunteer to help me with something?",
        "author": "strawberrymangopeach",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/3yjnv9/would_anyone_like_to_volunteer_to_help_me_with/",
        "text": "Hi there! \n\nOkay, this might sound really weird but bear with me. One of the things that I am working on in my journey to self improvement is self care/hygiene/appearance. It's related to depression but I think it's also a FLEA from growing up with a mom who discouraged me from wearing makeup, stylish clothes, etc. \n\nI work from home a lot of the time, so the temptation to spend the entire day in my pajamas with messy hair is strong. However, I'm trying to wean myself away from this. When I stay in my pajamas all day, it's much easier to sink back into bed and focus on depressed thoughts. I find that, even when I work from home, getting dressed in the morning, brushing my hair and looking presentable makes a big difference on my mood and productivity throughout the day. \n\nSo my goal is to create a new habit of getting dressed and looking presentable every morning. I don't mean spending hours getting ready, but at least brushing my hair, wearing clothes, putting a bit of makeup on, etc - being in a state where I wouldn't be embarrassed if a friend dropped by unexpectedly. \n\nSo I have a couple of questions:\n\n\n1. Does anyone else here relate to this?    \n2. Would anyone be willing to help me by holding me accountable to this new habit for a while until it becomes second nature?\n\n\nSince I am working at home alone no one else knows whether I am dressed or not, so I know I will be tempted to be lazy and stay in my pajamas. If I could take a selfie and prove that I am dressed and presentable for my work day and send it to someone, it would hold me accountable. (You'd probably have to be on a European time zone for this to work, otherwise you will get the message in the middle of the night?)\n\nIf anyone else struggles with this I would be happy to do the same for you! \n\nIf it's a totally bonkers idea just tell me and I will go away. Haha\n\n**EDIT: Thanks to my wonderful motivation buddy I was [fully dressed](http://imgur.com/gpe1jX4) and sitting in front of my computer at 8:30 am this morning ready to work. I love this community. Hope you are all having happy productive days too! If anyone else out there wants me to be their morning motivational support, just let me know! :)**\n",
        "created_utc": 1451324586,
        "upvote_ratio": ""
    },
    {
        "title": "Advice - Lost in My Head",
        "author": "Psq9909",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/3yiwxb/advice_lost_in_my_head/",
        "text": "Hey All\n\nI have been trying to process this thought, and I hope you folks could\nhelp me as it is causing me a lot of anxiety.\n\nI have been reading and lurking on RBN and LAN and ACoNLAN for months\nnow.  It has helped me to begin processing all of my hurt feelings and\ntraumatic experiences from my childhood and adulthood.\n\nThe feeling I can't kick is that maybe my nmom is just a big old\nwalking flea bag.  Everything that she told me as a child in regards\nto her treatment from grandma, I am now starting to see in other\npeople's posts describing their N's.  Was my grandma an N?  \n\nShe was my rescue from my unstable mother.  She was always there for me when I needed her emotionally. But could she have already hit the \"mello\nage\"?\n\nIt seems that everything my grandma did with my mom that my mom was\nunhappy about in her childhood, she did the exact opposite with me.\nPolar opposites are also very similar when you look at them, because\nthe actual act may be different, but the reasoning and thought process\nis still the same.  It turned into her constantly acting like a covert\nN.  Always wanting to be the center of attention, constantly searching\nfor pity. Always having to one-up any story she heard.  No matter what\nyou did, or a friend did, she knew someone over her life that knew\nsomeone that did it so much better than you. She was so mistreated my grandma and by her sis.  It was not like having a mother, it was living with a sister that I had to compete with, that I\nalso had to help parent.\n\nShe hated the bond that I had with my grandmother, and the fact that I\nnever bonded with her.\n\nMom feels that it was my grandmother trying to brainwash me into hating my mother.\n\nMy grandma recently died.  It crushed me.  My mom forced her way into\nthe funeral on the other side of the country (US), and made the funeral experience uncomfortable.  She complained about my grandmother\nbeing a horrible person in the sanctuary after the funeral for\nwhomever would listen.  My grandma's ashes were still in the\nsanctuary.\n\nMy mom sent gifts for my son's birthday in September, but made no\nappearance for Christmas.\nFor the longest time, I felt that we were the ones NC, but I think she\nmay think she initiated NC first ?!?.\n\nI know my mom has many N traits, but am I delusional thinking that she\nis just flea-ridden?\nShould I reach out to her? It has been 8 months since my grandma died,\nand 4 months since our last contact.\n\nDoes she assume that I am an N? I have been working on my fleas.  I am\nfeeling better emotionally now.  I have forgiven my mother and my\nfather for my childhood, but my SO wants nothing to do with either one\nof them because they are both toxic.\n\nShould I reach out to her in regards to her possibly being an ACoN and\nhaving fleas? Or will this just be inviting the toxicity back into my\nrather mellow current life?",
        "created_utc": 1451312268,
        "upvote_ratio": ""
    },
    {
        "title": "Has anybody heard of Ollie Matthews?",
        "author": "blahblah4798",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/3yi06v/has_anybody_heard_of_ollie_matthews/",
        "text": "Just wondering if you guys saw his facebook or his youtube videos. He's really obsessed with narcissists since his parents and his ex wife suffer from NPD.",
        "created_utc": 1451289412,
        "upvote_ratio": ""
    },
    {
        "title": "Hidden zombie flea rears its ugly head, bites me in the butt",
        "author": "nymphietonks",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/3yh2qf/hidden_zombie_flea_rears_its_ugly_head_bites_me/",
        "text": "Being raised by Narcissists has so many unexpected consequences, I'm still learning to deal with them. Every so often a very buried, very hidden flea rears its ugly head and takes over my body. I'm left wondering wtf I just did and why??.. I've spent many years since my traumatic childhood squashing as many as I can but one bit me today and now someone has blocked me on Facebook.\n\nIn person it's not as difficult to admit I'm wrong, and I frequently do, but for some reason on the internet I refuse -- REFUSE -- to apologize. So today I said some things that I knew she wouldn't like in response to a post and instead of doing what normal people would do when she got angry (basically back off and let it go) I decided to argue my point ad infinitum. I couldn't be wrong, and I wouldn't let go. \n\nI'm ashamed of my immaturity, tbh. I should know better now as an adult that you can't change people's opinions on FB and that it's better to let stupid stuff slide and pick your battles. But today I just couldn't. Now we weren't great friends but my fear of abandonment has kicked in hardcore. I want to apologize, say I was acting like a dick... But I can't. I'm blocked. \n\nI'm left wondering why -- WHY couldn't I just let it go?? What compelled me to keep on and keep on until she felt justified in blocking me??? \n\nThe worst part is this has happened once before. I see one little post that triggers something, and BOOM -- I'm a trained fighting dog spoiling for a good fight. I get excited, latch on and won't let go, and then I get (understandably) blocked. \n\nI remember those fights when I was a kid, where my NMom would follow me around the house in a rage, not letting me get away to think straight, talking in circles around my head. Do I let my guard down on the internet? Am I my NMom on the internet??? Argh!! \n\nWould love some advice, support, stories...",
        "created_utc": 1451271566,
        "upvote_ratio": ""
    },
    {
        "title": "Finally accepting that my best friend isn't the best friend",
        "author": "Skyentiss",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/3yfnxs/finally_accepting_that_my_best_friend_isnt_the/",
        "text": "Like most of us, leaving N's woke me up to other things in my life. What do *I* want? How do I want to be treated in relationships? Where are my boundaries? \n\n Since I was ten years old, I have had a best friend. The thing is, she was my best friend, but I was never her best friend. She loves me, and is a wonderful person, but she was never there for me like I was there for her over the years. And I just kept giving my energy to that relationship, kept spending my money, time, and effort on her and her kids. She had a major loss recently, and so I continued to support her. \n\nI am happy that I did so, and I don't feel anger or regret. But it recently hit me that I don't get that same energy and time back from her with any consistency. And that hurts. And that's ok. \n\nI've had the hardest years of my life these past two, and she doesn't even know what's going on because she doesn't ask. She doesn't call. She texts on occasion. She doesn't even always respond to me. She got me an \"event\" birthday gift that she never followed through with. I saw her at a mutual friend's house recently and she asked how I was and I said \"it's been a really rough week,\" and she just made a sympathetic face and then drifted away to chat with someone else. Maybe right then wasn't the time to get into it, but she never came back to ask. This isn't someone who I know casually, we have been very close for years and years. She always says \"we need to get together\" and \"I never see you guys,\" but then she never follows through. \n\nI've made excuses for her for a long time. But I think I'm finally ready to face the facts that she isn't able or willing to be the type of friend I want. So I've mentally taken a step back and I feel horribly sad about it, but I think it's the only thing I can do, for myself. ",
        "created_utc": 1451248825,
        "upvote_ratio": ""
    },
    {
        "title": "a sort of friendship purgatory",
        "author": "redlentils",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/3yf58p/a_sort_of_friendship_purgatory/",
        "text": "Does anybody else who was RBN find themselves in times of a sort of friendship purgatory? It seemed like when I was in the thick of living with my abusive parents and had no self-worth I didn't really have friends. I had people who used me for their benefit, if that. \n\nAs I've slowly gained my self-worth and self-esteem by breaking free and started doing things it seems like I've graduated from horrible people to better people up a scale over time. But I have so few people who still really treat me as a friend really should. I have people who just aren't there for me when I really need them to be. Some of them, when I have times of change and/or am struggling through things periodically seem to like to be critical in a hurtful way. \n\nI just feel stuck, like I can't seem to move beyond having people who are friends maybe 60% of the time. I really do believe that what is happening externally can reflect what is happening internally, like maybe having these types of friends and not being able to let go and be totally alone for awhile is a sign that I may be \"stuck\" in some not-great patterns internally. \n\nHas anybody been there? Part of me thinks maybe I should ditch these ones too and deal with being alone rather than every time I go through another life change or have to deal with something difficult, I don't have people suddenly breathing down my neck who are supposed to be sort of a support instead. ",
        "created_utc": 1451240421,
        "upvote_ratio": ""
    },
    {
        "title": "Developing a sense of self and intrinsic motivation. Any advice?",
        "author": "strawberrymangopeach",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/3yeyg3/developing_a_sense_of_self_and_intrinsic/",
        "text": "I have moved away, grown up and gone through a lot of growth in terms of my relationship with my parents. They are low contact on the other side of the world my goal now is to focus on healing the cracks and filling in the gaps they left. \n\nMy mother fits the description of \"enmeshment\" in the sense that she didn't treat me like a separate person with my own individuality and opinions. Over the years there was subtle programming - If I did something that benefited my parents or that they liked I got heaped with praise and support. If I even thought about doing something they didn't like (even if it posed no danger to me and was pretty reasonable) they treated me with disdain and punished me. It was like those invisible dog fences - there was an unseen line and I knew when I was getting close to it because I could read the disapproval in everything they did. \n\nIn this environment, I was told all the time that they would love me no matter what - but with subtle conditioning that said, \"... as long as you act a certain way.\" It took me a long time to realize that their \"advice\" wasn't for my benefit and wasn't helping me grow as a person - it was to make their lives better. As soon as I stepped outside of that invisible fence and started doing the things I wanted to do... they weren't happy and turned from supportive and loving to cold and passive aggressive. \n\nNow that I am a grown up, some of this still lingers with me in a number of ways:\n\n- My main motivation growing up was external praise, not intrinsic satisfaction. Now that I'm barely speaking to my parents it's hard to motivate myself to work hard and achieve things anymore for this reason. Yes it was unhealthy, but I think a part of me misses it when they would make a big fuss over my achievements. Doing something just because it makes me proud is a bit strange and doesn't come naturally yet. \n\n- Making my own decisions and setting my own goals is still very new territory. I'll often want to let others decide for me, because that feels much more comfortable. I overthink decisions, second guess myself and feel really anxious about taking responsibility for my choices in case I \"get it wrong.\"\n\n- When it comes moral grey areas of right and wrong I really struggle. I didn't develop a strong moral compass and I'm still trying to figure out the difference between what they tell me is right and what I think is right. \n\nI've come a long way in this regard, but I'm still well behind. If anyone else can relate to this or can offer me any resources or advice they found helpful, it would be great to hear from you. \n",
        "created_utc": 1451237245,
        "upvote_ratio": ""
    },
    {
        "title": "Loving yourself. Really loving yourself with no shame...",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/3yd8dk/loving_yourself_really_loving_yourself_with_no/",
        "text": "[deleted]",
        "created_utc": 1451192549,
        "upvote_ratio": ""
    },
    {
        "title": "Something's missing...",
        "author": "alwaysbluelobsters",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/3yd7x2/somethings_missing/",
        "text": "Does anyone else struggle with an occasional restlessness, as though something is missing? \n\nI have everything I've ever wanted in life – a new fiancé (as of this week :-)), a wonderful career we share together, an education I worked hard for, a family of furry kitties, a cozy home, great food and good friends. There's literally nothing more I could possibly want and I'm really proud of myself for coming so far out of my parent's hellhole in the past 10 years. Life right now is GREAT...except when I sit still and feel this indescribable void.  \n\nI've been so busy with work and taking care of our new rescue cats this season that I haven't stopped at all to check in with how I'm feeling about my first Christmas going NC with NMom and EDad. I think this feeling might be part mourning and grieving still – which I thought I worked through this year – but I'm not sure.\n\nThey left a gift on my back porch on Christmas Eve, which I think triggered me big time. My fiancé dumped it in the trash so I didn't have to go through it at all. But it was still a reminder that they're living, even when I grieved over them this year as though they were dead. I still can't get over how f*cked up that feels, or how to get on the other side of that so I don't feel such an emptiness. I tried thinking about all the crappy Christmases I spent with them to feel better about my choice, and I realized that I can't even recall most of them; I must've buried those memories out of pure survival.\n\nSo I guess my question is this: \n\nI have my own life and \"family\" now – so why do I feel like something is missing? And how do I stop feeling guilty for feeling this way, when I should be feeling more fulfilled than ever? ",
        "created_utc": 1451192304,
        "upvote_ratio": ""
    },
    {
        "title": "Didn't answer my ngrandmother's Christmas call, just found out my grandfather is in the hospital again (support)",
        "author": "Retrobebe83",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/3yd0ht/didnt_answer_my_ngrandmothers_christmas_call_just/",
        "text": "So my NGrandma pissed me off on Monday in a 1 min conversation. Decided I wasn't going to answer when she called on Christmas. Didn't need the stress-pregnant or not. My aunt called Christmas evening and I was in the bathroom and didn't answer. I listened to her voicemail when I got out and she mentioned my grandma was with her and they were calling. Decided to just delete it and message my aunt (my only good family member) today. \n\nI left her a fb post and thanked her for her call. She replied and said she would update me on my grandfather. I knew he had been in the hospital last weekend for blood clots in his lungs (which I found out about after the fact-after he got out-like usual). So I called her and I had an interesting conversation with my aunt. She claimed that my NGrandma wanted to tell me herself and told me \"everything\" on the voice mail. I never heard any of it. She then told me that my nparents came down when my grandfather was first in the hospital (bc of course they knew the moment it happened bc of my GC nfather who wants all family info to go through him and my flea ridden mother the former nurse). I guess they were there when I spoke to my NGrandma Tuesday on her birthday for all of a minute that resulted in my crying. My aunt said \"if she was short with you it was because your mother was there.\"\n\nShe then updated me about how my grandfather is back in the hospital since Thursday bc of having chest pains again. He has blood clots, his heart was In the heart attack danger zone, a blood infection &amp;amp; gal stones. They said he's doing better. He's been on a slow decline for years but the dementia has really started to set in over the last few years. My aunt insisted my grandma wanted to tell me all this. I take that with a grain of salt because the last year's conversations have put us a LC. \n\nI decided a while ago that when my grandfather does pass, I won't go to the funeral. It would be a snake pit for my mental health. This is terrible, but part of me wished a long time ago that it would happen while I was pregnant so I had an excuse for not going. Obviously it hasn't happened, but I am almost half way through my pregnancy. So I feel a little bit of guilt for that. Obviously I know that it's not my fault, his health as been declining for ages and it's only a matter of time. I also feel a bit guilty that I ignore my grandmother's call &amp;amp; he's in the hospital. Again, I know it's a coincidence or ntrick but the trained emotional reaction is somewhat there. \n\nAnyways. Just wanted to process that out. Doesn't change my decision in not going to the funeral when it happens. Just had to process it all out. \n\nUpdate edit: my aunt called again and told me about a convo she had with my grandma 2 weeks ago that she and forgotten bc she got sick. Basically she stood up for my right to not speak to my parents just like my NGrandma has forced her to comply with my nfather's choice to not speak to his brothers. She brought up everything that my NGrandma has asked her to do bc of my nfather and everything (in general terms) he did to her since childhood. She even said she only talks to him and says she loves him for her. When my NGrandma pushed for what happened as a kid, she then paused and said \"never mind, I don't want to know\". My aunt commented about how I was right, she does treat him like the golden boy. My aunt seems to think that  my NGrandma has softened towards me and that's why she insisted she tell me about my grandfather (aunt finally told her about my nfather's decree about the family information). She encouraged me to call her tomorrow but I'm afraid the tiger hast changed her stripes at all and it's not worth it. But with everything going on w my grandfather, who knows. ",
        "created_utc": 1451188351,
        "upvote_ratio": ""
    },
    {
        "title": "Duty and meaning",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/3ycuys/duty_and_meaning/",
        "text": "[deleted]",
        "created_utc": 1451185404,
        "upvote_ratio": ""
    },
    {
        "title": "Shitty N Christmas gift thread!",
        "author": "jojotoughasnails",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/3yb76t/shitty_n_christmas_gift_thread/",
        "text": "I hope everyone had a very merry LC/NC holiday. I figured it'd be fun to create a thread to share the ridiculous gifts from the N family members in our lives.\n\nI'm NC with Nmom. That didn't stop her from dropping off a heaping load of junk on my porch. Included were expired peanut butter(it's organic!), a carbon monoxide detector(what I've always wanted), oversized men's clothes with a sports logo(for the bookworm I am), and some cheap gaudy jewelery(what else would a pragmatic minimalist want?)....among an array of other dollar store looking items.\n\nAnyone else care to share their \"spoils\"?\n\nEDIT: I'm so happy with this! It's great not to feel alone about these things. And I love how everyone is turning it into a positive thing. Donations!",
        "created_utc": 1451155626,
        "upvote_ratio": ""
    },
    {
        "title": "I think Christmas went ok",
        "author": "htaylor393",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/3yaxij/i_think_christmas_went_ok/",
        "text": "It was a relaxed day, no-one barking orders at me, no 3 course breakfast followed by a 3 course lunch, no waiting for everyone to open their presents before getting mine, no arguments or shouting, just me, my fiance and my baby having a lovely day.\n\nI got presents from my fiances parents, aunt, and grandparents which I wasn't expecting. I had a lovely warm bowl of porridge for breakfast and a lovely gammon steak for lunch. We went to our friends (who're also neighbours) for half an hour and had a glass of lovely wine, then to my fiances parents where our daughter had her new doll played with my her male cousin (technically her 1st cousin once removed) who's only a few weeks older than her. We ate yummy buffet food and not one horrible thing was said to me all day.\n\nIt felt weird to have a good christmas for a change.",
        "created_utc": 1451151038,
        "upvote_ratio": ""
    },
    {
        "title": "TEDxYYC - Dr. Megan McElheran - Trauma Change Resilience",
        "author": "saddetective87",
        "url": "https://www.youtube.com/watch?v=P8nMgY5dkTs&amp;list=WL&amp;index=524",
        "text": "",
        "created_utc": 1451135869,
        "upvote_ratio": ""
    },
    {
        "title": "I had a great Christmas?",
        "author": "teethadvice",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/3y9epo/i_had_a_great_christmas/",
        "text": "I'm kind of teary. Because, I remember this time last year, I was by myself wondering what I should do for my first christmas NC from family. I don't remember what I did, probably just watched movies and listened to music. I was totally cool with it. \n  \nThis year, a former roommate invited me to their christmas. At first when she invited me, I was tempted to say no. I didn't want to seem like a lonely soul for Christmas that they had to extend their hearts too. But, I decided to say yes. I show up with my gifts Christmas Eve. And I was met with such a warm, normal family with kids and what not. The mother calling me her hija and that I should come and be her daughter's roommate again in this new place. The food was wonderful and the atmosphere was relaxed. I slept over, and again, for christmas, it was a normal day playing games, having fun, relaxing, and what not.  \n  \nBefore I left, one of the kids who I met that day. I was giving him a goodbye hug. And, I was you know making it one of those standard 2 second hug. As I attempted to part from him, he just held me closer and gave me a longer hug for about like 5 more seconds. I was kind of surprised and just  taken aback by the gesture. That this 11 year old kid felt comfortable with giving me a longer hug, and I squeezed him back tight. And, I don't know. Looking back to that hug now and the entire experience with their family, I'm just extremely blessed to have been able to share a holiday with a family like theirs.  \n  \nI hope you all had a Christmas that left you leaving content and satisfied and grateful. Happy holidays everyone :) Thank you for being there for me since I first made this account. ",
        "created_utc": 1451110495,
        "upvote_ratio": ""
    },
    {
        "title": "I did it.",
        "author": "everanything",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/3y87w7/i_did_it/",
        "text": "I did it. I did it. You guys. My first Christmas free of my NMom. No call, no gift, nothing. I feel so strong and so proud of myself. Thank you to the comm for the advice the last two years. It's meant and helped so much. I love you guys. Merry Christmas.",
        "created_utc": 1451085918,
        "upvote_ratio": ""
    },
    {
        "title": "John Bradshaw's Homecoming Series",
        "author": "supercooldragons",
        "url": "https://www.youtube.com/playlist?list=PLj0JjUCx1S2240fj9gwhSE7PrqDwXrhlh",
        "text": "",
        "created_utc": 1451083944,
        "upvote_ratio": ""
    },
    {
        "title": "Holiday check-in thread",
        "author": "8pointsforgryffindor",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/3y77ld/holiday_checkin_thread/",
        "text": "How is this holiday going for you?\n\nPlease feel free to share. And remember, you are not alone. ",
        "created_utc": 1451066504,
        "upvote_ratio": ""
    },
    {
        "title": "My heart is breaking",
        "author": "Gh0st-grl",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/3y5mdc/my_heart_is_breaking/",
        "text": "Maybe this isn't the right sub for this, it's nothing really to do with my toxic family. More so my new little family, my partner and I. I'm so happy to have him, especially around this time of year that's usually so hard for me. But I feel like we're falling apart. He's been hinting all month hardcore about popping the question. And now it's Christmas Eve, he started a fight out of the blue and said he's breaking up with me, won't kiss me goodnight, and isn't going to see my family tomorrow. We got in a huge fight like this a few days ago. He's all I have and I don't want this to fall apart, and it's all my fault for pushing for more commitment and now I have nothing. I was so happy to finally have a \"family\" (him) and I've ruined it all. I ruined the holidays and everything is broken. I don't know what to do\n\n\n\nUpdate: thank you all for your kind words and support. I was doing that stupid thing where I blow things out of proportion. By the time I posted this and smoked a cigarette he was fast asleep. I woke him up to ask if everything was okay - I couldn't wait until morning- and he had forgotten about our fight.. He was already half asleep when we were arguing. I think he was tired and cranky and just sort of being an ass, and in my mind that meant everything was falling apart because of me. ",
        "created_utc": 1451021640,
        "upvote_ratio": ""
    },
    {
        "title": "Today I got my keys",
        "author": "ihaveapentax",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/3y2exn/today_i_got_my_keys/",
        "text": "[removed]",
        "created_utc": 1450948218,
        "upvote_ratio": ""
    },
    {
        "title": "\"There is nothing more heartbreaking than finding out your ugliest layer of self is too ugly for someone you love to handle.\"",
        "author": "unbringing",
        "url": "http://www.huffingtonpost.com/lexi-herrick/11-habits-of-people-with-_b_6384062.html",
        "text": "",
        "created_utc": 1450937532,
        "upvote_ratio": ""
    },
    {
        "title": "The masquerade: A Rant in F#. (TW wife/child abuse, Nlogic)",
        "author": "TheTartanDervish",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/3y1gj2/the_masquerade_a_rant_in_f_tw_wifechild_abuse/",
        "text": "Dear frieNd: \n\nOh that's interesting... I thought the earth went around the sun, thanks for educating me how it revolves around you! \n\nShame you have no time for all your friends but, to be fair, at least you're ensuring strict equality among everyone expected to sacrifice friendship on your altar to workaholism. And that's a step up from a few years ago when it was alcoholism. Yay?\n\nAmazing that you've missed the irony of complaining other people live too far away to interrupt your (online) studies by visiting them, when you expected the same people to drop their (strictly in-person) studies or jobs to be there for you. You're really a good comedian - when it comes to other peoples' hypocrisy.\n\nHow awful that the VA staff accidentally threw out your very expensive medical equipment item. Of course an apology and repayment aren't enough! You're clearly the only person having *important problems* at the VA so why do you have to wait behind all those damned combat disabled veterans? \n\nOh woops, you meant all those damned guys except Tartan. Yeah well Tartan should know she's only in a better priority group because she got an Honorable discharge, you didn't deserve your Administrative separation because your combat stress is worse than hers *and* your command were all dickheads. Oh you forgot she had that problem that her CO got fired, and she nearly lost her rank because you lied. No that's all history, you deserve the top priority group too!\n\nPardon the confusion, did you really forget that you cost your ex-gf about $15,000 loans and £10,000 scholarship she could've used to finish her doctorate? Yes she was an idiot to give up on her doctorate but she chose to sacrifice that to be with you, that's on her.\n\nBecause it's weird how you bewail your student loans while refusing every offer of veteran advocacy. Yes your ex-gf still  tries to help but it's her job, you don't play the\"yes but\" game like she says, ugh.\n\nAnd yet you expect she'll take you back just as soon as you finish uni. The last time she saw you she was kicking you out  for leaving a love letter from another woman in your bag. It's totally not your fault had a seizure, your ex-gf's a horrible person for \"making drama\" by calling the ambulance and then going through your bag as the EMTs told her to do. She shouldn't've read it once she saw it wasn't anything medical.\n\nAnyway the lady who wrote that note must have snuck it into your bag somehow because you never knew she liked you, anyway she's kinda crazy... wow, how hard that must be for you, having such a persistent fan club! \n\nBut yeah, your ex-gf will just hang around for a couple years til you finish uni and then definitely take you back. \n\nNever mind you owe her brother $8500 for a land purchase you backed out of, her brother's cool too. Anyway it was all the addiction talking and you did the Step for that awhile back, why does he keep score against you?\n\nIt's like that friend that you don't understand why he's no longer your friend... You were his best man, you flew all that way to his wedding on his dime! And then you couldn't pay him back because you missed work to attend anyway, and he's your buddy so you thought it was a gift, and that was a dozen years ago so he has a grudge problem.\n\nBut seriously, we all know it, the real N is your biological father who did some prison stretches for being a conman and a deadbeat dad. You wouldn't have been hungry or gotten abused if he'd not been so horrible, if he hadn't driven your poor mother to near-fatal overdosing. \n\nInterestingly, we all support you on this because your mom was a nice lady once she decided to get help, and it took a lot of guts for her to call the social worker knowing she might lose you... but you'll never quite forgive her for the day biofather put you in the dryer and ran it, she shouldn't have been out interviewing for a job!\n\nYes, it's irritating that your brother is convinced he can pray away his bisexuality. Yes, it's horrible that he put his kids into a fundamentalist Christian school that doesn't teach evolution and logic. But your attitude is totally fine so why doesn't he visit you more?\n\nOh sorry, we should stop talking because you need your perfect pitch hearing rested up to mix a concert tonight? Yes, we know you were the soundman for Famous 90s Alternative Band for two years touring the world. And your time is as valuable as this skill.\n\nThe double standard waves brightly over your moral high ground, so high that only the microbes can pass below you.\n\nGood luck frieNd, you'll need it.",
        "created_utc": 1450926646,
        "upvote_ratio": ""
    },
    {
        "title": "Update: I threw my son's gifts away...I'm in a dark place. [support]",
        "author": "Annme319",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/3y12lj/update_i_threw_my_sons_gifts_awayim_in_a_dark/",
        "text": "I posted [here](https://www.reddit.com/r/LifeAfterNarcissism/comments/3xrfrq/question_about_boundaries_and_nc/) about the gifts and the confusion I felt. Thanks for the great help, btw. My husband put the box in the front of his work truck to put in the trash the next day. I went to bed at about 10 and slept 2 hours, then woke up at midnight with my stomach in knots and never went back to sleep. This went on till 5 am, when I crept to the truck, brought in the package, and cut it open. Inside were about 5 wrapped Christmas gifts. I never opened the gifts so I have no idea what was inside. I have no idea what possessed me to open the box. I quickly taped it shut and stuck it back in the truck. He put it in the dumpster that morning.\n\nOf course now I feel soul crushing guilt. (The gifts were for my 3 year old son). My mom always had a fondness for using gifts as weapons, usually involving guilt. I realize she was totally trying to manipulate me, but I feel like a shitty human being and the world's worst person. What kind of mother throws away gifts for her kid? I can't get the horrible voice to leave my head. My mom's on a fixed income, and it cost $11 to mail the box. I feel like such an asshole, like maybe I'm the N. It's like I have 2 arguing voices in my head...\"she went to all that trouble, and you just threw it out like trash.\" \"you know if you opened it, you would have to call and say thank you, and that's how she sucks you back in.\" \"She doesn't have the money for toilet paper, and you threw out things she took time shopping for and wrapping.\" \"she went to the trouble only because she knew she might get a payoff.\" \"She must love him or she wouldn't have bought him stuff.\" \"If she loved him she would have asked about him or to talk to him on the phone instead of talking about herself nearly the whole time.\" \"Maybe it was really nice stuff.\" \"Has it ever been really nice stuff? No.\"\n\nI can't shake this guilt. I feel so trapped like I am never going to be out of this nonsense. I just want to be normal so bad and I keep getting sucked into this stuff. Has anyone out there went through this or just have a kind word? I also feel guilty being needy on here like this I wish I had more experience so maybe I could actually contribute. Thanks guys. I get kind of emotional when I think about strangers reaching out to strangers on here. It's a very cool thing.\n\nSee, I am all over the damn place. And I haven't even drank in over 10 years so it's not even that I'm sitting here by myself sloshed. My head is like jello, and my heart is so broken.",
        "created_utc": 1450919180,
        "upvote_ratio": ""
    },
    {
        "title": "Is it possible to get better with no outside support?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/3y10pd/is_it_possible_to_get_better_with_no_outside/",
        "text": "[deleted]",
        "created_utc": 1450918221,
        "upvote_ratio": ""
    },
    {
        "title": "Need help with inspirational quotes!",
        "author": "devoricpiano",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/3y0l8k/need_help_with_inspirational_quotes/",
        "text": "This is a weird request. That being said I am hoping some of you can help! \nI'm an ACoN that works in the mental health field. I want to give my clients \"New Years Cards\" with a nice inspirational message on it. Some of the ones I've encountered have been really helpful for me. I have about 15 clients and I need a lot of quotes to pick from. I was thinking making a bunch then having people pick one randomly and having that be their card.\nAny help or direction would be awesome. ",
        "created_utc": 1450910667,
        "upvote_ratio": ""
    },
    {
        "title": "All about gaslighting, how you can tell, what you can do",
        "author": "sqqueen",
        "url": "http://everydayfeminism.com/2015/08/things-wish-known-gaslighting/",
        "text": "",
        "created_utc": 1450895304,
        "upvote_ratio": ""
    },
    {
        "title": "How to practice self care but avoid wallowing and no ambition?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/3xzeow/how_to_practice_self_care_but_avoid_wallowing_and/",
        "text": "[deleted]",
        "created_utc": 1450891688,
        "upvote_ratio": ""
    },
    {
        "title": "Estrangement, a choice when engagement is toxic",
        "author": "sqqueen",
        "url": "http://womboflight.com/2015/10/20/navigating-no-contact-when-estrangement-from-your-mother-is-the-healthiest-choice/",
        "text": "",
        "created_utc": 1450887414,
        "upvote_ratio": ""
    },
    {
        "title": "I can't calm down, and I can't do anything. How can I calm down? [Vent]",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/3xyf0j/i_cant_calm_down_and_i_cant_do_anything_how_can_i/",
        "text": "[deleted]",
        "created_utc": 1450872942,
        "upvote_ratio": ""
    },
    {
        "title": "Christmas gifts from narcissists...",
        "author": "ZiziGillespie",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/3xybue/christmas_gifts_from_narcissists/",
        "text": "Remember on The Simpsons when Homer gave Marge a bowling ball that had HOMER engraved on it? When I was about 14 my nmom decided that I loved snow globes and told me she would now buy me one every year for my birthday. I like snow globes as much as the next person but now I have quite the collection! What gifts did you receive from your narcissist? ",
        "created_utc": 1450870608,
        "upvote_ratio": ""
    },
    {
        "title": "[vent] had a horrible experience with a doctor",
        "author": "LionessSekhmet",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/3xxl2j/vent_had_a_horrible_experience_with_a_doctor/",
        "text": "(This is related to my ACoN experience, I promise.  I explain how below.)\n\nOkay, so first the situation in a nutshell: there's this thing that happens to me, and has happened to me for my whole life. I have \"weird spells\" and become \"confused\" (but it's more than just normally confused, like my entire brain just stops working all of a sudden), and lose the ability to speak and have a lot of weird sensory experiences.  After doing some research recently, I realized there's a chance these could be a form of seizure, even though I don't lose consciousness or convulse.  I've already been diagnosed with migraines, and the two may or may not be related.  I often seem to get a migraine after I have a \"weird spell\", but not always.  So, I went to see a neurologist about my concerns.\n\nNow the personal context: this is something that has happened to me my whole life, and nobody has ever believed me.  My Nmom either mocked me for it or I got in trouble, and there have been times when it happened in the middle of a conversation causing other people to think that I'm either super-rude or mentally defective.  (Well, I guess that second one might be technically true.)  On top of the maybe-seizures themselves causing a lot of fear and anxiety, I think they're also a PTSD trigger for me because of years of learning to suppress every sign of them and all of the times when my brain would freak out and stop working and nobody would believe me or help me.  I was always alone with this.  So speaking about it to a doctor is a *huge* deal to me on a personal level.  \n\nTo make matters even more difficult, I was having a mild version of some of the symptoms on this very day, and part of that is difficulty concentrating and putting words together.  So I wasn't in a great place already.\n\nWell, this doctor was just awful.  I couldn't get five words out without him interrupting, and every time I used a medical term (because I've done my fucking self-education about migraines like you're *supposed* to do), he would stop me and make me rephrase what I was saying without using any medical terminology, which was incredibly distracting and caused me to keep losing my train of thought.  \n\nWhen I tried to tell him that I was experiencing symptoms right now, he went and got this weird painkiller drink and made me drink it, without even trying to understand exactly what symptoms I was having.  (...Not ones that a painkiller would help with, actually.)  It was incredibly obvious that he had already decided that I only had migraines, all of my symptoms were because of the migraines, and that he didn't need to actually listen to what I was saying.  \n\nOn top of all this, I brought my spouse to the appointment with me, and this doctor looked at him, talked to him, and interacted with him pretty much entirely during the consultation.  He basically \"consulted\" with my husband and ignored me completely, which felt incredibly sexist.\n\nAnd now it's triggered my whole \"not being believed\" trigger again, and I'm back in this place that I don't like being, where everything seems dark and hopeless and like it will never get better.  It's not even rational, because the consultation did lead to results; I got prescribed an antidepressant that is supposed to help with sleep and prevent migraines, and he ordered an EEG test to check for unusual activity.  So on a rational level, I got the outcome that I wanted, I guess.\n\nBut it's just the way that he acted toward me and the way it all went down that made me feel like I'm never going to get people to take me seriously about this kind of stuff.  I feel so hopeless right now.",
        "created_utc": 1450850947,
        "upvote_ratio": ""
    },
    {
        "title": "For those of us who are spending Christmas alone, it seems the media is catching on about certain NC realities...",
        "author": "saddetective87",
        "url": "http://www.huffingtonpost.ca/lenora-thompson/toxic-family-christmas_b_8854830.html",
        "text": "",
        "created_utc": 1450839113,
        "upvote_ratio": ""
    },
    {
        "title": "Slightly ranty advice question",
        "author": "TheTartanDervish",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/3xwsns/slightly_ranty_advice_question/",
        "text": "So to recap, I'm a disabled veteran and I'm invited to address a major military studies group about some of my old career experience.\n\nHowever, being military people, there is a bit of a bias against my old job --  technically a very dark gray area legally at the time, but now a respected combat job. The hatred around my work in helping create this job runs very high because a Commanding General had to end the argument at the time, which ended a career later. There remains a definite \"ew girls in my gun club yuck\" element in some quarters, one of whom is a lecturer in the same meeting.\n\nRecently I put a blue streak in my hair, my friend is a colorist and did it to cheer me up after my surgery. Normally I'd dye it back for the conference but I really like it and frankly I'm established well enough in my field(s) that it won't matter to me personally.\n\nThe difficulty is that  I know it will become ammunition for the hater and at least catch the \"unprofessional\" label for some more. Personally I can handle it (mostly by pretending to check my watch and say \"wow, 2016 and you're still failing to overcome that mental obstacle?\") and I've got lots of friends at this meeting who agree that my hair color does not affect my brain contents... but the negativity bothers me sometimes, especially since I'll be travel-stressed and wheelchair-bound from getting to this meeting.\n\nHowever... there are so few military women in this level that we are extremely careful not to skyline ourselves because what one of us does *definitely* causes problems for the next lady. I am still nervous that my unconventional hairdo will become just one more piece of ammo to exclude women.\n\nBut I think I'm having a \"taking responsibility for how others feel\" flea. Your thoughts?\n\n",
        "created_utc": 1450835864,
        "upvote_ratio": ""
    },
    {
        "title": "Why do I even bother w my grandma? [vent/upset/support]",
        "author": "Retrobebe83",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/3xuh02/why_do_i_even_bother_w_my_grandma_ventupsetsupport/",
        "text": "I think my grandma is an N- though not nearly as severe as her son/my nfather, but he had to learn it from somewhere. She's been super pissed at me since I went NC. We fought every time we've talked since then and she doesn't believe me at all. So I've gone LC with her. \n\nI sent her an email for Christmas because I hate calling her. I'm super broke this year, so I told her we would be unable to and understand if she doesn't want to send me and my husband gifts and to focus on my son and baby on the way this year. Gave her our wish lists just in case. Got no response but then got packages in the mail for my son. Ok that's fine. \n \nToday is her birthday. I struggled with if I should call or not. But I \"manned up\" and did. I called to wish her a happy birthday, seems surprised I remembered and she asks me how I'm doing (I'm good)and then proceeds to tell me that my grandfather was in the hospital for a blood clot in his lung and on their way to the heart dr. No one ever tells me when he's in the hospital. And my nfather has actually said to my aunt (the one decent family member I have) that all family info has to go through him. Ha. \n\nThen she tells me that I'm \"right. We shouldn't bother with gifts for each other. Enough is enough\" I just said \"ok\" in a like \"wtf you talking about bc there is obvious subtext there\" and quickly changed the subject to how she sent the \"kid(s?)\" gifts and my aunt helped (aka did it) And then said goodbye. The convo was literally one min. I said 5 words. \n\nWay to make a pregnant woman cry in a minute conversation before her check up. Classy. I'm so done. Not gonna answer when she calls on Christmas. Not gonna invite her to the baby shower or christening. If she can make me cry in a min convo, then why would I want to see her in person?!",
        "created_utc": 1450799903,
        "upvote_ratio": ""
    },
    {
        "title": "Question about boundaries and NC?",
        "author": "Annme319",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/3xrfrq/question_about_boundaries_and_nc/",
        "text": "I never know which sub to post in, so if this doesn't belong I will delete it. But anyway, I'm struggling to understand something, and with the way I was raised I have no idea what \"normal\" is. \n\nMy NC mom keeps attempting to get back in touch with me. I've had to change my cell number, and my SO has been checking the mail. Well, there was a package addressed to my son on the front porch, and I saw it. This is the second round of packages in 7 months NC. \n\nSo my question is probably stupid, but if someone had told me never to contact them again, I certainly would stop trying afraid I would piss the person off more? (Especially if it were someone I supposedly loved, I would want them to be happy even if it was without me?) Am I weird, or is this something a normal person would do? I guess I'm wondering if what she's doing is sick, or would a normal person react with continued calls and gifts that were unwelcome? I understand about supply and all that, but why not just move on to new supply? Is it because I am her child she feels a special sense of entitlement? I'm so confused. It helps me to understand their behavior, because then I don't take it so personally. Can anyone help? ",
        "created_utc": 1450738363,
        "upvote_ratio": ""
    },
    {
        "title": "[VENT] I don't know if I enjoy anything anymore...",
        "author": "spoopycheeseburger",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/3xr35b/vent_i_dont_know_if_i_enjoy_anything_anymore/",
        "text": "I feel like I've just been trying to keep busy to drown out the flashbacks and the sound of his voice that echoes in my head even though we haven't spoken in weeks. Everything I do is to either fill the silence or to try and better myself because I never feel good enough. I never feel interesting enough. I never feel healthy enough. I never feel like I'm trying hard enough or making enough progress, so in order to stop his voice in my head telling me so, and my own internal voice agreeing with him, I watch interesting shows and tutorials, I research new hobbies, I clean to feel useful and berate myself that I've been in bed for days letting the house get this messy, I key myself up and work myself to exhaustion to compensate for the insufficiency I feel, and then I feel stressed out that I'm stressed out and can't handle everyday life.  \n\nIt all just reinforces itself. I try, try too hard, over-extend, crash and burn, and then I hear his voice: \"I told you you weren't good enough.\" And then I hear myself: \"I know.\"  \n\nBut I have to be. Even though I know you don't deserve me. I have to show you I can be what you want. I can be worthy. If only to hold it over your head that I am amazing and you'll never touch me again. I want you to want me because I hate you and I want the satisfaction of telling you no.  \n\n**TL;DR:** I am a fucking basket case that is becoming the very thing I hate.  \n\n**EDIT:** This has been looping in my head for the last three days and I had to get it out... I feel better now. ",
        "created_utc": 1450732930,
        "upvote_ratio": ""
    },
    {
        "title": "a little NC victory",
        "author": "BabbitandBromide",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/3xqmo8/a_little_nc_victory/",
        "text": "x-post to r/parentlessbychoice\n\nmy 33rd birthday was last week, and as I predicted/feared, Nmom left a voicemail - haven't heard from her in almost a year? and that was a threat. i have her number saved in my phone (under the name 'Squawk') so that i don't innocently pick up an unknown number. i didn't see the message for a couple of days because iPhones save voicemails from blocked numbers in a subfolder (why do they save them at all is what i want to know!!)\n\nanyway, i saw it, and i DELETED WITHOUT LISTENING! my heart pounded a little bit though. maybe next year i will do it without the heart pound :/\n\ni'm sure it would have either been a 'i miss you so much come back to me honey my life is empty without you' OR an 'even though you were terrible in x y and z ways i want you to know i will always love you and have a wonderful birthday even though you ruined my life' kind of message depending on her mood. either way i don't have to have the sound of it echoing in my head!",
        "created_utc": 1450726309,
        "upvote_ratio": ""
    },
    {
        "title": "DAE get triggered by movies, even PG-13 ones?",
        "author": "8pointsforgryffindor",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/3xpgjp/dae_get_triggered_by_movies_even_pg13_ones/",
        "text": "I watched Star Wars yesterday, which is a PG-13 movie. During the movie I enjoyed it, but after I got out I felt really triggered. On the way home, I shut down and couldn't talk. Had to go home and sleep for a while to shake it off. I felt miserable all day. (I usually am only able to watch comedies or kid's movies). The movie was fairly dark, and some of the thematic elements about parents and children who abandoned them were also really tough to watch. \n\nI planned to go see it again with coworkers tomorrow, but I don't want to. Now I'm struggling with feelings of guilt because I feel like I'm disappointing them. I'm trying to remember that I have a right to change my mind and do what's best for me. And that it's also ok to be triggered by a movie, even if it's supposedly \"for kids.\"\n\nAlso, I'm wondering if anybody else has experienced something similar. Thanks, LAN.",
        "created_utc": 1450708670,
        "upvote_ratio": ""
    },
    {
        "title": "I'm so tired of carrying all this pain and sadness around [vent/support]",
        "author": "Retrobebe83",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/3xouc3/im_so_tired_of_carrying_all_this_pain_and_sadness/",
        "text": "This has probably been the most difficult 2 years of my life (I've been 1.5 years NC). I have made some pretty bold changes in my life and nothing feels familiar or constant anymore except the sadness and pain. I quit my job of almost 10 years-which was great for my head &amp; heart but terrible for our finances. I took some time off to be with my son and I went back to school &amp; changed careers. I know have a job in my dream field but it's not paying the bills (it's half of what I was making). Half the time I feel like I suck at it. At least with my old job, however burnt out I was, I could do it in my sleep. I just wasn't passionate anymore (sn: I did just interview for a much better paying job in the new field that I should hear about in the new year). We are so in debt and behind on bills it isn't even funny. To top it all off, I'm pregnant with baby # 2 (which we are very excited for). \n\nSo maybe it's the hormones adding fuel to the fire, but I just feel so emotionally exhausted, sad and depressed. I can usually keep it at bay and focus on the present and put on my happy face. Then I have weekends, like this last one, where I cry and sleep for two days. I'm just on a hair trigger. Life shit happens and I have, what feels like, a nuclear reaction to it. I'm running out of my reserves to power through this dark time. Getting this new job (which pays slightly better than the one I quit) will help ease A LOT of what's making this time so dark. The few week wait is killer. But it's also little things. \n\nI hate feeling everything that comes with being an ACoN. I hate how sensitive I am to being treated by others. I hate that I have attachment issues and abandonment issues. I hate that I don't feel safe half the time except when I'm with my husband and son. I hate that I feel like such a fucking failure 75% of the time. I cried yesterday because I was so hungry I almost passed out but we only had $30 to last us until payday and not much food in the house-or at least food I wanted to/could eat. And that money was supposed to go towards my Christmas gifts. I'm just so tired of crying and hurting and worrying and stressing out and feeling abnormal. I just want to feel safe and secure. I want to know that I am taken care of &amp; loved no matter what (beyond my husband and BFF, I don't spect that from anyone else). \n\nSome days I really want to take all of this baggage off my shoulders and put it down, set it on fire and never look back. I'm so over all of this. I'm so tired of having a part of e that's always sad and scared. ",
        "created_utc": 1450694851,
        "upvote_ratio": ""
    },
    {
        "title": "For those male ACON, how did you learn to be a \"man\"?",
        "author": "saddetective87",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/3xoi75/for_those_male_acon_how_did_you_learn_to_be_a_man/",
        "text": "(No disrespect to female ACON, but this is about masculinity - if you feel you can contribute than by all means.)\n\nLong story short, my NM \"raised\" four boys didn't teach us to be men. Any attempt at masculinity or personal autonomy (at least from my perspective) was quashed in psychological abuse. We were forbidden to see our father and he has died recently, so that is not an option, and all the male figures in my family are either people who have sided with my mother or people I don't care to talk to because they are assholes.  \n\nI have made an effort to learn from the good lessons from the past through books and movies (loyalty to friends and family, pay your debts, never be cruel or cowardly, and so on), but there are times I still fall short. I have difficulty relating to most young men my age. A co-worker of mine said I was a 60-year old in a 20 somethings body. I guess this comes from a lot of lessons I learned on survival come from my grandfather who lived through the Great Depression and a lot of books I have read come from that time or WWII.\n\nThis isn't a question of gender identity in the regular sense, just from what I have gleened from historical masculinity isn't matching up with what I see in the real world. What did you do, or are doing?\n\nBTW, who else hates the phrase \"man up\"? What does that mean, aside from do what needs to be done?",
        "created_utc": 1450685820,
        "upvote_ratio": ""
    },
    {
        "title": "Can anyone help me understand the gc and his relationship with the n?",
        "author": "toobadiremember",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/3xnjdm/can_anyone_help_me_understand_the_gc_and_his/",
        "text": "I'm in the process of cutting final ties with gc and emom, but it's taking time as we have to divide up a corporation. I'm trying as much as possible to keep things civil but I just need to talk I guess.\n\nFirst of all, picture our company like the Blueth family's from arrested development. Gc is like a more infuriating Gob, constantly using the company credit card for personal finances. The latest incidence was on king crab he had flown in from Alaska. I wish I were joking. $500 worth of specialty seafood which he consumed and at the same time thought our mechanic shop should pay for.. That I should pay for. seriously, he doesn't know why I'm pissed. He almost fired our accountant for trying to hold him personally accountable for the purchase, we're taking real rage. He's completely flabbergasted when I suggest the business do an equitable 'favor' for me.. I'm guessing with the crab his wife didn't want him to make the purchase but he was craving it so he tried to hide it from her?\n\nWe had a business meeting at his house this weekend and things were getting a little heated. I went to throw away my soda and saw his garbage was full so I volunteered to take it out to the garage to give us both a break. On the way I saw a room in his house that was previously a storage room. He had decorated it and made it a hunting room, and I couldn't help but stare. Ndad was an avid archer and I just kind of stared at what kind of seems like a shrine to ndad? He had a full table set up just like ndads where they make their own arrows. The walls had stuffed heads of animals the kind ndad liked to hunt, and there were arrowhead naive American art just like ndad had hung above his headboard when we were growing up. There were family photos of all of us right before the divorce -a time period my ndad frequently reflected on as the best time of his life. In the corner of the room were easily thousands of dollars of complex bow targets and top of the line hunting equipment all brand new. Everything in that room was an ode to ndad, from the brand of beer next to the desk to the color and breed of hunting dog laying on his dog bed to go with all of this. Even the style of house gc choose to buy (mid century modern with a big willow tree in the back yard, just like ndad grew up with). \n\nI want to understand my brother's idolization of this horrible, horrible human being. Practically worshipping him.. How many people have a deep love for their parent without trying to recreate all of the material, household and hobby things that that parent likes? Gc even went out and bought the same style truck as ndad in the same color.An 80k luxury suv neither can afford.\n\n I want to understand how my brother could so quickly dismiss all the pain this person put me through. I want to understand how this mental illness spreads like a disease. I just don't get it.\n\nspending home with emom and gc makes me feel like I am taking crazy pills. Can anyone help me understand the gc?\n\n",
        "created_utc": 1450666144,
        "upvote_ratio": ""
    },
    {
        "title": "Had a momentary freak out yesterday",
        "author": "Retrobebe83",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/3xlh0f/had_a_momentary_freak_out_yesterday/",
        "text": "I've been NC for 1.5 years and this is our second Christmas without my FOO. I barely talk to my NGrandma besides sending her our Amazon list of what gifts she can get my son. Yesterday we got a package from Amazon with no indication of who it was from. I freaked out and thought it was my Nparents trying to sneak in a gift (wouldn't put past them). Called Amazon and quickly found out it was from my BFF. Phew. Crisis averted!",
        "created_utc": 1450632264,
        "upvote_ratio": ""
    },
    {
        "title": "Mystery scars and breaks",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/3xl4m2/mystery_scars_and_breaks/",
        "text": "[deleted]",
        "created_utc": 1450626435,
        "upvote_ratio": ""
    },
    {
        "title": "\"I may have made a mess but I am not a mess.\"",
        "author": "WiseEpicurus",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/3xjhug/i_may_have_made_a_mess_but_i_am_not_a_mess/",
        "text": "*This turned into a bit of a rant.*\n\nI'm so happy I found this quote/sentiment (it's from a child to her mother, apparently). It perfectly encapsulates how I feel my mother treated me and what I have internalized. \n\nMy mistakes meant I was a mistake, my problems happened because I was a problem. The thing is, I AM NOT A PROBLEM. I'm a human being, I make mistakes, and I have imperfections. I try to learn from and fix my mistakes, and embrace my imperfections. My imperfections don't have to be \"put up\" with, because that's what the right people will love about me.\n\nI was a fucking KID. Children need to learn and fail and grow and allowed to BE THEMSELVES, and they need a safe space to nurture that process. My mistakes are trivial compared to someone who profoundly failed to care for a child, and I have to live with and clean up your mistakes every day. ",
        "created_utc": 1450582977,
        "upvote_ratio": ""
    },
    {
        "title": "[progress] Threw away NMom's card without even opening it.",
        "author": "LionessSekhmet",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/3xjgyw/progress_threw_away_nmoms_card_without_even/",
        "text": "No regrets.  I'm not going to dance for her like she wants anymore.\n\nI asked her not to send me anything in the mail when I went NC, but we all know how \"good\" N's are at respecting boundaries.  I'll admit I'm a little bit curious about what she says inside... but not curious enough to actually break my own terms of NC and open it.  It's just not worth it.  \n\nBesides, I already know that it's one of two things.  Either it's a literal sermon, complete with Bible verses, about how horrible of a daughter I am and how God is angry at me and I deserve to be tortured forever blah de blah, or it's a generic religious Christmas card with no acknowledgement of my request for NC whatsoever.  Probably the second.  Even she must be starting to realize that I'm no longer responding to the sermons, so now she's testing me, trying to see what I'll do if she breaks NC.  Trying to get me to let her back into my head – fuck no.  Get thee into the recycling bin.\n\nI wonder if she'll ever learn that she can't fix this through manipulation?",
        "created_utc": 1450582493,
        "upvote_ratio": ""
    },
    {
        "title": "Gifts are all about them",
        "author": "oldestofNmom",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/3xi3ss/gifts_are_all_about_them/",
        "text": "I am an adult with adult kids, VLC with Nmom and getting to the point where I can laugh at the obvious N traits.\n\nAfter she tried to pull me into drama over presents, I suggested we not exchange any. This week, chocolates came in the mail for all of my FOC so, fine. I sent a short thank you email. Her response? \"You're welcome.  Makes my mouth water to think of them! :-)\"\n\nI know that this would be a perfectly acceptable email in normal families. But with my Nmom, it's just so predictable. She sent us chocolates that she likes.",
        "created_utc": 1450557546,
        "upvote_ratio": ""
    },
    {
        "title": "I just had a really hard day mentally and emotionally. Triggers inside",
        "author": "BakedBeauty",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/3xggpw/i_just_had_a_really_hard_day_mentally_and/",
        "text": "I woke up early in the day because I had a list of things in my head that I needed to do that are pretty important. I started feeling overwhelmed so I wrote this list down and started on the first chore. Well I knocked off 1 1/2 things before I just felt like I couldn't do anymore and I completely shut myself off. I have hypersomnia, but on top of that I tend to abuse sleep and use it as an escape. I did this today and I slept past my medication time and woke up feeling withdrawals. So I slept all through yesterday night, woke up at around 1030, went to fucking sleep at around 4 pm, woke up a few times but felt like shit so I went back to sleep, missed my meds and finally got up around 12 am. I use sleep and weed as an escape and now it's just not doing it for me anymore. I feel like instead of living, I am just suffering. I didn't even have to do anything physically or mentally challenging today guys. Just chores around the house and a couple phone calls. The past two years I've been taking care of myself but I still have times like these. I usually post here talking about this kind of stuff every once in a while, and I say that I hope it passes, and it usually does. It's in my heart to treat myself well and do all these things for myself but I'm having trouble grasping the fact that I can have a relationship with myself. I ignore the fuck out of myself sometimes, skipping meals and not drinking, not taking my meds on time, leaving dishes and trash piled up. \n\nMy bunny is nudging me for pets right now lol. I also had some pretty disturbing dreams but I guess that goes hand in hand with feeling like shit. I'm not happy with myself right now. When I am, it doesn't last that long. I just saw my therapist yesterday and actually talked about this with her. I told her I was scared I was going to fall back into this habit. I feel a little better just writing about it. I think Miss Potato missed me or knows I'm upset cuz she won't leave me alone lol!\n\nAnyways thanks for listening. I'm going to spend time with my animals now.",
        "created_utc": 1450525346,
        "upvote_ratio": ""
    }
]