[
    {
        "title": "Give your taxi driver a very specific route",
        "author": "enigmo",
        "url": "https://www.reddit.com/r/LifeProTips/comments/11a211n/give_your_taxi_driver_a_very_specific_route/",
        "text": "[removed]",
        "created_utc": 1677170139,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT Request: Need help with mental health",
        "author": "Alihaider17-PS4",
        "url": "https://www.reddit.com/r/LifeProTips/comments/11a1sww/lpt_request_need_help_with_mental_health/",
        "text": "[removed]",
        "created_utc": 1677169607,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT Request: What things should I look and listen for during a test drive of a used car?",
        "author": "_8bits1beard",
        "url": "https://www.reddit.com/r/LifeProTips/comments/11a1spo/lpt_request_what_things_should_i_look_and_listen/",
        "text": "Not a mechanic, can change my own oil, battery, or tire but that's about it.  I'm picking up a new car this weekend, what are some things I should look/listen for during my test drive?  I'm taking it to a mechanic Monday for an inspection but wanted to learn what are some things that might make me decide not to even leave the lot with it?",
        "created_utc": 1677169594,
        "upvote_ratio": 1.0
    },
    {
        "title": "When buying a used car, what are things I should look for during a test drive?",
        "author": "_8bits1beard",
        "url": "https://www.reddit.com/r/LifeProTips/comments/11a1oiz/when_buying_a_used_car_what_are_things_i_should/",
        "text": "[removed]",
        "created_utc": 1677169307,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT: To improve your cooking, heat your plates/bowls",
        "author": "Sirwired",
        "url": "https://www.reddit.com/r/LifeProTips/comments/11a18ns/lpt_to_improve_your_cooking_heat_your_platesbowls/",
        "text": "If you have a toaster oven or second oven (or even a dishwasher with heat dry), heat your plates or bowls before serving hot food, especially if your dishes are heat-sucking ceramic/stoneware.\n\nNothing makes good food ‘meh’ faster than scooping hot deliciousness on to a plate that will make it lukewarm in about two minutes. I stick mine in the toaster oven at 200 when I start to cook (150 if you have kids), and it’s made dinner so much more tasty, as the food stays hot throughout the meal.\n\nThis works even with the cheapest garage-sale toaster ovens that you'd never trust to cook actual food... no need for some fancy convection unit, or cavernous capacity; just needs to be large enough to hold the dishes for a typical meal.  (And of course a dishwasher can hold more than enough for many guests; if you don't have a way to skip straight to the dry cycle, run a rinse+dry cycle.  Naturally if you aren't using the oven to cook, you can fit all the dishes you need in there.)",
        "created_utc": 1677168240,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT Request— removing printed text off of nylon jacket?",
        "author": "off_my_ssris",
        "url": "https://www.reddit.com/r/LifeProTips/comments/11a13ky/lpt_request_removing_printed_text_off_of_nylon/",
        "text": "[removed]",
        "created_utc": 1677167907,
        "upvote_ratio": 1.0
    },
    {
        "title": "Winter weather driving advice: always carry a large bag of kitty litter, bag of rock salt and a small shovel in your vehicle. If you or the cars in front of you get stuck, the kitty litter and salt will give amazing traction, it’s relatively inexpensive and adds 50lb of weight to your vehicle.",
        "author": "Ok-Comparison3618",
        "url": "https://www.reddit.com/r/LifeProTips/comments/11a12st/winter_weather_driving_advice_always_carry_a/",
        "text": "[removed]",
        "created_utc": 1677167854,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT: Picking Limes",
        "author": "Bradkelly1",
        "url": "https://www.reddit.com/r/LifeProTips/comments/11a0iv7/lpt_picking_limes/",
        "text": "[removed]",
        "created_utc": 1677166444,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT: Keep track of your kudos/compliments at work",
        "author": "RedRick42",
        "url": "https://www.reddit.com/r/LifeProTips/comments/11a09g9/lpt_keep_track_of_your_kudoscompliments_at_work/",
        "text": "1. Set up a file in your e-mail called 'Kudos' or 'Compliments'\n2. Every time someone sends you a 'thank you' or 'well done!' on a task or project you did for them, file it in this folder.\n3. (optional) Download these and/or print them off. (see #3 below)\n\nHow can this help?  \n\n1. At many companies, especially large companies, each year you are asked to document your performance.  When doing so, you can use the exact quotes and names of individuals who have given you positive feedback over the past year.  This is highly impactful and helps you and your manager present concrete evidence of your contributions.  \n2. When you want to make a case for promotion or raise, you can use this data in a similar fashion.\n3. If you think your job may be in jeopardy (layoffs, etc), you have hard evidence to back up your argument. E.g., \"Here is what the VP of TPS Reporting said about me!\"\n\nI started doing this a couple of years ago, and not only did it make the dreaded \"Performance Review\" process much easier, it lead to positive impacts on annual salary increases.\n\nGood luck!  \nRick",
        "created_utc": 1677165779,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT: Lock out your knee to relieve hip/lower back tightness/pain. Lock out your elbow to relieve shoulder/neck tightness/pain.",
        "author": "StylezG_White",
        "url": "https://www.reddit.com/r/LifeProTips/comments/11a02u5/lpt_lock_out_your_knee_to_relieve_hiplower_back/",
        "text": "Your body is a kinetic chain, meaning, everything is more or less connected somehow. Every movement you make requires the effort of a combination of muscles. And often times, pain in one area is a result of tightness and/or weakness in a different (but related/connected) area.\n\nThe muscles around your joints are held in place by connective tissue (tendons) that is also attached to bones. Your muscles tell your bones what to do and where to go. You have to contract certain muscles in order to bend a joint. And since our bodies are designed to adapt to and memorize the movement patterns we engage in from day to day, the muscles around your joints will instinctively contract if you spend a lot of time with your joints bent.\n\nWe spend a lot of time sitting (which requires us to bend our hips and knees) and with our arms bent. When those muscles bunch up, they press on our connective tissues, as well as nerves. This bunching then pulls on other areas of our bodies. \n\nBent knees—&gt; bunched-up quads—&gt; tight hips\n\nBent hips—&gt; bunched-up hip flexors/weakened glutes—&gt; tight lower back \n\nBent wrists and elbows—&gt; bunched-up biceps—&gt; tight shoulders and neck\n\nA quick way to temporarily get rid of tightness and pain in the lower body is to straighten and lock out your knees. Bonus points for pointing your toes like a ballerina; this will give an extra stretch to the connective tissue that runs up your leg and connects to your hip socket/pelvis.\n\nLocking out your elbows will help with tightness and pain in your upper body. Bonus points for extending your wrists (show yourself the back of your hand), straightening your fingers, and flexing your armpit (this will help straighten your arm even more).\n\nLOCKING OUT YOUR JOINTS IS HEALTHY AND IS NOT DANGEROUS, as long as (a) you aren’t trying to support super-heavy weight without also engaging your muscles, (b) you aren’t doing dynamic or explosive movements on a locked joint, and (c) you aren’t using locked joints to absorb an impact (e.g., don’t jump and try to land with locked knees).\n\nIf you sit a lot, try to remind yourself to stand up, straighten the things you’ve been bending, and move around a little at least once an hour. This will give your muscles a small break from contracting and will allow your connective tissues to “breathe” a bit. It will also promote blood flow, which is a vital component of a healthy body.",
        "created_utc": 1677165301,
        "upvote_ratio": 1.0
    },
    {
        "title": "Lock out your knee to relieve hip/lower back tightness/pain. Lock out your elbow to relieve shoulder/neck tightness/pain.",
        "author": "StylezG_White",
        "url": "https://www.reddit.com/r/LifeProTips/comments/11a01ox/lock_out_your_knee_to_relieve_hiplower_back/",
        "text": "[removed]",
        "created_utc": 1677165219,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT: Use nail clippers upside down (the lever facing the ground) so the clippings don't go everywhere.",
        "author": "Luucccc",
        "url": "https://www.reddit.com/r/LifeProTips/comments/119zplk/lpt_use_nail_clippers_upside_down_the_lever/",
        "text": "Odd thing I tried today which really seemed to work, hopefully not just for me",
        "created_utc": 1677164396,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT Stuck on the phone with a robot? Pressing 0#0#0 usually gets you to a human",
        "author": "beezuzzles",
        "url": "https://www.reddit.com/r/LifeProTips/comments/119zd61/lpt_stuck_on_the_phone_with_a_robot_pressing_000/",
        "text": "Keep in mind, it’s usually someone who would transfer you elsewhere so they may not have your answer, but it’ll get you through some of the issues that come up with phone bots",
        "created_utc": 1677163481,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT: If someone asks you \"how is your son/daughter/baby/princess doing?\", respond with your child's first name, the person likely does not remember or know your child's name.",
        "author": "Any-Influence5873",
        "url": "https://www.reddit.com/r/LifeProTips/comments/119z7mz/lpt_if_someone_asks_you_how_is_your/",
        "text": "",
        "created_utc": 1677162984,
        "upvote_ratio": 1.0
    },
    {
        "title": "If someone asks you, \"how is your daughter/son/baby/princess doing?\" respond by saying \"Jack/Mary is good\"/. They likely don't remember their name.",
        "author": "Any-Influence5873",
        "url": "https://www.reddit.com/r/LifeProTips/comments/119z65c/if_someone_asks_you_how_is_your/",
        "text": "",
        "created_utc": 1677162875,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT survey pop money method 2023",
        "author": "rosst2007",
        "url": "https://www.reddit.com/r/LifeProTips/comments/119z0hx/lpt_survey_pop_money_method_2023/",
        "text": "[removed]",
        "created_utc": 1677162453,
        "upvote_ratio": 1.0
    },
    {
        "title": "Survey pop money method 2023",
        "author": "rosst2007",
        "url": "https://www.reddit.com/r/LifeProTips/comments/119yyku/survey_pop_money_method_2023/",
        "text": "[removed]",
        "created_utc": 1677162311,
        "upvote_ratio": 1.0
    },
    {
        "title": "If a salesperson selling you a good or service says something along the lines of, “I’ll give a special deal just for you”, it’s probably safe to assume the deal won’t be special or unique to you.",
        "author": "ImOnTheSpectrum",
        "url": "https://www.reddit.com/r/LifeProTips/comments/119xpyv/if_a_salesperson_selling_you_a_good_or_service/",
        "text": "",
        "created_utc": 1677158943,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT: You are entitled to a copy of your consumer report from multiple entities that track your credit report, employment history, rental history, RX history, social media history and more per the CFPB",
        "author": "geminigold",
        "url": "https://www.reddit.com/r/LifeProTips/comments/119xjd8/lpt_you_are_entitled_to_a_copy_of_your_consumer/",
        "text": "The Consumer Financial Protection Bureau has a list of the companies that collect your data and you are entitled to one report per 12 months by law. \n\nExamples are your credit report, background checks ran by employers and landlords, your employment history (with &amp; without income figures), your driving record, your filled RX history, your social media history and much more. You must request a copy of your report through each individual company. You can also dispute information reported and freeze the report if you wish once you have reviewed it. \n\nFor a list of the companies and a breakdown of the report data included in each, google CFPB List of Consumer Reporting Companies.",
        "created_utc": 1677158419,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT: Get the brave browser if you want to listen to music on YouTube with your screen turned off without having the subscription. Simply get brave, click the ... , go to Settings and enable background music. Now you switch over to other apps or even turn off your screen. iOS/Android",
        "author": "Long8D",
        "url": "https://www.reddit.com/r/LifeProTips/comments/119x3eg/lpt_get_the_brave_browser_if_you_want_to_listen/",
        "text": "",
        "created_utc": 1677157130,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT Request: Good to skill to learn for a better paying job while currently at a boring job?",
        "author": "PhoenixMain1",
        "url": "https://www.reddit.com/r/LifeProTips/comments/119wpdh/lpt_request_good_to_skill_to_learn_for_a_better/",
        "text": "[removed]",
        "created_utc": 1677155888,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT: Stockpile greetings cards. Never arrive empty handed at a birthday party, etc.",
        "author": "benjiyon",
        "url": "https://www.reddit.com/r/LifeProTips/comments/119vjps/lpt_stockpile_greetings_cards_never_arrive_empty/",
        "text": "[removed]",
        "created_utc": 1677152031,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT: Stockpile greetings cards. Never arrive empty handed at a birthday party, etc.",
        "author": "benjiyon",
        "url": "https://www.reddit.com/r/LifeProTips/comments/119v977/lpt_stockpile_greetings_cards_never_arrive_empty/",
        "text": "[removed]",
        "created_utc": 1677150988,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT Request: My 8 y/o brother just dropped the f bomb. should I tell our parents?",
        "author": "mercurysnowman",
        "url": "https://www.reddit.com/r/LifeProTips/comments/119upr9/lpt_request_my_8_yo_brother_just_dropped_the_f/",
        "text": "[removed]",
        "created_utc": 1677148985,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT: Once you stop trying to prove points, your life will be much more peaceful. Let people say and think what they want. It has nothing to do with you.\"",
        "author": "tradenjoin",
        "url": "https://www.reddit.com/r/LifeProTips/comments/119u2tq/lpt_once_you_stop_trying_to_prove_points_your/",
        "text": "",
        "created_utc": 1677146528,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT Request - Work in lawn care, and landscaping. Anyone help me with good bulking foods?",
        "author": "Jtthebest1",
        "url": "https://www.reddit.com/r/LifeProTips/comments/119tzg5/lpt_request_work_in_lawn_care_and_landscaping/",
        "text": "Been working this new job for a month, eating really healthy but it's kind of expensive. What's some meals or lunches you like to make to boost up the calorie count or for recovery? Thanks!",
        "created_utc": 1677146172,
        "upvote_ratio": 1.0
    },
    {
        "title": "if you're ever smoking *anything* avoid talking while exhaling. it's much harder on the lungs.",
        "author": "evansquak",
        "url": "https://www.reddit.com/r/LifeProTips/comments/119sr57/if_youre_ever_smoking_anything_avoid_talking/",
        "text": "",
        "created_utc": 1677141362,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT If someone comes to you to talk ask them if they just want to vent, want advise, or want you to get involved. Doesn’t matter the age- works amazing with children and adults alike.",
        "author": "ThoseTwo203",
        "url": "https://www.reddit.com/r/LifeProTips/comments/119sk1o/lpt_if_someone_comes_to_you_to_talk_ask_them_if/",
        "text": "",
        "created_utc": 1677140588,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT: If you can't handle breaking up with someone because you don't want to hurt them, play the long game by acting unattractive and needy til they lose interest and leave you instead",
        "author": "InquiryOrEnquiry",
        "url": "https://www.reddit.com/r/LifeProTips/comments/119s3sk/lpt_if_you_cant_handle_breaking_up_with_someone/",
        "text": "",
        "created_utc": 1677138890,
        "upvote_ratio": 1.0
    },
    {
        "title": "If you can't handle breaking up with someone because you don't want to hurt them, play the long game by acting really unattractive and needy til they lose interest in you and leave you",
        "author": "InquiryOrEnquiry",
        "url": "https://www.reddit.com/r/LifeProTips/comments/119s20t/if_you_cant_handle_breaking_up_with_someone/",
        "text": "",
        "created_utc": 1677138701,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT: If you're into gardening and growing your own food, you might want to check out companion planting. It's a technique where you plant different types of plants together to help each other out.. like planting garlic next to your roses can keep aphids away.",
        "author": "MaleficentTop6074",
        "url": "https://www.reddit.com/r/LifeProTips/comments/119rlyf/lpt_if_youre_into_gardening_and_growing_your_own/",
        "text": "Companion planting can help control pests naturally without using pesticides, it can improve soil fertility and you can get a better harvest and it's a cost-effective way to naturally imrove your garden's health. Some more examples includes - planting tomato and basil next to each other can improve the flavour and health of your tomato plants. Basil also helps keep the pests away. Planting chives and carrots next to each other will have the same effect.",
        "created_utc": 1677137014,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT: POA(Power of Attorney) ends at death (this might be specific to USA)",
        "author": "cametta",
        "url": "https://www.reddit.com/r/LifeProTips/comments/119reks/lpt_poapower_of_attorney_ends_at_death_this_might/",
        "text": "So make sure you have any funeral/after death arrangements taken care of, especially signing cremation authorizations. After death, unless specified, POA is over and everything reverts to next of kin. (If it’s children, everyone has to agree and sign.) only wills, trusts, and previously signed documents still stand.",
        "created_utc": 1677136274,
        "upvote_ratio": 1.0
    },
    {
        "title": "POA (Power of Attorney) ends at death.",
        "author": "cametta",
        "url": "https://www.reddit.com/r/LifeProTips/comments/119r9mr/poa_power_of_attorney_ends_at_death/",
        "text": "[removed]",
        "created_utc": 1677135790,
        "upvote_ratio": 1.0
    },
    {
        "title": "If you get in a car crash with your kids in the car, cover new carseats in the settlement",
        "author": "Wildmancharacter",
        "url": "https://www.reddit.com/r/LifeProTips/comments/119qlfo/if_you_get_in_a_car_crash_with_your_kids_in_the/",
        "text": "",
        "created_utc": 1677133463,
        "upvote_ratio": 1.0
    },
    {
        "title": "Lpt Spoil your dog while you can, let them know that you appreciate them. Give them the good treats, tell them that they are good pups.",
        "author": "loveandwood",
        "url": "https://www.reddit.com/r/LifeProTips/comments/119q4uv/lpt_spoil_your_dog_while_you_can_let_them_know/",
        "text": "Bring them to the places they like to sniff. Sit with them and appreciate your surroundings. Because those are the memories you will hold onto. Engrave those into your memories. There won’t always be time.",
        "created_utc": 1677131961,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT Request: How do I maximize happiness and opportunity while traveling for work?",
        "author": "sweettoothj",
        "url": "https://www.reddit.com/r/LifeProTips/comments/119q11s/lpt_request_how_do_i_maximize_happiness_and/",
        "text": "I work for 3 weeks at a time. I travel most of the Midwest region and every now and then have a day or 2 off within my 3 week schedule. We are compensated fairly. I spend a lot of my free time doing useless things like playing video games and watching/listening to youtube + podcasts while I can.\n\n&amp;#x200B;\n\nHow can I better spend my time to be more productive, and embolden my future?\n\n&amp;#x200B;\n\nI already tried the college route for half a year. I work too many unpredictable hours for that. I really cant work towards a degree with my current role",
        "created_utc": 1677131606,
        "upvote_ratio": 1.0
    },
    {
        "title": "Spoil your dog while you can. Give them the good treats, tell them they are good pups",
        "author": "loveandwood",
        "url": "https://www.reddit.com/r/LifeProTips/comments/119pymx/spoil_your_dog_while_you_can_give_them_the_good/",
        "text": "[removed]",
        "created_utc": 1677131385,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT request. Where can I find listings of the absolute cheapest housing?",
        "author": "herenti",
        "url": "https://www.reddit.com/r/LifeProTips/comments/119py93/lpt_request_where_can_i_find_listings_of_the/",
        "text": "[removed]",
        "created_utc": 1677131347,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT: When debating or arguing with someone and it’s going nowhere, ask them, “What evidence would it take for you to consider that you’re wrong?” If they say “Nothing,” then it’s time to end the conversation.",
        "author": "blowfishmo",
        "url": "https://www.reddit.com/r/LifeProTips/comments/119pkiz/lpt_when_debating_or_arguing_with_someone_and_its/",
        "text": "",
        "created_utc": 1677130127,
        "upvote_ratio": 1.0
    },
    {
        "title": "Instacart Shopper Referral Code WINGFD7786",
        "author": "Strange-Reading-7416",
        "url": "https://www.reddit.com/r/LifeProTips/comments/119pjbr/instacart_shopper_referral_code_wingfd7786/",
        "text": "",
        "created_utc": 1677130018,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT: If you like the toiletries from a hotel you’re staying in, (e.g., shampoo, conditioner, body wash) call the front desk and ask if they can send some up for you to take home.",
        "author": "nativesf",
        "url": "https://www.reddit.com/r/LifeProTips/comments/119pfc2/lpt_if_you_like_the_toiletries_from_a_hotel_youre/",
        "text": "Most hotels want feedback on their toiletries and usually expect you to take home what they put out already.\n\nBy asking for more to take home and telling them you enjoy them, they’re getting positive feedback and creating a return customer.",
        "created_utc": 1677129645,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT: If you’re having an allergic reaction, open the Benadryl and chew two in the otc aisle, then pay for the package you opened. Minutes matter. Don’t waste time waiting in line.",
        "author": "Sethrial",
        "url": "https://www.reddit.com/r/LifeProTips/comments/119pcye/lpt_if_youre_having_an_allergic_reaction_open_the/",
        "text": "",
        "created_utc": 1677129435,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT Request: {25M} Hello everyone, I have created this account right now to post this since i dont want to do it on my main. I am not the type to write my feelings or speak what am usually feeling and keep it inside me. It is affecting me alot and I dont know what to do...",
        "author": "DancingPengu1n",
        "url": "https://www.reddit.com/r/LifeProTips/comments/119p5z4/lpt_request_25m_hello_everyone_i_have_created/",
        "text": "[removed]",
        "created_utc": 1677128818,
        "upvote_ratio": 1.0
    },
    {
        "title": "{25M} Hello everyone, I created this account right now to post this, i didnt want someone to see it on my main account. I am not the type to write my feelings or speak what am usually feeling and keep it inside me. It is affecting me alot and I dont know what to do...",
        "author": "DancingPengu1n",
        "url": "https://www.reddit.com/r/LifeProTips/comments/119p4mx/25m_hello_everyone_i_created_this_account_right/",
        "text": "[removed]",
        "created_utc": 1677128708,
        "upvote_ratio": 1.0
    },
    {
        "title": "https://moneyeasily-elt.top/61136573169403",
        "author": "johnhoncho",
        "url": "https://www.reddit.com/r/LifeProTips/comments/119ov7i/httpsmoneyeasilyelttop61136573169403/",
        "text": "[removed]",
        "created_utc": 1677127928,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT: The best way to kill the lifeforce-destroying taste of cough syrup is to down a mouthful of liquid honey right after you take it.",
        "author": "sixup604",
        "url": "https://www.reddit.com/r/LifeProTips/comments/119osmw/lpt_the_best_way_to_kill_the_lifeforcedestroying/",
        "text": "",
        "created_utc": 1677127719,
        "upvote_ratio": 1.0
    },
    {
        "title": "The only way to kill the lifeforce-destroying taste of cough syrup is to down a mouthful of liquid honey right after you take it.",
        "author": "sixup604",
        "url": "https://www.reddit.com/r/LifeProTips/comments/119oroq/the_only_way_to_kill_the_lifeforcedestroying/",
        "text": "",
        "created_utc": 1677127634,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT: Odds are you won't be the first person in your circle of friends to lose a parent to old age, but when you hear of the first one to go, heed the warning and make sure you're maximizing the time with those you love, because it's likely the bulk of the time you'll have with them is behind you.",
        "author": "JD2005",
        "url": "https://www.reddit.com/r/LifeProTips/comments/119omxt/lpt_odds_are_you_wont_be_the_first_person_in_your/",
        "text": "First of my circle of friend's father just passed away, gave me a real gut punch reality check about the time I likely have left with my own Dad...  If you're in your late 30s/early 40s or older, this post is for you.",
        "created_utc": 1677127227,
        "upvote_ratio": 1.0
    },
    {
        "title": "If you are about to have work done on your home (i.e. windows) and you can’t move certain items, cover them to prevent them from getting damaged.",
        "author": "Kmealtltyhew",
        "url": "https://www.reddit.com/r/LifeProTips/comments/119olxw/if_you_are_about_to_have_work_done_on_your_home/",
        "text": "[removed]",
        "created_utc": 1677127141,
        "upvote_ratio": 1.0
    },
    {
        "title": "[💥Month Ends Super Sales💥] Buy Microsoft Windows 11 Pro license. Only $27.99 Get Up To 70% Off (Use Coupon Code: MO30KEYS)",
        "author": "AdalynnNZ",
        "url": "https://www.reddit.com/r/LifeProTips/comments/119oa1q/month_ends_super_sales_buy_microsoft_windows_11/",
        "text": "[removed]",
        "created_utc": 1677126140,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT: Driveway Chrome Extension",
        "author": "Downtown-Repair-805",
        "url": "https://www.reddit.com/r/LifeProTips/comments/119npes/lpt_driveway_chrome_extension/",
        "text": "It creates detailed step-by-step guides without any extra time. Super easy to download and utilize. The paltform will even do screen grabs while you work regularly. It requires no extra work on your end.",
        "created_utc": 1677124480,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT Go to Go bag tips",
        "author": "FunnyTop8478",
        "url": "https://www.reddit.com/r/LifeProTips/comments/119n4qb/lpt_go_to_go_bag_tips/",
        "text": "LPT \n\nBuilding a comprehensive bug-out bag or go bag is a complex process that requires careful consideration of your individual needs, the potential emergency situations you may face, and the environment in which you will be using the bag. That being said, here are 20 items that are commonly included in bug-out bags or go bags, with brand names\n\nBackpack - Osprey Atmos or Aether, Deuter ACT Trail, Gregory Baltoro or Zulu\n\nWater Filtration System - Sawyer Mini or Squeeze, LifeStraw, Katadyn BeFree\n\nFirst Aid Kit - Adventure Medical Kits, VooDoo Tactical, North American Rescue\n\nFire Starter - Exotac TitanLIGHT, Zippo lighter, UCO Stormproof matches\n\nKnife - Morakniv Companion, Benchmade Griptilian, Gerber StrongArm\n\nMulti-Tool - Leatherman Wave, Victorinox Swiss Army Knife, SOG PowerAssist\n\nFood - Mountain House freeze-dried meals, Clif Bars, KIND Bars\n\nWater Bottle - Nalgene, Hydro Flask, CamelBak Chute\n\nShelter - SOL Emergency Bivvy, MSR Hubba NX tent, Tarp with paracord\n\nClothing - Merino wool base layers, synthetic or down puffy jacket, rain jacket\n\nMaps and Compass - Suunto MC-2G Global, Silva Ranger, Brunton TruArc\n\nHeadlamp - Black Diamond Spot, Petzl Tikka, Fenix HL60R\n\nSunglasses - Oakley Flak 2.0, Ray-Ban Wayfarer, Costa Del Mar Fantail\n\nCommunication - Baofeng UV-5R two-way radio, Garmin inReach, Motorola T600 H2O Talkabout\n\nHygiene Kit - Sea to Summit Pocket Towel, wet wipes, hand sanitizer\n\nCash and Identification - Cash, passport, driver's license, credit cards\n\nParacord - Rothco 550 Paracord, Titan Type III, Atwood Rope MFG Micro Cord\n\nPower Bank - Anker PowerCore, Goal Zero Venture, BioLite SolarHome\n\nDuct Tape - Gorilla Tape, 3M Scotch Tape, Duck Tape\n\nWhistle - Fox 40 Classic, Acme Thunderer, SOL Rescue Howler\n\nIt's important to note that this is not a list of specific items you must include in your bug-out bag its a guide. \"goes\" into your bag will depend on your individual needs and the potential emergency situations you may face. I live in the Northeast so my bag would likely be wildly different from someone living in Phoenix Arizona. Additionally, it's important to regularly review and update the contents of your bag to ensure that they are up-to-date and meet your current needs.",
        "created_utc": 1677122828,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT: People in their 20s or just young adults what are some helpful legal knowledge do we need to know?",
        "author": "Jpoolman25",
        "url": "https://www.reddit.com/r/LifeProTips/comments/119n1rl/lpt_people_in_their_20s_or_just_young_adults_what/",
        "text": "just wanted to ask like I’m 26 now and I just want to be more aware in society like I want to have that confidence knowing what are my rights and what are some things to be aware of. Like renting first time apartment to knowing what to do during a car accident. I just wanted to get some insight.",
        "created_utc": 1677122589,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT: Before pouring soda into a glass, fill and empty the glass with water. The wetness on the sides of the glass will prevent it from fizzing and wasting a ton of CO2.",
        "author": "blandge",
        "url": "https://www.reddit.com/r/LifeProTips/comments/119mrnz/lpt_before_pouring_soda_into_a_glass_fill_and/",
        "text": "",
        "created_utc": 1677121830,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT: If you think your hobbies don't seem interesting to others, be more specific about them.",
        "author": "HappyAkratic",
        "url": "https://www.reddit.com/r/LifeProTips/comments/119moz1/lpt_if_you_think_your_hobbies_dont_seem/",
        "text": "I see some people worried about giving boring answers to \"What do you do for fun?\", when they spend their time reading, or playing video games, or hanging out with friends. Counter-intuitively, the best thing to do is to go into more detail! Which is more interesting?\n\n\"I like to read.\"\n\n\"I'm reading this sci-fi book about historians who go time-travelling for research and get stuck in the past. It's really cool to see a different take on how time travel could be used, and there's a bunch of historical information too.\"\n\n\"I play video games.\"\n\n\"I'm playing this game where you have to figure out how a bunch of people died on a ship. It's great— you really have to think and use intuition.\"\n\nThis continues the conversation rather than shutting it down, makes you seem more passionate and fun, and might even get other people interested in your hobby! People want to know what you like, not just the basics of what you do.",
        "created_utc": 1677121634,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT: If you avoid the dentist out of anxiety, call in advance and ask them to make nitrous available. It may cost you $80 to $100 USD extra, but worth it to get needed work done.",
        "author": "Wenger2112",
        "url": "https://www.reddit.com/r/LifeProTips/comments/119mhd3/lpt_if_you_avoid_the_dentist_out_of_anxiety_call/",
        "text": "",
        "created_utc": 1677121079,
        "upvote_ratio": 1.0
    },
    {
        "title": "Please help! Salary Negotiation Tips",
        "author": "mannersmakemen",
        "url": "https://www.reddit.com/r/LifeProTips/comments/119m6fu/please_help_salary_negotiation_tips/",
        "text": "[removed]",
        "created_utc": 1677120263,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT: When getting important information over the phone (or in person) nicely ask the person his/her name…",
        "author": "subiegal2013",
        "url": "https://www.reddit.com/r/LifeProTips/comments/119m5qj/lpt_when_getting_important_information_over_the/",
        "text": "Write it down with the date you spoke to them and what they told you so that if circumstances change, you can say you spoke to this person on this date and they told you whatever it was. This can be applied to your cell phone bill, health insurance, anything.",
        "created_utc": 1677120209,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT: If you are in the US and ever worked salary, and your pay was deducted on a daily basis ( you take a day off and get paid less), The Supreme Court just decided you are entitled to previous overtime pay and NOT an exempt salaried employee.",
        "author": "Brilliant_Agent_1427",
        "url": "https://www.reddit.com/r/LifeProTips/comments/119lf5u/lpt_if_you_are_in_the_us_and_ever_worked_salary/",
        "text": "",
        "created_utc": 1677118270,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT: If you have a car rear-view camera, you can also use it when parking normally to check if you're between the lines",
        "author": "empwnleon",
        "url": "https://www.reddit.com/r/LifeProTips/comments/119l9vo/lpt_if_you_have_a_car_rearview_camera_you_can/",
        "text": "I also use it to check if I'm parked in far enough or too far in",
        "created_utc": 1677117874,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT - Never completely empty your gas/diesel jug until you’re actually heading out to refill it",
        "author": "trailing-edge",
        "url": "https://www.reddit.com/r/LifeProTips/comments/119l6id/lpt_never_completely_empty_your_gasdiesel_jug/",
        "text": "Leave some in there as an emergency reserve in case you run your mower/atv/snowblower/whatever out of fuel.  That way at least you can get it back home safe…before you head out to fill the can again.",
        "created_utc": 1677117640,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT: Before pouring beer into a glass, rinse the inside of the glass and don't dry it.",
        "author": "bugsontheside",
        "url": "https://www.reddit.com/r/LifeProTips/comments/119l274/lpt_before_pouring_beer_into_a_glass_rinse_the/",
        "text": "The moisture on the inside of the glass keeps the beer from foaming up as it minimizes friction from carbonation against the dry surface.",
        "created_utc": 1677117323,
        "upvote_ratio": 1.0
    },
    {
        "title": "Don’t empty the gas/diesel can until you’re actually heading out to refill it",
        "author": "trailing-edge",
        "url": "https://www.reddit.com/r/LifeProTips/comments/119l1ew/dont_empty_the_gasdiesel_can_until_youre_actually/",
        "text": "[removed]",
        "created_utc": 1677117263,
        "upvote_ratio": 1.0
    },
    {
        "title": "restaurants that only use cheap ingredients will also use pepsi instead of coke and refuse American Express",
        "author": "oboshoe",
        "url": "https://www.reddit.com/r/LifeProTips/comments/119kzai/restaurants_that_only_use_cheap_ingredients_will/",
        "text": "[removed]",
        "created_utc": 1677117107,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT: Check in with your significant other’s if they seem to stop doing household chores",
        "author": "Smoky-Abyss",
        "url": "https://www.reddit.com/r/LifeProTips/comments/119kmzw/lpt_check_in_with_your_significant_others_if_they/",
        "text": "They might just be depressed, but I’ve learned from two long term relationships now that it can also mean they’re checking out of the relationship and getting ready to break up",
        "created_utc": 1677116205,
        "upvote_ratio": 1.0
    },
    {
        "title": "Accessing paywall-protected news",
        "author": "Ant-Tea-Social",
        "url": "https://www.reddit.com/r/LifeProTips/comments/119ke1n/accessing_paywallprotected_news/",
        "text": "[removed]",
        "created_utc": 1677115552,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT Request: Is work-life balance a luxury in the current economy?",
        "author": "lanadelreysoul",
        "url": "https://www.reddit.com/r/LifeProTips/comments/119kaum/lpt_request_is_worklife_balance_a_luxury_in_the/",
        "text": "",
        "created_utc": 1677115317,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT: Use the Sort By Highest Price When Shopping",
        "author": "shredu2",
        "url": "https://www.reddit.com/r/LifeProTips/comments/119k8zb/lpt_use_the_sort_by_highest_price_when_shopping/",
        "text": "Why? You can compare the most expensive products ( ie Top 10) to learn what the best product provides. This works great when shopping for other peoples hobbies.",
        "created_utc": 1677115190,
        "upvote_ratio": 1.0
    },
    {
        "title": "If you're having trouble falling asleep at night, turn down your bedroom's radiator or open a window.",
        "author": "F0lks_",
        "url": "https://www.reddit.com/r/LifeProTips/comments/119jp3d/if_youre_having_trouble_falling_asleep_at_night/",
        "text": "",
        "created_utc": 1677113790,
        "upvote_ratio": 1.0
    },
    {
        "title": "Get $100 on FanDuel Sportsbook in Bonus Bets! Terms apply. Make sure to use my invite link! https://fndl.co/snya15y",
        "author": "bobby225225",
        "url": "https://www.reddit.com/r/LifeProTips/comments/119jea5/get_100_on_fanduel_sportsbook_in_bonus_bets_terms/",
        "text": "",
        "created_utc": 1677113018,
        "upvote_ratio": 1.0
    },
    {
        "title": "existential life less",
        "author": "Particular_Usual8066",
        "url": "https://www.reddit.com/r/LifeProTips/comments/119jb3x/existential_life_less/",
        "text": "",
        "created_utc": 1677112791,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT: If you can't remember and it's giving you anxiety, say, \"I'm so sorry, I'm blanking on XYZ and it's giving me anxiety.\"",
        "author": "AmeriArcana",
        "url": "https://www.reddit.com/r/LifeProTips/comments/119jaw3/lpt_if_you_cant_remember_and_its_giving_you/",
        "text": "If you can't remember something and you're worried someone is going to call you out, let them know you're blanking and it's giving you anxiety.\n\nMost people will commiserate and take a little extra to catch you up.",
        "created_utc": 1677112774,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT request: How can I let go of intense anger towards a random person over something that happened years ago?",
        "author": "zmxncb455",
        "url": "https://www.reddit.com/r/LifeProTips/comments/119j1v0/lpt_request_how_can_i_let_go_of_intense_anger/",
        "text": "About 7 years ago at a music festival I was walking back to our campsite alone when this guy sitting at his campsite a little distance away started taunting me. \n\nI can’t remember what he said but I remember it being derogatory, and at first I pretended not to hear and just kept walking, but then he said “I know you can hear me” in this jeering voice and I snapped and yelled “f*ck you” and gave him the finger, to which he laughed and said “you wish”. That was the most infuriating part. \n\nI kept walking back to our campsite and tried to forget about it, but he kinda ruined the festival for me.\n\nI know it’s not a big deal, but every now and then I remember about it and feel this intense rage and hatred towards him, and I feel so angry and helpless about it.\n\nAny tips to get over this?",
        "created_utc": 1677112138,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT - Stop Carrying Credit Cards",
        "author": "049at",
        "url": "https://www.reddit.com/r/LifeProTips/comments/119j0xb/lpt_stop_carrying_credit_cards/",
        "text": "I found that my spending on fast food (and my weight) was getting out of control. So I simply stopped carrying credit cards in my wallet and switched to Apple Pay. Now I don’t fall into the habit of going to drive thrus for breakfast/lunch and my spending is down as well.",
        "created_utc": 1677112071,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT: Pets are not gifts.",
        "author": "TheGeckomancer",
        "url": "https://www.reddit.com/r/LifeProTips/comments/119iwy6/lpt_pets_are_not_gifts/",
        "text": " I feel like the title is self explanatory.\n\nA pet is a responsibility that comes with costs, such as a vet bill.\n\nNo harm is done if the handcrafted shot glass just sits on a shelf.\n\nAn animal going to a home unequipped to care for that animal causes harm all around.",
        "created_utc": 1677111787,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT Navigate the tricky age question",
        "author": "Sad_Ad_8006",
        "url": "https://www.reddit.com/r/LifeProTips/comments/119iwk7/lpt_navigate_the_tricky_age_question/",
        "text": "\n\nWhen someone asks you to guess their age, don't try to be accurate. Give them a figure atleast 8-10 years younger thank you actually think they are, they will be happy and tell you their right age instead of hurting them by guessing a number that might be way above their actual age",
        "created_utc": 1677111761,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT REQUEST: How to stop being so nervous? it will ruin me",
        "author": "SharpOpportunity4u",
        "url": "https://www.reddit.com/r/LifeProTips/comments/119isro/lpt_request_how_to_stop_being_so_nervous_it_will/",
        "text": "I have a driving test REALLY soon and I think I'm going to fail because of my nerves. \n\nBeing nervous will distract me and I will definitely make a serious or a dangerous fault. It feels like I just don't even want to go anymore. Don't know what I can think of in that moment in order to calm myself down. \n\nEven writing this now..make me wants to vomit.",
        "created_utc": 1677111493,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT: If you're making a sandwich for your kids and only have the heel of the bread left, put the heels inside. The kids probably won't notice",
        "author": "motoperpetuoso",
        "url": "https://www.reddit.com/r/LifeProTips/comments/119ik7y/lpt_if_youre_making_a_sandwich_for_your_kids_and/",
        "text": "",
        "created_utc": 1677110910,
        "upvote_ratio": 1.0
    },
    {
        "title": "ZkSync New NEW ERA Tokens airdrop! Reward 22.02.2023",
        "author": "Due_Cartographer1672",
        "url": "https://www.reddit.com/r/LifeProTips/comments/119hrbb/zksync_new_new_era_tokens_airdrop_reward_22022023/",
        "text": "[removed]",
        "created_utc": 1677108909,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT request - techniques for teaching a practical skill in a 1-1 setting, someone you don’t know.",
        "author": "quipp68",
        "url": "https://www.reddit.com/r/LifeProTips/comments/119h99z/lpt_request_techniques_for_teaching_a_practical/",
        "text": "I am currently teaching a craft that I’ve been doing my entire career so I know a decent amount about it. I’m not as natural with teaching. Any tips or things that worked when you were the student?",
        "created_utc": 1677107741,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT request - techniques for teaching a practical skill in a 1-1 setting, someone you don’t know.",
        "author": "quipp68",
        "url": "https://www.reddit.com/r/LifeProTips/comments/119h7l4/lpt_request_techniques_for_teaching_a_practical/",
        "text": "I am currently teaching a craft that I’ve been doing my entire career so I know a decent amount about it. I’m not as natural with teaching. Any tips or things that worked when you were the student?",
        "created_utc": 1677107632,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT: Be aware of how your partner treats their parents, siblings and friends; if they are rude, unkind or harsh with them there is a good chance they will eventually be the same to you.",
        "author": "Apendica",
        "url": "https://www.reddit.com/r/LifeProTips/comments/119h472/lpt_be_aware_of_how_your_partner_treats_their/",
        "text": "",
        "created_utc": 1677107412,
        "upvote_ratio": 1.0
    },
    {
        "title": "Tires that come with new cars should be replaced",
        "author": "Teslaqueen",
        "url": "https://www.reddit.com/r/LifeProTips/comments/119glqy/tires_that_come_with_new_cars_should_be_replaced/",
        "text": "[removed]",
        "created_utc": 1677106251,
        "upvote_ratio": 1.0
    },
    {
        "title": "Check those tires that came with your new car",
        "author": "Teslaqueen",
        "url": "https://www.reddit.com/r/LifeProTips/comments/119g70c/check_those_tires_that_came_with_your_new_car/",
        "text": "[removed]",
        "created_utc": 1677105344,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT: If you're having a particularly messy wipe after pooping, spit on the toilet paper before you wipe. It'll act more like a wet wipe, clean better, and reduce friction on your bunghole.",
        "author": "OneLargeMulligatawny",
        "url": "https://www.reddit.com/r/LifeProTips/comments/119g535/lpt_if_youre_having_a_particularly_messy_wipe/",
        "text": "",
        "created_utc": 1677105222,
        "upvote_ratio": 1.0
    },
    {
        "title": "A New Car Could KIll you!",
        "author": "Teslaqueen",
        "url": "https://www.reddit.com/r/LifeProTips/comments/119g3o6/a_new_car_could_kill_you/",
        "text": "[removed]",
        "created_utc": 1677105132,
        "upvote_ratio": 1.0
    },
    {
        "title": "If you’re having a particularly messy wipe after pooping, spit on the toilet paper before you wipe. It’ll act more like a wet wipe, clean better, and reduce friction on your bunghole.",
        "author": "OneLargeMulligatawny",
        "url": "https://www.reddit.com/r/LifeProTips/comments/119g04u/if_youre_having_a_particularly_messy_wipe_after/",
        "text": "[removed]",
        "created_utc": 1677104918,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT: Use Spotify’s “Friend Activity” feature to know how your SO is feeling",
        "author": "NoPantsGonnaSmash",
        "url": "https://www.reddit.com/r/LifeProTips/comments/119fzql/lpt_use_spotifys_friend_activity_feature_to_know/",
        "text": "This will make it easy to understand your SO feeling that day. If it’s emotional sad songs then you can make it better by doing something good to cheer them up etc",
        "created_utc": 1677104893,
        "upvote_ratio": 1.0
    },
    {
        "title": "Use Spotify’s Friends Activity feature to know how your SO is feeling",
        "author": "NoPantsGonnaSmash",
        "url": "https://www.reddit.com/r/LifeProTips/comments/119fxqr/use_spotifys_friends_activity_feature_to_know_how/",
        "text": "[removed]",
        "created_utc": 1677104765,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT Request: How to workout, and focus on mental health while studying for exams.",
        "author": "legendxtas",
        "url": "https://www.reddit.com/r/LifeProTips/comments/119faji/lpt_request_how_to_workout_and_focus_on_mental/",
        "text": "I'm currently studying for exams, and 3 months ago i had been signed up for amateur boxing, but soon left due to 5 days a week of training, meaning I would have no time for studying, so I decided to choose studying instead, how do I implement working out in my life?",
        "created_utc": 1677103444,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is the most valuable lesson you've learned in your life so far?",
        "author": "Admirable_keith",
        "url": "https://www.reddit.com/r/LifeProTips/comments/119f08e/what_is_the_most_valuable_lesson_youve_learned_in/",
        "text": "",
        "created_utc": 1677102899,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is the most valuable lesson you've learned in your life so far?",
        "author": "Admirable_keith",
        "url": "https://www.reddit.com/r/LifeProTips/comments/119ezl4/what_is_the_most_valuable_lesson_youve_learned_in/",
        "text": "",
        "created_utc": 1677102866,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT Request: Moving out at 18. Any tips?",
        "author": "Glowzyyy",
        "url": "https://www.reddit.com/r/LifeProTips/comments/119ez8u/lpt_request_moving_out_at_18_any_tips/",
        "text": "i am currently a senior in high school, planning to move out as soon as it's feasible. what are some things you wish you would have known before moving out? how can i make this more of a reality rather than a dream?",
        "created_utc": 1677102847,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT: Buy an irrigator for your teeth - it’s a game changer for bad breath",
        "author": "PapaMamaGoldilocks",
        "url": "https://www.reddit.com/r/LifeProTips/comments/119eun3/lpt_buy_an_irrigator_for_your_teeth_its_a_game/",
        "text": "[removed]",
        "created_utc": 1677102616,
        "upvote_ratio": 1.0
    },
    {
        "title": "lpt if you or someone you love has a high pain tolerance and they have a body pain in the same area longer than normal send them to get it checked out it may prevent intolerable pain later",
        "author": "etjasinski",
        "url": "https://www.reddit.com/r/LifeProTips/comments/119eekg/lpt_if_you_or_someone_you_love_has_a_high_pain/",
        "text": "",
        "created_utc": 1677101864,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT: Chinese Restaurants have the best chicken nuggets.",
        "author": "EnricoTortellini",
        "url": "https://www.reddit.com/r/LifeProTips/comments/119dzu9/lpt_chinese_restaurants_have_the_best_chicken/",
        "text": "",
        "created_utc": 1677101224,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT Request - How to work with elderly people over the phone?",
        "author": "Idontlikecottoncandy",
        "url": "https://www.reddit.com/r/LifeProTips/comments/119cvh5/lpt_request_how_to_work_with_elderly_people_over/",
        "text": "I'm starting a new job where I will be responding to life alert alarms which means helping a lot of old people when they're feeling stressed out or confused. I don't spend a lot of time around elderly folk so I'm nervous I'll say something wrong that frustrates them even more.\n\nI'm pretty sure I'll be taking some of my first calls today and I've had very little training, so anything I can do to make things run smoother would be a big help.\n\nSo, with that being said, any tips for communicating with older people and keeping them calm/happy? (Bonus points if anyone has any advice for understanding mumbling over the phone!) Thank you in advance!",
        "created_utc": 1677099637,
        "upvote_ratio": 1.0
    },
    {
        "title": "LPT: Measure the width of your non-dominant hand and memorize it. Now you have a useful reference for everyday measuring, always at hand. (details and picture in comments)",
        "author": "kattmedtass",
        "url": "https://www.reddit.com/r/LifeProTips/comments/119bpjz/lpt_measure_the_width_of_your_nondominant_hand/",
        "text": "",
        "created_utc": 1677097991,
        "upvote_ratio": 1.0
    }
]