[
    {
        "title": "third ballet costume update from uber-blonde :)",
        "author": "uber-blonde",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/42723s/third_ballet_costume_update_from_uberblonde/",
        "text": "[x-post from RBN, I forgot to put that in the title, sorry!]\n\nThird costume update. I just finished this tutu for Princess Aurora of Sleeping Beauty.\n\nThese costumes seem to be coming along easier and faster. As always, thanks to everyone for their support and encouragement. I would not have thought to start making these again without all the encouragement I got from RBN and LAN.\n\n[third costume link](http://imgur.com/a/F7XsL)\n\nI am sharing these with RBN/LAN because I feel the comments here helped me to start making these again. \n\nFor many years, I did not feel creative but after going NC and after all the positive encouragement I got on RBN/LAN I feel like creating again! Some of the credit goes to you guys.\n\neta: first &amp; last part",
        "created_utc": 1453490075,
        "upvote_ratio": ""
    },
    {
        "title": "How best to act around N ex tomorrow? I'm feeling disturbed we will be at same event. I also want to meet his friend (24M)",
        "author": "WorkedOutSoWell",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/4246kt/how_best_to_act_around_n_ex_tomorrow_im_feeling/",
        "text": "We broke up officially a few months ago (no contact since then) after a very intense relationship with a messy middle involving a fake suicide attempt of his/tons of sadness and a messy ending that showed he did not care about me and devalued me (quite a shock after his proclamations of love, gifts and compliments). It involved him choosing someone else (who has opposite values to him) over me just a few days after he threatened to commit suicide if I was not intimate with or re-commit to him. And he used my change of heart to manipulate the girl to end her abstinence for him. I recently found out we are both attending the same college event tomorrow evening, and I got chills. I am over him (though I was pretty devastated by it all due to his incredible positive qualities, looks, personality: think mr. jekyl and hyde and I had a lot of regrets not re-committing to him and lost my first love). But I'm now creeped out and pained by the emotional abuse. I recently re-listened to a voicemail from him where he laughed about raping me, belittled me, and made me frightened for the safety of me and my family.\n\nWe will not be forced to talk, but we'll see each other walking around in a group of about 30. I don't know how to act, or how to prevent myself from getting scared and feeling small and in danger. He's engaged to the girl now, despises and wants nothing to do with me, so he will not approach me. But I'm afraid his presence will terrify me due to the past emotions. The voicemail alone still made me feel disempowered and small. I have chills. He also judged me as being too social (as a negative), so I'm scared to interact and make friends at the event for fear it will confirm his beliefs about me. He is hyper masculine in group settings and flirtatious (totally different side of him he fronted initially) super happy and giddy and not sensitive and soft which can easily break my heart, since I'm viewing someone not like the person I thought I fell in love with. He'll be acting like the big happy successful fun-loving man on campus, despite acting like a depressed emotional blackmailer to me for months.\n\nDoes anyone have song suggestions I can listen to that can make me feel safe/loved right now?\n\nThe twist is his friend is also attending. I could have gone out with the friend over him from the beginning (obviously made the wrong choice) and realize now we could be great friends. I realized through how he told me the truth about the fakeness of the suicide threats, that this guy is genuine. I feel so bad we never got to hang out during the relationship, as I wanted to distance myself from my ex. But had I not done that, me and this guy were supposed to go on trips with my ex and we would have gotten close. We have a lot in common. I really want the opportunity to get to know him, but I suppose I'm \"off-limits\" or seen as \"dramatic\" as my ex must have told him. I don't even know what I'd say as an intro. \"Hey, thanks for texting with me when I flipped out thinking Damien died! How are you?\" (obviously not). The friend might also think I'm not very sexual, which is not true, so I'd want to appear like whatever my ex told him is untrue.\n\nAnyway, how should I view this situation/navigate without any emotional fallout? I had become incapacitated with severe depression after the breakup and just recovered. My close friend will be with me.\n\ntl;dr: Feeling so small and scared of thought of having to spend time with emotionally abusive ex tomorrow. What are songs to make me feel safe right now? And strategies to deal with tomorrow? He will be with his friend, who I regret not getting to know and would love to chat with. I'm not sure if I could initiate.\n",
        "created_utc": 1453441154,
        "upvote_ratio": ""
    },
    {
        "title": "Blizzard",
        "author": "Wildkittten",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/423ys2/blizzard/",
        "text": "It's going to snow here this weekend and my NC NDad called my work (he doesn't have my cell number) and left a message (I don't take his calls) saying that I could show everyone my cross country skiing skills.\n\nGuys. I don't cross country ski. He does. I don't own cross country skis. He does. I will be showing everyone my boxed wine drinking skills. Being NC is great for seeing the absurdity of the Ns. ",
        "created_utc": 1453437439,
        "upvote_ratio": ""
    },
    {
        "title": "Worse than having to be in a N-Relationship, is being complicit in one",
        "author": "woefulwank",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/421993/worse_than_having_to_be_in_a_nrelationship_is/",
        "text": "Nothing is more toxic, and until you realise you are complicit can you then take a step to get release from one. ",
        "created_utc": 1453400407,
        "upvote_ratio": ""
    },
    {
        "title": "Zen Pencils, on breaking the cycle of abuse, link inside:",
        "author": "EccentricCinderfella",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/420pbe/zen_pencils_on_breaking_the_cycle_of_abuse_link/",
        "text": "http://zenpencils.com/ Number 189, for when this gets old. I'm proud of you all, thanks.",
        "created_utc": 1453393512,
        "upvote_ratio": ""
    },
    {
        "title": "how do i get off my parents health insurance plan?",
        "author": "mostpeculiarpictures",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/41zz66/how_do_i_get_off_my_parents_health_insurance_plan/",
        "text": "I've been NC with my parents for 1 year but have stayed on their health insurance plan not cause it's more convenient or anything (I have medicaid and would prefer to just use that) but because.... I literally can't get off their plan. Their insurance company will not let me get off it unless they submit a form asking for it, and even when I was in contact with them, they refused to submit this form. Now asking for it feels dangerous because they've been stalking me and any contact would just give them a reason to get even worse about that. Plus I still don't know if they'd submit it, probably not.\nI don't know what to do...",
        "created_utc": 1453383356,
        "upvote_ratio": ""
    },
    {
        "title": "The Concept of Licensing Parenting",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/41y6vp/the_concept_of_licensing_parenting/",
        "text": "[removed]",
        "created_utc": 1453349322,
        "upvote_ratio": ""
    },
    {
        "title": "25 or so years of repressed rage have been put out into the world this past week",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/41y3qc/25_or_so_years_of_repressed_rage_have_been_put/",
        "text": "[deleted]",
        "created_utc": 1453348006,
        "upvote_ratio": ""
    },
    {
        "title": "VLC and staying strong",
        "author": "[deleted]",
        "url": "http://vlcstayingstrong",
        "text": "[deleted]",
        "created_utc": 1453337741,
        "upvote_ratio": ""
    },
    {
        "title": "Positive attitude my favorite quote",
        "author": "uber-blonde",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/41x9yb/positive_attitude_my_favorite_quote/",
        "text": "So this is now my favorite quote. It beat out my previous favorite quote, from Twain.\n\n[link](http://i.imgur.com/3qRkjZI.jpg)\n\nI remember my nMother used to get super annoyed with me, when she would dig and I would just get sunnier.\n\nWorks for me!\n\neta: image link",
        "created_utc": 1453335979,
        "upvote_ratio": ""
    },
    {
        "title": "What was your mentality beginning NC?",
        "author": "biketreadonbrain",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/41x3cy/what_was_your_mentality_beginning_nc/",
        "text": "I'm about to leave and go NC for both parents, but seeing them as very sad kids now in aged bodies and who will not be able to comprehend any of the \"humanness\" of me doing this is ripping my brain apart. Please, what was your perspective or \"story for yourself\" in the process of leaving?",
        "created_utc": 1453333525,
        "upvote_ratio": ""
    },
    {
        "title": "Had a close call today with my e/n mom",
        "author": "Retrobebe83",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/41wsjp/had_a_close_call_today_with_my_en_mom/",
        "text": "So I went to my hairstylist today since we are expecting a big snow storm Friday when my appointment original was scheduled. I sat down in the chair and began talking to my stylist about color. She left for a minute to grab swatches and I noticed the list of her appointments hanging on the wall (she has them there each day). Right after my name was my n/e mom who, I went NC with almost 2 years ago. Immediately the anxiety rose up. I knew she still saw the same stylist as me but they always made sure we weren't on the same day. My stylist came back and I just looked at her and said \"is my mom scheduled next after me?\" With tears in my eyes. The anxiety (made worse by pregnancy hormones I'm sure) hit me hard. It took everything I had to not have an anxiety attack. My stylist quickly said \"oh shit\" and sprung into action. She had them call my e/n mom and tell her that she was running behind and to come in 45 min later. Then she grabbed someone to help color my hair (OB approved) quicker and even had gem move my car to the back. She kept apologizing. She felt so bad and told me that normally she makes sure we keep our appointments on different days or at least change the names on the ticket and keep them hours a part. She kept trying to feed me, do everything for me (like grab my water, take $10 off my bill, and dry shampoo for free. They even moved my car around back and my stylist walked me to my car to be safe. They got me out of there 20 minutes earlier than they normally would. So thankfully I did not run into my e/n mom. It had anxiety the whole time. It was very sweet how above and beyond my stylist went. Now I'm exhausted post adrenaline rush!",
        "created_utc": 1453329476,
        "upvote_ratio": ""
    },
    {
        "title": "I got a lawyer!",
        "author": "daphnes_puck",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/41wjbc/i_got_a_lawyer/",
        "text": "I found an attorney in hometown who will send the cease and desist letter for me, who appears to completely understand the need. She agrees that, due to the interstate nature and my undisclosed state of residency, it would be unlikely to be awarded a protective order without some serious escalation on Ndad's part. I'll be forwarding the email and voicemails to her, but I also need to give her a synopsis of our relationship so that she can frame the letter properly. I'm feeling overwhelmed by the task. I promised to have it in by close of business tomorrow, so I have some time. I feel like this is an exercise I've been putting off for a year or more. Support, advice and suggestions welcome. [TW] Background posts can be found [here] (https://www.reddit.com/r/ACON_Support/comments/3vv1lc/the_jizz_felon_wrote_me_what_should_i_do/) and [here] (https://www.reddit.com/r/ACON_Support/comments/3wjzhf/followed_up_with_sis_about_jizz_felons_recent/).",
        "created_utc": 1453326104,
        "upvote_ratio": ""
    },
    {
        "title": "Just as I have come to grips with what narcissistic abuse and my NP did to me and come to grips with it, the sheer amount of crap that the NP dropped me in seems overwhelming.",
        "author": "saddetective87",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/41wf7w/just_as_i_have_come_to_grips_with_what/",
        "text": "Just as I seem to get a grip on things and pushing forward personally, the sheer fact of being out of regular full-time work and the requirements of getting back into school just seems overwhelming. I understand the concept of one day at a time, but right now I feel like I am living in the Great Depression (I only am thankful that I don't have credit card or student loans). I did everything needed to get out of depression and to reprogram from N abuse, but the wreckage is massive (the train has stopped but the collateral damage is massive).",
        "created_utc": 1453324648,
        "upvote_ratio": ""
    },
    {
        "title": "DAE have difficulty with focus and commitment?",
        "author": "o0o__infinity",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/41wep6/dae_have_difficulty_with_focus_and_commitment/",
        "text": "Does anyone else have difficulty committing to a life path or activity?  For example, I enjoy painting, but the thought process goes like this:\n \n1.  Canvases are a waste of money, so I shouldn't buy them.  Money is too hard to come by.\n2.  If I do buy a canvas, it usually sits untouched for months, if not years, because I'll just ruin it.\n3.  If I manage to paint on it, I'm wasting my time.  I'm wasting my potential, too, because I could have used that time to commit to other things, like a masters degree.\n4.  Success is failure, because if I become a successful artist, I'll miss out on all the other things I could have been in life, like a scientist.\n\nAnd it's like that for everything.  Dating?  Buying nice clothes is a waste of money, he won't like you anyway, why worry about dating when you should be looking for a better job?\n\nCommitment = guilt = failure.  It's twisted and unhealthy.  How do you overcome this blockade in your mind?",
        "created_utc": 1453324453,
        "upvote_ratio": ""
    },
    {
        "title": "Taking steps.",
        "author": "SeaTurtlesCanFly",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/41v5ix/taking_steps/",
        "text": "[Previous post.](https://www.reddit.com/r/LifeAfterNarcissism/comments/41lu8y/his_therapist_says_that_she_did_it/)\n\nI have reported the psychologist that my father is using to harass me to the state license board.  Phew.  It makes me sick, but that's done.  We'll see what comes of it.\n\nI have not contacted the APA yet, but that is next on my list.\n\nI have called a lawyer.  Let's see if anything comes of that.  Probably nothing will, but I do feel like this is something I should do, because if I don't stand up to this stuff... I don't know... I just need to stand up to it, because fuck these people.  \n\nI have called the local police department to follow up on n-dad's therapist's admission that she sent me the package even after I sent her a registered letter (that she signed for) a 1.5 yr ago stating that she should never contact me again, because I considered any communication from her to be harassment, blah blah blah.  \n\nSo, I'm getting stuff done.  I feel guilty that it took me more days than I'd like to get started.  I am really good at guilting myself, but I know me and I know I will work through it.  At least there's that.  My one year-old has been really sick and I've been very busy and worried about her - that was the delay.  My one year-old will be okay.  She just seems to have asthma like everyone else in her family, so bring on the albuterol.  :-/\n\nI am physically ill right now for doing these things.  I feel like n-dad is going to bust down the door any moment to punish me.  I know these feelings are lying to me, so I'm doing what I have to do anyway.  It also isn't easy to face all this shit with a sick baby and a three year-old who just started preschool and is having a lot of emotional upheaval around that.  \n\nIf you guys don't mind, wish me luck that something comes of at least some of these processes I have set in motion against this enabling, idiot therapist.  ",
        "created_utc": 1453308251,
        "upvote_ratio": ""
    },
    {
        "title": "If you guys listen to podcasts: Introvert Extrovert Podcast on Toxic People, and one of the hosts interactions with women in his life",
        "author": "PENGUINS_SNORT_COKE",
        "url": "http://traffic.libsyn.com/introvertextrovert/introExtro81ul.m4a",
        "text": "",
        "created_utc": 1453308238,
        "upvote_ratio": ""
    },
    {
        "title": "[Happy] I was asked if I could do something and didn't feel the pressure to find a way how to do it",
        "author": "ShojiAn",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/41ue2o/happy_i_was_asked_if_i_could_do_something_and/",
        "text": "So I was asked to talk to students about disability through video conference yesterday/early morning today. When I found the time when it was supposed to be (9PM/10PM, I'll be traveling through 2 different timezones at the time, the class to which I would to talk to is in third timezone) I said only \"I am sorry, it's too late for me.\".\n\nI wasn't afraid of the other person's reaction if I couldn't answer them 'yes'. I didn't feel obligated to answer 'yes'. It was only me asking myself 'Can I talk to people this late?'",
        "created_utc": 1453297525,
        "upvote_ratio": ""
    },
    {
        "title": "Has anyone beaten brain fog?",
        "author": "otwu",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/41tko9/has_anyone_beaten_brain_fog/",
        "text": "Two years after I figured out that my mum has NPD, life is mostly normal. I run my own business, I am reasonably financially stable, I have friends, hobbies and a nice flat. I eat pretty well (working on getting even better), I am starting an exercise regime and I am beginning to sleep in a regular pattern. I have taught myself how to do all these things, mostly with the help of the Internet, and am proud of how far I've come. \n\nOne thing I haven't beaten is brain fog. I have a sense of fogginess all the time, of not quite being present or focused. This is causing me a lot of stress and has an impact on my work and the relationship with my girlfriend. Doctors want to prescribe me pills and therapy has not helped me with this. I have had  it most days since I left university in 2012 and every day since the narcissism revelations in 2013.\n\nHas anyone got through this?",
        "created_utc": 1453280790,
        "upvote_ratio": ""
    },
    {
        "title": "The N's in my life treated the people closest to them the worst",
        "author": "nessytornado",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/41t6ku/the_ns_in_my_life_treated_the_people_closest_to/",
        "text": "They were always careful to treat mere acquaintances with more respect. Did anyone else fund this to be true?",
        "created_utc": 1453272376,
        "upvote_ratio": ""
    },
    {
        "title": "Life after an Ndad passes away TW: physical violence/drug abuse (X-post from /r/raisedbynarcissists )",
        "author": "Buffyfanatic1",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/41st8n/life_after_an_ndad_passes_away_tw_physical/",
        "text": "Hello everyone! I've been a lurker for quite sometime and just recently made an account. I'm posting this from mobile so please forgive me for formatting errors.\nTL;DR: raised by schizophrenic NDad and he passed away from drug abuse when I was 17 and how I've been coping now.\nBackground:\n\n\nI (F23), grew up in a very chaotic home. My parents divorced when I was just a year old. My ndad got custody so my sister, ndad, and I moved in with my grandma. Everything was hunky dory for a while and then my mom moved away to another state when I was just six years old. So my grandmother took over the mothering position.\nMy ndad had a severe drug problem. He used to be addicted to meth but then died down to prescription drugs and weed. I didn't realize my ndad had a drug issue until I was maybe 10. Before then I just couldn't understand why when my ndad went to sleep he couldn't wake up, make weird noises, etc.\n\n\nMy ndad was very much a narcissist. He would force me to make him dinner, bring him drinks, walk to the grocery store to get food, clean his bedroom for him, and much more. He used to say things like \"I'm a man and you're a little girl so no matter if you're right, I'll always be right because I'm the dad.\" Or \"women couldn't ever win in a physical fight between a man because yall are weak and worthless.\" I was pretty sure my ndad was sexist but that was the least of my issues.\nMy ndad was very physically and mentally abusive. Just towards me though. I was the SG. My sister might've been the GC but she didn't get any special treatment. Except she never got beat. Anytime my ndad was angry he would find any excuse to beat me. I could just walk right in the door from school and he would smack my face hard just for looking at him wrong. If I had any opinion that he didn't agree with, he would smack, hit, push, or kick me until I lied and said that his opinion was correct and I was initially in the wrong. Every time I spilled something it would become World War 3 in my household. \n\n\nOne morning my ndad woke up, (I was around 14 at the time), and he burst into my room and dragged me by the hair out of bed. He was slapping my face and kicking me calling me a liar, calling me ugly, told me that I'm a worthless human being and he just wants to ship me off to my mom, etc. my egrandma finally came to her senses and called the police. He was arrested Nd came home about a year later.\nThings got better after that, mainly because he didn't want to go to jail again. We found out from a doctor in the jail that he was schizophrenic and that's why he had rage issues and drug issues. At that point in my life I honestly didn't care, I hated him with every fibre of my being.\n\n\nHe stopped the abuse and kept on doing drugs. On thanksgiving in 2009, after several promises that he would stop doing drugs, he did them yet again. My egrandma asked me if we should call an ambulance. I remembered last time when we called an ambulance he was pissed and beat me off and on for about two weeks for causing a scene. So I told my egrandma to not call the ambulance as everyone thought he'd come out of it anyway. Well, he didn't.\nThe present:\n\n\nAfter he died I have lived through so many years of guilt because I could have saved him and I do blame myself for his death. I know what yall are going to say, that it wasn't my fault and that he chose to do those drugs. But I know good and well that if I called 911 that he would have lived.\nEven though it's been almost 7 years since his passing, my childhood has caused me a lot of issues. I am depressed all the time, it is very hard for me to form and keep friendships, even relationships are hard. Every time my boyfriend and I argue I just shut down and stop talking because I'm afraid it'll escalate to a point where I don't want to achieve. I know it's stupid because I know my boyfriend would never hurt me, it's just that initial fear I guess.\n\n\nI guess the main reason for me posting that is yes, you can go NC, move to another country (like I did), they could die, and many other factors that would able you to get away from the situation but it will still follow you. Yes I've gotten better over the years but I honestly don't know how to cope and I've been doing the best that I can coming from a household that I did. Thanks for listening. I truly appreciate any helpful advice or comments yall want to give me :)\n\nEdit:wall of text",
        "created_utc": 1453266043,
        "upvote_ratio": ""
    },
    {
        "title": "I figured out why I hate exercise today. It feels like panic.",
        "author": "Crossswampfast",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/41r9qr/i_figured_out_why_i_hate_exercise_today_it_feels/",
        "text": "It's not that I don't exercise -- I do, but not happily. No runner's highs or senses of accomplishment for me. There's nothing I've found that I like, and I've tried everything at least twice. Mostly I walk and do physically demanding chores/DIY. I am physically healthy, strong for my size, flexible and taking care of my meat-sack.\n\nI've been having more than my normal share of panic attacks over the past few weeks thanks for some family drama that I cannot avoid, and some people in my environment who ping my N radar, but whom I don't know well enough to say for certain, who respond to grey rock and medium chill by escalating and who I will never have to deal with again once this is over. Which will be soon. I'm getting through it. Mindfulness, meditation and all the tricks of many years of therapy are helping, but those are my normal, after-market hacks to prop up the fragilities built into me. Adding new stressors lowers my resistance. This is how it goes. It's okay. Not great, but okay.\n\nI went for a walk today and realized about half-way through that I was getting seriously furious at nothing. I enjoy my current walking book, I was comfortable, I wasn't consciously thinking about Nfam or the Pingers. And then I made the connection. My heart-rate was up. I could feel the tight, achy sensation in my chest and the tingling in my fingers, the hair standing up on the back of my neck and the hyper vigilance.  Exercise felt enough like panic that it became panic.\n\nMy body has been trained to associate the good, healthy feelings of exertion with the negative space of fear and panic and threat. Exercise triggers freeze and flee -- and apparently today, fight. \n\nAt least it makes sense now. I have no idea how I'm going to fix it, because chemically damping down my panic reactions isn't really functional and I can be a stubborn pain in my own butt. But the connection is there, so I can move forward on it. Somehow. \n\n",
        "created_utc": 1453244231,
        "upvote_ratio": ""
    },
    {
        "title": "My narcissistic mother is ruining my wedding",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/41q6dm/my_narcissistic_mother_is_ruining_my_wedding/",
        "text": "[deleted]",
        "created_utc": 1453230349,
        "upvote_ratio": ""
    },
    {
        "title": "Living in Narcissistic environments have driven me to several nervous breakdowns, and I'm done.",
        "author": "WiseEpicurus",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/41nny2/living_in_narcissistic_environments_have_driven/",
        "text": "They said I was crazy, they made me depressed,  anxious, drove me to edges of sanity and over. Over and over. Family, programs, group homes, bad therapists. I'm done.\n\nThe narcissistic and codependent environments and the dysfunctional systems, people, organizations hurt me so much. But it taught me self-reliance. To trust myself. Radical self-respect. A love of freedom.\n\nI'm so done being abused. Sitting still and cowering. Not having a voice, and not raising it. Done.\n\nI am moving out to my OWN PLACE asap. No one will stop me.\n\n No one can take away my principles. No one.\n\n I am NOT crazy. If you're acting well and like everything is peachy in a sick environment, you're the sick one! \n\nAny advice or well wishes are greatly appreciated. \n\nHonestly, even here I am weary of no one believing me how widespread the problem is in programs and group homes. How power is abused and misused, and how the dysfunction is so wired into the system's design.",
        "created_utc": 1453191621,
        "upvote_ratio": ""
    },
    {
        "title": "When you're too young to understand your mom's an alcoholic narcissist",
        "author": "QwertyvsDvorak",
        "url": "http://sarahrodlund.com/2016/01/19/makeup/",
        "text": "",
        "created_utc": 1453183927,
        "upvote_ratio": ""
    },
    {
        "title": "Questions to ask when hiring a therapist",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/41ms5h/questions_to_ask_when_hiring_a_therapist/",
        "text": "[deleted]",
        "created_utc": 1453175382,
        "upvote_ratio": ""
    },
    {
        "title": "His therapist says that she did it...",
        "author": "SeaTurtlesCanFly",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/41lu8y/his_therapist_says_that_she_did_it/",
        "text": "First off.... WTF?!?!  This is just insane, but here is the latest.\n\n[Previous post here.](https://www.reddit.com/r/LifeAfterNarcissism/comments/40zkz4/there_isnt_enough_evidence_for_a_criminal_case/)\n\nPlease forgive whatever grammar mistakes there are. I am on mobile.\n\nMy father's therapist admitted to the investigating detective that she sent me the package. I find this unlikely because my father's handwriting was on the envelope. However, she says that she sent it to me of her own volition, because she thought I would like to know about my stepmother's death. This is after I sent her a registered letter demanding that she never contact me again because she had been contacting me on behalf of my abusive father and I was sick of the flying monkey bullshit.\n\nNo, I would not like to know if anyone died if it means that I would have to hear from any of my abusers flying monkeys. My knowing that she died doesn't change anything.  It doesn't bring anyone back to life and it doesn't change that my step-mother had cancer.  I wish I could have saved her from that, but nothing I could have done would have done this for her. I still demand no contact and it makes me sick to hear from any of my father's enablers.  I am incapable of supporting him.  He scares me.  He gives me panic attacks.  The asshat is going to have to find support elsewhere... and since he is rich and flashy and has a large circle of friends and a whole lot of family, I am sure he's  not lacking for support.  \n\nI feel so violated that a mental health professional pulled this shit. Of course, I will be contacting whatever ethical board is applicable.\n\nI feel so sick. I cannot believe he manipulated someone who is invested so much time in her career and education.  She's not some \"counselor\" that has no real mental health background. That she would risk that for him is just insane.  It is actually more scary to me that he managed to talk her into this than if he had done it himself.  Fuck.  Why can't this guy just forget I exist FFS?  He didn't raise me.   I hardly saw him as  child and this jackass acts like he owns me.  It's fucking unbelievable.  ",
        "created_utc": 1453161625,
        "upvote_ratio": ""
    },
    {
        "title": "Therapist interview questions? And advice on self-defence/martial arts classes?",
        "author": "PrancerPrancer",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/41kudc/therapist_interview_questions_and_advice_on/",
        "text": "Hello LAN \n\nNew year, new outlook, new therapist (hopefully soon) and trying new things. There are two questions to this post, please do share your opinions and tips. Thank you. \n\n**First question** I am interested in taking a self-defence class.  Whilst the physical abuse from Nrents was rare, the emotional and psychological abuse has got me very shut down in terms of emotional affect, and I'm very poor at defending myself, verbally, in any kind of confrontation.  However, I love movement, I've done a lot of yoga, dance, running and some fitness over the years and very much feel that this kept me sane through the N-madness. I have an idea that some kind of self-defence class would feel similar enough to dance classes that I'd be able to access the deeply buried defensive and self-protecting part of my self, without freezing up in fear and flashbacks. I feel like I might be able to trick my brain into thinking its safe enough because it's *like* a dance class, and gently work on extending my range of self-protection skills, initially physically, and perhaps one day verbal self-defence too.  Basically, I want to tackle my learned helplessness.\n\nI've looked online and I can't find any classes that are just 'Self-Defence' in my area, as I was hoping.  \n\nInstead, I've found a Ju Jitsu class which I like the look of (the video had women in it, and talked about using an attacker's weight and momentum to throw/block them). I also found a Taekwondo class, a girl I work with is a black belt in this and spoke highly of it. (She's absolutely tiny, so this was encouraging!) But it seems to be more kicks and smashing blocks, which could be fun, but possibly less practically useful if I did ever face a real assailant!?  And I've found something called 'Integrated Martial Arts' at a local college, but the website for this is really vague, so not sure what to expect from that.\n\nAnd before someone says, \"Go try some classes, and see what you enjoy.\" I'm actually really nervous about this, and if possible I'd like to avoid going to a class I hate or find triggering, as that could easily put me off trying anything else. So I'd like to be as informed as possible about what to expect before choosing a class to try.\n\nHas anyone done any self-defence/martial arts classes? What should I look for? What should I avoid? What should I expect? Which martial arts might suit me better (particularly as I'm from a dance background and want to ease into this gently)? Thank you in advance for any tips and advice. \n\n**Second question**  Having had a nasty experience with a kinda crappy therapist I'm looking for someone new.  I'm preparing some questions to bring with me to each initial interview (I plan on talking to a few different therapists). They're quite open-ended questions which I'm hoping will help me get a good sense of how the therapist thinks, their background and who might be a good fit for me. What do you guys think of these questions? Are they appropriate/sensible?  Any suggestions for other questions I could ask? \n\n* What do you think the therapist's primary role is in the therapeutic relationship? \n* If a client is feeling very overwhelmed how do you respond?\n* What is your opinion on forgiveness with regards to healing from abuse? \n* What is your opinion on anger and rage with regards to healing from abuse? \n* If/When the client chooses to end therapy, how does this happen?\n* Do you measure a client's progress and/or agree goals or aims? If so, what approaches do you take to do this?\n* What is your take on Narcissistic Personality Disorder, what do you know about it, and what are your thoughts on healing from narcissistic abuse? Do you know, or have you ever met a person with NPD? \n* What is your understanding of trauma and its impact on the brain and body? Have you worked with clients in the past who have been traumatized by interpersonal trauma?  \n* I have done a lot of dance and yoga, and find these have helped 'keep me sane' and connected to those around me. Have you ever done a physical practice of any kind?    \n\nthanks for reading :)\n\n\n\n\n\n \n\n ",
        "created_utc": 1453149175,
        "upvote_ratio": ""
    },
    {
        "title": "N, FLEAS, or something else?",
        "author": "brideofjandh",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/41kjkq/n_fleas_or_something_else/",
        "text": "My boyfriend and I have Nparents and our own FLEAS that we’ve been working on, but there are other problems that seem different than FLEAS. My boyfriend is considering going to therapy (I’m in therapy now), but he’s afraid he has a problem that can’t be fixed. I know you can’t diagnose anyone, but if any of you have seen these things and can give some advice, it’d be helpful, because he’d be more likely to go to therapy if he hears that other people have had a similar problem and were helped by therapy. \n\nMy boyfriend has lightning-fast changes in temper and fights with me about trivial things, saying illogical things to the point that I doubt my own sanity.  A few examples: We made plans to go to the movies at night, talked about what we wanted to see, looked up movies together on the computer, and picked the show time.  Later when it was time to go, he acted like he didn't know what I was talking about and denied that we made plans to go to the movies.  When I showed him the computer and the tabs that we’d opened and reminded him of things he’d said about a certain movie, he changed his story and said he remembered that we’d made plans but denied that they were for that night.  When I show him the show times that we’d looked up for that day, he changed the topic and blamed me for not cleaning the apartment and ruining his work schedule.  Another time: I couldn’t find my medicine (for a rash on my hand), and we both looked for it over a few days.  Then one evening when I mentioned it again, he walked into the kitchen, pulled it out, dropped it in front of me, and made an angry comment about how I’d known where it was all along.  When I pointed out that if I’d known where it was, I would have used it, and that I didn’t understand why he hadn’t told me where he’d put it, he denied knowing that I needed the medicine, denied that he ever looked for it, and blamed me for not remembering where he had put it.  And another: We were at a bookstore, I was reading an article about poverty, and there was a photo of a child with crushed plastic soda bottles tied to his feet for shoes.  I said the photo was sad and that it made me think about poverty and how much I took for granted.  He got angry and said the photo wasn’t sad, and that if the kid wanted shoes he should just “go into the forest and make his own shoes”.  This escalated into him saying that homeless people who sleep in cardboard boxes could go into the woods and make their own houses if they wanted to, so he didn’t feel bad for them.\n\nWhen we have these kinds of conversations, I feel blindsided by his anger, lack of logic, and twisting of reality.  He’s normally pretty rational and I know he doesn’t believe what he’s saying when he gets like this.  It’s like he gets in this grip of an angry impulse and cannot stop himself.  He’s like Jekyll and Hyde. It’s really hard not to engage when he denies reality or says things that are ridiculous.  Using logic doesn’t work when he gets like that, though, but nothing else does either.  I’ve tried not responding or saying that I didn’t agree but didn’t want to fight, and it just makes him angrier.  Walking away or going into another room doesn’t work, fighting with him doesn’t help. \n\nUsually he calms down within an hour and then comes to me and apologizes and says that what he said was ridiculous and that he totally understands why I was upset.  On the times that we've fought to the point of screaming at each other, later he’s come to me in tears and was very apologetic (and so was I-I hate fighting, especially over trivial things). He’s told me that he thinks there’s something wrong with him and he’s afraid it can’t be fixed.  He says he thinks he has a problem with his brain.  I can see in his eyes and hear in his tone that he’s sincere—he really is sorry, he really is afraid there’s something wrong with him.  \n\nIf he were a narc, I would think he was doing those things to gaslight me. But the fact that he later apologizes, sincerely, not a narc’s “I’m sorry you feel that way” non-pology, makes me think he’s not really a narc and that he has some issues that are treatable.  What do you think?  \n\n\n\n",
        "created_utc": 1453145626,
        "upvote_ratio": ""
    },
    {
        "title": "Tips for dealing with ongoing triggers?",
        "author": "MetaphysicalBlanket",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/41k2bn/tips_for_dealing_with_ongoing_triggers/",
        "text": "Hello,\n\nLike many of us here, I moved away from home perhaps a bit before I was ready economically. I live in a cheap apartment in poor condition in a divided house. The house is old and has very little soundproofing. I'm finding that living here is triggering me in 3 ways.\n\n* 1) I can smell my neighbours smoking. (I posted on here about a confrontation with a neighbour previously, but this neighbour has now moved. I am now dealing with new smokers)\n* 2) I can hear my neighbours talking loudly, which I perceive like yelling. I think raised male voices trigger me.\n* 3) I am worried about my safety because the house has old electricity and could have a fire and I think I don't trust the neighbours to be safe because I'm associating them with NDad.\n\nI think these are all connected. My NDad smoked in the car with me and I associate that smell with abuse, shame, and suffering. The loud voices are an obvious one, they remind me of being yelled at. And the safety I think might emerge from the previous two: I think I'm subconsciously feeling like I am unsafe here, just as I did with my neglectful NDad, so I'm creating things to worry about, such as fire safety. Fire safety was a real worry for me growing up as my NDad refused to use smoke detectors, etc.\n\nI've complained to the landlord about the smoking already. Unfortunately, she will not do anything. It's a cultural thing, she is Greek and smokes in her own house so she doesn't understand. I've done some good work blocking out the smell but some of it still makes it in. I think I need to work more on the internal stuff rather than the external stuff: on being able to deal with it. It puts me into a place of suffering and powerlessness, and I'd like to work on changing that association. Same with the loud male voices. Of course, if you think it's not worth the suffering and I should move, then let me know. I have trouble knowing when that kind of thing is reasonable.\n\nThe fire safety stuff, well, I don't know. I put a battery in the common area smoke detector so I don't have to worry about that so much, and I have smoke detectors and a fire extinguisher in my apartment so I think that's about all I can do. I have to try and trust these neighbours to make reasonable precautions about fires despite subconsciously mistrusting them.\n\nDoes anybody have any tips for dealing with these kinds of ongoing, everyday triggers? Thanks in advance :)\n\ntl;dr: Neighbours are smoking and talking loudly, I smell and hear them, it's making me anxious in general and I want to be able to handle the triggers better so I feel more trusting of life rather than try to change their behaviour.",
        "created_utc": 1453139759,
        "upvote_ratio": ""
    },
    {
        "title": "Tips for dealing with an ongoing triggers?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/41k0kn/tips_for_dealing_with_an_ongoing_triggers/",
        "text": "[deleted]",
        "created_utc": 1453139143,
        "upvote_ratio": ""
    },
    {
        "title": "My aunt and emom fleas. Am I going crazy?",
        "author": "toobadiremember",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/41jw3r/my_aunt_and_emom_fleas_am_i_going_crazy/",
        "text": "Edit: I meant to change the title to something about empathy &amp; emom, but I forgot to before I got post.\n\nSo a couple months ago my aunt (emoms oldest sister) dropped dead of a heart attack. Luckily she was able to be revived, had surgery for a pace maker, but was in a coma for a couple weeks. She's fully recovered, but is understandably not doing well with her near death experience. While she was in the hospital none of her FOO visited her. Emom was across the country and had my sister's wedding to attend (so.. Semi valid excuse? Idk, you be the judge) but she did send roses and called my uncle a couple times for an update. My grandmother, and two other sets of aunts and uncles were 30-45min away from dying aunt, but did not visit.\n\nAlso worth noting, none of my mother's FOO came to any of her children's weddings.. Something my mom is very, very upset/hurt over, as she traveled across the country for all of her nieces and nephews weddings. \n\nanyway, formerly dying aunt, we'll call Hillary, is kind of on a rampage yelling at everyone. I identify with her because she's having a hard time coming to terms with what's clearly a fact that her FOO doesn't care about her, not even if she died. There's some other stuff going on involving grandma's end if life care, POA and what not but basically one aunt &amp; uncle aren't talking to Hillary, and my grandmother is doing her stiff upper lip thing and not addressing it. Hilary's only support is from her husband and adult children.\n\nNow for the meat and potatoes of the post: my mom is asking for advice on how to repair her relationship/deal with Hillary. I'm strongly suggesting emom view things from Hillary's perspective, empathize, validate her emotions, and start apologizing. Emom can (will?) Not. Do. it. When I talk to her about what empathy is in practical terms there's this.. Awkward tension in our conversation. As if I'm explaining something she's deeply uncomfortable with and doesn't understand. It's like she thinks empathy means feeling bad for the other person. She's mistaken empathy with pity/sympathy.\n\nI'm at my wits end trying to explain how important validation is, and add credence to my point by pointing out how hurt I've been by emoms inability to see anything outside of her own perspective. I've also pointed out how when I'm hurt I still have the ability to step outside myself, see things from the other's perspective, and apologize (even for things I don't think are wrong) because I've hurt the other person and want to repair the relationship. I was trying to explain how it is important to other people that we acknowledge our hurtful actions, then gave an example of when emom was comforted by me doing this for her. This seems to be something my mom is deeply struggling to understand.\n\n\nMy mom then asked what I was planning on doing with Hillary, and I told her to be honest I was thinking about calling her and telling her about times I've struggled with her (emoms) inability to see my perspective, validate how she's feeling, then ask her how she's holding up. Emom confidently stated if I validated Hillary's perspective of my mom it would only make Hillary hate emom more, and that Hillary's perspective is wrong.\n\nPart of me thinks I'm just barely starting to break through with something huge with emom. She wants to talk more today about this whole validation/Hilary thing. The other part of me is astonished that I have to explain the nuts and bolts of empathy and repairing an adult relationship to a 64 year old woman, and am further astonished I'm the first person to do so?? It's like if the other person can't pretend like nothing happened, emom doesn't know how to move forward relationally. \n\nWhat do you think, can empathy be taught? Suggestions?",
        "created_utc": 1453137567,
        "upvote_ratio": ""
    },
    {
        "title": "Some Monday motivation for those recovering from abuse :) Many blessings",
        "author": "Benevolent_Son",
        "url": "http://blessingsfromourmother.com/2016/01/18/judge-not-lest-ye-be-judged/",
        "text": "",
        "created_utc": 1453132970,
        "upvote_ratio": ""
    },
    {
        "title": "Recovering from Trauma - psychology today",
        "author": "saddetective87",
        "url": "https://www.psychologytoday.com/articles/200308/recovering-trauma",
        "text": "",
        "created_utc": 1453128281,
        "upvote_ratio": ""
    },
    {
        "title": "Phases of Trauma Recovery",
        "author": "saddetective87",
        "url": "http://trauma-recovery.ca/recovery/phases-of-trauma-recovery/",
        "text": "",
        "created_utc": 1453126656,
        "upvote_ratio": ""
    },
    {
        "title": "I made it to two minutes!",
        "author": "Cranksta",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/41hkr1/i_made_it_to_two_minutes/",
        "text": "I know this is really stupid and probably something I shouldn't be proud of because it's just basic hygiene, but tonight I brushed my teeth for two whole minutes!\n\nThe stress of growing up with an Nmom made building hygiene routines impossible, and with her constant ridicule it made things even more difficult. I went for a week without showering on average, changing clothes was done after a handful of days, and teeth brushing only happened on special days. I would get attacked constantly for these habits, she would literally force open my mouth and violently brush my teeth until they bled. She'd beat me over my bad hygiene at the smallest provocation, but would never actually help me fix it. Eventually I just gave up and stopped caring. She never took me to the dentist and I wasn't allowed out of the house anyway so there was no need to keep presentable or clean. I had these habits until I ran away at 18.\n\nNow I live with my siblings and my hygiene as a whole has improved greatly. I do my laundry each week, change clothing regularly and shower at least three times a week. The last thing I have to overcome is my teeth brushing habits. It's been slow, starting with just one brushing every other day to one brushing a day. Then two brushings a day, and now finally trying to improve my duration. My brushing sessions so far have been for maybe thirty seconds to a minute and it just doesn't cut it. So tonight I finally took my phone in with me to the bathroom, started my stopwatch and brushed my teeth until it hit two minutes. I feel so clean and happy and I'm really childishly proud of myself. I'm going to do my best to maintain it but it will probably wax and wane until it becomes habit. Still, for now, I'm proud. &lt;3",
        "created_utc": 1453095750,
        "upvote_ratio": ""
    },
    {
        "title": "Realism or Paranoia? I’m afraid of everyone from my past and it’s interfering with my life.",
        "author": "mostreclusiverecluse",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/41exrx/realism_or_paranoia_im_afraid_of_everyone_from_my/",
        "text": "Hi all. Let's get right to it.\n\n\nMy dilemma is this: Every few months I go through several-week-long waves of intense (affecting my daily life) paranoia about people from my past coming back to haunt me - ex family, ex boyfriend, ex friends. While I *think* this is warranted paranoia because these people are abusive narcissists, I read recently that it’s common for people who have had trauma to be hyper vigilant to the point of not being able to enjoy a normalish life or even semi-intimate relationships. So now I’m also paranoid that my paranoia is unwarranted to some degree and that I need to be actively trying to lessen it so I can enjoy my life more and function better. The idea would be that yes, these people from my past are crazy and treated me horribly, but no they are not necessarily still trying to hurt, stalk, attack, sabotage me, etc. \n\n\nHave any of you experienced this? Should I just keep riding these waves of paranoia, assuming they are valid, and hope that with time (and therapy and whatnot) they get better? Should I be focusing on healing the cause of the paranoia (possibly hyper vigilance from trauma)?\n     \n\nSome background:\n\n* **FAMILY.** I’ve been NC for several years. In addition to both my parents being Ns and sadists, there are also pedophiles *within* my family. My childhood was a nightmare. I’m absolutely terrified of my whole family because (1) they all hate me for going NC, (2) my Nmom tried to kill me when I was 4, and (3) they really fucked me up as a kid between the sexual abuse and the headgames (sometimes I thought I was actually going mad). Some family members used to stalk/harass me, and though I haven’t heard from them in a while, I think it’s because I’m vying for the title of “Most Reclusive Recluse” by moving a lot, having no friends, and being all around secretive. Or maybe it’s because they genuinely don’t really care anymore and have moved on to other N supplies. I don’t know, hence the dilemma.\n\n* **EX BOYFRIEND.** My last ex is a covert narcissist who left me high and dry. Literally stole a significant amount of my money, charmed other people into thinking he’s the good guy, and took my furniture. MY FURNITURE. He’s an unabashed liar. Though I haven’t heard from him directly lately, he has recently suddenly taken an interest in the exact same field of study that my boyfriend works in. My boyfriend doesn't think he's a threat and is mostly just amused that my ex wants to compete with him in careers. So I don’t know if anything is going to come of this, or if my ex is going to try something crazy, but I’m scared (again, rightfully or hyper vigilant?) that he’ll try to sabotage us. We’re not financially stable right now and I’m afraid any sabotage could really mess with our future. Also, he knows my family so I’m doubly scared that he’ll give them details so they can start harassing me again.\n\n* **EX FRIENDS.** I’ve had a knack for choosing narcissists and sociopaths to be in my life, so understandably I have a handful of ex friends who used &amp; dumped me in one way or another. I am afraid of them also sabotaging me because they all know a lot of the same people. There’s whole groups of people that me and these ex friends (as well as my ex boyfriend mentioned above) share as acquaintances. It doesn’t help with the reclusive thing because it paralyzes me about reaching out to anyone. I feel like I can’t trust them. I don’t know if I should just start over making new friends outside of all of the people I know.\n\n     \n\n**TLDR: AM I CRAZY? DISCUSS.**\n\n*Edited for formatting cause I don't know what I'm doing.*",
        "created_utc": 1453058258,
        "upvote_ratio": ""
    },
    {
        "title": "Recovering from the death of a pet",
        "author": "maotzu",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/41e2np/recovering_from_the_death_of_a_pet/",
        "text": "I have a pet cat. He is turning 7 this year. I have emotional problems, serious sort of been-in-the-hospital-before kind. This cat has been my best friend for 7 whole years. He's always there for me. Taking care of him has been really good for me. I talk to him about things and he is just generally a huge part of my life. I know that 7 is not old, but it made me realize, truly, that one day my pet won't be with me. Even just thinking about him not greeting me at the door when I get home or cuddling up with me at night breaks my heart. I don't want this to be a serious problem in a few years for me, emotionally. I've been doing pretty well lately, as in: I have a job, I'm sober, I'm in a stable relationship, I take care of my emotional health. It's been so good that I can be off of medication, and while it is still difficult, I can live a pretty normal life. Things I am already pretty good at (for dealing with problems): exercise, journaling, meditation, going to therapy, seeing my psychiatrist when I need to. I don't think that will be enough, as this is a really big emotional thing. I am afraid the death of my cat will be devastating. I am counting on at least a few more years with my sweet boy, but I feel like I should have a game plan for when the day comes. What are things I can do now to prepare for the inevitable, and what are things I can do after to grieve in a healthy way? \n\n\nTLDR: I have severe emotional problems. Cat is a big part of my life. Cat is getting older. How can I prepare myself for his passing, and how can I deal with it in a healthy way? (Besides the obvious like exercise, sleep, therapy, etc)\n\nEdit: Cat tax [Imgur](http://i.imgur.com/Z4fw6BT.jpg)",
        "created_utc": 1453046338,
        "upvote_ratio": ""
    },
    {
        "title": "'You're SO emotional!' Ever heard that one? Yep, me too! Abusers hate facing the emotional piper!",
        "author": "CottageDweller",
        "url": "http://linkis.com/com/nMwFD",
        "text": "",
        "created_utc": 1453021462,
        "upvote_ratio": ""
    },
    {
        "title": "I am better than all of you",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/41c6qw/i_am_better_than_all_of_you/",
        "text": "[removed]",
        "created_utc": 1453007747,
        "upvote_ratio": ""
    },
    {
        "title": "The Aging Narcissistic Parent - Beth McHugh",
        "author": "saddetective87",
        "url": "http://youronlinecounselor.com/Articles/Aging-Narcissistic-Parent.htm",
        "text": "",
        "created_utc": 1453003676,
        "upvote_ratio": ""
    },
    {
        "title": "[happy] [progress] We sold our old house today! And the neighborhood is better!",
        "author": "Crossswampfast",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/41bm4t/happy_progress_we_sold_our_old_house_today_and/",
        "text": "Spouse and I lived in a neighborhood with a community manager for the common areas, and a new person took over a couple years ago. The new person had extreme issues with women -- he got in our faces, bullied, threatened to have us kicked out (he couldn't, but --) even assaulted physically at least two others. Many of our neighbors were elderly, or on fixed incomes, or both, and terrified of this jerk. \n\nAbout 6 months ago, jerk did so to me (yelling) and my across the street neighbor saw. She was one of the ones he had hit. I convinced her to come with me to the cop shop, and we filed incident reports. A month later, a third woman filed another assault report (with her security camera video) and jerk is gone. Fired, restraining order, multiple charges of felony assault. New manager seems to be fine. \n\nStill... It didn't feel safe to stay. Spouse and I found another house, moved, have managed both mortgages, and found a buyer for the old one. Who signed the papers today. \n\nI hadn't realized how much tension I'd been carrying over this until it finished this afternoon. Knowing it's no longer my problem at all, and knowing I'm not leaving anyone behind in abuse is... Such a relief. ",
        "created_utc": 1452997984,
        "upvote_ratio": ""
    },
    {
        "title": "Came across this AMAZING photo on fb (funny)",
        "author": "Retrobebe83",
        "url": "http://imgur.com/3BMgbaj",
        "text": "",
        "created_utc": 1452995247,
        "upvote_ratio": ""
    },
    {
        "title": "Some good advice from Stephen Hawking.",
        "author": "saddetective87",
        "url": "http://www.iflscience.com/health-and-medicine/stephen-hawking-gives-some-beautiful-advice-depression",
        "text": "",
        "created_utc": 1452990541,
        "upvote_ratio": ""
    },
    {
        "title": "Post-recovery, how do you minimize the (chance of/time spent in) emotional regression?",
        "author": "BreakwaveCove",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/419uzc/postrecovery_how_do_you_minimize_the_chance/",
        "text": "For the sake of this post, let's view it as two separate sets of cognitive pathways:\n\n* one composes the regressive and unhealthy **victim** personality created as a defense during an abusive upbringing\n* the other composes the healthy **winner** personality designed and built through the exercising of neuroplasticity during recovery work\n* this winner personality is pretty much complete and has proven through experience to be well-designed and correct\n\nAnd assume that:\n\n* most all repressed emotional suffering stored in the victim personality has been worked through, so what's left is bare circuitry devoid of dormant emotional load, so further grief work will have little to no effect\n* most all of the time is spent operating and perceiving from the winner personality\n* awareness is maintained during regression into the victim personality so one can recognize and say to oneself \"I am perceiving from my victim personality\".\n \nThe undesired consequence of perceiving from the victim personality is not that it entails suffering, but rather that its cognitive distortions make decision making dangerous and generative creativity difficult. For instance, it is almost impossible to make healthy life choices when perceiving through the lens of the regressive victim personality.\n\nSo the effect of the victim personality firing up and becoming the mechanism of reality perception is *lost time and lost opportunities*.\n\nI've been considering hypnotherapy as one way of weakening the sensitivity of the victim personality and strengthening the winner personality, and using anchoring as a way to speed the switch back into winner personality.\n\nI've also thought of mirror work, and also of disarming the triggers by repeated exposure to them (i.e. listening to a voicemail of my biological father's voice over and over again, until I can do it without feeling any temptation to regress into the victim personality).\n\nWhat others ways can you think of, have you tried?\n\nEdit: I've heard of \"anchoring\", which I understand has to do with creating some word or body position that can be strongly associated with engagement of the winner personality, and so used during regression to re-engage it?\n",
        "created_utc": 1452972927,
        "upvote_ratio": ""
    },
    {
        "title": "Making new friends",
        "author": "cmp600",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/419t37/making_new_friends/",
        "text": "Hey, I was just wondering if anyone else who went no contact with a narcissistic parent and narcasiatic friends had to start over socially? How did you deal with it, did you make new fulfilling friendships post-NC? I guess I'm just a little worried, because although I have a great relationship with my mom, brother, and sister now, with meeting new people I'm worried I'll fall back into old patterns of \"befriending\" narcissists and codependents of narcissists. I guess It's really scary to put on a smile and put yourself out there again after being withdrawn and on guard against toxic people for so long. I have a feeling the initial loneliness gets better, but I'd love to hear some stories from people further along.",
        "created_utc": 1452972283,
        "upvote_ratio": ""
    },
    {
        "title": "Pink or Red? Color is subjective, you know :) [x-post from RBN]",
        "author": "uber-blonde",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/419h43/pink_or_red_color_is_subjective_you_know_xpost/",
        "text": "Today I thought of a funny story from my past.\n\nI like pink nails. I went to the nail salon with my nSister, who encouraged me to get red nails. I can't wear red, because of my fair coloring. I finally settled on a shade close to Chanel's \"Satin Red\" it's close to a red-pink blend.\n\nI proudly showed my color choice to my nSister and declared it a \"good compromise\".\n\n\"That's not red, it's PINK!\" she exclaimed.\n\n\"Um, yes, it's between the two colors...\" I said.\n\n\"IT'S PINK!!\"\n\nI carefully and politely explained how (some) color is subjective. You know, if your parents held up a thingy and said \"Look at the purple thingy!\" then children will associate that color name with that shade. And that's why we have primary colors- those are less subject to interpretation.\n\n\"IT'S PINK! How could you say it's RED when it's clearly PINK?\"\n\n\"Um, to ME it looks pinky-red...\" I said again.\n\n\"NO! It'S PINK! CAN'T YOU SEE IT'S PINK?!\"\n\n\"Ok\" I said. \"It's pink. Whatever you say.\" (tired sigh to self)\n\n(Triumphant leer from N) \"SEE, I TOLD YOU IT'S PINK!!\"\n\nGeez, how N can a person be? The color looks pinkish-red to me, and pink to them. So what? Who cares? Can we not agree to disagree?\n\nLMAO\n\neta: managed to gaslight MYSELF into typing \"red\" rather than \"pink\" now I am really laughing!!\n\nHave a great day, y'all! :)",
        "created_utc": 1452967769,
        "upvote_ratio": ""
    },
    {
        "title": "Taking the step - Looking for a therapist who doesn't push \"forgive your abusive parents and family.\" Any recommendations would be appreciated. Details inside.",
        "author": "therapy_rec",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/417pdk/taking_the_step_looking_for_a_therapist_who/",
        "text": "I've had a really bad last 12 months, with lots of really intense and traumatic events, and I think I need to at least explore the possibility of all that has happened with a therapist. I'm NC with my entire FOO, and the trauma has further shown me how alone I am, in that I have no family to go to for support, in fact they are a large part of the problem. \n\nI haven't been in therapy for about 6 or 7 years, and most of my 'handling' of my situation with my N family has been on my own and on this sub.\n\nHowever, I really think I need to at least explore the option of talking to a therapist. I've held far too much in. What I am looking for is a therapist who speaks English predominantly, who is able to do 'over the phone' or Skype sessions.  The most important thing I am looking for is a therapist who is not dismissive of childhood abuse and trauma, and who does not push the \"forgiveness is a magical fairy from heaven who makes all the pain go away.\"  It doesn't matter where they are located in the world, North America, Europe, wherever.  \n\nWhat's most important is finding someone who doesn't push the forgive your abusers mantra, and someone who acknowledges the reality of child abuse. \n\nIf anyone can recommend or even just suggest possible therapists, maybe someone you had success with in the past, or someone you have heard good things about, I would love to know.\n\nMaybe just PM me their website so I can take a look and decide if I want to contact them. There have been so many horror stories about therapists over the years, and I'm not willing to take a chance with someone who is going to do more harm than good, because they have their own personal agenda to push.  And if I have to read another poem on a therapists website about how 'forgiving your abusers is what makes the world go around, now don't you feel better?' I'm gonna plotz.\n\nThanks for reading. ",
        "created_utc": 1452936687,
        "upvote_ratio": ""
    },
    {
        "title": "Everybody has the Power :)",
        "author": "uber-blonde",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/416sn3/everybody_has_the_power/",
        "text": "This image with text reminded me of how happy I am NC.\n\nI know I could not WAIT for my nMother and other Ns in my life to leave! I am to the point in my life I will ASK them to leave, whenever possible.\n\nIt also reminded me of how I never want to be the person everyone wants to leave the room!\n\n[link to image with text](http://i.imgur.com/cdwDSMC.jpg)",
        "created_utc": 1452917641,
        "upvote_ratio": ""
    },
    {
        "title": "Everybody has the Power :)",
        "author": "uber-blonde",
        "url": "http://i.imgur.com/cdwDSMC.jpg",
        "text": "",
        "created_utc": 1452916148,
        "upvote_ratio": ""
    },
    {
        "title": "Yelling",
        "author": "clutch_purse",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/416141/yelling/",
        "text": "Did you grow up with a lot of yelling in your house? Specifically yelling that came from your Nparent? I did and want to talk about it. And how it's affecting me today in adult life and what not. ",
        "created_utc": 1452905054,
        "upvote_ratio": ""
    },
    {
        "title": "Run In With No Contact Aunt Forced Confrontation",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/415lf7/run_in_with_no_contact_aunt_forced_confrontation/",
        "text": "[deleted]",
        "created_utc": 1452898704,
        "upvote_ratio": ""
    },
    {
        "title": "Free review copy of 'Unmasking Narcissism: A Guide to Understanding the Narcissist in Your Life'",
        "author": "merway731",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/415hhy/free_review_copy_of_unmasking_narcissism_a_guide/",
        "text": "[removed]",
        "created_utc": 1452897183,
        "upvote_ratio": ""
    },
    {
        "title": "Free copy of 'Unmasking Narcissism: A Guide to Understanding the Narcissist in Your Life' is being offered by a publisher in exchange for reviews.",
        "author": "calstow",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/414voq/free_copy_of_unmasking_narcissism_a_guide_to/",
        "text": "[removed]",
        "created_utc": 1452888982,
        "upvote_ratio": ""
    },
    {
        "title": "Almost sent a fierce email to my aunt, who my Nsis is named after...",
        "author": "macarenaPistacio44",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/41452n/almost_sent_a_fierce_email_to_my_aunt_who_my_nsis/",
        "text": "I was shaking as I typed a reply because I thought Nsis was testing my VLC. Thank God I realized it, or I'd have sent it to my very nice aunt. Now I feel like crying at how F'D it all is. It was a TLDR restatement of what Nsis has done most recently and what she did that created the VLC, very strong but included that I respected my Nsis and loved her enough to expect nothing less than decent behavior from her. Something I've been thinking about after reading the \"apology\" thread. Maybe I need to slow down!! She has just \"pushed\" so many times, you know? My poor auntie would have been upset, but probably would have figured out the mistake, and been enlightened as to what my reasons for VLC are!!! \n\nUgh, just upset.",
        "created_utc": 1452879844,
        "upvote_ratio": ""
    },
    {
        "title": "What's your take on people who say \"I just wanted to do something nice\" instead of \"Sorry, I should have asked first\"?",
        "author": "arcticfoxtrotter",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/4126bc/whats_your_take_on_people_who_say_i_just_wanted/",
        "text": "Because it feels very gaslightingy to me. A (supposed) friend recently introduced me to a possible work contact (I'm partly self-employed) by emailing him and me at the same time. She didn't ask if I was free or if I wanted to be introduced.\n\nI hate it when people do things like this without asking, because it gets really awkward if I'm not able to actually work with the person. On this occasion it was an awful idea as THIS GUY WAS A COLLEAGUE OF MY NMUM. Who I'm NC from. \n\nI wrote back saying she should not have done that and she would need to explain to her contact herself (as the prospect of replying to him and having him say oh are you x's daughter was not okay with me).\n\nThe reply. *Really sorry, just didn't think of that. I meant to do something nice for you.*\n\nI hate it when people say that. It's like saying: *well I have decided how you should feel and what you should want, and I'm going to take offence if you don't fit in with that. I didn't really want to do something for you. It was for me.*\n\nI am no longer seeing this person but was interested to see what people thought as it's been on my mind.\n",
        "created_utc": 1452844940,
        "upvote_ratio": ""
    },
    {
        "title": "Handy snippets for difficult days",
        "author": "TheTartanDervish",
        "url": "http://m.imgur.com/a/f24GS",
        "text": "",
        "created_utc": 1452834186,
        "upvote_ratio": ""
    },
    {
        "title": "N-Abuse Roots Itself Deep In Your Mind",
        "author": "mykitty_titties",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/410gc3/nabuse_roots_itself_deep_in_your_mind/",
        "text": "So, I have always felt awful when things don't go the right way, as if I am the fault. Not \"Why is everything out to get me??\" but \"why can't I do anything right?\" I realized today that this is large connected to my shitty family.\n\nI smoke weed. I live in a legal state, and I mainly do it for my anxiety and carpal tunnel. I prefer vaping to smoking, and for my birthday my husband bought me a Volcano vaporizer. This is like THE desktop vape(or used to be, I think its sort of like owning a Mac desktop. It's cool, but it's not the most powerful/best on the market anymore). And it had a price to match. It was expensive and something I wanted in that \"one day....\" sort of sense. It was too expensive for me to ever consider buying it for myself, and it was always just something dream me would own. Not something that real me would ever own. \n\nIt's only ~$500, so it's not like it was unbelievably expensive. Just too much for me to consider spending on myself.(And in fact, thinking about how my husband spent $500 on one thing for me makes me a little ill. We can afford it. It's just ....why would someone spend that much on me??)\n\nAnyway, so we get our Volcano, and it is broke. From day one, it was broken. A defective heater. So immediately, I blame myself. It's my fault for wanting such a stupid and expensive thing, so of course it is broken because I am too stupid to figure it out, and why would I ever think it'd be ok for me to own something that cost ~$500? Cue me beating myself for 6 months about this. \n\nFinally, husband says \"I am pretty sure it's still under warranty, why don't we send it off for repairs?\" \n\nGreat idea! So I package it up real nicely, and take pictures the whole time to document it all in case it gets lost in the mail or something. I push myself to deal with the hectic chaos of the post office, and I actually mail it out.\n\nAnd then today I get an email from the repair place telling me it's gonna be ~$100 to fix it. \n\nSo I have a panic attack and start crying because I feel like it's my fault that this isn't going the way we expected. It should be under warranty but maybe it isn't and they didn't seem to think so(I mean, they didn't mention it, but they are supposed to check that the repairs are under warranty as soon as they get it in). So basically I feel like a moron for all of this. I wanted something dumb and expensive, and I got it, and since I am not supposed to have luxuries(my FLEAS), it was broken, and when I again tried to fix the problem, I just made things worse by making them more expensive.\n\nAnyway, I was explaining all of this, via Google Chat, to my husband and it wasn't until I was typing it all out did I realize that my feeling this way is because of my shitty narc family. And then my husband says to me \"You should never feel guilty for receiving a present.\" And wow, again, that was a crazy realization. \n\nSo yeah. I am trying to convince myself that I do deserve things, and trying really really hard to learn not to beat myself up. It's hard.\n\nAdditionally, at first, I never connected this feeling with my abusive family. I guess I just thought of it as a universal truth. \"I don't deserve things\" I just thought it was the truth. But in examining why I feel that way, I've realized it is all connected to them. It's so obtuse. I am finding more and more all of my mental issues are related to their abuse. I have a therapy appointment tomorrow, and boy howdy do I have a lot to talk about!",
        "created_utc": 1452816540,
        "upvote_ratio": ""
    },
    {
        "title": "Wondering what I should do in my situation...",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/40zxzc/wondering_what_i_should_do_in_my_situation/",
        "text": "[deleted]",
        "created_utc": 1452809697,
        "upvote_ratio": ""
    },
    {
        "title": "There isn't enough evidence for a criminal case. :(",
        "author": "SeaTurtlesCanFly",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/40zkz4/there_isnt_enough_evidence_for_a_criminal_case/",
        "text": "[Previous post here.](https://www.reddit.com/r/LifeAfterNarcissism/comments/403q1i/nfather_sent_me_a_package_he_violated_a/)\n\nI've had a week of playing phone tag with a local detective and a court advocate.  Because n-father didn't sign anything in the package he sent, it isn't enough evidence for a criminal case.  So, nothing is happening now.  All that has happened is that a report was made and I will get a copy of it for my records.\n\nThe advocate says that I can, however, use this record in a case to get another restraining order when my current one ends in about 11 months.  I can use all the things that I haven't been able to use... the fact that he was trying to whisper to me in court last time we were there, the letter he sent to my husband during the emergency restraining order before the first court date and this latest package.  Whether I will be given another restraining order, nobody knows.  We can hope. \n\nI am so very disappointed and I feel sick that he is getting away with this.  He probably asked a cop friend exactly what to do so he can get away with this.\n\nBecause he used his therapist's address to send the letter and I previously sent her a registered letter that she signed for demanding that she never contact me again in any way, we are now going to report this to whatever ethics board we can.  Even if she had nothing to do with this, I want this therapist to know that he is using her this way and, ya know, maybe she should fire him as a patient or something.  \n\nThis is so disappointing.  I feel like I'm going to throw up.  :(  Fuck.",
        "created_utc": 1452805063,
        "upvote_ratio": ""
    },
    {
        "title": "[Advice]How do you handle someone new who triggers your N-sense?",
        "author": "Crossswampfast",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/40ziqw/advicehow_do_you_handle_someone_new_who_triggers/",
        "text": "Forgive phone typing, please. \n\nI know many ACoNs develop a sort of N radar for new acquaintances, usually after too many abusive situations. I don't often get a clear mental caption reading, *Warning: Cluster B at 200 meters and closing* but I do pick up a caution warning. \n\nWhich is fine in social acquaintances, but in business, it gets messier. I've got one in my professional sphere right now who is just hitting every warning sensor I have -- wants to be besties, go out socially, asks increasingly personal questions, seriously over shares, talks about others with derision, seems to expect others to handle everything for her (like secondary research unrelated to the shared scope). For the moment, I have to work with her, but she just does not get hints or even direct \"that's really none of your business.\"  \n\nI know I'm being even more standoffish than usual (I am really reserved per normal -- FLEA) and somewhat avoidant, but seriously, I can almost count on an anxiety episode after an interaction -- either panic or mild dissociation where all I feel capable of doing is diving into a comfort video game or book. \n\nThis one will go away within a couple weeks to a month, but I cannot spend the rest of my life refusing to work with people who exhibit similar behaviors to the Ns I have known. My therapist is skeptical of my spidey-sense, and may have a point that I overreact and thus set up circumstances for what I perceive as N behavior, but is really just bewildered strangers I keep at an extreme distance. \n\n**Edited to add:** phone-typing induced brevity made me unclear. Skeptical should read \"offered an alternative viewpoint\" and \"overreact\" should read \"am sensitized to N behavior\". She wasn't dismissing me. This is not a matter where I'm non-functional; it's a matter where I want to widen my margins of error to better compensate for my fragilities. ",
        "created_utc": 1452804249,
        "upvote_ratio": ""
    },
    {
        "title": "Grew up with Narcissitjc",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/40yy11/grew_up_with_narcissitjc/",
        "text": "[deleted]",
        "created_utc": 1452797049,
        "upvote_ratio": ""
    },
    {
        "title": "From r/AskReddit: What rides would you find at an \"abusement\" park?",
        "author": "deflated_inferno",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/40wht0/from_raskreddit_what_rides_would_you_find_at_an/",
        "text": "the popular posts on askreddit are frequently things that i don't participate in, because of my life experiences separate me so much from regular people. when things like \"when did you lose your innocence\" or \"what lies did your parents tell you\" make the front page... hah. give me a break.\n\nanyway, dark humor helps me cope. and this question is up our alley. anyone have any dark jokes or sarcastic answers to share?",
        "created_utc": 1452754042,
        "upvote_ratio": ""
    },
    {
        "title": "Recently received recognition and a bit of notoriety...NMom must have found out as I've been card-bombed despite NC.",
        "author": "RighSideUp",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/40unkn/recently_received_recognition_and_a_bit_of/",
        "text": "NC means nothing to her and I've kept the cards as evidence.  I asked a friend for some legal advice so I can start looking into my options to get some assistance to have them to leave me alone.  Seriously - she couldn't have sent these in time for me to get them before my therapy appointment?\n\nThe cards had such stupid things inside...like \n\n* Just saying Hi because I think it is important to stay in touch with those you love\n\n* Missing you and the crazy things we used to do\n\n* Hope your day has many smiles in it\n\n* Thinking of you and hoping every day is amazing for you\n\nThis coming from the same person who 6 months ago after I went to her for support right after I left an abusive relationship and instead of supporting me chose to scream at me, veins sticking out of her neck, face red, head quivering from staining to be as loud as possible.  This person, who \"misses me and wishes me smiles\" screamed to me that I deserved his abuse, I was abusing her and needed to get my hormones checked, I was acting high and mighty (because I wasn't reacting to her ridiculous behavior), she didn't have friends who treat her like that (like what?  Not sure...).  She told me that I had no right to tell NexBF to not talk to her (I told him to stay away from my family after he discarded my brother who had just sent him a gift).  As usual, eDad was there and walked into the other room and did nothing, then later told me it was my job to make up with her in typical coward fashion.  It was like it was 30 years ago and I was 10 years old again.  I had an emotional flashback that lasted 2 weeks.  I remember driving back to my house praying to god I would get hit by a semi and killed on impact.\n\nThat was 6 months ago.\n\nHere's the most awesome part...NMom continues to be friends with my abuser.  She has told me it is my fault because I dragged her into my romantic relationship and obligated her.  No logic there since she only met him a couple times and knew him for a few weeks.  But, she helped him get over me and took him to chemo treatments. Obligation is gone and she still calls him. \n\nNow that I, her daughter, am kicking ass I'm guessing she wants in on the action as she can't even take credit for anything because she isn't in my life...\n\n...or maybe I can look at it from another perspective...Perhaps, I'm kicking ass more than ever is because she is no longer in my life and hasn't been for 6 months!\n\nI think I'm going to remind my brain it's just in a trauma state and go take a bath to calm down...",
        "created_utc": 1452725865,
        "upvote_ratio": ""
    },
    {
        "title": "After hard NC - do you listen to voice mails or not?",
        "author": "BreakwaveCove",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/40um18/after_hard_nc_do_you_listen_to_voice_mails_or_not/",
        "text": "I went hard NC with my immediate family a year and a half ago. I've avoided all contact since.\n\nToday I received two voice mails from a number belonging to either my biological father or biological brother. If I listen to them, I can practice being non-reactive and in \"robot\" mode. If I don't listen, I continue to assert my right to be free of any contact from them. Which one do you feel is most beneficial?\n\nI will post two replies - \"Listen\" and \"Don't listen\". Please up vote the one you choose and down vote the other.\n\nAnd of course I'd love to hear your experience with the two choices.",
        "created_utc": 1452725300,
        "upvote_ratio": ""
    },
    {
        "title": "My dog, my grandmother, and my old job",
        "author": "TarnishedTeal",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/40q2qb/my_dog_my_grandmother_and_my_old_job/",
        "text": "I used to work for a drugstore, and today I had to pick up a new prescription, so naturally, seeing the chance to see some old friends again, I filled it at my old place. While I was there everybody was super excited to see me and we were chatting on what had happened, who left, blah blah blah. I showed them pictures of my new dog and they all got super excited.\n\nOn the drive home I had to drive part of the way on the old road to my nGma's house, where I was living before. And I thought damn, wouldn't it be so cool to show her my new dog!\n\nAnd then I remembered that no, no it would not be cool. She would berate me about buying something I had to be responsible for. Ask me a billion questions and then ignore all the answers. Tell me the dog was ugly or that I was unfit to be a dog parent. And that was after she would berate me for leaving her, my family, being a selfish bitch and a horrible self-centered person who never thinks of anybody else. \n\nAnd I realized, as I sped ever so far in the other direction, that I don't have to do ANY of those things. I can keep my wonderful little dog away from that toxic bitch for all of his little doggie years. I never have to subject myself to her berating me ever again. I love my dog and I would adopt him again in a heartbeat. I am so glad I got out. It was really a moment which confirmed my decision to go NC. ",
        "created_utc": 1452655047,
        "upvote_ratio": ""
    },
    {
        "title": "Feeling overwhelmed today (vent/support)",
        "author": "Retrobebe83",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/40n2sc/feeling_overwhelmed_today_ventsupport/",
        "text": "I'm feeling very overwhelmed today as indicated by my title. So maybe I just need to vent and some internet hugs from the amazing RBN community.  I apologize in advance of this is all over the place. I feel all over the place and not centered at all. \n\nI'm 20 weeks pregnant today with my second child, so I'm sure the hormones aren't helping. I had a terrible migraine yesterday (despite drinking more than enough water) and slept too late in the day. So that was one of the reasons I slept so horribly last night (which is definitely impacting how I feel today). \n\nYesterday we had our ultrasound. My husband took the day off and we brought our 3 year old with us. We get there bright and early (I'm NOT a morning person) and they tell me they don't take our insurance. Well they take the PPO version but not the HMO (which is of course what we have). They also tell me that the hospital (the only one my OB delivers at)doesn't take it either. Add ok top of that that my insurance wants me to pay 20% of labor &amp; delivery and room &amp; board. I don't have that kind of money. It's been rough financially for us the last 2 years as I transition jobs/fields. That's a bit part of the stress. So anyways, my husband gets really upset. Over reacts really. We go to my OB and tell them what happened. I'm super calm and in \"take care of business mode\" (&amp; I'm the one who has anxiety etc). He just keeps getting more and more upset. He starts fixating. I eventually get it sorted out and we are able to go to our sonogram later in the day. But the whole time he's fixating and spiraling and getting more and more upset. All the while I have a massive migraine coming on. We were able to get home for a quick nap for me and the toddler before going back out to the appointment. I was up 15 min before we leave and remind him we are leaving soon. He snaps at me and freaks out (he thought we had 45 minutes before leaving). He's just radiating tension. \n\nMy husband is normally a very calm and steady man. He's my rock. But the last few months (ever since his mom had to bail us out financially) he has been on a downward spin. Every little thing upsets him and then he radiates tension. It either triggers me (hello nfather) or makes me angry. Then I spiral. I keep getting mad at him for not finishing chores. He won't finish a task and it is driving me nuts. It's hard for me to do a lot bc I'm pregnant, exhausted and have a weird work/school schedule. I have to rely on him a little more for everything. I can't even bend over or get up with out getting dizzy. Normally this is fine and that dynamic works for us. Just the last few months he's been wound so tight. I think his mom bailing us out triggered a lot of his daddy issues (his dad abandoned him when we was a baby and he's vowed to be a better father and provider). \n\nI feel like if anything is gonna get done (right) I have to do it. We came into some money this month and have a chance to catch up on bills. Who is doing that? Me even though it gives me massive anxiety. Then I tell him what we are doing &amp; he messes up a lot (uses the wrong card or thinks there is money available when it's spoken for other things and spends it). He doesn't do it on purpose but he gets absent minded. It makes me angry bc he's a grown man and I shouldn't have to do this on my own or act like his mother. I've been trying for ages to why us to both do it but it just hasn't worked and right now is too sensitive for screw ups. We finally have a chance financially and I don't wanna mess it up. After we catch up, we are going back to partners in finances. But then he gets mad at me when I make sure he uses the right card. It's frustrating.  On top of it,  trying to find a better paying job but no luck so far. \n\nLast night I tried to talk to him about how angry he got and how it upset me and he shut me down. He knew it upset me so this am I got an apology email and how he thinks he has anxiety and is avoiding/getting annoyed by things. Which I agree with to a certain point. I offered therapy for him/us and he's open but was very vulnerable about the whole thing. He recognizes his behavior and how its influencing me and our son. He's willing to do something about it but is processing still about it. This is all good news but it's just a lot especially on a day I got no sleep and am working 11 hours. \n\nI'm worried about the new baby coming and how he's gonna handle a new baby and a toddler in this state. I hate living like this-walking on egg shells or getting angry. Too many triggers here. So I just feel very overwhelmed. There is other minor stuff going on too (like overbearing friends, disappearing friends, needing a better job, feeling like I suck at my new field/this job, etc). I just wanna get back to good. \n\nTL;DR: my husband hasn't been himself bc of stress the last few months and today he finally realized it/how it's trigger me and effecting our son. Of course today I've had no sleep, am 20 wks pregnant &amp; have a long, tough workday. Feeling off centered and needed to vent/get hugs",
        "created_utc": 1452615930,
        "upvote_ratio": ""
    },
    {
        "title": "Should I \"disrespect\" my old N-mom and ask for justice in the division of property left by my father?",
        "author": "Lungano",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/40mb10/should_i_disrespect_my_old_nmom_and_ask_for/",
        "text": "My enabler dad died more than 10 years ago and N-mom never proceeded with the inventory, despite she says she will. Most of the family properties were inherited by her from her parents, and enabler dad did his best to waste it, but a reasonable amount still remains, which allows her a more than confortable lifestyle. I could legally demand the opening of the inventory according to my country law, to at least be aware of my share before she burns everything with N-sister, but I´m afraid of the huge reaction it will provoque from them, who have been carefully spreading the idea I am an unreliable and irresponsible loser along the years. I know I will look greedy  and insensitive to other people - they´re beloved by friends and family and have a virtually endless army of flying monkeys - and frankly I´m not sure I can cope with more gossiping, attacks and rejection. By the other hand, I´m 53 now, with a unstable professional status and my husband has been diagnosed with Parkinson disease. We will need all the money and safety that we can get, especially because we dont have children or other close family.\nSo I´ve been struggling with this decision: should I face their rage and ask the inventory myself, or should I simply protect myself from their poisonous contact, even at the price of being deprived of my rights? What do you, experienced Acons, would do?\n",
        "created_utc": 1452602621,
        "upvote_ratio": ""
    },
    {
        "title": "My life right now",
        "author": "peturbingprism",
        "url": "https://imgflip.com/i/x86ka#2ajbQGsqoYAiODME.16",
        "text": "",
        "created_utc": 1452602267,
        "upvote_ratio": ""
    },
    {
        "title": "Use or Abuse? (Trigger warning: sexual content)",
        "author": "Nuh-uhh",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/40ktw9/use_or_abuse_trigger_warning_sexual_content/",
        "text": "I know that the answer to this question is \"it doesn't matter.  The relationship isn't healthy:  leave\".  Except that I did leave, years ago, and it still bothers me.  Maybe partly because I've never discussed what actually happened.  Anyway, I ask:  Was the relationship abusive?  Was he a narc?\n\nHe did not pressure me to have sex before I was ready, but he used me like a blow-up doll when we did.  (Sex:  lots of foreplay until PiV at which point:  his sex -&gt; his orgasm -&gt; his nap -&gt; his snack.  No exceptions.)  He seemed convinced that he knew exactly what a woman wanted in bed (not PiV), had it down to a science, could have written a lab manual with exact times and all. It really didn't work for me, especially as it became clear that it was not alterable in any way, shape or form.  He preferred to believe the problem was my hang-ups, rather than consider the possibility that he didn't have a perfect one-size-fits-all program.  So sex became entirely about him:  all suggestions that I made were judged entirely in terms of whether or not he thought he would enjoy it.  \n\nThis went on far longer than I care to admit, with many discussions (calm, quiet, on long walks far from the bedroom, &amp; always at my instigation) where my concerns were discussed, and he agreed that it was unacceptable and promised it would never happen again.  But nothing ever changed.\n\nOverall, he seemed to have a very dependent personality &amp; tried to push me into being more of a mother to him.  (Which I resisted:  strongly!)  I could picture him taking on the role of 'househusband' which would have meant I'd be working, cleaning the house &amp; disciplining the kids.  My hopes &amp; dreams weren't considered (admittedly, I was too codependent to give much voice to them).\n\nSo:  was it abuse?  Or just use?  Is it possible to 'abuse' someone who's too much of a doormat to get up off the floor?  Was his seeming complete unawareness that I'm a complete human being with feelings &amp; hopes &amp; dreams, etc, a sign of narcissism?  (He wondered if he might be BPD.)\n\nAm I being reasonable in my belief that if I can just put a label on this, I'll be able to box it up and leave it on the shelf of my past?\n\nSorry that this was rant-y:  I really needed to get it off my chest.  Thank you in advance for any advice!",
        "created_utc": 1452572193,
        "upvote_ratio": ""
    },
    {
        "title": "Happy Post!! I'm nothing like my nFamily!!",
        "author": "UptownFluff",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/40kqk9/happy_post_im_nothing_like_my_nfamily/",
        "text": "I was scrolling on facebook and one of my high school friends who has been happily married to her high school sweetheart just posted pictures of her pregnancy tests and announced she was having a baby. I had not talked to the girl much since high school, but I honestly cried because I was SO happy for her, because I knew that, based on her fb posts, that is what she always wanted. To have a happy family complete with cute baby!\n\nand in that moment, I realized, I'm nothing like my nFamily. I used to hate that I had feelings because they always said I was too sensitive, but if my emotions can get me to feeling so happy for someone I haven't spoke to in years, then that's a good thing.\n\nIs it just me or has anyone else had a small \"aha\" moment when you knew you weren't going to turn out just like them?",
        "created_utc": 1452570806,
        "upvote_ratio": ""
    },
    {
        "title": "Does anyone else struggle with explaining to people why being \"independent\" is so important?",
        "author": "worriedaboutlove",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/40iq4f/does_anyone_else_struggle_with_explaining_to/",
        "text": "I'm 23, and currently unemployed (after doing a lot of temping recently). I live with a nice uncle, who, while not an N, apparently had no idea what went on in my household.\n\nWe often have arguments that stem from him asking me what I want to do with my life, and me saying that I want my next move to be a stable, non-temp job so that I can move out on my own (and get off my parents' health insurance, further severing ties between me and them).\n\nHe is consistently unimpressed with this answer, and he is certain that this is why I don't have a \"job I want\".\n\nBut here's the thing. I'm taking things slow. At this moment, the job I want has nothing to do with the duties, but what it gives me. That is, the ability to depend less (financially) on my parents. The ability to have a roof over my head that I am paying for, and don't have to worry about getting kicked out of (I've been essentially staying with relatives since I went LC)\n\nThe reality is, at least for me, is that I have no more mental energy to expend on \"following my dreams\", until I have a more stable living situation. Am I wrong for that?\n\nI am just feeling incredible pressure/fear, right now, and I'm not sure if what I am feeling is justified, or if my uncle is right, or if he is simply not well informed enough about the situation.\n\nAny perspective from you folks would be nice.",
        "created_utc": 1452544414,
        "upvote_ratio": ""
    },
    {
        "title": "The ultimate escape dream",
        "author": "Sirenemon",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/40ht4x/the_ultimate_escape_dream/",
        "text": "Ever since I've gotten out of the house, I've had \"escape dreams:\" running, jumping and flying to get away from \"something,\" or more obviously my parents (Nmom and Edad). Ever since I moved across the country and became NC they've been happening much less frequently, but the one I just had was really something else.\n\nI was back in my parent's house, along with my younger sister. I said something that upset them, so they sent me to my room for the day with only one of those packs of crackers you get for free with soup. With my shoddy power of the law (you can't force someone 18+ to be with you or limit what they're doing like that) I finally enacted my plan to escape that I've had since middle school.\n\nI packed up all the stuff I cared about in my luggage, took the screen out of my window and got onto the roof, which is just one story (the garage). I guess it wasn't as sneaky as I thought it'd be because they heard and my sister saw me as I was running away.\n\nMy dad came out of the house to chase me, and as the cops showed up, he threw a stick of dynamite at us????? Luckily no one got hurt but my parents got arrested. They got charged with terrorism (for the dynamite?) and false imprisonment and I was free to get out of there.\n\nI walked to the nearest bus stop and on the way I ran into some of my friends from college and my new state. I told them what had just happened and they were really happy to me. I woke up knowing that I was going to my current, safe home and that my parents wouldn't be able to get me anymore.\n\nIt was weird, because normally escape dreams end with me still running or me being \"caught.\" But this is the first time I've escaped and my parents got \"justice?\" I'm still not sure why my Edad was more, well, evil, and why my sister was helping them out, but I know that, no matter what, where I am now is safe from my parents and surrounded by friends.",
        "created_utc": 1452533586,
        "upvote_ratio": ""
    },
    {
        "title": "Why?",
        "author": "TheTartanDervish",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/40fdz8/why/",
        "text": "Why do I always think of the right words to say to my really loved ones at 1am? Why can't I say them out loud? Why does it hurt so much to heal?",
        "created_utc": 1452491639,
        "upvote_ratio": ""
    },
    {
        "title": "Was he a narc?",
        "author": "weirdnessthrowaway",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/40f42n/was_he_a_narc/",
        "text": "I was kind of with this guy for a while, but interacting with him was really hard for me. Ever since two relationships with narcs (or at least people who had narc traits), I have been very hesitant in getting into relationships with anyone else. I believe I am, for whatever reason, attracted to N types. \n\nWe texted every single day for a couple of months, I'm not sure if this was just him being himself/social/friendly or if I was a method of supply.... ( I probably shouldn't be thinking of things in these terms anyways) \n\nRegardless, I felt some minor ghosts of red flags come up, and I'm not sure if I'm imagining them or if they're real. He has been critical in the past \"come on weirdnessthrowaway, I thought you were smarter than that\" and stuff like that. I was never able to fully trust him, though given the time, and fearful of relationships, especially of narc ones, I'm not sure if I would have been be able to trust anyone... or maybe i'm just making an excuse for my apprehensions. \n\nI made him take some psych quizzes just for fun, and these were his results:\n\nDark Triad test \nNarcissism- 2.6/4, 40 percentile\nMachiavellianism- 2.8/4, 51 percentile\nPsychopathy- 1.7/4, 14 percentile\n\nNarc inventory test \nscore was 19/40, higher than 75.8% of the sample.\n(Us university graduates generally score 15.6, US adults tested in 2009 scored 15.3, US celebrities score 17.8)\nThis test is VERY black and white, though.",
        "created_utc": 1452486872,
        "upvote_ratio": ""
    },
    {
        "title": "My family encouraged people outside the family to abuse me, and encouraged me to be friends with/date these really fucked up people. How does this sound?",
        "author": "larry_appleton420",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/40exn0/my_family_encouraged_people_outside_the_family_to/",
        "text": "Hello everyone, I'm kind-of peeking my head out of the \"family bubble\" I've been living in, and I would hugely, greatly appreciate some outside perspectives on some of the stuff I lived through. Like, this is the stuff that's been normal and acceptable to me for my entire life. I'm in my early 30s now and considering going no-contact. They're still just as fucked up to me now as they have been... nada's changed. Anyway, here goes...\n\nWhen I was a kid my mom used to make me be friends with these really fucked up people. \n\nThere was this one kid who was abusing the shit out of me, he was the son of someone she wanted to be friends with. I told her about all the fucked up shit this kid was doing to me, but not only did she not care, but she treated this kid like he was family, for years, until I left for college. He'd humiliate me in public, he'd make up lies about me and spread them around to people, he'd act like my friend and then use the things I told him in confidence to embarrass me in front of other people. He was a real rat bastard. One time he told me \"I keep my friends close, and my enemies closer.\" And this is the kid my mom memorialized as one of the family, with pictures and everything. My brother used to hang out with this kid and they'd bond over tormenting me.\n\nAnother kid my parents tried to get me be friends with was this kid who would mutilate animals in the woods. I remember learning about him because I wanted to know who the asshole was who was murdering all of the frogs. Apparently it was this kid who my parents tried to make me be friends with; fortunately I only had one playdate with this budding sociopath. \n\nOne time I was kidnapped and tortured by my last \"friend\" and his sociopathic new friend; I had to escape from it in like a thriller movie. It wasn't childhood japes, either, that latter kid ended up going to federal prison for a few years for attempted murder, he was a scary dude. And when I told my parents, they thought it was hilarious. Which isn't surprising considering they made me be friends with these sociopathic little assholes. \n\nMy mom also encouraged me to date these really fucked up, cruel women. One girlfriend tormented me daily, and my mom knew this and told me I should marry her. I'm glad I didn't, because I heard she cheated on her current husband with about 15 guys and her husband was losing his mind. \n\nAnother girl my family encouraged me to date was this woman who would fart in my face, force me to have sex with her, and she gave me an STD that she then blamed on me! My mom threatened to disown me if I broke up with her, and my extended family liked her, too, and they saw her mistreating me. I was an idiot for listening to them, she was the last girl I ever asked out, and that was over 14 years ago! \n\nThe stories could go on and on and on ... I've left out the worst of it, really. Does this sound normal to you guys? Because I've been living in this bubble and I've learned that these really sick, abusive people are normal, and that I deserve that treatment, and I'll get my family's approval for letting people abuse me. But I've seen that it's actually incredibly dangerous for me to go along with it, like, potentially life threatening.\n\nThis is not OK, right?",
        "created_utc": 1452484002,
        "upvote_ratio": ""
    },
    {
        "title": "Does this sound normal to you guys? I'm looking for outside reactions to what my family sounds like. I'm trying to break the \"family bubble\" I've been living in.",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/40euqz/does_this_sound_normal_to_you_guys_im_looking_for/",
        "text": "[deleted]",
        "created_utc": 1452482699,
        "upvote_ratio": ""
    },
    {
        "title": "Do I need to write a no contact letter?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/40d6xu/do_i_need_to_write_a_no_contact_letter/",
        "text": "[deleted]",
        "created_utc": 1452459931,
        "upvote_ratio": ""
    },
    {
        "title": "Is there really a life after narcissism? how to keep sanity?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/409ziu/is_there_really_a_life_after_narcissism_how_to/",
        "text": "[deleted]",
        "created_utc": 1452402860,
        "upvote_ratio": ""
    },
    {
        "title": "Attention-seeking (long...sorting this out in my mind)",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/409iok/attentionseeking_longsorting_this_out_in_my_mind/",
        "text": "[deleted]",
        "created_utc": 1452394226,
        "upvote_ratio": ""
    },
    {
        "title": "NMom shaped my personality and it's affecting my role in relationships with others... help",
        "author": "blaisebazini",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/407z9t/nmom_shaped_my_personality_and_its_affecting_my/",
        "text": "Hey everyone! I'm moving on from years of emotional abuse from my N step mother and am now basically NC, life is great, my relationship with my dad and siblings is absolutely great, but unfortunately I feel like my entire personality has been shaped by my step mother. \n\nI have two full siblings, and had two step siblings as well. The step siblings were obviously the ultimate GC, but within the context of emotional manipulation, I was the sort of sub-GC she used within my full siblings to play us off each other. It was a relationship in which she made me feel special, and made me rat my siblings out and turn against them, gossip about them in return for praise, encouraging me to kiss her ass for her approval, and that's when she doled out love. But this specialness disappeared when she would then out me as an informant, or snap back to her unreasonable and horrible ways and I'd realise how fucked up she was. But I'd stick in this cycle where I wanted approval so much, I’d betray everyone and try my hardest to please her and build rapport, thinking maybe this time it’d be different- or even disbelieving my previous experience because it just didn’t seem right that such a nice person right HERE could have done that stuff before… only to be let down again and again.\n\nTo the point: this extremely submissive behaviour is replicating itself in my relationship with my room mate. She is horrible and selfish, and has me trapped in this thing where I feel like I need to do everything she asks for her approval and to make her like me, and to ward off outbursts… which always eventually come. Whenever she asks me to do things, it’s that same tone that implies ‘do it now… otherwise…’ that harks back to my step mother so badly. When she seems cold or angry I immediately think… is it me? And immediately try to make her feel better or ask about it. When I can’t do something she asks me to do I feel so fucking GUILTY. She has embarrassed me profusely in front of friends, has shouted and abused me, it’s been wild. But then later I just kinda think… that couldn’t be real, and I again I’m back to trying to please this person by being the cleanest, nicest, most easy going friendly house mate imaginable, and get basically NOTHING in return.\n\nThis person is leaving in a few days, so that’s cool, but I feel like I’m kinda destined to be in this same dynamic over and over again.\n\nI really want to leave this thing. I feel trapped, demeaned, pathetic, and I want to be different.\n\nDoes anyone have any small tips on how to start building a healthier and more self-respecting presence and how to resist authority and stop being so submissive to these kinds of personalities?",
        "created_utc": 1452372088,
        "upvote_ratio": ""
    },
    {
        "title": "Looking for advice: What technique or visualizations do you use for detaching from Nrent's abuse?",
        "author": "RighSideUp",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/407dtt/looking_for_advice_what_technique_or/",
        "text": "Looking to add to my mental toolkit to remove the sting from some of my memories and help with my emotional flashbacks.  Trying to separate the person from the disorder in my head lately has been very difficult and I'm getting triggered by stupid little stuff.  My two go-to thoughts I got from reading and therapy are:\n\n* Imagine Nrents in hospital gowns, laying in a hospital bed with tubes everywhere - because they are sick.\n\n* Picture a 5 year old trying to be a parent.  Remember how 5 year olds played house.\n\nAnyone have any more?  I've used these so much they are starting to lose their effectiveness and would like to change it up to view their BS from a different perspective where it's not personal - they're just fucked up, sick people and it has nothing to do with who I am as a person.",
        "created_utc": 1452363927,
        "upvote_ratio": ""
    },
    {
        "title": "Too shy",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/406pmi/too_shy/",
        "text": "[deleted]",
        "created_utc": 1452354295,
        "upvote_ratio": ""
    },
    {
        "title": "We've been seeing ourselves in the 'fun house mirrors' of people who reflect a warped image back at us. #self-esteem",
        "author": "CottageDweller",
        "url": "http://linkis.com/com/88ZOD",
        "text": "",
        "created_utc": 1452331375,
        "upvote_ratio": ""
    },
    {
        "title": "Sibling Issues",
        "author": "Wildkittten",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/404rwm/sibling_issues/",
        "text": "How do you know if you were the GC? I always assumed I was the GC - everyone always said I took after my NDad. But - I am also the one stubborn enough to decide I don't like how he treats me, and to stop talking to him, and to not feel especially guilty about it.\n\nBut. I had a blow-out fight with my sister. It was over a bunch of stuff, but one thing she said is that NDad thinks me not talking to him is a fun game, and he thinks her not talking to him is a problem that he should change his behavior to solve.\n\nI think she's wrong. I don't think he wants to change his behavior, he is just getting his NJuice from her since she isn't NC. However, it was also very very hurtful for her to say (or him to mean) that NDad thinks my refusal to talk to him after 25 years of abuse is a game to him, but not a game when it comes to her. Is she just basking in the glow of being NDad's best E right now, when I was CG before, or has she always been CG and I was just confused?\n\nCan you guys make sense of what is happening when she said that? I got really really upset and said mean things and I don't know how to pick up the pieces of Sis and my relationship, but I also don't understand the thing she said.",
        "created_utc": 1452312400,
        "upvote_ratio": ""
    },
    {
        "title": "N-father sent me a package - he violated a restraining order",
        "author": "SeaTurtlesCanFly",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/403q1i/nfather_sent_me_a_package_he_violated_a/",
        "text": "My n-father just sent me a package.  There is no doubt it is from him.  He didn't sign it or put his name on the return address, but the return address is his therapist's office and the handwriting is absolutely his.  The package was full of things to let me know that my step-mother died (FEEL SORRY FOR MEEEEEEEEEEEE! - Never mind that I am an abusive asshole who wants to abuse you until you kill yourself!).  \n\nAbout a year ago, I sent his therapist (because he had her sending letters to me to try to encourage me to have contact with him) a registered letter demanding she never contact me again and that if she did that I would do everything in my power to make her face consequences for that behavior.  She signed for that letter.  So, there's this factor as well.  But... she didn't send it (his therapist).  N-father DEFINITELY sent it.  It's his handwriting.  It's information about his life in the package.  \n\nI feel shocked, but I also feel excited.  My restraining order only lasts for one more year.  After that year, I wouldn't feel safe in my own yard again.  This is my chance to get that restraining order extended even longer.  I am calling the office that handles this kind of thing first thing on Monday morning, because **fuck this guy.**  He is very mistaken if he thinks that he can guilt me back into contact, because his wife died.  I am sorry that she died, but I am not sorry for enforcing a legal order that protects me from an abuser.  \n\nFuck.  I feel sick.  I feel hopeful.  I feel a lot.... I am going to feel like a cretin taking him to court over this, but I firmly believe doing so is the right thing to do.  If I didn't have children, I might not bother.  But, I know this guy.  He is very persistent and he is very abusive and he thinks he has a right to my children.  I want my children protected.  I want to feel safe with them playing in the yard.  I am absolutely following this through.  \n\nThe police have been called.  A report has been made.  I am told a detective will contact me within a few days to follow up.  Fingers crossed that this all goes smoothly.  \n\nSupport?  I need support... :-/  \n\n",
        "created_utc": 1452295877,
        "upvote_ratio": ""
    },
    {
        "title": "How do narcissists think? Can we reverse engineer their twisted logic? Did ever love us? Click here!",
        "author": "CottageDweller",
        "url": "http://linkis.com/psychcentral.com/bxOs9",
        "text": "",
        "created_utc": 1452293895,
        "upvote_ratio": ""
    },
    {
        "title": "Validation from my aunt regarding Nmom (TW: abandonment)",
        "author": "BluePetunia",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/4032ms/validation_from_my_aunt_regarding_nmom_tw/",
        "text": "I had to go visit my paternal aunt last night, and since the visit was tangentially related to Nmom, I decided that I would tell my aunt that Nmom was abusive and that I would be maintaining NC; I never want to see Nmom again.  I braced myself for being told that I was taking things wrong, and rehearsed telling her that she didn't have to believe me, but I wasn't going to argue about it.  (After my divorce, my aunt did try to kind of argue with me that Nex wasn't abusive, and she met him all of a handful of times over the five years we were together.)\n\nTo my surprise, she simply stated that even though she felt Nmom loved me in her own way, my aunt thought that Nmom is one of those people who never should have been a mother, that Nmom always put herself before anyone else.  My aunt gave me an example of what she thought was neglectful treatment of Nbro - dropping him off at the mall for several hours on his own when he was 11-12 years old, with $20 (this was after I left home and was no longer available to do babysitting).  Given Nbro's poor maturity level, yeah, it probably wasn't a good idea.  \n\nWell, that validation was a pleasant surprise, and now I'm wondering if any other family members were aware of this or other neglectful behaviors by Nmom and would not dismiss me out of hand for saying that I was abused by her.  It was a relief that someone had seen at least a very small part of what I experienced. ",
        "created_utc": 1452287060,
        "upvote_ratio": ""
    },
    {
        "title": "My side of the story. (Simply a long, much-needed emotional vent about NMom to people I know will understand). TRIGGER WARNING. This is emotionally charged and could be upsetting to read for some. I've sprinkled in a little bitter humor, though.",
        "author": "sorajernz",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/402my7/my_side_of_the_story_simply_a_long_muchneeded/",
        "text": "I'm going to just start from the beginning. I've already warned you that this will be long. (See? Look, I'm already apologizing for venting. That's a FLEA I'm sure many of you relate to...) Okay, here goes.\n\nI moved across the country about four and a half years ago. I did this, in many ways, to get away from the manipulation from my family  (but also for other reasons - to explore, to start over, etc). Last March (around), my NMom suggests that her and my sister (my sister only moved half-way across the country from home...) come to visit me for my birthday (which is in May). (This whole vent will not hop around this much.) (Stop apologizing OP)\n\nI was very excited for them to come visit for my birthday. My boyfriend (who I live with) and I started going over all the places we could take my mom and sister when they came to visit. We wanted to emphasize to my Nmom that WE will pick out places that really show off what WE love about our city, since usually Nmom will already have planned the entire visit with an overwhelming amount of activities that she decides we need to do, as if all of us are tourists. This is because she always has to be in control. \n\nAnyway. I'm very excited for them to come. My mom calls me one morning to talk to me about the trip and I tell her that my boyfriend and I have come up with all kinds of ideas for things that we can do together while they're here, so they can get a real feel for this city the way we have. She reminds me \"Remember, it's not just about your birthday. Your birthday also falls on Mother's Day, and your sister is graduating. It's not just about you.\" \n\nFirst of all, I wasn't even talking about my birthday. And while I already recognized these things and surely planned to fully celebrate both of them while they were here, what a fucking smack in the face to \"remind me\" that it's \"not just about me\". Of course it's not.\n\nThis hurt, and I mentioned it to my boyfriend, but decided I was still very excited to see them. \n\nMeanwhile, Nmom has two (yes two) fiances. Yes fiances. Yes two of them. I don't fucking understand it either. She's had the same two \"serious\" boyfriends for years now, and she plays them both so  skillfully to the point where they think they owe her somehow. I know this probably is not shocking to anyone with an Nmom or anyone who knows any narcissist for that matter, but still - even if it's not shocking - like come on, what the fuck. Anyway, in full on mid-life crisis mode (she's 50) my mom lost an extra lot of weight from running a lot and probably barely eating (she's never been overweight, weight has always been a thing for her) and she starts tanning non-stop. Our ancestors are mainly Irish, we don't tan very well at all. My skin is pretty much see-through to the veins, then burnt. lol. The last time I had seen my mom at this point was about a year prior, we all went on a family vacation (with extended family) and my mom was prancing around in a neon orange bikini even inside the hotel lobby (yes) and she was so tan she appeared to be of middle-eastern or African descent at first glance. At that time, I told her she should stop because she could get skin cancer.\n\nSo my mom gets skin cancer on her face. It's benign. My mom calls me and drops this bomb that she has skin cancer. She lets me freak out about it, she lets me cry about it and tell her I'm so sorry and I hope everything will be okay before she tells me it's an in-and-out procedure, it's benign, they will cut it out and it will only take a couple hours.\n\nIt doesn't take a couple hours. It's deep as fuck. They end up taking a shitload out of her face. They have to do reconstructive surgery on her face to fix it. My mom says they have to pull skin from her shoulder/neck or some shit. They try doing that. It's too tight. They try to do it again. They nail it. My mom calls me tearfully saying she doesn't want to compare herself to 25 year olds anymore. I am 25. I jokingly tell her, \"MEEEE neither\" and we laugh about it, and I tell her seriously, \"Maybe this is a blessing in disguise. It sucks, but looks aren't everything. I'm so happy (FIANCE #1) is taking such good care of you.\" \n\nPlease remember though that my mom is an Nmom. \n\nSo my mom calls me and says she might not be feeling well enough to come out for my birthday, but if that's the case, she will still send my little sister out to visit me since it has been a year since I have seen her. (I haven't been home for Christmas in like four years). I tell her that's totally fine and that would be great to still see little sister (22 y.o.) and that we will miss her but that she should do whatever she needs to do to heal. \n\nCool.\n\nCouple days later NMom calls and tells me, confirmed, she doesn't think she will be able to make it. That's okay, I understand, I love you. We will still have lots of cool things to do with Sister. Nmom continues: \"You know, I was thinking about it, and maybe I will suggest to Sister that she comes to visit me instead of visiting you. She might rather spend some time with me on Mother's Day after this.\" \n\nMe: Wot. I was really looking forward to seeing her, and you go out to see her pretty frequently. We came up with lots of ideas of stuff to do with her, I would really like to see her...\n\nNmom: \"Well I also wanted to talk to her about what her plans are after college\"\n\nme: lol wut, Can't you just talk on the phone about that? I haven't seen Sister in a year...\n\nNmom: \"Well I also don't think she'd want to spend a weekend with you. I mean you and Boyfriend have a small apartment... what if she wants to get away from you?\"\n\nGet away from me? A weekend? Two days.\n\nMe: lol I don't think she'll want to get away from me...\n\nNmom: \"Well I think if she wanted to get away from you she couldn't, she doesn't even have a car.\"\n\nWtf.\n\nMe: Okay, mom if you would rather have Sister visit you, then fine. I thought you already bought plane tickets but, whatever. That's fine. \n\nNmom: \"Well I will talk to Sister and let her decide.\"\n\ncue high school flashbacks.\n\nMe: No, mom. That's fucked up. Do not put her in the middle of this. If that is what you want, just tell her that there has been a change of plans. Don't put her in the middle of a tug of war between us. That's not fair to her. Just tell her things have changed and that's fine. We will work something out later. Don't make her choose between her mom and her sister, that's not right.\n\nNmom: K\n\nI tell my mom that I want to talk to her about some of these things, because I don't feel that I have healed from a horrific high school experience orchestrated by her (this might be a post for another time). I tell her I still have some issues about it and I want to talk to her to work through it. She complies. \n\nWe end up having a long phone conversation, very tearful. I tell her that I feel like I'm afraid to tell her how I feel because she won't take responsibility for it, and that she'll twist around what I'm saying without just relaxing and trying to understand how I feel. I feel like she'll spend all her energy trying to PROVE ME WRONG instead of trying to understand HOW I FEEL. I say that this hurts almost as much as the original pain from experiences hurt. \n\nI reference a weak moment I had in high school where I told her I \"just feel like dying\" and she tells me, \"Oh, OP, if you're going to kill yourself, don't tell anyone, just do it.\" ok thx\n\nI reference a time where I overdosed on the diet pills my nMom very readily gave me constantly, because I, being a dumb 16 year old girl, thought hell - if two does the trick, what does 10 do? 10 makes you see spots, wake up barely able to move your legs, then vomit everything including water - don't take 10. My mom assumes I've tried to kill myself (lol, I would have taken the whole bottle if that was my intention). She looks down at me with a loathsome sneer and tells me \"It's a good thing you've puked so much, they won't have to pump your stomach at the hospital.\" She doesn't take me to the hospital. She doesn't do anything. ok thx\n\nWe talk about how she would tell me when I was younger, \"I love you, I just don't like you.\" How that still hurts.\n\nWe talk about these and other instances. (These are a few BASIC examples of some shit. Again, maybe another post.) Nmom first gently says, \"Listen OP, you were a really tough teenager to raise.\"\n\nRE: teenagers that are easy to raise\n\nlol\n\n(By the way, I relate this to my best friend from HS, who's family I lived with for a while when my nMom would randomly kick me out/change the garage code for no reason. Best friend relates this to HER mother who says, um lol no she wasn't. Case dismissed.)\n\nANYWAY. Here are the tactics my nMom tries:\n\n1. Gently: \"OP, you have to remember, you were a very difficult teenager to raise.\" Shift the blame to me. Typical.\n\n2. Defensively: \"OKAY so I'm a SHITTY parent, is that what you want to hear? Is it? Are you happy now if I say I was SOOOO terrible that you had SUUUUCHHH a bad life because of me.\"\n\n3. Obvious fake crying: \"Maybe I have been an awful parent. I don't know, I've just always tried to do my best, you know? I'm not perfect - ha (irritating fake \"humble\" laugh, you know that shit) - I certainly am not.\"\n\n4. Gently: \"The only thing I really need to apologize for, sweetie, is marrying that awful man\" (My stepfather growing up - horrible alcoholic piece of shit) \"I never should have exposed either of you girls to that man and I'm so sorry.\" Not false, also not taking responsibility for the fact that she A) had her own role in being a POS and B) didn't divorce him until he was bankrupt (not a coincidence obviously) when I was already moved across the country. (She was married to him since I was 3, and says he hated me since then. He was her boss at the time. I DIGRESS.)\n\nYou get the fucking point. \n\nShe tries on every face she can to basically \"win\" this where I see that oh I've just been a sniveling brat for ever saying she's ever done anything wrong, and really, gee, my mom is just great and just so sweet. It's emotional manipulation that I'm sure ALL of you are NOT strangers to. But it's bothersome as fuck when it's obvious to you, when you see right through it. \n\nThe other tactic she tries, that I think is worth mentioning just because I'm sure a lot of you also relate to this too, and it's the hardest one: Making me the villain. I'm the bad guy. This is so common and so heart-wrenchingly painful. Nmom knows how to push my buttons. She knows how to make me lash out and just say something hurtful. Once I do that, she acts like a wounded lamb. On this phone call she refers to that in this way:\n\nVoice is calm, snake-like calm: \"If I have hurt you this bad - without trying to hurt you ... Can you imagine - OP - can you imagine .... how it feels ... when you DO try? to hurt me? Can you imagine how that feels OP?\"\n\nMe: Um yes, obviously, because I learned that from you.\n\nNmom, voice snaps back into matter-of-fact honesty: \"Okay that's fair.\" \n\nMe: Thanks.\n\nI think we all are familiar with a phone call like this. It actually ends on a positive note. It ends not at the end, but with a realization from both of us that there's still more work to do, but it seems like we're making progress, and that's worth something. I feel hopeful. \n\nA couple days later, I get a text from my Nmom that says, \"Wow, your 25th Bday\" (wait I think I've said this whole time I was 25, but was talking about my birthday. Okay it was going to be my 25th birthday, arbitrary... you still get it.) \n\nNmom says, \"When I was your age, my dad was about to kill himself, mom had dementia, and I was about to get cancer.\" (She had ovarian cancer when I was very young.)\n\nI know all of this. This has all been beaten into my head honestly from a pretty young age on. It's only to illustrate how hard she has it. I don't deny it. She's had some tough stuff. For sure. It's no reason to discredit how I've been treated. \n\nOkay.\n\nAbout a day or so later I have a conversation with Sister on the phone, not about anything in particular, just life and stuff we usually laugh about. Don't mention anything about nMom, assume it's already been taken care of and I don't even want to deal with it. Sister is acting weird and becomes extra reactive to EVERYTHING I say. I find this peculiar but am kind of just like, idk maybe she's having a shitty day or something.\n\nThe biggest example of her over-reacting to me is this. I have had a job since I was 15. I've been working as a server at a bar since I was 19. (I'm 25 in case you forgot). My sister (22) has never had a job. MY SISTER HAS NEVER HAD A JOB. (Note, she got one a few months ago though to be fair.)\n\nBut during this conversation, my sister has never had a job.\n\nI start venting (in a way that usually makes her laugh, and is intended to make her laugh) about how much I don't like this other server I work with. Sister cuts me off and says, \"But can you imagine what it's like to be her? To be a server every day, with customers treating you like shit every single day?\"\n\nR U SRS\n\nI literally have my mouth drop open, I laugh uneasily and ask, \"Are you being serious right now? I ...am that. I've been that for like six years. Of COURSE I can imagine what it's like to be a server all day... can you?\"\n\nSister says she can't deal with this anymore and doesn't want to talk.\n\n? ? ? ? ? ? ? ? ? ? ? ? ? ? ? ? ? ? ? ? ? \nI FEEL LIKE I'M TAKING CRAZY PILLS\n\nOkay so I vent to my boyfriend about this, he agrees that the entire conversation is a steaming pile of wut.\n\nI text my sister and ask her if there's anything I have done to somehow offend her or something.\n\nShe says: \"I just really don't like the way you've been treating Mom lately.\"\n\nMy whole world flips upside down and I feel like I could have super hero strength and throw a bus or something for my anger. So basically, while I'm trying to WORK THROUGH ISSUES with Nmom, she has CONTACTED my little SISTER and whatever she has said to her has made my sister upset with ME. \n\nI feel like I could blow the fuck up.\n\nI text my mom and say that this is exactly like when I was in high school, that it's fucked up that she pits my sister against me. I text my sister and say it's fucked up that she never tried to hear my side of the story and that she, as a grown adult, has allowed herself to be so obviously manipulated by Nmom. \n\nI reference a time, the last time I saw my sister in person (still as I write this) when my sister tearfully told me she was so sorry about high school, that she knew my mom was purposefully pitting her against me and that I was innocent, and she didn't know what to do and she sided with mom and she's SO SORRY FOR THAT. That she knew it was wrong and PLEASE FORGIVE HER. I told her \"I never blamed you.\"\n\n\"I never blamed you.\"\n\n\"Please don't hurt about this anymore. I never blamed you.\"\n\nWe hug. We cry. I tell her thank you so much for validating me by telling me this, that she has set a part of me free by doing so. Thank you. \n\nAnd then this, only a year later.\n\n******\n\nNow all of this happened around May. I go off the fucking handle. I decide to drop contact from both Nmom and sister, who I later identify as a GC (Golden Child) and myself as a Scapegoat. \n\nI find this subreddit. I learn more about what's going on. I become more aware of what's been happening. I feel more confident about my decision. \n\nSince then, I have tried to rebuild a relationship with my sister, but to no avail. She isn't who she once was. She's been molded into basically a mini version of my mom. She is always on the defensive when she speaks to me, as if she has been told that I am some kind of evil villain and everything I do or say is intended to \"manipulate\" her. HER WORDS.\n\nME. manipulate HER. It's so upsetting it could make my head spin.\n\nHer and I get into another argument about a week ago about this whole mom thing. That I should grow up and forgive my mother. This conversation STARTS because my sister mentions that she has felt suicidal (I don't know why suicide is such a major theme in my family, I'm sorry). This has been the fourth time my sister had passively mentioned this to me, and I tell her that she should seek therapeutic help. I tell her it's not embarrassing to have those feelings and it's okay to talk to someone, and it takes time, and that I take that very seriously and if she really feels that way that I am always there for her - even if she DOESN'T really feel that way and was just trying to get ATTENTION for saying it, I am HERE FOR HER. I know what it feels like to hurt. I know what it feels like to not be heard. I know what it feels like to feel the need to make a loud noise (me with just angry words, her maybe with suicide threats) to feel like someone's even hearing you. I know that feeling. I'm here with open arms, if only she'll have me. She won't. She has decided that I'm the bad guy, no matter what. \n\nShe tells me about Mom and how I've hurt mom so terribly. I talk to her about her feelings and tell her, \"You know, I wasn't actually threatening suicide, but I once told Mom super exasperatedly 'you make me want to die' or something, and she told me 'OP, if you're going to kill yourself - don't tell anyone, just do it.' I don't think she's the best person to talk to about stuff like this.\" \n\nNow pay close attention to her response, this is where it's kind of interesting:\n\nSister: \"I know. I've told mom I felt suicidal before and she was really dismissive of me, too, but maybe it's because of her history with suicide, like her Dad and stuff, and even our Dad attempted suicide.\" (Yes that's true, wtf, our family. But my dad is a wonderful person who I didn't grow up with but... okay nevermind.) \"But you know what? You keep holding on to Mom being a bad Mom. I have literally talked Mom off a ledge because of that. She told me about saying that to you, and it made her want to kill herself. I have literally talked her off a ledge multiple times because of you making her feel like a bad mom.\"\n\nBACK. THE. FUCK. UP.\n\nFirst of all, I already know this, my mom has threatened suicide to me, too. I think it's an N thing to do anyway.\n\nThe REAL interesting thing here is SISTER'S feelings about this.\n\nSo you're fucking saying, and try to keep up with these inconsistencies here:\n\n1. NMom tells me horribly insensitive thing pertaining to suicide. (Thank God I wasn't actually suicidal, since she gave me a green light basically).\n\n2. NMom tells Sister about this interaction, and asks for sympathy because now SHE FEELS SUICIDAL?\n\n3. Sister later feels suicidal, brings it up to Nmom, who is dismissive of her.\n\n4. Sister does not put this all together and come to the obvious conclusion that Nmom is a sniveling cunt. \n\nSorry.\n\nThat's harsh.\n\nBut come the fuck on, really?\n\nOkay so I tell Sister, I don't want to talk about this anymore. I have hardly spoken to her since. I even sent her a Christmas present before all of this and had to text her to ask her if it came. \n\nSister: \"Oh sorry, I thought I already texted you, yeah it came a long time ago, thanks!\"\n\n...ok\n\nSister somehow has been brain-washed into thinking I am a villain.\n\nANYWAY!\n\nMan, I'm sorry my blood is fucking boiling just typing this all out, but I think it's a good thing to do. Okay.\n\nSo anyway. \n\nOver the past couple days, Nmom has tried to reach out to me. Who fucking knows why. I think she just gets bored and decides she needs to be the center of attention with some drama and just goes out to make that happen. Seriously. \n\nSo she texts me on Tuesday (today is Friday for reference) and says this exactly:\n\n\"Would love to talk to you when it's comfortable for you. Just about what your up to these days. Your call.\"\n\nYOU'RE. What YOU ARE UP TO. Okay that's probably not important but still, okay. Whatever. Anyway.\n\nI obviously don't want to talk to her on the phone, but figure I'll just send her a long text message to tell her what's going on with me. That way it's not brutish or rude but it's also arms length. I tell her about what's going on (very shallow, surface-level, all positive things). \n\nI text her back 10 minutes after her original text, where she says she wanted to talk to me, right? \n\nThen why did she wait over three hours to text me back? \n\nWho fucking knows. \n\nShe says: \"Wow that all sounds fantastic! Very happy for you! :) \"\nMe: \"Thank you!\"\n\nCool. I feel like I skirted by this one in a mature and positive way, that isn't rude, but still says, hey, these are my boundaries.\n\nMy mom texts me again on Wednesday.\n\nNmom: \"I love you OP and wish we could be in each other's lives - miss you\"\n\nSo she has nothing of substance to respond to when I actually tell her what's going on in my life, even if it's just basic \"started a new work out routine, have been studying the Bible, school started again\" whatever. You know why? Because she doesn't give a fuck about talking to me about what's going on. She wants the drama. She CRAVES the drama. \n\nI do not respond because I value my time and emotional energy more than that. I respect myself enough not to bite her fucking bait. Or so I thought. \n\nLet me back - back - back it up here for just a brief second for clarity.\n\nSo in March 2015, I changed my old email that I'd had since high school and that was basically overwhelmed with spam. I went from a Yahoo email to a Gmail account, because it's the future now. I had sent out a group email to my entire family letting them all know. A few months later in May when my mom and I had that phone call where we were trying to work shit out and it blew up in my face, and I texted her pissed off, remember that? (wait of course you do you just read it) Okay well I forgot to mention that she sent me an email to my Yahoo account that I obviously didn't get because three months prior I had changed my email, and hardly got emails in the first place because of spam, which is why I changed it to begin with. My mom texts me to alert me that she sent an email, I check Gmail and am perplexed, then think to scroll through Yahoo and find her email. I'm irritated that she didn't send to new email, but figure at the time it's best not to even remind her because I wanted to keep an arms length anyway.\n\nNow you are pretty much caught up. \n\nSo this morning I get a text from Nmom, again, saying this: \n\"Can we email? I saw a Ted talk (in think it was Ted) you might like. Do you have the same email?\"\n\nThis is so trivial but like, fucking spell check a text that you're sending to someone when it's tense between the two of you. In think? God.\n\nI probably made typos in this angry post anyway and am just going to look like an asshole now, but I don't know. That's nit-picky.\n\nThere are two things I get from this text:\n\n1. \"I saw a Ted talk I think you'll like\"\nThis is like when an ex tries to find any reason at all to talk to you. It's an obvious manipulation tactic and that drives me up a fucking wall. \n\n2. \"([I] think it was Ted)\nYou THINK it was TED? Every TED talk has TED in huge ass red letters behind the speaker THE WHOLE TIME. What do you mean you THINK it was TED? And if you take it so seriously that it reminds you of me, that you think I'll like it, shouldn't you even know what the fuck you're talking about. Okay, maybe that's a nit-picky one too, but it bothers me still. \n\nThis is a habit I think a lot of us have, breaking shit down like this, right? Maybe it's just me. \n\n3. \"Do you have the same email?\"\nWhy are you asking me this? First of all, I sent you an email that said I changed my fucking email last March. Almost a year ago now seeing that it's January of 2016. You did send the last email to Yahoo and I didn't correct you. So either that means you got my email that I changed to Gmail and couldn't be bothered to change your address book, or you're trying to victimize yourself like I didn't tell you I changed my email.\n\nWell, being intelligent, I went through my Gmail emails and searched her name, and found her RESPONSE to me saying I changed my email.\n\nNmomEmail@nMomemail.com:\n\nOk\nLove you!!\n\nSent from my iPhone\n\nI screen-shot this, with the original message below it where I tell everyone my new email. \n\nI sent her this screenshot and then said: \n\"Same email since March 2015\"\n\nI only know it's March 2015 because the email says:\n\"On Mar 31, 2015, at 9:26 PM OP wrote...\"\n\n\n\n\n\nAlright. I've left out a few random details but nothing seriously important, and all redundant to what I've already put into this vent. If you made it this far, thank you so much for reading. I hope it didn't upset you and make you punch a hole in your monitor. \n\nI love reading posts on this subreddit because I finally feel like I'm surrounded by people who understand. It can be hard to explain to someone who does not have an N parent what it feels like, especially when they have seen this N parent in public, who acts like a fun social butterfly, like she's the life of the party, and nobody understands what I have against her. It can be enough to drive you insane. My heart goes out to all of you when I read your posts, and sometimes I comment just to tell you that I relate to what you have said. I love reading words that I didn't think to write, but that relate to the pain I have felt so clearly and so well. \n\nThank you all for sharing your stories, and thank you for reading mine. &lt;3 We have each other, and ourselves, and we will come out stronger in the end because of that. So much love. Thanks guys.",
        "created_utc": 1452281461,
        "upvote_ratio": ""
    },
    {
        "title": "Nosebleeding &amp; my nmother. Correlation",
        "author": "ShojiAn",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/4029ji/nosebleeding_my_nmother_correlation/",
        "text": "So I have been watching [video about Autism and anxiety](https://www.youtube.com/watch?v=rPD_yzMHJls). After 32:00 she mentioned that nosebleeding can be caused by anxiety. When I was younger I had them a lot. They stopped six years ago when I went to university in different city. There is a correlation between living alone and nosebleeds. I think I can say that there is a causation too",
        "created_utc": 1452276799,
        "upvote_ratio": ""
    },
    {
        "title": "Emotional Labor - a really great read not just for women, but also for ACoNs",
        "author": "BluePetunia",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/40294h/emotional_labor_a_really_great_read_not_just_for/",
        "text": "Just found out about this yesterday, and I couldn't stop reading it.  MetaFilter had a fantastic discussion thread about emotional labor - taking care of people emotionally, in all the big and little ways that entails.  Here's a link to The Mary Sue article, which has links to the original thread, The Toast piece that inspired it, and a 70 page PDF summary.  \n\nhttp://www.themarysue.com/emotional-labor-pdf/\n\nMostly this hit me from a female standpoint, for obvious reasons, since this is something that women are expected to just do, especially for men.  It also struck me, though, that not engaging in emotional labor is one of the ways that Ns are abusive, and the result isn't just emotionally scarred children, it's also children and adults who don't know how to engage in emotional labor or understand its value.  I have found myself sometimes observing \"what?  women do that for men?  why are men such dependent little babies?\" because Nmom didn't do it for me nor did she really do it for my dad or stepdad.   \n\nSo I thought I'd share.  I think it's a great read for any ACoN.  \n\nEdited for clarity. ",
        "created_utc": 1452276656,
        "upvote_ratio": ""
    },
    {
        "title": "How do you reconstruct your personality if most of what you developed as was a result of defense mechanisms?",
        "author": "saddetective87",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/402219/how_do_you_reconstruct_your_personality_if_most/",
        "text": "I know now why there are times I feel so out of step with people in social situations - most of my personal behavior developed as a series of defense mechanisms. That ... sucks.\n\nhttp://www.eric.vcu.edu/home/resources/pipc/Other/Personality/Table_Defenses.pdf",
        "created_utc": 1452274143,
        "upvote_ratio": ""
    },
    {
        "title": "Living",
        "author": "andresmaria",
        "url": "http://truthnetmedia.com/living/",
        "text": "",
        "created_utc": 1452269396,
        "upvote_ratio": ""
    },
    {
        "title": "Not wasting energy on people who aren't coming from a place of good faith",
        "author": "WiseEpicurus",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/401413/not_wasting_energy_on_people_who_arent_coming/",
        "text": "This issue has come up again and again for me for good reason. I've been so conditioned to try desperately to work miracles in making the willfully blind see. It's what I had to do as a child to survive.\n\nLife really is too short to waste energy like that. If the camel isn't thirsty, I'm not walking 5 miles to the nearest water source. I'm just gonna relax in the shade, so to speak.\n\nIt's easy to intellectualize things like this for me, but experiencing trial and error and all the emotions that come along with it is the essential ingredient for true growth.",
        "created_utc": 1452260368,
        "upvote_ratio": ""
    },
    {
        "title": "Trying to Make An N Determination (Advice)",
        "author": "Adastria",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/4007iw/trying_to_make_an_n_determination_advice/",
        "text": "Hello fellow ACoNs and other N sufferers. I have a serious question which is going to take a great deal of detail to explain. I have been NC with my family for over 10 years (mother is N, BPD, alchoholic, sister is N, father is E). I am in my 40s and I married less than 3 years ago. I found out, after the fact, that my husband's family has mental issues which include BPD and Aspergers.\n\nHere is where the question comes in. I actively work against seeing Ns behind every tree and in every shadow. I use all my resources to asses each person and to be fair and address situations before I become too uncomfortable. Having said that, I am having a really hard time not labeling my SIL as an N, and actively working to reduce her impact on my life. My husband's entire family lives on the opposite side of North America from him except for this sister. She lives within hours of us and we see her quite frequently and, to be honest, she triggers all of my defense mechanisms within hours of us being together.\n\nI am going to list a whole bunch of traits/examples pertaining to her. I realize no one here is a professional but I'd like opinions as to whether or not these things scream Narc, or Aspergers, or just me being a FLEA riddled hag. Please don't bother giving me advice like going NC because this isn't an option. Thanks ahead of time for all your input. Here are the points:\n\n1) She constantly has to cut in and finish people's sentences. She does this to everyone.\n\n2) If I ask my husband a question, or he me, she will jump in and answer before either of us can take a breath.\n\n3) She is constantly correcting everyone about everything. She picks at the smallest of details. \n\n4) She talks to everyone like they are 5. She constantly feels the need to explain stuff that she has no need to explain and she acts as if she's talking to young, stupid children. For example, she joined me and a friend at a zoo. She was constantly running ahead, reading the descriptive signs, and then parroting the descriptions back as if she was all knowing. She talked to us as if we were children in a nature tour group (which she actually does for a living to be fair).\n\n5) If someone says they are trying to do something, or working towards a large goal, she will quickly go online, skim an article or two on the subject, and then act like she knows everything about the subject, while desperately trying to convince said person that they are incapable of succeeding at their goals.\n\n6) She categorizes herself and then harps on the broader details of these categorizations incessantly. I cannot tell you how often I've been lectured about how she's a gender oppressed, victimized, woman or a tortured soul of a middle child.\n\n7) She obsesses over her hobbies and talks about them without any regard for other people. She pushes them on others without any recognition of people having said 'no thank you' or 'that's not my cup of tea'.\n\n8) She keeps up an appearance of being helpful but always has an excuse. Story time: She was staying at our house. I was making a meal for 5 and forgot that she hates mushrooms. I had told her hours before that I was making mushroom rice. She said nothing. Later, when she comes in the kitchen I say that I remembered and had changed the rice dish. She literally snivels that she didn't want to say anything and cause problems and she just wouldn't have eaten. I told her to stop acting like a doormat and speak up when these things happen. She got mad (rightfully) and sulked off. Later, she asked if she could help with washing the dishes. I said yes, please while prepping food. She asks where are my gloves. I tell her I don't have any because I'm allergic to them. She says she can't wash dishes without gloves because she has eczema on her hands (in reality, she's a germaphobe who washes obsessively and causes a rash). I say never mind, nicely, and go back to working. She leaves the room. She comes back and asks if there's anything else she can do. I ask if she can peel the beets. She asks me where my \"gloves\" are. I repeat the former answer. She whines that she doesn't want her hands to get all red from the beets. At this point I tell her to never mind because I'm fed up. This type of BS happens every time she visits.\n\n9) She refuses to use the same dish/utensil twice. She won't drink two cups of tea, in succession, in the same mug, without it being washed. As per 8 above, she \"can't\" wash dishes. She has never bothered to bring herself gloves and I don't have a dishwasher, which she is used to. She is oblivious to the fact that I am constantly washing dishes when she visits. She does volunteer to wipe sometimes.\n\n10) This one needs an example: Large supper. Table is set with name tags due to children. She discovers that she is not on the end of the table. She states that I should move her because she is left handed and will elbow the person next to her. I say that there is plenty of room between each chair and there shouldn't be a problem. I also say that each person is seated where they are for a reason. She gets agitated. She repeats her former objection 6 more times. Each time she rewords it hoping to get the result she wants if she just can get her point across. Each time she gets louder, talks faster, gets more visibly frantic, and gets more shrill. I finally tell her to settle down. She yells that she doesn't need to as she is not upset. I proceed to ignore her and she paces around the table like a trapped animal. She does not touch the name tags or say anything else. I'm not sure if this is a control issue or a neuroticism.\n\nThis is a woman who thinks she knows more than almost everyone but never forms her own opinions. She gets all of her opinions from select authority figures, bad internet sources, and a few highly aggressive female friends who shape her view of the general populace. It is this dichotomy that keeps me from pigeonholing her as an N. So....I'm asking for opinions. I need to understand what I'm feeling and reacting to before I can deal with it rationally. ",
        "created_utc": 1452240538,
        "upvote_ratio": ""
    },
    {
        "title": "Need help defusing my 1st flying monkey attack",
        "author": "LionessSekhmet",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/3zxh9s/need_help_defusing_my_1st_flying_monkey_attack/",
        "text": "A bit of background: I formally went NC with my NMom in May 2015.  For awhile, she respected my wishes, and I honestly thought there was a chance that she would just let it go and I would never have to deal with her again.  Fat chance.\n\nA little bit more context: yesterday I had some very minor surgery on my sinuses.  I told my eDad the date of my surgery, which I now realize was a mistake.  Because yesterday evening, when I was feeling like crap and recovering from the surgery, I get this email from my eDad's email address.  (All names have been replaced with generic labels.)\n\n&gt; \"LionessSekhmet,\n So your sister's family will be here over MLK weekend, 15-18 Jan. Your brother is wanting you to get to see his newborn daughter and everyone will be here then. So, your Mom says she will buy you and your spouse plane tickets if you would come down and be here through that weekend. Your brother really would like ya to come for a visit, had hoped you would be here around Christmas.\nThat's less than 2 weeks away, so let me know.\n\n&gt;Love Ya,\nDad\"\n\nThis email has it all.  Guilt tripping about not visiting over Christmas.  Using my brother, with whom I still have a relationship, to guilt trip. NMom offering to pay for the tickets, which means that I would then \"owe\" her during the visit.  Imposed time pressure: \"You have to make the decision *now*! It's only 2 weeks away!\"  And it was sent right after my surgery, which I'm sure is no mistake, but didn't ask at all about how the procedure went.  I wonder if she thought I would be hopped up on pain meds and might say yes while in a state of confusion?  Christ.\n\nI also have this weird suspicion that she wrote the email and not my dad.  I don't know why, but it just sounds more like her.  And it was sent from the iPad, which they both use.\n\nIf it is from my dad, this is the first time since NC that she's called in a flying monkey.  (She sent me a Christmas card, but I just threw it away unopened.)  I hate to see my dad being used this way because he is a good guy, he's just *so* passive and emotionally unobservant.  I don't consider him a co-abuser, because the few times my NMom got him involved directly, he actually took my side against her.  But it seems that I can't tell him too much personal information either, because he will share it with her.\n\nI'm definitely not going to say yes.  I just need help figuring out how I should say no.  Part of me is just tempted to send a one-word reply: \"No.\"  But I do have a good excuse too, since my husband is looking for a job right now and needs to be around for interviews etc., so I could be more \"polite\" and say that as an excuse.  I guess it depends on how honest I decide to be with my eDad.\n\nI'm also thinking of contacting my brother separately and proposing a later visit, as long as he agrees to not tell my parents about it.  (Unfortunately, they live in the same town.)  At the same time, I have the fear that he might agree and then still end up telling them, because he still has a relationship with NMom and she is very, very good at emotional manipulation, and then I'll end up being ambushed.\n\nI'm looking for advice.  Should I say no bluntly, or give an excuse?  Should I try to visit my brother who just had a kid, or is it too risky?  Because I really, really don't want to see or interact with my NMom in any way.",
        "created_utc": 1452200289,
        "upvote_ratio": ""
    },
    {
        "title": "second ballet costume update from uber-blonde :) [pix]",
        "author": "uber-blonde",
        "url": "http://imgur.com/a/q7yjk",
        "text": "",
        "created_utc": 1452189726,
        "upvote_ratio": ""
    },
    {
        "title": "Thought on my nSister",
        "author": "uber-blonde",
        "url": "https://www.reddit.com/r/LifeAfterNarcissism/comments/3zt33c/thought_on_my_nsister/",
        "text": "Tonight I realized telling the truth about my nSister makes me uncomfortable. I feel the same about my nMother.\n\nIt's not because someone might question me, or that anyone might not believe me. I know what happened and I don't care what other people think.\n\nIt's not because I'm embarrassed to admit my own family treated me worse than a prisoner of war. It sucks, but it's not the end of MY life. I've moved on.\n\nIt's not because I think they were wrong or I can't admit it. I KNOW they were wrong and they are awful people. I've always known that.\n\nIt is uncomfortable because in the back of my mind, I am allowing space for my nFamiy to come to their senses and repent? stop? None of which will happen, I am assured by my therapist.\n\nIt is the reason I waited until after my nMother's death to get in therapy. I was hoping she would just STOP and tell me how she was sorry and she loved me. None of which happened. She died, blaming me (I'm sure) for her miserable rotten life. Just as my nSister undoubtedly blames ME for her misery.\n\nToday I was messaging with another redditor on this sub and they are helping me to fully understand my nSister will NEVER change. She will never stop blaming me. Thank you, fellow ACoN.\n\nEvery day I am a little stronger. And every day I get a little healthier. \n\nWoo Hoo! :)\n\neta: paragraph, damn auto correct \"redactor\" wtf",
        "created_utc": 1452130407,
        "upvote_ratio": ""
    },
    {
        "title": "Who doesn't freak out cleaning when narcissists are coming to visit??? A funny take on the compulsion to clean!",
        "author": "CottageDweller",
        "url": "http://linkis.com/huffingtonpost.ca/5Skgl",
        "text": "",
        "created_utc": 1452117021,
        "upvote_ratio": ""
    }
]