[
    {
        "title": "What is Emergentist Theory of Language Acquisition?",
        "author": "itsmeeeskai",
        "url": "https://www.reddit.com/r/linguistics/comments/9ejzko/what_is_emergentist_theory_of_language_acquisition/",
        "text": "What is the difference among Emergentist, Nativist, and Social Theory of Interaction? Does Emergentist theory just summarizes all of them? Is it a more effective theory/model of language acquisition?",
        "created_utc": 1536556903,
        "upvote_ratio": ""
    },
    {
        "title": "Is there a living language that uses a runic alphabet?",
        "author": "Hidnut",
        "url": "https://www.reddit.com/r/linguistics/comments/9ejise/is_there_a_living_language_that_uses_a_runic/",
        "text": "[removed]",
        "created_utc": 1536552468,
        "upvote_ratio": ""
    },
    {
        "title": "Linguistic Subjectification",
        "author": "Ray1018belli",
        "url": "https://www.reddit.com/r/linguistics/comments/9ei6b8/linguistic_subjectification/",
        "text": "This episode of the Words for Granted podcast talks about the relationship between intensifiers and subjectification from a diachronic perspective. It's a beginner-friendly entry point into a complex topic!\n\nhttp://www.wordsforgranted.com/podcast-1/2018/7/31/episode-52-linguistic-subjectification-very-really-literally-etc",
        "created_utc": 1536540821,
        "upvote_ratio": ""
    },
    {
        "title": "Can Chinese write their own language? Chinese characters, even for everyday words, can be hard to recall",
        "author": "zkela",
        "url": "https://www.youtube.com/watch?v=zxHskrqMqII",
        "text": "",
        "created_utc": 1536539259,
        "upvote_ratio": ""
    },
    {
        "title": "Where Does \"Rabbi Voice\" Come From?",
        "author": "RamonaLittle",
        "url": "https://www.nytimes.com/2018/09/08/opinion/sunday/rabbi-voice-origins.html",
        "text": "",
        "created_utc": 1536533617,
        "upvote_ratio": ""
    },
    {
        "title": "Could Lithuanian cases support the Indo-Uralic hypothesis?",
        "author": "RandomAnanas",
        "url": "https://www.reddit.com/r/linguistics/comments/9eg6ly/could_lithuanian_cases_support_the_indouralic/",
        "text": "First of all, [Lithuanian has up to ten cases](https://en.wikipedia.org/wiki/Lithuanian_declension) (even though three of them are nearly extinct in modern Lithuanian). Proto-Indo-European had eight or nine cases, however, a few of them were lost, so their Lithuanian equivalents are posterior innovations.\n\nFurthermore, the new Lithuanian cases are much more regular, e.g. the illative case (the only one that's conserved in nouns, though only in some dialects) always has the same few endings (the singular paradigm always has the same ending, and the plural endings always have -na).\n\nThis definitely reminds me of agglutination, could any of this have to do with Uralic languages?",
        "created_utc": 1536524771,
        "upvote_ratio": ""
    },
    {
        "title": "My niece and multiple language acquisition",
        "author": "Grusinskaya",
        "url": "https://www.reddit.com/r/linguistics/comments/9efc2f/my_niece_and_multiple_language_acquisition/",
        "text": "[removed]",
        "created_utc": 1536518550,
        "upvote_ratio": ""
    },
    {
        "title": "Non-universal sound changes",
        "author": "eriksealander",
        "url": "https://www.reddit.com/r/linguistics/comments/9ee1t2/nonuniversal_sound_changes/",
        "text": "I am under the impression that when a langauge experiences a sound change, it is universal in the language. This principle makes proto language reconstruction possible.  But is this always the case?  I live in an Arabic speaking area where the standard arabic hard \"k\" sound is pronounced as a \"g.\" So for coffee they say Gahweh instead of the standard Kahweh.  It's this way throughout the language except for some notable exceptions.  The words \"Cairo\", \"Iraq\", and other places names with the hard \"K\" sound are said in my area with the  the old \"K\" pronunciation.  \n\nGiven this scenario should I think that:\n\n A. The sound change is in progress and eventually the word \"Cairo\" will be pronounced with an initial \"g\". \n\nOr \n\nB. The sound change is complete but these place names of distant areas have resisted the change.\n\nEdit: clarity",
        "created_utc": 1536508917,
        "upvote_ratio": ""
    },
    {
        "title": "What does early language development indicate?",
        "author": "Orion_Diplomat",
        "url": "https://www.reddit.com/r/linguistics/comments/9edt1r/what_does_early_language_development_indicate/",
        "text": "Delayed speech of course often indicates something is wrong, although in rare cases it indicates extraordinary analytical abilities (Pinker), like how Richard Feynman hadn't uttered a single word by his 3rd birthday. \n\n\n\n\n\n\n\n\n\n\nIf a child is hitting their linguistic milestones well early, what might this indicate? Like if a child has coherent loquacity and/or is speaking regularly in complete sentences at 2 years old?",
        "created_utc": 1536507177,
        "upvote_ratio": ""
    },
    {
        "title": "Sociolinguistic studies on \"expats\" and \"immigrants\"?",
        "author": "bahasasastra",
        "url": "https://www.reddit.com/r/linguistics/comments/9ectr6/sociolinguistic_studies_on_expats_and_immigrants/",
        "text": "Opinions differ regarding what is meant by an expat and an immigrant. Basically it sums up to three ideas:\n\n1. Expats plan to live in a foreign country temporarily but immigrants want to settle down there.\n2. Expats chose to live in a foreign country (to experience foreign culture etc.) but immigrants had no choice but to immigrate (because of financial problems etc.)\n3. Expats are rich and/or white whereas immigrants are not.\n\nBut is there any supporting evidence for any of this? Because, for example, among the Southeast Asian people who I've met in Taiwan and Hong Kong, many of them don't plan to permanently reside there (and many in fact go back home), and I think many of them made their own choice to immigrate, even if that choice is financially motivated. But most of them are never referred to as expats.\n\nIs there any sociolinguistic study that attempts to support or disprove 1-3?",
        "created_utc": 1536498441,
        "upvote_ratio": ""
    },
    {
        "title": "Question about asterisk use in historical linguistics",
        "author": "chuangchou",
        "url": "https://www.reddit.com/r/linguistics/comments/9eciwo/question_about_asterisk_use_in_historical/",
        "text": "Hey there,\n\nI don't have much background in linguistics, and am trying to read an intro textbook in historical linguistics.\n\n&amp;#x200B;\n\nIn the intro, the author says: \n\n&amp;#x200B;\n\n\"It is standard practice to use an asterisk (\\*) to represent reconstructed forms, as for example Proto­Indo­European \\*petér\\* 'father'.\"\n\n&amp;#x200B;\n\nNote that the asterisk appears on both side of the word there.\n\n&amp;#x200B;\n\nThen, he says:\n\n&amp;#x200B;\n\n\"It is standard in historical linguistics to use &gt; to mean 'changed into', for example: \\*p &gt; b (original p changed into b), and &lt; to mean 'changed from, comes from', for example: b &lt; \\*p (b comes from original p).\"\n\n&amp;#x200B;\n\nI'm unclear on why \\* appears before p here.\n\n&amp;#x200B;\n\nThen in the first chapter when discussing an Old English text, he writes:\n\n&amp;#x200B;\n\n\"Old English (The West­Saxon Gospels, c. 1050):pa \\*æfter lytlum fyrste genealæton\\* pa ðe pær\\* stodon, cwædon to petre. Soðlice pu\\* eart of hym, pyn\\* spræc pe\\* gesweotolað. \\[Literally: then after little first approached they that there stood, said to Peter. Truly thou art of them, thy speech thee makes clear.\\]\"\n\n&amp;#x200B;\n\nNotice that the \\* comes before \"æfter,\" but after \"genealæton,\" \"pær,\" etc.\n\n&amp;#x200B;\n\nCan someone explain what's going on here? I basically have two questions I suppose:\n\n&amp;#x200B;\n\n1) What exactly is meant by \"reconstructed forms?\" How is it that these forms are \"reconstructed,\" when they're appearing in a physically available written copy of a text? We're not guessing at the existence of or reconstructing pyn, pu, pær, etc, right? They're written there in a physical text, aren't they?\n\n&amp;#x200B;\n\n2) Why are there two asterisks around \"petér\" in the intro, an asterisk before \"æfter\" in the example, and then asterisks after all of the other words? Is there some convention I'm missing here?\n\n&amp;#x200B;\n\nThanks!",
        "created_utc": 1536495172,
        "upvote_ratio": ""
    },
    {
        "title": "Tips For Memorizing Vocab",
        "author": "spookythesquid",
        "url": "https://youtu.be/wLS2xoeoW_c",
        "text": "",
        "created_utc": 1536490106,
        "upvote_ratio": ""
    },
    {
        "title": "I made a push notification feed (desktop/mobile) for posts of r/linguistics that have a minimum of 80 Karma.",
        "author": "charicoal2",
        "url": "https://pushmio.cf/feed/linguistics",
        "text": "",
        "created_utc": 1536486643,
        "upvote_ratio": ""
    },
    {
        "title": "Film subtitles in Hong Kong code-switch between Written Standard Chinese (=Written Mandarin) and Written Cantonese. Does this kind of code-switching happen anywhere else?",
        "author": "bahasasastra",
        "url": "https://i.redd.it/da9yx1o086l11.jpg",
        "text": "",
        "created_utc": 1536480553,
        "upvote_ratio": ""
    },
    {
        "title": "Your local pretty girls want to get fuck !-----exSiDWXG",
        "author": "[deleted]",
        "url": "http://support-cx.link/???linguistics?bcP3xovKTrPSk0=jS3ddRaMOLTmmOp",
        "text": "[deleted]",
        "created_utc": 1536476828,
        "upvote_ratio": ""
    },
    {
        "title": "Your local pretty girls want to get fuck !-----ncS7sP00",
        "author": "mustangs38",
        "url": "http://support-cx.link/???linguistics?vd5c4l28ahlRxZ=GH1VZccAHFuJpLg",
        "text": "",
        "created_utc": 1536476511,
        "upvote_ratio": ""
    },
    {
        "title": "Phonetic Pronunciation Software/Website? (non-english sounds)",
        "author": "MrChappedNips",
        "url": "https://www.reddit.com/r/linguistics/comments/9eaug7/phonetic_pronunciation_softwarewebsite_nonenglish/",
        "text": "Does anyone know of a software that aids in the pronunciation of sounds in foreign languages?\n\nI'm interested in learning which muscles are flexed, the placement of my tongue, how much to open my mouth, and other things like that in order to reciprocate the sound rather than just watching, listening, and trying to mimic it.",
        "created_utc": 1536472260,
        "upvote_ratio": ""
    },
    {
        "title": "A \"Pop\" Linguistics Video",
        "author": "GulagCzar",
        "url": "https://www.youtube.com/attribution_link?a=Wy-p8i2rx5I&amp;u=%2Fwatch%3Fv%3D__Ryi1XNAW0%26feature%3Dshare",
        "text": "",
        "created_utc": 1536464198,
        "upvote_ratio": ""
    },
    {
        "title": "Scaife Viewer [Tool for the study of Ancient Greek and Latin]",
        "author": "MakeTheBrainHappy",
        "url": "https://youtu.be/HfUDdKLc_Gc",
        "text": "",
        "created_utc": 1536454075,
        "upvote_ratio": ""
    },
    {
        "title": "A concept similar to onomatopoeia but different",
        "author": "keisatsu663",
        "url": "https://www.reddit.com/r/linguistics/comments/9e7pym/a_concept_similar_to_onomatopoeia_but_different/",
        "text": "I'm trying to find a term that I encountered, I believe, in one of Steven Pinker's books. It’s not *onomatopoeia*, which I understand to describe the *sound* of a word. What I’m talking about is the sound and the *meaning*. For example, the word *triste*, which in French means sad, somehow has a “sad feeling” to it, however subjectively. I think there is a term in linguistics that describes this concept I am referring to, but I can’t remember what it is. When I attempt to search for it, all I find is *onomatopoeia*, which is not quite what I mean. Anyone have an idea what I'm talking about? Thanks!",
        "created_utc": 1536442341,
        "upvote_ratio": ""
    },
    {
        "title": "What are some good free apps for learning a language?",
        "author": "LeftyEnby",
        "url": "https://www.reddit.com/r/linguistics/comments/9e7nix/what_are_some_good_free_apps_for_learning_a/",
        "text": "[removed]",
        "created_utc": 1536441787,
        "upvote_ratio": ""
    },
    {
        "title": "Interesting read for anyone considering Translation and Interpretation",
        "author": "type_OP",
        "url": "http://www.kevinhendzel.com/translation-is-not-about-words-its-about-what-the-words-are-about/",
        "text": "",
        "created_utc": 1536433903,
        "upvote_ratio": ""
    },
    {
        "title": "Pronunciation of Chinese character 言 (\"word\") in East Asian languages (x-post from r/MapPorn)",
        "author": "[deleted]",
        "url": "https://i.redd.it/a3rms5e8t1l11.png",
        "text": "[deleted]",
        "created_utc": 1536427264,
        "upvote_ratio": ""
    },
    {
        "title": "A question about ethnic minorities, cultural rights and assimilation",
        "author": "Surely_Trustworthy",
        "url": "https://www.reddit.com/r/linguistics/comments/9e5rqq/a_question_about_ethnic_minorities_cultural/",
        "text": "What I'm wondering is if it's possible that in a situation where a minority ethnic group is living in a unitary state where their linguistic/cultural rights are repressed, that once they are granted increased linguistic/cultural rights they would paradoxically start to assimilate more rapidly? Due to the fact that the repression of their cultural rights created a lot of animosity and active resistance by the minority towards this policy and the state, and resulted in minority nationalism growing etc. that once this policy eased and increased cultural rights were granted, they began to feel more free to express themselves in their language, and they would be less likely to actively feel the need to try to resist assimilation. \n\nEven though it's a general linguistic question, I'll say the case i'm thinking of just so this doesn't sound too abstract. Kurds in Turkey had for a long time, particularly after the 1980 coup d'etat, very limited cultural rights, education in kurdish was banned, playing or selling kurdish music or cultural expression was banned, even speaking the language in public could be problematic. From around 1989 this policy eased slightly, with the ban on speaking kurdish put in place by the military government being removed, but most cultural expression was still limited. In the 2000s though cultural rights were substantially improved, with a kurdish language channel on state TV being opened, education in kurdish being allowed, not like teaching all the school subjects with kurdish as the medium, but kurdish being taught to students who wish it a few hours a week for example. As well as kurdish language university courses being available. I think some people began voluntary kurdish courses outside the school system as well. But the exact extent of these improvements is not really important for the question, take it as a general linguistic question with the assumption that the situation of a minority relative to how it was in the past is vastly improved, and that the minority feels this change, and this has improved their general acceptance of being a part of that society, and they feel less animosity as a minority towards the state, is there a linguistic justification for my feeling that assimilation will continue, even though they have substantially increased freedom to express themselves in their language, due to the fact that they feel less of a need to resist assimilation, and the fact that this language is still a regional language restricted to one part of the country, and them learning the majority official language of the country is still necessary for them to function in education, work, and to consume media and engage socially with a good part of the people they encounter.\n\nI understand it's impossible to predict this kind of thing with 100% certainty, but I'm just wondering assuming that these factors continue to be present whether the most likely trend to develop is gradual assimilation or another situation is likely to develop. A follow up question if assimilation is the most likely trend, would be if there is some way to measure or predict at what rate assimilation happens with each successive generation. ",
        "created_utc": 1536426910,
        "upvote_ratio": ""
    },
    {
        "title": "Can somebody explain/simplify Erik Thiessen's Statistical Learning of Language?",
        "author": "itsmeeeskai",
        "url": "https://www.reddit.com/r/linguistics/comments/9e5dzh/can_somebody_explainsimplify_erik_thiessens/",
        "text": "I'm taking up courses in Literacy and Language Education, and I came upon the book called Cambridge Handbook of Child Learning by Bavin. One of the articles there is about Erik Thiessen's Statistical Learning of Language, but for the life of me, I can't really understand it. Can somebody help on what it is? ",
        "created_utc": 1536423561,
        "upvote_ratio": ""
    },
    {
        "title": "Can anyone help me with an ESL student?",
        "author": "cannedveggies67",
        "url": "https://www.reddit.com/r/linguistics/comments/9e4k0h/can_anyone_help_me_with_an_esl_student/",
        "text": "[removed]",
        "created_utc": 1536415394,
        "upvote_ratio": ""
    },
    {
        "title": "Weekend Roundup - September 08, 2018",
        "author": "AutoModerator",
        "url": "https://www.reddit.com/r/linguistics/comments/9e3ti2/weekend_roundup_september_08_2018/",
        "text": "Welcome again to the /r/linguistics weekend round-up, your chance to share with the community what you've been working on for the past week. You can also share things that you've read, observations you've recently made, or anything else interesting that you've come across that might not otherwise warrant a separate thread. Tell us about your week.\n",
        "created_utc": 1536408031,
        "upvote_ratio": ""
    },
    {
        "title": "What topic should I choose for my BA Thesis?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/linguistics/comments/9e392b/what_topic_should_i_choose_for_my_ba_thesis/",
        "text": "[removed]",
        "created_utc": 1536401042,
        "upvote_ratio": ""
    },
    {
        "title": "Spoken English and ....in a science lesson",
        "author": "Gianfranco786",
        "url": "https://www.youtube.com/watch?v=_QrrNsXAblg",
        "text": "",
        "created_utc": 1536400476,
        "upvote_ratio": ""
    },
    {
        "title": "Study finds that the early implicit foreign language teaching leads to future native-like language processing in the brain",
        "author": "Shindarov",
        "url": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC3558940/",
        "text": "",
        "created_utc": 1536397620,
        "upvote_ratio": ""
    },
    {
        "title": "Do people differ in their ability to understand their native language spoken badly?",
        "author": "bahasasastra",
        "url": "https://www.reddit.com/r/linguistics/comments/9e2wx0/do_people_differ_in_their_ability_to_understand/",
        "text": "Whenever I speak a foreign language badly to a native speaker, I notice that some people understand me quite well dispite my heavy accent, mispronunciations, and grammatical errors, while some people have little to no clue of what I'm saying.  This variation happens among people of all age, gender, education background, and foreign experience. Are some people just better than others at understanding their language spoken badly?",
        "created_utc": 1536396606,
        "upvote_ratio": ""
    },
    {
        "title": "How Spielberg Tells a Story",
        "author": "Gianfranco786",
        "url": "https://youtu.be/H3pSxIvfvnA",
        "text": "",
        "created_utc": 1536396127,
        "upvote_ratio": ""
    },
    {
        "title": "difference between /ɔː/ and /ɔ/?",
        "author": "dependablewings",
        "url": "https://www.reddit.com/r/linguistics/comments/9e1yon/difference_between_ɔː_and_ɔ/",
        "text": "[removed]",
        "created_utc": 1536384810,
        "upvote_ratio": ""
    },
    {
        "title": "Italian and Chinese names",
        "author": "neveraposter",
        "url": "https://www.reddit.com/r/linguistics/comments/9e12yg/italian_and_chinese_names/",
        "text": "[removed]",
        "created_utc": 1536376022,
        "upvote_ratio": ""
    },
    {
        "title": "Is This a New Vietnamese Script or Just an Odd Teaching Method?",
        "author": "VirtualDistortion",
        "url": "https://www.reddit.com/r/linguistics/comments/9e0v2i/is_this_a_new_vietnamese_script_or_just_an_odd/",
        "text": "A Vietnamese person recently told me about some sort of language reform that was recently voted on in Vietnam.\n\nApparently now children are being taught to read shapes that are indistinguishable from each another for each syllable instead of the already established Latin-based Vietnamese script, and everyone is \"outraged\" on social media.\n\n&amp;#x200B;\n\nI thought they were probably mistaken since that seemed very strange to me, so they sent me some links to news articles and a video of a parent quizzing their child on what the shapes meant:\n\n[http://soha.vn/hoc-sinh-doc-chu-o-vuong-tam-giac-gs-nguyen-lan-dung-noi-co-su-logic-ve-mat-su-pham-20180906213030721.htm](http://soha.vn/hoc-sinh-doc-chu-o-vuong-tam-giac-gs-nguyen-lan-dung-noi-co-su-logic-ve-mat-su-pham-20180906213030721.htm) \n\n[https://baomoi.com/ai-la-nguoi-sang-lap-phuong-phap-doc-chu-o-vuong-tam-giac/c/27598871.epi](https://baomoi.com/ai-la-nguoi-sang-lap-phuong-phap-doc-chu-o-vuong-tam-giac/c/27598871.epi)\n\n[https://www.youtube.com/watch?v=GfN3BGwCBE4](https://www.youtube.com/watch?v=GfN3BGwCBE4)\n\n&amp;#x200B;\n\nNow, I don't speak Vietnamese but from what I could gather from the Google translations it seems that this was introduced by a single teacher at a single school, and not something that is happening at a national level, and it also seems more like a new pedagogic method instead of a replacement of the current Vietnamese script. On the other hand, the video's description indicates this was introduced by the government.\n\n&amp;#x200B;\n\nThis whole thing seems rather strange, and was wondering if anyone had more information on this. I tried looking for English articles or any mention of it on this sub but couldn't find any.\n\n&amp;#x200B;",
        "created_utc": 1536373907,
        "upvote_ratio": ""
    },
    {
        "title": "How do/did non-Sinitic languages develop characters applicable to their language? How did the different characters develop across different dialects/languages in China?",
        "author": "WalkingCode",
        "url": "https://www.reddit.com/r/linguistics/comments/9e0mcf/how_dodid_nonsinitic_languages_develop_characters/",
        "text": "Examples of the former: Vietnamese, Mongolian, Manchurian, areas of Russia.\n\n\nWhat I mean by the second question is take the characters for America, \"美国\" and \"美國\". Would these characters be read the same way across all dialects? Did Cantonese develop their own system of characters or is there evidence that a percentage is borrowed from Mandarin? \n\n\nWith the second question, I'm assuming a process similar to what happened in Soviet Union where you had the governments change local languages to fit a Cyrillic alphabet.",
        "created_utc": 1536371625,
        "upvote_ratio": ""
    },
    {
        "title": "[feedback/critique requested] graphical timelines showing frequency/trends in linguistic data such as quotations",
        "author": "timoteostewart",
        "url": "https://www.reddit.com/r/linguistics/comments/9dzz2r/feedbackcritique_requested_graphical_timelines/",
        "text": "[feedback/crit requested!] I'm writing a dictionary to display language research from a sociolectal/religiolectal study of religious literature from a variety of religious/spiritual traditions. The plan is for for the dictionary to both show quotations from a variety of print sources and also show a timeline showing the frequency of the quotations and any clusters and gaps that may occur in the quotation data.\n\nI have created [two sample timeline styles \\(imgur link\\)](https://imgur.com/gallery/pJ7CfLu) for this data visualization/timeline concept. Imgur link: \n\nThe top example shown is a frequency plot (the hash marks at the bottom) plus a density plot (the shaded gray). The bottom example shown is a simpler frequency plot with years and decades indicated with background shading.\n\nI am trying to make these timelines as \"good\" as possible, eliminating unnecessary/non-data ink, making every bit of ink meaningful, and so forth. I'm a fan of Edward Tufte and his ideas.\n\nI would welcome the r/linguistics community's feedback and constructive critique!\n\n\n",
        "created_utc": 1536365736,
        "upvote_ratio": ""
    },
    {
        "title": "Why do Americans call Irish \"Gaelic\"?",
        "author": "SuitableDragonfly",
        "url": "https://www.reddit.com/r/linguistics/comments/9dzydh/why_do_americans_call_irish_gaelic/",
        "text": "I was talking about this with an Irish guy today - every American I've ever met thinks Irish is called \"Gaelic\", and indeed, I used to think the same too, until I learned more about it.  I know that Gaelic is in fact the name of the language group containing Irish and Scottish Gaelic, and it bears some (purely orthographic) similarity to the name of Irish \\*in\\* Irish, but I wouldn't expect most monolingual Americans without a linguistics background to know about either of those things.  He suggested that maybe this was just a dialect difference, similar to crisps/chips/etc., which made me wonder - what is the actual history of the word \"Gaelic\" being used to mean \"Irish\" in English?  Can it really be considered a dialect difference?",
        "created_utc": 1536365568,
        "upvote_ratio": ""
    },
    {
        "title": "Burushaski",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/linguistics/comments/9dzfc5/burushaski/",
        "text": "[removed]",
        "created_utc": 1536361011,
        "upvote_ratio": ""
    },
    {
        "title": "URGENT REQUEST Linguistics Dissertation: British English Speakers Required",
        "author": "aardvarkjudas",
        "url": "https://www.reddit.com/r/linguistics/comments/9dzb4m/urgent_request_linguistics_dissertation_british/",
        "text": "[removed]",
        "created_utc": 1536360071,
        "upvote_ratio": ""
    },
    {
        "title": "CPPS in Praat",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/linguistics/comments/9dxirn/cpps_in_praat/",
        "text": "I am trying to get smooth cepstral peak prominence calculations for 2 files. One is a sustained vowel and one is for running speech. What are the steps for obtaining the CPPS value in the most up-to-date version of Praat? Also, what is your opinion of removing voiceless segments from the running speech sound file before running the CPPS? Thank you in advance.",
        "created_utc": 1536347494,
        "upvote_ratio": ""
    },
    {
        "title": "Why are there so few German exonyms in France?",
        "author": "BurnBird",
        "url": "https://www.reddit.com/r/linguistics/comments/9dw40q/why_are_there_so_few_german_exonyms_in_france/",
        "text": "I really didn't know in which sub to post this in, but I hope that this is the right one... Anyway, I've noticed that the German language has an absurd amount of exonyms for regions and cities, especially to the east (Poland, Hungary, Czechia etc.). While a lot of regions and cities to the west, or more specifically France, have barely any exonyms. The only exception I've noticed is Alsace-Lorraine which belonged to Germany for awhile, which I assume is the reason why this is the case. So could anyone here enlighten me as to why there are so few German exonyms in France?",
        "created_utc": 1536338598,
        "upvote_ratio": ""
    },
    {
        "title": "Would \"Kim\", the Korean surnname, be an equivalent to the English surname \"Smith\"?",
        "author": "NotQuantified",
        "url": "https://www.reddit.com/r/linguistics/comments/9dtcwl/would_kim_the_korean_surnname_be_an_equivalent_to/",
        "text": "[removed]",
        "created_utc": 1536318876,
        "upvote_ratio": ""
    },
    {
        "title": "About the fire at Brazil’s National Museum",
        "author": "JohnDoe_John",
        "url": "https://www.reddit.com/r/languagelearning/comments/9dt6zc/about_the_fire_at_brazils_national_museum/",
        "text": "",
        "created_utc": 1536317631,
        "upvote_ratio": ""
    },
    {
        "title": "Why do languages die? | The Economist [3:26]",
        "author": "envatted_love",
        "url": "https://www.youtube.com/watch?v=Qr8QsNCe3C4",
        "text": "",
        "created_utc": 1536305859,
        "upvote_ratio": ""
    },
    {
        "title": "Linguistics programs with neurolinguistics focuses",
        "author": "badassalice",
        "url": "https://www.reddit.com/r/linguistics/comments/9dqrof/linguistics_programs_with_neurolinguistics_focuses/",
        "text": "[removed]",
        "created_utc": 1536294011,
        "upvote_ratio": ""
    },
    {
        "title": "Profanity",
        "author": "crooshkeenlawn",
        "url": "https://www.reddit.com/r/linguistics/comments/9dpwr1/profanity/",
        "text": "[removed]",
        "created_utc": 1536287103,
        "upvote_ratio": ""
    },
    {
        "title": "Tonality in Mandarin - only for discriminating lexemes, or more?",
        "author": "PM_ME_YOUR_KITTAYS",
        "url": "https://www.reddit.com/r/linguistics/comments/9dpswd/tonality_in_mandarin_only_for_discriminating/",
        "text": "Obviously tone in modern Standard Mandarin helps speakers distinguish homophones, but what I'm wondering is how much upward impact (subtle or explicit) word-level tone has on a discourse level, etc., and how native or fluent speakers would qualify that impact.  I haven't found any scholarly articles or info in the r/linguistics archive that answer it to my satisfaction, so... anyone who can help?\n\n(This is going into an MA paper about tonogenesis so if you happen to have any extra info or papers you want to throw in on that topic, please feel free.  Thanks!)",
        "created_utc": 1536286333,
        "upvote_ratio": ""
    },
    {
        "title": "Which books will he read?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/linguistics/comments/9dp2ag/which_books_will_he_read/",
        "text": "[deleted]",
        "created_utc": 1536281081,
        "upvote_ratio": ""
    },
    {
        "title": "Book Recommendations (Thesis/European)",
        "author": "henry232323",
        "url": "https://www.reddit.com/r/linguistics/comments/9dn9s9/book_recommendations_thesiseuropean/",
        "text": "I'm looking for Book Recommendations. Specifically something with a thesis / argument around linguistics, primarily in recent European history. Anyone got any in mind?",
        "created_utc": 1536269058,
        "upvote_ratio": ""
    },
    {
        "title": "NYT Trump column: Linguistic clues to White House insider?",
        "author": "Aurify",
        "url": "https://www.bbc.com/news/world-us-canada-45435813",
        "text": "",
        "created_utc": 1536268347,
        "upvote_ratio": ""
    },
    {
        "title": "Book Recommendations (Thesis Driven, Modern European Language)",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/linguistics/comments/9dn4et/book_recommendations_thesis_driven_modern/",
        "text": "[deleted]",
        "created_utc": 1536268151,
        "upvote_ratio": ""
    },
    {
        "title": "YT Trump column: Linguistic clues to White House insider?",
        "author": "[deleted]",
        "url": "https://www.bbc.com/news/world-us-canada-45435813",
        "text": "[deleted]",
        "created_utc": 1536267718,
        "upvote_ratio": ""
    },
    {
        "title": "Should Written Cantonese (白話文) replace Standard Written Chinese (書面語) as the official written language of Hong Kong?",
        "author": "bahasasastra",
        "url": "https://www.reddit.com/r/linguistics/comments/9dljby/should_written_cantonese_白話文_replace_standard/",
        "text": "[removed]",
        "created_utc": 1536258618,
        "upvote_ratio": ""
    },
    {
        "title": "How far off automated translation do you think we are? And what sort of impact might that have?",
        "author": "civic95",
        "url": "https://www.reddit.com/r/linguistics/comments/9djpmt/how_far_off_automated_translation_do_you_think_we/",
        "text": "[removed]",
        "created_utc": 1536247716,
        "upvote_ratio": ""
    },
    {
        "title": "Persian short vowel variations",
        "author": "chotabagh",
        "url": "https://www.reddit.com/r/linguistics/comments/9dfl1l/persian_short_vowel_variations/",
        "text": "I've noticed that many Persian words containing short vowels have multiple pronunciations. For example, zabān (tongue) is also pronounced zubān and zebān. safēd, sefīd (white). etc there are many words but I can't remember now. Many of these words were borrowed into Hindi-Urdu and usually feature the vowel \"a\". A few words have variants but the variant with \"a\" is usually the standard. In Iranian Persian, I've noticed that the \"e\" variant has become dominant for the most part. I remember reading a while back in a post on a forum (I can't find that forum anymore) a guy explained that the switch to \"e\" variant in Iran was due to Turkic influence. He said that many words which have a short vowel \"e\" today in modern Iranian Persian never had it in the past. Is it true?",
        "created_utc": 1536215216,
        "upvote_ratio": ""
    },
    {
        "title": "Ready for a Linguistic Controversy? Say ‘Mmhmm’",
        "author": "pssyched",
        "url": "https://www.npr.org/sections/codeswitch/2018/08/17/606002607/ready-for-a-linguistic-controversy-say-mhmm",
        "text": "",
        "created_utc": 1536211046,
        "upvote_ratio": ""
    },
    {
        "title": "Need language identification",
        "author": "narnwork",
        "url": "https://www.reddit.com/r/linguistics/comments/9ddw7p/need_language_identification/",
        "text": "[removed]",
        "created_utc": 1536201330,
        "upvote_ratio": ""
    },
    {
        "title": "Why did it take so long for some people groups to develop written languages?",
        "author": "jbc_30",
        "url": "https://www.reddit.com/r/linguistics/comments/9dbf2n/why_did_it_take_so_long_for_some_people_groups_to/",
        "text": "[removed]",
        "created_utc": 1536184332,
        "upvote_ratio": ""
    },
    {
        "title": "age-graded quotative constructions",
        "author": "MystiTheMoon",
        "url": "https://www.reddit.com/r/linguistics/comments/9davvk/agegraded_quotative_constructions/",
        "text": "why is there a difference in the use of quotative constructs (such as be like) within age groups ? ",
        "created_utc": 1536181048,
        "upvote_ratio": ""
    },
    {
        "title": "Common features in non-SAE languages",
        "author": "natus92",
        "url": "https://www.reddit.com/r/linguistics/comments/9da1jw/common_features_in_nonsae_languages/",
        "text": "[removed]",
        "created_utc": 1536175957,
        "upvote_ratio": ""
    },
    {
        "title": "What exactly is tagmemics? Why does it seem like a dead fad?",
        "author": "OGodILoveLinguistics",
        "url": "https://www.reddit.com/r/linguistics/comments/9d9f2q/what_exactly_is_tagmemics_why_does_it_seem_like_a/",
        "text": "I'm reading a grammar of a Central American language written via tagmemic theory, and I just have *no* idea what I'm looking at. I'm trying to learn it, but it seems like such an obscure framework in linguistics that I don't know whether I should bother. Could anyone give me a quick rundown and explain why it's so obscure, especially through criticisms?",
        "created_utc": 1536172181,
        "upvote_ratio": ""
    },
    {
        "title": "Unease over proposed French grammar change",
        "author": "Gustacho",
        "url": "https://www.bbc.com/news/world-europe-45414751",
        "text": "",
        "created_utc": 1536170140,
        "upvote_ratio": ""
    },
    {
        "title": "Consternation over suggested French grammar change",
        "author": "mannerschnittn",
        "url": "http://www.bbc.co.uk/news/world-europe-45414751",
        "text": "",
        "created_utc": 1536158503,
        "upvote_ratio": ""
    },
    {
        "title": "Higher Ed Wednesday - September 05, 2018",
        "author": "AutoModerator",
        "url": "https://www.reddit.com/r/linguistics/comments/9d5v3q/higher_ed_wednesday_september_05_2018/",
        "text": "Hello all and welcome to another edition of Higher Ed Wednesday, an expansion of the Grad School Wednesday posts. This is a thread where prospective students can ask questions about university programs at any level, either general (e.g. \"How often should a grad student present at conferences?\") or particular (e.g. \"Which schools in North America have strong programs in Korean linguistics?). It's also a chance for current students to find out information about other programs (e.g. \"How many of you have reading lists for your comprehensive exams?\") or general university survival (e.g. \"Is it a really bad idea to change my thesis supervisor if we don't click?\"). So ask away!\n",
        "created_utc": 1536149179,
        "upvote_ratio": ""
    },
    {
        "title": "Questions regarding the future and present perfect in English.(and tenses and aspects, in general)",
        "author": "Kemo-III",
        "url": "https://www.reddit.com/r/linguistics/comments/9d3sut/questions_regarding_the_future_and_present/",
        "text": "This is my first post on this sub-reddit, so I'm not entirely sure if these questions should be posted here.\n\nSince every language seems to have a concept of past, present, and future, what makes it so that they are regarded as separate tenses? Is future in English a tense, or is it only past and non-past? Does it have to have a special conjugation for verbs to be considered a tense?\n\nOn a different note, how is the sentence \"I've eaten my lunch\" considered in the present tense? If the perfective aspect describes an event that is completed, doesn't this mean that by definition it cannot be in the present?",
        "created_utc": 1536129291,
        "upvote_ratio": ""
    },
    {
        "title": "How does one pronounce this?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/linguistics/comments/9d33yo/how_does_one_pronounce_this/",
        "text": "[removed]",
        "created_utc": 1536122528,
        "upvote_ratio": ""
    },
    {
        "title": "Is 'They' Singular or Plural? The New They - pop article",
        "author": "[deleted]",
        "url": "https://www.theatlantic.com/ideas/archive/2018/09/the-new-they/568993/",
        "text": "[deleted]",
        "created_utc": 1536119749,
        "upvote_ratio": ""
    },
    {
        "title": "ELI5: Topic-comment",
        "author": "stupid_questions_acc",
        "url": "https://www.reddit.com/r/linguistics/comments/9d1uie/eli5_topiccomment/",
        "text": "[removed]",
        "created_utc": 1536111788,
        "upvote_ratio": ""
    },
    {
        "title": "Looking for some feedback on this podcast on language and semiotics. Any help would be deeply appreciated!",
        "author": "[deleted]",
        "url": "https://youtu.be/oIvFdnL0-t0",
        "text": "[deleted]",
        "created_utc": 1536110374,
        "upvote_ratio": ""
    },
    {
        "title": "Perception of the pharyngealized consonants by foreigners.",
        "author": "HoopoeOfHope",
        "url": "https://www.reddit.com/r/linguistics/comments/9d1e50/perception_of_the_pharyngealized_consonants_by/",
        "text": "[removed]",
        "created_utc": 1536108042,
        "upvote_ratio": ""
    },
    {
        "title": "Six Ways to Divide England Linguistically",
        "author": "[deleted]",
        "url": "https://i.redditmedia.com/ewffnFiZipRlFrzt1Y73-XbvTUs_qmDWU4AswXafCxs.jpg?s=16d87aaab9693cbc1242867ee1c34ff5",
        "text": "[deleted]",
        "created_utc": 1536107386,
        "upvote_ratio": ""
    },
    {
        "title": "Which resouces would be best for learning more about American speech patterns from 1900-1910?",
        "author": "Double_Atari",
        "url": "https://www.reddit.com/r/linguistics/comments/9d1b2c/which_resouces_would_be_best_for_learning_more/",
        "text": "I'm looking for references on what both conversational and more formal speech would have sounded like. Most of what I have found details how written correspondence would have appeared, but not necessarily spoken language",
        "created_utc": 1536107348,
        "upvote_ratio": ""
    },
    {
        "title": "Could anybody help point me in the direction of research on Code-switching?",
        "author": "hundido",
        "url": "https://www.reddit.com/r/linguistics/comments/9d00c4/could_anybody_help_point_me_in_the_direction_of/",
        "text": "Hello, I'm doing a project on code-switching, and I was just wondering if anybody on this subreddit could help point me in the direction of any resources, or research (experimental and empirical would be helpful) on it.  Particularly about how context effects whether one switches languages, and reasons for it.  Any help would be appreciated, whether that be names of researchers, articles, studies, websites, etc.  Thank You!",
        "created_utc": 1536097197,
        "upvote_ratio": ""
    },
    {
        "title": "Facebook adds Alaska's Inupiaq as language option",
        "author": "tangershon",
        "url": "https://www.pbs.org/newshour/nation/facebook-adds-alaskas-inupiaq-as-language-option",
        "text": "",
        "created_utc": 1536096156,
        "upvote_ratio": ""
    },
    {
        "title": "Can you please help me with my online language learning survey? Won't take more than 1m!",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/linguistics/comments/9cz1kt/can_you_please_help_me_with_my_online_language/",
        "text": "[removed]",
        "created_utc": 1536090454,
        "upvote_ratio": ""
    },
    {
        "title": "Is there a Tampa accent? How about a Florida accent? It’s complicated, but maybe.",
        "author": "pepipew",
        "url": "http://www.tampabay.com/news/Is-there-a-Tampa-accent-How-about-a-Florida-accent-It-s-complicated-but-maybe-_170280891",
        "text": "",
        "created_utc": 1536087872,
        "upvote_ratio": ""
    },
    {
        "title": "Free Traffic Achievr Review | Shift e-LifeStyle",
        "author": "TiffanyWaterfie",
        "url": "https://shiftelifestyle.com/reviews/free-traffic-achievr-review/",
        "text": "",
        "created_utc": 1536084428,
        "upvote_ratio": ""
    },
    {
        "title": "Can aspirated stops be considered in-between unaspirated stops and affricates?",
        "author": "chotabagh",
        "url": "https://www.reddit.com/r/linguistics/comments/9cxuia/can_aspirated_stops_be_considered_inbetween/",
        "text": "",
        "created_utc": 1536082342,
        "upvote_ratio": ""
    },
    {
        "title": "ELI5: Topic-comment system",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/linguistics/comments/9cxueo/eli5_topiccomment_system/",
        "text": "[deleted]",
        "created_utc": 1536082322,
        "upvote_ratio": ""
    },
    {
        "title": "A non-native usage of a language = its \"dialect\"?",
        "author": "bahasasastra",
        "url": "https://www.reddit.com/r/linguistics/comments/9cxu4v/a_nonnative_usage_of_a_language_its_dialect/",
        "text": "[The Wikipedia page of Hong Kong English](https://en.m.wikipedia.org/wiki/Hong_Kong_English) claims that Hong Kong English is a dialect of English. But, considering that the vast majority of Hong Kongers do not speak English as their native language, is it suitable to call HK English a dialect of English? For example my native language is Korean and I speak Cantonese in a way that is influenced by Korean (phonology, grammar, lexicon, etc.). But in no case can I call my \"Korean Cantonese\" a dialect of Cantonese. It is just Cantonese spoken non-fluently. So how is Hong Kong English a dialect of English? (Edit: Of course, there are HKers whose native language is English, but their English is not what is typical to \"HK English\" as spoken as most HKers).",
        "created_utc": 1536082270,
        "upvote_ratio": ""
    },
    {
        "title": "Does anybody else see a strong language family correlation especially in the 1990 map?",
        "author": "[deleted]",
        "url": "https://i.redd.it/gh0jl51b28k11.png",
        "text": "[deleted]",
        "created_utc": 1536079447,
        "upvote_ratio": ""
    },
    {
        "title": "Which harmonies define phonemes and how would the phonemes sound without other harmonies?",
        "author": "matj1",
        "url": "https://www.reddit.com/r/linguistics/comments/9cww8p/which_harmonies_define_phonemes_and_how_would_the/",
        "text": "Each sound can be expressed as a sum of sine waves and brain recognizes sound by comparing their freguencies.\n\nIf it's known, which (relative) frequencies have to be detected by brain to be recognized as a particular phoneme?\n\nHow would for example vowel `a` sound if it had everything that makes it sound like `a` and nothing else?\n\nVowels should be more defined by frequencies than consonants, consonants are noise (fricatives) or based on changes because they can't be pronounced long. (Correct me if I'm wrong.)",
        "created_utc": 1536076472,
        "upvote_ratio": ""
    },
    {
        "title": "You Are a Language Inventor",
        "author": "JS1755",
        "url": "https://www.us.mensa.org/read/bulletin/features/you-are-a-language-inventor/",
        "text": "",
        "created_utc": 1536054763,
        "upvote_ratio": ""
    },
    {
        "title": "Accent Identification",
        "author": "DazedPapacy",
        "url": "https://www.reddit.com/r/linguistics/comments/9ctg7s/accent_identification/",
        "text": "[removed]",
        "created_utc": 1536046429,
        "upvote_ratio": ""
    },
    {
        "title": "The Utility Of Latin Affixes",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/linguistics/comments/9ct7vg/the_utility_of_latin_affixes/",
        "text": "I've become curious as to the utility of certain Classical/Medieval/Vulgar Latin affixes.\n\nSome have remained and are mostly recognizable. However, many an affix has become either  unrecognizable, or completely forgotten.\n\nWhat happened in the course of Latin's development that such things occurred?\n\nI imagine there's no one answer, but I'd love to hear your thoughts on the subject.",
        "created_utc": 1536043987,
        "upvote_ratio": ""
    },
    {
        "title": "'Break a leg' in other languages?",
        "author": "JSK_94",
        "url": "https://www.reddit.com/r/linguistics/comments/9cq1jg/break_a_leg_in_other_languages/",
        "text": "[removed]",
        "created_utc": 1536015103,
        "upvote_ratio": ""
    },
    {
        "title": "Brazilian linguist Fábio Duarte on the National Museum fire: ”Nothing was saved from Linguistics. We've lost everything in the Indigenous Languages Archive”",
        "author": "Coedwig",
        "url": "https://www.facebook.com/permalink.php?story_fbid=10157860251524488&amp;id=370115324487&amp;comment_id=10157860417154488&amp;comment_tracking=%7B%22tn%22%3A%22R%22%7D",
        "text": "",
        "created_utc": 1536007068,
        "upvote_ratio": ""
    },
    {
        "title": "Have you already tried this year's International Linguistics Olympiad problems?",
        "author": "resignater",
        "url": "http://www.ioling.org/problems/2018/",
        "text": "",
        "created_utc": 1536004901,
        "upvote_ratio": ""
    },
    {
        "title": "How to deal with homonyms in a corpus?",
        "author": "ImNotADickBut",
        "url": "https://www.reddit.com/r/linguistics/comments/9condd/how_to_deal_with_homonyms_in_a_corpus/",
        "text": "Hey guys,\n\nI am using the coca corpus for my term paper and I am a total beginner and suck at this. I wanted to research how brand names took over some words of our language, like how google became an actual word and so on. Now there is a word that has a homonym which means a complete different thing, is there some way to sort it out? I'd be really thankful if you can help me",
        "created_utc": 1536004580,
        "upvote_ratio": ""
    },
    {
        "title": "Origins of languages that use gendered nouns?",
        "author": "Heterozygoats",
        "url": "https://www.reddit.com/r/linguistics/comments/9cof32/origins_of_languages_that_use_gendered_nouns/",
        "text": "[removed]",
        "created_utc": 1536002911,
        "upvote_ratio": ""
    },
    {
        "title": "The origin of noun cases.",
        "author": "HoopoeOfHope",
        "url": "https://www.reddit.com/r/linguistics/comments/9cntpk/the_origin_of_noun_cases/",
        "text": "[removed]",
        "created_utc": 1535998740,
        "upvote_ratio": ""
    },
    {
        "title": "Can babies really learn a 2nd language with 10 min/ day exposure?",
        "author": "soulchikn",
        "url": "https://www.reddit.com/r/linguistics/comments/9cmpzo/can_babies_really_learn_a_2nd_language_with_10/",
        "text": "There's an English language school in my country which claims babies can learn English (by their method of course) with 1 hour of instruction a week.\n\nI live in a European country with a very low level of English fluency. This school that I'm talking about is a franchise of English language academies, and it's very, very popular. It caters to children as young as 3 months, up to 12 years old, and it's also super expensive.\n \nThis franchise's CEO (someone who supposedly is well-studied in pedagogy and developed their own \"method\") claims the high prices and low number of weekly hours are completely justified. **She says that she taught her own daughter English by speaking to her for only 10 minutes a day.** She claims her daughter, by the time she was a young child, was speaking English better (with 10 min exposure per day) versus adults who have been taking English classes for years.\n\nI wanted to ask - **is there any type of research or data to back up this claim, or refute it?** Are there any studies that look into how much time a young child needs to be exposed to a language per day in order to learn? My gut instinct tells me the claims of this CEO are not based on any actual research (I've yet to see this school show sources for this claim), so I wanted to see if anyone here could illuminate me. Thanks!",
        "created_utc": 1535991066,
        "upvote_ratio": ""
    },
    {
        "title": "This week's Q&amp;A thread -- please read before asking or answering a question! - September 03, 2018",
        "author": "AutoModerator",
        "url": "https://www.reddit.com/r/linguistics/comments/9clbqx/this_weeks_qa_thread_please_read_before_asking_or/",
        "text": "Do you have a quick question about language or linguistics that doesn’t merit its own thread? Our weekly Q&amp;A thread is the perfect place to post them! A new Q&amp;A thread goes up every Monday, but we have people who read them regularly throughout the week.\n\n**What counts as a “quick question”?**\n\nAny question that can be answered in a single comment and is unlikely to generate discussion is a quick question. While it’s impossible to predict which questions will generate disscussion all of the time, here are some examples: \n\n*Quick questions:*\n\n* Asking for an explanation of a technical term\n* Asking if there are any languages with a particular feature\n* Asking how we would transcribe something\n* Asking how a feature works in a particular language\n\n*Not-so-quick questions:*\n\n* Asking about the theoretical or methodological motivation for a particular claim\n* Asking for reading recommendations for a particular subject\n\nIf you’re not sure where your question belongs, just use your best judgment. The mods might ask you to move your question—but if so, it’s no big deal, and has nothing to do with the quality of the question.\n\nAlso, before asking a question, please be sure to check [**our FAQ**](https://www.reddit.com/r/linguistics/wiki/faqindex) and to do a quick Google or Wikipedia search. We’re happy to answer questions, but we appreciate it when people have tried to do some basic research first. You may also be interested in our [**reading list**](https://www.reddit.com/r/linguistics/wiki/readinglist).\n\n**Commenting rules**\n\nThe rules for commenting in this post are the same as for the rest of /r/linguistics. You don’t have to be a flaired user to answer questions, but we expect answers to reflect an expert level of knowledge. Please familiarize yourself with [**our commenting policy**](https://www.reddit.com/r/linguistics/comments/1u9xsr/reminder_of_the_rlinguistics_commenting_policy/) and [**our subreddit rules**](https://www.reddit.com/r/linguistics/wiki/rules).\n\n**What if I didn't get an answer to my question last week?**\n\nYour question probably wasn’t answered because no one who knew the answer saw it. This could be because you posted it soon before the new Q&amp;A thread went up, or it could be because it the answer requires specialist knowledge.  If this happens, feel free to repost your question in the new Q&amp;A thread, or to post it as a separate thread.",
        "created_utc": 1535979993,
        "upvote_ratio": ""
    },
    {
        "title": "Struggling uni student with a question about semantics (entailment)",
        "author": "godsmistakexxx",
        "url": "https://www.reddit.com/r/linguistics/comments/9cjpdt/struggling_uni_student_with_a_question_about/",
        "text": "I'm currently taking a course on linguistics in my university, and came across two situations regarding entailment that neither my teacher or the internet could explain to me in a way that I understood, so im hoping some of you guys could help :)\n\n* Some of Tom's children stayed behind when he left for work. At least one of Tom's children didn't stay behind when he left for work.\n* Helen used to be a member of the knitting club. Helen is no longer a member of the knitting club.\n\nBoth sentences from both scenarios apparently do not entail each other? I can't wrap my head around it at all. Thanks in advance for any help offered!!\n\n**EDIT**:  Basically I understand entailment as \"if X happens, then Y that follows it must as well.\", in which both statements share the same truth and don't contradict each other.",
        "created_utc": 1535962377,
        "upvote_ratio": ""
    },
    {
        "title": "Distribution of Word Lengths in Various Languages",
        "author": "[deleted]",
        "url": "http://www.ravi.io/language-word-lengths",
        "text": "[deleted]",
        "created_utc": 1535958509,
        "upvote_ratio": ""
    },
    {
        "title": "Significance of the Birch tree and its names in Indo-European languages and history?",
        "author": "slukeo",
        "url": "https://www.reddit.com/r/linguistics/comments/9cjajf/significance_of_the_birch_tree_and_its_names_in/",
        "text": "[removed]",
        "created_utc": 1535957773,
        "upvote_ratio": ""
    },
    {
        "title": "\"co-o\" pronounced as /kwɒ/ or /kwɔ/",
        "author": "finalbossofinterweb",
        "url": "https://www.reddit.com/r/linguistics/comments/9ciyr4/coo_pronounced_as_kwɒ_or_kwɔ/",
        "text": "[removed]",
        "created_utc": 1535954335,
        "upvote_ratio": ""
    },
    {
        "title": "Can concepts take on different word functions in different languages?",
        "author": "Hidnut",
        "url": "https://www.reddit.com/r/linguistics/comments/9cgtc9/can_concepts_take_on_different_word_functions_in/",
        "text": "I'm not a linguist so I'll try to elaborate with an imaginary example.  \n\n\nSuppose how in english, the word hungry is an adjective.  \nI am Hungry.  \n\n\nHowever in spanish, the concept of hunger is used as a noun.  \nYo tengo hambre.  \n(I have hunger)  \n\n\nAnyone else think it's neat how the same idea can inter-grammatically be articulated in different ways?  \n\n\nAre there languages that use what would be our familiar nouns/adjectives in english in varying ways? Hypothetical example, instead of saying \"That car is black\" (Subject Verb Adjective), you would say \"That car has black\" (Subjective verb noun). The above examples aren't bizarre, but can these grammatical objects be exotic to us, like a verb being conjugated based on the action being done rather than the subject of the sentence? (I suppose that is a new question, but I'd still like to know)",
        "created_utc": 1535933388,
        "upvote_ratio": ""
    },
    {
        "title": "Any database of sorts where I can find audio examples of as many English (British and American) accents as possible?",
        "author": "SpecialistGold",
        "url": "https://www.reddit.com/r/linguistics/comments/9cgdx2/any_database_of_sorts_where_i_can_find_audio/",
        "text": "I speak English fluently but not quite as a native. I am always fascinated by the myriad of accents out there and I would like to notice the difference betwen them more carefully.",
        "created_utc": 1535929470,
        "upvote_ratio": ""
    }
]