[
    {
        "title": "Is it weird that I hear the \"ing\" in English as /iŋ/ and not /ɪŋ/?",
        "author": "dong_chinese",
        "url": "https://www.reddit.com/r/linguistics/comments/1014igz/is_it_weird_that_i_hear_the_ing_in_english_as_iŋ/",
        "text": "Whenever I see an IPA transcription of English, I always see the \"ing\" sound transcribed as /ɪŋ/, but it seems strange to me because that is not how I perceive it, and I believe it is not how I pronounce it. To me, the vowel in \"ing\" sounds exactly like the FLEECE vowel.\n\nAs I hear it, the most noticeable difference between \"colloquial\" &lt;helpin'&gt; and \"proper\" &lt;helping&gt; is in the quality of the vowel, /hɛlpɪn/ vs /hɛlpiŋ/.\n\nHere's a recording of me saying the words \"pin peen ping helpin' helping English linguistics\": \n\n[https://vocaroo.com/1on1LpTZ2ycP](https://vocaroo.com/1on1LpTZ2ycP)\n\nI believe I pronounce it as /pɪn pin piŋ hɛlpɪn hɛlpiŋ iŋglɪʃ liŋgwɪstɪks/\n\nBut I've always seen these words transcribed as /hɛlpɪŋ ɪŋglɪʃ lɪŋgwɪstɪks/. I can say it that way if I want, but it sounds bizarre to me ([https://vocaroo.com/15fTlEuhio7L](https://vocaroo.com/15fTlEuhio7L)).\n\n* Am I actually pronouncing it as /ɪ/ and I'm not perceiving my own pronunciation correctly?\n* Do most people actually pronounce it as /ɪ/? Are my ears tricking me when I always hear it as /i/?\n* Am I pronouncing it an idiosyncratic way, or is it a normal dialectical variation? (I live in Texas, for what it's worth, but [I also am not a representative example of how people from my area speak](https://www.reddit.com/r/linguistics/comments/qe9iaf/apparently_i_have_a_foreign_accent_in_my_native/)).\n* As far as I know, there are no minimal pairs contrasting /iŋ/ and /ɪŋ/ in English. Is it accurate to say that they are allophones in this context?",
        "created_utc": 1672637710,
        "upvote_ratio": 1.0
    },
    {
        "title": "Common Sense",
        "author": "taush_sampley",
        "url": "https://www.reddit.com/r/linguistics/comments/10136eg/common_sense/",
        "text": "I did a poetry about a pet peeve of mine and thought you all would appreciate it\n\nThe sense of “common” found,   \nin “common sense” today,  \nis not the common sense,   \nwhich since did fade away;  \n—  \nA “common space” or “common place”,  \nis still a place to gather,  \nand with a quite uncommon sense,  \nboth mean “shared” together.  \n—  \nAnd now it’s clear, may-be you see,  \nwhen used without a care,  \nconcepts mingle – plain as day –  \na thing, if shared: not rare.  \n—  \nThe phrase today, when used to say  \n“you’re wrong” – not simply rude,  \nconsider now, the way it’s used,  \nis clearly to exclude.",
        "created_utc": 1672633525,
        "upvote_ratio": 1.0
    },
    {
        "title": "Linguists with dyslexia: how does it affect your study of linguistics?",
        "author": "jempai",
        "url": "https://www.reddit.com/r/linguistics/comments/10130yp/linguists_with_dyslexia_how_does_it_affect_your/",
        "text": "I got diagnosed with dyslexia rather late in life, and it makes a lot of my difficulties with language make sense in retrospect. I sing, and I use the international phonetic alphabet regularly. I consistently struggle with differentiating \\[e\\] and \\[ə\\]. Same with \\[y\\] and \\[ɥ\\] as well as \\[j\\] and \\[i\\]. \n\nAnyone here also have dyslexia? How does it affect language for you? Do you also struggle with IPA? Something else?",
        "created_utc": 1672633063,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is there a neurological term for \"Anger at language differences?\"",
        "author": "Clear-Seaweed-1800",
        "url": "https://www.reddit.com/r/linguistics/comments/1011oe9/is_there_a_neurological_term_for_anger_at/",
        "text": "My dad speaks with the American dialect, and he gets irrationally frustrated/angry when it comes to differences in United Kingdom dialect. \n\nMath vs. Maths\n\nCookies vs. Biscuits\n\nColor vs. Colour\n\nI think there was a specific term for irritation/frustration with words that we have learned and how we learn them, and the 'not-quite-right' feeling we get in our brains when we learn a slightly tweaked version of it, and I was wondering if I imagined that term?\n\nI feel like if we can put a label on the term, it would allow us to take steps so that he no longer becomes frustrated.\n\nAnd I understand \"hurdur Murica, he's just racist, He's just a stupid arrogant American!\"\n\nThose comments don't help, and they won't be funny to me. \n\nHe doesn't have a problem with UK he just doesn't understand why he gets frustrated when it come to linguistic differences for words he has learned a different way.\n\n If you don't know the answer it's okay not to know. \n\nIf it's a neurodivergent, or a \"human brains r weird in general when it comes to language\" thing I wanna do what I can to help him, \n\nthank you in advance!",
        "created_utc": 1672629045,
        "upvote_ratio": 1.0
    },
    {
        "title": "I found a congress of wugs at the mall",
        "author": "CaptainBlobTheSuprem",
        "url": "https://www.reddit.com/gallery/1011ez0",
        "text": "",
        "created_utc": 1672628272,
        "upvote_ratio": 1.0
    },
    {
        "title": "Best edition of Whorf’s “language, thought, and reality”?",
        "author": "bob-car",
        "url": "https://www.reddit.com/r/linguistics/comments/10114au/best_edition_of_whorfs_language_thought_and/",
        "text": "[removed]",
        "created_utc": 1672627394,
        "upvote_ratio": 1.0
    },
    {
        "title": "Vowel inventory guessing game!",
        "author": "TheOnionMan1",
        "url": "https://www.reddit.com/r/linguistics/comments/100z7bp/vowel_inventory_guessing_game/",
        "text": "Post the vowels from your native language (or even the native language of the country you live in) and let other guess what they are!",
        "created_utc": 1672622005,
        "upvote_ratio": 1.0
    },
    {
        "title": "Basque-Ainu Relation?",
        "author": "Revolutionforevery1",
        "url": "https://www.reddit.com/r/linguistics/comments/100v8er/basqueainu_relation/",
        "text": "I've been wanting to get my hands on the new Handbook of the Ainu Language &amp; before I get it I googled some things about the language; between the results layed a simple but stricking image comparing words from both languages semantophonetically (idk if that's the term but comparing them according to their meaning &amp; how they sound) some words have the exact same meaning &amp; look the same, idk about the pronounciations of both languages but the romanizations look very similar to each other.\n\n&amp;#x200B;\n\n[Here are some comparisons.](https://preview.redd.it/qq7zx304bi9a1.png?width=540&amp;format=png&amp;auto=webp&amp;s=ee61925e8b0d5a770523ef037dd5c4b47fd4a92d)\n\nIt's very strange to me. I just found a page talking about it so I'mma read it but I also want to know if others here are aware of this \"phenomenon\" if you could call it that.",
        "created_utc": 1672611604,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is that term or concept where it is implied something exists simply because it is mentioned?",
        "author": "invariablyuniquename",
        "url": "https://www.reddit.com/r/linguistics/comments/100v3i5/what_is_that_term_or_concept_where_it_is_implied/",
        "text": "it’s like implication of somethings existence just cause it’s said like:\n\n“I’ll be walking the dog at the park this afternoon” implies an existence of a dog with someone.\n\nBut what’s the term for it linguistically?",
        "created_utc": 1672611262,
        "upvote_ratio": 1.0
    },
    {
        "title": "why do we say Happy New YearS? is it possessive or plural?",
        "author": "eyeshitunot",
        "url": "https://www.reddit.com/r/linguistics/comments/100qaa9/why_do_we_say_happy_new_years_is_it_possessive_or/",
        "text": "And is this the only holiday or similar construction where we add the extra s?",
        "created_utc": 1672599012,
        "upvote_ratio": 1.0
    },
    {
        "title": "A pie eating contest where the prize is more pie",
        "author": "QtoAotQ",
        "url": "https://www.reddit.com/r/linguistics/comments/100onbw/a_pie_eating_contest_where_the_prize_is_more_pie/",
        "text": "This isn't really a linguistics question, but more relevant subreddits aren't very active, and I think people in this group might know how to find an answer. Does anyone know the origin of the saying \"X is like a pie eating contest where the prize is more pie\"? I've heard it said about careers in law and academia. A google n gram search of the last five words suggests it may have been a new phrase in the mid 70s, suggesting to me that it might be attributable to a particular writer.",
        "created_utc": 1672594706,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why Are English Consonant Cluster Lists Incomplete?",
        "author": "Legitimate-Plastic64",
        "url": "https://www.reddit.com/r/linguistics/comments/100ntxl/why_are_english_consonant_cluster_lists_incomplete/",
        "text": "Hi all.  Question in the title.  There are lots\\* of consonant clusters in modern English which I never see mentioned or discussed.  I haven't even been able to find what I\\* would consider even a semi-complete list of English consonant clusters. \n\nFor example, I never see the quad clusters /ndθs/  or /lfθs/  in thousandths and twelfths respectively.  I mean I at least hear words like that youtube science shows. They're not that rare when talking math or science. \n\nNot to mention a myriad of triple consonant clusters such as /dst/ like in \"hadst\" or \"amidst\".\n\nThis is just an observation of mine. Do I need to graduate to serious English phonology books to read more on this? or?",
        "created_utc": 1672592481,
        "upvote_ratio": 1.0
    },
    {
        "title": "The phonetics of /2023/",
        "author": "Supplementarianism",
        "url": "https://www.reddit.com/r/linguistics/comments/100nfep/the_phonetics_of_2023/",
        "text": "\"2023\"\n\nAs opposed to every other year I've lived, or in the future,\n\n\"2023\" seems to have an awkward sound to it.\n\nAny thoughts on this?",
        "created_utc": 1672591364,
        "upvote_ratio": 1.0
    },
    {
        "title": "what are speech acts?",
        "author": "needhelpwithschool2",
        "url": "https://www.reddit.com/r/linguistics/comments/100m4yu/what_are_speech_acts/",
        "text": "hello, I wanted to ask what the meaning of speech act. I'm still confused about its meaning. some people say that speech acts are speech that makes the listener into doing an action and some say that it is the action that you are doing while speaking",
        "created_utc": 1672587621,
        "upvote_ratio": 1.0
    },
    {
        "title": "help with some phrases from period films",
        "author": "lemonsaresosourx",
        "url": "https://www.reddit.com/r/linguistics/comments/100llkh/help_with_some_phrases_from_period_films/",
        "text": "hello. Was watching a couple of period films and one of the sentences that caught my attention was ‘please make my excuses’, asking to be excused from attending a social activity.\nThe second was ‘your father has requested you attend him in his study.’\nThird being ‘you must not mind my saying …’\n\nI do understand the meanings of all these sentences, yet the sentence structure seems odd to me. Could someone enlighten me 😊",
        "created_utc": 1672585969,
        "upvote_ratio": 1.0
    },
    {
        "title": "We Just Published Language Guessing Website, Langoguessr",
        "author": "Trsnaqe",
        "url": "https://www.reddit.com/r/linguistics/comments/100l614/we_just_published_language_guessing_website/",
        "text": "Hello fellow linguists! As a team of 2 university students, We're excited to announce the launch of LangoGuessr, a fun and engaging platform where you can test your knowledge of languages and music by guessing the language of a song. With a library of over 420,000 songs and over 70 languages, there's always something new to discover. Plus, we have both singleplayer and multiplayer modes, as well as leaderboards and certificates to earn. If you're interested in linguistics and want to challenge yourself to learn more about different languages and cultures, we think you'll love LangoGuessr. Give it a try and see how you do! \n\nPlease note that this website is just launched with enourmous amount of musics so please consider reporting if you come across wrong/unavailable music.\n\n[Challenge Yourself!](http://langoguessr.com/)",
        "created_utc": 1672584627,
        "upvote_ratio": 1.0
    },
    {
        "title": "Do Nations Actually Have Names?",
        "author": "TheObserverO2O",
        "url": "https://www.reddit.com/r/linguistics/comments/1009z42/do_nations_actually_have_names/",
        "text": "(Rewrite of previous removed post, because this is about the precise meaning of terms, not just matching words)\n\nThe google definition of a nation is \"a large body of people united by common descent, history, culture, or language, inhabiting a particular country or territory.\" In other words, about the people not their territory (and some like traveling peoples [ex. Roma] don't even have one), but it seems to me there aren't words for directly naming the nation itself as a corporate entity independent of territory or state, and I don't mean national identity as a quality (ex. Italianness or \"Italian\") nor its people in a counted sense (one Italian, two Italians). I mean something like \"Italia,\" except that means either the country (not the same as the nation) or \"land of Italians.\" Suffixes like -ia, -land, -heim, etc all seem to refer to the territory, though -ia can also refer to collections of things (militaria) or abstract nouns (familia in Latin). \n\nSo can English/Latin/Greek actually name the nation itself? Could maybe stem + -ia be used to name the nation as distinct from the territory or state?",
        "created_utc": 1672540628,
        "upvote_ratio": 1.0
    },
    {
        "title": "Has anyone tried to reconstruct the proto languages of the different modern Arabic dialects ?",
        "author": "abdu11",
        "url": "https://www.reddit.com/r/linguistics/comments/1009q1u/has_anyone_tried_to_reconstruct_the_proto/",
        "text": "Has anyone tried to reconstruct the different proto languages of the different linguistic groups of modern Arabic dialects ? Like proto Maghrebi Arabic or proto Levantine Arabic.",
        "created_utc": 1672539752,
        "upvote_ratio": 1.0
    },
    {
        "title": "A story in Proto Dravidian: The King and the God. Please review linguistics for corrections.",
        "author": "AbhiN1289",
        "url": "https://youtu.be/xjyOzs_1dKg",
        "text": "",
        "created_utc": 1672521666,
        "upvote_ratio": 1.0
    },
    {
        "title": "Has anyone tried to reconstruct common Chinese? Or protolanguages of Chinese sub-branches such as Mandarin and Cantonese?",
        "author": "TennonHorse",
        "url": "https://www.reddit.com/r/linguistics/comments/1000ruk/has_anyone_tried_to_reconstruct_common_chinese_or/",
        "text": "Has anyone reconstructed proto-Mandarin, proto-Cantonese, proto-Hakka etc?",
        "created_utc": 1672512381,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does anyone have a list of all the English syllable structures?",
        "author": "e-adell",
        "url": "https://www.reddit.com/r/linguistics/comments/zzwktu/does_anyone_have_a_list_of_all_the_english/",
        "text": "Looking for the C/V phonological structures, I can find plenty of then but I can’t find a comprehensive list. I want to make sure i’ve got them all haha.",
        "created_utc": 1672500753,
        "upvote_ratio": 1.0
    },
    {
        "title": "Question: Is there a name for the linguistic phenomenon of English speakers adding an “‘s” to the end of restaurant names?",
        "author": "Dancing_WithTheTsars",
        "url": "https://www.reddit.com/r/linguistics/comments/zztosk/question_is_there_a_name_for_the_linguistic/",
        "text": "For example, people calling Hop Li “Hop Li’s” or Julio “Julio’s”. It’s ubiquitous! What’s this phenomenon called??",
        "created_utc": 1672491864,
        "upvote_ratio": 1.0
    },
    {
        "title": "Linguistics-fiction. Might a spoken language be born in a community of signing people?",
        "author": "viktorbir",
        "url": "https://www.reddit.com/r/linguistics/comments/zzetgx/linguisticsfiction_might_a_spoken_language_be/",
        "text": "I mean, we know that groups of deaf people born in speaking people environments develop naturally sign languages (Bedouins in southern Israel, kids in Nicaragua...).\n\nNow imagine you have a community in which 100% of the people is deaf. Due to some cataclysm they lose all contact with the outside. They'll have kids. These kids, of course, will learn the signed language. But many of them will not be deaf.\n\nDo you think it would be possible for them the develop an oral language? In how many generations? Would it be in any way influenced by the signed language? Would the signed language be a substrate of it?\n\nPS. Sorry if this is too speculative, but as there was that question about monogenesis of language I've started thinking and thinking and this (im)possible situation has come to my mind.",
        "created_utc": 1672442591,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is there a beautiful word in any language that refers to the meeting of light and water (ideally the ocean)? Like sunlight infusing the ocean, or an ocean full of sunlight, or the pale but bright blue color associated with this?",
        "author": "Helpful-Knowledge-1",
        "url": "https://www.reddit.com/r/linguistics/comments/zze4us/is_there_a_beautiful_word_in_any_language_that/",
        "text": "\"Horizon\" isn't quite close enough.",
        "created_utc": 1672440881,
        "upvote_ratio": 1.0
    },
    {
        "title": "Searching for a word similar to \"synesthesia\" but for dancers/choreographers who can match the exact \"feeling\" of the music/drums to physical movements because we LITERALLY feel the music in our body.",
        "author": "swingthatwang",
        "url": "https://www.reddit.com/r/linguistics/comments/zzdb1p/searching_for_a_word_similar_to_synesthesia_but/",
        "text": "Is there such a word? Or is it just regular ole \"synesthesia?\" Thank you.",
        "created_utc": 1672438777,
        "upvote_ratio": 1.0
    },
    {
        "title": "How far could I go back in time and still understand English speakers?",
        "author": "yankees032778",
        "url": "https://www.reddit.com/r/linguistics/comments/zzb18o/how_far_could_i_go_back_in_time_and_still/",
        "text": "I know that the English language has evolved and changed dramatically over the last several hundred years. If I were to go back in time, at what point would I not be able to understand English speakers? Is it feasible that we'd be able to understand English speakers in 1600s and 1700s colonial America? What about even earlier than that?",
        "created_utc": 1672433163,
        "upvote_ratio": 1.0
    },
    {
        "title": "American Pronunciation 1800s",
        "author": "ThatUserNameIsStupid",
        "url": "https://www.reddit.com/r/linguistics/comments/zz99ze/american_pronunciation_1800s/",
        "text": "Hi! I was asked to read aloud a letter (or an account) written in 1836 by a woman from Missouri. I want to do a proper reading by pronouncing her words as close as she would have. Is there a reference that I can look at or listen to? Any ideas would be appreciated!",
        "created_utc": 1672428853,
        "upvote_ratio": 1.0
    },
    {
        "title": "Found in the New York Public Library - Rose Main Reading Room. Quoted from John Milton in 1643",
        "author": "MaraudngBChestedRojo",
        "url": "https://i.redd.it/tvlwxr0ee49a1.jpg",
        "text": "",
        "created_utc": 1672425073,
        "upvote_ratio": 1.0
    },
    {
        "title": "Proposal: The United African Phonetic Alphabet",
        "author": "wenitte",
        "url": "https://blog.mandla.app/p/the-united-african-phonetic-alphabet",
        "text": "",
        "created_utc": 1672416923,
        "upvote_ratio": 1.0
    },
    {
        "title": "will ʁ and ʀ hurt me",
        "author": "x-anryw",
        "url": "https://www.reddit.com/r/linguistics/comments/zz0cxm/will_ʁ_and_ʀ_hurt_me/",
        "text": "is my uvula going to hurt if I say ʀ and ʁ?",
        "created_utc": 1672406392,
        "upvote_ratio": 1.0
    },
    {
        "title": "Learning Ukrainian / Help with decoding language barrier in the meantime",
        "author": "Key_Record_4071",
        "url": "https://www.reddit.com/r/linguistics/comments/zyzj1g/learning_ukrainian_help_with_decoding_language/",
        "text": "I have a fairly new friendship with a Ukrainian person. There have been several instances in which it seems I’m upsetting her, and I have no idea why. I’m so worried that the friendship will come to an end because she believes I’m saying something I’m not and vice versa. \n\nWe communicate mostly in Telegram, \nIt seems we do okay when I send in English and she sends in Ukrainian. Using the built in translator seems to works fine. Sometimes I copy and paste into google, and it for the most part reads the same. \n\nIt’s when she writes me in English, I don’t know what’s going on, but she comes off as being rude and almost cruel. I’ll try to ask about this and the situation becomes uglier. \n\nAny feedback would be greatly appreciated. Thank you.",
        "created_utc": 1672403790,
        "upvote_ratio": 1.0
    },
    {
        "title": "Puzzle time #4",
        "author": "SpielbrecherXS",
        "url": "https://www.reddit.com/r/linguistics/comments/zyxudv/puzzle_time_4/",
        "text": "Hello again. Hope you had a wonderful X-mas and wish you a Happy New Year!\n\nHave fun with these!  \n\n\nPuzzle #1\n\nYou have a set of numerals from several Polynesian languages:\n\nhttps://preview.redd.it/xy7frwmnk09a1.png?width=839&amp;format=png&amp;auto=webp&amp;s=1ea075af3d142421cce9f669c61863067135d45f\n\nFill in the blanks.\n\n&amp;#x200B;\n\nShort answer:\n\n&gt;!Hawaiian: 3 — kolu, 9 — iwa;\nMaori: 5 — rima;\nNorth Marquesan: 2 — ‘ua, 5 — ‘ima, 7 — hitu, 9 — iva;\nRarotongan: 2 — rua, 3 — toru;\nSamoan: 3 — tolu, 4 — fa, 8 — valu!&lt;\n\nMy thinking:\n\n&gt;!1. Correlations for vowels, /n/ and /m/ seem trivial, so we can assume these remain the same across the languages.!&lt;\n\n&gt;!2. /k/ appears in Hawaiian only and is always correlated with /t/ in all others.!&lt;\n\n&gt;!3. Correlations between /l/, /r/, and /‘/ also seem pretty straightforward: /l/ in Hawaiian and Samoan, /r/ in Maori and Rarotongan, and /’/ in N. Marquesan, giving us words for 2: \\*’ua in N Marquesan  and \\*rua in Rarotongan; words for 3: \\*kolu in Hawaiian (k/t correlation, as discussed above), \\*toru in Rarotongan, and \\*tolu in Samoan; as well as words for 5: \\*rima in Maori and \\*’ima in N. Marquesan.!&lt;\n\n&gt;!4. The correlations between h/wh/v/’/f/s seem like a mess there has been some convergence of sounds. We have two outlier sounds that don’t appear in many words: /s/ in Samoan “tasi” (1) and /wh/ in Maori, in words for 4 and 7. And the third group is words for 8 and 9, which are the only ones where /v/ appears.!&lt;\n\n&gt;!Therefore, the system for /s/ is: /h/ in most languages, /’/ in Rarotongan, and /s/ in Samoan.!&lt;\n\n&gt;!The system for /wh/ is: /h/ in Hawaiian and N. Marquesan, /wh/ in Maori, /’/ in Rarotongan, and /f/ in Samoan, i.e. 7 in N. Marquesan is \\*hitu, and 4 in Samoan is \\*fa.!&lt;\n\n&gt;!The system for /v/ is: /w/ in Hawaiian and Maori, /v/ in the rest, i.e. 9 is \\*iwa in Hawaiian and \\*iva in N. Marquesan, and 8 in Samoan is \\*valu.!&lt;\n\n&amp;#x200B;\n\n&amp;#x200B;\n\nPuzzle #2\n\nThese are month names in Armenian in random order:\n\nhttps://preview.redd.it/iecpopmtl09a1.png?width=710&amp;format=png&amp;auto=webp&amp;s=e7d4d861f1e64ec4eef947db8e03c6b89d94d304\n\nWrite the corresponding names in English. For an added challenge, give an approximation of the readings in Armenian. There is no way to determine the exact readings from these data, but it is possible to get quite close!\n\n&amp;#x200B;\n\nShort answer:\n\n&gt;!1) August (ogostos), 2) February (fetrvar), 3) July (hyulis), 4) June (hyunis), 5) December (dektember), 6) May (mayis), 7) January (hyunvar), 8) November (noyember), 9) April (april), 10) October (hoktember), 11) March (mart), 12) September (september)!&lt;\n\n&gt;!(The first /o/ in August is the initial position variant, not a separate letter)!&lt;\n\n&amp;#x200B;\n\nMy thinking:\n\n&gt;!1. Find four -ber words: ##5, 8, 10, and 12 here. Let’s assume a letter-by-letter correspondence with -ember, especially since the repeated /e/ seems to confirm it.!&lt;\n\n&gt;!2. Look for the two M- months: ##6 and 11. Using the letters we already have, we read #11 as M\\*r\\*. The second letter is the same in #6, so let’s assume it’s /a/.!&lt;\n\n&gt;!3. We could assume the last letter in March was /ch/, but we see in in three of our -ber months: #5 (\\*e\\*ch?ember), #10 (\\*\\*\\*ch?ember), and #12 (\\*e\\*ch?ember), meaning it’s more likely to read /t/.!&lt;\n\n&gt;!4. ##5 and 12 both have three /e/’s in them, meaning they are probably December and September, with their third letters probably /k/ and /p/, respectively. Meaning #10 (\\*\\*k?tember) is probably October, leaving November for #8. Which gives us letters for /o/ (from both October and November), /n/, and /v/, presumably.!&lt;\n\n&gt;!5. Let’s write out the months with the letters we now have:!&lt;\n\n&gt;!1) \\*\\*ostos, 2) \\*etr\\*ar, 3) \\*o\\*\\*\\*s, 4) \\*o\\*n\\*s, 5) \\*dektember, 6) mav\\*s, 7) \\*o\\*n\\*ar, 8) november, 9) apr\\*\\*, 10) \\*oktember, 11) mart, 12) september!&lt;\n\n&gt;!\\#9 seems to be April, giving as /i/ and /l/ and allowing to read #3 as \\*o\\*lis and 4) \\*o\\*nis. These seem to be July and June. The first letter is unlikely to read /y/ or /ʒ/, since October also starts with it. Possibly, a /h/?!&lt;\n\n&gt;!6. This leaves us with #1 (\\*\\*ostos), #2 (\\*etr\\*ar) and #7 (\\*o\\*n\\*ar) with the meanings of August (\\*gostos), February (fetru?ar), and January (hu?nu?ar) by process of elimination.!&lt;\n\n&gt;!7. The second and third letters of June and July, a combination also seen in January, appear to be either a digraph or a diphthong, probably reading /yu/ (since we have another /u/ candidate in January and February).!&lt;\n\n&gt;!9. The revised readings 1) \\*gostos, 2) fetruar, 3) hyulis, 4) hyunis, 5) dektember, 6) mavus, 7) hyunuar, 8) november, 9) april, 10) hoktember, 11) mart, 12) september. I can’t see any way to determine the reading of the first letter in August, although it can be some phonetic variation of /o/.!&lt;\n\n&gt;!(As you can see, I was slightly off, taking the letter for /v/ to read /u/ and the letter for yot to read /v/)!&lt;",
        "created_utc": 1672398041,
        "upvote_ratio": 1.0
    },
    {
        "title": "Books on Hebrew/Yiddish?",
        "author": "Accurate_Soup_7242",
        "url": "https://www.reddit.com/r/linguistics/comments/zyxg3c/books_on_hebrewyiddish/",
        "text": "I’ve only recently heard through friends that prior to the founding of the state of Israel, Hebrew really wasn’t spoken in everyday conversation, and since the founding of Israel there is noted concern from some that Hebrew is supplanting Yiddish entirely. I have no idea if this is true but think it’s an interesting concept — basically an ancient language being pulled off the shelf into the modern day — and was hoping to learn more. Can anyone recommend any books on the issue? Thanks.",
        "created_utc": 1672396626,
        "upvote_ratio": 1.0
    },
    {
        "title": "Chat GPT fell for a classic translation trap, but surprisingly it was able to figure it out without any hints!",
        "author": "TangledPangolin",
        "url": "https://i.redd.it/14tie05xg09a1.png",
        "text": "",
        "created_utc": 1672395538,
        "upvote_ratio": 1.0
    },
    {
        "title": "I tricked ChatGPT with a classic translation trap, but it was surprisingly able to fix it with very few hints!",
        "author": "TangledPangolin",
        "url": "https://i.redd.it/f1upbdhhg09a1.png",
        "text": "",
        "created_utc": 1672395407,
        "upvote_ratio": 1.0
    },
    {
        "title": "I hit ChatGPT with a classic beginner translation trap. I had to nudge it a little, but ChatGPT actually figured it out!",
        "author": "TangledPangolin",
        "url": "https://i.redd.it/u5czsxa1f09a1.png",
        "text": "",
        "created_utc": 1672394930,
        "upvote_ratio": 1.0
    },
    {
        "title": "From where did Balto Slavic got the term 'Indraja'? Did the Indo Iranians took it from BMAC and gave it?",
        "author": "Leading-Okra-2457",
        "url": "https://www.reddit.com/r/linguistics/comments/zywx2j/from_where_did_balto_slavic_got_the_term_indraja/",
        "text": "🧐🤔",
        "created_utc": 1672394687,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why is old writing so convoluted?",
        "author": "RandumGoy",
        "url": "https://www.reddit.com/r/linguistics/comments/zyuuew/why_is_old_writing_so_convoluted/",
        "text": "So, for context, I've been looking through a multitude of ancient religious scriptures and writings by aristocracy and it's left me wondering, why are their writings so intentionally convoluted? There's so much redundant phrasing and confusing sentence structures that It leaves me wondering if it's intentionally difficult to read. Thoughts?",
        "created_utc": 1672387292,
        "upvote_ratio": 1.0
    },
    {
        "title": "My niece who’s never lived in New Jersey has a Jersey accent",
        "author": "cjdjfjfjd",
        "url": "https://www.reddit.com/r/linguistics/comments/zyso4w/my_niece_whos_never_lived_in_new_jersey_has_a/",
        "text": "Our family is from the deep South and most of us have a strong southern twang. We sound like hicks. The cool thing about my 11 year old niece is she has a Jersey accent. It’s always been that way.\n\nHer dad’s side of the family are from New Jersey, but her mom and dad divorced when she was young. The perplexing part is she never grew up in the northeast and wasn’t around her dad’s family much growing up. She picked it up on her own.\n\nI find it kinda neat. People ask us if she grew up there and we’re like “Nope, that’s how she’s always spoke since she was a toddler.”\n\nI always thought environment dictated how we speak but I kind of wonder if there’s a genetic competent in there somewhere. Idk",
        "created_utc": 1672379852,
        "upvote_ratio": 1.0
    },
    {
        "title": "Use Machine Learning To improve the reading for L2 English Readers",
        "author": "Striking-Warning9533",
        "url": "https://www.reddit.com/r/linguistics/comments/zys25x/use_machine_learning_to_improve_the_reading_for/",
        "text": " \n\n# \n\n&amp;#x200B;\n\nHi, I am a computer science student, and I am a non-native speaker myself. I think it will be interesting to use ML to help L2 readers. I have a few ideas and considering publishing some of them as an academic papers. However, I am not a linguistic or social science student. So I am not sure how to conduct an experiment to test if the approach is efficient.\n\nI read a paper that made questions on an article by another group of students and allowed subjects to take notes during the reading. However, this might be biased because of the questions they made, and also it might be influenced by note-taking skills.\n\nIf you are a teacher, what will you use to test the subject's English reading skills?\n\n(since the info you provide might be included in my paper, so you can note if you want to appear in the acknowledge part if I used your advice)",
        "created_utc": 1672377959,
        "upvote_ratio": 1.0
    },
    {
        "title": "My wife got a job in the Netherlands and now I need to learn Dutch... except I don't have a uvula. Am I screwed?",
        "author": "Adm_Bobbery",
        "url": "https://www.reddit.com/r/linguistics/comments/zyrceb/my_wife_got_a_job_in_the_netherlands_and_now_i/",
        "text": "I need to learn Dutch but I learned very quickly how guttural a lot of the language is. I'm afraid I'm not going to be able to speak the language effectively enough since I don't possess a uvula and cannot make guttural sounds. Are there alternative ways to produce the sound that will be good enough?",
        "created_utc": 1672375860,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why does word order change in English when making a statement vs. asking a question?",
        "author": "Phoenixrjacxf",
        "url": "https://www.reddit.com/r/linguistics/comments/zyptd2/why_does_word_order_change_in_english_when_making/",
        "text": "[removed]",
        "created_utc": 1672371307,
        "upvote_ratio": 1.0
    },
    {
        "title": "Question on the definition of words and how they change",
        "author": "moonlightsonata88",
        "url": "https://www.reddit.com/r/linguistics/comments/zypq9h/question_on_the_definition_of_words_and_how_they/",
        "text": "If this post does meet the requirements for the sub I apologize.\n\nI learned from reading that words have different types of meanings and there are different ways to classify these meanings. I am mostly curious about these: Semantic meaning, colloquial meaning, and the definition of a word.\n\nIf I'm understanding correctly. Meaning and definition have a similar relationship to subjectivity and objectivity. \n\nMeaning is subjective and the definition is objective. \n\nIf I have a fruit. I call it an apple. I show my fruit to you and you call it an orange. \n\nMeaning would be the cultural difference between you calling it an orange and me calling it an apple. (I'm sure a pedestrian way of thinking about it)\n\nThe definition would be the elements of the fruit that make it what it is. A red fruit, that bears seeds, comes from a tree and tastes sweet. (again pedestrian)\n\nTake this and adapt it to words and that's the difference between meaning and definition to my knowledge.\n\nIf I am not mistaken (which I ok with being I'm here to learn), the meaning of a word can change rather rapidly over a few years. Thank you internet.\n\nThese new meanings that don't die out as quickly as they are created may eventually be added to a word's definition (in something like a textbook or dictionary). \n\nThe process of changing a word's definition is much slower and occurs less frequently. \n\nAm I anywhere even close to the mark?",
        "created_utc": 1672371061,
        "upvote_ratio": 1.0
    },
    {
        "title": "Alphabet",
        "author": "Usual-Effort5025",
        "url": "https://www.reddit.com/r/linguistics/comments/zyoh6u/alphabet/",
        "text": "Hi Reddit, I made an alphabet for English with different runes and I was wondering if there was a website that I could make a keyboard for it with? Kind of like Unicode.",
        "created_utc": 1672367536,
        "upvote_ratio": 1.0
    },
    {
        "title": "Use of \"But\" in a question",
        "author": "Hotel_Arrakis",
        "url": "https://www.reddit.com/r/linguistics/comments/zyo4i8/use_of_but_in_a_question/",
        "text": "I am a fan of the British TV show \"The Big Fat Quiz Of ...\".  Quite often when a celebrity questioner asks a question, they introduce the topic and then say \"But, can your team tell me....\".  The \"But\" seems unnecessary and slightly jarring.\n\nIs it:\n\n* A British English thing (I'm American)\n* A common pub quiz format\n* An idiosyncrasy of the writers of The Big Fat Quiz\n* Common across all English speaking countries and I'm an idiot",
        "created_utc": 1672366592,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does Neapolitan vowel reduction have any unique reason?",
        "author": "LoverofCorn",
        "url": "https://www.reddit.com/r/linguistics/comments/zyo3fj/does_neapolitan_vowel_reduction_have_any_unique/",
        "text": "For context, in Neapolitan, unstressed e, a, and o all become [ə], as in fierro /ˈfjerə/. What caused this specifically in Neapolitan?",
        "created_utc": 1672366514,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is a Harvard professor inflating figures? Puzzling data on the number of Swahili speakers",
        "author": "Long_Drive",
        "url": "https://www.reddit.com/r/linguistics/comments/zynmru/is_a_harvard_professor_inflating_figures_puzzling/",
        "text": "I'm a political science doctoral candidate doing my dissertation on the effectiveness of assimilationist language policies. A large part of this involves trying to figure out how many speakers a language has or had at various points in time over the last 100 years. I've been wanting to make Tanzania's experience with the promotion of Swahili one of my case studies. However, I am utterly confused as to how some of these language numbers are calculated, and why Wikipedia cited one specific estimate.\n\nHere are the sources that have guided my understanding of the number of Swahili speakers throughout time, though having pre-1969 estimates on the number of Swahili speakers could be a massive help. \n\n  \n\n\n* (1969 *in Ethnologue 7th Ed.*) --- **13 million**. It does not specify whether these are L1 or L2 speakers, though. No further citation.\n   * All countries, “including Tanzania and Kenya”\n   * Looking at another example in the 7th Ed. of Ethnologue, the number of Bahasa Indonesia (Indonesian) speakers is at 6.7 million. Fast forward to the 10th edition, published 15 years later, the 6.7 million figure has not changed, but the number of L2 speakers is in parentheses next to it, at 110 million. Ethnologue typically likes to have the first number they cite be that of L1 speakers, and later present L2 speaker figures after that. A similar dynamic can be seen with Russian in the USSR. The 7th Edition puts the number of Russian speakers at 114,114,000. The 10th Edition cites the 1979 census to update this to 137,397,000 L1 speakers, with an additional \\~133 million L2 speakers worldwide. Using these examples in the case of Swahili doesn’t work though, since it tells us that there should be \\~13 million L1 speakers of Swahili between Kenya and Tanzania. The 10th Edition is clear that there are 1.3 million L1 speakers with 20-30 million L2 speakers total.\n* (1980 - United Bible Societies *in Ethnologue 10th Ed.*) --- 1.3 million L1 speakers\n   * All countries\n* (1980 - Center for Applied Linguistics *in Ethnologue 10th Ed.*) --- 20-30 million L2 speakers \n   * All countries\n* ~~(1980 - United Bible Societies~~ *~~in Ethnologue 10th Ed. &amp; 13th Ed.~~*~~) --- 12 million L1 &amp; L2 speakers~~\n   * ~~Kenya only~~\n* (1982 Polome *in Ethnologue 13th Ed. &amp; 15th Ed.*) --- 313,200 monolinguals\n   * **Tanzania only**\n* (1989 Holm *in Ethnologue 13th Ed.*) --- 5 million L1 speakers worldwide &amp; 30 million L2 speakers worldwide\n   * All countries\n* ~~(1994 I. Larsen BTL~~ *~~in Ethnologue 13th Ed. &amp; 15th Ed.~~*~~) --- 131,000 (L1 or monolingual)~~\n   * ~~Kenya only~~\n* (2000 World Christian Database *in Ethnologue 15th Ed.*) --- 540,837 L1 speakers &amp; 30 million L2 speakers\n   * **Tanzania only.** There are signs that the WCD figures are highly conservative. For example, the entry under Uganda sets the number of L1 speakers at 2,330, but notes that “the government plans to make this a mandatory subject in schools”.\n* (2000 World Christian Database *in Ethnologue 15th Ed.*) --- 772,642 L1 speakers\n   * All countries\n* ~~(2000 World Christian Database~~ *~~in Ethnologue 15th Ed.~~*~~) --- 2,330 L1 speakers~~\n   * ~~Uganda only~~\n* (2015 D. Nurse *in Ethnologue 25th Ed.*) --- 15 million L1 speakers &amp; 32 million L2 speakers\n   * **Tanzania only**\n* ~~(2019 Census~~ *~~in Ethnologue 25th Ed.~~*~~) --- 111,000 L1 speakers &amp; 19 million L2 speakers~~\n   * ~~Kenya only~~\n* ~~(2019 Census~~ *~~in Ethnologue 25th Ed.~~*~~) --- 2 million L1 speakers &amp; 9.1 million L2 speakers~~\n   * ~~DRC only.~~ Ethnologue actually classifies this differently compared to the Swahili spoken elsewhere. Nonetheless, Ethnologue still (I think, their number accounting is off) includes the DRC figures in their total number of Swahili *macrolanguage* speakers.\n* (2019 *in Ethnologue 25th Ed.*) --- **16,056,000 L1 speakers and 55,360,000 L2 speakers. Or 71,416,500 total**.\n   * All countries. If counting Swahili macrolanguage speakers, there are 18,099,500 L1 speakers or 82,559,500 total. *But this is the most liberal of all estimates.*\n* ~~(2019 in~~ *~~Ethnologue 25th Ed.~~*~~) --- 274,000 L1 (assumed) speakers~~\n   * ~~Somalia only.~~ The rest of the countries listed as established for Swahili in Ethnologue-- Burundi, South Africa, Mozambique, and Uganda, all have very negligible L1 speaker numbers.\n\nHere’s where it gets even spicier. Doing a quick Google search for the number of Swahili speakers, you get to the figure of 200 million provided by Wikipedia. This number is cited in a number of other articles, including in smaller UN reports. The Wikipedia citation for this comes from [an article](https://theconversation.com/the-story-of-how-swahili-became-africas-most-spoken-language-177259#:~:text=Once%20just%20an%20obscure%20island,boast%20over%20200%20million%20users.) posted in The Conversation by Dr. John Mugane from Harvard in February 2022, which is an edited excerpt from his 2015 book titled “The Story of Swahili”, which I briefly skimmed. In the first paragraph of the first chapter, he states “It \\[Swahili\\] is a peer to the dozen or so languages that boast close to 100 million users.” So about a 50% lower estimate than what he cites in his own article. The footnote next to this figure is interesting: “*The  World  Bank estimates that  120  to  150  million people speak  Swahili as a  second language; William J. Frawley (2003, 181) puts the number at a minimum of 75 million, and Ethnologue has it as 40 million. This book takes the higher number as closer to reality, given that Swahili is well known as a lingua franca in countries whose populations far exceed 150 million.*”\n\nI have requested the Frawley source from interlibrary loans, but I won’t get to it for another several weeks. The World Bank source, on the other hand, I cannot find at all. Mugane doesn’t cite it in his bibliography.\n\nThe second source cited in Wikipedia for the 200 million figure comes from Stanford, from December 2016 per the Wayback Machine. However, this source seems to put the figure at 100 rather than 200 million, while noting that “*it is not unrealistic to say that the numbers are much higher*”. It also states “*Another significant fact is that a vast majority of the 100 million plus speakers of Swahili speak other first languages. The number of its native speakers has been conservatively placed at just under 2 million.*” \n\n**My questions are:**\n\n* Did Dr. Mugane inflate his own estimate from 100 million to 200 million for an article in The Conversation?\n* Where is this World Bank data?\n* Why did Wikipedia cite the highest number possible when it cites the more specific Ethnologue figures on the right side sidebar (83M)? \n* Furthermore, how should I make sense of these wildly varying estimates from Ethnologue? Would it be correct to assume that the most recent (25th) edition has estimates that most closely reflect reality today?",
        "created_utc": 1672365298,
        "upvote_ratio": 1.0
    },
    {
        "title": "Since there's been several threads about French languages (including Oïl languages), here's a short 4 min summary of the sociolinguistic state of the Gallo language, presented in Gallo. Subtitles in Gallo, Breton and French.",
        "author": "paniniconqueso",
        "url": "https://www.youtube.com/watch?v=0Uj1C_1gNZE",
        "text": "",
        "created_utc": 1672356750,
        "upvote_ratio": 1.0
    },
    {
        "title": "Rajasthani features",
        "author": "CurrentIndependent42",
        "url": "https://www.reddit.com/r/linguistics/comments/zyh3i5/rajasthani_features/",
        "text": "Regardless of what we consider Rajasthani to be (a language, multiple languages, or the d-word), are there any specifically unifying features - at least largely common to Rajasthani variants and at least very uncommon outside them?",
        "created_utc": 1672349468,
        "upvote_ratio": 1.0
    },
    {
        "title": "what are the best arguments against monogenesis of language",
        "author": "NoNebula6",
        "url": "https://www.reddit.com/r/linguistics/comments/zyerod/what_are_the_best_arguments_against_monogenesis/",
        "text": "I like the idea of monogenesis, but is there anything that goes against it",
        "created_utc": 1672343956,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why is \"lost and found\" not an isocolon?",
        "author": "MimiKal",
        "url": "https://en.m.wikipedia.org/wiki/Isocolon",
        "text": "[removed]",
        "created_utc": 1672338584,
        "upvote_ratio": 1.0
    },
    {
        "title": "What linguistic features can you see in this child's writing?",
        "author": "russian_hacker_1917",
        "url": "https://i.redd.it/nnb22nsz4v8a1.jpg",
        "text": "",
        "created_utc": 1672333180,
        "upvote_ratio": 1.0
    },
    {
        "title": "Are there other languages besides Latin that associate North or the North Wind with an eagle?",
        "author": "nomenmeum",
        "url": "https://www.reddit.com/r/linguistics/comments/zya0o6/are_there_other_languages_besides_latin_that/",
        "text": "In Latin,\n\nAquila eagle\n\nAquilo North, the North Wind",
        "created_utc": 1672332701,
        "upvote_ratio": 1.0
    },
    {
        "title": "I had to read the article to know that the subpoena wasn't \"dropped\" like a new song release.",
        "author": "stooftheoof",
        "url": "https://i.redd.it/zqjf2ca06v8a1.png",
        "text": "",
        "created_utc": 1672331526,
        "upvote_ratio": 1.0
    },
    {
        "title": "How many phonemes are possible to articulate but no one language (alive or dead) contains them?",
        "author": "Old_time_turtle",
        "url": "https://www.reddit.com/r/linguistics/comments/zy8pv7/how_many_phonemes_are_possible_to_articulate_but/",
        "text": "There are many phonemes present in just a handful of languages, but I wonder which ones could not he found in a single language, or even not in the past.",
        "created_utc": 1672329461,
        "upvote_ratio": 1.0
    },
    {
        "title": "Would it be technically possible to create a new spoken language using only the vocal sounds available in the green segment, then teach that language to dogs, and then converse with dogs? Somebody come get this Nobel prize.",
        "author": "BARRYTHUNDERWOOD",
        "url": "https://i.redd.it/9i6nezixcw8a1.jpg",
        "text": "",
        "created_utc": 1672327725,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is it possible to have conlanging as a directed study? Or a thesis? Has anyone done it before?",
        "author": "AdParking9347",
        "url": "https://www.reddit.com/r/linguistics/comments/zy7i6x/is_it_possible_to_have_conlanging_as_a_directed/",
        "text": "Is this a possibility?",
        "created_utc": 1672326292,
        "upvote_ratio": 1.0
    },
    {
        "title": "Transcribing Philippine Language to IPA",
        "author": "secretpjs",
        "url": "https://www.reddit.com/r/linguistics/comments/zy0tik/transcribing_philippine_language_to_ipa/",
        "text": "anyone here could help me transcribe Philippine language to IPA??? I will DM you thank you so much in advance! :&gt;&gt;",
        "created_utc": 1672304885,
        "upvote_ratio": 1.0
    },
    {
        "title": "American Accent Mid 1800s",
        "author": "High_Fly_Flow",
        "url": "https://www.reddit.com/r/linguistics/comments/zxyvdg/american_accent_mid_1800s/",
        "text": "Linguists have established that the accent of the American Revolution sounded a lot like the modern accent in the west of England (like Hagrid from Harry Potter)\nBut I can’t find a single article detailing the accents leading up to present day General American. I went on a quest to find out as much as I could about this subject, and this is what I learned. The General American accent is an evolution of the old Midwest accent. Midwesterners born between around 1830* and 1865 have one of my favorite accents ever (though in my opinion, the ultimate euphonious American accent would be a mix of modern General American and old Midwest), and it sounds remarkably similar to today’s General American. It’s easy to see the evolution. There are a few differences though. The long O (as in \"cold\") and long A (as in \"bake\") were often monophthongal. Meaning essentially it was more rigid and there wasn’t as much mouth movement throughout the sound. But they were slightly different monophthongs than the modern \"Da Bears\" Midwest regional accent uses. The -ee sound at the end of words (as in \"party\") or at the end of a part of a compound word (can’t think of an example) was said like more of an -ih, like in modern Scottish or a REALLY posh person from England. Except this wasn’t a sign of patrician status, it was just how that vowel was pronounced in American English since at least the days of the Revolution. My theory of the reason why this has disappeared from American accents is that the -ee sound  was a lax pronounciation used to link a word that ended in that sound to a word that started with a vowel, for example, \"He was reallih happee about the house he bought\". The Rs were often very intense, and there seemed to be a hint of rolling them once in a blue moon, probably out of expediency since the tongue subconsciously probably didn’t want to keep saying the really heavy R. The L was often intense as well, said moreso in the back of the mouth than nowadays. The schwa-R combo, like in the word \"first\" was said strangely among some speakers. I can’t describe it, Jeff Goldblum actually does it despite being born in the ballpark of 100 years before the majority of the speakers I’ve heard with that feature. And also, some speakers pronounced words that feature an -ish, -age, and -ic as \"-eesh, -eedge, and -eek\". The double T combination wasn’t said like a D, like a fight wasn’t a baddle, it was a bat’hll. And also, the lli combination was pronounced differently but I can’t describe it. William was in between Wiyyum and Widyum instead of \"Willeeyum\". \n\n\n*There’s a recording out there of a former president of the LDS Church, Willford Woodruff who was born in 1807 and his accent is really similar to the one described above, but he’s speaking very deliberately (as one often had to do to sound clear in early recordings) so it’s pretty hard to gauge what he would have sounded like in normal conversation. Also, one person isn’t enough for me to make a blanket statement on the accent of a generation. He did have an influence from the old American brogue on the word \"crowned\" which was neat to hear. He said it more like \"cruwned\". \n\n**There was a trend among this particular generation of giving epic dramatic public speeches in a tremulous RP British sounding accent, this was highly highly likely not representative of how said people talked in their daily lives, but rather meant to stir up emotions and rally people to a cause. \n\n***There was also a trend of downtalk at the end of statements in recordings. This is probably because they wanted their statements to sound more confident. Like, at the end of thoughts they’d really HAMMER the last word. Some people in Youtube comment sections notice this and state their shock at how different the speaking rhythm used to sound, but I doubt this was the case, as it sounds way too manufactured. Plus, there’s a video out there of Union Civil War veterans talking and telling stories and their cadence is exactly like today’s, except when one of them gives a speech to the crowd, in which he downtalks at the end of thoughts. Granted, they seem to have been from the Northeast and not the Midwest due to them dropping Rs after vowel sounds but it’s still evidence that downtalk was a public speaking trend and not the natural rhythm of the language. \n\n**** The Southern US accent of the time is very well documented, it was the old Jimmy Carter accent, except it shared vowel sounds with the Midwest. The New England accent seemed to be very Boston Brahmin sounding back then. I assume the working class were in a proto version of the modern New England regional accent.",
        "created_utc": 1672297903,
        "upvote_ratio": 1.0
    },
    {
        "title": "What explains the large geographical split between Na-Dene languages in Arctic Canada and the Southwestern United States?",
        "author": "OrcaBoy34",
        "url": "https://www.reddit.com/r/linguistics/comments/zxw1ob/what_explains_the_large_geographical_split/",
        "text": "&amp;#x200B;\n\n[Map of Na-Dene languages distribution](https://preview.redd.it/rp0ysv4uor8a1.png?width=1920&amp;format=png&amp;auto=webp&amp;s=9e07fd2ba63a5c0085b6613169ecab39621bc7b5)",
        "created_utc": 1672289226,
        "upvote_ratio": 1.0
    },
    {
        "title": "What explains the large geographical split between Na-Dene languages in Arctic Canada and the Southwestern United States?",
        "author": "OrcaBoy34",
        "url": "https://i.redd.it/pxikbw2ynr8a1.png",
        "text": "",
        "created_utc": 1672289004,
        "upvote_ratio": 1.0
    },
    {
        "title": "Underlying psychological reasons for internet slang?",
        "author": "Original_Ad_1103",
        "url": "https://www.reddit.com/r/linguistics/comments/zxrmxx/underlying_psychological_reasons_for_internet/",
        "text": "I’m sure we have all seen the various styles of internet humor, talk, on various media platforms by younger generations (I myself am part of Gen z) . Let me give you an example, comments like “Bruh he took the L fr fr 💀“, among countless others in other abbreviations, slangs, and simplified writing. Most people would chalk it up to “kids being kids” in the online form, but theres a deeper reason for that. \n\nThere’s a reason for this kind of the way this kind of online slang evolves and works, it goes way deeper than most people think. The psychological tendencies that underlie the modern social machine (internet chat rooms, social media, you name it) is called “oversocialization”. Oversocialization is characteristic only of a certain segment of conformable social systems; as a result of aggregate info (Infinite scrolling, mass consumption, etc), repressed feelings in the strict sense but a whole spectrum of the consciousness are becoming sub-voided ; depersonalization, detachment, objectification, robotic behavior (so called “NPC” \\[non-playable character)) in modern terms). \n\nMost of these commentars who talk ”stupid”, tend to have some such feelings (possibly more or less repressed) and that these feelings are decisive in determining the direction of the social machine. They themselves feel that they are not inferior. In the physical “body”, they would never admit to themselves (in original thought processes) that they have such feelings, but in the social-self, it is precisely because they do see themselves as inferior that they identify and metamorphose with their problems. (I do not mean to suggest that Gen Z, connected entities, members, etc. ARE physically “bodily'' inferior; I’m are only making a point about social-self psychology.)\n\nIn the “body form”, they neither understand nor comprehend intricate discussional topics, only simplifying them in the social-self this is non-existent. They do not understand unsubjugated rationality, free and independent thought, or intricate physical systems independent from the social-self of the two bodies that they have formed. While superficial sentience is present, there is no “original thought” that clearly corresponds with the physical “body” with real motives. These faults did not appear at least at a time as long as 20 years ago, starting before the beginning of the Web 2.0 landscape, it is clear that these disruptions are the real motive for collectivist systems. \n\nAll in the social-self, while the body remains completely dejected and detached from the original thought process. There is no “inner” sense of reality, only superficial confidence in the systems of the social/media machine’s abilities to solve their own problems and satisfy their own needs. The concept of biological systems is alien to those in the social system, throwing off any biological rational control as if there were no hope of accomplishing anything through rational calculation and all that was left was to immerse oneself in the sensations of unconformity. Social media (and the social machine) has completely changed us as organisms entirely. In a sense we are no longer humans - we are the earliest versions of cyborgs with digitization on the external only because science has not allowed for internal, yet.\n\nThese commenters, constituents, agents, and bot agents are deeply involved emotionally in their attack on structured form They attack these concepts because of their own psychological repressed needs, given to them by media platforms. Their attack is an outlet for hostility, and, to the extent that it is successful, it satisfies the drive for power, propaganda, and oversimplification. More importantly, constituents hate structure. \n\nConstituents are antagonistic to structured explanations of complex systems or behavior because such explanations tend to make persons appear superior or inferior to others. In their argot form this is because they are physically, mentally, and emotionally stunted (not mature wise, but dehumanized)\n\nAs a result of this “dehumanization“, Gen Z (and other future generations will) have formed dual identities: the “social media self” and the “body” and there is barely any connection or recognition of the two by either themselves or as you can see (or not see) older generations. Think of the intricate unspoken understanding of the cliques and popular kids, nerdy kids, sporty kids, etc that takes place at \\*each and every school and town\\* think of your own upbringing, imagine being your adult self and walking into a random high school and having this insanely complex, imaginary order of operations that to you is invisible, but for every student it is all they know. \n\nFor the vast majority of students school and school life is quite possibly all they have ever known for their short time they’ve experienced so far here on earth. Don’t forget how creative humans are and how many of them have no where else to turn for a variety of reasons except to think and think at all times about these interactions with their classmates: who they like, who they’re trying to impress, who they don’t like, etc; a lot of what it turns into is all about the people around them and how they can seek positive reinforcement from these people and that’s where the separation begins of the “social self” and the actual “self.” \n\nAdd to that the complexities of the internet, that we cannot even begin to comprehend as adults and that’s probably how you end up with millions of human children that are all seeking for each other’s approval and no longer are able to understand their own inner identities. Coiled with the net, that’s what’s evolving with future generations, hiveminds with no true individuals only constituents semi-chronically online and virtually connected.\n\nIt's devolved to the point that perception of this type can't even be broken down to a science, like playing on the 'every joke has a victim' rule, or even basics like contrast. I don't know whether to be impressed or depressed from the state of which humor is going, as there are two sides to every coin. There is almost always a bit of truth to perception and “bias”: are humans (or Gen Z) becoming less intelligent? And can be satisfied with condensed thought processes curated for them by peers and social giants? \n\nOr perhaps it is that these perceptions are getting more and more complicated and that require deep, deep context of the given situation, of the given influences, of the given understandings, and of the given real time analysis. Of which someone, if they were to be dropped into the modern 21st century understanding without current analysis, would lack and find alien?   \n\n\nI personally find it fascinating how Internet culture can define an issue in such a succint way, when psychologists study for years and have no tl:dr answer\n\nIn Its current form, our infinite attention is the almighty god of the algorithm with its infinite hunger, in us, the parishioners, who are slowly shaping themselves in this impossible image, developing our dependence on consumption. Like a well-oiled illimitable machine. The collective hive-mind absorbs our consciousness, developing ideas, opinions, morals, and principles. Constant duplication of what appeared immediately, but the source material has long been destroyed. A chaos of heterogeneous constituents, the body of a system where its agents pull in mutual conjunction and feed off of each other.",
        "created_utc": 1672277346,
        "upvote_ratio": 1.0
    },
    {
        "title": "4 Questions for people who already have (or tried to) read a bilingual book",
        "author": "Cautious-Bid-8117",
        "url": "https://www.reddit.com/r/linguistics/comments/zxpsty/4_questions_for_people_who_already_have_or_tried/",
        "text": "Hello, I am currently writing an essay for graduating (graphic design licence). I am looking for some people who have already read a bilingual book and would be so kind as to answer a few questions :\n\n**Why did you read a bilingual book? language learning? Improvement of language skills? Other?**\n\n**What level of language did you have when you started reading it (the very first)? (approximatively A1-C2)**\n\n**Why opted for a bilingual book, and not a book in the original version?**\n\n**Have you finished the book? If not, why?**\n\nThanks a lot for reading :) (and sorry for my English \\^\\^')",
        "created_utc": 1672272792,
        "upvote_ratio": 1.0
    },
    {
        "title": "Use of ÿ in 1800s Silesia",
        "author": "ExcuseAdept827",
        "url": "https://www.reddit.com/r/linguistics/comments/zxouzl/use_of_ÿ_in_1800s_silesia/",
        "text": "I’ve been conducting genealogical research and wanted to investigate a change of vowel in our surname. My surname is ‘- - - - yra’, with that (paternal) side of the family coming from Katowice (Kattowitz). \n\nTo us, they were Polish but, as we know, history is complicated and unforgiving; looking at it more thoroughly they were very much German/Polish (Poland didn’t exist for years/the city was part of the German empire, which complicates it all, and they had a mixed parental heritage) but understandably ditched that side of their identity on emigration to the UK post-WWII. \n\nI found out from church records/Kirchenbuch  that my great grandfather (b.1883) had the name - - - - ÿra, and was wondering about the use of this character in an old Silesian context in German-Poles, and if it has any significance or interesting indication. \n\nEven weirder, his father (b.1854) and before went by - y - - era, in contrast to my - e - - yra, with no umlautend sound and no other (consonant) changes. \n\nSeems like certain vowels and sounds were quite interchangeable in this ‘borderland’ region?",
        "created_utc": 1672270563,
        "upvote_ratio": 1.0
    },
    {
        "title": "Requesting advice. Currently working on making a SVO language based on Japanese mainly for a story. Should I base the phonology on modern Japanese or Sengoku Japanese?",
        "author": "Leather-Corgi-9974",
        "url": "https://www.reddit.com/gallery/zxngfs",
        "text": "",
        "created_utc": 1672267293,
        "upvote_ratio": 1.0
    },
    {
        "title": "IPA Scrabble!",
        "author": "kittycataphora",
        "url": "https://www.reddit.com/gallery/zxlx5b",
        "text": "Just finished my post-holiday boredom project: IPA Scrabble!\n\nShocked this isn’t already an official edition honestly\n\nIt plays like normal Scrabble, we kept it to a 5 turn game just because the board got pretty closed off and two players were non-linguists lol, overall I’m super happy with it and will be forcing it at games night for years to come :)\n\nMore details are in the photo captions",
        "created_utc": 1672263721,
        "upvote_ratio": 1.0
    },
    {
        "title": "Given the global dominance of English (and to a lesser extent French, Putonghua, German, etc.) in academic literature, is it easier to express complex social, political and scientific ideas in those languages than in languages with comparatively less academic prestige?",
        "author": "Hamth3Gr3at",
        "url": "https://www.reddit.com/r/linguistics/comments/zxlhhi/given_the_global_dominance_of_english_and_to_a/",
        "text": "If so, how large is the gap, and is it easily bridged by loanwords from dominant languages, and redefining existing terminology in \"academic\" terms? Has this kind of phenomenon been recorded?",
        "created_utc": 1672262710,
        "upvote_ratio": 1.0
    },
    {
        "title": "Semantics devices",
        "author": "Zakclass",
        "url": "https://www.englishlessonsclass.com/2022/12/linguistics-stylistics-devices.html",
        "text": "",
        "created_utc": 1672262349,
        "upvote_ratio": 1.0
    },
    {
        "title": "Approximately when did Received Pronunciation stop having the LOT - CLOTH split?",
        "author": "Waryur",
        "url": "https://www.reddit.com/r/linguistics/comments/zxgkcp/approximately_when_did_received_pronunciation/",
        "text": "RP in the past, like American English, used to have the split where LOT before voiceless fricatives became long - and in both accents, identical with THOUGHT - so that \"off\" was pronounced \"awf\" (or \"orf\", as Brits are more likely to spell it - I've noticed they prefer \"ar\" and \"or\" to \"ah\" and \"aw\" to spell those sounds \"phonetically\") - additionally, God was pronounced \"gord\" (a remnant of which is \"Cor Blimey\" a corruption of \"God (Gord) Blind Me\". But nowadays British English has short CLOTH and so the split is gone. Americans say cawffee and Brits say coffee.",
        "created_utc": 1672251197,
        "upvote_ratio": 1.0
    },
    {
        "title": "venom and poison in the English language",
        "author": "Training-Luck1647",
        "url": "https://www.reddit.com/r/linguistics/comments/zxfyyd/venom_and_poison_in_the_english_language/",
        "text": "So i know what the difference is in English but I'm curious about why English makes such a distinction while other languages don't.\n\nGerman for example doesn't differentiate between the two. When did English speakers start to differentiate and do other languages also have two words for it?",
        "created_utc": 1672249821,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is it really possible to make the dark L sound without raising the tip of the tounge?",
        "author": "purplebigtree",
        "url": "https://www.reddit.com/r/linguistics/comments/zxeafy/is_it_really_possible_to_make_the_dark_l_sound/",
        "text": "I hear some people like the OP from [this post](https://www.reddit.com/r/linguistics/comments/vp7mls/my_dark_l_is_different_from_what_i_look_on_the/) say they can actually make an L sound without raising the tip of their tongue. \n\nI can't do it and I find it impossible to actually generate anything that resembles the same L-sound I hear when people say \"tall\" without moving the tip of my tongue.\n\nTo me, the dark L is simply the adition of the schwa vowel + a interrupted light L and the throat can only make an \"ugh\" sound.",
        "created_utc": 1672245859,
        "upvote_ratio": 1.0
    },
    {
        "title": "Grammatical gender and sexism within society",
        "author": "stefanoreddit_",
        "url": "https://www.reddit.com/r/linguistics/comments/zxe86v/grammatical_gender_and_sexism_within_society/",
        "text": "Hi everyone! I'm interested in knowing whether it's known who first attributed the categorization of nominal classes into the so-called masculine/feminine/neuter \"genders\", and why such a word was used at all. I'm mostly interested in finding out about these three in particular but any help would be appreciated (es. animate/inanimate).I'd also like to know whether there has been any study proving or disproving the relationship between the usage of the masculine plural as the unmarked morpheme for plural formation and early society, which privileged men from many points of view. This is the argument I've been hearing a lot lately, people who believe this claim that the languages who do that should change. I already know about the distinction between grammatical gender and natural genders, and I know the former is arbitrary. However, many languages use the masculine plural when talking about both masculine and feminine nouns, i.e. word meaning \"everyone, all the people\" in Sp. *todos*, It. *tutti*, Croatian *svi.* And since the function of grammatical gender is agreement, all these adjectives would agree accordingly (masculine plural) even in languages where there is no as clear a distinction between masculine plural and feminine plural (e.g. French Tous les hommes et toutes les femmes sont bienvenu*s. Ils* peuvent venir a partir de...). Ils means \"they\" in French, but it's used for masculine nouns.\n\nI'm trying to disprove such a theory, claiming that there is no direct correlation, and such a distinction is arbitrary, and as a whole it's completely idiotic. To me the confusion also arises from the labels that linguists have given these gender classes. My question is: had they been called class A and Class B, and if class B had been the one used for the plural formation in languages which have a class distinction, would there have been such a heated discussion regarding gender in language?). I also know that some Bantu languages use the feminine for their plural formation, but I don't think that makes women's position in society and politics any better. Is there any paper on such a matter?\n\nAny bibliographical work linked would be great, either pro or contra- my claim. Thanks in advance!",
        "created_utc": 1672245707,
        "upvote_ratio": 1.0
    },
    {
        "title": "(Grammatica) gender and society",
        "author": "stefanoreddit_",
        "url": "https://www.reddit.com/r/linguistics/comments/zxe715/grammatica_gender_and_society/",
        "text": "Hi everyone! I'm interested in knowing whether it's known who first attributed the categorization of nominal classes into the so-called masculine/feminine/neuter \"genders\", and why such a word was used at all. I'm mostly interested in finding out about these three in particular but any help would be appreciated (es. animate/inanimate).   \nI'd also like to know whether there has been any study proving or disproving the relationship between the usage of the masculine plural as the unmarked morpheme for plural formation and early society, which privileged men from many points of view. This is the argument I've been hearing a lot lately, people who believe this claim that the languages who do that should change. I already know about the distinction between grammatical gender and natural genders, and I know the former is arbitrary. However, many languages use the masculine plural when talking about both masculine and feminine nouns, i.e. word meaning \"everyone, all the people\" in Sp. *todos*, It. *tutti*, Croatian *svi.* And since the function of grammatical gender is agreement, all these adjectives would agree accordingly (masculine plural) even in languages where there is no as clear a distinction between masculine plural and feminine plural (e.g. French Tous les hommes et toutes les femmes sont bienvenu*s. Ils* peuvent venir a partir de...). Ils means \"they\" in French, but it's used for masculine nouns. \n\nI'm trying to disprove such a theory, claiming that there is no direct correlation, and such a distinction is arbitrary, and as a whole it's completely idiotic. To me the confusion also arises from the labels that linguists have given these gender classes. My question is: had they been called class A and Class B, and if class B had been the one used for the plural formation in languages which have a class distinction, would there have been such a heated discussion regarding gender in language?). I also know that some Bantu languages use the feminine for their plural formation, but I don't think that makes women's position in society and politics any better. Is there any paper on such a matter?\n\nAny bibliographical work linked would be great, either pro or contra- my claim. Thanks in advance!",
        "created_utc": 1672245626,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can new phonemes be pronounced with a bifurcated tongue?",
        "author": "murmur_lox",
        "url": "https://www.reddit.com/r/linguistics/comments/zxa295/can_new_phonemes_be_pronounced_with_a_bifurcated/",
        "text": "As the title says, I've been wondering if a bifurcated tongue would permit the pronunciation of new phonemes or a noticeable alteration of existing ones. Thought this would be the right sub to ask this question.",
        "created_utc": 1672235449,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is there a notable difference in the way native Basque speakers speak Basque from generation to generation?",
        "author": "paniniconqueso",
        "url": "https://youtu.be/KrSwubnyrok",
        "text": "",
        "created_utc": 1672234033,
        "upvote_ratio": 1.0
    },
    {
        "title": "Higher Ed Wednesday - December 28, 2022",
        "author": "AutoModerator",
        "url": "https://www.reddit.com/r/linguistics/comments/zx7tlg/higher_ed_wednesday_december_28_2022/",
        "text": "Hello all and welcome to another edition of Higher Ed Wednesday, an expansion of the Grad School Wednesday posts. This is a thread where prospective students can ask questions about university programs at any level, either general (e.g. \"How often should a grad student present at conferences?\") or particular (e.g. \"Which schools in North America have strong programs in Korean linguistics?). It's also a chance for current students to find out information about other programs (e.g. \"How many of you have reading lists for your comprehensive exams?\") or general university survival (e.g. \"Is it a really bad idea to change my thesis supervisor if we don't click?\"). So ask away!",
        "created_utc": 1672228812,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is the function of \"that he came\" there? (Sorry for my bad handwriting)",
        "author": "t_cgn",
        "url": "https://i.redd.it/6yydgoi96o8a1.jpg",
        "text": "",
        "created_utc": 1672228629,
        "upvote_ratio": 1.0
    },
    {
        "title": "Oxford spelling not used in WHO's new classification of diseases (ICD-11)",
        "author": "ArvindLamal",
        "url": "https://www.reddit.com/r/linguistics/comments/zx7ck2/oxford_spelling_not_used_in_whos_new/",
        "text": "It seems that Oxford spelling is not used in ICD-11 published by World Health Organization (Organisation?)\n\n\"generalised anxiety disorder\"\n\nhttps://icd.who.int/browse11/l-m/en#/http%3a%2f%2fid.who.int%2ficd%2fentity%2f1712535455\n\nWhy this sudden change?",
        "created_utc": 1672227103,
        "upvote_ratio": 1.0
    },
    {
        "title": "Would my accent change?",
        "author": "stopinventing",
        "url": "https://www.reddit.com/r/linguistics/comments/zx309p/would_my_accent_change/",
        "text": "So for context, I was born in Australia to Indian Parents, and I lived there until I was 10, when I moved to the US. I’m 15 now and I sound completely “american”, people don’t believe me when I tell them I was born in Australia and grew up there for a while. So I wanted to know, if I moved back to Australia later, would my accent shift to that of an Australian accent?\n\nThanks!",
        "created_utc": 1672210795,
        "upvote_ratio": 1.0
    },
    {
        "title": "How many instances are there throughout history of a single person inventing a writing system?",
        "author": "NotedCarnival63",
        "url": "https://www.reddit.com/r/linguistics/comments/zx2hg9/how_many_instances_are_there_throughout_history/",
        "text": "As the title says, how many times can we definitively prove that a writing system was invented by one person? I am already aware of Sequoyah inventing the Cherokee (ᏣᎳᎩ) syllabary, and Sejong the great, who invented Hangul (한글), the Korean writing system. Are there any other instances of this that can be proven?",
        "created_utc": 1672208940,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can two seemingly unrelated language families mix into one family gradually over time (example: Romance/Turkic)? What about with related language families? (Romance/Germanic) And has this happened before in history?",
        "author": "smooth_criminal___",
        "url": "https://www.reddit.com/r/linguistics/comments/zwzepu/can_two_seemingly_unrelated_language_families_mix/",
        "text": "Jdd",
        "created_utc": 1672199222,
        "upvote_ratio": 1.0
    },
    {
        "title": "Where do I find the etymology of a phrase that's longer than one word?",
        "author": "Orangutanion",
        "url": "https://www.reddit.com/r/linguistics/comments/zwvd7p/where_do_i_find_the_etymology_of_a_phrase_thats/",
        "text": "I noticed that Spanish has the phrase \"en caso de...\" which means the exact thing as and is basically a word-for-word translation of English's \"in case that...\" I'm trying to figure out if both languages developed this phrase independently, or if maybe the Spanish one was taken from English, or, more likely, if the phrase existed in Latin. I tried Wiktionary, but it doesn't have etymologies for entire phrases, just individual words. Any advice?",
        "created_utc": 1672187857,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is Welsh more closely-related to Farsi than English?",
        "author": "Square_Patient_3777",
        "url": "https://www.reddit.com/r/linguistics/comments/zwuvz0/is_welsh_more_closelyrelated_to_farsi_than_english/",
        "text": "This is a spurious fact I have in the back of my mind which I don’t know whether to believe - nor do I know how to fact-check it myself. I’m not familiar with linguistics but I get the idea of various language families and I know that English, Welsh and Farsi are all descended from Proto Indo European.\n\nI would appreciate if someone could clarify so I don’t make a tit out of myself when I inevitably confidently state a fact that is actually something I misheard on a podcast half a decade ago",
        "created_utc": 1672186618,
        "upvote_ratio": 1.0
    },
    {
        "title": "Parents reacted negatively to me announcing that I am going to study linguistics in university. Have any of you ever encountered this problem before and how did you address it?",
        "author": "cllax14",
        "url": "https://www.reddit.com/r/linguistics/comments/zwu1s5/parents_reacted_negatively_to_me_announcing_that/",
        "text": "I am in my mid 20s and I decided to go back to school. I just finished my associates degrees in Spanish and linguistics and have been accepted into several 4 year universities for linguistics. I have wanted to study this major since I was 17 but I was reluctant since my parents pressured me to either go into something healthcare or technology related. I got a part time job as an insurance rep at a hospital checking people’s insurance and maintaining transparency in costs processes for insurance applications, etc. I live in a major city so I interact with patients from all around the world. My favorite part of my job is speaking with patients who don’t speak English. The only classes I have ever enjoyed taking have been language classes. It is what I enjoy learning about the most so that’s why I chose linguistics as a major. \n\nMy thought process is that I make pretty decent money with my job right now. I want to shoot my shot in this career field and if nothing works out for me I still have this job I can fall back on. I can work my way up in this job and make a decent living if all else fails. I won’t be making doctor or nurse money, but there’s at least room for growth in my job. I’m only young once so I want to take an opportunity I have to study the major I enjoy the most. My parents think I’m wasting my time and that I should focus on getting my RN license instead. Yeah the money is nice for nurses but my heart isn’t really in that career. \n\nAm I making a mistake? Or are my parents just being over the top?",
        "created_utc": 1672184465,
        "upvote_ratio": 1.0
    },
    {
        "title": "In the sentence 'he has a brother the same height', why is there no verb/copula ?",
        "author": "IMakeInfantsCry",
        "url": "https://www.reddit.com/r/linguistics/comments/zwsqnq/in_the_sentence_he_has_a_brother_the_same_height/",
        "text": "English isn't my first language so I'm mainly trying to understand what underpins stuff that sounds correct to me but doesn't 'feel' like it should be.\n\nI think height could be substituted with 'age' or 'weight' here, why can you just tack it on without adding the 'that is the same...' copula? Is there a dedicated word for this phenomenon, I don't think it exists in other languages I speak.",
        "created_utc": 1672181285,
        "upvote_ratio": 1.0
    },
    {
        "title": "English Pluralization Survey!",
        "author": "slyder219",
        "url": "https://www.reddit.com/r/linguistics/comments/zws0nr/english_pluralization_survey/",
        "text": "Hey! I'm taking a class where I need to conduct a survey on how English-speakers would pluralize a word. There is twenty words. Would appreciate your response!\n\n&amp;#x200B;\n\nVia google forms, link: [survey](https://docs.google.com/forms/d/e/1FAIpQLScSRhAvFVlRWMNjuu5heq6is4jzqieyER3ALyYNYkMfdpdbhg/viewform?usp=sf_link)",
        "created_utc": 1672179577,
        "upvote_ratio": 1.0
    },
    {
        "title": "Which ancient script would Chuang Tzu have been using during his time? - Any Chinese script history experts here?",
        "author": "El-Jefe-Kyle",
        "url": "/r/ChineseLanguage/comments/zwdnsa/which_ancient_script_would_chuang_tzu_have_been/",
        "text": "",
        "created_utc": 1672164528,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is there something like the OED for Latin?",
        "author": "nomenmeum",
        "url": "https://www.reddit.com/r/linguistics/comments/zwl3oz/is_there_something_like_the_oed_for_latin/",
        "text": "I mean something that give etymologies and histories of the words, not just the definition.",
        "created_utc": 1672162520,
        "upvote_ratio": 1.0
    },
    {
        "title": "Are eagle (aquila) and north (aquilo) cognates in Latin?",
        "author": "nomenmeum",
        "url": "https://www.reddit.com/r/linguistics/comments/zwja0k/are_eagle_aquila_and_north_aquilo_cognates_in/",
        "text": "If so, how might the two concepts (eagle and north, or the north wind) have been related?",
        "created_utc": 1672157820,
        "upvote_ratio": 1.0
    },
    {
        "title": "Books on practical French phonology with audio?",
        "author": "violentmauve",
        "url": "https://www.reddit.com/r/linguistics/comments/zwisw8/books_on_practical_french_phonology_with_audio/",
        "text": "Does anyone have recommendations on books to improve French pronunciation? I already have Sons et Sens by Anne Violin-Wigent, as well as Savoir Dire by Diane Dansereau, and I’ve already gone through the FSI Basic Intro to Phonology. \n\nAny recommendations would be great, in French or English, although it would be helpful if it was written to change the anglophone accent specifically. A book of just pronunciation drills would work well also. \n\nPS: On the off chance, if anyone knows where to find the audio for D’Accord: La Prononciation du Francais Internationale: Acquisition et Perfectionnement by Sylvie Carduner, or A Drillbook of French Pronunciation by Albert Valdman that would be a great help.",
        "created_utc": 1672156572,
        "upvote_ratio": 1.0
    },
    {
        "title": "The Second Amendment seems very ungrammatical today, and contributes to a lot of confusion over its meaning. How was it considered grammatical in the 18th century?",
        "author": "spacenegroes",
        "url": "https://www.reddit.com/r/linguistics/comments/zwhd4l/the_second_amendment_seems_very_ungrammatical/",
        "text": "\"A well regulated Militia, being necessary to the security of a free State, the right of the people to keep and bear Arms, shall not be infringed.\"\n\nWhat's the subject of the sentence? If it's not \"Militia\" then what's the role of \"Militia\"?\n\nDid people of that time have concepts of subject and predicate and dependent clauses and so on? How would a grammarian in 1790 break down that sentence? How exactly did we develop the grammar rules that make that sentence sound wrong today?",
        "created_utc": 1672152783,
        "upvote_ratio": 1.0
    },
    {
        "title": "D-&gt;R in Swedish?",
        "author": "bawng",
        "url": "https://www.reddit.com/r/linguistics/comments/zwgz2w/dr_in_swedish/",
        "text": "Hi!\n\nI've tried googling this subject but since I don't know the relevant terms I don't know exactly what to Google.\n\nBut is there a known phenomenon where D is replaced by R in language in general, or Swedish in particular.\n\nI've noticed it in some very Stockholm-specific expressions, such as \"Hör du, du du\", which roughly translates to \"Hey, what are you doing\", although literally to \"Hey you, you you\". It's very often pronounced \"Hörru duru\" and at least the second D-&gt;R feels very arbitrary. Although the phrase is so established so it sounds unnatural to pronounce it as it \"should\".\n\nAnother example is \"Hur är det med dig?\", meaning \"How are you\", pronounced \"Hur e re me rej?\".\n\nOr made up \"Ska du ha den?\" -&gt; \"Ska ru ha den?\"",
        "created_utc": 1672151654,
        "upvote_ratio": 1.0
    },
    {
        "title": "Transcript of Noam Chomsky's 1992 Girona Lectures titled 'Language and the Cognitive Revolutions'",
        "author": "Aggressive-Eye-5368",
        "url": "https://www.reddit.com/r/linguistics/comments/zwebfl/transcript_of_noam_chomskys_1992_girona_lectures/",
        "text": "[https://lingbuzz.net/lingbuzz/007026](https://lingbuzz.net/lingbuzz/007026)",
        "created_utc": 1672143267,
        "upvote_ratio": 1.0
    },
    {
        "title": "My on-and-off relationship with Urdu! Would love to know your thoughts on the language and your experience learning it",
        "author": "lenstruation",
        "url": "https://www.reddit.com/r/linguistics/comments/zw9kps/my_onandoff_relationship_with_urdu_would_love_to/",
        "text": "Wrote a new article on my on-and-off relationship with Urdu! Give it a read - feedback, comments, sharing the article, and subscribing to the newsletter, everything is welcome and much appreciated 📷\n\n[https://sudhanshujoshi.substack.com/p/my-on-and-off-relationship-with-urdu](https://sudhanshujoshi.substack.com/p/my-on-and-off-relationship-with-urdu)",
        "created_utc": 1672125092,
        "upvote_ratio": 1.0
    },
    {
        "title": "If parents have different accents and there are no other speakers of the language for the kid to immediately interact with, will the kid's accent be a mix of the two?",
        "author": "SpielbrecherXS",
        "url": "https://www.reddit.com/r/linguistics/comments/zw92i4/if_parents_have_different_accents_and_there_are/",
        "text": "The title, basically.",
        "created_utc": 1672123324,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why don't we say words like \"twas\" anymore?",
        "author": "yairina",
        "url": "https://www.reddit.com/r/linguistics/comments/zw6arv/why_dont_we_say_words_like_twas_anymore/",
        "text": "I just came across someone using it and noticed how strange it is that we don't use it considering how English speakers love to shorten anything they can (in my opinion, Im no expert). \n\nIs there a reason why some contractions fall out of use?",
        "created_utc": 1672114495,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is there a term for accents coming back when emptional?",
        "author": "Y3T1_FN",
        "url": "https://www.reddit.com/r/linguistics/comments/zw1s0h/is_there_a_term_for_accents_coming_back_when/",
        "text": "I'm writing a character who lives in New York but she's from Germany. Most of the time she speaks in a New York accent but her German accent comes out when she's angry, sad, or happy. Is there a term for that?",
        "created_utc": 1672101440,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can anyone help me identify these?",
        "author": "littlecampbell",
        "url": "https://i.redd.it/0uexxok5nd8a1.jpg",
        "text": "",
        "created_utc": 1672101132,
        "upvote_ratio": 1.0
    },
    {
        "title": "Latinized Berber language?",
        "author": "Character_Sugar1510",
        "url": "https://www.reddit.com/r/linguistics/comments/zw0k6c/latinized_berber_language/",
        "text": "Assumed that a berber language spoken in Northern Africa (Morocco, Tunisia or Algeria) was latinized because of historical events involving ancient rome, how exactly would this language sound/look like today? Would it be categorized as Afro-asiatic or Romance?",
        "created_utc": 1672098232,
        "upvote_ratio": 1.0
    },
    {
        "title": "idk if this is the right place to ask, i wanna offer to the linguistic community a language exchange application",
        "author": "Flaky_Teach_1928",
        "url": "https://www.reddit.com/r/linguistics/comments/zvvzvk/idk_if_this_is_the_right_place_to_ask_i_wanna/",
        "text": "[removed]",
        "created_utc": 1672086357,
        "upvote_ratio": 1.0
    }
]