[
    {
        "title": "Differences in song contents based on language differences?",
        "author": "atomwithasuitcase",
        "url": "https://www.reddit.com/r/linguistics/comments/1186lco/differences_in_song_contents_based_on_language/",
        "text": "Does the language a song is in affect the content/story/feeling/style of the song? Rhyming words and cadences of languages are different, and I bet there are many other factors. Does this impart a difference broadly in a language’s songs? I’m interested in mainly mainstream, modern songs, but looking historically would also be interesting.",
        "created_utc": 1676994170,
        "upvote_ratio": 1.0
    },
    {
        "title": "Question for non-binary people",
        "author": "SenathB",
        "url": "https://www.reddit.com/r/linguistics/comments/1185m3l/question_for_nonbinary_people/",
        "text": "Hi guys, I wanna know how non-binary people use languages that have natural grammatical gender like masculine and feminine?\nFor example in French, when you say \"I'm tall\"\n\nBoys say \"Je suis grand\"\n\nGirls say \"Je suis grande\"\n\nHow would a non-binary person say this?\n\nThat is just an adjective but in a sentence like \"I have arrived\"\n\nBoys say \"Je suis arrivé\"\n\nGirls say \"Je suis arrivée\"\n\nThe verb conjugation changes. But in French the pronunciation is the same in many cases.\n\nIf we take Hindi as an example.\n\n\"I am eating rice\"\n\nBoys say \"मैं भात खा रहा हूं\" (ma͠i bhāt khā rahā hū̃)\n\nGirls say \"मैं भात खा रही हूं\" (ma͠i bhāt khā rahī hū̃)\n\n\"I am small\"\n\nBoys say \"मैं छोटा हूं\" (ma͠i chōṭā hū̃)\n\nGirls say \"मैं छोटी हूं\" (ma͠i chōṭī hū̃)\n\nHow would non-binary people say these sentences? Do they use a specific gender they prefer? And in German they have neuter too. Would non-binary people use the neuter in sentences like these (IDK if German verbs change depending on the gender of the speaker). Danish has common gender and neuter gender. Therefore do non-binary people use common or neuter if verbs and adjectives inflect like in French or Hindi?",
        "created_utc": 1676992159,
        "upvote_ratio": 1.0
    },
    {
        "title": "American English Needs Immigrants - NY Times",
        "author": "JS1755",
        "url": "/r/languagelearning/comments/1182m2r/american_english_needs_immigrants_ny_times/",
        "text": "",
        "created_utc": 1676983617,
        "upvote_ratio": 1.0
    },
    {
        "title": "Should I use square brackets [] or slashes // when transcribing realizations that resulted from consonantal assimilation? E.g. /ɡʊdˈbaɪ/ &gt; /ɡʊbˈbaɪ/ or [ɡʊbˈbaɪ]?",
        "author": "PerspectiveSilver728",
        "url": "https://www.reddit.com/r/linguistics/comments/1182d6q/should_i_use_square_brackets_or_slashes_when/",
        "text": "For example, If I were transcribing the pronunciation of \"goodbye\" where the middle /d/ and /b/ assimilated into \\[bb\\], producing \\[ɡʊbˈbaɪ\\], should I transcribe it as /ɡʊbˈbaɪ/ or \\[ɡʊbˈbaɪ\\]?\n\nAt first, I thought using square brackets was the obvious choice, but then I checked [this article](https://www.studysmarter.us/explanations/english/phonetics/phonetic-assimilation/) on phonetic assimilation, and throughout the entire thing, not even once are square brackets used.",
        "created_utc": 1676982753,
        "upvote_ratio": 1.0
    },
    {
        "title": "Did Germans use to use short subjunctives like \"wüsste\" on the regular?",
        "author": "afsef",
        "url": "https://www.reddit.com/r/linguistics/comments/117xi13/did_germans_use_to_use_short_subjunctives_like/",
        "text": "or did they also use \"würde gemacht\"-kinda constructions from the beginning? i'm asking cuz i like the shorter versions but they're kinda defective meaning not all verbs have an umlaut, or didn't they just care and went with them anyway?",
        "created_utc": 1676964387,
        "upvote_ratio": 1.0
    },
    {
        "title": "Looking for Mandarin Speakers in Taiwan",
        "author": "MLA_Welo_4C",
        "url": "https://www.reddit.com/r/linguistics/comments/117uuns/looking_for_mandarin_speakers_in_taiwan/",
        "text": "[removed]",
        "created_utc": 1676955209,
        "upvote_ratio": 1.0
    },
    {
        "title": "Will Korean used in North and South Korea diverge into complete different languages over time?",
        "author": "Golmar_gaming227",
        "url": "https://www.reddit.com/r/linguistics/comments/117u560/will_korean_used_in_north_and_south_korea_diverge/",
        "text": "I apologise if this question was asked before, but as Korean myself, I wondered since the end of the Korean war over 70 years ago, Korean language in North and South diverged a lot during that time. At this rate, I thought it's possible for two languages to evolve to the point of being unintelligible with one another (assuming current division becomes permanent), what do you think?",
        "created_utc": 1676953000,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is it Common for a Short *e* to Sound Like or Be Mutually Intelligible to *ɛ*?",
        "author": "Junior-Walk-988",
        "url": "https://www.reddit.com/r/linguistics/comments/117rk50/is_it_common_for_a_short_e_to_sound_like_or_be/",
        "text": "For some context, I speak Tamizh/Tamil, and I noticed that when saying words with a short e sound like என்ன (enna) often, the pronunciation will shift to a ɛ sound. Is this a common phenomenon?",
        "created_utc": 1676945325,
        "upvote_ratio": 1.0
    },
    {
        "title": "I tried to make a fake language in microsoft paint",
        "author": "Flunkiebubs",
        "url": "https://i.redd.it/vq6wa1gbofja1.jpg",
        "text": "",
        "created_utc": 1676938113,
        "upvote_ratio": 1.0
    },
    {
        "title": "How the fuck is \"the\" pronounced?",
        "author": "trebormints565",
        "url": "https://www.reddit.com/r/linguistics/comments/117moc7/how_the_fuck_is_the_pronounced/",
        "text": "More often than not i say \"da\" which confuses some people and they call me out and i repeat myself and then they understand.\n\nResearch suggests its \"thuh\" and \"thee\" - so for example \"The (thuh) girl caught the ball\" - not \"Da girl caught the ball\" \n\nIs this correct?",
        "created_utc": 1676932282,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is there any research on why Polish has 'ć' and 'dź' for /tɕ/ and /dʑ/ and not Czech-like 'ť' and 'ď' or something?",
        "author": "afsef",
        "url": "https://www.reddit.com/r/linguistics/comments/117kgfo/is_there_any_research_on_why_polish_has_ć_and_dź/",
        "text": "Does it mean that the Polish /tɕ/ and /dʑ/ evolved from /tsʲ/ and /dzʲ/ and not just from /tʲ/ and /dʲ/?\n\nIs there any research talking about a time period when 'ci' was pronounced as /tsʲ/ for example?\n\nI was always wondering 'cause i don't like the long trigraph 'dzi' for /dʑ/ (before vowels).\n\nThanks, and if there's a better place to ask this question, let me know too.",
        "created_utc": 1676927006,
        "upvote_ratio": 1.0
    },
    {
        "title": "Found this on the Neapolitan Wikipedia article. Is this a good explanation for Neapolitan?",
        "author": "Extronic90",
        "url": "https://www.reddit.com/r/linguistics/comments/117kari/found_this_on_the_neapolitan_wikipedia_article_is/",
        "text": "The term \"Neapolitan language\" is used broadly in this article to refer to the group of closely-related Romance dialects found in southern continental Italy, as described above. However, as the term itself implies, in contexts ranging from colloquial speech to academic linguistics, Neapolitan, napulitano or napoletano may refer instead to the specific Romance varieties spoken natively in Naples and the immediately surrounding Naples metropolitan area.",
        "created_utc": 1676926640,
        "upvote_ratio": 1.0
    },
    {
        "title": "I think I just got attacked by german prescriptivists lol.",
        "author": "Eltrew2000",
        "url": "https://www.reddit.com/r/linguistics/comments/117gra3/i_think_i_just_got_attacked_by_german/",
        "text": "I just wanted to find out what sounds does \"i\" usually represent word finally and this bloke attacked me saying how i need to improve my English skills cuz what i'm saying us \"grammatically incorrect\" and I keep getting downvoted.\n\nAnyways does anyone know here maybe what \"i\" usually represents word finally in german like idk in a word like \"Rösti\" for example?",
        "created_utc": 1676918321,
        "upvote_ratio": 1.0
    },
    {
        "title": "\"The evolution of Spanish is the merging of Latin and Basque.\" How true is this claim?",
        "author": "QuieroFondant",
        "url": "https://www.reddit.com/r/linguistics/comments/117g57k/the_evolution_of_spanish_is_the_merging_of_latin/",
        "text": "There's [a recent interview](https://www.infobae.com/leamos/2022/05/13/luis-garcia-montero-cuando-se-pierde-un-idioma-tambien-se-pierden-cultura-y-tradicion/) of a famous Spanish philologist who's now also the head of the prestigious Cervantes Institute that caught my attention. Specifically, what piqued my interest is the following quote that I'll translate roughly below:\n\n&gt; Spanish was not born in Castilla but in the north [of Spain], the place that is now La Rioja. The first written documents are conserved in San Martín de la Cogolla, a monastery, since it was Basque territory, and Basque was spoken there, hence an attempt was made to find a common tongue that would allow Basque-speaking people to understand Catalonians in an offshoot of Latin. The evolution of Spanish is actually the merging of Latin and Basque. \n\nI know next to nothing about historical linguistics, much less about the history of Spanish, but I'm a native speaker and familiar with Basque grammar, and I find these observations rather surprising. Could anyone with expertise on this area assess the extent to which they are true or at least a more or less reliable reconstruction of the past? I thought about crossposting this to /r/AskHistorians but I want to gauge the responses here first.",
        "created_utc": 1676916874,
        "upvote_ratio": 1.0
    },
    {
        "title": "Pronunciation of \"linear\"",
        "author": "static_void974110",
        "url": "https://www.reddit.com/r/linguistics/comments/117g3a9/pronunciation_of_linear/",
        "text": "I was at a bar with my friends discussing plot lines in fiction that are non-linear, but after I said the word \"linear\" itself, the conversation stopped dead in its tracks and my friends then spent the next 10-15 minutes poking fun at my apparently incorrect pronunciation. I'm a native English speaker, so I can't even say that I just learned it wrong, somehow I picked up a different pronunciation that was unintelligible to my friends even though they sound like the exact same word to me. \n\nBasically they all pronounce what I suppose is the standard way, as three syllables: li-ne-ar (approximately /'lɪn.i.ɚ/), where I've always pronounced it with two syllables: li-near (approximately /lɪ.'nɪɹ/), such that it's much more similar to the pronunciation of veneer.\n\nDoes anyone else pronounce it this way, or did I just somehow pick up this word completely wrong? If the latter, how common is that? For a regular person to naturally pronounce a normal word outside the standard for the dialect?",
        "created_utc": 1676916752,
        "upvote_ratio": 1.0
    },
    {
        "title": "Fingallian revival?",
        "author": "Extronic90",
        "url": "https://www.reddit.com/r/linguistics/comments/117eilg/fingallian_revival/",
        "text": "So, Yola is currently being revived. It is estimated that there are many fluent speakers. It is not yet a revived language because it currently doesn’t have any native speakers. Yola and Fingallian are said to have been closely related. Once Yola is revived, is it possible for us to revive Fingallian as the the second revived Anglic language?",
        "created_utc": 1676913556,
        "upvote_ratio": 1.0
    },
    {
        "title": "Other Anglic languages/dialects besides Scots, Yola, Fingallian and English?",
        "author": "Extronic90",
        "url": "https://www.reddit.com/r/linguistics/comments/117b1xm/other_anglic_languagesdialects_besides_scots_yola/",
        "text": "Hello! I came here to ask if there are any other Anglic dialects or languages besides Scot, Yola, Fingallian and English. I heard Northumbrian is said to be a separate language by a large group of people. The same goes for Cumbrian and Scouse. But, are there more Anglic languages?",
        "created_utc": 1676908660,
        "upvote_ratio": 1.0
    },
    {
        "title": "Regional differences in foreign languages???",
        "author": "Dusgewoonmike",
        "url": "https://www.reddit.com/r/linguistics/comments/1178enm/regional_differences_in_foreign_languages/",
        "text": "             Maybe this is dumb, but in a foreign language, say the speaker is from the Deep South vs New England, would the region affect the accent? As in, would the target language shift based on region, even if it's the same native language???\n            Also, how are American accents in foreign languages perceived???? Thanks :)",
        "created_utc": 1676904445,
        "upvote_ratio": 1.0
    },
    {
        "title": "[OC] The Evolution of the Indo-European Language Family",
        "author": "Pluto_and_Charon",
        "url": "https://i.imgur.com/aVSQZzq.jpg",
        "text": "",
        "created_utc": 1676899644,
        "upvote_ratio": 1.0
    },
    {
        "title": "This week's Q&amp;A thread -- please read before asking or answering a question! - February 20, 2023",
        "author": "AutoModerator",
        "url": "https://www.reddit.com/r/linguistics/comments/1174vvr/this_weeks_qa_thread_please_read_before_asking_or/",
        "text": "Do you have a question about language or linguistics? You’ve come to the right subreddit! We welcome questions from people of all backgrounds and levels of experience in linguistics.\n\nThis is our weekly Q&amp;A post, which is posted every Monday. We ask that certain types of questions be asked here instead of in a separate post.\n\n**Questions that should be posted in the Q&amp;A thread:**\n\n* Beginner questions — if you’re looking for a general answer that can be found in an introductory textbook, then it probably belongs here. If you ask in a separate post we’ll ask you to move it here.\n\n* Questions that can be answered with a simple Google or Wikipedia search — you should try Google and Wikipedia first, but we know it’s sometimes hard to find the right search terms or evaluate the quality of the results. Instead of removing these questions, we just ask you post them here.\n\n* Asking why someone (yourself, a celebrity, etc.) has a certain language feature — unless it’s a well-known dialectal feature, we can usually only provide very general answers to this type of question. And if it’s a well-known dialectal feature, it still belongs here.\n\n* Requests for transcription or identification of a feature — remember to link to audio examples.\n\n* English dialect identification requests — for language identification requests and translations, you want r/translator. If you need more specific information about which English dialect someone is speaking, you can ask it here.\n\n* Questions about prescriptivism — such as whether it's good or bad, when it's appropriate, whether something \"counts\" as prescriptivism, etc. These questions usually need the same general answers clarifying the role of descriptivism/prescriptivism in linguistics, so please post them here.\n\nWe’ll ask you to move your post to the Q&amp;A thread if you post it on the front page and we think it fits one of the above categories. You’re free to post your question here.\n\nIf you post your question to the Q&amp;A thread and don’t get an answer by the end of the week, you can post it as a separate post. If it’s already the weekend, you might want to wait to post your question until the new Q&amp;A post goes up on Monday.\n\n**Discouraged Questions**\n\nThese types of questions are subject to removal:\n\n* Asking for answers to homework problems. If you’re not sure how to do a problem, ask about the concepts and methods that are giving you trouble. Avoid posting the actual problem if you can.\n\n* Asking for paper topics. We can make specific suggestions once you’ve decided on a topic and have begun your research, but we won’t come up with a paper topic or start your research for you.\n\n* Asking for grammaticality judgments and usage advice — basically, these are questions that should be directed to speakers of the language rather than to linguists.\n\n* Questions that are covered in our FAQ or reading list — follow-up questions are welcome, but please check them first before asking how people sing in tonal languages or what you should read first in linguistics.",
        "created_utc": 1676894441,
        "upvote_ratio": 1.0
    },
    {
        "title": "Looking for articles/thesis/books about ampersand",
        "author": "lh____",
        "url": "https://www.reddit.com/r/linguistics/comments/1174dw2/looking_for_articlesthesisbooks_about_ampersand/",
        "text": "Hi, I had no luck finding relevant source of information on ampersand from the linguistics point of view. Can you please help? Thank you",
        "created_utc": 1676892674,
        "upvote_ratio": 1.0
    },
    {
        "title": "I have no clue how people are going to react to this but I map a world language families map using the EUIV map on mapchart. Because of the tiles available on this particular map some areas are not as well represented as others.",
        "author": "flippredd",
        "url": "https://i.redd.it/icewrxmkadja1.png",
        "text": "",
        "created_utc": 1676891233,
        "upvote_ratio": 1.0
    },
    {
        "title": "Help me decipher old german writtings from WWI !",
        "author": "Ratsel_WWI",
        "url": "https://www.reddit.com/r/linguistics/comments/1172rtw/help_me_decipher_old_german_writtings_from_wwi/",
        "text": "[removed]",
        "created_utc": 1676886558,
        "upvote_ratio": 1.0
    },
    {
        "title": "Wanting to go down a rabbit hole",
        "author": "snickitysnacc",
        "url": "https://www.reddit.com/r/linguistics/comments/1171nzo/wanting_to_go_down_a_rabbit_hole/",
        "text": "As the title says, I’m wanting to go down a rabbit hole lol. So I have a question, what are some of the most interesting historical linguistic topics that you’ve seen? Anything goes! Synchronic or Diachronic, doesn’t matter I just love to learn and I wanna hear what everyone finds interesting.\nI would love to learn about some interesting things from the past, rather than just linguistic things from the past 100 years or so, as I’m just getting into historical linguistics after only really studying the more modern teaching of linguistics through my degree. \nThanks in advance!",
        "created_utc": 1676882072,
        "upvote_ratio": 1.0
    },
    {
        "title": "Are all Austro-asiatic languages tonal? (this family is perplexing to me)",
        "author": "C-McGuire",
        "url": "https://www.reddit.com/r/linguistics/comments/116vu9s/are_all_austroasiatic_languages_tonal_this_family/",
        "text": "Austro-asiatic as a family is confusing to me, some languages within it seem to be very analytic or even isolating, while others have agglutination. My main question is whether the family is consistently tonal, but also I am wondering what is generally going on and what consistent typological and morphological traits there are. Also, if there are any non-tonal languages, are any of them make particular use of agglutination?",
        "created_utc": 1676861584,
        "upvote_ratio": 1.0
    },
    {
        "title": "where can I learn what s1,/s/,s3 and that s with the weird symbol is?",
        "author": "hypnoticbox30",
        "url": "https://i.redd.it/3y215gf6naja1.png",
        "text": "",
        "created_utc": 1676859154,
        "upvote_ratio": 1.0
    },
    {
        "title": "Are there conditions which lead to vowel reduction?",
        "author": "FilmWeasle",
        "url": "https://www.reddit.com/r/linguistics/comments/116u69r/are_there_conditions_which_lead_to_vowel_reduction/",
        "text": "Are there certain articulations that cause vowels to be reduced or that make them more ambiguous sounding? If my transcriptions are accurate, \"ə\" and \"ɪ\" often sound the same. Is there a pattern to this? What other vowels does this happen with?",
        "created_utc": 1676856591,
        "upvote_ratio": 1.0
    },
    {
        "title": "I’ve seen many Brits/ European English speakers often drop articles when speaking, such as “the” when referring to hospital and “a” when referring to vacation/holiday. Is there a term for this?",
        "author": "Chicken-Inspector",
        "url": "https://www.reddit.com/r/linguistics/comments/116pqjq/ive_seen_many_brits_european_english_speakers/",
        "text": "This is in relation to American (and I’m assuming Canada?) English. Idk about NZ/AU/India, etc…\n\nFor example, I’ve seen YouTube videos done by Brit’s, and they say things like “go on holiday” “go to hospital” etc… whereas Americans would say “go on a vacation” “go to the hospital”. (The fact that Americans don’t use holiday in this context is besides the point)\n\nIs there some term to describe this definite/indefinite article dropping?",
        "created_utc": 1676845203,
        "upvote_ratio": 1.0
    },
    {
        "title": "ISO Interview subject for an article!",
        "author": "Adept-Objective-9021",
        "url": "https://www.reddit.com/r/linguistics/comments/116nv5d/iso_interview_subject_for_an_article/",
        "text": "Looking for an established linguist, linguistic anthropologist, professor, etc. for a feature article on the roots of certain popular Southern (American) idioms (think tits on a bull, dead pig in the sunshine, etc.). \n\nIf you have any verifiable authority on this subject and would have 10-15 minutes for a phone interview, please comment or message! Would also love to hear from a lifelong resident of a southern state that has strong opinions or personal anecdotes regarding these idioms---but again, needs to be verified!",
        "created_utc": 1676840523,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does Spanish have the same onset phonotactics as English. Three consonants at the start of a word.",
        "author": "rosa1234sanc",
        "url": "https://www.reddit.com/r/linguistics/comments/116n67g/does_spanish_have_the_same_onset_phonotactics_as/",
        "text": "I and U in Spanish become glides before vowels.",
        "created_utc": 1676838783,
        "upvote_ratio": 1.0
    },
    {
        "title": "About proto Eurasiatic",
        "author": "Manzissimo1",
        "url": "https://www.reddit.com/r/linguistics/comments/116m2l4/about_proto_eurasiatic/",
        "text": "Is there any serious chance there was once a language from which both Indo European, Uralic, Mongolic, Turkic and Tungusic families are all derived ? If so... Where and when was it spoken ? By who ?",
        "created_utc": 1676836045,
        "upvote_ratio": 1.0
    },
    {
        "title": "The vowel in words like \"pants\" and \"ran\"",
        "author": "GGB_123",
        "url": "https://www.reddit.com/r/linguistics/comments/116l34c/the_vowel_in_words_like_pants_and_ran/",
        "text": "(I'm from the US)\nI've always wondered this. Some people say words like pants, ran, ban, sand, can and tram with the /æ/ vowel, but other people say them with a vowel that sort of sounds like a diphthong with the vowels /e/ and /ae/. Is this an actual vowel, and if so, does it have its own IPA symbol?\nI'm very new to this subreddit, so sorry if this post isn't what's typical here.",
        "created_utc": 1676833652,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is the difference between an American southern accent, and the old west accent?",
        "author": "fisharrow",
        "url": "https://www.reddit.com/r/linguistics/comments/116ipxl/what_is_the_difference_between_an_american/",
        "text": "Is the southern accent different than the western american accent? i don’t mean california, which is somehow different too, but the central western “cowboy” accent. It seems people of that region still exhibit it, from the videos of modern american coyboys i’ve been watching. I don’t know how to describe it, but it seems different than the south, and I don’t know how or why. It has less of a drawl, and is more tight in the mouth. Is it connected with the Texan accent, which seems similar?  It seems a heavy drawl is more eastern, unless i’m mishearing.",
        "created_utc": 1676827929,
        "upvote_ratio": 1.0
    },
    {
        "title": "I'm so god damn confused",
        "author": "barelygonnausethis",
        "url": "https://www.reddit.com/r/linguistics/comments/116ipw9/im_so_god_damn_confused/",
        "text": "I keep hearing credible sources say confidently that Danish has no voiced plosives and it's confusing the hell out of me. It's my native language, and I don't say /k/ when i see &lt;g&gt;. When I read the word \"bi\", I say /biˀ/, not /piˀ/. Not only that, I feel like I notice people voicing the voiceless plosive set in common speech.\n\nCan someone who knows what's up here tell me?? I feel like I'm in the god damn Twilight Zone",
        "created_utc": 1676827927,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to choose a translation",
        "author": "Prince0fPersia8",
        "url": "https://www.reddit.com/r/linguistics/comments/116hjto/how_to_choose_a_translation/",
        "text": "When trying to consume a work that isn't in one's native language, we have to choose a translation. I speak both French and English, so I tend to use French translations for latin languages and English for germanic ones, assuming that more of the original work will be carried through as the languages should be more closely related. Is there any real value to this?\n\nThanks in advance",
        "created_utc": 1676825196,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why is the diphthong in “suit” often pronounced as though the vowels were reversed?",
        "author": "hraun",
        "url": "https://www.reddit.com/r/linguistics/comments/116gzps/why_is_the_diphthong_in_suit_often_pronounced_as/",
        "text": "Especially in eg Received Pronunciation",
        "created_utc": 1676824052,
        "upvote_ratio": 1.0
    },
    {
        "title": "/uː.ɪ/ monophthongisation in USEng?",
        "author": "-B0B-",
        "url": "https://www.reddit.com/r/linguistics/comments/116glqy/uːɪ_monophthongisation_in_useng/",
        "text": "I noticed a USEng speaker (not sure where specifically he's from, sorry) pronounce „ruin“ with a monophthong (like „rune“) in [this video](https://youtu.be/IysWXVOI2Kc?t=8m56s), am curious if this is a noted phenomenon or just a quirk of his particular idiolect.",
        "created_utc": 1676823366,
        "upvote_ratio": 1.0
    },
    {
        "title": "origins of similar phrases",
        "author": "pamulapatums",
        "url": "https://www.reddit.com/r/linguistics/comments/116ehoj/origins_of_similar_phrases/",
        "text": "Just realized that 'you know better' and 'you know best' have very different meanings. Does anyone know the origins of both?",
        "created_utc": 1676820465,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do parrots produce sounds that require lips or teeth?",
        "author": "boomer_wife",
        "url": "https://www.reddit.com/r/linguistics/comments/116b9p9/how_do_parrots_produce_sounds_that_require_lips/",
        "text": "I was remembering my ex's parrot, an African grey. He could say my name (Maria, the r is an alveolar tap) perfectly. As far as I know they don't have the anatomy for that, how do they do it?",
        "created_utc": 1676815918,
        "upvote_ratio": 1.0
    },
    {
        "title": "Syllables in “actually”",
        "author": "BasYL6872",
        "url": "https://www.reddit.com/r/linguistics/comments/11688mw/syllables_in_actually/",
        "text": "So I don’t know much of anything about linguistics, but I wrote a haiku using “actually” as a 3 syllable word because that’s how I pronounce it, but according to Google it actually (pun unintended) has 4. Is my haiku still a proper haiku?",
        "created_utc": 1676806115,
        "upvote_ratio": 1.0
    },
    {
        "title": "A Relatively Definitive List of Linguistics-Based Science Fiction Books",
        "author": "ahoytheremehearties",
        "url": "https://www.reddit.com/r/linguistics/comments/1166qdo/a_relatively_definitive_list_of_linguisticsbased/",
        "text": "Sourced primarily from Reddit and Goodreads. Due to this, some books may not really be 'linguists SF', but they should all actually exist as I did check most of them on Goodreads. Ordered alphabetically by author's first names. \n\n  \n\nA. E. van Vogt, Null-A series\n\nAda Palmer, Too Like the Lightning\n\nAdrian Tchaikovsky, Children of Time \n\nAdrian Tchaikovsky, Elder Race\n\nAlan Dean Foster, Nor Crystal Tears\n\nAlastair Reynolds, Pushing Ice\n\nAlastair Reynolds, Revelation Space\n\nAlena Graedon, The Word Exchange\n\nAlfred Bester, Of Time and Third Avenue\n\nAlfred Bester, The Demolished Man\n\nAmal El-Montar &amp; Max Gladstone, This Is How You Lose the Time War \\[a stretch, allegedly\\]\n\nAmy Thomson, The Color of Distance\n\nAnn Leckie, The Raven Tower\n\nAnn Pratchet, Bel Canto\n\nAnthony Boucher, Barrier\n\nAnthony Burgess, A Clockwork Orange\n\nArkady Martine, A Memory Called Empire\n\nArthur Byron Cover, Autumn Angels\n\nArthur C. Clarke, The Nine Billion Names of God\n\nAshley McConnell, torarto CC1\n\nAyn Rand, Anthem\n\nBarry B. Longyear, Enemy Mine\n\nBeam Piper, Naudsonce\n\nBeam Piper, Omnilinguial\n\nBenjamin Appel, The Funhouse\n\nC J Cherryh, Chanur series\n\nC J Cherryh, Foreigner series\n\nC. S. Lewis, Space Trilogy\n\nChad Oliver, The Winds of Time\n\nCharles Yu, How to Live Safely in a Science Fictional Universe \n\nCharlie Jane Anders, The City in the Middle of the Night\n\nChina Mieville, Embassytown\n\nChina Mieville, The Scar\n\nChris Beckett, Dark Eden \n\nChristian Bok, Eunoia\n\nChristina Dalcher, Vox\n\nCJ Cherryh, foreigner series\n\nClaire McCague, The Rosetta Man\n\nConnie Willis, Miracle and Other Christmas Stories\n\nDan Holt, Underneath the Moon\n\nDaniel S. Fletcher, Jackboot Britain\n\nDavid Brin, Startide Rising\n\nDavid I. Masson, A Two-Timer\n\nDavid I. Masson, Not So Certain\n\nDiego Marani, New Finnish Grammar\n\nEdward Llewelly, Word-Bringer\n\nEdward Willett, Lost in Translation\n\nEleanor Arnason, A Woman of the Iron People\n\nEliezer Yudkowsky, Three Worlds Collide \n\nElif Batuman, The Idiot\n\nElizabeth Moon, Remnant Population\n\nFelix C. Gotschalk, Growing Up in Tier 3000\n\nFerenc Karinthy, Metropole\n\nFletcher DeLancey , The Caphenon \n\nFrank Herbert, Whipping Star\n\nFrederick Pohl and Jack Williamson, Cuckoo series\n\nFrederick Pohl, Slave Ship\n\nG Redling, Damocles\n\nGene Wolfe, The Book of the New Sun\n\nGeoffrey Ashe, The Finger and the Moon\n\nGraham Diamond, Chocolate Lenin\n\nGrant Callin, Saturnalia\n\nGreg Bear, Anvil of Stars\n\nGreg Egan, Diaspora\n\nH. Beam Piper, Omnilingual\n\nHarry Harrison, Uplift Trilogy \\[2nd trilogy in setting, starting with Brightness Reef\\]\n\nHarry Harrison, West of Eden\n\nHelen DeWitt, The Last Samurai\n\nHenry Higgins, My Fair Lady\n\nHenry Higgins, Pygmalion\n\nHenry Kuttner, Nothing but Gingerbread Left\n\nHoward Waldrop, why Did?\n\nJ. R. R. Tolkien, Gene Wolfe\n\nJ. R. R. Tolkien, The Book of the New Sun\n\nJ. R. R. Tolkien, Useful Phrases\n\nJack Vance, The Languages of Pao\n\nJack Womack, Elvissey\n\nJack Womack, Heathen\n\nJack Womack, Terraplane\n\nJames Blish, Quincunx of Time\n\nJames Blish, Vor\n\nJames P. Hogan, Inherit the Stars\n\nJanelle Shane, 68:Hazard:Cold\n\nJanet Kagan, Hellspark\n\nJasper Fforde, Shades of Grey\n\nJennifer Foehner Wells, Fluency\n\nJoan Slonczewski, A Door Into Ocean\n\nJohn Berryman, BEROM\n\nJohn Clute, Appleseed\n\nJohn Crowley, Engine Summer\n\nJohn Scalzi, Fuzzy Nation\n\nJohn Varley, The Persistence of Vision\n\nJorge Luis Borges, Pierre Menard Author of the Quivete\n\nJorge Luis Borges, The Book of Sand \n\nJorge Luis Borges, The Library of Babel\n\nJorge Luis Borges, Tlön, Uqbar, Orbis Tertius\n\nJulie Czernada, To Each This World\n\nK. J. Parker, A Practical Guide to Conquering the World\n\nKaia Sonderby, Xandri Corelel series\n\nKarin Tidbeck, Amatka\n\nKarin Tidbeck, Listen\n\nKarin Tidbeck, Sing\n\nKate Wilhelm, Juniper Time\n\nKatherine Addison, Sequel to The Goblin Emperor\n\nKatherine Addison, The Goblin Emperor\n\nKatherine Addison, Witness for the Dead\n\nKen Liu, The Bookmaking Habits of Select\n\nKen Liu, The Literomancer\n\nKen Liu, The Paper Menagerie and Other Stories\n\nKress, Probability Moon \n\nlain M. Banks, Feersum Endiinn\n\nlain M. Banks, Player of Games\n\nlan Watson, The Embedding\n\nLaura Jean McKay, The Animals in That Country\n\nLaurent Binet, The Seventh Function of Language\n\nLester del Rey, Outpost of Jupiter\n\nLindsay Ellis, Axiom's End\n\nLola Robles, Monteverde: Memoirs of an Interstellar\n\nMark Dunn, Ella Minnow Pea\n\nMark Wandrey, Black and White\n\nMary Doria Russell, The Sparrow\n\nMaryna and Serhiy Dyachenko, Vita Nostra\n\nMatt Haig, The Humans\n\nMax Barry, Lexicon\n\nMax Beerbohm, Enoch Soames\n\nMeg Pechenick, The Vardeshi Saga\n\nMichael Faber, The Book of Strange New Things\n\nMichael Frayn, A Very Private Life\n\nNalo Hopkinson, Midnight Robber\n\nNaomi Mitchison, Memoirs of a Spacewoman\n\nNeal Stephenson, Cryptonomicon\n\nNeal Stephenson, Snow Crash\n\nNnedi Okorafor, Akata Witch\n\nNorman Spinrad, Void Captain's Tail\n\nOctavia Butler, Parable of the Sower\n\nOctavia Butler, Speech Sounds\n\nOrson Scott Card, Speaker for the Dead\n\nPatty Jansen, Seeing Red\n\nPeter Watts, Blindsight\n\nPoul Anderson, Time Heals \n\nR. A. Lafferty, L. Sprague de Camp\n\nR. A. Lafferty, Language for Time Travelers\n\nR. A. Lafferty, The Wheels of If\n\nR. A. Lafferty, Viagen Interplanetarians series\n\nR. F. Kuang, Babel\n\nRainbow Rowell, Carry On\n\nRay Nayler, The Mountain in the Sea \n\nRebecca Ore, Becoming Alien trilogy\n\nRichard Garfinkle, Wayland's Principia\n\nRobert Heinlein, Gulf\n\nRobert Heinlein, Stranger in a Strange Land \n\nRobert Merle, The Day of the Dolphin\n\nRoger Zelazny, A Rose For Ecclesiastes\n\nRosemary Kirstein, Steerswoman series\n\nRussell Hoban, Riddley Walker\n\nRuth Nestvold, looking Through Lace\n\nS. J. Schwaidelson, Lingua Galctica\n\nSamuel R. Delany, Babel-17\n\nSamuel R. Delany, The Ballad of Beta 2\n\nSamuel R. Delany, Triton\n\nScott Alexander, Anglophysics\n\nScott Alexander, Unsong \n\nScott Westerfeld, Fine Prey\n\nScotto Moore, Battle of the Linguist Mages \n\nSharon Lee, Locus Custum\n\nSheila Finch, The Guild of Xenolinguists\n\nSheri S. Tepper, After Long Silence\n\nSheri S. Tepper, The Margarets\n\nStanislaw Lem, Fiasco\n\nStanislaw Lem, His Master's Voice\n\nStanislaw Lem, The Futurological Congress\n\nStephen Leigh, Alien Tongue\n\nSteven Hall, The Raw Shark Texts\n\nSue Burke, Semiosis\n\nSuzette Haden-Elgin, - her\n\nSuzette Haden-Elgin, Coyoted Jones series\n\nSuzette Haden-Elgin, Native Tongue Series\n\nSuzette Haden-Elgin, The Judas Rose\n\nSuzette Haden-Elgin, The Ozark Trilogy\n\nSylvia Neuvel, Themis Files series\n\nTed Chiang, Story of your Life\n\nTed Chiang, The Truth of Fact, the Truth of Feeling\n\nTed Mooney, Easy Travel to Other Planets\n\nTerry Carr, The Dance of the Changer and the Three\n\nUmberto Eco, The Name of the Rose\n\nUrsula K. Le Guin, Always Coming Home\n\nUrsula K. Le Guin, the Dispossessed\n\nUrsula K. Le Guin, The Nna Mmoy Language\n\nVance, The Moon Moth \n\nVernor Vinge, A Deepness in the Sky\n\nVernor Vinge, Children of the Sky\n\nWalter Jon Williams, Surfacing\n\nWalter M. Miller Jr., a Canticle for Liebowitz\n\nWilliam Gibson, Neuromancer",
        "created_utc": 1676800630,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is the usual quality of the vowel of FOOT (/ʊ/) in FOOT=STRUT accents, [ʊ] or [ɵ]?",
        "author": "PerspectiveSilver728",
        "url": "https://www.reddit.com/r/linguistics/comments/1165s3c/what_is_the_usual_quality_of_the_vowel_of_foot_ʊ/",
        "text": "I've usually seen FOOT in these sort of accents being transcribed as just \\[ʊ\\] but I feel like I've also heard speakers whose realizations consistently sounded more front, lying somewhere in the area of \\[ɵ\\] ([like in SSB/modern RP](https://www.englishspeechservices.com/blog/le-foot-vowel/)). \n\nSo I was wondering if this \\[ɵ\\] pronunciation actually can be found among some FOOT=STRUT speakers or if I'm just mishearing things.",
        "created_utc": 1676796839,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does the concept of oldest language exist or even make sense?",
        "author": "Mapartman",
        "url": "https://www.reddit.com/r/linguistics/comments/11653gs/does_the_concept_of_oldest_language_exist_or_even/",
        "text": "I ask this because I made a [(rather controversial) post](https://www.reddit.com/r/TamilNadu/comments/10fdrfu/there_is_no_such_thing_as_an_oldest_language/) on r/TamilNadu explaining why I think the concept of an \"oldest language\" makes no sense, and that claiming Tamil is oldest language is ridiculous.\n\nMy friend u/PlanBig6274 refuses to believe this for many reasons, including the fact that I am not a profession linguist. So to the professional linguists out here, my questions are:\n\n1. Does the concept of oldest language exist or even make sense?\n2. How are languages dated? (Is it based off changes in script, grammar etc)\n3. Can Tamil be considered \"the oldest language\" in any relevant way?\n\nThank you",
        "created_utc": 1676794143,
        "upvote_ratio": 1.0
    },
    {
        "title": "my friend said he heard a man frequently say a term that sounded like \"oh-nem-bua\" we have been puzzled for an incredibly long time",
        "author": "WoodTheChuck",
        "url": "https://www.reddit.com/r/linguistics/comments/1163xky/my_friend_said_he_heard_a_man_frequently_say_a/",
        "text": "Does anyone know what this term could mean? Senegal or France is likely the country of origin",
        "created_utc": 1676789610,
        "upvote_ratio": 1.0
    },
    {
        "title": "Currently stuck in my Master's thesis. This is about corpus research. Can you help?",
        "author": "TheReflectionTower",
        "url": "https://www.reddit.com/r/linguistics/comments/1163f2z/currently_stuck_in_my_masters_thesis_this_is/",
        "text": "Hi! I am writing my Master's thesis and I don't know precisesly how to continue with my work: basically I need to understand how certain constructions work (in Italian), and to do that I have to do some corpus research. Now, I don't really know how to use the corpora to do that: I mean, I search those constructions in the various corpora, but what next? How should I infer how the constructions I'm studying work?\n\nMaybe I should know that, but I never really did something like that, moreover my specialty is in \"educational liguistics\". Can you help?",
        "created_utc": 1676787646,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why is Armenian an agglutinating language?",
        "author": "Samuel_Journeault",
        "url": "https://www.reddit.com/r/linguistics/comments/1162ati/why_is_armenian_an_agglutinating_language/",
        "text": "Looking on Wikipedia I learned that Armenian was probably the only non-synthetic Indo-European language.\n\nIs it an evolution of the language or is it a borrowing from Turkic or Caucasian languages?",
        "created_utc": 1676783616,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is there science behind false cognates?",
        "author": "JustChillinlmao",
        "url": "https://www.reddit.com/r/linguistics/comments/115u6a0/is_there_science_behind_false_cognates/",
        "text": "I know the general idea of false cognates; words that may sound similar, but arised separately. This had led me to see two potential theories:\n\n1. This occurs simply by chance. This is the general accepted idea of the reasoning. There are millions of words in every language, so there will be overlaps of certain languages by default.\n\n2. There is a basis as to why certain words may sound like one another in languages that we may not know about. Humans may naturally say some words similar due to environmental factors. (ie. Mama being a mostly universal word for mother). I guess I’m just wondering how far this logic can be applied. 餐厅(can-ting) and canteen mean the same thing, but supposedly have zero connection. Could you argue that there’s a basis as to why more complex words may sound similar in varying languages?",
        "created_utc": 1676759749,
        "upvote_ratio": 1.0
    },
    {
        "title": "ChatGPT is a great advancement in AI Language Models. However, I thought I'd devise a test to demonstrate that it's still lacking in an understanding in semanticity.",
        "author": "Lukmin1999",
        "url": "https://i.redd.it/mbm5olsac0ja1.png",
        "text": "",
        "created_utc": 1676752477,
        "upvote_ratio": 1.0
    },
    {
        "title": "ChatGPT has a good understanding of English grammar, but it still has problems with semantics. I provided a little test to demonstrate this.",
        "author": "Lukmin1999",
        "url": "https://i.redd.it/kgk00786uuia1.png",
        "text": "",
        "created_utc": 1676752125,
        "upvote_ratio": 1.0
    },
    {
        "title": "Since-sense merger in Western American English",
        "author": "BeansAndDoritos",
        "url": "https://www.reddit.com/r/linguistics/comments/115n59o/sincesense_merger_in_western_american_english/",
        "text": "I've noticed a new sound change in my dialect, which I'm calling the *since-sense* merger. In this sound change, a stressed /ɪ/ lowers to /ɛ/ in some environments. Some words with this I've noticed in my dialect are *milk*, *vanilla*, *gorilla*, *disintegrate*, *since*, and *begin*. It seems like the rule is something along the lines of \"stressed /ɪ/ adjacent to a nasal lowers to /ɛ/\", with *gorilla* perhaps being an analogy with *vanilla*.\n\nTwo other interesting points of note:\n\nI pronounce the word *miracle* with \\[eɪ\\] in the initial syllable instead of \\[i\\], which (as far as I know) could be a realization of the same sound change before /r/.\n\nThe sound change seems to be slightly non-uniform, because I've heard other speakers pronouncing the word *anti-semitic* with the sound change whereas those from my local area do not.\n\nDoes anyone else have any insights? In particular, I'm looking for more affected words if any of you speak a dialect with the sound change so we can deduce a regular environment where it takes place.",
        "created_utc": 1676748565,
        "upvote_ratio": 1.0
    },
    {
        "title": "English Lessons Class - Linguistics, Grammar, Essay",
        "author": "Zakclass",
        "url": "https://www.englishlessonsclass.com/2023/02/what-is-phonitics.html",
        "text": "",
        "created_utc": 1676745849,
        "upvote_ratio": 1.0
    },
    {
        "title": "Do languages develop words for tastes in the same fashion they do for colors?",
        "author": "TheDebatingOne",
        "url": "https://www.reddit.com/r/linguistics/comments/115lgdv/do_languages_develop_words_for_tastes_in_the_same/",
        "text": "I just saw how [Etymonline](https://www.etymonline.com/word/sour#etymonline_v_23926) traces sour to a PIE word meaning \"salty, sour, bitter\". Which reminded my of how the word yellow comes from refered to both green and yellow, and in general how some languages have less or more basic color terms than others.\n\nTaste, like color, is also a nebulous spectrum that humans split up using words, and so I'm assuming not all languages cut up the spectrum in the same way, so how differently do they do it? Do words for bitter almost always come before words for sweet, for example?",
        "created_utc": 1676744047,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is there anything like a Rosetta Stone for learning IPA phonetics?",
        "author": "danielrosehill",
        "url": "https://www.reddit.com/r/linguistics/comments/115ki60/is_there_anything_like_a_rosetta_stone_for/",
        "text": "Hope this is an acceptable post for this community.\n\nI'm currently trying to learn the IPA phonetics representations.\n\nThere are interesting videos on YouTube but I was wondering if - to accelerate my progress - there is any sort of online learning program that might resemble something like a Rosetta Stone style immersion methodology.\n\n(As in ... you get shown an IPA symbol and can play its sound and then reinforce that knowledge through multiple choice questions)?\n\nTIA for any leads towards resources.",
        "created_utc": 1676741499,
        "upvote_ratio": 1.0
    },
    {
        "title": "Transatlantic Accent",
        "author": "thisiswidow",
        "url": "https://www.reddit.com/r/linguistics/comments/115jffk/transatlantic_accent/",
        "text": "Hello! I'm new to Reddit and I know next to nothing about linguistics, but I figured this subreddit was the best place for my question :). So, I'm writing a screenplay that's  a neo-noir that pays a lot of homage to the classic film noir genre, and want to write some characters with Transatlantic accents. I've considered that once it were to be hypothetically acted out, you could just hear the accents, but that's not really a solution as I really want to channel these details in the scripts, just in case I enter it in my school's screenwriting contest. I really want my stylistic choices to seem deliberate. However, I don't want to do it phonetically, I want to find certain words, phrases, and overall slang that would be fitting with the accent/its origin and the old Hollywood setting. It would also be helpful if anyone knows any speech patterns/sentence structuring that are recognizable? Really anything that might be useful. Thanks!",
        "created_utc": 1676738622,
        "upvote_ratio": 1.0
    },
    {
        "title": "Stress marking in Iberian languages",
        "author": "ilemworld2",
        "url": "https://www.reddit.com/r/linguistics/comments/115i2pf/stress_marking_in_iberian_languages/",
        "text": "Accents that mark syllable stress are some of the features that, if applicable, make a language truly phonetic. Without having to flip through a dictionary, you can pronounce any word in the language accurately. \n\nHowever, it seems that in Europe, only Iberian languages have this beneficial feature. Italian also marks stress, but it only does it partially. IIRC, the only non-Iberian language that always marks stress (not counting shortcuts like the vowel + n + s rule in Spanish) is Greek.\n\nWhy isn't this more common in Europe? Why is syllable stress only marked in the Iberian peninsula?",
        "created_utc": 1676734873,
        "upvote_ratio": 1.0
    },
    {
        "title": "Two pronunciations of ‘salt’ in British English?",
        "author": "Randomname052",
        "url": "https://www.reddit.com/r/linguistics/comments/115h54y/two_pronunciations_of_salt_in_british_english/",
        "text": "I've been noticing recently that I pronounce words like ‘salt’ differently to my dad. I can't find much about this online. I'm not familiar enough with the IPA to transcribe the pronunciations, but I think mine could be described as a ‘vault-volt merger’. I'd like to understand how prevalent this is, and which is considered the standard pronunciation. If anyone could provide some information or let me know what I need to search to find out more about it, I would be grateful.",
        "created_utc": 1676732331,
        "upvote_ratio": 1.0
    },
    {
        "title": "Yiddish loanwords in British English?",
        "author": "bookshelfbauble",
        "url": "https://www.reddit.com/r/linguistics/comments/115gyu7/yiddish_loanwords_in_british_english/",
        "text": "Not sure if this is the right place to pose this question, but here goes. Recently I’ve been thinking about how ubiquitous Yiddish loanwords are in American English, and was wondering if they’d managed to find their way into British English as well.",
        "created_utc": 1676731829,
        "upvote_ratio": 1.0
    },
    {
        "title": "HELP",
        "author": "jacksashtray",
        "url": "https://www.reddit.com/r/linguistics/comments/115bjd4/help/",
        "text": "[removed]",
        "created_utc": 1676712578,
        "upvote_ratio": 1.0
    },
    {
        "title": "Syllabification of words like \"exam\"",
        "author": "xoseph12",
        "url": "https://www.reddit.com/r/linguistics/comments/115b1v7/syllabification_of_words_like_exam/",
        "text": "The rules of syllabification for English that I learned in school are Maximum Onset Principle and Sonority Contour Principle.\n\nIf we apply these principles to \"exam\" /ɪgzæm/, the result should be /ɪ.ɡzæm/, right? MOP tells us to put as many sounds as possible to the onset of a syllable, and SCP tells us to make sure the sonority of a syllable first increases then decreases. /g/ has a lower sonority than /z/, so we should just put them all to the second syllable.\n\nBut the syllabification of this word on both cambridge [https://dictionary.cambridge.org/dictionary/english/exam](https://dictionary.cambridge.org/dictionary/english/exam) and webster [https://www.ldoceonline.com/dictionary/exam](https://www.ldoceonline.com/dictionary/exam) are: /ɪɡˈzæm/. It does make more sense, but why? Are there any other rules other than this two when it comes to English syllabification?",
        "created_utc": 1676710579,
        "upvote_ratio": 1.0
    },
    {
        "title": "How does one interpret these tables, and what are the differences between s and s', r and r', and m and m'? (Pre-Latin Iberian alphabet).",
        "author": "aragorn767",
        "url": "https://i.redd.it/ly6w42o8mxia1.png",
        "text": "",
        "created_utc": 1676701445,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do you interpret these tables, and what are the differences between s, s', r, r', m, and m'. (Pre-Latin Iberian alphabet).",
        "author": "aragorn767",
        "url": "https://i.redd.it/ulr1dcg3lxia1.png",
        "text": "",
        "created_utc": 1676701061,
        "upvote_ratio": 1.0
    },
    {
        "title": "Pre-Germanic Substrate features",
        "author": "Ealhart",
        "url": "https://www.reddit.com/r/linguistics/comments/1154x9c/pregermanic_substrate_features/",
        "text": "Hi all,\n\nI’m interested in understanding what evidence there is for Pre-Germanic substrate hypothesis and potential features, as I am contemplating using them as a base from which to build a conlang.\n\nTo my understanding, the dominant hypothesises are that the Pre-Germanic substrate was either Finnic/Uralic or Vasconic in origin, but what evidence do we actually have of the substrate? E.g. in vocabulary, grammar, phonology, etc.",
        "created_utc": 1676688341,
        "upvote_ratio": 1.0
    },
    {
        "title": "The Revival of Hebrew? (1879-1908) | Short documentary on the revival of Hebrew",
        "author": "limetom",
        "url": "https://www.youtube.com/watch?v=dYNpXmE_-5c",
        "text": "",
        "created_utc": 1676677568,
        "upvote_ratio": 1.0
    },
    {
        "title": "Definitenessless articles in languages",
        "author": "Niccccolo",
        "url": "https://www.reddit.com/r/linguistics/comments/1150no4/definitenessless_articles_in_languages/",
        "text": "Are there langauges that don't distinguish between definite and indefinite article but use articles anyway e.g. to specify number and gender?",
        "created_utc": 1676675872,
        "upvote_ratio": 1.0
    },
    {
        "title": "Colloquial Calgary English",
        "author": "Zafkiel666",
        "url": "https://i.redd.it/2243dnemfvia1.jpg",
        "text": "",
        "created_utc": 1676675006,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is going on in the picture, pragmatically speaking?",
        "author": "Klutzy-Pace-1473",
        "url": "https://www.reddit.com/r/linguistics/comments/114yuka/what_is_going_on_in_the_picture_pragmatically/",
        "text": " Which are the direct and the indirect speech acts involved? Are the participants being cooperative? Are any of Grice's conversational maxims being flouted? By whom, and to what effect?",
        "created_utc": 1676671133,
        "upvote_ratio": 1.0
    },
    {
        "title": "I have a concept I’d like some experts to weigh in on.",
        "author": "atryhardrooster",
        "url": "https://www.reddit.com/r/linguistics/comments/114wzs5/i_have_a_concept_id_like_some_experts_to_weigh_in/",
        "text": "So I was thinking about how language can cause delusion in the human psychi, and I started to think about people using language to create confirmation bias. I was thinking that the word god and good being so similar, and god being absolute goodness. And devil and evil being similar, and the devil being absolute evil, was surely done on purpose, right? These words were purposefully spelled to be almost exactly the same when the English language was being created, to create a stronger association between these words. This is my theory. For example if they chose to spell devil “ivdel” and evil “veli” this would create less of an association between the 2 concepts which would lead to less of a connection in the subconscious mind. Is this at all grounded in reality or is it just purely coincidence?",
        "created_utc": 1676666406,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why did palatalization in proto-gallo-romance turn /k/ and /g/ before front vowels into /ts/ and /dʒ/ if, AFAIK, there is a tendency for sounds further front to be more likely to be voiced and sounds further back to be unvoiced, and the only difference between /k/ and /g/ is voicing?",
        "author": "HexagonWire57",
        "url": "https://www.reddit.com/r/linguistics/comments/114udqz/why_did_palatalization_in_protogalloromance_turn/",
        "text": "I am referring to how, for example /G/ is much rarer than /q/, while there are languages like Arabic which have /b/ but lack /p/.",
        "created_utc": 1676659794,
        "upvote_ratio": 1.0
    },
    {
        "title": "Interpreting bespoke Shoshonean vowel notation to IPA to the practical orthography",
        "author": "OctaviusIII",
        "url": "https://www.reddit.com/r/linguistics/comments/114txlo/interpreting_bespoke_shoshonean_vowel_notation_to/",
        "text": "I’m having some issues converting Steward’s 1938 phonetic notation (from [Basin-Plateau Aboriginal Groups](https://repository.si.edu/handle/10088/15422), p. 272) into contemporary Shoshone orthography (I’m using Crum-Miller). Part of the issue is that I’m not a linguist or an anthropologist, so some of the terms like “continental usage” for the vowels is tough to interpret. I haven’t found a discussion about this particular notation. I’m interpreting place names rather than vocabulary for this exercise, so dictionaries are only part of the solution.\n\nAny thoughts on how to proceed?",
        "created_utc": 1676658666,
        "upvote_ratio": 1.0
    },
    {
        "title": "Interpreting bespoke Shoshonean vowel notation to IPA to the practical orthography",
        "author": "OctaviusIII",
        "url": "https://i.redd.it/gi0y1xrujsia1.png",
        "text": "",
        "created_utc": 1676658537,
        "upvote_ratio": 1.0
    },
    {
        "title": "Are there any languages that recognize vowel sounds that are usually present as a result of accents?",
        "author": "totallynotarobut",
        "url": "https://www.reddit.com/r/linguistics/comments/114tb0e/are_there_any_languages_that_recognize_vowel/",
        "text": "It's a curiosity, because these are valid sounds but I've never noticed that anyone recognizes them as anything other than someone's accent. For example, the way some of us in rural areas of the US say oil. The usual way to say it sounds almost like two syllables, but when pronounced the way, say, I say it, the i is heavily de-emphasized. I'd like to explain it better for those of you who don't know what I mean, but that's the problem -- I'm unaware of any indication that this sound is recognized so it's kind of impossible to explain to someone who doesn't already know how some of us pronounce it.",
        "created_utc": 1676657086,
        "upvote_ratio": 1.0
    },
    {
        "title": "Are there any Indian languages that don't primarily use a Brahmic script or the Latin alphabet? If so, why?",
        "author": "Davyslocket",
        "url": "https://www.reddit.com/r/linguistics/comments/114sxbu/are_there_any_indian_languages_that_dont/",
        "text": "Both Indo-Aryan and Dravidian languages use Brahmic scripts. Were there any literate pre-European people who used another script?",
        "created_utc": 1676656142,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why did the Arabic and Persian loan words in Hindi get transcribed with a Dental T and D but the English loans in the language get transcribed with retroflex Ts and Ds",
        "author": "freshmemesoof",
        "url": "https://www.reddit.com/r/linguistics/comments/114nha4/why_did_the_arabic_and_persian_loan_words_in/",
        "text": "I was curious as to why this happened because English, Persian *and* Arabic have alveolar Ts and Ds with the exceptions of some letters in Arabic and English. But the all the loans from Arabic and Persian in Hindi- if contained a T or D always became dentals in Hindi whereas all the English loans minus the \"th\" letters get transcribed as retroflexes. Please let me know why this happened",
        "created_utc": 1676646314,
        "upvote_ratio": 1.0
    },
    {
        "title": "Sanskrit IPA Transcriptions - Scharf 2011. But What's the Source?",
        "author": "thelinguistt",
        "url": "https://www.reddit.com/r/linguistics/comments/114lbfn/sanskrit_ipa_transcriptions_scharf_2011_but_whats/",
        "text": "[removed]",
        "created_utc": 1676643261,
        "upvote_ratio": 1.0
    },
    {
        "title": "Assistance with Minimalist tree diagrams: Feature checking a passive sentence",
        "author": "FindusMcMindus",
        "url": "https://www.reddit.com/r/linguistics/comments/114kih9/assistance_with_minimalist_tree_diagrams_feature/",
        "text": "Hi all,\n\nI've been struggling with this question for a little while and was hoping to get some clarification! With the following data array : Eve was seen in Vienna \n\nI understand that 'Eve' as the definite Np needs to move to the spec of TP but I'm not sure if it has to be copied or if it simply merges with T one bar to form TP. This is what I currently have but I'm left without anything to feature check the verb 'seen' in the array because of the oblique case of 'in' checking Vienna?\n\nAny assistance on where I have gone wrong would be greatly appreciated!",
        "created_utc": 1676641131,
        "upvote_ratio": 1.0
    },
    {
        "title": "Minimalist Tree diagram assistance with feature checking for the following passive sentence!",
        "author": "FindusMcMindus",
        "url": "https://i.redd.it/ka6igrl64ria1.jpg",
        "text": "",
        "created_utc": 1676640821,
        "upvote_ratio": 1.0
    },
    {
        "title": "Puzzle time #11",
        "author": "SpielbrecherXS",
        "url": "https://www.reddit.com/r/linguistics/comments/114jy0s/puzzle_time_11/",
        "text": "*The idea behind linguistic puzzles is to provide a snippet of information about a language or a group of languages, just enough for you to recognise patterns, formulate a hypothesis and solve the task, without any prior knowledge about the languages necessary. Have fun!*\n\n&amp;#x200B;\n\n**Puzzle #1**\n\n(*by Miriam Fried)*\n\nTurkish is spoken by about 60 million people in Turkey and surrounding countries. It is a member of the Altaic language family, which consists of about 65 languages, including Turkmen, Mongolian and maybe even Korean and Japanese. Until 1929, Turkish was written in the Arabic writing system. That system was then replaced by the Roman system, with a few special letters to represent certain Turkish sounds. For example, in this puzzle you will find the letter \"ç\" which represents a sound similar to the first sound in the English word \"chop.\"\n\nThe following are some Turkish words, followed by their English translations. Look at these words carefully and try to answer the questions below:\n\nkilimler = carpets, kilimde = in the carpet, deftere = to the notebook, defterlerde = in the notebooks, adamlara = to the men, taraflarda = in the sides, okula = to the school, arabalar = cars, deniz = ocean, masa = table, ev = house, havuç = carrot, defter = notebook\n\n***Translate into Turkish:***\n\nin the ocean, to the carrot, tables, in the notebook, to the houses\n\n&amp;#x200B;\n\n***Short answer:*** &gt;!in the ocean = denizde, to the carrot = havuça, tables = masalar, in the notebook = defterde, to the houses = evlere!&lt;\n\n&amp;#x200B;\n\n***Explanation:***\n\n&gt;!Group the words by form: plural (easy to see it ends with either -ler or -lar), “in the” (ends with -de or -da), and “to the” (-e or -a). See that ler/lar comes before the other affix, and the choice of /a/ vs. /e/ depends on the root vowels: /e/ is used for roots with front vowels (e and I)!&lt;\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n**Puzzle #2**\n\n*(by A.A. Zaliznyak, adapted)*\n\n&amp;#x200B;\n\nYou have Arabic words and their translations in random order:\n\n1) miγzal, ma’buud, mahzan, ‘aamil, mirkab, ma’bar, maγzuul, ma’bad, mi’bar, ma’mal\n\n2) idol, worker, (river) crossing, warehouse, yarn, ferry, factory, spindle (for spinning wool etc.), temple (place of worship), telescope\n\n&amp;#x200B;\n\n***Task 1.*** Find translations for each Arabic word.\n\n***Task 2.*** Make up additional composite Arabic words and explain their meanings.\n\n&amp;#x200B;\n\n***Short answer:*** &gt;!miγzal = spindle, ma’buud = idol, mahzan = warehouse, ‘aamil = worker, mirkab = telescope, ma’bar = crossing, maγzuul = yarn, ma’bad = temple, mi’bar = ferry, ma’mal = factory!&lt;\n\n&gt;!Possible new words include markab = observatory, mi’mal = machine tool, or γaazil = spindler.!&lt;\n\n&amp;#x200B;\n\n***My thinking:***\n\nThis one took me a while!\n\n&gt;!1) Group translations into object/place pairs: ferry - (river) crossing, worker - factory, yarn - spindle, idol - temple (place of worship).!&lt;\n\n&gt;!Warehouse and telescope are standalones.!&lt;\n\n&gt;!2) Grouping Arabic words into pairs didn’t get me anywhere, so I tried for a different approach, making up a table of vowel vs. consonant patterns. It immediately gave me a set of four a-a words and three pairs (four, with the addition of ma’mal / ‘aamil despite a somewhat different structure).!&lt;\n\n&gt;!3) It also leaves mirkab/mahzan as standalone counterparts to telescope/warehouse, respectively, since mahzan falls into the a-a group of four, and we do have four places (crossing, factory, temple, and warehouse).!&lt;\n\n&gt;!4) If this assumption above is correct, this means that mirkab (telescope), along with the two other i-a words, forms a group of tools, and it also means we have a single pair where the non-place word (‘aamil) is outside of other non-place groups of words, and probably means “worker” as the only word relating to a human.!&lt;\n\n&gt;!5) We have three remaining pairs (ma’buud/ma’bad, mi’bar/ma’bar, and miγzal/maγzuul), where mi’bar and miγzal are tools and ma’bad and ma’bar are places (crossing and temple). The “placeless” pair of miγzal/maγzuul probably corresponds to spindle/yarn, respectively (see i-a tool group above). Which leads us the the next assumption that ma’buud and maγzuul are objects of action (worshiping or spinning here), not tools. Meaning that ma’buud/ma’bad are most likely to mean idol/temple, while mi’bar/ma’bar are left with ferry/crossing.!&lt;",
        "created_utc": 1676639384,
        "upvote_ratio": 1.0
    },
    {
        "title": "Evidence for (some) phonemic vowel length in English?",
        "author": "L1qu1dN1trog3n",
        "url": "https://www.reddit.com/r/linguistics/comments/114iocg/evidence_for_some_phonemic_vowel_length_in_english/",
        "text": "I've heard some people say that vowel length isn't phonemic in any English dialects, but I've spotted in my own accent (some sort of hybrid between standard Southern British English and Geordie English) a possible minimal pair between the words 'very' and 'vary', which I pronounce \\['vɛʋɪi\\] and \\['vɛːʋɪi\\] respectively. Is this not enough to say that, at the very least, there is a phonemic difference between ɛː and ɛ in my dialect of English?",
        "created_utc": 1676635184,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does the human brain really process language?",
        "author": "FusionRocketsPlease",
        "url": "https://www.reddit.com/r/linguistics/comments/114gx7i/does_the_human_brain_really_process_language/",
        "text": "Wouldn't it be more like \"efficient information integration?\" For example, the brain did not evolve to understand writing, but we all use it instantly after learning it from childhood. Likewise, spoken and heard language is the act of recognizing patterns in sounds and associating them with other things after learning the association. The brain does not know what \"language\" is because it is a human invention. Evidence that language is not exclusively spoken/heard is that we can learn sign language without learning to use the more common form. Other animals don't understand \"language\" because their brains are either too simple, or they haven't evolved a part of the brain to recognize integrated patterns the way we learn. What do you think?",
        "created_utc": 1676630313,
        "upvote_ratio": 1.0
    },
    {
        "title": "Tonal interjections? in non-tonal language",
        "author": "Fast-Alternative1503",
        "url": "https://www.reddit.com/r/linguistics/comments/114dz4m/tonal_interjections_in_nontonal_language/",
        "text": "**TL;DR:**\nAn interjection in an unambiguously non-tonal language seems to depend largely on pitch patterns, some of which don't exist outside this interjection and others that have different meanings within this interjection. The pitch patterns do not spread to following words.\n\nIn one dialect of a language, which does not distinguish tone on any lexical level, there seems to be one interjection that does. Unfortunately, it is extremely badly documented, and regional differences can be very large. So giving the language and dialect names is unlikely to help, and more likely to lead to incorrect findings. The \"interjection\" in question is pronounced /ha:/. \n\nIt is not a word. Alone, it has no meaning. But depending on two factors, its meaning changes. The first is vowel length and the second is the pitch.\n\nTo notate the pitch, look at where the lines above the \"a\" are.\n\n/hà:/ kind of evokes the idea of something like \"yeah right\"\n/hâ:/ (really long) evokes the idea of \"oh\" as in realisation\n/ha:/ (slightly long) is used to respond when being called.\n/ha/ evokes the idea of surprise\n/há/ evokes the idea of surprise at an idea like when you hear something that makes no sense\n\nDo note for  that literally means the pitch starts low, climbs and falls back. \n\nThere are probably a lot more of these variations that I forgot. Vowel length is distinctive, so that is expected. But the tone part is kinda weird. Is it prosodic? Possibly. \n\nBut some of these pitch patterns are missing in other speech, such as â, and others have different meaning. For example, à is used to express only extreme anger when applied to whole words, coupled with loudness. Yet, some seem to follow the prosody rules. For example, the pitch pattern in á is usually used to express surprise.\n\nFor the last one, it seems reasonable to assume it is a variation of /ha/, since they have nearly the same meaning. Also, the pitch doesn't follow into following words if there are any.\n\n\nThis is unfortunately all I know and can provide. \n\n\nIn English, which we also know is non-tonal, I can't think of anything similar.\n\n**Question:**\n\nDo you think this is complicated prosody I may not have analysed correctly, or what is this?",
        "created_utc": 1676620457,
        "upvote_ratio": 1.0
    },
    {
        "title": "Welocalize is hiring for \"Ads Quality Rater – German (Germany)\"",
        "author": "kumarstaffing",
        "url": "https://www.reddit.com/r/linguistics/comments/114de4o/welocalize_is_hiring_for_ads_quality_rater_german/",
        "text": "[removed]",
        "created_utc": 1676618100,
        "upvote_ratio": 1.0
    },
    {
        "title": "collective nounssss woooo",
        "author": "bae_diggs",
        "url": "https://www.reddit.com/r/linguistics/comments/114c0ld/collective_nounssss_woooo/",
        "text": "why are they so cool? do they occur in other languages, or are they an english phenomenon? is there a collective noun for collective nouns, or is that just a paradox?\n\n&amp;#x200B;\n\nand, perhaps most importantly, which of these obscure collective nouns is the superior collective noun:\n\n&amp;#x200B;\n\n* a lechery of priests\n* a load of diapers\n* a panel of carpenters\n* a handful of gynecologists\n* a hotbed of swingers\n* a HANDFUL of *gynecologists*\n\n&amp;#x200B;\n\nTIA!!",
        "created_utc": 1676613011,
        "upvote_ratio": 1.0
    },
    {
        "title": "Final Ə for emphasis",
        "author": "kkachisae",
        "url": "https://www.reddit.com/r/linguistics/comments/114bfil/final_ə_for_emphasis/",
        "text": "Lately, I've noticed that some English speakers (mainly young North American women) add a schwa at the end of sentences, resulting in phrases like \"Oh my god-(d)uh!\" or \"Give it back-(k)uh!\"  The speakers seem to add the Ə for emphasis, since they do not add it after every /d/ or /k/.. \n\nWhat is this phenomenon called?",
        "created_utc": 1676610935,
        "upvote_ratio": 1.0
    },
    {
        "title": "Reaching C2 in one day",
        "author": "Edwincooperboy",
        "url": "https://www.reddit.com/r/linguistics/comments/114awcj/reaching_c2_in_one_day/",
        "text": "The definition of a C2 is someone that knows 20,000 words, and since numbers are considered a form of words, all you have to do is to be able to count to 20,000.  \n\n\nIn English, you just need to know the numbers 1-12, as well as the various bases, 20, 1000, 10000, etc., and you should be able to count to 20,000 in one day, which are words that would fit into the definition of C2.",
        "created_utc": 1676609178,
        "upvote_ratio": 1.0
    },
    {
        "title": "Latin",
        "author": "DaveKellett",
        "url": "https://www.reddit.com/gallery/1146ynb",
        "text": "",
        "created_utc": 1676600862,
        "upvote_ratio": 1.0
    },
    {
        "title": "This seem a bit prescriptive.",
        "author": "MineBloxKy",
        "url": "https://i.redd.it/vvc7gyvyooia1.jpg",
        "text": "[removed]",
        "created_utc": 1676593400,
        "upvote_ratio": 1.0
    },
    {
        "title": "University of Toronto, Sociolingustic Survey",
        "author": "Adelhied0712",
        "url": "https://www.reddit.com/r/linguistics/comments/11447jn/university_of_toronto_sociolingustic_survey/",
        "text": " I am a student of University of Toronto, taking LIND11, advanced sociolingustic. We are carrying out research on lingustic use, we are asking if you would agree to participate in our research by completing this survey. The LIND11 survey at maximum should take about 3-4 minutes to complete. You do not have to participate at all, or, even if you agree now, you can terminate your participation at any time without prejudice. You also do not have to answer individual questions you don’t want to answer. Your name will not be attached to the questionnaire, and we will ensure that your participation remains confidential. We can tell you that your response may be included in the paper I will write at the conclusion of this assignment; however, your responses would be anonymous, and nobody could connect your responses with you as an individual. In this survey, you need to answer all of the questions (which will take about 3-4 minutes at maximum). If you agree to the above conditions, you may start now. Good luck and thank you for your participation.\n\n[https://docs.google.com/forms/d/e/1FAIpQLScGXHZi4s7Qc6FV7xteNDOUEjtHpQfXzN2EwpNTuoVdZBzGkA/viewform?usp=sf\\_link](https://docs.google.com/forms/d/e/1FAIpQLScGXHZi4s7Qc6FV7xteNDOUEjtHpQfXzN2EwpNTuoVdZBzGkA/viewform?usp=sf_link)",
        "created_utc": 1676589356,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why did Korean and Vietnamese people adopt Chinese style names, while Japanese people didn't?",
        "author": "Korean_Jesus111",
        "url": "https://www.reddit.com/r/linguistics/comments/1144529/why_did_korean_and_vietnamese_people_adopt/",
        "text": "While Japanese people do have names written in Chinese characters, the characters can be pronounced with a mixture of the Sinitic pronunciation (on'yomi) and the native Japanese pronunciation (kun'yomi), or even special pronunciations used specifically for names (nanori). Korean and Vietnamese names, when written out in Chinese characters, always use the Sinitic pronunciation of the characters.\n\nEssentially, Korean and Vietnamese names have the same convention as Chinese names. Japanese names only appear in writing to look like Chinese names (although with a higher prevalence of 2-character last names), but they actually have a different naming convention.\n\nWhat caused Korean and Vietnamese people to adopt Chinese naming conventions while Japanese people didn't? Was there any point in the past when Japanese people did adopt Chinese style names and then switch back to their own naming conventions, or did Japanese people never adopt Chinese style names?",
        "created_utc": 1676589179,
        "upvote_ratio": 1.0
    },
    {
        "title": "Proto-Algic Syllables",
        "author": "T1mbuk1",
        "url": "https://www.reddit.com/r/linguistics/comments/1142kip/protoalgic_syllables/",
        "text": "So far, as a result of my searching for information about the syllables of, and reconstructed proto-words for Proto-Algic, none of the search results are helping. Can any of you figure out the structure?",
        "created_utc": 1676585225,
        "upvote_ratio": 1.0
    },
    {
        "title": "Ithkuil version 2 just dropped",
        "author": "Prunestand",
        "url": "https://i.redd.it/7fnjxjp6cmia1.png",
        "text": "",
        "created_utc": 1676582911,
        "upvote_ratio": 1.0
    },
    {
        "title": "Talking about PIE's Laryngeals and Vowels",
        "author": "T1mbuk1",
        "url": "https://www.reddit.com/r/linguistics/comments/113y8as/talking_about_pies_laryngeals_and_vowels/",
        "text": "Some information on Wikipedia about PIE is likely wrong, even regarding the vowels being only limited to \\[e\\], \\[o\\], and their long versions, when that is least likely to occur in a language. Also, there are multiple ideas, as you already know, for the exact consonants the subscripted h's represent. I have a few guesses myself(ruling out secondary articulation):\n\n1. ç, x, h\n2. ç, x, ħ\n3. x, χ, h\n4. x, χ, ħ\n5. x, ħ, h\n\nBut which vowel inventory and laryngeal fricatives do you feel would most likely be the most plausible for PIE?",
        "created_utc": 1676574187,
        "upvote_ratio": 1.0
    },
    {
        "title": "Are there any languages that you know of that place the article after the noun?",
        "author": "Bilbobaginses1",
        "url": "https://www.reddit.com/r/linguistics/comments/113wzh0/are_there_any_languages_that_you_know_of_that/",
        "text": "When I was reading Understanding syntax by Maggie Tallerman. I swear I read her say something about indonesian putting the articles after the noun. But I reread some of the pages where I thought it said that, and I found nothing. so I was wondering if anybody knew of any languages that had this feature.",
        "created_utc": 1676571010,
        "upvote_ratio": 1.0
    },
    {
        "title": "Noun &lt;=&gt; Verb ? [English language]",
        "author": "DasAllerletzte",
        "url": "https://www.reddit.com/r/linguistics/comments/113lcv0/noun_verb_english_language/",
        "text": "I know there’s the thing with turning a verb into a noun sometimes (e.g. to walk -&gt; the walk)\n\nNow I want to know if this also works vice versa?\n\nI’ve had the problem, reading the word „thermostatting“.  \nI know what a thermostat is and what it does.  \nBut I’ve never seen it used as a verb before.\n\nSo is this, like, a regular thing in English like in some other languages?",
        "created_utc": 1676534408,
        "upvote_ratio": 1.0
    },
    {
        "title": "TRAP-BATH split in Irish English?",
        "author": "PerspectiveSilver728",
        "url": "https://www.reddit.com/r/linguistics/comments/113k9xl/trapbath_split_in_irish_english/",
        "text": "Does the TRAP-BATH split exist in Irish English?\n\nOn the [vowel table](https://en.wikipedia.org/wiki/Hiberno-English#Overview_of_pronunciation_and_phonology) from the Irish English Wiki page, 'broad /æ/' is listed as a part of Irish English, but Irish English isn't mentioned at all on the Wiki page that's specifically about the [phonological split](https://en.wikipedia.org/wiki/Trap%E2%80%93bath_split).\n\nSo I was wondering if Irish English really did have the split or if this was just completely false.\n\n&amp;#x200B;\n\nhttps://preview.redd.it/ihmhhg9vyhia1.png?width=702&amp;format=png&amp;auto=webp&amp;v=enabled&amp;s=5fab9b6ed502e29f5a8a5f399fbc42d8f2858df3",
        "created_utc": 1676530076,
        "upvote_ratio": 1.0
    },
    {
        "title": "Do Americans use “use” in this context",
        "author": "doritosFeet",
        "url": "https://www.reddit.com/r/linguistics/comments/113iu2k/do_americans_use_use_in_this_context/",
        "text": "I was having a personal conference with a professor. For context, I’m a grad student. He shared his ideas with me and I said I wouldn’t be able to help implement it but I’d be happy to share my knowledge with him. And then he goes “then I can use you for that”\n\nIs this use of the word normal in such a context?",
        "created_utc": 1676524847,
        "upvote_ratio": 1.0
    },
    {
        "title": "Soviet-era transliteration question",
        "author": "just_another_sheep",
        "url": "https://www.reddit.com/r/linguistics/comments/113ioqn/sovietera_transliteration_question/",
        "text": "I have a distinct memory of reading some linguistics book in college that made a strange claim. It said that during the soviet era, some language was transitioned from some script to Cyrillic. During the transition, a guide book was published with a typo - by mistake, the character \"1\" was prescribed as a letter in the new spelling rules for the language.  \n\n\nProblem is, I have no idea if this story is even true or not. I do remember reading it but I haven't been able to corroborate the story and it's proven very difficult to construct search queries about since the character \"1\" appears all over all sorts of webpages. Furthermore, since I'm not sure what language it even was, my search scope is really limited.  \n\n\nFeeling at the end of my rope, I asked ChatGPT about it. Confidently, it told me the following:  \n\n\n&gt;Yes, there is a language that includes the numeral \"1\" as a letter, and that language is Azerbaijani.  \n&gt;  \n&gt;Azerbaijani was written in the Arabic script before the Soviet Union began promoting the use of the Latin script in the 1920s, and later the Cyrillic script in the 1930s. During the conversion to the Cyrillic script, an extra letter was added to the Azerbaijani alphabet, which was a modified form of the letter \"sh\" (written in Cyrillic as \"ш\"). This modified letter looked similar to the number \"1\" and was mistakenly replaced by the numeral in some printed materials, leading to confusion and errors in written Azerbaijani.  \n&gt;  \n&gt;In 1991, after the dissolution of the Soviet Union, Azerbaijan switched back to the Latin script, and the modified letter \"sh\" was replaced with a letter that more closely resembles its Arabic script predecessor. The numeral \"1\" is no longer used as a letter in Azerbaijani.\n\n  \nHowever, I obviously don't know if that's true either or if the bot just made everything up. Can anybody corroborate this story? I've tried to verify the bot's story but still not having much luck.",
        "created_utc": 1676524317,
        "upvote_ratio": 1.0
    },
    {
        "title": "ChatGPT gave me a very confident answer about a question I've had for ages, but I can't verify it. Does anyone have more information on this?",
        "author": "just_another_sheep",
        "url": "https://i.redd.it/dinsxgfxfhia1.png",
        "text": "",
        "created_utc": 1676523645,
        "upvote_ratio": 1.0
    },
    {
        "title": "Languages of the Mind: Essays on Mental Representation Book by Ray Jackendoff",
        "author": "SignificantRead8500",
        "url": "https://www.reddit.com/r/linguistics/comments/113hxnc/languages_of_the_mind_essays_on_mental/",
        "text": "I can't find this book in .pdf anywhere. Maybe there's a better place for me to post about it, please guide me to it? \nAlso what are some good books/resources to get started on Psycholinguistics? My professor's approach is very close to equative the mind to a computer and I'm having trouble accepting it. What are your thoughts?",
        "created_utc": 1676521727,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why are i and ɨ considered to be allophones in Russian while i and ɪ are considered to be seperate phonemes in Ukranian?",
        "author": "CrashBandioof420",
        "url": "https://www.reddit.com/r/linguistics/comments/113hnt9/why_are_i_and_ɨ_considered_to_be_allophones_in/",
        "text": "The main argument I hear for i and ɨ being different phonemes is that ɨ is just a variation of i that comes after non palatalized consonants. However, to my knowledge, Ukranian ɪ never comes after a palatalized consonant, and it also never comes at the start of a word. So why is Ukrainian considered to have six vowel phonemes while Russian is said to have five?",
        "created_utc": 1676520835,
        "upvote_ratio": 1.0
    }
]