[
    {
        "title": "Phoenician Pronunciations",
        "author": "Doodlebot11",
        "url": "https://www.reddit.com/r/linguistics/comments/10jnk7s/phoenician_pronunciations/",
        "text": "I've been trying to translate some Phoenician words, specifically 𐤔𐤋𐤌. I know it means peace and is equivalent to שָׁלוֹם or Shalom in Hebrew, but I've been having trouble figuring out what is the general scholarly consensus on how it would have been pronounced and how we would write that out in the Latin alphabet like שָׁלוֹם to Shalom. some sources say it was pronounced /ʃaloːm/ similar to Hebrew, some say /soːluːm/, others say /soːlyːm/, and some say it was /ʃaloːm/ in Levantine Phoenician but /soːluːm/ then later /soːlyːm/ in Punic.\n\nSo, I wanted to ask what is the correct way to pronounce it, in Punic and in traditional Phoenician, or at least what is the general consensus on how it was pronounced and how that would be Romanized?",
        "created_utc": 1674508098,
        "upvote_ratio": 1.0
    },
    {
        "title": "Orthography for music genres/styles?",
        "author": "MasThomp007",
        "url": "https://www.reddit.com/r/linguistics/comments/10jmrta/orthography_for_music_genresstyles/",
        "text": " I've been standardising my personal music library for days, and one of the challenges is to label the songs with their correct genres / styles.\n\nBut I find it confusing when I see the same genre / style being spelt differently, especially with the case and hyphen thing.\n\nFor example, is it \"K-pop\" or \"K-Pop\"? Is it \"Post-rock\" or \"Post rock\" or \"Post-Rock\". Is it \"Neo Soul\" or \"Neo soul\" or \"Neo-soul\"?\n\nI'm so confused. Is there an ISO standard for musical terms?",
        "created_utc": 1674506214,
        "upvote_ratio": 1.0
    },
    {
        "title": "Where/how do these ways of speaking development? Don’t instead of doesn’t",
        "author": "girgir2000",
        "url": "https://www.reddit.com/r/linguistics/comments/10jmm2q/wherehow_do_these_ways_of_speaking_development/",
        "text": "I’ve heard people, especially where I’m from which is the northeast of America speak like this including people in my family. They ll say things like, that don’t make no sense, he don’t know, I don’t have no money, etc. why did this way of speaking arise? My family all graduated high school and I hear college students here talk like this. The racial back l ground doesn’t matter, I’ve heard both black and white people speak like this. I know they  grammar and English in school, so why does this happen?",
        "created_utc": 1674505824,
        "upvote_ratio": 1.0
    },
    {
        "title": "Everyone who ever went vs *Someone who ever went",
        "author": "thegwfe",
        "url": "https://www.reddit.com/r/linguistics/comments/10jk4w8/everyone_who_ever_went_vs_someone_who_ever_went/",
        "text": "I'm doing the \"Exercise on negative polarity\" in Section 6.6 of the book by Heim and Kratzer. It asks you to characterize quantifiers that make sentences like the following grammatical:\n\n(1) Q people ever went.\n\n(2) Q people who ever went were happy.\n\nFor example, (1) is grammatical with Q=\"No\" or Q=\"Few\", but ungrammatical with Q=\"All\" or Q=\"Some\". Meanwhile, (2) is grammatical with Q=\"All\" or Q=\"No\", but ungrammatical with Q=\"Some\" or Q=\"Two\". The setting is formalized as follows. Quantifiers are relations on the set of sets of individuals. For example for Q=\"All\", the sentence\n\nQA B\n\nis true iff A ⊂ B, and for Q=\"Some\" it is true iff A ∩ B  ≠ ∅.\n\nOkay, so for which Q is (1) true? I made a big table showing which quantifiers have certain formal properties. The set of quantifiers making (1) grammatical coincided with the set of \"right downward monotone quantifiers\", that is, those with\n\nA ⊂ B, CQB  ⇒ CQA.\n\nQuick googling seems to agree with this solution. The key phrase is \"downward entailment\" licencing negative polarity items. But what about (2)? Well, we can try applying this \"downward entailment\" here as well. if QAB is grammatical with B involving \"ever\" iff Q is right downward monotone, then I suspect QAB is grammatical with A involving \"ever\" iff Q is *left* downward monotone.\n\nThis *mostly* fits with my table, which predicts that (2) is grammatical with \"Every\" and \"No\", but not with \"Some\", \"Two\", \"Most\". That doesn't seem quite right, since the sentence is grammatical with \"Most\". (At least I think so, I'm not a native speaker. But Google gives over a million hits for \"Most people who ever\", and only 5 hits for \"Some people who ever\".)\n\nSo my question is: What *is* a correct characterization of quantifiers allowed in (2)? Is my idea salvageable? I had no luck googling. I found in a few places that \"Every person who ever went\" is fine, but no generalization or explanation.",
        "created_utc": 1674499852,
        "upvote_ratio": 1.0
    },
    {
        "title": "If you knew every language in existence but could only teach your child one what would it be and why?",
        "author": "Dipablo115",
        "url": "https://www.reddit.com/r/linguistics/comments/10jjuaf/if_you_knew_every_language_in_existence_but_could/",
        "text": "Help me choose my language course please.",
        "created_utc": 1674499128,
        "upvote_ratio": 1.0
    },
    {
        "title": "different kinds of bilingualism",
        "author": "wagenrace",
        "url": "https://www.reddit.com/r/linguistics/comments/10jin5h/different_kinds_of_bilingualism/",
        "text": "[https://nimke.medium.com/the-types-of-bilingualism-explained-7d969cebdeac](https://nimke.medium.com/the-types-of-bilingualism-explained-7d969cebdeac)",
        "created_utc": 1674496316,
        "upvote_ratio": 1.0
    },
    {
        "title": "Bengali typefaces",
        "author": "Sector-Both",
        "url": "https://www.reddit.com/r/linguistics/comments/10jhdzl/bengali_typefaces/",
        "text": "I'm reading [this book](https://play.google.com/books/reader?id=bttGAAAAcAAJ&amp;pg=GBS.PR1&amp;hl=en_GB) , and apparently the first Bengali typeface was developed by Panchanan Karmakar for this book. This got me wondering about the history of Bengali typefaces and English typefaces in India during the British Raj. Does anyone have any resources for this? (Hope my question makes sense.)",
        "created_utc": 1674493337,
        "upvote_ratio": 1.0
    },
    {
        "title": "Hearing a word multiple times to permanently remember it?",
        "author": "MBeyrami",
        "url": "https://www.reddit.com/r/linguistics/comments/10jgk4s/hearing_a_word_multiple_times_to_permanently/",
        "text": "Hello!\n\nSometime within the last past 10 years I read a news article citing a study where researchers found out that hearing/listening to a (foreign) word for xx times (i think it was ~90? ~120?) would permanently ingrain it on one's long-term memory. I remember trying it myself by setting up an audio-player to repeat an audio file containing one word based on the discovered number. \n\nThe thing is, I can't remember the study's name, the researcher's name....and not even the number itself!\n\nAny clue? I'd appreciate some help, it's been bugging me for a while now, I can't find the study anywhere now",
        "created_utc": 1674491331,
        "upvote_ratio": 1.0
    },
    {
        "title": "Post-Apocalyptic American East Coast Dialects.",
        "author": "YonasThe",
        "url": "https://www.reddit.com/r/linguistics/comments/10jgd3e/postapocalyptic_american_east_coast_dialects/",
        "text": "Hello there! I plan on making a video analyzing a post-apocalyptic American east coast that has gone completely medieval. In this video I will quote historical figures, and I want to figure out what some groups of people would sound like if they spoke normal English in an accent or dialect. I would not want this to be unintelligible to English speakers. The main accents I would be interested in is Pennsylvania Dutch, Southern, and an accent descending from general American. I know very little about linguistics but I hope I can find help.",
        "created_utc": 1674490843,
        "upvote_ratio": 1.0
    },
    {
        "title": "Use of \"fam\" in British English",
        "author": "arkman132",
        "url": "https://www.reddit.com/r/linguistics/comments/10jfh9t/use_of_fam_in_british_english/",
        "text": "So I recently found out that the word \"fam\" is part of aave, but it is also a huge part of British English, I don't think iv ever heard an American persons say it besides when imitating British people. The word first spread in the UK because of its use by ally G. I'm wondering what people who are actually well versed in language think.",
        "created_utc": 1674488650,
        "upvote_ratio": 1.0
    },
    {
        "title": "Highest \"Information to Syllable Ratio\"?",
        "author": "KlLLMEPLZ",
        "url": "https://www.reddit.com/r/linguistics/comments/10je66q/highest_information_to_syllable_ratio/",
        "text": "Which natural languages have the highest information to syllable ratio? As in it can convey the most meaning with the least syllables. This thought crossed my mind while I was looking at some dubbed Disney songs in other languages. I realised the \"information density per syllable\" of a language is an important factor when it comes to songwriting and translations, since if the same meaning has to fit into a longer phrase with more syllables, it would require having to change the rhythm of the lyrics, or cutting out important bits of information.  \n\n\nFor example, the Japanese version of \"We Don't Talk About Bruno\" definitely has some rhythm changes to the song: [https://youtu.be/hUY3ul8Y1j4](https://youtu.be/hUY3ul8Y1j4).   \n\n\nAdditionally, extending from this, given languages with high information to syllable ratios, it can be argued that they allow for more lyrical freedom to fit into a rhythm of a song. I know that according to this [paper](https://sci-hub.se/https://muse.jhu.edu/article/449938/pdf). English, Vietnamese and Chinese are good contenders with the highest amount of information conveyed per syllable. Are there any others?",
        "created_utc": 1674485284,
        "upvote_ratio": 1.0
    },
    {
        "title": "How true is the claim that \"there is a fixed number of syllables in any language, of which relatively few (around 500) are usually enough to form all the most frequent words.\" (Field 2008)",
        "author": "CanidPsychopomp",
        "url": "https://www.reddit.com/r/linguistics/comments/10jdkh5/how_true_is_the_claim_that_there_is_a_fixed/",
        "text": "What's the truth to this claim? Does anyone know the author may have got this number from?\n\nI do realise that this is from TESOL/SLA, not from 'real' linguistics. I had a quick google and couldn't find anything.\n\nThe original source is John Field, Listening in the Language Classroom",
        "created_utc": 1674483638,
        "upvote_ratio": 1.0
    },
    {
        "title": "This week's Q&amp;A thread -- please read before asking or answering a question! - January 23, 2023",
        "author": "AutoModerator",
        "url": "https://www.reddit.com/r/linguistics/comments/10jatck/this_weeks_qa_thread_please_read_before_asking_or/",
        "text": "Do you have a question about language or linguistics? You’ve come to the right subreddit! We welcome questions from people of all backgrounds and levels of experience in linguistics.\n\nThis is our weekly Q&amp;A post, which is posted every Monday. We ask that certain types of questions be asked here instead of in a separate post.\n\n**Questions that should be posted in the Q&amp;A thread:**\n\n* Beginner questions — if you’re looking for a general answer that can be found in an introductory textbook, then it probably belongs here. If you ask in a separate post we’ll ask you to move it here.\n\n* Questions that can be answered with a simple Google or Wikipedia search — you should try Google and Wikipedia first, but we know it’s sometimes hard to find the right search terms or evaluate the quality of the results. Instead of removing these questions, we just ask you post them here.\n\n* Asking why someone (yourself, a celebrity, etc.) has a certain language feature — unless it’s a well-known dialectal feature, we can usually only provide very general answers to this type of question. And if it’s a well-known dialectal feature, it still belongs here.\n\n* Requests for transcription or identification of a feature — remember to link to audio examples.\n\n* English dialect identification requests — for language identification requests and translations, you want r/translator. If you need more specific information about which English dialect someone is speaking, you can ask it here.\n\n* Questions about prescriptivism — such as whether it's good or bad, when it's appropriate, whether something \"counts\" as prescriptivism, etc. These questions usually need the same general answers clarifying the role of descriptivism/prescriptivism in linguistics, so please post them here.\n\nWe’ll ask you to move your post to the Q&amp;A thread if you post it on the front page and we think it fits one of the above categories. You’re free to post your question here.\n\nIf you post your question to the Q&amp;A thread and don’t get an answer by the end of the week, you can post it as a separate post. If it’s already the weekend, you might want to wait to post your question until the new Q&amp;A post goes up on Monday.\n\n**Discouraged Questions**\n\nThese types of questions are subject to removal:\n\n* Asking for answers to homework problems. If you’re not sure how to do a problem, ask about the concepts and methods that are giving you trouble. Avoid posting the actual problem if you can.\n\n* Asking for paper topics. We can make specific suggestions once you’ve decided on a topic and have begun your research, but we won’t come up with a paper topic or start your research for you.\n\n* Asking for grammaticality judgments and usage advice — basically, these are questions that should be directed to speakers of the language rather than to linguists.\n\n* Questions that are covered in our FAQ or reading list — follow-up questions are welcome, but please check them first before asking how people sing in tonal languages or what you should read first in linguistics.",
        "created_utc": 1674475211,
        "upvote_ratio": 1.0
    },
    {
        "title": "Phonological Rules",
        "author": "murrxxie",
        "url": "https://www.reddit.com/r/linguistics/comments/10j7kcj/phonological_rules/",
        "text": "What are the challanges in teaching and learning phonological rules?",
        "created_utc": 1674462150,
        "upvote_ratio": 1.0
    },
    {
        "title": "Which language when spoken communicates the most information in the least time/syllables?",
        "author": "knowbodynows",
        "url": "https://www.reddit.com/r/linguistics/comments/10j62ih/which_language_when_spoken_communicates_the_most/",
        "text": "I suppose there's a trade-off with accuracy so I guess I'm also interested in the language with highest accuracy of communication per syllable.\n\nAlso interested in the least efficient and the least accurate. (Assuming a listener with full vocabulary.)\n\nThere must be all kinds of qualifiers absent in my question so I'm interested in what those are.\n\nI imagine english is efficient because largest vocabulary. Esperanto and German must score well in accuracy. Tagolog probably less efficient. Japanese hard to guess... \n\nIs there a language that's particularly pleasurable to speak because you experience high certainly that you're understood with high resolution of nuance?",
        "created_utc": 1674456118,
        "upvote_ratio": 1.0
    },
    {
        "title": "[2207.02098] Neural Networks and the Chomsky Hierarchy",
        "author": "koavf",
        "url": "https://arxiv.org/abs/2207.02098",
        "text": "",
        "created_utc": 1674455306,
        "upvote_ratio": 1.0
    },
    {
        "title": "Bachelor’s in Linguistics Jobs",
        "author": "snickitysnacc",
        "url": "https://www.reddit.com/r/linguistics/comments/10j16fu/bachelors_in_linguistics_jobs/",
        "text": "[removed]",
        "created_utc": 1674440121,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why do people say ‘buffalo buffalo buffalo buffalo buffalo’ makes sense?",
        "author": "Wizards_Reddit",
        "url": "https://www.reddit.com/r/linguistics/comments/10j036v/why_do_people_say_buffalo_buffalo_buffalo_buffalo/",
        "text": "Buffalo isn’t a verb so in what way does it make sense? There are other similar sentences that do make sense but they all have a verb. There’s the town of Buffalo, and the animal of buffalo, so ‘Buffalo buffalo’ works, but where do the extra 3 ‘buffalo’s come from?",
        "created_utc": 1674436879,
        "upvote_ratio": 1.0
    },
    {
        "title": "Thinking about going back to school...",
        "author": "GreemBeemz",
        "url": "https://www.reddit.com/r/linguistics/comments/10izuik/thinking_about_going_back_to_school/",
        "text": "I (37m) I have a Bachelor's in an unrelated field, and am kinda going nowhere, career-wise.\n\nI've been thinking about working on getting a master's in linguistics. I have a passion for language, and learning new languages. I feel like I would enjoy being an interpreter or translator. Would linguistics be the right thing to study? Would it make sense to major in a specific language, or is \"linguistics\" a completely different concept?\n\nDoes anybody know any good schools (preferably online) that have a good program?\n\nI'm kinda just getting started on researching this, so any starting points, ideas, or advice are greatly appreciated. Thanks!",
        "created_utc": 1674436171,
        "upvote_ratio": 1.0
    },
    {
        "title": "slams my hands down.",
        "author": "torturecollege",
        "url": "https://www.reddit.com/r/linguistics/comments/10iym42/slams_my_hands_down/",
        "text": "i've decided. after years of avoiding it. months of saying i will never touch it. never look at it. i am going to pick up thai.\n\ni love challenges and i'm capable of learning anything with enough time... but thaiiii? if thai shoved me against a locker and demanded my lunch money i'd piss myself\n\n\"mandarin chinese has the hardest writing system!!\" no the fuck it does not. that has got to be one of the easier ones. at least mandarin doesn't have an alphabet that flips letters around, has no spaces, no punctuation, shove em all together!!\n\nbut this language is mocking me at this point. ouughh you'll never be able to learn thai ohghhj forget about it NO. now i can't. i cave. it's thai time.\n\nif anyone here knows or has attempted to learn thai i need your help with this. where do i even start with the 72 characters and no partners to practice? i will watch shows and listen to music and conversations. but for my own notes? grammar? i need a tip or two or eight",
        "created_utc": 1674432661,
        "upvote_ratio": 1.0
    },
    {
        "title": "ITAW for an expression originally used metaphorically but now the metaphorical definition is used more than the original definition? Like “dog piling” for example",
        "author": "tempestokapi",
        "url": "https://www.reddit.com/r/linguistics/comments/10iw47r/itaw_for_an_expression_originally_used/",
        "text": "I think astroturfing also fits if we can say astroturfing means both “to put astroturf on a yard” and “to create fake grassroots campaign.”",
        "created_utc": 1674426216,
        "upvote_ratio": 1.0
    },
    {
        "title": "How many cases does your language have?",
        "author": "LeAuriga",
        "url": "https://www.reddit.com/r/linguistics/comments/10ivy5h/how_many_cases_does_your_language_have/",
        "text": "Just curious. Mine has 16 lol",
        "created_utc": 1674425779,
        "upvote_ratio": 1.0
    },
    {
        "title": "Very short linguistics survey",
        "author": "Beneficial_Entry_835",
        "url": "https://www.reddit.com/r/linguistics/comments/10ivr4d/very_short_linguistics_survey/",
        "text": "Hi everyone!\n\nMe and my friend are conducting a survey for our sociolinguistics class. We would really appreciate you taking the time to do it. It is for native Dutch or native English speakers.\n\nHere is the link: [https://uva.fra1.qualtrics.com/jfe/form/SV\\_erGINMPASAL4RLM](https://uva.fra1.qualtrics.com/jfe/form/SV_erGINMPASAL4RLM)\n\nThank you a lot &lt;33",
        "created_utc": 1674425282,
        "upvote_ratio": 1.0
    },
    {
        "title": "Please make sense of this wikipedia sentence for me",
        "author": "jannyuses",
        "url": "https://www.reddit.com/r/linguistics/comments/10iusdh/please_make_sense_of_this_wikipedia_sentence_for/",
        "text": "\"The nephron is the **minute** or microscopic structural and functional unit of the kidney.\"\n\n\n\nWord in bold is causing confusion, what is meant by that?",
        "created_utc": 1674422917,
        "upvote_ratio": 1.0
    },
    {
        "title": "A New video by RobWords on Anglish",
        "author": "theanglishtimes",
        "url": "https://youtu.be/aMA3M6b9iEY",
        "text": "",
        "created_utc": 1674418124,
        "upvote_ratio": 1.0
    },
    {
        "title": "Languages in Prefaces",
        "author": "AffectionateSize552",
        "url": "https://thewrongmonkey.blogspot.com/2023/01/languages-in-prefaces.html",
        "text": "",
        "created_utc": 1674417753,
        "upvote_ratio": 1.0
    },
    {
        "title": "Which Romance language has the most consonants?",
        "author": "Qaqqu",
        "url": "https://www.reddit.com/r/linguistics/comments/10ism7f/which_romance_language_has_the_most_consonants/",
        "text": "Can be Sicilian? Not counting the allophones, there are 35 sounds:\n\nb c ç d̪ ɖ dz dʒ f ɡ j ɟ k l m ɱ n ŋ ɲ ɳ p ɾ ɽ s ʂ ʃ t̪ ʈ ts tʃ v ɣ w x z ʐ \n\nCounting allophones, the sounds are 43: ɖʐ (allophone of ɖɖ), ʈʂ (allophone of ʈɽ), r (allophone of ʐ), ʒ (allophone of z), ʝ (allophone of ɟ), h (allophone of f only in some Calabrian dialect), kkx and qqχ (allophones of kk).\n\nMaybe it doesn't count, but some speakers in some areas (like Caltanissetta) tend to replace k p t with kʰ pʰ tʰ. If we count this, the sounds are 46",
        "created_utc": 1674417548,
        "upvote_ratio": 1.0
    },
    {
        "title": "i need help from a linguist",
        "author": "ghost_hay",
        "url": "https://www.reddit.com/r/linguistics/comments/10iskd7/i_need_help_from_a_linguist/",
        "text": "Hello, i got interested in siberian languages such as yukaghir and others, but all linguistic papers or grammar books i found are all written using the latin script, but that doesn't make sense, the languages use the cyrillic alphabet. Any help to transliterate from latin to cyrillic? I can read cyrillic well so that's not a problem",
        "created_utc": 1674417418,
        "upvote_ratio": 1.0
    },
    {
        "title": "[Article] (bilingual) Language development: Preverbal stage (0–1 years)",
        "author": "wagenrace",
        "url": "https://medium.com/@nimke/language-development-preverbal-stage-0-1-years-ec16517cdcac",
        "text": "",
        "created_utc": 1674415755,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is there a term for the second “separator” used in many languages? One Mississippi, to kasse øl, etc",
        "author": "dtewfik",
        "url": "https://www.reddit.com/r/linguistics/comments/10iqn9i/is_there_a_term_for_the_second_separator_used_in/",
        "text": "I’m learning Danish and am realizing that they (of course) don’t use Mississippi to count out seconds and am trying to learn how other cultures/languages do this. Any clues or hints at what I can look up?",
        "created_utc": 1674412658,
        "upvote_ratio": 1.0
    },
    {
        "title": "UC Irvine's Intro to Linguistics lectures are available on YouTube!",
        "author": "ElitePowerGamer",
        "url": "https://www.youtube.com/playlist?list=PLp17O33E3qFw9Rh1XrZHVfsfK8lhFawJ0",
        "text": "",
        "created_utc": 1674411346,
        "upvote_ratio": 1.0
    },
    {
        "title": "Did English ever have a case system?",
        "author": "Automated_Automaton1",
        "url": "https://www.reddit.com/r/linguistics/comments/10iplaa/did_english_ever_have_a_case_system/",
        "text": "I was wondering if English ever had a case system for inflections to denote the nominative, accusative, gelatine, etc like some other languages do",
        "created_utc": 1674410039,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do you keep up with new developments in linguistics research?",
        "author": "astrasaurus",
        "url": "https://www.reddit.com/r/linguistics/comments/10ipdkd/how_do_you_keep_up_with_new_developments_in/",
        "text": "As the title states :) I'm interested in research &amp; a more steady source of input about linguistics research developments &amp; studies. However, the only way I can think of gaining this atm is through reading research papers. I was wondering if there was a more efficient way or source, kind of like a news source, but specifically focused on different linguistics fields?",
        "created_utc": 1674409494,
        "upvote_ratio": 1.0
    },
    {
        "title": "Translating without understanding?",
        "author": "TheRandomRath",
        "url": "https://www.reddit.com/r/linguistics/comments/10ip545/translating_without_understanding/",
        "text": "Hello, I am a math student who has zero knowledge about linguistics. Recently, I came across a type of question which I found interesting, that was \"Given x sentences in a foreign language and y sentences in a known langauge, figure out which is which\". \n\nNow I am aware different languages have different subject/verb/object arrangements, different ways to represent yes/no etc, so is there a resource that could broadly help me or point me in the right direction? [the exact question ](https://imgur.com/a/RmXSPX0) for reference. Thank you!",
        "created_utc": 1674408894,
        "upvote_ratio": 1.0
    },
    {
        "title": "very short linguistics survey",
        "author": "Beneficial_Entry_835",
        "url": "https://www.reddit.com/r/linguistics/comments/10iorac/very_short_linguistics_survey/",
        "text": "Hi everyone!\n\nMe and my friend are conducting a survey for our sociolinguistics class. We would really appreciate you taking the time to do it. It is for native Dutch or native English speakers.\n\nHere is the link: [https://uva.fra1.qualtrics.com/jfe/form/SV\\_erGINMPASAL4RLM](https://uva.fra1.qualtrics.com/jfe/form/SV_erGINMPASAL4RLM)\n\nThank you a lot &lt;33",
        "created_utc": 1674407928,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to pitch a project for a postdoctoral job? Do you just work on one big study and then say you will publish it as different manuscripts? What's the end goal?",
        "author": "darknthorny",
        "url": "https://www.reddit.com/r/linguistics/comments/10in68z/how_to_pitch_a_project_for_a_postdoctoral_job_do/",
        "text": "I am applying for a postdoc, I do have a project in mind that's not the issue, but I'm struggling to formulate what I will do with this study as I'm describing my timeline for completion. Do I describe it as working on separate manuscripts for publication? Or does it have to be one single project (e.g., book?) Or does it not matter, I should just describe the study as a study? What is considered as \"completion\" then? When it's published? When it's written? \n\nSorry, I'm graduating soon and have never had to do this before. Also my field (sociolinguistics) does not really have a lot of postdocs so couldn't rely on any of my former now-employed classmates for help with samples. Thanks!",
        "created_utc": 1674403931,
        "upvote_ratio": 1.0
    },
    {
        "title": "Fenna Follow up",
        "author": "CoffeeChuggerTf",
        "url": "https://www.reddit.com/r/linguistics/comments/10im7qk/fenna_follow_up/",
        "text": "Hello everyone. I hope this finds you in good health and attitude. About my recent post about the so called \"fenna\" language. It is not real, as some of you probably guessed. I don't want to justify anything I did or said, but I don't want to start any drama with anyone either. \n\nI am just a an 18 year old who loves languages and everything that concerns linguistics. From this langauge, which you probably guessed is a conlang, I hoped to make no money from or monetize it in any way. I just got sick of nobody wanting to learn it, as the death of many conlangs stems from nobody else's desire to learn it. \n\nTo those who live in Tajikistan and the surrounding countries, I sincerely apologize for appropriating you and your culture. That was 100% wrong to do, and I take full blame for it and am willing to bear the brunt of the criticism.\n\nYou don't have to accept my apology, and I am open to the criticism and question, but I do not want to start drama with people. If any of the mods are reading this, I will accept a ban from the community and completely understand the reasoning behind it. \n\nThank you, r/linguistics and have a good day everyone :)",
        "created_utc": 1674401439,
        "upvote_ratio": 1.0
    },
    {
        "title": "What are some good YouTube channels about linguistics?",
        "author": "Still_a_potato7",
        "url": "https://www.reddit.com/r/linguistics/comments/10ik9ff/what_are_some_good_youtube_channels_about/",
        "text": ".",
        "created_utc": 1674395942,
        "upvote_ratio": 1.0
    },
    {
        "title": "how do we know how to copy/produce phonemes?",
        "author": "passavodiqui",
        "url": "https://www.reddit.com/r/linguistics/comments/10ii1t6/how_do_we_know_how_to_copyproduce_phonemes/",
        "text": "How is it that anyone can hear a phoneme, and, without having any knowledge on how it's articulated, reproduce it (with varying degrees of success)? Or even recognize it as an allophone of the phones they're already familiar with? \n\nWhat's the literature on this?",
        "created_utc": 1674388560,
        "upvote_ratio": 1.0
    },
    {
        "title": "Within a pidgin or creole, how likely is it for the substrate speakers to learn new vowels?",
        "author": "weedmaster6669",
        "url": "https://www.reddit.com/r/linguistics/comments/10ic7tg/within_a_pidgin_or_creole_how_likely_is_it_for/",
        "text": "I've been making a conlang of the hypothetical Norse-inuit pidgin, and here's the thing, from what I can gather Proto-Inuit had the common three vowel system + length and phonemic schwa 7 vowels in total. [Old Norse had 38 vowels](https://en.m.wikipedia.org/wiki/Old_Norse#Vowels), which is a lot more than 7. Is it likely for the Inuit speaers to learn e and o and such? What about diphthongs, might they replicate y with iw and e with əj and o with əw or something?",
        "created_utc": 1674366017,
        "upvote_ratio": 1.0
    },
    {
        "title": "Aspirations at the end of swear words?",
        "author": "TheStellarJay1",
        "url": "https://www.reddit.com/r/linguistics/comments/10ibwsh/aspirations_at_the_end_of_swear_words/",
        "text": "I've noticed recently that almost all popular swear words today end in an aspiration:\n\nfu(ck) di(ck) bi(tch) shi(t) a(ss) pi(ss) cun(t) \n\nDoes anyone have any ideas why this might be? I thought it might have something to do with them sounding more harsh or even final devoicing. Just a casual language learner, not a linguist, hoping someone might shed some light on this.",
        "created_utc": 1674364931,
        "upvote_ratio": 1.0
    },
    {
        "title": "What happened to the Latin words that didn't make it into English?",
        "author": "Current-Wealth-756",
        "url": "https://www.reddit.com/r/linguistics/comments/10iacup/what_happened_to_the_latin_words_that_didnt_make/",
        "text": "I was looking at quejarse, which in Spanish means to complain, and which comes from a similar Latin root. That got me thinking, why did some words make it from Latin to French to English, and others didn't? I can't think of any similar english words with that root, so was there ever one, or was a Germanic word just already available, or did there used to be a similar word that fell out of use? Is there any rhyme or reason to what words make it to English from Latin and which ones didn't?",
        "created_utc": 1674359742,
        "upvote_ratio": 1.0
    },
    {
        "title": "Fenna language recording!",
        "author": "CoffeeChuggerTf",
        "url": "https://drive.google.com/file/d/1fPL1LdPqXaDyeUl21LHBSOYgEJH4nBpx/view",
        "text": "A recording of me saying the Lord's Prayer in Fenna! Enjoy!",
        "created_utc": 1674349969,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why do so many singers make a “ch” sound in between t and y? (i.e want you= “wanchu”)",
        "author": "katastrophe_7719",
        "url": "https://www.reddit.com/r/linguistics/comments/10i6zgx/why_do_so_many_singers_make_a_ch_sound_in_between/",
        "text": "I’ve noticed this more when I’m listening to music and I’m curious if there’s a name for this phenomenon or a reason it happens instead of the usual t sound?",
        "created_utc": 1674349465,
        "upvote_ratio": 1.0
    },
    {
        "title": "[Syntax] Theta-role assignment in depictive construction",
        "author": "Apprehensive-Home254",
        "url": "https://www.reddit.com/r/linguistics/comments/10i5lp8/syntax_thetarole_assignment_in_depictive/",
        "text": "I wonder how theta-roles are being assigned in depictive construction, given that θ-criterion: Each argument bears one and only one θ-role, and each θ-role is assigned to one and only one argument. \n\nIn sentence like *I hammered the metal flat,*  there are two theta roles assigned by *hammer* to *I* and *the metal*. Then, how does flat assign its theta role?",
        "created_utc": 1674345595,
        "upvote_ratio": 1.0
    },
    {
        "title": "Origin of the \"Bunched/Gooise R\"?",
        "author": "Jamie3317",
        "url": "https://www.reddit.com/r/linguistics/comments/10i5hqv/origin_of_the_bunchedgooise_r/",
        "text": "I'm aware of how the \\[r\\] to \\[ɹ̠ʷ\\] sound change happened in English, however, I'm lost as to how the bunched R \\[ɣ̞ˤʵʷ\\] developed in English. I know that labialized postalveolar and labio-velar approximants are similar, however, I am curious as to how the bunching and pharyngealization developed. Is this related to \\[ɻ\\] or \\[ɑ\\] phones?\n\nI know this bunched R also occurs in Dutch, but I don't think it occurs in any other languages? I've tried researching it, but it doesn't seem like there is a lot of info about this topic. Can anyone explain this?",
        "created_utc": 1674345280,
        "upvote_ratio": 1.0
    },
    {
        "title": "Has anyone thought about analyzing programming languages as actual languages ?",
        "author": "Ambanidia",
        "url": "https://www.reddit.com/r/linguistics/comments/10i5gg2/has_anyone_thought_about_analyzing_programming/",
        "text": "Programming languages are literally a mean to communicate with something else. Syntax and grammar are MUCH more important (and therefore tell much more) and there's always a safekeeper telling you when you are talking nonsense logically wise (e.g. compilation errors, etc...).\n\nHow would you discriminate an actual language as opposed to a programming language ?",
        "created_utc": 1674345178,
        "upvote_ratio": 1.0
    },
    {
        "title": "Are there forms of old high german, of which exist runic sources?",
        "author": "MetalJucro",
        "url": "https://www.reddit.com/r/linguistics/comments/10i4oj5/are_there_forms_of_old_high_german_of_which_exist/",
        "text": "I hope I am at the right place for this subject and based on what I read in the rules, not in the wrong thread / sub.\n\nI am trying to find out if there have been sources about a form of old high german or earlyer language variant which has written runic sources.\n\nI have had a tattoo idea for more than a year now and I want to combine the end of the second merseburger charm with the image of an braceteate (said to be) depicting Uuodan/Wodan/Odin and a horse with a damaged/broken leg.\n\nI want to be as historically accurate as posible  and as the braceteate is from the 2. to 3. century ad (and because I love the look of runic writing) I've been trying to research earlyer forms of old high german or west-germanic from about that period.",
        "created_utc": 1674343051,
        "upvote_ratio": 1.0
    },
    {
        "title": "Are native English speakers actually sensitive to the difference between /θ/ or /ð/ and /f/ or /d/?",
        "author": "araiderofthelostark",
        "url": "https://www.reddit.com/r/linguistics/comments/10i3tci/are_native_english_speakers_actually_sensitive_to/",
        "text": "Hello, I am sorry for the messy title, but I couldn't really express it more eloquently.\n\nI wonder. I am a Polish native speaker. My native language does not contain either /θ/ or /ð/ (thing, thistle, thanks, the, etc.). Most Polish people, especially beginners, will pronunce, \"free\" and, \"three\" the same way. Nobody really points out the difference to us at any point during our formal education, so we have to learn about it on our own. I really can't comprehend why our school system does not place more emphasis on pronunciation. I would argue that it's very useful knowledge to possess.\n\nI will admit it took me quite a while until I got a hang of it. Actually, to this day I am not quite sure if I am pronuncing it correctly... I think I am, but I have no native English speakers near me to consult with.\n\nI wonder, are natives actually all that sensitive to the difference? If somebody pronunced \"three\" the same way as, \"free\", would you notice that? Do you think most English natives would be consciously aware of the difference? \n\nIs that a common occurence amongst other non-natives, or is it just a Polish phenomenon? Or am I actually going crazy and nobody ever mistakes those consonants and I live in an alternate universe\n\nI am sorry for my low English proficiency, I am interested in hearing your thoughts on the subject.",
        "created_utc": 1674340764,
        "upvote_ratio": 1.0
    },
    {
        "title": "Old French",
        "author": "Difficult_Adagio_485",
        "url": "https://www.reddit.com/r/linguistics/comments/10i395c/old_french/",
        "text": "Wiktionary says Z was pronounced TS in Old French, does anyone know what information this is based on or what evidence there would be for that pronunciation? I am not sure how the exact sound would even be traced or what the theory is based on, why not just say its pronounced like a regular Z? Modern French has Z pronounced like a English Z. Wikipedia also makes claim about Z in OF. I am not saying it is baseless, I am wondering what the evidence is, or if there is any skepticism about the claim.\n\n[https://en.wikipedia.org/wiki/Z](https://en.wikipedia.org/wiki/Z)",
        "created_utc": 1674339278,
        "upvote_ratio": 1.0
    },
    {
        "title": "Koenraad elst",
        "author": "Anonymouse207212",
        "url": "https://www.reddit.com/r/linguistics/comments/10i119b/koenraad_elst/",
        "text": "[https://youtu.be/JOSeXBdDI\\_M](https://youtu.be/JOSeXBdDI_M)",
        "created_utc": 1674333558,
        "upvote_ratio": 1.0
    },
    {
        "title": "Sharing my langauge",
        "author": "CoffeeChuggerTf",
        "url": "https://www.reddit.com/r/linguistics/comments/10i0fcw/sharing_my_langauge/",
        "text": "Hello. I am a 19 year old native of Tajikistan. I have moved to America to pursue a career as a Linguist. And in my time in the states, I have talked to people (to their disbelief) about my native langauge Fenna. See, originally I lived near the Zeravshan Valley in an isolated settlement. I moved to Dushanbe when I turned 18 and flew to America after enrolling to an American university. I now live in the US in California. Curiosity made me look up fenna on the internet a few times over the years and to my surprise I have found nothing about it. My American friends don't know about it, and I would love to raise awareness for it and I am asking the internet if they have heard of it. If you have any questions please ask :)",
        "created_utc": 1674332052,
        "upvote_ratio": 1.0
    },
    {
        "title": "What are some equivalents in languages other than English of stretching out one letter or sound for emphasis?",
        "author": "redcommodore",
        "url": "https://www.reddit.com/r/linguistics/comments/10i0b0t/what_are_some_equivalents_in_languages_other_than/",
        "text": "So for instance in English where you might write “ooooh” if you have a revelation or “haaaaaa” if something is especially funny or “arrrrgh” if you’re frustrated. I’d be especially curious if there are examples of the same concept in non-alphabetic languages.",
        "created_utc": 1674331745,
        "upvote_ratio": 1.0
    },
    {
        "title": "\"Burglarization\" - a linguistic process",
        "author": "BeansAndDoritos",
        "url": "https://www.reddit.com/r/linguistics/comments/10i01w1/burglarization_a_linguistic_process/",
        "text": "I'm wondering if the following process has an established name: where a derived word becomes an opaque formation to speakers and they produce a new derivation of the already-derived word to arrive at the original meaning. For example: burgle -&gt; burglar, which became opaque and generated the identical-meaning \"burglarize\".\n\nIf no word for this process exists yet, I propose we call it burglarization, as an alternative to the word \"burglary\". Thoughts?",
        "created_utc": 1674331121,
        "upvote_ratio": 1.0
    },
    {
        "title": "Finding this book",
        "author": "HericDumpsterfire",
        "url": "https://www.reddit.com/r/linguistics/comments/10hz8cz/finding_this_book/",
        "text": "A friend of mine described a book in the linguistics of arguing but couldn’t remember the title. He said it detailed how logical arguments are formed in various languages and the different approaches to rhetoric. Would anyone happen to know what he was talking about?",
        "created_utc": 1674329035,
        "upvote_ratio": 1.0
    },
    {
        "title": "Looking for people willing to help me out with a research project for university.",
        "author": "stonefacedbro",
        "url": "https://www.reddit.com/r/linguistics/comments/10hz5n1/looking_for_people_willing_to_help_me_out_with_a/",
        "text": "[removed]",
        "created_utc": 1674328835,
        "upvote_ratio": 1.0
    },
    {
        "title": "Evolution of counting and numbers in the English language?",
        "author": "TevTegri",
        "url": "https://www.reddit.com/r/linguistics/comments/10hymc5/evolution_of_counting_and_numbers_in_the_english/",
        "text": "I've tried searching for an answer to this and can't seem to find an answer specific to the English language.\nI want to know how we got from saying, \"two and twenty\" to \"twenty-two.\" It doesn't appear to be derived from French. I'd be interested in learning how our system of counting and words for numbers evolved over time.\n\nApologies if this is the wrong subreddit for the topic.",
        "created_utc": 1674327502,
        "upvote_ratio": 1.0
    },
    {
        "title": "Question on the loss of semantic information after orthography reform",
        "author": "hippobiscuit",
        "url": "https://www.reddit.com/r/linguistics/comments/10hxmz8/question_on_the_loss_of_semantic_information/",
        "text": "I've recently read the book [\"The Fall of Language in the Age of English\" by Minae Mizumura](http://cup.columbia.edu/book/the-fall-of-language-in-the-age-of-english/9780231163026), a thoroughly interesting book on the creation of a \"national literature\" of Japan in the face of modernization across major stages and events in history and its future. In particular two notable periods of national language policy were brought up which the author argues brought a significant effect on Japanese written language ; \n\n1. the first being the \"Genbun Itchi\" reform in the Meiji period (1910s) where written language which followed classical conventions was made to follow the spoken language, and\n2. the second being the discourse on national language policy following defeat in world war 2 and US Occupation (1946), where there was a society wide discourse that Japanese should adopt a totally different writing system which although there being proposals which included abandoning the use of Chinese Characters or total romanization, ended ultimately in a set of \"standard kanji\" which constituted a reduction of characters and simplified the writing of particular characters.\n\nWhile the ostensible objective of these language reforms were to increase literacy and make it easier for common people to acquire reading, the author argues that such an effect of the reforms was ultimately marginal as literacy rates in Japan during the time of these reforms were comparable to other countries at equal stages of societal development. The Author finds that such language reforms were ultimately detrimental to the written language as by aiming to make Japanese closer to a phonetic or alphabetic orthography, they effected an elimination of semantic meaning that could only be contained and communicated in writing.\n\nThe argument made by the author is that any language reform which aims to make the written language conform to spoken language (how words are pronounced) effects a destruction of the semantic meaning contained in writing. This argument suggests that this \"semantic simplification\" has wrought massive damage to the literature of Korea which adopted Hangul and Viet Nam which adopted romanization from both languages previously being written using Chinese Characters. From my own layperson's view this argument seems persuasive as I can imagine for instance what would happen if English or French decided to reform orthography so words were to be spelled solely according to how they were pronounced.\n\nIt was also mentioned that this societal policy to make literacy easier was adopted by scientists (I can't recall whom) that held the theory of Darwinist evolution in human language where it was thought that written language develops from pictograms, to logograms, ultimately arriving at an alphabet. \n\n**Conclusion and Questions:**\n\nI'd like to hear what the people here think about the author's position that aiming to reduce the differences between writing and spoken language amounts to the limitation of writing, that writing has little to gain and all to lose through social policies aiming at standardization. Is there another side of the argument on the effects of society-wide language policy? Is the theory of writing system evolution still credible in today's age? \n\nAny relevant linguistics sources and comments would be very useful for me as I find this a really interesting topic I know little about. If anything is unclear or you would like me to elaborate on certain points I'd gladly do so.",
        "created_utc": 1674325030,
        "upvote_ratio": 1.0
    },
    {
        "title": "Help finding a term",
        "author": "Toarindix",
        "url": "https://www.reddit.com/r/linguistics/comments/10hxb9w/help_finding_a_term/",
        "text": "The term I’m looking for describes the method of speaking/writing in a way that eliminates extraneous words that can be implied based on the context of the conversation in order to minimize the time spent speaking/writing. This is often used in radio communications among first responders such as firefighters, police, and ambulance personnel.  \n\nExample: “Engine 5 clear, Medic 8 remaining.”\n\nInstead of: “Engine 5 is now clear of the scene, Medic 8 will be remaining on the scene.” \n\nA more colloquial example is from The Office when Kevin says “why use many word when few word do trick.”",
        "created_utc": 1674324214,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why are so many romance languages SVO when Latin was an SOV language?",
        "author": "Ucanhaveitbetter",
        "url": "https://www.reddit.com/r/linguistics/comments/10hwqni/why_are_so_many_romance_languages_svo_when_latin/",
        "text": "Hello all,\n\nI don't know much Latin but I am under the impression it is a SOV language but it seems like French, Spanish, Portuguese and Italian are SVO. Why did this grammatical principle get lost in the development of these languages?",
        "created_utc": 1674322808,
        "upvote_ratio": 1.0
    },
    {
        "title": "I know every language sounds fast if you don't know it, but are there languages that are scientifically proven to be faster than other languages?",
        "author": "SeyfettinRayii",
        "url": "https://www.reddit.com/r/linguistics/comments/10hutq5/i_know_every_language_sounds_fast_if_you_dont/",
        "text": "Title pretty much says it",
        "created_utc": 1674317855,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why did coda -t shift to -l in Sino-Korean words but not native Korean words?",
        "author": "Mother-Structure",
        "url": "https://www.reddit.com/r/linguistics/comments/10htq0b/why_did_coda_t_shift_to_l_in_sinokorean_words_but/",
        "text": "I was reading up on the change of final -t to -l in almost all Sino-Korean words such as 일 /il/ from Middle Chinese /ʔiɪt̚/, but there are Native Korean words with coda -t intact, such as 낟 /nat/ and 끝 /k͈ɯt̚/. Correct me if I'm wrong, but most native Korean words did not shift from /-t/ to /-l/ while most Sino-Korean words did. Does anyone know why this was the case? Is it phonologically motivated, sociolinguistically motivated?",
        "created_utc": 1674314923,
        "upvote_ratio": 1.0
    },
    {
        "title": "Towns where patois are still strong?",
        "author": "Extronic90",
        "url": "https://www.reddit.com/r/linguistics/comments/10hra0l/towns_where_patois_are_still_strong/",
        "text": "Hello, everyone. I can here to ask if there are still any towns or villages in France where the local patois is still spoken and passed on? Thank you.",
        "created_utc": 1674307807,
        "upvote_ratio": 1.0
    },
    {
        "title": "\"GUPS\", the Great upheaval of the Phonological System in 5-6th century northwestern europe.",
        "author": "Hingamblegoth",
        "url": "https://www.reddit.com/r/linguistics/comments/10hqu6r/gups_the_great_upheaval_of_the_phonological/",
        "text": "[https://spw.uni-goettingen.de/projects/aig/mp4/SGA-INT-002.mp4](https://spw.uni-goettingen.de/projects/aig/mp4/SGA-INT-002.mp4)\n\nWatching this interesting video on Old irish with David Stifter i came across the acronym \"GUPS\", or the Great upheaval of the Phonological System in 5-6th century northwestern europe. This refers to the large (areal?) sound changes mostly in the form of strong phonetic reduction that drastically affected many northwestern european languages around the time of the fall of the western roman empire, namely Insular celtic, Germanic and Gallo-romance. \n\nCan I find more written on this phenomena?",
        "created_utc": 1674306415,
        "upvote_ratio": 1.0
    },
    {
        "title": "Regard v regarding in contemporary English",
        "author": "qiu_ennan",
        "url": "https://www.reddit.com/r/linguistics/comments/10hmgmx/regard_v_regarding_in_contemporary_english/",
        "text": "Why is the verb regard (in the sense relate to; concern) archaic, whilst the preposition regarding (effectively the present tense of the former) is not?",
        "created_utc": 1674289458,
        "upvote_ratio": 1.0
    },
    {
        "title": "Tabooness survey",
        "author": "Rare_Information5475",
        "url": "https://www.reddit.com/r/linguistics/comments/10hjwpc/tabooness_survey/",
        "text": "Hi everybody. I'm doing a survey for my linguistics course assignment. It contains 12 sentences, each to be rated with a degree of \"tabooness\". It can be completed within a few minutes. Very much appreciate your help and time! The link is here:\n\n[Tabooness survey](https://docs.google.com/forms/d/e/1FAIpQLSf6NjMlQKL_XUsNSn-LQEfKv86GtIQfZM5g-P_Mm2AZTrZ70w/viewform?usp=sf_link)",
        "created_utc": 1674279726,
        "upvote_ratio": 1.0
    },
    {
        "title": "Recent Ling graduate. Not finding work. What do I do?",
        "author": "shiekhyerbouti42",
        "url": "https://www.reddit.com/r/linguistics/comments/10hjwis/recent_ling_graduate_not_finding_work_what_do_i_do/",
        "text": "So I'm in a bit of an unusual circumstance: long story, but I wasn't able to complete my degree until this past year, when I turned 40. In the meantime, I worked IT jobs (not my favorite thing) and did some copy writing/editing, including an unpaid volunteer gig as editor-in-chief of a nonprofit's newsletter. \n\nI've applied to grad schools but won't hear back from them for another few months (I think I stand a decent shot at getting in - decent GPA at 3.56). So now I'm hunting for jobs in copy editing, writing, and so on. Although I'm familiar with AP, APA, and Chicago styles and although I have 3 years of experience not only editing but running a team and publishing, I don't seem to be taken very seriously by anybody. I'd very much like to change that. \n\nI will take another IT job if I really have to - it's getting to be looking that way - but I really want to do something I like for a change. I mean I can do anything for a few months, right? Of course, if I don't get in to a grad school I'm worried I'll be stuck in a field I really don't like.\n\nOf course it doesn't help that I'm kind of stuck where I am; but where I am is the fastest growing Midwest city second only to Chicago (Columbus OH) so it should (and does) have plenty of jobs in that field. I can't move because I don't have the money and because my fiancee has a job here that she can't leave (not that that would be a good idea anyway if I get into a grad school somewhere else entirely).\n\nI wonder if there's any resources for this sort of thing. And I wonder if there's another field I could check out. I am not very fluent in any foreign language though and I don't know what else to do. \n\nAny thoughts?",
        "created_utc": 1674279707,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can someone tell me what language this is?",
        "author": "JohnnyDeppsFingerTip",
        "url": "https://i.redd.it/fe0uv2xc4dda1.jpg",
        "text": "",
        "created_utc": 1674274054,
        "upvote_ratio": 1.0
    },
    {
        "title": "Syntactic Analysis | Indirect object - Adjunct",
        "author": "Zakclass",
        "url": "https://www.englishlessonsclass.com/2023/01/syntactic-analysis-indirect-object.html",
        "text": "",
        "created_utc": 1674248048,
        "upvote_ratio": 1.0
    },
    {
        "title": "What would this sound be called?",
        "author": "Toxopid",
        "url": "https://v.redd.it/w2g0azpub9da1",
        "text": "",
        "created_utc": 1674246171,
        "upvote_ratio": 1.0
    },
    {
        "title": "Interesting take on the sociolinguistic impact of ChatGPT, especially in education",
        "author": "EcstaticPangolin4719",
        "url": "https://medium.com/p/23144630b324",
        "text": "",
        "created_utc": 1674244857,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is there a name for the literary device used for a sentence like “gargoyles gargling oil”, etc",
        "author": "kriziaamberreads",
        "url": "https://www.reddit.com/r/linguistics/comments/10h56pr/is_there_a_name_for_the_literary_device_used_for/",
        "text": "(This is a lyric from a song that interests me)\n\nWhen you take a word and break it into two similar-sounding-to-the-original word and it still makes sense, is there a name for that?? I hope “literary device” is even the right category for that. I’m not a linguist, just someone fascinated with a concept!! TIA!!",
        "created_utc": 1674241341,
        "upvote_ratio": 1.0
    },
    {
        "title": "Puzzle time #7",
        "author": "SpielbrecherXS",
        "url": "https://www.reddit.com/r/linguistics/comments/10h2psi/puzzle_time_7/",
        "text": "*A comment under one of my previous posts made me realise some people here may not be familiar with the concept of linguistic puzzles. The idea is to provide a snippet of information about a language or a group of languages, just enough for you to recognise patterns, formulate a hypothesis and solve the task, without any prior knowledge about the languages necessary. Have fun!*\n\n&amp;#x200B;\n\n**Puzzle #1**\n\n(by Tom Payne)\n\n&amp;#x200B;\n\nThe following list of words is from the Agta language of the Central Cagayan Valley in the Northern island of Luzon, in the Philippines. There are now only about 600 speakers of this variety of Agta, although there are perhaps 10,000 people in the Philippines who speak other varieties also known as Agta. The Agta people now speak an Austronesian language similar to other languages spoken in the Philippines. However, they are descended from the Melanesian people who were present in the Philippines before the Austronesian peoples arrived. The Agta language is now seriously endangered.\n\n1. wer - creek\n\n2. balabahuy - little pig\n\n3. talobag - beetle\n\n4. bakbakat - granny\n\n5. palapirak - little money\n\n6. bahuy - pig\n\n7. bag - loincloth\n\n8. walawer - little creek\n\n9. balabag - little loincloth\n\n10. takki - leg\n\n11. labang - patch\n\n&amp;#x200B;\n\nNow you have enough information to translate the following words into Central Cagayan Agta:\n\nlittle leg, money, little beetle (this is the word for 'lady bug'), little patch, little granny\n\n&amp;#x200B;\n\nShort answer: &gt;!little leg = talatakki, money = pirak, little beetle = talatalobag, little patch = lalalabang, little granny = balabakbakat!&lt;\n\nExplanation: &gt;!The prefix for “little” is formed by the first sound of the root + /ala/!&lt;\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n**Puzzle #2**\n\n(by Kibrik A.Ye., adapted)\n\n&amp;#x200B;\n\nBelow are Ancient Greek words in Nominative (left) and Genitive cases without diacritics. Translations are for reference only, they are not relevant for solving the puzzle.\n\nκατηlιψ — κατηlιφοc (attic)\n\nπαιc — παιδοc (child)\n\nαιξ — αιγοc (goat)\n\nαιθιοψ — αιθιοποc (Ethiopian)\n\nπιτυc — πιτυοc (pine tree)\n\nκορυc — κορυθοc (helmet)\n\n&amp;#x200B;\n\nYou also have this set of Greek-based English words for reading convenience:\n\nπαραδοξ... - paradox\n\nκυβερνητ... - cybernet(ics)\n\nφιλοσοφ.. - philosoph(y)\n\nγυψ... - gyps(um)\n\nχαοc - chaos\n\nνεκταρ - nectar\n\nθεμ(α) - them(e)\n\nMind that all vowels read as in Spanish; κ always reads k; γ is g as in get; ch as in Loch Ness; and δ is a form of c.\n\nυ is similar to /u/ in June but is always rendered as \"y\" in Greek loanwords into English.\n\n&amp;#x200B;\n\n**Task:** Determine Nominative forms for the following nouns (here in Genitive):\n\n1. ορνιθοc (bird); 2. αραβοc (Arab); 3. ονυχοc (talon); 4. προβlητοc (cape, promontory).\n\n&amp;#x200B;\n\n*Short answer:*&gt;! 1. ορνιc; 2. αραψ; 3. ονυξ; 4. προβlηc.!&lt;\n\n&amp;#x200B;\n\n*My thinking:*\n\nI was rather baffled before looking up the tip &gt;!to group the consonants by place of articulation.!&lt;\n\n&gt;!1) Since we need to reconstruct Nominative from Genitive, lets look at the N=&gt;G transitions. The simplest is /-os/ =&gt; Ø in παιc =&gt; παιδοc and /-os/ =&gt; /-s/ in πιτυοc =&gt; πιτυc. This obvious correlation of /-s/ in N and /-os/ in G can also be seen in all the other nouns.!&lt;\n\n&gt;!2) The real trick is the mutating consonant root endings. We don't have enough data to reconstruct sound-by-sound correspondences, which implies we need to group the available consonants. Pooling the main text of the puzzle with the task, we find the wider range of consonants in Genitive, and it consists of labials (bpf), gutturals (gkh), and dentals (dtθ).!&lt;\n\n&gt;!3) In the bpf group, we see that both /p/ and /f/ converge on /p/ in Nominative (with the /-os/ for G changing to /-s/ for N, as we've already established). In the other two groups, we only have one example each, but if we assume similar pattern, it'd mean converging on /k/ in gkh and on Ø in dtθ, respectively.!&lt;\n\n&gt;!4) Therefore, keeping in mind that /ps/ and /ks/ have their own special letters: αραβοc =&gt;  \\*αραψ (bpf group), ορνιθοc =&gt;  \\*ορνιc and προβlητοc =&gt; \\*προβlηc (dtθ group), and ονυχοc =&gt; \\*ονυξ (gkh group). Which, incidentally, correlates nicely to the stone onyx in English.!&lt;",
        "created_utc": 1674235542,
        "upvote_ratio": 1.0
    },
    {
        "title": "Could anyone explain the difference between phonemes and allophones in a simple way?",
        "author": "canelitacanelota",
        "url": "https://www.reddit.com/r/linguistics/comments/10h2nfg/could_anyone_explain_the_difference_between/",
        "text": "Could anyone?",
        "created_utc": 1674235391,
        "upvote_ratio": 1.0
    },
    {
        "title": "if you know you know",
        "author": "fostersfruitcider",
        "url": "https://www.reddit.com/gallery/10h1aya",
        "text": "",
        "created_utc": 1674232226,
        "upvote_ratio": 1.0
    },
    {
        "title": "Government And binding theory books",
        "author": "brownie-_-monster",
        "url": "https://www.reddit.com/r/linguistics/comments/10gx4vt/government_and_binding_theory_books/",
        "text": "I am currently reading  \"Introduction to Government and binding theory\" by Liliane Haegeman, and was wondering if there is a book that could explain the theory in simpler terms. Any suggestions?",
        "created_utc": 1674221766,
        "upvote_ratio": 1.0
    },
    {
        "title": "What does the overt NP mean?",
        "author": "brownie-_-monster",
        "url": "https://www.reddit.com/r/linguistics/comments/10gtv4l/what_does_the_overt_np_mean/",
        "text": "I just started studying syntax, and I am a little bit lost in terminology. Would someone please explain to me what does overt NP stands for? TIA",
        "created_utc": 1674211582,
        "upvote_ratio": 1.0
    },
    {
        "title": "My confusions about NP specifiers, complements, and adjuncts.",
        "author": "Sharp_Artist9935",
        "url": "https://www.reddit.com/r/linguistics/comments/10gtnr6/my_confusions_about_np_specifiers_complements_and/",
        "text": "I am very confused by the division among specifiers, complements, and adjuncts of noun phrases (let’s talk about\n English because I’m studying mostly in English syntax). I’m not a native speaker of English so my judgments could be false, but I really feel them to be very much a word game.\n\nFor example, the NP “students of linguistics” contains a PP complement “of linguistics.” Then, the NP “linguistics students” seems to have the same meaning. And what is conveyed in the previous PP complement now is in the specifier. In what sense, a complement of NPs “completes the meanings?”\n\nMoreover, in deletion test, we can delete an optional constituent like an adjunct, but not a complement. Consider this sentence (one of my lecture materials to illustrate the deletion test): John will publish a book about the origin of language next year. “Next year” can be deleted; “about the origin of language” can also be deleted (the prof said it is an adjunct different from the of-structure). But “of language” cannot be deleted. I can easily accept this. But the question remains: if I change “the origin of language” to “language origin,” then it seems that the specifier “language” is equally unlikely to be deleted; similarly, if I change the about-PP to “of the origin of language,” then it seems that this complement can also be readily deleted just like the adjunct. Could anyone please solve my puzzles?",
        "created_utc": 1674210854,
        "upvote_ratio": 1.0
    },
    {
        "title": "Translating laguages without references",
        "author": "mangay67",
        "url": "https://www.reddit.com/r/linguistics/comments/10gsbnk/translating_laguages_without_references/",
        "text": "Is it possible to figure out an unknown language with no knowledge or context about it? Like a man born in rural  Wales who has never seen Chinese letters tries to use whatever he can translate. Ie. Like the internet and ai but a version of which that has never seen chinese.",
        "created_utc": 1674205870,
        "upvote_ratio": 1.0
    },
    {
        "title": "What's the origin of Languages?",
        "author": "DEADPUA",
        "url": "https://www.reddit.com/r/linguistics/comments/10gr319/whats_the_origin_of_languages/",
        "text": "For Example; English, French, Spanish they fall under the \"Latin Language\" word for example: EN: information, FR: information (spelled differently), ES: información (spelled almost like French, yet written a bit differently)\n\nBasically; a lot of words in those languages are the same to Linguists (I speak about 4 languages; could be 5)\n\nSo I was wondering Latin; is mostly spoken in the Americas And Western Europe.\nWe have Tamazight spoken by Northern Africans; We have Arabic Spoken from North Africa; passing the Middle East and even in India... (For example Shukriya/Shukran in Arabic or Thanks in English)\n\nBelow what I mostly curios about:\n\nAnd we have Russian; Kazakh, Ukrainian which sounds kinda the same, maybe because they have common words like Latin (ex: word: information between English, French...)\n\nAll in All, What are the Main Languages and we can take Arabic or Latin as example for me to understand Russian, Chinese/Mandarin/Malay or Even Pechtu (a language between Afghanistan, Pakistan and maybe even Iran; so that I can know more about the last mentioned Territories/Regions.\n\nPS; Just a curious human being/person!/aka a 5 year old is asking his parent!\n\nThank you all!",
        "created_utc": 1674201254,
        "upvote_ratio": 1.0
    },
    {
        "title": "Ideas for a linguistics related science fair project?",
        "author": "_Mexican_Soda_",
        "url": "https://www.reddit.com/r/linguistics/comments/10gqqiu/ideas_for_a_linguistics_related_science_fair/",
        "text": "Hi everyone!\n\nIn my school, the science fair is coming up. My school is a really small one, with only around 60 students in all high school. Because of this, Science Fair in my school is a really small event compared to other schools. The school doesn't choose any winners due to this, basically everyone gets an A+ on their project, and we also have a lot of liberty on what project we want to choose for our science fair. \n\nSince I don't really have to worry too much about the science fair, I would like to take advantage of this and use this science fair as a way to do a project based around linguistics.  This is because I feel that it could be a great opportunity to learn how to do a research project, and because I have been recently getting a great interest in linguistics. However, I'm having a little bit of trouble choosing a project I would like to do.\n\nThe first idea that came up to my mind, was to do a project on how personal pronouns (tu vs usted) in Spanish affect the way you perceive your family members. For context, I live in both the Mexican side and the US side of the US-Mexico border, and because of that, I have access to lots of English speakers and Spanish speakers. The other day I asked a friend of mine whether she referred to her Grandmother by \"usted\" or by \"tu\", to which she answered \"I have a close relationship with my Grandma, so of course I use tu\". This shocked me a lot, since I know a lot of people who refer to their grandparents, and even their parents, by \"usted\" instead of \"tu\", which seems really impersonal. \n\nBecause of that, I wanted to do an experiment on whether people who refer to their Parents/Grandparents by \"tu\" have a stronger relationship than those who refer to their Parents/Grandparents by \"usted\". As you all might have noticed however, it is almost imposible to objectively measure something as abstract as \"a strong relationship\". How would I even go on about measuring \"a strong relationship\"? It is a pretty difficult thing to do objectively, and because of that, I had to discard that project idea, or at least, plan it out better.\n\nAnyways, I would like to know if there any possible ideas for projects that I could do based on linguistics, or if not, at least I would like to know if there could be a way to modify my original project in order to make it more objective.\n\nThank you in advance, and sorry if my ideas seem all over the place; I am not a very good writer and my poor English doesn't help the cause that much either.",
        "created_utc": 1674199957,
        "upvote_ratio": 1.0
    },
    {
        "title": "Are the old editions of Chomsky's \"Mind and Language\" still okay to read?",
        "author": "RaiseOpen5247",
        "url": "https://www.reddit.com/r/linguistics/comments/10gnujo/are_the_old_editions_of_chomskys_mind_and/",
        "text": "There are plenty of $5 dollar copies of the old editions of this book out there, I wonder if they're still current or if they are outdated.   \n\n\nThis might sound like a strange question, but I know that in some fields books become outdated very quickly, new editions being a complete overhaul of the book.\n\nI actually bought the 3rd edition of this book in my own language, but then I found out it was a fraud. The translation is just a bit better than what you'd get out of Google Translate.",
        "created_utc": 1674190429,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is it common for historically oppressed groups to linguistically reappropriate words that were once used by their oppressors?",
        "author": "ChasetheElectricPuma",
        "url": "https://www.reddit.com/r/linguistics/comments/10gevk4/is_it_common_for_historically_oppressed_groups_to/",
        "text": "The -a ending variant of the \"n-word,\" for example, has a very specific in-group usage(s) among black diasporic communities. Are there any other examples similar to this?",
        "created_utc": 1674166305,
        "upvote_ratio": 1.0
    },
    {
        "title": "Chittagonian Historical Linguistics",
        "author": "linguist96",
        "url": "https://www.reddit.com/r/linguistics/comments/10gcfoc/chittagonian_historical_linguistics/",
        "text": "This is very niche, but does anyone know of any resources on the historical development of Chittagonian or of any old texts in Chittagonian?",
        "created_utc": 1674160475,
        "upvote_ratio": 1.0
    },
    {
        "title": "ISO Nepali and Assamese Grammar",
        "author": "linguist96",
        "url": "https://www.reddit.com/r/linguistics/comments/10gc3db/iso_nepali_and_assamese_grammar/",
        "text": "I'm looking for recommendations for good Nepali and Assamese Linguistic Reference Grammars. Does anyone have recommendations?",
        "created_utc": 1674159671,
        "upvote_ratio": 1.0
    },
    {
        "title": "Dutch and Low German influence on English",
        "author": "Harsimaja",
        "url": "https://www.reddit.com/r/linguistics/comments/10gbo3m/dutch_and_low_german_influence_on_english/",
        "text": "How much do linguists think Dutch and Low German influenced English?\n\nI often see English words given in dictionaries having etymologies as from ‘(possibly) Dutch or Low German’, or at least ‘cf. Dutch X, Low German Y’. I see two possible opposing forces at play here:\n\n1. Any Germanic root that we don’t happen to see attested in Old English or Old Norse got ascribed to Dutch or Middle Low German, when it might be a general West Germanic word that simply hasn’t survived in the not too huge OE corpus. Is there much research on how much this could be due to? Seems there could at least be some statistical guesstimates. \n\n2. A lot of words in English do indeed seem to have genuinely come in from Dutch/Flemish in the late medieval period (with Flemish migration from around 1300) through to the Dutch Golden Age, or from Low German (via the English association with the Hanseatic League). Low German is generally unfairly merged with ‘German’ and even ‘Germanic’ in most people’s minds, so I get that, but is Dutch unfairly ignored as a major influence on English in most popular summaries?",
        "created_utc": 1674158675,
        "upvote_ratio": 1.0
    },
    {
        "title": "Any reason why native speakers of Malay treat the TH sounds of Arabic differently from how they treat the TH sounds of English?",
        "author": "PerspectiveSilver728",
        "url": "/r/asklinguistics/comments/10g4ljl/any_reason_why_native_speakers_of_malay_treat_the/",
        "text": "",
        "created_utc": 1674145802,
        "upvote_ratio": 1.0
    },
    {
        "title": "definition of \"toxic\"",
        "author": "Imaginary-Maybe-9306",
        "url": "https://www.reddit.com/r/linguistics/comments/10g3ufd/definition_of_toxic/",
        "text": "i was trying to fall asleep last night and randomly started thinking about this. \n\nwhen you hear 'toxic' nowadays the first thing that comes to mind for me is \"my friend is toxic\" aka a negative adjective, but it's interesting that we also call things \"intoxicating\" sometimes, usually in a sexual context, to say that it's so good it sends you into a sort of frenzy. both of these usages are built off of the literal definition of toxic, but it seems plausible that we could adopt toxic to mean something completely different than how we commonly use it now.\n\nan example would be 'omg i love chipotle so much their guacamole is TOXIC'\n\nwhat are some other words that have the potential to behave in totally different ways like this?",
        "created_utc": 1674140471,
        "upvote_ratio": 1.0
    },
    {
        "title": "What's LF (Logical Form) in Government and Binding literature?",
        "author": "13022019",
        "url": "https://www.reddit.com/r/linguistics/comments/10g36y5/whats_lf_logical_form_in_government_and_binding/",
        "text": "I've recently starting reading on GB theory. I've noticed in a specific papre repeated mention of 'movement at LF (Logical Form)\". What does that mean? I read online that LF is a step beyond Surface Structure. I don't understand this, if Surface Structure is a final product (in my understanding), how is movements there?",
        "created_utc": 1674138843,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is Old Tamil Native grammar wrong wrt [ɯ]?",
        "author": "No_Asparagus9320",
        "url": "https://www.reddit.com/r/linguistics/comments/10g3330/is_old_tamil_native_grammar_wrong_wrt_ɯ/",
        "text": "The Old Tamil grammar 'tholkkapiyam' states [ɯ] as an allophone of /u/ and additionally says that the unrounded vowel is of 'half duration' wrt a short rounded vowel like [u]. Does this stand true wrt modern acoustic phonetics?",
        "created_utc": 1674138580,
        "upvote_ratio": 1.0
    },
    {
        "title": "Contest: Transcribe what you hear into IPA.",
        "author": "owidju",
        "url": "https://www.reddit.com/r/linguistics/comments/10g1fkp/contest_transcribe_what_you_hear_into_ipa/",
        "text": "[https://www.facebook.com/reel/5571659112894656?s=yWDuG2&amp;fs=e](https://www.facebook.com/reel/5571659112894656?s=yWDuG2&amp;fs=e)\n\n&amp;#x200B;\n\nI will try first: \\[mˠwoɰæɰiiiiiiiiɱɱɱmmm\\]\n\nContinue!",
        "created_utc": 1674134129,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why is English an anglo Frisian Language",
        "author": "CodeBudget710",
        "url": "https://www.reddit.com/r/linguistics/comments/10fx2q5/why_is_english_an_anglo_frisian_language/",
        "text": "If a large proportion of the people who invaded England were Saxons, and a key player in understanding Old English is Wessex English, why is English an Anglo-Frisian language and not a sort of dialect of the Saxon dialect in Germany or a hybrid between Anglo-Frisian, Saxon and Jutish?",
        "created_utc": 1674118966,
        "upvote_ratio": 1.0
    },
    {
        "title": "Retroflex sounds around the world - private communication from Peggy Mohan",
        "author": "e9967780",
        "url": "https://i.redd.it/nshsfzk3jzca1.jpg",
        "text": "",
        "created_utc": 1674109576,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is Bavarian language/dialect related to old Frankish?",
        "author": "Any-Squirrel-3953",
        "url": "https://www.reddit.com/r/linguistics/comments/10fq9uc/is_bavarian_languagedialect_related_to_old/",
        "text": "If it is how much?",
        "created_utc": 1674096225,
        "upvote_ratio": 1.0
    },
    {
        "title": "Practice my Spanish?",
        "author": "Hoyasnaxagurl22",
        "url": "https://www.reddit.com/r/linguistics/comments/10fq7dg/practice_my_spanish/",
        "text": "Hi is there a free app where I can connect with benevolent Spanish speakers who want to help me with my conversational rudimentary Spanish? I’m on day 10 of Duolingo!",
        "created_utc": 1674096024,
        "upvote_ratio": 1.0
    },
    {
        "title": "Teaching abroad",
        "author": "a_c98",
        "url": "https://www.reddit.com/r/linguistics/comments/10fm58h/teaching_abroad/",
        "text": "Hi everyone! This message is in regards to anyone teaching English as a second language abroad. Which program did you apply for to be registered to teach abroad? \n\nThank you in advance!",
        "created_utc": 1674085134,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why is the Greek and Albanian word for brother so different from all others Indo-European languages?",
        "author": "An_Oxygen_Consumer",
        "url": "https://www.reddit.com/r/linguistics/comments/10flqjp/why_is_the_greek_and_albanian_word_for_brother_so/",
        "text": "I recently saw a post on Instagram with all the different words for brother in all the European languages and I noticed that they all shared the same root, as they all have a \"r\" sound and most have a \"t\" sound in it, all but the greek \"adelfós\" and the Albanian \"vëlla\". So I was wondering if there is a theory behind why in the southern balkans they have adopted different words for brother.",
        "created_utc": 1674084113,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is there a Phoible for grammatical features of a language?",
        "author": "what_do_i_put-_here",
        "url": "https://www.reddit.com/r/linguistics/comments/10fkjz3/is_there_a_phoible_for_grammatical_features_of_a/",
        "text": "what the title says",
        "created_utc": 1674081278,
        "upvote_ratio": 1.0
    },
    {
        "title": "Question on the evolution of Greek",
        "author": "karlpoppins",
        "url": "https://www.reddit.com/r/linguistics/comments/10fkjlh/question_on_the_evolution_of_greek/",
        "text": "Why has Greek changed so little over more than a millennium - that is to say, compared to many other IE languages? In my opinion (as a native Greek speaker with no linguistics qualifiations), Medieval Greek reads as little more than exceptionally fancy Modern Greek, and sounds identical to it.\n\nPhonetically, Greek had an evolutionary explosion with iotacism, frication of aspirated consonants and a few other changes by up to the 5th century AD or so and then very few things have changed till modern times. The only advancement in Greek phonetics that I'm aware of during the last millennium is the gradual loss of prenasalisation in voiced plosives, and that's merely a phonetic and not a phonemic change - plus it's still taking place.\n\nGrammar and syntax evolved a bit more evenly since ancient times, I reckon, but by the turn of the second millennium Greek had become mutually intelligible with its modern counterpart, reading as somewhat conservative Modern Greek (the previously prescribed \"katharevousa\"). \n\nI've also heard that Icelandic is very similar to Old Norse, and perhaps Italian and Spanish are similar enough to late Latin. I wonder how the evolution of these languages compares to the evolution of Greek, as well as what may have caused such a glacial evolutionary pace for Greek and perhaps for some of the other languages I mentioned.",
        "created_utc": 1674081251,
        "upvote_ratio": 1.0
    },
    {
        "title": "Linguistics Graduates -- what jobs do you have now?",
        "author": "No-Context-6966",
        "url": "https://www.reddit.com/r/linguistics/comments/10fhoeo/linguistics_graduates_what_jobs_do_you_have_now/",
        "text": "hey guys !!  I have 4-year BA in linguistics and im about to graduate with a Master's degree this summer. Previously, I worked as a language teacher abroad but recently realised that I'd like to start a new career paths. What fields are you guys working in now? \n\nthank youuuu",
        "created_utc": 1674073492,
        "upvote_ratio": 1.0
    }
]