[
    {
        "title": "Can one’s accent change after moving to a different country?",
        "author": "AlternativeNo5023",
        "url": "https://www.reddit.com/r/linguistics/comments/10fgui9/can_ones_accent_change_after_moving_to_a/",
        "text": "Let’s say if someone moves to Scotland from the US, and learns some of the Scottish slang words and lives there permanently. Is it possible that the person’s accent can change from American to Scottish depending on the amount of time they live over there?",
        "created_utc": 1674071514,
        "upvote_ratio": 1.0
    },
    {
        "title": "Should I switch to Computational Linguistics?",
        "author": "StatementClassic8919",
        "url": "https://www.reddit.com/r/linguistics/comments/10fgcg3/should_i_switch_to_computational_linguistics/",
        "text": "I don't know if this is the right sub. I'm doing an MA in General Linguistics. I'm realizing that there isn't much hope of finding a good job in translation/localization even after I finish this degree. I'm a native European Portuguese speaker and my other working languages are German and English.\n\nI'm considering switching to Computational Linguistics and learning basic programming. Unfortunately, my uni does not have this profile and I would have to move cities as well. I'm wondering if it's worth it. I'd like some advice if you got it.",
        "created_utc": 1674070332,
        "upvote_ratio": 1.0
    },
    {
        "title": "World’s oldest rune stone found in Norway, archaeologists believe",
        "author": "Hingamblegoth",
        "url": "https://sciencenorway.no/archaeology-language-runes/worlds-oldest-rune-stone-found-in-norway-archaeologists-believe/2141404",
        "text": "",
        "created_utc": 1674065402,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does word order serve any function in non-configurational languages?",
        "author": "PastTheStarryVoids",
        "url": "https://www.reddit.com/r/linguistics/comments/10fdjih/does_word_order_serve_any_function_in/",
        "text": "I've heard about non-configurational languages like Dyirbal or Warlpiri, where word order is apparently extremely free and has no bearing on a sentence's meaning. Modifiers can even be separated from their heads. My question is, is there any reason for speakers to choose one order over another in a particular utterance?\n\nMy first thought was that word order could have a pragmatic function, i.e. marking topic/comment. However, according to R.M.W. Dixon's *The Dyirbal Language of North Queensland*, Dyirbal puts topic in the absolutive case and uses antipassive *-ŋay* to make ergatives topics. If a sequence of clauses share a topic, it can be omitted in all but the first. If a speaker wants the ergative of the preceding clause to be the topic, they can mark this with the verbal affix *-muŋa*. (I think that's the form; I could be misremembering.) Clearly Dyirbal, at least, already has mechanisms to mark topic/comment. Dixon does note tendencies, e.g. verb last, absolutive first, but these can all be violated. He tells an anecdote about how he created a sentence to demonstrate the freeness of Dyirbal's word order (it featured noun markers, adjectives, and possessors all separated from their heads), and a \"well-known linguist\" denied that such free word order was possible, and accused him of exaggerating. Dixon presented the sentence to his Dyirbal informants, and they \"castigated\" him for asking a stupid question, saying \"'You know that's alright!'\".",
        "created_utc": 1674063815,
        "upvote_ratio": 1.0
    },
    {
        "title": "phonemes",
        "author": "Zakclass",
        "url": "https://www.englishlessonsclass.com/2021/07/phoneme-concept-and-definition.html",
        "text": "",
        "created_utc": 1674059415,
        "upvote_ratio": 1.0
    },
    {
        "title": "(Linguistics) Specializing in two or more languages?",
        "author": "yacibb",
        "url": "https://www.reddit.com/r/linguistics/comments/10fad2g/linguistics_specializing_in_two_or_more_languages/",
        "text": "I am planning to go to graduate school for linguistics soon, but I am interested in research in both Japanese and French. Is this possible? I don’t want to have to choose between the two. I am particularly interested in phonetics/phonology and sociolinguistics in both languages.",
        "created_utc": 1674056365,
        "upvote_ratio": 1.0
    },
    {
        "title": "Verb conjugation in Polish vs Ukrainian, Russian and Belarusian",
        "author": "intetgjore",
        "url": "https://www.reddit.com/r/linguistics/comments/10f9520/verb_conjugation_in_polish_vs_ukrainian_russian/",
        "text": "Hi,\n\nI am teaching a Polish class to a number of refugees. As it is voluntary work I have next to no qualifications safe for my native knowledge of the Polish language. Last time we talked about cases in Polish and I tried to draw some parallels between the aforementioned Slavic languages which  the students found  really useful for memorization and quite interesting generally. Does anybody have a good comparative source that would offer an overview of this subject?",
        "created_utc": 1674053317,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is there any discussions of (very) modern internet language in linguistics at the moment?",
        "author": "Master-of-Ceremony",
        "url": "https://www.reddit.com/r/linguistics/comments/10f8kdy/is_there_any_discussions_of_very_modern_internet/",
        "text": "Sorry for the poor phrasing of the question, but I really didn’t know what to call these things.\n\n I’m specifically talking about the use of tools like “ /s” after a sentence on Reddit to indicate sarcasm. It’s such a unique and odd piece of language (in English anyway) in that it denotes tone without altering the way a sentence is read at all, and arguably isn’t necessary a lot. Other things could be similar (in my completely amateur view) might be hashtags when used at the end of a short sentence on Instagram/Twitter etc., though in this case they possess a much wider range of tones which they can impose on the prior sentences. I’m sure there’re more but this is all that comes to mind. it’s also different from “/s” in as much as the hashtag after the sentence has entered speech amongst some (mostly young) groups, quite literally as “they just can’t stop me, (I’m) Hashtag goated”.\n\nJust curious to see if there’s any research done into the rather short history of these words(?) and if there’s a name for them (“posterior tonal modifier” seems appropriate but I’m not exactly an authority in linguistics with my 0 hours of formal education in it)",
        "created_utc": 1674051781,
        "upvote_ratio": 1.0
    },
    {
        "title": "Higher Ed Wednesday - January 18, 2023",
        "author": "AutoModerator",
        "url": "https://www.reddit.com/r/linguistics/comments/10f5ofv/higher_ed_wednesday_january_18_2023/",
        "text": "Hello all and welcome to another edition of Higher Ed Wednesday, an expansion of the Grad School Wednesday posts. This is a thread where prospective students can ask questions about university programs at any level, either general (e.g. \"How often should a grad student present at conferences?\") or particular (e.g. \"Which schools in North America have strong programs in Korean linguistics?). It's also a chance for current students to find out information about other programs (e.g. \"How many of you have reading lists for your comprehensive exams?\") or general university survival (e.g. \"Is it a really bad idea to change my thesis supervisor if we don't click?\"). So ask away!",
        "created_utc": 1674043210,
        "upvote_ratio": 1.0
    },
    {
        "title": "Where do you find language data for your linguistic analyses?",
        "author": "1Kuerbis",
        "url": "https://www.reddit.com/r/linguistics/comments/10f3tro/where_do_you_find_language_data_for_your/",
        "text": "Hi everyone,\n\nI am currently writing a paper for one of my linguistics classes and have found it to be quite difficult to collect the data needed for my analysis.  \nFor reference, the task given was to kind of recreate an investigation on segmental inventory size and word length, as was done by D. Nettle (as seen in [this PDF](https://people.uleth.ca/~fangfang.li/Psychology3850/readings/Nettle1995.pdf) of his paper from 1995). In the study, he took sample words from 10 different languages by using a specific method of collecting words from dictionaries of each language. Now our job is to try and use his method and apply it to other languages that are not included in his initial study. \n\nThis is where my issue with the task lies. Nettle used physical copies of dictionaries with around 20-30k entries for his sampling method, which are not accessible to me, since all I can find are travelling dictionaries, or ones used to learn a language, which both fail to have some kind of neutrality in the choice of the entries (they all mainly focus on tourist-y conversations, etc). I have talked to my professor about this and he said it's fine if we find our own scientific method to collect samples, but I'm still having trouble to actually find a free linguistic corpus or glossary online for the languages we chose (in my case Swedish, Dutch, and Japanese). I have tried some websites, like sketchenginge for example, which gather data from a variety of online sources, but everytime I think I found a good source, the results are hidden behind paywalls.\n\nNow to my actual question: does anyone know where I can actually look for this type of data or might even coincidentally have online sources for the languages mentioned? I am also more than happy if someone has an idea, other than online corpora, on how to tackle this issue!\n\nThank you all for reading and I'm looking forward to your replies!",
        "created_utc": 1674036646,
        "upvote_ratio": 1.0
    },
    {
        "title": "I really don’t know if this is a bad question but I’m curious",
        "author": "JOSHBUSGUY",
        "url": "https://www.reddit.com/r/linguistics/comments/10f3sdt/i_really_dont_know_if_this_is_a_bad_question_but/",
        "text": "How within languages did gendered grammar form naturally ?",
        "created_utc": 1674036509,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do y'all explain verb transitivity to students?",
        "author": "apollonius_perga",
        "url": "/r/ENGLISH/comments/10f17vd/how_do_yall_explain_verb_transitivity_to_students/",
        "text": "",
        "created_utc": 1674026803,
        "upvote_ratio": 1.0
    },
    {
        "title": "Has a creole ever took off and behaved as a regular language long term, undergoing evolution and everything?",
        "author": "weedmaster6669",
        "url": "https://www.reddit.com/r/linguistics/comments/10ezugm/has_a_creole_ever_took_off_and_behaved_as_a/",
        "text": "Creoles are natural languages right, just a special case? I don't see why a creole couldn't evolve and become just as complex and behave as a typical language right? Has that ever happened?",
        "created_utc": 1674021873,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is the modern historical consensus on the Dare Stones?",
        "author": "emperator_eggman",
        "url": "https://www.reddit.com/r/linguistics/comments/10ev4tr/what_is_the_modern_historical_consensus_on_the/",
        "text": "Particularly the first stone that was unable to be debunked?",
        "created_utc": 1674008161,
        "upvote_ratio": 1.0
    },
    {
        "title": "Words That Decode the World",
        "author": "1992ScreamingBeagle",
        "url": "https://foreignpolicy.com/2023/01/15/words-foreign-languages-cultures-decoder-russia-india-iran/",
        "text": "",
        "created_utc": 1673997334,
        "upvote_ratio": 1.0
    },
    {
        "title": "How common is the position that the Kagoshima and Tsugaru varieties are distinct languages from Japanese rather than dialects of Japanese?",
        "author": "ArcticCircleSystem",
        "url": "https://www.reddit.com/r/linguistics/comments/10eogrs/how_common_is_the_position_that_the_kagoshima_and/",
        "text": "In the recently released version 4.7 of the Glottolog database, the Max Planck Institute for Evolutionary Anthropology split [Kagoshima-ben](https://glottolog.org/resource/languoid/id/sats1241) and [Tsugaru-ben](https://glottolog.org/resource/languoid/id/tsug1237) from other varieties of [Japanese](https://glottolog.org/resource/languoid/id/nucl1643) due to a lack of mutual intelligibility between the Kagoshima dialect group, Tsugaru-ben, and other varieties of Japanese. The maintainers of the database also propose a [Japanesic](https://glottolog.org/resource/languoid/id/japa1256) branch of the [Japonic](https://glottolog.org/resource/languoid/id/japo1237) languages based on the criteria of mutual intelligibility consisting of four branches: [Old Japanese](https://glottolog.org/resource/languoid/id/oldj1239), Kagoshima, Tsugaru, and [Japan-Taiwan Japanese](https://glottolog.org/resource/languoid/id/japa1258) which consists of Japanese and [Yilan Creole Japanese](https://glottolog.org/resource/languoid/id/yila1234).\n\nThe main thing I'm curious about is how common the position that Kagoshima-ben and Tsugaru-ben are separate but related languages from Japanese among scholars. Is this a common or significant minority position?",
        "created_utc": 1673991715,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why the scary, funny, profane ‘FAFO’ was 2022’s word of the year",
        "author": "Spagetti13",
        "url": "https://www.washingtonpost.com/opinions/2023/01/17/fafo-2022-word-year-find-out/",
        "text": "",
        "created_utc": 1673990448,
        "upvote_ratio": 1.0
    },
    {
        "title": "How common is the view that Urartian and Hurrian were part of the Northeast Caucasian family?",
        "author": "IGotchooFam",
        "url": "https://www.reddit.com/r/linguistics/comments/10ek4yv/how_common_is_the_view_that_urartian_and_hurrian/",
        "text": "I've been reading quite a bit out of Sergei Starostin's *A North Caucasian Etymological Dictionary*, and he seems convinced of the connection.\n\n&amp;#x200B;\n\nI'm wondering how common the viewpoint is.",
        "created_utc": 1673981715,
        "upvote_ratio": 1.0
    },
    {
        "title": "The gradual extinction of Polish",
        "author": "araiderofthelostark",
        "url": "https://www.reddit.com/r/linguistics/comments/10ej3tb/the_gradual_extinction_of_polish/",
        "text": "I have read that a significant percentage (about 90%) of the human languages spoken at the beginning of this century are projected to become extinct by the end of it. I have just read this on Wikipedia, but I have heard a similar claim before, including on Reddit, so I am not basing this question just on that.\n\nI wonder, does that mean Polish is threatened? Is it an endangered language? Do you think Polish will have become obsolete by the end of this century? Why?\n\nI am a native speaker of Polish, and I have been wondering about to what extent is it endangered.\n\nI apologize for my low English proficiency.",
        "created_utc": 1673979265,
        "upvote_ratio": 1.0
    },
    {
        "title": "Baby talk",
        "author": "sapienshomo",
        "url": "https://www.reddit.com/r/linguistics/comments/10eidl6/baby_talk/",
        "text": "Are there certain sounds that babies can produce before other sounds universally, across languages? I would think any bilabials be the first since a baby can begin blabbering without teeth or super precise motor skills in the tongue.  Then is there any sort of universal progression of phones they are able to pronounce as those motor skills develop, teeth grow, etc?  Or would it have to do more with the frequency of a phoneme in the baby’s language environment? I.e. more frequent phonemes are acquired first.  I guess in summary: is there a universal progression of sounds babies learn to produce based on the physical development of the mouth and motor skills, is it culturally specific to the language environment, or a mixture of the two?",
        "created_utc": 1673977576,
        "upvote_ratio": 1.0
    },
    {
        "title": "What does “You don't try to photograph the reality, you try to photograph the photograph of the reality”",
        "author": "kingofcookiesttv",
        "url": "https://www.reddit.com/r/linguistics/comments/10egz5s/what_does_you_dont_try_to_photograph_the_reality/",
        "text": "Was reading this and was fascinated, I’m not sure what it means exactly and I can’t really find an answer online, can someone give me their take on it? Sorry if this is the wrong place to be posting this, sorry.",
        "created_utc": 1673974249,
        "upvote_ratio": 1.0
    },
    {
        "title": "What does, “You don't try to photograph the reality, you try to photograph the photograph of the reality”",
        "author": "kingofcookiesttv",
        "url": "https://www.reddit.com/r/linguistics/comments/10egxdc/what_does_you_dont_try_to_photograph_the_reality/",
        "text": "Was reading this and was fascinated, I’m not sure what it means exactly and I can’t really find an answer online, can someone give me their take on it? Sorry if this is the wrong place to be posting this, sorry.",
        "created_utc": 1673974130,
        "upvote_ratio": 1.0
    },
    {
        "title": "Unique jobs in Linguistics you can get with a BA degree?",
        "author": "Cornelious72",
        "url": "https://www.reddit.com/r/linguistics/comments/10eggk4/unique_jobs_in_linguistics_you_can_get_with_a_ba/",
        "text": "Hey everyone:) I am currently majoring in Linguistics and I was wondering about job opportunities with a BA degree. Obviously, you google this and a few come up like translation, teaching, speech pathology, etc. Though I am curious to if you guys have any insight in to other jobs that may not be mentioned as much. \n\nI’m super interested in the cultural part of Linguistics as well as language preservation. I am studying Spanish as well. I am still undecided with grad school.",
        "created_utc": 1673972978,
        "upvote_ratio": 1.0
    },
    {
        "title": "Finite Grammars in Human Language: Are they real?",
        "author": "Tyagus",
        "url": "https://www.reddit.com/r/linguistics/comments/10eerdd/finite_grammars_in_human_language_are_they_real/",
        "text": "Hey everyone, \n\nI work with computational linguistics and I am looking into machine learning and the composition skills models develop. A toy grammar is created to test this in this case.\n\nHowever, I am wondering if anyone could point me to research that looks into human language and if there is any plausibility that they are finite or if it remains an open question. I have heard that Chomsky's universal grammar was criticized, so I was wondering about this particular question.\n\nThanks in advance",
        "created_utc": 1673968715,
        "upvote_ratio": 1.0
    },
    {
        "title": "FOOT - STRUT split",
        "author": "rolfk17",
        "url": "https://www.reddit.com/r/linguistics/comments/10ed525/foot_strut_split/",
        "text": "Most varieties of English have the FOOT-STRUT split, which began in Early Modern English. As opposed to many other sound changes it does not follow any strict rules, if my understanding is correct.  /ʊ/ &gt;  /ʌ/ does not occur when preceded or followed by certain consonants, but this is more of a rule of thumb than a strict rule. \n\nNow, I am wondering if there is a special reason why in the many different varieties of English around the world, the same words seem always to belong to the same class, so in American English the same words have the foot or strut vowel as in Southern British, Scottish or Australian English (with the exception, probably, of occasional hypercorrection in Northern British English).",
        "created_utc": 1673964509,
        "upvote_ratio": 1.0
    },
    {
        "title": "Recommendation of German grammar's book",
        "author": "Matheus_Morroni",
        "url": "https://www.reddit.com/r/linguistics/comments/10ec000/recommendation_of_german_grammars_book/",
        "text": "I'm looking for a book of German grammar, it could be in English-German or only in German. I want to study more about the grammar rules of this beautiful language.",
        "created_utc": 1673961311,
        "upvote_ratio": 1.0
    },
    {
        "title": "Individual sociolinguistic variation",
        "author": "shortchangerb",
        "url": "https://www.reddit.com/r/linguistics/comments/10eagdd/individual_sociolinguistic_variation/",
        "text": "Excuse the poor title; I’m hoping someone can point me in the right direction. I’m interested in how much an individual speaker varies their speech in different contexts (e.g. at home, at work, amongst friends, in front of a contractor…)\n\n\nBut naturally it sounds like a very difficult thing to study. Is there a term for this or a body of work associated with it? I’ve found a few red herrings.\n\n\nI’m interested in finding out whether we can measure an individual’s likelihood to alter their speech in different contexts. E.g. John speaks more or less the same all the time, whereas Mary varies her pitch/speed/register based on company\n\n\nI guess a starting point may be the suppression of regional accents in formal contexts, and community-wide differences in home dialect/community dialect?",
        "created_utc": 1673956505,
        "upvote_ratio": 1.0
    },
    {
        "title": "Whats the linguistic term for this?",
        "author": "HoseWasTaken",
        "url": "https://www.reddit.com/r/linguistics/comments/10ea5m8/whats_the_linguistic_term_for_this/",
        "text": "For when there are different sounds for the same letter in a language and the natives don't even notice it. Sorry for the phrasing I'm far from a linguist.\n\nFor example, in Spanish we have \"dado\" pronounced like daðo.",
        "created_utc": 1673955445,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can founder effect explain differences between English dialects in their different colonies?",
        "author": "beutifulanimegirl",
        "url": "https://www.reddit.com/r/linguistics/comments/10e9bn4/can_founder_effect_explain_differences_between/",
        "text": "I don't really know if the founder effect term is even used in linguistics, but maybe there is an analogous phenomenon in linguistics that I don't know of. Anyways I always found it interesting that the English dialects have diverged so much, for instance Australian English sounding very different than American English. Is the explanation for this just that Australia was settled later and therefore has more in common with modern British English?",
        "created_utc": 1673952451,
        "upvote_ratio": 1.0
    },
    {
        "title": "What are some ongoing sound changes/shifts in general going on in other languages than English?",
        "author": "Technical_Bet4162",
        "url": "https://www.reddit.com/r/linguistics/comments/10e6xuo/what_are_some_ongoing_sound_changesshifts_in/",
        "text": "I have seen linguistic discussions about how English is changing in front of our eyes, such as with vowel mergers or the spread of AAVE/Southern words like ‘y’all’ within most dialects of North American English. I was wondering however, if there are any ongoing changes going on within languages and I’d be interested to see some examples you have",
        "created_utc": 1673943598,
        "upvote_ratio": 1.0
    },
    {
        "title": "What Kind of Arabic is the Qur'an Written In?",
        "author": "Dudeist_Missionary",
        "url": "https://www.reddit.com/r/linguistics/",
        "text": "",
        "created_utc": 1673942514,
        "upvote_ratio": 1.0
    },
    {
        "title": "Homonym \"Mouth Shapes\"",
        "author": "PastelSkunk",
        "url": "https://www.reddit.com/r/linguistics/comments/10e609v/homonym_mouth_shapes/",
        "text": "Hi all!   \n\n\nFirst post in the sub, and full disclosure I'm only an amature linguist.  Anyway, I was having a discussion with my partner that to me I pronounce homonyms the same (obviously that's what a homonym is) but to me they have a different shape in my mouth.  The example we used was 'bawdy' and 'body'.  Exact same spelt homonyms don't do this for me (ie. read/read, address/address).  I have personal preferences to different spellings of names for this exact reason.  Why should Ashlee or Ashleigh be different to me I don't know, but it is a real feeling for me.  \n\n\nJust wanted to know if anyone more knowledgeable has any resources or info on this phenomena!  Thanks for your time reading my post &lt;3",
        "created_utc": 1673940172,
        "upvote_ratio": 1.0
    },
    {
        "title": "Any Ukranian speakers here available to help me with something ludicrously specific?",
        "author": "Qfwfq_on_the_Shore52",
        "url": "https://www.reddit.com/r/linguistics/comments/10dw8c9/any_ukranian_speakers_here_available_to_help_me/",
        "text": "If so, please drop a comment here or DM me. Thanks in advance!",
        "created_utc": 1673911989,
        "upvote_ratio": 1.0
    },
    {
        "title": "Could \"bus\" be considered a hypernym for \"double-decker\"?",
        "author": "DracoCross",
        "url": "https://www.reddit.com/r/linguistics/comments/10dtlq2/could_bus_be_considered_a_hypernym_for/",
        "text": "I think it could, but google keeps telling me that it**'**s a synonym, not a hypernym, so I wanna make sure.",
        "created_utc": 1673906086,
        "upvote_ratio": 1.0
    },
    {
        "title": "Switching subject to object to add emphasis",
        "author": "SorgfuldNoekke",
        "url": "https://www.reddit.com/r/linguistics/comments/10dt97b/switching_subject_to_object_to_add_emphasis/",
        "text": "Recently, I’ve seen a particular kind of comment on Reddit and social media that I’m curious to know more about. At its heart, it’s paying a compliment, but a very strong one. Here’s an example, where the second sentence is responding to the first. \n\n&gt; “Maria Callas is an amazing opera singer.”\n\n&gt; “She doesn’t sing opera. Opera is sung by her.”\n\nObviously it’s being done for humorous effect. Intuitively, I know *exactly* what’s going on. The second comment is meant to be a stronger compliment than the first. But I don’t know why it works.\n\nWhat is going on linguistically in terms of the syntax and pragmatically that makes this kind of word play work? Do any other languages do this kind of thing?",
        "created_utc": 1673905407,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is becoming a speech therapist possible?",
        "author": "confused-gourd",
        "url": "https://www.reddit.com/r/linguistics/comments/10dsd2m/is_becoming_a_speech_therapist_possible/",
        "text": "Right now, I have a plan to become a speech therapist as an adult. However, I also plan to move somewhere in Canada (probably a French speaking portion), and don't know if I (an American who had to take speech therapy myself) could teach the proper regional sounds.",
        "created_utc": 1673903878,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is Hebrew אהב (ahav) cognate to Arabic أحب ('aḥabba)?",
        "author": "New-Brief3824",
        "url": "https://www.reddit.com/r/linguistics/comments/10dreqm/is_hebrew_אהב_ahav_cognate_to_arabic_أحب_aḥabba/",
        "text": "They both mean \"to love\". However, an Arabic ح /ḥ/ should correspond to a Hebrew ח and not ה /h/. So is it one of those false pairs of cognates like English *have* and Latin *habeō*?",
        "created_utc": 1673902315,
        "upvote_ratio": 1.0
    },
    {
        "title": "what should i minor in?",
        "author": "flirtsorn",
        "url": "https://www.reddit.com/r/linguistics/comments/10dr00m/what_should_i_minor_in/",
        "text": "So recently I’ve been really debating on what i should do with my minors. I currently am a linguistic major with a korean minor. I love every time we cover child language acquisition and hope to do something related to that field. After talking with a professor he let me know that I should looking into a cognitive science minor or psychology minor/double major. I’m a little worried of making the wrong choices and was hoping for some guidance. I don’t really want to drop my Korean minor and am curious on what to add. My advisor said that I should be fine with adding either but it can’t be both. Also i go to michigan state if that helps. Any tips on what I should do?",
        "created_utc": 1673901640,
        "upvote_ratio": 1.0
    },
    {
        "title": "what is the grammatical meaning of this sentence?",
        "author": "sexsexsex2369420",
        "url": "https://www.reddit.com/r/linguistics/comments/10dqfyc/what_is_the_grammatical_meaning_of_this_sentence/",
        "text": "so i was trying to translate a sentence into a conlang i made, something like \"dont walk in the forest, the bear will come\", but i had trouble translating \"will come\", what exactly is the meaning of it? its some sort of conditional i think, but also confirming it will happen, but im not sure what thats called",
        "created_utc": 1673900730,
        "upvote_ratio": 1.0
    },
    {
        "title": "Are the small moribund Siberian languages simply doomed to extinction?",
        "author": "Upplands-Bro",
        "url": "https://www.reddit.com/r/linguistics/comments/10dp5vk/are_the_small_moribund_siberian_languages_simply/",
        "text": "It's quite sad and somewhat eerie watching the last speakers of languages like Enets and Nganasan die off one by one. Forest Enets, for example, had under 70 speakers in 2020. Given the abysmal HDI indicators in rural parts of these regions, there is a distinct possibility of that number dwindling to zero within a decade or so.\n\nI know many of these have been heavily Russified, but seeing any language die out is terribly sad\n\nIs there any possibility of preserving these languages? Would that be possible at this point, even if there were enough will and resources? Or is there a point after which we simply have no other recourse but to watch these languages die out and be relegated to the annals of history?",
        "created_utc": 1673897849,
        "upvote_ratio": 1.0
    },
    {
        "title": "Sorry if this gets posted a lot but I can’t figure out how to search the answer on this: why is it “tables and chairs” and not “chairs and tables”?",
        "author": "paboi",
        "url": "https://www.reddit.com/r/linguistics/comments/10doxx4/sorry_if_this_gets_posted_a_lot_but_i_cant_figure/",
        "text": "It sounds very awkward to say “chairs and tables” but I don’t know why that is.",
        "created_utc": 1673897336,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is the German word 'Deutsch' (meaning German) etymologically linked to the German word 'Leute' (meaning people)?",
        "author": "CodeBudget710",
        "url": "https://www.reddit.com/r/linguistics/comments/10dohhq/is_the_german_word_deutsch_meaning_german/",
        "text": "I heard deutsch comes from diutisc and it meant \"people\" or \"of the people\"",
        "created_utc": 1673896292,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does something like vowel-length sandhi exist where the phonemic lengths of vowels change depending the lengths of vowels in other syllables?",
        "author": "NeverBefore800",
        "url": "https://www.reddit.com/r/linguistics/comments/10dnyk8/does_something_like_vowellength_sandhi_exist/",
        "text": ".",
        "created_utc": 1673895131,
        "upvote_ratio": 0.99
    },
    {
        "title": "How long does it take for a language to become a lingua franca?",
        "author": "francinebeenfrensky",
        "url": "https://www.reddit.com/r/linguistics/comments/10dlyj7/how_long_does_it_take_for_a_language_to_become_a/",
        "text": "Hello! New here.\n\nI'm writing a portal fantasy novel wherein English ultimately becomes the lingua franca of a foreign world (let's call it Other World) after a few characters from Other World spend a significant amount of time on Earth and bring it back to Other World. While I know fantasy novels allow for a degree of artistic license, I did want the logistics of this to be somewhat feasible.\n\nI don't want to give away too much about my story, but the Other World is rather small and lightly populated at this time in the story (think a couple hundred thousand). The group that travels from Earth consists of around six people. They spend three years on Earth before returning to the Other world, during which they become fluent in English. How long would it take for English to hypothetically become the lingua franca on the Other World considering this fact? Is it even possible?\n\nI know these questions seem odd and might be hard to fully gauge, but any help would be appreciated! Cheers!",
        "created_utc": 1673891461,
        "upvote_ratio": 1.0
    },
    {
        "title": "Are some languages more vulnerable than others to information loss due to degraded aural transmission?",
        "author": "Svejkovat",
        "url": "https://www.reddit.com/r/linguistics/comments/10dhvwj/are_some_languages_more_vulnerable_than_others_to/",
        "text": "I have little academic experience to bear, but I have been a USAF airborne linguist/translator, a private pilot, and a city commuter bus driver.  I have a fair amount of experience negotiating a variety of compromise when it comes to radio intelligibility in at least a couple of languages. I have occasionally wondered if in the scope of languages some are more prone to errors in vocal transmission owing to degraded radio comms than others. There is variance among languages in pitch and tone and even anatomical constituents, such as the differences in development and coordination of the tongue, lips, sinuses, vocal cords, etc.  Might these difference proffer any advantage of one language over another in a state of degraded radio communications over another?",
        "created_utc": 1673884148,
        "upvote_ratio": 1.0
    },
    {
        "title": "What similarities is there between Southern Irish accents and West country accents.",
        "author": "EquipmentScary1957",
        "url": "https://www.reddit.com/r/linguistics/comments/10dhqym/what_similarities_is_there_between_southern_irish/",
        "text": "[https://www.youtube.com/watch?v=U\\_QGDxIg9oo](https://www.youtube.com/watch?v=U_QGDxIg9oo)\n\n[https://www.youtube.com/watch?v=iXcizut9qA8&amp;t=1s](https://www.youtube.com/watch?v=iXcizut9qA8&amp;t=1s)\n\n[https://www.youtube.com/watch?v=MCon9iWR5-U](https://www.youtube.com/watch?v=MCon9iWR5-U)",
        "created_utc": 1673883826,
        "upvote_ratio": 1.0
    },
    {
        "title": "English IPA",
        "author": "migoa",
        "url": "https://www.reddit.com/r/linguistics/comments/10ddolt/english_ipa/",
        "text": "Why does IPA transcribe \"I\" as /ˈaɪ/ or day as /ˈdeɪ/ instead of /aj/ and /dej/ respectively? Are these sounds that different?",
        "created_utc": 1673873171,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is the meaning of \"be-\" in beloved, belated, behead?",
        "author": "SnooSeagulls8125",
        "url": "https://www.reddit.com/r/linguistics/comments/10dd8j9/what_is_the_meaning_of_be_in_beloved_belated/",
        "text": "Are they somehow connected? I might not know fully because my first language isn't english",
        "created_utc": 1673871789,
        "upvote_ratio": 1.0
    },
    {
        "title": "This week's Q&amp;A thread -- please read before asking or answering a question! - January 16, 2023",
        "author": "AutoModerator",
        "url": "https://www.reddit.com/r/linguistics/comments/10dcsf5/this_weeks_qa_thread_please_read_before_asking_or/",
        "text": "Do you have a question about language or linguistics? You’ve come to the right subreddit! We welcome questions from people of all backgrounds and levels of experience in linguistics.\n\nThis is our weekly Q&amp;A post, which is posted every Monday. We ask that certain types of questions be asked here instead of in a separate post.\n\n**Questions that should be posted in the Q&amp;A thread:**\n\n* Beginner questions — if you’re looking for a general answer that can be found in an introductory textbook, then it probably belongs here. If you ask in a separate post we’ll ask you to move it here.\n\n* Questions that can be answered with a simple Google or Wikipedia search — you should try Google and Wikipedia first, but we know it’s sometimes hard to find the right search terms or evaluate the quality of the results. Instead of removing these questions, we just ask you post them here.\n\n* Asking why someone (yourself, a celebrity, etc.) has a certain language feature — unless it’s a well-known dialectal feature, we can usually only provide very general answers to this type of question. And if it’s a well-known dialectal feature, it still belongs here.\n\n* Requests for transcription or identification of a feature — remember to link to audio examples.\n\n* English dialect identification requests — for language identification requests and translations, you want r/translator. If you need more specific information about which English dialect someone is speaking, you can ask it here.\n\n* Questions about prescriptivism — such as whether it's good or bad, when it's appropriate, whether something \"counts\" as prescriptivism, etc. These questions usually need the same general answers clarifying the role of descriptivism/prescriptivism in linguistics, so please post them here.\n\nWe’ll ask you to move your post to the Q&amp;A thread if you post it on the front page and we think it fits one of the above categories. You’re free to post your question here.\n\nIf you post your question to the Q&amp;A thread and don’t get an answer by the end of the week, you can post it as a separate post. If it’s already the weekend, you might want to wait to post your question until the new Q&amp;A post goes up on Monday.\n\n**Discouraged Questions**\n\nThese types of questions are subject to removal:\n\n* Asking for answers to homework problems. If you’re not sure how to do a problem, ask about the concepts and methods that are giving you trouble. Avoid posting the actual problem if you can.\n\n* Asking for paper topics. We can make specific suggestions once you’ve decided on a topic and have begun your research, but we won’t come up with a paper topic or start your research for you.\n\n* Asking for grammaticality judgments and usage advice — basically, these are questions that should be directed to speakers of the language rather than to linguists.\n\n* Questions that are covered in our FAQ or reading list — follow-up questions are welcome, but please check them first before asking how people sing in tonal languages or what you should read first in linguistics.",
        "created_utc": 1673870412,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does the frequency of a sound/phoneme within a certain given language correlate with its frequency across world's languages?",
        "author": "SpiritualPlate1984",
        "url": "https://www.reddit.com/r/linguistics/comments/10dcm4v/does_the_frequency_of_a_soundphoneme_within_a/",
        "text": ".",
        "created_utc": 1673869836,
        "upvote_ratio": 1.0
    },
    {
        "title": "Looking for a course/tutorial/book on any Proto-Language GRAMMAR.",
        "author": "GloriousRenaissance",
        "url": "https://www.reddit.com/r/linguistics/comments/10d7w0s/looking_for_a_coursetutorialbook_on_any/",
        "text": "Hi, /r/linguistics , I hope this is the right place to ask.\n\nWent through the sidebar, the resources and the Frequently asked questions, but didn't find anything like what I'm looking for.\n\nBasically, the title.\n\nWould like to get my hands on any reading material regarding the grammar of any Proto-Language (any proto-lang is absolutely fine, but PIE, proto-germanic are preferred). Does such a thing exists???\n\nIt can be a tutorial or a book or a course, or even a crash course, or one of those in-a-nutshell type of thing.\n\nYour help is very appreciated! Thanks in advance.",
        "created_utc": 1673852666,
        "upvote_ratio": 1.0
    },
    {
        "title": "\"Austro-Hmong\"/\"Southeastasiatic\"?",
        "author": "T1mbuk1",
        "url": "https://www.reddit.com/r/linguistics/comments/10d7pu8/austrohmongsoutheastasiatic/",
        "text": "There are some proposed language families out there. One I'm sort of interested in, despite my lack of experience with linguistics and whatnot, is [Austro-Tai](https://www.wikiwand.com/en/Austro-Tai), which is a hypothesis claiming that the Kra-Dai languages and the Austronesian ones share a common ancestor. A contradictory one is [Miao-Dai](http://sealang.net/sala/archives/pdf8/kosaka2002affiliation.pdf)(proposed by Ryuichi Kosaka in 2002), which replaces Austronesian with Hmong-Mien. I'm starting to wonder if any of the three candidate languages share common ancestors or if neither is related. I also wonder, based on levels of experience with linguistics, what's the fastest amount of time it would take to reconstruct proto-languages?",
        "created_utc": 1673852103,
        "upvote_ratio": 1.0
    },
    {
        "title": "The single \"Asian - American Accent\"",
        "author": "Remarkable-Joke-4949",
        "url": "https://www.reddit.com/r/linguistics/comments/10d6jty/the_single_asian_american_accent/",
        "text": "A post from a year ago described an \"Asian - American accent\", saying they could always tell if someone was Asian from their voice, regardless of whether they were born and raised in the US.\n\nI'm Asian, born and raised in the US. Firstly, people think Asians have more effeminate voices, which isn't true. Artists like Rich Brian prove how Asian voices can also be \"tough-sounding\". The difference there is just from how much they use their voices: Someone who shouts a lot will have a raspy voice. Someone with relaxed vocal chords, speaks from their chest regularly, or just has a deeper voice, will have a deeper voice. \n\nThe poster indicated they couldn't really put the accent into words, so it must be something subtle. Now, I want to bring up the [Homelander monologue](https://www.youtube.com/watch?v=tB1X1YhqFns) from The Boys.\n\nAnthony Bourdain initially speaks at a volume that isn't shouting, but he puts a lot of pressure behind his enunciation. I was trying to imitate the monologue, and it was actually difficult for me to achieve that mediate 'half-shouting'. \n\nI played around with it for a while, and what I learned is that it didn't matter if I tried to consistently sound throaty, or nasal, or deep, or high-pitched. Whenever I put pressure on my syllables, I put it at the front of my mouth. This caused me to start shouting pretty sharply. I would describe it as the syllables escaping too easily so that I couldn't enunciate them with as much power. \n\nI figured out how to enunciate my syllables by putting pressure to the back of my mouth, which allowed me to sound like Bourdain. But it felt pretty weird for me to talk that way. Most East-Asian languages speak by putting pressure to the front, giving them a sharper sound.  Even for Asians who are born in the US, those kinds of subtle effects can be common because they are raised (and probably learned how to shout) from their parents. \n\nIt also goes to show how subtle an accent can be; it's not just a general sound, but also where someone speaks from, and all the different places they can go in just one sentence. \n\nAlso, lots of Southeast, South, and Central Asian people don't really have the same accent as East Asians. So I wouldn't call it an \"Asian - American\" accent but rather an \"East - Asian - American Accent\". Maybe not even that but just call it an \"general accent that comes from enunciating syllables at the front of your mouth\".",
        "created_utc": 1673848256,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is this sound?",
        "author": "3-little-cominists",
        "url": "https://www.reddit.com/r/linguistics/comments/10cxndo/what_is_this_sound/",
        "text": "I want to find out what the *squeek* noise General Levy sings in ‘Incredible’ is\n\nhttps://open.spotify.com/track/2Q9F3D53QeclwbsY24cuxO?si=cDruYz1GTBS6k4a25-dVLg",
        "created_utc": 1673823263,
        "upvote_ratio": 1.0
    },
    {
        "title": "What I think some basic English verbs look like as Latinate borrowings",
        "author": "IMissMistTwst38839",
        "url": "https://www.reddit.com/r/linguistics/comments/10cwr0y/what_i_think_some_basic_english_verbs_look_like/",
        "text": "For a while now I've been interested in Latin influence on English. It's interesting to me because Latin borrowings in English sound like Spanish words to me and I'm a Spanish speaker. So it's fun to see the similarities between English and Spanish.\n\nSometimes I think of what it would be like if Latin had even more influence on English, to the point that extremely common verbs like do or grow would be of Latin origin, so that English and Spanish would have a ton of close cognates in their basic vocabulary.\n\nHere are some predictions I made:\n\n\"do\" or \"make\" = \"face\" because...\n\"do\" or \"make\" in Spanish is \"hacer\". \"deshacer\" in English is \"deface\". So a Latinate \"do\" or \"make\" could be \"face\".\n\nExample: \"I faced you a salad.\"\n\n\"grow\" = \"crease\" because...\n\"grow\" in Spanish is \"crecer\". \"decrecer\" in English is \"decrease\". So a Latinate \"grow\" could be \"crease\".\n\nExample: \"Clifford the Dog creased so much he was taller than a house.\"\n\n\"say\" = \"dict\" because:\n\"say\" in Spanish is \"decir\". \"contradecir\" in English is \"contradict\". So a Latinate \"say\" would be \"dict\".\n\nExample: \"I dicted you not to touch the stove!\"\n\nThis is just some fun exercise I wanted to do, and I could be wrong. Anyway, what are some alternate-history Latin or Spanish borrowings you can think up in English?",
        "created_utc": 1673821077,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why is there no passive present participle or active past participle? would be cool tbh",
        "author": "TarkFrench",
        "url": "https://www.reddit.com/r/linguistics/comments/10cwcf4/why_is_there_no_passive_present_participle_or/",
        "text": "I've noticed in like English, French, German and Latin that in all of these languages have a present participle that is inherently active and a past participle that is inherently passive, and no real way of forming let's say an active past participle-like phrase without the use of a relative pronoun.\nTo me at least, that's a bit weird considering languages like Arabic and iirc Turkish have this feature.\nIs that because of PIE?\nAlso, Ancient Greek is a bit weird in all of these languages, because it seemingly has active, mediopassive and/or passive voice forms for every tense/aspect/mood combination.",
        "created_utc": 1673820090,
        "upvote_ratio": 1.0
    },
    {
        "title": "It is said sometimes that some German dialects have lost their genitive cases and some have merged their accusative and dative case, but has any German dialect lost its declensions/cases to the extent of that of English.",
        "author": "CodeBudget710",
        "url": "https://www.reddit.com/r/linguistics/comments/10cuqrt/it_is_said_sometimes_that_some_german_dialects/",
        "text": "Is there German dialect where the accusative, dative and genitive have fallen out of use? And a word in nominative form is the same as it is in every other case or form?",
        "created_utc": 1673816294,
        "upvote_ratio": 1.0
    },
    {
        "title": "Doesn anyone know of any user-friendly discourse segmenters?",
        "author": "femke_0",
        "url": "https://www.reddit.com/r/linguistics/comments/10csaqt/doesn_anyone_know_of_any_userfriendly_discourse/",
        "text": "[removed]",
        "created_utc": 1673810488,
        "upvote_ratio": 1.0
    },
    {
        "title": "How common is the epenthesis of a glottal stop [ʔ] before word-initial vowels cross-linguistically?",
        "author": "_Aspagurr_",
        "url": "https://www.reddit.com/r/linguistics/comments/10cs2fa/how_common_is_the_epenthesis_of_a_glottal_stop_ʔ/",
        "text": "I've read somewhere that it's very common but I wonder how true that claim is",
        "created_utc": 1673809945,
        "upvote_ratio": 0.99
    },
    {
        "title": "Why do most Irish accents not have an alveolar tap?",
        "author": "EquipmentScary1957",
        "url": "https://www.reddit.com/r/linguistics/comments/10cr7ib/why_do_most_irish_accents_not_have_an_alveolar_tap/",
        "text": "Just curious why this happened historically when in the Irish language it was a tap.",
        "created_utc": 1673807939,
        "upvote_ratio": 1.0
    },
    {
        "title": "Are there any languages whose structure goes Subject-Verb-Rest of Sentence? Asking after seeing this tweet from Ed Greenwood on a certain fantasy language.",
        "author": "Groudon466",
        "url": "https://imgur.com/gallery/HEkENdp",
        "text": "",
        "created_utc": 1673807750,
        "upvote_ratio": 1.0
    },
    {
        "title": "Romanian",
        "author": "izzavela",
        "url": "https://www.reddit.com/r/linguistics/comments/10cnfkh/romanian/",
        "text": "Is Romanian closer to the northern italian languages or the southern italian languages?",
        "created_utc": 1673798855,
        "upvote_ratio": 1.0
    },
    {
        "title": "What accents when speaking English commonly have a 'th' sound instead of an S?",
        "author": "MischiefManaged1975",
        "url": "https://www.reddit.com/r/linguistics/comments/10ckzwn/what_accents_when_speaking_english_commonly_have/",
        "text": "I have a speech impediment and for most of my life people have asked me what country I'm from because \"they like my accent\". I've only living in the US south my whole life but people have guessed from German to Polish.",
        "created_utc": 1673792381,
        "upvote_ratio": 1.0
    },
    {
        "title": "What are some jobs that focus on syntax?",
        "author": "ThePerdedor",
        "url": "https://www.reddit.com/r/linguistics/comments/10ci2ge/what_are_some_jobs_that_focus_on_syntax/",
        "text": "Basically the title. I am a linguistics major who really enjoys syntax and I’d like to work in a job that utilizes syntax.",
        "created_utc": 1673783779,
        "upvote_ratio": 1.0
    },
    {
        "title": "Are [ɾ] and [r] allophones in British English?",
        "author": "BizarroBezos",
        "url": "https://www.reddit.com/r/linguistics/comments/10chuwa/are_ɾ_and_r_allophones_in_british_english/",
        "text": "I cannot think of any examples that would prove otherwise, but I would be happy to be proven wrong",
        "created_utc": 1673783073,
        "upvote_ratio": 1.0
    },
    {
        "title": "Don’t know if this is the place for it, but I found some writing on a family photograph that I can’t tell what it is.",
        "author": "RangerMaster1",
        "url": "https://www.reddit.com/gallery/10cc5lx",
        "text": "",
        "created_utc": 1673762256,
        "upvote_ratio": 1.0
    },
    {
        "title": "Adding [p] after [m] in certain English-language accents?",
        "author": "jempai",
        "url": "https://www.reddit.com/r/linguistics/comments/10cbf6i/adding_p_after_m_in_certain_englishlanguage/",
        "text": "Hello y'all, I stumbled upon [this video about Manitoba accents](https://youtu.be/j_Jf9mSXJDI?t=50). She talks about how she and other Manitobians add a \\[p\\] sound after \\[m\\], like in the words \"something\" \\[səmp.θɪŋ\\] or \"hamster\" \\[hæmpstɚ\\].  \n\nWhat other English-language accents do this as well? Is there a reason for it, or is it just a result of making an accidental plosive from the air pressure of the bilabial nasal?",
        "created_utc": 1673759838,
        "upvote_ratio": 1.0
    },
    {
        "title": "Features lost independantly in every descendant",
        "author": "TennonHorse",
        "url": "https://www.reddit.com/r/linguistics/comments/10cb7l1/features_lost_independantly_in_every_descendant/",
        "text": "How common is it for all descendant languages to lose independantly a feature of the parent, to a point where it's completely unreconstructable and not even any indirect evidence of it's existence is kept? I have been looking at dialects of Mandarin (split shortly before the 14th century) and found that none of the Mandarin dialects have preserved the final bilabial -m nasal. Every single -m merged with -n and didn't affect the nearby sounds or the tone in the slightest. If we did a reconstruction of proto-Mandarin based on modern Mandarin dialects (there are many), proto-Mandarin wouldn't have -m. Yet, in a rhyme dictionary of early Mandarin (14th century ZhongYuanYinYun), it clearly states that Mandarin had -m. So we know from this single rhyme dictionary that proto-Mandarin did have -m. My question is, how common are features like this that are lost independantly in every descendant?",
        "created_utc": 1673759175,
        "upvote_ratio": 1.0
    },
    {
        "title": "Any interesting things you do with your language?",
        "author": "ellvoyu",
        "url": "https://www.reddit.com/r/linguistics/comments/10c7pfo/any_interesting_things_you_do_with_your_language/",
        "text": "When I say your language, I mean how you specifically speak it.\nFor example, l, to my knowledge, am the only person who contracts 'Excuse me' into 'Scuma' and I haven't heard of anyone else doing it. Do you do anything similar?",
        "created_utc": 1673748689,
        "upvote_ratio": 1.0
    },
    {
        "title": "need help with spanish phonetic transcription",
        "author": "scaledandicyx",
        "url": "https://www.reddit.com/r/linguistics/comments/10c4o7e/need_help_with_spanish_phonetic_transcription/",
        "text": "hi so i have an important test next week and i was wondering if i could text anyone from here in the next few days with help as im not the best in the phonetic transcription and will probably need help thank you&lt;3",
        "created_utc": 1673740438,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does Punic have any influence on the Tunisian dialect?",
        "author": "TheCarthageEmpire",
        "url": "https://www.reddit.com/r/linguistics/comments/10byzpt/does_punic_have_any_influence_on_the_tunisian/",
        "text": "Since both Punic and Arabic are Semitic languages and therefore share many similarities I'd imagine it's difficult to know if punic has any influence on the Tunisian dialect",
        "created_utc": 1673729379,
        "upvote_ratio": 1.0
    },
    {
        "title": "Are there any dialects that kept the -th ending of verbs instead of -s?",
        "author": "Independent-Ad-7060",
        "url": "https://www.reddit.com/r/linguistics/comments/10byf5w/are_there_any_dialects_that_kept_the_th_ending_of/",
        "text": "Hello! In standard English, the third person singular conjugation of most verbs in the present tense endeth with an -s (for example: he says, he thinks etc).  However in early 17th century texts like the King James Bible and in the plays of Shakespeare, we can see the -th ending instead.\n\nI wonder if there are any remote dialects of English that exclusively use the -th ending instead of the -s ending.  Or if this -th verb ending is completely extinct.  \n\nThank you!",
        "created_utc": 1673727975,
        "upvote_ratio": 1.0
    },
    {
        "title": "What do you call two languages that are essentially the same but not dialects of one another?",
        "author": "De-Snorkel",
        "url": "https://www.reddit.com/r/linguistics/comments/10bqn9n/what_do_you_call_two_languages_that_are/",
        "text": "For example British English and American English. or Dutch and Flemish. It seems a bit silly to call  these dialects since in both cases they have many dialects of their own and are just as widely if not more widely spoken than the \"non dialect\" version of the language. What terminology do you use to distinguish one from another or describe that they're part of the same thing in linguistics? I've tried to google this but I couldn't find an answer. Would be grateful for a reply. Much thanks",
        "created_utc": 1673708925,
        "upvote_ratio": 1.0
    },
    {
        "title": "Are there theoretical elements (concepts, notions, descriptive categories, goals, etc, …) that all - or most - linguistic theories share?",
        "author": "Ok-Time9377",
        "url": "https://www.reddit.com/r/linguistics/comments/10bpqg0/are_there_theoretical_elements_concepts_notions/",
        "text": "I’m not talking about the quest for language universals but conceptual common ground. What all linguistic theories share that either make them theories of language(s)? I am wondering if we can isolate the conceptual building blocks of all theories.\n\nLanguage is probably one but do they all include language development or speech or the problem or segmentation     Or the notion of structure, etc. \nDo they all question the function of language or not necessarily? Are there common descriptive categories (e.g. tense, time, verb, event,…) \n\nDoes that make sense?",
        "created_utc": 1673706561,
        "upvote_ratio": 1.0
    },
    {
        "title": "In the sentence ''Tonight we will go fishing instead.'' what is the transition word?",
        "author": "MarkClover",
        "url": "https://www.reddit.com/r/linguistics/comments/10bode0/in_the_sentence_tonight_we_will_go_fishing/",
        "text": "[removed]",
        "created_utc": 1673702676,
        "upvote_ratio": 1.0
    },
    {
        "title": "Words for human organs being used as terms of endearment",
        "author": "CID_Nazir",
        "url": "https://www.reddit.com/r/linguistics/comments/10bobol/words_for_human_organs_being_used_as_terms_of/",
        "text": "Words used for human organs are often also used as terms of endearment, the most common would be the heart (as in 'sweetheart'). In my native tongue (Malayalam), the words for liver and eye are also used as terms of endearment (generally only for romantic partners). This would probably be considered unusual in English.\n\nSo, I was kinda curious about how words for some organs are common across many languages (like the heart) while others are not so common. Also other than the three examples I mentioned here (heart, liver, eye), are there any other organs which are commonly used as a term of endearment in a language, which would be unusual in others?",
        "created_utc": 1673702535,
        "upvote_ratio": 1.0
    },
    {
        "title": "IPA of Swedish /i:/",
        "author": "jsb309",
        "url": "https://www.reddit.com/r/linguistics/comments/10bo758/ipa_of_swedish_i/",
        "text": "Hi there, long(ish)-time-first-time. I was watching [this video](https://youtu.be/xAqVhKKX4Yc) and around 2:04 it occurred to me that the Swedish woman is using a realization of /i:/ I've not really heard before to pronounce the Swedish word \"visa\" (and other words with /i:/). I went to Wiktionary and it gives the phonemic transcription as /'vi:,sa/, so I know there is no phonemic difference between what she says and the audio sample on Wiktionary. So what is the phonetic transcription of /i:/ in how she pronounces \"visa\", since it's not [i:]? For comparison, \"visa\" is also a Norwegian word and the Norwegian speaker seems to use [i:] for the word. Finally, does the Swedish speaker have a particular accent where this realization of /i:/ is common, or is this how it's spoken everywhere in Sweden? Thanks!",
        "created_utc": 1673702155,
        "upvote_ratio": 1.0
    },
    {
        "title": "I have a question about Ural-Altaic language family",
        "author": "abdmeiwn",
        "url": "https://www.reddit.com/r/linguistics/comments/10bn4if/i_have_a_question_about_uralaltaic_language_family/",
        "text": "I know that most similarities of Korean and Tungus/Mongolian languages can be explained by contact and borrowing. Despite this, why is Korean still considered as belonging to Altaic-language by some scholars?",
        "created_utc": 1673698604,
        "upvote_ratio": 1.0
    },
    {
        "title": "I've seen spaniards have this obsession with pronouncing words as if they were spanish words, regardless of their language of origin. Have there been some studies about this?",
        "author": "Frigorifico",
        "url": "https://www.reddit.com/r/linguistics/comments/10bel88/ive_seen_spaniards_have_this_obsession_with/",
        "text": "I'm Mexican, and whenever I speak to someone from Spain there are moments when I have to fight to not laugh at them, because when a word has origins in other languages they pronounce them as if they were reading them and these were originally spanish words\n\nFor example Spiderman usually is /spaideɹman/ (please forgive if my IPA is not exact) but spaniards say /spiderman/ because that's how those letters would be pronounced if this was a spanish word\n\nThere are many other examples: /bacon/ instead of /beicon/, /wifi/ instead of /waifai/, /ironman/ instead of /aironman/\n\nIn fact the other day I was talking with a friend and she mentioned she likes the song /aleluxa/, perplexed I asked to hear it, because I didn't know it, but it turned out to be /haleluja/ from Leonard Cohen\n\nAnother example is that if you see BBC articles mentioning people like Bashar al Asad they will write it \"Bachar el Asad\" because \"sh\" is not officially part of the spanish language, and \"al\" means \"el\" in arabic\n\nFrom where I'm sitting this custom seems silly. The word is the sound, not the writing, thus if you know how the word sounds in its language of origin, and you can make the damned sounds, why not say them? Why give more importance to the written version?\n\nThis has always driven me crazy, please someone help me understand",
        "created_utc": 1673668109,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to pronounce 'paradisiacal'",
        "author": "you_are_soul",
        "url": "https://www.reddit.com/r/linguistics/comments/10bdni0/how_to_pronounce_paradisiacal/",
        "text": "I thought no worries, I'll nip on down to youtoob and lo and behold, I find three separate clips on the pronunciation of that that exact word and each one is completely different from the others. Is this a word that no one knows how to pronounce because no one ever uses it, or has it been subsumed by regional dialects? Is the 's' silent?",
        "created_utc": 1673665280,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is this writing on this bag a real language? What does it say?",
        "author": "Lyrimal",
        "url": "https://www.reddit.com/gallery/10bc7i6",
        "text": "",
        "created_utc": 1673661112,
        "upvote_ratio": 1.0
    },
    {
        "title": "Wikipedia claims that /g/ in Lower Egyptian Arabic is a modern innovation -- is this true?",
        "author": "ColonoscopyCaptain",
        "url": "/r/learn_arabic/comments/10bbd5w/wikipedia_claims_that_g_in_lower_egyptian_is_a/",
        "text": "",
        "created_utc": 1673659499,
        "upvote_ratio": 1.0
    },
    {
        "title": "Distinctive Features of Montenegrin",
        "author": "birdstar7",
        "url": "https://www.reddit.com/r/linguistics/comments/10b99jv/distinctive_features_of_montenegrin/",
        "text": "Could anyone make a complete list or contribute some bits of info about distinctive features of Montenegrin which distinguish it from Croatian, Serbian and Bosnian, grammatically, phonologically, vocabularily (is that even a word?), etc.? Like, features of Montenegrin grammar, words exclusive to Montenegro, and whatnot. I haven’t been able to find much info about it in English (my native language), but I think this paper is a good start, it outlines some features but it doesn’t delve too much into the grammar and whatnot that make Montenegrin stand out from the other varieties of Serbo-Croatian. https://kuscholarworks.ku.edu/bitstream/handle/1808/29402/Greenberg_offprint_JosephFest_2019_22%20April-2(proofs+frontmatter)_reduced.pdf;jsessionid=24A463CFAC2A81BA69A969C0265993C5?sequence=1",
        "created_utc": 1673653149,
        "upvote_ratio": 1.0
    },
    {
        "title": "question about effectiveness of flashcards",
        "author": "Cultural_Yellow144",
        "url": "https://www.reddit.com/r/linguistics/comments/10b8qmp/question_about_effectiveness_of_flashcards/",
        "text": "When I'm learning new vocabulary from the second foreign language, which I'm learning, would it be better to push a second side definition in my native language or this first one which I've already learnt to some extent?",
        "created_utc": 1673651807,
        "upvote_ratio": 1.0
    },
    {
        "title": "현금홀덤사이트 - 현금으로 즐기는 홀덤 - 조작없이 안전하게- 홀덤월드",
        "author": "andreavtmccague",
        "url": "https://holdem.world/%ED%98%84%EA%B8%88%ED%99%80%EB%8D%A4%EC%82%AC%EC%9D%B4%ED%8A%B8/",
        "text": "",
        "created_utc": 1673651797,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why is brain/mind written as such in the linguistic literature?",
        "author": "Striking-Stuff50",
        "url": "https://www.reddit.com/r/linguistics/comments/10b6a8z/why_is_brainmind_written_as_such_in_the/",
        "text": "Is this to reflect the lack of consensus if such dichotomy exists? Does this have to do with the mind-body problem? \n\nAny info is highly appreciated. Thank you :)",
        "created_utc": 1673645747,
        "upvote_ratio": 1.0
    },
    {
        "title": "Suggested ways to learn vowel IPA?",
        "author": "RaiseOpen5247",
        "url": "https://www.reddit.com/r/linguistics/comments/10b3pb2/suggested_ways_to_learn_vowel_ipa/",
        "text": "I'm back at vowels again. A few days earlier I [made this post](https://www.reddit.com/r/linguistics/comments/106tkgt/how_accurate_are_the_vowels_found_in_the_ipa_chart/) asking whether the IPA vowels are accurate transcriptions and someone gave me a [link to a blog post](https://www.englishspeechservices.com/blog/the-vowel-space/) talking about how the vowel space is not a physical space, how Daniel Jones himself was not consistent or terrifically convincing when vouching for his system, and how vowels are rather about \"formants\", I concept that's beyond me.\n\n&amp;#x200B;\n\nThen I did some research and found some scientific papers like this one by [Göran Hammarström](https://www.cambridge.org/core/journals/journal-of-the-international-phonetic-association/article/abs/revision-of-cardinal-vowels-and-some-other-problems/9D357A8563E453AF40695915908C1957) (1973) which mentions another one by J. D. McClure (1972), I just skimmed through this first, but it's clear both criticize the vowel system used by the IPA, already in the early 70s.\n\nThen there's a [short 1977 review by Peter Ladefoged](https://www.jstor.org/stable/412751) of the book *Fundamental Problems in Phonetics*, by J. C. Catford, which although not mainly discussing this, glides over the same problem.\n\nI also recurred to the [IPA website itself,](https://www.internationalphoneticassociation.org/IPAcharts/inter_chart_2018/IPA_2018.html) because someone here pointed to the recordings there being made by \"actual, professional phoneticians\", including Ladefoged himself. The vowels sounds are hardly consistent. The recordings don't agree between themselves, even though they were recorded by four professional phoneticians. I won't go in detail, you can check the chart yourself: the recordings for the same vowel differ significantly from one phonetician to another (sometimes they just sound off), and sometimes the same phonetician has recordings that sound the exact same thing to me, even though the vowel qualities are supposedly quite distinct.\n\nNow, I'm not a linguist or phonetician. I graduated in another field of the humanities, luckily in one of the best colleges I could know of, and and trying to get a grasp of basic linguistics, specifically, phonetics, for a prospective master's program in Germany. I've been into this for a month only and it bothers me A LOT, that in a discipline so old there's apparently no sign of an actually disciplined way to describe vowels.\n\nMaybe I'm wrong, but really, the first thing I read that actually made sense was the blog post above, although I feel it's description of formants and cardinal vowels is way too complex for me to get into.  I'd like to ask then, is there anything to be learnt at all when it comes to learning these vowels, because to me, it seems like every professor/course picks whatever sound they like and attach it to a certain sign and teach it that way (I've been taking some MOOCs on phonetics, the lack of agreement is astounding).\n\n&amp;#x200B;\n\nOverall, that's it, a bit of a rant, but also, I'd like some guidance, otherwise I think I'll give up on phonetics entirely, as there *appears* not be anything systematic to be learnt at all when it comes to a coherent, learnable vowel system.\n\nPlease, prove me wrong, or rather, instruct me.",
        "created_utc": 1673639503,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is there a definitive answer?",
        "author": "Nananyann",
        "url": "https://www.reddit.com/r/linguistics/comments/10b217s/is_there_a_definitive_answer/",
        "text": "Recently I've been in this well of \"Is Homo derived from ομος or χωμα?\" and it's driving me insane. Many people say it's from ομος meaning same/similar, yet an adequate amount of people also say it might be from χωμα meaning dirt.\n\nI'm confused and honestly, it could be either of them- or neither for all we know (im losing it please help). \n\nIs there a definitive answer or way to know for sure which one it is? Thank you for your time and trouble...",
        "created_utc": 1673635415,
        "upvote_ratio": 1.0
    },
    {
        "title": "I don't know if this is allowed here, but i think it's related to lingusitics in some way. Anyway, i 3D modeled Bouba, Kiki and a Wug.",
        "author": "Ziemniakus",
        "url": "https://www.reddit.com/gallery/10azx7g",
        "text": "",
        "created_utc": 1673630277,
        "upvote_ratio": 1.0
    },
    {
        "title": "Content words for day to day Dialogue | English Grammar | Jacintha Dharma",
        "author": "banknotecoinstamp",
        "url": "https://youtube.com/watch?v=uTejvOxnrNs&amp;feature=share",
        "text": "",
        "created_utc": 1673622621,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do we know Proto-Sino-Tibetan had a complex morphology?",
        "author": "Vampyricon",
        "url": "https://www.reddit.com/r/linguistics/comments/10aweqe/how_do_we_know_protosinotibetan_had_a_complex/",
        "text": "I've heard it claimed a few times, usually along the lines of the following:\n\n&gt; It is becoming increasingly clear that Proto-Trans-Himalayan/Proto-Sino-Tibetan had a complex morphology.\n\nThis is occasionally supplemented with the claim that the various branches of Trans-Himalayan/Sino-Tibetan have their root words derived from different forms of the PTH/PST root word.\n\nWhat are the papers that show this morphology? How do we know that morphology isn't just epicycles to patch up a failing hypothesis? (I.e. what are the foundational papers that show that Sino-Tibetan is a valid family?)",
        "created_utc": 1673621526,
        "upvote_ratio": 1.0
    },
    {
        "title": "Puzzle time #6",
        "author": "SpielbrecherXS",
        "url": "https://www.reddit.com/r/linguistics/comments/10aw8gu/puzzle_time_6/",
        "text": "Puzzle #1\n\n(by Mirjam Fried)\n\nCzech is the official language of the Czech Republic, the western two thirds of the former Czechoslovakia. It is spoken by about nine and a half million people and belongs to the western branch of Slavic languages.  \nThe Czech spelling system uses special letters for certain sounds; you will also find a few of them in this puzzle, including the following:\n\ně pronounced as the first syllable of the word \"yellow.\"\n\nč pronounced as the first sound in the word \"Czech.\"\n\nš pronounced as the first sound in the word \"shop.\"\n\nů pronounced as the last sound in the word \"stew.\"\n\né pronounced approximately as the last sound in the word \"café.\"\n\ná pronounced approximately as the first sound in the word \"argue.\"\n\nThe following are examples of how to say in Czech what time it is:\n\n&amp;#x200B;\n\nhttps://preview.redd.it/kn09cj8afsba1.png?width=659&amp;format=png&amp;auto=webp&amp;v=enabled&amp;s=bee2a2a1f2397a30d4c1f42d9444da9329fc5999\n\nHow would you say the following in Czech?\n\n23 minutes after five, 10 minutes after nine\n\n&amp;#x200B;\n\nShort answer: &gt;!za sedm minut půl šesté; za pět minut čtvrt na deset!&lt;\n\nExplanation: &gt;!I happen to know Slavic numerals, so I didn't really need to figure them out from scratch here. But the first two phrases should be enough to realise \"osm\" is 8, while \"pět\" and \"deset\" are 5 and 10, respectively, and the rest of the numbers are fairly straightforward.!&lt;\n\n&gt;!The tricky part starts with phrase 4, where we find an \"eight\" instead of an expected \"seven\". It seems to parse as \"quarter of the eight's hour\". In the next two phrases, this guess is confirmed and expanded upon, when we suddenly have two \"eights\" and a \"quarter\" instead of \"seven minutes after seven\" and a \"ten\", a \"quarter\" and a \"seven\" instead of \"five minutes after six\". The only math that makes sense here is \"eight minutes to quarter of the eight's hour\" and \"ten minutes to quarter of the seven's hour\", and we can see from the other phrases that \"za x minut\" does indeed mean \"x minutes to\".!&lt;\n\n&gt;!\"Half\" in \"půl osmé\" and \"půl deváté\" functions similarly to quarter: it's \"half to\" rather than \"half past\".!&lt;\n\n&amp;#x200B;\n\n&amp;#x200B;\n\nPuzzle #2\n\n(by Myravyova I.A.)\n\nBelow are several words in Alyutor (a language of the Chukotkan branch of the Chukotko-Kamchatkan family) with an accent mark on each word and an English translation:\n\nt**a**tul - fox\n\nnətɣ**ə**lqin - hot\n\nnur**a**qin - far\n\nɣ**ə**lɣən - skin\n\nn**e**qəqin - fast\n\nnəs**ə**qqin - cold\n\ntapl**a**ŋətkən - he makes shoes\n\nk**ə**mɣətək - curl up\n\nʔ**i**tək - to be\n\npaq**ə**tkuk - to gallop\n\nn**i**lɣəqinat - white\n\np**u**nta - liver\n\nqet**u**mɣən - kin, relative\n\np**i**wtak - to pour, to scatter\n\nnəm**i**tqin - skillful\n\nt**u**mɣətum - friend\n\nt**ə**tka - walrus\n\nk**ə**ttil - forehead\n\nqalp**u**qal - rainbow\n\nkəp**i**rik - to hold in arms, to cradle\n\ntəv**i**tatətkən - I am working\n\np**i**ntəvəlŋək - to come for, to attack (each other)\n\n&amp;#x200B;\n\n(\\* I deleted the references to exact grammatical forms since this puzzle is purely phonetic, and the extra morphological info was misleading for me when solving)\n\n&amp;#x200B;\n\n&amp;#x200B;\n\nDetermine accent in the following words:\n\nsawat (noose), pantawwi (fur boots), nəktəqin (hard, solid), ɣətɣan (late autumn), nəminəm (broth), nirvəqin (sharp), pujɣən (spear), tilmətil (eagle), wiruwir (salmon), wintatək (to help), nəmalqin (good), jaqjaq (seagull), jatək (to come), tavitətkən (I will work), pintətkən (he attacks someone), tajəsqəŋki (in the evening).\n\n&amp;#x200B;\n\n&amp;#x200B;\n\nShort answer:\n\n&gt;!sawat (noose), pantawwi (fur boots), nəktəqin (hard, solid), ɣətɣan (late autumn), nəminəm (broth), nirvəqin (sharp), pujɣən (spear), tilmətil (eagle), wiruwir (salmon), wintatək (to help), nəmalqin (good), jaqjaq (seagull), jatək (to come), tavitətkən (I will work), pintətkən (he attacks someone), tajəsqəŋki (in the evening)!&lt;\n\n&amp;#x200B;\n\nExplanation: &gt;!My thinking was off here. I assumed we needed to take into account morphology, with accent never falling on affixes, and decided the accent falls on the next to last syllable of the root, unless it’s an open syllable with a schwa. Surprisingly, this incorrect assumption gave me correct accents for every word in the task except tajəsqəŋki and pintətkən.!&lt;\n\n&gt;!The actual way to go is to sort the words by the number of syllables and to count syllables from the start, not from the end of word/root. In this case you can see that the accent falls on the second syllable, unless it’s the last syllable or an open syllable ending with schwa. In this latter two cases the accent falls on the first syllable.!&lt;",
        "created_utc": 1673621067,
        "upvote_ratio": 1.0
    },
    {
        "title": "Questions",
        "author": "Azenyar",
        "url": "https://www.reddit.com/r/linguistics/comments/10asm6x/questions/",
        "text": "Hi guys,\n\nI am interested in the linguistics of English.\n\nI just wanted to ask :\n\n1- What would happen if English lost the features of : arbitrariness, duality and displacement ?\n\n2-What should any linguist do in order to be objective when studying language? \n\n3-Is it true that proto-indo European is hypothesized to be the ancestor of all languages in the world?\n\n4-Are the words semantics, morphology and phonology examples of the linguistics register?\n\n5-Is the standard language an officialized dialect?\n\n6- Do linguists analyze languages and must speak them?",
        "created_utc": 1673610566,
        "upvote_ratio": 1.0
    },
    {
        "title": "EFL/SLE Sociopragmatics and how to accept a refusal",
        "author": "Tankgirl_14",
        "url": "https://www.reddit.com/r/linguistics/comments/10ascei/eflsle_sociopragmatics_and_how_to_accept_a_refusal/",
        "text": "Please help!  \n\n\nI am writing an article on rejection/refusal of an offer, and all previous literature concerns how to refuse or refusal strategies, rather than how to accept a refusal. Am I missing terminology here?  \n\n\nDoes anyone know of a resource that could help me here?  \n\n\nThanks!",
        "created_utc": 1673609611,
        "upvote_ratio": 1.0
    },
    {
        "title": "What's the difference between /bəˈfɔɹ/ and /biˈfɔɹ/",
        "author": "MeirMorei",
        "url": "/r/EnglishLearning/comments/10ar91d/whats_the_difference_between_bəˈfɔɹ_and_biˈfɔɹ/",
        "text": "",
        "created_utc": 1673606200,
        "upvote_ratio": 1.0
    },
    {
        "title": "Has anyone attempted to assign symbols for unpronounceable phonemes?",
        "author": "Phenomenymous",
        "url": "https://www.reddit.com/r/linguistics/comments/10aivf2/has_anyone_attempted_to_assign_symbols_for/",
        "text": "This is probably a stupid question, but I figure it doesn't hurt to be curious. On the IPA chart, there are regions shaded in gray that indicate that it's impossible to articulate. Has anyone tried to assign symbols to them, even if they cannot be physically spoken?",
        "created_utc": 1673577739,
        "upvote_ratio": 1.0
    },
    {
        "title": "Future Tense + Bridge Verbs",
        "author": "antiretro",
        "url": "https://www.reddit.com/r/linguistics/comments/10aif56/future_tense_bridge_verbs/",
        "text": "Hi all, i was thinking about negative raising in general when i noticed the same group of verbs that allow negative raising like:\n\nI don't believe that john will come = I believe that John won't come.\n\n&amp;#x200B;\n\nand then I noticed the absurdity of bridge verbs with +FUT as shown below:\n\n?/\\*I will believe that John will come.\n\n?/\\*I will believe that John comes.\n\n&amp;#x200B;\n\nas I'm not a native speaker, I couldn't judge these sentences myself nor could I find any paper related to this aspect of bridge verbs. Speaking of aspects, I guess they are also not feasible:\n\n?/\\*I am believing that John + verb\n\n?/\\*I have believed that John + verb  \n\n&amp;#x200B;\n\nany insight on this matter is greatly appreciated!",
        "created_utc": 1673576482,
        "upvote_ratio": 1.0
    },
    {
        "title": "Reconstructed Languages like PIE",
        "author": "Acts17_28",
        "url": "https://www.reddit.com/r/linguistics/comments/10aemn5/reconstructed_languages_like_pie/",
        "text": "I remember seeing how linguist(s) came up with a lexicon for Proto-Indo-European, do they actually believe that is the language originally spoken? How can it be anything other than a speculative fabrication seeing how there are no extant texts in the language?",
        "created_utc": 1673566720,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why do so many Dutch speakers who learn English as adults have no discernible accents?",
        "author": "forward_thinkin",
        "url": "https://www.reddit.com/r/linguistics/comments/10adrjr/why_do_so_many_dutch_speakers_who_learn_english/",
        "text": "I guess this might not be the case in other parts of the English speaking world who have different dialects but as someone who lives in North America, I couldn’t help but notice how quickly native Dutch speakers pick up the language. There might be some grammatical mistakes every now and then but they always have pristine pronunciation. \n\nSo much so that I didn’t even know that two of my classmates had just moved over here from Brussels 4 years ago.\n\nIs it becuase all the phonological sounds present in English are also present in Dutch? Or that the two languages are so closely related? Super curious.",
        "created_utc": 1673564638,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is a 'Rheme'?",
        "author": "AvantReps",
        "url": "https://www.reddit.com/r/linguistics/comments/10add24/what_is_a_rheme/",
        "text": "I can't seem to figure out what examples of a rheme would be. I'm not really getting anything from searching. From [https://knepublishing.com/index.php/KnE-Social/article/view/8707/14672](https://knepublishing.com/index.php/KnE-Social/article/view/8707/14672):\n\n\"The system deals with the current point of departure about what has come before; it is clear where the clause is located in the text, and how its contribution fits in. This point of beginning of the clause or local context is called a theme. The remainder of the message of the clause tells what is presented against the background of the local context; it is where the clause moves after the point of the beginning of the clause. This is called a rheme\". \n\nI'm not sure if it's just the explanations I'm having troubles with. I mostly want to know this because I feel like it would help me understand literature of the more 'impressionistic' persuasion better.\n\nthere are a ton of other \"eme\" words too, which I didn't even know about before trying to figure this one out - I don't study linguistics. I'd definitely appreciate some help in comprehending these concepts though; I don't even know if I'm conceptualizing them in the right way.\n\nThanks!",
        "created_utc": 1673563684,
        "upvote_ratio": 1.0
    }
]