[
    {
        "title": "Is a uvular tap recognised as being used in at least some major English varieties?",
        "author": "langisii",
        "url": "https://www.reddit.com/r/linguistics/comments/8vb7hp/is_a_uvular_tap_recognised_as_being_used_in_at/",
        "text": "I've noticed I (Australian English speaker) often use and hear what I think is a voiced uvular tap or stop as an allophone for the /d/ in the consonant cluser /-dn-/ or /-dən-/ in words like \"wooden\", \"didn't\", \"sudden\", \"widening\", etc. This includes when it occurs between separate words, for example \"good night\", \"could never\".\n\nA friend who natively speaks Scottish English (but has been in Australia since childhood) also uses it in \"Wednesday\". Wiktionary notes Scottish English pronunciation as /ˈwɛ(ʔə)nzde/ but the sound I'm thinking of isn't a glottal stop; I guess it would be /ɢ̆/.\n\nIs this an allophony that people talk about? From my googling it seems like uvular taps are very rare and not attested in English. Is it something that's unrecognised or is it a well-known thing that I've just got wrong/missed in my googling? Is it present in other varieties of English?",
        "created_utc": 1530463874,
        "upvote_ratio": ""
    },
    {
        "title": "Can language unite us in the Marianas? -- \"Guam and the CNMI each have adopted official orthographies, which are distinct from one another in fundamental ways, beginning with the spelling of CHamoru. There are differences in speech patterns, intonation and word use from island to island.\" [USA]",
        "author": "trot-trot",
        "url": "https://www.postguam.com/forum/featured_columnists/can-language-unite-us-in-the-marianas/article_8220003a-7aaf-11e8-b812-5bad409ca8e1.html",
        "text": "",
        "created_utc": 1530436032,
        "upvote_ratio": ""
    },
    {
        "title": "Looking for free audio recordings of the ~3,000 most common English words.",
        "author": "second-rate-hero",
        "url": "https://www.reddit.com/r/linguistics/comments/8v881k/looking_for_free_audio_recordings_of_the_3000/",
        "text": "I'm building an app and I'm wondering if there are recordings of common English words that I can freely use.",
        "created_utc": 1530428006,
        "upvote_ratio": ""
    },
    {
        "title": "How do I teach articulatory phonetics?",
        "author": "kneechasenpai",
        "url": "https://www.reddit.com/r/linguistics/comments/8v845i/how_do_i_teach_articulatory_phonetics/",
        "text": "Uh... Sorry for the rather blank title. Some of my literature buddies have a phonetics paper this semester. They're gonna have their exams next week and are asking me to help them out. Thing is - their phonetics professor's kinda lazy and I've never taught phonetics before. How do I start? Help a brother out here please.",
        "created_utc": 1530426425,
        "upvote_ratio": ""
    },
    {
        "title": "How to Talk “Straight”?",
        "author": "principalsoffice",
        "url": "https://www.reddit.com/r/linguistics/comments/8v75pc/how_to_talk_straight/",
        "text": "How does one talk “straight”? I’m gay and I’ve found, and others have told me, that I talk in the middle of a gay lisp and normal talking. What is the science behind this and what specific sounds can be changed? I want to talk like a normal 16 year old boy and not make it obvious that I’m gay. This isn’t any type of self hate, I’m only interested in answers to the question asked. Thanks a",
        "created_utc": 1530415150,
        "upvote_ratio": ""
    },
    {
        "title": "Why did the Continental Germanic languages lose [ð] and [θ], while English, Icelandic, and Faroese retained those sounds?",
        "author": "thatrandomdemonlord",
        "url": "https://www.reddit.com/r/linguistics/comments/8v74u3/why_did_the_continental_germanic_languages_lose_ð/",
        "text": "",
        "created_utc": 1530414894,
        "upvote_ratio": ""
    },
    {
        "title": "Questions about IPA vowel positions",
        "author": "lingesale",
        "url": "https://www.reddit.com/r/linguistics/comments/8v6roi/questions_about_ipa_vowel_positions/",
        "text": "I'm learning French pronunciation with the IPA system and I had a question about the vowel chart. I found [this](https://i.imgur.com/9gUR5Bn.png) vowel chart for French (it's edited by myself, I'll explain this later) and I noticed that the vowels are slightly, but still noticeably off from the standard (?) IPA vowel chart that contains all the sounds (the colours corresponding with where they are on the standard chart). So my two questions are: 1) Do the slightly difference positions make a difference in when learning these sounds, or does their slight change in position from the standard chart not make an audible difference? (or rather, is it important) 2) How do I take into account the different position from the standard position to try to be as precise as possible when making these sorts in accordance to their positions? \n\nI assume the different positions are there for a reason, especially comparing them to other languages like Italian for example that also has very similar but slightly different positions for the same vowels as well. Specifically for the second question it's puzzling to think of how to make these sounds in their exact position, or at least as approximant as possible, compared to its standard place. I can find many clips showing the pronunciation of these sounds in their standard position but not in the exact position according to the French IPA chart, and I'm also not sure exactly how to make those small differences; like with /e/ for example, I can pronounce it as in its standard position, but trying to imagine pulling my tongue back slightly and pronouncing it still produces the same sound to my ears.\n\nWhat are some tips? As my aim is to perfect these sounds in French.",
        "created_utc": 1530410741,
        "upvote_ratio": ""
    },
    {
        "title": "Is this sound inventory naturalistic? Please help! (Comment posted on r/conlangs)",
        "author": "Dark-Soliloquy",
        "url": "https://www.reddit.com/r/conlangs/comments/8ryclo/comment/e1g6wds?st=JJ0INJSK&amp;sh=1d2053ab",
        "text": "",
        "created_utc": 1530408691,
        "upvote_ratio": ""
    },
    {
        "title": "Why do we write \"wr\" in English for some [ɹ] sounds?",
        "author": "eagleyeB101",
        "url": "https://www.reddit.com/r/linguistics/comments/8v6dln/why_do_we_write_wr_in_english_for_some_ɹ_sounds/",
        "text": "[removed]",
        "created_utc": 1530406465,
        "upvote_ratio": ""
    },
    {
        "title": "Pronunciation of old English word \"doundrins\"?",
        "author": "TapiocaTuesday",
        "url": "https://www.reddit.com/r/linguistics/comments/8v6cgx/pronunciation_of_old_english_word_doundrins/",
        "text": "[removed]",
        "created_utc": 1530406121,
        "upvote_ratio": ""
    },
    {
        "title": "Are most alphabetic writing systems derived from logographic writing systems?",
        "author": "Caulisoup",
        "url": "https://www.reddit.com/r/linguistics/comments/8v552d/are_most_alphabetic_writing_systems_derived_from/",
        "text": "I am aware that Hangul is an unique alphabetic writing system. Hiragana and Katakana are derived from Han Characters, some of which are pictographic logograms but most of which are now semantic and phonetic. Many writing systems seem to be derived from Egyptian hieroglyphics. \n\nIs that the natural evolution of language - logographic by the original civilization and alphabetic by other civilizations?",
        "created_utc": 1530394498,
        "upvote_ratio": ""
    },
    {
        "title": "Are there concepts expressed across most if not all languages?",
        "author": "entityzer0",
        "url": "https://www.reddit.com/r/linguistics/comments/8v4t3b/are_there_concepts_expressed_across_most_if_not/",
        "text": "[removed]",
        "created_utc": 1530391491,
        "upvote_ratio": ""
    },
    {
        "title": "Any recommendations on how to teach my Chinese students the velarized (dark) [ɫ] sound in English?",
        "author": "BinaryFingers132",
        "url": "https://www.reddit.com/r/linguistics/comments/8v3523/any_recommendations_on_how_to_teach_my_chinese/",
        "text": "I’m teaching at a university in China, and my students seem to have more trouble with dark [ɫ] than any other sound. They generally try rounding their lips and often end up with a vowel like [oʊ] or [ɔ]. For example with one girl, I thought her name was “Cameo” for a couple weeks before I saw she was writing “Camille” on her papers.\n\nMost Chinese accents/dialects have the normal light [l] sound (although a few don’t fully distinguish between [l] and [n]) so usually they’re fine with that one. I’ve tried getting them to do a sound kind of like [lg] where they just don’t release the “g”, so at least it gets their tongue to their velum while making the light [l]. And I tell them that they really don’t have to do anything with their lips, but maybe it’s hard for them to change when they’ve been attempting it the same way for years.\n\nSo, any suggestions on how I can teach them this sound?",
        "created_utc": 1530377652,
        "upvote_ratio": ""
    },
    {
        "title": "Why do we say the 'Mississippi River' but 'Lake Superior'? Or 'Mount Everest' but the 'Rocky Mountains'?",
        "author": "RolandPapers",
        "url": "https://www.reddit.com/r/linguistics/comments/8v2r4j/why_do_we_say_the_mississippi_river_but_lake/",
        "text": "Why does the proper name precede some land formation nouns while others follow?   Is there a rule, pattern, or history to this?\n\nWhat are examples of land formations or bodies of water that have either a preceding proper name or one following?  \n\nAre there others families of nouns where this occurs?   ",
        "created_utc": 1530374268,
        "upvote_ratio": ""
    },
    {
        "title": "Human Listeners Can Accurately Judge Strength and Height Relative to Self from Aggressive Roars and Speech",
        "author": "[deleted]",
        "url": "https://www.sciencedirect.com/science/article/pii/S2589004218300579",
        "text": "",
        "created_utc": 1530371212,
        "upvote_ratio": ""
    },
    {
        "title": "Is \"bias\" by definition illogical, or is it also right to use it for logical assumptions and if so, why is it seen as such a negative word?",
        "author": "TheFruitVendor",
        "url": "https://www.reddit.com/r/linguistics/comments/8v26kc/is_bias_by_definition_illogical_or_is_it_also/",
        "text": "[removed]",
        "created_utc": 1530368809,
        "upvote_ratio": ""
    },
    {
        "title": "Are there any languages that are still spoken today, that are mutually intelligible with English?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/linguistics/comments/8v218r/are_there_any_languages_that_are_still_spoken/",
        "text": "[removed]",
        "created_utc": 1530367291,
        "upvote_ratio": ""
    },
    {
        "title": "Weekend Roundup - June 30, 2018",
        "author": "AutoModerator",
        "url": "https://www.reddit.com/r/linguistics/comments/8v1dnh/weekend_roundup_june_30_2018/",
        "text": "Welcome again to the /r/linguistics weekend round-up, your chance to share with the community what you've been working on for the past week. You can also share things that you've read, observations you've recently made, or anything else interesting that you've come across that might not otherwise warrant a separate thread. Tell us about your week.\n",
        "created_utc": 1530360026,
        "upvote_ratio": ""
    },
    {
        "title": "Linguistics for children?",
        "author": "rantasam",
        "url": "https://www.reddit.com/r/linguistics/comments/8v0v8h/linguistics_for_children/",
        "text": "I have worked with a colleague of mine for many years creating and teaching a language and linguistics A Level course (17-18 year olds). She is now moving to a new school that currently only teaches 11 year old students. \n\nHas anyone any suggestions for an interesting book or resource that could be incorporated in teaching linguistic concepts and ideas as a leaving present?\n\nAny ideas greatly appreciated. ",
        "created_utc": 1530352849,
        "upvote_ratio": ""
    },
    {
        "title": "I can roll my r's, but not in my internal monologue",
        "author": "onthelambda",
        "url": "https://www.reddit.com/r/linguistics/comments/8uzo7k/i_can_roll_my_rs_but_not_in_my_internal_monologue/",
        "text": "[removed]",
        "created_utc": 1530335753,
        "upvote_ratio": ""
    },
    {
        "title": "Linguist of reddit, is it grammatically incorrect to refer to women as females in a sentence. For example, “I talked to a female yesterday.”",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/linguistics/comments/8uza57/linguist_of_reddit_is_it_grammatically_incorrect/",
        "text": "[removed]",
        "created_utc": 1530331274,
        "upvote_ratio": ""
    },
    {
        "title": "How do you ever get a job in linguistics if you aren't a computer science major?",
        "author": "bisexualconspiracy",
        "url": "https://www.reddit.com/r/linguistics/comments/8uyew4/how_do_you_ever_get_a_job_in_linguistics_if_you/",
        "text": "Hi all,\n\nI'm a recent ling graduate. Mainly focused on ASL and I did get accepted to Gallaudet for sign linguistics, but I've deferred so I can make my decision next year. \n\nI am very quickly realizing that getting a job in linguine is useless unless you have an MA or PhD in computational, and for a lot of entry level computational jobs they only want software engineers or computer science majors. \n\nI'm getting very discouraged that I will ever find a career in linguistics. If all the jobs are in computational with grad degrees but I'm into sign linguistics, that doesn't seem like a good fit. And all other jobs in linguistics require years of experience, but I can't even find a job to give me experience. \n\nDo you guys have any tips or should I give up and accept linguistics just will probably not be my path?",
        "created_utc": 1530322037,
        "upvote_ratio": ""
    },
    {
        "title": "Does anyone else not distinguish /ŋ/ from /ŋɡ/ or is that just something I do?",
        "author": "Iykury",
        "url": "https://www.reddit.com/r/linguistics/comments/8uxzo0/does_anyone_else_not_distinguish_ŋ_from_ŋɡ_or_is/",
        "text": "For example, I pronounce the word \"thing\" like [θiŋɡ].",
        "created_utc": 1530317816,
        "upvote_ratio": ""
    },
    {
        "title": "If English was written with a different wtiting system, which one would be the best?",
        "author": "Soph19310",
        "url": "https://www.reddit.com/r/linguistics/comments/8uxshi/if_english_was_written_with_a_different_wtiting/",
        "text": "[removed]",
        "created_utc": 1530315950,
        "upvote_ratio": ""
    },
    {
        "title": "Is this sound inventory naturalistic?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/linguistics/comments/8ux15h/is_this_sound_inventory_naturalistic/",
        "text": "[deleted]",
        "created_utc": 1530309240,
        "upvote_ratio": ""
    },
    {
        "title": "\"BOOKMARK\" is a wrong term for the browser in 2018. what do you smart people would call it if didn't exist ?",
        "author": "orenmizr",
        "url": "https://www.reddit.com/r/linguistics/comments/8uwraf/bookmark_is_a_wrong_term_for_the_browser_in_2018/",
        "text": "[removed]",
        "created_utc": 1530306984,
        "upvote_ratio": ""
    },
    {
        "title": "Resources for keeping up with linguistic research",
        "author": "annodomini",
        "url": "https://www.reddit.com/r/linguistics/comments/8uvsyd/resources_for_keeping_up_with_linguistic_research/",
        "text": "I studied some linguistics in college (more than 10 years ago by now); did enough work for it to qualify as a minor, though I never bothered to file the paperwork to officially get the minor since I wasn't planning on doing much with it afterwards.\n\nI loved it, those were some of my favorite classes, and I'd like to keep up with what major things are going on in the world of linguistics, but I'm not in academia so I don't have access to many journals, and trying to follow fields via journal articles might work for someone quite specialized and following it closely, but I'm a bit more interested in higher level overviews and references to important new work.\n\nAre there any good resources for someone in my position? Something that might target the educated layman, or for linguists who want to follow along with what is going on in fields that aren't their specialty?\n\nSemantics is the area I went most in depth in college, having taken classes with Angelika Kratzer and Chris Potts, as well as natural language processing (I majored in computer science and am now a programmer). But I'm also interested in other fields, like syntax and phonology, or even fields I didn't study as much of but could learn more about.\n\nOne of the things I'm most interested in, that I didn't see as much of in my undergraduate studies, was very much in the way of empiricism; I love math and logic, so I really enjoy theoretical linguistics, but I also worry that a lot of it involves building up theoretical frameworks which are flexible enough that they could never really be falsified, and can sometimes be so general as to be nearly meaningless.\n\nWhile of course there was a lot of work applying and testing particular formalisms against specific examples in English and sometimes other languages, that's more anecdotal data than anything really falsifiable.\n\nSo besides having a way of catching up on linguistics in general, I'm also curious about the state of the art in empirical linguistics; actually testing theories against corpora or languages they weren't developed against, use of statistical evidence about actual speech rather than comparing theories against a few hand selected examples, or successes in particular formalisms being used to improve performance in NLP.\n\nAnyone have suggestion on resources for both keeping up in general, or on resources for validating theoretical linguistics results with empirical evidence?\n\nOr if there aren't good sources to reference, for those of you who are active in studying linguistics, what are the major advances that have happened in the past decade or two in your field? What important, groundbreaking work has come out that has changed your field? Or maybe what slow, measured change has happened over the past couple of decades, without one single groundbreaking piece of research, but with the state of the art now being considerably different than it was 10 or 20 years ago? And how is that work being validated against the real world, as opposed to just spending a lot of time working out features of a particular formalism against small anecdotal data sets?",
        "created_utc": 1530299595,
        "upvote_ratio": ""
    },
    {
        "title": "Is why used as a filler word?",
        "author": "Somphet1987",
        "url": "https://www.youtube.com/watch?v=iWqV4xuqS1c",
        "text": "",
        "created_utc": 1530298397,
        "upvote_ratio": ""
    },
    {
        "title": "Is there any difference between pronunciation of Hampster and Hamster, Thompson and Thomson?",
        "author": "JohnnyGoodman4u",
        "url": "https://www.reddit.com/r/linguistics/comments/8uuw7k/is_there_any_difference_between_pronunciation_of/",
        "text": "[removed]",
        "created_utc": 1530292773,
        "upvote_ratio": ""
    },
    {
        "title": "Why some speakers can't understand speakers who understand them - Asymmetric Intelligibility",
        "author": "KetchupBlood",
        "url": "https://www.youtube.com/watch?v=E042GHlUgoQ",
        "text": "",
        "created_utc": 1530289956,
        "upvote_ratio": ""
    },
    {
        "title": "Is there an English word to express the idea of saying a word in a tone that reflects the word itself?",
        "author": "Speakwithsimon",
        "url": "https://www.reddit.com/r/linguistics/comments/8uufe9/is_there_an_english_word_to_express_the_idea_of/",
        "text": "[removed]",
        "created_utc": 1530289314,
        "upvote_ratio": ""
    },
    {
        "title": "\"the laundry needs washed\" vs \"the laundry needs to be washed\"/\"needs washing\"",
        "author": "theghostintheshell",
        "url": "https://www.reddit.com/r/linguistics/comments/8utxvi/the_laundry_needs_washed_vs_the_laundry_needs_to/",
        "text": "From time to time I meet people whose dialect has no prohibition against the syntax \"the dogs need walked\", but in my intuition of my own dialect, that's a marked violation of what should be \"the dogs need walking\" or \"the dogs need to be walked\".  Does anyone here know what the syntactic distinction is called and/or what region of the US it comes from?  Am I wrong that it is a minority thing (linguistic, not ethnic)?\n\nGot my degree in linguistics but have forgotten a lot in the 15 years since I worked with it.",
        "created_utc": 1530285557,
        "upvote_ratio": ""
    },
    {
        "title": "How to best respond to Linguistic Pseudoscience? (mainly regarding Eastern languages)",
        "author": "Serdouk",
        "url": "https://www.reddit.com/r/linguistics/comments/8utmra/how_to_best_respond_to_linguistic_pseudoscience/",
        "text": "I'm asking because both on and offline, I experience misleading/fallacious arguments coming from people who claim to have a background in linguistics making claims like:\n\n- Hindi and Urdu have separate unrelated origins.\n\n- Arabic has not changed since the 10th century.\n\nIn addition to folk/incorrect representation of etymologies and language evolution (the language/s in question being colloquial Arabic).\n\nI don't see that the \"hammering with facts\" tends to work very well since studies show that that actually further bolsters them in their incorrect beliefs. \n\nSo I ask, what is a more passive stance we can take? Or at least one where we can make statements without making the mistake of an argument from authority fallacy since most of us have not conducted actual field studies in populations. \n\nI want to do this without operating under the opposite fallacy of ad hominem/dogmatism by dismissing the other person simply because they may exhibit absurd beliefs about language (i.e. I don't want to assume that every Pakistani I encounter who states that Urdu comes from Farsi while Hindi is Dravidian has a nationalist agenda as opposed to simply being ignorant to the facts).",
        "created_utc": 1530283138,
        "upvote_ratio": ""
    },
    {
        "title": "What languages with the open front unrounded vowel /a/ and not /ä/?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/linguistics/comments/8utjk9/what_languages_with_the_open_front_unrounded/",
        "text": "[deleted]",
        "created_utc": 1530282443,
        "upvote_ratio": ""
    },
    {
        "title": "The STRUT-schwa merger - is it legit?",
        "author": "warlockelder",
        "url": "https://www.reddit.com/r/linguistics/comments/8usmv4/the_strutschwa_merger_is_it_legit/",
        "text": "So I have recently been seein' a lot of people talkin' about the strut-schwa merger, or, in other words, the /ʌ/-/ə/ merger, in American English.  \nNow, the whole thing is apparently the invention of the British phonetician John Wells, who seems to be the only major credible source for its existence per my brief Google search. My problem with this is that in his phonetics blog, he justifies the merger with the fact that he \"feels\" he can distinguish between a stressed /ə/ and /ʌ/ or between a unstressed /ʌ/ and /ə/.  \nKnowing firsthand how one can overthink and misanalyse even regarding their native language, I am kind of sceptical of this - I really haven't seen any evidence or tests that would indicate some people actually make such distinctions, aside from what John Wells \"feels\" is true.  \nBut if there is no contrast - or rather, there aren't any minimal pairs - how can there be a merger? Right now it seems to me that some people take the ambiguous phonemicity of /ʌ/-/ə/ and say they are different sounds, others say they are the same sound, and it all comes down to the fact that more American academics have decided they are the same sound so it is claimed some \"merger\" is at work in America although there is no real sound shift, just people having different notions about an ambiguous contrast between two sounds?  \n  \nOR maybe I am totally off and there is more evidence to the merger, in which case I'll be glad to be proven wrong.  \n  \nP.S. And yes, I am aware /ʌ/ is [ʌ] in only a few certain dialects and that the most common realisation is [ɐ], which coincidentally is a common realisation of schwa in open syllables. That doesn't really change my point. ",
        "created_utc": 1530274281,
        "upvote_ratio": ""
    },
    {
        "title": "The giants of linguistics",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/linguistics/comments/8urwt7/the_giants_of_linguistics/",
        "text": "[deleted]",
        "created_utc": 1530265895,
        "upvote_ratio": ""
    },
    {
        "title": "The giants of linguistics",
        "author": "[deleted]",
        "url": "https://i.redd.it/vb0pr383ww611.jpg",
        "text": "[deleted]",
        "created_utc": 1530265715,
        "upvote_ratio": ""
    },
    {
        "title": "What languages, despite not normally having a locative case, take words such as \"home\" in a sort of locative case?",
        "author": "someguy7734206",
        "url": "https://www.reddit.com/r/linguistics/comments/8uqpcb/what_languages_despite_not_normally_having_a/",
        "text": "In English, we can say \"he is going home\" or \"he is home\". The word \"home\" seems to take a sort of locative case here, because it wouldn't make any sense if we replaced it with anything else: if we used, for example \"New York\", we would have to say \"he is going to New York\" or \"he is in New York\". A similar phenomenon occurs in Russian, which is more inflected yet also uses prepositions for all other places except home: for home, you would say \"он идет домой\" (he is going home) or \"он дома\" (he is home), yet for any other place, you would say \"он идет в Россию\" (he is going to Russia) or \"он в России\" (he is in Russia). Even in Latin, only certain words take the locative case, \"domus\" (home) being one of them, with similar constructions.",
        "created_utc": 1530250800,
        "upvote_ratio": ""
    },
    {
        "title": "Massachusetts Governor Charlie Baker claims that the \"vast majority\" of state troopers are not engaged in defrauding the state--what minimum percentage is required to meet the threshold of \"vast majority\"?",
        "author": "Quantum_Telegraph",
        "url": "https://www.masslive.com/expo/news/erry-2018/06/a3aed718376432/massachusetts_state_police_ove.html",
        "text": "",
        "created_utc": 1530231980,
        "upvote_ratio": ""
    },
    {
        "title": "Oye Oye in the British Courtroom",
        "author": "gardano",
        "url": "https://www.reddit.com/r/linguistics/comments/8uoqoe/oye_oye_in_the_british_courtroom/",
        "text": "So I'm studying Spanish here in Argentina, and my teacher tells me not to bother learning *oir* because it's not really used here. I insisted I've heard *oye* before, only later to realise it was British courtroom scenes.\n\nIs my memory faulty, or is *oye oye* actually used, and what is its origin?",
        "created_utc": 1530231287,
        "upvote_ratio": ""
    },
    {
        "title": "Does someone has this book on applied linguistics?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/linguistics/comments/8uo7j4/does_someone_has_this_book_on_applied_linguistics/",
        "text": "[removed]",
        "created_utc": 1530226551,
        "upvote_ratio": ""
    },
    {
        "title": "I need help with this linguistic exercise!",
        "author": "[deleted]",
        "url": "https://i.redd.it/pzhjwhvolt611.jpg",
        "text": "[deleted]",
        "created_utc": 1530226434,
        "upvote_ratio": ""
    },
    {
        "title": "QUESTION: What is the stutter in this video specifically called?",
        "author": "BoomBoomChuck13",
        "url": "https://www.reddit.com/r/linguistics/comments/8uo68h/question_what_is_the_stutter_in_this_video/",
        "text": "[removed]",
        "created_utc": 1530226242,
        "upvote_ratio": ""
    },
    {
        "title": "I need help with this linguistics exercise!",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/linguistics/comments/8uo4fp/i_need_help_with_this_linguistics_exercise/",
        "text": "[deleted]",
        "created_utc": 1530225835,
        "upvote_ratio": ""
    },
    {
        "title": "Pros and Cons of studying linguistics in a language department?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/linguistics/comments/8umb9r/pros_and_cons_of_studying_linguistics_in_a/",
        "text": "[removed]",
        "created_utc": 1530212012,
        "upvote_ratio": ""
    },
    {
        "title": "Internet linguistics - btw is not just \"by the way\"",
        "author": "huoyong",
        "url": "https://www.reddit.com/r/linguistics/comments/8um3hv/internet_linguistics_btw_is_not_just_by_the_way/",
        "text": "I tried to submit this as a x-post but was deleted.\n\nI saw [this post](https://i.redd.it/beg5pkl5cq611.jpg) on r/all and thought it was quite interesting from a linguistics point of view, it seems that btw can only be used as \"by the way\" when it is used as a pragmatic marker, to me (and it seems that to a lot of the commenters below), something is off. Would you consider this to be ungrammatical? Did btw experience semantic shift? Is there any other phenomena like this or any studies on this?",
        "created_utc": 1530210417,
        "upvote_ratio": ""
    },
    {
        "title": "Internet linguistics - BTW is not just \"By the way\"",
        "author": "[deleted]",
        "url": "https://i.redd.it/beg5pkl5cq611.jpg",
        "text": "[deleted]",
        "created_utc": 1530209780,
        "upvote_ratio": ""
    },
    {
        "title": "Why isn't [ç] (as in huge and human) considered a phoneme in English?",
        "author": "chutoy_",
        "url": "https://www.reddit.com/r/linguistics/comments/8ulrhg/why_isnt_ç_as_in_huge_and_human_considered_a/",
        "text": "[removed]",
        "created_utc": 1530208033,
        "upvote_ratio": ""
    },
    {
        "title": "Need help with a (possibly) folk etymolgy I heard",
        "author": "TheToto1000",
        "url": "https://www.reddit.com/r/linguistics/comments/8ul9yi/need_help_with_a_possibly_folk_etymolgy_i_heard/",
        "text": "[removed]",
        "created_utc": 1530205102,
        "upvote_ratio": ""
    },
    {
        "title": "In the sentence, “My name is Bob.” Is the subject “My” “name” or “you”?",
        "author": "3zby_",
        "url": "https://www.reddit.com/r/linguistics/comments/8ul6un/in_the_sentence_my_name_is_bob_is_the_subject_my/",
        "text": "[removed]",
        "created_utc": 1530204539,
        "upvote_ratio": ""
    },
    {
        "title": "Is there a word in English that describes a situation where everything is going wrong",
        "author": "EldinMusic",
        "url": "https://www.reddit.com/r/linguistics/comments/8ujtga/is_there_a_word_in_english_that_describes_a/",
        "text": "[removed]",
        "created_utc": 1530195402,
        "upvote_ratio": ""
    },
    {
        "title": "Interesting Second Language Accents",
        "author": "Mydogfarts",
        "url": "https://www.reddit.com/r/linguistics/comments/8ujphh/interesting_second_language_accents/",
        "text": "[removed]",
        "created_utc": 1530194646,
        "upvote_ratio": ""
    },
    {
        "title": "Grammar is defined as the morphology of words and the syntax of sentences. Is there a term for \"grammar\" but on the scale of the entire language? Something like the \"diction\", or \"style\" of the entire language.",
        "author": "StevesEvilTwin2",
        "url": "https://www.reddit.com/r/linguistics/comments/8ujie2/grammar_is_defined_as_the_morphology_of_words_and/",
        "text": "[removed]",
        "created_utc": 1530193275,
        "upvote_ratio": ""
    },
    {
        "title": "Is should really the past form of shall?",
        "author": "awhyanyhow",
        "url": "https://www.reddit.com/r/linguistics/comments/8uhzhb/is_should_really_the_past_form_of_shall/",
        "text": "Hi, this might be a weird question but I do not really understand how on earth should can possibly be the past form of shall. I've read some internet threads and the varying answers can be resolved into two main camps\n\nThe first camp keeps saying that should is the past tense of shall, and in British English as well as in formal writings should is still used as a past form of shall. Should/shall just follows the same pattern with can/could and will/would\n\nThe second camp says that shall has no past form and should can't be said to be its past form because when we replace shall with should or should with shall, unlike sentences where we replace will with would or can with could or the other way around, the entire meaning of the sentence changes. There is an abyss between saying I shall go to the school and I should go to the school, still the same in comparion to saying I will go to the school and I would go to the school, and I can go to the school and I could go to the school.\n\nTherefore, the second camp says, not should but would should be taken as the past form of shall and will, and should as independent.\n\nI am really confused. I am a nonnative speaker and yesterday I was reading david hume's essays. He clearly uses should as the past form of shall, but the second camp is also correct in saying that there is literally an abyss in meaning between should and shall nowadays. Besides, doesn't using should as the past form of shall cause ambiguities? I mean, I had to pause several times to figure out if should was used in the sense of suggestion or in the past form of shall as I was reading hume's essays. Doesn't this cause ambiguities?\n\nWhat is your opinion on this?\n\nEdit: david hume example sentence: to some philosophers it appears a matter of surprise, that all mankind, possessing the same nature, and being endowed with the same faculties, should yet differ so widely in their pursuits and inclinations, and that one should utterly condemn what is fondly sought after by another.",
        "created_utc": 1530181234,
        "upvote_ratio": ""
    },
    {
        "title": "Studies on schizophrenia and polyglotism",
        "author": "cacarachi",
        "url": "https://www.reddit.com/r/linguistics/comments/8uhxez/studies_on_schizophrenia_and_polyglotism/",
        "text": "[removed]",
        "created_utc": 1530180691,
        "upvote_ratio": ""
    },
    {
        "title": "Which current language group is closest to PIE?",
        "author": "cacarachi",
        "url": "https://www.reddit.com/r/linguistics/comments/8uhgio/which_current_language_group_is_closest_to_pie/",
        "text": "[removed]",
        "created_utc": 1530174493,
        "upvote_ratio": ""
    },
    {
        "title": "Questions about American Sign Language Phonemes and American sign language translation.",
        "author": "Modestcomedian",
        "url": "https://www.reddit.com/r/linguistics/comments/8uhbku/questions_about_american_sign_language_phonemes/",
        "text": "Hi,\n\nJust to give some background I'm an engineering student who is trying to design an application that can translate words in ASL into English. \n\nFrom my understanding, the basic building block of a word in American Sign Language (or any language for that matter) is the phoneme, and the types of phonemes in ASL are hand shape, hand movement, hand location, hand orientation, and Nonmanual signs. \n\nSo if we know all possible types of handshapes, hand locations, hand movements, etc... is it then possible to then create any word in ASL?\n\nIs there a definitive list of all possible phonemes (not phoneme types) in ASL?\n\nWhat is the relationship between words in ASL and words in English? For example, I know in mandarin \"笑 (Xiào)\" can be the direct translation for \"laugh\" in English (which is a one-to-one relationship), compared to \"happy\" in English which has the translation to \"快乐 (Kuài lè)\" in mandarin (which is a one-to-many relationship). Heck there are even words that don't exist in English that exists in other languages.\n\nThanks in advance!\n",
        "created_utc": 1530173115,
        "upvote_ratio": ""
    },
    {
        "title": "What do you think the linguistic conditions of the future will be like?",
        "author": "aretheyaliens",
        "url": "https://www.reddit.com/r/linguistics/comments/8ugzlz/what_do_you_think_the_linguistic_conditions_of/",
        "text": "[removed]",
        "created_utc": 1530168897,
        "upvote_ratio": ""
    },
    {
        "title": "The Lord's prayer in proto germanic - does this look legit?",
        "author": "Raffaele1617",
        "url": "https://www.reddit.com/r/linguistics/comments/8ugrm8/the_lords_prayer_in_proto_germanic_does_this_look/",
        "text": "Here's the text I found:\n\nUnseraz fader, þū ini himinai,\nWīhijaþau þīna namô.\nKwemadau þīna rīkiją\nwerþadau þīnaz wiljô,\nswē ini himinai auk ana erþōi.\nGeb unsiz unsera braudą gadagalīka heuradagō.\nFrageb-uh unsiz unserôz sundijôz,\nSwaswē wīz auk unseraimaz sundijōnamaz fragebamaz.\nAuk ne bring uns du kustōngai\nAuk lausī uns abu ubilai.\n\nDoes this look like it follows what we know about proto germanic? That is, is it as legit as, say, Schleicher's fable?",
        "created_utc": 1530165810,
        "upvote_ratio": ""
    },
    {
        "title": "Where to start?",
        "author": "KaraWSR",
        "url": "https://www.reddit.com/r/linguistics/comments/8ugfaq/where_to_start/",
        "text": "[removed]",
        "created_utc": 1530161252,
        "upvote_ratio": ""
    },
    {
        "title": "Theory about the Origin of Japanese, Ainu, and other Asiatic Languages",
        "author": "Evrovia",
        "url": "https://www.reddit.com/r/linguistics/comments/8ugenu/theory_about_the_origin_of_japanese_ainu_and/",
        "text": "[removed]",
        "created_utc": 1530161027,
        "upvote_ratio": ""
    },
    {
        "title": "Was \"did not they?\" ever grammatical in English?",
        "author": "amelaine_",
        "url": "https://www.reddit.com/r/linguistics/comments/8ug896/was_did_not_they_ever_grammatical_in_english/",
        "text": "I'm reading *Persuasion* and a character says this sentence of dialogue: \"they called here afterwards, did not they?\" Obviously this sounds ungrammatical to me, a 21st century American. The only two ways I would write this phrase would be \"didn't they?\" or \"did they not?\" Is it possible that that Austen actually had her character saying the contraction and the phrase \"did not he/she/it/etc.\" was actually never used? It seems unlikely that we had once had 2 ways to say it without a contraction--with the \"not\" before and after the subject--and we lost one of them so completely that it sounds ungrammatical while the other one is still very common.\n\nThis would be similar to the modern American English phrase \"trying to\": though it's frequently said as a contraction (\"tryna\"), it's typically never written as one, unless the author is intentionally trying to display dialect. Austen's character is a young, easily excited woman who follows all the latest trends, so it makes sense that she would use a contraction before it was appropriate to write it into a work of literature. I think the only reason this phrase violates the word order rules of English, and places the word \"not\" before the subject in a question, is because it was condensed into the word \"didn't.\" Is there research on this?",
        "created_utc": 1530158864,
        "upvote_ratio": ""
    },
    {
        "title": "What do you call this- \"idiom\", maybe?",
        "author": "Terpomo11",
        "url": "https://www.reddit.com/r/linguistics/comments/8ufqfy/what_do_you_call_this_idiom_maybe/",
        "text": "[removed]",
        "created_utc": 1530154080,
        "upvote_ratio": ""
    },
    {
        "title": "Why do so many English-language names for girls end in the “ee” sound?",
        "author": "sawitontheweb",
        "url": "https://www.reddit.com/r/linguistics/comments/8ueo5a/why_do_so_many_englishlanguage_names_for_girls/",
        "text": "[removed]",
        "created_utc": 1530144522,
        "upvote_ratio": ""
    },
    {
        "title": "Time perception among English-speaking users",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/linguistics/comments/8ue5wl/time_perception_among_englishspeaking_users/",
        "text": "[deleted]",
        "created_utc": 1530139900,
        "upvote_ratio": ""
    },
    {
        "title": "New student. Overwhelmed. Any advice?",
        "author": "LtlGldnBallofAwesome",
        "url": "https://www.reddit.com/r/linguistics/comments/8udxjt/new_student_overwhelmed_any_advice/",
        "text": "[removed]",
        "created_utc": 1530137931,
        "upvote_ratio": ""
    },
    {
        "title": "Undocumented language?",
        "author": "namnajitet",
        "url": "https://www.reddit.com/r/linguistics/comments/8udgt4/undocumented_language/",
        "text": "[removed]",
        "created_utc": 1530134314,
        "upvote_ratio": ""
    },
    {
        "title": "Why is Proto Slavic grammar so complex while there is no written records of any Slavic from the Preglagolic times?",
        "author": "cacarachi",
        "url": "https://www.reddit.com/r/linguistics/comments/8ubyoa/why_is_proto_slavic_grammar_so_complex_while/",
        "text": "[removed]",
        "created_utc": 1530123344,
        "upvote_ratio": ""
    },
    {
        "title": "In English, when we need to use multiple adjectives we put them in a very specific order. Why is this, how did it come about and do other languages do the same?",
        "author": "tinylittlesocks",
        "url": "https://www.reddit.com/r/linguistics/comments/8ubt6w/in_english_when_we_need_to_use_multiple/",
        "text": "I've always wondered about this. English has quite a specific order for adjectives, and anything out of place can sound  pretty odd. \n\n* Opinion\n* Size\n* Physical quality\n* Shape\n* Age\n* Colour\n* Origin\n* Material\n* Type \n* Purpose\n\nWhere does this order come from? Why is it like this? What do other languages do with their adjectives?\n\n",
        "created_utc": 1530122302,
        "upvote_ratio": ""
    },
    {
        "title": "Are there any theories about the origin of Pirahã, or at least the origin of its unique features?",
        "author": "xoh-",
        "url": "https://www.reddit.com/r/linguistics/comments/8ubbsa/are_there_any_theories_about_the_origin_of_pirahã/",
        "text": "As I understand it, it is lacking a significant number of core features found in other languages (even ignoring debated ones such as lack of recursion), for example:\n\n• Lack of numbers beyond 2\n\n• Lack of native pronouns \n\n• Lack of lexical distinction between 'mother' and 'father'\n\n• Very small phoneme inventory\n\n• Lack of colour words\n\nI'm assuming it can't be a coincidence that one language would have all these extremely unique features (or lack thereof), i.e. the cause of the lack of one of the features must be tied with the lack of the others.\n\nWhat are some possible explanations? I assume, if it has a normal linguistic ancestry, it probably had most of these features at some point? (Simply because I find it hard to believe that a language could have spread from Asia all the way down the Americas without picking up these features at some point).\n\nSo then it must have lost the features? But why would it lose them all? Some cultural practice that lead to significant linguistic change (similar to taboo associations in some cultures)?\n\nCould it perhaps be a \"new\" language, maybe originating from a group of deaf people/abandoned children or something, who didn't have any language originally? Might this also explain the uncommon sounds, as well as hummed/whistled registers?\n\nEdit: \n\nI'll also add that bizarre features also seem to exist in 'connected' languages. Pirahã and another Amazon language, Wari, are the only languages with [t͡ʙ̥] according to wikipedia, presumably a result of some historic connection. Wari is described as having \"one of the world's most asymmetrical vowel systems\", with 5 front and 1 back vowel.",
        "created_utc": 1530118985,
        "upvote_ratio": ""
    },
    {
        "title": "Transfer features French —&gt; Hebrew",
        "author": "HoldenCaulfield0114",
        "url": "https://www.reddit.com/r/linguistics/comments/8u9poe/transfer_features_french_hebrew/",
        "text": "I’m curious what are some of the clear markers of speech French speakers will carry with them when they speak Hebrew. I hope I’m not being too specific here.\n\nP.S. they should really have a database out there where you plug in L1 and L2 to check out transfer features... just saying I think that would be rad ! ",
        "created_utc": 1530107003,
        "upvote_ratio": ""
    },
    {
        "title": "Is “crap” a curse word anymore?",
        "author": "xXx_LI_xXx",
        "url": "https://www.reddit.com/r/linguistics/comments/8u98ud/is_crap_a_curse_word_anymore/",
        "text": "[removed]",
        "created_utc": 1530102950,
        "upvote_ratio": ""
    },
    {
        "title": "Higher Ed Wednesday - June 27, 2018",
        "author": "AutoModerator",
        "url": "https://www.reddit.com/r/linguistics/comments/8u9237/higher_ed_wednesday_june_27_2018/",
        "text": "Hello all and welcome to another edition of Higher Ed Wednesday, an expansion of the Grad School Wednesday posts. This is a thread where prospective students can ask questions about university programs at any level, either general (e.g. \"How often should a grad student present at conferences?\") or particular (e.g. \"Which schools in North America have strong programs in Korean linguistics?). It's also a chance for current students to find out information about other programs (e.g. \"How many of you have reading lists for your comprehensive exams?\") or general university survival (e.g. \"Is it a really bad idea to change my thesis supervisor if we don't click?\"). So ask away!\n",
        "created_utc": 1530101182,
        "upvote_ratio": ""
    },
    {
        "title": "Autism spectrum accent",
        "author": "wafflywords",
        "url": "https://www.reddit.com/r/linguistics/comments/8u8z9v/autism_spectrum_accent/",
        "text": "It is reasonably common to find mention of speech patterns that are common for people on the Autism spectrum, such a characteristic tone, but generally the texts I see have been written by health professionals or educators, not linguists. Has anybody seen an analysis of frequent speech features that has been written by a linguist?  I am aware that Autism is a spectrum and so the speech features of one person will be different from those of another person, but I was wondering if there was an analysis of common features. ",
        "created_utc": 1530100424,
        "upvote_ratio": ""
    },
    {
        "title": "Book about milestones of child language aquisition",
        "author": "ElegantRun",
        "url": "https://www.reddit.com/r/linguistics/comments/8u83ru/book_about_milestones_of_child_language_aquisition/",
        "text": "Hi everyone,\n\nI am looking for a  book (or reference) that explicitly states the language milestones (since birth), it's goals and all details that are part of a milestone. For example, what errors children make, how they manage to overcome it and the specific way that they converse. I would really appreaciate if you could also give me references about child conversation in particular milestone. \n\nThanks a lot in advance!",
        "created_utc": 1530090418,
        "upvote_ratio": ""
    },
    {
        "title": "What causes regional accents to develop in the US?",
        "author": "-Mamba-",
        "url": "https://www.reddit.com/r/linguistics/comments/8u6mft/what_causes_regional_accents_to_develop_in_the_us/",
        "text": "[removed]",
        "created_utc": 1530073084,
        "upvote_ratio": ""
    },
    {
        "title": "Thought this would be interesting, tell us what you call these little ones and where you grew up!",
        "author": "[deleted]",
        "url": "https://i.redd.it/npa2fkc3mg611.jpg",
        "text": "[deleted]",
        "created_utc": 1530068632,
        "upvote_ratio": ""
    },
    {
        "title": "How do I make the sound [t̴]?",
        "author": "3zby_",
        "url": "https://www.reddit.com/r/linguistics/comments/8u5pd0/how_do_i_make_the_sound_t/",
        "text": "[removed]",
        "created_utc": 1530064282,
        "upvote_ratio": ""
    },
    {
        "title": "Is there a reason why English-speakers frequently skip the initial word in some sentences?",
        "author": "R_towers",
        "url": "https://www.reddit.com/r/linguistics/comments/8u55oz/is_there_a_reason_why_englishspeakers_frequently/",
        "text": "Hi, r/linguistics. I've had this doubt on my mind lately about why English speakers tend to skip the first word on some sentences. Kind of like when anyone would say \"It's been a long time since I last saw you\" they would start the sentence skipping the \"it’s\", and so it sounds like \"Been a long time since I last saw you\".\n\nIs there a particular reason as to why that happens? Does this phenomenon have a name? Am I looking too much into it?\n\nThanks in advance!",
        "created_utc": 1530059268,
        "upvote_ratio": ""
    },
    {
        "title": "Leibniz’s Characteristica Universalis",
        "author": "ivnshvrk",
        "url": "https://www.reddit.com/r/linguistics/comments/8u4l2e/leibnizs_characteristica_universalis/",
        "text": "[removed]",
        "created_utc": 1530054210,
        "upvote_ratio": ""
    },
    {
        "title": "What’s the difference between grammatical aspect, tense, and mood?",
        "author": "3zby_",
        "url": "https://www.reddit.com/r/linguistics/comments/8u3vxf/whats_the_difference_between_grammatical_aspect/",
        "text": "[removed]",
        "created_utc": 1530048516,
        "upvote_ratio": ""
    },
    {
        "title": "Language to learn",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/linguistics/comments/8u2ggp/language_to_learn/",
        "text": "[deleted]",
        "created_utc": 1530037976,
        "upvote_ratio": ""
    },
    {
        "title": "Post your idiolect's vowel chart!",
        "author": "[deleted]",
        "url": "https://i.redd.it/ul9h3n3s2e611.png",
        "text": "[deleted]",
        "created_utc": 1530037952,
        "upvote_ratio": ""
    },
    {
        "title": "Soporific Prose: \"Delivering Government Solutions in the 21st Century - Reform Plan and Reorganization Proposals\" (Executive Office of the POTUS)",
        "author": "GoetzKluge",
        "url": "https://www.documentcloud.org/documents/4548493-Delivering-Government-Solutions-in-the-21st.html",
        "text": "",
        "created_utc": 1530037748,
        "upvote_ratio": ""
    },
    {
        "title": "Does anyone have examples of foreign phonemes used in loanwords in Italian?",
        "author": "cyberpunking",
        "url": "https://www.reddit.com/r/linguistics/comments/8u28b4/does_anyone_have_examples_of_foreign_phonemes/",
        "text": "For example in english you often have the word *loch* given as an example of the /x/ sound, which is not really used in english but many english speakers know how it should sound because of that word, which is a loanword from scottish gaelic afaik.\n\nDoes anyone have examples of this phenomenon occuring in italian? are there any loanwords i might be able to use to help an italian speaker understand the pronunciation of rare phonemes? especially vowels?",
        "created_utc": 1530036313,
        "upvote_ratio": ""
    },
    {
        "title": "Where can I learn French Canadian?",
        "author": "FangFingersss",
        "url": "https://www.reddit.com/r/linguistics/comments/8u1eb1/where_can_i_learn_french_canadian/",
        "text": "[removed]",
        "created_utc": 1530030417,
        "upvote_ratio": ""
    },
    {
        "title": "Looking for scholary works about English historical linguistics",
        "author": "ChimcharTrainer",
        "url": "https://www.reddit.com/r/linguistics/comments/8tztwc/looking_for_scholary_works_about_english/",
        "text": "I'm in my second year at university and I study English and Dutch linguistics. I wanted to do some reading during the summer about English historical linguistics. I'm especially interested in the Old and Middle English periods. Any recommendations or must reads?",
        "created_utc": 1530018212,
        "upvote_ratio": ""
    },
    {
        "title": "Ancient Japanese/Chinese (?) Slab Found at Construction Site in Sakhalin, Russia",
        "author": "Artsz",
        "url": "https://www.reddit.com/r/linguistics/comments/8tyu52/ancient_japanesechinese_slab_found_at/",
        "text": "[removed]",
        "created_utc": 1530007766,
        "upvote_ratio": ""
    },
    {
        "title": "According to google, \"lol\" was more widely used in the 1800s than today. This is an error, right?",
        "author": "iamfromreallife",
        "url": "https://i.imgur.com/8Odevvm.png",
        "text": "",
        "created_utc": 1530007666,
        "upvote_ratio": ""
    },
    {
        "title": "Web app/site that lists derivational forms of a given word?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/linguistics/comments/8txo3b/web_appsite_that_lists_derivational_forms_of_a/",
        "text": "[deleted]",
        "created_utc": 1529993268,
        "upvote_ratio": ""
    },
    {
        "title": "Can anyone tell me what language this is?",
        "author": "HonestAboutExpertise",
        "url": "https://www.reddit.com/r/linguistics/comments/8tv6uv/can_anyone_tell_me_what_language_this_is/",
        "text": "[removed]",
        "created_utc": 1529969128,
        "upvote_ratio": ""
    },
    {
        "title": "Can anyone tell me what language this is? My friend found this posted in his apartment laundry room",
        "author": "HonestAboutExpertise",
        "url": "https://imgur.com/a/zCjtWlo",
        "text": "",
        "created_utc": 1529968510,
        "upvote_ratio": ""
    },
    {
        "title": "Future AMA with Professor Sali Tagliamonte",
        "author": "fc235",
        "url": "https://www.reddit.com/r/linguistics/comments/8tuyz2/future_ama_with_professor_sali_tagliamonte/",
        "text": "Hey Linguistics-loving friends!\n\nI have managed to convince Professor Tagliamonte to do an AMA later this summer, exact date TBA. She’s really busy with having become the chair of the University of Toronto’s Linguistics department so it may be with short notice that the AMA takes place, but I thought I would let everyone know so that you can keep it in mind in case you think of any questions!\n\nNot only is she incredible in the field of Sociolinguistics, she also has 5 kids. She’s a true icon of being able to do it all! So keep note of any questions you might have for when it’s announced!",
        "created_utc": 1529967230,
        "upvote_ratio": ""
    },
    {
        "title": "Need Help",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/linguistics/comments/8tuxjk/need_help/",
        "text": "[removed]",
        "created_utc": 1529966878,
        "upvote_ratio": ""
    },
    {
        "title": "Are there any modern 'pidgin' or 'creole' languages evolving in Europe?",
        "author": "PomoAndroid",
        "url": "https://www.reddit.com/r/linguistics/comments/8tspv2/are_there_any_modern_pidgin_or_creole_languages/",
        "text": "I hope those aren't offensive terms- they're the ones I'm familiar with.\n\nSince the EU's adoption of open borders and right-to-work throughout Europe there's been a lot of population movement between members of language groups. I'm sure it's not unusual for a citizen of a country like Spain or Portugal to have worked in Germany, France and England over the course of a career, picking up bits of language in each- fertile ground for the organic growth of a creole. Has anything like this been observed in the EU? ",
        "created_utc": 1529950050,
        "upvote_ratio": ""
    },
    {
        "title": "Why in English are imaginary tenses in the past tense?",
        "author": "awhyanyhow",
        "url": "https://www.reddit.com/r/linguistics/comments/8tsol6/why_in_english_are_imaginary_tenses_in_the_past/",
        "text": "[removed]",
        "created_utc": 1529949795,
        "upvote_ratio": ""
    },
    {
        "title": "special forms for Passive Perfect crosslinguistically.",
        "author": "merijn2",
        "url": "https://www.reddit.com/r/linguistics/comments/8tsgdc/special_forms_for_passive_perfect/",
        "text": "My specialist language is Zulu, and Zulu is an agglutinative language. Following the verb stem in Zulu are first the so-called verbal extensions, which change the valency of verb, and then what people call the Final Vowel, which is a morpheme that varies with tense, aspect and polarity, and often, but not always is a vowel. However, one of the extensions is the passive *-w-*, and if the passive is combined with the perfect aspect marker *-ile* they merge into one morpheme, *-iwe*, so *-cul-* means \"sing\", *-cul-w-* means \"be sung\" and \"have been sung\" is *-cul-iwe* rather than the expected *\\*-cul-w-ile*. Granted, the perfect is  someteimes irregular in Zulu, and in some verbs the perfect is formed in a different semi-regular way, namely with *-e* and raising the last vowel of the verb if it is an /a/ , for instance *-bulal-* \"kill\" *-bulel-e* \"have killed\", and some extensions use this second way of forming the perfect, but the way the passive perfect is formed is specific for the passive. This got me wondering to what extent this is an accident, or if the passive and perfect are a special combination in more languages. When I was a student I did one paper about Indonesian, and I vaguely recall that Indonesian verbs can have a special perfect passive perfect affix, but I am not sure, and a quick Wikipedia browsing and googling doesn't reveal quite what affix that might have been. But even in languages that are more familiar to me there is often something special about the perfect passive. In all Romance and Germanic languages there is a passive perfect participle, that if used as an adjective has perfect passive meaning. And except Scandinavian languages, that is the only passive form a verb has.\n\nIt also makes sense that the perfect and passive often have special forms. Your prototypical transitive verb expresses that the agent does something that changes the patient: if you steal something you change the ownership of the thing that is stolen. The perfect aspect often expresses a state that is a result of something that happened earlier, and since the patient of a transitive verb often undergoes a change from one state to another, it would make sense if perfect aspect is often combined with passive voice. And if things are often combined it is more likely that that combination has a special form. And it also makes sense that this is expressed with an adjective in many languages, because adjectives are often used to express states.\n\nAnyway, this is just me rambling, my question is, do other languages also have special forms for the passive perfect? Or am I just overgeneralizing over too few languages? And if there is something special about the passive perfect, is my reasoning correct why that is correct?",
        "created_utc": 1529948127,
        "upvote_ratio": ""
    },
    {
        "title": "The verb equivalent to \"to not know\" in different languages",
        "author": "sungmoki",
        "url": "https://www.reddit.com/r/linguistics/comments/8tri39/the_verb_equivalent_to_to_not_know_in_different/",
        "text": "Howzit everyone,\n\nWell I'm Korean (born and raised), and I speak English at a native level and I've been studying Spanish for 3 years.\n\nOne thing that just popped to my mind while learning different languages is that as far as I know, the Korean language is the only language that has a separate word for \"to not know\" which is \"모르다\" in Korean.\n\nWith help of online dictionaries and Google Translate, I looked up the equivalent verb to \"to not know\" in different languages (that is, Mandarin, German, French, Russian, and Hindi) and none of them had an independent verb that meant \"to not know.\"\n\ne.g. \"no saber\" (Span.), \" अनजान होना \" (Hindi), etc.\n\n\"To not know\" in all of the languages that I looked up were all derived from some form of adverb meaning \"not\" and a verb meaning \"to know\"; meanwhile, in Korean, 모르다 is just one verb in itself meaning \"not to know.\"\n\nI hope you all found this interesting, and if you know of any explanations or theories related to this, please let me know!\n\n\\*\\*edit) The argument that 모르다 is originated from 못 알다 (negation of 'to know') is not based on profound research. Etymology in the Korean language (especially pure Korean lexis like 모르다) is hard to research because Korean is considered as an isolate; on the other hand, it's relatively easy to research the etymology of English words, for instance, because their origin is well known in many cases (e.g. Latin, old English). The National Korean Language Institute does not approve of the argument that 모르다 came from a negation of 'to know.",
        "created_utc": 1529941254,
        "upvote_ratio": ""
    },
    {
        "title": "How do we know Proto-Germanic borrowed *spendaną (&gt; English \"spend\") from Latin expendere, rather than deriving it directly from PIE *spend- \"to libate\"?",
        "author": "ilovethosedogs",
        "url": "https://www.reddit.com/r/linguistics/comments/8tr7im/how_do_we_know_protogermanic_borrowed_spendaną/",
        "text": "The semantics are certainly closer to the Latin, but I can easily imagine \"libate\" becoming \"spend\" over time, since they're not very different semantically either.\n\nIs there a paper where this borrowing was definitively demonstrated over inheritance? Or is it just assumed because the *-d hasn't undergone Grimm's Law (&gt; *spent-)?",
        "created_utc": 1529938965,
        "upvote_ratio": ""
    },
    {
        "title": "Name question! Is there a difference between the name Morgan spelt with an “a” versus the name Morgen spelt with an “e” ?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/linguistics/comments/8tr0bx/name_question_is_there_a_difference_between_the/",
        "text": "[removed]",
        "created_utc": 1529937469,
        "upvote_ratio": ""
    }
]