[
    {
        "title": "What exactly are the difference between clicks and implosives?",
        "author": "weirdcrowdfundQthrow",
        "url": "https://www.reddit.com/r/linguistics/comments/zc2esq/what_exactly_are_the_difference_between_clicks/",
        "text": "From what I gather, they're both produced via an ingressive mechanism - when producing them myself, it feels like the only real difference is the amount of \"suction\" force involved, and that they can be blurred together quite a bit.\n\nTo me it seems quite strange that they're even considered separate things - if somebody told me that one feature tended to evolve from the other, I wouldn't be the slightest bit surprised, but it doesn't seem to be that way.\n\nWhat exactly am I missing here?",
        "created_utc": 1670134732,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can We Separate Art From the Artist? - Adarsh Badri",
        "author": "UnapologeticAcademic",
        "url": "https://adarshbadri.me/separate-art-from-the-artist/",
        "text": "",
        "created_utc": 1670130891,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why we should NOT preserve endangered/indigenous languages. (I need essay paper help)",
        "author": "_ibanii",
        "url": "https://www.reddit.com/r/linguistics/comments/zby14n/why_we_should_not_preserve_endangeredindigenous/",
        "text": "Hello everyone, this is not a debate on a certain issue rather than that, I need your help people. Currently I am writing an essay paper on a topic of \"Should we preserve endangered languages\" and I have gathered more than enough evidence for the affirmative side, however it's a different story when it comes to the negative perspective aka (we shouldn't preserve endangered languages). If you know of any good reliable sources on this topic can you please pm me them or attach them down below. Any source counts, thank you!",
        "created_utc": 1670121067,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why did case marking remain in English pronouns?",
        "author": "minecon1776",
        "url": "https://www.reddit.com/r/linguistics/comments/zbxs37/why_did_case_marking_remain_in_english_pronouns/",
        "text": "pronouns have case marking in English like he vs him and she vs her. I am aware Old English had case marking on all nouns and modern English lost this feature. Why did English not lose case marking in pronouns as well? I have also noticed that other languages without case marking on most nouns can tend to still have it on pronouns (Spanish for example).",
        "created_utc": 1670120344,
        "upvote_ratio": 1.0
    },
    {
        "title": "Use \"species\" instead of 'Race' in Dungeons &amp; Dragons",
        "author": "mitrerapport",
        "url": "https://www.dndbeyond.com/posts/1393-moving-on-from-race-in-one-d-d",
        "text": "",
        "created_utc": 1670108101,
        "upvote_ratio": 1.0
    },
    {
        "title": "Difference in word-final *-n and *-m in Slavic",
        "author": "stlatos",
        "url": "https://www.reddit.com/r/linguistics/comments/zbt1og/difference_in_wordfinal_n_and_m_in_slavic/",
        "text": "The description of word-final \\*-n and \\*-m in Slavic found in\n\n[https://www.academia.edu/322559/Proto\\_Indo\\_European\\_final\\_nasals\\_in\\_Slavic](https://www.academia.edu/322559/Proto_Indo_European_final_nasals_in_Slavic)\n\ntakes \\*-m &gt; -0 as earlier than \\*-n &gt; +nasal.  This seems to be exactly the opposite order of what the evidence given shows (and other evidence not given).  It seems that the example of \\*-m &gt; n- across word boundaries (and I’d add \\*som- &gt; \\*son- / \\*sum- &gt; OCS sǫ- / sъ- (compare \\*som- &gt; Skt. sam- ‘with/ having/together/same’)), show that some \\*m became \\*n, possibly all word-finally and before dental C (or perhaps any C, see below).  This suggests that \\*-n &gt; +nasal was earlier (and happened at the same time as the change of syllable-final \\*-n &gt; +nasal within words), then \\*-om &gt; \\*-um, then \\*-m &gt; \\*-n, then (a few) word boundaries changed in set phrases, then these new \\*-n &gt; 0 with no nasalization (perhaps at the same time as all other syllable-final consonants that were deleted).  The loss of -n with nasalization at a time when the other nasal(s) remained is not odd, as many other languages have shown one nasal, whether n, ng, or m, lost in places where others are retained, whether with nasalization or not.\n\nJust as word-final and syllable-final \\*-n are connected above, so should word-final and syllable-final \\*-m.  This would allow an explanation for some similar oddities, such as \\*k\\^mtom &gt; \\*sumtom &gt; \\*suto(d) &gt; sъto ‘hundred’ (with final -o from analogy with other neuters).  If most \\*mt &gt; \\*nt but \\*mt was retained here (maybe due to \\*sumtom having 2 syllable-final \\*-m’s in a row, but also possibly simply optional) then the lack of nasalization would be explained by the same change explaining the difference in nasalization for \\*-m and \\*-n.  The fact that most historic cases of \\*Vm became \\*V+nasal within words makes it likely that most Slavic examples of \\*mC became \\*nC before the changes above.  Even \\*mb and \\*mp &gt; \\*nb and \\*np are possible (compare similar changes, apparently optional, in Armenian).  This could be more evidence of the retention of mb being less important than simplification of -m &gt; -n in Slavic at the time (maybe with important implications for whether some tendencies and features are universally more important in determining language change).  This would also be evidence in favor of OCS sъto ‘hundred’ being native, not borrowed oddly from Iranian, etc.",
        "created_utc": 1670107347,
        "upvote_ratio": 1.0
    },
    {
        "title": "Idk if this is the right place but",
        "author": "Oighreach6",
        "url": "https://www.reddit.com/r/linguistics/comments/zbsgnb/idk_if_this_is_the_right_place_but/",
        "text": "[removed]",
        "created_utc": 1670105900,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to use proper pronouns with stuffed animals",
        "author": "mitrerapport",
        "url": "https://nypost.com/2022/12/03/teacher-skye-tooley-uses-stuffed-animals-to-teach-kids-lesson-on-being-gender-fluid/",
        "text": "",
        "created_utc": 1670104716,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is there a linguistic term to describe a misspelling of a eponym that becomes the official spelling overtime?",
        "author": "thethpunjabi",
        "url": "https://www.reddit.com/r/linguistics/comments/zbrho8/is_there_a_linguistic_term_to_describe_a/",
        "text": "There is a place in Pakistan that was originally named Qila Mihan Singh, but overtime the 'h' in Mihan was dropped and it is now referred to as Qila 'Mian' Singh and this has become the official name. Is there a linguistic term to refer to this phenomenon?",
        "created_utc": 1670103520,
        "upvote_ratio": 1.0
    },
    {
        "title": "Have you ever analysed international school accents?",
        "author": "Long-Fold-7632",
        "url": "https://www.reddit.com/r/linguistics/comments/zbqolv/have_you_ever_analysed_international_school/",
        "text": "[removed]",
        "created_utc": 1670101566,
        "upvote_ratio": 1.0
    },
    {
        "title": "Op-Ed: The term 'gaslighting' is everywhere, but are we using it the right way?",
        "author": "BlankVerse",
        "url": "https://www.latimes.com/opinion/story/2022-12-03/gaslighting-language-meaning-culture-linguistics-merriam-webster",
        "text": "",
        "created_utc": 1670099632,
        "upvote_ratio": 1.0
    },
    {
        "title": "I need help with X- tree",
        "author": "Melancholicdiana",
        "url": "https://www.reddit.com/r/linguistics/comments/zboafj/i_need_help_with_x_tree/",
        "text": "Hi everyone.\nI need some help with X- tree. I need to draw it for this sentence: The tall french handsome man.\nThe problem is i still can not distinguish between the adjuncs and adjectives so i don't know if i should draw several AP or use a branch of x' for adjunc.\nAnd another question, for adjuncs, can we draw them to the left of x branch? Or it must be to the right for some reason? If so, how should i draw the rest of the tree without changing the sequence of words?\nHave the same problem with adverbs too. ):\n\nP.S: i guess you will ask why i don't ask it from our teacher. Bc the tasks for this class are supposed to be challenging and they are always about the next session's lesson. So we probably have not learnt what we need for solving it. The goal is to research and ask and get engaged with the whole thing.",
        "created_utc": 1670095607,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to distinguish if there’s goose-foot-strut vowel split in an English accent?",
        "author": "IWantABoyfriendMaybe",
        "url": "https://www.reddit.com/r/linguistics/comments/zblgxc/how_to_distinguish_if_theres_goosefootstrut_vowel/",
        "text": "Phonetics homework. Help!",
        "created_utc": 1670088439,
        "upvote_ratio": 1.0
    },
    {
        "title": "Study and Studio",
        "author": "Anonycat14",
        "url": "https://www.reddit.com/r/linguistics/comments/zbejtr/study_and_studio/",
        "text": "Hi guys, Could you tell me why the word (u) in\"Study and Studio\" different in pronouncing? the word Study is sounds/A/ but Studio is sounds/u/",
        "created_utc": 1670068260,
        "upvote_ratio": 1.0
    },
    {
        "title": "How does one realize or perceive word-inital contrasts between /p/, /k͡p/, and /kp/ in isolation?",
        "author": "NeverBefore800",
        "url": "https://www.reddit.com/r/linguistics/comments/zb8i16/how_does_one_realize_or_perceive_wordinital/",
        "text": "I am under the impression that /k͡p/ in many languages involves a labial release after the velar has just begun releasing. If so, would slight velarization of the following vowel be the main cue in perceiving a difference from /p/, word-initially, in isolation from other words? Also, would the /k/ in /kp/ have to be released before closing the /p/ in order for it to be normally distinguishable from /k͡p/, or would different timing normally be enough?",
        "created_utc": 1670044774,
        "upvote_ratio": 0.99
    },
    {
        "title": "Armenian mxrčem ‘immerse/dip’",
        "author": "stlatos",
        "url": "https://www.reddit.com/r/linguistics/comments/zb2w17/armenian_mxrčem_immersedip/",
        "text": "Armenian mxrčem ‘immerse/dip’, mkrtem ‘immerse/dip / bathe/baptize’ are obviously related.  Older \\*-te- &gt; -te- vs. \\*-tye- &gt; -če- seems likely (both types of verbs were comon in PIE), but why -x- vs. -k-?  This seems similar to a possible change of 2 fricatives to fricative-stop (or perhaps a change of 3 fricatives in 3 syllables in a row to fricative-stop-fricative (see below)) for \\*h2aukwtro- &gt; MArm. akutʿ (akuth) ‘cookstove’, \\*tetketro-? &gt; tʿakartʿ (thakarth) ‘trap, snare, net’.  Seeing both -x- and -k- in mxrčem and mkrtem might be more evidence of the optional nature of such a change, as previously theorized.\n\nDepending on the nature of the change, this might require mxrčem and mkrtem to come from an older form begining with \\*mx- or \\*mh-, etc.  Looking for evidence of such, consider the relations:\n\nmux ‘smoke/tempering’\n\n\\*muxemi &gt; mxem ‘plunge in / bathe’\n\n\\*murxutyemi &gt; mxrčem ‘immerse/dip’\n\n\\*murkutemi &gt; mkrtem ‘immerse/dip / bathe/baptize’\n\nThe metathesis of -r- in some of these is proposed to explain the relationship with some words with -r- below (r &gt; 0 is also seen in several other words, with no explanation or shared environment).\n\nThe stages of meaning make sense if the changes ‘smoke &gt; steam &gt; (steam from) dipping (hot metal into water)’ existed.  An original mux ‘smoke’ would likely be related to MArm. mšuš ‘fog’.  If from older \\*mšurš / \\*mxurx ‘smoke / fog’ was the source of mux ‘smoke’ and mšuš ‘fog’ it could show an alternation š / x probably also seen in \\*trsmi-mi &gt; tʿaršamim / tʿaṙamim ‘wither’ (compare \\*trsmi- &gt; MIrish tirimm ‘dry’).  That older \\*-rx- &gt; \\*-rr- &gt; ṙ happened is probably also shown by \\*derh2- &gt; Greek dérō ‘flay/skin’, Arm. teṙem ‘flay/skin/make callous’, \\*drh2- &gt; \\*darx- &gt; taṙatok ‘garment, cloak, coat’ (assuming that PIE h2 was x or its uvular equivalent, see below).\n\nThe existence of words beginning with older \\*mš- / \\*mx- becoming m- or x- ( &gt; h- ) is seen in alternation like \\*mxeld(y)- &gt; młjuk- ‘strangle’, xełd- / hełj- ‘drown/suffocate/strangle’.  These have not previously been give as evidence of \\*mx-, explained away by linguists such as Hrach Martirosyan (see below) as “rhyming words” or an example of C &gt; m in reduplication (assuming that forms like hełjamłjuk ‘drowned/suffocated’ are older than młjuk- ‘strangle’).  It seems unlikely that such changes would “target” words in h- and x- instead of spreading new m- variants evenly across all consonants, so I prefer older \\*mx- as strengthened by the presence of mš- vs. m- above.\n\nMost of these changes can not be regular, and there is no evidence of dialect mixing as the source.  In fact, many are seen in related IE languages.  Similar changes like š &gt; x / h in Dardic are also without environmental cause, and creating unknown dialects in the path for both, both with the same changes, seems too much of a coincidence.\n\nMore info and theory in:\n\n[https://www.reddit.com/r/linguistics/comments/za6qot/armenian\\_khthr\\_krth/](https://www.reddit.com/r/linguistics/comments/za6qot/armenian_khthr_krth/)\n\n[https://www.academia.edu/28412793/The\\_Proto-Indo-European\\_Laryngeals\\_and\\_the\\_Name\\_of\\_Cilicia\\_in\\_the\\_Iron\\_Age](https://www.academia.edu/28412793/The_Proto-Indo-European_Laryngeals_and_the_Name_of_Cilicia_in_the_Iron_Age)\n\n[https://www.academia.edu/46614724/Etymological\\_Dictionary\\_of\\_the\\_Armenian\\_Inherited\\_Lexicon](https://www.academia.edu/46614724/Etymological_Dictionary_of_the_Armenian_Inherited_Lexicon)",
        "created_utc": 1670027547,
        "upvote_ratio": 1.0
    },
    {
        "title": "Seattle area friends/meetup?",
        "author": "natural_language_guy",
        "url": "https://www.reddit.com/r/linguistics/comments/zb2kxo/seattle_area_friendsmeetup/",
        "text": "[removed]",
        "created_utc": 1670026679,
        "upvote_ratio": 1.0
    },
    {
        "title": "Has anyone here watched Hot Skull (Sicak Kafa)? Is it any good? It's a Turkish SF tv series that seems to involve linguistics.",
        "author": "viktorbir",
        "url": "https://www.reddit.com/r/linguistics/comments/zb0qru/has_anyone_here_watched_hot_skull_sicak_kafa_is/",
        "text": "[removed]",
        "created_utc": 1670021837,
        "upvote_ratio": 1.0
    },
    {
        "title": "What place of articulation would the semivowel [a̯] correspond to?",
        "author": "weedmaster6669",
        "url": "https://www.reddit.com/r/linguistics/comments/zb0700/what_place_of_articulation_would_the_semivowel_a/",
        "text": "Every vowel can become a semivowel, and a semivowel is an approximant, so where would the open front unrounded semivowel [a̯] fit on the consonant chart?",
        "created_utc": 1670020604,
        "upvote_ratio": 1.0
    },
    {
        "title": "would the voiceless m be a marginal phoneme in English?",
        "author": "weedmaster6669",
        "url": "https://www.reddit.com/r/linguistics/comments/zb041x/would_the_voiceless_m_be_a_marginal_phoneme_in/",
        "text": "\"mhm\" [mm̥m] \"hmm\" [m̥m]\nI think from a descriptivist point of view you could call mhm and hmm English words, and they definitely usually have the voiceless nasal in them i believe, so wouldn't that make the voiceless bilabial nasal a phoneme in English - even if it's only in two words that aren't often thought of (but very much used) as words?",
        "created_utc": 1670020424,
        "upvote_ratio": 1.0
    },
    {
        "title": "When words are shortened in English, why is it so common to end them in “-o”?",
        "author": "kayakhomeless",
        "url": "https://www.reddit.com/r/linguistics/comments/zaylsp/when_words_are_shortened_in_english_why_is_it_so/",
        "text": "For example: conversation-convo, ammunition-ammo, random-rando, psychopath-psycho, ecological-eco, organic chemistry-orgo, Corvallis-Corvo (the city), Guantanamo-gitmo, mononucleosis-mono, etc.\n\nThe rule seems to be to shorten the word to two syllables, and add an “-o” if it doesn’t have one already. Is there a name for this?",
        "created_utc": 1670017165,
        "upvote_ratio": 1.0
    },
    {
        "title": "what is it called when you repeat a word to refer to something more specific or something different?",
        "author": "BaconGremlin24",
        "url": "https://www.reddit.com/r/linguistics/comments/zaw2ae/what_is_it_called_when_you_repeat_a_word_to_refer/",
        "text": "for example saying you dont “like” a person, but you “like like” them.\nis there a name for that?",
        "created_utc": 1670011574,
        "upvote_ratio": 1.0
    },
    {
        "title": "Burmese Grammar Recomendations?",
        "author": "linguist96",
        "url": "https://www.reddit.com/r/linguistics/comments/zav7pz/burmese_grammar_recomendations/",
        "text": "Does anyone have any recommendations for a good linguistic reference grammar of Burmese?",
        "created_utc": 1670009641,
        "upvote_ratio": 1.0
    },
    {
        "title": "New Bashkir alphabet based on Latin script. Bashkir is a Turkic language of the Kypchak subgroup of the Altaic family. I made it.",
        "author": "alexshedlon",
        "url": "https://i.redd.it/q5e5dqtn3j3a1.png",
        "text": "",
        "created_utc": 1670006027,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why doesn’t one’s mental mechanism for thought seem to have an effect on how well they are able to express themselves?",
        "author": "kaixiiii",
        "url": "https://www.reddit.com/r/linguistics/comments/zatd0q/why_doesnt_ones_mental_mechanism_for_thought_seem/",
        "text": "From my understanding, there are a couple (possibly more) general ways that people think: through concrete words or abstract ideas. I use the former, where I have an internal dialogue with myself and it’s basically like talking to myself but in my head and sometimes has an actual voice narrating those thoughts (tangent: does anyone else start to think in someone else’s voice after you’ve spent a lot of time hearing them talk?). It could also manifest as visual words written out, but whatever the case may be it is expressed in actual, concrete words (I also sometimes correct my own word choice to accurately express my thoughts even though I already know what I mean). The latter, abstract method I have been told is like picturing an image (like seeing a mental photo of an apple instead of thinking “hmm should I eat an apple right now?” or visually imagining themself eating an apple) or even just feeling an abstract idea or emotion (like feeling the concept of “apple-ness” and deciding if actually experiencing that feeling would make them happy). Here’s an example of the variations of this method: [link](https://twitter.com/i/events/1226183524773875712)\n\nThe logical implications of using the verbal method are that those who use it would tend to be better at expressing their thoughts and emotions as they have so much practice verbalizing their thoughts internally, but what I’ve noticed is that I, for example, am kind of bad at expressing my thoughts/feelings (unless given enough time to revise it until I feel it represents them precisely) and often struggle to find the right words, whereas some of my friends who use the latter can be very well spoken. I know there are a lot of other factors at play, like education level and language or even psychological/emotional blocks to expressing one’s true feelings, but is it not unintuitive that verbal thought doesn’t seem to lend itself to greater verbal precision in practice?\n\n(I will admit my basis for this conclusion is kinda anecdotal as I haven’t looked into any scientific research on the subject, but from what I’ve gathered from the people around me, it seems to generally be the case. I’ve also taken many linguistics courses to fulfill my ling minor, but even my cognitive/psycholinguistics class hasn’t addressed this. Please correct me if I’m wrong; I’ve been wondering this for a while)",
        "created_utc": 1670005357,
        "upvote_ratio": 1.0
    },
    {
        "title": "Baby speaking italian",
        "author": "Toramenor",
        "url": "https://v.redd.it/dh4jgwhwkh3a1",
        "text": "",
        "created_utc": 1670003984,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is it true that current southern American dialects are similar to middle age British accents?",
        "author": "schaweniiia",
        "url": "https://www.reddit.com/r/linguistics/comments/zas8ky/is_it_true_that_current_southern_american/",
        "text": "I keep reading the claim that e.g. people in Scotland used to sound a lot like Southern Americans do now rather than Scottish people do today. Is there any truth to that?",
        "created_utc": 1670002691,
        "upvote_ratio": 1.0
    },
    {
        "title": "Intentionality and acceptability in a text ( News article)",
        "author": "Vegetable-Mention373",
        "url": "https://www.reddit.com/r/linguistics/comments/zaqetl/intentionality_and_acceptability_in_a_text_news/",
        "text": "I'm study text linguistics and we have an assignment due next Monday and It is about the seven standards of textuality.My part of the assignment is to analyze a text ( A news article to be specific) it talks about covid in China. However, It is difficult to analyze this text as it is not a conversation where I can analyze the Gerican maxims, so how can I state the intentionality of the writer and the acceptability of the text? And How can I say this in an essay? \nPlease help me out. I really need these grades and If someone can recommend me a book that will help me understand the seven standards of textuality, I'll be truly grateful 🙏",
        "created_utc": 1669998268,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is there any high-quality documentation (either using attested forms or reconstructions) of a language's evolution from fully isolating to largely fusional?",
        "author": "the_dreaded_triptych",
        "url": "https://www.reddit.com/r/linguistics/comments/zapmis/is_there_any_highquality_documentation_either/",
        "text": "I'm interested in seeing how sound changes over time produce inflectional morphology. Is there anything like this, or would the timeframe be too large for such documentation?",
        "created_utc": 1669996299,
        "upvote_ratio": 1.0
    },
    {
        "title": "Story of Being Two and A Half Lingual",
        "author": "saurabh_bhatia_",
        "url": "https://www.youtube.com/watch?v=hG6IuVw9rrM",
        "text": "",
        "created_utc": 1669983817,
        "upvote_ratio": 1.0
    },
    {
        "title": "sssssssssssssssssssssssssssssssssssss",
        "author": "cawodeg945",
        "url": "https://www.youtube.com/watch?v=4I-vhbk8eXk&amp;list=PLwkg5OJ4PeqCL4izP6IY6YXWjH_pwj6nW",
        "text": "",
        "created_utc": 1669978622,
        "upvote_ratio": 1.0
    },
    {
        "title": "Western countries",
        "author": "Character_Pay0",
        "url": "https://www.reddit.com/r/linguistics/comments/zaez9i/western_countries/",
        "text": "[removed]",
        "created_utc": 1669966095,
        "upvote_ratio": 1.0
    },
    {
        "title": "Dropping the \"to be\" infinitive.",
        "author": "amohr",
        "url": "https://www.reddit.com/r/HomeMaintenance/comments/za6dpz/how_do_i_fix_this_the_chips_need_filled_and_it/?utm_source=share&amp;utm_medium=android_app&amp;utm_name=androidcss&amp;utm_term=1&amp;utm_content=share_button",
        "text": "I live in the PNW and I don't observe it locally, but online I've seen/heard it quite a bit lately. Something like, \"this needs replaced,\" I would say as, \"this needs to be replaced,\" or, \"this needs replacing,\" perhaps. I'm curious about this phenomenon: where it's common, how it originated, etc.  Thanks!",
        "created_utc": 1669955612,
        "upvote_ratio": 1.0
    },
    {
        "title": "Armenian kh-thr &gt; k-rth",
        "author": "stlatos",
        "url": "https://www.reddit.com/r/linguistics/comments/za6qot/armenian_khthr_krth/",
        "text": "In Armenian, most voiceless stops &gt; voiceless aspirates, but there are at least 2 examples of PIE k-tr that become k-rth instead of expected kh-rth :\n\ntʿekʿem (thekhem) ‘shape, bend, twist, weave’ &gt;&gt; tʿakartʿ (thakarth) ‘trap, snare, net’\n\n\\*h2aukwtro- &gt; \\*auktro- &gt; \\*akutro &gt; \\*akurt &gt; MAr. akutʿ (akuth) ‘cookstove’, Van dia. angurtʿ ‘portable clay oven’\n\n(\\*h2aukwtlo- &gt; \\*auktlo- &gt; \\*aukslo- &gt;&gt; aulla ‘pot’ in Latin, for comparison)\n\nInstead of a regular rule, this seems to be sporadic dissimilation of Ch-Ch &gt; C-Ch or similar, as in dialects of ancient Greek (possibly seen as irregular in ancient Macedonian examples with multiple outcomes).  More irregularities to T-K, K-T, etc., possibly seen in \\*(s)teg- &gt;&gt; Latin toga vs. \\*-toka &gt;&gt;  taṙatok -a- ‘garment, cloak, coat’ instead of expected \\*-tʿok.  Both assimilation and dissimilation seen in similar environments makes irregular change more likely.\n\nThe existence of such changes is important partly because the etymology of tʿakartʿ and akutʿ are listed as uncertain even with exact cognates like aulla available (previous explanation of kw &gt; k due to unrounding due to u make little sense).  This would only be one of the many irregular changes seen in Armenian.  In fact, akutʿ contains at least 2, since r &gt; 0 is also seen in several other words, with no explanation or shared environment.  The change of auCCC &gt; aCuCC would also be unique, but possibly similar to Latin \\*augsto- &gt; augustus (áukštas ‘high’ in Lithuanian, for comparison).\n\nThis also might show a closer connection between Armenian and Greek, if Ch-Ch &gt; C-Ch was found in both, but neither showing it for all words/dialects.  The nature of such a change in Greek could be known with greater precision if the theorized change of Armenian voiceless stops to fricatives before these fricatives became voiceless aspirates is true (seen independently in fricatives from other sources, for example, \\*sweso:r &gt; \\*xwexur &gt; \\*khweur &gt; kʿoyr (khoyr) ‘sister’).  If the change was x &gt; k before some fricatives, x &gt; kh in other environments, this could indicate Greek had fricatives before voiceless aspirates, perhaps explaining some changes of ps &gt; phs, etc., in some dialects.  The change of a stop to a fricative before a fricative is very common, and this might also explain the stages of apparently regular \\*pst &gt; \\*fsθ &gt; \\*fθ &gt; phth.\n\nThe existence of a fricative as an intermediate stage in Armenian might also allow more regularity in the explanation of sporadic k-tr &gt; k-rth : if h2 was a fricative, then \\*h2auktro- &gt; \\*haxuθro &gt;  akutʿ could have had a stage with 3 fricatives in 3 syllables in a row, exactly like \\*tetketro-? &gt; \\*θaxaθro &gt; tʿakartʿ.  This environment is a more likely one for irregular dissimilation, probably excluding -s- (and its outcomes?), more precision depending on whether h2 vs. x was h vs. x at the time, uvular vs. velar, etc.\n\nMore info and theory in:\n\n[https://www.academia.edu/28526541/Studies\\_in\\_Armenian\\_historical\\_phonology\\_I\\_aspiration\\_and\\_spirantization\\_of\\_PIE\\_voiceless\\_stops](https://www.academia.edu/28526541/Studies_in_Armenian_historical_phonology_I_aspiration_and_spirantization_of_PIE_voiceless_stops)\n\n[https://www.academia.edu/45633568/PIE\\_roots\\_of\\_the\\_shape\\_C\\_C\\_eH\\_in\\_Old\\_Armenian](https://www.academia.edu/45633568/PIE_roots_of_the_shape_C_C_eH_in_Old_Armenian)\n\n[https://www.academia.edu/10714049/PIE\\_ps\\_in\\_Armenian](https://www.academia.edu/10714049/PIE_ps_in_Armenian)\n\n[https://www.academia.edu/43502841/Once\\_more\\_on\\_Armenian\\_k\\_PIE\\_e\\_%C4%81\\_%C5%AB\\_s\\_and\\_maybe\\_even\\_o\\_s](https://www.academia.edu/43502841/Once_more_on_Armenian_k_PIE_e_%C4%81_%C5%AB_s_and_maybe_even_o_s)\n\n[https://www.academia.edu/46614724/Etymological\\_Dictionary\\_of\\_the\\_Armenian\\_Inherited\\_Lexicon](https://www.academia.edu/46614724/Etymological_Dictionary_of_the_Armenian_Inherited_Lexicon)",
        "created_utc": 1669944061,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is the r at the end of Old Norse and Icelandic a rhotacism of s?",
        "author": "MerlynTrump",
        "url": "https://www.reddit.com/r/linguistics/comments/za2gf9/is_the_r_at_the_end_of_old_norse_and_icelandic_a/",
        "text": "I was just a while ago reading [an article](https://lingualiebender.com/2017/06/20/grimms-law-part-1/) on Grimm's Law and of course it mentioned the \"foot\" in many languages thing, when I noticed that the Icelandic word is fotur. Now about a year ago I got a book on the Norse Sagas (specifically Ragnars saga) and the book mentioned that in the Old Norse originals words typically ended in an -r to mark grammatical case (I don't think it used the term case though), but that in English this final r is left off. So English translations have Ragnar and Sigurd, but the Norse original has Ragnarr and Sigurdr (at least when in the Nominative case), I'm presuming that this is the root of all the -ur words in modern Icelandic names (Icelandic being the most conservative of the Scandinavian languages), like Eirikur (from Eirikr, i.e. Erik). \n\nGetting back to fotur, I'm aware of the proto-Germanic being Fotiz\\* (I think the asterisk is because it's reconstructed, not attested). And it hit me: Probably last year (or earlier this year maybe), I had read on Wikipedia about rhotacism and [the article](https://en.wikipedia.org/wiki/Rhotacism#Latin) there mentioned a quotation from Varro, stating that the reason that so many Latin words end in singular nominative but use r's elsewhere is because the pronunciation changed (before Latin became written down) from s (which has z pronunciation when between vowels) to r. So words like flos become floris in the genitive, etc.\n\nSo is the r and the end of Old Norse and Icelandic, a rhotacism of the -s that usually occurs at the end of masculine nominative words in other Indo-European languages (i.e. the -us in Latin and the -as and -os in Greek).",
        "created_utc": 1669934345,
        "upvote_ratio": 1.0
    },
    {
        "title": "How I Learned Spanish! (8 Ways You Can Too)",
        "author": "Elcompaenrique",
        "url": "https://youtu.be/Ac83Bv8HEes",
        "text": "",
        "created_utc": 1669931044,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is it called when you make up meaningless words that sound like they are from ancient languages? Like the name of the basketball club \"Cibona\", it sounds like it is from Illyrian, and \"cib-\" is an actual Illyrian root (in \"Cibalae\"), and \"-ona\" is an actual Illyrian suffix (in \"Albona\").",
        "author": "FlatAssembler",
        "url": "/r/etymology/comments/z9zebd/what_is_it_called_when_you_make_up_meaningless/",
        "text": "",
        "created_utc": 1669928992,
        "upvote_ratio": 1.0
    },
    {
        "title": "Urgent: Looking for Code-switching clip.",
        "author": "an-al",
        "url": "https://www.reddit.com/r/linguistics/comments/z9ys27/urgent_looking_for_codeswitching_clip/",
        "text": "Hey everyone!\n\nI have an assignment to do for my uni which is due in a week from now and I haven't even started it yet because I've been bombarded with deadlines and exams. I (We) have to find a clip with a conversation between two people (preferably), transcribe 1000 words from it, and then analyze code-switching. I'd very much prefer to do it with native Spanish-speaking people who code-switch between Spanish and English often; (probably a Hispanic couple or family relatives who grew up in the US?). I would greatly appreciate it if you guys could point me toward something.\n\nThanks in advance &lt;3",
        "created_utc": 1669926590,
        "upvote_ratio": 1.0
    },
    {
        "title": "Linguistic Perspective for Orwell’s Nineteen Eighty-Four",
        "author": "FScottHemingway1",
        "url": "https://www.reddit.com/r/linguistics/comments/z9ymwz/linguistic_perspective_for_orwells_nineteen/",
        "text": "\n(I’m not sure if this is against the rules of the sub so please let me know and I’ll take it down.)\n\nI’m a grad student in English literature and I’m working on research of Orwell’s Nineteen Eighty-Four and if his hypothesis regarding language is feasible under the rules of linguistics. I only have some entry knowledge on the subject matter which is why I thought I’d turn here for some opinions.\n\nOrwell depicts the society of Oceania as having a decreasing vocabulary due to its authoritarian government. Moreover, every year the society creates a new edition of its mandated dictionary with each book being shorter and shorter. Terms like “slavery” are kept but its counterpart “freedom” is redacted. Antonyms are not allowed per the rules of Oceania’s Newspeak. \n\nOrwell’s premise is that as this government reduces the language that is available, the people they oppress would have no way of communicating any activism. \n\nBut I’m not too sure that Orwell is right on this one. \n\nGiven that nouns and verbs are open classes, it would be fairly easy to add new verbs and words to any dialect. And wouldn’t linguistics argue that even with the language available that people would still find a way to communicate their beliefs?\n\nPlease let me know if this theory is incorrect and if there’s something I’m overlooking. I’d really appreciate any linguistic perspective.",
        "created_utc": 1669926271,
        "upvote_ratio": 1.0
    },
    {
        "title": "What are the main similarities and differences of Semitic and Cushitic languages?",
        "author": "kimhaewon120",
        "url": "https://www.reddit.com/r/linguistics/comments/z9whya/what_are_the_main_similarities_and_differences_of/",
        "text": "[removed]",
        "created_utc": 1669921571,
        "upvote_ratio": 1.0
    },
    {
        "title": "/θ/ to /ð/ shift?",
        "author": "amandalaguera",
        "url": "https://www.reddit.com/r/linguistics/comments/z9vife/θ_to_ð_shift/",
        "text": "I’ve been hearing /ð/ being used in place of /θ/ increasingly lately in numerous speakers, the vast majority of which have been younger females (between the ages of ~15 to mid thirties). \n\nOne of the biggest trigger phrases seems to be “thank you”, but I have heard it in other word-initial contexts as well (e.g. “two thousand”), many times when following another voiced consonant or a vowel sound. \n\nHas anyone else noticed this? Is this some shift or trend unfolding before my eyes (or ears, rather)?",
        "created_utc": 1669919474,
        "upvote_ratio": 1.0
    },
    {
        "title": "Potential \"Auxlang\" Collab(?)",
        "author": "Xykai_the_alien",
        "url": "/r/conlangs/comments/z97lzd/potential_auxlang_collab/",
        "text": "",
        "created_utc": 1669912614,
        "upvote_ratio": 1.0
    },
    {
        "title": "Looking for list of most frequently used sentences in spoken German",
        "author": "daringmigration",
        "url": "https://www.reddit.com/r/linguistics/comments/z9rhk9/looking_for_list_of_most_frequently_used/",
        "text": "I'm looking for a list of the most frequently used sentences in spoken German. Something like a word frequency list but for whole sentences or phrases that are used in naturally spoken German.\n\nThis is almost what I'm looking for - [https://github.com/orgtre/top-open-subtitles-sentences](https://github.com/orgtre/top-open-subtitles-sentences)\n\nHowever, they used the OpenSubtitles corpus to create the list. Since dramatic movie scripts can be so different from normal speech, the resulting list seems like it might not be a great representation of real life German sentence frequency.\n\nIs anyone aware of a list like this that uses a different corpus? Maybe YouTube captions? \n\nAlternatively, does anyone know of a good way to scrape YouTube captions that are in a particular language? \n\nThanks for your help! And I apologize if this isn't the right place to ask.",
        "created_utc": 1669910382,
        "upvote_ratio": 1.0
    },
    {
        "title": "Babylonian Dictionaries",
        "author": "MrToxic2559",
        "url": "https://www.reddit.com/r/linguistics/comments/z9o7j5/babylonian_dictionaries/",
        "text": "I would like to know, what function did the bilingual dictionaries created in the Akkadian Empire serve?",
        "created_utc": 1669902177,
        "upvote_ratio": 1.0
    },
    {
        "title": "Restrictiveness affix?",
        "author": "ZekiTheDingo",
        "url": "https://www.reddit.com/r/linguistics/comments/z9ivwe/restrictiveness_affix/",
        "text": "I've been looking into restrictive and non-restrictive adjectives lately.\nRestrictive: \"The man who I saw at the party is my friend\", where you're talking about this man in contrast to any other men.\nNon-restrictive: \"The man, who I saw at the party, is my friend\", where there's no such contrast occurring, and the clause only serves to describe the noun.\n\nI saw that in Spanish restrictiveness is marked consistently, putting an adjective after a noun being restrictive, and putting it before being non-restrictive. Which made me curious, how common is it for languages to consistently mark restrictiveness, and are there languages that mark it with an affix?",
        "created_utc": 1669884440,
        "upvote_ratio": 0.81
    },
    {
        "title": "Is there an actual difference between [ɔʏ] and äu in German?",
        "author": "NeverBefore800",
        "url": "https://www.reddit.com/r/linguistics/comments/z9ayem/is_there_an_actual_difference_between_ɔʏ_and_äu/",
        "text": "From video footage it seems that the [ʏ] is significantly less rounded than the IPA would suggest.\n\nhttps://youtu.be/uau2wxEm9w8\nhttps://youtu.be/pwjfB8VbtME\n\nIdk feel free to correct.",
        "created_utc": 1669860472,
        "upvote_ratio": 0.95
    },
    {
        "title": "Singular they/them being used for individuals with known genders?",
        "author": "camohunter19",
        "url": "https://www.reddit.com/r/linguistics/comments/z99s1b/singular_theythem_being_used_for_individuals_with/",
        "text": "[removed]",
        "created_utc": 1669857510,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can someone explain what connected speech in Fuzhounese is?",
        "author": "Chairsarecool",
        "url": "https://www.reddit.com/r/linguistics/comments/z990k7/can_someone_explain_what_connected_speech_in/",
        "text": "[removed]",
        "created_utc": 1669855586,
        "upvote_ratio": 1.0
    },
    {
        "title": "Origin of the word \"quote\" regarding getting estimate on insurance or things alike",
        "author": "Shawnfrost9327",
        "url": "https://www.reddit.com/r/linguistics/comments/z97jse/origin_of_the_word_quote_regarding_getting/",
        "text": "[removed]",
        "created_utc": 1669852032,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is there a strong correlation with how well speakers of a language understand non-L1 speakers and how widely that language is spoken and learnt?",
        "author": "Harsimaja",
        "url": "https://www.reddit.com/r/linguistics/comments/z94l3v/is_there_a_strong_correlation_with_how_well/",
        "text": "[removed]",
        "created_utc": 1669845329,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is there a strong correlation with how well speakers of a language understand non-L1 speakers and how widely that language is spoken and learnt?",
        "author": "Harsimaja",
        "url": "https://www.reddit.com/r/linguistics/comments/z94k59/is_there_a_strong_correlation_with_how_well/",
        "text": "[removed]",
        "created_utc": 1669845274,
        "upvote_ratio": 1.0
    },
    {
        "title": "What makes a \"new language\"?",
        "author": "Avversariocasuale",
        "url": "https://www.reddit.com/r/linguistics/comments/z93u2z/what_makes_a_new_language/",
        "text": "[removed]",
        "created_utc": 1669843700,
        "upvote_ratio": 1.0
    },
    {
        "title": "Numbers in Kokborok (Tripuri) Language",
        "author": "holongtiprasa",
        "url": "/r/Kokborok/comments/z8znqo/numbers_in_kokborok_tripuri_language/",
        "text": "",
        "created_utc": 1669834515,
        "upvote_ratio": 1.0
    },
    {
        "title": "What’s the deal with people not being able to pronunce stuff?",
        "author": "Tomtenissarna",
        "url": "https://www.reddit.com/r/linguistics/comments/z8ydto/whats_the_deal_with_people_not_being_able_to/",
        "text": "Everywhere I see people on the internet (especially in conlang communities) that can't pronounce very basic phonemes and vowels, that I can pronounce even though they arent in my native language or english either. If you know the technicalities of a phoneme then how can it be so hard to pronounce? The recipe of how to pronounce it is literally in it’s name!",
        "created_utc": 1669831619,
        "upvote_ratio": 1.0
    },
    {
        "title": "Spanish linguistics",
        "author": "hecate_the_goddess",
        "url": "/r/Spanish/comments/z8v16u/spanish_linguistics/",
        "text": "",
        "created_utc": 1669831168,
        "upvote_ratio": 1.0
    },
    {
        "title": "What, if any, differences are there in meaning of pan- and omni- prefixes?",
        "author": "Asleep_Travel_6712",
        "url": "https://www.reddit.com/r/linguistics/comments/z8xm9m/what_if_any_differences_are_there_in_meaning_of/",
        "text": "[removed]",
        "created_utc": 1669829841,
        "upvote_ratio": 1.0
    },
    {
        "title": "Rap about whether Language is innate",
        "author": "sirkn8",
        "url": "https://youtu.be/I5f-5ty9Z_E",
        "text": "",
        "created_utc": 1669826280,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why \"environmental pollution\" and not \"environment pollution\"?",
        "author": "nhp55555",
        "url": "https://www.reddit.com/r/linguistics/comments/z8sz0e/why_environmental_pollution_and_not_environment/",
        "text": "Hi everyone. I have a question regarding linguistics. My student wrote \"environment pollution\" in her essay, and I corrected it as \"environmental pollution\". She came to me and asked why she couldn't use \"environment\". I referred her to the Google Ngrams to show her \"environmental pollution\" is used much more widely, but that seemed insufficient. She asked why she can use \"air/water pollution\", but not \"environment\". She is an adult EFL student, and the explanation that a phrase is used more popularly than another seems unsatisfactory to her. I wondered how to explain this in linguistics. Can some one help me? Thank you so much.",
        "created_utc": 1669818738,
        "upvote_ratio": 1.0
    },
    {
        "title": "Higher Ed Wednesday - November 30, 2022",
        "author": "AutoModerator",
        "url": "https://www.reddit.com/r/linguistics/comments/z8poy3/higher_ed_wednesday_november_30_2022/",
        "text": "Hello all and welcome to another edition of Higher Ed Wednesday, an expansion of the Grad School Wednesday posts. This is a thread where prospective students can ask questions about university programs at any level, either general (e.g. \"How often should a grad student present at conferences?\") or particular (e.g. \"Which schools in North America have strong programs in Korean linguistics?). It's also a chance for current students to find out information about other programs (e.g. \"How many of you have reading lists for your comprehensive exams?\") or general university survival (e.g. \"Is it a really bad idea to change my thesis supervisor if we don't click?\"). So ask away!",
        "created_utc": 1669809611,
        "upvote_ratio": 1.0
    },
    {
        "title": "(English) Is Syllable Initial [kʃ-] Possible?",
        "author": "zanjabeel117",
        "url": "https://www.reddit.com/r/linguistics/comments/z8omp7/english_is_syllable_initial_kʃ_possible/",
        "text": "When I (a British English native speaking roughly RP) try to syllabify English words like *construction* and *reduction*, I get \\[kṇ.ˈstrʌ.kʃṇ\\] and \\[rɪ.ˈdʌ.kʃṇ\\], whereas the Cambridge English Dictionary gives \\[[kənˈstrʌk.ʃən](https://dictionary.cambridge.org/dictionary/english/construction)\\] and \\[[rɪˈdʌk.ʃən](https://dictionary.cambridge.org/dictionary/english/reduction)\\].\n\nI'm not too concerned about my brain's decision to remove the schwas and make \\[n\\] syllabic/a syllable nucleus, but I don't understand why I've put \\[kʃ\\] in the syllable onset while the dictionary puts \\[k\\] as the previous syllable's coda. I understand it's probably got something to do with onset maximisation, but I'm pretty sure \\[kʃ\\] can't be word-initial in English, so how can it be syllable initial in my own idiolect/brain?",
        "created_utc": 1669806032,
        "upvote_ratio": 1.0
    },
    {
        "title": "In Optimality theory, isn't everything favoured by a markedness constraint a marked phenomenon?",
        "author": "No_Asparagus9320",
        "url": "https://www.reddit.com/r/linguistics/comments/z8l9dp/in_optimality_theory_isnt_everything_favoured_by/",
        "text": "In the book Optimality theory (Rene Kager, 1999) in page 93 it is mentioned that \"the presence of an onset is an unmarked situation\". Though I understand this statement completely, I have a question : Don't markedness constraints like ONSET favour marked situations? Why call it a marked constraint if it favours an unmarked situation? ",
        "created_utc": 1669794311,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to add tones and pitch in espeak - mac ?",
        "author": "Western-Analyst-4688",
        "url": "https://www.reddit.com/r/linguistics/comments/z8k4xw/how_to_add_tones_and_pitch_in_espeak_mac/",
        "text": "I use espeak on mac in command line /terminal . I wanted to ipa with enclosed in double brackets  example: \\[\\[du\\]\\]\n\n&amp;#x200B;\n\n**How do I add tones an pitch accent in Espeak ?**",
        "created_utc": 1669790861,
        "upvote_ratio": 1.0
    },
    {
        "title": "Books about English Linguistics only",
        "author": "housingaffl",
        "url": "https://www.reddit.com/r/linguistics/comments/z8f516/books_about_english_linguistics_only/",
        "text": "I'm currently teaching ESL and I was wondering if anyone had recommendations for English linguistics books?\n\n  \nI have books on various linguistics topics but I was wondering if there were any that catered to English only from a linguist's perspective?",
        "created_utc": 1669777108,
        "upvote_ratio": 1.0
    },
    {
        "title": "question for concepts such as direction",
        "author": "madlink01",
        "url": "https://www.reddit.com/r/linguistics/comments/z8d9lk/question_for_concepts_such_as_direction/",
        "text": "I hear words like mirror, reverse, inverse in relation to a binary (i.e. up and down, front and back, etc.), but I've been focusing on concepts such inside-out (not the movie) and I've been wondering if there's a subject that lists all of these concepts.  I would like to learn more about it.",
        "created_utc": 1669772537,
        "upvote_ratio": 1.0
    },
    {
        "title": "12 Best Islands in Thailand For a Luxury Trip in 2022",
        "author": "aletheapirohann",
        "url": "https://vipluxuryservices.com/best-islands-thailand/",
        "text": "",
        "created_utc": 1669770629,
        "upvote_ratio": 1.0
    },
    {
        "title": "Methods (social anxiety related)",
        "author": "yvky",
        "url": "https://www.reddit.com/r/linguistics/comments/z8bkhp/methods_social_anxiety_related/",
        "text": "Hello! I've an upcoming term paper in Applied Linguistics. The topic is entirely open and up to us to choose. It's more about the methods we learned that we're supposed make use of.\n\nThe problem is I suffer from social anxiety so interviews are out of the question.\nEven though DCTs and questionnaires can be conducted online I still need to reach out for participants if I don't only ask my classmates. Unfortunately, this also causes some anxiety (basically everything concerning strangers, was hoping recruiting people online would be less of an issue but doesn't feel like it right now).\n\nSo I guess the best would be working with corpora (which I've never worked with before)?\n\n(In case you're wondering how I manage to come so far or what kind of weird question it is.\n\nI majored in literature and minored in linguistics a while back ago and just recently went back to uni for a master's degree. So I'm not very experienced in linguistic researches yet. \n\nAlso at the moment I struggle a bit with my mental health / social anxiety. Sorry if this post is sort of a weird social anxiety venting post but I'd appreciate any feedback and maybe someone can relate sort of?)",
        "created_utc": 1669768408,
        "upvote_ratio": 1.0
    },
    {
        "title": "Beside \"one\", are there other English words beginning with \"o\" for that sound?",
        "author": "_Username-Available",
        "url": "https://www.reddit.com/r/linguistics/comments/z86itt/beside_one_are_there_other_english_words/",
        "text": "[removed]",
        "created_utc": 1669756745,
        "upvote_ratio": 1.0
    },
    {
        "title": "Survey on Attitudes Towards Gender-Neutral Spanish",
        "author": "icedivy",
        "url": "https://www.reddit.com/r/linguistics/comments/z82z1x/survey_on_attitudes_towards_genderneutral_spanish/",
        "text": "[removed]",
        "created_utc": 1669748978,
        "upvote_ratio": 1.0
    },
    {
        "title": "Etruscan inscription from one of the San Casciano dei Bagni statues: transcription and attempted translation in comments",
        "author": "Qafqa",
        "url": "https://i.redd.it/mpo0i8sbmo0a1.jpg",
        "text": "",
        "created_utc": 1669728436,
        "upvote_ratio": 1.0
    },
    {
        "title": "Etruscan inscription from one of the San Casciano dei Bagni statues: transcription and attempted translation in comments",
        "author": "Qafqa",
        "url": "https://i.redd.it/mpo0i8sbmo0a1.jpg",
        "text": "",
        "created_utc": 1669726734,
        "upvote_ratio": 1.0
    },
    {
        "title": "How does changing order of prepositonal phrases effect semantics in a language?",
        "author": "BERCMJSJ-5",
        "url": "https://linguistics.stackexchange.com/questions/45639/how-does-order-of-prepositional-phrases-effect-semantics",
        "text": "",
        "created_utc": 1669724053,
        "upvote_ratio": 1.0
    },
    {
        "title": "Siren pronounced like sireen?",
        "author": "first_of_thy_name",
        "url": "https://www.reddit.com/r/linguistics/comments/z7lcqi/siren_pronounced_like_sireen/",
        "text": "[removed]",
        "created_utc": 1669702168,
        "upvote_ratio": 1.0
    },
    {
        "title": "Sentence/senates merger",
        "author": "Water-is-h2o",
        "url": "https://www.reddit.com/r/linguistics/comments/z7knni/sentencesenates_merger/",
        "text": "[removed]",
        "created_utc": 1669700022,
        "upvote_ratio": 1.0
    },
    {
        "title": "Hungarian 'R' vs Japanese 'R'",
        "author": "levi-eat-world",
        "url": "https://www.reddit.com/r/linguistics/comments/z7j8ni/hungarian_r_vs_japanese_r/",
        "text": "As a native Hungarian speaker learning Japanese, I've been told my pronounciation in Japanese is rather good, however, I've been struggling with the 'r' sound. I can tell a distinct difference between the way I try to pronounce 'r' (by rolling), and how Japanese speakers pronounce it (flapping). Native Japanese speakers seem to pronounce it almost like 'd.' If by any chance there's anyone here who speaks both languages, can anyone tell me how similar flapping and rolling are and what the main difference is? I can't seem to find a decent answer anywhere else.",
        "created_utc": 1669695849,
        "upvote_ratio": 1.0
    },
    {
        "title": "hi! thinking about maybe doing a PhD in language policy / planning. recommend me some readings?",
        "author": "banana_question",
        "url": "https://www.reddit.com/r/linguistics/comments/z7iezy/hi_thinking_about_maybe_doing_a_phd_in_language/",
        "text": "[removed]",
        "created_utc": 1669693537,
        "upvote_ratio": 1.0
    },
    {
        "title": "Where can I read about the relationship between mother tongue and learning science ?",
        "author": "al3arabcoreleone",
        "url": "https://www.reddit.com/r/linguistics/comments/z7fwqw/where_can_i_read_about_the_relationship_between/",
        "text": "[removed]",
        "created_utc": 1669686856,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is the ancestral language?",
        "author": "findelepisode",
        "url": "https://www.newscientist.com/article/mg25634143-200-the-ancestral-language-of-half-the-world-reveals-our-shared-culture/",
        "text": "I stumbled across this article and I found it quite interesting, so I thought of posting it here. Does anyone here have access to this article?",
        "created_utc": 1669685550,
        "upvote_ratio": 1.0
    },
    {
        "title": "Canadian pronunciation of -ar sound. Has anyone else noticed this unique accent feature?",
        "author": "High_Fly_Flow",
        "url": "https://v.redd.it/meafut4d3u2a1",
        "text": "",
        "created_utc": 1669685225,
        "upvote_ratio": 1.0
    },
    {
        "title": "How can i make schemes like in B?",
        "author": "No-Cat-2242",
        "url": "https://www.reddit.com/r/linguistics/comments/z7cd0k/how_can_i_make_schemes_like_in_b/",
        "text": "&amp;#x200B;\n\nhttps://preview.redd.it/kfjq9fpb0s2a1.png?width=972&amp;format=png&amp;auto=webp&amp;s=34a80feec354930e62360e565298e3651f59bfb8",
        "created_utc": 1669677983,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do languages that don't have initial or final clusters syllabify intervocalic CCC sequences?",
        "author": "Suippumyrkkyseitikki",
        "url": "https://www.reddit.com/r/linguistics/comments/z7aq36/how_do_languages_that_dont_have_initial_or_final/",
        "text": "For example, standard Finnish allows neither initial nor final clusters (other than in recent loanwords), but it does have intervocalic CCC sequences. Other things being equal, you might expect Finnish words like *virtsa* and *myrsky* to syllabify as *vir-tsa* and *myr-sky* according to a maximal onset principle, but the syllabifications favoured by native intuition are ones with heavy codas: *virt-sa* and *myrs-ky*. It seems as though Finnish actually follows a maximal coda principle but with another principle against null onsets. This would explain why *virtsa* is *virt-sa* and not *virts-a* or *vir-tsa*.\n\nI'd be interested to know if other languages in this situation maximize the coda or the onset.",
        "created_utc": 1669674317,
        "upvote_ratio": 1.0
    },
    {
        "title": "Where can I read about the historical and applied impact of the Norman Conquest on English?",
        "author": "MotherHolle",
        "url": "https://www.reddit.com/r/linguistics/comments/z79gx6/where_can_i_read_about_the_historical_and_applied/",
        "text": "[removed]",
        "created_utc": 1669671604,
        "upvote_ratio": 1.0
    },
    {
        "title": "Professional linguists",
        "author": "February-23",
        "url": "https://www.reddit.com/r/linguistics/comments/z796du/professional_linguists/",
        "text": "Hi everyone,\n\nI'm curious how many here are currently working (or have been working) as linguists, or otherwise in the field of linguistics? And with which language(s)? \n\nI'll start: I work as a linguist for a company that develops Artificial Intelligence voices for Text To Speech (TTS). Simplified, I train the robot voices to sound like real humans. I work with varieties of English such as American, British, Irish, Australian, and Canadian, and I also work with Norwegian, Swedish and Danish. Occasionally I get some voice issues in German and French. Another major language of ours is Afrikaans, but that is not my domain. \n\nI'd love to hear from other linguists about what they do.",
        "created_utc": 1669670981,
        "upvote_ratio": 1.0
    },
    {
        "title": "Regarding \"everyone else's\" possessive construction",
        "author": "Illustrious-Brother",
        "url": "https://www.reddit.com/r/linguistics/comments/z76f58/regarding_everyone_elses_possessive_construction/",
        "text": "In English, you generally do not use this kind of possessive construction, where the possessor is separated from the possessive marker by an adjective.\n\nHowever, \"everyone else\" functions more like a pronoun, similar to \"you guys\" and any other similar expressions. (Though I *have* seen mentions of \"your guys' \" but that's another topic entirely). But this process must have started with a pronoun + adjective phrase first, so perhaps the better question it is why is this kind of construction limited? \n\nWhy don't we have \"they/them all's\" for example? Or perhaps we already but only in small parts of the English speaking world.\n\nA similar kind of construction is in phrases like \"all of them\" which creates an awkward situation where you \"them\" clashes with \"their\" when you try to make it possessive. \n\nSo why not put apostrophe S at the end and go on with our days? What underlying English rules (syntax-tactics?) that prevent us from creating more possessive pronoun constructions this way?",
        "created_utc": 1669665041,
        "upvote_ratio": 1.0
    },
    {
        "title": "This is how Scots is a Na-Dene language ! This is the TRUTH !",
        "author": "proud_p_u_nd_a_ist",
        "url": "https://www.reddit.com/r/linguistics/comments/z76eds/this_is_how_scots_is_a_nadene_language_this_is/",
        "text": "We  are being censored for disclosing the truth. Scots IS a Na-Dene  language. I cannot believe the level of dictatorial censorship on the  most prestigious linguistics subreddits. We are being eliminated.\n\nFor  reference: I am a linguist of 30 years experience at Oxford University,  and I cannot emphasize enough how much the grammar, phonology and  lexicon of the Scots tongue mirrors that of the Yeniseian vernacular, to  a shocking degree.\n\nI do not have  much time, but I must disclose one finding: the Scots word 'bevvy' is a  5,000 year old cognate from the Proto-Ancient-Nortwestern-Eurasian  shamanic tongue, in which initiated shamans would consume 'bx'e'vhjui'  to come in contact with the gods of a higher realm. Similarly, Scotsmen  today will regularly see jesus after consuming enough alcohol to not  feel the heroin overdose and physical trauma they are receiving from a  drunken bar brawl.\n\nThat is all for now.\n\nGreat  things will happen when I reveal the truth about the ancient !Xoo space  faring vampires who communicate in click consonants, but that is a  story for another time.\n\nGoodnight my fellow linguists, may Tengri have mercy on your geminating souls.",
        "created_utc": 1669664994,
        "upvote_ratio": 1.0
    },
    {
        "title": "Book about Alphabet Development around the world?",
        "author": "WhatsThePointOfNames",
        "url": "https://www.reddit.com/r/linguistics/comments/z73dp3/book_about_alphabet_development_around_the_world/",
        "text": "[removed]",
        "created_utc": 1669658426,
        "upvote_ratio": 1.0
    },
    {
        "title": "Linguists of Reddit, what existing models of linguistic analysis of the meaning of a word are there?",
        "author": "Intercessia",
        "url": "https://www.reddit.com/r/linguistics/comments/z72e27/linguists_of_reddit_what_existing_models_of/",
        "text": "Non-native speaker here, so don’t be too mean. \n\nWhat are the differences between such models of analysis and which ones do you prefer? \n\nI am currently involved in a trademark dispute where a linguistic analysis of the meaning of a word has been conducted by an expert and I have a feeling that the methodologies of the analysis are very restricted, meaning not all methodologies present have been applied and in my particular case not to my favor. Some background: Former communist Eastern European country with weak academics and heavy ideological influences lingering in almost every aspect of life.\n\nI might have to make a statement before the court and I need help from linguists to construct my argument. I am the plaintiff, not a lawyer.",
        "created_utc": 1669656186,
        "upvote_ratio": 1.0
    },
    {
        "title": "İs there any language that doesn't have monophtongs at all?",
        "author": "SpiritualPlate1984",
        "url": "https://www.reddit.com/r/linguistics/comments/z719s0/is_there_any_language_that_doesnt_have/",
        "text": "[removed]",
        "created_utc": 1669653720,
        "upvote_ratio": 1.0
    },
    {
        "title": "How would English change and diverge regionally over hundreds of years with no unifying body keeping it standard",
        "author": "Purple-Oil7915",
        "url": "https://www.reddit.com/r/linguistics/comments/z70zy4/how_would_english_change_and_diverge_regionally/",
        "text": "[removed]",
        "created_utc": 1669653091,
        "upvote_ratio": 1.0
    },
    {
        "title": "Notating Prosody (English)",
        "author": "Bhxtwy",
        "url": "https://www.reddit.com/r/linguistics/comments/z6zpes/notating_prosody_english/",
        "text": "Do any of you know of resources for notating suprasegmentals, particularly prosody? The goal is to be able to record differences between dialects of English beyond phonology and phonetics, which the IPA is well used for.\n\nExamples of suprasegmental phenomena to quantify/qualify could be intonation contours and stress (pitch, vowel length, volume).\n\nMany thanks!",
        "created_utc": 1669650039,
        "upvote_ratio": 1.0
    },
    {
        "title": "This week's Q&amp;A thread -- please read before asking or answering a question! - November 28, 2022",
        "author": "AutoModerator",
        "url": "https://www.reddit.com/r/linguistics/comments/z6uplw/this_weeks_qa_thread_please_read_before_asking_or/",
        "text": "Do you have a question about language or linguistics? You’ve come to the right subreddit! We welcome questions from people of all backgrounds and levels of experience in linguistics.\n\nThis is our weekly Q&amp;A post, which is posted every Monday. We ask that certain types of questions be asked here instead of in a separate post.\n\n**Questions that should be posted in the Q&amp;A thread:**\n\n* Beginner questions — if you’re looking for a general answer that can be found in an introductory textbook, then it probably belongs here. If you ask in a separate post we’ll ask you to move it here.\n\n* Questions that can be answered with a simple Google or Wikipedia search — you should try Google and Wikipedia first, but we know it’s sometimes hard to find the right search terms or evaluate the quality of the results. Instead of removing these questions, we just ask you post them here.\n\n* Asking why someone (yourself, a celebrity, etc.) has a certain language feature — unless it’s a well-known dialectal feature, we can usually only provide very general answers to this type of question. And if it’s a well-known dialectal feature, it still belongs here.\n\n* Requests for transcription or identification of a feature — remember to link to audio examples.\n\n* English dialect identification requests — for language identification requests and translations, you want r/translator. If you need more specific information about which English dialect someone is speaking, you can ask it here.\n\n* Questions about prescriptivism — such as whether it's good or bad, when it's appropriate, whether something \"counts\" as prescriptivism, etc. These questions usually need the same general answers clarifying the role of descriptivism/prescriptivism in linguistics, so please post them here.\n\nWe’ll ask you to move your post to the Q&amp;A thread if you post it on the front page and we think it fits one of the above categories. You’re free to post your question here.\n\nIf you post your question to the Q&amp;A thread and don’t get an answer by the end of the week, you can post it as a separate post. If it’s already the weekend, you might want to wait to post your question until the new Q&amp;A post goes up on Monday.\n\n**Discouraged Questions**\n\nThese types of questions are subject to removal:\n\n* Asking for answers to homework problems. If you’re not sure how to do a problem, ask about the concepts and methods that are giving you trouble. Avoid posting the actual problem if you can.\n\n* Asking for paper topics. We can make specific suggestions once you’ve decided on a topic and have begun your research, but we won’t come up with a paper topic or start your research for you.\n\n* Asking for grammaticality judgments and usage advice — basically, these are questions that should be directed to speakers of the language rather than to linguists.\n\n* Questions that are covered in our FAQ or reading list — follow-up questions are welcome, but please check them first before asking how people sing in tonal languages or what you should read first in linguistics.",
        "created_utc": 1669636812,
        "upvote_ratio": 1.0
    },
    {
        "title": "Grammaticalisation",
        "author": "Twisted_Gemini",
        "url": "https://www.reddit.com/r/linguistics/comments/z6s82b/grammaticalisation/",
        "text": "[removed]",
        "created_utc": 1669628185,
        "upvote_ratio": 1.0
    },
    {
        "title": "Italian vs Japanese pronunciations of English words",
        "author": "ziz__",
        "url": "https://www.reddit.com/r/linguistics/comments/z6o9nm/italian_vs_japanese_pronunciations_of_english/",
        "text": "[removed]",
        "created_utc": 1669614470,
        "upvote_ratio": 1.0
    },
    {
        "title": "Italian vs Japanese pronunciations of English words",
        "author": "ziz__",
        "url": "https://www.reddit.com/r/linguistics/comments/z6o62j/italian_vs_japanese_pronunciations_of_english/",
        "text": "[removed]",
        "created_utc": 1669614152,
        "upvote_ratio": 1.0
    },
    {
        "title": "Reading material recs on language and gender",
        "author": "nkusa76",
        "url": "https://www.reddit.com/r/linguistics/comments/z6jtvs/reading_material_recs_on_language_and_gender/",
        "text": "Does anyone have book or journal article recommendations that look at how gendered versus genderless languages form different conceptions of gender (roles) in the respective societies? For instance, how does Spanish society view gender (or rigidly do they adhere to these views) and how is this impacted by their gendered language? \n\nTIA",
        "created_utc": 1669601242,
        "upvote_ratio": 1.0
    },
    {
        "title": "Are certified teachers being underrated? | The key to “mastering” a language is…",
        "author": "LITGangOfficial",
        "url": "https://youtu.be/4HFOODlI11w",
        "text": "",
        "created_utc": 1669599786,
        "upvote_ratio": 1.0
    },
    {
        "title": "Slot88 Situs Game Judi Slot Online Terbaik dan Terjamin Agen18",
        "author": "winfredbirdinep",
        "url": "https://patricialynne.com",
        "text": "",
        "created_utc": 1669595538,
        "upvote_ratio": 1.0
    },
    {
        "title": "[x-post from r/etymology] I find it interesting that the Burmese wholesale adopted the English word \"democracy\" rather than invent their own word for it like the Thai did.",
        "author": "Lagalag967",
        "url": "https://www.reddit.com/r/linguistics/comments/z6hba3/xpost_from_retymology_i_find_it_interesting_that/",
        "text": "[removed]",
        "created_utc": 1669594437,
        "upvote_ratio": 1.0
    },
    {
        "title": "Bilingual Minimal Pairs",
        "author": "UncreativePotato143",
        "url": "https://www.reddit.com/r/linguistics/comments/z6f5wa/bilingual_minimal_pairs/",
        "text": "[removed]",
        "created_utc": 1669589122,
        "upvote_ratio": 1.0
    },
    {
        "title": "What to do with a BA in linguistics?",
        "author": "CosmicDoll",
        "url": "https://www.reddit.com/r/linguistics/comments/z6dup9/what_to_do_with_a_ba_in_linguistics/",
        "text": "[removed]",
        "created_utc": 1669586095,
        "upvote_ratio": 1.0
    },
    {
        "title": "\"Ih\" vs. \"eh\" speech quirk. Is this a common experience?",
        "author": "unconstrainedoptimal",
        "url": "https://www.reddit.com/r/linguistics/comments/z6d0qa/ih_vs_eh_speech_quirk_is_this_a_common_experience/",
        "text": "I re\"sint\"tly started seeing someone and she finds it interesting that I consis\"tint\"ntly replace \"eh\" sounds in *many* words with an \"ih\" sound (think \"ih\"nteresting). Is this comm\"in\"? *(oh God I guess I do it for the \"uh\" sound as well)* I can't express how pervasive it is across my speech, but no one has pointed it out before now. Now I can't help but notice it in ev\"ih\"ry other sen\"tin\"ce I say.\n\nSome more \"ih\"xamples are:\nProb\"lih\"matic\nS\"ind\" instead of s\"eh\"nd\n\n\nSome of these may be more comm\"in\" than others but I'm curious if this is normal. I'm from the Pacific Northwest.\n\nSome other quirks include saying \"come fort uh bull\" as opposed to \"come fter bull\" and \"temp e rat chure\" as opposed to \"temp rat chure\" like many of my friends. However, the most \"pir\"vasive seems to be the replace\"mint\" of \"eh\" (and I guess \"uh\") with \"ih\". \n\nHelp!",
        "created_utc": 1669584156,
        "upvote_ratio": 1.0
    }
]