[
    {
        "title": "Can an individual phoneme carry meaning?",
        "author": "PortsmouthKerachi",
        "url": "https://www.reddit.com/r/linguistics/comments/8klf6s/can_an_individual_phoneme_carry_meaning/",
        "text": "[removed]",
        "created_utc": 1526738384,
        "upvote_ratio": ""
    },
    {
        "title": "How should I prepare for the International Linguistics Olympiad?",
        "author": "TheComingOfTheGeeks",
        "url": "https://www.reddit.com/r/linguistics/comments/8kl8vh/how_should_i_prepare_for_the_international/",
        "text": "Or at least, how should I start?",
        "created_utc": 1526736334,
        "upvote_ratio": ""
    },
    {
        "title": "Weekend Roundup - May 19, 2018",
        "author": "AutoModerator",
        "url": "https://www.reddit.com/r/linguistics/comments/8kktse/weekend_roundup_may_19_2018/",
        "text": "Welcome again to the /r/linguistics weekend round-up, your chance to share with the community what you've been working on for the past week. You can also share things that you've read, observations you've recently made, or anything else interesting that you've come across that might not otherwise warrant a separate thread. Tell us about your week.\n",
        "created_utc": 1526731232,
        "upvote_ratio": ""
    },
    {
        "title": "Can the negative form of \"have\" use a syllabic consonant?",
        "author": "fu0cco",
        "url": "https://www.reddit.com/r/linguistics/comments/8kkm3z/can_the_negative_form_of_have_use_a_syllabic/",
        "text": "[removed]",
        "created_utc": 1526728325,
        "upvote_ratio": ""
    },
    {
        "title": "Please i want any help in the simplest way",
        "author": "O3D_DUZ",
        "url": "https://www.reddit.com/r/linguistics/comments/8kkkch/please_i_want_any_help_in_the_simplest_way/",
        "text": "[removed]",
        "created_utc": 1526727630,
        "upvote_ratio": ""
    },
    {
        "title": "Full ride in WashU, Linguistics or Actuarial Science in University of Missouri",
        "author": "Getsugatenshoo",
        "url": "https://www.reddit.com/r/linguistics/comments/8kkgvv/full_ride_in_washu_linguistics_or_actuarial/",
        "text": "[removed]",
        "created_utc": 1526726103,
        "upvote_ratio": ""
    },
    {
        "title": "Is there a free online linguistics class?",
        "author": "gabek333",
        "url": "https://www.reddit.com/r/linguistics/comments/8kk1vl/is_there_a_free_online_linguistics_class/",
        "text": "I've always loved linguistics and language (I speak English, Hebrew, and Spanish). I really want to learn linguistics more (and hopefully it will help when I learn arabic and french).",
        "created_utc": 1526719233,
        "upvote_ratio": ""
    },
    {
        "title": "A Sanskrit-English dictionary, etymologically and philologically arranged, with special reference to Greek, Latin, Gothic, German, Anglo-Saxon, and other cognate Indo-European languages : Monier-Williams, Monier, Sir, 1819-1899 : Free Download, Borrow, and Streaming : Internet Archive",
        "author": "BroaderSpectrum",
        "url": "https://archive.org/details/1872sanskriten00moniuoft",
        "text": "",
        "created_utc": 1526702944,
        "upvote_ratio": ""
    },
    {
        "title": "Travel grants for conference",
        "author": "Urmi18",
        "url": "https://www.reddit.com/r/linguistics/comments/8kiul3/travel_grants_for_conference/",
        "text": "[removed]",
        "created_utc": 1526702109,
        "upvote_ratio": ""
    },
    {
        "title": "How did the various Germanic languages eventually coalesce into more-or-less a single German language with different dialects? Another way to ask this is: What happened to those ancient Germanic languages as the Classical age turned into the Middle Ages, and then into the modern age?",
        "author": "assbaring69",
        "url": "https://www.reddit.com/r/linguistics/comments/8kipb1/how_did_the_various_germanic_languages_eventually/",
        "text": "Not sure if right subreddit to post this in. I tried looking for a historical linguistics sub but could not find one. Please tell me if there's any better subs for me to submit this post to.\n\nFor example, what happened to the Frankish language? Where are its descendants today, if any, and how do they differ from German dialects descended from other Germanic languages? (Or is that even how it works? If not, then please enlighten me.) I've always wondered about this. Also, why did Dutch, Frisian, and a lot of other Germanic languages in that vicinity manage to maintain their unique languages while the region that is today known as Germany has all the ancient Germanic languages coalescing into a single language with only different dialects? Or is it simply a matter of arbitrary designation of a speech as language or dialect? (\"A language is just a dialect with an army\", or something to that effect.)",
        "created_utc": 1526700313,
        "upvote_ratio": ""
    },
    {
        "title": "Do speakers of languages with more grammatical rules make more mistakes in speech?",
        "author": "actualsnek",
        "url": "https://www.reddit.com/r/linguistics/comments/8kiflh/do_speakers_of_languages_with_more_grammatical/",
        "text": "How would the grammar/syntax error rates of a native speaker of Toki Pona or Malay \\(correct me if it isn't grammatically simple\\) to those of native speakers of Ancient Greek or Sanskrit?",
        "created_utc": 1526697210,
        "upvote_ratio": ""
    },
    {
        "title": "Language Tree Help",
        "author": "ARC_1",
        "url": "https://www.reddit.com/r/linguistics/comments/8kiefp/language_tree_help/",
        "text": "So about 2 months ago I posted something about a family tree of languages, well I took a break from that, however I recently started working on it again. I was wondering if anyone could correct anything I've done wrong and or tell me what to add. \nDisclaimer: I am not a professional linguist in any way, this is just a hobby of mine. Also this is not done.\nKey: Blue:Dialect, Red: Dead Language, Green:Spoken Language, Yellow: Ceremonial Language \nRed Arrow: Influenced another language\nBlack Arrow: Decedent Language\nThe Tree: https://i.imgur.com/6v5e9xV.jpg\nSmaller Tree: https://i.imgur.com/9OUidvi.jpg",
        "created_utc": 1526696836,
        "upvote_ratio": ""
    },
    {
        "title": "Mora&gt;Syllable&gt;Stress Timing in IE Languages?",
        "author": "ExcitingNothing",
        "url": "https://www.reddit.com/r/linguistics/comments/8kiape/morasyllablestress_timing_in_ie_languages/",
        "text": "Hi,\n\nI am trying to understand Timing in IE languages but cannot find clear answers online. \n\nIs the difference between Mora Timing and Syllable Timing just vowels length?\n\nHow does a Mora-Timed language become syllable timed if not by a loss of long vowels or length distinction?\n\nFor instance Ancient Greek was Mora Timed but Greek is now syllable timed or possibly stress timed. \n\nDoes it go Mora Timed&gt;Syllable&gt;Stress in IE languages?\n\nSlavic languages have long and short vowel distinction so why are they classed as stress-timed? \n\nIs it possible they lost the distinction earlier, became stress timed, and then recreated vowel length distinction on top of stress timing. \n\nThanks",
        "created_utc": 1526695699,
        "upvote_ratio": ""
    },
    {
        "title": "Guus Kroonen: Linguistic supplement to Damgaard et al. 2018: Early Indo-European languages, Anatolian, Tocharian and Indo-Iranian",
        "author": "Alloran",
        "url": "https://zenodo.org/record/1240524",
        "text": "",
        "created_utc": 1526678779,
        "upvote_ratio": ""
    },
    {
        "title": "Graphemes, Sound &amp; Thought",
        "author": "tonguetiedyed",
        "url": "https://www.reddit.com/r/linguistics/comments/8kga07/graphemes_sound_thought/",
        "text": "[removed]",
        "created_utc": 1526675529,
        "upvote_ratio": ""
    },
    {
        "title": "Recommendation for complex sentence analysis?",
        "author": "wotansp",
        "url": "https://www.reddit.com/r/linguistics/comments/8keqs0/recommendation_for_complex_sentence_analysis/",
        "text": "Hey there buddies\n\nFirst of all, thanks for your time. I will need to perform complex sentence analysis and I'm trying to find nice stuff in order to do it properly. I'm pretty good at analyzing simple sentences, but I get really messed when more clauses enter the game :\\_\\( I am pretty much ok at analyzing the different phrases and constituents, but if the recommendations include that even better, reviewing is always a good thing.\n\nAny recommendation? Books, multimedia or whatever. I have... 3 weeks to dominate it. Thank you all!",
        "created_utc": 1526663039,
        "upvote_ratio": ""
    },
    {
        "title": "Bantu verbal extensions, Romance reflexives, Ancient Greek middle, Semitic binyanim, and the derivation/inflection divide.",
        "author": "merijn2",
        "url": "https://www.reddit.com/r/linguistics/comments/8keo14/bantu_verbal_extensions_romance_reflexives/",
        "text": "When I was an undergraduate I was taught in Morphology 101 and Syntax 101 that there is a distinction between derivation and inflection. The following things are regarded as differences between derivation and inflection:\n\n1. Productivity: inflection is always productive, derivation may or may not be productive.\n2. The result of derivation may have a meaning that doesn't directly follow from the meaning of the stem \\+ the meaning of the derivational morpheme, inflection is always predictable.\n3. The result of derivation may be input for other derivations, the result of inflection may not be the input of derivation.\n4. Related to that, derivational morphology is often closer to the stem than inflectional morphology.\n5. One thing that is more intuitive is the idea that derivational morphology often changes the core meaning of the stem, whereas inflectional morphology deals more with things that either are purely grammatical \\(think for instance about accusative case affixes\\) or semantic features that are more peripheral to the meaning of the stem \\(think for instance about tense\\).\n\nOne thing that is often seen at least traditionally in mainstream Generative Grammar as inflection \\(if it is expressed morphologically\\) is the passive. If we look at Latin, a language that expresses the passive morphologically, I think it is clear that passive morphology  doesn't affect the core meaning of the stem, it merely changes how the different arguments are expressed, and if they are expressed at all. It is also productive, all transitive verbs have passives , and its meaning is predictable. I think you could argue about passive being the input for for instance passive participles, but when we come to point 4, at least in Latin the passive is expressed by having a different agreement morpheme, the morpheme that is furthest from the stem.\n\nHowever, if we look at Zulu, a Bantu language, it becomes a bit more problematic. The Zulu passive is productive, and most of the time completely predictable semantically. There are however a very small amount of verbs that have more peculiar meanings: *khola* means to satisfy, *kholwa*, its passive counterpart means to believe in something. The Zulu passive can be input for other derivational morphology, for instance *isithandwa*, which means \"loved one\". Morphologically it is one of the so\\-called verbal extensions, a group of morphemes that directly follow the verb stem. However, as far as I know the passive morpheme is always the last of the verbal extensions if there are more than one, and in the recent past, the tense morpheme and the passive morpheme merge into one morpheme, which is something you would more expect in inflectional morphology.\n\nAs said, the passive morpheme in Zulu is one of the verbal extensions, a group of morphemes that follow the verb stem immediately. The other verbal extensions are clearly derivational affixes morphologically, in that they can feed into other derivation, for instance nominalizations, and they are closest to the verb stem. They vary to which extent they are productive, and to which extent they resulting meaning is predictable. They also vary in to what extent they change the core meaning of a verb; sometimes all the applicative does is add a beneficiary argument to the verb, but in other cases the verbal extensions have a more drastic change in meaning, for instance *buka* \"to look at\" which becomes *bukeka* to be attractive.\n\nThinking about this it struck me that there are a lot of languages where there is verbal morphology that straddles the divide between inflection and derivation. One example is the Ancient Greek middle. The middle is expressed by having different agreement morphemes, which is the part of the verb that is furthest from the stem. I think it doesn't take part in other derivational morphology like nominalizations. However its meaning is often not quite predictable, and although sometimes it is just used as a passive or reflexive, which I would argue doesn't really change the meaning of the verb that much, sometimes the change in meaning can be more fundamental \\(I remember a case that was \"giving away\" changing into \"selling\"\\). In Romance languages, of which I don't know that much,  you have the reflexive, which you could even argue isn't even morphological, but still the meaning of the reflexive verbs is as far as I know not always quite predictable. I'd argue, based on the little that I know of Hebrew and Arabic, that the binyanim in Semitic also straddle the line between inflection and derivation.\n\nNow I know that the divide between inflection and derivation that I learned in syntax and morphology 101 is not something that is universally accepted. It is my impression that nowadays the vast majority of linguists reject a sharp divide between the two, and personally I also don't believe in such a sharp line. Yet I wondered if other people have written about this type of verbal derivation with the question in mind what this says about the divide between inflection and derivation. Also I wonder if other people know of cases of verbal derivation that straddles this line in other languages.",
        "created_utc": 1526662413,
        "upvote_ratio": ""
    },
    {
        "title": "Mandarin Vocab",
        "author": "Words_Music",
        "url": "https://www.reddit.com/r/linguistics/comments/8kej80/mandarin_vocab/",
        "text": "Hi there,\n\nI was wondering if you could shed light on how mandarin vocab changed so dramatically from the other sintic languages? Whilst the other languages have different preferred forms - they seem to be mostly original uses, whilst the mandarin ones seem to be completely different words, ie. the word for drink used to be stutter.\n\n(edited as I meant stutter not thirst!)",
        "created_utc": 1526661331,
        "upvote_ratio": ""
    },
    {
        "title": "[Help] Survey of English Dialects (1952) — Can't find questionnaire",
        "author": "Zarorg",
        "url": "https://www.reddit.com/r/linguistics/comments/8ke8ic/help_survey_of_english_dialects_1952_cant_find/",
        "text": "Hi all,\n\nCurrently attempting to do some research into dialects in northern England, and I'm reading a lot about this [*Survey of English Dialects*](https://en.wikipedia.org/wiki/Survey_of_English_Dialects) from the fifties. Regularly mentioned is the \"1,300 question questionnaire\" used by Mr. Ellis and his friends to gather data, yet I can't actually find these questions anywhere.\n\nWould anybody know where it could be found? It would be useful by allowing me to build my methodology and questions on top of what's been done before, rather than just making my own from scratch.\n\nTL;DR: Give me a PDF of the Survey of English Dialects questionnaire booklet, please.",
        "created_utc": 1526658987,
        "upvote_ratio": ""
    },
    {
        "title": "Help with grammaticalization",
        "author": "Miliel",
        "url": "https://www.reddit.com/r/linguistics/comments/8kdlrx/help_with_grammaticalization/",
        "text": "Hello, everyone! I'm currently doing a literature review about verbs' behavior and grammaticalization under the Cognitive Linguistics umbrella. I'm having a hard time finding a recent paper about these things. It would be awesome if you guys could point me some papers about this or some sites you use.",
        "created_utc": 1526653893,
        "upvote_ratio": ""
    },
    {
        "title": "Are there any resource talking about Latin diverging into the different romance languages?",
        "author": "Hugh__Janus",
        "url": "https://www.reddit.com/r/linguistics/comments/8kdgw6/are_there_any_resource_talking_about_latin/",
        "text": "I'm working on a project about the shift of Latin to the modern romance languages and I want to know if there are any post classical historians or modern day etymologists who go into depth about the shift from vulgar Latin into something different, whether that be French, Spanish, or Italian. I appreciate anything you can find.",
        "created_utc": 1526652746,
        "upvote_ratio": ""
    },
    {
        "title": "Child's language skills in kindergarten can predict his or her future proficiency in other subjects",
        "author": "vili",
        "url": "http://www.washington.edu/news/2018/05/17/want-to-help-your-child-succeed-in-school-add-language-to-the-math-reading-mix/",
        "text": "",
        "created_utc": 1526647952,
        "upvote_ratio": ""
    },
    {
        "title": "Laurel or Yanny? - Audio Button App",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/linguistics/comments/8kcvdq/laurel_or_yanny_audio_button_app/",
        "text": "[removed]",
        "created_utc": 1526647447,
        "upvote_ratio": ""
    },
    {
        "title": "Publish your research findings of Language and Cognition in IHCI 2018",
        "author": "ihciconf",
        "url": "https://www.reddit.com/r/linguistics/comments/8kclt5/publish_your_research_findings_of_language_and/",
        "text": "[removed]",
        "created_utc": 1526644784,
        "upvote_ratio": ""
    },
    {
        "title": "favorite vowel shift in language/dialect/regional accent?",
        "author": "JkValucia",
        "url": "https://www.reddit.com/r/linguistics/comments/8kcjir/favorite_vowel_shift_in_languagedialectregional/",
        "text": "[removed]",
        "created_utc": 1526644079,
        "upvote_ratio": ""
    },
    {
        "title": "JSTOR - article on ludlings (secret language games)",
        "author": "bil-sabab",
        "url": "https://daily.jstor.org/super-secret-world-ludlings-know-kids/",
        "text": "",
        "created_utc": 1526627378,
        "upvote_ratio": ""
    },
    {
        "title": "Are there any languages which are small/are spoken in small countries, but have a lot of dialects?",
        "author": "viktor77727",
        "url": "https://www.reddit.com/r/linguistics/comments/8kb5be/are_there_any_languages_which_are_smallare_spoken/",
        "text": "And vice versa - are there any languages that are big/spoken in large countries, but don't have many dialects?",
        "created_utc": 1526625663,
        "upvote_ratio": ""
    },
    {
        "title": "Why is the Polish spelling so different from other Slavic languages?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/linguistics/comments/8kb2rb/why_is_the_polish_spelling_so_different_from/",
        "text": "[deleted]",
        "created_utc": 1526624731,
        "upvote_ratio": ""
    },
    {
        "title": "Why is there a folk name for sunshowers in almost every culture",
        "author": "Rimbaud33",
        "url": "https://www.reddit.com/r/linguistics/comments/8kahc4/why_is_there_a_folk_name_for_sunshowers_in_almost/",
        "text": "Maybe many of you know already that there are weird sunshower names in most cultures around the world, in Japan they say that a fox is getting married, in USA the devil is beating his wife, I didn't know but apparently in my country (Mexico) we say a witch is getting married and so on. I have found this parallelisms: there is someone who is seen as either evil or clever (at least in Mexico there are sayings about how the devil is smart, for example \"the devil is more wise because he is old than for being the devil\") also it can be a trickster but generally a negative but intelligent being. Another characteristic in common is that it often involves some kind of wedding, either the devil and his wife or someone getting married. I can see why this could have originated, sun and rain are opposites and they are combined, like in a wedding, but it is almost surreal because of how you'd expect it never to happen. My question here is: Why is it such a widespread phenomenon? And it adapts to places and cultures but most languages have a variant of this. How can this be a coincidence??? It can't be something inherent to human culture, it's a very specific concept and almost universal thing with most cultures . I have found a lot of compilations but couldn't find any information on why this happened. Any theories or explanations?\n\n Edit: there's a list with a lot of examples from all the world in Wikipedia from different sources: \nhttps://en.m.wikipedia.org/wiki/Sunshower\n\nOne of the sources:\nhttps://linguistlist.org/issues/9/9-1795.html \n\nAnd the results of a survey in the US:\nhttps://www4.uwm.edu/FLL/linguistics/dialect/staticmaps/q_80.html \n\nTLDR: There are lots of variants of a very specific phrase throughout the world \n\nEdit TLDR:It exists in places as different and/ or isolated as Japan (and it's a very very old phrase about ancient folklore) Korea, nepal, Thailand,India, Bangladesh, sri lanka, Vietnam. In Africa (Zulu, Afrikaans, in Kenia, Tanzania, Zimbabwe ) Australia, US, Mexico, south America, Canada France, Russia, Belgium, Sweden, Ethiopia, Hawaii, Phillines, middle east (Arab, Iran, Serbia ), Hebrew and many, many many more. ",
        "created_utc": 1526617381,
        "upvote_ratio": ""
    },
    {
        "title": "Why is there so much variation in \"yes\" across Indo-European languages?",
        "author": "samajors",
        "url": "https://www.reddit.com/r/linguistics/comments/8k8kyz/why_is_there_so_much_variation_in_yes_across/",
        "text": "I'm not very educated in linguistsics, but it seems to me that across Indo-European languages it's common for the word meaning \"no\" to start with an n sound (no, non, нет, etc.), but there seems to be a lot more variation in words for \"yes\" (yes, si, oui, да, and more). Again, this is just my impression, but if it's correct, does anyone know why?",
        "created_utc": 1526598227,
        "upvote_ratio": ""
    },
    {
        "title": "I'm not sure if this the right place to ask but I have a question about the transcription of the pronunciations of words in Merriam-Webster's online dictionary...",
        "author": "ARMunsilenced",
        "url": "https://www.reddit.com/r/linguistics/comments/8k8f0b/im_not_sure_if_this_the_right_place_to_ask_but_i/",
        "text": "SO for some words I've noticed the transcription will read something like this :  \\ sə¦rendə¦rē \\, however, in their giude for how to understand the pronunciation transcriptions, there's no mention of the character ¦. Does anyone know what this means?\n\nI've sort of assumed it's to do with stress as often these entries don't contain the normal markers for stress they use (ˈ for main stress and ˌ for secondary stress, eg \\ im-ˌplȯ(i)-ˈē \\) but I could be completely wrong about this.\n\nAnt help greatly appreciated. ",
        "created_utc": 1526596713,
        "upvote_ratio": ""
    },
    {
        "title": "Is There Such a Thing as Truth?",
        "author": "121531",
        "url": "http://bostonreview.net/politics/errol-morris-there-such-thing-truth",
        "text": "",
        "created_utc": 1526596370,
        "upvote_ratio": ""
    },
    {
        "title": "Can somebody help me distinguish between linguistics, philosophy of language, semiology, and semiotics?",
        "author": "foxxytroxxy",
        "url": "https://www.reddit.com/r/linguistics/comments/8k76li/can_somebody_help_me_distinguish_between/",
        "text": "[removed]",
        "created_utc": 1526586714,
        "upvote_ratio": ""
    },
    {
        "title": "Why are there no other native languages of England?",
        "author": "TheIrishJJ",
        "url": "https://www.reddit.com/r/linguistics/comments/8k60xs/why_are_there_no_other_native_languages_of_england/",
        "text": "In other parts of Europe, such as France, Italy, Germany, Poland, etc. people have H and L languages, but England doesn't. Except maybe with the exception of Cornish, English people speak English at home, English at school, English at work, etc. Why is it not like in other countries, such as parts of Poland, where you might speak Kashubian at home and Polish at work, or Germany, where you speak Low German or High German at home, but if you went to another part of Germany you would speak Standard Germany.  \n\nI know England has dialects of English, but they're not different enough so that spelling changes or slight grammar changes are used.  \n\nWhy is it so different in England/with English than other countries/languages?",
        "created_utc": 1526577859,
        "upvote_ratio": ""
    },
    {
        "title": "Which would be more useful for a linguist?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/linguistics/comments/8k4wk9/which_would_be_more_useful_for_a_linguist/",
        "text": "[removed]",
        "created_utc": 1526569270,
        "upvote_ratio": ""
    },
    {
        "title": "Why do many languages have some form of (what seems to me) rough alliteration for question words?",
        "author": "apple1rule",
        "url": "https://www.reddit.com/r/linguistics/comments/8k4oyt/why_do_many_languages_have_some_form_of_what/",
        "text": "Like in english: Who, what, where, when\n\nSpanish: Cuándo, Cómo, Cuánto + Quién, Qué\n\nGreek: Pote, pou, pos, poso, Poios\n\nTurkish: Nerede, niye, nasil, neden, neresi\n\nDanish: Hvem, hvad, hvor, hvornår\n\nand in relatively different languages too, it's a similar occurrence:\n\nHindi: kaun, kya, kahaan, kab\n\n\n\n\nIs there any sort of significance to this? Could not find anything online.",
        "created_utc": 1526567541,
        "upvote_ratio": ""
    },
    {
        "title": "Where did the use of “whenever” instead of “when” come from?",
        "author": "DranoCleanse",
        "url": "https://www.reddit.com/r/linguistics/comments/8k4ndd/where_did_the_use_of_whenever_instead_of_when/",
        "text": "Just noticed this upon moving to the American Midwest. For example, my coworker said “Whenever our boss was out sick last Wednesday, I covered her shift.” She’s referring to a single instance, by says “whenever.” I’ve only heard it from people who grew up in the Midwest and deep south.",
        "created_utc": 1526567162,
        "upvote_ratio": ""
    },
    {
        "title": "Is Tamil the oldest language?",
        "author": "eternal_optinist",
        "url": "https://www.reddit.com/r/linguistics/comments/8k3bu9/is_tamil_the_oldest_language/",
        "text": "[removed]",
        "created_utc": 1526554391,
        "upvote_ratio": ""
    },
    {
        "title": "are there languages without prefixes and suffixes?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/linguistics/comments/8k234r/are_there_languages_without_prefixes_and_suffixes/",
        "text": "[removed]",
        "created_utc": 1526538418,
        "upvote_ratio": ""
    },
    {
        "title": "How did we develop language for more abstract concepts like waiting or feeling sad?",
        "author": "cactuscobbler",
        "url": "https://www.reddit.com/r/linguistics/comments/8k1q8m/how_did_we_develop_language_for_more_abstract/",
        "text": "If I'm wrong on any of this, please correct me. I'm not saying anything definite, I'm just saying what I perceive to be true:\n\nMost early forms of written communication were pictographic, no? I mean you have the Chinese writing system, the hieroglyphs. It'd make sense that you'd more or less \"draw\" whatever you were trying to describe.\n\nThis makes more sense than giving meaning to specific arrangements of letters that are meaningless individually (I'm talking about forming words in alphabets where you reuse letters like cyrillic, greek, roman etc.). When did we develop a method to describe things with words? How did we do this? Did it arise out of a cultural necessity? Or was cerebral evolution a literal prerequisite to allow us to start communicating more \"complex\" thoughts with language? \n\nSuccinctly, I'm asking how we moved on from \"Hungry. food.\" to more complex thought and describing things outside of the obvious, like more emotional and philosophical things that aren't obviously evident in nature.",
        "created_utc": 1526534479,
        "upvote_ratio": ""
    },
    {
        "title": "As a non-linguist and lover of doggos, I am very interested in linguists’ initial impressions of r/ilikthebred.",
        "author": "ellivibrutp",
        "url": "http://www.reddit.com/r/ilikthebred",
        "text": "",
        "created_utc": 1526533461,
        "upvote_ratio": ""
    },
    {
        "title": "I absolutely cannot roll my r's!! Agh I'm so frustrated! Help!",
        "author": "Treadmilloo",
        "url": "https://www.reddit.com/r/linguistics/comments/8k1aq1/i_absolutely_cannot_roll_my_rs_agh_im_so/",
        "text": "[removed]",
        "created_utc": 1526530094,
        "upvote_ratio": ""
    },
    {
        "title": "Why do pronouns have a gender?",
        "author": "theUnmutual6",
        "url": "https://www.reddit.com/r/linguistics/comments/8k1568/why_do_pronouns_have_a_gender/",
        "text": "Here's a thing I've been scratching my head about for a while.\n\nPeople are pretty resistant to the idea of \"new gender\" pronouns \\- but what flummoxes me is why pronouns are linked to gender in the first place.\n\nPronouns just refer to a noun, so you could imagine a society where the pronouns were:\n\n* king, elder, married person, child\n* hunter, weaver, farmer, warrior\n* Clean, unclean, outsider\n* Person to whom I owe respect, Person from whom I demand respect\n\netc etc etc etc. \n\nI see people make fun of the really wacky neo\\-pronouns, like roe/roeself for people who identify with/are/really like deer \\- I personally think it's rather fun. But most of all, what I see is a cool linguistics challenge, and a mystery. Because actually, there's no good reason \\- as far as I know \\- why an ancient Celtic family with a Roe Deer patron, who saw themselves as the children of the deer, shouldn't develop familial pronouns expressing \"That person who is like a deer says...\", as we use pronouns to express \"That person who is a man says...\". And another family in the area, descended from the Eagle, use a pronoun expressing \"That person who is an eagle...\" and so on. \n\nI found a list of \"royalty &amp; deity themed pronouns\", which I'm sure no one's actually ever used \\- and yet, the idea of a society having a pronoun which they use exclusively to refer to a leader or god seems very possible. In fact, Christianity does this a bit by referring to God as He and talking about His works and His plan \\- the capital letter denoting this is arguably a different pronoun to the pronoun he/his, referring only to mortal males. \n\n**TLDR**\n\nIn English pronouns stand in place of a noun, and they also communicate something about the social role or appearance of the noun. Some things I'd like to learn/discuss:\n\n* Why didn't we develop pronouns which refer to a characteristic which isn't gender? Because it seems super plausible.\n* Are there any real world languages you know which use different characteristics in a pronoun? Such as respect, age, family, marital status, etc. Why did those languages develop differently?\n* Tracing back the family tree of languages, when was this first a thing? Where did it come from? Do we have any idea why?  \n\nMy best theory is that practical pronouns must refer to something you can deduce just by looking \\- gender as appearance, rather than social role. Maybe gender is more universally recognised across cultures than a \"local\" pronoun system, and any which did exist are long gone. Still \\- in a society with strict rules about clothes, where you could easily spot a priest, an unbearded youth or a man with a bordered toga; or a system based on age, where one use a different pronoun for your elders; or in small communities where relationships would be known to all...\n\n*\\(NB \\- not wild about debating the validity of trans identities or making fun of people or talking about the modern use of gender\\-neutral language, or any related politics. Just want to talk development of language, and figure out where this came from. Thank you!\\)*",
        "created_utc": 1526528563,
        "upvote_ratio": ""
    },
    {
        "title": "A large, very popular Facebook group has developed an interesting way of using English",
        "author": "Doctor_Oceanblue",
        "url": "https://www.reddit.com/r/linguistics/comments/8k0yc0/a_large_very_popular_facebook_group_has_developed/",
        "text": "https://www.facebook.com/groups/865200613646902/\n\nI don't have a particular question pertaining to this, I just think you all might find this interesting. This is pretty much just a group where people post cat pictures, but the users have developed some odd, funny language \"rules.\" They include: using the letter \"m\" instead of \"n\" at all times; if a word ends with the letter \"m,\" it is followed by the letter \"b;\" \"hamb,\" \"catto,\" and \"cade\" all mean \"cat;\" emphasizing words or phrases by putting them in multiple parentheses or brackets (sometimes both.) For the most part, nobody got together and said \"okay, this is what the language rules are going to be,\" but there are some instances where this did happen. For example, the rules say you are not allowed to put any words in triple parentheses because of the anti-Semitic implications. Also, while the word \"himb\" means \"him,\" it was recently agreed that no one can use \"herm\" to mean \"her\" because of the word's use in other places as a slur against Intersex people. There are other meme communities where people use invented words and language rules, but I feel like this is the one where it's most prevalent. \n\nHas there ever been research on the development of language in internet subcultures? If so, are there any well-known phenomena at play here? (Also, if Hambpostimg has already been talked about in this sub, pardon me.) ",
        "created_utc": 1526526682,
        "upvote_ratio": ""
    },
    {
        "title": "What causes certain suffixes to be added to words in German? Are there rules for adding -bar vs -sam vs -lich etc?",
        "author": "shouldiworryx",
        "url": "https://www.reddit.com/r/linguistics/comments/8jzidj/what_causes_certain_suffixes_to_be_added_to_words/",
        "text": "I meant to say added to adjectives not words. I've tried asking in r/german but couldn't get an answer. Thanks in advance.",
        "created_utc": 1526513122,
        "upvote_ratio": ""
    },
    {
        "title": "I have a bit of a ‘gay accent’. Is there any way to get rid of it?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/linguistics/comments/8jzhh0/i_have_a_bit_of_a_gay_accent_is_there_any_way_to/",
        "text": "[deleted]",
        "created_utc": 1526512895,
        "upvote_ratio": ""
    },
    {
        "title": "How come the word Emergency which refers to some dire situation contains the word Emergence. Does this words and their meaning share similar implications, or they are not related in any awful-human-meaning-seeking way?",
        "author": "Cognicious",
        "url": "https://www.reddit.com/r/linguistics/comments/8jzdem/how_come_the_word_emergency_which_refers_to_some/",
        "text": "[removed]",
        "created_utc": 1526511905,
        "upvote_ratio": ""
    },
    {
        "title": "English teacher looking for a path",
        "author": "percival369",
        "url": "https://www.reddit.com/r/linguistics/comments/8jz3sj/english_teacher_looking_for_a_path/",
        "text": "Hi, I’m an English teacher in high schools, I have taught for four and a half years and found that the literature degree I studied didn’t set me up for teaching the moving parts of the language. \n\nI want to help the students studying so much and I want to start on a strong foot next year. So I was hoping someone could guide me to some resources which are easy for me to digest and implement which teach reasons for spelling and grammar etc. I would like to use phonetic language and teach like they would English as a second language. \n\nPS: I am a history fan so the history of language would appeal as well.\n\nThanks in advance.",
        "created_utc": 1526509589,
        "upvote_ratio": ""
    },
    {
        "title": "X-Post from /r/science: Hesitation Markers and Pauses Before Nouns",
        "author": "Cho_Zen",
        "url": "http://www.pnas.org/content/early/2018/05/09/1800708115",
        "text": "",
        "created_utc": 1526508147,
        "upvote_ratio": ""
    },
    {
        "title": "Please read my abstract and tell me your honest commentary/opinion about the research I'm doing",
        "author": "nightwica",
        "url": "http://www.pluricentriclanguages.org/ndv-conf-nitra-2018/ABSTRACTS/036.%20Katona%20Abstract%206.%2",
        "text": "",
        "created_utc": 1526504778,
        "upvote_ratio": ""
    },
    {
        "title": "A DP(-shell)-analysis for object CPs in English?",
        "author": "death_by_abstraction",
        "url": "https://www.reddit.com/r/linguistics/comments/8jyf21/a_dpshellanalysis_for_object_cps_in_english/",
        "text": "The idea that subject CPs / clausal subjects have DP\\-status \\(or, at least, DP properties\\) is fairly old \\(Rosenbaum 1967\\) and, by now, pretty established — no help required here. But does anybody know of theoretical or empirical diagnostics suggesting that the same holds for objects CPs / clausal objects? It seems to be the common view that DP\\-hood is only generated for clauses in what we perceive as the subject position \\(but what might just as well be Spec,TopicP\\), but not for CP complements that remain in situ. If there are any thoughts out there that might challenge this pattern, I'd be eternally grateful if you could leave a comment. ",
        "created_utc": 1526504003,
        "upvote_ratio": ""
    },
    {
        "title": "Help finding articles/chapters/books applying Optimality Theory to European Portuguese phonology",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/linguistics/comments/8jxoes/help_finding_articleschaptersbooks_applying/",
        "text": "I'm trying to find academic material \\(ideally journal articles\\) that address phonological topics in *European* Portuguese and apply OT analysis. As with all linguistic matters, there's considerably more out there available on Brazilian Portuguese.\n\nThis is technically for a comparison paper I need to write: I'm to compare two different articles addressing the same phenomenon and analyse the approaches. But since I'm having such a devil of a time finding actual articles, I'm hoping to use this subreddit's hivemind \\(if I'm using that correctly\\) to share articles that people may know, and then I can sift through and see if similar phenomena are addressed. Thank you!\n\n\\(Note to modes: Since I'm only asking for help in finding the articles, I don't think this should violate rule 6\\(b\\).\\)",
        "created_utc": 1526498338,
        "upvote_ratio": ""
    },
    {
        "title": "English only language to omit article in headline or title",
        "author": "pataki9",
        "url": "https://www.reddit.com/r/linguistics/comments/8jwwkd/english_only_language_to_omit_article_in_headline/",
        "text": "[removed]",
        "created_utc": 1526492529,
        "upvote_ratio": ""
    },
    {
        "title": "Laurel vs. Yanny Debate? We Made a Tool to Help You Hear Both",
        "author": "fuchsely",
        "url": "https://www.nytimes.com/interactive/2018/05/16/upshot/audio-clip-yanny-laurel-debate.html",
        "text": "",
        "created_utc": 1526489216,
        "upvote_ratio": ""
    },
    {
        "title": "I need some help with phonetic transcription",
        "author": "Meowsticly",
        "url": "https://www.reddit.com/r/linguistics/comments/8jw5gf/i_need_some_help_with_phonetic_transcription/",
        "text": "[removed]",
        "created_utc": 1526487041,
        "upvote_ratio": ""
    },
    {
        "title": "Is there a term for using the same word in two sentences back to back? An example would be “Lets figure something out soon. I’ll be available on evenings soon.”",
        "author": "lichenvar",
        "url": "https://www.reddit.com/r/linguistics/comments/8jvw78/is_there_a_term_for_using_the_same_word_in_two/",
        "text": "[removed]",
        "created_utc": 1526485123,
        "upvote_ratio": ""
    },
    {
        "title": "Higher Ed Wednesday - May 16, 2018",
        "author": "AutoModerator",
        "url": "https://www.reddit.com/r/linguistics/comments/8judks/higher_ed_wednesday_may_16_2018/",
        "text": "Hello all and welcome to another edition of Higher Ed Wednesday, an expansion of the Grad School Wednesday posts. This is a thread where prospective students can ask questions about university programs at any level, either general (e.g. \"How often should a grad student present at conferences?\") or particular (e.g. \"Which schools in North America have strong programs in Korean linguistics?). It's also a chance for current students to find out information about other programs (e.g. \"How many of you have reading lists for your comprehensive exams?\") or general university survival (e.g. \"Is it a really bad idea to change my thesis supervisor if we don't click?\"). So ask away!\n",
        "created_utc": 1526472401,
        "upvote_ratio": ""
    },
    {
        "title": "Agglutinative Languages",
        "author": "jjaekksseun",
        "url": "https://www.reddit.com/r/linguistics/comments/8juc0c/agglutinative_languages/",
        "text": "Do people that speak agglutinative langauges think of really long words like \"Muvaffakiyetsizleştiricileştiriveremeyebileceklerrimizdenmişsinizcesine\" as one really long word or multiple really short words? ",
        "created_utc": 1526471985,
        "upvote_ratio": ""
    },
    {
        "title": "Why Nouns Slow Us Down, and Why Linguistics Might Be in a Bubble",
        "author": "l33t_sas",
        "url": "https://www.newyorker.com/elements/lab-notes/why-nouns-slow-us-down-and-why-linguistics-might-be-in-a-bubble",
        "text": "",
        "created_utc": 1526465870,
        "upvote_ratio": ""
    },
    {
        "title": "Alvin Boyd Kuhn: The Esoteric Structure Of The Alphabet",
        "author": "BroaderSpectrum",
        "url": "https://archive.org/details/AlvinBoydKuhnTheEsotericStructureOfTheAlphabet",
        "text": "",
        "created_utc": 1526449893,
        "upvote_ratio": ""
    },
    {
        "title": "Has there been any attempt to recreate Common Brytonnic like they did with PIE?",
        "author": "bridgekit",
        "url": "https://www.reddit.com/r/linguistics/comments/8jr53i/has_there_been_any_attempt_to_recreate_common/",
        "text": "I'm looking for some resources about common Brytonnic (ancestor to Welsh, Cornish, Breton, etc.) but all I can find says that we have no real written record of it. Has anyone attempted to reconstruct it using old Welsh, old breton, etc? And if not are there any resources I could use to possibly try it myself? ",
        "created_utc": 1526434978,
        "upvote_ratio": ""
    },
    {
        "title": "Is there a good resource for how to transliterate the constructed PIE orthography system to the English alphabet?",
        "author": "ijflwe42",
        "url": "https://www.reddit.com/r/linguistics/comments/8jqqyd/is_there_a_good_resource_for_how_to_transliterate/",
        "text": "PIE has lots of modified letters/symbols like h₁, ǵʰ, bʰ, and some words seem to have a capital letter at the end (*tuH).\n\nI’d like to have a more intuitive understanding of how to pronounce these words.",
        "created_utc": 1526431573,
        "upvote_ratio": ""
    },
    {
        "title": "A Linguist Explains Why 'Laurel' Sounds Like 'Yanny': It's the audio version of The Dress.",
        "author": "sacundim",
        "url": "https://www.theatlantic.com/technology/archive/2018/05/dont-rest-on-your-laurels/560483/",
        "text": "",
        "created_utc": 1526429390,
        "upvote_ratio": ""
    },
    {
        "title": "Halle memorial - link to video (Chomsky and many others)",
        "author": "AlabasterOnion",
        "url": "http://whamit.mit.edu/2018/05/14/memorial-for-morris-halle/",
        "text": "",
        "created_utc": 1526429006,
        "upvote_ratio": ""
    },
    {
        "title": "Tools to help study Latin verbal agreement",
        "author": "Nekisch",
        "url": "https://www.reddit.com/r/linguistics/comments/8jpoeh/tools_to_help_study_latin_verbal_agreement/",
        "text": "[removed]",
        "created_utc": 1526422285,
        "upvote_ratio": ""
    },
    {
        "title": "Auditory illusion: do you hear \"Laurel\" or \"Yanny\"? (Phonetic explanation in comments)",
        "author": "[deleted]",
        "url": "https://twitter.com/CloeCouture/status/996218489831473152?s=19",
        "text": "[deleted]",
        "created_utc": 1526419615,
        "upvote_ratio": ""
    },
    {
        "title": "Question on the prevalence of some words and grammatical features in English, and when to use them",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/linguistics/comments/8jp7ef/question_on_the_prevalence_of_some_words_and/",
        "text": "[removed]",
        "created_utc": 1526418588,
        "upvote_ratio": ""
    },
    {
        "title": "Definition of hangzóhiányos igetővek",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/linguistics/comments/8jo9lr/definition_of_hangzóhiányos_igetővek/",
        "text": "[deleted]",
        "created_utc": 1526411534,
        "upvote_ratio": ""
    },
    {
        "title": "Are \"word scramble\" puzzles easier in languages with higher consistency between symbols and phonemes?",
        "author": "KushlungsMcBone",
        "url": "https://www.reddit.com/r/linguistics/comments/8jnno0/are_word_scramble_puzzles_easier_in_languages/",
        "text": "So I came across a word scramble: H O M E R T. I realized in a few seconds it was \"mother\", but it took me much longer than most word scrambles at that level and length would take me. I think this is because \"t\" and \"h\" separately are the voiceless alveolar stop and the  voiceless glottal fricative; nothing about that word scramble indicates that there is a voiced dental fricative (ð) in the word. I was wondering if this lack of visual-phonetic consistency makes these kinds of puzzles harder in languages that rely on combinations of symbols to make specific sounds (like the english \"th\") or inconsistent phonetic-graphic correlations (like the \"eau\" in \"beautiful\" and \"you\" being phonetically identical) as opposed to more phonetically consistent languages (i.e. Spanish, Italian) or purely phonetic writing systems (i.e. Japanese hiragana)",
        "created_utc": 1526407103,
        "upvote_ratio": ""
    },
    {
        "title": "Can you guys tell me what language is this?",
        "author": "RaphK20",
        "url": "https://www.reddit.com/r/linguistics/comments/8jnk7a/can_you_guys_tell_me_what_language_is_this/",
        "text": "[removed]",
        "created_utc": 1526406363,
        "upvote_ratio": ""
    },
    {
        "title": "About how far back can an English speaker today still understand the language with relative ease?",
        "author": "-Mamba-",
        "url": "https://www.reddit.com/r/linguistics/comments/8jmvic/about_how_far_back_can_an_english_speaker_today/",
        "text": "[removed]",
        "created_utc": 1526401279,
        "upvote_ratio": ""
    },
    {
        "title": "How does your speech differ from your native language's standard?",
        "author": "JoseElEntrenador",
        "url": "https://www.reddit.com/r/linguistics/comments/8jmuq5/how_does_your_speech_differ_from_your_native/",
        "text": "[removed]",
        "created_utc": 1526401106,
        "upvote_ratio": ""
    },
    {
        "title": "Any Turkish speakers here? Need some help with Turkish 'adpositions'",
        "author": "aroused_badger",
        "url": "https://www.reddit.com/r/linguistics/comments/8jk20y/any_turkish_speakers_here_need_some_help_with/",
        "text": "Doing a Syntax report on adpositions by comparing two languages. Turkish is one of them. \n\nWould anyone be able to give me some examples with glosses of turkish sentences containing adpositions. This is a tough topic and I'm having trouble wrapping my head around it, so if there are any additional comments you want to make about how Turkish encodes location,  movement etc in its suffixes that would be of great help. Just trying to gain a broader understanding and some of the literature out there is a bit inaccessible.\n\nCheers",
        "created_utc": 1526373938,
        "upvote_ratio": ""
    },
    {
        "title": "The evolution of language? There's an app for that",
        "author": "wintz",
        "url": "https://phys.org/news/2018-05-evolution-language-app.html",
        "text": "",
        "created_utc": 1526369531,
        "upvote_ratio": ""
    },
    {
        "title": "Family tree of scripts descended from the Egyptian Hieroglyphics",
        "author": "[deleted]",
        "url": "https://i.redd.it/0umr623yqyx01.png",
        "text": "[deleted]",
        "created_utc": 1526365614,
        "upvote_ratio": ""
    },
    {
        "title": "Anybody body else out there who can selectively hear their native language as just sounds and shut off the processing/ semantic aspect? Exploring the idea of tuning out the interpretation and just experiencing the sensory information as if your native language were foreign toyou like pre-lingual",
        "author": "billy_r_williams",
        "url": "https://www.reddit.com/r/linguistics/comments/8jjatb/anybody_body_else_out_there_who_can_selectively/",
        "text": "[removed]",
        "created_utc": 1526363740,
        "upvote_ratio": ""
    },
    {
        "title": "Speakers hesitate or make brief pauses filled with sounds like “uh” or “uhm” mostly before nouns. Such slow-down effects are far less frequent before verbs.",
        "author": "vili",
        "url": "http://www.media.uzh.ch/en/Press-Releases/2018/Speech.html",
        "text": "",
        "created_utc": 1526361556,
        "upvote_ratio": ""
    },
    {
        "title": "Nahuatl",
        "author": "jjaekksseun",
        "url": "https://www.reddit.com/r/linguistics/comments/8je98x/nahuatl/",
        "text": "[removed]",
        "created_utc": 1526319893,
        "upvote_ratio": ""
    },
    {
        "title": "Why does the accent of 4-syllabled -ism word fall on the first syllable?",
        "author": "mteechan",
        "url": "https://www.reddit.com/r/linguistics/comments/8jde7k/why_does_the_accent_of_4syllabled_ism_word_fall/",
        "text": "E.g. rhotacism, criticism.\n\nCompare meCHAnical/MEchanism",
        "created_utc": 1526313457,
        "upvote_ratio": ""
    },
    {
        "title": "Historical Spelling",
        "author": "jjaekksseun",
        "url": "https://www.reddit.com/r/linguistics/comments/8jcf4d/historical_spelling/",
        "text": "I know that languages like Thai and Tibetan have very extreme cases of historical spelling, as those languages have not had a spelling reform for hundreds of years. When was the last the last time English got a spelling reform and are there any examples of historical spelling in languages like English or Spanish?",
        "created_utc": 1526306124,
        "upvote_ratio": ""
    },
    {
        "title": "This week's Q&amp;A thread -- please read before asking or answering a question! - May 14, 2018",
        "author": "AutoModerator",
        "url": "https://www.reddit.com/r/linguistics/comments/8jc18p/this_weeks_qa_thread_please_read_before_asking_or/",
        "text": "Do you have a quick question about language or linguistics that doesn’t merit its own thread? Our weekly Q&amp;A thread is the perfect place to post them! A new Q&amp;A thread goes up every Monday, but we have people who read them regularly throughout the week.\n\n**What counts as a “quick question”?**\n\nAny question that can be answered in a single comment and is unlikely to generate discussion is a quick question. While it’s impossible to predict which questions will generate disscussion all of the time, here are some examples: \n\n*Quick questions:*\n\n* Asking for an explanation of a technical term\n* Asking if there are any languages with a particular feature\n* Asking how we would transcribe something\n* Asking how a feature works in a particular language\n\n*Not-so-quick questions:*\n\n* Asking about the theoretical or methodological motivation for a particular claim\n* Asking for reading recommendations for a particular subject\n\nIf you’re not sure where your question belongs, just use your best judgment. The mods might ask you to move your question—but if so, it’s no big deal, and has nothing to do with the quality of the question.\n\nAlso, before asking a question, please be sure to check [**our FAQ**](https://www.reddit.com/r/linguistics/wiki/faqindex) and to do a quick Google or Wikipedia search. We’re happy to answer questions, but we appreciate it when people have tried to do some basic research first. You may also be interested in our [**reading list**](https://www.reddit.com/r/linguistics/wiki/readinglist).\n\n**Commenting rules**\n\nThe rules for commenting in this post are the same as for the rest of /r/linguistics. You don’t have to be a flaired user to answer questions, but we expect answers to reflect an expert level of knowledge. Please familiarize yourself with [**our commenting policy**](https://www.reddit.com/r/linguistics/comments/1u9xsr/reminder_of_the_rlinguistics_commenting_policy/) and [**our subreddit rules**](https://www.reddit.com/r/linguistics/wiki/rules).\n\n**What if I didn't get an answer to my question last week?**\n\nYour question probably wasn’t answered because no one who knew the answer saw it. This could be because you posted it soon before the new Q&amp;A thread went up, or it could be because it the answer requires specialist knowledge.  If this happens, feel free to repost your question in the new Q&amp;A thread, or to post it as a separate thread.",
        "created_utc": 1526302835,
        "upvote_ratio": ""
    },
    {
        "title": "How close are modern Mayan languages to what they were when the first conquistadors arrived?",
        "author": "mb2396",
        "url": "https://www.reddit.com/r/linguistics/comments/8jbbxt/how_close_are_modern_mayan_languages_to_what_they/",
        "text": "How did the killings and the Spanish supremacy affect the Mayan languages in Mayan-speaking areas? Are the modern dialects very different (from a grammatical as well as phonological point of view) from what they were in the early 16th century?\n\nIf you don't know about Mayan languages but do know about any other indigenous American language (be it Sioux, Quechua, Nahuatl, ...), feel free to answer for this/these language(s) as well!\n\nAny answer will be appreciated. Thanks in advance! :)",
        "created_utc": 1526295374,
        "upvote_ratio": ""
    },
    {
        "title": "current trends and 'hot topics' in linguistic research",
        "author": "WorkingCranberry",
        "url": "https://www.reddit.com/r/linguistics/comments/8japow/current_trends_and_hot_topics_in_linguistic/",
        "text": "Hello everyone,\n\nAs I'm currently thinking about my Bachelor's thesis' topic I was wondering whether there are any significant trends in linguistic research at the moment. My side subject is computer science and everyone there is crazy about big data, machine learning and artificial intelligence. I know that this is also due to the commercial value of these but I thought there could be anything comparable (on a smaller scale of course) in linguistics. Doesn't matter from which particular branch of research, I'm interested in all kind of stuff. One thing I stumbled across was CALC (computer-assisted language comparison) but I'm open to any kind of suggestion.\n\nThank you very much in advance!",
        "created_utc": 1526286882,
        "upvote_ratio": ""
    },
    {
        "title": "Do I want a career in linguistics or am I just passionate about a hobby?",
        "author": "lagomz",
        "url": "https://www.reddit.com/r/linguistics/comments/8j8ul5/do_i_want_a_career_in_linguistics_or_am_i_just/",
        "text": "[removed]",
        "created_utc": 1526263756,
        "upvote_ratio": ""
    },
    {
        "title": "Will written Chinese ever get more simplified than it is now?",
        "author": "fjalsob",
        "url": "https://www.reddit.com/r/linguistics/comments/8j8syc/will_written_chinese_ever_get_more_simplified/",
        "text": "",
        "created_utc": 1526263290,
        "upvote_ratio": ""
    },
    {
        "title": "Semantic presupposition, anaphora or conversational context? Please help.",
        "author": "mturknoobie",
        "url": "https://www.reddit.com/r/linguistics/comments/8j8k81/semantic_presupposition_anaphora_or/",
        "text": "Hi All -\n\nI am not a linguistic. I am a tech person getting in research. I am struggling to find the correct academic term to describe a scenario.\n\nExample: two people or 1 person and 1 machine are having a conversation about breakfast. Half way through the conversation, person A makes a statement \"I don't like apples\". Person B says \"I thought we were talking about breakfast\". Person A's statement was talking about apples in the context of breakfast, but B just didn't understand that i.e. didn't get the inference...\n\nOk - clumsy example. But if this sort of thing presupposition? It could perhaps be anaphora as person A didn't say \"I don't like apples for breakfast\". or maybe it is called something else related to conversational context? Maybe this is an example of grounding or common ground as per Clark and Brennan? \n\nAppreciate any help. Regards,\n\n**cross-post from /r/asklinguistics. you can see my desperation haha. ",
        "created_utc": 1526260885,
        "upvote_ratio": ""
    },
    {
        "title": "An Algorithmic Investigation of the Highfalutin 'Poet Voice'",
        "author": "ridiculousrssndoll",
        "url": "https://www.atlasobscura.com/articles/cultural-analysis-poet-voice",
        "text": "",
        "created_utc": 1526260706,
        "upvote_ratio": ""
    },
    {
        "title": "Voiced palatalized alveolar lateral approximant",
        "author": "edgarbird",
        "url": "https://www.reddit.com/r/linguistics/comments/8j7852/voiced_palatalized_alveolar_lateral_approximant/",
        "text": "I am having \\*extreme\\* difficulties trying to pronounce it. Is it simply pronounced with the relatively easy to pronounce voiced palatal lateral approximant?",
        "created_utc": 1526247705,
        "upvote_ratio": ""
    },
    {
        "title": "This Wikipedia page states that the speculated origin of the letter G is a camel pictographs. How can that be?",
        "author": "lifeontheQtrain",
        "url": "https://en.m.wikipedia.org/wiki/G",
        "text": "",
        "created_utc": 1526246284,
        "upvote_ratio": ""
    },
    {
        "title": "Suggestions for fiction with dialect?",
        "author": "cassiehe",
        "url": "https://www.reddit.com/r/linguistics/comments/8j6c3k/suggestions_for_fiction_with_dialect/",
        "text": "I'm not entirely sure whether this kind of post is allowed, so I apologise in advance if it is not.\n\nFor some years I have maintained an interest in dialect literature - fiction wherein a character or characters' narration, thoughts or speech (or all three) are represented in nonstandard English. I'm considering writing my MA dissertation on dialect literature with a focus on how dialect aids characterisation and potentially also about possible ideological implications of using dialect (how dialect speakers are perceived as belonging to a low social class, being uneducated, etc. whereas speakers of ”Standard English” are perceived as belonging to a high social class, being educated, etc.). \n\nI’ve been reading a bunch of James Kelman’s novels, but since his books tend to contain only few conversations and thus not much direct speech, I’m not sure that any of them carry the potential for an entire dissertation. I’ve recently published a paper on the use of dialect in Welsh’s *Trainspotting*, so sadly that one isn’t an option. My question is thus: **Can any of you recommend any novels or short stories that contain dialect and would potentially be suitable for carrying out a stylistic analysis concerning characterisation and possibly ideology (preferably British)**? \n",
        "created_utc": 1526240237,
        "upvote_ratio": ""
    },
    {
        "title": "\"Are Father who art in heaven...\" why can \"be\" take the 2nd person conjugation here?",
        "author": "creepyeyes",
        "url": "https://www.reddit.com/r/linguistics/comments/8j5hfc/are_father_who_art_in_heaven_why_can_be_take_the/",
        "text": "When I was younger and heard the Lord's Prayer, I didn't really think much about the \"art\" part of that line because I just thought it was a fancy way to say, \"is.\" Now I know better, that it's an archaic conjugation for 2nd person singular informal. However, I'm confused why that conjugation can work here. Even if we assume \"Our Father\" is being used in a vocative sense (which makes sense, all the other pronouns are 2nd person informal) surely the use of \"who\" before the copula would mean it must be conjugated for \"who\" and not \"Our Father.\"\n\nConsider a more mundane sentence, \"And so it's you who is my best friend\" versus, \"And so it's you who are my best friend.\"\n\nIs this maybe just an archaism, or is it actually just *my* dialect that's weird in prefering a 3rd person pronoun for that use-case?",
        "created_utc": 1526233239,
        "upvote_ratio": ""
    },
    {
        "title": "By the grace of God We are Alexander I in 18th century Russia and We like to refer to ourselves in plural. Where did this habit come from? When did it first start? Is it limited to the head of the state? Does it exist outside European monarchy?",
        "author": "Milespecies",
        "url": "https://www.reddit.com/r/AskHistorians/comments/8j313m/by_the_grace_of_god_we_are_alexander_i_in_18th/",
        "text": "",
        "created_utc": 1526230732,
        "upvote_ratio": ""
    },
    {
        "title": "Are the glide vowels at the end of diphthongs non-syllabic?",
        "author": "KushlungsMcBone",
        "url": "https://www.reddit.com/r/linguistics/comments/8j4iz4/are_the_glide_vowels_at_the_end_of_diphthongs/",
        "text": "[removed]",
        "created_utc": 1526225258,
        "upvote_ratio": ""
    },
    {
        "title": "Is there any hard evidence to illustrate how lyrical music has influenced accepted pronunciations and speech patterns?",
        "author": "faceturnsblue",
        "url": "https://www.reddit.com/r/linguistics/comments/8j3pek/is_there_any_hard_evidence_to_illustrate_how/",
        "text": "",
        "created_utc": 1526217424,
        "upvote_ratio": ""
    },
    {
        "title": "Firstness, Secondness, Thirdness for a newbie.",
        "author": "SpaceKraken420",
        "url": "https://www.reddit.com/r/linguistics/comments/8j3pd2/firstness_secondness_thirdness_for_a_newbie/",
        "text": "I can't wrap my head around those three terms, could any one explain those terms to me? (Not in a layman's terms, as this is all I found on google and it just doesn't make the slightest amount of sense to me)(Or if you do, with examples please).\n\nP.S: Accordingly to the theories of Peirce and Adamczewski.\n\n\nThanks heaps!!",
        "created_utc": 1526217411,
        "upvote_ratio": ""
    },
    {
        "title": "What Are Tropes In English Sentence Construction?",
        "author": "ResearchOfLegend",
        "url": "https://www.reddit.com/r/linguistics/comments/8j3p82/what_are_tropes_in_english_sentence_construction/",
        "text": "[removed]",
        "created_utc": 1526217366,
        "upvote_ratio": ""
    },
    {
        "title": "Slavic words for \"king\" - fun fact",
        "author": "mcmusa",
        "url": "https://www.reddit.com/r/linguistics/comments/8j3ii2/slavic_words_for_king_fun_fact/",
        "text": "[removed]",
        "created_utc": 1526215304,
        "upvote_ratio": ""
    },
    {
        "title": "OpenAcces / OER – linguistics on YT",
        "author": "cervantes1976",
        "url": "https://www.reddit.com/r/linguistics/comments/8j3c76/openacces_oer_linguistics_on_yt/",
        "text": "Do you have any hints for OpenAccess/OER for linguistics on YT? Searching for stuff like this:\n\n- YT-Channel of Martin Hilpert (Neuchatel): https://www.youtube.com/user/carlahilpert (in English)\n- YT-Channel of the Virtual Linguistics Campus (Jürgen Handke, Marburg): https://www.youtube.com/user/LinguisticsMarburg (in English) \n- YT-Channel of Alexander Lasch (Dresden): https://m.youtube.com/channel/UCnSqvWH1_wqTB9I_d41G2xg (in German)\n\nThanks!\n",
        "created_utc": 1526213067,
        "upvote_ratio": ""
    },
    {
        "title": "Is Deccani Urdu (Hydrabadi/Dhakni) an accent of Urdu or a Dialect of Urdu?",
        "author": "mwJalal",
        "url": "https://youtu.be/PornOV6Dvy0",
        "text": "",
        "created_utc": 1526201517,
        "upvote_ratio": ""
    }
]