[
    {
        "title": "Where do retroflex letters come from ?",
        "author": "rlf_93",
        "url": "https://www.reddit.com/r/linguistics/comments/9gcfr4/where_do_retroflex_letters_come_from/",
        "text": "[removed]",
        "created_utc": 1537119393,
        "upvote_ratio": ""
    },
    {
        "title": "Why 'piss' is ruder than 'pee'?",
        "author": "bahasasastra",
        "url": "https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0198430",
        "text": "",
        "created_utc": 1537117382,
        "upvote_ratio": ""
    },
    {
        "title": "Creating a language survey",
        "author": "barry1981",
        "url": "https://www.reddit.com/r/linguistics/comments/9gbvfh/creating_a_language_survey/",
        "text": "Hi. I hope someone can advise. I am trying to create an attitudinal questionnaire based on second language learning and experiences to determine if attitudes correlate with usage (this is a very basic description). I can't seem to find any explicit advice or textbooks on this. The methodology on Gardner's AMTB, for example, appears simpler than expected, in my current limited opinion. Are there any statistical methods books that approach survey design from a linguistics point of view? Thanks in advance",
        "created_utc": 1537115268,
        "upvote_ratio": ""
    },
    {
        "title": "Semivowels in Indo-Euroean",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/linguistics/comments/9gbr7p/semivowels_in_indoeuroean/",
        "text": "[deleted]",
        "created_utc": 1537114428,
        "upvote_ratio": ""
    },
    {
        "title": ":) or ^_^ in your culture?",
        "author": "bahasasastra",
        "url": "https://www.reddit.com/r/linguistics/comments/9gbbha/or_in_your_culture/",
        "text": "[The English Wikipedia page of emoticons](https://en.m.wikipedia.org/wiki/List_of_emoticons) divides emoticons into western and eastern ones. Western emoticons express smile as :) whereas eastern one do so as ^_^ and the like. I guess this reflects the actual smiles in Western countries (where people tend to smile with lips) and those in East Asia (where people tend to smile with both lips and eyes).\n\nBut what about cultures that do not fit neatly into \"east\" or \"west\"? (Latin America, Africa, Central Asia, etc.)? What types or emoticons do they use in those cultures?",
        "created_utc": 1537111133,
        "upvote_ratio": ""
    },
    {
        "title": "Naive question on verb usage in Chinese/Japanese",
        "author": "franklinwritescode",
        "url": "https://www.reddit.com/r/linguistics/comments/9gb2c4/naive_question_on_verb_usage_in_chinesejapanese/",
        "text": "I'm only familiar with Chinese and Japanese, but Chinese has no conjugated verbs, i.e., there is no \"tense\" in Mandarin Chinese. I've read that Japanese is similar with only two major verb forms to express present and past.\n\nIs this common in other Asian languages? Can someone trace back anthropologically the reason behind languages like Chinese &amp; Japanese having a less complex verb system than Latin and Germanic languages? How do Chinese and Japanese get around the lack of verb conjugations when expressing timing?",
        "created_utc": 1537109075,
        "upvote_ratio": ""
    },
    {
        "title": "Why do so many Spanish/Portuguese words of Arabic origin use the letter z/ç for the words that has س?",
        "author": "HoopoeOfHope",
        "url": "https://www.reddit.com/r/linguistics/comments/9gaphh/why_do_so_many_spanishportuguese_words_of_arabic/",
        "text": "What makes this more confusing is the fact that Spanish z is pronounced like Arabic ث. Why would they use it if the letter s sounds like س?\n\nExamples;\n\n\nسكر/azúcar/açúcar\n\nطاسة/taza/taça\n\nI remember there being a lot more but I can't exactly remember the words.",
        "created_utc": 1537106207,
        "upvote_ratio": ""
    },
    {
        "title": "Doing fieldwork in Pima - Language &amp; Oral Tradition: A great reading from ten years ago about the Akimel O'odham of Arizona's language and traditions",
        "author": "KoveytBud",
        "url": "http://discuss.rewild.com/t/doing-fieldwork-in-pima/1091/8",
        "text": "",
        "created_utc": 1537094753,
        "upvote_ratio": ""
    },
    {
        "title": "Ah yes Singlish?",
        "author": "yongle8868",
        "url": "https://www.guidesify.com/blog/2018/09/16/can-or-cannot-singaporeans-meaning/",
        "text": "",
        "created_utc": 1537074635,
        "upvote_ratio": ""
    },
    {
        "title": "Treeing non infinite to and aux verb?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/linguistics/comments/9g7dub/treeing_non_infinite_to_and_aux_verb/",
        "text": "[deleted]",
        "created_utc": 1537066684,
        "upvote_ratio": ""
    },
    {
        "title": "Homework help?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/linguistics/comments/9g6ll0/homework_help/",
        "text": "[removed]",
        "created_utc": 1537059378,
        "upvote_ratio": ""
    },
    {
        "title": "Strange vowel length distinction of the LOT/CLOTH vowel",
        "author": "-fronting",
        "url": "https://www.reddit.com/r/linguistics/comments/9g6b36/strange_vowel_length_distinction_of_the_lotcloth/",
        "text": "\nAs I’m sure many of you are aware, Australian English has phonemic vowel length. Exactly which vowels it affects depends on the individual, but for me personally I have four vowels with length distinctions:\n\n/ɑ/ -&gt;  “bard” vs “bud”\n\n/ɛ/ -&gt;  “bared” vs “bed”\n\n/ɪ/ -&gt; “beard” vs “bid”\n\n/æ/ -&gt; “bad” vs “lad”\n\n(For context I am a millennial who grew up in Canberra and in rural NSW )\n\nThis left me thinking about the other short vowels, specifically the /ɒ/ vowel from the LOT/CLOTH set, and if there was any potential for contrastive vowel length.\n\nNow, the LOT/CLOTH vowel doesn’t have a separate long vowel with a similar realisation, so the most likely scenario by which contrastive vowel length could develop would be if it split into a long vowel and a short vowel, similar to what happened  with the /æ/ vowel above; the so called “bad-lad split”, which is pretty well documented.\n\nSo I sounded out a bunch of LOT/CLOTH words and sure enough I found some words had long vowel sound. But it wasn’t like the bad-lad split, where there’s a fairly healthy number of words with the long vowel and with the short vowel. There were exactly two words I found with long vowels: “god” and “gone”.\n\nOther similar words ending in a voiced coda consonant like “vod” or “bod” or “don” don’t have a long vowel, nor does “gob” which has the initial ‘g’, plus a voiced coda consonant, all these words have short vowels. Furthermore, near identical words like “goddess” and the “-gon” suffix do not have the long vowel.\n\nI would probably have just chalked this up to being a quirk of my idiolect, except I stumbled upon [this thread](https://cn.reddit.com/r/linguistics/comments/5j56kk/length_distinction_of_%C9%92_in_australian_english/) from a couple of years back, where a redditor identified not just an /ɒ/ length distinction, but one that specifically only affected the words “god” and “gone”, which kind of blew my mind.\n\nIs there any kind of documentation of this vowel length distinction out there? I haven’t been able to find anything about it. No papers, no Wikipedia articles. It’s presumably a regional thing, but if two random unrelated redditors have the distinction, it seems pretty unlikely that we’re the only ones.\n\nFinally, I’m not sure how naming conventions work for sound changes that don’t neatly follow lexical sets. Assuming this is a real distinction, what would it be called? The “gone-gon” split?  \n",
        "created_utc": 1537056843,
        "upvote_ratio": ""
    },
    {
        "title": "J.J. McCullough's accent",
        "author": "cfard",
        "url": "https://www.reddit.com/r/linguistics/comments/9g66ae/jj_mcculloughs_accent/",
        "text": "For those of you who don't know, J.J. McCullough is a Canadian YouTube commentator who makes videos about Canadian politics among other things. One of the most salient features of his speech is his hyper-raising of the /aʊ/ morpheme, so the word *about* literally sounds like /əˈbu̟t/, but unironically. He explains in the below video that he just has a stronger form of Canadian raising, but to be honest I don't really believe him (I think he's consciously doing this).\n\nThe evidence:\n\nThe raising of the diphthongs /aʊ/ and /aɪ/ (becoming /ʌʊ/ and /ʌɪ/) are in complementary distribution; the former occur only when not followed by a voiceless consonant. However J.J. used the examples [*house*, *down*, *around*, and *south*](https://www.youtube.com/watch?v=8YTGeIq4pSI&amp;t=25s), two of which involve voiced consonants (edit: and less than one second earlier, he *didn't* raise *pronounce*). Furthermore, he talks about how he gets flak for this from other Canadians, yet uses the pronunciation of [*route* as /ɹut/ vs. /ɹaʊt/](https://www.youtube.com/watch?v=8YTGeIq4pSI&amp;t=1m31s) as a counterexample (but this isn't a distinction between raising the diphthong or not, in fact it is between /ɹʌʊt/ and /ɹaʊt/).\n\nIn this other video about his views on Canada's bilingualism (which got my blood boiling a bit don't even get me started), he hyper-raises even more, including diphthongs that precede voiced consonants!\n\n&gt; [\"It's usually estimated at /əˈɹu̟nd/ seventeen per cent of the population, and these are disproportionately people who live in and /əˈɹu̟nd/ Quebec.\"](https://www.youtube.com/watch?v=KitLiKbIsSU&amp;t=1m6s)\n\nI couldn't find any examples of him hyper-raising /aɪ/ to /i/. In fact, for this diphthong he exhibits the same distribution as expected in Canadian English, and applies the appropriate degree of raising.\n\nIs it just me or do you think he's faking it?",
        "created_utc": 1537055701,
        "upvote_ratio": ""
    },
    {
        "title": "What are the most \"evil\" sounding languages in history? Or even fiction?",
        "author": "Andsf",
        "url": "https://www.reddit.com/r/linguistics/comments/9g640c/what_are_the_most_evil_sounding_languages_in/",
        "text": "[removed]",
        "created_utc": 1537055120,
        "upvote_ratio": ""
    },
    {
        "title": "pronunciation of bat / bad",
        "author": "eric-nyc",
        "url": "https://www.reddit.com/r/linguistics/comments/9g6221/pronunciation_of_bat_bad/",
        "text": "Some people pronounced bat and bad with the same vowel, [bæt] [bæd]. Others (like me), don't.  I pronounce bat as [bæt] and bad as something like [bɛɪd] or maybe [bɛəd]. I use the same vowel sound in cash. (I grew up in central New Jersey.)\n\nWhere can I read about this bat / bad distinction?",
        "created_utc": 1537054625,
        "upvote_ratio": ""
    },
    {
        "title": "Recommendations: Second Language Speech Training (Methods and/or CBST Programs)?",
        "author": "SonOfChickenNergal",
        "url": "https://www.reddit.com/r/linguistics/comments/9g4wd3/recommendations_second_language_speech_training/",
        "text": "Hi all,\n\n&amp;#x200B;\n\nI'm searching for articles and resources to prepare the research plan for my Master's and am not having any luck.\n\n&amp;#x200B;\n\nEssentially, I want to test the effects of (English) phonemic training on the perceptual accuracy of a certain class of L2 learners. Unfortunately, I can't find any resources regarding this type of training, or any computer-based speech training (CBST) programs that may have been developed for such a purpose. The only programs I've been able to\n\nidentify thus far are either lexis-based rather than phoneme-based (i.e. developed not for L2 learners on the phonemic level but rather for native speakers with speech impediments) or otherwise inaccessible.\n\n&amp;#x200B;\n\nObviously a training method that does not involve technology is also an option, but I am not a speech pathologist and do not consider myself qualified to develop such a method alone.\n\n&amp;#x200B;\n\nWould anyone have any suggestions as to where I might continue to look?\n\n&amp;#x200B;\n\nThanks in advance.",
        "created_utc": 1537044926,
        "upvote_ratio": ""
    },
    {
        "title": "How do you predict the different manner in which people will talk, 50 years from now?",
        "author": "MonoWill2",
        "url": "https://www.reddit.com/r/linguistics/comments/9g3vpe/how_do_you_predict_the_different_manner_in_which/",
        "text": "[removed]",
        "created_utc": 1537037013,
        "upvote_ratio": ""
    },
    {
        "title": "What are some languages similar to Sanskrit, which have a property-based word formation approach?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/linguistics/comments/9g2feq/what_are_some_languages_similar_to_sanskrit_which/",
        "text": "[removed]",
        "created_utc": 1537026260,
        "upvote_ratio": ""
    },
    {
        "title": "Pharyngeal 'R' in Glaswegian?",
        "author": "MintJuiceConnection",
        "url": "https://www.reddit.com/r/linguistics/comments/9g1it0/pharyngeal_r_in_glaswegian/",
        "text": "I've been binge watching Limmy's Show and something is driving me crazy; often-times, when the actors pronounce an R in the coda of a syllable, it sounds at least partially pharyngeal, sometimes extremely so, like a uvular approximant. I keep hearing it but I haven't been able to find any reference to pharyngeal sounds of any kind in any Scottish dialects and I'm second-guessing myself. \n\n&amp;#x200B;\n\nTry listening to this sketch here, especially when he starts saying \"powers\" about a minute in [https://youtu.be/5wgg4rUVm7M](https://youtu.be/5wgg4rUVm7M)\n\n&amp;#x200B;\n\nAm I nuts or what?",
        "created_utc": 1537018820,
        "upvote_ratio": ""
    },
    {
        "title": "How was the digraph ⟨-ae⟩ pronounced in Contemporary/Neo Latin words such as \"Pinaceae\"?",
        "author": "Olfbir",
        "url": "https://www.reddit.com/r/linguistics/comments/9g16yn/how_was_the_digraph_ae_pronounced_in/",
        "text": "[removed]",
        "created_utc": 1537015547,
        "upvote_ratio": ""
    },
    {
        "title": "Weekend Roundup - September 15, 2018",
        "author": "AutoModerator",
        "url": "https://www.reddit.com/r/linguistics/comments/9g0xox/weekend_roundup_september_15_2018/",
        "text": "Welcome again to the /r/linguistics weekend round-up, your chance to share with the community what you've been working on for the past week. You can also share things that you've read, observations you've recently made, or anything else interesting that you've come across that might not otherwise warrant a separate thread. Tell us about your week.\n",
        "created_utc": 1537012831,
        "upvote_ratio": ""
    },
    {
        "title": "Someone on our conlanging forum made a bogus claim based entirely on false cognates that French-derived creoles are related to Egyptian, published a book about it, and won't listen to us trying to prove him wrong. What can we do?",
        "author": "ShabtaiBenOron",
        "url": "https://www.reddit.com/r/linguistics/comments/9g0x1p/someone_on_our_conlanging_forum_made_a_bogus/",
        "text": "",
        "created_utc": 1537012615,
        "upvote_ratio": ""
    },
    {
        "title": "Words shared by Hiberno-English and South African English",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/linguistics/comments/9g0f10/words_shared_by_hibernoenglish_and_south_african/",
        "text": "[deleted]",
        "created_utc": 1537006221,
        "upvote_ratio": ""
    },
    {
        "title": "Why are there so many differences between Brazilian Portuguese and European Portuguese?",
        "author": "elchulow",
        "url": "https://www.reddit.com/r/linguistics/comments/9fzrn1/why_are_there_so_many_differences_between/",
        "text": "For those who don't know it's not like English from the US and English from the UK, it's much more than that, there are so many things Brazilians say that in the eyes of a Portuguese person would be very wrong like saying \"Tem muitas pessoas\" instead of \"Há muita gente\" (There are a lot of people) or \"Eu compro pra ela esse livro\" instead of \"Eu compro-lhe este livro\" (I'm buying her this book) or even \"Eu te amo\" instead of \"Eu amo-te\". There are many other things that I could point out but but I won't mention them atm, I'm a Spanish speaker who learned Portuguese and even from my Spanish perspective it sounds sooo wrong what Brazilians do. \n\nThere's also the pronunciation, Brazilians don't follow properly the rules about non stressed vowels so that leads to having very different accents, they can be so different that a Brazilian person who hasn't been exposed to EP could have a lot of trouble to understand people from Portugal. Even as a learner, the first time I heard the Portuguese accent I even couldn't understand 60% of what they were saying despite being able to understand like 90-100% of BP.\n\nWhy both dialects have sooooo many differences? Even in Spanish you have like 22 countries or so and there are wayy more less differences between all the Spanish dialects combined in comparison to BP and EP.",
        "created_utc": 1536997481,
        "upvote_ratio": ""
    },
    {
        "title": "State of the arab language in 10 years. 2028",
        "author": "[deleted]",
        "url": "https://old.reddit.com/r/learn_arabic/comments/9ftf3p/state_of_the_arab_language_in_10_years_2028/",
        "text": "[deleted]",
        "created_utc": 1536976810,
        "upvote_ratio": ""
    },
    {
        "title": "What, if anything, explains why each word in this series has approximately the same two different possible stress patterns?",
        "author": "crochet_du_gauche",
        "url": "https://www.reddit.com/r/linguistics/comments/9fxck2/what_if_anything_explains_why_each_word_in_this/",
        "text": "“Caramel”, “Caribbean”, “chimpanzee”, ...",
        "created_utc": 1536971877,
        "upvote_ratio": ""
    },
    {
        "title": "Recommendations for current (and/or essential) scholarship on Na-Dené/Athabaskan languages?",
        "author": "daedaleo",
        "url": "https://www.reddit.com/r/linguistics/comments/9fwbsf/recommendations_for_current_andor_essential/",
        "text": "Hi all, \nI'm an undergrad transitioning away from classics and towards linguistics (unfortunately at a school with an ailing department, but oh well). I'm really interested in western Native American and First Nations languages, and was wondering if any of y'all could point me towards \"essential\" older works on Na-Dené languages, or influential, newer stuff. Even just recommended grammars would be appreciated. Thanks in advance!",
        "created_utc": 1536962982,
        "upvote_ratio": ""
    },
    {
        "title": "Worth a shot.",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/linguistics/comments/9fwbcy/worth_a_shot/",
        "text": "[removed]",
        "created_utc": 1536962894,
        "upvote_ratio": ""
    },
    {
        "title": "Rolling r's after certain vowels",
        "author": "BecksSharp",
        "url": "https://www.reddit.com/r/linguistics/comments/9fvp0t/rolling_rs_after_certain_vowels/",
        "text": "Anyone out there have advice on exercises to roll my r's more elegantly after certain vowels? When speaking Spanish I don't have issues rolling the r after most vowels but always after the 'i\" and sometimes after the 'u\" I can't go right into the 'r.' The only way I can explain it is I need to add an \"a' or \"e\" in between to make it possible. Suggestions for fixing this? I have no idea how rare this particular issue is but I can't seem to find anything on it anywhere online.",
        "created_utc": 1536958185,
        "upvote_ratio": ""
    },
    {
        "title": "Where does the the pronunciation of \"flourish\" as /flɔrɪʃ/ come from?",
        "author": "READERmii",
        "url": "https://www.reddit.com/r/linguistics/comments/9fvip2/where_does_the_the_pronunciation_of_flourish_as/",
        "text": "Where does the the pronunciation of \"flourish\" as /flɔrɪʃ/ come from? according to [this](http://www4.uwm.edu/FLL/linguistics/dialect/staticmaps/q_12.html) ~23% of people in the US pronounce \"flourish\" /flɔrɪʃ/. Is this the product of the presence/absence of a merger, or is this a spelling pronunciation? I'd really like to know where the use of the NORTH vowel in this word comes from. Also I'd like to know what other words are like this if any one can help me out with that it would be much appreciated.",
        "created_utc": 1536956898,
        "upvote_ratio": ""
    },
    {
        "title": "Caught myself being a hypocrite in relation to linguistic discrimination",
        "author": "jmdrs",
        "url": "https://www.reddit.com/r/linguistics/comments/9fvgtn/caught_myself_being_a_hypocrite_in_relation_to/",
        "text": "Linguistic discrimination has a huge role in segregation, as you all know — it's always the way of speech of the poor, the black, the immigrant that suffers from discrimination. The normative grammar sets a standard of speech that contributes to the segregation and makes a common thought thinking that lots of ways of speech are wrong and/or ugly. We grow up learning that certain accents are to be laughed at, and others are just ugly and the speaker should change it, and deconstructing this fact, that certain accents sound ugly or funny  to us, is not something that happens overnight — it’s deep-rooted in us, and requires effort.\n\nSo, today I was watching journalist Glenn Greenwald, who I hold in high esteem, [interviewing Marina Silva](https://www.youtube.com/watch?v=midaPx_OzfY), a stupid, neoliberal presidential candidate in Brazil. He was speaking portuguese, and sincerely, his accent was bothering me. As I said, of course I knew it wasn’t *supposed* to be bothering me, but it was. It was muddling the interview, a little bit, for me, taking a lot of my attention — not because it was hard to understand, but my mind simply couldn’t *not* be constantly noticing it. Even though I was reading the subtitles, I had to rewind and try paying attention again some times.\n\nThat made me think: is it discriminating to think that it would be beneficial for him to learn how to lose some of his accent, to be more *understandable*? It’s very clear that if he wasn’t provided of subtitles, it would be very hard to understand him. I mean, he can also think it’d be beneficial for him, and of course that if he didn’t *want* to change it and I were to say “but you *have* to, because it’s wrong/ugly” it would be explicitly discriminating; that’s not the case. \n\nAt the same time, I feel like a hypocrite, because I don’t feel the same for [chef Érick Jacquin](https://www.youtube.com/watch?v=ooEUQpvsnoQ), who’s a judge in MasterChef in Brazil, because even though it’s very hard to understand him lots of times, I think his french accent is very beautiful. I would not like it at all if he lost his accent, regardless of the fact that it'd probably be beneficial for him to lose it.\n\nWhat are your thoughts?",
        "created_utc": 1536956523,
        "upvote_ratio": ""
    },
    {
        "title": "Does this constitute a new finding in my term paper?",
        "author": "FallenSisyphos",
        "url": "https://www.reddit.com/r/linguistics/comments/9fv27y/does_this_constitute_a_new_finding_in_my_term/",
        "text": "I worked on several prepositional phrases and identified (by using two online corpora) which of them are favored in American and British English today. Does this constitute a real effort in finding something new or is it merely the taking of information (from the corpus)? (I calculated the absolute frequencies between the years 2012-2016 for spoken language in both AmE and BrE).\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n(I am struggling as to what my central question should look like. I gave up on my previous thesis, \"has BrE become more similar to AmE in its use of prepositional phrases?\" since I noticed that what I identified as previous data for AmE and BrE from Brown and LOB (two corpora from the 60ies) do not provide a sufficient number of items while the new COCA and SpokenBNC corpora show occurences in \"per million words\". Thus I could not compare them)\n\n&amp;#x200B;\n\nLong story short, having new data on prepositional use in both AmE and BrE identified, I am looking for an easy way out. Thus, my question above.\n\nI want to mention previous research and the data found in it (Brown and LOB) only as side information and nothing I will base my work on.\n\n&amp;#x200B;\n\nI appreciate your help",
        "created_utc": 1536953608,
        "upvote_ratio": ""
    },
    {
        "title": "What is the origin of the Welsh accent?",
        "author": "Tarnmanner",
        "url": "https://www.reddit.com/r/linguistics/comments/9fuotw/what_is_the_origin_of_the_welsh_accent/",
        "text": "I imagine this is an oversimplification and that there are dozens of accent differences across Wales from town to town, but I'm referring to the accent most people recognise as 'the Welsh accent'. Where does it come from? Is it a purely regional English accent? Is it the accent a monolingual Welsh speaker would have if they tried to speak English? I guess it's probably some combination of the two, but does anyone have any insight on this? ",
        "created_utc": 1536951002,
        "upvote_ratio": ""
    },
    {
        "title": "How far off being \"Linguistically Complete\" are emojis?",
        "author": "civic95",
        "url": "https://www.reddit.com/r/linguistics/comments/9fud2w/how_far_off_being_linguistically_complete_are/",
        "text": "' Linguistically complete ' probably has a proper name, that I don't know ( I have zero training in linguistics ). To understand what I mean, English is linguistically complete. Whereas a language I fabricate to be able to talk to my brother without my mother understanding is basic and can't express as many concepts / thoughts / nuance as the English language. \n\nSo with emojis, I'm wondering whether there's any chance of reasonable sentences being constructed using them at some point, whether there's any leaning towards this being possible, and how far off that being possible the current available set is. \n\nAgain, I'm not trained at all, so I'm sorry if this is a bit vague. I'm just curious. \n\nThanks",
        "created_utc": 1536948735,
        "upvote_ratio": ""
    },
    {
        "title": "Does Adding a Suffix or Prefix in English Make a New Word Appropriately?",
        "author": "31November",
        "url": "https://www.reddit.com/r/linguistics/comments/9fuc7f/does_adding_a_suffix_or_prefix_in_english_make_a/",
        "text": "[removed]",
        "created_utc": 1536948566,
        "upvote_ratio": ""
    },
    {
        "title": "Unsubtitled diglossia in Kenyan national broadcaster. All sociolinguistic explanations welcome!",
        "author": "FieryWest",
        "url": "https://www.youtube.com/watch?v=jgs_C1-Nx3Q",
        "text": "",
        "created_utc": 1536939988,
        "upvote_ratio": ""
    },
    {
        "title": "What language is this woman speaking? Is it Swahili? Thanks for your help. More discussion in comments.",
        "author": "[deleted]",
        "url": "https://www.youtube.com/watch?v=jgs_C1-Nx3Q",
        "text": "[deleted]",
        "created_utc": 1536938386,
        "upvote_ratio": ""
    },
    {
        "title": "How Did Cool Become Such a Big Deal?",
        "author": "B0etius02",
        "url": "https://www.neh.gov/humanities/2014/julyaugust/feature/how-did-cool-become-such-big-deal-0",
        "text": "",
        "created_utc": 1536914975,
        "upvote_ratio": ""
    },
    {
        "title": "7 Canons of Etymology",
        "author": "2Wugz",
        "url": "https://www.reddit.com/r/linguistics/comments/9fong7/7_canons_of_etymology/",
        "text": "I was reading a brief summary of W.W. Skeat’s Canons of Etymology on etymology.com. I’ve never encountered these canons before but I love learning about etymology. The final one said “ It is useless to offer an explanation of an English word which will not also explain all the cognate forms.” I’m not sure that I quite understand. Does it perhaps mean that when trying to trace the origins of a given English word, one has to take into account the cognates of that English word in other languages? And their explanation has to be consistent with those cognates?",
        "created_utc": 1536895444,
        "upvote_ratio": ""
    },
    {
        "title": "I'm building an app to help children with Autism that have trouble communicating verbally through a keyboard of \"symbols/pictures.\" How would you design a keyboard of pictures that would cover the majority of sentences?",
        "author": "AmpliveGW2",
        "url": "https://www.reddit.com/r/linguistics/comments/9fohty/im_building_an_app_to_help_children_with_autism/",
        "text": "* Symbols look like this: [https://www.bilingualspeechtherapist.com/wp-content/uploads/2015/05/core.pn](https://www.bilingualspeechtherapist.com/wp-content/uploads/2015/05/core.png)\n* At the bottom of the UI are \"categories\"\n\nBasically, the challenge is if you had a very limited vocabulary, what would be the most important things to include to still be able communicate effectively. Thanks and looking forward to what you guys think of!",
        "created_utc": 1536894027,
        "upvote_ratio": ""
    },
    {
        "title": "The Problem with the Assuming Color with the word African",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/linguistics/comments/9fng84/the_problem_with_the_assuming_color_with_the_word/",
        "text": "[removed]",
        "created_utc": 1536885227,
        "upvote_ratio": ""
    },
    {
        "title": "Anyone know of any good articles about Spanglish?",
        "author": "YoutubeProfessor",
        "url": "https://www.reddit.com/r/linguistics/comments/9fmso2/anyone_know_of_any_good_articles_about_spanglish/",
        "text": "Title.",
        "created_utc": 1536879874,
        "upvote_ratio": ""
    },
    {
        "title": "In what way have Chomsky \"decisively refuted Saussure\"?",
        "author": "jak_laka",
        "url": "https://www.reddit.com/r/linguistics/comments/9fmqdf/in_what_way_have_chomsky_decisively_refuted/",
        "text": "As far as I  can tell Chomsky is just a radical continuation of structural linguistics. He of course breaks with many, like  Leonard Bloomfield. \n\nOn the wikipedia-page for [structural linguistics](https://en.wikipedia.org/wiki/Structural_linguistics) it says the following\n\n&gt; Holland[4] writes that Chomsky had \"decisively refuted Saussure\". Similar views have been expressed by Jan Koster,[6] Mark Turner,[7] and others.[8][9]\n\nBut I don't see it. And the sources on the page don't help, as fr as I have been able to tell. \n\n\n-------------------\n\nEdit: For the record I understand that Saussure is not relevant anymore, but isn't that just because we surpassed him, not because he was wrong? The same way few/no contemporary mathematicians cite Euklid.\n\n\n----------------------------------------\n\nEdit2: And can you not view Chomsky as a structuralist with works like *Syntactic Structures* and *The Logical Structure of Linguistic Theory*, and his concept of deep *structure*?\n\n\n------------------------------\n\nEdit3: And the only source I have found of Chomsky talking about it is here: https://youtu.be/zDNufwtiqdw?t=114.\n\nAnd here he says Saussure claim, that there is a link between the signifier and the signified, is true. And obviously true to such an extent that he won't even explain why. ",
        "created_utc": 1536879394,
        "upvote_ratio": ""
    },
    {
        "title": "Hungarian was declared a Turkic language by the Prime minister of Hungary. What do you think of the various theories surrounding Hungarian and the Uralic languages?",
        "author": "bernardeckhard",
        "url": "https://www.reddit.com/r/linguistics/comments/9flxe0/hungarian_was_declared_a_turkic_language_by_the/",
        "text": "In the light of recent events, the Prime minister declared that the Finno-Ugric theory is a misconception and that Hungarian is a Turkic language. There are many Hungarian scholars that hold the Turkic theory as true.\n\nAs a native speaker of Hungarian and a person passionate about languages and linguistics I firmly believe that Hungarian is a Finno-Ugric language and that any existing *Altaic* resemblances are due to merely the respective Sprachbund.\n\nThere are many other theories — Mongolian, Hunnic, Scythian and Sumerian — to name a few strictly in regards to Hungarian, and some others that would group Uralic with other language families such as Indo-European, Yukaghir, Altaic, Dravidian, Eskimo and Chukotko-kamchatkan.\n\nHungarians have been known to reject the Uralic family ever since it was first thought of. What do you think of these various theories?",
        "created_utc": 1536873232,
        "upvote_ratio": ""
    },
    {
        "title": "I'm looking for an historical anecdote about some \"lost in translation\" that had some consequences...",
        "author": "Nuvola_Rossa",
        "url": "https://www.reddit.com/r/linguistics/comments/9fliub/im_looking_for_an_historical_anecdote_about_some/",
        "text": "[removed]",
        "created_utc": 1536870295,
        "upvote_ratio": ""
    },
    {
        "title": "Read / review my Circassian Grammar book?",
        "author": "Aslanovich1864",
        "url": "https://www.reddit.com/r/linguistics/comments/9fj18j/read_review_my_circassian_grammar_book/",
        "text": "I'm an ethnic Circassian, and I've spent the last 10 years working on a Circassian Grammar \"textbook\". It's not quite a textbook, but it's a bit more than a primer. It's one of only a handful of works on Circassian Grammar, and the only one designed specifically to teach the language, rather than document it. \n\nWould anyone on this sub-reddit be interested in reading it and providing feedback? I'm looking for feedback on how well (or poorly) I've explained the topics. \n\nI should note that Circassian is somewhat similar to other North Caucasian languages, so many of the concepts in this text would apply to languages like Abkhaz, Ubikh, and (to a lesser extent), Chechen, Georgian, etc... \n\nPlease PM me if you're interested, along with your email address, so I can send you a copy.",
        "created_utc": 1536853002,
        "upvote_ratio": ""
    },
    {
        "title": "NAPA Keyboard for Android?",
        "author": "mckp",
        "url": "https://www.reddit.com/r/linguistics/comments/9ffxsm/napa_keyboard_for_android/",
        "text": "I was wondering if any of you know the best keyboard to use on an Android for NAPA rather than using shortcuts. Or if there's a keyboard where you can customize which characters are on your keyboard.\n\nApologies if this isn't the appropriate subreddit to be asking.",
        "created_utc": 1536823674,
        "upvote_ratio": ""
    },
    {
        "title": "The wug test",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/linguistics/comments/9ffl1f/the_wug_test/",
        "text": "[removed]",
        "created_utc": 1536819606,
        "upvote_ratio": ""
    },
    {
        "title": "Why are there so many languages in Papua New Guinea and how related are they?",
        "author": "vannucker",
        "url": "https://www.reddit.com/r/linguistics/comments/9ffikc/why_are_there_so_many_languages_in_papua_new/",
        "text": "",
        "created_utc": 1536818837,
        "upvote_ratio": ""
    },
    {
        "title": "A statement regarding recent fire at Brazil's National Museum",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/linguistics/comments/9fe4un/a_statement_regarding_recent_fire_at_brazils/",
        "text": "[removed]",
        "created_utc": 1536805526,
        "upvote_ratio": ""
    },
    {
        "title": "IPA Replacement Letters for Praat",
        "author": "gonzo594",
        "url": "https://www.reddit.com/r/linguistics/comments/9fdil9/ipa_replacement_letters_for_praat/",
        "text": "I'm parsing out phoneme segments in Praat, but I can't use IPA symbols because Praat doesn't allow that. Is there a resource that shows what letters can be used in place of IPA? I know it exists because my professor said the military uses a standard to quickly type phonetically as opposed to using IPA, but it's a bit late for my professor to respond.\n\nThanks!",
        "created_utc": 1536800437,
        "upvote_ratio": ""
    },
    {
        "title": "Does the human language on its most fundamental level have limits? If yes, do the limits of our language has anything to do with the limits of our understanding",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/linguistics/comments/9fd62y/does_the_human_language_on_its_most_fundamental/",
        "text": "[removed]",
        "created_utc": 1536797564,
        "upvote_ratio": ""
    },
    {
        "title": "What would you say is the best model for language acquisition and sla?",
        "author": "itsmeeeskai",
        "url": "https://www.reddit.com/r/linguistics/comments/9fcn2k/what_would_you_say_is_the_best_model_for_language/",
        "text": "Wondering since we have different models and theories presented, what for you is the best model and why?",
        "created_utc": 1536793100,
        "upvote_ratio": ""
    },
    {
        "title": "How can I utilize my major as a dentist?",
        "author": "luain123",
        "url": "https://www.reddit.com/r/linguistics/comments/9fbukk/how_can_i_utilize_my_major_as_a_dentist/",
        "text": "[removed]",
        "created_utc": 1536787215,
        "upvote_ratio": ""
    },
    {
        "title": "Apologies If Asked Prior, But Can Someone Explain How The Fem Pronouns Came To Be She, Her, Hers, But Not She, Shim, Shis -- As It Is For The Male He, Him, His?",
        "author": "misternortheast",
        "url": "https://www.reddit.com/r/linguistics/comments/9fbctm/apologies_if_asked_prior_but_can_someone_explain/",
        "text": "[removed]",
        "created_utc": 1536783811,
        "upvote_ratio": ""
    },
    {
        "title": "I want to speak Mandarin, not write it.",
        "author": "PatThewinner",
        "url": "https://www.reddit.com/r/linguistics/comments/9f8yu9/i_want_to_speak_mandarin_not_write_it/",
        "text": "[removed]",
        "created_utc": 1536767600,
        "upvote_ratio": ""
    },
    {
        "title": "Where can I find youtube user statistics for USA between 2012 and 2016?",
        "author": "FallenSisyphos",
        "url": "https://www.reddit.com/r/linguistics/comments/9f8nht/where_can_i_find_youtube_user_statistics_for_usa/",
        "text": "[removed]",
        "created_utc": 1536765435,
        "upvote_ratio": ""
    },
    {
        "title": "I'm a teenage freelancer and I will translate any text from English to Afrikaans text on my fiverr page ====&gt; magneticballoon",
        "author": "RedBalloon0",
        "url": "https://www.reddit.com/r/linguistics/comments/9f8mf0/im_a_teenage_freelancer_and_i_will_translate_any/",
        "text": "[removed]",
        "created_utc": 1536765220,
        "upvote_ratio": ""
    },
    {
        "title": "What are some examples of orthography influencing speech?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/linguistics/comments/9f8kr5/what_are_some_examples_of_orthography_influencing/",
        "text": "[removed]",
        "created_utc": 1536764894,
        "upvote_ratio": ""
    },
    {
        "title": "This is an anime fan base server mostly focused in hentai channel",
        "author": "omprasad2001",
        "url": "https://www.reddit.com/r/linguistics/comments/9f8euv/this_is_an_anime_fan_base_server_mostly_focused/",
        "text": "[removed]",
        "created_utc": 1536763743,
        "upvote_ratio": ""
    },
    {
        "title": "Why can some people mimic tone and accent almost perfectly where as others cannot?",
        "author": "anothercreativemind",
        "url": "https://www.reddit.com/r/linguistics/comments/9f8743/why_can_some_people_mimic_tone_and_accent_almost/",
        "text": "I’m taking Chinese in college. Something that I’ve noticed is that some people (when repeating words) almost sound like they’re in pain trying, and some have absolutely no issue saying just about any word. I had a professor a while back who was born in Germany and lived there for 18 years of his life. He was still fluent in German, but you wouldn’t know by hearing him that he was... he sounded as authentically “American” as you would expect. But then there’s my Chinese teacher, born in Taiwan, raised in Los Angeles from 18 onward, who has a heavy accent still but is fluent in English.\n\nWhat is it that drives one’s ability to pick up accents so perfectly? It almost seems like something immeasurable. ",
        "created_utc": 1536762151,
        "upvote_ratio": ""
    },
    {
        "title": "A team of researchers has uncovered the distinct computations that occur when we switch between different languages, a finding that provides new insights into the nature of bilingualism",
        "author": "vili",
        "url": "https://nyuad.nyu.edu/en/news/latest-news/science-and-technology/2018/september/research-shows-how-we-turn-on-off-languages.html",
        "text": "",
        "created_utc": 1536758890,
        "upvote_ratio": ""
    },
    {
        "title": "Higher Ed Wednesday - September 12, 2018",
        "author": "AutoModerator",
        "url": "https://www.reddit.com/r/linguistics/comments/9f754q/higher_ed_wednesday_september_12_2018/",
        "text": "Hello all and welcome to another edition of Higher Ed Wednesday, an expansion of the Grad School Wednesday posts. This is a thread where prospective students can ask questions about university programs at any level, either general (e.g. \"How often should a grad student present at conferences?\") or particular (e.g. \"Which schools in North America have strong programs in Korean linguistics?). It's also a chance for current students to find out information about other programs (e.g. \"How many of you have reading lists for your comprehensive exams?\") or general university survival (e.g. \"Is it a really bad idea to change my thesis supervisor if we don't click?\"). So ask away!\n",
        "created_utc": 1536753973,
        "upvote_ratio": ""
    },
    {
        "title": "Is it at all realistic to think that dogs will, at some point in evolution, be developing speech? They have developed some form of understanding of words haven't they?",
        "author": "crbarve",
        "url": "https://www.reddit.com/r/linguistics/comments/9f6thk/is_it_at_all_realistic_to_think_that_dogs_will_at/",
        "text": "[removed]",
        "created_utc": 1536751064,
        "upvote_ratio": ""
    },
    {
        "title": "Does this Greek DNA study support or disprove Pontic steppe hypothesis?",
        "author": "dawidlazinski",
        "url": "http://www.sciencemag.org/news/2017/08/greeks-really-do-have-near-mythical-origins-ancient-dna-reveals",
        "text": "",
        "created_utc": 1536746688,
        "upvote_ratio": ""
    },
    {
        "title": "New York's r-dropping English vs r-ful GenAm",
        "author": "jonnyboy171",
        "url": "https://www.reddit.com/r/linguistics/comments/9f6bqw/new_yorks_rdropping_english_vs_rful_genam/",
        "text": "[removed]",
        "created_utc": 1536746031,
        "upvote_ratio": ""
    },
    {
        "title": "Is there any logic between how we pronounce \"the\" in different ways?",
        "author": "fou-lu",
        "url": "https://www.reddit.com/r/linguistics/comments/9f5roj/is_there_any_logic_between_how_we_pronounce_the/",
        "text": "[removed]",
        "created_utc": 1536739111,
        "upvote_ratio": ""
    },
    {
        "title": "Is Google Translate getting worse?",
        "author": "bahasasastra",
        "url": "https://www.reddit.com/r/linguistics/comments/9f4r3m/is_google_translate_getting_worse/",
        "text": "I don't know if it's only me, but the way GT translates these days seem worse than back in the days when the translations were more \"literal\", or word-by-word.\n\nNowadays GT seems to make wild guesses about what the source text means, in order to come up with a more \"natural\" translation. The problem is, sometimes that guess is right, which yields a very human-like translation, but sometimes when the guess is wrong, it just adds information that wasn't even there in the first place.\n\nWord-by-word translation was, in my opinion, less risky in that regard, even though it sounds less \"natural\". At least GT didn't come up with words out of nowhere. Does anybody feel the same way as I do?",
        "created_utc": 1536727686,
        "upvote_ratio": ""
    },
    {
        "title": "Mandarin to become mandatory in Russian schools by 2020",
        "author": "[deleted]",
        "url": "https://www.worldofbuzz.com/mandarin-will-become-mandatory-subject-russians-pass-2020/",
        "text": "[deleted]",
        "created_utc": 1536726877,
        "upvote_ratio": ""
    },
    {
        "title": "Article (in French) about modern Montreal slang",
        "author": "ElitePowerGamer",
        "url": "http://plus.lapresse.ca/screens/a483b787-a330-418d-904d-4a8814866b2a__7C___0.html",
        "text": "",
        "created_utc": 1536725030,
        "upvote_ratio": ""
    },
    {
        "title": "The changing use of the word aesthetic",
        "author": "kindlewick",
        "url": "https://www.reddit.com/r/linguistics/comments/9f4csr/the_changing_use_of_the_word_aesthetic/",
        "text": "I hope this is ok to post here. This is kind of just a thing I noticed and I wondered if anyone had more educated or informed thoughts on it.\n\nI've noticed people have started saying things like \"my locker is aesthetic\" or \"the software is intuitive and aesthetic\" when I would have said something more like, \"my locker fits with my aesthetic\" or \"the software is intuitive and aesthetically pleasing.\" \n\nI looked it up and aesthetic has been used as an adjective, but the usage I described above has not been idiomatically correct in the past. This kind of made me wonder if there are different kinds of adjectives, and about how the meaning and usage of adjectives shifts over time.\n\nThoughts? Recommended reading? Am I just an ignoramus and this is a well documented usage?\n\nEdit: so I've been thinking about this and all the times I would use aesthetic as an adjective it would have a direct object: aesthetic values, aesthetic sensibility, aesthetic features. Are transitive adjectives a thing? Are there any similar adjectives?",
        "created_utc": 1536723944,
        "upvote_ratio": ""
    },
    {
        "title": "What's the subject of a sentence that begins with the word \"Introducing\"? Example: \"Introducing the new and improved Reddit!\"",
        "author": "aqua_zesty_man",
        "url": "https://www.reddit.com/r/linguistics/comments/9f3wpj/whats_the_subject_of_a_sentence_that_begins_with/",
        "text": "[removed]",
        "created_utc": 1536719940,
        "upvote_ratio": ""
    },
    {
        "title": "Features in 2nd language that don't exist in 1st language",
        "author": "Iquabakaner",
        "url": "https://www.reddit.com/r/linguistics/comments/9f3q80/features_in_2nd_language_that_dont_exist_in_1st/",
        "text": "I'm a native Cantonese speaker and when I speak English I often mix up 'he' and 'she', especially when I'm speaking quickly and wasn't paying attention to the pronouns.\n\nI think it's because Cantonese does not distinguish between the two pronouns, so I grew up not paying attention to the gender of the word when I speak.\n\nI wonder if there are other instances like this in speakers of other languages?\n\nEdit: Grammar",
        "created_utc": 1536718407,
        "upvote_ratio": ""
    },
    {
        "title": "Why does the IPA use latin script?",
        "author": "JOKES_FOR_TOKES",
        "url": "https://www.reddit.com/r/linguistics/comments/9f3p0o/why_does_the_ipa_use_latin_script/",
        "text": "More specifically, is this mostly eurocentrism? Or is it more pragmatic (something to do with latin having more phonetic possibilities)? Have there been any notable attempts to dismantle/challenge this?",
        "created_utc": 1536718133,
        "upvote_ratio": ""
    },
    {
        "title": "Has Greek language changed less than Latin has done into Romance languages?",
        "author": "Yoshiciv",
        "url": "https://www.reddit.com/r/linguistics/comments/9f3jjb/has_greek_language_changed_less_than_latin_has/",
        "text": "",
        "created_utc": 1536716914,
        "upvote_ratio": ""
    },
    {
        "title": "Dictionary containing the Phonetic Transcription of words",
        "author": "Ruffi-",
        "url": "https://www.reddit.com/r/linguistics/comments/9f3i5t/dictionary_containing_the_phonetic_transcription/",
        "text": "I already found the CMU Dictionary and found their Arpabet not to be too helpful.\n\nConverting the Arpabet to IPA doesn't work great either.\n\nI am more or less searching for a dictionary just containing english words themselfs and how they are supposed to be pronounced with help of the phonetic alphabet.\n\nI am trying to go through every pronounciation and pick the ones using specific combinations of phones the most.\n\nThank you guys for any recommendations :)",
        "created_utc": 1536716607,
        "upvote_ratio": ""
    },
    {
        "title": "Why is AAVE different from American English?",
        "author": "PenguinPigeonHybrid",
        "url": "https://www.reddit.com/r/linguistics/comments/9f1tl5/why_is_aave_different_from_american_english/",
        "text": "",
        "created_utc": 1536703300,
        "upvote_ratio": ""
    },
    {
        "title": "Looking for a corpus of English that lists verbs’ syntactic frames by frequency",
        "author": "werdwirdwhyrd",
        "url": "https://www.reddit.com/r/linguistics/comments/9f0onr/looking_for_a_corpus_of_english_that_lists_verbs/",
        "text": "To clarify, I’m not interested in frequency itself - this is easy enough to find. I need a list of the frames each verb takes. For comparison, I’m using the Adesse corpus for Spanish. Any suggestions?",
        "created_utc": 1536694906,
        "upvote_ratio": ""
    },
    {
        "title": "Can someone explain the difference between the a- and o- series of consonants in Khmer?",
        "author": "stereotypicalheroguy",
        "url": "https://www.reddit.com/r/linguistics/comments/9f074a/can_someone_explain_the_difference_between_the_a/",
        "text": "",
        "created_utc": 1536691295,
        "upvote_ratio": ""
    },
    {
        "title": "What’s the origin of AAVE?",
        "author": "PenguinPigeonHybrid",
        "url": "https://www.reddit.com/r/linguistics/comments/9f06kr/whats_the_origin_of_aave/",
        "text": "[removed]",
        "created_utc": 1536691183,
        "upvote_ratio": ""
    },
    {
        "title": "Question about bilingual speakers and how they treat two languages",
        "author": "Hordiyevych",
        "url": "https://www.reddit.com/r/linguistics/comments/9ezm1r/question_about_bilingual_speakers_and_how_they/",
        "text": "Hi, if there is a more appropriate place to post this question please direct me there!\n\nI'm a bilingual speaker of Ukranian and English, with Ukrainian being my first language, however I've gone through the English education system so I've got an English accent when speaking English, but have still held on quite well to my Ukrainian accent when speaking the language. \n\nWhen I am speaking Ukrainian and want to use an English word I'm quite comfortable slotting one in, however I always pronounce it in a Ukrainian accent, for example when speaking to my parents. I find it hard to insert an English word in a British, despite me using a British when speaking English normally to friends or others. Additionally, when people ask me to speak English but with an accent, I always find it hard to so, despite me doing it perfectly easily when predominantly speaking Ukrainian to family or whoever. \n\nI'm curious why that happens, why there's such a large disconnect between what I can easily do in terms of speech, depending on what language I'm predominantly speaking. Thank you! Sorry if any of this is unclear, I'll be happy to clear up any confusion.",
        "created_utc": 1536687112,
        "upvote_ratio": ""
    },
    {
        "title": "How does modern gender-neutral language work with highly gendered languages?",
        "author": "Harsimaja",
        "url": "https://www.reddit.com/r/linguistics/comments/9ezif6/how_does_modern_genderneutral_language_work_with/",
        "text": "Here I am referring to any (probably minority) semi-popular movements or subcultures or official contexts that for their own reasons want to remove gender bias from a language, and the particular ways they go about this - not necessarily the usual forms of the language.\n\nLots of major languages (especially many Indo-European and Afro-Asiatic languages) have masculine and feminine genders far more pervasive than in English - it is often a grammatical requirement for not just third person pronouns but nearly every noun and adjective, and in many cases verbs. It's also true for pronouns and speaker-dependent markers in many East/South-East Asian languages. How do modern pushes for gender neutrality handle this?\n\nTraditionally the masculine was used as a default in many of these cases but are there modern drives to go further than that? I'm not asking what has caught on with everyone, just interested to see how certain semi-prominent subgroups tackle the issue linguistically. \n\nIn English there has been a push for several decades to change a few things: e.g. 'actor', originally masculine, gets used neutrally to encompass 'actress' too; the pronoun 'they' used where gender is unknown; even words imported from Romance languages like 'Latino/a' have a drive for neutral versions like 'Latinx'. But this isn't the same as changing a couple of words in every sentence.\n\nMany of these have a neuter case, but traditionally it is generally used only for inanimate persons with a few weird exceptions, and I imagine would broadly be like using \"it\" instead of \"they\" for an unknown person. Some like Dutch have merged the masculine and feminine into a \"common\" gender but I'm not referring to those. \n\nAsking from a linguistic standpoint. ",
        "created_utc": 1536686385,
        "upvote_ratio": ""
    },
    {
        "title": "Looking for an insider's perspective on linguistic research",
        "author": "Chanandler_Bond",
        "url": "https://www.reddit.com/r/linguistics/comments/9ezezj/looking_for_an_insiders_perspective_on_linguistic/",
        "text": "Hi all! Soon I'm starting a BA paper in linguistics. However, since I'm far from an expert, I feel like I'm not well-equipped to discern what subject in what linguistic branch is actually worth researching right now. I'd love to get some perspective from those of you initiated or interested in linguistics!\n\nWhat do you personally think is fascinating or underresearched right now? What is a linguistic mystery that needs to be solved? What topics should a young researcher definitely avoid? I'm particularly interested in language acquisition (both children and adults), but I'm all ears for other fields as well; all roads are open to me right now.\n\nI should mention that I study both Dutch and English and I have access to native speakers of both languages. Thanks a bunch!",
        "created_utc": 1536685711,
        "upvote_ratio": ""
    },
    {
        "title": "Possibly a very dumb question about the phonetics of trills.",
        "author": "Ledokolya",
        "url": "https://www.reddit.com/r/linguistics/comments/9ewyma/possibly_a_very_dumb_question_about_the_phonetics/",
        "text": "Okay, I really feel like this will turn out to have been a really stupid question and I'm just overlooking some literature that I should have known about, but here goes.\n\nI'm doing so work with L2 productions. My subjects are (8 of them) L1 Russian and L2 Japanese and I'm currently focusing on their productions of /r/, which is typically realized as a tap in Japanese and as an alveolar trill in Russian. It's a fairly simple recording test with subjects reading the Japanese carrier sentence これは(target word)と言います。\n\nAs one might expect the L2 productions are full of trills. What's unexpected is that I'm finding a lot of instances where the trill is preceded by a vowel-like... thing - a short period of usually fairly clear voice preceding the first closure of the trill. In terms of VOT that would be something like -50 ms, but I'm fairly sure it's not a negative VOT since Russian shouldn't have that. It also seems to be way too articulated for VOT, and while its formant structure seems to vary, it resembles mostly a schwa or a mid-front vowel. Finally, it's frequent, but not consistent - there are utterances where a word-initial trill is not preceded by it. This is present both in L1 Russian and L2 Japanese productions, and in the latter shows up a lot word-initially, slightly less after a nasal and markedly less inbetween two vowels. Finally, the trill's palatalized counterpart has a fricative-like realization, and this feature sometimes precedes that too. Peculiarly, I also have a separate test subject who is fully Russian-Japanese bilingual (grew up in a Russian-speaking household in Japan since infancy, currently 30) and his Japanese utterances lack this feature, while in the Russian ones it shows up inconsistently and seemingly with less frequency than the other L1 Russian subjects - though I haven't actually calculated that yet.\n\nI keep trying to find something that would give me an idea of what this, uh, thing is in the literature, but having trouble, because I don't really even know what to look for, which keywords to use. Prevoicing? Negative VOT? None of the works on phonetics I've seen seem to talk about this as a common feature of alveolar trills, so it could be specific to Russian? In any case, I'd be grateful for any pointers on how to analyze it.",
        "created_utc": 1536667728,
        "upvote_ratio": ""
    },
    {
        "title": "Opinion: A Linguist's Defense Of 'Falsehood'",
        "author": "liestrumptoldus",
        "url": "https://www.npr.org/2018/09/06/645240941/opinion-a-linguists-defense-of-falsehood",
        "text": "",
        "created_utc": 1536652056,
        "upvote_ratio": ""
    },
    {
        "title": "Computational Linguistics or Speech Pathology? - 5yrs later what do you guys think is a better career path?",
        "author": "ladywanders",
        "url": "https://www.reddit.com/r/linguistics/comments/12qknz/computational_linguistics_or_speech_pathology/",
        "text": "",
        "created_utc": 1536650084,
        "upvote_ratio": ""
    },
    {
        "title": "What's a linguistic feature that sounds really counter-intuitive but exists as an actual feature?",
        "author": "PortalandPortal2Rock",
        "url": "https://www.reddit.com/r/linguistics/comments/9eugs8/whats_a_linguistic_feature_that_sounds_really/",
        "text": "",
        "created_utc": 1536640577,
        "upvote_ratio": ""
    },
    {
        "title": "Noam Chomsky Language and Other Cognitive Systems",
        "author": "youndaimist",
        "url": "https://www.youtube.com/watch?v=ZptwQYHtOWI",
        "text": "",
        "created_utc": 1536636040,
        "upvote_ratio": ""
    },
    {
        "title": "How do Nahuatl nouns work?",
        "author": "SignificantBeing9",
        "url": "https://www.reddit.com/r/linguistics/comments/9etr5o/how_do_nahuatl_nouns_work/",
        "text": "What are the rules for compounding nouns? When is the absolutive removed? I’m mostly asking about Classical Nahuatl, but anything is welcome. Thanks!",
        "created_utc": 1536634781,
        "upvote_ratio": ""
    },
    {
        "title": "Is there a summary of different theories and models of Language Acquisition and SLA?",
        "author": "itsmeeeskai",
        "url": "https://www.reddit.com/r/linguistics/comments/9et74j/is_there_a_summary_of_different_theories_and/",
        "text": "A lot of theories and models have been presented in acquiring Language and about SLA, but is there a quicker way of understanding them easily without having to read pages and pages of journals and publications...? Thanks",
        "created_utc": 1536630135,
        "upvote_ratio": ""
    },
    {
        "title": "[NLP/NLU] Are there more idioms in English than in other widely spoken languages?",
        "author": "Feasinde",
        "url": "https://www.reddit.com/r/linguistics/comments/9eph4l/nlpnlu_are_there_more_idioms_in_english_than_in/",
        "text": "Are there any studies suggesting that English has a larger number of idioms compared to other widely spoken languages? A professor of mine recently made the claim that this supposed characteristic of English is what drove the rise of statistical methods in Natural Language Processing and Natural Language Understanding, but I have been unable to find any sources for such claim; it sounds to me rather dubious at first glance but, as a bilingual speaker of Spanish and English, I do find myself under the impression that I use many more idioms when speaking English.\n\n&amp;#x200B;\n\nThanks!",
        "created_utc": 1536602413,
        "upvote_ratio": ""
    },
    {
        "title": "Need an example of benefit of gendered nouns in Spanish",
        "author": "fxplace",
        "url": "https://www.reddit.com/r/linguistics/comments/9eos17/need_an_example_of_benefit_of_gendered_nouns_in/",
        "text": "[removed]",
        "created_utc": 1536597546,
        "upvote_ratio": ""
    },
    {
        "title": "What were the common features that linguists saw to hypothesize the existence of the Altaic language family?",
        "author": "HoopoeOfHope",
        "url": "https://www.reddit.com/r/linguistics/comments/9eo25d/what_were_the_common_features_that_linguists_saw/",
        "text": "We're not discussing the validity of the language family. Just asking what common features they have.",
        "created_utc": 1536592617,
        "upvote_ratio": ""
    },
    {
        "title": "Around when did English pronouns shift from nominative to oblique in disjunctives?",
        "author": "warlockelder",
        "url": "https://www.reddit.com/r/linguistics/comments/9enx6g/around_when_did_english_pronouns_shift_from/",
        "text": "i.e when did \"Who did this? Me.\", \"It's me\" etc. become more common than \"Who did this? I.\" \"It is I\" etc.",
        "created_utc": 1536591661,
        "upvote_ratio": ""
    },
    {
        "title": "A Guide To Logical Fallacies",
        "author": "nala1015",
        "url": "https://i.imgur.com/30HPR9p.jpg",
        "text": "",
        "created_utc": 1536588938,
        "upvote_ratio": ""
    },
    {
        "title": "Are there any forms of insular English today that are similar to Appalachian English?",
        "author": "Lothken",
        "url": "https://www.reddit.com/r/linguistics/comments/9en8fj/are_there_any_forms_of_insular_english_today_that/",
        "text": "I have read both theories that Appalachian English is an isolated form of English that originated from archaic Elizabethan and/or Scots-Irish English. There is a variety of archaic grammar that are still retained in Appalachia. My question are there similarities to Appalachia that still reside around the epicenter of English? Is there anywhere that retains the same intimations and/or grammar as Appalachian English? ",
        "created_utc": 1536586880,
        "upvote_ratio": ""
    },
    {
        "title": "This week's Q&amp;A thread -- please read before asking or answering a question! - September 10, 2018",
        "author": "AutoModerator",
        "url": "https://www.reddit.com/r/linguistics/comments/9emyso/this_weeks_qa_thread_please_read_before_asking_or/",
        "text": "Do you have a quick question about language or linguistics that doesn’t merit its own thread? Our weekly Q&amp;A thread is the perfect place to post them! A new Q&amp;A thread goes up every Monday, but we have people who read them regularly throughout the week.\n\n**What counts as a “quick question”?**\n\nAny question that can be answered in a single comment and is unlikely to generate discussion is a quick question. While it’s impossible to predict which questions will generate disscussion all of the time, here are some examples: \n\n*Quick questions:*\n\n* Asking for an explanation of a technical term\n* Asking if there are any languages with a particular feature\n* Asking how we would transcribe something\n* Asking how a feature works in a particular language\n\n*Not-so-quick questions:*\n\n* Asking about the theoretical or methodological motivation for a particular claim\n* Asking for reading recommendations for a particular subject\n\nIf you’re not sure where your question belongs, just use your best judgment. The mods might ask you to move your question—but if so, it’s no big deal, and has nothing to do with the quality of the question.\n\nAlso, before asking a question, please be sure to check [**our FAQ**](https://www.reddit.com/r/linguistics/wiki/faqindex) and to do a quick Google or Wikipedia search. We’re happy to answer questions, but we appreciate it when people have tried to do some basic research first. You may also be interested in our [**reading list**](https://www.reddit.com/r/linguistics/wiki/readinglist).\n\n**Commenting rules**\n\nThe rules for commenting in this post are the same as for the rest of /r/linguistics. You don’t have to be a flaired user to answer questions, but we expect answers to reflect an expert level of knowledge. Please familiarize yourself with [**our commenting policy**](https://www.reddit.com/r/linguistics/comments/1u9xsr/reminder_of_the_rlinguistics_commenting_policy/) and [**our subreddit rules**](https://www.reddit.com/r/linguistics/wiki/rules).\n\n**What if I didn't get an answer to my question last week?**\n\nYour question probably wasn’t answered because no one who knew the answer saw it. This could be because you posted it soon before the new Q&amp;A thread went up, or it could be because it the answer requires specialist knowledge.  If this happens, feel free to repost your question in the new Q&amp;A thread, or to post it as a separate thread.",
        "created_utc": 1536584777,
        "upvote_ratio": ""
    },
    {
        "title": "Can anyone help me identify the language on the bottom here? (Sweden)",
        "author": "Captain_Halibut",
        "url": "https://i.redd.it/di574016qdl11.jpg",
        "text": "",
        "created_utc": 1536571404,
        "upvote_ratio": ""
    },
    {
        "title": "Phonemes' stability hierarchy?",
        "author": "HoopoeOfHope",
        "url": "https://www.reddit.com/r/linguistics/comments/9el6n5/phonemes_stability_hierarchy/",
        "text": "Has anyone tried to list phonemes based on their stability across the world languages? For example; [k] before [a] is stable but [k] before [i] is not because of the palatalization which can change to [tʃ].\n\nI know that consonants evolve in many different ways but has there ever been an observable pattern to which consonants are more likely to change across languages?",
        "created_utc": 1536568689,
        "upvote_ratio": ""
    },
    {
        "title": "Is there a term for the colloquial phonetic representations people use?",
        "author": "tree1000ten",
        "url": "https://www.reddit.com/r/linguistics/comments/9ekm76/is_there_a_term_for_the_colloquial_phonetic/",
        "text": "[removed]",
        "created_utc": 1536562886,
        "upvote_ratio": ""
    }
]