[
    {
        "title": "How can I install in one partition of an external SSD?",
        "author": "zbregans",
        "url": "https://www.reddit.com/r/linux/comments/10o4kw3/how_can_i_install_in_one_partition_of_an_external/",
        "text": "[removed]",
        "created_utc": 1674987577,
        "upvote_ratio": 1.0
    },
    {
        "title": "Announcing a new \"meme\" Linux distro",
        "author": "cruzzeky",
        "url": "https://www.reddit.com/r/linux/comments/10o3jml/announcing_a_new_meme_linux_distro/",
        "text": "I have no way with words but here we are. Soon I will begin development on a Breaking Linux a debian based breaking bad distro. Similar to AmogOs. Next week I will begin development such as theming, debloating and more. Until I start I will be doing research and any ideas will be appreciated.",
        "created_utc": 1674983475,
        "upvote_ratio": 1.0
    },
    {
        "title": "what is we used used chat gtp3 to finish whay aaron swartz started",
        "author": "ComfortableBasis3046",
        "url": "https://www.reddit.com/r/linux/comments/10o2t6b/what_is_we_used_used_chat_gtp3_to_finish_whay/",
        "text": "[removed]",
        "created_utc": 1674980613,
        "upvote_ratio": 1.0
    },
    {
        "title": "My new blog",
        "author": "Key-Sheepherder-1365",
        "url": "https://www.reddit.com/r/linux/comments/10nzy4x/my_new_blog/",
        "text": "[removed]",
        "created_utc": 1674970207,
        "upvote_ratio": 1.0
    },
    {
        "title": "what is the computer illiterate breakdown of this world with blue belly and brain video games etc?",
        "author": "OG_Original_Goonie",
        "url": "https://www.reddit.com/r/linux/comments/10nzq82/what_is_the_computer_illiterate_breakdown_of_this/",
        "text": "[removed]",
        "created_utc": 1674969473,
        "upvote_ratio": 1.0
    },
    {
        "title": "My New Blog?",
        "author": "Key-Sheepherder-1365",
        "url": "https://www.reddit.com/r/linux/comments/10nzhh3/my_new_blog/",
        "text": "[removed]",
        "created_utc": 1674968633,
        "upvote_ratio": 1.0
    },
    {
        "title": "amog os revival",
        "author": "cruzzeky",
        "url": "https://www.reddit.com/r/linux/comments/10nzb7w/amog_os_revival/",
        "text": "Hey idk if yall remeber amog os but recently it was shutdown and ive copied the repo to be open sus check it out at [https://github.com/comicaldevs/open-sus](https://github.com/comicaldevs/open-sus) . I would like some people to help out with the repo once i get the permissions sorted.",
        "created_utc": 1674968068,
        "upvote_ratio": 1.0
    },
    {
        "title": "Run 9 versions of Linux through Windows 10/11 WSL",
        "author": "Physical-Excuse-5906",
        "url": "https://home127001.com/how-to-configure-ansible/",
        "text": "",
        "created_utc": 1674964941,
        "upvote_ratio": 1.0
    },
    {
        "title": "Anybody know of some quality neural TTS that's libre/open-source?",
        "author": "Ryluv2surf",
        "url": "https://www.reddit.com/r/linux/comments/10nwk1j/anybody_know_of_some_quality_neural_tts_thats/",
        "text": "Looking for a pleasant to listen to TTS for listening to long documents while playing games or otherwise occupied. I've tried Festival but find it artificial sounding and not up to scruff. \n\nI wish Hackernoon's neural TTS for reading articles was available but doesn't seem to be, or atleast can't find it.",
        "created_utc": 1674959277,
        "upvote_ratio": 1.0
    },
    {
        "title": "Just got arch working on a Chromebook!!",
        "author": "Philofun2010",
        "url": "https://i.redd.it/dedozkzhpxea1.jpg",
        "text": "",
        "created_utc": 1674959152,
        "upvote_ratio": 1.0
    },
    {
        "title": "System76 is working on Pop!_OS's immutable base",
        "author": "Remote_Tap_7099",
        "url": "https://github.com/pop-os/core",
        "text": "",
        "created_utc": 1674956072,
        "upvote_ratio": 1.0
    },
    {
        "title": "System76 is working on Pop!_OS's immutable base",
        "author": "Remote_Tap_7099",
        "url": "https://github.com/pop-os/core/tree/master/src",
        "text": "",
        "created_utc": 1674955945,
        "upvote_ratio": 1.0
    },
    {
        "title": "Sytem76 is working on Pop!_OS's immutable base",
        "author": "Remote_Tap_7099",
        "url": "https://github.com/pop-os/core",
        "text": "",
        "created_utc": 1674955809,
        "upvote_ratio": 1.0
    },
    {
        "title": "Chainguard Unveils Memory-Safe Linux Distribution",
        "author": "dlorenc",
        "url": "https://securityboulevard.com/2023/01/chainguard-unveils-memory-safe-linux-distribution/",
        "text": "",
        "created_utc": 1674955184,
        "upvote_ratio": 1.0
    },
    {
        "title": "Unable to remove directory",
        "author": "slicher_dev",
        "url": "https://i.redd.it/8eri8m3ecxea1.png",
        "text": "[removed]",
        "created_utc": 1674954740,
        "upvote_ratio": 1.0
    },
    {
        "title": "Split files across two locations",
        "author": "goiter12345",
        "url": "https://www.reddit.com/r/linux/comments/10nugez/split_files_across_two_locations/",
        "text": "I have two drives, and a project where I want to use the space from two drives, for a single directory. Is there a relatively simple way to do this? Ideally I would want to set a space limit where if the first drive is full, it moves on to the next drive.",
        "created_utc": 1674952948,
        "upvote_ratio": 1.0
    },
    {
        "title": "my trash specs and UPTIME",
        "author": "bmp_dev",
        "url": "https://www.reddit.com/r/linux/comments/10ntu1i/my_trash_specs_and_uptime/",
        "text": "[removed]",
        "created_utc": 1674951205,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to configure Host Managed SMR drives",
        "author": "Streetluger06",
        "url": "https://www.reddit.com/r/linux/comments/10ntt92/how_to_configure_host_managed_smr_drives/",
        "text": "I am new to Linux and trying to get some host managed SMR drives working on a Fedora desktop. I made sure to use the latest version of fedora, which has a compatible kernel. I've installed the necessary add-ons to view the device and verify it's recognized. But whenever I try to write a gpt partition table or format the drive to ext4, I get IO errors and corrupt partition tables. \n\nAre there any resources out there that I can reference to try and get this working? I've been looking and haven't found anything that is helping. I reviewed the SMART scan results and the drive appears to be functioning properly, and they are supposed to be brand new. I can provide more info as needed, but at this point I have tried so many tools and commands I can't begin to post them all. \n\nAny resources or advice is appreciated.  And please remember I am new to Linux systems and Fedora, so expect noob mistakes to be a possibility here.",
        "created_utc": 1674951147,
        "upvote_ratio": 1.0
    },
    {
        "title": "Arch users: Why do you install clean arch instead of installing an arch-based distro like Kali?",
        "author": "pkuba208",
        "url": "https://www.reddit.com/r/linux/comments/10nsw8i/arch_users_why_do_you_install_clean_arch_instead/",
        "text": "[removed]",
        "created_utc": 1674948654,
        "upvote_ratio": 1.0
    },
    {
        "title": "Wine 8.0 Released",
        "author": "goldensyrupgames",
        "url": "https://www.winehq.org/announce/8.0",
        "text": "",
        "created_utc": 1674945277,
        "upvote_ratio": 1.0
    },
    {
        "title": "Suggesting a name for my app.",
        "author": "hicham_lamine",
        "url": "https://i.redd.it/5nxh2v5tzuea1.png",
        "text": "",
        "created_utc": 1674944545,
        "upvote_ratio": 1.0
    },
    {
        "title": "I was super excited to get this book. This is actually the 2nd religious mention. 1st I was will to let slide. But I haven’t hit the Table of Contents yet but, I sincerely hope this is last mention of the imaginary man and his imaginary family that do magic tricks.",
        "author": "FunkRogers",
        "url": "https://www.reddit.com/r/linux/comments/10nqxa6/i_was_super_excited_to_get_this_book_this_is/",
        "text": "",
        "created_utc": 1674943488,
        "upvote_ratio": 1.0
    },
    {
        "title": "Has anyone else seen a uptick in companies, for me smaller ones, adopting, or asking for a no Microsoft /Windows solution? I usually handle smaller companies that are cnc, large 100 ton presses, but lately, the requests have been to set up a new system devoid of anything Microsoft.",
        "author": "No_BoneSpurs_Here",
        "url": "https://www.reddit.com/r/linux/comments/10nos5s/has_anyone_else_seen_a_uptick_in_companies_for_me/",
        "text": "",
        "created_utc": 1674938007,
        "upvote_ratio": 1.0
    },
    {
        "title": "Had a quick question.",
        "author": "jarebearrrr",
        "url": "https://www.reddit.com/r/linux/comments/10nop44/had_a_quick_question/",
        "text": "Hopefully I don’t sound dumb. But I have a Kali Linux VM that I noticed uses the zsh shell. And I know Mac also uses zsh. So, being as they both use zsh, does that mean the shells work the same even though they are on different kernels? Or do they have different functions since the kernel is different? I am pretty much a beginner. I’m still trying to wrap my head around kernels, and how to use Linux and the different shell types. Thanks for any feedback!",
        "created_utc": 1674937798,
        "upvote_ratio": 1.0
    },
    {
        "title": "Tukzedo: A highly-opinionated, non-democratically led Linux distro concept based on ZFS and TPM. Immutable, rolling. Intended to be secure, install-once-and-use-for-life, functionally immortal. Some ideas may enrage ~1/3 of linux fans, and hopefully also RMS if it were to rise to his attention.",
        "author": "t00mietum",
        "url": "https://www.reddit.com/r/linux/comments/10no725/tukzedo_a_highlyopinionated_nondemocratically_led/",
        "text": "Tukzedo will reflect everything I've personally and professionally wanted in a distro, as an ethusiast, developer, devops manager, CTO. (And linix user since \\~'07, Solaris and Mac since \\~'08, and DOS/Windows since \\~1986.) Some distros are getting close in specific narrow areas (MicroOS, Silverblue, Nix, Funtoo, Ubuntu, GoboLinux) - but not all at once yet and not fast enough. And it's likely none ever will in total.\n\n## Features\n\n- ZFS-based &lt;sup&gt;1&lt;/sup&gt;.\n- Rolling-release, but *stable* &lt;sup&gt;2&lt;/sup&gt;.\n- \"Immutable\", similar implementation as MicroOS, but ZFS-based rather than Btrfs. Likewise with snapshots selectable at boot-time.\n- TPM2, SecureBoot, and encrypted root pool - enabled and configured, out-of-the-box, transparently, at install time. &lt;sup&gt;3&lt;/sup&gt;\n\t- Exception for running in a VM.\n\t- The only parts not encrypted with TPM are `/boot`, and `/home`.\n\t- Like all end-user TPM installations, the master decryption key can be written-down or exported at install time.\n- All user filesystems under `/home` are encrypted by default, with each user's password, integrated into PAM. &lt;sup&gt;4&lt;/sup&gt;\n- Fine-grained user-level ZFS filesystems - and GUI helpers - for finer-grained auto snapshots and rollback. &lt;sup&gt;5&lt;/sup&gt;\n- All major DEs supported, up-to-date, as first-class citizens, as a project priority. Gnome, KDE, XFCE, Mate, Cinnamon, Budgie, Lxqt. &lt;sup&gt;6&lt;/sup&gt; Tiny market share DEs like bare tiling WMs, available but not officially supported.\n- Integrated GUI ZFS helpers, such as:\n\t- \"Time-machine\". Similar to how OpenSolaris once (still?) had a ZFS time-machine baked into the Nautilus. Maybe literally the same code.\n\t- GUI helpers for things such as converting a single boot drive into a mirror or RAIDZ.\n\t- Auto-snapshot configuration (perhaps based on Sanoid).\n- Nemo is the overriden default file manager on all DEs (independent of it's unnecessary Cinnamon DE dependencies). But easy to change back to DE default if desired. &lt;sup&gt;7&lt;/sup&gt;\n- Most (eventual goal of all) non-DE-bundled applications will be flatpak-based, with the not tangential benefit of decoupling upgrade dependency hell. &lt;sup&gt;8&lt;/sup&gt;\n- Modern, non-FHS-standard filesystem layout &lt;sup&gt;9&lt;/sup&gt;. Each individual user can choose to see the default modern layout, or only the legacy FHS layout - and switch back and forth at will without reboot or logging out. Example of layout at root (with redundancies implied rather than shown):\n\n\t~~~\n\t/\n\t    legacy/\n\t\t\tbin/\n\t\t\tboot/\n\t\t\tdev/\n\t\t\t⋯\n\t\t\ttmp/\n\t\t\tusr/\n\t\t\tvar/\n\t\tsystem/\n\t\t\texec/\n\t\t\t\tconfig.yaml\n\t\t\t\tapps/\n\t\t\t\t\tconfig.yaml\n\t\t\t\t\tcustom/\n\t\t\t\t\tflatpak/\n\t\t\t\t\tzpkg/\n\t\t\t\t\t\tconfig.yaml\n\t\t\t\t\t\t4c7747b1-f669-461a-a4ee-ed7a082914d5/\n\t\t\t\t\t\t\tconfig.yaml\n\t\t\t\t\t\t\tversions/\n\t\t\t\t\t\t\t\t449791c6-e636-41c2-b823-b5e54546f424/\n\t\t\t\t\t\t\t\t\tconfig.yaml\n\t\t\t\t\t\t\t\t\tx86_64/\n\t\t\t\t\t\t\t\t\t\tconfig.yaml\n\t\t\t\t\t\t\t\t\t\tbinaries/\n\t\t\t\t\t\t\t\t\t\tdata/\n\t\t\t\t\t\t\t\t\t\tlibraries/\n\t\t\t\t\t\t\t\t45340e02-00f9-4448-b05a-0e848ac9f9d3/\n\t\t\t\tsysbin/\n\t\t\t\t\tbinaries/\n\t\t\t\t\t\tx86_32/\n\t\t\t\t\t\tx86_64/\n\t\t\t\t\tconfig/\n\t\t\t\t\tdata/\n\t\t\t\t\tlibraries/\n\t\t\tcache/\n\t\t\t\tapps/\n\t\t\t\tsystem/\n\t\t\tdata/\n\t\t\t\tlogs/\n\t\t\tdevices/\n\t\t\tprocesses/\n\t\t\tservers/\n\t\t\t\tsftp/\n\t\t\t\tsmbd/\n\t\t\t\twww/\n\t\t\t\t\t17c3195f-c2c9-4762-a813-e747e98c3c3e/\n\t\t\tservices/\n\t\t\t\tcron/\n\t\t\t\tsystemd/\n\t\t\tsockets/\n\t\t\ttemp/\n\t\t\t\tpersistent/\n\t\t\t\tsession/\n\t\tusers/\n\t\t\talbert/\n\t\t\t\tLegacy/\n\t\t\t\t\t.Trash-0/\n\t\t\t\t\t⋯\n\t\t\t\t\t.var/\n\t\t\t\tSystem/\n\t\t\t\t\texec/\n\t\t\t\t\t⋯\n\t\t\t\t\ttemp/\n\t\t\t\tUser/\n\t\t\t\t\tDesktop/\n\t\t\t\t\tDocuments/\n\t\t\t\t\t⋯\n\t\t\t\t\tPictures/\n\t\t\t\t\tTrash/\n\t\t\troot/\n\t\t\t\t## legacy layout, but under '/home/root'\n\t~~~\n\n## Endnotes\n\n1. **ZFS and GPLv2/CDDL**: It's as close to settled legal opinion as is possible in un-court-tested software matters, that this is legally OK. Good enough for me, at least. As a separate exercise, I've poured over the alleged \"license incompatibility\" issues between GPLv2 and CDDL - and as a non-lawyer, I agree with the majority consensus of software legal experts.\n\t- Oracle - as the majority copyright holder on ZFS - have themselves already set the legal precedent that would be used against them in court, by distributing GPLv2 and CDDL binaries, inseparably, in the same base distro (Unbreakable Linux).\n\t- GPLv3 and GPLv2 are exactly as incompatible, and in exactly the same way, as CDDL and GPLv2. So the militant RMS-like stance about a vague and arguably incorrectly interpreted catch-22, hardly seems warranted.\n\t- But if you still disagree, then don't use Ubuntu, nor this nonexistent distro.\n2. **Rolling-release**: Due to other intended features, this might not be based on an existing \"testing\" or bleeding-edge rolling distro like Deb testing (which would otherwise be ideal), Tumbleweed, Arch, Gentoo, etc. Or if so, updates would held for more exhaustive vetting and testing. (And if Arch-based, `pacman` would not used or even *available*.) Frequency of available updates would be close to the same, just behind by a few weeks. Compared to a typical LTS model, this would still be light-years more up-to-date. (Except that \"light-year\" is a measure of distance, not time. Except that space and time are bound up together, so it actually is. Also, it's a year.)\n3. **TPM+SecureBoot**: If this distro comes to fruition, this would obviously be one of the more controversial and hated features by the people that choose not to drive it. And possibly by some that do. (Fortunately there are literally hundreds of other distros to choose from.)\n\t- While TMP2 et. al are not flawless or free of exploits, most people don't have the NSA, elite corporate spies, or the Russian mafia after them - they just want their data reasonably secure from some random opportunists, if they leave their laptop at the airport or coffee shop.\n\t- Few people express angst that *every* iPhone, Android, Macbook, OEM Windows laptop, or Chromebook sold in the world, is secured with some form of TPM+SecureBoot. This is just another layer in the security toolset.\n\t- The only reason more Linuxphiles don't use it now, is because it's a royal PITA to set up with existing \"tools\".\n4. **Encrypted home dirs**: This is already possible - I'm running it now - but it can be wonky. And changing passwords in an integrated way needs work, but is possible.\n5. **Fine-grained user autosnapshotting**: Each top level \"capitalized\" folder under `~`, for starters, gets it's own filesystem. Configurable via declaration-based policy. (How nice would it be, for example, to be able to roll-back only `~/Dropbox`? I can tell you, it's very nice and headache-saving.)\n6. **DEs**: Installed by default with less-jarring initial experiences. Gnome, for example, gets installed with desktop icons and other popular extensions enabled by default. Plasma installed with thinner, single-row panel. Xfce with only one panel. Etc.\n7. **Nemo**: Why? Because it's the best, most user-friendly, \"least-surprising\" file manager available on Linux. Feel free to disagree. It is currently possible to separate Nemo from Cinnamon, just not necessarily easy, depending on the distro. (Easy to do on any Ubuntu 18-22 DE, with the right instructions.)\n8. **Flatpak**: If a high-priority app doesn't have a flatpak in flathub or other popular, safe repos - and/or it doesn't run very well (eg Firefox, Steam) - then we'll add it and/or improve it for flathub ourselves - or if that proves problematic, add it to our own curated, closed hub that exists only to fill individual gaps in flathub and other open hubs until the situation improves on a per-app basis.\n9. **Linux Filesystem Hierarchy Standard**: Internally, a full FHS structure would have to be supported and \"navigable\", just hidden by default. Hiding parts of a filesystem doesn't necessarily require kernel modification, as GoboLinux has nicely demonstrated. Other features:\n    - Similar to GoboLinux, Nix, and several others, software won't be installed all over the place, but rather in one dir per package, more like MacOS. But as those other distros have found - and largely solved - this isn't as easy as it sounds, as without a bag of tricks for the rest of the system, it breaks other stuff. Fortunately there are existing projects like 'GNU Stow' that make retaining compatibility with FHS and existing utilities easier.\n    - Multiarch is probably here to stay if not expand in the future, so that will be even better supported.\n    - Multiple versions of applications (not just flatpaks) supported.\n    - This layout idea is based on my own decades-long evolution of personal directory layouts, but is a WIP and could use some tweaks for more flexibility and thinking for inevitable future abuse/entropy.\n\nIf you downvote this because you're rolling your eyes thinking, \"not another distro\", or \"dude, ideas are a dime a dozen\", then hey - fair enough. But if it's because you're irrationally upset over something involving tradition or convention, then I *may* be on the right track. (Or, the upset could also be valid, who knows. Let's discuss.)\n\nWho's ready to join the team? I mean, once it's funded.",
        "created_utc": 1674936487,
        "upvote_ratio": 1.0
    },
    {
        "title": "nix-init - Generate Nix packages from URLs with hash prefetching, dependency inference, license detection, and more",
        "author": "figsoda",
        "url": "https://www.reddit.com/r/linux/comments/10nnyz0/nixinit_generate_nix_packages_from_urls_with_hash/",
        "text": "[Source Code](https://github.com/nix-community/nix-init)\n\n[![](https://asciinema.org/a/555367.svg)](https://asciinema.org/a/555367)\n\n- Hash prefetching powered by [nurl]\n- Dependency inference for Rust packages using the [Riff](https://github.com/DeterminateSystems/riff) registry and python projects\n- Interactive prompts with fuzzy tab completions\n- License detection\n- Supported builders\n  - `stdenv.mkDerivation`\n  - `buildRustPackage`\n  - `buildPythonApplication` and `buildPythonPackage`\n  - `buildGoModule`\n- Supported fetchers\n  - `fetchCrate`\n  - `fetchFromGitHub`\n  - `fetchFromGitLab`\n  - `fetchFromGitea`\n  - `fetchPypi`\n  - All other fetchers supported by [nurl] are also supported, you just have to specify the tags manually\n\n```\nUsage: nix-init [OPTIONS] &lt;OUTPUT&gt;\n\nArguments:\n  &lt;OUTPUT&gt;  The path to output the generated file to\n\nOptions:\n  -u, --url &lt;URL&gt;        Specify the URL\n  -c, --config &lt;CONFIG&gt;  Specify the config file\n  -h, --help             Print help\n  -V, --version          Print version\n```\n\n[nurl]: https://github.com/nix-community/nurl",
        "created_utc": 1674935926,
        "upvote_ratio": 1.0
    },
    {
        "title": "I made an emoji picker compatible with XServer and Wayland through Fcitx5 or IBus",
        "author": "GaZaTu",
        "url": "https://github.com/GaZaTu/im-emoji-picker",
        "text": "",
        "created_utc": 1674933921,
        "upvote_ratio": 1.0
    },
    {
        "title": "Switching from Windows 11 to linux, what should I expect?",
        "author": "bdhd656",
        "url": "https://www.reddit.com/r/linux/comments/10nmlo1/switching_from_windows_11_to_linux_what_should_i/",
        "text": " I've  always used Windows and never really considered switching, but two  years ago I made the decision to do some research and completely fell in  love with Linux. Unfortunately, the game industry crushed my dream.\n\nToday,  with fewer complaints about games not working and me playing less video  games overall, I decided to check if the applications I use every day  were available on Linux. I have never encountered a community that has  been more helpful, and this encouraged me to give Linux a try. However,  I'm not sure what I missed out on, what I'll miss, or what to expect.\n\nI've  chosen Pop\\_OS! because it seems the simplest and most polished out of  the bunch I've seen, and I've heard that it can install drivers  automatically, which is always a plus. As a college student, I would  like to be able to evaluate the \"risk\" and at the very least know what  to expect when I make the decision.",
        "created_utc": 1674932426,
        "upvote_ratio": 1.0
    },
    {
        "title": "How good is ClamAV against latest Windows threats?",
        "author": "th3bucch",
        "url": "https://www.reddit.com/r/linux/comments/10nmlm8/how_good_is_clamav_against_latest_windows_threats/",
        "text": "As as said on the title, how good is it?\n\nSome background info:  \nYesterday a friend of mine has found some kind of virus on his Windows 10 machine. He's typically smart and careful about digital security but he got it anyway, not knowing how.  \nWhen I spoke to him after work, he was already cleaning the machine so the only info I got about the malware was that his carrier was a `.scr` file but no further info on his payload. a quick search on google shows that the most common viruses delivered that way are cryptolockers and cryptocurrency miners. Not having got anything encrypted we can safely exclude the first.\n\nThe malware had also disabled his AV (Windows Security) and other services like Teamviewer.  \nHe deleted all copies of the `.scr` file then performed a full scan of all the drives in Winows' safe mode, not finding any more threats.\n\nI suggested him to scan the system with a better AV software, my knowledge on the matter as a long time Linux user is a bit rusty but I had no problem so far with the commercial AV I have on the laptop the company I work for supplied me.\n\nAnyway, he didn't want to install a commercial software, neither trial or paid, and anyone knows the free ones are full of ads and bloated with useless tools, so my last suggestion was to try a Linux live with `ClamAV`.  \nI then discovered there is a Windows Client called `ClamWin` which is just a GUI for the ClamAV engine.  \nAfter getting sure it was updated ad uses the latest definitions database he did another full scan, again not findidng threats.\n\nSo, how reliable is threat detection of this AV software on newer viruses?\n\nSorry for the long post, tl;dr not needed I think.",
        "created_utc": 1674932422,
        "upvote_ratio": 1.0
    },
    {
        "title": "Thanks to MXLinux I rescued an old Asus 2-in1",
        "author": "justme424269",
        "url": "/r/MXLinux/comments/10nlmoh/thanks_to_mxlinux_i_rescued_an_old_asus_2in1/",
        "text": "",
        "created_utc": 1674930042,
        "upvote_ratio": 1.0
    },
    {
        "title": "Yes, this belongs here. Wonder if anyone else gets why",
        "author": "ad-on-is",
        "url": "https://www.instagram.com/reel/Cl5tA--DPow/?igshid=YmMyMTA2M2Y=",
        "text": "",
        "created_utc": 1674927516,
        "upvote_ratio": 1.0
    },
    {
        "title": "pls help double click isn't working on my mouse (lubuntu 22 lts)",
        "author": "Samaykom",
        "url": "https://i.redd.it/q27f9x4n0vea1.png",
        "text": "",
        "created_utc": 1674926582,
        "upvote_ratio": 1.0
    },
    {
        "title": "Installed linux, what is this extra partition.",
        "author": "GyanPrakash2483",
        "url": "https://i.imgur.com/xzdj2kF.png",
        "text": "I am pretty new to linux and using alternative operating systems so sorry if I am asking something dumb.\n\nSo I have a 256GB SSD in which linux was installed(I used \"erase disk and install\" option), when I look at the partitions, there is this 537MB partition on the same SSD alongside this 256GB partition.\n\nWhat is this 537MB partition and how is there this extra 537MB partition if my SSD is only 256GB in size?",
        "created_utc": 1674926135,
        "upvote_ratio": 1.0
    },
    {
        "title": "Grub vs systemd",
        "author": "readntraveln",
        "url": "https://www.reddit.com/r/linux/comments/10nk35q/grub_vs_systemd/",
        "text": "[removed]",
        "created_utc": 1674925987,
        "upvote_ratio": 1.0
    },
    {
        "title": "Looking to get into Linux!",
        "author": "Hillpaws",
        "url": "https://www.reddit.com/r/linux/comments/10njzlq/looking_to_get_into_linux/",
        "text": "[removed]",
        "created_utc": 1674925726,
        "upvote_ratio": 1.0
    },
    {
        "title": "Taeknown - Topic (Shot By Dexta Dave)",
        "author": "Plane-Childhood-942",
        "url": "https://youtu.be/oY905Lbg8Wc",
        "text": "",
        "created_utc": 1674923847,
        "upvote_ratio": 1.0
    },
    {
        "title": "Carbonyl: Forking Chrome to render in a terminal",
        "author": "biendi",
        "url": "https://fathy.fr/carbonyl",
        "text": "",
        "created_utc": 1674922735,
        "upvote_ratio": 1.0
    },
    {
        "title": "RHEL 8.6 move /boot, /root",
        "author": "Ok_Win9939",
        "url": "https://www.reddit.com/r/linux/comments/10nipbb/rhel_86_move_boot_root/",
        "text": "\nHello guys,\n\nLet's say i have a rhel 8.6 image that is already installed with /boot/efi mounted on /dev/vda1 and /root on /dev/vda2  and defalut VM size is 40Gb.\n\nI want to reduce /root to ~20GB, i've tried by adding a 2nd disk and moving them there, but i have some trouble when boot. \n\nAny ideea how to do that? \n\nPs: it would be great if there is any option to do it in openstack directly, if not, i can use virtualbox. A bit limited to these 2 options..",
        "created_utc": 1674922453,
        "upvote_ratio": 1.0
    },
    {
        "title": "error message - Bluetooth related",
        "author": "Useful_Distance4325",
        "url": "https://www.reddit.com/r/linux/comments/10nim9g/error_message_bluetooth_related/",
        "text": "[removed]",
        "created_utc": 1674922228,
        "upvote_ratio": 1.0
    },
    {
        "title": "Python Script Help",
        "author": "Nchlstoo",
        "url": "https://www.reddit.com/r/linux/comments/10nictj/python_script_help/",
        "text": "[removed]",
        "created_utc": 1674921577,
        "upvote_ratio": 1.0
    },
    {
        "title": "Python Script help",
        "author": "Nchlstoo",
        "url": "https://www.reddit.com/r/linux/comments/10niar9/python_script_help/",
        "text": "[removed]",
        "created_utc": 1674921425,
        "upvote_ratio": 1.0
    },
    {
        "title": "How good would be this ? a Linux phone from a serious Linux company",
        "author": "prueba_hola",
        "url": "https://i.redd.it/vrz9x4qe1tea1.png",
        "text": "",
        "created_utc": 1674920807,
        "upvote_ratio": 1.0
    },
    {
        "title": "Hailer: C-library for inter-process/inter-node messaging in a network",
        "author": "Puzzled_Ad_104",
        "url": "/r/embedded/comments/10jkncv/hailer_clibrary_for_interprocessinternode/",
        "text": "",
        "created_utc": 1674919421,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is there a Win+X menu equivalent?",
        "author": "Weekly-Courage-7493",
        "url": "https://www.reddit.com/r/linux/comments/10nh75h/is_there_a_winx_menu_equivalent/",
        "text": "[removed]",
        "created_utc": 1674918512,
        "upvote_ratio": 1.0
    },
    {
        "title": "Dual boot fail",
        "author": "relicrb",
        "url": "https://www.reddit.com/r/linux/comments/10ngyk9/dual_boot_fail/",
        "text": "[removed]",
        "created_utc": 1674917851,
        "upvote_ratio": 1.0
    },
    {
        "title": "What am I doing wrong? Linux Bootable USB",
        "author": "ViolinistSea1792",
        "url": "https://www.reddit.com/r/linux/comments/10ngmqp/what_am_i_doing_wrong_linux_bootable_usb/",
        "text": "I'm actually starting to become unsure as to whether it's possible to do this. \n\nI'd like to create a USB key which will allow me to boot Linux off of it, that I can move between different machines to always have a \"portable pc\" as it were. I'd like to be able to install programmes on it and be able to constantly save new data on it, if that's possible? \n\nHere's what I've tried so far; I've installed the linux booter onto a USB using Rufus and Linux Mint (Cinnamon) v 21.1, which creates the installer on said USB key. Ok. Cool, now I'll try to use that booter to install actual Linux onto another USB key, so I can have it as a portable version of Linux. Nope, isn't working, and after hours of trying I'm hitting nothing. The only thing I can think of is needing maybe a lightweight distro instead of cinnamon? Or is this not doable on a USB, only on an external HDD/SDD?\n\nIf someone has any advice or a guide I'd be very appreciative, thank you!",
        "created_utc": 1674916937,
        "upvote_ratio": 1.0
    },
    {
        "title": "I made measurement software that simplifies DRC to the point of being comparable with doing DRC via AVR",
        "author": "Mister_Magister",
        "url": "https://v.redd.it/d4gfpquiksea1",
        "text": "",
        "created_utc": 1674915083,
        "upvote_ratio": 1.0
    },
    {
        "title": "Introducing the common input method",
        "author": "hodong-kim",
        "url": "https://www.reddit.com/r/linux/comments/10netld/introducing_the_common_input_method/",
        "text": "# Common input method\n\nCim stands for Common input method.\n\nInput methods in Linux and BSD are fragmented.  \nThere are many input methods in Linux and BSD, such as XIM, Gtk-IM, Qt-IM, and Wayland-IM.\n\nCim is software that integrates these input methods.\n\nAlready, the Gtk input method and the Qt input method are plugin methods, and it has already been proven that there is no problem for decades when these plugin methods are used for input.\n\nHowever, since the Gtk input method and Qt input method depend on Gtk and Qt, respectively, X-only, Java, Wayland-only, and console-only applications cannot use such Gtk and Qt input methods.\n\nSo I designed a common input method with C API by removing the dependency on Gtk from the Gtk input method.\n\nCim is made with C API and has no dependencies, so it can be used in various computer languages and applications.\n\n## How it works\n\n`cim.h` contains interfaces and types.  \n`cim.c` contains functions for applications to use input contexts.  \nIf necessary, I plan to separate the API required by the application and the API required by the input tools(IME).\n\n* Location of plugins\n\nPlace the input method plugins implementing the Cim input context API as follows:\n\n    /usr/lib/input.d/im-sample.so\n    /usr/lib/input.d/im-nimf.so\n    /usr/lib/input.d/im-ibus.so\n    /usr/lib/input.d/im-uim.so\n    /usr/lib/input.d/im-fcitx.so\n    /usr/lib/input.d/im-kime.so\n\n* The location of the symbolic link pointing to the plugin\n\nIt is recommended to select input plugins via a symbolic link rather than an environment variable. This is because an environment variable may not be set in some circumstances. Also, the symbolic link approach makes it easy to create configuration tools.\n\n`~/.config/cim.so` is a symbolic link to the input method plugin like ibus, fcitx, nimf, kime, uim.\n\n    ln -sf /usr/lib/input.d/im-sample.so ~/.config/cim.so\n\n* Try it\n\nNow, when an application or GUI toolkit calls the Cim input context API, the input method works through it.\n\nIf you want to change the input method to fcitx, you can simply reset the symbolic link.\n\n    ln -sf /usr/lib/input.d/im-fcitx.so ~/.config/cim.so\n\nIn this way, XIM, GTK-IM, QT-IM, Wayland-IM, etc. can be replaced and integrated. However, there is a problem that input is not possible in Snap or Flatpak. If various applications or GUI toolkits call Cim input context API, the input problem in Snap or Flatpak can be easily solved by accessing `$HOME/.config/cim.so`.\n\n## Integration is practically possible\n\nEven if applications such as Wayland, Snap, Flatpak, or GUI toolkits such as Gtk or Qt do not adopt Cim, input methods can be integrated in practice if various bridges that implement Cim are provided.\n\nYou need to set environment variables to use it this way.\n\n    QT_IM_MODULE=\"cim\"\n    GTK_IM_MODULE=\"cim\"\n    XMODIFIERS=\"@im=cim\"\n\nThe following plugins can call third-party input methods such as nimf, ibus, fcitx, uim, and kime via `~/.config/cim.so`.\n\n    /usr/local/lib/gtk-4.0/4.0.0/immodules/libim-cim-gtk4.so\n    /usr/local/lib/gtk-2.0/2.10.0/immodules/im-cim-gtk2.so\n    /usr/local/lib/gtk-3.0/3.0.0/immodules/im-cim-gtk3.so\n    /usr/local/lib/qt5/plugins/platforminputcontexts/libqt5im-cim.so\n    /usr/local/lib/qt6/plugins/platforminputcontexts/libqt6im-cim.so\n\nSince XIM and Wayland-IM require communication, a daemon(`cimd`) is needed. `cimd` can load `cim-xim.so` and `cim-wayland.so`, and they call the Cim input context API.\n\n    /usr/local/bin/cimd\n    /usr/local/lib/cimd/plugins/cim-xim.so\n    /usr/local/lib/cimd/plugins/cim-wayland.so\n\nActually, this is technically possible.&lt;br /&gt; However, Flatpak and Snap applications can use input methods via `~/.config/cim.so`. If that's not possible, you'll need to contact the Flatpak and Snap developers.\n\n## Benefits to input tool developers\n\nAssuming that the Cim implementation includes the above plugins and daemon, even if the input tool(IME) developer does not implement Gtk-IM, Qt-IM, XIM and Wayland-IM, just implementing Cim input context API will enable typing in Gtk, Qt, X and Wayland applications.\n\n## Contact\n\nEmail:   [hodong@nimfsoft.art](mailto:hodong@nimfsoft.art)  \nWebsite: [https://nimfsoft.art](https://nimfsoft.art)\n\n## License\n\nCopyright (C) 2023 Hodong Kim [hodong@nimfsoft.art](mailto:hodong@nimfsoft.art)\n\nPermission to use, copy, modify, and/or distribute this software for any purpose with or without fee is hereby granted.\n\nTHE SOFTWARE IS PROVIDED \"AS IS\" AND THE AUTHOR DISCLAIMS ALL WARRANTIES WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.\n\n## Download source code\n\n[https://nimfsoft.art/downloads/cim-2023.01.28.tar.gz](https://nimfsoft.art/downloads/cim-2023.01.28.tar.gz)",
        "created_utc": 1674911712,
        "upvote_ratio": 1.0
    },
    {
        "title": "Are there any linux distros that work on a Imac 27' 2020?",
        "author": "wowwoweowoww",
        "url": "https://www.reddit.com/r/linux/comments/10nem5c/are_there_any_linux_distros_that_work_on_a_imac/",
        "text": "[removed]",
        "created_utc": 1674911088,
        "upvote_ratio": 1.0
    },
    {
        "title": "sudo: apt: command not found. Vanilla OS",
        "author": "techlove99",
        "url": "https://www.reddit.com/r/linux/comments/10ncvwk/sudo_apt_command_not_found_vanilla_os/",
        "text": "[removed]",
        "created_utc": 1674904920,
        "upvote_ratio": 1.0
    },
    {
        "title": "please help i start doom 3 from heroic launcher end error",
        "author": "upaceBiker",
        "url": "https://www.reddit.com/r/linux/comments/10ncllv/please_help_i_start_doom_3_from_heroic_launcher/",
        "text": "[removed]",
        "created_utc": 1674903852,
        "upvote_ratio": 1.0
    },
    {
        "title": "Xsane and wifi scanner in other vlan",
        "author": "enialdet",
        "url": "https://www.reddit.com/r/linux/comments/10nbpjc/xsane_and_wifi_scanner_in_other_vlan/",
        "text": "[removed]",
        "created_utc": 1674900446,
        "upvote_ratio": 1.0
    },
    {
        "title": "how to delete linux if its on the same partition as windows",
        "author": "slonCS",
        "url": "https://www.reddit.com/r/linux/comments/10nbd98/how_to_delete_linux_if_its_on_the_same_partition/",
        "text": "",
        "created_utc": 1674899191,
        "upvote_ratio": 1.0
    },
    {
        "title": "This week in KDE: Major bugfixing and screen recording in Spectacle",
        "author": "kyentei",
        "url": "https://pointieststick.com/2023/01/27/this-week-in-kde-major-bugfixing-and-screen-recording-in-spectacle/",
        "text": "",
        "created_utc": 1674898633,
        "upvote_ratio": 1.0
    },
    {
        "title": "Recommended mini PC for daily use?",
        "author": "ajm3232",
        "url": "https://www.reddit.com/r/linux/comments/10na8xf/recommended_mini_pc_for_daily_use/",
        "text": "So I did a little digging into this subject and noticed some of these mini PC manufactures have their own firmware for Windows and most of the questions around this topic are 6+ years old. Some of them saying audio doesn't work via HDMI without a custom Linux kernel (no idea if this is the same case). Was wondering how things are currently in today's landscape?\n\nI've been heavily comparing MINISFORUM and Beelink minis. Current setup is: i7 950, Radeon 550 running Arch Linux w/ i3 DE. Lot of my tasks/job is CPU/RAM intensive while gaming is 3rd/4th on the priority list. Would be nice to have to run Forza 5 or any 2010's game or less with Steam Proton. Only major upgrades I ever do to my PC is memory, but graphics/cpu I rarely ever touch unless it's broken. So mini PC sounds ideal. Plus I have a house with 3 kids under age 5. So would be nice being able to hide the damn thing.",
        "created_utc": 1674894786,
        "upvote_ratio": 1.0
    },
    {
        "title": "Arch linux - Failed to set locale in rofi, help",
        "author": "Efectivament",
        "url": "https://i.redd.it/91ygn5w9urea1.png",
        "text": "",
        "created_utc": 1674888112,
        "upvote_ratio": 1.0
    },
    {
        "title": "Rofi error",
        "author": "Efectivament",
        "url": "https://www.reddit.com/r/linux/comments/10n85bk/rofi_error/",
        "text": "[removed]",
        "created_utc": 1674886997,
        "upvote_ratio": 1.0
    },
    {
        "title": "Linux on iphone",
        "author": "Isuckatminecraftalot",
        "url": "https://www.reddit.com/r/linux/comments/10n71cn/linux_on_iphone/",
        "text": "[removed]",
        "created_utc": 1674883132,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why can't $1,000 ARM ultra books run Linux, even though Linus wants them to? Is it just a kernel thing?",
        "author": "tsunamisweetpotato",
        "url": "https://www.reddit.com/r/linux/comments/10n6npe/why_cant_1000_arm_ultra_books_run_linux_even/",
        "text": "[removed]",
        "created_utc": 1674881950,
        "upvote_ratio": 1.0
    },
    {
        "title": "ext4 drivers for Windows that support casefolding?",
        "author": "sofakng",
        "url": "https://www.reddit.com/r/linux/comments/10n5ymw/ext4_drivers_for_windows_that_support_casefolding/",
        "text": "This question is related both to Linux and Windows so hopefully it's OK to ask here...\n\nDoes anybody know of any ext4 drivers for Windows that also support casefolding?\n\nI'm looking to share an SD card for my Steam Deck between SteamOS (Linux) and Windows but it formats the card ext4 (w/casefolding).\n\n(I think you can reformat it as btrfs but this isn't recommended due to the lack of casefolding)",
        "created_utc": 1674879704,
        "upvote_ratio": 1.0
    },
    {
        "title": "what would be a good OS/kernel to install on a Jide Remix Mini Android PC?",
        "author": "VictorM_6",
        "url": "https://www.reddit.com/r/linux/comments/10n106q/what_would_be_a_good_oskernel_to_install_on_a/",
        "text": "[removed]",
        "created_utc": 1674865683,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can’t get system to boot if I install the proprietary AMD 22.10 drivers (i need it for Blender GPU rendering)",
        "author": "hazefi",
        "url": "/r/Ubuntu/comments/10mzlns/cant_get_system_to_boot_if_i_install_the/",
        "text": "",
        "created_utc": 1674862667,
        "upvote_ratio": 1.0
    },
    {
        "title": "Q4OS - trouble connecting to sites",
        "author": "Rheactron",
        "url": "https://www.reddit.com/r/linux/comments/10mzolc/q4os_trouble_connecting_to_sites/",
        "text": "I just installed Q4OS on Lenovo Thinkcentre M79 SFF. \n\nI chose Trinity desktop.\n\nIt seems to work fine, and looks amazing (I missed Windows XP), but there seems to be some trouble with network connection. \n\nI'm using ethernet connection, and while I can access the internet in general, and install software, I can't access certain sites. I get the error message as if there's no connection. \n\nSites I couldn't access so far: reddit, github (completely, they refuse to open) and VSCode deb package download (specifically that, the site itself works).\n\nGoogle and Wikipedia work, as do all the other sites I tries so far.\n\nI truly have no idea what could be wrong and how to solve the problem.",
        "created_utc": 1674862403,
        "upvote_ratio": 1.0
    },
    {
        "title": "Bash ninjas HATE this new trick",
        "author": "noisesfromdownstairs",
        "url": "https://i.redd.it/sx9rk7w14oea1.gif",
        "text": "",
        "created_utc": 1674860980,
        "upvote_ratio": 1.0
    },
    {
        "title": "I developed a GUI, that automaticly sets your desktop background to live satellite images of the Earth. You can even customize the image composition in a config.yaml file. It´s installable via dpkg or python pip!",
        "author": "WorkingMuscle11",
        "url": "https://github.com/lennart-rth/Live-Earth-Wallpapers",
        "text": "",
        "created_utc": 1674858188,
        "upvote_ratio": 1.0
    },
    {
        "title": "It's there a Linux distribution dedicated to only running a virtual machine desktop ?",
        "author": "transdimensionalmeme",
        "url": "https://www.reddit.com/r/linux/comments/10mvrw1/its_there_a_linux_distribution_dedicated_to_only/",
        "text": "[removed]",
        "created_utc": 1674852875,
        "upvote_ratio": 1.0
    },
    {
        "title": "[F37 Kinoite] I got an update to Mesa and some other platform packages via flatpak and now chromium based applications are broken",
        "author": "Mewi0",
        "url": "https://www.reddit.com/r/linux/comments/10muzum/f37_kinoite_i_got_an_update_to_mesa_and_some/",
        "text": "https://preview.redd.it/b3c5ur849nea1.png?width=1418&amp;format=png&amp;auto=webp&amp;v=enabled&amp;s=0babd2270f3a28363ff74542f82a761e8da80c3d\n\nhttps://i.redd.it/n0vadob39nea1.gif\n\nI already tried booting into my other kinoite images just to be sure and it's still happening. Does the same thing with X11. I tried using `flatpak repair` but that did nothing. Is there a way I can check recent update history for flatpak and what packages were installed and then from there downgrade them until a fix is released? I use this computer for work. I am not sure what exact packages were updated, I know mesa was one of them. Example packeges with issues are Opera, Steam, and Chrome. Packages that do not have issues include Discord, Revolt, and Firefox.  \n\n\n  \nOperating System: Fedora Linux 37\n\nKDE Plasma Version: 5.26.5\n\nKDE Frameworks Version: 5.102.0\n\nQt Version: 5.15.8\n\nKernel Version: 6.1.7-200.fc37.x86\\_64 (64-bit)\n\nGraphics Platform: Wayland\n\nProcessors: 16 × AMD Ryzen 7 3700X 8-Core Processor\n\nMemory: 31.3 GiB of RAM\n\nGraphics Processor: AMD Radeon RX 6800 XT\n\nManufacturer: ASUS",
        "created_utc": 1674850945,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to map the Stadia Controller to SDL2 correctly (this may work for any other controllers you may have trouble with)",
        "author": "jorgesgk",
        "url": "https://www.reddit.com/r/Stadia/comments/10muihx/linux_map_the_bluetooth_stadia_controller_to_sdl2/",
        "text": "",
        "created_utc": 1674849833,
        "upvote_ratio": 1.0
    },
    {
        "title": "Nvidia vGPU software free?",
        "author": "Moonstone459",
        "url": "https://www.reddit.com/r/linux/comments/10mujab/nvidia_vgpu_software_free/",
        "text": "[removed]",
        "created_utc": 1674849829,
        "upvote_ratio": 1.0
    },
    {
        "title": "Chromium Vaapi video decode/encode broken .",
        "author": "SnooJokes925",
        "url": "https://www.reddit.com/r/linux/comments/10mtwn7/chromium_vaapi_video_decodeencode_broken/",
        "text": "[removed]",
        "created_utc": 1674848350,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does linux distro affect the battery?",
        "author": "mart1nski",
        "url": "https://www.reddit.com/r/linux/comments/10msrwm/does_linux_distro_affect_the_battery/",
        "text": "[removed]",
        "created_utc": 1674845773,
        "upvote_ratio": 1.0
    },
    {
        "title": "Linux Terminal Commands - 1 Useful commands for Linux based OS (such as Ubuntu).",
        "author": "NeuronResearcher",
        "url": "https://youtube.com/watch?v=dFzqIzHfF5A&amp;feature=share",
        "text": "",
        "created_utc": 1674843444,
        "upvote_ratio": 1.0
    },
    {
        "title": "Found a new discord",
        "author": "AppointmentOld4191",
        "url": "/r/AzureCertification/comments/10mn538/found_a_new_discord/",
        "text": "",
        "created_utc": 1674842982,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is there a complete and simple example for GTK ListView with ListModel?",
        "author": "DeathToIngsoc",
        "url": "https://www.reddit.com/r/linux/comments/10mo0ii/is_there_a_complete_and_simple_example_for_gtk/",
        "text": "Obviously I'm completely lost and been ending up in the same documentations (where I expect to find what I need) back and forth and still have no idea how am I going to initialize the model with simple data to be viewed in ListView?\n\nI'm using Gtkmm and I know TreeView is being deprecated now so it should save me some time learning and sticking to ListView and ColumnView instead.\n\nCan anyone help?",
        "created_utc": 1674834380,
        "upvote_ratio": 1.0
    },
    {
        "title": "RGB Keyboard - ROG Flow Z13",
        "author": "abstracted_2",
        "url": "https://www.reddit.com/r/linux/comments/10mn6yi/rgb_keyboard_rog_flow_z13/",
        "text": "[removed]",
        "created_utc": 1674832359,
        "upvote_ratio": 1.0
    },
    {
        "title": "OldTechBloke retires his Youtube-channel due to terminal lung cancer",
        "author": "Lord_Schnitzel",
        "url": "https://www.reddit.com/r/linux/comments/10mmzkh/oldtechbloke_retires_his_youtubechannel_due_to/",
        "text": "[removed]",
        "created_utc": 1674831849,
        "upvote_ratio": 1.0
    },
    {
        "title": "Uefi when starts ubuntu",
        "author": "Kannashit",
        "url": "https://www.reddit.com/r/linux/comments/10mmpu3/uefi_when_starts_ubuntu/",
        "text": "Then, me, in the grub customizer just switch the first postion of inicialization to uefi bios (i probably was out of mind) now, when i start ubuntu the pc just turn into bios. I alredy try to reinstall linux but the problem persists",
        "created_utc": 1674831175,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to use gcc and make in QEMU?",
        "author": "damn_hymn",
        "url": "https://www.reddit.com/r/linux/comments/10mmkc2/how_to_use_gcc_and_make_in_qemu/",
        "text": "[removed]",
        "created_utc": 1674830777,
        "upvote_ratio": 1.0
    },
    {
        "title": "Linux Developers Evaluating New \"DOITM\" Security Mitigation For Latest Intel CPUs",
        "author": "twlja",
        "url": "https://www.phoronix.com/review/intel-doitm-linux",
        "text": "",
        "created_utc": 1674826810,
        "upvote_ratio": 1.0
    },
    {
        "title": "So I found this big ass dinossaur",
        "author": "AndreyRibeiro",
        "url": "https://i.redd.it/b1bi8xagmmea1.jpg",
        "text": "[removed]",
        "created_utc": 1674824947,
        "upvote_ratio": 1.0
    },
    {
        "title": "Could not get permission to save user (name)",
        "author": "Vromies",
        "url": "https://www.reddit.com/r/linux/comments/10mjebj/could_not_get_permission_to_save_user_name/",
        "text": "[removed]",
        "created_utc": 1674821735,
        "upvote_ratio": 1.0
    },
    {
        "title": "U-boot now supports booting Linux from an HTTP server",
        "author": "unixbhaskar",
        "url": "https://www.cnx-software.com/2023/01/25/u-boot-now-supports-booting-linux-from-an-http-server/",
        "text": "",
        "created_utc": 1674821409,
        "upvote_ratio": 1.0
    },
    {
        "title": "This caterpillar looks like it has tiny penguins on its back.",
        "author": "Remnie",
        "url": "https://i.redd.it/hepf3dxjckea1.jpg",
        "text": "",
        "created_utc": 1674818327,
        "upvote_ratio": 1.0
    },
    {
        "title": "SWAP Memory in Linux (Tech Tutorial Friday)",
        "author": "bogdantudorache",
        "url": "https://medium.com/@tudorache.a.bogdan/swap-memory-in-linux-bf300e9fa77a",
        "text": "",
        "created_utc": 1674817516,
        "upvote_ratio": 1.0
    },
    {
        "title": "learning about linux i found out that a lot of it can be summarized by this sentence.",
        "author": "buitenbeentje97",
        "url": "https://www.reddit.com/r/linux/comments/10mhj9z/learning_about_linux_i_found_out_that_a_lot_of_it/",
        "text": "[removed]",
        "created_utc": 1674814633,
        "upvote_ratio": 1.0
    },
    {
        "title": "Milestone Completed: Firefox now has JavaScript JIT acceleration for RISC-V (RV64GC). Patch upstreamed.",
        "author": "nextbern",
        "url": "https://lists.riscv.org/g/apps-tools-software/message/284",
        "text": "",
        "created_utc": 1674812873,
        "upvote_ratio": 1.0
    },
    {
        "title": "Error while dual booting Ubuntu. This error shows after selecting \"Try or Install Ubuntu\"",
        "author": "Best_Bath6235",
        "url": "https://i.redd.it/q24c000ellea1.jpg",
        "text": "",
        "created_utc": 1674812485,
        "upvote_ratio": 1.0
    },
    {
        "title": "Anybody here dual booted HP Omen 15 laptop ?",
        "author": "Best_Bath6235",
        "url": "https://www.reddit.com/r/linux/comments/10mghji/anybody_here_dual_booted_hp_omen_15_laptop/",
        "text": "[removed]",
        "created_utc": 1674810178,
        "upvote_ratio": 1.0
    },
    {
        "title": "Rant: Matrix name makes it undiscoverable",
        "author": "ifeeltiredboss",
        "url": "/r/matrixdotorg/comments/10m94en/rant_matrix_name_makes_it_undiscoverable/",
        "text": "",
        "created_utc": 1674784905,
        "upvote_ratio": 1.0
    },
    {
        "title": "Live Distro for File Recovery",
        "author": "Caeso_Lucilius",
        "url": "https://www.reddit.com/r/linux/comments/10m8zb8/live_distro_for_file_recovery/",
        "text": "I'm in a spot of trouble. My Windows laptop won't boot into Windows for me, and I have some files on there I really need. Luckily, I have my Linux laptop here, too, and two USB sticks.\n\nMy plan is to make a live USB system, then use it and the other USB to get the files I need from my hard drive. What distro would best accomplish this?\n\nMany thanks for your advice.",
        "created_utc": 1674784397,
        "upvote_ratio": 1.0
    },
    {
        "title": "Any linux distros that work on a imac 2020 5k 27'?",
        "author": "wowwoweowoww",
        "url": "https://www.reddit.com/r/linux/comments/10m7t84/any_linux_distros_that_work_on_a_imac_2020_5k_27/",
        "text": "[removed]",
        "created_utc": 1674780959,
        "upvote_ratio": 1.0
    },
    {
        "title": "blendOS, a seamless blend of all Linux distributions.",
        "author": "ExaHamza",
        "url": "https://www.reddit.com/r/linux/comments/10m788g/blendos_a_seamless_blend_of_all_linux/",
        "text": "[removed]",
        "created_utc": 1674779280,
        "upvote_ratio": 1.0
    },
    {
        "title": "OTB (OldTechBloke) retires his channel due to health issues",
        "author": "Electrical_Mango_489",
        "url": "https://www.youtube.com/post/Ugkxs2epNJ54eS92V-5-LaqGd6kqRR0Oh2yL",
        "text": "",
        "created_utc": 1674779206,
        "upvote_ratio": 1.0
    },
    {
        "title": "Best Notepad++ Alternatives for Linux",
        "author": "zeranexos",
        "url": "https://androidfoss.com/notepad-alternatives-for-linux/",
        "text": "[removed]",
        "created_utc": 1674772706,
        "upvote_ratio": 1.0
    },
    {
        "title": "Vulnerability in sudo (patch available)",
        "author": "Odd-Feed-9797",
        "url": "https://www.reddit.com/r/linux/comments/10m4fl9/vulnerability_in_sudo_patch_available/",
        "text": "[removed]",
        "created_utc": 1674771895,
        "upvote_ratio": 1.0
    },
    {
        "title": "I'm new to Linux, someone explain this to me",
        "author": "Olivia-Evelyn",
        "url": "https://i.redd.it/l6ckbi0vlgea1.png",
        "text": "",
        "created_utc": 1674770674,
        "upvote_ratio": 1.0
    },
    {
        "title": "Searching and watching youtube (with thumbnails) entirely within a terminal (using sixel)",
        "author": "username2022oldnew",
        "url": "https://v.redd.it/pqmf7pksggea1",
        "text": "",
        "created_utc": 1674768445,
        "upvote_ratio": 1.0
    },
    {
        "title": "Searching and watching youtube entirely within a terminal (using sixel)",
        "author": "username2022oldnew",
        "url": "https://v.redd.it/qn72wsuregea1",
        "text": "",
        "created_utc": 1674768071,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why Linux for normal people",
        "author": "Jumboo-jett",
        "url": "https://www.reddit.com/r/linux/comments/10m2v0p/why_linux_for_normal_people/",
        "text": "[removed]",
        "created_utc": 1674768039,
        "upvote_ratio": 1.0
    },
    {
        "title": "Guide: Alpha test HDR on Linux!",
        "author": "P65B40",
        "url": "/r/linux_gaming/comments/10m2gyx/guide_alpha_test_hdr_on_linux/",
        "text": "",
        "created_utc": 1674767474,
        "upvote_ratio": 1.0
    }
]