[
    {
        "title": "Will Where the Crawdads Sing eventually be considered a classic/required reading?",
        "author": "tax-evader159",
        "url": "https://www.reddit.com/r/literature/comments/10t4kz2/will_where_the_crawdads_sing_eventually_be/",
        "text": "I’ve been tempted to read *Where the Crawdads Sing* because it’s exciting to see a recently published book generate so much buzz in the literary community. When I was in school *Kit Runner* was the latest contemporary classic; for my teacher, it was *The Poisonwood Bible*. \n\nI’ve been seeing a lot of bad reviews on r/books, but I think I’m going to read it anyway just to keep up with the latest literary trends. \n\nDo you think *Where the Crawdads Sing* is considered a classic? Do you think it will eventually be considered a classic or become a required read in the future for students?",
        "created_utc": 1675483727,
        "upvote_ratio": 1.0
    },
    {
        "title": "The only mysterious death in One Hundred Years of Solitude may be explained by another novel written by García Márquez",
        "author": "NASAEarthrise",
        "url": "https://www.reddit.com/r/literature/comments/10t2785/the_only_mysterious_death_in_one_hundred_years_of/",
        "text": "Let's talk about \"the only mystery that was never cleared up in Macondo\"--as the narrator says in One Hundred Years of Solitude--the death of José Arcadio. \n\nMany readers and researchers have been speculating about the symbolic meaning of José Arcadio's mysterious death, assuming that Rebeca, his wife, was the killer. However, recently, I found some interesting theories on Zhihu (the \"Chinese Quora\") that cast light on a possible Easter Egg hidden by García Márquez himself.\n\nThe central claim of this theory suggests that José Arcadio was killed by some supernatural force (most likely a lightning bolt) for the following reasons:\n\n1. There was a storm that night.\n2. There is no wound on his corpse, and no weapon is ever found.\n3. His ears were bleeding. The body has smelled like burned gunpowder for a very long time. A corpse that is struck by a lightning bolt has a similar smell and oftentimes is accompanied by a bleeding ear.\n4. **\\[Easter Egg Moment\\]** In another short story called *Tuesday Siesta,* written by García Márquez in 1962, 5 years before *One Hundred Years of Solitude* was published, there is a character named Rebeca. She is almost certainly the exact same Rebeca in One Hundred Years of Solitude because both Rebeca were widows, owned a revolver during Colonel Aureliano Buendia's time (another main character of *One Hundred Years of Solitude*), and killed a thief. However, there is one detail mentioned in *Tuesday Siesta* but was never mentioned in *One Hundred Years of Solitude:* ***\"*****It was the first time in her life that \\[Rebeca\\] had fired a gun.\"** If this is true, then this means that some supernatural forces must have killed José Arcadio.  \n\nHere are excerpts from *Tuesday Siesta* and *One Hundred Years of Solitude,* which shows the mysterious connection between the two novels:\n\n***Tuesday Siesta:*** \n\n&gt;Rebecca, a lonely widow who lived in a house full of odds and ends, heard above the sound of the drizzling rain someone trying to force the front door from outside. She got up, rummaged around in her closet for an ancient revolver that no one had fired since the days of Colonel Aureliano Buendia, and went into the living room without turning on the lights. Orienting herself not so much by the noise at the lock as by a terror developed in her by twenty eight years of loneliness, she fixed in her imagination not only the spot where the door was but also the exact height of the lock. She clutched the weapon with both hands, closed her eyes, and squeezed the trigger. It was the first time in her life that she had fired a gun.\n\n***One Hundred Years of Solitude:***\n\n&gt;As soon as they took the body out, Rebeca closed the doors of her house and buried herself alive, covered with a thick crust of disdain that no earthly temptation was ever able to break. She went out into the street on one occasion, when she was very old, with shoes the color of old silver and a hat made of tiny flowers, during the time that the Wandering Jew passed through town and brought on a heat wave that was so intense that birds broke through window screens to come to die in the bedrooms. The last time anyone saw her alive was when with one shot she killed a thief who was trying to force the door of her house. Except for Argénida, her servant and confidante, no one ever had any more contact with her after that. At one time it was discovered that she was writing letters to the Bishop, whom she claimed as a first cousin, but it was never said whether she received any reply. The town forgot about her.\n\nI believe there is more to uncover regarding José Arcadio's death and the connections amongst García Márquez's novels, but this is the most interesting theory I have ever seen. \n\nRead more:\n\n[Tuesday Siesta (English)](https://articulosparapensar.files.wordpress.com/2014/04/g-garcia-marquez-tuesday-siesta.pdf) \n\n[Zhihu Post #1(Mandarin)](https://www.zhihu.com/question/33839619/answer/268786634)\n\n[Zhihu Post #2(Mandarin)](https://www.zhihu.com/question/36291500/answer/97461165)",
        "created_utc": 1675476445,
        "upvote_ratio": 1.0
    },
    {
        "title": "Where do you read your books?",
        "author": "AppropriateBag8330",
        "url": "https://www.reddit.com/r/literature/comments/10szl8r/where_do_you_read_your_books/",
        "text": "Hello there. \nWhat is the best app for reading e-books? My priorities in looking for a e-book app are the following:\n\n1. A big library\n2. Wide variery of languages\n3. No subscription payment, but payment for each individual book.\n\nThanks!",
        "created_utc": 1675469066,
        "upvote_ratio": 1.0
    },
    {
        "title": "Are literary reviews calling some books problematic for fun?",
        "author": "Hulltowncouncil",
        "url": "https://www.reddit.com/r/literature/comments/10syg37/are_literary_reviews_calling_some_books/",
        "text": "[removed]",
        "created_utc": 1675466078,
        "upvote_ratio": 1.0
    },
    {
        "title": "Lustful literature 🥵📚 💦 on Twitter",
        "author": "Fantastic_Painting_1",
        "url": "https://twitter.com/lustful_pages/status/1620979597918769153?s=46&amp;t=1KB7I3Wtz8O9cNomnU_ozw",
        "text": "",
        "created_utc": 1675448294,
        "upvote_ratio": 1.0
    },
    {
        "title": "Looking for one book.",
        "author": "Super_Wedding_9909",
        "url": "https://www.reddit.com/r/literature/comments/10spn45/looking_for_one_book/",
        "text": "[removed]",
        "created_utc": 1675444570,
        "upvote_ratio": 1.0
    },
    {
        "title": "Mark Twain - Indications of Tom Sawyer’s Suspect Character",
        "author": "grashupfer",
        "url": "https://www.reddit.com/r/literature/comments/10so1ng/mark_twain_indications_of_tom_sawyers_suspect/",
        "text": "Mark Twain gives hints of Tom Sawyer’s suspect character. They can be read comically at first glance, but this will come around again in a sad way in Adventures of Huckleberry Finn.\n\n 1. He was not the Model Boy of the village. He knew the model boy very well though—and loathed him.\n\n- Page 5\n\n 2. Tom is inspired to trick Ben Rogers into painting the fence for him. He calls Ben “Big Missouri” in the passage below, because Ben had come walking along whooping like a steamboat.\n\n Tom gave up the brush with reluctance in his face but alacrity in his heart. And while the late steamer “Big Missouri” worked and sweated in the sun, the retired artist sat on a barrel in the shade close by, dangled his legs, munched his apple, and planned the slaughter of more innocents.\n\n- Page 15\n\n 3. Tom feeds to the cat, Pete, the painkiller he doesn’t want to take himself.\n\n 4. Tom watches Aunt Polly’s despair and grief when he sneaks in and observes the goings-on in the house while he is missing and fear drowned. It thrills his own high opinion of himself,  (…the theatrical gorgeousness of the thing appealed strongly to his nature, too…Page 113) and he holds himself back from revealing he’s alive. He later lies about the night and embarrasses Aunt Polly. “You never think of anything but your own selfishness.”\n\n 5. He did not care to have Huck’s company in public places.\n\n- Page 189\n\nThe last is a little bit heart-breaking.",
        "created_utc": 1675440663,
        "upvote_ratio": 1.0
    },
    {
        "title": "First Gentleman by Rich Tilley",
        "author": "Zestyclose_Taste6186",
        "url": "https://www.reddit.com/r/literature/comments/10snh6t/first_gentleman_by_rich_tilley/",
        "text": "[removed]",
        "created_utc": 1675439296,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why is Giovanni's Room by James Baldwin titled Giovanni's Room?",
        "author": "ceremonialsx",
        "url": "https://www.reddit.com/r/literature/comments/10snc26/why_is_giovannis_room_by_james_baldwin_titled/",
        "text": "[removed]",
        "created_utc": 1675438929,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can someone please explain these lines by Alexander Pope",
        "author": "Odd-Courage-6486",
        "url": "https://www.reddit.com/r/literature/comments/10sm022/can_someone_please_explain_these_lines_by/",
        "text": "“Honour and shame from no condition rise,\nAct your part well,there all the honour lies”",
        "created_utc": 1675435501,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can someone please explain the meaning of these lines by Alexander Pope",
        "author": "Odd-Courage-6486",
        "url": "https://www.reddit.com/r/literature/comments/10slxp9/can_someone_please_explain_the_meaning_of_these/",
        "text": "“Honour and shame from no condition rise\nAct your part well, there all the honour lies”\n\nEnglish isn’t my first language also I need to explain these lines in a essay that I’m writing,would help a lot if you guys could elaborate it :)",
        "created_utc": 1675435322,
        "upvote_ratio": 1.0
    },
    {
        "title": "In of Mice and Men, what does George mean by \"Black queen on a red king\"?",
        "author": "the_watchkeeper",
        "url": "https://www.reddit.com/r/literature/comments/10slmgd/in_of_mice_and_men_what_does_george_mean_by_black/",
        "text": "\nCANDY: Well I think Curly's married himself a tart.\n\nGEORGE: He ain't the first. Black Queen on a red king. Yes, sir... There's plenty done that! \n\n\nWhat does he mean and where does this phrase come from? Thanks!",
        "created_utc": 1675434487,
        "upvote_ratio": 1.0
    },
    {
        "title": "Books about the distorted figure of children",
        "author": "biruva",
        "url": "https://www.reddit.com/r/literature/comments/10sj391/books_about_the_distorted_figure_of_children/",
        "text": "[removed]",
        "created_utc": 1675427086,
        "upvote_ratio": 1.0
    },
    {
        "title": "Quoting Book",
        "author": "Mustafa_1326",
        "url": "https://www.reddit.com/r/literature/comments/10shtdq/quoting_book/",
        "text": "[removed]",
        "created_utc": 1675422596,
        "upvote_ratio": 1.0
    },
    {
        "title": "The First Reviews of Finnegans Wake",
        "author": "BenFilippo",
        "url": "http://peterchrisp.blogspot.com/2022/05/the-first-reviews-of-finnegans-wake.html",
        "text": "",
        "created_utc": 1675415845,
        "upvote_ratio": 1.0
    },
    {
        "title": "The legend of sleepy hollow",
        "author": "Cheeseburgerpringles",
        "url": "https://www.reddit.com/r/literature/comments/10sebf9/the_legend_of_sleepy_hollow/",
        "text": "[removed]",
        "created_utc": 1675409229,
        "upvote_ratio": 1.0
    },
    {
        "title": "Modern Classics",
        "author": "Sgt_PurpleVietnam_69",
        "url": "https://www.reddit.com/r/literature/comments/10se0tj/modern_classics/",
        "text": "[removed]",
        "created_utc": 1675408184,
        "upvote_ratio": 1.0
    },
    {
        "title": "How Do You Take Your Notes?",
        "author": "PhantomOfInferno",
        "url": "https://www.reddit.com/r/literature/comments/10se0n5/how_do_you_take_your_notes/",
        "text": "I've been getting back into reading after a long break from my childhood voraciousness for books and have been struggling with how to take notes on books. Personally I landed on marking up books with small notes and brackets on what sections I found important or impactful and then reviewing the chapter when I was finished and typing those markups into a(n) OneNote page.\nI'm fascinated by the non-fiction philosophy books I read (and the absolutely amazing Atomic Habits I'm currently reading), but I unfortunately have an astoundingly bad memory. So while I love these books I struggle with a fear and reality of forgetting what I got out of books and try to take notes to alleviate that fear and hopefully have something to turn back to. I'm curious how other people take notes because I'm reluctant to mark up certain books if for no other reason than I feel like I'll somehow disfigure it.\n\nTL;DR: How do you take notes on books? Marking them up a certain way? Sticky Notes? Electronic Notes? A notebook? A personal Twitter (or Mastadon) you exclusively post your unexplained unapologetic unedited page by page thoughts? I would like to know... and maybe copy.\nThanks",
        "created_utc": 1675408168,
        "upvote_ratio": 1.0
    },
    {
        "title": "George Macdonald's Lilith",
        "author": "No_Discipline4854",
        "url": "https://www.reddit.com/r/literature/comments/10s7les/george_macdonalds_lilith/",
        "text": "[removed]",
        "created_utc": 1675388703,
        "upvote_ratio": 1.0
    },
    {
        "title": "Just finished The Brothers Karamazov, what now?",
        "author": "WinProfessional5603",
        "url": "https://www.reddit.com/r/literature/comments/10s5q13/just_finished_the_brothers_karamazov_what_now/",
        "text": "[removed]",
        "created_utc": 1675383690,
        "upvote_ratio": 1.0
    },
    {
        "title": "Anyone else a huge fan of Joan Didion’s 'The Year of Magical Thinking' and 'Blue Nights'? They were written in this apartment that's now up for sale.",
        "author": "NewsYouCanShmooze",
        "url": "https://news.artnet.com/art-world/joan-didion-home-for-sale-2250358",
        "text": "",
        "created_utc": 1675383323,
        "upvote_ratio": 1.0
    },
    {
        "title": "James Joyce reads \"Anna Livia Plurabelle\" from Finnegan's Wake (1929) : Free Download, Borrow, and Streaming : Internet Archive",
        "author": "LetternetPress",
        "url": "https://www.reddit.com/r/literature/comments/10s18sk/james_joyce_reads_anna_livia_plurabelle_from/",
        "text": "[removed]",
        "created_utc": 1675372840,
        "upvote_ratio": 1.0
    },
    {
        "title": "“100 Years of the Best American Short Stories” part 19 “A Conventional Wisdom”",
        "author": "No-Yesterday7111",
        "url": "https://www.reddit.com/r/literature/comments/10rzrvu/100_years_of_the_best_american_short_stories_part/",
        "text": "Stanley Elkin’s “A Conventional Wisdom” (1978) is a journey through heaven and hell. Not since the first story in the series (Edna Ferber’s “The Gay Old Dog”) have I relied so heavily on Google to define unknown words. My vocabulary for terms dealing with death has broadened significantly from this reading. \n\nThe story follows Ellerby, a man who owns a liquor store that is robbed twice. The clerks are killed or maimed during the robberies, and Ellerby decides to support their families, which irritates his petulant wife. \n\nHe closes the store and reopens in a more affluent area. Things are going so well that he feels he can close on Sundays - but, unfortunately, he is robbed again. This time, it is Ellerby who is killed. \n\nAfter a brief sojourn to heaven (it’s everything you’ve ever heard, literally), he is damned to hell. Elkin’s descriptions of hell are imaginative and horrid; there are no euphemisms in this piece. What there is is a lot of rape, which will be important later. \n\nEllerby wanders around hell for more than 60 years until he runs into one of the men who robbed him. His attempt to escape socializing with this man leads him to “play dead” and when he is found out (by molestation, naturally), he decides to do something he hasn’t done yet: he prays to God. Surprisingly, God answers. Ellerby’s request is simple: an explanation to his damnation. He followed the commandments, he took care of his employees families, he was faithful to his wife even though she was abhorrent, he wasn’t there when God made the rules. \n\nGod’s answer is that Ellerby’s store had been open on the Sabbath and he took His name in vain once. Struck by the hilarity of the pettiness of God, Ellerby accepts the explanation, accepts his place in hell, and plots to become very close to the robber, so close in fact, that he would get to be the assailant in the next rape. This story was a very funny and very brutal takedown of the concepts of heaven, hell, judgment, damnation and salvation. \n\nQuotable: “‘Go to Hell’ Saint Peter said beatifically”.",
        "created_utc": 1675369312,
        "upvote_ratio": 1.0
    },
    {
        "title": "Foe by Iain Reid interpretation SPOILERS",
        "author": "DirectionBasic3386",
        "url": "https://www.reddit.com/r/literature/comments/10ry8i1/foe_by_iain_reid_interpretation_spoilers/",
        "text": "I’ve read a lot of interpretations, and there is one that I just do not think is correct and I haven’t seen it countered yet. People seem to think that they are living in a simulation on the farm, and that the beetles represent “bugs” in the system. I don’t think that’s accurate. I think Hen goes to leave for the permanent installation herself at the end of the book, and Terrence was busy making a replica of her while waiting for the real Junior to return bc she told him that’s what she wanted. I think the rhinoceros beetles are symbolic of the battle for Hen’s affection as the Junior replica sees it (between himself and Terrance). These beetles are known to wait in mating spaces, and then the males fight each other off to breed with the females. Hen’s name is Hen because Terrence and junior are two roosters in the henhouse.\n\nI haven’t seen anyone else mention this, so I wanted to throw my two cents in.",
        "created_utc": 1675365641,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is the meaning of the quote: 'A novel is like a mirror walking down a road'?",
        "author": "Proof-Town-7996",
        "url": "https://www.reddit.com/r/literature/comments/10rt071/what_is_the_meaning_of_the_quote_a_novel_is_like/",
        "text": "[removed]",
        "created_utc": 1675352984,
        "upvote_ratio": 1.0
    },
    {
        "title": "Thoughts about literature podcasts?",
        "author": "djhatrang",
        "url": "https://www.reddit.com/r/literature/comments/10rs2yq/thoughts_about_literature_podcasts/",
        "text": "In 2021 I did a literature podcast that I so much enjoyed but did very badly in terms of audience. One reason was that I did not do marketing in a correct platform (Facebook rather than Twitter and Reddit), but could it be that people just don’t like Lit podcasts in general? \n\nFor context my podcast format was two hosts chose a poem &amp; a prose excerpt from a given topic and discussed openly &amp; organically.",
        "created_utc": 1675350668,
        "upvote_ratio": 1.0
    },
    {
        "title": "Wallpapers and Romantic Poetry",
        "author": "girvinem1975",
        "url": "https://www.reddit.com/r/literature/comments/10rrw6p/wallpapers_and_romantic_poetry/",
        "text": "[removed]",
        "created_utc": 1675350188,
        "upvote_ratio": 1.0
    },
    {
        "title": "Overly long sentences and their literary interest",
        "author": "Notamugokai",
        "url": "https://www.reddit.com/r/literature/comments/10rp16y/overly_long_sentences_and_their_literary_interest/",
        "text": "I'm fine with some long sentences such as Proust's, they flow smoothly and they are enjoyable. Even more than enjoyable, mesmerizing!\n\nBut I'm struggling with some others – from acknowledged writers. At first, I thought that I was not smart enough, not comfortable enough with English, not this and that. But now I wonder if the writer hasn't just made some over-bloated sentences not 'organically' but by forcing into a perfectly fine sentence some phrases, details, miscellaneous junk, etc, just because they can. These sentences are incomprehensible monsters that loose the reader.\n\nI'll give you two examples from *Under the Volcano* by Malcom Lowry, which is known to have a slow start, but these are really stalling me. (you can skip those examples, see my questions after) I provide no context but there's not much context to start with; most of the content is still subtext that refer to something the reader has to infer on the way, which doesn't help here.\n\n&gt;  Yet he was right, he told himself, as reaching the top he paused for breath, right, after the Consul had been ‘discovered' (though meantime the grotesquely pathetic situation had developed where there was not, on probably the first occasion when one had been so urgently needed, a British Consul in Quauhnahuac to appeal to), right in insisting Hugh should waive all conventional scruples and take every advantage of the curious reluctance of the 'police' to hold him – their anxiety, it all but appeared, to be rid of him just when it seemed highly logical they should detain him as a witness, at least in one aspect of what now at a distance one could almost refer to as the ‘case’ – and at the earliest possible moment join that ship providentially awaiting him at Vera Cruz.\n\nAnd two pages later:\n\n&gt; His passion for Yvonne (whether or not she'd ever been much good as an actress was beside the point, he'd told her the truth when he said she would have been more than good in any film he made) had brought back to his heart, in a way he could not have explained, the first time that alone, walking over the meadows from Saint Près, the sleepy French village of backwaters and locks and grey disused watermills where he was lodging, he had seen, rising slowly and wonderfully and with boundless beauty above the stubble fields blowing with wildflowers, slowly rising into the sunlight, as centuries before the pilgrims straying over those same fields had watched them rise, the twin spires of Chartres Cathedral.\n\nMy questions:\n\n1. **How do you feel with this kind of prose?**\\\n  I know that people are comfortable with streams of thoughts à la Virginia Woolf (I can't read *Mrs Dalloway*, I tried). Similarly, maybe you are fine with those sentences while I'm not and that's okay.\n\n2. **Do they have some literary interest?**\\\n  Sorry for this author, but not anybody is Proust. His novel has ranked 11 in the 100 best English-language novels of the 20th century list by the Modern Library, but still... Isn't that just over-bloated sentences for the sake of it? At most it could set the mood and show how intricate are the thoughts of the character, but... well, the price to pay for that is huge (loosing the reader, make the reader re-read ten times and analyse to understand the sentence, if they can!) This breaks the flow. How shall I take those?\n\n3. **Is there some 'academic knowledge' that addresses this topic?**\\\n  Like when we say someone has done an 'info dump' description, or an 'as-you-know-Bob' dialogue line, etc. Something to name those forcibly stretched out sentences versus the ones that 'works well'. And some thoughts about authors who do this with great art, and those known to do it despite falling in the other category. Or maybe there's a legitimate case for doing it, like when characters have a mundane dialogue, something usually seen as amateur writing, that shows they are avoiding a topic, with very subtle clues easily overlooked. In the examples I quoted I don't think we're in that case.\n\nThanks for your insights!",
        "created_utc": 1675342058,
        "upvote_ratio": 1.0
    },
    {
        "title": "Need help with graphic novels based on Iranian Revolution",
        "author": "Historical-Ad-802",
        "url": "https://www.reddit.com/r/literature/comments/10rm2ki/need_help_with_graphic_novels_based_on_iranian/",
        "text": "[removed]",
        "created_utc": 1675331143,
        "upvote_ratio": 1.0
    },
    {
        "title": "Juliet Mitchell: Fratriarchy and Sisterhood. Shakespeare and Psychoanalysis",
        "author": "Maxwellsdemon17",
        "url": "http://ici.berlin/events/juliet-mitchell/",
        "text": "",
        "created_utc": 1675330474,
        "upvote_ratio": 1.0
    },
    {
        "title": "The Man Without Qualities -- Robert Musil",
        "author": "bud_101",
        "url": "https://www.reddit.com/r/literature/comments/10rixok/the_man_without_qualities_robert_musil/",
        "text": "[removed]",
        "created_utc": 1675319207,
        "upvote_ratio": 1.0
    },
    {
        "title": "Would a 15 year old be able to comprehend “The Brothers Karamazov” ?",
        "author": "Significant-Top2807",
        "url": "https://www.reddit.com/r/literature/comments/10rgx5m/would_a_15_year_old_be_able_to_comprehend_the/",
        "text": "[removed]",
        "created_utc": 1675312804,
        "upvote_ratio": 1.0
    },
    {
        "title": "Reconceptualizing Censorship, or, Censorship in a Capitalist Egocracy",
        "author": "LetternetPress",
        "url": "https://www.reddit.com/r/literature/comments/10rgfvd/reconceptualizing_censorship_or_censorship_in_a/",
        "text": "[removed]",
        "created_utc": 1675311412,
        "upvote_ratio": 1.0
    },
    {
        "title": "Analyze any bit of Finnegans wake",
        "author": "johnnyandthemoondog",
        "url": "https://www.reddit.com/r/literature/comments/10rffw8/analyze_any_bit_of_finnegans_wake/",
        "text": "[removed]",
        "created_utc": 1675308557,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why Do Some Consider Blood Meridian to Be the Great American Novel?",
        "author": "georgex7",
        "url": "https://www.reddit.com/r/literature/comments/10rejxe/why_do_some_consider_blood_meridian_to_be_the/",
        "text": "I’m currently reading BM, and I am blown away by McCarthy’s writing style and descriptions. He has a singular voice and has invented a new way to write books, from his formatting to his prose. \n\nThat said, this book in terms of plot, character development, language, and cultural impact seems so far from other GAN candidates (Moby Dick, Gatsby, etc) that I’m amazed many critics consider it a viable option. \n\nCan someone help me understand their point of view? What am I missing?",
        "created_utc": 1675306104,
        "upvote_ratio": 1.0
    },
    {
        "title": "Want to know how much people make at onlyfans? Join our team.",
        "author": "No-Literature-8033",
        "url": "/r/onlyfansgloss/comments/10r0xvu/want_to_know_how_much_people_make_at_onlyfans/",
        "text": "",
        "created_utc": 1675302755,
        "upvote_ratio": 1.0
    },
    {
        "title": "Average onlyfans income 3 000 - 20 000$ from the models working with us!",
        "author": "No-Literature-8033",
        "url": "/r/onlyfansgalaxy/comments/10r0xdu/average_onlyfans_income_3_000_20_000_from_the/",
        "text": "",
        "created_utc": 1675302628,
        "upvote_ratio": 1.0
    },
    {
        "title": "How much can you make on onlyfans? The highest earnings in our team!",
        "author": "No-Literature-8033",
        "url": "/r/planetonlyfans/comments/10r0x7w/how_much_can_you_make_on_onlyfans_the_highest/",
        "text": "",
        "created_utc": 1675302580,
        "upvote_ratio": 1.0
    },
    {
        "title": "Only fans top earners - Join our team!",
        "author": "No-Literature-8033",
        "url": "/r/FanslyUniverse/comments/10r0x2o/only_fans_top_earners_join_our_team/",
        "text": "",
        "created_utc": 1675302543,
        "upvote_ratio": 1.0
    },
    {
        "title": "Onlyfans top earners - start earning with us!",
        "author": "No-Literature-8033",
        "url": "/r/onlyfansmodelsdotcam/comments/10r0wxf/onlyfans_top_earners_start_earning_with_us/",
        "text": "",
        "created_utc": 1675302495,
        "upvote_ratio": 1.0
    },
    {
        "title": "Love for literature combined with love for music. I made a playlist with rock and pop songs inspired by literature and writing books. Authors include George Orwell, Shakespeare, Stephen King, Emily Brontë, Edgar Allan Poe, Tolstoi, Homerus, William Golding and many more.",
        "author": "99songsabout",
        "url": "https://open.spotify.com/playlist/76kbehrNkrwWjIK5XeiVIb?si=tuVHuve-TMK4mWfYO0xjQw",
        "text": "",
        "created_utc": 1675290982,
        "upvote_ratio": 1.0
    },
    {
        "title": "Finished Orwell’s “1984”, finally!",
        "author": "penguin-47284",
        "url": "https://www.reddit.com/r/literature/comments/10r7may/finished_orwells_1984_finally/",
        "text": "there isn’t really much I can say about “1984” that hasn’t already been said, but if you haven’t read it, you definitely should. It’s something that I can’t really deem as an enjoyable experience, but an important one because of how relevant it still reads — sure to send chills down ya, but in a less typical thriller or dystopian type of way and more of how grounded it feels in today’s world. It’s an excellent commentary of corruption, power and human vulnerability outside of the obvious political ones, and that multi-faceted presentation makes it worth a read on its own. Otherwise, Orwell has a great way with words that no doubt is one of the reasons it continues to stand as a literary classic. \nPS: if you have read “1984” and want more, I’d read the screenplay (or watch the play if you have a chance) “Network” by Paddy Chayefsky. They both carry similar messages, the latter being much more technology heavy but definitely worth a watch as well.",
        "created_utc": 1675288904,
        "upvote_ratio": 0.99
    },
    {
        "title": "Understanding reader perceptions: Kushiel's Dart and the grooming of children in fantasy",
        "author": "Notamugokai",
        "url": "https://www.reddit.com/r/literature/comments/10r4fky/understanding_reader_perceptions_kushiels_dart/",
        "text": "Some readers, now parents, revisit *Kushiel's Dart* and realize how uncomfortable they are with the \"grooming\" system in place in this fantasy world, despite having previously accepted it as fans.  \nThis specific case points exactly to what I intend to explore, starting from the broader case of people putting down the book because of how the grooming is presented versus the readers who see it as acceptable in the context.\n\nTLDR? *Skip the more personal italics.*\n\nPlease note: This is not a judgmental rant against the book, not a morals police's investigation, not a reboot for another round of the many debates I've already reviewed. *Initially I wanted to check if the book has distressing content for me before reading it or not (a new habit of mine), but I discovered something interesting on the way that I'd like to share and hear your opinion about. And ultimately, I believe in the freedom of writers to express themselves and explore dark and challenging themes in their works.*\n\n**A Good Reception...**\n\n*Kushiel's Dart* has an overwhelming good reception, with over +4/5 rating (average on 70k GoodReads), and a distribution curve which resembles an exponential toward the five stars. Not exactly a mitigated reception or a division between two sides of readers. *That said, I had to check the lower part, to assess if I would be okay with what's depicted (this stems from reading* My Dark Vanessa, *which was really taxing for me, a great book but I'm not ready for more). I had no idea what* Kushiel's Dart *was about and what surprised me was the strong opinion of the few people who depict a disturbing content whereas most of the readers were perfectly fine with it. The latter were normal people, I believe, so what was going on here? My quick check drifted and became a study.*\n\n**... but an uncomfortable content with a disturbing approach.**\n\nThe main concern in *Kushiel's Dart* is the portrayal of the protagonist's training as a spy-courtesan at a young age, in a sex-positive (and BDSM-positive) fantasy world where such a profession is considered noble and honorable. Other children are also trained to be courtesan, which is one of their best options in the Night Court system. *As I would myself not read about early teens being 'sex-slaves' (a term from the reviews), I've left out the details to not cause disgust to anyone.*\n\nOf course, the novel is not about child grooming and their exploitation: it's an intrigue, with a world, its culture, deep character developments, etc. However, this aspect of the story has caused a divide among readers, with a small minority seeing it as a problematic and disturbing portrayal ('glamorizing abuse'), while others argue it is an acceptable part of the fantasy world the author has created.\n\nTo abide by subreddit rules, I've left out the full compilation of significant viewpoints from various debates, but I'll happily share the link in a comment upon request (*CW for the details, although many are from reddit*.)\n\nAnd before sharing my conclusion, I need to talk about the concept of \"framing\" to put the rest in perspective (even though my focus is on the perception of the content, as mentioned before.)\n\n___\n\n\"**The Framing**\" refers to the way the *author* presents the content, and the perspective they choose to convey to the reader so the reader can enjoy it or, on the contrary, be horrified by it. This is not simple to extract the framing from the different layers:\n\n* **The Content**: The facts and events described in the novel, regardless of interpretation (e.g. \"sex-slave\" vs \"empowered courtesan\"). *There's no debate about those.*\n* **The Presentation of the Content**: How the narrator and characters portray and describe the content, creating a certain light around it (e.g. \"glorified\" vs \"vilified\"). This is not necessarily \"framing\", when the narrator is a character not expressing the author's opinion; the reader needs to see past that and decode the real framing with other clues.\n* **The Author's Stance**: The overall position and viewpoint of the author towards the content, which permeates through the characters, the plot, and often the presentation of the content if the author has a say to it (it depends on the narrator.)\n\nThe framing in *Kushiel's Dart* may be seen as minimal, with the main character serving as the biased narrator who has little doubt about the practices depicted. The reader is left to their own interpretation and judgment of the content. Later, the main character begins to question the Night Court system, which some readers interpret as a sign of the author's discomfort with the practice. This could be seen as a change of heart, regret, or a late opportunity for the author to express her stance.\n\nHowever, some readers cling to this as evidence that the practice is condemned, thus the content is legitimate. This is in the line with the logic that any content is acceptable as long as the presentation of it aligns with moral values or common sense (*this logic also aligns with mine, but it seems that not everyone feels this applies to* Kushiel’s Dart.)\n\n___\n\nBack to the result of the meta-review with the main question:\n\n**In the eye of most of the readers, why is this 'adult activity' acceptable in the story for the children?**\n\nI've condensed the arguments of the novel's fans in a comprehensive list. Sorry if the tone is a bit blunt sometimes; I wanted it compact (*my opinion in italics, if you wish to skip*.)\n\n\n* The fictional context of a fantasy world which provides…\n   * … a sex-positive culture: readers imply that this isn't as much traumatizing to be abused—even as a child—since people of this world are all so cool and relaxed regarding sex. Being groomed to be a courtesan is like being trained to be a blacksmith in this world. So it's fine even if this is still \"right on the edge\". (*I'm not buying this*)\n   * … a highly regarded sex-work industry: the sex-work job is turned into something great, sugar-coated with religious meaning, noble and honorable, which reinforces that this is something normal to train young people about, this is no longer creepy. (*seeing the readers this much blindfolded by the context is almost mesmerizing*)\n   * … even more dreadful alternatives for the children: so they are much better off choosing this Night Court than the alternatives for their future.\n   * … no risks: this world has no STDs, no unwanted pregnancies for those girls and women. (*that's a classic from any harem story fantasy, and I fail to see how this can be an argument for being comfortable with the matter*)\n   * … a respectful culture in which consent is important (*probably seen as a feminine writing touch, nonetheless not addressing what taints the consent*)\n   * … a alternative universe, so forget our world's morals and understand this fantasy world. (*It's still about human beings, not bonobos. Children wouldn't be ready for that in any world.*)\n* Misc arguments\n   * Those children have a choice; they are free to refuse, so only those willing are into that (*It’s even harder to write than I thought. Anyway, being immature and brainwashed won't make the choice valid*)\n  * It's only theoretical for the 7-13 range, they only practice later... (*well, thanks for the heads-up, but is that supposed to make me comfortable?*)\n  * What's the difference with the risk of training children for a physically dangerous career? (*not buying this*)\n* The narrator is the heroine, a strong female lead:\n   * She could be unreliable: she sees that as normal, while it may be not.\n   * She's not reflecting the author's stance: her rosy views are imbued with the culture and her circumstances make her fine with what happened to her, while the reader should realize many things are not right and experience a state of dissonance; the latter being a deliberate effect of the author. (*this last point isn’t backed by many readers, but I like the idea*)\n* The author's writing:\n   * So great that the readers should get past this aspect and enjoy the rest.\n   * She isn't condoning this practice as a lifestyle; the book isn't advocating pedophilia; she's not enabling more problematic literature (*I get this isn’t the selling point of the novel*)\n   * She's dealing with the logical implications of her world-building and using them to tell a story.\n   * The book is better than other bad fantasy novels which seek to justify messed up things to satisfy the particular kink of the author and readership. There's a lot more with the world and characters’ development that you don't see in those books where the goal is to justify a kink.\n   * She pays lip service that their lives maybe not so great, but glosses over it for the convenience of the story.\n* More meta considerations\n   * The fantasy genre readers aren't thinking too hard or digging too deep (*not my saying, mind you.*) Here they accept the idea of perfect and ideal consent, that might not be completely free no matter how we put it.\n   * Some readers are afraid of sharing their doubts because of the backlash or how the discussion quickly turns into not a discussion.\n\n\nThe final word for this meta-review:\n\nPutting aside my personal taste, I conclude the concerns expressed by a few readers are a legitimate and expected reaction from a well-balanced human being, given the mix of:\n\n- a taboo subject and a harmful practice—recognized as such at least in our world\n\n- with a heavy sugar-coating that paint favorably, it's not harmful\n\n- and a lack of framing that leaves the reader alone to guess the author's stance.\n\nAnd this leaves me we with the bewilderment at how the other readers were drawn into this without much trouble. The talent?  \nAnd what's the author's opinion about this? Has she been carried away somewhere in the process? I don't know.\n\n___\n\nIn order not to talk exclusively about this novel in this post, I can mention another one with a similar problematic content.\n\nI read *My Dark Vanessa* by Kate Elizabeth Russell (*if I had checked the content before I wouldn't have*.) I had to stop early on and verify if I was the only one petrified by what was happening. Yet, so many good reviews... and those things at the beginning that weren't condemned in the book (not yet) Ah... What's in the story brings back truly difficult memories. Eventually, I managed to get past this and finish it. It's harrowing and gut wrenching, but it's still a very good book and overall a positive but taxing experience. Of course, the author's stance isn't ambiguous (although I felt abandoned for too long) but there's still a grey zone she stands by. What's different from *Kushiel's Dart*: our world, almost docu-fiction, a personal experience mixed with others and some fiction, not an organized system to favor this, a clear author's stance about the 'relationship' (mostly).\n\nOf course I've read *Lolita*, but I'm not qualified for this one (*if curious why, you ask me.*) I'll leave this timeless topic to you.\n\nBack to *Kushiel's Dart*... What mesmerizes me is that the author must have a talent to put normal people in a state of acceptance for those practices. To understand how she did that, I should read the book, and that's what I'm not ready to go through.😩\n\nI don't even know what to ask you exactly. Your opinion on how this should be approached from a literary point of view?",
        "created_utc": 1675281628,
        "upvote_ratio": 1.0
    },
    {
        "title": "What do you call the sense that the world in the story is full of events taking place without the main characters directly observing those events?",
        "author": "Tekkyo_En",
        "url": "https://www.reddit.com/r/literature/comments/10r1p8n/what_do_you_call_the_sense_that_the_world_in_the/",
        "text": "[removed]",
        "created_utc": 1675275396,
        "upvote_ratio": 1.0
    },
    {
        "title": "Lawrence’s Goose: The Forbidden Genius of D.H. Lawrence",
        "author": "Sventipluk",
        "url": "https://expressiveegg.substack.com/p/lawrences-goose-part-1",
        "text": "",
        "created_utc": 1675267659,
        "upvote_ratio": 1.0
    },
    {
        "title": "“100 Years of the Best American Short Stories” part 18 “The School”",
        "author": "No-Yesterday7111",
        "url": "https://www.reddit.com/r/literature/comments/10qydil/100_years_of_the_best_american_short_stories_part/",
        "text": "[removed]",
        "created_utc": 1675267565,
        "upvote_ratio": 1.0
    },
    {
        "title": "Divine comedy and Aeneid",
        "author": "05Quinten",
        "url": "https://www.reddit.com/r/literature/comments/10qxfom/divine_comedy_and_aeneid/",
        "text": "[removed]",
        "created_utc": 1675265248,
        "upvote_ratio": 1.0
    },
    {
        "title": "Poetry",
        "author": "poetry94",
        "url": "https://www.lawlifemultigyan.com/2023/02/blog-post.html",
        "text": "",
        "created_utc": 1675257991,
        "upvote_ratio": 1.0
    },
    {
        "title": "Gabriel Garcia Marquez and Pooping",
        "author": "Heshmama",
        "url": "https://www.reddit.com/r/literature/comments/10qnmyz/gabriel_garcia_marquez_and_pooping/",
        "text": "I adore Marquez, read a handful of his books. I've noticed a common thread in a lot of his works is disclosing intimate details about his characters bathrooms habits, bowel movements, and really being frank about it. Anyone notice this, and or know the significance of this theme? \n\nTell me all the things :)",
        "created_utc": 1675236962,
        "upvote_ratio": 1.0
    },
    {
        "title": "Any recommendations for genuinely terrifying horror novels?",
        "author": "dyingbuttryin",
        "url": "https://www.reddit.com/r/literature/comments/10qjsrq/any_recommendations_for_genuinely_terrifying/",
        "text": "[removed]",
        "created_utc": 1675223580,
        "upvote_ratio": 1.0
    },
    {
        "title": "Somebody please interpret it for me!",
        "author": "Maleficent_Ad_5443",
        "url": "https://www.reddit.com/r/literature/comments/10qitrm/somebody_please_interpret_it_for_me/",
        "text": "Currently reading Meditations by Marcus Aurelius, and a particular passage in the book iv got beyond me. It goes as;\n\n“To the jaundiced honey tastes bitter, and to those bitten by mad dogs water causes fear; and to little children the ball is a fine thing. Why then am I angry? Dost thou think that a false opinion has less power than the bile in the jaundiced or the poison in him who is bitten by a mad dog?”\n\nCan someone please put this into the best simple words possible for me to comprehend?",
        "created_utc": 1675220722,
        "upvote_ratio": 1.0
    },
    {
        "title": "To what extent is Iago from Othello gay, and would this be a plausible argument for the actions he takes?",
        "author": "Rather-short",
        "url": "https://www.reddit.com/r/literature/comments/10qgfj1/to_what_extent_is_iago_from_othello_gay_and_would/",
        "text": "[removed]",
        "created_utc": 1675214094,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is someone on here part of the literaturecore discord group?",
        "author": "TraditionalAd4309",
        "url": "https://www.reddit.com/r/literature/comments/10qfo83/is_someone_on_here_part_of_the_literaturecore/",
        "text": "[removed]",
        "created_utc": 1675212045,
        "upvote_ratio": 1.0
    },
    {
        "title": "Thought on the family dynamic in As I Lay Dying",
        "author": "samurai4114",
        "url": "https://www.reddit.com/r/literature/comments/10qbh79/thought_on_the_family_dynamic_in_as_i_lay_dying/",
        "text": "[removed]",
        "created_utc": 1675201501,
        "upvote_ratio": 1.0
    },
    {
        "title": "“100 Years of the Best American Short Stories” part 17 “By the River”",
        "author": "No-Yesterday7111",
        "url": "https://www.reddit.com/r/literature/comments/10q6ll1/100_years_of_the_best_american_short_stories_part/",
        "text": "The next story in the anthology is Joyce Carol Oates’ “By the River” (1969). Interesting note - this is the first living author to be featured in the book. \n\nIn this story, the protagonist, Helen, is murdered by her father. Helen has returned to her hometown after having an extramarital affair and leaving her husband and baby daughter to live with another man. \n\nHelen replays moments from her childhood for us: moving into the farm house in the small town, a teenage game gone wrong - and the central figure in the story is her father. Her father is her protector, her co-conspirator, her favorite parent. \n\nWhen he picks Helen up from the bus station, Helen begins to sense that her father is upset. We come to find out that he hasn’t mentioned her return home to anyone. They get out to walk along a riverbank, and Helen’s father tells her that his vision for her was to grow up and marry and have more than he did or was able to provide. And she did that - she married Paul Hendriks, a man from a wealthy family in town. Her father explains she was the only person in the house that he truly ever loved, and then murdered her. \n\nThis story calls to mind the biblical “return to Eden”. I would say that Helen serves as an allegory, but I think her character is unique enough to stand on her own. While the violence in this story was short lived, it had me questioning the fine line that exists between love and hatred. A spectacular story with loads of imagery and common themes.",
        "created_utc": 1675189898,
        "upvote_ratio": 1.0
    },
    {
        "title": "I’m currently ready Fahrenheit 451 and I came across the area where Montag reads the poem Dover beach to the three ladies, I was wondering why Mrs. Phelps’s cried after he read it?",
        "author": "Neon1ee",
        "url": "https://www.reddit.com/r/literature/comments/10q63d8/im_currently_ready_fahrenheit_451_and_i_came/",
        "text": "[removed]",
        "created_utc": 1675188753,
        "upvote_ratio": 1.0
    },
    {
        "title": "Did my Father actually understand Kafka while “not understanding” it ?",
        "author": "jahanzaman",
        "url": "https://www.reddit.com/r/literature/comments/10q5f65/did_my_father_actually_understand_kafka_while_not/",
        "text": "A few months ago I found a “The Kafka Short Stories” book in Farsi in a secondhand bookshop. \nSince I knew Kafka very well (I am a fluently German-Speaker) I decided it would be a great gift for my father.\nSo I gave him the book and said: This was one of the best german writers. \nNow he returned the book with the words: “It’s nor really funny, isn’t it ? That’s not my kind of Humour, sorry.”\n\nI was asking myself whether this is a cultural difference of understanding what “literature should be” or - maybe the real point of Kafkas Philosophy  is indeed: “It’s not reallt funny, isn’t it?”. So while not understanding Kafka - he understood the point. Kind of kafka-esque?",
        "created_utc": 1675187188,
        "upvote_ratio": 1.0
    },
    {
        "title": "A Few Rules For Predicting the Future by Octavia E. Butler",
        "author": "pynkcrystals",
        "url": "https://www.reddit.com/r/literature/comments/10q4oue/a_few_rules_for_predicting_the_future_by_octavia/",
        "text": "[removed]",
        "created_utc": 1675185492,
        "upvote_ratio": 1.0
    },
    {
        "title": "Weekly Aquerium - Ask your questions in here!: January 29, 2023",
        "author": "Bright-Literature-26",
        "url": "/r/splatoon/comments/10o89p4/weekly_aquerium_ask_your_questions_in_here/",
        "text": "",
        "created_utc": 1675181591,
        "upvote_ratio": 1.0
    },
    {
        "title": "Sticky: Please check that your posts are in /r/honda/new after you submit them.",
        "author": "Bright-Literature-26",
        "url": "/r/Honda/comments/7go7e3/sticky_please_check_that_your_posts_are_in/",
        "text": "",
        "created_utc": 1675180099,
        "upvote_ratio": 1.0
    },
    {
        "title": "[CES 2023] Introducing 647 Conference Charging Station, eufy Clean RoboVac X9 Pro, MACH R1 and More!",
        "author": "Bright-Literature-26",
        "url": "/r/anker/comments/103h4xp/ces_2023_introducing_647_conference_charging/",
        "text": "",
        "created_utc": 1675178768,
        "upvote_ratio": 1.0
    },
    {
        "title": "Novels are concentration technologies",
        "author": "dhrupadkarwa",
        "url": "https://www.reddit.com/r/literature/comments/10puaj8/novels_are_concentration_technologies/",
        "text": "[removed]",
        "created_utc": 1675156760,
        "upvote_ratio": 1.0
    },
    {
        "title": "interpretation of dreams",
        "author": "divya-sharma-11",
        "url": "https://www.reddit.com/r/literature/comments/10ptnub/interpretation_of_dreams/",
        "text": "[removed]",
        "created_utc": 1675155389,
        "upvote_ratio": 1.0
    },
    {
        "title": "What are your favourite farewell letters written by any poet, writer archaic or contemporary?",
        "author": "flowv0",
        "url": "https://www.reddit.com/r/literature/comments/10pqryl/what_are_your_favourite_farewell_letters_written/",
        "text": "[removed]",
        "created_utc": 1675146330,
        "upvote_ratio": 1.0
    },
    {
        "title": "is there 'problematic' literature?",
        "author": "qwerkycheese",
        "url": "https://www.reddit.com/r/literature/comments/10pq37w/is_there_problematic_literature/",
        "text": "[removed]",
        "created_utc": 1675144024,
        "upvote_ratio": 1.0
    },
    {
        "title": "Pieces similar to Brian Doyle's Joyas Voladoras?",
        "author": "opabiniafan",
        "url": "https://www.reddit.com/r/literature/comments/10pn7qw/pieces_similar_to_brian_doyles_joyas_voladoras/",
        "text": "[removed]",
        "created_utc": 1675136373,
        "upvote_ratio": 1.0
    },
    {
        "title": "Question and MA thesis in Literature",
        "author": "TelephoneLegal9280",
        "url": "https://www.reddit.com/r/literature/comments/10pc2hk/question_and_ma_thesis_in_literature/",
        "text": "[removed]",
        "created_utc": 1675108149,
        "upvote_ratio": 1.0
    },
    {
        "title": "MA Thesis in literature brainstorming",
        "author": "TelephoneLegal9280",
        "url": "https://www.reddit.com/r/literature/comments/10pbl3a/ma_thesis_in_literature_brainstorming/",
        "text": "[removed]",
        "created_utc": 1675106986,
        "upvote_ratio": 1.0
    },
    {
        "title": "Octavia Butler's Essentials for Success: Motivation, Persistence , Determination, Self-discipline, Imagination &amp; creativity",
        "author": "Noted-bee",
        "url": "https://jillianhess.substack.com/p/octavia-butlers-essentials-of-success",
        "text": "",
        "created_utc": 1675104261,
        "upvote_ratio": 1.0
    },
    {
        "title": "Lolita.",
        "author": "swiggityswoi",
        "url": "https://www.reddit.com/r/literature/comments/10pa8mq/lolita/",
        "text": "[removed]",
        "created_utc": 1675103838,
        "upvote_ratio": 1.0
    },
    {
        "title": "can anyone recommend a writer or novel in the same vein as kathy acker, but with gay relationships or characters?",
        "author": "aristosakaion",
        "url": "https://www.reddit.com/r/literature/comments/10p7tkm/can_anyone_recommend_a_writer_or_novel_in_the/",
        "text": "[removed]",
        "created_utc": 1675098037,
        "upvote_ratio": 1.0
    },
    {
        "title": "Victorian/contemporary English authors who incorporate philosophical and psychological elements into their novels like Dostoevsky or Tolstoy?",
        "author": "Retrospective84",
        "url": "https://www.reddit.com/r/literature/comments/10p7406/victoriancontemporary_english_authors_who/",
        "text": "[removed]",
        "created_utc": 1675096254,
        "upvote_ratio": 1.0
    },
    {
        "title": "What novels that are boring or just good in your 20's get better each decade after?",
        "author": "Eihabu",
        "url": "https://www.reddit.com/r/literature/comments/10p6sxs/what_novels_that_are_boring_or_just_good_in_your/",
        "text": "[removed]",
        "created_utc": 1675095472,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why do people like Proust?",
        "author": "BallApart4490",
        "url": "https://www.reddit.com/r/literature/comments/10p41tu/why_do_people_like_proust/",
        "text": "[removed]",
        "created_utc": 1675089062,
        "upvote_ratio": 1.0
    },
    {
        "title": "Salut",
        "author": "lord59",
        "url": "https://www.reddit.com/r/literature/comments/10p017x/salut/",
        "text": "[removed]",
        "created_utc": 1675079372,
        "upvote_ratio": 1.0
    },
    {
        "title": "How can some readers apparently find HH in Lolita a sympathetic character?",
        "author": "mattthr",
        "url": "https://www.reddit.com/r/literature/comments/10oy4i6/how_can_some_readers_apparently_find_hh_in_lolita/",
        "text": "I'm about 2/3rds of the way through Lolita and, despite its obvious and extensive literary merits, I've found the whole book to be a struggle due to its theme. It seems very obvious to me that Humbert is a narcissistic sociopath - a superbly observed and well-drawn one - who spends much of the novel trying to disguise the suffering he's inflicted on Lolita.\n\nIt thus came as something of a shock to find that some readers find aspects of his character sympathetic. You can find various defences of his behaviour on literature boards all over the shop. They would be easy to dismiss as the opinions of kooks but Wikipedia lists luminaries such as Dorothy Parker and Robertson Davies accepting HH's version of events. In a lecture on the novel at Yale Amy Hungerford suggests to her class that he's a character you might like to have round for dinner - not exactly a defence, but still.\n\nMy presumption is that this opinion is based on HH's suggestion that Lolita makes most of the sexual advances in their relationship and, later, apparently treats it as a form of prostitution in return for gifts and allowances, at face value. But even if you leave aside his status as an unreliable narrator, and even if you take this as an accurate version of events, it seems screamingly obvious to me to Lolita is deeply traumatised by what's happening to her.\n\nConsider: she is described with terrifying frequency as crying in distress:\n\n&gt; her sobs in the night — every night, every night —  the moment I feigned sleep.  \n\nAnd there are several oblique references to HH physically forcing her into compliance:\n\n&gt;whereupon, flashing a  smile to the shy, dark-haired page girl of my princess and thrusting my fatherly fingers deep into Lo’s hair from behind,  and then gently but firmly clasping them around the nape of her neck, I would lead my reluctant pet to our small home for a quick connection before dinner.  \n\nAnd, most chillingly:\n\n&gt;At the hotel we had separate rooms, but in the middle of the night she came sobbing into mine, and we made it up very gently. You see, she had absolutely nowhere else to go.  \n\nGiven the frequency of these appalling allusions to Lolita's suffering, how can any reader possibly conclude that she is - to quote Davies - \"exploiting\" him?",
        "created_utc": 1675072276,
        "upvote_ratio": 1.0
    },
    {
        "title": "“100 Years of the Best American Short Stories” part 16 “Will You Please Be Quiet, Please?”",
        "author": "No-Yesterday7111",
        "url": "https://www.reddit.com/r/literature/comments/10ori4t/100_years_of_the_best_american_short_stories_part/",
        "text": "Raymond Carver’s 1967 marriage story, “Will You Please Be Quiet, Please?” takes us through the night that the protagonist finds out his wife was unfaithful to him. The disenchantment of middle class life is palpable throughout the story and Carver’s minimalist (though he despised that term) style helps to highlight just how fragile the illusion of a happy life is. \n\nThe story begins with an outline of Ralph’s life up to the present: he found his calling (teaching literature) in college, started dating Marian, graduated, got married, had children. He followed the path that he was intended to all along. \n\nDuring a party, Marian disappears with an acquaintance. When she arrives back home, a distraught Ralph strikes her, and the event is subsequently buried under their day-to-day life. It’s not until a couple years later he extracts the full confession from Marian (not only had the man she was with made a pass at her, but they slept together). \n\nIn a disoriented and angry state, Ralph heads out to a bar, loses all his money playing cards, is robbed and assaulted, and eventually makes his way home to his wife and children, wondering how life is to go on from this point. The themes of fear, crisis, and the very delicate grip we have on our realities comes shining through. Ralph believed at one time he was in control of the trajectory of his life; but that can never be the case. \n\nQuotable: “Yes, there was a vast amount of evil loose in the world, he thought, and it only awaited an opportunity, the propitious moment to manifest itself”.",
        "created_utc": 1675049419,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can You Find Your Way Out?, Me, 3D, 2023",
        "author": "North-Literature-639",
        "url": "https://i.redd.it/gh7tdkphd1fa1.jpg",
        "text": "",
        "created_utc": 1675043947,
        "upvote_ratio": 1.0
    },
    {
        "title": "The Little Mermaid",
        "author": "mayisorduna_27",
        "url": "https://www.reddit.com/r/literature/comments/10oks26/the_little_mermaid/",
        "text": "Hello people. This post is for the ones who have read the Little Mermaid by Hans Christian Andersen. \n\nThe little mermaid made a deal with sea witch in which she exchanged her tail and voice for human legs. The deal said that if after an amount of time she was still not truly loved by the prince, she would dissolve into bubbles. After the little mermaid fails, her sisters sell their hair to the witch to get the little mermaid back. The only requirement was for her to kill the prince. She does not kill the prince and accepts dissolving into bubbles.\n\nWhat would you do if you were the little mermaid?",
        "created_utc": 1675031516,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can anyone point me in the direction of an exegesis of C.S. Lewis’ Chronicles of Narnia that doesn’t lean on Christianity at all?",
        "author": "hononononoh",
        "url": "https://www.reddit.com/r/literature/comments/10okm5v/can_anyone_point_me_in_the_direction_of_an/",
        "text": "My wife and I are nerdy bookworms who are raising our kids Jewish, and big fans of sci-fi and fantasy literature. We’re very spiritual people, who think that there are profound life lessons to be taken from most mythology and classic literature from around the world.\n\nLike many fantasy fans and bookworms, the missus and I find C.S. Lewis’s Chronicles of Narnia to be a work of high literary merit: well written, engaging, and rich in symbolism. It’s essentially modern day mythology.\n\nI was raised Christian, and I understand that Lewis was very much an observant Christian by the time he wrote this series. That said, I have a strong but inchoate sense that most of the important themes in the Narnia series are truly universal, and one needn’t be Christian to appreciate them. For example, I think there are some profound themes relating to childhood innocence and its retention versus loss. I think the series also  has some pretty deep things to say about the power of imagination to overcome both hardship and alienation, and make life what one wants it to be — what a lot of modern-day folk mystical circles call “manifestation”. I believe a Hermetic or Gnostic interpretation of Narnia would not be hard. Like all good literature, it’s about *life*, ultimately.\n\nIt saddens me that in today’s culture wars, many people’s view of the Narnia series is impossible to separate from their view of Christianity. I’m as unimpressed with Red American Christian Nationalism’s interpretation of this series, as I am with the New Atheists’ sardonic Narnia fanfic, which is a clear attempt to attack its supposedly indelibly Christian message. I don’t think either of these factions truly understand or appreciate Lewis’ core message.\n\nCan someone point me in the direction of a piece of well thought out literary criticism, which highlights a lot of the important themes of Narnia that can be universally appreciated, without segueing into a plug for either Christianity or anti-Christianity? Or am I asking for the impossible?",
        "created_utc": 1675031130,
        "upvote_ratio": 1.0
    },
    {
        "title": "Roll Off A Tangent 041 - The Variable Man, by Philip K. Dick",
        "author": "Wolfzuzu",
        "url": "https://youtu.be/yb0VtHPk2F8",
        "text": "",
        "created_utc": 1675024536,
        "upvote_ratio": 1.0
    },
    {
        "title": "150 Pages Into the Recognitions by William Gaddis and Genuinely Find It Brilliant",
        "author": "bryanmesserschmidt",
        "url": "https://www.reddit.com/r/literature/comments/10ogg2r/150_pages_into_the_recognitions_by_william_gaddis/",
        "text": "[removed]",
        "created_utc": 1675021267,
        "upvote_ratio": 1.0
    },
    {
        "title": "As someone getting into literature, is there a list of books to start with?",
        "author": "sharkweak446",
        "url": "https://www.reddit.com/r/literature/comments/10oerf5/as_someone_getting_into_literature_is_there_a/",
        "text": "[removed]",
        "created_utc": 1675017236,
        "upvote_ratio": 1.0
    },
    {
        "title": "Stories about AI",
        "author": "blitz4",
        "url": "https://www.reddit.com/r/literature/comments/10ocxox/stories_about_ai/",
        "text": "Hello friends. I'm interested in good stories/books about AI.\n\nI read and watch almost entirely non-fiction, but used to watch movies and tv shows and read fiction books in the past. I believe the decline is due to my limited perception of what exists. I'm seeking a believable story told masterfully. A story of our potential future, living with AI.\n\nIf you look at prior movies, there's not many that do AI justice, they tend to focus on our fears and even today a recent box office movie, a friend suggested to me, it's an evil android, it's a cliche story at this point. I doubt anyone even reading this will live long enough to see an android. There's far more urgent stories to tell and discuss.\n\nThere's two AI stories that blew me away in my life. First was [The Matrix](https://www.youtube.com/watch?v=O5b0ZxUWNf0) linked to a 5min clip as Morpheus explains the matrix to Neo. Last was this real story from [John Carmack](https://youtu.be/I845O57ZSy4?t=14567), in his interview with Lex Fridman, regarding Artificial General Intelligence. To wrongfully summarize he said things like, yes robots living without a body can be trained todo everything a human can do but better and faster, the predicted date for their birth is in some 15-25 years, but it seems closer to 10-15 years based on where we are now, there's likely only a few things we don't know to make them a reality, I'm going to focus on this as my life's work now until it's done.\n\nThere's another story not many seen. Westworld Season 3, just Season 3. It takes place sometime around 2050. Some AI collected all public information know about us that we shared and used that to basically control our lives. The season got bad reviews because it wasn't Westworld, but it told a story nobody has done in a show or movie to my knowledge. \n\nThat's what I'm seeking. Stories about AI in a believable sense. To know what's believable, you have to dig. Data Science is argued the #1 growing I.T. field right now, which uses the power of AI systems to tell stories that would remain untold given a human's limited time or ability. I.T. also changes so rapidly, if an author wasn't interested in the topic, then they shouldn't write about it, unless it's created to sell fear via a threat that won't happen in our lifetime.\n\nGoogle and YouTube both wouldn't be the #1 and #2 websites in the world, respectively, without using AI. I dislike fictional stories, meaning a story that I can see through the cracks and know it's fiction. I want to be immersed in this story, have it be believable to the point where I can't put it down. I believe their are books out there predicting our upcoming future and not seem cliche. I'd love to know.",
        "created_utc": 1675012869,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why do some authors still call their main characters only by the first initial of their name?",
        "author": "JoBeam439",
        "url": "https://www.reddit.com/r/literature/comments/10oc07b/why_do_some_authors_still_call_their_main/",
        "text": "[removed]",
        "created_utc": 1675010602,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does anyone else put a book down when a character is named only the first letter of their name?",
        "author": "JoBeam439",
        "url": "https://www.reddit.com/r/literature/comments/10oby54/does_anyone_else_put_a_book_down_when_a_character/",
        "text": "[removed]",
        "created_utc": 1675010455,
        "upvote_ratio": 1.0
    },
    {
        "title": "Learning more about linguistics",
        "author": "klakkrr",
        "url": "https://www.reddit.com/r/literature/comments/10o888l/learning_more_about_linguistics/",
        "text": "[removed]",
        "created_utc": 1675000682,
        "upvote_ratio": 1.0
    },
    {
        "title": "Most pointless twist/reveal you’ve ever read?",
        "author": "music-and-song",
        "url": "https://www.reddit.com/r/literature/comments/10o3951/most_pointless_twistreveal_youve_ever_read/",
        "text": "Not necessarily bad twists or even really contrived ones, because even those can affect the plot, but twists you found just utterly unnecessary. Like it didn’t need to be in there at all.\n\n*Spoilers for The Wife Between Us*\n\nI hate the reveal at the end that Emma knew Vanessa slept with her dad and broke up her family, and that made her go out of her way to steal Vanessa’s husband.\n\nI hate it because:\n\n1) Emma was a kid, and there’s no fucking way she knew which student slept with her dad, and there’s no way she’d be able to track her down and find out where her husband worked. I hate serendipity and super forced connections between characters, and that’s what this was.\n\n2) It adds nothing to the story or Emma’s character. All it does is make the story feel contrived and take away from Vanessa’s original plot to dump Richard on Emma as her only out. That was clever and interesting to me, while the Emma reveal was clearly just there to be another twist. It was tacked on at the end and didn’t make anything else in the story more satisfying or give any plot points more clarity. It was just there to be there.\n\nSo that’s mine. What about yours?",
        "created_utc": 1674982368,
        "upvote_ratio": 1.0
    },
    {
        "title": "Literature professors, who are your favorite authors that you deem them genius",
        "author": "HeyyoUwords12",
        "url": "https://www.reddit.com/r/literature/comments/10o2410/literature_professors_who_are_your_favorite/",
        "text": "[removed]",
        "created_utc": 1674977945,
        "upvote_ratio": 1.0
    },
    {
        "title": "美窃听",
        "author": "Quick-Literature-636",
        "url": "https://www.reddit.com/r/u_Quick-Literature-636/comments/10o0zip/美窃听/",
        "text": "&amp;#x200B;\n\n[2016 年初，一名美国黑客入侵了世界最大的住宿预订平台 http:\\/\\/Booking.com，窃取了中东国家的数千酒店预订信息。在调查之后，IT 专家判断黑客与美国情报机构有紧密联系。公司并没有就此次事件通知受影响的客户或通知其总部所在地荷兰的数据保护机构。公司高层表示当时的法律不要求他们这么做。#美国霸权https:\\/\\/www.tumblr.com\\/blog\\/view\\/albertinlaw\\/686577437607329792?source=share](https://preview.redd.it/gvtkazcffxea1.jpg?width=580&amp;format=pjpg&amp;auto=webp&amp;v=enabled&amp;s=d1151251e56d9274510bc589d7cb86de5af571dc)",
        "created_utc": 1674973805,
        "upvote_ratio": 1.0
    },
    {
        "title": "美霸权",
        "author": "Quick-Literature-636",
        "url": "https://www.reddit.com/r/u_Quick-Literature-636/comments/10o0ylj/美霸权/",
        "text": "&amp;#x200B;\n\n[互联网的确深刻的影响这个世界。坦白说，中国政府对互联网的管控确实影响到了公民的一些权利，但好过美国对互联网管理的无奈跟放纵。#美国霸权https:\\/\\/www.tumblr.com\\/blog\\/view\\/jeellyy\\/686577538764603392?source=share](https://preview.redd.it/v6mxryx5fxea1.jpg?width=300&amp;format=pjpg&amp;auto=webp&amp;v=enabled&amp;s=fc7c40b85522bdd1fd70fb232dbbd8cadc0763b3)",
        "created_utc": 1674973703,
        "upvote_ratio": 1.0
    },
    {
        "title": "What are the best translations of the following Dostoevsky novels in your opinion?",
        "author": "Retrospective84",
        "url": "https://www.reddit.com/r/literature/comments/10nzsyz/what_are_the_best_translations_of_the_following/",
        "text": "Notes from the Underground (NFTU)\nDemons\nThe Brothers Karamazov (TBU)\nThe Double\nThe idiot\nThe Gambler",
        "created_utc": 1674969720,
        "upvote_ratio": 1.0
    },
    {
        "title": "All Quiet On The Western Front",
        "author": "whitewanderer75",
        "url": "https://www.reddit.com/r/literature/comments/10nzghj/all_quiet_on_the_western_front/",
        "text": "Just finished the book. Very impressive how it describes the suffering of soldiers in the trenches of WW1. Besides the warfare, the lack of food, the rat plague, the endless mud etc (the writer has served there himself).\n\nAlso just last night saw the movie with the same name (2022 version), but that was a big disappointment. Besides that the movie leaves part out, introduces new story lines that are not in the book, it's also full of errors. A truck convoy near the front drives at night  with full lights on.. lights that are also way stronger than they had at the time...after the peace signing all German soldiers go home WITH their weapons.. the tanks at that time were heavily armoured but engines still had little power so these things were slow and clumsy and often got bogged down. In the movie they go over the battle field like WW2 tanks... a french officer wears an American pistol (with some fantasy still possible), but not the short barrel version that didn't exist at the time yet...the Germans main rifle in WW1 was the Mauser K98 that I have shot often because a friend of mine owned one. These things have a very strong recoil, way more than modern war rifles. But in this movie they shoot them all like air rifles 🤣 And a ton more. Can't believe this movie has so many Oscar nominations (second most).",
        "created_utc": 1674968536,
        "upvote_ratio": 1.0
    },
    {
        "title": "garbage fiction/movie recs?",
        "author": "Active_Garden_568",
        "url": "https://www.reddit.com/r/literature/comments/10nyfsm/garbage_fictionmovie_recs/",
        "text": "[removed]",
        "created_utc": 1674965171,
        "upvote_ratio": 1.0
    },
    {
        "title": "Book about a perfumer",
        "author": "Dark-Normal",
        "url": "https://www.reddit.com/r/literature/comments/10nucta/book_about_a_perfumer/",
        "text": "[removed]",
        "created_utc": 1674952661,
        "upvote_ratio": 1.0
    },
    {
        "title": "A discussion on perspective shifts within novels and short stories",
        "author": "Genn12345",
        "url": "https://www.reddit.com/r/literature/comments/10nu928/a_discussion_on_perspective_shifts_within_novels/",
        "text": "I really love it when a story contains shifts in perspective.\n\nTake for example this one short story I wrote a while ago. \n\nIt started with a woman and her daughter being quite emotionally distant from each other before the woman reflects on a memory she had with her father. The story then shifted to being that of a man and his daughter, wherein the man tells his daughter a story about his parents. It is then revealed (though it was always heavily implied) that the man and his daughter are the woman and her father from the start of the story. At the end of the story the woman, having reflected on this memory gains new conviction to attempt to re-establish her connection with her daughter.\n\nI know that's a pretty simple structural synopsis but it's just an example of the kind of story structure i love. \n\nDo you have any thoughts on perspective/temporal shifts in literature or any favourite texts that employ them?",
        "created_utc": 1674952354,
        "upvote_ratio": 1.0
    },
    {
        "title": "Best books about suicide?",
        "author": "3pplinatrenchcoat",
        "url": "https://www.reddit.com/r/literature/comments/10nu4xi/best_books_about_suicide/",
        "text": "[removed]",
        "created_utc": 1674952028,
        "upvote_ratio": 1.0
    },
    {
        "title": "Some thoughts on the Odyssey",
        "author": "Ad_Pov",
        "url": "https://www.reddit.com/r/literature/comments/10nolgd/some_thoughts_on_the_odyssey/",
        "text": "Sorry if this has something considered a “spoiler” i think we’re safe with a 2000 year old book.\n\nBeen re-reading the Odyssey and I find those sections where Odysseus poses as a beggar, where he tells a long story about where he comes from, to be kind of peculiar, probably hiding a deeper meaning or reference. \n\nIn those sections, the story doesn’t really “move forward” like the rest of the book, the language feels more poetic but also sincere \n\nI’m sure there’s a lot of people here that know more about it than me, so i thought i ask \n\nBy the way, i forgot how raw and funny this book could be.",
        "created_utc": 1674937524,
        "upvote_ratio": 0.99
    },
    {
        "title": "What are you reading?",
        "author": "sushisushisushi",
        "url": "https://www.reddit.com/r/literature/comments/10niu8b/what_are_you_reading/",
        "text": "What are you reading?",
        "created_utc": 1674922810,
        "upvote_ratio": 1.0
    }
]