[
    {
        "title": "Pizza delivery driver explains why his supervisors despise him for following the rules",
        "author": "HobbesisCalvin",
        "url": "https://youtu.be/KWG3HdpA8Y0",
        "text": "",
        "created_utc": 1521313873,
        "upvote_ratio": ""
    },
    {
        "title": "Cats are Assholes",
        "author": "BagelsToGo",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/854oik/cats_are_assholes/",
        "text": "[removed]",
        "created_utc": 1521302859,
        "upvote_ratio": ""
    },
    {
        "title": "A friend ordered Lemon Chicken and this is what she got",
        "author": "RishanChattaraj",
        "url": "https://i.redd.it/1q44xw8o1bm01.jpg",
        "text": "",
        "created_utc": 1521284270,
        "upvote_ratio": ""
    },
    {
        "title": "I finished my workout... And u?",
        "author": "kal_eido",
        "url": "https://i.redd.it/mv0ul7hh55m01.jpg",
        "text": "",
        "created_utc": 1521274018,
        "upvote_ratio": ""
    },
    {
        "title": "Got my training done boss!",
        "author": "[deleted]",
        "url": "https://i.redd.it/qtrvdzo2c9m01.jpg",
        "text": "[deleted]",
        "created_utc": 1521263557,
        "upvote_ratio": ""
    },
    {
        "title": "those are some genius kids",
        "author": "butahumblebee",
        "url": "https://i.redd.it/djaoxh0kf8m01.jpg",
        "text": "",
        "created_utc": 1521252617,
        "upvote_ratio": ""
    },
    {
        "title": "Tacos. Upvote this so that this super low-res image becomes the #1 result when \"Googleing\" tacos.",
        "author": "[deleted]",
        "url": "https://i.redd.it/z5fmy6n9l7m01.png",
        "text": "[deleted]",
        "created_utc": 1521242471,
        "upvote_ratio": ""
    },
    {
        "title": "Let him win",
        "author": "[deleted]",
        "url": "https://i.imgur.com/1XCSmtM.gifv",
        "text": "[deleted]",
        "created_utc": 1521242057,
        "upvote_ratio": ""
    },
    {
        "title": "Rude to the trainee? Guess you're going to be waiting for those glasses.",
        "author": "falsifiedusername",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/84y28f/rude_to_the_trainee_guess_youre_going_to_be/",
        "text": "[removed]",
        "created_utc": 1521228146,
        "upvote_ratio": ""
    },
    {
        "title": "Exceeding my R.D.A. for sugar",
        "author": "Wiseraptor",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/84xrz1/exceeding_my_rda_for_sugar/",
        "text": "[removed]",
        "created_utc": 1521225940,
        "upvote_ratio": ""
    },
    {
        "title": "Waiting for you approval",
        "author": "madamejesaistout",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/84xa6t/waiting_for_you_approval/",
        "text": "LTR, FTP, please be kind.\n\nNot too long ago, my boss (who is based in a different city, so we don't see or talk to each other outside of twice-weekly conference calls) was stressed out about a deadline and took some of that stress out by sending angry emails about social media posts I had made. In particular, an image was published that he hadn't given final approval to. \n\nI was very annoyed because we had an approval process using a task management software that he has neglected for over a year now. I emailed him back that he had plenty of time to comment on the post before it was scheduled and since he hadn't responded to that post or the 20 others, I moved forward with publishing. We had a conversation a couple months ago about how he didn't want to be a bottleneck with social media posts and he trusted me to publish if he didn't have time to review.\n\nSo this week, after being told by our other colleague that my boss needed final say, I waited for explicit approval before posting memes. Which of course meant that things did not get published. Today, we had a video call scheduled to review the process and give him some training on our task management software.\n\nY'all, I work from home. I took a shower this morning in anticipation of this video call! But he cancelled.\n\nSo I emailed that there were posts waiting for his approval. He started working in the task management software, marking my tasks as done! So I asked him not to do that. He called me because he was confused. (This is why we need a video training session!) He was clearly annoyed, so he said I didn't need to wait for his approval to post on social media.\n\nSmall victory. I'm sure he'll get annoyed in a couple months and ask for more oversight. Then get overwhelmed with work and ask me to not ask him for approval all the time. Endless cycle.",
        "created_utc": 1521222116,
        "upvote_ratio": ""
    },
    {
        "title": "Reminding you to save paper",
        "author": "ludwigavaphwego",
        "url": "https://i.imgur.com/4PjgPLf.jpg",
        "text": "",
        "created_utc": 1521220611,
        "upvote_ratio": ""
    },
    {
        "title": "Won't let me use the bathroom? Fine I will just piss myself in your classroom!",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/84x1qt/wont_let_me_use_the_bathroom_fine_i_will_just/",
        "text": "[deleted]",
        "created_utc": 1521220218,
        "upvote_ratio": ""
    },
    {
        "title": "Make it pop? Sounds like a plan!",
        "author": "Sinomon",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/84wt6n/make_it_pop_sounds_like_a_plan/",
        "text": "So this year my science teacher is pretty bitchy and inconsiderate of how students feel. Constantly losing papers, giving hours of busy work and projects at the most inconvenient times in the year, like right now. She decided to give us a project where we have to make a presentation and write a 4 page paper by the next week. And there will be no class time to complete it. Now here’s where the malicious compliance comes in. She says that she doesn’t want a regular project, she wants it to POP. Ok Mrs. L, looks like you’re getting my paper and powerpoint in hot pink comic sans.",
        "created_utc": 1521218362,
        "upvote_ratio": ""
    },
    {
        "title": "Done with my training boss!",
        "author": "[deleted]",
        "url": "https://i.redd.it/riuk1cypg5m01.jpg",
        "text": "[deleted]",
        "created_utc": 1521216698,
        "upvote_ratio": ""
    },
    {
        "title": "Let's Panic the Child Psychologist!",
        "author": "LurkingLikeFreddy",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/84w4z8/lets_panic_the_child_psychologist/",
        "text": "This is a story my dad, and his mother have gone into detail about and I thought I'd share it.\n\nQuick setup: This takes place in 1969/70 school year.  Both of my grandparents on that side were hardcore scientists (a chemist and an engineer who worked on rockets and missiles for the Army before going to university) so they were very iffy about the dreaded \"pseudo-science psychology\".  My dad inherited this distaste for psychology early on.\n\nStory: Dad was six or seven when they brought a child psychologist into the classroom to test behavior.  My dad was being a \"recalcitrant brat\" because he caught on pretty quick that this was some sort of test that wasn't going to be graded.  Therefore, he was going to troll the psychologist.\n\nOne of the projects they were asked to do was fold a piece of paper horizontally and into three spaces.  On the first section, the students were to draw what they used to be.  The second was what they are now and the third was what they will be.\n\nLogic dictates you draw baby, yourself as you draw yourself now and then either as a grownup or in the job you want to be in.\n\nMy dad drew Frankenstein, having been brought to life in some way, an angel, demonstrating that he was a well-behaved and perfect child, and Dracula, to show what he'd be doing when he was dead.\n\nHe handed this in and the look on the psychologist face was priceless. \n\nAnd so she called my grandmother.  Now, as I said, they were pretty anti-therapy in that household.  Having someone tell her that her child had mental issues was not something she was willing to listen to. (We'll set aside the fact that he is the only person in my family without mental issues.)  She got off the phone and snapped, \"What did you do?\"\n\nHe explained the project, told her it was stupid and that it wasn't being graded, so he wasn't doing it.\n\nGrandma was perfectly fine with that.\n\nThe child psychologist did not come back.",
        "created_utc": 1521213078,
        "upvote_ratio": ""
    },
    {
        "title": "My 7 year old tried pulling a fast one at school today.",
        "author": "Aarinfel",
        "url": "https://imgur.com/JYFLO0E",
        "text": "",
        "created_utc": 1521202917,
        "upvote_ratio": ""
    },
    {
        "title": "Malicious Compliance gets my 14 yo self in the head teachers office",
        "author": "bingshakabingbong",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/84utvi/malicious_compliance_gets_my_14_yo_self_in_the/",
        "text": "When I was 14 at school I was a bit unruly and messed around a little in class. We had double history in the afternoon with a supply teacher, which is basically the worst class you could have (history wasn't my thing, and the supply teachers we had were awful). I'm chatting to my mate. Teacher says 'Ed! Come and move to the front of the class NOW' She's had quite a bit of shit from the other kids in the class so she's at the end of her teather. Then she says 'IF I HEAR A SINGLE WORD FROM YOU FOR THE REST OF THIS CLASS I AM GOING TO CALL DISCIPLINE SUPPORT'. DP YOU UNDERSTAND?? (Discipline support is basically where the teacher can get a senior member of staff to shout at kids that are messing around so it's a pretty bad thing to happen.)\n\nGiven the fact that I was not meant to say anything until the end of the lesson I didn't respond to her question. She then got one of the kids to fetch the headmaster, and he told me off for 'being smart'. To which point I replied 'isn't that what schools are meant to promote'. Needless to say my malicious compliance got me in a lot of shit, my parents weren't too pleased either.",
        "created_utc": 1521201087,
        "upvote_ratio": ""
    },
    {
        "title": "Crosspost from /r/funny",
        "author": "Casanova_Kid",
        "url": "https://imgur.com/JYFLO0E",
        "text": "",
        "created_utc": 1521182949,
        "upvote_ratio": ""
    },
    {
        "title": "This kid and his school work",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/funny/comments/84q37e/my_7_year_old_tried_pulling_a_fast_one_at_school/",
        "text": "[deleted]",
        "created_utc": 1521177004,
        "upvote_ratio": ""
    },
    {
        "title": "So I can't park here, huh?",
        "author": "thisgirlagain",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/84sv8w/so_i_cant_park_here_huh/",
        "text": "This is not my story but my co-worker but it is too good to pass up. \n\n\nI work at an office that does internal work and downstairs is the retail location. It's a decently small 3 story building that houses over 150+ people on rotation shifts. My internal department works from 7 til midnight while the retail downstairs is only open 8-5. \n\nWell my coworker who is a bad ass retired cop (barc from here on out) works with me simply for the health insurance or cause he needs to stay busy more than likely the both. He doesn't really need the job for money sake. Well there are very specific rules that in the parking lot we can not take up the first four rows to leave it for customers until the retail location closes. Well barc has a disability where he can't really walk too far as he is old and was injured on the job when he was a cop. To be kind he always parks as far as he can with out trying meddle in the way of customers. \n\n\nWell this lovely week the retail manager decided that he was tired of seeing barc's car park in the last spot in the fourth row and decided to send a site email saying he will tow the car parked in this spot with a picture of barc's car attached to the email... NOW. Barc is a nice man but being a retired cop he has no patience for BS threats. So after managers approach him telling him to move his car. He went downstairs and drove to the first spot in the parking lot, assigned to handicap, pulled in and made sure that his handicap placard was nice and shiny and displayed proudly. \n\n\nNot a peep was heard from management. And no tow truck was called. He said he was going to park there for a few more days and then move it back to his old spot.",
        "created_utc": 1521174512,
        "upvote_ratio": ""
    },
    {
        "title": "This assignment is easier than expected",
        "author": "Rege21",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/84spxy/this_assignment_is_easier_than_expected/",
        "text": "When I was in 3rd grade, we were given weekly spelling lists of 20 words and accompanying assignments to help us learn how to spell the words as well as their definitions. I disliked spelling lists immensely as the words were not very difficult or useful and the assignments just felt like busywork.\n\nThe assignments were things like filling in blank spaces in sentences with the word that made the most sense or matching words and definitions. One assignment was to write sentences containing the spelling words. We were supposed to write 20 sentences, one for each word,  but the instructions stated that if we could work more than one spelling word into a sentence then we could write less than 20.\n\nHowever, I noticed that the instructions failed to put a limit on how many spelling words we could use in a sentence. So I wrote exactly one sentence that stated: \"My spelling words this week are (*insert all 20 spelling words*)\" and handed in my assignments.\n\nThe next week before getting our new list we received our graded assignments. I received full credit for my one sentence, and then my teacher proceeded to explain to the class that some new rules were being put in place including a limit of three spelling words per sentence and a ban on listing words.",
        "created_utc": 1521172941,
        "upvote_ratio": ""
    },
    {
        "title": "Made me think of you guys",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/funny/comments/84q37e/my_7_year_old_tried_pulling_a_fast_one_at_school/?utm_source=reddit-android",
        "text": "[deleted]",
        "created_utc": 1521171236,
        "upvote_ratio": ""
    },
    {
        "title": "Taking advantage of a poorly worded question on a music History test",
        "author": "HanzoShotFirst",
        "url": "https://i.redd.it/aeee7ew2b1m01.jpg",
        "text": "",
        "created_utc": 1521166366,
        "upvote_ratio": ""
    },
    {
        "title": "My 'take this job and shove it' prank from 1989 - (Big Telco CSR Stories Part II)",
        "author": "gloobnib",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/84rw94/my_take_this_job_and_shove_it_prank_from_1989_big/",
        "text": "[removed]",
        "created_utc": 1521164494,
        "upvote_ratio": ""
    },
    {
        "title": "The table is fine.",
        "author": "TSwizzlesNipples",
        "url": "https://i.imgur.com/nk5KjoI.jpg",
        "text": "",
        "created_utc": 1521153830,
        "upvote_ratio": ""
    },
    {
        "title": "You want real physics? Sure...",
        "author": "dyslexic_fcuk",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/84qist/you_want_real_physics_sure/",
        "text": "This happened more than 20+ years ago but I was thinking about it this morning..\n\nI've been working in the video games industry for a long time and at that time was working on a racing type game for the PlayStation One (PSX). While the PSX was a great little console for its time, the CPU was kinda lackluster as it didn't have floating point and ran at about 33mhz.\n\nAnyway, we had our basic racing physics going (no integration, all fixed point integer math) and created a spreadsheet with some simple fields such as friction, engine power, etc. \nOne of the producers who claimed to be an 'expert' on all things racing came by one day and saw one of the designers fiddle with the numbers. Upon seeing the spreadsheet his eyes lit up and he immediately called a meeting where he insisted that his thorough understanding of racing physics were invaluable to the quality of the game. While I tried to explain to him that a) we didn't have much time left on the project and that b) the physics were bare-bones / not realistic due to the technology, he wasn't having any of it. In fact, tuning the 50+ models were now to be HIS responsibility and he wanted about 20-30 fields added for each model such as tire thread, types of exhaust, etc.\n\nFine.\n\nSo I dutifully added those parameters to the spreadsheet and handed it to him. He spent hours and hours of his time, sometimes until deep in the night tweaking those numbers and playing the game until it felt 'just right'.\n\nFor the remaining couple of weeks on the project, he'd talk to anyone who would listen (not a lot of people) about how his contributions were key to making the difference between a lackluster game and one that would go on to win awards for the most realistic racing game ever!\n\nNow, the thing I forgot to mention was that maybe one or two of those fields were actually hooked up to the game. So while he was changing variables ranging from 0 to 1.0 in tiny increments (rebooting and playing the game each time, even going through the front-end as we gave him a full build to ensure 'everything was as good as it could be'), absolutely NOTHING changed!\n\nAnyway, the game got great reviews and while we had to endure weeks of boasting afterwards, it was worth the additional 10-20 minutes I'd put in knowing he was wasting his time...\n\nEdit: A typo here and there",
        "created_utc": 1521152234,
        "upvote_ratio": ""
    },
    {
        "title": "Who Teaches Spanish in Spanish Class?",
        "author": "SkateTroe",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/84q917/who_teaches_spanish_in_spanish_class/",
        "text": "So, this is a story from some 7 years or so, back in high school Spanish class. The teacher for this particular class was a pretentious a-hole, and very few people liked him. He rode his bicycle to school every day wearing a full skin-tight biker suit like you see on Tour de France. His personality matched this to a T.\n\nWhen he wasn't banning XC runners from drinking water in his class (\"I rode my bike 20 miles today already, what did you do?\" \"Okay everyone, let's put the binkies away.\" etc.), he was teaching us foreign languages. Commonly French. Sometimes Italian. And every so often, he would teach us a little bit of *Spanish.* You see, this was a very civilized fellow who knew all the romance languages but Portuguese. But hey, so does everyone else, right? Right?\n\nSo, hopefully, you can see how this guy got on our nerves. *Constantly.* I learned more French in that class than Spanish because he felt the need to impress a bunch of sophomore boys.\n\nOkay. So. We have a test of some sort--I forget if it was an exam or just a test, but whatever. A test. Conjugating verbs, some vocab mix n' match, and at the end, an essay. Now, we were given the prompt ahead of time so we could practice and make sure we knew the proper vocabulary, and so on, and because our teacher was such a kind-hearted fellow, he allowed us to write our essay in any romance language we like. Y'know, for all those tri-lingual sophomores in middle America.\n\nEnter Alejandro (we'll call him Alejandro. His real name is significantly less Spanish). Alejandro has a brother. His brother...\n\n*...is fluent in Portugese.*\n\nSo, our hero works with his brother to write out an essay, translate it into Portugese, and commit it to memory to be written on the test. If you will recall, this is the *one* romance language our teacher doesn't know. But hey, he said \"Any romance language.\"\n\nMaybe next time, he'll stick to teaching us the subject of the course instead of inflating his own ego.\n\n...but probably not.",
        "created_utc": 1521150063,
        "upvote_ratio": ""
    },
    {
        "title": "Put the computers in the right spot...",
        "author": "Cryno10001",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/84pkqa/put_the_computers_in_the_right_spot/",
        "text": "Im on mobile so I'm sorry I guess\n\nI'll be referring to the teacher as \"he\"\n\nIn school I was the last one in the classroom after school after all the other students had left. During class the teacher is always telling people to put the laptops in the right slot in the laptop cart. Of course nobody listened and just put them in random slots. But of course he (the teacher) sees this and tells me to put them in the right spots.\n\nSo I do and this entire time he is telling me to plug them in correctly to so they were all straight. (He had major OCD). So I plug them in, in the spot to the left. (So 2 was in 1's spot, 3 was in 2's spot and so on). So they were in the RIGHT spot (the spot to the right of the correct one) He never told me to put them in the correct spots while I was doing this. I left and said goodbye. He had 1, and the last spot was open, so he had to move them all one by one to the right.\n\nI didn't like him...\n\nSo.... The next day I have to stay late again because of what I did. So he tells me to put them in the RIGHT spots. So I find the middle of the cart and somehow manage to put all of the computers in the spots to the right. \n\nHe hated me for the rest of the year.",
        "created_utc": 1521144791,
        "upvote_ratio": ""
    },
    {
        "title": "During World War 2, were internment camps common across South America?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/84pkc7/during_world_war_2_were_internment_camps_common/",
        "text": "[removed]",
        "created_utc": 1521144707,
        "upvote_ratio": ""
    },
    {
        "title": "This isn't my account!",
        "author": "mhoke63",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/84nexq/this_isnt_my_account/",
        "text": "I technically work in collections for a large telecommunications provider.  But, it’s very soft collections and I’m “dedicated”, meaning I have a portfolio of accounts that are mine only.  It’s also not for individuals, but state governments.  It’s mostly figuring out what invoices are past due and sending them to the customer.  They typically get paid pretty fast once I do all the legwork.  I work with the same people all the time.  Since they’re state governments, we rarely disconnect for non-payment.  It happens, but not often.  In my 5 years of doing this, I’ve disconnected a total of 3 accounts.  There are also a ton of hoops to jump through just to get it disconnected.  The customers are usually pretty good.  But one customer, we’ll call him Frank, is a handful.  He’s scary if you’ve never worked with him, but once you know how to handle him, you just laugh off all his antics.  Lots of bark, no bite.\n\n\nFrank did not like paying bills.  He seemed to take it as a personal insult to contact him about a past due account.  For this customer, he had a massive account with literally hundreds of phone lines that this account billed long distance to.  The average monthly bill was about $3,000.  About a year prior to the beginning of this story, I contacted him for payment.  After about a month of bill reconciliations and emails back and forth, he finally pays it to a zero balance.  This is rare, especially for this guy.  But I thought, great.  It should be paid monthly now.  I confirmed that we had the right address and he was getting the invoices in the mail.  Wonderful.  We’re good.\n\n\nThree months later, his account pops up on my list again.  I’m wondering why.  I send him an email asking what’s up and if he needs anything from me.  He responds on a huge rant that it “isn’t his account”.  I tell him that he paid it just a few months ago with no issue.   He skirts that issue and says, “We have a different provider.  Whoever set the long distance to you guys was wrong.  We were slammed”.  Slamming is a telecommunications term meaning something added to a customer’s account without their consent.  Now, his local service is with another carrier, but the long distances is set to us.\n\n\nI look further into the account.  It was opened 20 years prior.  I tell him this.  He did not like this.  He demanded to know who ordered the service and who set the order up.  We don’t have records that far back.  I just told him we can’t provide that and since he took responsibility just a few months prior, they’re valid charges.  We end up getting the sales team involved in this.  They read the riot act to him about how they’re valid and we need payment.  He concedes.  After a couple weeks of going back and forth, he went back to his tune of, “this is not my account.  We don’t even use you as a provider.  You need to prove it’s owed”.\n\n\nI did exactly that.  There are about 350 phone numbers on this account.  I went through meticulously ever single phone number and all the usage with those phone numbers.  This took a couple weeks to gather and format together.  I sent this to him in a massive spreadsheet.  Again, he responds, “THIS IS NOT MY RESPONSIBILITY!  THOSE PHONE NUMBERS ARE WITH ANOTHER CARRIER!!  DISCONNECT THIS ACCOUNT RIGHT NOW!”.  Well, we still have a process to go through.  We have to send some letters through the mail, get the sales team involved with the process, and several other things.  It takes a minimum of 4-6 weeks to do.  But, I am doing exactly what he asked me to do, disconnect it.  So, I start going through the process.  He emails me about the letters.  I just say they’re required in the disconnect process.  The account will be disconnected by x date.\n\n\nThis date rolls around.  We shut off everything.  The next day, I get an email from Frank.  “WHY DID YOU DISCONNECT THE LONG DISTANCE?!  WE NEED THESE LINES!  I’M GETTING CALLS FROM ALL OVER THAT THEY CAN’T MAKE LONG DISTANCE CALLS!”.   I referred him to his previous emails telling me to disconnect the service multiple times, his quotes about how they were with another carrier, his complaining about the letters I sent, and his response of, “JUST DISCONNECT IT!”.  I also showed the several times in the emails that this was for long distance service, not the local service, which was with another carrier.  He said he needs the service up again.  But, there’s two big problems.  The first is that it’s disconnected, not just suspended.  A new order will have to be set up.  On top of that, one of the things in the process of disconnection is a hold on their credit.  They have to pay the entire bill before we can order new services from them.  We got a payment and sales was able to get his services up and running again within a few days. \n\n\nThese emails had his boss and my boss copied on them.  His boss forgot to take us off copy when he reamed Frank a new one about all this.  We laughed so hard at this email.  I think Frank kept his job, but man his boss laid into him.\n",
        "created_utc": 1521128574,
        "upvote_ratio": ""
    },
    {
        "title": "Sometimes, you just gotta do what Mom says (xpost r/calvinandhbbes)",
        "author": "buzzbuzz17",
        "url": "https://i.redd.it/ncru9hfebul01.jpg",
        "text": "",
        "created_utc": 1521116129,
        "upvote_ratio": ""
    },
    {
        "title": "Smash Mouth ruined my graduating performance.",
        "author": "great9rejects",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/84l5n9/smash_mouth_ruined_my_graduating_performance/",
        "text": "[removed]",
        "created_utc": 1521105857,
        "upvote_ratio": ""
    },
    {
        "title": "Not sure if MC or just didn't understand",
        "author": "[deleted]",
        "url": "https://i.redd.it/otqct234bwl01.jpg",
        "text": "[deleted]",
        "created_utc": 1521105841,
        "upvote_ratio": ""
    },
    {
        "title": "No one cuts the line? Yes ma’am!",
        "author": "turtlemanTTU",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/84kx7z/no_one_cuts_the_line_yes_maam/",
        "text": "First a little back story.\n\nWhen I was in college I was a bouncer at one of the main college bars. There were 5 bars on the same street right off of campus that got packed on the weekend. Most of the bounces new each other and would let each other cut the line at their bar for the same implied treatment if they had a weekend off. Just to be clear we were only letting 5-6 people cut the line a night. Usually when another bounce came to my door I would just open and let him in, hand him a wrist band, and he would walk away as to not disturb the line.\n\nNow to the story.\n\nOne night I let a bouncer cut the line discreetly as usual except this time someone in line started yelling at me cursing blah blah. I just say that he worked at the bar. This tactic usually works on drunk people who aren’t thinking clearly. The guy apparently was still pissed and told my manger what happened after he got in.\n\n This particular manager was a huge hypocrite, she preached the rules and was always on my ass about having the correct count incase the fire marshall showed up, but on her night off would bring in 15 friends through the back door and tell me to equalize the count i.e. let 15 people out before one could come in. This is a key example of how to piss off a line of people.\n\nSo this night she came up to me and asked why I let this guy cut the line. Obviously she knows who he is and I say he works at such in such bar. She chews my ass out for 5 minutes or so and says “no one fucking cuts the line ever!” I shrug it off and go about my bouncing duty’s. This happens somewhat often people get pissed because they see us let someone in the managers were usually relaxed about it because they got to cut at other bars as well.\n\nWell several weeks later I am at the door again on a Friday night the whole street is packed at least 50 people in line and I see the manager leave the bar across the street. I almost couldn’t stop smiling when I saw it. That bitch walks up to the door doesn’t even acknowledge me and tries to walk in. I calmly put my arm across the door and say “ I’m sorry miss I’m at capacity if you would like to come in you will have to go to the back of the line.” She turns and slurring her speech says to fuck off, she is my manager. I said “yes ma’am that’s true but you aren’t working tonight, and there are no fucking cuts ever.” I can still see the blood start to boil in her head. She starts to chew me out as I am accustomed to from her. Yeah I’m having to bite me inner lip to keep from smiling/laughing. I still have my arm across the door she she can’t walk in and she tell me to go get the MOD (manager on duty) that is working that night. Again calmly I say I’m sorry but I can not leave the door unattended or who knows what could happen, but she is welcome to call the manager. She is so pissed off the vanes in her head are visible she is cursing and throwing a fit. I just go back to checking IDs and giving wrist bands. \n\nFinally the manager walks up and asks me what the fuck I’m doing. I let him know about the “no fucking cuts ever” policy. He kind of puts his fingers on his forehead and shakes his head like Goddammit why is this happening. For some stupid reason the MOD sides with me and told her that rules are rules. He must have been sick of her bullshit too. I had to bite down so hard on my inner lip to keep from laughing I made my lip bleed. The look of surprise and anger on her face was priceless. By now the line died down to maybe 10 people so she shuffles to the back staring daggers at me the whole time.\n\nThis may be the best part she gets to the front of the line and is still very wobbly from drinking heavily. One person leaves and she is about to walk in, and I very politely inform her that she is too intoxicated to come in tonight. She just stood there for what felt like an eternity probably just 15 seconds or so staring at me and mumbled “fuck off”. You could see the defeat in he eyes at this point, and she turned and left without another word.",
        "created_utc": 1521102520,
        "upvote_ratio": ""
    },
    {
        "title": "Malicious Compliance",
        "author": "Stinky_brittany_fart",
        "url": "https://i.redd.it/ncru9hfebul01.jpg",
        "text": "",
        "created_utc": 1521092284,
        "upvote_ratio": ""
    },
    {
        "title": "I want my account reset... ok, if you say so.",
        "author": "LeaveTheMatrix",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/84k3mn/i_want_my_account_reset_ok_if_you_say_so/",
        "text": "This happened a few years ago but...\n\nI work in hosting and occasionally we will get requests from people who want their accounts completely reset as they want to \"start over\". \n\nThere are two ways this can be done: \n\n1. We do a reset. This resets EVERYTHING as if it were new. If there is anything on the account, it will be gone.\n\n2. We just wipe out individual files/database for the specific site they want \"reset\" (not a true reset, just everything website specific removed but don't touch stuff like email)\n\nSo I get this guy asking for a reset and I take a look at his account, while he only had a single domain he had multiple email accounts. \n\nSo per policy I reply back and tell him the difference between the two reset methods and that he would lose everything if he wanted a real reset done. I did specify email would be lost. \n\nHe comes back complaining that I shouldn't be asking questions, that when he says he wants a reset then he wants it done as soon as possible, knows what a reset is and doesn't need it explained, and so on so on. \n\nSo I do the reset as he requests. \n\nHis next message was \"where is the 4GB of email I had saved on the server?\" \n\nFallout:\n\nWell luckily we make full account backups daily, but as he wasn't paying for the backup service he had to pay a bit to get the email restored.",
        "created_utc": 1521091190,
        "upvote_ratio": ""
    },
    {
        "title": "Take Your Class Seriously Much?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/84inx7/take_your_class_seriously_much/",
        "text": "[deleted]",
        "created_utc": 1521076116,
        "upvote_ratio": ""
    },
    {
        "title": "“If you show up late in form class”",
        "author": "ItsOptional_",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/84i5kj/if_you_show_up_late_in_form_class/",
        "text": "Forgive me father for i am on mobile etc etc\n\nSo this happened a while ago but i found this subreddit and decided this might be a good place for it\n\nSo my secondary school (high school) had a teacher in our 4th year (which is practically a year off school here in ireland) who took our roll every morning. For the most part we liked him but he was adamant about upholding the rules to keep the principle off his back.\n\nThis teacher (Mr. C) would come in at the start of the day for 10 minutes following school starting but before classes began and would take the roll and do general announcements and such we called this “form class”.\n\nOne day Mr.C shows up and states that too many people had been coming in late and disturbing classes and form class by showing up halfway through and stated that despite it being fourth year you still had to show up on time and, as he usually did, he made a new rule.\n\n“if you show up late **in form class** you wont be allowed leave the school for lunch (which was the only way any of us really socialised)”\n\nBut as a lazy teenager who would do anything to get out of waking up early, i came up with a workaround; rather than sleeping in for 10 or 20 minutes, getting the second bus to the city and showing up 5 minutes into form class, i would instead sleep in for 30-40 minutes get about the fifth bus and show up halfway through the first class *after* form, then wait till after lunch to tell Mr.C that i was late so that by the time he marked me as such it was too late for him to keep me in at lunch.\n\nI felt kind of bad because Mr.C was a generally cool guy who was just trying to keep the principle off his back, but at the time i was just glad i got an extra 20 minutes of sleep.\n\nAlthough i did feel especially bad when people started to cop on and start doing the same as me, eventually causing form class to only have a 50% attendance while First Class would often have 90%.\n",
        "created_utc": 1521071444,
        "upvote_ratio": ""
    },
    {
        "title": "Having changed record labels, Van Morrison was contractually obliged to produce 36 tracks for his old label. It didn't go well for them.",
        "author": "chochazel",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/84i4f7/having_changed_record_labels_van_morrison_was/",
        "text": "After a pretty unhappy couple of years with his label Bang Records in the mid-60s, Van Morrison wanted out. They demanded he deliver some more short and poppy stuff like Brown Eyed Girl, while he wanted to release 11-minute renditions of lion impersonations (which he did on the album Saint Dominic's Preview.) The singer became so distraught with his label situation, that he slipped into financial trouble and had problems finding gigs.\n\nJust when it seemed Morrison might never deliver on his musical potential, Warner Music stepped in and bought out his deal with Bang Records. There was still one small contractual detail though. Morrison was obliged to record exactly 36 songs for his old label, who would also continue to earn royalties off anything he released for the first year after leaving Bang. Not a patient man at the best of times, Van did the only thing he could think of: he recorded more than 30 songs in a single recording session, on an out-of-tune guitar, about subjects as diverse as ringworm, blowing your nose, a dumb guy named George, and whether he wanted to eat a danish or a sandwich.\n\nhttps://www.youtube.com/watch?v=BgkvlSsZiLQ",
        "created_utc": 1521071167,
        "upvote_ratio": ""
    },
    {
        "title": "“If i catch you coming in late”",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/84i35y/if_i_catch_you_coming_in_late/",
        "text": "[deleted]",
        "created_utc": 1521070842,
        "upvote_ratio": ""
    },
    {
        "title": "Everything... You keep using that word. I do not think it means what you think it means.",
        "author": "Zavarakatranemi",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/84h0z0/everything_you_keep_using_that_word_i_do_not/",
        "text": "Many years ago, I worked for a certain well-known (for all the wrong reasons) service provider as a Feedback Engineer. Every week we would receive thousands of feedback “incidents”, and spam, from multiple sources, in several languages etc.\n\nMy job, on top of keeping an eye out for any spikes, was primarily focused on maintaining the technical side of things (build the data store, fine tune the text processing, machine learning etc.) This included a certain level of security access, as some feedback entry points gathered PII (personal identifiable information) that was also logged in the back end.\n\nSince no one else in the company wanted to learn how to read the data, I was also tasked with sending out a report on “Hot Topics” every Monday morning. I had no desire to do this manually so I just ran a script that gathered the week’s top actionable issues and sent it out to the teams. \n \nThe company was never popular but we were getting slammed back then, so mid-June someone from marketing (we will call him Joffrey) was re-branded Feedback Manager. His second day, Joffrey announced in a group email the equivalent of “it’s the process, not the product” - that it was not our shitty products and services that needed improvement, but the feedback was not gathered, analyzed and presented correctly. \n\nAt first I didn’t take this personally. I figured he was new, and it was only natural to want to go over the process. I shot him an email introducing myself and sharing with him the last several reports, and a simplified version of how everything works in the back end. I also invited him to a 1:1 meeting, to take him over the process in more detail. \n\nHe declined the meeting, and our communication, hardly paraphrased, went something like this:\n\n&gt;Joffrey: I don’t want weekly reports. I want daily reports, and I will send them out to the teams myself. All I want you to do is give me the data. And I don’t want you to summarize anything, I want **everything** we have on each feedback item. **Everything** you get, I want to see it.\n\n&gt;Me: Some data is sensitive and cannot be shared outside of the tool, so it would be easier to request access to the raw data spreadsheets instead. We are also talking about 3-5k messages a week, mostly X,Y and Z related, so what details would you like to report on for each?\n\n&gt;Joffrey: I don’t need access to the tool, I just want to view all the comments. And as I said, I want **everything**. It’s not up to you to decide what is important enough to report, and what isn’t. That is what I’m here for now.\n\n&gt;Me (in disbelief): So just to confirm, you want to receive an actual report with all the raw data for each feedback message we get as it comes in, instead of at least the clusters with only the actionable cells? \n\n&gt;Joffrey: For the last time, you don’t get to decide what is \"actionable\". Yes, I want individual reports on each and every piece of feedback we get, until I feel confident our feedback gathering process works, from start to finish. That is what **everything** means. I am also struggling to understand your reluctance to give me what I have now asked for the 3rd time. It makes me wonder how diligent you have been in properly gathering and reporting this feedback. Please stop cutting corners, and do your job, so I can do mine.\n\nThat last sentence was what got me into malicious compliance mode.\n\nFirst I checked whether Joffrey had set up email alerts on his phone - he had not. Secondly, that Friday was July 4th, and I verified he was taking Wednesday and Thursday off. I expected he would only check his emails Monday morning, around the time the teams would expect to receive the weekly report. Then I spoke to some good friends over at InfoSec who set me up with the permissions I needed to create a new system account and certain rules within my reporting environment. Finally, I spoke to HR to make sure the vacation I had booked several weeks in advance was still logged, and set to work to create the framework for what I had in mind.\n \n* Starting at 00:01 on Wednesday, every inbound feedback we got, spam and non-actionables included, generated an individual report.\n\n* Since Joffrey wanted “everything”, I was not weeding out any of the potential PII, so each report was encrypted and saved on the new, secure dashboard. The dashboard required a unique code, generated along with the report, to access it.\n \n* An alert for each report, with the link to said report and the unique access code, was emailed from a system account only to Joffrey.\n \n* Each alert had “Do Not Forward” permissions, meaning Joffrey would have to manually enter his email and each individual report’s unique 12-digit code on the site for every single report he wanted to read.\n\n* Upon entering the code, the report would automatically download the excel sheet with the raw data to his system. \n  \n* Each sheet had between 100-200 different columns, with [every single piece of information we gathered for each individual feedback item](https://i.imgur.com/XoqZZxw.jpg), regardless of how useful it was.\n \n* Because not all the feedback entry points gathered the same data, there was no standard row for each type of information, meaning Joffrey would have to manually identify which row contained what type of information on each individual report.\n\n* And it was 4th of July week, one of our busiest times of the year.\n\nI would love to have seen his face when he got to the office Monday morning and was greeted by about 5,000 individual feedback reports, on top of any other emails he would have received. I can only imagine what new swear words he invented when he realized he would have to do everything manually.\n\nI say I can only imagine it, because the message that greeted him when he emailed me furious as to what the hell was happening was “Hello, and thank you for your email. I am out of the office until July 14th, for any questions about Consumer Feedback, and for the weekly report, please contact Joffrey at rosechokeslion@got.com“ \n\nTL;DR New manager wants to report everything. I give him everything x 5000.\n\n**Edit:** Commas, not dots.\n\n**Edit prt 2: A few people asked for the fallout of my malicious compliance - there really wasn't any :)** \n\nTo set this up, I had to run it by InfoSec, a team I have been working closely with for years, so they covered for me big time. As an added bonus to the story, when I explained what I needed, my friendly InfoSec manager noted \"you do understand this is an incredibly convoluted and unnecessary process for most of the feedback items, right?\" and I just shrugged and told him \"I serve at the pleasure of the Feedback Manager\".\n\nJoffrey tried to bypass the process and they shut him down hard due to the PII. They also chewed him out for not having the correct security clearance to request, let alone view, that data in the first place.\n\nIT issued a new email for Joffrey, and on Thursday he was very politely asking to meet with me 1:1 so I could explain to him the machine learning process. After our few in-person meetings where I showed him around and helped him get the clearance he needed, he made sure we did not cross paths again unless absolutely necessary, which proves people DO learn from their mistakes after all.\n\nOur director (a hardass with a sense of humor) called me in on Monday, and after he conceded that I did exactly what Joffrey asked, he just said \"You made your point. Don't make it again\" and that was that.\n",
        "created_utc": 1521062079,
        "upvote_ratio": ""
    },
    {
        "title": "One page cheatsheet (Teacher didn't say what size)",
        "author": "thehotshotpilot",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/84fr3u/one_page_cheatsheet_teacher_didnt_say_what_size/",
        "text": "When I was in law school, test formats were generally one of three types: 45% no notes 45% allowed a cheatsheet (of some size rarely fully  open notes) 10% take home test with time limit.\nThe teacher will clearly let you know in advance if it is open notes / cheatsheet or closed notes and will give you parameters. Generally, they say you can have a 8 1/2\" x 11\" (letter sized), legal 8 1/2\" x 14\" or once 11\" x 17\" piece of paper. \nOne professor who was laid back and cool wasn't a dick (but a hard grader) with details and just said one piece of paper. \nOne guy in class went to one of the many butcher shops and got a big piece of butcher paper and copied all of his notes onto this 6ft long piece of 2ft wide butcher paper. Being attorneys and the lack of specificity in the instructions, he was allowed to do that. The professor however was very specific in his instructions in all classes subsequent.  ",
        "created_utc": 1521052474,
        "upvote_ratio": ""
    },
    {
        "title": "We're a Trending Subreddit today!",
        "author": "Not_An_Ambulance",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/84f9w1/were_a_trending_subreddit_today/",
        "text": "If you've not read the rules yet, please take a moment to do so.",
        "created_utc": 1521048986,
        "upvote_ratio": ""
    },
    {
        "title": "Grade 4 journal entry",
        "author": "qmechan",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/84e7hs/grade_4_journal_entry/",
        "text": "When I was 9 I was required to write 250 words a day on pretty much whatever. I had forgotten about the assignment one day and panicked, so I went home and printed off a picture of the Mona Lisa, and cut it into four equal pieces. I pasted it to my paper and wrote “1 picture = 1000 words. This is a quarter of a picture.”\n\nI got full marks with the comment “Ha Ha do not do this again.”",
        "created_utc": 1521041056,
        "upvote_ratio": ""
    },
    {
        "title": "HOA passed a stupid decorating rule.",
        "author": "jaxmagicman",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/84dh4a/hoa_passed_a_stupid_decorating_rule/",
        "text": "Our board was tired of seeing people leave decorations up too long after holidays ended so they passed a rule last July that we could only have decorations up 15 days prior and must be taken down 15 days after a holiday.\n\nSome people might think that rule is ok.  But I like to decorate for halloween on October 1st to have the decorations up all of October.  I don't think that is unreasonable.  And I liked having Christmas up (it was a tradition) on the weekend after Thanksgiving.  Everyone is out for the holiday.  We make a big deal of it.  And we'd take Halloween down the weekend after Halloween and Christmas came down the weekend after New Years.  It isn't up all year.  \n\nWhen they passed this rule, I was livid.  I decided that they never mentioned which holidays we could decorate for so the first thing I did was go out and buy Red, White and Blue lights.  I decorated for the 4th of July and you better believe I left those annoying lights up until July 19th.  \n\nProblem is there really aren't major holidays from July on until October.  BUT the HOA did not say it had to be a major holiday.  After July 19th, I decorated for International Beer day which was on August 4th.  How do you decorate for that?  Well it was the same Red, White and Blue lights up for the 4th of July but I removed the sign that said \"Happy Independence Day\" and replaced it with a sign I made myself that read \"Happy International Beer Day\".\n\nOn August 19th I changed the sign to Happy National Aviation Day.  I kept the same lights up though.\n\nNext was Labor Day.  Yep.  Just changed the sign again.  On  September 19th I started celebrating Rosh Hashanah.  Because again, they never indicated which holidays we could decorate for. \n\nI removed the Happy Rosh Hashanah on October 1st and changed it to Happy Sukkot. But I went all out for that.  I created a Booth out of my halloween casket decorations and put little figures (taken from my halloween decorations) into them.  \n\nI kept his up over the holidays where I started with Veterans day after halloween and then went to Thanksgiving and Hanukkah.\n\nThey board met March 8th, and they tried to pass a rule saying which holidays we could decorate for, BUT they couldn't get the vote when they tried to just include, New Years, Valentines, 4th of July, Halloween and Christmas.  They didn't include any Jewish Holidays and our Jewish neighbors didn't like that.  They didn't include any non-christian holidays like Ramadan and a lot of people voiced their displeasure with that.  \n\nSo they are going to meet again on April 10th and I think they are just going to change the rule to make decorations come down for the holidays in a reasonable time and not put restrictions on when we can start. ",
        "created_utc": 1521035085,
        "upvote_ratio": ""
    },
    {
        "title": "To queue or not to queue? That is the question...",
        "author": "Kinglens311",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/84d7el/to_queue_or_not_to_queue_that_is_the_question/?utm_source=ifttt",
        "text": "",
        "created_utc": 1521033972,
        "upvote_ratio": ""
    },
    {
        "title": "To queue or not to queue? That is the question...",
        "author": "twows995",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/84d7el/to_queue_or_not_to_queue_that_is_the_question/",
        "text": "Note: Since this happened a few months ago, the dialogue may not be word-for-word, but it's still fairly accurate.\n\nOver Christmas, I did some work at a local retail store, one that mainly sold clothes, shoes and accessories. Since it was Christmas Eve, and late afternoon, it was very busy. Going up to the till, we had put temporary barriers to direct the queue to help keep things more organised.\n\nI was on the till, and I was scanning some items that this young man wanted to buy, but there was this bitch of a woman who pushed her way to the front of the line.\n\n\"Excuse me ma'am, you're going to have to wait at the back of the line.\"\n\n\"Well, I'm in a rush and if I don't get this pair of trainers for my son, then you'll have ruined his Christmas.\"\n\n....Bitch please, we're open all day, it's not my fault you're in a rush because you couldn't be bothered to manage your time better and come in earlier....\n\n\"I'm sorry, but you'll have to queue like everyone else. I'm not going to serve you unless you queue.\"\n\nI then carry on scanning the young mans items as she leaves, hopefully not coming back. But, oh no, she comes back with my manager.\n\n\"[Twows995], this woman has complained, saying you were very rude to her. We're going to have to give you a disciplinary warning.\" Baring in mind, it's policy that unless the complaint is proven wrong, then it automatically results in a disciplinary action.\n\n\"I only asked her to queue like everyone else. I mean, these barriers make it pretty clear.\"\n\n\"No, I want customers to feel welcomed here, and you we're not treating her with respect. Finish your shift and I'd like you to see me in my office at the end.\"\n\nWhen he goes off, I can see the customers at the front of the queue laughing in shock, because they had already seen that woman and what she had said.\n\nI move out from behind the till, and move the temporary barriers to the side of the store. They're fairly light and there was only a few, so didn't take too long. I also ask those in the queue to not queue in an orderly line, and essentially to wait as if you were at a bar. I then carried on serving people, who were now in a sort of crowed around the till. Several minutes later, my manager notices all the barriers have been moved and that all the customers who were once queuing are now in a crowd around the till.\n\n\"What's happening here, twows995?\"\n\n\"Well after I got a disciplinary action for enforcing queuing, I didn't think you wanted the queue anymore.\"\n\n\"Are you serious? How about stop being a smart arse and thinking it's 'clever' to listen to everything I tell you exactly? Go to my office now, I'm suspending you with immediate effect.\"\n\nI then got a weeks' suspension, but after some of my colleagues heard of what happened, I got quite a bit of support from them.\n\n",
        "created_utc": 1521032579,
        "upvote_ratio": ""
    },
    {
        "title": "tet",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/84cdby/tet/",
        "text": "[removed]",
        "created_utc": 1521023662,
        "upvote_ratio": ""
    },
    {
        "title": "#2 Sandeep Maheshwari motivational video that will grow your willpower",
        "author": "jagsirsidhu",
        "url": "https://www.youtube.com/attribution_link?a=x4I-Q-QTOJM&amp;u=%2Fwatch%3Fv%3DogrGhXgVHYg%26feature%3Dshare",
        "text": "",
        "created_utc": 1521013148,
        "upvote_ratio": ""
    },
    {
        "title": "Comcast refused to complete my cable installation unless I let them install their horrible bloatware on my PC...",
        "author": "dusmeyedin",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/84bkk9/comcast_refused_to_complete_my_cable_installation/",
        "text": "This happened circa 2010, so maybe their corporate practice has changed. But perhaps not.\n\nI moved to a new address, and duly called up the only cable provider in the area (Comcast, of upvoted swastika fame). They sent out a guy in a van to install my cable internet service.\n\nBefore he left, he said he had to install Comcast's \"proprietary software\" on one of my PCs, otherwise Comcast wouldn't let him close out the ticket.\n\nFortunately, I had prepared for this. I have many PCs and computers, all running the relevant Windows or Apple OS. But I kept one special computer running Linux.\n\nI ushered the Comcast tech to this computer and said \"this is the only one I have right now, I'm afraid.\"\n\nHe worked on it for about 5 minutes and then gave up. \"I got a personal laptop in my van,\" he said. \"I'll just install the Comcast thing on that and we'll call it a day, okay?\"\n\nOkay by me, Comcast service guy. Okay by me.",
        "created_utc": 1521012825,
        "upvote_ratio": ""
    },
    {
        "title": "NOT VALID UNLESS SIGNED",
        "author": "CEPTyler",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/84b11h/not_valid_unless_signed/",
        "text": "In high school I worked the front desk of a super 8 motel. The area  I lived in was a heavily travled tourist area. There were many times our rooms would sell out. This particular weekend was graduation week for the high schools and local University. When I came on to my shift at 4pm our 100 room motel had only 4 rooms available that quickly sold out. Once the motel was sold out, my job was pretty easy. All I had to do was check in guest who already had a reservation and explain to the occasional foreign tourist that \"no vacancy\" ment we were sold out of rooms. During this time period, Super 8 was running a company wide website promotion where the first 888 people to book online every day we're got an $8.88 room. A huge family of about 15 people walked into the motel and a man with the group informs me he has 5 rooms reserved. I pull up the reservations and see one room at the promotional $8.88, and the other 4 rooms for $79.99. I gather his ID and confirm his information. The guy instantly gets pissed when I inform him of the price of the rooms. He yells before I can say anything and is demanding to speak to a manager as he was \"garenteed\" to have 5 rooms for $8.88. I politely explain to the man that I am the only employee on duty and the $8.88 room rate is a special promotion that only applies to one room. I further explained to him how lucky he was to score the promotional rate as there are a finite amount throughout the country and they sell out quickly. The man continued to scream at me, then his wife also begins to yells at me. I sat there calmly trying to defuse the situation while another family member began calling around to other hotels to \"get a better rate\". The whole family finally stepped outside and informed me they were going to call \"corporate\" and I was going to be fired. After about 15 the man walked back into the motel and conseeded  he would just pay for the rooms and implied the \"extra\" money would be taken out of my paycheck when corporate found out what I did to his room rates. He threw his credit card on the counter and it bounced behind my computer monitor causing me to have to unplug the monitor, move it out of the way, and dig through a mess of dusty cords to get it. Once I managed to get his credit card I saw on the signature line he had written \"SEE ID\" in big bold letters taking up the whole panel. I then told him I'm sorry sir, but this card isn't valid, I cannot accept this as payment. He immediately started screaming again \"HOW THE FUCK WOULD YOU KNOW THAT!!! YOU DIDN'T EVEN SWIPE IT, YOU'RE A FUCKING MORON!!!\" I then calmly showed the man that the back of his card said \"AUTHORIZED SIGNATURE REQUIRED- NOT VALID UNLESS SIGNED.” The man then proceeded to inform me where I could stick my head and yelled \"cancel the rooms\" as he left the lobby. After he left I was able to sell the empty rooms in about 2 hours for over $150 each. The family did return to the hotel about 4 hours later and the wife came in asking about empty rooms ( I think she thought I wouldnt reconize her) and I was happy to inform her we were sold out. The guy did call and complain about me the next day to management, but they didn't care because I sold the rooms for over double what the guy would have paid. I'm sure the family ended up having to drive 2 hours away to get a room in the next big city due to everywhere being sold out.",
        "created_utc": 1521005804,
        "upvote_ratio": ""
    },
    {
        "title": "Metrics - You get what you measure!",
        "author": "gloobnib",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/84a4n3/metrics_you_get_what_you_measure/",
        "text": "This is *really* long, but it represents my crowning professional achievement in the Malicious Compliance department; I felt it best to keep the story intact and include each step of escalating Malicious Compliance.  TL;DR at the bottom.\n\nBack in the ~~early 90’s~~ 1989 I worked for a Very Large Telephone Company as a Customer Support Representative (CSR) in their billing call center.  My first day after completing the required two weeks of training I received 4 customer commendations (The customer had to call back after we were through, ask for a supervisor, and say that I deserved to be commended).  I received a total of 12 commendations in my first week on the job.  This was unheard of; most CSRs got maybe 2-3 a month.  Not bragging, just stating that I was good at the job and at only 18 years old, I really liked getting the positive attention for doing my job well.\n\nSo my 30 day evaluation rolls around and my supervisor takes me aside and the conversation goes something like this (I will be G, SV will be my supervisor):\n\n* SV: “Gloob, you’ve received over 20 customer commendations in your first month.  That is outstanding! ...  Your attendance is perfect… You have never been late coming back from your breaks.”  She then shows me a printout with a several columns of numbers (metrics), but with one of mine circled in red.  “There’s only one problem.  You are spending too much time in ‘work state’”\n\n* G: “Uh, OK.  What is ‘work state’ and why is that bad?”\n\n* SV: “Work state is when you make yourself unavailable for calls.  You are only supposed to use it for restroom breaks or when the customer terminates the call before you can complete your work.  It says here you are averaging over 70 seconds of Work State on every call.  That number should never be any higher than 20 seconds.”\n\n* G: “Oh.  Well, the reason why is that once I understand the customer’s problem and we agree upon a solution, I thank the customer for calling and then make myself unavailable while I do all the computer work needed to fix their problem.” \n\n* SV: “Well, see we can’t have your metric so far outside the realm of what every other CSR does.  Just keep the customer on the line while you do the updates so that this metric looks as good as your other metrics!”\n\n* G: “That doesn’t make any sense.  The customers really appreciate that I am able to quickly understand their problems and am able to get them fixed quickly.  You are asking me to take up more of their time when it isn’t needed”.\n\n* SV: “I know sweetie, but please, I don’t like having to explain to my boss why your metric is so outside the norm”.\n\n* G: &lt;starting a slow burn inside&gt; “Yeah, ok I guess”.\n\nFor the next 30 days, I kept the customer on the line while I completed every aspect of the call.  I would then thank the customer, hang up, and then place myself into work state *doing absolutely nothing but staring at the second hand of my watch* for exactly 20 seconds.    Then I would take the next call.  \n\nFast forward to my monthly review at 60 days…\n\n* SV: “Gloob, I see that your Work State number is now 20 seconds, which is good.  But see this number here?  You can see that your average call time is now just over 310 seconds.  We really don’t want to see that number above 300 seconds…”\n\n* G: &lt;seething at the lunacy&gt; “You told me not to let the customer hang up until I was finished doing the work.”\n\n* SV: “I know, but see if you can maybe work a little bit faster?  Its only 10 seconds per call, I *know* you can do it! &lt;smile&gt;”\n\n* G: &lt;Fine.  You want 300 seconds, I’ll give you 300 seconds&gt; \"Yes, I will make sure that number is not more than 300 next month”\n\n* SV: “That’s the spirit”\n\nFor the next 30 days, I made sure that every single one of my calls took up EXACTLY 5 minutes.  As in if the customer just needed to be transferred to another department, I would put them on hold for 4 minutes and 45 seconds, then come back on the line and say “transferring you now”.  I kept a stopwatch with a ‘lap’ timer setup so that I would know exactly when my 5 minutes were up.  Then I would go into work state for 20 seconds.  Then I would take the next call.\n\nTime for the 90 day review:\n\n* SV: “OK, I’m not sure what exactly is happening here, but I see your productivity is really starting to plummet and we’ve noticed you haven’t had a commendation in over a month.”\n\n* G: “I’m not sure I understand.  My work state and my average call handling time are both within the expected values.  I can see that you track the number of calls each day as well.  What is the expected range for that metric?’\n\n* SV: Gets a strange look on her face.  Realization is dawning.  “We want to see everyone averaging at least 100 calls a day”.\n\n* G: “But I’m averaging close 110.  What is the problem?”\n\n* SV: “In your first 2 months you were taking over 130 calls a day…”\n\n* G: “But I’m still within your expected metrics, correct?”\n\n* SV:  “Yes.  But we already know you can do better!”  \n\n* G:  &lt;slow burn continues&gt; “OK, maybe I don’t understand how this is calculated.  Are *all* calls included in all metrics?”\n\n* SV: “Actually, no.  If a call lasts under 15 seconds, we assume it is a transfer or escalation and it doesn’t get included in either your work state or average call times.  But it is still included in the total calls metric.  That’s why it seems like we are asking you to take more calls in a day than is possible; the transfers don’t take any time to complete but still get included in your total calls”.\n\n* G: “OK.  I will see what I can do to increase my total calls per day”.\n\n\nSo, for the next 30 days, same drill as last month: Every call takes me EXACTLY 5 minutes to complete, followed by 20 seconds in work state.  Only now I kept a notepad next to me and kept tick marks for every call I handled.  When I got to my ‘expected’ 100 calls for the day, every single call that came in after that, I would immediately transfer to the ‘supervisor escalation line’, not even bothering to ask the customer for their phone number or *why* they were calling.  The line was supposed to be reserved for irate customers or other issues that were beyond our authority to deal with, but unless I logged into the customers’ accounts, the supervisors had no way to tell who escalated the call.  \n\nI did this exactly 100 times each day at the end of my shift.  When I got to 100 of these calls, I logged out of the ACD (call tracking system) and would go hide in the bathroom or breakroom for about 20-30 minutes until the end of my shift.\n\n\nAt my next evaluation (day 120), it was my supervisor and the VP for the entire call center (3 levels up) who were at the table.  They had the ‘metrics’ sheets for each of the last 4 months spread out in front of them.  They handed a copy to me.\n\n* VP: “S has informed me of the previous conversations you’ve had with her.  She also informs me that every time you discussed a specific metric, the next month that metric would be exactly the minimum number required.  Nothing more, nothing less.  She also informed me that at your last meeting you were requested to increase your average number of calls per day.”\n\n* G: “That is correct.  Did I not achieve the goal this month?”\n\n* VP: &lt;losing patience&gt; “You EXACTLY DOUBLED the number of calls to 200per day.  Nobody has *ever* taken 200 calls in a day, let alone average that over a full month.  In fact, I had the IT staff go back and pull the metrics for the last two months.  Not only are your averages for each metric EXACTLY the minimum acceptable value, EVERY SINGLE DAY IS EXACTLY THAT VALUE!  ….  That is simply not POSSIBLE.  I believe you have somehow hacked into our ACD system and have modified the tracking entries for yourself”\n\n* G: &lt;impressed that they assume I have l33t h@x0r $x!LL$, but feigning ignorance&gt; “I’ve not falsified any records.  You guys asked me to focus on specific metrics, and I did.  I don’t see what everyone is so upset about”\n\n* S: “Gloob, I’m honestly not sure this is going to work out.  Aren’t you happy?”\n\n* G: “Honestly? Not really since we started focusing on metrics…”\n\n\nSorry, this is too long already.  I’ll leave out the drama over the ACD vendor (Rockwell/Collins) having to fly someone in to try to find out how I was “hacking” their system to do this (in the “popular culture” sense of the word), their threats of termination, the ultimate involvement of our union steward or the final ‘screw you’ I left behind on my last day.  ~~(On second thought, THAT deserves its own post!)~~  The mods deleted my follow up in this sub, so reposted over to /r/pettyrevenge [That story is located here](https://www.reddit.com/r/pettyrevenge/comments/855vdc/my_take_this_job_and_shove_it_prank_from_1989_big/?ref=share&amp;ref_source=link)   \n\nAnyway, I lasted about 4 weeks after that.  Just enough time for me to start looking for another job and for me to give my 2 weeks’ notice once I found it.\n\nI’ve matured significantly since I had this job.  Honestly I now feel bad for just about everyone, including the customers that I undoubtedly pissed off there at the end.  But I never forgot a very important business lesson that I still use when managing employees today:  You get what you measure.  But are you measuring the right things?\n\nTL;DR -   As a telephone CSR, I went from being the rookie all-star that the customers loved to a jaded malicious-compliance asshole in 4 short months.  All because of a misguided focus on BS ‘metrics’ and not on the most important metric of customer satisfaction.\n",
        "created_utc": 1520996358,
        "upvote_ratio": ""
    },
    {
        "title": "Work ethic 10/10",
        "author": "Sleepingtuba",
        "url": "https://i.redd.it/dtnqitz8xll01.jpg",
        "text": "",
        "created_utc": 1520980114,
        "upvote_ratio": ""
    },
    {
        "title": "\"Your cheat sheet must be on notebook paper\"",
        "author": "joel1A4",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/847gvc/your_cheat_sheet_must_be_on_notebook_paper/",
        "text": "In 8th grade I was taking a civics class. At the end of the class there was a 200 question final exam which was spread across 2 days. The teacher said we were allowed to have a single page, front and back, cheat sheet. I didn't feel like copying our entire study guide by hand so I asked if I could print my cheat sheet. The teacher responded with \"It has to be on notebook paper.\" So me, being a smartass, copy and pasted the whole 10 page study guide into word, made the font as small as our printer could handle, and printed it out on a piece of notebook paper. It was a struggle to get the printer avoid the binder holes but overall easier than copying it by hand. \n\nI showed up for the first day of the test with a magnifying glass and this piece of notebook paper completely filled with 5 columns of barely legible text. She noticed immediately that I was using a magnifying glass to read my study guide and came to look. She said \"I told you that you couldn't print it.\" I responded by telling her she had only said that it had to be on notebook paper, which it in fact was. This was backed up by several others in the class who heard the original conversation. She was not happy but let me keep it for that day. The second day of the test she refused to let me use it. I had already finished most of the test the first day though so it didn't really matter that much.",
        "created_utc": 1520973601,
        "upvote_ratio": ""
    },
    {
        "title": "Returning the cat",
        "author": "Cranky_And_Old",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/8476lv/returning_the_cat/",
        "text": "When my dad was in college, he and his roommates basically adopted a huge alley cat named Virgil, and would take care of him. Virgil was treated as dog. He loved Virgil, and he usually hates cats.\n\nThey would also let him go outside and continue to be an alley cat, they just fed him.\n\nSomehow (not sure on the details) the ASPCA (or some equivalent) get involved and began sending them letters saying that Virgil needs to be spayed and neutered. Eventually they sent a final letter saying if my dad and his buddies didn't take Virgil to get neutered, then the ASPCA would be forced to take Virgil from them.\n\nSo right after they got the letter, Virgil got hit by a garbage truck and was killed. So my dad and his buddies gathered Virgil up, put him in a large box, and brought him to the ASPCA office and explained, \"He's broken. You can have him now.\" \n\nThus the ASPCA got what they wanted and my dad got a super fucked up story. ",
        "created_utc": 1520970998,
        "upvote_ratio": ""
    },
    {
        "title": "So you want us to look NICE? Okay then. Rules are rules.",
        "author": "PFC_TubeEar",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/8475h9/so_you_want_us_to_look_nice_okay_then_rules_are/",
        "text": "Hello MC. Long time listener, first time caller.  I’m hopping on the “school regulations” train here. This malicious compliance started about 8 years ago in the first few weeks of my senior year at Blah Blah High School.  To date, this is the proudest accomplishment of my friend’s high school careers and mine.\n\nYou could say that we were good kids mostly.  Middle of the high school caste system, decent grades, involved in a range of extracurriculars, broad mash of cliques, etc.…a solid crew. Now, the previous year’s senior prank was taken way too far. It was more along the lines of absolute destruction. Long story short, it involved a *LOT* of spray paint vandalism and honey and syrup in the hallways. It pissed off everyone, most of all the administration obviously. But we loved our school. So not wanting to follow in their footsteps, we set out to come up with a plan within the rules (both life and school) and still unforgettable…i.e. malicious compliance in its purest. The administration had brought the hammer down on all tomfoolery since the previous year’s stunt though, so we needed to be in accordance to our newly revised, much more lame, “BLAH BLAH HIGH SCHOOL STUDENT MANUAL”. \n\t\nFor a public school, we had a pretty strict dress code. We were allowed to wear any shoes, any bookbag, and conservative necklaces, rings, and other jewelry. Those were our freedoms. Other than that, it was strictly khaki bottoms, navy or white polos tucked in with a belt, school IDs on the left collar, short hair for guys, and the optional solid color jackets, but not pullovers unless they were the same color as our uniform shirts. People would try to get away with what they could to match their style, but there was not much wiggle room…. you would think. Slowly but surely, we all casually questioned administration about the BBHS Student Manual’s Uniform Guidelines.  \n\n“What kind of jewelry can we wear?”\n\n“Nothing gaudy,” they said.  “It has to look nice.” \n\n“We could wear *ANY* shoes? *ANY* bookbag?”\n\n“Sure, as long as it looks nice.”\n\n“What about our pullovers? Why do they have to be the same color as our shirts?”\n\n“Because it looks nice.”\n\n“Could we wear button down oxford shirts instead of polos? They look more nice.”\n\n“Of course, that sure would look nice.”\n\nNICE.\n\n\nThus began what we maliciously dubbed, “Casual Thursdays”. \n…The Thursdays were anything but. \n\nWe showed up turning heads. The most dapper looking crew to walk the halls of BBHS. Fresh pressed white oxford shirts with a nice “necklace” tie, nice and tight, complimented with solid navy argyle “pullover” sweater vests. Our khaki bottoms were heavily starched dark slacks with a dress belt.  Did you know the ladies could get pantsuit skirt bottoms in khaki too? We had our nice dress shoes, dress boots, and heels shined so well you could see yourself in them.  The guys had their hair nice and slicked. The gals wore their tightly bound business buns. Our books were brought in briefcases, leather bound shoulder bags, and laptop bags. Sure, a business blazer counts as a solid color jacket. We were beautiful. \n\nThere was not a thing that we didn’t modify, and not a rule that was out of line. We were in complete regulation. Casual Thursday then spread like a wildfire. In no more than a month we had everyone, in every clique, every club, every sport, every high school walk of life, donning their Sundays best on Thursdays. They brought fresh ideas to the mix too. Wearing bright rainbow ties, shoes, and bags. Teams would match school colors on game days. Some would find the flashiest watches, rings, and necklaces. Some would switch to bowties, taped glasses, and pocket protectors to look nerdy as they could. One kid handed out a bulk supply of badge holders that made your School ID look like an FBI badge hanging on your pocket.\n\nWe knew it couldn’t last. We would have our fun, but there was no way administration was going to let us completely mock the blessed handbook, especially when it became as popular and fashionable as it did. We were waiting on the day it had to be called off. The best, and most shocking, part about it though was that they loved it! What started out as a maliciously compliant middle finger to the man, turned into a rule shaking triumph over them in a way that brought the whole school together. It was a fun way for anyone and everyone to have a weekly break from the depressing and confusing period of life that is high school.  Even some of the teachers played along as well.  At the end of the day, we were making the school look classier. Although maybe not as wildly as that first year, casual Thursday became a Blah Blah High School Tradition for years to come.\n\nWe really did look Nice.\n\n**TL;DR**: The administration buckled down on our dress code. We followed every rule in the handbook and turned our hallways into nice ol'fashioned swagger.",
        "created_utc": 1520970750,
        "upvote_ratio": ""
    },
    {
        "title": "Would have been even funnier if I tweeted the post he commented on",
        "author": "[deleted]",
        "url": "https://twitter.com/Ketchups92/status/973358496052891648/photo/1",
        "text": "[deleted]",
        "created_utc": 1520965561,
        "upvote_ratio": ""
    },
    {
        "title": "Does it count if I malicious made someone else comply?",
        "author": "taustinoc",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/846aai/does_it_count_if_i_malicious_made_someone_else/",
        "text": "When I was in high school, I was an honor roll student with basically no effort whatsoever, because I was smarter than most of the teachers. (This isn't a brag; my shoes were smarter than most of the teachers. It was a farm community, and most of the kids didn't need to know much more than how to pound corn seeds into the ground with a hammer and hope it grows. There were maybe three academically inclined students in the entire school, and we were all straight A students.)\n\nSo, basically, I was very bored most of the time. And idle hands, etc. Yeah, I was a bit of a troublemaker. One of the ways I minimized the amount of trouble I got into was joining the yearbook staff as a photographer. The darkroom class didn't get a whole lot of supervision, though, so we . . . goofed off a lot when things were slow. Sometimes to the detriment of the neighboring classes.\n\nSo, we got into trouble one day, all of us, and sent to the office, where we were grilled by the principal, but nobody would spill the beans. The principal was an ass with the IQ of a mushroom (big mistake was not separating us), but he had one trick he'd mastered. He had a low, gravelly voice, and he'd speak with a very low volume, so you had to really listen closely to hear what he was saying. Kind of a childish head game, but it work pretty well for him.\n\nProblem was,  I have a well documented (by that school, in fact) hearing loss in one ear. So when he started playing that game with me, I turned so he was on that side, and literally couldn't hear what he was saying. Made him repeat everything several times (while everyone else was trying not to laugh). He realized what I was doing, and moved to my other side. And I turned, keeping him on the half-deaf side, and making him repeat everything he said. I ran rings around him (in the head game department) by making him literally run rings around me. Eventually, he gave up, yelled at us a bit, and (realizing they'd already spent the deposit money on the yearbooks that couldn't be delivered if he expelled the entire darkroom class) told us to behave. There were no further consequences, though we did tone it down a bit after that.\n\nBut he never played that stupid game with *me* again.",
        "created_utc": 1520964381,
        "upvote_ratio": ""
    },
    {
        "title": "The Highschool Trench Coat Story",
        "author": "thefreakychild",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/845z69/the_highschool_trench_coat_story/",
        "text": "A recent post about a bookbag policy in response to the Columbime High School tragedy reminded me of this story from when I was in high school at the time of the shooting.\n\nKeep in mind that this was from when I was in high school back in 99, almost 20 years ago..   I like to think that I'm completely different now and that my actions, as callus as they appear, were (to me) born of what I saw as a stupid reactionary policy change that seemed to target me specifically...\n\nI lived in Georgia at that time and was the 'oh so goth' try hard type of guy.... \nI had, months before the Columbine shooting began wearing a black leather trenchcoat to school...  I never once had anything said to me by teachers, or administration...\nI wore it the day of the shooting as well...  I didn't have a TV and I didn't care about news radio, I would just hole up in my room after school listening to CDs and be a sulky teenager..  my mother worked a lot then, and I was basically self sufficient to the point that she and I wouldn't even need to see each other for days at a time.... so I was just simply unaware about what happened.  The next day, a Wednesday, I went to school in that trench coat...  \n\nI remember, as soon as I walked in from the parking lot, everyone just kind of stopping and starting at me...\n\nIt took just a couple minutes for the principal to come and all but tackle me to the ground...  Of course,  I was searched, my car was searched, my locker, my bag, everything.. nothing was found, of course..\n\nNow comes the part of malicious compliance, cause I was a principled little fuck and I think what they did was pretty overboard for the situation, especially after I repeatedly told them I had no idea and of course I wouldn't have worn that coat if I had known... As, obviously, this was the first I was hearing about the shooting.\n\n I was given a week's suspension for wearing the trench coat... While I was gone, a dress code update was put into place that no black trench coats were to be allowed....\n\nSo, when I went back to school, I changed to an old army surplus green trench coat.... Took a day or two for the written policy to just say 'no trench coats'.\nIt was also changed to say that shirts must be tucked in.\n\nSo,  after that, I went to school wearing a set of surplus military camo fatigues, with the top tucked in, of course....\n\nA couple of days later, an announcement that no camo would be acceptable per the new dress code...\n\nThis, of course, offended basically half of the entire school who would regularly wear Realtree type hunting camo jackets and pants, cause it is the South after all..\n\nIt took about a week for the camo part to be rescinded from the dress code after I had, unintentionally, caused a minor uprising in the school over it..  by the end of that week, nearly half the students took it upon themselves to wear some type of camoflauge clothing...\n\nSo, yeah...  \n\nLooking back on it, I was being an asshole over something that I could have just let go and not escalated, but the initial week's suspension for the first infraction pissed me offf..\n\nEDIT: corrected a misspelled word I saw on a reread.\n",
        "created_utc": 1520962066,
        "upvote_ratio": ""
    },
    {
        "title": "Malicious compliance is a thing in the army also, especially when your squad leader is a cock",
        "author": "Sortofachemist",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/845ner/malicious_compliance_is_a_thing_in_the_army_also/",
        "text": "I've been out of the army a few years now and I have to say, I don't miss it one bit and cannot fathom why anyone would.\n\nHere is a bit of background to lay the foundation of hate I had for this squad leader who we will call, ssg cockbag.  I was an infantryman and with that job comes a lot of meathead mentality.  You're a pussy if you get hurt and go get checked out.  Pussy if you can't run 2 miles in under 13 minutes.  Blah blah blah, everything makes you a pussy.  SSG cockbag took this mentality to a whole new level.  He went to special forces selection and made it to the end, they don't kick you out they make people quit, but was \"psych dropped\" which means that he was a shit team player and not mentally stable/fit for that sort of work.  SSG cockbag then comes to my squad, weapons squad.  We carry the m240b machine guns, Carl gustav, at4, etc...  The heavy stuff.\n\nFast forward a couple months and we have a competition in our battalion between all of the weapon squad gun teams, the two man teams that operate the 240s.  I was on one of those teams.  There were about 25 teams that competed that day and it was a fucking ball buster.  Started with running in our full kit (body armor, helmet, etc), 50lb rucksack, the 240 itself (27.6lbs), spare barrel, and tripod (11.4 for the tripod and I think like 5 for the barrel) 2 miles to the machine gun range.  Once at the range we did buddy drags, bound for a few hundred meters, casevac, a bunch of physically demanding shit.  Once done you grab all your shit and run the two miles back to the finish.  We finished in second place.  Guys in our company we're congratulating us and saying we did great, proud of us, all that shit.  Then SSG cockbag comes up to is screaming that we should have put out more (we put everything we dad into it, we we're so smoked we could barely stand).  He screams at us telling us what shit bags we are for a solid 10 minutes in front of the whole company.  \n\nThat's how everything went with this guy.  In the field he would sit in the vehicle with the heat running while we laid in snow, the rest of the platoon cozy in their vehicles.  In sub zero temperatures he had 5 if us share a tarp instead of getting to use our sleeping bags.  Seriously, fuck this guy.\n\nOne day Jesus looked down upon me and my squad and said you know what motherfuckers?  I got your back.   And not 2 seconds later SSG cockbag throws his Camelback at me and tells me to fill it up.  Well Roger that big sarg!  Went to the tree line and pissed in it, then topped it off with water from a puddle.  We go out on a \"patrol\" (this was training) and when he takes his first sip from that piss bag I saw the rage in his eyes.  He knew what I did.  He couldn't prove it.  He went thirsty for the next ten hours.\n\nTldr, my squad leader told me to fill his Camelback.  I filled it, with my urine and puddle water.\n\n",
        "created_utc": 1520959693,
        "upvote_ratio": ""
    },
    {
        "title": "Historical Example from 1880s Siam",
        "author": "leftovers_and_chill",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/845kjg/historical_example_from_1880s_siam/",
        "text": "[removed]",
        "created_utc": 1520959117,
        "upvote_ratio": ""
    },
    {
        "title": "Did you make chocolate chip cookies? Yes, I did.",
        "author": "Mesoposty",
        "url": "https://i.redd.it/k452xo4g0kl01.jpg",
        "text": "",
        "created_utc": 1520957017,
        "upvote_ratio": ""
    },
    {
        "title": "Was wrongfully terminated for not phoning in to work to notify of illness and they required an appeal to be sent in writing. Coughed all over the letter to infect the HR manager who fired me...",
        "author": "Voyager87",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/84519q/was_wrongfully_terminated_for_not_phoning_in_to/",
        "text": "I came down with a bad case of a cold/vomiting/fever whilst working at a pharmaceutical company. I woke up and vomited and then phoned into work to inform the company of my absence and the receptionist failed to pass this on to the team leader. Upon returning to work a few days later informing them each day of the absence I was met by the HR manager and dismissed on the spot for \"failure to notify of absence\" and told I could appeal in writing, not by email. \n\nHaving set my phone to automatically record all the calls I had the calls I made to made to reception on file and I burned them to a CD and wrote a letter explaining the situation which I hand delivered even though I held little hope of reinstatement.\n\nI coughed dozens of times over the letter and envelope before handing over the letter to the HR director who fired me...\n\nI hope he has a nice week.",
        "created_utc": 1520955157,
        "upvote_ratio": ""
    },
    {
        "title": "Pay up or give us the car back",
        "author": "viewfromtheclouds",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/844z1g/pay_up_or_give_us_the_car_back/",
        "text": "As a poor college student working in the cafeteria, I had some money troubles, and made a few stupid decisions.  The first car I ever bought was a used green Datsun B210.  Worked good enough for what I wanted.  Believe it or not, a local bank in my hometown loaned me money to buy it.  Fast forward a couple of years, and the car and I were rear-ended by a speeding sportscar when I was backing out of a driveway.  I wasn't hurt but it basically totaled the car.  I kept paying the monthly payments, even though the car didn't work any more.  Then I hit a rough patch, and stopped paying the car payments.  (Stupid since it was only about $700 left, but 30 years ago that seemed like a huge amount of money.)  The bank started calling and complaining, and sending me angry notices.  (Totally reasonable of course).  Finally, someone at the bank made the mistake of saying \"Pay up or give us the car back!\"  That was all I needed.  I borrowed a friend's truck, rented a car-tow trailer, and towed the dead car 60 miles back to my hometown and left it in the bank's parking lot.  Mailed them their letter back with the \"give us the car back\" circled with a note saying it was the green heap sitting in their parking lot.\n\nYears later, hunted them down again, and paid it off to reduce bad karma....",
        "created_utc": 1520954679,
        "upvote_ratio": ""
    },
    {
        "title": "Take. The. Door.",
        "author": "Brock2845",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/844qpf/take_the_door/",
        "text": "In French (Canada) we have a saying that means \"get out\" it is \"Take the door\".\n\nWell, in high school, Tim took it to the letter.\n\nBeing a high school kid, Tim was restless and got a lot of detentions. He'd rarely finish a class *in* the class and finish them in a detention room.\n\nWell, Tim got fed up of it. One day, a teacher told him \"**Take the door**\". He got out, went to some manual work \"class\" (where you learn how to build using some simple tools like screwdrivers). He took tools and went back to the classroom he got kicked out of.\n\nTim took the door off its hinges and walked away with it.\n\nTim took the door.\n\nTim also got suspended.",
        "created_utc": 1520952825,
        "upvote_ratio": ""
    },
    {
        "title": "[Crosspost] GIMP BOY!!!",
        "author": "compassionate_tree",
        "url": "https://i.redd.it/d6aayprcdgl01.jpg",
        "text": "",
        "created_utc": 1520940637,
        "upvote_ratio": ""
    },
    {
        "title": "Give us extra work enjoy being ran around all day",
        "author": "lasthopel",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/842miu/give_us_extra_work_enjoy_being_ran_around_all_day/",
        "text": "So this happened at my first year of university doing game design, I was part of a class of 12 students and we each had to choose one of two paths, doing design work or animation and such, into the first month we got told we had to do sound design as a model, we found it odd as we had studied this at college level and game sound design was very separate from what we were learning.\n\nAnyway we go to lesson and learn not only is the guy teaching us a idiot who has zero idea about how games work but also he expected us in 2 8 hours lessons a week (keep in mind we had 2 major projects going on that took up all out contact time in class) but also wanted us to do 40-50 hours outside of class and complete a online certificate course on using logic on Mac as well as other stuff, the worst is this only accounted for 10% of our grade yet if we had done it all would have take up 70% of our time.\n\nNot one person on our course owned a Mac so we would have to come to class or the studios, so when it came to getting our hands on the tools we needed to go to the studios so we \"complied\" with his extra work hours, Every time we wanted to go in he had to let us in because only he and a few others had the keys , Every moment we could we would ask him to come up, he would often try to sneek of for a coffee, nope need you to open. This door, it's lunch?, Sorry need you to open the studio, it got so bad he straight up stopped coming to class and ignored emails.\n\nIn the final 3 month's of the year we learn he had been fired, 80% of the stuff he had planned and told us to do has been scraped due to it being \"unfeasible\" for us, and we where getting a new tutor, in the end It didn't, effect our grades and ment we had to do one extra coding model to up our grade that I did just completed making  a door open.\n\nDon't make students do stupid amounts of pointless work when you're the only.one who has access to the tools.",
        "created_utc": 1520930360,
        "upvote_ratio": ""
    },
    {
        "title": "Concert Black",
        "author": "mstarrbrannigan",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/842d4b/concert_black/",
        "text": "I was in orchestra from grade 4 until my senior year of high school. Because it wasn't a big district, and the orchestra director mainly just taught orchestra (he also taught a Digital audio class, music theory, and beginner guitar which were all only available if enough students signed up) he served as director for both the middle school and the high school.\n\nBecause playing an instrument requires a certain skill level, unless you signed up in 4th grade, you pretty much didn't get to join orchestra. In my school district, orchestra and band were divided into two separate classes. If you were in both, some days of the week you would go to band instead of orchestra and vice versa. Students only in orchestra went to orchestra every day. This was the case for both middle and high school.\n\nAs such, students like myself and a classmate I'll call Cindy saw this same teacher basically every school day for seven years. Because of this, we got to know our orchestra director a lot better than any of our other teachers and developed a pretty cool rapport with him. It became a tradition that graduating seniors and the teacher would exchange gifts at the final concert of the school year. His gifts always included Ticonderoga pencils, the finest of all pencils and you can't convince me otherwise, and usually some joke gift. The students would usually pool together and get him some sort of gag gift as well. He was Greek and proud of his heritage so one year the seniors got him a custom t-shirt with a picture of windex that said \"PUT WINDEX ON IT\" (see *My Big Fat Greek Wedding* to get the reference). Another year the seniors got him a goldfish because he'd had one that he kept in the middle school orchestra room but it died within a couple weeks and they never stopped giving him shit for it.\n\nI honestly don't remember what my senior class got for him because we played a prank that overshadowed it. See, in middle school we were allowed to wear any color we wanted for our concerts as long as we were dressed nicely. Come high school, that rule changed and we had to wear \"concert black\" for all of our performances. Concert black meant black pants and a black or white shirt. I didn't care because I was an edgy teen and chose to wear black all the time. Cindy took issue with this rule.\n\nEvery year, every concert, she argued with the teacher about it. But he never budged. Finally, come senior year, Cindy decided to do something about it. Which is where the malicious compliance comes in.\n\nWe all pitched in and had bright yellow t-shirts made that said \"CONCERT BLACK.\" We all came in wearing our actual concert black, then as the teacher had his back turned to address the audience to talk about how he had been our orchestra director for 7 years, we all pulled on our t-shirts. \n\nThe audience laughed but they didn't really get the joke. The \"god damn it guys\" look on the teacher's face made it all worthwhile anyway.",
        "created_utc": 1520926683,
        "upvote_ratio": ""
    },
    {
        "title": "Either study french or make paperhats. Easy choice.",
        "author": "KazeHD",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/842beb/either_study_french_or_make_paperhats_easy_choice/",
        "text": "Im from Switzerland so I think it was the equivalent as being in Highschool (USA).\n\nI was 15 and not a big fan of the mandatory french class we had. Mostly because we had one teacher replacement after another with each new teacher being worse than the last.\n\nSo french class starts and we get a new temporary teacher who didn't seem to like us very much from the get go. Half of the class wasn't paying attention, me and some friends were building paperhats and boats so the teacher told us to \"Either study french or make paperhats\". \n\nShe didn't think we would follow through so we started making various hats in different colors ranging from Wizard hats to runescape-like partyhats.\n\nLater on she told what happened to the ~~rector~~ principal but she left out what she said and basically blamed us for not participating on purpose. The rector took her side and wrote a letter to our parents about our negative behaviour.\n\nMy parents just laughed at the letter after my explanation and my dad still brings this up sometimes.",
        "created_utc": 1520926004,
        "upvote_ratio": ""
    },
    {
        "title": "Lots of examples in this /r/AskReddit thread",
        "author": "rnykal",
        "url": "https://redd.it/83v3pl",
        "text": "",
        "created_utc": 1520924889,
        "upvote_ratio": ""
    },
    {
        "title": "Fire department wanted to know everything...",
        "author": "Demorative",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/84222l/fire_department_wanted_to_know_everything/",
        "text": "To preface this, I love the local fire department guys/gals. They're great. This is a story of how I managed to out malicious compliance a malicious compliance fire department inspector.\n\n\n\n\nI work in an independent mechanic shop, and I was recently promoted to head mechanic position...which unfortunately includes office work. And the owner was a lazy SOB who liked to fob paperworks that he didn't like to do to the receptionist, who in turn would fob it to me. I didn't mind it at times, since it would get me out of the hot noisy garage and into the air conditioned office.\n\nOne such paper that was fobbed to me was the fire department annual inspection paperwork. That is to say, the fire department wants to see your evacuation plans, containment systems for hazardous materials, safety systems in place, the whole thing. Quite normal and sensible.\n\nThe paperwork also asked for a list of liquids that we store and use, and the type of containment for them. No biggie, right? Just list the usual things a shop uses...brake clean, electrical cleaner, industrial solvents, etc etc. That's how I've always done in the past few years, and I've never had much problems with it.\n\nWell, anyone who has dealt with fire department building inspections can tell you that the inspectors tend to be humorless. And this particular inspector that came to me was a new one, so he was trying hard. I don't know who he was trying to impress, us or his bosses, because he was extra malicious on that inspection day.\n\n\nOh, your oil barrels are seeping oil from the cap? FAIL.\n\nYour containment barrier around the oil barrel is splashed with oil? FAIL.\n\nNo \"official\" designation for your waste shop rag? FAIL.\n\nNo \"official\" designation for empty brake clean/spray bottles for recycling? FAIL.\n\nYour fire extinguishers not within the allocated 3' from the ground? FAIL.\n\n\nAnd so on. All those were really annoying, but easily fixed. That wasn't much of a problem. What WAS a problem was the list of liquids that we kept onsite. Apparently that was \"insufficient\" and we needed to \"provide more information\".\n\nI was going crazy. I submitted a list of everything we kept, along with their flammability ratio, locations marked on building map, and the type of containment. This was one thing that I never had a problem with, the previous inspectors always found my info to be satisfactory and moved on. Well, until THIS guy came along.\n\nHe denied our application four times in a row. Each time, I would mail out the application, and a week and half later I would get a letter back with a big red fat \"DENIED\" stamped on it. On this fourth such letter, I was seeing red. If this kept up for much longer, then we couldn't renew our shop license, and then after we would be illegally operating...and that carries a hefty fee.\n\nSo I gathered everyone to the office. I told them to leave anything and everything liquid they use at the shop on my desk. One of my guys was an aspiring bodybuilder, so he drank a protein shake everyday. I'm going to need that protein shake jar. Oh, the receptionist liked to use the pocket hand sanitizer? Yep, gonna need that. Our office manager liked to drink black coffee straight from the pot? Yessir, gonna need that too. Why? Oh, because it's a burning hazard, sir. Just look at that McDonald's coffee case. You got a date tonight johnny boy? You using cologne? You have it here? Fantastic, I want it.\n\nOur people were finding it hilarious, so of course they complied. By the end of the day my desk was literally overflowing with legitimate and not so legitimate shop tools. I had everything from industrial rust dissolver to battery acid to the receptionist's make up bag sitting on and around my desk, and even in my shelf and the ground.\n\nMy office was out in the open, so the customers that came in could see the mess. Some of them were weirded out, but most of them found it funny and some even cheered me along.\n\nSo I cataloged everything, referencing the manufacturer datasheet on the main ingredients (if there was one), or as in the case of coffee, simply wrote that the coffee maker kept it at 202F (I actually verified this with a IR thermometer) which classifies it as a burning hazard. The hand sanitizer was a poison if ingested or applied on a deep cut, and so on. By the end of the day I had over 15 pages, both side filled out, on ALL types of liquids and semi-liquids stored on site.\n\nThen I put it together with the application and mailed it out. I was so excited that I couldn't wait. But government gears turn slowly as they are wont to do. A week later, as I'm working in the garage, the fire department pulls up in my lot. I look over, it's that same inspector! He was scowling pretty hard when he saw me, and made a beeline toward items that failed the inspection last time. I guess he was hoping to fail me again, but jokes on him, I had the guys clean/fix it up on Saturday before we went home...so all the offending items were not only fixed to regulation, they were PERFECT. The fire extinguishers were exactly 36\" off the ground as specified, and I know this because he whipped out a tape measure. The oil barrels were so clean that they sparkled, and the containment barriers looked factory new.\n\nEvery single item on our fix-it list was done to perfection. Seeing that, he grudgingly approved our application. When he was about to leave, he turned and brought out my application, turned to my list of liquids and went, \"What is this?\"\n\n\n\"You asked for a list of hazardous and flammable materials kept on site, sir.\"\n\n\n\"Yes, but I didn't ask for coffee! Or Germ-X, or Premiere Proteins, or whey shake, whatever the hell these are!\"\n\n\nI took the application and turned it back to page 1, where the inspector had highlighted the bullet point where it said \"List ALL hazardous waste brought or generated on site.\" with the word \"ALL\" viciously underlined.\n\n\n\"But they're not hazardous!\"\n\n\n\"Yes sir they are.\"\n\n\n\"How?\"\n\n\n\"You can choke on them while drinking.\" I have no idea how I said that with a straight face, but I did. Our receptionist who was listening in, choked on her tea at that point. \"Case in point. You'll notice that I did include Ahmad tea bags in that list, sir.\"\n\nHe sighed in apparent disgust and got up. \"Well, everything seems to be good, you'll get your permit renewal application in a week or so.\" And left without so much a bye.\n\nI was a hero on that day! (No I wasn't. I only got a donut for my work.)\n\nTL:DR -- fire department inspector fails me for trivial things and continuously denies my application for providing information that was satisfactory for last inspections. I turn the tables on him by giving him EVERYTHING he wanted, whether or not he wanted it.",
        "created_utc": 1520922375,
        "upvote_ratio": ""
    },
    {
        "title": "Wells Fargo needed my two cents.",
        "author": "thejengamaster",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/8420wr/wells_fargo_needed_my_two_cents/",
        "text": "About two months ago I decided to close my bank accounts, checking and savings, at Wells Fargo. I went in spoke with a banker and was given my money, allegedly my remaining funds in the accounts, and some paper, and was told, that was that.\n\nAbout a month after that I get a phone call from corporate telling me that they are trying to close my account but it is two cents in the red. They ask if I would like to go into a branch to pay that. I replied that I would prefer not to. Then they offered to wave the two cents and finish closing the account. I said that sounds fantastic.\n\nAbout a week ago I get a phone call from my local branch asking if I can come in and pay two cents so they can close the account. This whole process has been frustrating. \n\nSo I grab a ziplock bag and pour the loose change from my change jar into it. I go to the bank and say that I would like to make a deposit and a withdrawal. I walked out with four $20 bills, a $5, a $1, a .25 and two .01. The bank got $86.29 in coins and closed out my account.",
        "created_utc": 1520921956,
        "upvote_ratio": ""
    },
    {
        "title": "I had a lot of problems in school. Many were brought on by myself, many were caused by teachers. This is a little of both",
        "author": "Sortofachemist",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/841my2/i_had_a_lot_of_problems_in_school_many_were/",
        "text": "I had a lot of problems in school, from k-12.  The actual school work was easy, it was actually being in a classroom I couldn't do.  \n\nAnyways, I had this first grade teacher who was pretty horrible to me.  One day I wasn't moving fast enough for her when she asked me to throw something away in the trash can.  She said \"move it mister.\" I stood there, looked her dead in the eyes, and began to wiggle my entire body (\"you said move it\").\n\nMy parents had to come in that day.  My father was super straight laced so he was angry and disappointed.  My more free spirit mother could barely keep from laughing.",
        "created_utc": 1520917095,
        "upvote_ratio": ""
    },
    {
        "title": "How to kill a helpdesk with love, care and attention to detail ...",
        "author": "vk6flab",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/841l2e/how_to_kill_a_helpdesk_with_love_care_and/",
        "text": "In the mid-1990's our workplace was hectic, with people coming and going, phones ringing off the hook, emergency responses to outages, a typical IT helpdesk for 5000+ workstations.\n\nDue to lack of space in our 1970's building we (eight of us) were housed in a \"temporary\" demountable which we called \"The Enterprise\" and had rigged up a Macintosh Plus mouse to click a Hypercard stack to play the sound of the USS Enterprise door opening whenever the door to our demountable was opened.\n\nAs a result of a court case where an employee of another organisation successfully claimed overtime going back years there was a human resources response that required that we all complete a time-sheet.\n\nFor a couple of weeks we diligently tracked our hours, noting arrival and departure, lunch breaks (if any) and submitted the time-sheets as requested.\n\nWe were told that we could only lodge 37.5 hours per week, because overtime was not approved.\n\nWe pointed out that we had been told that we were required to submit our time-sheets and those submitted were what we worked. A server went down, we stayed late to make it run again. Lunch skipped due to malfunctioning printer, no problem, just log it and move on. The boss' computer down, fixed it, worry about dinner later, backup failed, run it again at 9pm when everyone else was at home.\n\nWe were again told to only lodge 37.5 hours per week.\n\nBeing the inventive lot one of my colleagues created a program that generated the appropriate time-sheets, added a gif of various managerial signatures and allowed it to be customised for each team member.\n\nTime-sheets were duly printed out and submitted.\n\nWe were told that the time-sheet had to reflect actual arrival and departure times, so the program was altered to randomise the times, ensuring that the total hours on each sheet was a maximum of 37.5 hours.\n\nThis worked for about six months until a member of the human resources staff noticed that we all worked on a holiday and we were advised that this was unacceptable.\n\nSo, again the program was altered to include a database of standard holidays with special organisational exceptions and rotation for roster days off. (If you work 45 hours one week, you can take a day off the next week.)\n\nWe started printing out the revised sheets and realised that this was a colossal waste of paper so we asked if we could print our time-sheets 16-up, that's 16 pages on a single page.\n\nWe were told that we could in fact do that, so our revised time-sheets were printed double-sided, 16 to a side, 32 time-sheets per page.\n\nThen we were told that we actually had to work those hours.\n\nAt that point the helpdesk ceased to be functional, since we went home when the clock hit 37.5 hours, regardless of the state of the central IT infrastructure, broken printers, phone queues, backups or other random stuff that our team had been maintaining for years.\n\nShortly after that most of the members of the team started resigning.",
        "created_utc": 1520916444,
        "upvote_ratio": ""
    },
    {
        "title": "Highschool language teachers in a nutshell",
        "author": "sighwhyamiafailure",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/841jgz/highschool_language_teachers_in_a_nutshell/",
        "text": "So in freshman and sophomore year, we were required to take language classes but there were much less choices than now in upper classes. I was already good at French, had passed most of the extracurricular tests to a high level(DELF's), so I spent my time studying for the next high level test. I was put in the highest level french class available in school, which was a fairly low level one for me, so I brought in my own french books and studied for my own higher level tests to kill the time. My teacher saw this, got mad that I  wasn't working with the \"appropriate level coursework\", so I did all the classwork and homework for the rest of the 1.5 years in a matter of 3 days, handed it in, then napped the rest of the year away. She couldn't do anything if I decided I didn't want to show up to class one day or just get up and walk out since I had done all the relevant classwork or tests.",
        "created_utc": 1520915890,
        "upvote_ratio": ""
    },
    {
        "title": "Need I say more?",
        "author": "TooHardToChoosePG",
        "url": "https://www.reddit.com/r/AskReddit/comments/83v3pl/what_is_one_rule_that_was_implemented_at_your/",
        "text": "",
        "created_utc": 1520915852,
        "upvote_ratio": ""
    },
    {
        "title": "You didn't say what KIND of 'theme'",
        "author": "headlesslady",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/841hot/you_didnt_say_what_kind_of_theme/",
        "text": "When I was in college in the early 80s, the drinking age was 18-19. The University decided too many parties were focusing on getting drunk (hell yes Tequila Car Bash!) So they called all the fraternity and sorority presidents in and strongly suggested that future parties be \"theme\" parties. \n\nI'm sure they had costume parties and beach parties at the lake in mind. My husband's fraternity had a different idea, and soon there were posters hung all over campus advertising their THEME party: *Come as you are, leave as a drunk!*\n\nFor some reason, the Dean was not appreciative of the effort. ;)",
        "created_utc": 1520915327,
        "upvote_ratio": ""
    },
    {
        "title": "$6 extra in airport parking a problem, um ok; I’ll be sure to not do that again.",
        "author": "whereasiwas",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/841b2w/6_extra_in_airport_parking_a_problem_um_ok_ill_be/",
        "text": "Early 2000s I was working as the only sales person in an 800 person data company.  The company was always pretty cheap about things.  The founder and CEO’s theory was that if clients visited us and saw a bunch of lavish offices stuff they would think we were wasteful with the money they spent with us. I was on out of town business trips a few times a month and I tried to make it a habit of doing day trips when I could.  I figured I would save the company money and limit my time away from the office.  On one particular trip I was late getting to the airport and parked in short-term parking.  The net effect of short-term parking for 9 hours vs. extended parking was a $6 difference.  When I turned in my expense report, the head of accounting denied the parking expense and sent me a passive aggressive email citing the company travel policy from the employee handbook.  I accepted the adjustment and resubmitted.  A few days later I ran into her in the cafe and tried to apologize for not knowing the policy and I explained that I always tried to minimize expenses by taking day trips instead of overnight stays etc.  Her response; “Rules are rules.  Why do you think you are so special? What if everyone thought like you and tried to skate by breaking the rules?”.  So from there on out, 6 more years, every business trip I booked was an overnighter....early AM flight the day before the meeting, late afternoon flight out the day after the meeting, per diem for meals for 3 days, hotel stay, and three full days of extended parking rate.  Expensed every dime of it and never had an expense report questioned or denied.",
        "created_utc": 1520913299,
        "upvote_ratio": ""
    },
    {
        "title": "Electric company's customer service rep told me not to call them again.",
        "author": "raptorbluez",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/84136w/electric_companys_customer_service_rep_told_me/",
        "text": "I had a roommate that was pretty awful about paying his bills on time, nevertheless we agreed he'd set up and be responsible for paying the electric bill every month.  Unfortunately he added my name to the account when he set it up.  There was no way that I wanted to be listed on an account that I knew would often be paid late so I called the electric company.  I was polite but insisted that they remove my name from the bill.\n\nI ended up with a real jerk in the company's customer service department who flatly refused to remove my name from the account.  He then flagged the account instructing future representatives not to remove my name under any circumstances.  \n\nHe told me not to call them again. \n\nI moved out of state 4 months later and the account was closed, but due to the fact the customer service rep flagged the account the way he did I continued to get zero balance bills every month for the next 7 years.  The bills then started coming quarterly but didn't stop for a full 10 years.  If I moved they would correct my address without any contact from me and continue to send these bills. \n\nThere are lots of figures online as to the cost of generating an invoice, but assuming a $12 cost per invoice (the minimum according to Sterling Commerce), this company spent at least $1,100 (and probably more than $1,600) regularly informing me that I didn't owe them anything.  \n\nIt required constant vigilance, but I carefully followed the customer service rep's instructions and never called them again.  My apologies to the trees that have lost their lives due to my quest for justice.\n\nTLDR:  \n\nElectric company representative nastily refused to remove my name from an account that should have been set up only in my roommate's name.  He told me not to call again.  The company continued to send out zero balance bills every month for 10 full years after the account was closed.  I followed his instructions and didn't call them again, and enjoyed the irony for 10 years each time I received a bill.\n\n\n",
        "created_utc": 1520910927,
        "upvote_ratio": ""
    },
    {
        "title": "Electric company told me not to call them again. I didn't and it cost them more than $1,000.",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/840zy6/electric_company_told_me_not_to_call_them_again_i/",
        "text": "[deleted]",
        "created_utc": 1520909965,
        "upvote_ratio": ""
    },
    {
        "title": "Must Ask For Consent!",
        "author": "HobbesisCalvin",
        "url": "https://www.youtube.com/watch?v=tWKa-YTScYM",
        "text": "",
        "created_utc": 1520908648,
        "upvote_ratio": ""
    },
    {
        "title": "Middle School Backpack Policy",
        "author": "ducksflytogether96",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/840men/middle_school_backpack_policy/",
        "text": "I was in 8th grade during the Columbine shooting. Shortly after, our middle school dictated that there were to be no backpacks in classrooms as a safety issue/fear. They could be in hallways/lockers/busses, just not allowed in class. My schedule had me all over all 3 levels away from my assigned locker, and with textbook and notebook for each class, made it impossible to not have my backpack with me at all times. \n\nHorrible bitch science and home room teacher thought she was in cool with the “popular kids” and played into this fear of the rise of unpopular kids and what they may do as copy cats. Being nerdy and unpopular as I was, and the fact I had her 3 times a day made her extra edgy. So when I came in first period she tells me I better not have it later in the day. 3rd hour I bring it back and she’s trembling and just stares at me most of the hour. \n\n8th hour I come back with it on because we’re headed home in 20 minutes. She screams, “u/ducksflytogether GET YOUR BACKPACK OUT OF MY ROOM RIGHT NOW!!!” I calmly unzip my backpack pull out the student handbook. “Miss K, this is the handbook that includes all the rules that my parents and I signed a form that I would follow. Please tell me where it says I can’t carry one.” \n\n“YOU OF ALL PEOPLE KNOW IT’S A NEW RULE FOR SCHOOL SAFETY GET IT OUT NOW OR I’M HAVING YOU SUSPENDED!!!”\n\n“As you wish” I reply as I pack up my bag, carry it over to the door, prop the door open, and set the bag in the middle of the doorway but fully in the hallway.\n\nShe loses it and claims it must have a bomb, why else would I put it in that spot, and calls down a principal to escort me out. \n\nPrincipal’s office- opens my file to see it’s empty. I’m a good kid with no priors and straight A’s, but I really wanted to stick it to this lady for making my final year of middle school such hell. I had to sit in the office the rest of the day (15 min) and was asked not to speak to her the rest of the year. I just quietly smiled at her 3 times a day, everyday, for those last 4 weeks as the policy was quickly rescinded. ",
        "created_utc": 1520906252,
        "upvote_ratio": ""
    },
    {
        "title": "“Cover it up so it’s not a plain brown box”",
        "author": "numbersaremygameyall",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/840b9t/cover_it_up_so_its_not_a_plain_brown_box/",
        "text": "Not the most significant story, but it fits the sub!\n\nI work as a student assistant in my university as administrative support. We service all professors in our academic college and have Dr. Asshole who works in our suite, who has obnoxiously high expectations given we get paid $10/hr. He, in the past, has expected us to recreate flyers that were made by actual graphic designers, drive around town delivering things for him (half of us don’t even have cars), have a professional change of clothes available at all times “just in case,” etc. \n\nSo this particular day, Dr. A has promised a colleague that she can put a donation box in our suite for clothes for a charity. She drops off a large, plain box. Unsure of any details, I let it sit there and let anyone who asks know what it’s supposed to be for.\n\nDr. A comes in and flips a lid because it looks so “unsightly.” I ask if he wants me to make a flyer to put on it, which he agrees to so I put as much information as I know and could find online about the charity on it and printed out three copies - one to put on the box, one above it at eye level, and one on our front door.\n\nDr. A comes back later and immediately upon seeing it says, “Hey, we really need more than just that flyer, that still looks really bad. Can you decorate the whole box?” \n\nThis is a college, not a preschool, so having no crafts on hand, I ask, “The whole box? You want me to order Fedex blown-up flyers for the sides or something?”\n\nDr. A: “Uh, how much would that be?”\n\nMe: “Around $40.”\n\nDr. A: “No, no, no, we can’t do that...” At this point, another professor walks in and asks him to join him to go to Starbucks. As he leaves, he says, “Just, please, cover it up, will you?”\n\nMy coworker was nearby, so I go in there and we’re theorizing about what to do, meanwhile I have a bunch of actual projects for different professors to worry about and I’m becoming extremely overwhelmed and a bit pissed, so I just say, “You know what? I’m just gonna do exactly what he said. I’m going to cover it up.” \n\nI go back to my desk and make 40 copies of the flyer I had made. I grab a tape dispenser, and I spend 20 minutes just taping a bunch of copies of the flyer to the sides and visible insides of the box so there’s no brown showing. Then I go back to my work.\n\nDr. A gets back after I leave but my coworker was excitedly watching for his reaction. He stops immediately when he walks in, but does not say anything. He opens his mouth, but remains silent as he stares at it for a moment, glances at my coworker, and begrudgingly continues to his office. My boss mentions to me a couple days later that Dr. A had complained about the situation to him but even through his own sequence of events had not been able to articulate what he would have preferred I do instead. The box stayed like that (without complaint to me) until the lady came to pick it up, at which point I helped her remove all of the flyers before she hauled it off for good, haha.\n\nTLDR - cover the box, but not like that, or that, or...",
        "created_utc": 1520903371,
        "upvote_ratio": ""
    },
    {
        "title": "Only v neck shirts",
        "author": "d4nk3std4nk3r",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/840a0g/only_v_neck_shirts/",
        "text": "In 6th grade the school dress code was that only v neck shirts were allowed. This rule was out of the blue. Everyone cut the necks in their shirts as big as possible in the shape of a V.  To the point where people had their shirts showing their stomachs. Even the girls did it. They repealed it a few days later.",
        "created_utc": 1520903061,
        "upvote_ratio": ""
    },
    {
        "title": "Grilled Cheese",
        "author": "EarhornJones",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/8405c9/grilled_cheese/",
        "text": "In my dorm, if you did something that triggered the smoke/fire alarm, you had to do a safety presentation for everyone on your floor. This was intended to deter pranksters from pulling the alarm.\n\nA guy on our floor was making grilled cheese in the kitchenette, and burned it, which legitimately triggered the fire alarm. Afterwards, he explained, assuming that since it had been a legitimate alarm, and not a prank, that he wouldn't have to do a presentation. He was, of course, wrong.\n\nSo, the next Wednesday night, the entire floor assembled, and we were treated to a thirty minute safety presentation on the dangers of grilled cheese sandwiches. It contained literally nothing about fire safety. It was all choking hazards and cholesterol.\n\nOur RA was furious, but the student pointed out that the write-up that he'd been given just said \"safety presentation\".\n\nWe didn't get any more presentations after that.",
        "created_utc": 1520901911,
        "upvote_ratio": ""
    },
    {
        "title": "No chance of a good grade? No reason to work hard.",
        "author": "JordanLeDoux",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/84045u/no_chance_of_a_good_grade_no_reason_to_work_hard/",
        "text": "So in high school, over a decade ago, I was always one of those kids (particularly in math class) that could learn just from the lecture, and never really put in work on the homework because it felt like busywork to me. (Imagine my surprise later in life at how much of *life* is busywork.)\n\nMy Junior year, my trig teacher had a very odd grading system.\n\n1. All tests were graded on a curve, with the max score set by the best score that was made.\n2. Your entire letter grade was your performance on these tests.\n3. However, your actual grade was \"gated\" by the % of homework you turned in. So to qualify for a score better than a D, no matter your test scores, you had to turn in at least 60% of all homework assignments completed. 70% qualified you for a B, 80% for an A. **This homework was not graded, it was just checked for completion**, and he made that QUITE explicit.\n\nAt first, I started the class with \"this is my Junior year, I'm gonna strap in and do the work, even though I think it's stupid.\" That attitude changed eventually when I saw just how... stupid most of it was. This was beyond \"busywork\", he was giving us almost 2 hours of homework per night (if we did it right) that didn't actually contribute to our grade, and virtually none of it was to teach us anything.\n\nSo I started with the malicious compliance. Since he didn't actually grade the homework, I started to put almost no effort into getting right answers. I started to make things up. Anything I could to get my steps on the page.\n\nAbout two months into the class, he had me stay after to express his displeasure with what I was doing. You'd think it would be something like \"knock it off and do your work\", but instead what he told me was: \"I don't care how much homework you turn in or what grade you get on the tests, I'm not giving you a grade higher than a D this year\". No warning or anything, just straight to the \"you're dead to me\" route.\n\nSo, I stopped turning anything in. He got even more annoyed, and a few classes later he called me out for it *in class* during the lecture. So I calmly explained to him that since he told me to my face that no matter what grade I earned this year, he would give me a D, I wasn't going to do any of the work, and that the only reason I still came to class was because I wanted to learn the material.\n\nMy classmates were appalled at learning this, but nothing came of it.\n\nUntil the next test.\n\nThe grade meant nothing to me any more. However, I wanted that extra little snub to him for being such a dick. So even though I usually tested very well in math, I made *extra* sure I was prepared for that test.\n\nI set the curve for that test, scoring a 106. The ENTIRE rest of the class was furious, but not at me... at him. They complained LOUDLY for a whole class (refused to let him do his lecture) that they shouldn't be punished because he was being childish towards the \"best student in the class\". \n\nAfter a few minutes, I spoke up and told everyone else in the class that I'd purposely tank the rest of the tests to not set the curve, since the grade didn't matter to me any more, and everyone was super thankful.\n\nSomehow, in all of this, I had never even thought to talk to my parents about it. So by the time parent-teacher conferences happened, I told them the situation and they were FURIOUS.\n\nBut the school couldn't really do anything. The teacher had been there FOREVER, and there were just too many hoops to discipline or remove them.\n\nBecause of that, instead of getting into AP Calc my senior year (which had a required C or better in trig) I got put in like a remedial algebra class at the beginning of my senior year.\n\nHalfway through the first class of the year, after answering questions the teacher was asking, they said \"why are you even in this class?\" After a brief explanation, the teacher told me to get my things and follow them. He opened the door to AP Calc, ushered me inside, and told the AP Calc teacher \"he should be in your class\", then walked away.\n\nI was pretty decent friends with the AP Calc teacher, so after an explanation of the previous year they let me in the class.\n\nTL;DR: Went for malicious compliance. Resulted in malicious retaliation from the teacher, which turned into petty revenge from me, which almost messed up my high school academic career my senior year, but everything worked out in the end.",
        "created_utc": 1520901621,
        "upvote_ratio": ""
    },
    {
        "title": "Can you hear this?",
        "author": "DodgeDozer",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/8403mh/can_you_hear_this/",
        "text": "Back when it was cool, I briefly had one of those push-to-talk phones.  I was working with a lot of people who used them and figured it would make my life easier.  Unfortunately, the coverage was horrible as was the voice quality, so I ended up getting rid of it and cancelling the plan.  Somehow, in closing out the account, they misquoted me the wrong sum on my final bill by a small amount and the next month I got a bill in the mail for an outstanding 11 cents.  Just 11 cents.\n\n\nSo I called them up and was like, \"Hey, you sent me a bill for 11 cents on a plan that’s cancelled. Can you just cancel it out?\"\n \n\"No, sir, that’s an outstanding balance that needs to be paid off.\"\n\n\"Guy, your company just spent more money on paper, ink, and postage than what I owe them.  Plus, now they’re paying you to waste time talking to me about it.\"\n\n\"I know, sir, but it still must be paid.\"\n\n\"...Alright, buddy, let me know when you’re ready for my VISA number.  Also, please make sure to mail me a final statement showing my zero balance.\"",
        "created_utc": 1520901487,
        "upvote_ratio": ""
    },
    {
        "title": "Daily Mandatory Lunch Meetings",
        "author": "Char-Lez",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/84029i/daily_mandatory_lunch_meetings/",
        "text": "I worked for a place that I loved, but it had a crazy policy of a daily mandatory lunch meeting for which no one was paid.\n\nThe rule was we could bring our lunch.\n\nIt was on.\n\nI focused on the smelliest, noisiest lunches possible.  Lots of fish.  Lots of crinkly plastic and rustling papers.  Can openers.  Anything obnoxious.\n\nI would plant myself in the front row center and pay rapt attention to the material...  while driving everyone crazy.\n\nSadly, they tolerated me and didn’t change their stupid policy, but I made them pay for it every single day.",
        "created_utc": 1520901154,
        "upvote_ratio": ""
    },
    {
        "title": "Saw this website cookies banner",
        "author": "Devin1405",
        "url": "https://i.redd.it/beacszidefl01.png",
        "text": "",
        "created_utc": 1520901133,
        "upvote_ratio": ""
    },
    {
        "title": "The reff was blind but wasnt deaf (Idk, I thought this title was cool)",
        "author": "usernamebetween3and2",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/83zze0/the_reff_was_blind_but_wasnt_deaf_idk_i_thought/",
        "text": "(Disclaimer: This story is a mesh of experiences. I keep it specific for narrative sake using real people and events, but it's more about what generally happens. I have a bad memory.)\n\nI'm a ref for grade school volleyball. Sports parents and coaches can get a bit crazy, as I'm sure a lot of you are aware. I ref 3rd and 4th, 5th and 6th, and 7th and 8th. When I ref 3rd and 4th I'll tend to be very lenient. I doubt myself sometimes and honestly if no one notices a violation, I'll just let the game play out.\n\nThis one coach wasn't having it. Some kid kept stepping over the line to serve (a violation) and I shrugged it off. No big deal. These 4th graders can barely pass the ball.\n\nIt soon gets super noticeable. But I realized something. She would step over the line AFTER she had just hit the ball, a fact barely noticeable compared to the GIANT steps this kid was taking.\n\nThe coach keeps pestering me to pay attention to the game and make some calls on these 4th graders (I am guilty of zoning out and letting the cheers guide my calls as well... Im not proud of this).\n\nIt's time for her team to serve and a one of the kids is not on the court. (Front row just off the side... the most common of that uncommon mistake). Their server serves and I blow my whistle. The other team got the point. No one knew what had happened.\n\nI explained and some parent behind me said \"This isn't the NFL.\"\n\nYou're darn right it isn't.\n\nEdit:Spelling of \"coach\" and \"reff\" (idk if I can change the title)",
        "created_utc": 1520900468,
        "upvote_ratio": ""
    },
    {
        "title": "What is one rule that was implemented at your school or work that backfired horribly? [AskReddit]",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskReddit/comments/83v3pl/what_is_one_rule_that_was_implemented_at_your/",
        "text": "[deleted]",
        "created_utc": 1520898862,
        "upvote_ratio": ""
    },
    {
        "title": "Neil Young engaging in some textbook malicious compliance back in the 80s",
        "author": "Fuzzy_the_sheep",
        "url": "https://youtu.be/W9XlAMu_cUU?t=2970",
        "text": "",
        "created_utc": 1520897549,
        "upvote_ratio": ""
    },
    {
        "title": "Micromanaging",
        "author": "Deetoria",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/83zmyj/micromanaging/",
        "text": "I was on the board of a sports league and was head of the communications team. Keep in mind this is a league of about 45 people, so not exceptionally large by any standards. My team ran like clockwork. Nothing was ever late. We got a new president and she decided that she wanted regular updates on everything being worked on. OK, I would update her periodically but I didn't think I needed to do it too often. That wasn't enough. She told me I needed to update her on every stage of projects and things we were working on ( such as posters for our next game. ) These are all volunteer positions and this would require far more work than what I was putting in at the time for no good reason. She kept bugging me to update her more often... so I did.\n\nI would send her multiple updates near daily. Things like \" Thought for 5 minutes about wording for a press release. \" or \" Holly spent 10 minutes working on poster design. \" or \" Susan commented on a post relevant to the league, \" \n\n\nIt pissed her off. She would ask why I'm telling get her this stuff and I'd reply that she said she wanted regular updates. She eventually left me alone and my team went back to working smoothly.",
        "created_utc": 1520897412,
        "upvote_ratio": ""
    },
    {
        "title": "Pulled your legos apart boss (x-post from /r/lego)",
        "author": "hicctl",
        "url": "https://i.imgur.com/YpgO7tH.jpg",
        "text": "",
        "created_utc": 1520897139,
        "upvote_ratio": ""
    },
    {
        "title": "Neil Young engaging in some malicious compliance back in the 80's",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/83zkyi/neil_young_engaging_in_some_malicious_compliance/",
        "text": "[removed]",
        "created_utc": 1520896947,
        "upvote_ratio": ""
    },
    {
        "title": "\"No senior prank\" compliance...",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/AskReddit/comments/83v3pl/what_is_one_rule_that_was_implemented_at_your/dvkz7zn",
        "text": "[deleted]",
        "created_utc": 1520896478,
        "upvote_ratio": ""
    },
    {
        "title": "You have to be VERY specific with children",
        "author": "Blastartechguy",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/83zb2i/you_have_to_be_very_specific_with_children/",
        "text": "I was reading another story on here that reminded me of one that happened years ago. \n\nWhen I was around 4 or 5 years old (I'm 18 now), I was visiting my grandmother in California with my dad and sister. We went to the beach one day and I had to go to the bathroom. Being 4, I thought I could only go to the bathroom IN a bathroom. I go up to my dad and tell him I have to go to the bathroom. He tells me the obvious answer, go pee in the ocean. In his mind, he thinks I will go about waist deep, do my business, and continue playing. Unbeknownst to him, the waves look HUGE, and scared me at the time. So I went up to the water, right next to my sister, dropped my swim trunks, and relieved myself. \n\nMy grandmother took a picture of it and it's still hanging on the wall to this day.",
        "created_utc": 1520894675,
        "upvote_ratio": ""
    }
]