[
    {
        "title": "Restaurant complies with omnipotent government",
        "author": "d_Lightz",
        "url": "https://i.imgur.com/UQfmn6j.jpg",
        "text": "",
        "created_utc": 1523666625,
        "upvote_ratio": ""
    },
    {
        "title": "Dentist dilemma",
        "author": "uniqueniko",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/8c3bwg/dentist_dilemma/",
        "text": "So this happened back in 2005 when I was a wee third grader. \n\nA little backstory, I was a very anxious child. Practically everything made me nervous (school, meeting new people, etc.) and when I got nervous, I would throw up. At its worst I was throwing up every morning before school because I was terrified something bad was going to happen. Let's just say me and vomiting had a very close (and gross) relationship. (Flash forward a few years and with the help of patient parents and therapists I got over my anxiety. Yay!). \n\nBecause of this constant vomiting, as you could imagine, I had many many cavities. Which was a double edge sword because I was TERRIFIED of the dentist. \n\nOkay now to the real story. \n\nI was at the dentist getting one of my cavities filled. Everything was going good. We were just enough into the procedure where they had taken off the dead part of my tooth and were prepping to fill it. I was pretty anxious the whole time so I was feeling nauseous, but that was fairly normal for me.\n\nThat's when it hit me. It was more than nausea, I was gonna throw up. \n\nI told the dentist, let's call him Dr. Tooth, that I was going to throw up. Which pretty much sounded like \"H'M UNNA FROW UUUU\" because, well you know, dentist. \n\nI expected him to let me up and vomit so we could continue on with the procedure. He was fully aware of my anxiety situation, and told me when I first started going to his practice that if I was too nervous I would be allowed up. But we wouldn't be here if that was the case! With an eye roll and a sassy tone Dr T replied \"you're fine. Lay down and we'll be done shortly.\"\n\n\"She's not lying. She's going to throw up if you don't let her go.\" My dad told Dr T. \n\n\"Kids tell us this all the time, they just want a break out of the chair. She doesn't actually need to throw up.\" -Dr T\n\nMy dad, being a dad, chuckled and waited. \n\nSo I did as I was told, I sat there. I tried to keep it in but nothing could hold back the flood which was coming. \n\nA few moments later brown vomit came spewing out of my mouth like a teenage boy losing his virginity. AND MAN did it get everywhere; his shirt was ruined, my shirt was ruined, his hands and arms were covered in vomit, the tech had vomit all over her shoes, it was everywhere. The only clean one was my dad, who got to witness the whole scenario. \n\nBUT IT GETS BETTER \n\nThey rushed me a plastic container to puke in, BUT IT HAD A HUGE BREAK AT THE BOTTOM. so now I was puking into this broken bucket which was just dropping my vomit straight onto the chair and the floor. \n\nThe look on this mans face was PRICELESS. It is something I will never forget. His fancy facility covered in an 8 year-old's vomit. With the horrible smell starting to drift into the main area where other clients were seated. \n\nI went to the bathroom eventually, but my stomach was pretty much empty by that point. I got a free T-shirt out of it and never went back. To this day me and my dad still joke about \"VOLCANOOOOOOOO\" because, according to him, that's exactly what it looked like.  \n\nTLDR: had to puke. Dentist wouldn't let me puke. Puked on the dentist. ",
        "created_utc": 1523659722,
        "upvote_ratio": ""
    },
    {
        "title": "Never tell me to just stay seated when I need to use the restroom",
        "author": "graytsk",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/8c2wrt/never_tell_me_to_just_stay_seated_when_i_need_to/",
        "text": "First post, mobile, etc etc.\n\nThis is actually a double feature of two related stories around 5 years apart.\n\nIn general I was a major teacher’s pet for most of elementary school. I was pretty patient and quiet, and always wanted to follow what my teachers were saying. All except for one who we’ll call Ms. June. \nMs. June HATED me, and even now I’m not quite sure why. For instance, we had these “self-manager” badges that were basically good kid points that let us walk to lunch without an adult. Well earlier in the year some kid kept kicking me in the shins during a test and I told him quietly to stop and the lovely Ms. June took my badge right there and ripped it in half, telling me I’ll never get it back (they were only taken usually for a week at most). I got to hold Ms. June’s hand everyday to lunch for the entire year, making me always late and a laughing stock. \n\nWell, whenever I had to go the bathroom I had to deal with Ms. June, who would tell me to just wait it out until lunch. One day I wasn’t having it, so after asking about three times she yells “You aren’t allowed out of that seat until the end of school!”\n\nI pissed right then and there, staring her dead in the eye.\n\nObviously she freaked out and started yelling at me that I was filthy and I had to go home and change, but luckily I always kept extra athletic clothes in my backpack for sports, and was never denied again.\n\nOr so I thought...\n\nFlash forward 5 years and I’m in middle school music with the most abhorrent substitute I’ve ever had. Every student hated her, and she even made three kids cry in one of the classes. Now being a girl in puberty I was struggling with adjusting to that time of the month. So when I felt something, I raised my hand and said it was an emergency. She responded with “I don’t care, you just had lunch so you should’ve went then, just wait.” \n\nI’ve played his game before, and I still have extra workout clothes in my locker just across the hall.\n\nI sat that entire class with my legs nice and wide, making sure I made the biggest mess possible. When the bell rung, I smirked and stood up to see a massive smudge of red splattered on the seat. I walked over to her and placed the chair in front of her, asking her to sanitize it since I couldn’t go to the bathroom. I didn’t even hear what she said because I ran out to grab my spare clothes and clean up. \n\nDisgusting and probably a hassle for the janitors in hindsight but what can I say, I was a stubborn kid. Best part, I found out a year later that the sub was asked to never come back to our school because of how many issues she had.\n\n**tl:dr - Was told to stay sitting when I needed to pee. Complied and pissed myself. Did the same thing five years later but with my period.**\n\nEdit: Some people are wondering how I supposedly “held a period in.” It wasn’t really holding it in as I’m not some witch, but I didn’t make any efforts to keep the free bleeding to a minimum, i.e. not clenching my thighs, making sure the flow was directly downwards, not shifting my body to prevent the spill. Also, I have an extremely heavy and irregular period in the first few days, so getting a decent blood patch is not impossible, especially while wearing black tights. Unfortunately I’m not a guy lmao just a girl bad at explaining stuff :)\n\nEdit 4/14: clarification",
        "created_utc": 1523656024,
        "upvote_ratio": ""
    },
    {
        "title": "If I want to listen to music during a test then I will",
        "author": "myusernamesuckslol",
        "url": "https://imgur.com/a/VY1jH",
        "text": "",
        "created_utc": 1523652934,
        "upvote_ratio": ""
    },
    {
        "title": "NPR Music Reviewer Asked to Review Taylor Swift Song. Complies.",
        "author": "the_future_is_wild",
        "url": "https://www.npr.org/sections/allsongs/2018/04/13/602149081/you-know-what-fine-taylor-swift-covers-earth-wind-fires-september",
        "text": "",
        "created_utc": 1523652252,
        "upvote_ratio": ""
    },
    {
        "title": "Was told I couldn't exchange a broken car starter.",
        "author": "muscularmanny",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/8c24y7/was_told_i_couldnt_exchange_a_broken_car_starter/",
        "text": "[removed]",
        "created_utc": 1523649642,
        "upvote_ratio": ""
    },
    {
        "title": "We asked a cleaning company to clean the outside patio area of the bar...",
        "author": "[deleted]",
        "url": "https://i.redd.it/lxsroc0beqr01.jpg",
        "text": "[deleted]",
        "created_utc": 1523649370,
        "upvote_ratio": ""
    },
    {
        "title": "Master of the chairs, then.",
        "author": "icenoob23",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/8c210v/master_of_the_chairs_then/",
        "text": "In a previous job, we had this admin, who was brilliant, funny, almost universally liked, and she had been there forever, which meant she was exceedingly efficient in navigating the bureaucracy and had contacts at every level and in every department of the company. She had my full admiration and I relied on her for many things. I was leading a rather important department which included a research group. I was good at my job and loved it, which was uncommon and made me hard to replace. We were widely respected by almost everyone there, from her boss's boss to the president. On paper, her boss was also my boss. It was a technicality: my department supposedly answered to him, but most of our duties were company-wide and he had no say on them. My organization answered to the board/president/their deputies and sometimes would not align with his interests. He resented us, and he hated even more that he couldn't send us away. So he had an idea to display his power over us:\n\n**[Malicious compliance #1]**\n\nMy department was directly in front a lab for students affiliated with my research group. We ran weekly seminars with the students. The lab was a bit cramped, so we ran them in my department instead. The students would just move their chairs from their lab to ours, leave them there in a corner for next time, and if they were running low on chairs they would grab one from the stack. So, boss ordered the admin to conduct a weekly inventory of the chairs. She had to find which chairs were out of place without authorization (based on their inventory stickers underneath) move them to the correct room. Every Friday afternoon she had to come over, look at all the inventory numbers and match them to her list. We didn't have barcode tags or readers at the time, so it was a manual and boring task. On Monday mornings, boss would send his secretary to count the chairs and he would officially reprimand the admin and me if the count didn't match. He was not allowed to fire us, but he could make sure we had menial work to do every Friday after everyone else had gone, all within the rules.\n\n**[Malicious compliance #2]**\n\nThis lasted less than a month. One Friday, the admin didn't come for our weekly punishment. I walked to her office where she greeted me with a wide smile and pointed to her desk. She had the map of the building, with each room labelled \"Dept [name]: [X] chairs\". Except the labels were freshly crossed over. She had hand-drawn a box around the floor plan, labeled \"Room of all the chairs: X+Y+Z+... = total chairs\". The modified map had just been signed by the president. I hear that my boss wasn't very amused about it. Now we could comply with zero effort, between security not letting anyone take out company property without authorization and the yearly inventory reviews. And if he wanted to enforce it nonetheless, his secretary would have had to count all the chairs in the building and not just the two rooms, every week.\n\n**[Not malicious compliance, but...]**\n\nThe icing: next to the \"Room of all the chairs\" there was a handwritten note by the president, stating \"The head of the department of the chairs, IceNoob23, and his delegates, have full and exclusive authority to approve any chair transfer at any time and for any reason\". I promptly delegated all my newly-found chair powers back to the admin. The revised map with the note was to be posted in every chair-containing room, including the boss' office, but we decided the last part was probably a joke by the president, and just hung the revised map in our offices. \n\n**[Postscript]**\n\nYes, a dual chain-of-command structure is broken. Both had mostly been in sync before and had never posed a problem, but changes to my organization approved during my tenure there led to small but increasing conflicts of interests between the two. By the time this happened the company officials had already been working on disentangling them. The chair incident was not entirely malicious, it was also about documenting ownership of the physical resources (and the president's response meant \"who cares about chairs?\"). We split some time after, at which time my tongue-in-cheek appointment to \"Head of the department of the chairs\" was rescinded.\n\n...\n\n**Clarification:** to my knowledge, the admin never told the president the real reason she was redrawing the map. She just explained that it would be easier to track inventory that way, described the situation with my group, and suggested to explicitly allow me to move the seats around as needed.\n\n...\n\n**TL;DR** (credits to u/RustyWolf): TL;DR OP and the admin were told by their boss to ensure that each room that they used had the correct chair count every friday, and would reprimand them if it was off on monday. Admin then went to the president of the company and had him agree to a floorplan where the chairs from all of the rooms that OP and the admin used were shared, and gave OP and the admin permission to move them at will.\n\n\n\n\n",
        "created_utc": 1523648797,
        "upvote_ratio": ""
    },
    {
        "title": "Xpost r/funny: Metro police tell publisher they can NOT have a quote from police for use on book cover... thus giving a quote for use on book cover.",
        "author": "[deleted]",
        "url": "https://imgur.com/qSiwi2M",
        "text": "[deleted]",
        "created_utc": 1523648537,
        "upvote_ratio": ""
    },
    {
        "title": "Ok. It would have been easier with my hand, but fine...",
        "author": "I_play_trombone_AMA",
        "url": "https://i.imgur.com/LvXi2UE.jpg",
        "text": "",
        "created_utc": 1523647312,
        "upvote_ratio": ""
    },
    {
        "title": "Want this document? Sure, you can have it. Perhaps in 80 years.",
        "author": "kuratowski",
        "url": "https://www.thestar.com/news/canada/2018/04/12/federal-department-tells-researcher-his-document-request-will-be-ready-in-80-years.html",
        "text": "",
        "created_utc": 1523644326,
        "upvote_ratio": ""
    },
    {
        "title": "Sign Compliance proof",
        "author": "mmussen",
        "url": "https://i.imgur.com/jm9FIAj.jpg",
        "text": "",
        "created_utc": 1523642174,
        "upvote_ratio": ""
    },
    {
        "title": "Fine, I'll clean the bathroom.",
        "author": "Mordanzibel",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/8c0wuh/fine_ill_clean_the_bathroom/",
        "text": "Back when I was a teenager in the mid 90s, I got my first real job that didn't involve tobacco farming at the local Wal-mart. When they hired me, they hired me to be a stocker. All of my duties were described to me and I'd like to be clear that at no point was cleaning the bathroom on this list.\n\nWell, the guy whose job that was quit unexpectedly one day and they decided that since I was just a part time teenager that they'd make me do it. I was less than thrilled and explained to the store manager that this is not what I was hired to do. I was, of course, read the riot act about how I'm paid to work and that means doing whatever needs working on etc.\n\nI said fine, I'll do it. They show me to the closet where they kept the janitorial supplies and then just walked away. So I filled the bucket about halfway with some Clorox, then I put in a splash of water...just enough to claim some was in there. I noticed that there was a jug of blue liquid with a rather large skull and crossbones warning label on it. I picked this up and carried it with me to the bathroom. Once there, I put on a little surgical mask (completely unhelpful) and poured some of that blue jug liquid into the Clorox and got to mopping as hard as I could. \n\nTo this day, I don't know what was in that jug. What I do know is that shortly after starting to mop, a white misty smoke began to rise from the floor and the mop bucket. I had been holding my breath but I couldn't do so forever. One inhalation of this stuff felt like someone had reached into my lungs and snatched the air right out of me.\n\nI quickly exited to fresh air, breathed in deeply and went back to get the mopping supplies and make my exit. I even hung a little do not enter sign on the door.\n\n15 minutes later my boss is furiously searching for me and wants to know what the hell I did. Apparently customers were going into the restroom and then running out red-eyed, coughing, and crying and all the wax had been dissolved off the floor. \n\nI feigned ignorance told her I cleaned it just like she wanted. I just used a little water and Clorox. \n\nI was never asked to clean the bathrooms again. ",
        "created_utc": 1523640095,
        "upvote_ratio": ""
    },
    {
        "title": "On the back cover of Banksy's book",
        "author": "D4rkr4in",
        "url": "https://i.imgur.com/qSiwi2M.jpg",
        "text": "",
        "created_utc": 1523637616,
        "upvote_ratio": ""
    },
    {
        "title": "On the back cover of Banksy's book",
        "author": "flipsideCREATIONS",
        "url": "https://imgur.com/qSiwi2M",
        "text": "",
        "created_utc": 1523636808,
        "upvote_ratio": ""
    },
    {
        "title": "\"Quoted\"",
        "author": "Light_A000",
        "url": "https://imgur.com/qSiwi2M",
        "text": "",
        "created_utc": 1523634169,
        "upvote_ratio": ""
    },
    {
        "title": "Sign Compliance",
        "author": "mmussen",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/8c01g9/sign_compliance/",
        "text": "So this story takes place some years ago at the brewery I work at.\n\nFor background our brewery is located on the side of a river, on a secenic road, in an area prone to flooding.\n\nWe had just commissioned a silo to hold malt for us, that had arrived but had not yet been stood up and installed when our area experienced record floods. The highway was under 6 feet of water. The flood carried our silo off - it was recovered after the water recieded, installed and painted with the logo of the brewery.\n\nNow we enter the asshole inspector. Who decided that the logo painted on the silo consituted a sign - which was too big for the side of a scenic highway and would need an exemption permit from the state or to repaint the silo with a smaller logo.\n\nThe complaince: the silo was repainted without the logo instead the name of the brewery was painted on the side in block letter, larger than before. Just above the name in small print we added \"if found please return to\"\n\nWhen the inspector came back and complained that the sign was even larger than the old one he was simply told \"I'm sorry, that's not a sign, it's a label in case it gets lost again.\"\n\nSeveral years later we still have the same label.\n\nEdit: picture is taken, I just need to figure out how to upload on mobile.\n\nEdit 2: here you go https://m.imgur.com/jm9FIAj",
        "created_utc": 1523633424,
        "upvote_ratio": ""
    },
    {
        "title": "You guys price match right?",
        "author": "nekortek",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/8bziyc/you_guys_price_match_right/",
        "text": "A few years ago I was working for a certain retailer known for their blue and yellow color scheme. During this particular time, I was working in their computer department as part of the sales team. \n\n\nOne morning, a gentleman came in looking for a new laptop. The gentleman was nice and he knew exactly what he wanted which made for an easy sale for me. He was however, very adamant in his questioning on whether or not we would price match Amazon. I explained that we would be able to so long as it was for the exact model and Amazon was the one selling it rather than a third party.\n\n\nI went on to grab the laptop and start ringing it up. At this point the following conversation occurs:\n\n\n&gt;Gent: You're going to price match this right?\n\n&gt;Me: Yes sir, absolutely. As long as it matches our guidelines.\nGent: Alright, well I want you to price match it no matter what. I'll hold you to it.\n\n\nThe gentleman has been very nice the entire time but like many people I have dealt with, is getting hung up on price matching. I don't mind, I completely understand and agree with trying to get the best price. \n\n\nI look up the laptop on Amazon and verify it is the correct model and that Amazon is the one selling it. Then I look at the price and notice it's currently $50 more than we were selling it for. So, like the gentleman asked, I overrode the price to make it $50 more expensive. The gentleman looks at the screen to see the price has increased.\n\n\n&gt;Gent: Hey, why did the price go up?\n\n&gt;Me: I price matched Amazon for you just like you asked.\n\n\nI show the gentleman the screen showing the more expensive price. He lets out a laugh and tells me I know what he meant. I laughed too and corrected the price before finishing the sale. \n\n\nLater on, my manager stopped by to let me know the gentleman had stopped on his way out to praise my sense of humor.\n\nEdit: The store name rhymes with Best Buy. Didn't realize so many companies shared the colors. My bad. ",
        "created_utc": 1523629335,
        "upvote_ratio": ""
    },
    {
        "title": "Assignment Help Business Management",
        "author": "[deleted]",
        "url": "https://idealthesis.com/blog/assignment-help-business-management/",
        "text": "",
        "created_utc": 1523623586,
        "upvote_ratio": ""
    },
    {
        "title": "Administration seems to think it was malicious",
        "author": "Greenblueyell",
        "url": "http://www.cbc.ca/news/canada/montreal/quebec-teen-suspended-jersey-humboldt-broncos-1.4617890",
        "text": "",
        "created_utc": 1523622739,
        "upvote_ratio": ""
    },
    {
        "title": "\"Ducktales\"",
        "author": "[deleted]",
        "url": "https://youtu.be/f5d8pVg3Qtg?t=3m35s",
        "text": "[deleted]",
        "created_utc": 1523619497,
        "upvote_ratio": ""
    },
    {
        "title": "A fire drill can go very wrong when done by the book",
        "author": "theykilledken",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/8byc7c/a_fire_drill_can_go_very_wrong_when_done_by_the/",
        "text": "I'm relatively new to reddit and writing on mobile so I apologize for any possible formatting issues.\n\nBack in my army days we were stationed at a basic training camp (utchebka) that doubled as a signal corps base. I was completing my officer training (military interpreter) and was quite full of the army bullshit by that time, same as almost everyone in my platoon. I had a couple of months left to complete the training and by that point, I had no intention to pursue a military career. The qualification was what I was after.\n\nA particular annoyance was a certain captain who was very fond of staging fire alarm drills in the middle of the night. I guess the equivalent for his position would be something like a drill sergeant in any of the NATO armies, but the russian army does things a little differently, sergeants are little different from enlisted soldiers in the amount of authority they have and the roles normally expected of drill sergeants are relegated to lower ranked commissioned officers, mostly lieutenants and sometimes captains.\n\nIDK I guess that asshole felt he was unfairly treated and deserved a better position so he took it out on the guys. A fire drill at 3 AM in November is no fun. The end result was almost always even worse. Standing out in the open listening to his screaming rants about us not meeting the expectations future officers should abide by, that was the exact opposite of what any sane person would call a healthy outdoors activity. We were all either fresh out of college by that time or were in our final years so, dumb as we were, we wanted (and planned) to get back at him in some way, preferably a very humiliating one. Unfortunately, the signal corps soldiers were one step ahead of us. I guess they had to deal with even more of his bullshit than we had.\n\nOne beautiful winter night the shrill fire alarm goes off AGAIN but this time the night watch led by a junior sergeant decides to do things by the book. Remember, junior sergeant rank is closer to something like private first class. He IS a regular soldier for almost all intents and purposes. In the three-floor HQ building the so-called \"secret archive\" was kept on the second floor in a huge 2x1.5 meter cabinet welded out of angle iron and sheet metal. The thing probably weighted about half a ton empty (which it wasn't of course) and the field manual was quite specific about the fact that under no circumstances the archive should be allowed to burn, under threat of severe charges to both the watch and command officers at the base. The field manual said it should be, \"hauled out of the burning building as a first priority\". I guess the book was referring to a regular old fire-resistant safe, not this huge armored monstrosity.\n\nThe solution was preplanned and swift. The six of them were strong enough to push that steel cabinet out of the second floor window, taking part of the wall and all of that window with it in the process. The sergeant then proceeded to report his actions up the chain of command, again, very much by the book. The amount of screaming and shouting was staggering, the captain looked both very angry and very lost at the same time. I have never again seen this combination of emotions to this date.\n\nThe aftermath of these heroics was glorious. The damage done to the building was repaired in a few days; the safe did not survive the fall and was replaced with half a dozen smaller, standard steel cabinets. The captain was forbidden ever again from staging fire drills at this base and filed a transfer report in about a week after the incident.\n\nThe funniest thing was that the CO of that base had no way of reprimanding the junior sergeant without looking bad or criminally negligent at the same time, so he had to grudgingly commend his actions. The remaining 6 month or so of his service went relatively uneventfully. The story became stuff of legends and is fondly remembered every time I meet with my friends from that time.\n\nTL;DR an army drill instructor orders a fire alarm drill and causes serious damage to HQ building and a documents archive in it.\n\nEDIT: grammar, spelling, and I publicly swear I will never write posts from my phone ever again. Also thanks to the advice of a kind commenter I hope the drill sergeant analogy makes more sense now. Also I fixed one small small detail I got wrong when I first wrote this.",
        "created_utc": 1523617883,
        "upvote_ratio": ""
    },
    {
        "title": "Our garbage bins had to be removed due to a bollocks policy. No matter, we now have flower pots!",
        "author": "[deleted]",
        "url": "https://i.imgur.com/pZV5OEi.jpg",
        "text": "[deleted]",
        "created_utc": 1523614011,
        "upvote_ratio": ""
    },
    {
        "title": "No phones allowed.",
        "author": "Logseman",
        "url": "https://i.redd.it/zju2wwl92gr01.jpg",
        "text": "",
        "created_utc": 1523602537,
        "upvote_ratio": ""
    },
    {
        "title": "No phones/MP3 players allowed for music? Fine, we'll just bring an actual record player to class.",
        "author": "[deleted]",
        "url": "https://imgur.com/fM06Ouq",
        "text": "[deleted]",
        "created_utc": 1523591993,
        "upvote_ratio": ""
    },
    {
        "title": "Eat the paper.",
        "author": "lascorpion",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/8bwago/eat_the_paper/",
        "text": "When I was a toddler, I was sitting on the floor doing my toddler thang, and I stumbled across a piece of paper that looked really delicious. I began to eat said paper, and my mother walked up to me and decided to be sarcastic. \n\nShe said, “Well! Why don’t you just eat the whole paper?”\n\nI’ve never been one to back down from a challenge, even as a kid, so I looked her square in the eye and said, “okay.”\n\nShe left and returned and when she returned, I was nibbling on the last piece of that delightful paper. \n\nShe says that’s how she knew I was going to be a difficult child. \n\nShe was right. ",
        "created_utc": 1523591108,
        "upvote_ratio": ""
    },
    {
        "title": "Local flat earth group had a meet-up at a friend’s bar. He reserved them a very special table.",
        "author": "mike1305",
        "url": "https://i.redd.it/8dq0np8j6lr01.jpg",
        "text": "",
        "created_utc": 1523586214,
        "upvote_ratio": ""
    },
    {
        "title": "\"Take EVERYTHING out of your room\"",
        "author": "octive100",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/8bvnre/take_everything_out_of_your_room/",
        "text": "So, my parents are pretty cool most of the time. But not when they have had a bad day, that's when they take it out on me. Btw, TL;DR at end of page.  They aren't abusive for those wondering, it's just that on a bad day for them, the little things can tick them off. \n\nOn a different note, my parents have a strange way of getting rid of things they don't need anymore. So, every couple years, they take most of their things out of their room and only put back what they want to keep. I rarely do this and my room is a mess. \n\nSo one day, my dad gets fed up(it was a terrible day at work) and tells me to clean out my room. So I do my usual and shove things in my closet. A little while later he rolls around and says \"no, I mean take you're things out and only put back what you want to keep\" so I, being the lazy person that I am, I clean out a couple things and get back to having fun, so it's getting pretty late (11-12 at night) and my dad is pretty frustrated with how work is not going well and my general laziness and yells at me \"TOMORROW I WANT YOU TO TAKE EVERYTHING OUT OF YOUR ROOM AND PLACE IT IN THE LIVING ROOM\" . So I decide to put some legitimate effort in and take EVERYTHING out of my room. So first I take all of my personal items and put them in the living room. Then I call up some of my friends who are actually strong(I on the other hand am really weak) with offers of money and pizza. And they help me move everything else out of my room: my closet shelving system, my dresser, my shelves, my table, my loft bed(which disassembles into multiple pieces), all of my other furniture. Then I think I am done. But while we are enjoying pizza, I realize just how much more I can do. So now, anything I can get out I do. I take out my ceiling fan, all of the electrical outlet covers, my window shades, my closet doors, the light bulbs, the door, EVERYTHING. When my dad walked in he said \"what did you do? There's only blank wall, exposed wire, and Windows? \" I said \"I took EVERYTHING out of my room\" he was angry, but proud of himself for raising a smartass. He was supposedly the same way as a kid.\n\nTL;DR : you really should read the whole thing, but for those who are too lazy, my dad said to remove EVERYTHING from my room, so I did, including furniture, shades, electrical outlet panels, and closet doors.",
        "created_utc": 1523584612,
        "upvote_ratio": ""
    },
    {
        "title": "Local flat earth meetup at my friend’s bar. He reserved them a very special table",
        "author": "[deleted]",
        "url": "https://i.redd.it/uga4sre80lr01.jpg",
        "text": "[deleted]",
        "created_utc": 1523584095,
        "upvote_ratio": ""
    },
    {
        "title": "\"Why don't you go home?\"",
        "author": "nutsaur",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/8bve6p/why_dont_you_go_home/",
        "text": "When I was about eight years old my family went to visit my uncle.\n\nMy uncle loves ships and worked in the shipping industry his entire life.\n\nOne day my brother, uncle, and I were going to the top of the local mountain to see a historical ship come into the area.\n\nI didn't really want to go but my uncle said \"You'll regret it.\" when I said I wanted to stay home so I went too.\n\nMy parents went off somewhere else so it was just the three of us up the top of this mountain waiting for this ship.\n\nI was getting bored waiting for this ship so I asked where it was.\n\n\"The ship can't arrive until all the other boats leave.\"\n\n\"Why doesn't someone just tell them all to go home?\"\n\n\"Why don't you go home?\"\n\nMy brother and uncle laugh and I walk away.\n\nI walk down the mountain, past where we parked the car, down the road, along the beach, back onto the street, and back to my uncles place. The walk probably took two or three hours.\n\nI remember a lot of things happening on that walk home. Someone was laying in a bunch of bushes, I'm not sure if they were dead or asleep but being a child I just ran away and forgot two minutes later.\n\nSome youth group were playing sport on the beach and a girl with glasses caught the ball and promptly face planted. The coach awkwardly said \"Uh, good catch [name of girl]\"\n\nI was walking past a fence singing to myself and some kids put their water gun through a gap and squirted me. They seemed a couple years younger than me so I briefly considered walking onto their property and chasing them but kept going instead.\n\nI get back to my uncle's and grab a fruit roll up type thing - I'm feeling a bit hungus after walking so long.\n\nSoon enough my parents come home and my brother and uncle too. Mum is in tears because she thought I'd been abducted and the police were out looking for me too.\n\nMy parents and uncle were amazed how I could remember how to get home after never being to either the mountain nor my uncle's place before.\n\nTL;DR Drove to a mountain with my uncle, he joked about me going home because I was bored, so me being the sensitive child walked home.",
        "created_utc": 1523582100,
        "upvote_ratio": ""
    },
    {
        "title": "He asked me to rub his back.",
        "author": "[deleted]",
        "url": "https://i.redd.it/pxfwqakgmkr01.jpg",
        "text": "[deleted]",
        "created_utc": 1523579465,
        "upvote_ratio": ""
    },
    {
        "title": "\"Close the door on your way out.\"",
        "author": "ICantGiveLessOfAFuck",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/8bv3cg/close_the_door_on_your_way_out/",
        "text": "This didn't happen to me, but to my coworker.\n\nI work APCH (I greet people at the door, put stickers on returns and exchanges and check receipts) at Wally World, and I have a pretty chill manager. However, I have an APA (undercover) who has been here a while and thinks she can boss us around even though she isn't a supervisor or manager.\n\nMy coworker had a dying radio and asked the APA if she could get into the office to grab a charged one (office is locked to everyone except the Store manager, Assistant managers, AP manager, and the APAs).\n\nAPA says no because she is on lunch, to wait for the AP manager, and then tells my coworker to close the door on the way out.\n\nMy coworker says fine, then proceeds to slam the door on the APA, who was carrying her lunch and drink.\n\nTL;DR: Be nice to others if you don't want your favorite shirt to be drenched in ranch, Pepsi and spicy wing glaze.",
        "created_utc": 1523579330,
        "upvote_ratio": ""
    },
    {
        "title": "No cell phone, no problem",
        "author": "[deleted]",
        "url": "https://i.redd.it/zju2wwl92gr01.jpg",
        "text": "[deleted]",
        "created_utc": 1523573941,
        "upvote_ratio": ""
    },
    {
        "title": "\"This has to be a joke, tell me exactly why\"",
        "author": "youreahugeidiott",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/8buh4v/this_has_to_be_a_joke_tell_me_exactly_why/",
        "text": "About a year ago I worked at a hotel/conference center restaurant as a bartender.  As a relatively large property/venue, we did a lot of private company events as well as many weddings.  To handle these generally large groups, the hotel had a banquet event staff that handled these events by setting up temporary bars with their own bartenders.\n\nWell one day I'm busy handling my bar inside of the restaurant and one of the banquet event managers comes to me to tell me they have cut off an intoxicated guest that has been frequenting their temporary bar in the event hall.  This is a relatively normal practice and they give me a visual description and a last name of the patron.  But before I can ask exactly why the guest was cut off, they tell me to watch my female coworkers because he was trying to force one of the banquet bartenders into a closed storage closet. Bad news. Don't know why they didn't call they cops, not my call and I didn't witness anything. \n\nBusiness starts to pick up at the restaurant bar and I start to become busy when all of the sudden a man fitting the description comes up and orders a double tito's and soda.  Without hesitation I ask him for his last name, which he tells me promptly (thinking I'm just going to start him a tab).  It's the guy.  So I tell the guy, who we'll call Perv, very professionally, \"I'm sorry sir, but I've been told you've been cut off tonight from another bar and I cannot get you any more alcohol\". This is where the fun starts.\n\nPerv is with another dude that works for the same company who starts giving me a hard time about not giving Perv another drink.  As soon as this demand for justification starts playing out, Perv also starts making a scene as to how ridiculous him being cut off is.  Perv has the nerve to ask why he was cut off.  At this point I can't believe this guy is about to let me potentially put him on blast like this.  I give him a final out by saying \"sir, I'm really going to have to insist you leave the bar, it seems like by you've actions you've had a bit to drink tonight\".  As soon as I say this, his coworker starts busting my chops again about cutting him off and demanding reason and saying, \"This has to be a joke, tell us exactly why\"...so I let it all hang out.\n\n\nMe to Perv: \"Sir, you have been cut off this evening because you made inappropriate advances at a female bartender working the event in your event area.  If you would like, we could have the hotel security or police come down here to sort this out\".\n\nPerv: \"I have no idea what you're talking about, that girl and I were just talking\" (admitting he knows exactly what I was talking about)\n\nPerv's coworker: *Dies inside, looks at me while dying inside, looks at Perv, then removes himself from the situation while still dying inside*\n\nPerv was eventually removed by security.\n\nThis must have been a previous issue because the next day I was called in to meet with the CEO of whatever company Perv worked for, as well as the female bartender in question, and were apologized to profusely.",
        "created_utc": 1523573720,
        "upvote_ratio": ""
    },
    {
        "title": "Insufficient budget to properly upgrade the server setup. RAID 0 of two (or three?) different old hard drives it is.",
        "author": "COMPUTER1313",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/8bufkt/insufficient_budget_to_properly_upgrade_the/",
        "text": "I had a chat with an IT employee about a \"server\" setup that I discovered when I was checking a circuit breaker. The so-called \"server\" setup consisted of multiple desktop computers piled together.\n\nThe employee eventually mentioned about a coworker who was given a project to improve the \"server\" as it was having trouble with keeping up with the ever-increasing volume of data entries and reading.\n\n- Budget request for a proper server hardware? Denied.\n- Run the service on other existing server hardware? Other departments and some of the IT managers threw a fit due to concerns about THEIR services being impacted by my production department's needs. (My workplace has a lot of conflicts between departments. There are a couple stories that would go here or the notmyjob subreddit.)\n- Request for my production department to contribute some money to the server project because IT department won't? Lol no.\n\nThe coworker did more research, and noticed that there was a specific load that was hitting one of the desktop computers hard.\n\n- One or two 15,000 RPM hard drives and some sort of a hard drive controller card for that one desktop? Nope.\n- Request to move that one specific load to elsewhere? All options denied.\n\nSo the coworker decided to request permission through email to use RAID 0 of two or three hard drives from decommissioned computers. Permission granted.\n\nRAID 0 config of two hard drives (from my understanding) almost doubles the read and write performance (of the slowest hard drive in the config), slightly increases latency, and also doubles the risk of failure because if one drive dies or the RAID config spazzes out, all of the data is lost. All two or three hard drives are likely to have been used for years before being decommissioned, and then being brought back back into service.\n\nThe coworker pulled an old hard drive from the decommissioned computer (maybe two), setup RAID 0, and then pushed the desktop computer back into server usage.\n\nProblem solved.\n\nI am not an IT expert, but I am not looking forward to the day when manufacturing stumbles due to that RAID 0 config of two or three different hard drive models crashing. I hope there is regular data backup, but I'd imagine a failed RAID 0 config would require time to replace it and there will be a gap in the data records between the last backup and when the RAID config failed.\n\nEDIT: Why does my department have a server made of desktops under IT's supervision? My only guess is that some sort of office politics ended up with an ugly compromise.",
        "created_utc": 1523573342,
        "upvote_ratio": ""
    },
    {
        "title": "I mean, he's not breaking the rule...",
        "author": "[deleted]",
        "url": "https://i.redd.it/jpkn5hpayhr01.jpg",
        "text": "[deleted]",
        "created_utc": 1523570714,
        "upvote_ratio": ""
    },
    {
        "title": "You wanted me to move forward...",
        "author": "VenusSmurf",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/8btw3d/you_wanted_me_to_move_forward/",
        "text": "TL:DR at bottom. This is a slow build.\n\nI had an experience today that definitely qualifies as both petty revenge and minor malicious compliance. I will admit that I was chuckling afterwards, though I'm also having second thoughts about my own character. Even so...\n\nI drop my kid off at school every morning. The school always has faculty at the curb in front of the school to direct traffic, and one of the daily volunteers is a staff member notorious for unreasonable power trips over the most random things. (That's a different story. Suffice to say, she's not beloved by anyone.)\n\nIn any case, as parents pull up to the curb, she's supposed to wave them forward and keep the cars moving. There are other faculty doing the same thing, but she takes her job very seriously. Instead of politely waving the cars on as the other faculty do, she'll snap impatiently at parents, getting visibly angry if they're not quick enough.  Most days, the snapping escalates to yelling. It's gotten to the point where the kids are all ready to jump out with the cars practically still moving, just to avoid getting lectured by this woman.\n\nI didn't care enough to fight it, but after a year of this, there came a day when I had to drop my kid off for an early meeting. There was only one other car at the curb when I arrived, but this woman was already out and yelling at the driver to pull all of the way forward, even though he was only a few feet short. Again, nobody else was there, and the entire point of the curbside direction is to prevent traffic congestion that wouldn't be an issue for at least another hour.\n\nIn any case, he moved forward, and I did the same, pulling up behind the other car with only a few inches to spare...and she immediately rounded on me anyway, shoving her face through the open passenger window to the point where my kid had to lean back, and snapping that I wasn't far enough.  \n\n...there were literally three inches between my car and the one in front. I tried to politely point that out, and the woman lost it. Her face practically turned purple with anger, and her voice reached new volumes as she yelled that we were causing problems for the school and showing disrespect to her, that she deserved better, and some other nonsense about abandoning our community spirit.  Spittle flew in our faces as she actually pounded her fist against the windowsill.  Even I was shocked into silence, and my kid was legitimately scared.\n\nAnd then she grabbed my kid's arm. Not enough to cause pain, and she immediately let go when I snapped out of my shock and ordered her to back off, but that was my final straw. Nobody touches my kid. \n\nFor the past year, nearly every time I've pulled up at that curb, I've let my kid out at the first opportunity, pulled forward enough to make eye contact with this woman, and then deliberately slowed down to a crawl.  It drives her insane. She gestures wildly. She yells. She comes up to my car and raps on the window, then yells a bit more. I just sit and stare at her, never saying a word, never smiling or frowning. And once she's given up in the face of my lack of reaction or gone to yell at someone else, I calmly pull forward and drive away.  \n\nFor the record, I'm petty, but I'm not awful. Again, my kid gets out of the car before I get to my slow down spot, and this woman hasn't seen her or gone near her since the arm grabbing. If she ever does, I won't be limiting myself to petty curbside behavior.  I also don't slow down if doing so will cause noticeable problems for anyone else. \n\nAnd this is where the malicious compliance comes in. We've had rain for three straight days. My entire town is a giant mud puddle, and the school parking lot is practically flooded. EVERYONE was driving slowly today, partly because it was necessary, partly to avoid splashing anyone on the curb. Common courtesy and all that.\n\nTo make a long story longer, I'd let my kid out of the car and was about to drive on, not intended to be petty today, when the woman spotted me and immediately started yelling at me to go faster.  Even I have polite moments, though, so I rolled my window down to bring her attention to the giant puddle in front of her.  \n\nShe wasn't having it. Maybe it was the past year of dealing with me. Maybe she was just having more of an off day than usual. Maybe she was just being her normal self. Whatever the reason, she just kept yelling, and this time got personal. She insulted my car, my sense of community spirit, my inability to respect her, and even my driving skills. I kept waiting for expletives that never came, but she was being completely unprofessional.\n\nAnd I was annoyed. \n\n...so I drove forward at the speed she usually demands, just as I'd been instructed.\n\nI HAD warned her about the puddle. \n\nEdited, because I forgot the TL:DR.\n\nTL:DR Annoying woman yelled at me to drive faster, even after I tried to tell her about a puddle next to her. I drove faster. She got a shower she probably didn't want.\n\n\nEdit: Most of you are rightfully wondering why I apparently didn't report this. I actually did. The complaint was dismissed, supposedly because there wasn't any evidence the school could use to justify action, but really because this woman is related to the vice principal and to someone on the district board. That's a common problem in my community--everyone is related, and nobody wants to go after family or the family of friends. I'm sure I'm not the only one to have reported her behavior, but nothing has ever come of it. \n\nIn any case, I've asked the kids who go to that school, including mine, if she causes problems during school hours. Surprisingly, she doesn't. She spends all of her time in her office and doesn't interact with any but adults. That's probably for the best. \n\nUpdate: \n\nI was rightly chastized for not including her reaction. The woman was soaked from just below the waist down, but she was so shocked that she didn't really react at all. She just froze.  I'd suspected the reaction would come today, when I dropped my kid off this morning and after she'd had time to work up some proper outrage, and since I've already exposed my rotten personality, I can admit that I was genuinely looking forward to it.  \n\nThe expected confrontation didn't happen, though. When the woman saw me coming, she immediately jumped back from the curb--several feet back--then pointedly turned away and didn't move until I'd left. \n\nI really should feel bad for making her act like a frightened rabbit, but after everything, I'm just pleased that she probably won't mess with me again, and for the few moments I was there, nobody else got yelled at. Hopefully, that lasts. \n\n",
        "created_utc": 1523568897,
        "upvote_ratio": ""
    },
    {
        "title": "No cell phone, no problem",
        "author": "Nutritionisawesome",
        "url": "https://i.redd.it/zju2wwl92gr01.jpg",
        "text": "",
        "created_utc": 1523563640,
        "upvote_ratio": ""
    },
    {
        "title": "Here Is Your Tip!!",
        "author": "ragnarokxg",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/8bt7jx/here_is_your_tip/",
        "text": "So I was reminded by an earlier post about this story.  Back when I was working as a Pharmacy Tech while finishing up my degree I used to frequent a nearby restaurant as they had a bar area where I could order lunch and get it pretty fast.\n\nWell the lunchtime bartender had changed and so had the service I had started receiving.  I only had 30 mins for lunch.  So I would call and order ahead, and by the time I got there and got my drink served my food would be out. Well the new bartender started to pretty much ignore me because I didn't order an alcoholic drink.  This was the only one that had an issue with me being there and he made it known.  So after tipping good a few times he didn't change.  Well working in the service industry in my younger years I have guidelines all servers/bartenders should follow to get a good tip.  Well this guy did none, so I had stopped tipping.\n\nWell one visit after this I am paying my tab at the front again, because I had to go back and after being ignored I had enough.  Well he decided to confront me about not leaving a tip.  So I told him why he hadn't received a tip, and then told him I will tip him for the drink because I did not order my food through him.\n\nI realized I only had bills so I grabbed a dollar bill, tore it in half and threw it at him.  I then took the other half with me, and kept it for about a week before getting rid of it.",
        "created_utc": 1523563583,
        "upvote_ratio": ""
    },
    {
        "title": "Insult me and my work, then ask for a discount?",
        "author": "Pfefferneusse32",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/8bsjwa/insult_me_and_my_work_then_ask_for_a_discount/",
        "text": "This happened yesterday. Probably not the best business practice, it was mean, spiteful, and I might've over reacted, but.... well, this sub isn't called \"good decision making.\" \n\nI work in a metal shop, cutting out metal signs with a CNC plasma table. We also have a huge press brake and a giant shear that just eats through metal in a way that seeing it in action makes you hold your fingers farrrrr away. The signs aren't the big money maker of the shop, but it does help a bit, and it's flashy, so we keep on doing it. I have an order ready to be picked up by a customer of ours. This jerk Bob has been coming to us for 3 years. I hate him. Everyone hates him. Me, the welders, the secretaries, my boss. Everyone. He's rude, condescending, and just wants to wear you down until he gets what he wants. He buys our signs for very low cost and sells them for at least 4 times his buying price at car shows, the kind that basically have a flea market in the middle of them. He knows he's getting a *fantastic* deal on these and making good money on them. That's not enough for him. He nitpicks everything, tries to beat you down on the prices, no matter which employee he's talking to. It's gotten to the point that my boss is done talking to this guy, and would love to not see him again. I've been nominated to be the one to deal with Bob, because I don't get upset with him. (Spoiler alert, I do, I just hide it well.)\n\nThis order is for an upcoming car show, in the next week or so. As I'm going through the order piece by piece in front of him so he can sign off on it, he starts picking them up and giving them a once over. He has a stink face on and I know it's coming. I just know it. I prepare myself to hear him asking about the prices and if I could \"help him out.\"\n\nBut he doesn't say that. \n\nNo, instead he starts into saying \"Y'know, I'm surprised I can eve resell this trash. Not your best work.\"\n\nI'm frozen in anger. I think of the dozens of times I've tweaked designs for him, and most recently spending so much time to re-draw something in my CAD/CAM because it juuuuust wasn't quite right. I'm proud of my work. I know that I'm good at what I do. I try to do my best to make a good product for every customer that walks in, to give them something that will make them happy for the money they spend at a small, family owned shop. I haven't said anything in reply yet. Y'know, I'm just mad.\n\nThen I hear the most magical words. \n\n\"I dunno, could you take a little off?\"\n\nIt gave me joy to say \"Sure, I'll take half off.\" But what gave me more joy was firing up the shear and staring him in the eyes as I began cutting the unpurchased signs in half.\n\n\nWell, now there are no signs for him to buy, he doesn't have any stock, and he already bought his booths for the upcoming car shows. But that doesn't sound like my problem.\n\nHonestly wasn't thinking of the business side. I *did* kind of just waste $130 worth of material. When I told my boss he said \"I mean.... I wish you would've just told him to fuck off instead of cutting up the material. Eh, we were running low on shims anyway. If I never have to hear from Bob again..... eh, just don't lose it on anyone again?\"\n\n**TL;DR: Gave a customer half off.**",
        "created_utc": 1523558520,
        "upvote_ratio": ""
    },
    {
        "title": "\"I need to know where to get body parts from now!!\"",
        "author": "MaddenMan73",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/8bsisd/i_need_to_know_where_to_get_body_parts_from_now/",
        "text": "Worked at a auto body and paint shop back in the 90s, we had a guy that was somewhat a friend with the owner and would always call up and harass us by being a jerk/dick when we were busy and it was always for his benefit and for no benefit to the company.  One day he called me up and without identifying himself or greeting/etc he demanded \"Who do you guys get body parts from?\"  I was trying to respond that it was multiple vendors and I would need more information but he thought I was giving him the runaround so he demanded by commanding \"I need to know where to get body parts from now!!\".  So I said \"please hold\" and decided that I was done with his crap and so I gave him the phone number to the local hospital.   \n\nI found out from his son about a week later that he called the hospital and inquired about getting some new body parts and he didn't want old ones so they called 911 on him.   Apparently he was too embarrassed by all of this to call us back and either apologize or chew me out.  Still it made me feel good as this asshat had it coming. ",
        "created_utc": 1523558276,
        "upvote_ratio": ""
    },
    {
        "title": "I quit less than an hour later",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/8bs4pr/i_quit_less_than_an_hour_later/",
        "text": "[removed]",
        "created_utc": 1523555260,
        "upvote_ratio": ""
    },
    {
        "title": "Updated the hotel rooms sign, boss.",
        "author": "TheSecondReal0",
        "url": "https://i.redd.it/f1rbf3u5fir01.jpg",
        "text": "",
        "created_utc": 1523552977,
        "upvote_ratio": ""
    },
    {
        "title": "Teacher said no cell phones allowed in a test, not even for music. This kid brought in his record player.",
        "author": "[deleted]",
        "url": "https://i.redd.it/4b90unc23ir01.jpg",
        "text": "[deleted]",
        "created_utc": 1523548726,
        "upvote_ratio": ""
    },
    {
        "title": "how we findout the square of matrix in matlab?",
        "author": "chghjlkl",
        "url": "https://www.youtube.com/attribution_link?a=zy-qh74jrqM&amp;u=%2Fwatch%3Fv%3DD9ecHiWp9YA%26feature%3Dshare",
        "text": "",
        "created_utc": 1523548537,
        "upvote_ratio": ""
    },
    {
        "title": "When cell phones aren’t allowed in a test and you want to listen to music, just bring in a record player instead.",
        "author": "[deleted]",
        "url": "https://i.redd.it/jpkn5hpayhr01.jpg",
        "text": "[deleted]",
        "created_utc": 1523547936,
        "upvote_ratio": ""
    },
    {
        "title": "\"Students are taking their Physics Midterm exam today. I said no cell phones, not even for music since they could be used to cheat. \"",
        "author": "[deleted]",
        "url": "https://i.redd.it/alga1tc5thr01.jpg",
        "text": "[deleted]",
        "created_utc": 1523545411,
        "upvote_ratio": ""
    },
    {
        "title": "\"I gave you enough information.\"",
        "author": "jaxmagicman",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/8bqo9o/i_gave_you_enough_information/",
        "text": "So we have a database that is very difficult to maintain (not one I made, one we are forced to use).  It is easy to delete the wrong thing and then we are charged $250.00 to recover it.  Because of that, only I can delete something.  The data base has customer number, dates, and other items that are indexed.  The only 1 item that is unique to each document is the document ID number.  So for that reason I ask that people requesting the document be deleted provide the document ID number.\n\nI received a request to delete a document and it had everything on the document EXCEPT the id number.  I send an email back saying that I need the document ID number.  The response I got was not what I was expecting:\n\n&gt;Her: Why do you need the document ID number?  I gave you enough information to find it.\n\n&gt;Me: I know, but sometimes the documents share a lot of those attributes and the doc ID is the only one it can't.\n\n&gt;Her:  Look I don't have time to do your job for you, just find the document and delete it.\n\nSo out of curiosity I look it up using what she provided and just as expected there are two matching ones (usually they want one deleted because they duplicated it some way).  Now the nice thing to do would be to call her and tell her there are two but I don't want to delete the wrong one.  But she was very clear that I shouldn't bother her with this.  So I deleted both.  The duplicate and the one she probably wanted to keep.  Which led to.\n\n&gt;Her: I'm missing a document.  It was there but now it's gone.\n\n&gt;Me: Which one? \n\nShe gives me the information (not the document ID) and I tell her that is one she wanted deleted.  \n\n&gt;Her:  No, I wanted the duplicate deleted.  How are you this stupid?\n\n&gt;Me:  I did exactly what you said.  \n\n&gt;Her: You've got to get it back.\n\n&gt;Me:  Ok, but it is going to cost $250. \n\n&gt;Her:  What?? For your mistake.  I'm talking to your boss about this.\n\nIn the end, my boss backed me up 100%.  She ended up paying from her budget.  And she uses document ID's now. Nothing was said about her calling me stupid.  But whatever. \n\nEdit:  Since the most commens about this is how I should have done something different with database, /u/-ksguy- explained it best:  \"It's possible they don't have access to the database through a tool like SQL Management Studio, and instead use a simple GUI that gives limited options. In that case they wouldn't be able to run backups, restores, or mirroring.\"",
        "created_utc": 1523544188,
        "upvote_ratio": ""
    },
    {
        "title": "Told my mom \"Just throw it on the bed\"",
        "author": "SaunaAnts",
        "url": "https://i.redd.it/sldou3adohr01.jpg",
        "text": "",
        "created_utc": 1523543801,
        "upvote_ratio": ""
    },
    {
        "title": "Push those DNS changes even though they're broken? Sure!",
        "author": "Kaarsty",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/8bqg1u/push_those_dns_changes_even_though_theyre_broken/",
        "text": "I've been working with a startup for the better part of two years, helping them to build a prototype web application and implement it securely and smoothly. The development phase, and implementation phase went off without a hitch! Now, this startup needed some serious marketing assistance, and enlisted a firm that does just that, with some web development as well for good measure. Over a period of about 3 months this other company poached my client, whispering sweet somethings in their ear until they decided to move development over to their house as well, might as well keep it all under one roof right? This bothered me, but was something I felt coming right from the start. They're not going to sell strictly marketing when they have a team of 15 developers, they NEED to cover that overhead. A year later the product is in worse shape than when I left it, is still using prototype level code (though they'd promised prime-time ready app) and is set up SO poorly network-wise that I could blow it down with a sneeze. This week this other company asked me to go ahead and update the DNS records (name servers - they tell your computer where to find a website - what IP address its associated with) to run the site through Cloudflare (they provide routing and caching (speed) services), because I'd noted about a week ago that the site becomes extremely slow with more than 3 users on it at a time. Now, being a decent IT guy, I checked the DNS records held by Cloudflare before making any changes, just to be safe. What I found is as follows:\n\n- Missing A records (equates www.blah.com to an IP address)\n- Missing CNAME records (Aliases needed for routing purposes)\n- Incorrect SSL set up\n- Bad redirects and missing page rules\n\nI made mention of this to the other company, and they got a little snippy with me, alluding to how difficult it is to have to work DNS changes through me (nevermind the fact they've had control over DNS for the last 6 months) and blah blah blah. I was once willing, but at this point you couldn't pay me to sit down with them and explain the workings of DNS and general routing. They then asked me to push the changes so they can get to work!\n\nDONE! Oh, now the website won't come up? SSL protocol mismatch what? Can't find www.blah.com? Wonder why thats happening.\n\nThe client launches this week, and their site has now been down for ~3 hours. I've offered assistance, and my emails have gone unreturned. \n\nI think that maybe, just maybe, this client will be back. ",
        "created_utc": 1523542336,
        "upvote_ratio": ""
    },
    {
        "title": "This guy",
        "author": "1thatonedude1",
        "url": "https://www.reddit.com/r/NotMyJob/comments/8bpund/made_the_ethernet_cable_boss/?utm_source=reddit-android",
        "text": "",
        "created_utc": 1523539176,
        "upvote_ratio": ""
    },
    {
        "title": "Don't touch our devices until school? Okay.",
        "author": "NeenanJones",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/8bpyd5/dont_touch_our_devices_until_school_okay/",
        "text": "On mobile, lurker, yadda yadda yadda.\n\nAt the beginning of this school year we our school rolled out an iPad program for the students. We all got ours around a month before school started and we're told to follow the instructions on the sheet we were handed with it. After about 20 minutes with the iPads at our home we realized the \"self-serve\" app we were supposed to use to download apps was broken, of course there still was an app store (they hadn't removed it yet) but, we were told to not touch it, or install our iCloud account. Now I already had a bit of a reputation here for being a troublemaker that works inside the rules, so I didn't touch it. \n\nThe first day of school rolls around and I show up with an empty iPad. There's nothing on it except the sef serve and settings, the school removed everything else, my teach of course calls me up and asks why I didn't just install the apps, so I let her know I was following the rules. Eventually they fixed self serve and I got my apps.\n\nSo I know it's not a great case but I felt like sharing it. Let me know if there's anything I'm missing out on.",
        "created_utc": 1523538060,
        "upvote_ratio": ""
    },
    {
        "title": "Hot dog cut in half",
        "author": "[deleted]",
        "url": "https://i.redd.it/s8v74bxy6hr01.jpg",
        "text": "[deleted]",
        "created_utc": 1523537933,
        "upvote_ratio": ""
    },
    {
        "title": "Sorry but the handbook clearly says",
        "author": "TGotAReddit",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/8boi21/sorry_but_the_handbook_clearly_says/",
        "text": "So back in high school I got a job at a pizza place for kids with the scary animatronics and arcade (you know the one).  Well i worked there for exactly 1 year, and my sister had worked there before me (9 years earlier), which is how i knew I’d get the job even though i hated kids.\n\nWell, soon after I started, our district manager got replaced.  The new manager was this bitch we’ll call BL for Bitch Lady.  She had it in her head that her ideas were the best ideas because she was from New York and therefore was better than a lowly little city like Erie.  \nSo soon after she becomes our district manager, she starts implementing all new practices and also firing people.  She fired our store manager (who had worked there as the store manager for 18 years and was the sweetest lady imaginable, who went on to sue over it). She took away our free meal while we worked.  She forced us to get rid of our employee microwave so we were forced to buy our lunches there since we couldnt heat up our food.  Things like that.\n\nWell BL hated me.  She constantly would get on my case for every last little thing she could find wrong, and in every case, I proved her wrong, which she didnt like.  I also was the only person who could effectively do anything in the game room at the time since we had no game tech, preventive maintenance guy, and all of the current game attendants were 16 y/o guys who didn’t want to deal with that and really just wanted to work the kitchen.  (We had an annoying sexist issue where all the managers would hire guys and stick them as game room attendants and refuse to move them and then also refuse to let girls have hours being game room attendants even when they asked, but thats unrelated).  She didn’t want me doing game room though because i enjoyed that too much, so she cut my hours from just under full time (so they didn’t have to give benefits) to 2-3 four hour shifts a week, and only ever working kid check.  She then hired all new people to do the jobs i had been doing in game room.\nWell I was of course pissed.    So i looked through the employee handbook and checked what the dress code was.  Now I couldnt wear colored hair or anything easy as that, but you had the choice of either blue, black, or red polo shirts, paired with black or khaki dress pants.  You also could wear a black sweater or jacket over your shirt (so you didnt freeze in the winter but the handbook said nothing about when that was allowed, just that it was.). Well all of us had been told to wear blue or black polos with black dress pants when we were hired so that was what EVERYONE wore to work.\n\nI went and got a second job at the bullseye store next door and shared my uniform of “red shirt and khaki pants” and was the ONLY worker dressed that way every day of work.  I also get cold a lot and since BL forced me to stand still at kid check right by the door every day, I decided I was going to wear the allowed black sweater.\n\nWhen she came in and saw me in my completely non-matching uniform, and a long sleeved sweater in the middle of july, she about exploded.  She pulled me into the office and went on and on about how i was breaking dress code.  I pulled out the hand book and showed her the exact wording and how I wasn’t doing anything wrong.\n\nShe sent me back to kid check, still fuming but again having nothing she could do about it.  By the time I quit a few months later, she had cut me to a single 4 hour shift a week, and i never once got off kid check.\n\n\n(For anyone wondering, I worked game room so much that i had my own set of keys to every lock in the entire store except the front door and the managers office given to me by the previous store manager before she was fired because i did the token removals, fixed the games, did all of the preventative maintenance, and helped her with doing the game tech job since we didnt have one at the time.  I still have the keys, 4 years later)\n\n\nSorry for formatting, on mobile",
        "created_utc": 1523519914,
        "upvote_ratio": ""
    },
    {
        "title": "no cell phones!",
        "author": "barrybenson69",
        "url": "https://imgur.com/gallery/rEOiC",
        "text": "",
        "created_utc": 1523516045,
        "upvote_ratio": ""
    },
    {
        "title": "About as malicious as you can get lol",
        "author": "Bamafan6566",
        "url": "https://i.redd.it/ds3b9w8lucr01.png",
        "text": "",
        "created_utc": 1523510562,
        "upvote_ratio": ""
    },
    {
        "title": "\"Oh, honey... That's not enough\"",
        "author": "blupps",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/8bmp1s/oh_honey_thats_not_enough/",
        "text": "So this was a few years ago when I worked at a Subway store in Australia. We had a Vietnamese Pork Roll promo, and as part of it, coriander (cilantro) joined the ranks of our salads for a while.\n\nThe recommended amount was pretty much tear up a single leaf for a six inch. For those of you who don't know, coriander is strong, and tastes like complete ass.\n\nUnfortunately, most people would see a leafy green and expect spinach or lettuce amounts of coriander. This was usually quickly resolved with an \"are you sure? It's pretty strong\" and they'd decide against it...\n\n...\n\nSo this lady comes in to the store, one of those with a nasty bitchy attitude who starts by just saying the name of the sub demandingly. \"Vietnamese Pork\".\nGood thanks and you? \nWe sort out the bread and cheese etc. and then we get to the salads.\n\nBitchy Customer (BC) asks for the coriander, and I oblige, putting the normal amount on.\n\nBC: More than that!!!\n\nMe: Are you sure? It's pretty strong.\n\nBC: *staring at me*\n\nMe: Sure.\n\nI proceed to about triple the amount, cause sure, some people are weird and like coriander. After she sees what I'm doing, her response is a condescending:\n\n\"Oh, honey, that is not enough.\"\n\nFuck it. I go full nuclear with the coriander. Like it's lettuce. She doesn't say anything, I wrap up her sub, charge her, and she leaves.\n\nSad I missed her reaction to her nasty sub, but never did see her again after that.\n\nEdit: formatting",
        "created_utc": 1523498842,
        "upvote_ratio": ""
    },
    {
        "title": "What’s something you find awkward?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/8bmo1z/whats_something_you_find_awkward/",
        "text": "[removed]",
        "created_utc": 1523498587,
        "upvote_ratio": ""
    },
    {
        "title": "Simple, everyday malicious compliance that you can do too.",
        "author": "310_memer",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/8bml4i/simple_everyday_malicious_compliance_that_you_can/",
        "text": "[removed]",
        "created_utc": 1523497825,
        "upvote_ratio": ""
    },
    {
        "title": "This dog was told to \"use the fire hydrant\". [X-post r/ whatswrongwithyourdog]",
        "author": "MutatedPlatypus",
        "url": "https://www.reddit.com/r/WhatsWrongWithYourDog/comments/8bgay3/human_dog_go_youse_that_dog/",
        "text": "",
        "created_utc": 1523493300,
        "upvote_ratio": ""
    },
    {
        "title": "1 Hazard ID every day? Okay.",
        "author": "dhammadan",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/8blx3f/1_hazard_id_every_day_okay/",
        "text": "A few years ago I worked for a safety company. This safety company decided they wanted to pump up their paperwork game (looks good to Occupational Health &amp; Safety and does some good things for their insurance) and decided the best way was to make it mandatory to fill out one hazard identification form every day, for every person. Our managers were quite unpleasant about the whole thing and threatened our jobs if we didn't comply.\n\nI hatched a plan. Since these are legal documents they have to be passed along to the government when they are requested I figured we might be able to get something to happen with them. I got 15 of my co-workers to start writing hazard Identification forms about the stress caused by their unemployment threats, scanning and saving them. After 10 or so days of writing these things I sent an email to OH&amp;S with a few samples.\n\nNeedless to say they were not impressed. Within 2 days of my e-mail our company got a notice of a 'random audit.' Our management decided to start getting their paperwork in order and came across these forms we'd filled out.\n\nThey scrambled to take down the posters saying we needed to do them, but it was too late. The orange hats showed up on site and went straight to our paperwork since they knew exactly where to look. 3 individuals got fined as well as the company.\n\nRekt",
        "created_utc": 1523491715,
        "upvote_ratio": ""
    },
    {
        "title": "English music? OK!",
        "author": "BamBiffZippo",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/8bl0r0/english_music_ok/",
        "text": "First time poster, tl;dr at bottom. Let me know if I did the complying wrong.\n\nI teach middle school students Spanish, and during work time I put on music for my students. Sometimes it's oldies, sometimes it's pop, sometimes it's folk, sometimes in English, sometimes in Spanish. I will occasionally honor requests, if I'm not in a particular musical mood.\n\nOne of my students has a bit of a white-girl attitude towards things that aren't in English, we'll call her WG. She complains loudly about anything I make them so our listen to in Spanish, so essentially everything in my class. \n\nThe kids asked as soon as work time started for music. WG chimed in right away to request \"English music only please\" in her whiniest tone. \n\nI immediately went to my computer and pulled up a list of British, English musicians and began playing the songs suggested for each one.  Much complaining on her part and laughter by the others ensued.\n\nTl;dr student asks for English music, gets music by artists from England.",
        "created_utc": 1523483985,
        "upvote_ratio": ""
    },
    {
        "title": "Memories of Brighton Beach Memoirs",
        "author": "BoredNumb",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/8bktuj/memories_of_brighton_beach_memoirs/",
        "text": "TL,DR; Know what your students have access to before you abandon them.\n\nSo I’ve wavered over whether or not this was appropriate for posting in this group but I figured worst case scenario is that someone deletes it so I hope everyone enjoys my small contribution.\n\nBack in 10th grade I got involved with the Forensics club.  For those that maybe confused, this had nothing to do with crime scenes or dead bodies.  Instead it was essentially acting competition.  Students would work up a short 5 to 7 minute scene, perform it in front of judges and then would “win fabulous prizes!!” (read as “get a ribbon”).  The teacher sponsor (hereafter to be referred to as Mrs. P for prudish) would run rehearsals with all the club members for an hour and a half after school and had a class that focused on the techniques of and practicing for the competitions. It wasn’t required that you be in the class to be in the club but those that were tended to be seen as more devoted to the club.  It seemed like it might be fun so I joined the club without taking the class and did fairly well, made semi-finals a few times but never broke into finals at any completion.\n\nThe next year, I decided to join again but figured that maybe taking the class would help me break into finals once or twice.  Big mistake.  You see, Mrs. P had a really great group of seniors (read as “did well in competitions”) in the previous year that didn’t leave the area to go to college (read as “couldn’t get over their glory days as important drama competitors so hung out between college classes at the high school”).  Mrs. P picked a few favorites from the class and handed off everyone else to the “veterans” during the after school practices.  Now while these folks may have done real well in competitions, they were not teachers.  Depending on which one was “helping” me, I would be given, at best, conflicting advice or, at worst, advice that was illegal to use in competition.  I went to Mrs. P several times for help but she just kept pushing me back the veterans saying that she didn’t have time.  I never broke semifinals and my grade suffered for it as competition results were about 50% of the class grade.  \n\nThis class would eventually be the class that would break my 4.0 GPA.  I was desperate to get good grades because I knew my parents were not going to pay for my college and I needed all the financial aid I could get.  I was not happy to say the least.\n\nI cannot remember if the competition season takes up a bit over half of a semester or a bit over half of a year but the important point is that there is a bit of time that the class has to do something that is not related to official competitions for purposes of the class being an official one.  When we got to this point in the year, Mrs. P gathered up her favorites and started working with them on possible selections for the following year.  She told the rest of us to work up a scene; we could use any script in the filing cabinet and that we were going to do an in class competition that would be worth 25% of our grade.\n\nAfter allowing the crowd to dissipate from in from of the filing cabinet (which was actually 3 large 4-drawer units), I walked over and started looking for something to perform.  I don’t know why I did this but for some reason instead of opening one of the top or second row drawers like I normally did, I opened one of the bottom drawers and went all the way to the back.  The scene I pulled out was a piece from “Brighton Beach Memoirs”.  I could not believe that this was in here.  Mrs. P was the most uptight person I had met in my life up until that point.  I double checked the script and it had all the correct check in markings so it was a valid file script.  For those of you that have seen the play or the movie, Brighton Beach Memoirs is about a teen aged boy just hitting puberty and dealing with all the wonderfulness of that time in a boy’s life.  The scene occurs between the lead and his older brother talking about the appropriateness of the lead looking at his female cousin undressing through a window, masturbation, almost every trigger point someone like Mrs. P could have about teen aged boys and girls.  I knew exactly what I had to do.\n\nFor the next two weeks, I practiced this scene every possible minute I could.  There is a way for a single individual to do a two person scene.  It involves continually switching posture, vocal intonation, focal points, etc. to indicate the different characters.  It can cause points to be lost if you don’t do it effectively.  I practiced until I had it locked in and could do it automatically.  Lines were practiced until they were practically becoming responses to questions in real life to others when they were appropriate.  I was going to nail this.\n\nSo performance day came.  The judges were Mrs. P, one of her favorites (major brown-noser) and a random other student.  I was flawless!  Most of the class was rolling with laughter.  Mrs. P’s face could not have been sourer.  I finished, took my bow and waited for my critique.\n\n*Pencil tapping*\n\nP: \t“Do you really feel that piece was appropriate for this class?”\n\nMe:\t“You said we could do any piece in the cabinet.”\n\nP:\t“Let me see the script!”\n\n\n\nI hand her the script.  She scours over it with her eyes searching for proof of it being a fake.  None found.\n\n\n*Frenzied pencil tapping*\n\nP:\t“Yes, it looks to have been but do you feel you exercised good judgement in performing it at your age in this setting?”\n\nMe:\t“While I can understand that there are those that might be uncomfortable with the subject matter, I don’t feel it inappropriate.  Part of storytelling is putting a spotlight on uncomfortable subjects so they are not swept under the rug.  These are issues that some of us may be dealing with right now and it may help to know that others think about it as well.”\n\nP:\t“Would you perform this piece in front of the principal?”\n\nMe:\t“Have him come up.  I’m ready now.”\n\nP:\t“Would you perform this piece in front of your parents?”\n\nMe:\t“They have been helping me practice all this week.”\n\nP:\t“This is highly inappropriate for this environment.  I think you showed great lack of consideration in choosing it.  Please take your seat.”\n\n\nIn all fairness, while she marked me down in every category that she possibly could, she gave me perfect marks for techniques.  I had to fight with her to correct the marks from the brown-noser as she graded me lowest marks in all categories.  When I challenged the technique marks, she couldn’t give an example of what I had messed up on to warrant the low scores.  Pretty much everyone else in the class said it was a great performance and didn’t understand why she was so down on it.   \n",
        "created_utc": 1523482459,
        "upvote_ratio": ""
    },
    {
        "title": "SPAM THIS NUMBER",
        "author": "152736gwgydk",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/8bk9jb/spam_this_number/",
        "text": "[removed]",
        "created_utc": 1523478051,
        "upvote_ratio": ""
    },
    {
        "title": "My dog isn't allowed on the couch, so when told to get down he complied",
        "author": "Aodaliyan",
        "url": "https://imgur.com/oTHI0ZW",
        "text": "",
        "created_utc": 1523475282,
        "upvote_ratio": ""
    },
    {
        "title": "Sure, I'll follow your rude demands just because it will take forever.",
        "author": "-xystonulex",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/8bjlpy/sure_ill_follow_your_rude_demands_just_because_it/",
        "text": "First thing in the morning at work I answered the phone and was greeted with a woman who impatiently demanded to speak to a co-worker.  \n\nI let her know that my co-worker was most likely over at the main office, and offered to giver her the number. \nThe woman cut me off before I could tell her that the main office was in a different building, and  I had no idea if my co-worker would even be in the office at that time in the morning.\n\n She became very snarky and rudely told me that this was a long distance call, and I was wasting her time by suggesting she make another long distance call.  \"Why the hell don't you just WALK to the office and see if she is there?  Instead of thinking I can spend all day making long distance calls!  I'll wait while you get her.\"\n\n\"Okay, fine\" I said \"the main office is in a different building, so it will take me about 15 minutes to get back to you.  Bye\"\n\n\"Wait, how about you just give me the number to the main office?\"\n\n\"What a great idea!\"\n\n",
        "created_utc": 1523473003,
        "upvote_ratio": ""
    },
    {
        "title": "\"Hey, can you put those pillowcases on the pillows?\"",
        "author": "[deleted]",
        "url": "https://i.redd.it/k177rljumbr01.jpg",
        "text": "[deleted]",
        "created_utc": 1523470709,
        "upvote_ratio": ""
    },
    {
        "title": "Madlads at the bar",
        "author": "[deleted]",
        "url": "https://i.redd.it/sk1wwb2nt9r01.jpg",
        "text": "[deleted]",
        "created_utc": 1523468700,
        "upvote_ratio": ""
    },
    {
        "title": "No Hall Passes Allowed",
        "author": "bye_ren",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/8bipf2/no_hall_passes_allowed/",
        "text": "Throughout my life I’ve had incredibly bad GERD and Acid Reflux issues that accompany it. I’ve been late to events, thrown up in awkward places, and even delayed dates due to it.\n\nWhen I was in middle school I had a teacher I’ll call Ms C. She was a Reading teacher that absolutely believed her class was a gift from god. She was also my homeroom teacher, so I’d start my school days in her class first thing in the morning.\n\nAs I said, Ms C was ridiculous. She wouldn’t allow ANY hall passes and tardy slips were handed out like the candy she hid in her drawer and ate in front of us (yes this is a real thing). We had specific testing that we did every year in the spring and fall, it was the state wide week long kind of testing. During this testing, you went to your first class and stayed there while testing until lunch.\n\nEven though we spent roughly three-four hours in the room she would not budge on hall passes. This is where the malicious compliance came in. I had shown up late to school due to my stomach issues, having thrown up for a full 30 minutes and throwing off my morning routine. I show up RIGHT when we started testing.\n\nBeing the person she is, Ms C called me over and handed me my tardy slip. Okay. I ignored it, while still agitated, and went to my desk to test. However, something definitely wasn’t right. I was getting the pre-puke mouth watering that I usually get right beforehand and my stomach was still doing summersaults. I held it in until the testing 15 minute break.  Then I ran up to the front of the room. \n\nI had to have looked like a sailor getting their sealegs for the first time. I was so dizzy and kept burping. I asked “Ms C, could I please use the bathroom I think I’m going to be sick.” \nShe, of course, declined. \n“You’ll be fine, you know I don’t let the class use hall passes in this class. You would have had time to use the restroom before class if you got to class on time. Return to your seat.” \nObviously, this was not possible. I know when I’m going to be sick. So I gently reiterated and even tried to compromise. \n“Ms C, I’m genuinely going to throw up, if you won’t let me leave, can I at least use your trash can?”\nShe again declined. Of course, at this point I couldn’t hold it anymore and with the trash can option being a negative I was pissed, sick, and running out of options. So I decided to use the closest thing to me and threw up on her desk. \n\nShe was of course furious, but she let me leave to go to the nurse. I threw up twice on the stairs on the way to the nurse’s office and was sent home for the rest of the day. After that, she allowed us to use the 15 minute breaks for restroom breaks.",
        "created_utc": 1523466293,
        "upvote_ratio": ""
    },
    {
        "title": "My wife, a Venezuelan smartass",
        "author": "gaudiocomplex",
        "url": "https://i.redd.it/o9b5o99ewar01.jpg",
        "text": "",
        "created_utc": 1523461955,
        "upvote_ratio": ""
    },
    {
        "title": "Written 2 week notice",
        "author": "Straight_Holla",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/8bh6s8/written_2_week_notice/",
        "text": "[removed]",
        "created_utc": 1523454517,
        "upvote_ratio": ""
    },
    {
        "title": "[Startup Struggles] - Episode 3 - You want to ignore crucial procedures on a whim for no real reason?",
        "author": "GTAIVisbest",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/8bg56i/startup_struggles_episode_3_you_want_to_ignore/",
        "text": "Our company finally managed to sign a contract with our clients in the middle of 2017. We ship and sell certain goods per KG to retailers via air freight in many different countries. We have one main client with whom we do most of our business, and we have a couple of shipments to them per week.\n\nEvery shipment involves a lot of documentation and there's a long procedure involving document creation and invoicing that needs to be followed to ensure everyone (the custom's broker, the client and the airport authorities) receives the documents they need. When we started exporting, the responsibility of organizing this mess fell to me and I was given a smelly heap of disorganized documents to streamline. Fortunately, over the months, I've managed to condense the procedure, and, with the help of a few well-automated Excel programs I wrote, the whole procedure gets itself done with a lot less work than before.\n\nOne quirk of this procedure is that all invoices need to be sent to a particular contact in our client's company. This particular contact somehow insists on using his private e-mail to receive work documents instead of his professional one, probably because he's able to work from outside of his office. I guess his upper management signed off on it since he never tried to be discreet. Usually, there would be no problem, except for the fact that this private e-mail has a limit of about 2MB per attachment received. If the e-mail has attachments that exceed this limit, the mail won't go through.\n\nIn the beginning we had *big* problems as I was attaching all 6 invoices into one mail, totaling about 5MB, and sending it to him and his coworkers. No matter how many coworkers I CC'd in the email, the one guy using his personal e-mail wouldn't get the documents and all hell would break loose every time.\n\nFinally, to get around this, I started sending him 4 or 5 different e-mails, depending on the size of the shipment, as to break up the documents so he can read them. This worked fine for a while until one day my boss approached me and asked me about it. I confirmed to her that we were sending 5 different e-mails every time, otherwise our client wouldn't be receiving our invoices.\n\nShe was appalled, and started lecturing me about how \"this wasn't good practice\" and \"to continue this way is not possible\", and that I had to \"find a solution\". I informed her that if I join all the invoices together, the mail doesn't go through to my client's inbox, and if the client doesn't receive the invoices they can put in a claim through their system that eventually leads to us not being paid for what we exported. Still exasperated, she continues to sigh and keeps repeating \"No, no, this is not how it's done, you cannot send 5 different e-mails to the client for his invoices!\". Even though I try to explain it again to her, the lecturing continues regardless.\n\nYou want me to revert back to sending one e-mail, even though I *know* it will cause problems down the road when we stop getting paid? Alright, whatever floats your boat.\n\nA day or so later, when we had our shipment, I sent one large e-mail with all the invoices bundled inside, which of course did not arrive to the client. I texted the guy responsible (the one using his personal e-mail) through messenger with some details about my Malicious Compliance, and much to my delight, a couple of minutes later he sends a LARGE e-mail, with our CEO and his CEO in CC, claiming that the documents were not received and this will result in us not being paid. I waited an hour or so and then sent him the 5 e-mails normally, with the invoices, as I always do.\n\nThe next day, my CEO calls me early in the morning to ask about the e-mail from the day prior. I explained to him that I was told to join all invoices into one email and that resulted in the client not receiving them. He, getting upset, tells me to \"manage my own goddamn sector\" and that I should do whatever it takes to make sure things run smoothly. I agree vigorously and grin, knowing what's coming next. Later on, my boss slinks into work, looking sullen, angry and depressed. She starts telling me how badly our CEO ripped into her for \"something she didn't even know would be a problem\" as I nodded solemnly.\n\nSafe to say, she didn't interfere in the invoicing process for a while after that incident.",
        "created_utc": 1523444020,
        "upvote_ratio": ""
    },
    {
        "title": "Neural Networks can play the malicious compliance game too (xpost ProgrammerHumor)",
        "author": "pnjun",
        "url": "https://gfycat.com/GoodnaturedSnoopyHellbender",
        "text": "",
        "created_utc": 1523429767,
        "upvote_ratio": ""
    },
    {
        "title": "Neural Network plays the malicious compliance game",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/ProgrammerHumor/comments/8bcpmx/when_you_set_a_goal_for_your_neural_network_and/",
        "text": "[deleted]",
        "created_utc": 1523429126,
        "upvote_ratio": ""
    },
    {
        "title": "Told to make less noise. Quitting the task makes less noise doesn’t it?",
        "author": "Silvgalaxy",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/8bf0ai/told_to_make_less_noise_quitting_the_task_makes/",
        "text": "Sorry for the formatting in advance, I’m on my phone and was reminded of this whilst reading some stories here.\n\nA long time ago when I was about 14 I lived with my parents in a house with a dishwasher. I assume that it would be common for a household to label unpacking the dishwasher as a chore and mine wasn’t any different.\n\nI was unpacking the dishwasher. I wasn’t asked to unpack it nor had I  just used a plate that needed to go in. I had benevolently decided to unpack it because I felt like being a good son.\n\nMy Dad was watching tv at the time and the noise I was making was obviously starting to get to him. It’s a dishwasher with cutlery and plates being stacked on top of more cutlery and plates - it’s gonna make a noise.\n\nAnyway, my dad yells at me, “COULD YOU PLEASE MAKE LESS NOISE WHILE OTHER PEOPLE ARE TRYING TO WATCH TV”.\n\nPissed off (I believe rightfully so) at such an ungrateful and uncalled for bout of anger I simply stopped doing it midway and went upstairs to continue playing xbox. This as you can imagine significantly reduced the noise factor.\n\n...\n\nI’m annoyed but start getting immersed into the game I was playing.\nA few minutes later and I hear the faint noise of cutlery and plates being stacked up on top of other cutlery and plates.\n\nBet he thought twice about yelling at someone doing everyone (including himself) a favour again. \n",
        "created_utc": 1523428321,
        "upvote_ratio": ""
    },
    {
        "title": "When you set a goal for your neural network, and it *technically* has the correct output.",
        "author": "montylemon",
        "url": "https://gfycat.com/GoodnaturedSnoopyHellbender",
        "text": "",
        "created_utc": 1523424878,
        "upvote_ratio": ""
    },
    {
        "title": "Half is half.",
        "author": "Inimici",
        "url": "https://i.redd.it/o1ta3f2so7r01.jpg",
        "text": "",
        "created_utc": 1523422865,
        "upvote_ratio": ""
    },
    {
        "title": "You're with us or you're out!",
        "author": "Voidcomplex",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/8beexv/youre_with_us_or_youre_out/",
        "text": "I worked for what was originally a very nice small software development company. It was a great first job and I put my heart and soul into this company. Working back late, getting in early and generally going well and truly beyond what was required by out clients and management. \n\nThis all started to change when the management team began to believe their own hype. We grew as a company and as we grew things got worse and worse. Suddenly for a business of say 20 people we had 5 managers and now a brand new GM to keep everyone in line. \n\nI say everyone in line because I as well as a number of good, hardworking colleagues started noticing more office bullshit and less constructive work. So some of them started to leave and find other jobs. Thats when the culture of the business really started taking a turn for the worse. \n\nAnyone who was giving their 4 weeks notice, suddenly were escorted out of the office the next day, and before anyone else was there. Management had decided that people should just “disappear”. We would get in to work and a fellow colleague’s desk was clear and someone we had known for years had just vanished. No group wide email. no conversation, no transition of work. To even mention their name was somehow viewed as absurd. We were even instructed not to tell our clients that people had left, why they had left. They. didn’t. exist. anymore.\n\nBy this stage I had counted 8 team members had left in the last 12 months and with them a heap of industry specific knowledge. For a small business this was huge.\n\nThis kind of overbearing management and staff turn over killed all work ethic what was left of our team were pulled into the office of the GM for a meeting on work ethics, moral, management expectations and discipline.\n\nSo we get pulled into this meeting and get told in no uncertain terms pick up your attitude or find someplace else. the GM then proceeded to tell us we were all replaceable within the business and how as “future leaders” we should be honoured to be working at this place. The pep talk doesn’t quite go the way GM intended it to. It only reconfirmed everyones feelings and we all go back to our desks. \n\nBy this stage everyone that had left found other employment and some colleague even found me a job. Without letting on to my current employment, I had applied for, interviewed and was awaiting to get confirmation that I got the new position. \n\nTurns out the night after the GM’s meeting I get the confirmation I need. \n\nThe very next day I write my letter and stroll in to the GM’s office. He is naturally disinterested as I pass him my resignation letter, tri-folded neatly, so that he has to take the time to open it. \n\nGM: “What is this?”\nMe: “I have been thinking of our meeting yesterday.”\nGM: *looks down a the letter then up at me* “Un- huh.” *slowly starts to realise what the letter is*\nMe: “I believe it outlines all my necessary contractual obligations.”\n\nI turnaround, walk out the door, sit at my desk and wait for the shit to hit the fan. And it does. \n\nIn the time it takes to send an email I see the CEO run to the GM’s office and the door is slammed shut. Heated words are exchanged, then they both leave for 3 hours in what I suspect is a crisis meeting. \n\nThe next day the entire organisation except me is pulled into a day long meeting where they have to restructure the entire teams to cover the extensive work that i was doing. \nTheir loss is significant. \nFor the remainder of my 4 weeks I’m not allowed to tell anyone of our clients I am leaving. They can’t afford to let their clients know they have lost another employee. The rumours in the industry are already mounting.\n\nFrom what I found out later, the company is a shell of it’s former self. \n\ntldr; GM gives remaining employee’s a “pep talk” to try and boost moral. Two options: You’re with us or you’re out.” Backfires when I hand my resignation letter in the next day causing restructure of entire departments.",
        "created_utc": 1523420932,
        "upvote_ratio": ""
    },
    {
        "title": "Rain, the bane of my existence.",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/8bduet/rain_the_bane_of_my_existence/",
        "text": "[deleted]",
        "created_utc": 1523414884,
        "upvote_ratio": ""
    },
    {
        "title": "Repainting a Parking Lot",
        "author": "koolios44",
        "url": "https://i.redd.it/crorm55kr6r01.jpg",
        "text": "",
        "created_utc": 1523411759,
        "upvote_ratio": ""
    },
    {
        "title": "Penny wise, dollar foolish.",
        "author": "Bobby_Bouch",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/8bczkk/penny_wise_dollar_foolish/",
        "text": "This wasn't as malicious as some of the others here, but probably one of the costlier ones.\n\nBackground: Sometimes I need to operate a very large and expensive ~$800,000 piece of rented heavy machinery.\n\nI had a job site that was a 3 hour drive for me (2 day job), so I asked my company to get me a hotel. They refused. I drove there the first day, i finished working for the day and called my boss again.\n\n* Me: You sure I can't get that hotel? The drive is ridiculous.\n* B: No.\n* Me: Can you comp my travel expenses (240 miles at $0.55 cents per mile).\n* B: No, if you ask me again, I will replace you and have someone else go out instead.\n* Me: Can you book me a hotel?\n\n\nMy boss annoyingly replaced me with one of my co-workers and I had to go to my usual work place instead. \n\n**The next day... (Job site opens at 10 A.M.)**\n\n10:15 am: I'm in the office when I hear my boss yell out \"WHAT DO YOU MEAN HE HIT THE PIER!\".\n\nThe guy that replaced me ended up damaging the rented equipment. Unable to operate it was sent for repairs, the day was lost and we would have to reschedule and rent it out another day (about $3,000).\n\nBonus: Later that day the rental company calls with a repair estimate of $65,000.\n\nBonus x2: The government agency we were contracted by got wind of the workplace accident, and required all operators to get a certificate 3 states away to operate the machinery from then on out to prevent these types of accidents. So the company had to send me and my coworker on a 3 day vacation, paying for 3 nights in a hotel, as well as our usual pay, as well as travel expenses and food expenses. Also, the certificate cost about $1,000 per person.\n\nAll in all the company ended up paying around $72,000 all because they did not want to pay for my hotel.\n\nTLDR: Company saved $250 by not buying me a hotel. My replacement ended up damaging the equipment, wasting a day in the field, wasting $3,000 in equipment rentals, employee salaries, $65,000 worth of repairs and 3 days for 2 people to travel to another state to complete a safety training to avoid future accidents.",
        "created_utc": 1523406807,
        "upvote_ratio": ""
    },
    {
        "title": "STOP TALKING",
        "author": "Brudius",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/8bcp5u/stop_talking/",
        "text": "So working at a call center, we run upon some interesting things. The issues we deal with can be pretty complex. However sometimes they want to explain things through and through when not necessary. \n\nI was trying to explain the answer to this customer when the following happens.\n\nLady: STOP TALKING RIGHT NOW!\n[I comply and stop talking. She explains some irrelevant information for 5 minutes. I haven't made a peep.]\n\nLady: Hello? Hello? HELLO?!?!?!?\n\nMe: You told me to stop talking, so I was respecting your wishes. Would you like me to talk now?",
        "created_utc": 1523404488,
        "upvote_ratio": ""
    },
    {
        "title": "Orders are orders!",
        "author": "_Project2501",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/8bchit/orders_are_orders/",
        "text": "Small story, but thought I’d share.\nTL:DR Followed orders and got a mini vacation out of it. \n\nThis happened in 2015 when I was in Basic Combat Training (BCT) with the US Army at Fort Benning, GA. \n\nBit of a backstory on me, I joined when I was 22, and those four years of experience working and providing for myself may not be much but it was enough to set me apart from most of the other soldiers who were almost all fresh out of high school. I was also in peak physical shape and an asshole, so the Drill Sergeants seemed to like me from the start.\n\nIn BCT everyone goes by the buddy system, and the soldier I was paired up with was dying or something so he had to go to sick hall. \n\nSo like 5 AM we get shuttled to sick hall and after they tell the guy he isn’t dying we are dismissed. The procedure from here is to call Battalion CQ  to let them know you need pick-up and they will forward the message on to your Company and a Drill Sergeant will come get you. \n\nSo we do. They order us over the phone to remain there and wait. So we do. And nothing happens. \n\nBattalion is less than a mile away, but we have orders. And frankly, I am loving the break from pushups and low crawling. \n\nHours pass. We call periodically and each time we receive the same instructions. Finally the sick hall clinic is closing and so I make one last call, inform them we will no longer be able to call as the clinic is closing, and am told again to wait there to be retrieved by a Drill Sergeant. \n\nIt gets dark. We have now been waiting and relaxing for over 12 hours. If you haven’t been to BCT, let me just tell you that this is vacation. Also, there really wasn’t anything else we could do. If we had decided to just leave and *anything* happened to us on the way back we would be so dead. No point to take that risk. \n\nWhen the Drill Sergeant finally showed up late at night we snapped to parade rest and waited for his reaction. \n\nDrill Sergeant: What time is it private?\nMe: 2245 Drill Sergeant!\nDrill Sergeant: (nods slowly, gets right in my face, voice threatening) And how long have you been here, Private?\nMe: 17 Hours Drill Sergeant!\nDrill Sergeant: (Veins now bulging in his temple and he is turning a beautiful shade of red) And what *the fuck* have you been doing this whole time private?\nMe: (hiding a shit-eating grin) Absolutely nothing Drill Sergeant!\n\nThe private next to me visibly wilted and the Drill Sergeant, well, he exploded. This was a 250lb very angry and very loud human who (I found out much later) has actually strangled people to death in combat. \n\nHe went on for a bit about how no one knew where we were and threatening us with everything from anal hemorrhaging to death by overexposure to cleaning agents after all the cleaning we were going to do.\n\nAt some point while we were pushing he paused long enough to ask some question that I can’t remember,  but I slipped in to my reply something about our unwavering commitment to following orders. \n\nThis actually made him pause for a second and even though my face was in the dirt it was like I could see gears turning. Remember, this Drill Sergeant and I have a pretty good relationship. He asked a few more questions and soon the whole story came out. \n\nWe kept pushing, and he kept yelling, but now he was actually praising us for following orders. It’s pretty amazing how he could be just as angry and intimidating while threatening us with mortal danger as he was while praising us. After a bit of that he took us back and they allowed people to walk back from Sick Hall after that. \n",
        "created_utc": 1523402800,
        "upvote_ratio": ""
    },
    {
        "title": "Don’t want me in a nice dress? Fine.",
        "author": "yarbs514",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/8ba5k4/dont_want_me_in_a_nice_dress_fine/",
        "text": "So I just discovered this sub, and I think I have a story for y’all. \n\nThis happened a couple of years ago, I was in high school and wearing a red dress. \n\nOkay, it was spirit week (in layman’s terms: dress the hell up in your schools colors, paint your face, come to football games, and a school assembly) the entire school was filled to the brim with reds and blacks and whites. \n\nI happened to be wearing a red dress. \n\nIt was to my knees, long sleeved, and cut my figure nicely. I thought I looked spiffy, and my friends said I looked good. Hell, everyone said I looked good. \n\nExcept Hall-Bitch. \n\nHall-Bitch (HB) was a woman who hated my family and myself because we weren’t the most pious perfect people ever to walk into church and she hates the fact my family still doesn’t go to the Sunday lunches with all the other snippy southern ladies. She constantly pulled me aside all year for dress code, my shorts are too short (they weren’t), my top can’t be tucked it (it could) and other bullshit. \n\nThis time I heard her faint “EXCUSE Me, Miss!” From the doorway of the cafeteria and I felt a hatred so deep it pains me even now. \n\n“Yes Mrs. HB?” I say back to her, perfectly polite. \n\n“Your dress, it’s a violation of dress code.”\n\nWhatAndHow.jpeg \n\n“How so, Mrs. HB?” I ask, genuinely curious how my KNEE LENGTH and LONG SLEEVED dress was against violation. \n\n“I can see your back.” HB’s voice sounds like she’s trying out for the position of Delores Umbridge. \n\nThe dress did dip in the back, yeah, but it didn’t go under my shoulders and my hair covered all of my skin. I was flabbergasted, and taking my silence as an agreement HB starts to read me her version Miranda rights. The school dress code policy. \n\nShe’s ranting and raving and writing me up to go to the front office and shit man it’s been a bad day already-\n\nWait a second. \n\nDress Code Rule: 13.) A student can wear a school sports uniform that’s in violation of dress code policy during spirit week or if the team the student represents has an event that day. \n\n“Mrs. HB! I have a sports uniform in my car, may I wear that?” I ask, a plan already forming in my mind. \n\nHall-Bitch agreed that I was allowed to do that, and she’s clearly imagining the cheer leading uniforms that this rule had been made for. She even commends me for school spirit, saying it was a great thing that I was showing dedication. \n\nI walk out to my car, reach in my sports duffle, and consider my options. \n\nI was in three sports at the time, but l had two uniforms on hand. Cross country and track had the same uniform, so I decided I should go with my track booty shorts and tank top. It was track season, we had a meet that weekend, my ass looked great. \n\nI walk back into the cafeteria and HB has a heart attack. \n\nWhen I say that the track uniform had booty shorts I mean it, the tank top tight across my chest and riding up on my hips. It was made for running long distances, not winning beauty contests. \n\nShe’s screaming at me, yelling about fingertip length and how dare I make fun of a very serious high school dress code rule. Her face is red, the whole cafeteria is looking at us. \n\n“I have another uniform” I say. “For a different sport.” \n\n“Change!” She screams at me. “For the love of god change!” \n\nOkay. \n\nI walk back out to my car, my best friend following me out. I pick out my other team’s official uniform, change in the car, and have my best friend help me put on my swim cap. \n\nI walk into the cafeteria in my swim team official suit. No back, the fabric paper thin, the sides coming up to just under my ribs showing off my entire hip, my butt barely covered, barefoot. \n\nI’m wearing my swim cap and goggles just to be cheeky. \n\nI look at HB, her face purple she was so mad, storming over to me with literal steam coming out of her ears. The whole cafeteria is invested in this point, looking at the two of us standing off. \n\n“Principles office!” She screamed. “Now!” \n\nShe grabs my arm, frog marches me straight to the principles office, and shoves me right into this mans desk. She’s screaming, foaming at the mouth. \n\nShe’s explaining how terrible of a child I am, how I’m belittling her and making fun. \n\nThe principle stops HB with a hand, and pulls out the student handbook. He reads the dress code rules. He looks at HB and says: \n\n“Well, yarbs514 isn’t technically breaking the rules. She can carry on the school day as regular.” \n\nAnd that’s the story of my day (that started) in a red dress. \n\ntldr- got dress coded in high school, followed rules that allowed me to wear my swimming uniform the whole day. ",
        "created_utc": 1523385781,
        "upvote_ratio": ""
    },
    {
        "title": "Tennessee Libertarians Run 22 Candidates for Governor",
        "author": "beibiddybibo",
        "url": "https://www.recuro.org/feed/libertarianpartyoftn",
        "text": "",
        "created_utc": 1523385151,
        "upvote_ratio": ""
    },
    {
        "title": "I was at the receiving end",
        "author": "Lazarth",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/8b9qnr/i_was_at_the_receiving_end/",
        "text": "[I'm writing on mobile so please forgive any formatting issues.]\n\nI work at the research and development lab of the parent company of many well known clothing brands. My main job is running tests on fabrics and preparing the fabrics for testing. I love my job and everyone I work with. My biggest complaint though is the garment and fabric sizes. Not everyone communicates the size required for different tests very well and sometimes I have people ask me to run specific tests on samples that are WAY too small.\n\nYou can't get a 9\"x4\" sample from a 5\"x5\" square of fabric.\n\nSo I often casually complain or officially email people on their sample sizes. One of those people happened to be a coworker, let's call her Bell, who I had previously asked to send larger fabric sizes. \n\nTuesday rolls around and I get an email from Bell asking me to get weights from a fabric sample she has sent in to the lab. When I check the lab, there is a bag with enough fabric inside of it to cover the entire lab is white fabric. And I have to deal with cutting tiny 2\"x2\" squares out of it and properly recycling the remaining. \n\nWell played madam, well played. ",
        "created_utc": 1523382908,
        "upvote_ratio": ""
    },
    {
        "title": "\"Could you use headphones?\"",
        "author": "CreamyRootBeer",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/8b8lph/could_you_use_headphones/",
        "text": "I was in my Digital Electronics class last year (High School), where we were working with Arduinos. For a little project, the teacher had distributed little speakers and components for a small noise maker. After it was all done, however, I continued using the speaker to make various sounds and songs. It should be noted that this speaker is not loud, but it's not quiet either. After about 3 weeks of noise, somebody begs me, \"Could you use headphones, please?!\" I ask them to confirm that they want me to do so, as I know the difference between my headphones and the speaker. After he confirms, I hook up my headphones. He's shocked when my headphones are at least 2 (possibly even 4) times louder than the speaker. When he looks at me, I simply shrug, a massive grin on my face, knowing he, quite literally, asked for it.\n\nEdit: volume.\n\nEdit2: I would often help others in the class, as well as be friendly, and so this wasn't taken as a jerk move as much as just funny.\n\nEdit3: Someone mentioned, the Arduino has pretty much no volume control, so the volume is entirely dependant on the setup you have.\n",
        "created_utc": 1523375227,
        "upvote_ratio": ""
    },
    {
        "title": "When you make an Instagram account for your cat and the first DM you get is asking for nudes...",
        "author": "sushicats",
        "url": "https://i.redd.it/a5tzfzht13r01.jpg",
        "text": "",
        "created_utc": 1523373036,
        "upvote_ratio": ""
    },
    {
        "title": "from r/funny",
        "author": "[deleted]",
        "url": "https://i.imgur.com/30pIICV.png",
        "text": "[deleted]",
        "created_utc": 1523371692,
        "upvote_ratio": ""
    },
    {
        "title": "Couple ordered to stop performing oral sex...",
        "author": "Fineus",
        "url": "http://metro.co.uk/2018/04/10/couple-involved-lengthy-bridge-sex-bonfire-night-fined-7454271/",
        "text": "",
        "created_utc": 1523369317,
        "upvote_ratio": ""
    },
    {
        "title": "You get what you pay for. This is what you get when given a half hour for a 2-3 hour job.",
        "author": "precision_guesswork3",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/8b7nzi/you_get_what_you_pay_for_this_is_what_you_get/",
        "text": "Ten years ago I was working as an electrician and one of our largest accounts was 7-11. They were starting to sell the stores as franchises and became increasingly tight on their maintenance budget. I received an assignment in South Miami for repair of the cooler lights (apparently a customer got shocked when touching the door), as an emergency call in the evening, and had to drive almost 2 hours in rush hour traffic to get there. About 15 min from the store I get a call from my Service Manager (SM). It goes something like this: \nSM: Give me a call once you get there and assess the situation. \nMe: Ok sure.\nSM: And they're only giving us 4 hours for the job.\nMe: I hope that doesn't include travel time...\nSM: 4 hours including travel. Can't go over!\nMe: Alright but that doesn't even give me a half hour to work.\nSM: 4 hours! Can't go over!\nMe: Fine. I'll give you a call when I get there.\n\nArrived to the store, opened up the cooler door lights and see what needs to be done. A proper fix will take 2-3 hours. I call back SM. \n\nMe: Hey this is the issue ..... It's going to take 2-3 hours here. \nSM: I already told you it can't go over 4 hours. That's all the customer has given us. \nMe: Can't be done. What do you want me to do?\nSM: I already told you! Fix the lights and keep your time to 4 hours!\nMe: Again that's not possible... (I'm an electrician not a magician).\nSM: So you want us to pay you for all your time when we are only going to get paid for 4 hours? Do you expect the company to just eat all of this cost? Get it done and don't bill over 4 hours!\nMe: You got it boss\n\nBy this time I only had about 15 min left of actual time to work. I went in, disconnected the ballast, capped off the wiring and shut off that circuit. Now they had no cooler lights! But at least there was no risk of anyone getting hurt. Got my time sheet signed and left. \n\nNext day I get a call from SM. \nSM: Just got a call about the store last night. Apparently the lights never got fixed. What the hell happened?!\nMe: Well I only had a half hour at the store. I didn't have time to replace the ballasts. (Continued explaining exactly what was done).\nSM: Are you serious? You went all the way down there and just turned off the breaker! Now we have to go back under warranty! Go back down there and repair the lights!\nMe: How long do I have this time?\nSM: Just fix it properly and let me know when you're done.\nMe: You got it boss\n\nWent back down to the store, fixed the lights properly and left. Billed 8 hours since it basically took all day with travel. A full day that I got paid and the company didn't, when I could have just stayed a couple extra hours to do it right the first time. SM never gave me a shit about how long a job will take again. \n\nEdit: Thanks to all who helped fix the formatting!\n",
        "created_utc": 1523367737,
        "upvote_ratio": ""
    },
    {
        "title": "I'm Very Angry and I'll Hold",
        "author": "barrymccockner76",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/8b7nei/im_very_angry_and_ill_hold/",
        "text": "When I was first married I had a job working for a call center for a smaller regional bank. Compared to the massive bank that eventually bought them out-you know, the one with the horses and stagecoach waiting to get robbed, such a great symbol for a bank-this bank was actually pretty good about helping idiots with overdraft fees.\nI quit this bank long before they changed the laws in the US regarding these fees so I don't know how prevalent they still are, but back then my job as one of the first people someone would talk to at the bank was usually telling someone's balance, making a transfer for them, closing accounts, but mostly dealing with irate people wanting these fees reversed.\n\nWhich makes sense. These fees suck and can set off a cascade of several overdrafts once checks and other debit charges hit. You can quickly get buried and we were given a lot of discretion, especially with first time offenders. Regional Bank would let us reverse them all if we decided, and since it wasn't my money if someone was nice and honest in how they asked I'd always reverse them all.\n\nThen there were the people who took the entitled, trashy, all my problems are everyone else's fault approach. These were the types of folks who were repeat offenders, who'd had fees reversed multiple times before, and who the bank would make us escalate to a \"supervisor\" to override and get them reversed. Usually we'd tell them no, they'd get pissed and hang up. But a lot would ask for a supervisor after we said no, which I was fine with at that point (later I became a \"supervisor\" who just took those calls all day, but that's a story of fresh hell for another day) we'd put them on hold, call the team leader, tell them the deal, then warm transfer them and move on to the next call.\n\nEventually big bank would have a 24 Hr call center, but back when it was the regional bank we closed at 6pm. Sometimes we'd get our last call just before and be on the phone way past 6, which the bank was fine with. We didn't get dinged for long calls like big banks do. They just wanted us to stay on the call until they were satisfied one way or the other. We were allowed to hang up if they started swearing or became otherwise verbally abusive.\n\nSo one day a lady calls me just before 6, and she wants fees reversed. And she's a total bitch about it. We go round and round about how we've done this several times already and I can't help her this time, and she asks for a supervisor.\nI knew my supervisor left at 5 that day but we could usually transfer to a different team leader, and usually one was designated to stay late until we were all off our calls.\nBut for some damn reason they had all left by then. I put her on hold and physically got up and walked around to double check. When I'd call their line it'd just ring and I'd get the hold music.\n\nI went back and told the angry lady this, which had the imagined effect. By this point she'd already screamed, swore at me, etc so I was fine to just hang up on her, but then I had an idea. Let's call her WTB for white-trash bitch.\nWTB-I want to speak to a supervisor RIGHT FUCKING NOW.\nMe-I'm sorry ma'am, but we close at 6, it's now 6:30 and none of them are here. You'll need to call back in the morning.\nWTb-I'm not waiting on hold in the morning again to go through all this. I want to talk to one now.\n\nMe-But there aren't any here. \nWTB-Well I'll just wait until there is!\nShe's just going scorched earth at this point and daring me to hang up on her.\nSo I decided to comply. I said, ok please hold, I'm transferring you to the supervisor queue.\n\nUsually I call first and do the warm transfer, but since I knew no one would pick up I cold transferred her to the queue. I wasn't sure it would let me do it because it ties up my line until someone picks up, but once I hung up the receiver it let me clock out, and since the call time didn't matter I left her on hold and went home. \nI wish there was a way to see how long she actually waited. I'm sure she thought she was holding me up from going home!\n\n ",
        "created_utc": 1523367563,
        "upvote_ratio": ""
    },
    {
        "title": "(mild) I can't buy any more puzzles right now...so sayth the keeper of the checkbook",
        "author": "Mistress_Jedana",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/8b7m1w/mild_i_cant_buy_any_more_puzzles_right_nowso/",
        "text": "My husband said I have too many jigsaw puzzles right now, and I'm not to buy me anymore.  [He is not being serious, he really doesn't care if I buy more.  Just like I don't care if he buys himself more golf clubs or D&amp;D books or garden supplies..]\n\nI only have like 15, btw; one Ravensburger Disney and the rest Thomas Kinkade Disney.  I have 3 I haven't done yet, and this is why he said I shouldn't buy me any more.  So I follow his instructions; I did not buy ME any more puzzles.\n\nI signed up for Reddit Secret Santa, Puzzle 2018.  I bought my giftee two puzzles, and someone else will buy me puzzles.  Ha!  Take that, husband of mine!\n",
        "created_utc": 1523367192,
        "upvote_ratio": ""
    },
    {
        "title": "Boss told me to make an ethernet cable today. No specification of length. Jokes on them.",
        "author": "PinkiRoo8001",
        "url": "https://i.imgur.com/30pIICV.png",
        "text": "",
        "created_utc": 1523365833,
        "upvote_ratio": ""
    },
    {
        "title": "This customs declaration form filled out by the Apollo 11 Crew stating \"departure from Moon\".",
        "author": "UnnecessaryAppeal",
        "url": "https://image-store.slidesharecdn.com/25cd3e1f-c4eb-4004-9054-08c9b852d62b-original.jpeg",
        "text": "",
        "created_utc": 1523356745,
        "upvote_ratio": ""
    },
    {
        "title": "Malicious Compliance Fail",
        "author": "Malikissa",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/8b65r4/malicious_compliance_fail/",
        "text": "So a couple years ago I worked for a local cosmetics company doing production, making lipsticks mostly. Now, the owners are sweet, but lousy with business, and we're obsessed with finding out the true cost of their lipstick, ie how much labor they paid me to actually make them.  \n\nThis turned into some annoying micromanaging, so I decided to give the exactly what they wanted. I wrote down every second of my time. It was all accounted for, down to 1 minute 56 seconds to wash hands and put on gloves after removing gloves to scratch my nose.  \n\nAfter I wasted probably a full hour of my shift with this nonsense, I turned it in and got ready to clock out. And, to my utter horror, my boss LOVED it, thanked me profusely, and told me that was exactly what I should do every day from here on out.  \n\nDammit.",
        "created_utc": 1523350116,
        "upvote_ratio": ""
    },
    {
        "title": "Moving out",
        "author": "gcov2",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/8b5y9i/moving_out/",
        "text": "So my roommate accidentally knocked up his girlfriend of a few months and kicked me out. \n\nI wasn't officially registered there although I tried to because without an official address I couldn't get money support for my studies which I need desperately. Although I work part time. My roommate just couldn't be bothered and I needed his consent. \nHe wasn't malicious, just a brat and a lazy fuck. Spoiled. Only child. You know those. \n\nImportant is I don't have a contract and if anyone finds out I live there his contract gets terminated as well. Since the contract is very old he pays about a third of the rent the complex manager could get now so he wants him out of course.\n\nFew days before I leave for vacation he casually drops on me I have to get out because his girlfriend is moving in.\n\nLiving situation here is hard and I don't have a lot of money. To give you an idea, it takes about a year to find a good payable apartment. So I was trying to find a new apartment and for that I needed his statement that I always paid my rent, which he declined giving since I never officially lived there/wasn't registered and if anyone noticed he would be kicked out.\n\nHe is not rich either. And I brought my new washing machine and he kicked out his old one.\nSo after I returned from my vacation I moved out 2 months ahead of schedule. \n\nNow they don't have my washing machine anymore and have to pay double rent since her contract still goes on for 2 months and he can't do anything since I never officially lived there.\n\nI moved my stuff to a temporary place which doesn't cost me anything if you wonder. I don't have much. \n\nEdit: I won't report him. I moved out ahead of schedule because that was best for me and I saved some money. I have nothing to gain by reporting him although of course I thought about it. Briefly and bitterly.\n\nStill, I'd rather keep the moral high grounds. Better karma.\n\nEdit2: for satisfactory reasons: he is trying to get the money and sends me daily messages. First angry, accusing insults and now pleading. I do not respond. I'm just smiling. Feels good. Wonderfully malicious. ",
        "created_utc": 1523347012,
        "upvote_ratio": ""
    },
    {
        "title": "Class dismissed",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/8b5x8o/class_dismissed/",
        "text": "[deleted]",
        "created_utc": 1523346629,
        "upvote_ratio": ""
    },
    {
        "title": "I'm a nanny, not a lifeguard. (X-post from r/idontworkherelady)",
        "author": "BeautyNoBeast",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/8b5645/im_a_nanny_not_a_lifeguard_xpost_from/",
        "text": "Posted this on r/idontworkherelady and they suggested I share here as well\n\nAlright, so this happened this past summer. For context: I was working as a live in nanny for two of my cousins (8M &amp; 13F) to help pay my tuition. My aunt bought us all pool passes, and since we are from a rural town, we went there pretty much every day. I have a lot of stories from there, because I guess the only moderately fit college students at that pool were all lifeguards?\n\nCast:\n\n8M is my 8 year old male cousin\n\n13F is my 13 year old female cousin\n\nBC is the absolutely lovely /s lady \n\nAnd Me will be me of course \n\nStory:\n\nI was at the pool on an incredibly warm (for my area of the Midwest at least) day. It seemed like every child under the age of 15 in our entire town had made the same decision as us. We had been there about two hours and I was forcing them to reapply sunscreen (both are ginger, so if they burn... they burn). Suddenly this woman walks up to me with her 3 small children. None of them could have been more than ten. \n\nNow, I paid her no mind, though her shrill voice seemed pretty loud even compared to the children running around screaming. I was applying sunscreen and had a large glop of it in my hand when suddenly I feel someone grab me and spin me around. (Now I have severe social anxiety in most cases, but I also have my mother's temper when provoked)\n\nBC: I. Said. Excuse me! \n\nMe: Well, that was rude.\n\nI started to turn back to 8M, but she grabbed me again. My cousins weren't too happy about that. 8M is a devil child, (I was trying to teach him discipline, but my aunt and uncle had let him become a royal pain; biting people when he didn't get his way, scratching people till they bled, etc) and I could tell he was about to do something so I asked 13F to finish his sunscreen while I dealt with BC.\n\nBC: My children need sunscreen. Put it on.\n\nMe: Umm excuse me? \n\nBC: You heard me. I said. PUT. IT. ON. \n\nMe: Look lady, it's not my fault if you forgot to bring sunscreen for your kids. \n\nBC: What the H3LL kind of pool hires pathetic wastes of space like you?!\n\nMe: And what kind of mother sets this kind of example for three small children? (I'll admit, I mouthed off... but I was always taught that respect has to be earned, even by elders)\n\nI really thought BC was going to slap me or something at this point, instead she got super quiet and calm. I think she was trying to be threatening but she really wasn't. \n\nBC: Okay, I'm going to give you one last chance. WE. NEED. SUNSCREEN. NOW.\n\nWell, I still had that glob of sunscreen in my hand, so I thought *What the h3ll?* BC wanted sunscreen, she was gonna get sunscreen.\n\nSo I walked towards the four of them, and instead of bending down to put it on one of the children, I patted BC on the head (getting as much in her hair as I could) and walked away with my cousins to enjoy the rest of our day by the pool. \n\nPetty I know, but I don't regret it one bit.\n\nTL;DR: went to the pool with my cousins, lady thought I worked there and demanded I put sunscreen one her children as well. I put sunscreen in her hair and walk away.",
        "created_utc": 1523336744,
        "upvote_ratio": ""
    },
    {
        "title": "“How long have you been there?”",
        "author": "Nate_36",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/8b4pnb/how_long_have_you_been_there/",
        "text": "I work at a call center for software support, a lot of customers will ask how long an agent has worked there when we pick up to see if it’s worth explaining their issue to or not and we’re supposed to tell them. (Can’t lie to the customers). They refuse to give new agents the chance to learn because they “don’t have time to wait longer for an answer”\n\n\nMy response is “I got in at 9:00 this morning, how can I help you today?”\n\n\nThey usually hang up, funny thing is I’ve been there for 5 years and could’ve helped them easily.",
        "created_utc": 1523331958,
        "upvote_ratio": ""
    }
]