[
    {
        "title": "My high school's senior anti-prank. Was told you would enjoy.",
        "author": "HelloItsMeYourFriend",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/83z2o3/my_high_schools_senior_antiprank_was_told_you/",
        "text": "cross posting this from an ask reddit thread that i replied to earlier today:\n\nMy high school was trying to prevent a senior prank since the class before us had got a little out of hand. They basically told us not to have one, that they would get anyone who did anything in a lot of trouble, yada yada\n\nSo somebody has an idea. What if we do an \"anti prank\". The idea had floated around the halls and everyone knew what we were going to do. For an entire week, every senior was going to bring a potentially threatening item for a senior prank, and do nothing with it.\n\nThe week starts and that Monday, nearly the entire senior class carries a banana with them to every class. This is a school of ~2600 student, 650 graduating class. So there are hundreds of bananas being carried through the halls, teachers and assistant principals freaking out. By noon, an announcement was made that all bananas needed to be eaten or thrown away or they would be confiscated. So by that afternoon, every banana was taken away from the student.\n\nThe next day got even better. Somebody has the idea that we should all bring a gallon jug of water with us to class. And to no one's surprise, again their is an announcement that they are going to start taking up the water jugs for fear of what we are going to do with them. But this time, the students got creative. People are resentful now and not wanting to give up their precious water. Students are getting creative, hiding them in backpacks, avoiding teachers in the hallways, whatever it took to keep their water jugs. But eventually, most of the jugs had been confiscated.\n\nSo the students start taking to social media. Tons of tweets and mentions are going out to local news stations, TMZ, Oprah, Ellen, you name it, they got mentioned. All of these messages are going out along the lines of \"School is confiscating all water, not allowing students to drink water #highschooldrought2kxx #weredying #sendhelp. You get the picture. Before the end of the day, two different news reporters were at our school. Guess we had the last laugh after all.\n\nTL;DR: School made silly rules to not let us have a senior prank. We anti-pranked them and their rules back fired. lots of negative press over nothing malicious ever happening.",
        "created_utc": 1520892859,
        "upvote_ratio": ""
    },
    {
        "title": "Drop that X-Wing!",
        "author": "neoslith",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/83yu6t/drop_that_xwing/",
        "text": "~~Many many years~~ A long time ago, in a suburb not very far away, Lego and Star Wars together was something novel and new. My brother had Luke's X-Wing. He was 11 and I was 8.\n\nSo I'm running around the family room with his star fighter, when my brother notices.\n\n&gt;\"NeoSlith, that's mine. Drop it!\"\n\n____\n\nAnyone ever play 223 brick pick-up before? That was my brother's first time.",
        "created_utc": 1520891020,
        "upvote_ratio": ""
    },
    {
        "title": "Corporate Dress Code Policy, and my updated wardrobe",
        "author": "The_Only_Unused_Name",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/83ytz5/corporate_dress_code_policy_and_my_updated/",
        "text": "I work in an IT department. We were able to wear khaki slacks, tennis shoes, and a polo shirt to work- the unofficial IT uniform. Our CEO deciding it was time to make everyone step up their game, and to the protests of pretty much everyone, updated our policy to \"Business dress or better.\"\n\nSo as I was searching for a GOD DAMNED BUSINESS SUIT to wear to my job where I fuck around of the floor with cabling, and crawl into attics occasionally, in a thrift shop I happened across a USED TUXEDO. I looked like a hapless prom date in a 1980's rom com. Fancy that, it's just my size as well. I picked that bad boy up for a song, shined up my black shoes, and off to work.\n\nWithin a week, the policy changed. Now it specified \"No Tuxedos\". it also specified that the dress code was to be business, which meant black pants, a shirt, jacket, and tie. So I sold the tux on facebook for almost what I paid initially, and back to the thrift store I go. I came out with a almost neon green jacket, multiple gaudy shirts, and a number of god-awful ties.\n\nYet again, within a week of me looking like a technicolor hobo, the code changed to \"COLOR COORDINATED Business attire\". They took out the \"black pants\" qualifier. Not able to sell this batch of trash, I instead just gave it back to the thrift store and found a gaudy peach suit, and a classic 1970s baby blue disco looking suit, that looked pretty sharp I thought. \n\nNow it was updated again, to \"Black, navy, or grey coordinated suits with shirts and ties in good taste.\" Well I don't know how I can get around that one. But by that time everyone was damn sure sick of having to change their wardrobe and there was a large amount of protesting- People put their feet down and demanded to be paid extra for the needed wardrobe.\n\nSo now I'm back in my khakis and polos and tennis shoes and everyone seems much more comfortable.",
        "created_utc": 1520890978,
        "upvote_ratio": ""
    },
    {
        "title": "Maliciously compliance in a subreddit",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/83yo5r/maliciously_compliance_in_a_subreddit/",
        "text": "[removed]",
        "created_utc": 1520889687,
        "upvote_ratio": ""
    },
    {
        "title": "Grocery Shopping.",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/83ydwo/grocery_shopping/",
        "text": "[deleted]",
        "created_utc": 1520887569,
        "upvote_ratio": ""
    },
    {
        "title": "Monday 8AM office hours? No problem!",
        "author": "lavenderblue",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/83xw4e/monday_8am_office_hours_no_problem/",
        "text": "My thesis advisor hated students. He had to have them, and he was sought after as department head, but *hated* dealing with us. When he bothered to answer email, he never actually read or responded to the whole thing, but brusquely responded to whatever was in one random sentence. And he was sexist to boot, shunting legitimate questions asked by women onto male students who had no idea of the answers.\n\nSo \"for our convenience\" he decided to hold his office hours at 8am on Mondays, a full 2 hours before any classes started, let alone for us seniors. When he said \"of course, if that's too early *smirk* feel free to email,\" I knew he had to be punished.\n\nI showed up every single Monday morning for the entire year, with a full hour's worth of well thought out, detailed questions. Oh, you wanted an hour to nurse your hangover in peace and \"maliciously comply\" with your Uni's requirement to be available to the students you were advising? How about we talk for an hour about this obscure statistical method instead. Don't worry, I brought graphs and textbooks. And a tape recorder \"for my notes.\" It got to the point where you could see his face fall when he turned the corner and saw me, my laptop, and a polite smile. \n\nIf you're going to make this unpleasant for us, I'm going to make it unpleasant for you.  ",
        "created_utc": 1520884074,
        "upvote_ratio": ""
    },
    {
        "title": "10$ frozen chicken for 1$",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/Frugal/comments/83xnom/10_frozen_chicken_for_1/",
        "text": "[deleted]",
        "created_utc": 1520882670,
        "upvote_ratio": ""
    },
    {
        "title": "Label EVERYTHING",
        "author": "crazyhasydaisy",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/83xo3v/label_everything/",
        "text": "I work as a bartender and we also fill growlers at my location. We only serve beer and wine for about 10 hours each day, but we fill growlers all day long. For those who don't know growlers are glass jugs that can be filled and refilled with beer and hard cider and such. Because we don't serve all day our bartenders are only scheduled for the times when we are actively serving not during the rest of the work hours. When the bartenders, like myself, aren't on the clock growlers get filled by management. Honestly it's really easy  to fill a growler you just put the hose in the tap, turn it on, wait for it to fill, cap it, write down the price and name of the beer, clean off any beer that has filled, dry it, and give the growler back to the customer to pay for it at a cash register. \n\nAnyway, I showed up at work and it was the beginning of my shift so it was dead at the bar and One of my managers walks up and says in a really condescending way, \"Hey, it would be great if you could label everything in your department and I mean EVERYTHING especially the hoses.\" Then he gives me the label maker and walks away. \n\nWell with this kind of power in my hands I couldn't just let my opportunity escape me. So I labeled everything and I mean EVERYTHING! I labeled \"kegs\", \"new kegs\", \"dirty hoses\", \"clean hoses\", \"pint glasses\", \"more pint glasses\", \"even more pint glasses\", \"and even MORE pint glasses\", \"half pint glasses\", \"tasting/flight glasses\", \"flight planks\", \"64 oz growlers\", \"water cups\", \"32 oz growlers\", \"new growler caps\", \"wine glasses\", \"champagne\", \"cleaning supplies\", \"sanitizer\", \"cleaning spray\", \"paper towel holder\", \"cork screw\", \"sink\", \"hot! Water\", \"cold water\", \"happy hour sign\", \"A-frame\", \"last call sign\", \"trash\", and the best of all I labeled each hose individually \"hose\"\n\nI only stopped there because I ran out of label tape, but I enjoyed myself and got a laugh out of unnecessarily labeling everything. \n\n\n**Update**\n\n\nI just got off work and let me tell you all of my coworkers loved the labels and thought they were really funny. However, most of the labels had to be taken off just because they got in the way of work or were falling off after a day of getting all wet. All of the labels on the sink including the cold and hot! Water handles were falling off and had to be taken off. Also the labels on the hoses had to get taken off as well because they were constantly wet. Other than that all of the labels get to stay and I get to giggle every time I take out the trash and see my label. ",
        "created_utc": 1520882399,
        "upvote_ratio": ""
    },
    {
        "title": "Rules from a supervisor",
        "author": "delete_post",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/83xnpd/rules_from_a_supervisor/",
        "text": "This was a few years ago and I have left the job since. So we got a new supervisor and to show his \"Authority\" he told us to not talk to the Boss/Owner of the company unless we spoke to him first. Even though I and a few other people working there knew of our bosses open door policy because we were at least a few years in.\n\nOne day my boss comes out of the office to speak to me about something. My boss is a really chill guy you can joke and be sarcastic with. So he starts talking to me. I stop him and get up off my chair to get approval from my supervisor to speak to my boss. My boss sees the hilarity of this and just laughs and asks me the question and continues on his day.\n\nAnother time, we have moved and finally have a cubicle office. Which is great, but they put our names on a piece of paper with our \"title\" everyone elses title was fine but I've been in the company for so long that I was the \"jack of all trades\" but they put me under a specific title. Of course this is the new superviors doing because the boss doesnt care. So after a few days my boss comes out of his office to talk to me and ask me to do something that was not on my title. I tell him to back up from my cubicle. Then point to my \"title\" and tell him that \"sorry, thats outside my job description\". We both had a laugh, while everyone else is just looking at me surprised I said that to my boss.",
        "created_utc": 1520882319,
        "upvote_ratio": ""
    },
    {
        "title": "Preschoolers are -great- at malicious compliance.",
        "author": "FritoKAL",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/83xe6i/preschoolers_are_great_at_malicious_compliance/",
        "text": "Really this is much more like mischievous compliance.\n\nOur family's \"You have to hold hands if we're walking outside.\" rule has become extremely specific lately. Because my son is a junior master at complying with the words we say not the intent we mean, and he hates holding hands.\n\nRule version 1:  You have to hold hands when we cross the street.\n\nWhat we wanted: He holds one of our hands.\n\nWhat we got: He holds his own two hands together.\n\nVersion 2:  You have to hold mommy or daddy's hand\n\nResult: Demands that Papa (his grandfather) call us because he can't cross the street without holding mommy or daddy's hand.\n\nVersion 3: You have to hold a grown-up's hand.\n\nResult: Tries to hold the hand of his Spider-Man action figure.\n\nVersion 4: You have to hold a real grown-up's hand, not a toy.\n\nResult: Tries to hold the dog's paw at daycare.\n\nVersion 5: You have to hold a real human grown-up's hand, not a toy.\n\nNo mischievous compliance -so far-. \n\n(Edit: I love you guys, and the responses from other parents, and I'm really happy so many people are legit worried about kids' safety because that is a great thing to worry about. I promise I've explained WHY to my kid. He hears \"You have to hold hands and look for cars and use the cross walk because it's not safe to just run without looking, you could get hurt.\" all the time. I promise I am not letting my kid run in the street we don't even start to cross until he's actually holding a hand safely, I just wanted to recount the funny ways he tries to avoid it. He holds hands, he just tries to kid-lawyer his way out of it first. I promise, my kid is crossing the street safely! You can stop sending me PM's now.)",
        "created_utc": 1520880403,
        "upvote_ratio": ""
    },
    {
        "title": "I was told you guys would like this ...",
        "author": "jenglasser",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/83wk8h/i_was_told_you_guys_would_like_this/",
        "text": "I had a super bitchy French teacher who would constantly hand out detentions for things as inconsequential as walking to the trash can to throw away a piece of paper. She absolutely could not deal with the fact that we periodically might need to actually leave our chairs for a perfectly valid reason. One day she locked herself out of the classroom and nobody would let her back in. \"Sorry! We aren't allowed to get out of our seats!\" She had to get the janitor.",
        "created_utc": 1520874339,
        "upvote_ratio": ""
    },
    {
        "title": "On",
        "author": "[deleted]",
        "url": "https://i.redd.it/0yd4yx222bl01.png",
        "text": "[deleted]",
        "created_utc": 1520862405,
        "upvote_ratio": ""
    },
    {
        "title": "Getting it back one way or another",
        "author": "syberghost",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/83uvxn/getting_it_back_one_way_or_another/",
        "text": "This was years ago and it was a co-worker who engaged in malicious compliance, but I was there for all of it.\n\nEmployer gave everybody a 5% pay cut, across the board. About a year later, we had a problem where we needed somebody to hook up to the serial port on a piece of hardware, and Manager discovered that we were using personal laptops to do this work since we were only provided with desktops. This was a security violation (and we knew it was), but it was the only option. So, Manager tasked my Coworker with putting together \"requirements for team laptops\".\n\nCoworker looked at me and said \"I'm getting our % back one way or another\". He went to the approved hardware vendor and found their top of the line model, then he wrote down every hardware spec that was only found on that model or those like it. Then he submitted those requirements to our procurement team. Manager signed off without reading them.\n\nAnd that's how my entire team got $4,000 laptops, and my Employer got a completely new process for ordering hardware in which you had to choose off the menu unless you got approval from a VP.\n",
        "created_utc": 1520860733,
        "upvote_ratio": ""
    },
    {
        "title": "am I doing this right?",
        "author": "[deleted]",
        "url": "https://i.redd.it/lpu6u3o9tbl01.jpg",
        "text": "[deleted]",
        "created_utc": 1520857703,
        "upvote_ratio": ""
    },
    {
        "title": "So you want time tracking...",
        "author": "Digital-Chupacabra",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/83ukeo/so_you_want_time_tracking/",
        "text": "Sorry for the long one folks.\n\n\nA few jobs ago I worked at an advertising company that had sizable development team, we built apps, websites, etc for clients.\n\nHow ever all of the management came from the account mangier / sales team, you might see how there could be some cultural issues or misunderstandings.\n\nSo one friday day it comes down from on high that there had been a complaints from other teams that we (the dev team), were slacking off and watching videos. \n\nTo combat this perception the *brilliant* idea was struck upon that all teams with in the company would have to start tracking how they spent their time, starting on the following pay cycle ... which of course was the next Monday. Further more at the end of each week submit a hard copy log to the person in charge of this undertaking. \n\nSo being a lead on the dev team I took it upon myself to solve this problem in the manor I was most accustom too.\n\nI went and got my self a big mug of coffee, put up my do not disturb sign, (it said \"servers are crashing come back later.\") put my head phones on, cracked up the tunes and went to work.\n \nI wrote a small daemon (a program that runs in the background with out user input) that would collect information on what activities were preformed on the computer. \n\n* It logged the time, date, and name of the application, when you opened a new porgram.\n* It logged the time, date, when you opned a new tab in chrome or firefox, I had about a dozen catagories it would assigen to the URLs based on what it was. YouTube was programming tutorials and stack overflow was debugging research, stuff like that.\n* It logged when you locked your screen and unlocked it.\n* You get the idea.\n\nit saved all of this information to a nice CSV (spreadsheet).\n\nI finished with some time to spare in the day so I summoned all my teammates to my office, and explained the daemon I had written and offered to give them copies, which they were all too eager to get their hands on. Our team lead laughed for a solid minute, and installed it on his computer.\n\nThe first Friday that we had to turn in the logs, our team blew through our monthly allotment of printer toner and paper, each of us had dozens of pages, I think my total was past 100 pages of 10 pt. font.\n\nThe outrage was immense, my boss backed me up, we did  provided a log of all our time, really what more could be asked of us?\n\nneedless to say the Time tracking program was quickly killed after that, least our methods be adopted by others.",
        "created_utc": 1520857539,
        "upvote_ratio": ""
    },
    {
        "title": "mykonos villas for rent",
        "author": "osamakhan123",
        "url": "https://mlv.villas/villas/thalassa/",
        "text": "",
        "created_utc": 1520854177,
        "upvote_ratio": ""
    },
    {
        "title": "My legs are burning",
        "author": "ForestOnFIRE",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/83te1u/my_legs_are_burning/",
        "text": "This just happened. So I was staying at a friend's house outside a big city. I had lectures the next day up in the city where I do my degree. This meant I had to wake up extra early to get on the train and be in time for classes. \n\nI woke up early enough and cycled to the train station, so far so good, on time!  I purchased a ludicrously expensive train fare and made my way to the platforms, i was not 50m from the train and there's a gated barrier with a ticket inspector checking tickets, so I show him my ticket then he realises I have a bicycle with me...uh ohhh...he says \"sorry mate I can't let you on the early train here, earliest I can let you on would be 9:11 am.\"...cogs start spinning, it's 7:45, the train was meant to leave at 7:51 and I'm trying to process how I will get the train in time for my 9am (45 minuite train journey). The cogs stop and I have a solution, the next station along is 1 mile away and is more of a rural stop so no ticket inspector. I have 8 minutes to get there. I start running with my bike through the station and mount it through the doorway and make it there in 6 minutes, uphill, two to spare. I manage to board the train with not so much as a glare from the conductor, legs burning and feeling rather awake.",
        "created_utc": 1520842598,
        "upvote_ratio": ""
    },
    {
        "title": "They asked for plates...",
        "author": "AllSeeingAI",
        "url": "https://i.redd.it/q1z024sbz3l01.jpg",
        "text": "",
        "created_utc": 1520835047,
        "upvote_ratio": ""
    },
    {
        "title": "\"I would like a sliced apple\"",
        "author": "pwu1",
        "url": "https://i.redd.it/gm304dr457l01.jpg",
        "text": "",
        "created_utc": 1520801191,
        "upvote_ratio": ""
    },
    {
        "title": "Meet at 6:15am Sunday morning? Sure thing!",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/83n92h/meet_at_615am_sunday_morning_sure_thing/",
        "text": "[deleted]",
        "created_utc": 1520781186,
        "upvote_ratio": ""
    },
    {
        "title": "Getting more days off then they want to give",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/83mx1s/getting_more_days_off_then_they_want_to_give/",
        "text": "[deleted]",
        "created_utc": 1520777574,
        "upvote_ratio": ""
    },
    {
        "title": "Received another fee after paying my \"final\" electricity bill",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/83mtsy/received_another_fee_after_paying_my_final/",
        "text": "[deleted]",
        "created_utc": 1520776601,
        "upvote_ratio": ""
    },
    {
        "title": "Daughter yelled at me to make her a “surprise snack”",
        "author": "[deleted]",
        "url": "https://i.redd.it/j6f4o5h6lyk01.jpg",
        "text": "[deleted]",
        "created_utc": 1520770070,
        "upvote_ratio": ""
    },
    {
        "title": "Feels good to beat the system",
        "author": "hcnuptoir",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/83m2zo/feels_good_to_beat_the_system/",
        "text": "I was promoted to a supervisory position at work a couple of years ago after my old supervisor fired himself. My previous supervisor wasn't very good at organizing or keeping in stock all of the paperwork our operators are required to fill out during a shift. So my first duty was to filter out all of his old crap that he left behind and organize the paperwork. This was no problem. The problem came when my managers carpet bombed my shift with new hires. Some of these guys couldn't be trusted to spell their own name correctly much less fill out their paperwork. At the same time, management decided it was a good idea to start making changes to the paperwork while at the same time adding MORE paperwork for the operators to do. Most of this crap is 100% reduntant. We went from 3 papers on a clipboard per operator to 9. And all of it is information that was repeated on the previous. Since I was still new to the position, every week theres was a meeting with me about this and that and him and her. And it always boils down to \"operator A isnt doing this paper, operator B isnt doing that paper correctly, you need to train operator 4 on how to write the date, operator X doesnt understand a 24 hour clock. You need to make sure all of the paperwork is filled out correctly and completly\" it just goes on and on and on. So I gathered all of our paperwork, found all of the redundancies, and filled them out myself. Used those as masters and proceeded to make hundreds of copies. I explained to my operators what i was doing and that I was doing it to help them out. This worked beautifully. I had beaten the system....for about 18 months. I was called into a meeting with my egghead manger and his half robot superior, the plant manager. They    were    pissed. Without getting too into it, they wanted to fire me but decided to let me go with a verbal warning, a corrective action report to the entire shift, and a memo to the department regarding paperwork and supervisory duties. Not to mention that if they wrote me up and turned me in to HR, they would have looked worse than me for not catching this sooner. Suckers. I took a pic of the corrective action. It pleases me. I had beaten the system, even if only for just a little while. ",
        "created_utc": 1520765722,
        "upvote_ratio": ""
    },
    {
        "title": "MC on a sign",
        "author": "matyascsekek",
        "url": "https://i.redd.it/xlzklbbmk3l01.jpg",
        "text": "",
        "created_utc": 1520757938,
        "upvote_ratio": ""
    },
    {
        "title": "Asking for extra lemon at Applebees",
        "author": "[deleted]",
        "url": "https://i.redd.it/fu3d1rv912l01.jpg",
        "text": "[deleted]",
        "created_utc": 1520746578,
        "upvote_ratio": ""
    },
    {
        "title": "You owe me money? That's fine. I'll wait for the check.",
        "author": "heat_it_and_beat_it",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/83jl9y/you_owe_me_money_thats_fine_ill_wait_for_the_check/",
        "text": "Disclaimer- This is not my story, but a close friend that I served in the Marine Corps with. He passed away recently and I remembered this story while at his memorial service today. I think this story truly wraps up what he was like.\n\nAs my friend was doing his final check out to get out of the Marine Corps, it came time to do his final pay audit. (This is where they figure out down to the penny what your final paycheck will be. Colossal pain in the ass, BTW.) \n\nAs the clerk was doing a double check of all the numbers, he caught that someone had miscalculated a transaction. So, he had been shorted by 4 dollars and change. (As I understand it, the pay had already been sent to disbursing and there was no fixing it.) \n\nAs I'm sure many people on here can attest to, if you owe the US government money, they will take it in a heartbeat. They don't care one bit. I've seen Marines not get paychecks for several months in a row because the government needed that money all back at once. \n\nSo, as a matter of principle, my friend raised a little bit of a stink, and told the clerk he wanted every penny that was due to him. The clerk had never run into this before so he had to talk to his NCO (non-commissioned officer, first line supervisor) then the SNCOIC (staff non- commissioned officer in charge, senior enlisted for the pay department.) It eventually got elevated to the officer in charge of the admin center, a grumpy old Chief Warrant Officer. \n\nThe CWO came out and told my friend, \"You do realize we'll have to request a US Treasury hard check for you, right?\" \n\n\"Yes, sir. That's fine. I'll wait.\" \n\nThe CWO even offered him 4 dollars out of his own pocket to get him on his way. My friend refused just on principle. \n\n\"I don't want YOUR money, sir. I want the government's money.\"\n\nSo, my friend waited around in their office for about 6 hours for them to cut him a hard check from the US Treasury for around 4 dollars. \n\nHe never even cashed it. Again, it was the principle of the thing.\n\nTL,DR- My friend waited 6 hours for the admin center to jump through fiery hoops to cut him a check for 4 dollars. ",
        "created_utc": 1520731293,
        "upvote_ratio": ""
    },
    {
        "title": "Not sure this belongs here but...",
        "author": "wcase85",
        "url": "https://i.redd.it/sogc6m7a81l01.jpg",
        "text": "",
        "created_utc": 1520729586,
        "upvote_ratio": ""
    },
    {
        "title": "You don't want me wiping patient exam chairs clean?",
        "author": "starbygoode",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/83j5bo/you_dont_want_me_wiping_patient_exam_chairs_clean/",
        "text": "[removed]",
        "created_utc": 1520726870,
        "upvote_ratio": ""
    },
    {
        "title": "Wanna know what I'm doing in the bathroom? OKAY!",
        "author": "ReallTrolll",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/83iyyk/wanna_know_what_im_doing_in_the_bathroom_okay/",
        "text": "[removed]",
        "created_utc": 1520725188,
        "upvote_ratio": ""
    },
    {
        "title": "(I was told this belongs here). My daughter told me she wanted a “surprise snack”.",
        "author": "[deleted]",
        "url": "https://i.redd.it/2ydjh7dfd0l01.jpg",
        "text": "[deleted]",
        "created_utc": 1520719200,
        "upvote_ratio": ""
    },
    {
        "title": "After being warned by the NBA, the Bulls play Justin Holiday and Robin Lopez the entire first quarter and take a 5 point lead. Engage tank mode for the rest of the game.",
        "author": "rumdiary",
        "url": "https://i.imgur.com/neEZNhV.png",
        "text": "",
        "created_utc": 1520707111,
        "upvote_ratio": ""
    },
    {
        "title": "400, 000 Subs",
        "author": "[deleted]",
        "url": "https://i.imgur.com/LpzLIi9.png",
        "text": "[deleted]",
        "created_utc": 1520701324,
        "upvote_ratio": ""
    },
    {
        "title": "A little petty, a little malicious",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/83g5rf/a_little_petty_a_little_malicious/",
        "text": "[deleted]",
        "created_utc": 1520699453,
        "upvote_ratio": ""
    },
    {
        "title": "\"Just add subtitles!\"",
        "author": "ShinnyRose",
        "url": "https://i.redd.it/pgdqfvoehxk01.jpg",
        "text": "",
        "created_utc": 1520684217,
        "upvote_ratio": ""
    },
    {
        "title": "Work truck has two flat tires. Drive it anyway? No problem.",
        "author": "zpchamp",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/83dup5/work_truck_has_two_flat_tires_drive_it_anyway_no/",
        "text": "I worked several years as a residential heating and air guy in Atlanta, Ga for one of the largest companies in the area at that time. I lived in my “bachelor pad”, which was a luxury 1-bedroom condo I bought when I was in sales. With my neighborhood not allowing me to park a work truck at my house, I parked at a 24hr gas station over night, a Quiktrip for those familiar, that was about a mile and a half from my house. \n\nOne summer morning, when we were crazy busy, I got to my truck to find that someone let all of the air out of my two passenger tires and the truck was sitting on the rims. The station has a free air compressor, but to avoid being a hinderance to their customers, I parked far away from everything. I called my manager to ask for an air compressor, and he kept angrily insisting I use Quiktrip’s. When I explained that the truck was literally on the rim, he kept insisting he’s had flats and driven on rims, and that this whole situation was ridiculous. He could not believe that I needed air in my tires, while being stuck at a gas station with air. \n\nThis was before camera phones, we all had Nextels, so I couldn’t send him the picture of the tire being 100% empty. So empty, they might have vacuumed the air out. At this point, I had already asked employees and tons of other people for portable air compressors and even considered using refrigerant/Freon (I was too low, but it is also illegal and harmful to the ozone layer and I would never do that), so all of my options were exhausted. I calmly told my manager that I have tried everything, but this truck is not moving until he gets an air compressor out there. \n\nHe then said “I don’t give a fuck what it does to the rims, you drive that truck to that damn air compressor, at the gas station you are at, and put air in those tires”, and then he hung up the phone. So, I did what he wanted. I got in the truck, backed out of the parking spot, and started to drive toward the front of the store to get to the other side. \n\nAs soon as I started to drive, you could feel the tires just rumbling all over the place as the truck bounced like crazy. When I started to pass the front of the store, people coming out started to flag me down. I rolled the window down and said, “I’m going to the air compressor”. The guy said it was on the rim and the rim was bending. I told him that was fine, my boss told me to get it over there no matter what. \n\nHe said “ok” and shrugged his shoulders. I pulled up to the air compressor and looked at them. The tires were both pushed to the inside and the rims looked all kinds of jacked up. I called my manager and told him he needed a tow truck now, instead of of an air compressor, and told him to call me when I have a working truck. I wish it ended there, but he called a tow truck that was there within 10min, and I had to ride with him to the shop and wait on it. \n\nOn top of that, they saved the tires and rims, so my boss never understood how bad it was. Also, this happened to me 7 or 8 years ago, I’m now 30. So I’m wondering if maybe it wasn’t as bad as I thought it was back then. I was a moron with cars. I’m no expert now, but I owned some shitty vehicles after that stage in my life that taught me simple things.\n\n*TL;DR*\nMy work truck had two completely flat tires when I went to pick it up from a gas station parking lot one morning during our busy season. After some debate, my boss told me to drive it to the air compressor on the other side of the parking lot no matter what. I did just that, and he had to get a tow truck out to take it to a tire repair shop to fix the rims.\n\nEdit: Added spacing\n",
        "created_utc": 1520668224,
        "upvote_ratio": ""
    },
    {
        "title": "I'm NOT on the sofa /couch. [cat]",
        "author": "[deleted]",
        "url": "https://i.redd.it/0l74jd8vvuk01.jpg",
        "text": "",
        "created_utc": 1520652812,
        "upvote_ratio": ""
    },
    {
        "title": "Sign’s up boss",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/83c0q4/signs_up_boss/",
        "text": "[removed]",
        "created_utc": 1520646032,
        "upvote_ratio": ""
    },
    {
        "title": "Misplaced Charges Lost and Found Again. They want their money, so I’ll give it to them.",
        "author": "DemonizedLin",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/83al12/misplaced_charges_lost_and_found_again_they_want/",
        "text": "A city I travel to for work recently had an E-Z Pass only toll installed, within the last few years.  The charges for last March and April had mysteriously disappeared, and I had paid off the remaining balance then got myself an E-Z Pass.  I thought everything was fine and dandy until I received a notice in the mail that I owed $19 for tolls.  I was confused, naturally, as I had paid what I thought was the full balance.  I called their customer service in an attempt to refute these charges, when the person I spoke to explained that the charges had fallen off and came back, and that I most certainly have to pay them. Okay then.\n\nAfter some thought a lovely idea came to mind.  They want nineteen dollars, then I will make sure that they regret this.  I have obtained straight from my bank nineteen dollars in wrapped pennies.  Guess who’s gonna get nineteen dollars in wrapped pennies next Friday?\n\nI am sincerely looking forward to this.",
        "created_utc": 1520633177,
        "upvote_ratio": ""
    },
    {
        "title": "Carrot kid",
        "author": "BuddyRole",
        "url": "https://i.imgur.com/RO6XGRg.jpg",
        "text": "",
        "created_utc": 1520631708,
        "upvote_ratio": ""
    },
    {
        "title": "Just paint what I gave you!",
        "author": "orbitaldan",
        "url": "https://i.redd.it/mq7yepf4dlj01.jpg",
        "text": "",
        "created_utc": 1520629302,
        "upvote_ratio": ""
    },
    {
        "title": "You're asking me to waste everyone's time? Ok then...!",
        "author": "WillHButt",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/839p83/youre_asking_me_to_waste_everyones_time_ok_then/",
        "text": "I work in a call center, in the technical support department. A few months ago they told us we were going to merge with the billing department and get compensated for the added tasks. Some didn't like this while me, hey, I'll take a raise anytime, especially for tasks easier than what I already do.\n\n&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;Problem is: 1. They're not compensating us right now; 2. They're going to give us the training in the next 6 to 9 months (read a year or 2 in company time); and 3. They put us on the billing queues as soon as this was announced...\n\n&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;So, we're getting calls directed to billing while we are not trained or paid for the task. Fine. First day on those queues, I litteraly couldn't help a single billing customer. All I can see, sometimes, is the balance due, and no one is calling for this only. So from then on, as soon as I saw ''billing'' on my phone, I quickly pressed the hold button and transfered to the actual billing department (on the customer's end, it probably only sounded like the waiting music looped).\n\n&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;Turns out we were receiving A LOT of billing calls; at some point, I transferred over 20 customers in a row before getting to a technical call. Did that for a while until I got told by my supervisor that I at least needed to check if there was anything I could do. Tried for another few days, still couldn't help anyone. Out of frustration, I started transfering directly again. This time, I actually got suspended one day for being insubordinate...\n\n&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;Now my supervisor is really nice and comprehending, so I tried as much as possible to make him understand that by taking calls I can't do anything about, I'm just wasting my time, the customer's time and the company's time. What I'm then told is that I'm being paid to come here and do whatever they tell me to do.\n\n&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;Fine. Now I'm taking all the time I can to identify the customer, repeat with them what the issue is and explain to them why I have to transfer them elsewhere after all that time. I hate it, I'm not helping anyone or the company, but I do it. It's pretty mild, but still malicious compliance! Aaaaand I don't want to lose my job over this......! XD",
        "created_utc": 1520626134,
        "upvote_ratio": ""
    },
    {
        "title": "Must wear shorts to the knees? No problem!",
        "author": "fluffy1910",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/839oco/must_wear_shorts_to_the_knees_no_problem/",
        "text": "Back in the late 90’s I worked for a retail clothing store. Being an in-shape teenager with nice legs, I would wear girls juniors style shorts (that this company sold!) along with the required company T-shirt. Until one hot, humid, southern summer where rules changed… we could only wear shorts that came to our knees, otherwise pants were required. Screw that! I refuse to drive to work with no air conditioning, in pants, while it's 95 degrees out. So the remainder of my summer before college, I’d wear my brother’s scummy looking cargo shorts, which just happened to come to my knees, to work. Every. Single. Day. ",
        "created_utc": 1520625941,
        "upvote_ratio": ""
    },
    {
        "title": "Try to stick me with the dishes? I don't think so.",
        "author": "secularflesh",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/8385ws/try_to_stick_me_with_the_dishes_i_dont_think_so/",
        "text": "To preface this, my GF and I have a simple rule: one cooks, the other cleans. This works great most of the time though sometimes she sometimes complains that my meals are too elaborate,  behind too many dirty pots and pans. She never complains when she's actually eating it though.\n\n\nTwo days ago, I prepared a nice dinner for us at her place. She offered to make me breakfast in the morning since she had to get up early anyway to catch a flight. I asked her if she was sure because I didn't want her to be pressed for time. She insisted with confidence. I slept over that night and set my alarm for 30 minutes later than usual.\n\n\nThe next morning I wake up to find 4 slices of 3-day old pizza covered in plastic wrap on a plate on the dining room table. There's a hastily scribbled note that says: *Woke up late - didn't have time to cook. Remember to lock up and wash the dishes after you finish the pizza. Love you. =P*\n\n\nI shake my head and pop the pizza in the microwave. As it's reheating, I spot the still dirty dishes from the previous night festering in the sink. I'm fucking livid.\n\nI sit down and start eating the damn pizza, seething. I re-read the note and smile. I leave one and a half slices of on my plate, get my stuff, lock up, and leave. She comes home in 9 days.\n\n\nUPDATE: GF found out what I did. After some begging and pleading we came to a settlement agreement. She admitted she didn't do the dishes that night on purpose. No hard feelings - we fuck with each other all the time. I went over and cleaned it up this morning. Pizza wasn't too bad since it was only sitting out for a couple of days.",
        "created_utc": 1520614547,
        "upvote_ratio": ""
    },
    {
        "title": "Chaotic Good (x post from r/funny)",
        "author": "chasehale110",
        "url": "https://i.imgur.com/JbyszQn.jpg",
        "text": "",
        "created_utc": 1520608498,
        "upvote_ratio": ""
    },
    {
        "title": "Well... okay, if you insist!",
        "author": "zeromig",
        "url": "https://i.redd.it/zs0xxwuv3kk01.jpg",
        "text": "",
        "created_utc": 1520607565,
        "upvote_ratio": ""
    },
    {
        "title": "The most expensive first-aid kit in the country",
        "author": "Tar_alcaran",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/836son/the_most_expensive_firstaid_kit_in_the_country/",
        "text": "I work as a safety inspector, mostly for (hazardous) waste disposal and soil remediation, and everything related to that.This story is about a three-day audit at an asbestos-removal project, back when I had more spare time, and only two employees. \n\nNow, companies that do these jobs get audited a LOT, by half a dozen agencies, so you'd think they'd be used to this. The owner/supervisor though, was not a fan of being told what needed improving, and took every single observation as a personal insult. After getting a few pretty serious infractions, he hired me for a week and told me to \"make everything work again\".\n\nAnd that's fine. I can fix things. Mostly though, I'll just point things out that need fixing. If you didn't place enough fences, i'm not personally going to bring in more fences. I wrote up a report, starting with the casual stuff (first-aid kit hasn't been checked) and ended with the bad stuff (that guy is having lunch in his asbestos-covered suit, surrounded by cancer-dust). \n\nThe owner flipped out. He told me he paid me to *\"fix things, not to complain about them*\". He would pay me to personally fix everything on that list, no matter how long it took. I offered that maybe bringing in someone to inspect the first aid kits and fire extinguishers would be cheaper, but nope. I had to fix it, and do it right! Could I order new kits? *\"NO! I don't want you wasting money buying new stuff we don't need!\".*\n\nAfter getting that confirmed by email, I got started on the list. Collected all the first-aid kits, Emptied them on the table, checked the expiration dates, bought new stuff, filled all of them. It took me a day to do the first 4 kits (since this isn't my job, and also I wasn't in a hurry). When he saw me sorting kits, I got \"That's what I like to see! Good girl!\"\n\nSuddenly, my work speed slowed to a crawl. And I found another 16 kits. Sure, they weren't technically his responsibility, but it would be irresponsible not to check them. Personally. At the end of the next week, I'd spent about 100 hours at his site, sorting first-aid kits, checking extinguishers, ordering fencing, applying signs, and other menial labor, but mostly sorting first-aid kits.\n\nAnd then, the bill came. 100 hours, at a politely discounted 130$/hour, plus about 500 in expenses. That got him 26 newly-inspected first-aid kits, 6 checked fire-extinguishers, and a set of extra fence-clamps. ",
        "created_utc": 1520603469,
        "upvote_ratio": ""
    },
    {
        "title": "Take my break at a scheduled time? Sure!",
        "author": "nbrett81",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/836ox4/take_my_break_at_a_scheduled_time_sure/",
        "text": "I work at a gas station in New Jersey. For those of you who don’t know, NJ is the last state in the US where it is illegal to self serve your own gas. Therefore, we have at least 2 attendants on from open —&gt; close to keep up with the volume. \n\nRecently, HR got fed up with us attendants taking our break whenever we wanted and causing the gas station to get backed up (because only 1 person would be out pumping the gas). So our HR manager decided the best way to fix the problem would be to have scheduled breaks. Keep in mind this was in the dead of winter. o This, in theory, would work because when there was a scheduled break, the main store would have to send out a person to cover your break. HR said even though your break is scheduled, you still will have to call inside to have someone come out and cover the break.\n\nAnd so it started, our first week with scheduled breaks. I was the first person to have a break on this new schedule, so when my time rolled around I called inside. At this point, the gas station and the main store were slammed. They were understaffed inside with only 4-5 cashiers on out busiest day of the week. But low and behold, the 4 managers who were on duty were hiding in the cash room fucking around and not doing their job (as per the usual). Anyway, i’m calling inside and the Front Line girl picks up. I say, “Hey FLG, It’s nbrett81 from the gas station. Since the want us to take scheduled breaks now, can you send someone out here to cover?”. She then goes on through a whole spiel about how slammed they are and that the scheduled breaks are a terrible idea and HR lady is incompetent and blah blah blah. But then, I had a great idea. \n\nI turned to my left and in the parking lot I saw it. My last glimmer of hope. THE HR LADY’S CAR. I tell FLG to page HR Lady to the gas station to cover a break. \n\nNot 15 seconds later, our office phone starts beeping so I pick it up. HR Lady tells me to find someone else to cover my break because she’s “busy”. I told her that everyone else way also busy dealing with customers and that she’d have to come out. She argued with me for 2 more minutes before conceding to her own rules. \n\nA few minutes later, here she comes wearing only a light jacket. In the beginning of January. It was 6F outside and with the windchill it felt like -2F. \n\nNeedless to say, that rule was dismissed shortly after my break. \n\nTLDR: HR got rekt after making a stupid rule regarding breaks. \n\nEDIT: For those of you saying “but Oregon!”. When I said that NJ is the last state in the USA to have self service be illegal, I meant that NJ is the last state to have a blanket ban on self service gas stations, unlike Oregon, where it is ILLEGAL to dispense your own gas unless certain conditions are met. Sorry for the confusion. ",
        "created_utc": 1520602427,
        "upvote_ratio": ""
    },
    {
        "title": "The Triple J News Theme",
        "author": "TylerIsAWolf",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/836dgn/the_triple_j_news_theme/",
        "text": "[removed]",
        "created_utc": 1520599070,
        "upvote_ratio": ""
    },
    {
        "title": "Movie of devil offering wishes, with malicious compliance.",
        "author": "Berthole",
        "url": "http://www.imdb.com/title/tt0230030/",
        "text": "",
        "created_utc": 1520592494,
        "upvote_ratio": ""
    },
    {
        "title": "If you have half an hour, listen to what happens when a comedian plays with Malicious Compliance against the Police and Government",
        "author": "[deleted]",
        "url": "https://www.youtube.com/watch?v=PRwsXnBQaEo",
        "text": "[deleted]",
        "created_utc": 1520585436,
        "upvote_ratio": ""
    },
    {
        "title": "Its-Vetpro A Complete Care for Domesticated Animals and Birds",
        "author": "akicksoft1",
        "url": "https://mfadirectblog.wordpress.com/2018/03/09/its-vetpro-a-complete-care-for-domesticated-animals-and-birds/",
        "text": "",
        "created_utc": 1520578572,
        "upvote_ratio": ""
    },
    {
        "title": "How my roommate takes the trash out",
        "author": "[deleted]",
        "url": "https://imgur.com/7cZrFIF",
        "text": "[deleted]",
        "created_utc": 1520564997,
        "upvote_ratio": ""
    },
    {
        "title": "Getting (Kind of) Fired",
        "author": "syockey",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/833bp0/getting_kind_of_fired/",
        "text": "I work a 2nd part time job being the night/closing supervisor for a gym. It gets me a free membership and beer money. I've been there for five plus years, and I'm rarely late for a shift. My real job (8-5) was crazy and ran long. Being a long crazy day, I would have rather gone home and played video games. But I'm a good employee and rushed off to my 2nd job.  \n  \nTwo steps into the building the daytime guy jokes \"Your two minutes late... You're fired\". I know full well he doesn't have the ability/power to fire me, so I replied \"Sweet\" and walked back to my car. He must have thought I was joking (EDIT - b/c he didn't yell for me to come back).  \n  \nI went home and played games for an hour before answering my phone. My actual supervisor was ~~begging~~ telling me to go back and let the poor guy go home (EDIT - ON TIME). I relented and went back and do in fact still work there.\n  \n  \nEDIT - Since people seem to think I'm a dick or somehow screwing him over. No he wasn't mad. He was shocked I walked that quick, and laughed when I came back. Shifts overlap and he went home perfectly on time. Also its a freaking gym... fold towels (which he didn't do and left for me)... talk to people... pick up after ass hats who can't put their own weights away. My being gone for that hour didn't change a damn thing.",
        "created_utc": 1520562750,
        "upvote_ratio": ""
    },
    {
        "title": "I think this fits nicely.",
        "author": "[deleted]",
        "url": "https://i.redd.it/n7jff22zpjk01.jpg",
        "text": "[deleted]",
        "created_utc": 1520553748,
        "upvote_ratio": ""
    },
    {
        "title": "Absolutley sure that's what they meant.",
        "author": "Aaron_Purr",
        "url": "https://i.redd.it/n7jff22zpjk01.jpg",
        "text": "",
        "created_utc": 1520553396,
        "upvote_ratio": ""
    },
    {
        "title": "I'm not sure that's what they meant...",
        "author": "SpongeBad",
        "url": "https://i.redd.it/n7jff22zpjk01.jpg",
        "text": "",
        "created_utc": 1520549428,
        "upvote_ratio": ""
    },
    {
        "title": "Send more",
        "author": "[deleted]",
        "url": "https://i.redd.it/1uuzgghdwik01.jpg",
        "text": "[deleted]",
        "created_utc": 1520532424,
        "upvote_ratio": ""
    },
    {
        "title": "Only one table? OK then.",
        "author": "beenisss",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/82xpyl/only_one_table_ok_then/",
        "text": "A few summers ago I worked at an oyster bar/restaurant type place right by the water in this nice, scenic little town on the coast. When the owner got the place he wanted to make use of the space at the front for outdoor seating, as the view was an obvious draw. So he made a request as part of his planning application for seating out front, figuring there was space for about a handful of 4-tops.\n\nFor whatever reason, his request was denied. The application came back with permission for one outside table, and no more.\n\nSo, the owner relented and put just one table out front. It was specially made and runs pretty much the entire length of the restaurant.",
        "created_utc": 1520518134,
        "upvote_ratio": ""
    },
    {
        "title": "When this tab rips off",
        "author": "millerman02",
        "url": "https://i.redd.it/lhpji2sayik01.jpg",
        "text": "",
        "created_utc": 1520508297,
        "upvote_ratio": ""
    },
    {
        "title": "Report Every Time you Notice a Problem",
        "author": "QZip",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/82whb8/report_every_time_you_notice_a_problem/",
        "text": "I was a security guard about 5 years ago with a terrible manager. He often gave us orders that reduced security, showed his incompetence, or generally pissed everyone off. He also expected you to follow even his most ridiculous orders or he would fire you on the spot.\n\nWell he was mad one Friday afternoon because he asked why he didn't know about a problem and the security guard said, \"It's been a known problem. It's on maintenance's radar.\" I forget exactly what the problem was, I think it had something to do with a broken infrequently used door.\n\nSo he wrote a high priority e-mail to the security guard e-mail telling us to, \"Write down every single single time you do a patrol with anything wrong in your log, then e-mail each individual infraction in a separate e-mail to maintenance with the problem and cc me.\"\n\nI'm sure he intended you to write one e-mail to maintenance/him, but just make a note in your log that yeah the problem hasn't been fixed yet every time you did a patrol. However, that's not what he wrote.\n\nI had the first shift after he wrote that e-mail. He wouldn't be back until Monday and I had 16 patrols to do in my 16 hour shift and wouldn't you know it there were some known problems that maintenance hadn't gotten around to yet.\n\nI wrote 5 e-mails every patrol. Flooding the maintenance and my boss' e-mail with 80 e-mails of redundant information. When my shift was over, I made sure my replacement fully understood the nuance of my boss' e-mail and what I had done and thus what he was expected to do.\n\nMy boss came in on Monday after everyone had dutifully followed the letter of the law to an inbox full of hundreds of e-mails about the same 5 problems. He was not happy. Maintenance was livid. They went all the way up to the CEO who came crashing down hard on my boss. Usually my boss would've thrown all of us under the bus, but he really couldn't possibly get past the fact that his poor choice of words had made this occur.\n\nHe really, really tried to find something I had done wrong so he had a reason to fire me after that, but he never could find anything and always looked like an idiot when he tried.",
        "created_utc": 1520504169,
        "upvote_ratio": ""
    },
    {
        "title": "Global Digital Forensics Market Size, Status and Forecast 2022",
        "author": "rasika24",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/82wbcz/global_digital_forensics_market_size_status_and/",
        "text": "[removed]",
        "created_utc": 1520501937,
        "upvote_ratio": ""
    },
    {
        "title": "Global Triacetin Market Research Report 2018",
        "author": "rasika24",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/82w9vn/global_triacetin_market_research_report_2018/",
        "text": "[removed]",
        "created_utc": 1520501337,
        "upvote_ratio": ""
    },
    {
        "title": "Company's Policy: \"All beverages must be in a cup with a straw\"... too amused to argue with the employee loophole discovered tonight.",
        "author": "egglessomlette",
        "url": "https://i.redd.it/puvt5t4brgk01.jpg",
        "text": "",
        "created_utc": 1520481735,
        "upvote_ratio": ""
    },
    {
        "title": "My neighbor went out to shovel before I did, so I followed his lead.",
        "author": "BlackSight6",
        "url": "https://i.imgur.com/xeNmFcZ.jpg",
        "text": "",
        "created_utc": 1520481533,
        "upvote_ratio": ""
    },
    {
        "title": "More Training for me",
        "author": "lynn-lez",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/82ukwf/more_training_for_me/",
        "text": "[removed]",
        "created_utc": 1520480796,
        "upvote_ratio": ""
    },
    {
        "title": "Seemed like a better fit here.",
        "author": "coolhand_chris",
        "url": "https://i.redd.it/2gaqit8mock01.jpg",
        "text": "",
        "created_utc": 1520478015,
        "upvote_ratio": ""
    },
    {
        "title": "Chocolate CHIP cookies.",
        "author": "Muskratapplepie",
        "url": "https://www.reddit.com/r/assholedesign/comments/82o7yf/single_chocolate_chip_cookie/?st=JEHMMI53&amp;sh=af25d6c4",
        "text": "",
        "created_utc": 1520460026,
        "upvote_ratio": ""
    },
    {
        "title": "Worked a private dinner and a random woman asked if she could help. I gave her something I thought she couldn't mess up; \"Take the stickers off these avocados\"",
        "author": "jongdoe",
        "url": "https://i.redd.it/0onu1tog3ek01.png",
        "text": "",
        "created_utc": 1520453000,
        "upvote_ratio": ""
    },
    {
        "title": "Air conditioning woes",
        "author": "SparkySailor",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/82qu0j/air_conditioning_woes/",
        "text": "Apologies for formatting, mobile upload.\n\n\nSo this happened years ago (1980's) in Canada. My Dad was in the federal police at the time, and the police force was ordering Crown Victoria police cruisers. They would receive the cars with air conditioning installed, and then pay 500-1000$~ or so to remove the air conditioning, in the belief that having air conditioning in the cars would make the officers lazy. Now I don't know how many of you have worn body armor before, but it's like wearing a parka during the summer, and in the area where he was working, temperatures of 90 degrees F (30+C ), were extremely common in the summer, and the officers were working 12 hour shifts, sometimes without moving their cars (when doing speed traps or stakeouts, etc).\n\n In the interest of his fellow officers, my Dad hatched a plan: you don't want your officers to be lazy? Fine. Let's go do some extra work. All the guys in the department started putting up fliers all over the community. \"Cops helping the homeless\". About half the department chipped in 10$ each to buy eggs, bacon, bread, pancake mix, the works. \n\nAt 0500, before their shift started, they drove to the local homeless shelter....and made all the homeless people in the community breakfast on the hood of a NOT RUNNING police car at 5 in the morning. Now, where does the part that will achieve something (besides helping some hungry people) come in? They filmed their little event and sent the video to the procurement people in the capital of the country. Mysteriously, their next car they got from the procurement people had air conditioning still installed. \n\nTL;DR: PD was taking air conditioning out of their cops cars cause they thought it would make people lazy. Dad cooked homeless people breakfast on the hood of a police car at 5am and sent video to superiors.",
        "created_utc": 1520449590,
        "upvote_ratio": ""
    },
    {
        "title": "Why don't you just quit?",
        "author": "mydreamnotyours",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/82qcer/why_dont_you_just_quit/",
        "text": "I recently had a conversation with a relative who suffers from several conditions and he related this story to me which I thought would be perfect for this sub.\n\nMy relative, I'll call him John (not his real name) was working full time in an important role for a small media company. Due to his conditions, among other things John has to be able to stand and sit whenever he needs and this job was perfect for allowing him to do that. Plus he really enjoyed the work.\n\nHis company was bought by a fairly large media organization that I won't name. They kept everyone and even began promoting some people. One of the company executives talked to John on the phone, praising his work and then emailing him an offer of a great promotion, to take effect about a month later when other changes happened at the company.\n\nThen the same executive visited the local office and found out John was disabled. This shouldn't have mattered, but the guy wasn't happy about it and even called John names right to his face. \n\nJohn let it go because as sad as it is he's used to it when some people are assholes to him. Then instead of being promoted as he was promised, suddenly the executive emailed John to say he was too inexperienced to be promoted and would now have his hours cut from full time to half time work!\n\nWhen John objected, the executive told him in email \"If you don't like it, why don't you just quit?\"\n\nSo even though he enjoyed his job, John called his bluff and quit. The local office had to shut down for a week because he wasn't there, but that's not the best part.\n\nJohn filed discrimination paperwork. He still had the emails from the executive where he was promised a promotion and then suddenly told he was too inexperienced for the same thing and where he was told to quit.\n\nIt took nearly a year for the process, but the company realized they were in trouble and apologized to John and offered him his old job back. \n\nJohn said no thanks and ended up with a settlement that paid him enough money he won't have to work any time soon.",
        "created_utc": 1520446044,
        "upvote_ratio": ""
    },
    {
        "title": "But I'm not supposed to work from home more than 1 day a week...",
        "author": "xxklipxx",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/82pqie/but_im_not_supposed_to_work_from_home_more_than_1/",
        "text": "I don't often get the chance for malicious compliance, but today granted a golden opportunity. At my company we are allowed to work from home, and up until recently we were very flexible on the amount of days you could be home. Policy adjustments now say we can only WFH 1 day a week, and the flexibility for health issues is pretty much gone for most people.\n\nLast week I was feeling really shitty and just wanted to be home in the quiet dark so I could actually get some work done. Not bad enough that I had to call out all together though. I was told to keep consistency on the team I had to stay in office since I already worked one day at home. Wasn't happy about it, but I toughed it out for a couple of days and took a long rested weekend to feel better. Now this week I already worked from home Monday. Today I had an emergency that I had to be at home to deal with. So I had to take a personal day off, knowing that I couldn't work from home again this week.\n\nShortly after sending my notice, my manager reached out to me to ask if I could just log in at home to help with some work today. I told them I didn't think it was a good idea to break consistency on the team and allow me to work from home an extra day, as I had already been home Monday. I didn't want any negative attention coming my way because I was abusing policy. I haven't heard back from them yet.\n\nIt's just not fair to bend the rules when it's convenient to get work done, but not when it's convenient for a sick worker.",
        "created_utc": 1520441554,
        "upvote_ratio": ""
    },
    {
        "title": "What's allowed in the Dorm Room...",
        "author": "SpeedyAF",
        "url": "https://www.reddit.com/r/TalesFromTheCockpit/comments/8282qd/whats_allowed_in_the_dorm_room/",
        "text": "",
        "created_utc": 1520440422,
        "upvote_ratio": ""
    },
    {
        "title": "Video Game Reviewer Told to Stick to the Facts.",
        "author": "PunjabiPlaya",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/82pck5/video_game_reviewer_told_to_stick_to_the_facts/",
        "text": "Steve Hogarty wrote a review of the [H&amp;M expansion for the Sims2](https://i.imgur.com/PwzRDvx.jpg). For his next review of the Sims2: Ikea Home Stuff, he was told to stick to the facts. So [he did](https://i.imgur.com/eLLEj9u.jpg).\n\nCredit to /u/TooShiftyForYou: https://www.reddit.com/r/gaming/comments/82o851/this_is_the_review_that_got_me_blacklisted_by_ea/dvbkk7q/",
        "created_utc": 1520438685,
        "upvote_ratio": ""
    },
    {
        "title": "Take a Picture",
        "author": "notnotdying",
        "url": "https://i.redd.it/4pmk6m54rbk01.jpg",
        "text": "",
        "created_utc": 1520421200,
        "upvote_ratio": ""
    },
    {
        "title": "Vicom Security",
        "author": "sombha",
        "url": "http://www.vicomonline.com",
        "text": "",
        "created_utc": 1520413166,
        "upvote_ratio": ""
    },
    {
        "title": "M I Crooked letter Crooked letter...",
        "author": "DocShotgun",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/82liq2/m_i_crooked_letter_crooked_letter/",
        "text": "My dad was in the Navy and they were told to get everything spotless in the barracks. The drill sergeant, after determining everything was ok, decided to ask questions. He went by to each person and asked for their name and the state they came from. Something like: Smith, Alabama.\n\nMy dad, when questioned, answered normally. [name], Mississippi. The drill sergeant was like, “From Mississippi? Spell Mississippi.”\n\n“M I S S I...”\n“No, [name], spell it the correct way.”\n\nMy dad knew he wanted: M I crooked letter crooked letter I crooked letter crooked letter I humpback humpback I, but didn’t want to give him the satisfaction. So he asks:\n\n“You want me to spell it, sir?”\n“Yes, [name].”\n“I T sir.”\n\nFrom there the drill sergeant got red in the face from embarrassment and told my dad he was a smartass. \n\nDue to confusion: Mississippi has an old joke surrounding its spelling. Normally it would be:\nM I S S I S S I P P I\nThe joke is that the S’s become crooked letter and the P’s become humpback.\nAnd I T spell “it.”",
        "created_utc": 1520396383,
        "upvote_ratio": ""
    },
    {
        "title": "ADA compliance... check!",
        "author": "EternalSophism",
        "url": "https://i.imgur.com/hYYz1If.gifv",
        "text": "",
        "created_utc": 1520382190,
        "upvote_ratio": ""
    },
    {
        "title": "Just following the instructions",
        "author": "[deleted]",
        "url": "https://i.redd.it/4srpti0k88k01.jpg",
        "text": "[deleted]",
        "created_utc": 1520378781,
        "upvote_ratio": ""
    },
    {
        "title": "Just following the instructions",
        "author": "[deleted]",
        "url": "https://i.redd.it/s8b51v8p48k01.jpg",
        "text": "[deleted]",
        "created_utc": 1520377271,
        "upvote_ratio": ""
    },
    {
        "title": "Write a news-style report on Hiroshima for your homework.",
        "author": "RemoteCryptographer",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/82jd0k/write_a_newsstyle_report_on_hiroshima_for_your/",
        "text": "[removed]",
        "created_utc": 1520376337,
        "upvote_ratio": ""
    },
    {
        "title": "Wish me luck!",
        "author": "mjferr18",
        "url": "https://v.redd.it/31z3j67s08k01",
        "text": "",
        "created_utc": 1520376012,
        "upvote_ratio": ""
    },
    {
        "title": "Malicious Compliance ADVICE?",
        "author": "REEEE_iwantmytendies",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/82hljg/malicious_compliance_advice/",
        "text": "[removed]",
        "created_utc": 1520362900,
        "upvote_ratio": ""
    },
    {
        "title": "Guy keeps complaining that excavator worker is doing it wrong.",
        "author": "[deleted]",
        "url": "https://www.liveleak.com/view?t=5e8_1520033932",
        "text": "[deleted]",
        "created_utc": 1520350242,
        "upvote_ratio": ""
    },
    {
        "title": "Want me raise it higher?",
        "author": "Catholicker",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/82ejak/want_me_raise_it_higher/",
        "text": "I'm a welder in a small mom and pop shop. Ive been here a couple months and have known the owner for the better part of 20 years. I was in a tight spot and needed a temp job and he helped me out. I didn't expect to accept a full time position but I recently have.\n\nWhen I first came in the other guys warned me about John. Now I'm the only white guy in the shop and the rest are all Hispanic. Really cool guys. So I don't know if it's a cultural difference or what but he treats everyone like shit. \n\nHe thinks he's the supervisor and basicly tries to be delicate people work when he can't even complete his own. Anyway he's always rubbed me the wrong way but I have alot of patients so I've taken to doing petty stuff to upset him instead of going off and causing drama.\n\nLast week he had a problem with how low I left the overhead crane hook hanging down. It was out of the way from where we were working but I guess he didn't like how low it was. Now our crane has a wireless remote on it and we hang it on the hook as to not run over it or lose it. So he tells me to raise it higher. Ok Mr. Wanna be boss.\n\nHe's a shorter fellow and while I'm not the tallest guy I am taller and have long arms. So I put it as high as I could reach on my tip toes. \n\nIt took about 15 minutes before he needed it. And I watched him struggle with reaching it.and I'm struggling to suppress my laughter. After a few minutes of jumping with no success he grabs a broom to get to the remote off. He's could ask for my help as he told me to put it higher. I now leave it where I want and he does t day anything.",
        "created_utc": 1520337697,
        "upvote_ratio": ""
    },
    {
        "title": "You want to be in charge of the keys? Okay then!",
        "author": "TheOneCABAL",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/82df66/you_want_to_be_in_charge_of_the_keys_okay_then/",
        "text": "Hello there, I'm back with another (hopefully less controversial) story from the movie theater life.\n\n I work behind the snack bar and naturally, we only keep a small amount of stock out behind the bar, everything else is locked up in a stock room in the kitchen. Only managers have a key to this room, with one exception: a single set of backup keys. \n\nWell a few months ago the senior employees all came up with the idea that one of us should hold the backup keys for restocking things in case the bar manager was busy at the time. Most of the managers agreed and it helped things run smoothly.  \n\nFast forward to last week. One of the managers decided that no employee should have the keys. It wouldn't be that big of a deal until I saw one of this managers favorites carrying around the keys Friday night. So on Saturday when he wouldn't let us have them, I hatched my plan. \n\nAny time I would need something brought out to be restocked behind the bar I would wait until I saw the manager go into the office, count to 4 to make sure he just sat down in his chair, and say into the radio \"Hey, *(manager)* can we get more large cups brought out to the bar?\"\n\nI did this 4-5 times until he finally walked out with a cart full of just about everything we could possibly need from him and he said as much. \n\nAfter a few minutes of not picking and searching I found my quarry. Our cheese dispenser (for nachos) has room for two bags: one loaded into the dispenser, and one sitting in a warmer to make sure it's ready for when the current bag ran out. And we didn't have a backup bag. So one last time I was able to ask him for help with something.\n\nHe stormed out of the office to fulfill my request completely unable to express his frustration. As an avid reader of this sub I expected him to throw the keys at me and disappear into the office but he didn't give in and he suffered the consequences. ",
        "created_utc": 1520323320,
        "upvote_ratio": ""
    },
    {
        "title": "“Come talk to me when you decide you want more of a work life.”",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/82c7of/come_talk_to_me_when_you_decide_you_want_more_of/",
        "text": "[deleted]",
        "created_utc": 1520308960,
        "upvote_ratio": ""
    },
    {
        "title": "Ruin a department I helped create? Fine. Whatever.",
        "author": "DangerPaladin55",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/82bvw1/ruin_a_department_i_helped_create_fine_whatever/",
        "text": "This goes back decades. I'm almost over it. (not really)\n\nI joined a company that was set up as a consultancy to a large corporation to repair their relationship amongst the local community that they were part of. I was in the IT division - I was part of a team of five people who installed computers in local businesses and it ran a billing package for these businesses. We trained their staff and supported everything. This was all done as a low-cost outreach and was very successful.\n\nThis went fine for about eight years until the top guy in the company left to join the corporation and a new guy took his place as director. The new guy, who wasn't really a problem, was more of a paper manager. A genius at it really - but he left all personnel issues to the department managers. However, he didn't along with the IT manager and she finally resigned after months of tense standoffs over various policy issues.\n\nNow, I was the most experienced staffer and I might've had a chance to get her job, but the office grapevine said the director had already secretly selected someone himself. This was surprising as we'd merged with the large corporation and all hiring was required to go through human resources. But he wanted to be able to replace our manager instantly so he'd been grooming the replacement so the moment she resigned (in a fit of anger during a meeting) he had her replaced right away.\n\nRemember how I said the director wasn't good at personnel? He wasn't good at hiring and interviewing either. The new IT manager was horrifically unqualified. Her resume was invented from top to bottom. She had no management experience and as we discovered - she knew nothing about IT.\n\nHow much nothing? She didn't understand the difference between Macs and PCs. She made a major purchase of new office software for the entire office. Mac office software. We ran MS-DOS on PCs at the time. Although Windows 95 had come out a few years earlier - we were locked into IBM PCs w/DOS based applications on a contract with IBM.  Her resume boasted a deep programming background, but she didn't know what a subroutine was. It simply got worse and worse.\n\nOver the next few years, she deliberately drove out all experienced staff. She would require highly granular timekeeping for all of IT, tracking who called in for support, when we spent support at a business or the corporation, even though there was ZERO use for this as there wasn't even internal tracking for who used what. When we complied, including tracking the time to track the time, and her increasingly complex needs for details started to take up to an hour each day - the director ended it. She also routinely took personal credit for projects done by her department with no acknowledgment of the actual individual who performed the work. One by one my coworkers left to other jobs - and in one case she framed one guy for a failure she caused and got permission to fire him. \n\nShe replaced everyone with people she had known at previous jobs - regardless of their backgrounds and job skills. A Cobol programmer replaced one of our training and support people. He was a great guy and miserable in the role she put him in. She hired another woman to replace another staff member but all this woman had done before was author training manuals. Our training materials were all provided under our contract. I never figured out what she did aside from acting occasionally as a personal secretary. Which made no sense since we had a secretarial pool. And she got paid three times what they got paid.\n\nAs for me - my wife and I had had our first child around this time and I simply didn't care about issues of pride anymore. I was careful to CYA myself because all I wanted to do was bring home a paycheck for my family. The IT manager took credit for everything I did. I was careful to document my work - and in many cases, her taking credit failed because it was too obvious she wasn't involved. She moved on to trying to get me fired. \n\nAnyone who has done customer/computer support knows that you will get customers you just cannot make happy. Usually just a personality conflict. In the past, we simply traded the call off to another member of IT staff and that would often do the trick.\n\nMy manager tried to inflate all of these to fireable offenses. To my face, she would promise to have my back (as the original IT manager always did - she LOVED her staff and would take a bullet for us). Behind the scenes, she tried to build a case against me.\n\nThe first time I realized this was a meeting between the director, one of our business consultants, my manager and myself. I'd been given a heads up by the business consultant and when I walked into the meeting I had all my notes on my supposed failures. She made her pitch to the director, but the business consultant and I destroyed her and demonstrated to the director she was inventing things. She was humiliated and I remained unscathed.\n\nThe second time, an assistant manager at one of the businesses I'd recently installed a computer system at, raised a huge stink. He'd been following me around during the install and questioned me. Turns out he was trying to set up a system at home to call into his office to get onto the network. Which, back then, was a bigger deal than it is today. However, I'd actually done this for another business - but not this one. He'd made some random guesses as to what he needed and wasted $5000 (because it was all IBM hardware/software). He blamed me. Again, the IT manager told me she'd reviewed my notes and knew I was blameless. I wasn't stupid enough to believe her again.\n\nI got the business consultant to go to the head manager at this business and ask about this. It turned out the assistant manager there had never requested remote access internally and the entire staff there supported my version of events.\n\nOf course, my manager once again had tried to escalate this to a major failure. Remember those detailed notes/timekeeping she had wanted? Well, even though the ridiculous depth of them was gone, I still kept them. She called another meeting, this time inviting senior management from the corporation as well. It was another embarrassing moment for her. I refuted all the claims made by her and the assistant manager of the business and with documentation. My good friend, our business consultant, backed it all up and the cherry on the top? The head manager of the business called the senior management at our corporation to apologize for his assistant manager and to praise my work. My manager looked like the idiot she was. All because I continued to comply with the task/timekeeping she originally instituted to drive the old staff out.\n\nNow - she kept her job (mainly because our director would have to explain why he hired someone so clearly unqualified and he couldn't because he violated HR policy to do so). But I know you readers out there want to hear some juicy revenge as well.\n\nThat weekend following that meeting a major business's entire computer network I'd installed went down after a lightning strike. I remotely diagnosed it and knew it needed a simple hard drive replacement and a restore from a tape backup.\n\nI came in Monday. Before I could leave to fix the client she called me into her office. She offered me a three-month severance package. Full pay, benefits, etc. They only offered these to management types normally. She hated me and wanted me gone. I told her I would GLADLY accept it - but didn't she want this client fixed? It was kind of a big deal. She said NO. While I signed the legal paperwork she rambled idiotically about my job performance, etc, but I just finished signing, took my copy of the papers, and told her that she didn't know anything about what she was talking about and this severance proved that.\n\nI packed up my office, said goodbye to my friends (many of whom were shocked and crying over this - and I can't deny I was a little wet around the eyes too). I told them it wasn't a problem.\n\nAnd you know what? It wasn't a problem. I'd been building my own software company on the nights and weekends for years (with full permission of my original manager). I walked out of there was three months of free salary into my own company which was now paying me more than my old salary now that I could go full-time with my partners.\n\nOh, and my friend who got fired? I used my contacts and found him a job, a better job, too.\n\nAs for my manager? They took over TWO MONTHS to figure out how to replace and restore that hard drive to the business that had the lightning strike. I wasn't kidding about her hiring the wrong people for our jobs. That business likely bad mouthed them because they barely retained 25-30% of the businesses as they lost them one by one over the next few years. (my friends kept me up-to-date until, they too, left)\n\nTL;DR - new manager doesn't know IT, runs out existing staff to hire friends who aren't qualified, finally it's down to me and I comply and comply as it ruins the department under her. I walk w/a nice severance package into my own company.",
        "created_utc": 1520305672,
        "upvote_ratio": ""
    },
    {
        "title": "Pedestrian walks over cars that are parked on the walkway.",
        "author": "DarthVersius",
        "url": "https://www.youtube.com/watch?v=0R4CPzE17hk",
        "text": "",
        "created_utc": 1520269347,
        "upvote_ratio": ""
    },
    {
        "title": "Wear nicer clothes to work",
        "author": "photonrain",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/823kuo/wear_nicer_clothes_to_work/",
        "text": "First off I acknowledge I was a stroppy employee.  I did work very hard for the company (of about 15 employees) for 3 years before the company was moved 100 miles north from my hometown in the Waikato to Auckland. I moved with them and on arrival essentially a new CEO joined. I was in the research and development team (one of 3). She had a background as a corporate lawyer while my engineering role was unique but most like IT, I had no client contact, I was often in a darkroom doing optical testing.  I was undeniably a raggamuffin, a tee-shirt with a frayed collar, slightly torn jeans and skater shoes would be fairly standard.\n\nAnyway a big deal was made by this new manager about me dressing more tidily if I wanted to progress in my career .So I went and bought new leather shoes, dress pants and a black dress shirt.  However in homage to my boyracer brethren from waikato I got a large mazda engine style rotor and the words \"Waikato Fuckin Rotors\" embroider on the back of it .  On its first outing I bumped into thenew CEO at the front door of the office and she was very very impressed with my effort.  It was only later in the day she saw the back of it and said if I ever wore that shirt again I would be sent home to change.  \n\nFor the next few months I was always very close to being fired but eventually her and I became excellent friends and I worked at that company for another 8 years travelling the world representing them (in a suit she paid for for my tutoring her son in maths and physics).\n\nHowever you see it, it was malicious compliance and a bit of push back against a new boss trying to change the company culture.",
        "created_utc": 1520226477,
        "upvote_ratio": ""
    },
    {
        "title": "My wife said I could have HALF of the Snickers bar.",
        "author": "Taz666",
        "url": "https://i.redd.it/yt5140j12vj01.jpg",
        "text": "",
        "created_utc": 1520218992,
        "upvote_ratio": ""
    },
    {
        "title": "Throwing a hysterical child onto a ride who misses the height limit by 2-inches? Whatever you say!",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/821y48/throwing_a_hysterical_child_onto_a_ride_who/",
        "text": "[deleted]",
        "created_utc": 1520209841,
        "upvote_ratio": ""
    },
    {
        "title": "You're going to fail but you still need to hand something in",
        "author": "ukozthrowaway",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/821i29/youre_going_to_fail_but_you_still_need_to_hand/",
        "text": "A recent post reminded me of a short but sweet malicious compliance story of mine where I wasn't granted an extension for a paper in high school (can't remember what my reason was).\n\nAfter appealing not getting the extension, and it being rejected again I was told that my paper was past due and I would fail the assignment. I said that if I was going to fail anyway why bother even finishing it now. \nThe teacher replied saying that I needed to hand in something for each assignment, regardless of the grade, otherwise I would fail the subject.\n\nSo I wrote a front page with the assignment title, my name, and my teachers name, and handed that in as my assignment. My teacher was furious.\nI was graded a F, with a -60% for being a week late.",
        "created_utc": 1520205644,
        "upvote_ratio": ""
    },
    {
        "title": "Everything 1$",
        "author": "X-Filer",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/820708/everything_1/",
        "text": "[removed]",
        "created_utc": 1520194402,
        "upvote_ratio": ""
    },
    {
        "title": "So you brought me in from across the country with great promises but lowered my salary from the first week and want me to update all info on your projects one letter each week? No problem, new lady lawyer boss.",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/81zzbz/so_you_brought_me_in_from_across_the_country_with/",
        "text": "[deleted]",
        "created_utc": 1520192547,
        "upvote_ratio": ""
    },
    {
        "title": "I don't care about your excuse, hand it in or you get a 0.",
        "author": "SpideyPoolRomance",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/81znq7/i_dont_care_about_your_excuse_hand_it_in_or_you/",
        "text": "Please excuse the terrible writing. \n\nThis is a story from 4th grade. We were given a major project in english where we had to write and \"publish\" our own children's books, including drawing pictures and binding them. \n\nI went all out on this thing working on it during class, lunch, and at home. I finished it at home two days before it was due and put it in my bag to take to school the next day.\n\n(Now a little bit of a backstory, my mom and brother (3 years younger) were extremely abusive to me with my brother constantly tormenting me and destroying my stuff with no consequences.)\n\nSo my brother went through my room (again,) destroying anything he could get his hands on, snapping my pencils, my CDs, and tearing up my project into little pieces.\n\nI went in the next day and told my teacher that my brother destroyed my project and could I please have a week to turn in a replacement. She told me that she doesn't care about my excuses and that if I don't get it in the next day I would get a fail on the project. \n\nThe next day I delivered a ziplock containing the pieces of my project and dropped it on her desk, she gave me a B+ out of pity I think.",
        "created_utc": 1520189740,
        "upvote_ratio": ""
    },
    {
        "title": "Reddit compliance",
        "author": "Sparx86",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/81vpp8/reddit_compliance/",
        "text": "[lets see how that plays out for him cotton](https://np.reddit.com/r/baseball/comments/81vevr/on_this_day_in_2017_the_mods_told_me_not_to_post/)",
        "created_utc": 1520139529,
        "upvote_ratio": ""
    }
]