[
    {
        "title": "Saved (hopefully) at least 80 lives",
        "author": "sokado",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/1055ejo/saved_hopefully_at_least_80_lives/",
        "text": "I got diagnosed with several pesky autoimmune diagnoses pre- and post-Covid.\nSince then I was prescribed several helpful medicines, and many of them were made available to Ukrainian and Polish women. I am so grateful to the blessings of this planet that I could use my misoprostol and mifepristone prescriptions to help women and children to escape pregnancy nightmares.\nThank you and I hope that 2023 becomes a better year!",
        "created_utc": 1673038889,
        "upvote_ratio": 1.0
    },
    {
        "title": "I can’t prop the door open? Alrighty then",
        "author": "Pickles_McWaffle_1",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/1052oz7/i_cant_prop_the_door_open_alrighty_then/",
        "text": "TLDR: Been sitting on this story for a few months now. I work for a small moving company in my city. We move furniture and decor to many different places throughout the city. \n\nWe got a call about moving a large load of bookshelves to a rather large industrial building. We loaded up two 18 foot box trucks full of shelves and were ready to move. When we arrived at the building, we pulled around to the loading dock and began off loading the shelves. \n\nAs we were bringing stuff off the truck, I went to building security to open the door. (There had been a recent string of shootings in our area and everyone was locking all the doors.) They handed me a door stop and told me I could prop the door open since we have a large load. So I propped open the door and we got going. \n\nWe no more had the first pallet off the truck when the building’s maintenance manager came running towards us. He screamed at us “WHAT ARE YOU DOING?! YOU CANNOT HAVE THAT DOOR PROPPED OPEN!!!” Now this man looked like he was somewhere between the ages of 76 and 105. He was as red as I’ve ever seen anyone. I calmy told him that security gave me a doorstop and told me since we have such a large load, we could keep the door propped open. Of course, he wasn’t having it. “I DON’T CARE WHAT SECURITY TOLD YOU, YOU CANNOT HAVE THIS DOOR PROPPED OPEN!!” \n\nAt this point, my Native American temper got the better of me. I replied “Yes sir!” I walked over to the door and picked up the doorstop. I walked back to security and explained the situation. They rolled their eyes and explained that this crotchety old fossil is always causing problems all over the building. They told me I could still prop open the door but now I was mad and was feeling petty. He doesn’t want us to prop the door open? Alrighty then. \n\nThere was a buzzer outside of the door so I buzzed security asking them if they could open the door. Well guess who’s office was right by said door and thus guess who security called to open the door and let us in? That’s right, fossil man that was two days older than dirt.\n\nHe opened the door and let us in. We made our delivery and came back to grab another pallet. I again buzzed security and they again asked fossil man to let us in. This happened twice more before he stopped me and said “You know if you wanted to keep that door open, you can since you have such a big load.” I replied with the biggest smile on my face “Oh no sir, this door cannot be propped open. I wouldn’t want to upset anyone by doing that.” He looked at me with a look on his face that was somewhere between murderous and the realization that he had made a huge mistake. \n\n18 pallets later, we had the load delivered. And every single time, guess who had to let us in? It took us a little over 2 hours to get everything finished. The last pallet we delivered, I poked my head into fossil man’s office and said “Thank you so much for your help.” I’m pretty sure he popped a blood vessel. \n\nTLDR: Crotechy old fart tells me I can’t prop open a door, alright then you’ll open it for me more than 20 times.",
        "created_utc": 1673032498,
        "upvote_ratio": 1.0
    },
    {
        "title": "\"Are you sure you want my feedback?\" - HR insists on it while being in front of Boss....",
        "author": "Warrior044",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/1052jer/are_you_sure_you_want_my_feedback_hr_insists_on/",
        "text": "[removed]",
        "created_utc": 1673032119,
        "upvote_ratio": 1.0
    },
    {
        "title": "30 min lunch break",
        "author": "Curtismcg7392",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/104ktnm/30_min_lunch_break/",
        "text": "In my job we are allowed a 30 min lunch break each day. I work in the hospitality sector so I am usually always busy. Most days I do not take my full break as i only need 10-15 min to eat some food and then I am happy to get back to work. I am not paid for this other 15 min as the 30 min is automatically deducted from my wage at the end of the day but I dont like leaving my coworkers swamped when there's one less person there. I rather just take the time I need to eat and get back.\n\nIn the last 2 months there has been a flu going around that everybody seems to be getting and I was not excluded from this. I was in bed for 2 days with a fever but luckily these were my days off so I didnt miss work. The 3rd day I had to go into work and didn't want to call in sick so I just fought through it and went to work. After the first 6 hours of my shift I was exhausted and finally got my break. I ate really quickly in about 5 min and decided to take a nap and set my alarm for 30 min.\n\nAfter my alarm went off I went straight back to work. One of my managers lets call Mr. Hugh Jass came up to me and asked me where I had been and I told him I had a nap on my break as I have the flu. He said that I took an extra 5 minutes and I am only allowed a 30 min break per day. Later on that day HR sent out an email saying they had been told that employees were taking extra long lunch breaks and the employees are allotted 30 min breaks.\n\nCue malicious compliance: For the next 2 weeks I took exactly 30 min breaks. Not one minute more or less. I calculated over 2 weeks the company had lost at least 3 hours of free work I would have otherwise been doing before the email. It appears Mr. Jass noticed this aswell as after 2 weeks he asked me why I was now taking my full 30 min break. When I explained to him he apologised and said I could go back to using just the 15 min now that we had cleared it up. I told him I was now happy with my 30 min break and will keep using the full thing.",
        "created_utc": 1672979736,
        "upvote_ratio": 1.0
    },
    {
        "title": "I will take care of myself.",
        "author": "mukofish",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/104ir6t/i_will_take_care_of_myself/",
        "text": "Apologies for any typos and formatting, on mobile.\n\nI worked at this custom fabrication shop for a few years. It was a fun place to work, lots of different projects. I did the engineering and drafting. Shortly after I started, one of the guys I worked with got promoted to be my boss. He was great to work with and for. Upper management had no idea how long things took and he kept them in check when they tried to over promise on what we could do. \n\nWell covid hit and they let go of all of middle management so my boss went bye-bye. As did most of my department team. Then they promoted the worst possible person to be the manager of my department. He worked in a lot of different departments and felt he was always right. \n\nTo keep the doors open, uppermangment said yes to pretty much every job they could. It got to the point where the shop was working 10-12 hour days 6 or 7 days a week, and my department was doing 10-12 hour days 5 days a week. They kept asking me to work Saturdays, but I have my kids, so I kept telling them I couldn't. \n\nNow for the malicious compliance. One day, in a one on one meeting, I was telling my boss how the overtime is burning me out. It's almost an hour drive for me to the office. So if I'm working a 10 hour day and i take a half hour lunch, that's 12.5 hours away from home. \n\nHis response was, \"I didn't tell you where to live. It's my job to manage the work load, it's your job to manage your personal life.\" \n\nSo queue malicious compliance. I stopped giving a shit about what was coming in and only worked on the things he told me to. I didn't take any extra initiative and managed my personal life right into a new job. \n\nShortly after, the other experienced people in the department also handed in their two weeks. Last I heard, they lost some big contracts because they couldn't keep up with the workload. \n\nTl;dr\nMy manager essentially told me my burnout was my problem, not his. So I quit, prompting the other people in my department to also quit. Company lost at least $2 million in contracts because they couldn't keep up with the work.",
        "created_utc": 1672973861,
        "upvote_ratio": 1.0
    },
    {
        "title": "Downstairs neighbor demands we ‘walk normal’. So we do. And she HATES it.",
        "author": "PaludisVulpes",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/104h4ji/downstairs_neighbor_demands_we_walk_normal_so_we/",
        "text": "We’ve been living in this apartment for three years. It’s old. It’s cozy. The building is ~20 years old and though the appliances and wall paint and carpets have been replaced… the floor has not. It’s painfully thin. Every step we take creaks and groans and it’s ANNOYING. Living on the 3rd floor, we know it’s gotta be even more so for whoever lives below us. So, we’ve done our best to be mindful of their comfort, and try not to make too much noise.\n\nWe had a new downstairs neighbor move in a couple months ago. And she is NOT convinced that we are literally tip-toeing around our apartment. Every time I get home and close my door? She’s banging on my floor with a broom or something. Every time I cross the living room? Banging. Every time I vacuum? Banging. Every time my dog chews on a bone? She bangs on the dang floor and it scares my poor dog. We’ve been living on eggshells trying to be courteous, but she’s driving us mad with her insistent BANGING every time we take a step.\n\nI guess she had finally ‘had enough’ because she came upstairs to yell at us the other day. “You are too loud! You need to be courteous and walk normal! You have neighbors!”, she yells. She almost looked like she was going to cry. It was disturbing. We felt bad. My husband tried to explain that, ma’am, we do our best to be quiet, but these floors are really old and they creak. We’re not stomping or jumping or running. We’re living - but we’ll continue to be considerate.\n\nShe was NOT impressed with his answer, and continued to argue. “Well, I lived on a first floor before and my other neighbors weren’t loud like you.” “It’s so loud and my job is so stressful so I want you to stop stomping.” “I don’t want to be a mean person but I really think you’re too loud.” \n\nSo you know what we agreed to? To walk like normal people. “Okay, okay, we’ll walk normally.” We said. This is exactly what we had been doing. Nothing different. So she still bangs on the floor and gives us nasty looks. But we are being normal people who walk normal and don’t stomp around! Our dog is a normal dog who chews on bones and walks from his bed to his food bowl, and gets excited when it’s time for walkies! We are so normal!\n\nWe’ll be moving in the next month so it’s no skin off my back. Hope the next tenant doesn’t have kids… or maybe I do. And then she’ll finally understand that we are normal people who walk normal. Maybe she’ll miss us.",
        "created_utc": 1672969481,
        "upvote_ratio": 1.0
    },
    {
        "title": "Drowning in rv bed sheets",
        "author": "Agile-Ad-4913",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/104euf2/drowning_in_rv_bed_sheets/",
        "text": "This happened several years ago. I was working out of town and my wife was in poor health so the whole family had to go live with me in my 34’ fifth wheel bunk house rv. So it’s my wife,12 yr old daughter and 9 yr old son and myself living in this rv for 2 yrs at a pretty nice rv park . The wife wanted to get new sheets for our bed so told her to see what Amazon had. She finds a few different ones she likes and was showing me them . I mentioned that our mattress is a queen but it’s not a normal queen size. For those of you that don’t know a lot of Rv’s (not all) have what is called a short queen or rv queen mattress. I honestly can’t remember exactly but I think the mattress is 4” shorter. So anyway i go through her picks and find one that has a rv queen size. They are 600 thread count Egyptian cotton. Cost 60-70 dollars each . I say what the hell and get them. When we get the package they sent the wrong ones so i got ahold of Amazon they said to send them back and they would send out correct ones. We get the correct sheets about 5 days later and all is good . I get a call from the rv office about 4 days later that says I have 3 packages which is odd cause I almost always know when I have packages due . Anyway I pick them up and it’s 3 sets if sheets all rv short queen 70$ sheets . I get ahold of Amazon and tell them about package and they say thanks and to keep them. 2 days later another 5 show up, next day 2 next day 7 etc etc . This goes on for about 45 days . I think I ended  up with about 125 sets of $70 dollar mattress sheets. I had the owner of the Park refuse packages and return to sender as I was buried in sheets . I got ahold of a large rv outfit and made a deal for 100 of the sheet sets. Made 3000 on the sheets and still had 10-15 sets after I gave almost everyone in the rv Park a set lol. I had tried several times to get them to stop mailing them to me . What we think happened is that someone one put our addres as the return addres for the short rv sheets, since that is the only ones we ever go and they had all sizes in the ad .",
        "created_utc": 1672963642,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to destroy someone",
        "author": "CrazyBoysenberry1352",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/104csjk/how_to_destroy_someone/",
        "text": "My ex-bf is a total narcissist. We both grew up in a dysfunctional family. Both of us are children of trauma. However, I choose to deal with it, and seek therapy, while he chooses to point fingers and deny. He has gaslighted me, cheated on me, tried to “open our relationship“ and still, when he can’t get any regular sex, opens up his Facebook account to contact me. \nNormally, I am ‘blocked’. (Until this last year, when I blocked him only to have him open new accounts to approach me. Gross, motherfucker). \nHe also gets into local Reddit sex and sex club sites, in which he’d initiated me into. Not that I don’t like the ‘scene’ I just honestly preferred it with him since we were both a bit gun-shy.\nStill, we had some of our best sex at these clubs in SF. (Which he still advertises for sex with others with having had me on a pole— BITCH) I preferred power exchange, he liked twist for whatever reason. (Less adventure. Too many overweight. like OBESE people.) \nSo anyway….\nHe has done some really skeezy sleazy shit, and I want him to be punished. \nWhat he has is a ‘microwave’ as a mail box.\nIt is not ‘sanctioned’ by the post office, but for ease, they put the mail\nThere. \nNot legal.\n\n\nProposing some devious tricks.\nNothing to do\nWith the US mail. \nWhich is a felony. \nJust wanna teach this MF a lesson. \nPM me.",
        "created_utc": 1672958766,
        "upvote_ratio": 1.0
    },
    {
        "title": "He heheh",
        "author": "[deleted]",
        "url": "",
        "text": "[removed]",
        "created_utc": 1672957222,
        "upvote_ratio": 1.0
    },
    {
        "title": "We don't pay for tolls in express lanes",
        "author": "Healthy_College_6067",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/1049k2k/we_dont_pay_for_tolls_in_express_lanes/",
        "text": "[removed]",
        "created_utc": 1672951335,
        "upvote_ratio": 1.0
    },
    {
        "title": "Counting Chips At a Casino",
        "author": "Awild788",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/1048bj6/counting_chips_at_a_casino/",
        "text": "Several years ago I worked in the Cage (place where you cash out) in Casino.  During my time there I was a cashier and a manager.  We had people trying to get things over on us all the time from invalid coupons ( comps ), fake chips, chips from other casinos,  short change artists,.and others.  \nThe folks I always enjoyed dealing with where the ones who would bring a large amount of lower denomination chips usually the total would be around 150-300 US.  Now as a cashier these people never fazed me and they did not get anything over on me.  As a manager I would back up my people.  The short change chip con works like this.  The customer puts down a handful or two of chips and starts immediately complaining about how long it is taking.  They will interrupt the cashier constantly telling them how much is there and demanding there money.  Also people with fake chips use same tactic.  If the cashier's gets  rattled they will misscount and payout wrong.\n So here is where the malicious compliance comes.  Since the customer is complaining that it is taking to long andy cashier is counting wrong.  I would go over and help.  I would instruct the cashier to make sure they count it correctly by verifying every chip.  That is asking for someone to come over and check it.  I would also tell my cashier that anytime the customer interrupted to stop mix the chips up and start recounting and tell the customer they need to start over for accuracy.  Basically doing the.tje exact thing to them except the speed.  Well this resulted in the payout being super correct, taking a long time, and the customer basically having to keep quiet.  Also it gave me plenty of time to get a picture of the person sent to every Cage so they would be aware we had a chip shorter on board.\nI also got to recognize few of these folks and would great them as they came up to the window.  Which they usually responded with just being quiet.  I kept several of my cashier's from losing their jobs die their drawers being off.\n\nIn a Nut Shell.  Customers try to con.casheirs by distracting them but preventing the bad payout by over complicating the payout.\n\nThis is a little long and sorry if it did not flow as well as I would like",
        "created_utc": 1672948422,
        "upvote_ratio": 1.0
    },
    {
        "title": "You don't want me to eat fast? Ok",
        "author": "BiggusVickus",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/104741f/you_dont_want_me_to_eat_fast_ok/",
        "text": "Tldr: I am a fast eater. My parents don't like that. So I eat my salad outrageous slow (1 lettuce leaf at a time). Turns a 15 minute lunch into a 1 hour lunch. Now I can eat as fast as I want. \n\nSo I am usually a fast eater, and will be the first one to finish food at the dinner table (or wherever I'm eating). As such, I tend to take large bites, and fill up my fork to the max. My parents don't necessarily like it. They think it's disgusting, I disagree as food isn't coming out of my mouth, but I'm not here to argue that. \n\nAt lunch today (at a restaurant), I was eating my salad quickly. My parents got angry and told me to slow down and take smaller bites and not to fill up my fork with as much food as possible. \nIn my head I'm thinking \"Ok, I won't do that\". \nI proceed to take a slice of lettuce, or 1 crouton, or 1 onion ring onto my fork at a time. \n\nWhat started out as initially a 15 minute lunch became an hour or so lunch, as it took forever to eat my salad. Towards the end of the first salad they were begging me to hurry up (as they had stuff to do) I then decided to have seconds (usually I wouldn't have had a second salad, but I really wanted to rub it in) and I had an extra salad, repeating the 1 lettuce leaf at a time. \n\nNow I'm allowed to eat how I want.",
        "created_utc": 1672945539,
        "upvote_ratio": 1.0
    },
    {
        "title": "You don't want me to eat fast? Ok",
        "author": "BiggusVickus",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/104733a/you_dont_want_me_to_eat_fast_ok/",
        "text": "Tldr: I am a fast eater. My parents don't like that. So I eat my salad outrageous slow (1 lettuce leaf at a time). Turns a 15 minute lunch into a 1 hour lunch. Now I can eat as fast as I want. \n\nSo I am usually a fast eater, and will be the first one to finish food at the dinner table (or wherever I'm eating). As such, I tend to take large bites, and fill up my fork to the max. My parents don't necessarily like it. They think it's disgusting, I disagree as food isn't coming out of my mouth, but I'm not here to argue that. \n\nAt lunch today (at a restaurant), I was eating my salad quickly. My parents got angry and told me to slow down and take smaller bites and not to fill up my fork with as much food as possible. \nIn my head I'm thinking \"Ok, I won't do that\". \nI proceed to take a slice of lettuce, or 1 crouton, or 1 onion ring onto my fork at a time. \n\nWhat started out as initially a 15 minute lunch became an hour or so lunch, as it took forever to eat my salad. Towards the end of the first salad they were begging me to hurry up (as they had stuff to do) I then decided to have seconds (usually I wouldn't have had a second salad, but I really wanted to rub it in) and I had an extra salad, repeating the 1 lettuce leaf at a time. \n\nNow I'm allowed to eat how I want.",
        "created_utc": 1672945479,
        "upvote_ratio": 1.0
    },
    {
        "title": "You don't want me to eat fast? Ok",
        "author": "BiggusVickus",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/104728y/you_dont_want_me_to_eat_fast_ok/",
        "text": "Tldr: I am a fast eater. My parents don't like that. So I eat my salad outrageous slow (1 lettuce leaf at a time). Turns a 15 minute lunch into a 1 hour lunch. Now I can eat as fast as I want. \n\nSo I am usually a fast eater, and will be the first one to finish food at the dinner table (or wherever I'm eating). As such, I tend to take large bites, and fill up my fork to the max. My parents don't necessarily like it. They think it's disgusting, I disagree as food isn't coming out of my mouth, but I'm not here to argue that. \n\nAt lunch today (at a restaurant), I was eating my salad quickly. My parents got angry and told me to slow down and take smaller bites and not to fill up my fork with as much food as possible. \nIn my head I'm thinking \"Ok, I won't do that\". \nI proceed to take a slice of lettuce, or 1 crouton, or 1 onion ring onto my fork at a time. \n\nWhat started out as initially a 15 minute lunch became an hour or so lunch, as it took forever to eat my salad. Towards the end of the first salad they were begging me to hurry up (as they had stuff to do) I then decided to have seconds (usually I wouldn't have had a second salad, but I really wanted to rub it in) and I had an extra salad, repeating the 1 lettuce leaf at a time. \n\nNow I'm allowed to eat how I want.",
        "created_utc": 1672945424,
        "upvote_ratio": 1.0
    },
    {
        "title": "100 earbuds for the price of 1",
        "author": "CSyoey",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/1045b61/100_earbuds_for_the_price_of_1/",
        "text": "This was several years ago, back when totally wireless earbuds were still a new concept. This ear bud that I bought was just an individual, it didn’t come in pairs. \n\nSo I bought one earbud for $30, which seemed like a good deal at the time. But it arrived to me broken, it wouldn’t turn on or charge. So I emailed the company and they sent me a 99% discount code. They never stated in any of our emails that this code was only to be used on one more earbud. \n\nAnyways why should I pay to replace something that never worked in the first place? I would have gladly sent the first back and waited for another one to be delivered. But they insisted that I just use the discount code to replace it. \n\nInstead of buying 1 earbud for $.03, I bought 100 for $30. Which is the original cost of just one. \n\nI have a ton of them away, my friends kept losing them and I just kept handing them out. But I also sold a bunch and made over $100 in total. I could have made more money but I kept losing them myself so it was good to keep extras. Then by the time I lost all of them, I was ready to buy a true pair totally wireless earbuds",
        "created_utc": 1672941280,
        "upvote_ratio": 1.0
    },
    {
        "title": "I'm Not The Vice Principal Anymore? Ok!",
        "author": "Disgruntled_Veteran",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/1044s2s/im_not_the_vice_principal_anymore_ok/",
        "text": "[removed]",
        "created_utc": 1672939989,
        "upvote_ratio": 1.0
    },
    {
        "title": "Better get some ice tea if you like it, there’s going to be a shortage.",
        "author": "LuchiniOfAstora",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/103vw5t/better_get_some_ice_tea_if_you_like_it_theres/",
        "text": "[removed]",
        "created_utc": 1672915164,
        "upvote_ratio": 1.0
    },
    {
        "title": "Triple the cost of travel, because \"corporate has a discount\"? Sure!",
        "author": "r4zv4n80",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/103vh86/triple_the_cost_of_travel_because_corporate_has_a/",
        "text": "I was supposed to go on assignment in Toronto for about a month and a half, so I find myself a nice studio apartment right across the street from the office (this was quite a while ago, way before AirBnB), I submit  my options to the travel department and they deny it, saying I should get a hotel instead (at one of X, Y, Z chains).\n\nSo I look up hotels and find one that was a couple subway stations away, but even with our discount code, it was double the amount. \n\nI go back to the travel dept and explain that not only is it (much) more expensive, but it'd also incur additional costs. Not to mention it'd be more comfortable to live somewhere with a small kitchen and a washing machine for a month and a half.\n\nTheir reply was \"*Well, getting that apartment would mess up our metrics: we have volume discounts with several hotel chains, and we know you'll be traveling for about 40% of your time, so we can exactly forecast your travel cost.*\". \n\nAt the end of my trip, my expenses were tripled compared to what I'd have spent on that apartment, since I wouldn't have needed subway rides (we also couldn't get a pass, had to expense individual tickets!), would have used a couple of detergent bottles instead of the extremely expensive hotel cleaning service, and would cook breakfast / dinners instead of going to restaurants (at that time, we didn't have a daily allowance, we'd expense everything instead).\n\nAnd since most of my trips were a week long, there was a huge difference in cost - so it got flagged at the end of year audit and the finance dept started asking questions. And since my department was very mobile in general, they found other stupid wasteful (and annoying!) policies (e.g. \"car rentals are forbidden if there's a public transportation option\" - so I had to have two $150 taxi rides from the airport to the client's town and back, instead of renting a car for the week, at about $80). \n\nLots of policies were changed following this and.. I was getting my travel related replies from someone new in that department afterwards :)",
        "created_utc": 1672913585,
        "upvote_ratio": 1.0
    },
    {
        "title": "Want to know my every move? Got it.",
        "author": "melanchonous",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/103supg/want_to_know_my_every_move_got_it/",
        "text": "[removed]",
        "created_utc": 1672903779,
        "upvote_ratio": 1.0
    },
    {
        "title": "Well I did end up playing today",
        "author": "scarlettplays13",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/103sck6/well_i_did_end_up_playing_today/",
        "text": "I went to an arcade I frequent recently and had been saving my tickets up for a while trying to get a big grand prize. It was 18,000 tickets each (their were two items I wanted) but they dropped the price to 7,000 tickets each and I had 14,000 or so tickets at the time so I went ahead and got one of the two big prizes they offered. The manager got my prize from the back and swiped my game card they noticed the last play activity was two days prior and the manager glared at me and said “from now on since it’s such a hassle to get these things from the back you have to play the day of in order to get these prizes, but I’ll be nice and do it for you this once.” All the while still glaring at me and saying how it was company policy (I used to work for that company and it was never a policy). So I smiled and loaded up my game card and won an extra 4,000 or so tickets, went back and got the second one all while smiling and saying I did play today the manager kept glaring at me while another manager grabbed the prize from the back. They checked my game card three times by three different managers to “double check” I ended up walking out with two giant prizes that day and was satisfied with my winnings.",
        "created_utc": 1672902007,
        "upvote_ratio": 1.0
    },
    {
        "title": "Keep sucking me with impossible schedules and terrible workers? It’s not my fault nothing else got done and yo look bad.",
        "author": "S3xySouthernB",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/103rjrm/keep_sucking_me_with_impossible_schedules_and/",
        "text": "Back when I was in college I would come home over summer and winter breaks and work at a certain pretzel stand. I’d been there for a few years, casually knew the owners but we weren’t on a first name basis, worked with their son when he’d pick up shifts (great kid) and knew the GM really well.\n\nGM of our two store in one mall location had to take a month off for an injury leaving two very very dumb managers in charge. One refused to work anything but an opening to 3 shift 5 days a week and the other would reluctantly do short closing shifts. Neither were competent at writing a schedule and both just wanted to look good while doing zero extra work.\n\nTo top it off we had a slew of newbies including…change girl. Don’t get me wrong, I get it, math is hard. That’s why the register tells you the change to give to someone…but it doesn’t tell you which bills or coins to give.\n\nGM texted me and begged me to work the second location as a sort of assistant manager and to come do some PM shifts to close up and do drawers. I agreed because he was fielding constant complaint from the two full grown in there 40s adults whining about their schedules. However I was blissfully unaware just how incompetent everyone was. \n\nShort am shift manager hired change girl with no interview. Other manager literally didn’t bother learning names- everyone do everything so I don’t have to- attitude.\n\nI started doing drawers and one was always off. Short, over, math of the daily report not making sense. I pointed it out to both managers who ignored it. Then my shifts at our second in mall location kicked in and change girl became my second person in the AM whose job it was to come in an hour before opening (one hour after me) and run down to the main location to get restocking stuff while I made all the dough, and prepped for the day.\n\nShe was never on time. She couldn’t couldn’t follow a list and brought the wrong stuff constantly despite a very good cook working downstairs who would have happily helped. But nope, she’s texting again.\n\nIt started to become me sprinting around making everything, removing from the oven, dip in butter, rotate everything, pack up order I was taking while she starred into space. I couldn’t take a break or clean up because she literally couldn’t comprehend an order.\n\nIt peaked when she walked away from an OPEN CASH Drawer to ask me how to make 37 cents…apparently my “quarter dime two pennies” wasn’t adequate because she brought coins over and asked me which one was the dime…\n\nShe only had her dads credit card. She’s never used cash…\nShe panicked and made me drop everything because she hit 5$ and the person gave her 10$…\n\nI begged the am manager to send help and she refused, instead scheduling a third worker for herself. It culminated with being scheduled to pull a 15 hour day with only change girl working for half the day. Idiotic managers sent out a message with a huge list of new cleaning and stocking expectations plus “no empty store” rule. Aka I was not going to be able to go to the bathroom, have a break or even get anything done. I was over it. I texted my recovering GM to please look at the schedule, my reports on the disasters, and begged for help.\n\nHe told me to fully comply and to just wait. So I maliciously and through sheer pettiness comply and it’s a nightmare.\n\nLow and behold change girl shows up finally does a run down to get restocking and by then we are open…with no cash drawer. I’m trying to serve customers and it’s a mess. Suddenly the son of the owners shows up. Asks what’s up and I explain. He offers to go get the drawer for me and does BEFORE CHANGE GIRL GETS BACK. He watches as she brings all the wrong stuff again, does unload, asks how to make change, and won’t get off her phone.\n\nHe leaves and then change girls shifts over and she’s gone and I’m solo with downstairs having 4 workers. The rest of the day is hell and nothing gets done. am manager comes back to the mall for personal shopping and proceeds to yell at me for the disaster. Just as the owners show up.\n\nShe’s pulled away for a little chat about her scheduling habits and I talk to the other owner about the entire days mishaps. Turns out GM texted them a heads up and to go in today and see the camera footage.\n\nI finally get to go home after two workers from downstairs are sent to hel.\n\nThe next morning I wake up to the most glorious phone call. An manger will now only be working with change girl and any discrepancy in the drawer being that manages fail. Both mangers now have to do all their silly requirements and schedules were being taken over permanently by GM on paid leave. I never got a crap schedule again.\n\n\nChange girl got let go in two days. Am mangers was fired in a week after the owners started monitoring her everyday. The other manager kinda got their act together when our location was sent a temp from another location and I got a raise as soon as our GM came back.",
        "created_utc": 1672899297,
        "upvote_ratio": 1.0
    },
    {
        "title": "Just Keep Him!",
        "author": "CaffeineFueledLife",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/103qqln/just_keep_him/",
        "text": "A little over 6 years ago, my husband was at the grocery store and right outside the door, he found this skin and bones dirty fluffball. He had a paw that seemed to have been crushed at some point. Well, he brought him home. We got him cleaned up and fed him. He was just a kitten but devoured two full cans of cat food. Clearly very hungry. \n\n\nWell, we did the right thing. We took a picture of him and posted him on Facebook asking if he belonged to anyone, and said we were happy to keep him if he didn't have a home. Someone claimed him so we returned him. \n\n\nThe next day, another person found him. She also posted. Same person claimed him. New person asked if she could pick him up because her husband was out with the car. She said she couldn't and told the rescuer to just \"put him outside and he'll find his way home.\" The rescuer lived about 2 miles away from her. It was freezing outside, snow in the ground. Rescuer said she wasn't comfortable with that. \n\n\nSome people who had seen our post and the new post started politely suggesting that it would be safer to keep him inside. His owner lived next to a busy street across from the grocery store where my husband originally found him. She started getting angry and defensive, saying it was impossible to keep him inside, blah blah blah. His crushed paw was brought up and she said he was just fine. Then she said, \"if you all think you know better than me what's best for my cat, just keep him!\"\n\n\nK. Second rescuer messaged us (she had since found our previous post) and said she couldn't keep him because she already had enough pets and asked if we still wanted him. We said, \"absolutely!\" My husband went and picked him up. \n\n\nOriginal owner really lost her shit them. She started messaging us saying she was calling the cops and we stole her cat. I replied with a screenshot of her comment saying to keep him. \n\n\nWe took him to the vet. Vet estimated that he was about 8 months old. He said the paw didn't seem to be causing him any pain so an x-ray wasn't necessary unless the changed. Neutered him, gave him his shots, flea meds, ear mite meds, and wormer (for our two resident cats as well cuz fleas, ear mites, and worms are very contagious). Resident cats (Connor and Murphy) hissed at the new kitty (r named him Mickey) for about 2 days. Then they were all friends. \n\n\nAs I mentioned, it has been 6 years. Mickey has never once tried to get out. He is partial to my husband but will cuddle with the rest of us if my husband isn't home. Guess he remembered who saved him. As for the original owner calling the cops? If she did, they told her to kick rocks. They never showed up. I saved that screenshot, though. All 3 of our boys are very happy and healthy indoor cats.",
        "created_utc": 1672896716,
        "upvote_ratio": 1.0
    },
    {
        "title": "Just use what you have!",
        "author": "CrackSnap7",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/103q2ug/just_use_what_you_have/",
        "text": "Never thought I’d have another story to post here, but *c'est la vie!*\n\nThis became longer than I thought it would. TL;DR at the bottom.\n\nBack when I graduated college, there were very few jobs available in my field so I applied for and landed a contractual job with the State Government. \n\nIt was mostly a clerical position with lots of typing involved; at the end of which I knew Microsoft Word and Excel well enough to call them family!\n\nThe pay was good enough considering the work and the fact that I was posted in my own city so there was no need for me to move anywhere. Besides, the contract renewed every year with a raise in salary.\n\nThe computers we were assigned for the job were surprisingly good. But anything will break down when used too often. I should probably mention that I graduated with a degree in Engineering and have been into computers since I was 11. So, for the most part I could fix any software, and even some hardware issue that hindered my work.\n\nThe resident IT “God” (self-proclaimed), Bhaskar, hated me for that! Was it because I wasn’t as dependent on him as the others in the office and he had an inferiority complex; or maybe he just didn’t like the look of my face, I’ll never know! But I was always met with a, “Why don’t you fix it yourself?” whenever I approached him with a difficult issue. So mostly I did!\n\n8 months into my second term, my keyboard died. It was your typical membrane keyboard with typical membrane keyboard issues. Which meant once a key stopped working, you threw out the entire keyboard and got a new one. \n\nFor me, it wasn’t just one key, it was the entire R3 row. Which means that all the keys from “TAB” all the way to “9” on the Numpad just stopped working one day. \n\nWhen it comes to typing, that row is particularly important! So, like a sane person, I went to Mr. IT God to request a new one.\n\n“*My keyboard is dead. I would like a new one please!*”\n\n“*Fix it yourself!*”, was the reply as expected.\n\n“*Yeah, I would like to, but this is a hardware issue. This keyboard is dead.*”\n\n“*There are no extra keyboards. Just use what you have!*”, he said this as there was literally a stack of new keyboards behind his desk.\n\nI knew this was going nowhere and I wouldn’t get a new keyboard from this guy. So, I just left.\n\nI was now in a dilemma. I needed to do the work they were paying me to do. And I couldn’t do it with a broken keyboard. I could’ve just bought a new membrane keyboard. They’re pretty cheap! But why should I spend my money on stuff my office should give me for free? \n\nBesides, I had a point to make.\n\nSo, I drove home, picked up one of my most annoying personal keyboards and drove right back. \n\nMy keyboard was mechanical. I could type faster on it. It had “Rainbow Vomit”. And it was loud!\n\nI plugged it into my office computer and got to work! Needless to say, chaos ensued. \n\nWord soon spread about the guy who had “connected a typewriter” to his computer. Apparently, they could hear me typing over in the next department! People soon gathered around to watch me type. This is a small city in India. Most of these people were technologically illiterate. They had never seen a mechanical keyboard before.\n\nThis led to a disruption in the workflow of the office and so one of the higher ups came over to investigate.\n\nHe saw me typing loudly and came over to talk. Let’s call him Borthakur because that’s his name.\n\nBorthakur - “*What is this? A typewriter?*” \n\nMe - “*No sir, this is my keyboard. I brought it from home*”\n\nBorthakur - “*This is not standard issue. What happened to the one you were given?*”\n\nMe - “*Sir, it’s broken so I’m using this.*”\n\nBorthakur - “*If your keyboard is broken, you should’ve asked Bhaskar for a new one. You shouldn’t bring personal stuff from home for use in the office.*”\n\nMe - “*Sir, I asked him for one and he told me he doesn’t have any extra hardware and to ‘use what I have’.* ***This*** *is what I have.*”\n\nBorthakur – “*Come on. Let’s go over and have a talk with him. Bring your broken keyboard*”\n\nAnd off we went to Mr. IT God’s office.\n\nBorthakur – “*Is it true that you’ve refused a replacement keyboard for Mr. Snap?*”\n\nBhaskar – “*He fixes all his computer problems himself. He can probably fix this too*.”\n\nBorthakur – “*You know full well he can’t fix a broken keyboard. Give him a new one.*”\n\nBhaskar – “*There is none available*.”\n\nBorthakur then turned to me, “*How much does your personal keyboard cost?*”\n\nMe – “*This one cost me $150, I think. Why do you ask?*”\n\nBorthakur – *“I will write you a check for $150 and deduct that from the IT Department’s budget. How does that sound Bhaskar?*”\n\n“*This is ridiculous! Our keyboards cost $2!*”, Bhaskar shouted as he picked up a new keyboard box to show him the price.\n\n“*So you* ***do*** *have replacements available!*”, Borthakur said. “*I do not know why you are refusing him a new one but you better give it to him now!*”\n\nNeedless to say, I had a new keyboard before the hour was over.\n\nI refused a contract renewal and left that job 3 months later.\n\n**TL;DR:** IT guy suffers from inferiority complex and refuses me a replacement keyboard. I bring the most obnoxiously loud keyboard I have to work. Chaos ensues. I get replacement keyboard.",
        "created_utc": 1672894725,
        "upvote_ratio": 1.0
    },
    {
        "title": "Minimum maintenance",
        "author": "Muad_Dib_of_Arrakis",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/103p2kp/minimum_maintenance/",
        "text": "I work at a place where equipment is not treated well. New hires are poorly vetted and trained, old hands hop to a different piece of equipment, and it falls to me and my manager to fix this equipment, as maintenance. \n\nDuring the December rush, we were so busy that there was no time to do periodic maintenance or inspections of machines. (So busy, in fact, I was instructed to supervise and sometimes operate a number of problem machines to the exclusion of all other maintenance items.)\n\nWhen I brought this up to my boss, he sighed and said that his manager had told him not to bother with PM's, inspections, walk-throughs, or any of the other ways we head off issues before they become major. \n\nHe said that yes, he knows what it means, and to document all repairs done and parts and supplies used (that's a tale for another post). I said sure, and got back onto the floor. \n\nLater that week, an automated packing machine threw a belt due to a tear. It would have gotten caught in an inspection or PM, but neither were done. Due to the nature of the machine and it's newness to the facility, we didn't have any spare parts. \n\nThe downtime to the machine, cost of an expedited belt and flying out a technician to install it were somewhere in the mid five figures range, I'm told. \n\nA few days after that, a truck's brushes finally gave up the ghost. Told the big boss, I can fix it but it'll take a while. Have to dismount the motors to get the brushes in and out, and there's three of 'em. He said to throw in the spare motor that I know you have squirreled away somewhere!\n\nI tried to mention that the \"spare motor\" was from a parts truck and also needed brushes, and was brushed off. \n\n\"Just get it running!\" \n\nSure boss. \n\nTruck went down in an aisle the next day, and it was parked until we could get downtime to fix it. \n\nSpoiler alert: &gt;!it was several weeks until we got the downtime.!&lt;",
        "created_utc": 1672891696,
        "upvote_ratio": 1.0
    },
    {
        "title": "STAY ON THE WINDOW!!!! ok….",
        "author": "Brooklynisqueerr",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/103nif9/stay_on_the_window_ok/",
        "text": "So for context I work at a tim hortons which is a Canadian coffee chain, think Starbucks but less expensive. \n\nUsually everyone is assigned a position at the beginning of their shift, but will usually help out other positions if they have time, for example the person taking orders on the drive thru, may help make coffee if they have the time.\n\nOne morning (about 6am), I am assigned to work at the window which means I take money and hand out the coffee. The person taking orders was gone doing something, and I had nobody at my window so I decided to help and take an order. My supervisor turns the corner and I shit you not SCREAMS at me “STAY ON YOUR WINDOW” I tried telling her nobody was at my window but she wasn’t having it.\n\nFrom there I shrugged and stayed at the window, I didn’t help anyone for anything. \n\nCue malicious compliance.\n\nWe got slammed, everyone was running everywhere, every order had a bunch of coffee food and doughnuts, everyone was running everywhere while I was sitting peacefully at my window. I stood there and didn’t dare move a muscle. \n\nNormally I would be helping either taking orders or making coffee, but I was specifically told not to, so I didn’t. \n\nAnother note, we get timed on how long each car stays in the drive thru, the average should be about 25 seconds, today it was 45 seconds. \n\nI just chuckled as I saw my supervisor tired and upset, not saying a word, but knowing damn well she brought this all on herself.",
        "created_utc": 1672887328,
        "upvote_ratio": 1.0
    },
    {
        "title": "68 $14.99 grill thermometers for $2 each",
        "author": "deddunc",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/103lhk2/68_1499_grill_thermometers_for_2_each/",
        "text": "Hope this qualifies. This happened at the beginning of summer 2021.\n\nWhile shopping for new grilling tools at a very very large and successful department store (the kind that turns small, thriving communities into ghost towns) I came across some digital food thermometers I have seen online for $14.99\n\nThe only problem is the price listed was $1.99. Now the small print near the barcode on the shelf correctly listed the price as $14.99.  I figured whoever is responsible for these things missed the \"4\" or some other typo. Being the responsible person I am I grabbed the attention of an associate nearby and informed him of the error.\n\nThe employee checked the tag and used his little tricorder to scan the product and it came back to, you guessed it, $1.99. I even pointed out the $14.99 price on the barcode. He said \"whatever\" and walked away.\n\n\"Whatever\" is correct. I bought all 27 thermometers for $2 each. A total of approximately $65-70 after tax. I gifted a few and sold the rest online at $8/each. I made around $200.\n\nI went back about 5 days later and the thermometers had been restocked, correctly listed as $14.99 but using a price check scanner, ringing up as $1.99. Again an associate, this time a manager, was nearby. I got her attention and repeated my actions 5 days prior (see paragraph 3). The manager did not respond. I was met with an exaggerated eye roll and abandonment in the grilling section.\n\nI grabbed ALL of the thermometers, this time 41 total for both racks. I spent around $100 and sold all online for $10/piece this time and made $410. Invested $170 and made, like, $650 due to two employees lack of engagement. \n\nI have NEVER seen those thermometers in stock at ANY location since.",
        "created_utc": 1672881825,
        "upvote_ratio": 1.0
    },
    {
        "title": "Pay me",
        "author": "_4string",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/103isgx/pay_me/",
        "text": "I became an independent contractor instead of an employee after Covid.. \nCool, love it, I can charge an appropriate rate for my services. \nI was told to email invoices in a certain process and that I was net 30.. No problem..\nI submitted invoices to the proper channels. No payment… 3 months pass and a few invoices later. I got paid for a few months in back invoices… \nNow it’s started again… no payment…\nI started charging 20% if not paid in full 30 days per our contract. \nThey are now 3 full Invoices behind. 30/60/90 \nI will keep sending late charges per month until paid… 😊 \nSunday is my last day as they are closing…. I never get response on emails.. so I assume this will drag on into the new year… 😊 \nHappy new year 👍",
        "created_utc": 1672875047,
        "upvote_ratio": 1.0
    },
    {
        "title": "Ask me to show my Chemistry work in excruciating detail? Here you go, except it's all in Roman Numerals",
        "author": "iTwango",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/103hued/ask_me_to_show_my_chemistry_work_in_excruciating/",
        "text": "Back when I was younger, (I can't remember if it was late middle school or early high school) I had a Chemistry teacher that very much got on my nerves. It was probably because the other science teachers I had were so awesome (making chlorine gas bombs in school, running gels to sequence onion DNA, all kinds of cool stuff) that taught in a way that clicked with me so starkly contrasted her teaching style. Going from teachers that understand I knew what I was doing and allowed me to work as was ideal for me, to one that wants me to do it *their way* or else it's wrong, really got on my nerves. Maybe I was being pretentious, but getting marked wrong just for not doing it the way someone wants it done when the answer was right and the steps acceptable was intolerable for me.\n\nI tend to be a bit sarcastic/have a dry sense of humour, and this teacher appreciated that - we would joke around, as would she and other students (I didn't hate her or anything, just really didn't prefer her teaching style) so I would often make stupid jokes like requesting that my final project for the semester be making some ANFO and blowing it up on camera (ANFO is what the Mythbusters used to make the most epic cement mixer explosion ever.) I actually ended up firing a cannon and doing some measurements for the final project, which was cool.\n\nBut anyways; at one point I had asked her something that she must have assumed was sarcasm due to being sandwiched in between many other chemistry comments of mine that showed I knew what I was talking about: I asked her plainly if I could do all of my work in Roman Numerals, and if she would grade it fairly if I did. She said \"if you show your work, yes.\" Assuming I was joking.\n\nI was not joking. I took up programming when I was 10 years old on mIRC making chat bots; so I threw together a simple script or found a tool to convert the numbers in my chemistry equations for homework and exams to roman numerals. I then proceeded to turn in assignments for the coming months entirely in Roman Numerals, just to be petty and make her needlessly labour as I had to. It was extra work for me, but worth it.\n\nShe stuck to her guns and graded it fairly. I may have eventually stopped when I felt she suffered enough. \n\nIt was a fun class.\n\nDunno if this fits here or in r/pettyrevenge better. Hope you enjoyed my silly story.",
        "created_utc": 1672872846,
        "upvote_ratio": 1.0
    },
    {
        "title": "Stand in line to buy a parking pass? sure",
        "author": "SoundedBetterInHead",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/103h2ge/stand_in_line_to_buy_a_parking_pass_sure/",
        "text": "I read a story here a few days ago that reminded me of this little bit of MC of mine from a few years ago. I worked contract IT for a large university in Texas. To park near the office building I had to pay $40 per month and since I was contract I couldn't get a long term pass, but had to buy one every month.\n\nThe week before it expired I would wait until it was a nice sunny day, walk across campus and wait in line to purchase the pass. It was on the opposite side of the campus, but I was only allowed to park in the one lot. I would get to work, clock in, walk across a beautiful campus on the clock (which took 35 to 40 minutes), happily wait in line for however long it took, pay for a pass, and walk back across the campus. I always looked forward to those strolls where they paid me more for my time than I paid them for parking, and I got a nice relaxing walk to boot :-)",
        "created_utc": 1672871037,
        "upvote_ratio": 1.0
    },
    {
        "title": "I asked for a raise since new employees started the same rate. I was told there's no chance of raises officially.",
        "author": "Fluffledpuppies",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/103dcq0/i_asked_for_a_raise_since_new_employees_started/",
        "text": "[removed]",
        "created_utc": 1672862464,
        "upvote_ratio": 1.0
    },
    {
        "title": "As we communicated to you when we issued the replacement, the original item(s) need to be returned to us to avoid any charges",
        "author": "Ronin058",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/103cqjn/as_we_communicated_to_you_when_we_issued_the/",
        "text": "[removed]",
        "created_utc": 1672861031,
        "upvote_ratio": 1.0
    },
    {
        "title": "Well you asked me to iron it!",
        "author": "the_tall_mallu",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/103cmcg/well_you_asked_me_to_iron_it/",
        "text": "It was my elder brother's engagement day. It was a big event with many guests. It's a big function where I'm from. All of my close family members had bought good expensive clothes to wear for the function. My dad had a silk shirt which was the most expensive of all. So, on the morning of the engagement day , as we were all busy to get stuff done, he asks me to iron his new shirt. He had bought the shirt 2 weeks prior and he had to ask me to do it on the function day that too right before we were about to leave. Usually I do iron his shirts most of the time but it was just so busy and chaotic that day and not to mention the iron we had was faulty. I told him I don't have time and the iron is faulty. He was pissed and started raising his voice. Everyone heard what was going on. \n\nSo, I was like OK, whatever, got his shirt and as I was walking towards the iron table he yells , \"its silk, make sure you put it on low heat\". \n\nSo, I plugged in the iron put the heat in low, gave it a few minutes to heat up and picked it up and right when I placed it on the front of the shirt, it burned, creating a hole almost as big as the iron box. I, annoyed, picked up the shirt and held it to his face. He was so furious and started shouting and screaming at me. But, thankfully, everyone had heard me telling him the iron was faulty. So, everyone sided with me . He had to wear an old shirt till we got to the place. Since it was still morning, most of the shops were closed. But, my brother's friends went out of their way to get him a new shirt (1/4th of the price of the original) for the function. He was furious for days.\n\nNOTE: The fault with the iron was a manufacturing defect. The min heat and max heat were swapped. We never noticed it because we usually put the heat right in the middle. But, I was scared to use it as I had previously burned two of my uniforms. He brought this on to himself since he specifically asked me to put it on low heat. The faulty machine read it as high heat.  I figured this out after a couple of days later. TBH, even I felt bad for him.",
        "created_utc": 1672860763,
        "upvote_ratio": 1.0
    },
    {
        "title": "If you hang up on me I’m putting you right back in the queue",
        "author": "E-godson",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/103c61c/if_you_hang_up_on_me_im_putting_you_right_back_in/",
        "text": "I work in sales at a call center (but from home) and make outbound calls to people all day. I work on a team of about 50 people. The people I’m calling have already requested information so it’s not (shouldn’t be) a surprise. Sometimes a person will answer the phone and as soon as I introduce myself they hang up the phone. This is probably because they don’t want to be called anymore. Normally if I leave a voicemail, the record goes right back in the queue to get called by someone else the next day. If I speak with someone, I disposition them appropriately either by closing the record or selling the product, but if someone doesn’t say anything and just hangs up-I just put them back in the queue because if they don’t have the decency to ask to be removed from the queue then I don’t have the decency to read between the lines. \n\nIt’s not much-but it gives me a tiny bit of petty satisfaction.",
        "created_utc": 1672859731,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can’t refund the balance on an exchange ? No stress",
        "author": "RepairDecent",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/103akqd/cant_refund_the_balance_on_an_exchange_no_stress/",
        "text": "Got a pair of shoes for Christmas from JD sports, £85 in value. Walk into the store after Christmas and see the same shoe marked down to £40. Mmm. I guess I’ll return them ( unworn in the box). Get to JD pick out the same pair and a new pair ( Same shoes £40 and other marked down pair £25)  remaining Balance £20.\n\nGet to till and say I’d like to exchange these (Old pair )for these two pairs of shoes. Mind you I’m being served by a teenager. ( No hate, I was there once too) that won’t be an issue sir. \n\nThe remaining £20 I’ll have to put on a gift card as it’s an exchange, I decline and state I am just visiting the country and would be no use to me.\nWell sir there’s not much else I can do. \n\nI then proceed to ask, if I leave these 2 new pairs can I get the refund back on my original payment card ? Yeah absolutely. \n\nMmm I scratch my head and say alright, leave these 2 just give me a refund. Proceeds to refund me on my original card, thanks me and wishes me well on my way, instead I remain at the till and say I’d like to purchase those two pairs of shoes please.( the ones I said I didn’t want and he placed back)  He looks at me as if the penny hasn’t quite dropped yet. And rings me up, I Pay and as he hands me the receipt I can see the penny drop, and mentions “I don’t think you can do that”. I simply took the receipt and said thank you and went on my way.",
        "created_utc": 1672856078,
        "upvote_ratio": 1.0
    },
    {
        "title": "Want me to use my light? You got it!",
        "author": "UmbralikesOwls",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/103aic7/want_me_to_use_my_light_you_got_it/",
        "text": "So I (23F) worked retail for about 4 years and just recently quit in September 2022. I have a lot of stories both good and bad from my time there, but I've been wanting to tell this story for a while.\n\nSo, in 2021, I think, my workplace got green lights at the registers, and we manually have to turn on and off every time we had a customer. I found it incredibly annoying and having them is unnecessary; espeically since no one ever looks up to see them on. So I never used the light. Instead, I would yell out or motion the customer (if they can easily see me) to come into my line. I find it easier and quicker this way. \n\nHowever, some of my managers and some coworkers who acted like the boss thought otherwise. They would often tell me I need to use my light, even though no one ever looks to see who's open. Want me to use my light? Okie dokie! I would comply, turn on my light, and then continue to yell out for the next customer.\n\nMy thought process was \"well you told me to turn on the light. You never said I couldn't stop yelling.\" I considered myself a smartass for just finding loopholes into what they wanted me to do.\n\nOne time I did get told to stop yelling out to customers; even though I wasn't the only one doing it. I was annoyed but complied thinking \"they can't get mad at me for not getting customers because they told me I wasn't allowed to yell out\". I should also note that I was at the register furthest away from the line. So yea I would literally stand there and wait until someone notices I can take them.\n\nWe also have \"next\" signs and sometimes I would get told to use my light and my sign. Ok. I did both of them and still yelled I could help the next person.\n\nUnfortunately, they never got the hint that I would still continue to yell out even if they say to use my light. When they weren't getting on me about it, I simply didn't use my light. But ThEy WeReN't SpeCiFiC eNoUgH tO sAy I cAn'T yElL.\n\nI know this isn't the most clever or genius malicious compliance, but I figured this belong here since technically I did exactly what they told me. Sooo...I don't even feel bad about it",
        "created_utc": 1672855917,
        "upvote_ratio": 0.99
    },
    {
        "title": "Revenge advice",
        "author": "daisypebbles",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/1038k7c/revenge_advice/",
        "text": "Hi, long story short I was good to a person whilst they was in trouble. I borrowed them a few hundred and they e now stopped speaking to me. I’ve had countless excuses why they can’t pay me back and the latest is they’ve told their family members a load of bullshit about me and IM MAD. \nI can’t physically force him to pay up but I need to do something, he can’t get away with this!! \nAny contributions are welcome, legal of course :)",
        "created_utc": 1672851468,
        "upvote_ratio": 1.0
    },
    {
        "title": "Wranger put a target on my back",
        "author": "ljnsvdslsmnmtf",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/1037mf8/wranger_put_a_target_on_my_back/",
        "text": "Many moons ago while still in school I landed my first ever job working in retail at Target. Like most jobs in the retail sector, any person that has manager or IC in their job title, always seems to act like they have the most important job in the world. This is my story of a run in with one such person, as she was a red head I'll call her Wranger.\n\nI'd been working at the store for a little while just doing general shelf packing etc. &amp; customer service, before I was called in for the Stock Take. For those lucky enough not to know, a stock take is just counting every single thing in an entire store within one evening after closing. \n\nIt was all hands on deck, mostly school aged kids &amp;  a few a little older to do all the work. Gotta Target those profits with cheap labour. There was approx 20-30 of us on the floor &amp; we were all given RF gun &amp; told to start in the ladies clothing section. We'd use the RF gun to scan the item barcode count how many of the same item are on the rack enter the quantity into the gun &amp; move on.\n\nIt must have been 10-15mins since we started before Wranger started yelling at everyone that a clothing rack got missed. This was an unforgivable sin in Wrangers eyes, she needed to know who missed the rack! Well as it turns out I was guilty by proximity.\n\nShe totally ripped into me about the mistake I supposedly made, meanwhile I was just dumbfounded I didn't know if it was my fault, anyway I didn't argue. Like most red heads Wranger was also quite fiery &amp; proceed to rip into me telling my how incompetent I was, she deemed me so incompetent that she took away my assigned RF gun. I was told I was not allowed to ever touch another RF gun &amp; I had to go out the back into the stores area &amp; help the person doing stock take there. I complied.\n\nMy punishment. For the rest of the night I had to hang out with this cute girl, while hardly working. We were just chatting &amp; joking around by ourselves, never saw  Wranger again that night, I was climbing around on the top of the storage shelves about 15m high, in what seemed like Aladdin's cave of big stuffed toys. You could literally dive into the stuffed toys there were so many, I was throwing them at her, so she could scan them, she was pegging them back when she was done like a pillow fight. It really was a terrible punishment.\n\nAfter all I couldn't scan them that would be too much responsibility for someone like me.",
        "created_utc": 1672849212,
        "upvote_ratio": 1.0
    },
    {
        "title": "Reverse Malicious Compliance?",
        "author": "eternalphoenix64",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/1035hwr/reverse_malicious_compliance/",
        "text": "Not quite MY story, but the others don't have reddit and I wanted to share. MIGHT not fit here, but it's still a great story.\n\nThis is the story of how my wife (W), sister-in-law (SIL), and their sorta-but-not-really-or-at-least-not-in-the-legal-sense-adopted brother (AB) were picking up pine cones as a chore when they were kids.\n\nOne day, their dad (FIL) asks them to go pick up pine cones before dinner. The three kids went out with FIL, and each was assigned a tree. AB and W get to it. SIL does too. Kinda. After a few moments, FIL hears her crying and comes out to see what all the fuss is.\n\nSIL: \"It HURTS! They're to HEAVY!\" (in very dramatic fashion throwing a fit like a toddler at some 10 or 12 years old)  \nFIL thinks about this a moment... lights up with an idea (here comes the MC)  \nFIL: Picks up a pine needle and offers it to SIL. \"Here!\" SIL take it.  \nFIL: \"Does that hurt?\"  \nSIL: (teary-eyed sniff) \"No...\"  \nFIL: \"Is it too heavy?\"  \nSIL: (another sniffle) \"No...\"  \nFIL: \"GREAT!!! Then you can pick up all the pine needles instead!\" And he walked back in\n\nProbably would have taught her a great lesson too, but mother-in-law (MIL) got tired of the temper-tantrum a few moments later and brought SIL in to have dinner (this was, sadly, a pretty common thing where MIL would undermine FIL - as a result they eventually divorced, SIL went to live with MIL and SIL is barely capable of adulting)",
        "created_utc": 1672843961,
        "upvote_ratio": 1.0
    },
    {
        "title": "Want to know every move I make? Fine",
        "author": "Scapegoat306",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/1034vrq/want_to_know_every_move_i_make_fine/",
        "text": "[removed]",
        "created_utc": 1672842258,
        "upvote_ratio": 1.0
    },
    {
        "title": "Want to know my every move? Fine by me.",
        "author": "Scapegoat306",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/1034obl/want_to_know_my_every_move_fine_by_me/",
        "text": "[removed]",
        "created_utc": 1672841697,
        "upvote_ratio": 1.0
    },
    {
        "title": "Be rude, won't listen to me well I've got ya",
        "author": "DustPuzzleheaded4555",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/102xa5f/be_rude_wont_listen_to_me_well_ive_got_ya/",
        "text": "So yesterday, had a customer who went through the drive-thru, ordered his sides first and when I tried to find out what kind of chicken he wanted screamed at me and told me I was subservient to him I was lesser than him and I would learn how to listen to him because he was Superior to me and was a customer and therefore was always right. So me being a tad petty let him place his order the way he wanted to. And then asked him and was the original or extra crispy?? And your drink? And your sides? What else are you sir?? Okay this is your total. Got to the window collected the money handed him his order. Gave him my sweetest smile until my hope he had a year as sweet and lovely as he was.",
        "created_utc": 1672817457,
        "upvote_ratio": 1.0
    },
    {
        "title": "The forbidden icecream always tastes the sweetest",
        "author": "Tye-Evans",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/102uzml/the_forbidden_icecream_always_tastes_the_sweetest/",
        "text": "As i type this i am enjoying cheaply bought icecream that should have been very over priced.\n\nIn my town there are two icecream places that are are from the same company, I have a few friends there and I have heard that they aren't treated well by their bosses, supposedly they don't get paid super and are paid cash in hand, which is shady to say the least, and when you go there, their icecream is very expensive, for the price of one scoop you could buy an entire tub of ice cream at another store, however buying more makes it cheaper, encouraging you to buy more ice cream than you want to be price effective, the price per scoop nearly halves in price if you get enough so me and my friend went to their store and ordered a few scoops of ice cream into one cup, then when we got it we transferred it into another cup, allowing us to get ice cream for over 25% off what it should have been. We didn't order much but it would be possible to get icecream for  nearly half price doing this",
        "created_utc": 1672809881,
        "upvote_ratio": 1.0
    },
    {
        "title": "Do NOT remove the penalties!",
        "author": "16Geek",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/102sxan/do_not_remove_the_penalties/",
        "text": "I am currently a QC Analyst at a logistics company (apart from being a business analyst, I hold two roles. More on this later.)\n\nWe penalise our couriers, dispatching office clerks/staffs, our franchisees (who assist with last mile deliveries) who does not follow the company's delivery processes. \n\nInternally we do have a lot of processes to ensure handover of the goods are either on-time and/or is recorded so nothing goes missing - or at least we know who last worked on the said parcel. \n\nI am tasked to oversee the franchisees. Notably, our penalty system is perfect yet as it was just rolled out within the last 60 days, lots of optimisation is required still. The penalty system for the franchisees is separated from the internal workers', so our rules, guidelines are different. While I am a business analyst for the franchisee program, I am not person who worked on the penalty system - the person who worked on it had a lot of things missed out when they worked on the logic. I don't blame them as they were pressured to roll it out ASAP.\n\nMoving on. What was missed out was that we (internally) operate 365 days a year while our franchisees have the option to have 1 day off per week. The current penalty's arrangement is that given the outlet did not perform a delivery attempt on D1 D2 D3 (so on and so forth, but except D0), they would be penalised. $1 per parcel, per day. \n\nSo now you get the gist - even on their day off, they would be penalised as the system has no way to pair the logic where if day off = do not penalise. \n\nNo biggie, we already had something planned out - which is by deleting these penalties. My colleague and I (only two of us hold both Biz and QC Analyst role concurrently) have been removing these penalties.\n\nOne fine day mid December, a data analyst from higher up who pulled the data and saw that we've been removing the penalties. He walked over and screwed us, saying that we've already gotten penalty system up and running, system has generated the penalties, why are we removing it? And as per his words, \"You place a penalty, then you take it away. What for you have penalties then?\"\n\nWe reasoned with the abovementioned conditions, he didn't accept any of it. Pissed, he walked off and demanded another department to revoke our access to the penalty system. (we still do but we acted as if we don't and we're not deleting ANY penalties, and as per his words, why should we remove any?)\n\nWe allowed the penalties to run without deleting any part of it and sure enough by the end of the month, the penalties were finalised automatically, charged to the franchisees' accounts. Hell ensued, every franchisee came demanding and we just sat aside munching on popcorn, for every inquiry from the franchisee asking about it, we would forward the inquiry to our other colleague who deals with contractual matters. \n\nTo date, many of these complaints are still unresolved and they're now quitting the partnership. \n\nTL;DR: We have penalty system that is imperfect, a data analyst did not allow us to remove the penalties, even when it's an unfair one. The franchisees were penalised at the end of the month as we were not allowed to waive the fees and they are now quitting.\n\np/s: I'm just waiting for them to get a lawyer to sue the company for breach of agreement, as stated in the agreement, franchisees have n months of \"no penalty period\".",
        "created_utc": 1672803743,
        "upvote_ratio": 1.0
    },
    {
        "title": "Landlord told me \"I'll make things ugly for you!\" so I made them for him.",
        "author": "Ann1362",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/102hrgo/landlord_told_me_ill_make_things_ugly_for_you_so/",
        "text": "Landlord didn't reply to emergency repair and left us without heat during the winter storm. I had someone come and do a repair and deducted it from the rent. The repair was a little over $200. He blew up and had a fit said \"if you wanna go down this route I'll make things real ugly for you\". Said he was out of the country and couldn't get the text repair request but he did get the text about the rent. We have rented two years and have been great tenants. We redid the kitchen for him, clean the gutters and loved this house like ours. Today I went into the city building/code enforcement and asked about the house to try to get out of the lease. Turns out he doesn't have the permit/inspection to rent. He also added structures to the house without a permit and was not even allowed to rent in the zone we were in. He has multiple families living in this one single family house. The funny thing is he was trying to get us to buy this house a couple of weeks ago. Code enforcement showed up an hour later, I gave them the keys to the house and told him to \"have fun\". I'm moving at the end of this month, too bad I won't get to see the finale.",
        "created_utc": 1672776036,
        "upvote_ratio": 1.0
    },
    {
        "title": "Take my laptop home? Sure...",
        "author": "Flying_Rhino1",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/102bam2/take_my_laptop_home_sure/",
        "text": "Working in a small company in the Netherlands as a warehouse manager for over 3,5 years. I'm leading a team of 5 people doing the physical work, and I basically take care of all administrative work regarding import and export. \n\nDuring Covid, some people were forced to leave, and I their jobs were divided over other staff. Some left without leaving important information regarding their work, which left us with a lot of extra work. Because of that, our boss made it so that everyone needed to assign someone as their deputy. This way, there would always be someone to do the work needed.\n\nI had a guy from our warehouse, I'll name him Steve, who I taught how to arrange transport, receive stock etc. Steve would do that when I was free. In the beginning, I had not yet taught Steve everything, and he would not respond to incoming e-mails on my computer. During this time all our old computers were replaced by new laptops, so everybody could work from home if necessary. \n\nOne day, I had taken a day off, and an e-mail came in from sales who were working at home, with an urgent order to be taken care of. A piece of equipment needed in a machine of a customer had to be sent the same day to be delivered the next.  Machine stopped working, costing the customer a lot of money. Transport had to go through customs, and that was something Steve had not learned yet and didn't respond. The next day, my boss was angry at me that I didn't respond. When I told him that it was my day off and Steve didn't understand everything yet, he replied that I had to take the laptop home when I took a day off \"in case of emergencies\". That's what the laptops are for. I told him that Steve could not do his job without it. He said that it's my job and not Steve's. Ok then....\n\nForward a few weeks, and I take another day off. As told, I took the laptop home. I told Steve that I would do that and to tell everybody who wanted something that he wasn't able to help and to send a mail to me. On this laptop are logins for websites to arrange transport, templates, sop's, etc. I planned to go to the beach with friends and left the laptop in the car. My phone was exploding with calls in the morning because Steve did not have a computer, other people didn't know where to find information needed to arrange transportation and more. I never responded to the calls because a day off is a day off. \n\nWhen I got back the next day, my boss was furious. When I told him that I did exactly what he told me to do, he immediately told me to leave the laptop at work the next time and to share important information with others in case something happens with it.",
        "created_utc": 1672760661,
        "upvote_ratio": 1.0
    },
    {
        "title": "My dad called me donkey, so I became one.",
        "author": "BinShitlala",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/10276zn/my_dad_called_me_donkey_so_i_became_one/",
        "text": "[removed]",
        "created_utc": 1672749690,
        "upvote_ratio": 1.0
    },
    {
        "title": "Guide to MVP Development For Startups",
        "author": "ARFASOFTECH",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/1026obp/guide_to_mvp_development_for_startups/",
        "text": "[removed]",
        "created_utc": 1672748235,
        "upvote_ratio": 1.0
    },
    {
        "title": "Nahhh. Act your wage.",
        "author": "Revolutionary-Lie458",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/101y94c/nahhh_act_your_wage/",
        "text": "[removed]",
        "created_utc": 1672720607,
        "upvote_ratio": 1.0
    },
    {
        "title": "Do you want me to stop talking? OK",
        "author": "Neat-Belt-6291",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/101w9eq/do_you_want_me_to_stop_talking_ok/",
        "text": "This happened some time ago. I was talking to a guy (the guy was far away and I only talked to him over the internet despite having met him in person before), everything was going well, however in the middle of nowhere he asked me to stop talking with him (I asked him twice if he really wanted this to confirm). I didn't understand why he asked me to but I stopped talking to him.\nI am a curious person and I want to understand people's minds and so I had already seen before meeting the guy that there is a psychological trick which consists of trying to make the person more attracted to a person, if that person talks to the person and suddenly stop talking and then go back to talking to the person, that is, creating the feeling of missing the person. Knowing this I didn't block him and waited until he spoke to me again. 6 months went by and he (as I deduced) started talking again, he tried to talk several times I ignored it to a certain extent that I was already fed up with him trying to talk so I just said to him:\" you asked me to stop talking and that's the what am I going to do\" he then blocked me.",
        "created_utc": 1672714930,
        "upvote_ratio": 1.0
    },
    {
        "title": "Healthcare executive hates her own policy.",
        "author": "TheGynechiatrist",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/101nh79/healthcare_executive_hates_her_own_policy/",
        "text": "This happened years ago. I am an OB/GYN in a busy suburb of San Francisco. One of my patients was the vice president of a large health insurance corporation. She was a dynamic executive who climbed the corporate ladder quickly. One of her special talents was reducing healthcare benefits for patients. She initiated a policy where women who underwent cesarean section would to be discharged in two days rather than the standard four day hospital stay. Shortly after having in vitro fertilization she found herself pregnant with twins. During one of her office visits I mentioned the new two-day policy. I told her that for some patients it was really rough to be discharged after major surgery in two days and be expected to care for a newborn infant. She just smiled and said that she didn't get where she was in corporate America by giving away money. And patients just needed to suck it up. Health insurance wasn't meant to be a convenience.\n\nShe was 42 years old and went to full-term with her twins. Despite her age she elected to attempt a vaginal delivery because of the quick recovery. Her labor was long and extremely difficult and ended with cesarean section. On day two I went to her room to complete her discharge from the hospital. She said, \"I'm NOT leaving! This is inhuman! You can't expect me to go home and take care of twins like this! I can barely walk! All you need to do is write a note in the chart that says I'm having a complication. My stay will be authorized.\" I told her that would be fraud. And I wouldn't be willing to falsify a medical record. Anyway, about a year later the state of California forced them to reverse the policy.",
        "created_utc": 1672693071,
        "upvote_ratio": 1.0
    },
    {
        "title": "All I can afford to give you for our anniversary is a kiss.",
        "author": "Swiggy1957",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/101mfn3/all_i_can_afford_to_give_you_for_our_anniversary/",
        "text": "I have to preface this with a little background. My ex was born on Christmas day, so she was a little put out by the one gift for both occasions. Then, we hot married the day before Christmas. Very rare we ever got an anniversary gift. I swore to her that I would never do the all-in-one type gifting. \n\nMy malicious compliance concerns my making that promise to give my ex a separate gift for each occassion.\n\nThings were tight too many years,  but the worst was when I had to scrounge up $10 for her gifts. I did something like @OP. I spotted some small, hurricane candles at the drug store: $1 each. She was into those. One for her birthday and one for Christmas. Wrapped separately and given at different times of the day. Christmas morning, she opened the small box and loved it. Her comment was \"two bad you couldn't have gotten a second one to make it a set.\" Later, she opened the big box, and her set was complete. \n\nI also found her an inexpensive birthday card that was perfect. A picture of Goofy on the front that said, \"I saved money on your birthday card because it had a slight defect.\" Well, money was tight that year, so appropriate.  Open the card, and printed upside down, it said, \"Merry Christmas.\" \n\nOur anniversary? I put her gifts under the tree as soon as I Wrapped them, then looked at her and said all I'd be able to get her for our anniversary was a kiss. Christmas eve rolls around, I hand her a Wrapped box. Surprised her, and she said \"I thought you could only afford to give me a kiss for our anniversary.\" I gave her a peck on the cheek and said \"Open it.\" She opened it, and she was like a school girl. Her gift was a giant, Hershey Kiss. That started a tradition that lasted clear up til we got divorced: every year, she got a Hershey Kisses on our anniversary along with whatever other gift I got her.",
        "created_utc": 1672690625,
        "upvote_ratio": 1.0
    },
    {
        "title": "My Nana kept reminding me of my table manners in the form of asking \" What would Grammie say?\" so I told her",
        "author": "Icy_Project8674",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/101lo58/my_nana_kept_reminding_me_of_my_table_manners_in/",
        "text": "My Nana randomly started picking on my table manners. She would ask me \" what would Grammie say?\" They are pretty close even though my mom and dad aren't together. It was unexpected, she just started nit picking at my table manners, and at home. ( btw I'm not like, a mess it was perhaps one thing per dinner. Like if I didn't know I had sauce on my face) I wouldn't mind that much but she would also say \" That's not every lady like\". Which I hate. I told her it made me uncomfortable, I'm non-binary. Also, it's not the only thing about being a lady. Once we were signing up for a high school, and she clicked the non-binary option, and then clicked female because she was worried what a high school would think. Anyway, we were eating pasta at home and I had some sauce on my face, kinda just ignored it, but she said \" What would Grammie say?\" So I immediately went into my \" perfect manners mode\" I did exactly what my Grammie and Gramps tought me. And of course, if she messed up, even a tiny bit, I would correct her and say \"What would Grammie say.\" I would even critique how she CUT HER FOOD! That was the end of that. I told my mother the next day, and she is proud.",
        "created_utc": 1672688819,
        "upvote_ratio": 1.0
    },
    {
        "title": "Tell me to read the price on the shelf? Okay, you lost 1200% of your profit.",
        "author": "TrevorMitchWyatt",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/101lgwl/tell_me_to_read_the_price_on_the_shelf_okay_you/",
        "text": "Okay, so the monetary amount isn’t as crazy as some posts here, but I spent $0.49 cents on something that was supposed to cost me $6-7 at the grocery store. A little backstory:\n\nI was shopping and came across some beautiful (and massive) daikon radish. I just got a cookbook with a recipe that I could use a lot of them for, so I go weigh one and find it weighs almost 3 and a half pounds. (1.6 kilos for my non-American friends.) However, the shelf they are on has them listed as “artichokes,” which are $0.49 each.\n\nThere’s no price listed for the radishes, so I walk over to a manager and say “hi there! I was wondering if you knew how much these radishes were?” He turns to me, says “look at the price on the shelf,” and as I try to explain there isn’t one he says “just follow the price on the shelf, is that so hard?” So I did.\n\nWent to the self-checkout, put in one artichoke, got the rest of my groceries and went on my way, a few bucks richer. Looked up the price on their website when I got home and it was $2 a pound. Solid deal if you ask me.",
        "created_utc": 1672688350,
        "upvote_ratio": 1.0
    },
    {
        "title": "I don’t want the car",
        "author": "hankiepanki",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/101i7lp/i_dont_want_the_car/",
        "text": "I’m not a malicious person, though I do feel some joy reading this sub. First off, my dad was a great man, he was just dumb sometimes. Lol\n\nSome background: I am one of the youngest from a very large family. My mom passed away when I was 10. My dad, bless his heart, was from the generation where the man worked and the woman took care of everything at home. When my mom passed away, the responsibility of “everything at home” fell to the kids. By the time I was 11, I was regularly cooking dinner for 8-10 people. I had a long list of chores. Truly, it was fine. I’m sure I pitied myself some because my friends didn’t have these responsibilities, but I really had a great childhood, minus the dead mom thing. \n\nWhen I was 16, my dad got me a car. I paid for gas with babysitting money, my dad paid for insurance and maintenance. I had to get my little sister and myself to and from school. I had to do the grocery shopping. I had to get the two of us to practices and meets. I had to run chores. I was responsible for driving her wherever she needed to go. My day consisted of getting to school, getting home, grocery store, making dinner if it was my turn, homework, practice, bed. Meets were on weekends. I NEVER went out. I was never in trouble. I was an honors student. I’m not trying to toot my own horn, but I was a good kid. All was well, relatively. \n\nAND THEN: my dad got a new girlfriend. Her kids were in high school with me. She told him that if I got to have a car, I should be fully responsible for it. After all, HER kids were. So my dad sat me down and said “I’ve decided that if you want a car, you have to pay for it. I expect you to take over payments, maintenance ,and insurance.” I told him I couldn’t afford that. He told me I’d have to get a job. I said I had no time for a job. He told me I’d have to figure it out. \n\nSo: cue malicious compliance, I guess. I went and got my keys and handed them to him. I told him I didn’t want the car anymore. He was a little shocked, but I guess he thought I’d come crawling back for it soon. Lol\n\nThe next morning, my sister and I “missed the bus”. I had to wake him up so he could drive us to school. He was PISSED. We got a ride home from school. At 5:30, when dinner was supposed to be on the table, I was reading on the couch. He came home, “where is dinner?”. I said “oh, I didn’t have a car to get to the store. I’m sure there are some leftovers you can heat up”. He told me I’d have to start walking to the store. I told him I didn’t have time! Finals were coming up! Didn’t he care about my grades? An hour later, I told him it was time for practice. My sister and I needed a ride to and from practice. He told me to call a friend. “Sorry, I can’t. No one on the team lives in this town. It would be really out of the way for anyone else.” He drove us. Then he picked us up, silently fuming the whole way. \n\nThe next morning, oops! We missed the bus again! I had to wake him up AGAIN, plus he had no orange juice in the morning, on account of no one going to the store. Once again, no dinner on the table. He had to drive me to the store when he got home. Once again, we needed a ride to practice. I informed him that the meet that weekend was an hour away and we had to be there at 9. \n\nThat was enough for him. It was probably the most parenting he’d done in 30 years of being a father. He called me to the top of the stairs. He tossed my car keys up to me. “I’ve decided you can have your car back. I’ll pay for half of the payment and half of the insurance. You can only use it for school, practice, meets,chores, and driving your sister.” I laughed, tossed the keys back and said “that’s all I use it for, anyway. I don’t want the car. Sell it”\n\nFive minutes later, he’s SCREAMING my name from the bottom of the stairs. He overhand whips the keys up the stairs. Y’all, my dad never got mad. His new deal was he’d pay for everything but gas, but I wasn’t allowed any personal use of the car. I said “so, I have to pay to do chores and I get no benefit from it? No, thank you” and I tossed the keys back down the stairs.\n\nHalf an hour later, he demands my presence in the living room. He calmly said he would pay for everything but gas, I’d have the use of the car when I wanted but….I had to do all the stuff I’d previously been doing without complaint until his girlfriend got into his head. He didn’t phrase it like that, of course. Then he said “I hope you learned a lesson here”. I did. Lol, I certainly did.",
        "created_utc": 1672680582,
        "upvote_ratio": 1.0
    },
    {
        "title": "Started a gas station in the driveway because, it’s the law.",
        "author": "ElectronicMoon1676",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/101i2hr/started_a_gas_station_in_the_driveway_because_its/",
        "text": "[removed]",
        "created_utc": 1672680240,
        "upvote_ratio": 1.0
    },
    {
        "title": "The roof, the roof is - WHAT?!",
        "author": "Redneckgenius",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/101fp8y/the_roof_the_roof_is_what/",
        "text": "[removed]",
        "created_utc": 1672674367,
        "upvote_ratio": 1.0
    },
    {
        "title": "Christmas &amp; Birthday Gift Compliance",
        "author": "Imaginary-Card-1694",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/101dtln/christmas_birthday_gift_compliance/",
        "text": "My sister’s birthday is the week before Christmas. Like everyone with a birthday at that time of year she hated when people gave her “combined” birthday/Christmas gifts. As she got older, she acknowledged that they were often more expensive items but as a child it was difficult for her to understand why she got only one present while everyone else got 2. Consequently, within our immediate family we were (and still are) lunder strict instruction to buy 2 presents each year - 1 birthday, 1 Christmas. The exception was if there was something specific she desired that was expensive, then she would ask for a combined gift. \n\nOne year she asked me for a pair of shoes she wanted. I said they would have to be combined birthday/Christmas as they were pricy but she was fine with that. \n\nCue the malicious compliance… I wrapped one shoe and gave it to her for her birthday, and wrapped the other and gave it to her for Christmas. I thought it was hilarious… she not so much.",
        "created_utc": 1672669528,
        "upvote_ratio": 1.0
    },
    {
        "title": "Not a team player? Okay.",
        "author": "Hayden2013",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/101czhj/not_a_team_player_okay/",
        "text": "Some required background:\n\nI worked for a university police department. The university requires employees to purchase a parking pass decal to park on campus. The police department is set a little bit off of the main campus and we got away for years without needing to buy parking passes. One year, our police administration decided that we would no longer be exempt and had the parking services office put up a decal required sign for our lot. They told us that we must have decals to park there or we would be ticketed.\n\nAnother officer and myself decided to start parking on the public street next to the department, which allowed us to avoid buying parking passes. This did not sit well with the department, and we both ended up in the Chief's office for a meeting. The Chief told us that 'I'm not telling you you won't be eligible for promotion, but when we're looking for people to promote to Sergeant, we need team players.' He made it clear that he did not like that we were not purchasing parking passes even though we were complying with the policy and not parking on campus without a pass.\n\nThe malicious compliance:\n\nWe had a Sergeant who loved to go out of his way to find things that others were doing wrong. He would nitpick the smallest things trying to get one over on people. I love reading and would read policies and stuff in my free time, so I was well versed in how to use them to my advantage. I came up with a plan to get one over on the department using Sgt. Nitpick.\n\nOn a week I knew Sgt. Nitpick would see, I went to the parking office and purchased a temporary parking pass. The normal decals would be placed on the rear window while the temporary pass is a hangtag that goes on the rear view mirror. The campus parking policy stated that if you did not have a decal as an employee, you could purchase a temporary pass once per year for up to two weeks at 4 dollars per day. I purchased the temporary pass for one week (M-F), which was the best $20 I've spent.\n\nI worked night shift and Sgt. Nitpick worked day shift at the time. On Monday night, I parked in the lot with my new temporary decal knowing that Sgt. Nitpick would see my car in the lot on Tuesday morning. When I came into work Tuesday night, I expected to get called into my Sergeant's office and spoken to.\n\nIt didn't happen! By the end of my shift on Tuesday, I began to wonder if my plan had failed...\n\nOn Wednesday, though, it happened! I get called into my Sergeant's office and he has an email from the Captain. The Captain stated that someone had noticed that I was parking in the lot without a decal and I needed to get a decal if I was going to park in the lot. He also intimated that they noticed the hangtag and suggested that I had somehow gotten it nefariously.\n\nI had the biggest grin on my face and my Sergeant looked very confused. I explained the parking policy, that I had paid $20 for the temporary pass, that it was good through Friday, and I would stop parking in the lot after it expired. He started laughing and said he would take care of it.\n\nThe next morning when I saw Sgt. Nitpick, I said good morning as I usually do. He would not speak to me. He did not end up speaking to me for about two weeks. I'm guessing he got an earful from the Captain for the embarrassment he caused. Treat people better!",
        "created_utc": 1672667188,
        "upvote_ratio": 1.0
    },
    {
        "title": "Guy wanted me to buy him a Bag of Chips, so I did and crushed all the Chips and gave it to him.",
        "author": "TheCrowsNestTV",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/1016ug6/guy_wanted_me_to_buy_him_a_bag_of_chips_so_i_did/",
        "text": "This was about a decade or so in School. One of my friends was bugging me to buy him a small Bag of Chips, so eventually I did. I made sure to crush all the Chips while the Bag was still sealed and gave it to him. When he opened it and looked inside, he looked at me and said \"really\"?",
        "created_utc": 1672645607,
        "upvote_ratio": 1.0
    },
    {
        "title": "AITA for closing the door on a man in a wheelchair?",
        "author": "SoccerFalcon21",
        "url": "/r/AmItheAsshole/comments/100xtld/aita_for_closing_the_door_on_a_man_in_a_wheelchair/",
        "text": "",
        "created_utc": 1672643475,
        "upvote_ratio": 1.0
    },
    {
        "title": "HR said you can't give me a 10% raise? I guess i'll take a 20% raise in another department in the same company then.",
        "author": "IDoDataStuff",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/10145rq/hr_said_you_cant_give_me_a_10_raise_i_guess_ill/",
        "text": "So this happened in late 2021. I went to my manager and said that I hit the minimum years experience (the biggest thing you need for promotions in my company) and I would like to have a 10% raise so that I match my coworkers. He said he would talk to HR and get back to me. A month goes by and I ask him about the raise and he said he talked to HR and they said that 3% is the highest they can give me. I told him about how I talked to my coworkers and they are making a lot more than I am (about 15%) and that if I can't get my 10% I will apply to other teams. He said that there was no way that another team will pay me more than 3% because that is what HR told him. \n\nI immediately applied to a different team that I knew had a position available. Fast forward 2 weeks and I went through 3 interviews that went very well. I told my wife that I love being on my team and that the only way that I will leave is if I get an insane offer, like the 10% that I want. I got a call from the hiring director and they offered me 22% and a signing bonus of 5k. I immediately accepted it and told my current manager about how much I got offered. He asked me if I am willing for counter offers for me to stay and I asked him how he can counter if 3% is the highest he could give me for a raise. I could tell he was frustrated after I said that because he tried to explain that he was allowed to offer more if it was to keep someone on the team and that 3% was the max only for a static raise. \n\nAfter he said that I knew there was no way I was going to get out of my current job that I wanted to in the future so I just told him there was no way of me staying and that I would be done in 2 weeks. \n\nNever accept lower than what you know you are worth and there are always better things on the other side.",
        "created_utc": 1672636588,
        "upvote_ratio": 1.0
    },
    {
        "title": "Move the thing we're not allowed to move? Okay.",
        "author": "mmm-pistol-whip",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/100wsh9/move_the_thing_were_not_allowed_to_move_okay/",
        "text": "I used to work as a carpet cleaner and I have seen a **LOT** of crazy shit doing that job.\n\nThe way it worked is:\n\n* Enter house and pretreat open areas\n* Move furniture to clean under them\n* Move back after cleaning those areas\n* Clean everything else\n* Fuck off to the next job\n\nThere were some things we didn't move like big fancy shit, big shit, and dumb shit.  One of the things on that list is beds, more often than not we could get pretty much all the way under them and there was never anything other than dust under them.  No biggie right?  WRONG.\n\nMy coworker and I had a customer that was a bitch, but this was pretty normal for us.  Someone who had to keep an eye on us like a teacher at a middle school dance full of kids that just bought a first class ticket on the puberty train.\n\nEverything was pretty manageable until we got to her bed.\n\n\"Um, aren't you going to move the bed?\" - feel free to read that in a very controlling and bitchy tone\n\n\"Sorry, but we're not allowed to.  We can typically get under it and beds don't move easily - they need to be taken apart a bit and the legs are known to be a bit fragile when moved.  We'll do the best we can without moving it.\"\n\nShe didn't like that response.  She started to get loud, argue, and threaten to call out boss.  I honestly didn't give a shit if she did but what did bother me was her the time we were wasting arguing was only making my day longer.\n\nAfter a bit of back and forth I caved.\n\n\"Fine.  We'll move it.  But here's the deal, If anything happens or anything breaks I take absolutely no responsibility and will not be fixing or cleaning any of it up.  Okay?  I have my coworker here as a witness to this.\" I said as my coworker promptly nodded.\n\nShe agreed.\n\nI grabbed the queen size mattress to lift off the bed and promptly shattered the ceiling light above her bed causing a wonderful flurry of glass shards falling all over her bed and floor.\n\nShe was stunned silent.  She walked away and came back to silently clean up the glass shards.  after that she left us alone to finish the job and paid the bill quickly without questions or comments.",
        "created_utc": 1672615562,
        "upvote_ratio": 1.0
    },
    {
        "title": "Yes, you can set the air-conditioning to your desired coolness",
        "author": "Dvnhge",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/100tnks/yes_you_can_set_the_airconditioning_to_your/",
        "text": "This is not my story, but my father's. I have his permission to post.\n\nSo, some years ago, my father was a building inspector in the government. \nHe had a set area of buildings he had to maintain. Meaning he would go to the buildings owned by the government and do regular inspections on the cooling/heating, generators etc. \nHe would also be in charge of maintenance schedules, getting contractors for repairs and new installations and so on.\n\nSo the one particular site is and office building, with a large open plan layout sharing large airconditioning units to cool the area. \nObviously if a large group of people share an office space, the temps are set to a general temp to accommodate the majority of the people. With the understanding, if it is too cold, bring a sweater.\n\nThen he started getting complaints the AC's are set too cold. He would go, check the temp, check the unit and all seems to be working correctly set to 20degrees Celcius. \nAfter numerous complaints, my father went to the people in the office and asked who had what problem. Suddenly most of the people complained that the temp was not ideal for them. The one wants it colder, the other wants it hotter. My dad asked them how do they expect him to control the temp around their individual desks if they share a large AC unit.\n\nThey pretty much shrugged and kept complaining. Having had enough of stupid people, my father got a contractor to install individual temp switches on every desk, with a cable running into the floor, and explained that all of them could now change the temp to their desired setting. \nBut then power cable for each of these switces, just stopped when they entered the floor below, they were not connected to anything. Little dummy switches. \nHe left a note in the building file for the next inspector what the little wires were coming out of the roof below the office.\n\nHe said he regularly followed up with the people in that office if they are happy, and he said he never got complaints after that, they were very happy with his service and that they could contro their own temp.  Hahaha",
        "created_utc": 1672607707,
        "upvote_ratio": 1.0
    },
    {
        "title": "You want a raise or you will quit? Here is a note pad for you resignation letter....",
        "author": "InfiniteRespect4757",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/100sxw9/you_want_a_raise_or_you_will_quit_here_is_a_note/",
        "text": "Everyone always posts about sticking it to their boss, so here one that went the other way.\n\nAbout 30 years ago I was a much younger manger and I had a really good (young) employee that joined us 3 or 4 month earlier. This was great place to work, 4 weeks vacation, full benefits, employer funded pension and we paid a bit more than our competitors. It was also back in the days when there was more people that wanted a job than there were jobs.\n\nAt an rate this lady asked to meet with me. When we meet she pretty much leads \"I want a raise and if you don't give me one - I will quit!\"\n\nI don't like being threatened like that so my reply was \"Here is a note pad, please write me your letter of resignation as you are not getting a raise.\"\n\nHer jaw dropped and she told me \"I don't want to quit, I really like this job.\" There may have been a tear or two.\n\nI said something to her like, \"I can see this meeting did not go the way you had planned, so let's go back to work.\"\n\nI was a little pissed off by the whole exchange, but also was not going to hold her little mis-judgement against her. I liked her and we had a good working relationship, so the exchange was weird in the context of the relationship we had.\n\nThe story has a nice ending, she came to see me the next day and said she was embarrassed about the whole thing. Her boyfriend had told it was a good approach to get a raise and she naively listened to him. I explained to her how raises worked with us and she was likely to get one at her 6 month appraisal. She did. She worked with me for a long time and was my right hand person for years. We had a good laugh a few times about her marching into my office with her demand.",
        "created_utc": 1672605890,
        "upvote_ratio": 1.0
    },
    {
        "title": "As we communicated to you when we issued the replacement, the original item(s) need to be returned to us to avoid any charges.",
        "author": "Ronin058",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/100s5pl/as_we_communicated_to_you_when_we_issued_the/",
        "text": "[removed]",
        "created_utc": 1672603837,
        "upvote_ratio": 1.0
    },
    {
        "title": "From 1 January 2023, you have a right to 3 days’ sick pay a year in Ireland. This is called statutory sick pay (that means the legal minimum). Sick pay is paid by your employer at 70% of your normal pay up to a maximum of €110 a day.",
        "author": "Notalabel_4566",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/100o1kn/from_1_january_2023_you_have_a_right_to_3_days/",
        "text": " \n\nIt is called as Statutory Sick Pay scheme (SSP).\n\nHere is the link to whole article.\n\n[https://www.citizensinformation.ie/en/employment/employment\\_rights\\_and\\_conditions/leave\\_and\\_holidays/sick\\_leave.html#:\\~:text=From%201%20January%202023%2C%20you,of%20%E2%82%AC110%20a%20day](https://www.citizensinformation.ie/en/employment/employment_rights_and_conditions/leave_and_holidays/sick_leave.html#:~:text=From%201%20January%202023%2C%20you,of%20%E2%82%AC110%20a%20day).",
        "created_utc": 1672593058,
        "upvote_ratio": 1.0
    },
    {
        "title": "\"This sh!+'s gonna CEASE!\"",
        "author": "roboturkeyismyname",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/100miyk/this_shs_gonna_cease/",
        "text": "This happened about 4 years ago and I've been itching to share it here recently.\n\nI used to work for \"big brown\" as a delivery driver. At the time  I was still a cover driver which is essentially a full time driver without a permanent route. Every day you'd go in not knowing what part of the city you'd be delivering to. It sucked. \n\nI had started to get dispatched to a pretty nice area regularly, since the regular driver was out for a few months, and felt like I was hitting my groove. I could tell, with pretty decent accuracy, how long my day would be just by looking at the \"stop count\". And the route was just outside of the city in what we all considered the countryside, so it was beautiful too. I was really starting to enjoy it.\n\nThen in comes Sizzleburger (not his actual name but it sounds so similar that we called him that). Sizzle was a cover driver like me, but he had about a year of seniority on me. That meant that he was allowed to choose which route he wanted to take based on who ranked lower than him(the rules about this were always weird, like when I would tried to do it, management would push back and say I wasn't allowed even though it's in our contract). Sizzle was also very full of himself. He looked like a wannabe mob boss from The Sopranos, and whenever he was mad about his route he'd file a grievance and come out and say \"This sh!+'s gonna cease\". We did not get along since he was, ya know, a complete dick to everyone.\n\nThe day finally comes when Sizzle decides he doesn't like that I'm running the \"cushy\" route and he's tired of the one right next to it, which was really not that bad. I had looked at the dispatch list and did my little time calculation, so I knew that I could finish his route faster than I could the \"cushy\" route. So I patiently complied and went to work.\n\nIt's getting towards the end of the day. I had maybe 5 stops left when I get a call from my supervisor.\n\nSup. \"Hey robotturkey, you're really not gonna like this, but I need you to go take 30 stops off of Sizzleburger because he has 70 stops left\"\n\nMe \"You've gotta be kidding me, you know he bumped me from that route this morning?\n\nSup. \"I know, I know. He's been on our last nerve with the grievances so just go take the stops and I promise you won't get bumped by him again.\"\n\nI knew he must have gone out on the route and at some point realized that he picked the worse route for the day based on stop count. But to have 70 stops left at around 7 o'clock meant he had been sitting on his ass for half the day. But again, I complied and went to meet up with Sizzle.\n\nI pull up to his truck \"butt to butt\" and open the door. Immediately I'm hit with a smell like walking into a bar at 2am when all the beer is drying up on the floor. I look at him and he is obviously drunk, an alcoholic drunk like he thinks he can hide it but his eyes were so bloodshot it was just pathetic. I say nothing while he tries to play down the fact that I'm helping him on the route he bumped me from. I take my boxes and leave.\n\nIf this was another job I might not feel so passionate about this, but as a truck driver I have zero tolerance for anyone getting behind the wheel intoxicated, especially a death machine like those box trucks.\n\nAfter I left I call my buddy who was another driver,  with a lot of seniority, and ask what I should do. He says he'll call the Sup and that I should finish the stops I had. About 10 minutes later I get a call from the Sup again.\n\nSup. \"Hey we know what's going on and I just wanted to let you know Sizzleburger will no longer be working for us. We've been waiting for actual proof that he's been drinking on the job and you just gave it to us so good job and we're sending two more guys to split up the route. In his own words, this sh!+'s gonna cease!\"\n\nTLDR: Coworker steals my route and ends up getting fired for drinking on the job.",
        "created_utc": 1672588766,
        "upvote_ratio": 1.0
    },
    {
        "title": "intern escapes reputation and brain free",
        "author": "TimeGreedy5046",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/100m0j1/intern_escapes_reputation_and_brain_free/",
        "text": "\nSo this is all  many years ago now but anyway between my second and third year of University I took a \"sandwich year\" to work in industry - I joined a global bank in their Fund Accounting department for a year. \nI'm a perfectionist, a quick learner, fantastic visual memory, an adept multi-tasker, a little bit OCD and a terrier getting to the route of a problem so back office Fund Accounting was great. I loved it and quickly showed I was good so they just kept adding more to my plate which I was fine with, I hate being bored.\n\nA qualified accountant decided to leave, she was getting nine times my salary a month - they asked her to train me up to take over her accounts.\n\nShe trained me in less than a month and left. My boss and his boss hovered for about a week but it was clear I had it so they left me be. I was still being given new extra tasks and just accepted it as didn't know better.\n\nI had had it drummed into me always find the money, always balance the accounts, don't ever write off more than a couple of pounds. So I did, I loved the detective aspect, it soothed my 85% bored mind, so being given licence to phone, dig round and be nosy was great. I remember there was a line item of £1500 (three times my monthly salary) that I just couldn't find and I TRIED EVERYTHING, I raised it with my boss (P), we probably spent another three weeks looking for that money, it just was not accounted for (no pun intended!).So he told me to write it off, I remembered my training and queried it, just wrote it off, I left it a few days still hunting for the money, he is asking why I haven't finished the accounts, he got pissed with me as I hadn't finished them yet. Said again just write it off.\nI didn't, I  kept hunting because it irked me, I went to him a few days later asking about an avenue to look for the money he was surprised it was something I was stil working on and condescendingly told me to just do what I'd been told, in the scheme of things it wasn't large an amount as the fund was £200million, so a missing £1500 was nothing He damn near patted me on the head.\n\nSo I went back to my desk wrote him an email saying sorry and I was filing the accounts with the write off like he had asked and sorry for being a nuisance\nI printed off every email exchange put it in a folder and put in it my drawer. Literally the sky didn't fall in so I forgot about it and moved on, my boss and I were fine too, it literally was just carry on as normal.\n\nFast forward about six months later (and about ASIC weeks before I would be finishing) and the auditors were brought in (standard practice - one of the big three global firms at the time), I was coached through how to behave and interact with the team if they ever asked me for anything - bosses are sweating a little now as essentially a 20 yr old who hasn't even finished her degree was doing monthly accounting on multiple funds totally around £500million.\n\nI remember my solo meeting with the auditors when they asked questions about my accounts I was working on, all very nice no problems.\n\nA few days later, my boss, his boss and his boss come to my desk. I'm oblivious as the approach from behind but you can feel the office go very very silent.\n\nPolitely my boss says we are concerned about a large amount you wrote off that the auditors are querying. Note he was polite yes, but he didn't lower his voice, clearly playing for the terraces/audience, he had a sombre demeanor all very serious.I was totally clueless and said, okay well what fund is it for, as soon as he said the name I KNEW IT WAS THAT £1500, I smiled and said oh yes, I know what this is about. My bosses bosses boss decided to slap my bosses boss on the shoulder and exit saying \"I'm sure you can handle this\" gave me a pitying look and off he went. \nMy boss was still not cold and LOUD and said \n\"It's £1500 why did you write it off?\" I looked him dead in the eye and said \"Yes I remember it was £1500 and I thought it was a lot of money to write off at the time\". He then glanced at his boss, then said loudly \"So why did you write it off, you know you shouldn't write off amounts more than a few pounds, the auditors are really not happy with this, this is causing a lot of problems, yours is the only account that has been flagged\" LIAR but I'll get to that later.\nYou could hear a pin drop, no pretence at all anyone was working, everyone on the floor was watching this go down. So about 30 people on the department floor all openly watching and listening as they are both standing over me.\nSo I slowly stood up, turned, reached and opened my bottom drawer, took out the folder, and my sweaty palms put the file on my desk. I still standing said equally loudly and clearly, \"I wrote it off because YOU told me to\". He scoffed and said \"No I didn't, I would not have done that\"  I repeated \"I asked you numerous times and eventually I wrote it off because you made it clear I was annoying you keep asking about it\"\nThe whole office watched him turn really red (super blond Norwegian guy so he's firing up really good). He was about to finish his own career I think as he looked apoplectic with shock, mouth flopping trying to form his response. His boss stepped in and said to me \"You can't just make allegations like that\"\nI looked at him, by now slightly regretting my catty heated but honest reply to my boss, so said with a more meek demeanor but still equally loud.\n\"Yes, I agree, I'm sorry.\" He then said \n\"We need to take this elsewhere can you come with us\". I repeated\n\"Yes, I agree, I'm sorry, that's why I kept this folder in case anyone ever asked me as I really didn't think the money should be written off\" \nI handed my bosses boss the folder and said \"It's all the investigations I did, I hand wrote date and times for meetings with P and you can see the top dated email where I confirmed I would be writing it off like P asked and apologising for keep asking after he'd said to write it off.\"\nUtter silence\nI then sat down and said, \"You can keep the file, I've a copy in my drawer\" (I didn't, though I was aware I should have made one), I said \"I've got a deadline to phone in the fund numbers for four o'clock can I phone them through then meet with you after if you still have any queries?\". He said yes, didn't meet anyone's eyes and left taking my boss with him.\n\nI picked up the phone and starting calling the numbers through (an extra task I'd been given when I first joined)\nI swear my palm was so sweaty, my body was sweaty even my hairline was sweating and my heart thudding so bad. I finished my calls and went hiding out in the ladies room til five then went straight home. I was so angry and so sad, pissed that they both had been clearly ready to throw me under the bus and grateful I'd learnt CYA at my first job in a shop where they'd deduct wages if the till was short come closing time.\n\nNothing more was said, by anyone\nNo apology for publicly trying to maul me\nNothing\nNot a word\nI was just really really quiet at work. It shook me how throw away I was (foster system, self esteem issues I really was super bitter about how P tried to screw me over and thought he'd get away with it)\n\nI worked my remaining time quietly and P just didn't talk to me.",
        "created_utc": 1672587242,
        "upvote_ratio": 1.0
    },
    {
        "title": "Want me to be on job by 8:30? Ok.",
        "author": "GibberishAsshat",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/100kj4o/want_me_to_be_on_job_by_830_ok/",
        "text": "This takes place over the past 2 months and without going into too many details about my work, here’s my story. \n\nI work in a large metro city on a team that does maintenance on our infrastructure, keeping our plant running and keeping our customers services running. We all have a company truck that we take home every day and start our days at 7:30 every morning 5 days a week. Now I live the furthest our from our service area, 45 minutes to an hour drive without traffic &amp; there’s always traffic. That being said some days it takes me 2.5 hours to get to my first job in the mornings, my supervisor knows this and was ok with it as long as I was enroute to my first job by 7:30. \n\nThen we had a restructuring of the big bosses… They wanted us on our first job by 8:30. I emailed my supervisor about it and he assured me that I was fine and he was aware of my drive time in. A few weeks pass and he tells me the new big bosses aren’t happy about my arrival times in the mornings and that I’d need to leave earlier, I ask him to email that to me so I can remember to set my alarm earlier (I really asked for it emailed to me so I’d have documentation), he does. \n\nNow I’m kinda pissed because I don’t want to have to get up earlier and not get payed to drive into our area, so I start looking into our policies. Our policy on time recording is pretty strict and states if we are operating company equipment (my truck) we are working. So I start leaving at 6 every morning giving me ample time to get to my first job by 8:30 and starting my time as soon as I started my truck giving me an hour and a half OT every day. Now I knew something was going to be said about this and when my supervisor showed up on me asking me why I was clocking that OT every morning before my shift I handed him his email telling me to leave earlier and the attendance policy with the section highlighted. He looks up to me grinning from ear to ear and compliments me on finding a loophole in the big bosses new rule. \n\nI haven’t had another thing said to me about my OT or anything else about me not being on job by 8:30. I’m still not happy about waking up earlier but the 7.5 hours of OT a week is nice.",
        "created_utc": 1672582485,
        "upvote_ratio": 1.0
    },
    {
        "title": "If I don’t like it I can find another job? Okay.",
        "author": "Xgrunt24",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/100kfdy/if_i_dont_like_it_i_can_find_another_job_okay/",
        "text": "I think this qualifies. I worked at a small shop serving an electrical apprenticeship. Myself and the shop manager had had a few run-in’s and I assume he disliked me as much as I disliked him. \n\nI had refused to do a job and told him he didn’t pay me enough. It was at the stockyards and I was expected to put on a set of waders, crawl down into a raw fat reclamation tank, and replace a submersible pump. Wasn’t going to happen. \n\nAnother time he wanted me to lie to a customer to make an issue they were having sound like it wasn’t our fault. I refused and told him if he want to lie about it, he was going to have to drive out to the job site and do it himself. He told me to keep my mouth shut and did come out.  \n\nI think the only reason he didn’t fire me was I was by far one of the most efficient and versatile employees.  This fact had me questioning how much I was getting out of this apprenticeship and was passively looking around for another shop to apprentice at. \n\nMy wage scale was structured and I got regular raises bringing me closer to journeyman’s level over my time as an apprentice. So, I had to find someone that would sign up to complete my apprenticeship as well as want to hire me. \n\nOne of our better journeymen had gone to another shop and had introduced me to the owners. We had talked about what it would take to get me to move. Things were progressing but nothing committed to at that point. \n\nQue the malicious compliance. It’s my evaluation and raise time. My manager calls me up to the conference room and explains that due to my performance and the shop being in a slow period he was not going to give me the 25 cents an hour raise as my contract said but, was going to give me a dollar more an hour once I became a journeyman. We argued and I told him if I can’t trust you for a quarter why would I believe the dollar?\n\nThe argument ended in him telling me if you don’t like it you can always quit. Oh really?  I picked up the conference room phone on the table in front of us and called the shop I had been talking with. I asked the owner if I brought my tools over today would I have a job? After  a quick and uncomfortable discussion with his partner he said yes. \n\nI informed my manager I resigned effective now. I loaded my tools up punched out and went straight to work that afternoon.",
        "created_utc": 1672582133,
        "upvote_ratio": 1.0
    },
    {
        "title": "(LONG) Neighbor damages then reports my backyard fence bordering their property to the city and demands it get taken care of as it is now an eyesore - Sure thing, neighbor.",
        "author": "EnigmaGuy",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/100kacw/long_neighbor_damages_then_reports_my_backyard/",
        "text": "[removed]",
        "created_utc": 1672581657,
        "upvote_ratio": 1.0
    },
    {
        "title": "Funny, I thought I was incompetent?",
        "author": "CleopatraVI",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/100eyg1/funny_i_thought_i_was_incompetent/",
        "text": "Newbie in this sub, hello and happy new year! Been reading some of the stories and thought I’d share one of my own… \n\nOne of my previous jobs was a very toxic workplace because the CEO was an absolute nut job. Micromanaged everyone and always wanted perfection. My role was 2-fold and therefore required me to work very closely with him a big chunk of the time. I didn’t mind the perfection bit as I’m a perfectionist myself; very meticulous and have a keen eye on detail. It’s the micromanaging part I couldn’t stand.\n\nThis one time we had a big media event where we were launching a new partnership. Having extensive experience with local media and knowing the requirements in terms of branding placement etc., I knew what was needed for such an event. So I set up and even asked some of my media pals to confirm whether it was all visible in cameras. All was in order. Everyone was happy.  \n\nAnyway, my boss comes in a whole hour earlier than expected and decides to micromanage and take set up matters into his own hands. I had stepped aside to welcome some guests so imagine my shock when I came back to find him rearranging everything while screaming in front of everyone that we were incompetent and hadn’t done it right. “What did I hire you for if I’m going to end up doing it myself” is a common phrase he used all the time. I tried to explain the reasoning behind the placement but he wouldn’t let me get a word in. He then proceeded to tell me to leave everything as he had set it and let the other team deal with the rest of the event. \n\nI complied and removed myself from the event altogether since I was so incompetent, I went to stand at the back and didn’t help out again the remainder event as per his request. Fast forward to when the coverage came out and everyone was asking why our branding wasn’t visible. I told them all to take it up with my boss directly. See, I know from working closely with him that he doesn’t like embarrassment and will do literally ANYTHING to avoid it. So having our shareholders, other high profile stakeholders and media asking him directly about this was a very embarrassing situation for him. \n\nLet’s just say after that day he would only show up to events right at the start time. He also told me to draft a policy that everyone company-wide had to follow, including him. When I finally had enough and quit, he said that he was sad to be “losing such great talent” 🙄 funny, I thought I was incompetent?",
        "created_utc": 1672560137,
        "upvote_ratio": 1.0
    },
    {
        "title": "My new years just blow up",
        "author": "JustcanthelpKaren",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/100exvz/my_new_years_just_blow_up/",
        "text": "[removed]",
        "created_utc": 1672560073,
        "upvote_ratio": 1.0
    },
    {
        "title": "Use all my spelling words in a sentence? You got it!",
        "author": "ewhit78",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/100d30c/use_all_my_spelling_words_in_a_sentence_you_got_it/",
        "text": "Obligatory posting on mobile etc etc\n\n\nThis story takes place in 2009 when I was in 5th grade. Each week we had 8 spelling words that we would work with during the week with a spelling test every Friday. One of our weekly homework tasks was to use all of our spelling words in sentences. \n\nAs little me was sitting at the table working on my spelling sentences one week, my dad sat down and asked me what I was working on. I explained I had to use each spelling word in a sentence. My dad asked if my teacher specified how many sentences I had to write. She did not, just said we had to use each word in a sentence. \n\nThis launched a half hour brainstorming session in which my dad and I figured out a way to use each and every spelling word in one sentence. The same sentence. \n\nI turned in my one sentence homework assignment the next day. My teacher asked me why I didn’t write all my sentences. I said “well I used every spelling word, I just only needed one sentence!” My teacher looked it over and started laughing. \n\nFrom then on, our weekly homework assignment was to use each spelling word in ITS OWN sentence. I would do that, then my dad and I would figure out a way to get them all in one sentence and write it on the bottom of my paper. My teacher continued to get a kick out of it and my vocabulary is much stronger from the weekly brainstorm sessions with my dad :)",
        "created_utc": 1672552412,
        "upvote_ratio": 1.0
    },
    {
        "title": "Give me sentences for sass, I will give you sassy sentences!",
        "author": "HInesDawg",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/1009bir/give_me_sentences_for_sass_i_will_give_you_sassy/",
        "text": "So, my only daughter (almost 8) is the spitting image of my wife in virtually every way. This includes her penchant for giving us attitude constantly and attempting to order me around..\n\nEarlier this week, my wife was sick of the sass she was getting from our female child and told her to \"Go write 10 times that you will not sass Mommy!!\"\n\nMy daughter dutifully complied and wrote these for her first two sentences:\n\nI will not talk back to Queen Mommy\nI will not talk back to Ruler Mommy\n\nThe rest were nice ones as I think she ran out of sassy words. This has been saved for her memory box and I will tease my wife about it forever after this.",
        "created_utc": 1672538402,
        "upvote_ratio": 1.0
    },
    {
        "title": "The most *satisfying*, monstrosity of a package I’ve ever shipped",
        "author": "AllFactsNoOpinions",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/10097up/the_most_satisfying_monstrosity_of_a_package_ive/",
        "text": "So I just found this sub and needed to share this story about the most satisfying package I’ve ever shipped.\n\nSo, a few years ago I used to work at IKEA in Home Delivery. Regularly, we would ship missing/replacement parts to customers and arranging these shipments was the bulk of my position. We had some boxes of varying sizes to ship these parts, but if you’ve ever been to IKEA—you know how wonky some of these parts are shaped. The boxes we had covered 80% of the parts, but the remaining 20% were completely oversized and we had to Mickey-mouse boxes together to ship them. \n\nI had been asking for months to get a better variety of boxes, or at least some huge ones, since Mickey-mousing boxes was outrageous for a corporation of this size. I always got the typical corporate response and nothing changed. Fast forward to the time I’m posting about, I had to ship an outrageously shaped item of a huge size. It was like two triangles meeting at a 90 degree angle, linked tip to tip. It was an insane item to package and I decided that—if I was going to package this without proper supplies—I was going to do it *right*.\n\nI went on a mad dash Mickey-mousing a shitload of boxes together with a ton of tape. I was on my grind!  A man on a mission, and I wasn’t going to miss this opportunity to craft the perfect creation. Fast forward an hour later, I was finished. I had made the perfect box. \n\nI was so proud of it. I stuck it right on the trolley for shipping packages, told my managers we needed bigger boxes, and continued as normal. The box shipped and I had no idea what the customer thought, but the gratifying feeling of shipping the perfect monstrosity was enough. Now, having recently discovered these photos, I want to share them with people who’d appreciate them. Link below:\n\nhttps://imgur.com/a/YOiTfKk",
        "created_utc": 1672538057,
        "upvote_ratio": 1.0
    },
    {
        "title": "I got revenge on my ex just following the law",
        "author": "Most-Consequence4736",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/1007dod/i_got_revenge_on_my_ex_just_following_the_law/",
        "text": "My (ex)girlfriend and I moved into a new rental apartment but to help cover the costs, we agreed to let my best mate move in with us. She paid for all of the bond and the 2 week advance payment as I happened to buy a new car just a week before we got accepted. The total was $3260 there abouts. Her and I were on the lease, but my mate wasn’t due to the fact landlords wouldn’t accept 3 young people onto a lease, however they would accept a few months down the line after we submit a new lessee application. Everything was fine up until my mate moved in and she slowly started changing with everything she said and did. After a month into living there, she wanted to end things with me for reasons that weren’t her own and started to pack my things into a box. She had no where to go but I did so she made the decision that she was going to stay there and kick me out of our place. She then ‘decided’ with my mate that they would stay there until they could find someone else and so my mate could finally get onto the lease and build up his rental history. I knew our relationship was over and I was completely oblivious that my girlfriend was doing this on the side with my mate that I’ve known longer than her so out of the kindness and the trusting person I was, I agreed to leave, let them have the place not thinking anything of it and staying on the lease until my mate could gather his financials to be officially on the lease. I was willing to do anything to make it easy for her because I still loved her, until 2 days after she kicked me out. See she forgot to sign out of her instagram account on my phone so I was getting all the messages she was sending and receiving, to which I stumbled across her and my mates conversation on how they had sex the night before on my bed that I hadn’t yet taken from the apartment, and that’s when my attitude changed. I knew she had no where to go, my mate didn’t want to move back home so they needed this place really badly, so I put in a request to end the lease on the spot and cancel the contract. She couldn’t afford the place by herself and the law states, I need to approve anyone to be on the lease and no one can force me off the lease, though I had the upper hand with my income. Immediately their life flipped and they scrambled to figure out ways to keep the place but couldn’t. I then requested all the fees when came to be $1000 (break lease, re-advertising, bond clean, rent until a tenant was found) to come directly out of the bond my ex solely put in for. When we signed the contract, even though she put in all the money, she signed off that we put in half and half so contractually I get half of what’s left of the bond and she can’t do anything about it. I started getting threatening messages from her to pay her back or else but she was shit out of luck. So in the end, I took the place from them, all the furniture, all her money and from $3260, she was only left with $747 and with her income, no possible way of getting a new place to live in. Hadn’t I had found out, they would be living there having their best life and by that time, it would have been too late for revenge.",
        "created_utc": 1672532015,
        "upvote_ratio": 1.0
    },
    {
        "title": "I got out of multiple disciplinary write-ups by continuously citing health violations that the owner didn't want to put on record.",
        "author": "RichardsDickinsCider",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/10061ot/i_got_out_of_multiple_disciplinary_writeups_by/",
        "text": "I owned my own business, but I had to sell it because I had an opportunity to move to a new country. After moving, I had to scramble to find a job, as the moving costs had depleted a lot of my savings. I found a job as a night auditor at a hotel. For about a year, the job was great. I was left alone, with only one or two customers to check in per night. But I knew at a certain point, I'd have to get career-focused, and I really did have an \"I don't care\" attitude towards this job because I knew if I lost it, I was settled in and could earn more elsewhere, but I was never ready to give up the perks, and to be honest, it was fun not giving a \\[censored\\]. Being a night auditor, I was disconnected from the work culture there, but I could see from notes left, rules that were explained to me, and just a few whispers that it wasn't great. In addition, when I was hired, I told them the pay was a few dollars short, and they told me not to worry and they'd fix that issue. Come to the first paycheck, they didn't, and I ended up working for less pay. Because of my situation, I accepted the less pay, but all of these factors combined made me an employee with an \"I don't give a \\[censored\\] attitude.\"\n\nFor a long time, they didn't notice because I worked the night shift. I was in an open relationship, and I slept with the waitress that worked late. We had sex on the couch in the closed cafe. We had sex on the desk of the owners and managers. We had sex anywhere there were no cameras. There were many times when customers checking in had to wait for me to get my pants back on to greet them. I also slept on the job a lot. I brought my Xbox into work and would just pause the TV when customers came in.\n\nThe first time I came on the radar was after about six months, when they noticed the ice cream for customer milkshakes was disappearing really quickly. They asked all the staff about it, and I openly admitted to eating one to two milkshakes per shift. I reminded them they said I could eat as much as I wanted while on shift when I was hired and trained. The owner, who got wind of this, decided to make an example of me. He started putting in rules and extra tasks that targeted the night auditor. Dumb little extra work like record every piece of paper printed. Because it's the service industry, there is a normal amount of complaints or issues that would arise, stuff that was unavoidable, like a customer complaining about the third-party booking site they used. This would normally be overlooked, but with me, it was now recorded as evidence, and I was emailed all these little complaints. It was obvious the owner was setting me up.\n\nOne day, we got a review on our website that stated, \"I stayed at the hotel and ordered a sandwich from the night auditor at 2 a.m. The sandwich was disgusting and inedible. Do not stay here, but if you do, definitely do not order the food.\" The next day, I was called by the owner and questioned about it. I had no memory of the sandwich and just answered the questions with an \"I don't give a \\[censored\\]\" attitude and \"I don't know\" or \"I don't remember.\"\n\nI had a work disciplinary meeting scheduled. It was scheduled on my day off during a time I normally sleep.  \n\nI told the owner I reject the disciplinary meeting based on that, and if I was going to be scheduled for a disciplinary meeting, he would need to pay me for the hour or so it took. He was instantly angry and told me that in 20 years of owning a hotel, he had never paid an employee for a disciplinary meeting, and that by its nature, I should accept an unpaid meeting because I was in trouble. I told him that I wouldn't, and that I'm innocent until proven guilty, anyways, so by the nature of him being my employer, he should have good will and assume I'm innocent, by which I should be paid for the time to explain or defend myself. He was red in the face, angry, and tried to argue more. I let him know I had contacted the government's free employment agency, and I knew I was in the right. So he finally agreed, and scheduled the meeting for a time when I started work.\n\nThe meeting was just him and myself. He started off angry and accusatory. I could tell he personally disliked me. He had a whole list of small gripes he went through. One by one, I simply excused each with some reasoning or another. I simply was not taking personal responsibility for anything, and did not care if he liked it or not. In my mind, this meeting was just me at work going through the motions, so I could get back to sleeping on the job. After about 20 different accusations, he blew up. He said, \"In 20 years, I've never met an employee as arrogant as you. I can't believe your attitude. You don't take personal responsibility for anything. What type of person are you?\"\n\nAt this, I replied back, \"I've never met an employer as arrogant as you. And if you're going to insult me, I'm going to walk out of this meeting. I don't care what you think of me. You can keep your comments to yourself, or go rant to someone who cares, because I don't.\" I got up and started to walk out. He apologized and asked me to sit down. This is because laws in our country would side with me in an employment court based on his outburst, and he knew it.\n\nI sat back down, and he got to the main topic, the sandwich review. He asked me to explain myself, and how I could make such a terrible sandwich. I asked him, \"Why are you assuming it's the way I prepared the sandwich, and not your ingredients?\" He looked at me, shocked. \"What do you mean?\" He was caught off guard and completely unprepared. In my theme of not taking responsibility, I blamed his ingredients. \"Well, you have ham that's frozen and past its expiration date. I used to throw it away, but was told not to. I wouldn't eat it, and I think it's disgusting that you're selling it to paying guests. Even if it isn't expired. Because you keep the ham frozen, it's microwaved from frozen and tastes rubbery and gross.\" I waited as he sat there, depleted, and wrote down my response. The meeting abruptly ended, with nothing more from him. A few days later, I received an email stating the disciplinary had been dropped.\n\nHe didn't stop targeting me, though. I made it worse, too, by taking personal responsibility on behalf of the hotel, and pointing out issues and problems to guests, and explaining how it was the hotel's fault. \"Oh, sorry that wasn't clean when you got in the room. The hotel cleaners aren't paid well, and they are hurried from room to room, so they can't always get\n\nThe hotel cleaners aren't paid well, and they are hurried from room to room, so they can't always get everything.\" To make things worse for my employer, his second hotel needed a night auditor, so they borrowed me. I ended up being liked and was permanently employed, so I was working between both hotels and doing the same over there. This led again to another disciplinary meeting. When it was scheduled, I just confronted the accusations by asking if this was retaliation for previously bringing up the expired ham and asking if he had made any policy changes around that. He had to record my answers again and dismissed the disciplinary meetings because he didn't want to have that brought up in an employment court.\n\nEventually, I left voluntarily. But the damage I had done was immense. The amount of bad reviews that came from me were frequent. I considered what I was doing as sticking up for the other employees who didn't have an \"I don't give a \\[censored\\]\" attitude and didn't have the \"get out of jail free\" card I had. They had to put up with him and his shitty rules and policies. I didn't, and I told every employee the story, and they all celebrated my activities with laughter and giggles.",
        "created_utc": 1672527832,
        "upvote_ratio": 1.0
    },
    {
        "title": "Want to do my job for me? Please, be my guest…",
        "author": "CleopatraVI",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/zzze8q/want_to_do_my_job_for_me_please_be_my_guest/",
        "text": "[removed]",
        "created_utc": 1672508579,
        "upvote_ratio": 1.0
    },
    {
        "title": "Want me to clock in, SUUURE!",
        "author": "InsideEcstatic",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/zzyae7/want_me_to_clock_in_suuure/",
        "text": "[removed]",
        "created_utc": 1672505531,
        "upvote_ratio": 1.0
    },
    {
        "title": "You want me to punch in .... Sure!",
        "author": "InsideEcstatic",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/zzy9o6/you_want_me_to_punch_in_sure/",
        "text": "[removed]",
        "created_utc": 1672505476,
        "upvote_ratio": 1.0
    },
    {
        "title": "You want me to clean your side path? No problem.",
        "author": "dedokta",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/zzuemb/you_want_me_to_clean_your_side_path_no_problem/",
        "text": "So a few years ago I was helping to lay a new concrete driveway at my mother's house. Some of the runoff water ran into the neighbour's side pathway leaving a slight discolouration. A simple wash would have removed this, but the neighbour complained and told us we had to clean it up. Now this is fair enough, but they weren't very polite in asking us about it especially when we had no idea it had happened. Anyway, I agreed to clean the path for them.\n\nSo I got out the power washer and started at the front of the house. This path has not been cleaned in a LONG time, so the power washer was making a noticeable difference. Up the path I went doing a very thorough job of getting all the years of grime off, including the slight concrete slurry from our work. I continued up to the point where the runoff started, and then I stopped. I left a perfectly etched line that really made it obvious just how filthy the path was before I washed it. Up it went, all the way up the side of the house, plain to see. I'd cleaned up every last bit of concrete runoff and made that pathway shine, until it didn't.\n\nThey could've really complain as it wasn't my job to clean the entire path and I had cleaned up all the concrete runoff as agreed. My mother doesn't get along with them at all so she was happy with the result even though she didn't originally want me to clean it for them.",
        "created_utc": 1672494173,
        "upvote_ratio": 1.0
    },
    {
        "title": "Boss has zero social skills, makes new designer cringe and leave",
        "author": "SorryICantLie",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/zzqmso/boss_has_zero_social_skills_makes_new_designer/",
        "text": "So the story goes like this: I got a job a couple months ago as a tryout programmer for a radio SaaS company. With me a couple of other people joined, and everything seemed fine: the workgroup was competitive and passionate about the products and the development section was good enough for me to actually care. Boss sometimes gave motivational one liners like \"win, win bigly\" and \"cutting edge technology\", but personally didn't mind at all the cringe.\n\nMeet Steve, the unicorn of the programming world, both proficient in design and front-end, that joined the company in the same period as me. He's a good guy and hard worker, and we were both having fun learning the ropes.\n\nEventually some red flags came to the horizon. For example, one day the full section was late (I was 10 min late) and he put up a last minute a meeting where he lashed out at newcomers, while the old members just sit and watched.\n\n...ok, I thought this was fine as people would be coming on time, but next day one of the oldies started arriving at work around 11, which kinda pissed me off.\n\nTime for Steve to shine: I don't know all the details, but he was working directly under the boss for an important design project, which revealed as a huge pain in the ass.\n\nOne day after several months I thought they were done, as they were staring at the results of the project in a pc near my office. Curious I came along and saw it was pretty good and said: \"pressure makes diamonds, am I right?\". Boss apparently doesn't like to be outshined and started trying to make the joke his own in the most cringe way possible: \"what diamonds!?! You guys are lemons and we gotta squeeze the juice outta those lemons. If they could talk they would go 'ouch ouch stop'....\".... Let's say that after this I had to go to the bathroom to recover from the almost lethal doses of cringe.\n\nNot long after Steve quit his job and left at his office several kilos of lemons, with a note: \" If you have so much fun squeezing lemons B., here have fun\".\n\nHe left a legend.",
        "created_utc": 1672480517,
        "upvote_ratio": 1.0
    },
    {
        "title": "Just keep the cooler full *shrug*",
        "author": "linguishtick",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/zziyx1/just_keep_the_cooler_full_shrug/",
        "text": "So up until two months ago, I had been working as the beer buyer at a bar. I loved the job (through all its faults), but our upper management (it's a small chain) really stopped listening to anything any of the employees had to say after Covid happened. The main complaint that every (and I mean EVERY) location had was this new computer system we switched to. Apparently some of the investors also had some connections with this new company, so we had to switch to their system because, ya know, gotta make the rich people richer. Anyways, the system was HELL. I mean literally malfunctioned so frequently and so badly that our store alone had lost thousands of dollars because of it. \n\nAnyways, the system made my job as a buyer nearly impossible. I couldn't keep track of my cost because it was constantly inaccurate, I couldn't put in invoices because it had some stupid thing that did them automatically (but they were ALWAYS incorrect and it didn't allow me to manually fix them), and I couldn't run any reports because the numbers were always wayyy off. I complained to my boss about it very professionally, multiple times, and then a couple of times not as professionally, and finally I just said \"listen, you want me to keep my beer cost under 30% but I literally can't even see what my cost IS. I would just do the math manually but the reports are always wrong, so it would still be inaccurate. I cannot meet your expectations if I am working blind, and I really do want to do well in this job. What do you want me to do?\" And she said, word for word, \"Forget about beer cost. Just make sure the cooler is stocked.\"\n\nI had spent the past two and a half years METICULOUSLY keeping track of our cost while that store went from $27,000 a week to $45,000 a week in sales. And suddenly they just didn't care about that?! They were willing to lose an asinine amount of profit because one investor was gonna lose some business relationship or something. \n\nSo. I did exactly what she said. I didn't mind cost, I literally didn't even look at prices when ordering. I just. Kept the cooler stocked. And I never even got to see the real numbers (because I wasn't able to pull the damn reports) but I know that the actual cost went WAY up. I had vendors coming in with samples saying \"I know this probably isn't in your budget for this month but-\" and I would say \"nope, let's get it. Today, please.\" I didn't do anything that would literally put the company in jeopardy, but I know damn well when they do the math at the end of this year, they're going to see exactly when I stopped giving a fuck. \n\nA few weeks after buying some of the most incredible (and expensive) beers ever because I didn't give a shit about cost, I decided it wasn't fair to me OR the company to still be working at a job that I started to resent, so I accepted another position (which I have been loving immensely). But when I trained the person to fill my role, I taught them HOW to calculate cost in case they ever got a new system, but told them not to worry about it now because it was impossible. I said the exact words that I was told, \"just keep the cooler full.\" \n\nI still love the company overall and I hope they do well, but I also kinda want the investors to shit their pants a little bit once they run those end-of-year reports this week. ...Not that they will be accurate.",
        "created_utc": 1672453809,
        "upvote_ratio": 1.0
    },
    {
        "title": "Question",
        "author": "flmdicaljcket",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/zzexvz/question/",
        "text": "[removed]",
        "created_utc": 1672442911,
        "upvote_ratio": 1.0
    },
    {
        "title": "As we communicated to you when we issued the replacement, the original item(s) need to be returned to us to avoid any charges.",
        "author": "Ronin058",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/zzea0s/as_we_communicated_to_you_when_we_issued_the/",
        "text": "[removed]",
        "created_utc": 1672441219,
        "upvote_ratio": 1.0
    },
    {
        "title": "As we communicated to you when we issued the replacement, the original item(s) need to be returned to us to avoid any charges.",
        "author": "Ronin058",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/zze6v0/as_we_communicated_to_you_when_we_issued_the/",
        "text": "[removed]",
        "created_utc": 1672441021,
        "upvote_ratio": 1.0
    },
    {
        "title": "Demand a car for your birthday. Here it is!",
        "author": "littlewasknown",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/zzdizm/demand_a_car_for_your_birthday_here_it_is/",
        "text": "So this happened around 1990 in Australia. We grew up in a very working class family where we  had enough food/clothes but never any extras or brand name clothes etc. Both my parents worked hard and provided for us the best they could. My eldest brother was about to turn 17 and  was to get his drivers license. He had found his dream car for sale and demanded my parents buy it for him for his birthday. My parents were struggling to pay the bills let alone buy a car.\n\nA week before my brothers birthday, my brother finds out his dream car is sold and asks my parents did they buy it? The had a very nice chat about they can't afford such an item and $50 is the limit. My brother explodes claiming its his birth right to be given a car on his 17th birthday etc etc. He goes on a complete selfish egocentric rant about his need for a car. He demands they buy him that type of car, no matter how it is as long as its working or else. He than storms out to amates place.\n\nNow my father isn't one to go off angry so cue malicious compliance. On the morning of the my brothers birthday he wakes to find streamers and balloons tied to string from his bedroom door leading through the house out the door to the drive way.  He is beside himself with excitement. There  he finds a working version of the car he wants but alas it's a matchbox car. That's all he got for his birthday. He sulked for about a month after that but never asked for anything again.",
        "created_utc": 1672439346,
        "upvote_ratio": 1.0
    },
    {
        "title": "Add 10 more people to your reservation last minute? With pleasure.",
        "author": "bladkbirdicp",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/zzbf1n/add_10_more_people_to_your_reservation_last/",
        "text": "I had been working at this southern comfort food restaurant for about 6 years as pretty much all front-of-house positions except for manager. So I was well-versed in each position, and in this particular story, being the hostess.\n\nIt wasn’t uncommon for guests to change their reservations - whether it be time, party size, seating arrangement, etc. The most challenging change was always the party size updates. Unless a manager approved, we typically could only take parties as large as 8 people as it was quite the popular brunch spot and the maximum capacity was like 120 or something but we only had around 40 tables including the patio. The largest tables could only seat 6 people comfortably but we would make accommodations by putting tables together. Anyway every Sunday for the first 3-4 hours, we would have back to back reservations for every table and the timing was very tight.\n\nThis is more of a general issue we ran into, where for some reason we would always have parties of anywhere between 12-20 people in reservations, because money is money right? Usually only half the party would show up and create more problems as now they have multiple tables that I wasn’t able to seat for people without reservations.\n\nOn the flip side, lots of parties would reserve for 8 people and call a few minutes before their allotted time and say 10 or so more people were coming. Obviously this was an issue as they had nowhere to sit but would constantly blame it on me as if I’m the one who couldn’t stop inviting people to their 8 person reservation.\n\nSooo I then had the bright idea to start letting people know that we have room for them…on the other side of the restaurant on the outside patio (which we left unreserved, first come first serve). More often than not this bit me in the booty but I complied with their last minute reservation change on the busiest time of the busiest day of the week, maliciously. At least they got to enjoy some delicious fried chicken!\n\nPS. this doubles as malicious compliance with my manager’s decisions to allow large party reservations, leaving me to deal with the backlash. It may be petty but I was 18.",
        "created_utc": 1672434123,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can’t throw away a small box cause it’ll fill up the thrash can? Fine I’ll just clean my truck out",
        "author": "Competitive-Chapter4",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/zz9fml/cant_throw_away_a_small_box_cause_itll_fill_up/",
        "text": "For a little context, I’m a construction worker with my own company truck. As far as from what I have seen in my area, most people with company trucks have this thing where the front two seats always stay very clean (aside from dirt that comes from working in my field of work) the backseats however are a different story… it is amazing how much trash gets thrown back there whether it be water bottles, snack wrappers, food wrappers, etc. My company has a contract with a local detailer that comes and washes and vacuums all company trucks bi-weekly to keep the appearance up, we are just responsible for removing all large trash so they don’t have to do to much work. Usually we just throw out everything at the dumpster at the shop before the detailer goes in and works his magic. \n\nAnyways… on to the story.\n\nSo today I had just finished up a service call and was about to go on my lunch break. I had stopped at a local gas station near downtown Austin to pour gas right before I headed off to get some tacos. As I’m pouring gas I look in the back of my tailgate and realized I forgot to throw away at the job site and didn’t want to run the risk of it flying out and possibly causing an accident so naturally I decide to take it out, break the box down, and toss it in the trash can at the pump. Now the box itself wasn’t too big, about the size of a shoebox, and once broken down it was probably about a quarter of that size. \n\nAs I took the broken down box and placed it in the trash, one of the ladies who worked at the gas station came out furious saying I wasn’t allowed to throw away that box. She claimed the trash was only for smaller items and we weren’t allowed to throw away larger things. I was really confused and told her that it really wasn’t all that big and I didn’t see an issue. She then argued that the cardboard can unravel and fill up the bin and then she would have to replace the bags. I didn’t feel like arguing so I just obliged and took out the box and placed it back in the tailgate. She thanked me for not being so difficult and was about to go into the gas station before I stopped her and asked, “so then… what can I throw away in the trash?” She replied with anything small like water bottles, taco bags, wrappers etc.\n\nNow cue the malicious compliance.\n\nI after she said that I thanked her for letting me know and proceeded to open the back door to my truck and she got a hold of all the mess. I then proceeded to take out small loads of empty water bottles, taco bags, etc. It is truly amazing how much trash builds up in these construction trucks. Unless one had been recently cleaned out I have never seen one with little to no mess. I think I’m pretty good at tossing the stuff out of my truck but every two weeks when I submit my truck for cleaning it always baffles me with how much mess is in there.\n\nI then proceed to stuff the trash can with trash and fill it up. Now granted these trash cans already had trash in them and weren’t all that big and I didn’t really press down the trash to make more fit. I then proceeded to move to the next trash can and started filling that one up, all while looking her with the biggest smirk on my face. She then proceeded to tell me that I can’t be throwing out that much stuff cause it’s only meant for small things that I bought from the store. I then proceeded to show her that almost all this stuff can be bought at the store she was working at. She then screams at me saying that there’s no way I bought everything there and that I probably got some from other places as well. I then pulled out my company gas card that was from her gas station and told her that this was the only gas station that I’m allowed to use while in this vehicle so yes I come to this store a lot since it’s right by my job and most of this, other than the taco wrappers, come from here. \n\nShe then proceeded to call me an AH and a few other names as she stormed off into the store. I just sat there with such a huge feeling of accomplishment knowing that I dealt with that Karen accordingly. If she would’ve just let me throw out the small box you wouldn’t have to come out and replace the trash bags rn and could be sitting inside on your phone but now you gotta come out and do the job you’re getting paid to do. It must suck to actually have to do what you where hired to do. All because you thought some small pieces of cardboard would fill up one little trash can. Little words of advice, next time mind your own business.",
        "created_utc": 1672429228,
        "upvote_ratio": 1.0
    },
    {
        "title": "Lake Access Fees",
        "author": "Cerberus_144",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/zz6rxo/lake_access_fees/",
        "text": "I have a story, It's not as extreame as some of the ones I've read here but I felt like I should share it, even if it's more \"passive-aggressive complaince\"  \n\n\nIN 2008 my family and I moved into a house that was a block away from a Lake. Access to the lake was managed by a sort of \"Beach Gate\" authority that maintained the gate and the section of the beach nearest the gate. A yearly fee was paid for access to the gate to help pay for maintenance of the gate and the beach.  I can't remember what it was.\n\n When we moved in we enjoyed the lake for about a month until the beach association informed us that the previous owner of the house hadn't paid their fee in three years, and since the fee was tied to the address we'd have to pay three years worth of fees or we'd have to give up our gate access. My mom and Stepdad said \"Screw this\" and handed the key over.  \n\nWe lived in that house for a couple of years and they kept trying to get the access fees from us but we refused. The rules of the beach allowed residents to bring guests to the beach so we would often go to the beach as \"guests\" of our neighbors or get in the car and go a half mile down the road to the public part of the beach. It wasn't as clean but it was free.\n\nI feel sorry for the next people to live in that house after we moved. I'm sure being presented with the demands for FIVE YEARS of back pay on Beach access would have been an insulting shock.",
        "created_utc": 1672422741,
        "upvote_ratio": 1.0
    },
    {
        "title": "I have to stay up front? Fine, then I’m not covering for your station.",
        "author": "OptimalMeteor77",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/zz6lg0/i_have_to_stay_up_front_fine_then_im_not_covering/",
        "text": "I have this problematic coworker. For the purpose of this story, let’s call her Abby. Before I continue with this story, let me give you some background information.\nAbby is about twice my age, but we are at equal levels in our workplace. Apparently, Abby really wants to be a manager, but she isn’t one. However, that doesn’t stop her from acting like one. I am lucky enough that usually my shifts don’t align with hers. But occasionally they do. Almost always, if Abby and I are on shift together, she is a closer. That means she will tell me my cutwork (food I have to portion) before I can go. That’s the only ‘authority’ she has over me. Abby has a habit of being rude and bossy. Again, she really wants to be a manager so she acts like one.\nThere will be multiple occasions where she will yell at me if the previous shift crew didn’t do something and I will have just clocked in but somehow it’s my fault. She will yell at me for not doing something when I’m actively doing something else. So if I go to the thing she yelled at me to do, she will yell at me for not doing what I was originally doing. It would be an endless cycle.\nNow, fast forward to about a week ago. I don’t do evening shifts, only mornings. But one of my coworkers car wouldn’t start because of the snow, and I wasn’t busy that day, so I offered to take the shift. It was a night shift. Abby happened to be working. It was the peak of the blizzard so it was slower than I’ve ever seen. I was assigned to cashier and Abby was assigned to greet (hostess). Anyway, Abby would keep going to the back to ‘help’ someone else, although he was doing just fine. Any time I would walk away from the cashier stand for a work related task she would yell at me telling me that I needed to stay at the front. A customer came in and paid for their pickup order. If it’s not prepaid, an order remains in a hot box until it gets paid for. I went to go grab the order and Abby yells at me for not being up front. I calmly explain to her what I was doing and she was clearly annoyed and yells at me to hurry up. A lot of little instances similar to that. She left me alone up front and expected me to do my job and hers without leaving that station. Eventually, I’d had enough. And when the opportunity presented itself, I couldn’t pass it up. Cue the malicious compliance.\nA customer spilled a to-go water on the front counter. I began to clean it up. A party comes in to be sat. And that’s when I saw my opportunity. I call back to Abby to let her know that there were people up front. She tries to tell me to take care of it, but I return to the counter to continue cleaning up the mess before she could finish. She storms up front and seats the party. When she is done she comes over to me and starts yelling at me for not doing what she told me. I explain that I was staying up front like she said, and I was doing my job. She told me that cleaning the mess could wait, which I respond that no it couldn’t, because the water was beginning to spill towards the register and cords, which would be bad. There wasn’t an argument she could make to this and she just storms away. I was satisfied with this income.\nTL;DR: Coworker yells at me to stay up front. So I took it literally which would prevent me from helping her out with her station, which she had abandoned.",
        "created_utc": 1672422301,
        "upvote_ratio": 1.0
    },
    {
        "title": "REPOST: Karen pretends to be allergic to mushrooms, ends up being denied breakfast",
        "author": "Service_job_survivor",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/zz5qh1/repost_karen_pretends_to_be_allergic_to_mushrooms/",
        "text": "[removed]",
        "created_utc": 1672420252,
        "upvote_ratio": 1.0
    },
    {
        "title": "REPOST: Karen pretends to be severely allergic to mushrooms, ends up denied breakfast",
        "author": "Service_job_survivor",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/zz5o0y/repost_karen_pretends_to_be_severely_allergic_to/",
        "text": "[removed]",
        "created_utc": 1672420078,
        "upvote_ratio": 1.0
    },
    {
        "title": "teen leak https://scctopk.nl/invite/i=73047",
        "author": "Lessmindinit",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/zz5l42/teen_leak_httpsscctopknlinvitei73047/",
        "text": "[removed]",
        "created_utc": 1672419878,
        "upvote_ratio": 1.0
    },
    {
        "title": "teen leak https://scctopk.nl/invite/i=73047",
        "author": "Lessmindinit",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/zz5kh8/teen_leak_httpsscctopknlinvitei73047/",
        "text": "[removed]",
        "created_utc": 1672419834,
        "upvote_ratio": 1.0
    },
    {
        "title": "I'm told not to say a single word - I comply",
        "author": "baka-tari",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/zz1x3r/im_told_not_to_say_a_single_word_i_comply/",
        "text": "[removed]",
        "created_utc": 1672410664,
        "upvote_ratio": 1.0
    },
    {
        "title": "One of the most crucial things to keep in mind while asking questions on Reddit if you're new is to provide background.",
        "author": "Euphoric-Cod9855",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/zz0npx/one_of_the_most_crucial_things_to_keep_in_mind/",
        "text": "[removed]",
        "created_utc": 1672407238,
        "upvote_ratio": 1.0
    },
    {
        "title": "Call you every time…done.",
        "author": "Mountain_Bill8564",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/zyz7yx/call_you_every_timedone/",
        "text": "I am a nurse in a busy hospital. Had a surgical patient that the surgeon said not to call him at night if the night hospitalist could take care of it, in Dr words this means call me and I will yell at you. During the night I needed something fairly simple so consulted the night nurse practitioner (NP). Well I ended up having to call the surgeon. However he had a  physician assistant (PA) covering him that night. The PA comes to the floor and rips into me for calling the NP. Said why would I even call her “she’s only a NP”…a NP and PA are equals. They function the same. He said I better call him for anything, not anyone else. Cue the malicious compliance…\n\nI called that man at least 10 times that night. For everything. And for a good six months any time I had one of his patients I called him for every. Single. Thing. \n\nDon’t piss off your nurse.",
        "created_utc": 1672402770,
        "upvote_ratio": 1.0
    }
]