[
    {
        "title": "You don’t like ALL CAPS? Fine, there will be no capitalization at all.",
        "author": "princess_tut",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/8fe9e9/you_dont_like_all_caps_fine_there_will_be_no/",
        "text": "I recently asked one of my assistants to refrain from typing in all caps, because people from other departments were complaining. This assistant tends to be combative and defensive, so co-workers were interpreting her ALL CAPS as aggression. \n\nSo today I checked the logs for something unrelated, and she is now typing everything in lower case. Awesome. ",
        "created_utc": 1524856595,
        "upvote_ratio": ""
    },
    {
        "title": "Is this beer? No",
        "author": "Curiosityhurts",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/8fdx9r/is_this_beer_no/",
        "text": "Big holiday, lots os people on the street, me and the old SO enter a pizza place to order some take away. Since we are holding plastic cups full of white wine, I ask the cashier if it will be an issue if we sip it inside while waiting for our food. She says it shouldn't be because the place is packed and no one will bother.\nFast forward 10 minutes, a concerned waiter (probably taking managing orders), sees our plastic cups, approaches our table, and asks me:\n_ Is this beer?\nI look at him, look at my cup, look at my SO, look at him again and answer firmly: No.\nHe walks away.\nThe end. ",
        "created_utc": 1524853899,
        "upvote_ratio": ""
    },
    {
        "title": "Oh that was an option?",
        "author": "Bliucifer",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/8fdvht/oh_that_was_an_option/",
        "text": "Lurker here, first time poster and on mobile (I see that that's an issue for formatting sometimes?).\n\nI think this belongs here, let me know if it's not.\n\nSome background; I am ill, coughing like a 50 a day smoker, nose blocking like a hairy man's shower drain, snot bloody everywhere.\nI am a stock replen supervisor for a retail chain in the UK, often called Bits Missing by workers and customers alike.\n\nRightio, last evening I went to work and did lighter duties than I usually would (Facing the store and stocking the specials at the front of the store and whatnot instead of running around the store stocking the shelves wearing myself out physically).\nThe other supervisor, OS, was fine with this and I warned in my nightly handover for the management, M, that I'd possibly need to do so again the next shift (today)\n\nResulting in this happening about an hour ago;\nI get to work and am about to go off and do light duties when\nOS - \"M want you working stock\"\nMe - \"I can't, I'm sick and that'll make me worse.\"\nOS - \"You'll want to go talk to M about it\"\n\nAfter trying to find M to be told this particular member of M is in the office wanting to see me I go in.\n\nStore M - \"hiya you alright?\"\nMe - \"No. Not really\" (coughs here and there)\nSM - \"oh ok\" he was a bit taken aback\nDeputy M - \"What's wrong with you?\"\nMe - \"some kind of cold/flu I don't know\" (I'm not a doctor what do you want from me?)\nDM - \"Right. Well either you work stock or go home\"\nMe - \"OK, I'll go home then.\"\n- Compliance has never felt so good-\n\nCherry on top? I found out before I went to the office that they got a much bigger delivery than they expected today, so I'm pretty sure they were trying to bluff me into working stock since the warehouse was so backed up before this and DM was staying late tonight and we think she was going to do the facing.\n\nEdit: once I got home I realised I still had the keys for doing the lock up so that's going to be fun for them tonight. Either someone's staying even later or someone's got to share their keys as an inconvenience.",
        "created_utc": 1524853510,
        "upvote_ratio": ""
    },
    {
        "title": "Made the name tag, boss",
        "author": "MuvHugginInc",
        "url": "http://imgur.com/VMl0XHc",
        "text": "",
        "created_utc": 1524851833,
        "upvote_ratio": ""
    },
    {
        "title": "That’s what she asked for...",
        "author": "ProphetJezediah",
        "url": "https://i.redd.it/fiqiawwtkhu01.jpg",
        "text": "",
        "created_utc": 1524850138,
        "upvote_ratio": ""
    },
    {
        "title": "Somebody guild this",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/8fd79o/somebody_guild_this/",
        "text": "[removed]",
        "created_utc": 1524848215,
        "upvote_ratio": ""
    },
    {
        "title": "Did you enjoy your food?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/8fd1yd/did_you_enjoy_your_food/",
        "text": "[removed]",
        "created_utc": 1524847062,
        "upvote_ratio": ""
    },
    {
        "title": "Conference Problems",
        "author": "MightyThorgasm",
        "url": "https://twitter.com/SandiPsych/status/989139494262726656?s=09&amp;",
        "text": "",
        "created_utc": 1524846707,
        "upvote_ratio": ""
    },
    {
        "title": "Made the name tag, boss [xpost /r/notmyjob]",
        "author": "LeDocteurNo",
        "url": "http://imgur.com/VMl0XHc",
        "text": "",
        "created_utc": 1524846678,
        "upvote_ratio": ""
    },
    {
        "title": "Made the name tag, boss",
        "author": "AntalRyder",
        "url": "http://imgur.com/VMl0XHc",
        "text": "",
        "created_utc": 1524844334,
        "upvote_ratio": ""
    },
    {
        "title": "Close!",
        "author": "AntalRyder",
        "url": "https://i.redd.it/j54dqiwioeu01.jpg",
        "text": "",
        "created_utc": 1524844067,
        "upvote_ratio": ""
    },
    {
        "title": "What's in a name, tag.",
        "author": "LaterGatorPlayer",
        "url": "https://i.imgur.com/VMl0XHc.png",
        "text": "",
        "created_utc": 1524843398,
        "upvote_ratio": ""
    },
    {
        "title": "\"You can't decorate your graduation cap, student!\"",
        "author": "[deleted]",
        "url": "https://i.imgur.com/szJgl5j.jpg",
        "text": "[deleted]",
        "created_utc": 1524840744,
        "upvote_ratio": ""
    },
    {
        "title": "Not mine, but thought it belonged here.",
        "author": "EpicLevelWizard",
        "url": "http://imgur.com/VMl0XHc",
        "text": "",
        "created_utc": 1524840142,
        "upvote_ratio": ""
    },
    {
        "title": "the cross streets of \"Not my job\" and \"Malicious Compliance\"",
        "author": "[deleted]",
        "url": "http://imgur.com/VMl0XHc",
        "text": "[deleted]",
        "created_utc": 1524838890,
        "upvote_ratio": ""
    },
    {
        "title": "Made the name tag, boss!",
        "author": "[deleted]",
        "url": "http://imgur.com/VMl0XHc",
        "text": "[deleted]",
        "created_utc": 1524836196,
        "upvote_ratio": ""
    },
    {
        "title": "\"Recently invited to speak at a conference and was asked which of my two affiliations I preferred to go on my name tag. Probably University of Central Lancashire, I replied. So that's what they put.\"",
        "author": "sylvar",
        "url": "https://imgur.com/gbtaV9t",
        "text": "",
        "created_utc": 1524832664,
        "upvote_ratio": ""
    },
    {
        "title": "Probably...",
        "author": "ir0nm8n",
        "url": "http://imgur.com/VMl0XHc",
        "text": "",
        "created_utc": 1524832146,
        "upvote_ratio": ""
    },
    {
        "title": "An attempt at working smarter instead of harder.",
        "author": "Peruda",
        "url": "https://i.imgur.com/CBoNSSq.jpg",
        "text": "",
        "created_utc": 1524814638,
        "upvote_ratio": ""
    },
    {
        "title": "Beverly Hills",
        "author": "TooHardToChoosePG",
        "url": "https://i.redd.it/5ct9wkjz6bu01.jpg",
        "text": "",
        "created_utc": 1524801793,
        "upvote_ratio": ""
    },
    {
        "title": "Just following the instructions",
        "author": "[deleted]",
        "url": "http://imgur.com/gallery/Ahhe9FI",
        "text": "[deleted]",
        "created_utc": 1524778071,
        "upvote_ratio": ""
    },
    {
        "title": "Antidisestablishmentarianism",
        "author": "LurkingLikeFreddy",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/8f5oyq/antidisestablishmentarianism/",
        "text": "I was talking with some friends about really long words in our native languages when I remembered this gem.\n\nWhen I was ten or so, we were assigned to write a sentence, in class, in cursive, that had a certain number of characters (I think is was 200-300) and was not a run-on sentence in American English.\n\nBeing the quiet smartass, I complied using the longest work in the English language.  (I know there are medical terms that are longer, but this was my thought process at age ten.)\n\nMy sentence:\n\n&gt;My most favorite word in the whole world is antidisestablishmentarianism, which means to oppose disestablishmentarianism and to support current establishmentarianism and their established governance.\n\nI had no idea whether all this information was entirely accurate, but I was more than happy to let the teacher proofread my shitty cursive and also choke on a lemon.",
        "created_utc": 1524773018,
        "upvote_ratio": ""
    },
    {
        "title": "Kid's hockey team is starting to check this spring and were told to only hit players who have the puck. One passed it to a player on the other team and then hit him...",
        "author": "dftba8497",
        "url": "https://v.redd.it/04fyuv8qfau01",
        "text": "",
        "created_utc": 1524770053,
        "upvote_ratio": ""
    },
    {
        "title": "30fps? It needs to run at 60fps!!",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/8f4mpi/30fps_it_needs_to_run_at_60fps/",
        "text": "Some people have asked me to share more game-development stories, so here's another one that happened in about the same timeframe (mid/late 90's, PS-X). As by pure chance, this again involved another project manager, although not the same one.\n\nIn those days it was commonplace to write your own engine for a game. Sequels would usually keep the same engine but for any new game that didn't 'fit' the engine, you'd make adjustments or create a new one. Anyway, this particular game was new and we were a couple of months in, just working away on the engine / game. \nThis meant we had lots of metrics on-screen, such as memory usage, CPU / GPU load and a the obligatory frames-per-second (fps) counter. \n\nNow, before 3D and the PS-X came along, pretty much all games ran at 60fps. Due to the more complex nature of 3D it has become commonplace to run at 30fps. It's still a pet peeve of mine but alas, I digress..\n\nAnyway, one day our PM walked by and, after looking at the game for some time, stated with some concern in his voice that \"It's not running at 60fps.. I want it to be running at 60fps!\". No matter how many times we tried to explain to him that a) we were not targeting 60fps, b) we were only a few months in and c) we were running in debug mode, he insisted that the game needed to run at 60!\n\nNeedless to say, this got old fast. Numerous attempts were made to change his mind but he wasn't having any of it... The game needed to run at 60, come hell or high water!(tm)\n\nUntil one day we noticed that he couldn't actually discern the difference between 30 and 60 and solely based his observation on the fps counter on the screen...\n\nSo, to make a long story short, the problem was 'solved' by making the fps counter twiddle between 60 and 61fps.. The 'real' fps was buried inside some of the other stats, multiplied by 10 IIRC to make it more difficult to spot :-)",
        "created_utc": 1524764881,
        "upvote_ratio": ""
    },
    {
        "title": "Burnt Fries",
        "author": "OneEpicNova",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/8f3r6b/burnt_fries/",
        "text": "Not me, but my coworker(Call her T). We work at a bowling alley, and every now and then, we get these really nasty customers. This lady had already been a pain and complaining to T (who works at the snack bar) how her wings weren't made yet, despite her not paying.\n\n\nShe comes back a while later to order fries. She paid for them and all, but T, after dropping them in the fryer had to run and help the guy running the counter. As T is walking back, (knowing very well how long fries need to be in the fryer) the lady comes back up and tells T \"pull up my fries and give them to me now! They're going to be burnt!\" The fries hadn't been in for as long as they should've, but the lady wanted her fries, so she got hot, undercooked fries, as per her request. ",
        "created_utc": 1524758326,
        "upvote_ratio": ""
    },
    {
        "title": "Gas leak, you say?",
        "author": "vcc17",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/8f0ieh/gas_leak_you_say/",
        "text": "So I work for a natural gas company. We provide natural gas to our customers.  As part of my job, I safety check gas appliances, relight pilots and respond to emergency gas leak calls. \n\nDuring the cold months, we get a lot of false gas leak reports just because customers can’t wait for an appointment to have their pilots lit for their heater.  When I get these gas leak calls, I can typically tell if they’re false report from the customers. \n\nOne time, on Thanksgiving, I arrived at one of these false gas leak report and the customer is inside the home cooking with a whole group of people inside.  The customer is told to wait outside the house for us to come (safety concern). Well this guy and his family didn’t. When I got in, the guy says I smell gas coming from my force air furnace (heater). I inspected the thing and it was in the off position. He says he tried turning it on and it doesn’t work and later admitted he only called us to come out and turn it on and get it running.  I was not having it. During this time of year we are crazy busy and appointments are typically two weeks out.  I had to stop work at another appointment, just to come to this douche. \n\nAs policy, if we don’t smell gas, we have to do a full on investigation. This involves inspecting every gas appliance and the gas line in the house.  I found a couple small leak some of the fittings (coupler) and appliance valve. It’s not even hazardous. Back then we would just tell customer to get it fixed and be on our merry way.  Nowadays, we treat it the same way we do with major leaks. Well that was the first issue I found. The next thing I found was the water heater was not up to code. Won’t go too much into details, but their was an issue with the flue.  I disconnected his water heater.  The final issue I found was the gas flex line was improperly connected to the dryer.  I disconnected that too. \n\nIn the end, I shut off the gas to the entire house and lock up the gas meter outside. The guy was not having it. He was pissed off and swearing at me. I told him straight up that we treat every gas leak seriously and he shouldn’t have called it in just because he was cold.  That false gas leak call probably cost him a couple hundred dollars and a sad Thanksgiving.\n\nTLDR : Customer made a false gas leak call, just so I can turn his heater on. I ended up shutting off his gas due to minor leaks and ruined his Thanksgiving. \n\nEdit: Just so you won’t think I’m too much of an a$$, I do help out some that make false report. If they’re old or if kids are involved, I’ll actually take my time in helping them. Then I’ll lecture them in what they did was wrong. This guy happens to be mid 40s and no kids were present. They’re fit enough to handle the 60 degree cold. ",
        "created_utc": 1524723339,
        "upvote_ratio": ""
    },
    {
        "title": "Fresh hot popcorn",
        "author": "DontouchMeNoobs",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/8eyf24/fresh_hot_popcorn/",
        "text": "A few months back I was doing volunteer work. I was part of a popcorn stand for this event. Every year we have a box filled with smaller popcorn bags we have made in advance because it gets really busy later on. It's not really cold, just made 10 minutes in advance. So we give them a bag of popcorn from the box, and we pop more to refill it. Later when it gets really busy this girl asks for popcorn. We give her one of the extra bags we pre popped. All the while we are popping more because the box is only a third full. The girl sees this, touches her popcorn and says \"I want fresh popcorn.\" This is slightly inconvenient because she is holding up the line. So I take a bit of popcorn from the machine, sprinkle it on top, and hand it to her. She takes it, doesn't notice and walks away.",
        "created_utc": 1524701481,
        "upvote_ratio": ""
    },
    {
        "title": "For want of a pen",
        "author": "FondOfDrinknIndustry",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/8ex0ze/for_want_of_a_pen/",
        "text": "To paint the scene: I was a vendor, the only vendor for what some would consider the best ice cream around. We had competitors, sure, but chefs are particular people. 'I have to have it' kinda particular. Well since every tub goes through my hands keeping me happy is a good idea. There are more than a few dock agents that I come across in my day. They have an important job and security is part of it. For example, I deliver to an international airport. Means fingerprints, FBI background check, vehicle restrictions, the whole nine yards and I can't even open a door there. I understand procedure. I also understand that when you ask someone to sign something you should have a pen. I ask chefs to sign invoices all day. I have a pen; I usually don't offer it because chefs always have a pen, a pencil, and a thermometer (unless they're shit) and it's rude to ask for a pen back so to avoid pen attrition I just don't offer. If they need one I'll produce it but I digress...  important thing is I have about three pens in my pocket and a dozen or so in my van.\nEnter this new dock agent. I've been in and out of this dock (downtown, hotel) every other week for the last year or so. It's always staffed but no one ever had a check in procedure. I come in to the vestibule (I guess) and there's a sign in log and no pen. I walk past it without a second thought. Drop off the goods, get my invoiced signed and head back out. Back in the vestibule the dock agent accosts me.  \n\"You didn't sign in.\"  \n\"There isn't a pen.\"  \n\"You have to sign in.\"  \nI start walking back to my van.  \n\"WHERE THE FUCK DO YOU THINK YOU'RE GOING?!\"  \n\"TO GET A FUCKING PEN!\"  \nRelayed the whole story to my boss and never saw that dock agent again. ",
        "created_utc": 1524689778,
        "upvote_ratio": ""
    },
    {
        "title": "I asked my husband to stop eating all my ice cream in the middle of the night. Well, he didn't eat ALL of it.",
        "author": "TealHousewife",
        "url": "https://i.redd.it/lk0z79oka4u01.jpg",
        "text": "",
        "created_utc": 1524689302,
        "upvote_ratio": ""
    },
    {
        "title": "Airport physics",
        "author": "RedPalenciaTUM",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/8ewp8g/airport_physics/",
        "text": "**TL;DR at the end. Obligatory LTL, FTP, non\\-native** **\\-** **excuse my English yadayada.**\n\n\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\n\nSo, we all know the golden age of flying is far gone. Traveling by plane is now uncomfortable, tedious and involves long lines with invasive security checks. I mean, they are there for a reason and I fully support that, but unless I have superpowers I won't be able to hijack a plane with with a nail clipper.\n\nAnyhow, I still always follow the strict rules and prepare mentally before setting foot in an airport.\n\nThen there is my grandma.\n\nShe likes to do the things her way, on her time and how she likes them. It has led to some awkward  situations for sure, but since she is never inherently rude we kind of go with it and laugh at her stories.\n\nGrandma has never flown in a plane before and for her 70 birthday we decided a trip to the beach was deserved and gifted her with her first ever plane tickets, told her all the info she would need and the security restrictions like:\n\n* No more than 500ml liquids.\n* No pocket knifes \\(she collects them and always has one with her\\).\n* Only 1 small handbag.\n* Etc.\n\nGrandma assures us that for this time she will make sure to comply with all the instructions to avoid missing the flight for which she is very excited.\n\nWe meet her at the airport and everything looks good, she isn't wearing anything made from metal and says that she didn't bring her trusty Swiss army knife, we are all going through the security checkpoints and chatting to avoid the boredom when suddenly it's her turn.\n\nShe gets asked to empty her bag and the guard pulls out a 1.5Lt bottle of frozen water.\n\nWe just looked at her while they told her they couldn't allow her to go through with the bottle since it violated security policies.\n\n\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\n\n&gt;*$Grandma:* But what does the policy says?  \n&gt;  \n&gt;*$SecGuard:* It says that you are not allowed in with more than 500ml of liquid.  \n&gt;  \n&gt;*$Grandma:* Oh, I see, I'm very sorry, but... if you hold this bottle you will see that the water is frozen.  \n&gt;  \n&gt;*$SecGuard:* yes....?  \n&gt;  \n&gt;*$Grandma:* Then it's not a liquid, it's a solid.\n\n\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\n\nAn hour later we are taking off and my grandma sits happily while holding her purse, which still has a 1.5Lt bottle of frozen water.\n\n**TL;DR:** Sassy grandma gives physics lesson to airport security guard by finding a loophole in security restrictions.\n\n**EDIT:** Some formatting, I'm still getting used to the \\*new\\* more \"user friendly\" reddit.",
        "created_utc": 1524687301,
        "upvote_ratio": ""
    },
    {
        "title": "Just cancel it immediately.",
        "author": "garlicbae",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/8eweto/just_cancel_it_immediately/",
        "text": "This happened about 2-3 years ago, but I was reminded about it today and thought it would fit well in this sub. \n\nI used to work in the insurance industry and as part of my job, would need to process changes and cancellations for customers. We had a customer call in one day advising that they had found cheaper insurance elsewhere and wanted to immediately cancel their policy which had renewed about 2 weeks earlier. Now, commonly in the insurance industry here, there is a minimum charge that is kept by the insurance company in situations where a customer wants to cancel early. This ensures that the insurance company and agencies are able to recoup their costs associated with the issuing of that policy. \n\nBecause they already had other insurance in place, I started explaining that we could backdate the cancellation to the same date their policy had renewed and thus essentially cancelling out the renewal policy so that no minimum premium would be charged at all. However, this customer rudely cut me off mid-sentence and replied \"Just cancel it today. Immediately. Send me the forms.\" and hung up. The next day, I received the signed cancellation form, of course dated for today's date. So I gave him a call back and again tried explaining the minimum charge but was hastily told \"Just cancel it.\" and once again got hung up on. I tried calling him back a couple times but was sent to voicemail each time. And so, I went ahead and processed his cancellation for today's date and a week or so later sent him his cancellation documentation along with an invoice for $1,000.\n\nTL;DR: Tried to save customer some money, they didn't listen and paid the price.",
        "created_utc": 1524685050,
        "upvote_ratio": ""
    },
    {
        "title": "Every time I have to look for you, money comes off",
        "author": "neimamin",
        "url": "https://i.redd.it/1jrj2b36n3u01.jpg",
        "text": "",
        "created_utc": 1524681437,
        "upvote_ratio": ""
    },
    {
        "title": "(Meta) Are there any favorite stories here that involve someone being fired/reprimanded/etc without the superior realizing how much that person brought to the table?",
        "author": "My_Own_Persona",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/8evmjl/meta_are_there_any_favorite_stories_here_that/",
        "text": "[removed]",
        "created_utc": 1524679116,
        "upvote_ratio": ""
    },
    {
        "title": "This joke from /r/jokes",
        "author": "Kitnado",
        "url": "https://www.reddit.com/r/Jokes/comments/8esnco/a_fifteen_yearold_boy_came_home_with_a_porsche/",
        "text": "",
        "created_utc": 1524674583,
        "upvote_ratio": ""
    },
    {
        "title": "This is my shitty parking space!",
        "author": "Periah17",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/8euien/this_is_my_shitty_parking_space/",
        "text": "So, a few months ago, the facility I work at (I work for an out sourced company) decided that it would be a good idea to give all employees, their own and my coworkers and I, specific parking places; tandem parking. Were not allowed to park anywhere else in the lot, we have to park out on the street if our spaces are full. The people who work in this facility absolutely cannot park for shit. Cannot seem to stay inside the lines, don't know how to pull in all the way so their bumpers aren't sticking out, whatever. They don't know how to park. now that we have assigned parking, most of the facility employees still can't get their shit straight and just park how ever and where ever they want. My team and I have tried to ignore the new rules and we get an earful from the security guards. Anyway, We, being the red-headed step children, get the parking furthest from the facility and not even enough spaces for all of us. There are about 18 people on our team, they gave us 15 spots and we have to share those with people who come to the facility for meetings or anything extra. \nEveryday I park in the same spot, end up getting stuck behind one of my coworkers who comes in later than me, which means they leave later than I do and I have to get them to move their car every day when I want to go home. \nSo, for some reason, today they blocked off ALL assigned parking, turning it into Valet, for some event, didn't warn anyone, and the facility employees are filling up all the rest of the lot. There's nothing left for our team and the security guards are helping to find spots for the facility people but wont help the rest of us, outsourced slobs. Well, to hell with these assholes. I went through their stupid cones and parked in the same spot I always do. the security guard tried to say something to me and told me to move. I told him this is the parking spot the facility has allowed us. There is no more parking in the rest of the lot, I showed him my parking pass, and walked away. \n\nTL;DR: My outsourced, unappreciated coworkers and I were forced to have shitty, far away parking. Facility tries to take away our parking for some event but gives us no alternatives. I park in my shitty spot even though its been blocked off for the day. Facility parking enforcement doesn't like it but can't do anything about it.\n\nUpdate: very anticlimactic, didn’t get towed. Car was A-okay, no tickets, no problems. Yay!!",
        "created_utc": 1524670735,
        "upvote_ratio": ""
    },
    {
        "title": "Sure, I'll give you my full salary history (x-post to r/recruitinghell)",
        "author": "southparkfan14",
        "url": "https://i.redd.it/vlioup8im0u01.jpg",
        "text": "",
        "created_utc": 1524644966,
        "upvote_ratio": ""
    },
    {
        "title": "You want me to stay later?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/8eqcfr/you_want_me_to_stay_later/",
        "text": "[deleted]",
        "created_utc": 1524625031,
        "upvote_ratio": ""
    },
    {
        "title": "FedEx Office person: “I’m sorry we don’t accept UPS boxes.",
        "author": "mriphonedude",
        "url": "https://i.imgur.com/bM0URIN.jpg",
        "text": "",
        "created_utc": 1524622357,
        "upvote_ratio": ""
    },
    {
        "title": "I Have to Pay You Every Month? Enjoy Cashing These Checks. Xpost.",
        "author": "Newbosterone",
        "url": "https://www.reddit.com/r/pussypassdenied/comments/8dzakc/he_may_have_to_pay_but_hes_going_to_savage_as/",
        "text": "",
        "created_utc": 1524611424,
        "upvote_ratio": ""
    },
    {
        "title": "You want me to contact Pete? Fine.",
        "author": "kaeuryfiu2y379",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/8eooqg/you_want_me_to_contact_pete_fine/",
        "text": "[removed]",
        "created_utc": 1524609977,
        "upvote_ratio": ""
    },
    {
        "title": "Good thing they had sprinklers",
        "author": "picu",
        "url": "https://i.imgur.com/IKEKBKz.gifv",
        "text": "",
        "created_utc": 1524607996,
        "upvote_ratio": ""
    },
    {
        "title": "That extra twenty-four square feet of carpet has got to go.",
        "author": "LurkingLikeFreddy",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/8eo5xf/that_extra_twentyfour_square_feet_of_carpet_has/",
        "text": "This is a story about my dad's friend/ex-coworker from back in the 1980s so the details are a little bit fuzzy.\n\nMy dad's friend got poached from the firm where they were actuaries for an international business.  She was hired to be an actuary for a law firm instead.  Now this was a big law firm with six partners in a big city in the US Midwest that used to have the tallest building in the world.  In fact this is where that law office was based (It's long since gone.)\n\nThe first day she worked was a week after the oldest of the six partners retired.  They hadn't started head hunting a new partner, but couldn't let his office stand empty and they knew that letting a junior partner use it would only create a situation in which the junior partner would attempt to hold the office hostage.\n\nSo they decided to give it, temporarily, to whoever was the next hire.  That was Dad's Friend.  The only catch was that official policy dictated that only people above a certain pay grade could have more than 200 square feet of carpet in their offices.  The office was 14x16 ft, with left her with 24 extra feet.\n\nSo that day, the partner who hired her had facilities come and take up six 2x2 ft carpet squares and put them in the storage closet on that floor for when the new partner was hired.\n\nAnd that is how my dad's friend ended up with a corner office in the tallest building in the world, on the eightieth (or so) floor for nine months.\n\nEdit: moved tl;dr\n\nTl;dr: New hire had 24 square ft of bare floor in her 224 square ft corner office to uphold carpet square footage policy.",
        "created_utc": 1524605528,
        "upvote_ratio": ""
    },
    {
        "title": "Sure, boss. I'll get right on those MTV cupcakes!",
        "author": "69sucka",
        "url": "https://scontent.cdninstagram.com/vp/b6039dec44e68e944ae7ff47fe076019/5B76BBBC/t51.2885-15/s640x640/sh0.08/e35/29718255_210307802890675_3352783103415287808_n.jpg",
        "text": "",
        "created_utc": 1524605176,
        "upvote_ratio": ""
    },
    {
        "title": "[Image] I accept nothing",
        "author": "[deleted]",
        "url": "https://i.redd.it/t8h44wkiiwt01.jpg",
        "text": "[deleted]",
        "created_utc": 1524595117,
        "upvote_ratio": ""
    },
    {
        "title": "I accept nothing",
        "author": "[deleted]",
        "url": "https://i.redd.it/66fv6k7whwt01.jpg",
        "text": "[deleted]",
        "created_utc": 1524594906,
        "upvote_ratio": ""
    },
    {
        "title": "“Green parking only”",
        "author": "BENTANALAPAGAN",
        "url": "https://i.redd.it/xhryzzraxqt01.jpg",
        "text": "",
        "created_utc": 1524593058,
        "upvote_ratio": ""
    },
    {
        "title": "No foreign flags, you got it!",
        "author": "[deleted]",
        "url": "https://i.redd.it/31dcaizu0wt01.png",
        "text": "[deleted]",
        "created_utc": 1524589203,
        "upvote_ratio": ""
    },
    {
        "title": "How Many Lines Have You Written?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/8elfrx/how_many_lines_have_you_written/",
        "text": "[deleted]",
        "created_utc": 1524584975,
        "upvote_ratio": ""
    },
    {
        "title": "The bathroom is trashed and I need you two to clean it!",
        "author": "BusinessAmphibian",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/8elbwy/the_bathroom_is_trashed_and_i_need_you_two_to/",
        "text": "I was at my first job in high school as a host in a barbeque joint. I ended up getting one of my best friends a job as a dishwasher in the back of the house. There was a specific manager there we will call him \"Manager J\" who would give out jobs that were so bad the employees named them \"Manager J\" Jobs. For example, I cleaned out the INSIDE of our company dumpster, shoveled snow on days off, cleaned cobwebs out of drains and anything else you could imagine really sucked to do. Enough with the backstory one day I was working while my friend was on the dish line and it was one of those days in a restaurant where no one was coming in so it was prime time for a \"Manager J\" Job. He came up to me and started the conversation like this \"So it looks like two boys were playing Star Wars in the bathroom.\" Naturally, I had no clue what this meant so I asked for some clarification on it. He replied with \"You know they were playing laser beams.\" I started to get the idea then so I bluntly asked: \"Were they crossing streams Manager J.\" All he said back was how bad it was and how I needed to grab my friend to clean it. So I complied because I was a good employee and got my dishwasher friend into the bathroom. When we got into the men's restroom we found just what we expected, a perfectly cleaned and stocked restroom from the night before because up until this point we have only had about 3-4 small groups into the BBQ Joint. My friend and I both have a lightbulb at about the same time and agree to spend as much time in the bathroom until \"Manager J\" came to find us. We cleaned everything in the bathroom to an extent where I said \"Hey friend should I mop the walls\" and he replied with \"why not I am already cleaning the ceiling.\" I round the corner to find him on the counter wiping the ceiling. About three hours passed of just us screwing around in the bathroom until \"Manager J\" came to find us. He burst in and said he had been looking for us for a long time and that we were both going to be reprimanded for hiding on the job. We both calmly told him how bad the bathroom was and that we were cleaning it the whole time. No reprimand from him or corporate and no this didn't slow him down on dishing out \"J Jobs.\"\n\nTL: DR\nThe manager wanted my friend and me to clean the bathroom because it was \"destroyed.\" The bathroom wasn't dirty at all since no customer has used it yet. We spent three hours in the bathroom screwing around till he came to find us.",
        "created_utc": 1524584174,
        "upvote_ratio": ""
    },
    {
        "title": "Sure, I'll rate your test",
        "author": "alcool22",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/8ekz93/sure_ill_rate_your_test/",
        "text": "I work at a big IT company and as you would expect, the bigger the company is, the bigger the bureaucracy in terms of office policies.\n\nOne of those policies my manager is always adamant about (and has a much bigger impact on my evaluations than you'dd expect) is to always complete the mandatory training courses related to data privacy and physical and logical security on time.\n\nImagine my surprise than when I receive an e-mail from some random dude from security team that I haven't completed a training course related to logical security and it's way overdue. He also made sure my manager and my manager's manager are in carbon copy, as well as my team peers. Straight up public shaming no more, no less.\n\nI take the course as soon as I have a chance, taking valuable time off other pressing task and  it seems oddly familiar. No surprises, upon looking at my course history, I already had that piece of a$$ training 40 days ago.\n\nI reply to thank the guy for wasting my time, keeping everybody else in the loop. He then proceeded to reply that it is all my fault and the fact that I completed the course hasn't shown up as  because I haven't taken the survey to rate the usefulness of the test and the questions within, that I need to take the survey and send him a screenshot before he can manually confirm in the automated platform that I completed the training course. \n\nSure thing mate. I rated the training course and all the questions related to it with 1 out of 10 and sent it back with a screenshot.\n\nI also separately encouraged my peers to rate their training courses to not get in the same situation as me. At least 5 of them gave it below 3/10.\n\nNow, given the company politics, I am pretty sure that he will at least have a chat with his boss explaining why the latest training course scored abnormally low on user evaluation. \n\nHe replied to my mail in private asking me why I rated the thing so low. I told him that it was interesting the first time around, but the 2nd time was a complete waste of my time, which reflected in the ratings. He took it like a man, and ended the conversation there.",
        "created_utc": 1524581458,
        "upvote_ratio": ""
    },
    {
        "title": "We want to see the data",
        "author": "humpty_mcdoodles",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/8ekhjg/we_want_to_see_the_data/",
        "text": "I've been working on a project as an R data scientist with some medical clinicians. After doing some prelim analysis that didn't pan out, the project was handed over to a more senior member. So far, the directions from management have been extremely vague at best, oftentimes completely illogical. After months of having no testable hypothesis, or really any idea or even a shadow of an idea,  that senior team members starts abandoning the project.\n\nSo then this tangled mess of a project somehow becomes my responsibility (again). After a few weeks of the blame being put on me, management gets desperate and starts throwing vague demands about \"data\" at me. Finally, they said they want to see the \"data\". No amount of explanation availed me. It was at this point they metaphorically closed their eyes and plugged their ears.\n\nSo I write a short R script to populate some tables. By the way, our dataset is 5,000 patients long, and 653 variables wide. I printed all the tables out and I am planning on passing out some thick packets at the meeting. I will let you know how it goes in the next couple of hours!\n\nEDIT: Hey guys, a little past a couple of hours but the meeting went long and I got hungry. Didn't really go the way I expected it to, basically I went through the tables really slowly and management was quiet the whole time. The packet I passed up ended up being around 20 pages, 12-point font. I would say each table was around 12 columns wide and god-knows how many rows deep. If anyone is familiar with med data, the left-hand column was \"slightly\" aggregated ICD-10-CM codes, so the data was pretty granular with things like \"pulmonary valve disorder\", etc, etc. They looked dazed (probably how I look in all these meetings where I have to translate exec speak to data speak) and they kinda threw their hands up at the end, and said we will reconvene next week. Still no clue as to next steps, or what I am supposed to do at this point. ",
        "created_utc": 1524577375,
        "upvote_ratio": ""
    },
    {
        "title": "Obeying the letter of the law precisely",
        "author": "NevynPA",
        "url": "https://i.redd.it/waznrmptxut01.png",
        "text": "",
        "created_utc": 1524576088,
        "upvote_ratio": ""
    },
    {
        "title": "Ordered an Iced Coffee, no sugar, only creamer.",
        "author": "[deleted]",
        "url": "https://imgur.com/tWIzBN0",
        "text": "[deleted]",
        "created_utc": 1524539192,
        "upvote_ratio": ""
    },
    {
        "title": "Ordered an Iced Coffee, no sugar, only creamer.",
        "author": "[deleted]",
        "url": "https://i.imgur.com/tWIzBN0.png",
        "text": "[deleted]",
        "created_utc": 1524537534,
        "upvote_ratio": ""
    },
    {
        "title": "Don’t cut the tablecloth!",
        "author": "otchris",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/8egtbo/dont_cut_the_tablecloth/",
        "text": "[removed]",
        "created_utc": 1524534188,
        "upvote_ratio": ""
    },
    {
        "title": "I ordered an Iced Coffee, No Sugar, just creamer - They gave me a cup of just creamer.. No Coffee.",
        "author": "[deleted]",
        "url": "https://imgur.com/a/zjcOFul",
        "text": "[deleted]",
        "created_utc": 1524533330,
        "upvote_ratio": ""
    },
    {
        "title": "X-post r/aww",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/aww/comments/8edzuu/good_boi_knows_hes_not_allowed_to_have_sticks/?st=JGCZ615O&amp;sh=f443d154",
        "text": "[deleted]",
        "created_utc": 1524532457,
        "upvote_ratio": ""
    },
    {
        "title": "I was told I couldn't use \"JCS\" as my ship ID tag because it was for \"group admins only\". So I complied...",
        "author": "Neo_Vexos",
        "url": "https://i.redd.it/581fprhvaqt01.jpg",
        "text": "",
        "created_utc": 1524519918,
        "upvote_ratio": ""
    },
    {
        "title": "Yeah, sure. I'll call my dad...",
        "author": "krle994",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/8eezgk/yeah_sure_ill_call_my_dad/",
        "text": "\\(TL;DR at the end\\)   \n\n I was in 7th grade \\(for reference: not US and about 13 years old\\) and I was at my basketball practice at school. Our male locker room had holes in almost all of the doors from kids punching them. One of the other guys from practice \\(let's call him Bored Kid\\) was, as you may have guessed, very bored and was walking around the locker room. Bored Kid stopped at the entrance door and started picking apart the broken pieces off the door before practice and throwing the pieces on the floor. This is what will later cause the shit to hit the fan.\n\nAmong others, there was an older kid \\(let's call him Douche Kid\\). He was bigger than all of us and liked being, well, a douche. While we were still there in the locker room, I approached the Bored Kid and started talking to him till the beginning of the practice. We started heading out and the janitor came in right after us. The janitor is an alcoholic old guy, grumpy and has had a few conflicts with the students over the years where he called the students offensive names and cursed at them \\(think an even grumpier but skinnier version of Willy from the Simpsons\\). He saw the pieces and started yelling about the door at us. I turn around and Douche Kid comes in and starts saying how I broke the door and was laughing about it earlier. So the janitor freaks and starts yelling at me, calling me names, and saying  stuff like \"I f\\*\\*\\* your mother\". He pulled me inside the locker room by my arm and started saying how he is going to take me liable for all the broken doors and how my dad's going to pay. I tried explaining what happened, but he did not even give me a chance to finish.\n\nNow this is where the good part starts. He insists that I call my dad and tell him to come right away with his wallet to pay for the damages. I ask him, knowing my dad, \"Are you sure you want me to do that?\" He yells that he is absolutely sure and that I should call him right away. To fire him up even a little more, I tell him I don't have a phone to call him, and he already took out his phone mid\\-sentence, grinning ear\\-to\\-ear and I said \"Yeah, sure. I'll call my dad...\". \n\nSo he hands me the phone and I enter the locker room and call my dad. I explain everything that happened and, the magic words, I told him that he cursed at me, mentioning my mother. Dad said he is coming and I went back to practice. I handed the phone back to the janitor and he was still grinning with joy. Now, my dad is a 6'3, 250 pound, scary looking man and a boxer as a young lad \\(again, just for reference\\).\n\nIn the middle of the practice, my dad came into the gym and called me over. As I was coming out, the janitor showed up, grinning. He immediately started telling my father how I broke all the doors. My dad stopped him mid\\-sentence and said \"He told me that you said that you are gonna f\\*\\*\\* his mother\". The grin fell into the dark abyss, never to show again. The skinny little weasel was now scared shitless. \n\nHe started to stutter and said with a nervous laugh \"Ooooh, nooo. Th... Th... That is not what I meant. I... meant it ... how do you say...\"\n\n \\- Dad \"Figuratively?\"\n\n \\- Janitor \"Yee... yes, yes!\"\n\n\\- Dad \"So how about I break your bones? Figuratively?\"\n\nThe janitor went pale and said \"But sir, I don't think there is a reason for such actions. Please, let's not do this. I guess I was wrong maybe. Some doors were already broken so maybe he WAS telling the truth about not breaking them... \\*nervous laughter\\*\"\n\n\\- Dad \"If I ever hear that you as much as look at him the wrong way, I am going to break your bones, but certainly not figuratively!\"\n\n\\- Janitor \"Oh, no problem sir. I do not have any problems with that.\"\n\nSo me and my dad went home after and now I was the one grinning. After that incident, the first time the janitor saw me, he asked, quite hypocritically, why I had to bring my dad into that, and I said that he was the one insisting I call him. Ever since then, he says hi to me with a big ol' smile.\n\nTL;DR\n\nThe janitor wanted to pin some broken doors on me, and insisted I call my dad and cursed at me while doing so. I told him that was not a good idea, he insisted. Dad came, and threatened to break his bones, he now also thinks it was not a good idea.",
        "created_utc": 1524517822,
        "upvote_ratio": ""
    },
    {
        "title": "Only owning airspace 75 feet above your property.",
        "author": "LifeLocks",
        "url": "https://i.redd.it/5ceeyx0dmpt01.jpg",
        "text": "",
        "created_utc": 1524511664,
        "upvote_ratio": ""
    },
    {
        "title": "Confirming the brand of a brace",
        "author": "charmyc",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/8edmsl/confirming_the_brand_of_a_brace/",
        "text": "Hi! \nI work for a Health Insurance company and this happened to a colleague of mine today. \n\nWhile processing claims sometimes the brand of equipment being claimed is not always clear. To confirm that the type of brace is covered, if the info was not provided in the invoice, we sometimes ask for pictures of the box or the brace to confirm what type of brace it is. (Fabric brace like those sold at pharmacy are usually not covered)\n\nThe phrasing for this request goes a little like this;(modified heavily to avoid confirming which insurance company)\n\n“In order to process your claim, we need to confirm that this brace is eligible for coverage. Please provide the brand and model number of the braces or pictures of the box or braces. “\n\nWe usually just get an updated receipt or pictures of the box. In this case the insured sent his full back braces by mail for us to evaluate. \n\nTechnically allowing us to confirm coverage. \n\nWe sometimes also get used denture to confirm that they are indeed worn out. (A simple say so from a dentist is sufficient or if they are more then x years old)\n\n",
        "created_utc": 1524507461,
        "upvote_ratio": ""
    },
    {
        "title": "No, We Don’t Want Carpets Anymore",
        "author": "FierceTom",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/8ed9yy/no_we_dont_want_carpets_anymore/",
        "text": "So my dad just told me this story, and I thought it fit perfectly here. The usual, on mobile sorry for typing etc.\n\nSo I’m looking at buying my first house, and my parents are telling me about chains, and how if one person pulls out, the whole chain collapses, so people start making unreasonable demands as they no everyone is desperate for the sale to not fall through. So when they sold their house, they rented a house while looking to buy another one, avoiding the chain. \n\nWhen they sold their house, and moved half way across the country, they agreed with the buyer that they’d leave the carpets and curtains, nearly new btw, for something like £1000 extra. Two days before the sale was due to go through, the buyer demanded my parents include the carpets and curtains free, or else she’d pull out the sale, my dad called her bluff and said fine, cancel the sale. To which the buyer then said, oh no don’t cancel, we just don’t want the curtains and carpets. \n\nHere’s where my dad got annoyed. The buyer knows my parents had moved half way across the country and were trying to go back on their deal, and save £1000. Seeing as they said they didn’t want the carpets, my dad rented a mini van and drove half way across the country to their old house, the day before the sale completed, and ripped all the carpets out. Literally ripped them, so they couldn’t be reused, kept two of the nicest and carpeted our attic and shed in our new house, but left the old destroyed carpets and curtains in a pile in the garden. \n\nHave fun moving into the new house and having to spend upwards of £4000 to recarpet the house before you can move anything in! At least you saved £1000 though :)",
        "created_utc": 1524504805,
        "upvote_ratio": ""
    },
    {
        "title": "We can't adjust the thermostat? Fine we'll just cool it down.",
        "author": "moration",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/8ebzyq/we_cant_adjust_the_thermostat_fine_well_just_cool/",
        "text": "We got new thermostats in my office about a year ago. You can adjust them up or down two degrees. Not to  mention the HVAC is never really in sync with the room the control is in.\n\nStaff is now putting cold things on the thermostat to cool it down artificially. I suggested a can of compressed air but it seems a cotton roll with some chilled water is enough to kick the heat on.",
        "created_utc": 1524494867,
        "upvote_ratio": ""
    },
    {
        "title": "You never said anything about the far-left",
        "author": "kowell",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/8eby57/you_never_said_anything_about_the_farleft/",
        "text": "For this story's purpose, the country and all political party names have been modified since I really don't want to get into a ~~circlejerk~~ political debate on reddit. (It's not the USA)\n\nAt my previous job, I had a few colleagues who were quite into politics but that would usually respect other people's opinion and could take a joke. They liked to talk politics but not shove it down other people's throat. You know... decent people.\n\nOne of them was a moderate right guy and hated the local left party so for his birthday we got him a membership card to the left party, valid for 2 years so he'd even be able to vote in their next leadership race. We also revamped his office plaque and any stationaries he had to reflect is newfound political idealogy. He loved it, got a good laugh and even said he could now destroy them from within. (complete will evil laughter and gloating)\n\nAnother colleague with similar political taste learned of this, got a good laugh but firmly said we'd better never get him a card to local left party as well because he really REALLY hated them.\n\nOK... so we got him a membership card for the ultra-left hippy loving social justice party for 4 years insted and redid his office plaque and stationaries and the secretary even helped us to change his automated email signature to add (proud member of the ultra-left hippy loving social justice party)\n\n*Side note*\n\nWe actually kept this going for a while. The first colleague ended up with personalised mugs with the party logo and pictures on it, fullsize color posters and even a photoshopped picture in a frame of himself and the party leader on his desk. Since he was a good laugh he kept them all in his office but some people who knew of his political affiliations (he was pretty vocal) would always stare weirdly when they saw the stuff in his office.\n\n*EDIT*\n\nA few people have mentioned that changing his email signature could have hurt his carreer inside the company. Worry not good people, as I have explained in a comment, secretary was responsible for his emails since he was sort of a mid-manager and he basically sent 2 emails a day, to people in the know. Secretary made sure not to humiliate him with this BUT he did for some reason send an unusually high number of emails inside the department that day. We were tricksters, not evil.",
        "created_utc": 1524494458,
        "upvote_ratio": ""
    },
    {
        "title": "TIL that The Sex Pistols were asked by their manager to write a song called \"Submission\", hoping they would write about bondage. Instead they wrote a song about a submarine mission.",
        "author": "[deleted]",
        "url": "http://www.songfacts.com/detail.php?id=7936",
        "text": "[deleted]",
        "created_utc": 1524476908,
        "upvote_ratio": ""
    },
    {
        "title": "The Not-so-Friendly Local Gaming Store",
        "author": "N11Ordo",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/8ea5t9/the_notsofriendly_local_gaming_store/",
        "text": "I usually post on $NumberRelatedAnonymousMessageboard so I apologise if the formatting is wonky.\n\nThis might be a long one so let me set the stage before I get to the good part. \n\n\nACTORS: \n\n**$N11Ordo** - Yours truly. \n\n**$LGS** - Local Gaming Store. Sells boardgames, wargames and roleplaying games.\n\n**$SGM** - Stressed but good manager. Juggling kids, education and store management. Usually needs 30 hours per day to do all the things he promises he’ll do.\n\n**$StO** - Store Owner. A massive $OldWordForRooster. \n\n\n**BACKGROUND**\n\nAt the time when this happened I had been unemployed for a long time so when the job center gave the go-ahead for the chance at a government-payed trainee^1 spot at $LGS I jumped on it with gusto, with the hopes of working with my hobby. Now, I’m usually the last guy to even be phased by being mistreated and just chug through it with a smile but this one time I decided enough was enough.\n\n\n^1 Closest I can relate it to in US terms. Essentially the company agrees to give you work experience and the government-run job center pays you a small sum each month for it. As a GPT you can only work certain hours and can’t sub in for actual employees. At the end of the trainee period it is seen as good form that the company hires you unless you did something monumentally bad during the trainee period.\n\n\n**ACT 1 - First Contact**\n\nMonday morning and $N11Ordo was giddy as he parked his bike next to the $LGS, head already filled with ideas about how this was the start of a long and glorious career working with his beloved hobby. \n\n\n$StO quickly greets $N11Ordo, dumps over onboarding responsibility to $SGM and then promptly storms out to catch a flight to $BigBoardgameConvention. After a slightly confused “welcome aboard” spiel and introducing $N11Ordo to the back area (consisting of storage, a small office and a even smaller kitchen), $SGM find that $LGS are out of trainee shirts and $StO hasn’t put them on backorder. $N11Ordo is given a company-branded work shirt with a temporary palm-sized handwritten badge that says “TRAINEE” over the breastpocket as a stopgap solution and told what’s expected of him as a trainee. This include sweeping and dusting the store every morning, stock the shelves if something is missing, assist customers and if all those have been checked off, paint the store’s supply of loaner wargaming terrain. This will be important later on.\n\n\n**ACT 2 - The Troubles Begins**\n\n&gt;“What do you think you are doing? That area is employees only!\n\n$N11Ordo looks up from behind the counter where he’s been helping $SGM tally boxes of 100+ mixed dice to see $StO march up to the counter, finger pointing square at $N11Ordo. \n\n&gt;$N11Ordo: “I’m helping $SGM tally these dice so he-“\n\n&gt;$Sto: “I SAID EMPLOYEES ONLY!”\n\n&gt;$N11Ordo: “Okay. Hey $SGM, can I take these boxes over to $PopularCardGame table and tally them there?\n\n&gt;$SGM: “Sur-\n\n&gt;$StO: No you can not. Those dice are to be kept behind the counter at all times. \n\nNot wanting to make a fuss and maybe ruin his hopes of working with his hobby $N11Ordo puts the dice boxes back in order and steps out from behind the counter.\n\n&gt;$N11Ordo: How about I restock the shelves with the new games we have in the backroom?\n\n&gt;$StO: The backroom is employees only as well. You can’t be in there without supervision. \n\n&gt;$N11Ordo: I’m guessing you don’t have time to supervise me while I get the things I need?\n\n&gt;$StO: No, I don’t. I have better things to do then watch you haul boxes around. \n\nDejected $N11Ordo pick up a broom and decides to sweep the floor for the fifth time that day.\n\n**FAST FORWARD 3 DAYS**\n\n&gt;“You can’t wear that, those shirts are for employees only! Go change right this instant!”\n\n$N11Ordo looks up from scrubbing coffee rings from one of the tables reserved for $PopularCardGame tournaments later that day and notices $StO pointing at him and fuming with barely concealed anger. \n\n&gt;$N11Ordo: I was told by $SGM to wear this so customers knows i’m a trainee. \n\n&gt;$StO: I don’t care. Those shirts are for employees only and you are not a employee. \n\n\nOne quick shirt change later and $N11Ordo is using his regular shortsleeved summershirt with no sign or branding to differentiate him from a generic customer as work shirt. \n\n\n**ACT 3 - The End**\n\n&gt;$StO: “I’ve gotten complaints about you from a lot of customers. I don’t want you to handle customer service any more.”\n\nFor the record this is complete $WordForMaleBovineManure. I know somewhere around 80 percent of all the people that shop at $LGS and no one has said anything to me.  \n\n&gt;$N11Ordo: Okay, so what do you want me to do instead?\n\n&gt;$StO: I don’t know. Find something to do. You know what’s expected of you.\n\nLet’s see, store is cleaned and dusted, floors swept, can’t restock shelves, can’t handle customer service, can’t loiter behind the counter to learn the register. What else is there? Oh right, painting terrain. \n\n\nHere’s where the malicious compliance comes into play. $N11Ordo grabs some boxes of dull sprue-gray terrain pieces and the big box of paint pots. Usually it would take about 45-ish minutes to paint each piece to what is referred to as tabletop standard (a few quick coats of paint, a slather of wash to get depth and a quick drybrushing to pop what details there are) but this won’t do at all. This store needs to have the best painted terrain it can possibly have. \n\nPaints are prepared, reference photos researched at great length and every miniscule piece of moldline scoured away like it was an affront to nature itself. Now just the prepwork for each piece runs up to 40 minutes without even the first layer of paint having been applied yet. $N11Ordo carefully thins each layer of paint to nearly the consistency of water and applies each layer with outmost care before letting each piece dry for 20 minutes before applying the next layer of ultrathinned paint. Every single detail on the terrain pieces are given the full competition winner treatment. This goes on for a week, customers or no customers. $N11Ordo’s days now consists of sweeping and dusting the store then bringing out the big box of terrain and paints, paint two or three terrain pieces for seven hours then clock out and go home, all the while $StO ranting about customers being neglected and nothing is getting done.\n\n\nFriday after lunch and $N11Ordo has just finished up a statue terrainpiece that now looks like it could step off the board by its own. \n\n&gt;$StO: That won’t do. Redo that statue. \n\n&gt;$N11Ordo: Um, why?\n\n&gt;$StO: It doesn’t match the style of the other pieces \n\nThis is new. $StO hasn’t complained about any of the other pieces that $N11Ordo painted in the same style. Well enough is enough. Instead of his usual grin and bear it stoicism $N11Ordo gets up, carefully puts the paint pots back in order and puts away the terrain pieces. \n\n&gt;$StO: What are you doing?\n\n&gt;$N11Ordo: Putting back everything where it should be.\n\n&gt;$StO: I told you to repaint the statue, not put everything back!\n\n&gt;N11Ordo: I quit. \n\n**Edit** - Changed some formatting",
        "created_utc": 1524475415,
        "upvote_ratio": ""
    },
    {
        "title": "www.sf-casino.com 카톡문의는 sf257 입니다 우리카지노 우리카지노계열 우리카지노총판 입니다.더킹카지노 트럼프카지노 슈퍼카지노 33카지노 개츠비카지노 이외 먹튀검증된 우리카지노계열 카지노사이트 많이있습니다.우리카지노총판 및 쿠폰문의 가입문의 받고있습니다. 우리카지노 제휴사이트 셔플카지노에이전시 많은 이용부탁드립니다. 감사합니다 www.sf-casino.com 카톡문의는 sf257 입니다",
        "author": "asd772",
        "url": "https://sf-casino.com",
        "text": "",
        "created_utc": 1524466605,
        "upvote_ratio": ""
    },
    {
        "title": "TIL that The Sex Pistols were asked by their manager to write a song called \"Submission\", hoping they would write about bondage. Instead they wrote a song about a submarine mission.",
        "author": "Shawnj2",
        "url": "http://www.songfacts.com/detail.php?id=7936",
        "text": "",
        "created_utc": 1524464541,
        "upvote_ratio": ""
    },
    {
        "title": "\"A severe and incurable brain disease\"",
        "author": "poppypants2",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/8e7xrn/a_severe_and_incurable_brain_disease/",
        "text": "The setting: 10th grade English class, about 15 years ago\n\nAs you can imagine, some of the homework assignments were not popular among all the students. The teacher, Mr. C, was getting a bit tired of everyone's complaints... so when a student asked, \"is there *any* way we can get out of this assignment?\" he replied sarcastically, \"Yeah, sure. If you get a note from a medical doctor saying you have a severe and incurable brain disease that prevents you from completing the assignment, then you won't have to do it.\"\n\nI think he forgot that my dad is a doctor--an actual MD. And, luckily for me, my dad also has a good sense of humor. \n\nThe next morning I showed up to class with an official doctor's note on a prescription pad saying \"*I have diagnosed Poppypants with a severe and incurable brain disease that prevents him from completing his English assignment. Thank you for your understanding. (signed, Dr. Poppypants, MD)*\"\n\nThe teacher looked at it, read it, and you could see the gears turning in his head until he finally laughed and asked if it was fake. I assured him it was quite real and he could call the doctor to verify it. He thought it was pretty funny and ended up posting it on the bulletin board in the teachers' lounge. I had done the assignment just in case (I was a really good student and didn't want to risk it), so I ended up handing it in anyway.",
        "created_utc": 1524448020,
        "upvote_ratio": ""
    },
    {
        "title": "When you answer to no one",
        "author": "Sunder15",
        "url": "https://i.imgur.com/E01PZhp.jpg",
        "text": "",
        "created_utc": 1524444448,
        "upvote_ratio": ""
    },
    {
        "title": "There aren't enough fries in this",
        "author": "uq42",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/8e79c6/there_arent_enough_fries_in_this/",
        "text": "I used to work at a large chain of fast food restaurants that sold burgers and fries. It was getting late, maybe 10pm and we were fairly slow. I was working the cash register and assembling orders as the grill area sent food up when angry lady (AL) came up to the counter and shoved a box of fries in my face\n\nAL: there aren't enough fries in this!\n\nMe: It looks fairly full to me but if you want I can weight them and give you the correct amount.\n\nAL: That would be helpful.\n\nI don't remember her exact words but I know she was fairly smug. In her mind she just won.\n\nI opened a cabinet and got out a small weight scale. I placed the fries on the scale and lo and behold there were too many fries in the box. Being the helpful person I am I dumped a few out, doing my best to make sure i could get a second pour.\n\nAL was not happy at all. I guess this isn't what she had in mind. I placed the fries back on the scale a second time, out of her reach of course.\n\nMe: I'm sorry mam but it appears this is still slightly over the weight limit.\n\nI dumped a few more out and weighed it right on the money. My favorite manager who had been watching the whole thing was laughing at the situation. AL must've seen this because she didn't ask to speak to a manager.\n\nIf she had been polite at the beginning I would've given her more fries for free",
        "created_utc": 1524441139,
        "upvote_ratio": ""
    },
    {
        "title": "I do not have your battery",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/8e703h/i_do_not_have_your_battery/",
        "text": "[deleted]",
        "created_utc": 1524438597,
        "upvote_ratio": ""
    },
    {
        "title": "“Put the paper towels on the rack”",
        "author": "zbuck0237",
        "url": "https://imgur.com/b1l3G1w",
        "text": "",
        "created_utc": 1524430019,
        "upvote_ratio": ""
    },
    {
        "title": "I think this works here..",
        "author": "[deleted]",
        "url": "https://i.redd.it/9p645vdamit01.jpg",
        "text": "[deleted]",
        "created_utc": 1524426887,
        "upvote_ratio": ""
    },
    {
        "title": "Call My Mom? Okay",
        "author": "pay_purr_mew",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/8e5hn4/call_my_mom_okay/",
        "text": "Junior year of high school I had a real knob of a math teacher (hereafter,\"Mr. K\"). Always picking on students and lived on failing people. I had an A in the class come interim report time and he demanded everyone get it signed by their parents and returned. Usually this was reserved for folks with grades C or lower. I didn't bring it home and have it signed. Mr. K spent 20 minutes of class time sending all of us up to call our parents in front of the class who failed to comply. I was last and all the other students with failing grades were fussing and sucking their teeth.\n\nI, however, couldn't wait. She has little patience for bullshit. When it was my turn, I call my retired Lt. Colonel mother, then middle school teacher in the middle of her robotics class. She was so worried that I was calling because at the time I was having a lot of health issues and had regular standing appointments on base to get injections every single day. I tell her Mr. K asked me to call because I didn't have my interim signed. Thinking I was failing, she demanded to know my grade. I tell her I have an A in the class. At this point she politely requests that I hand the phone to Mr. K. He has the smug look and just stares at me, thinking that I just got in trouble. \n\nQuickly he turns around and everyone can hear her barking at him for wasting her time enacting useless policies and how dare he waste valuable class time as one teacher,to another. He's quietly mumbling \"yes ma'am, yes ma'am.\" He hangs up the phone and resumes class.\n\nI was never asked to call my parents again in his class.\n\nEdit: I speak to my mother every day or so and read her some of the things y'all said. She was in stitches. My father was the airborne ranger, so she doesn't often hear that she's the badass one. You guys really made her day. Thank you. 😄",
        "created_utc": 1524424789,
        "upvote_ratio": ""
    },
    {
        "title": "Sure, I’ll make your tea",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/8e57ua/sure_ill_make_your_tea/",
        "text": "[deleted]",
        "created_utc": 1524422426,
        "upvote_ratio": ""
    },
    {
        "title": "was on ifunny and thought this belonged here",
        "author": "RandomAmerican81",
        "url": "https://i.redd.it/yk43c9wdrht01.jpg",
        "text": "",
        "created_utc": 1524416495,
        "upvote_ratio": ""
    },
    {
        "title": "My mother's boyfriend said that he wanted a little glass of wine",
        "author": "TheGrandFerry",
        "url": "https://imgur.com/eTUUCn3",
        "text": "",
        "created_utc": 1524414828,
        "upvote_ratio": ""
    },
    {
        "title": "Won't let me go see the nurse? Fine, she'll come to me instead.",
        "author": "UnfortunateDesk",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/8e4cma/wont_let_me_go_see_the_nurse_fine_shell_come_to/",
        "text": "Hey, I just got here but scrolling through these stories reminded me of my own. I hope it fits here. \n\nI was a sophomore in high school taking a test in history class. My periods had always been heavy and came with debilitating painful cramps but usually I could push through it. Not this day though. This day, I was in agony. I was clammy and dizzy and I couldn't focus at all on the test (which was all open ended questions, ugh) and I knew if I could just lay down for a little bit I'd be fine. \n\nSo I got up and asked Mr M if I could go to the nurse. He didn't even look up from his desk and he said if I didn't finish my test first, he'd have to fail me on it. Okay, fine. Whatever. I dragged myself back to my desk and scribbled down some words and as I handed it to him I blacked out. I woke up on the floor with the nurse standing over me. I was white as a sheet and  she helped me into a wheelchair and rolled me down the hall to her office where she got me some ibuprofen and a heating pad.\n\nMr M apologized to me the next day and gave me an A on the test 😅 ",
        "created_utc": 1524414765,
        "upvote_ratio": ""
    },
    {
        "title": "No noisy toys for the kid? Okay!",
        "author": "chadake",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/8e38de/no_noisy_toys_for_the_kid_okay/",
        "text": "I’ll preface this with the usual mobile-posting request of ‘please forgive my formatting’. \n\nThis year, for my eldest-spawn’s birthday, my extended family decided to comply with my repeated request for **no** noisy toys this year. They bought him books, craft sets, robotics kits, science kits, Star Wars figurines, etc.. Finally, a break from toys that screech and beep at the slightest movement - or so I thought. \n\nEvery single one of them attached birthday cards that have in-built speakers &amp; play different tunes. They even had the same note scribbled on the back of each one: “You said no noisy toys, but you didn’t say anything about noisy cards!” ",
        "created_utc": 1524403725,
        "upvote_ratio": ""
    },
    {
        "title": "I left a list of chores for my teen daughter to do. I came home to stuff like this.",
        "author": "Z0MBIECL0WN",
        "url": "https://imgur.com/b1l3G1w",
        "text": "",
        "created_utc": 1524392876,
        "upvote_ratio": ""
    },
    {
        "title": "Mow the lawn? Okay.",
        "author": "Kittenyberk",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/8e25s8/mow_the_lawn_okay/",
        "text": "This happened about 5 years ago now, but  still fills me with fuzzy warmth.\n\n\nWe were living in a rented house in a very rural hamlet of about 20 houses, 60 people and 30 dogs.\n\n\nThe house was cheap, but falling apart, the landlord was the worst kind of bastard who'd pick up on anything he could blame on us, but not deal with minor issues like the central heating not working, or the stairs falling down.  \n\n\nThe landlord's parents lived next door, so there was a lot of snooping went on, and often he'd just phone from their house to harass us.\n\n\n\nAnyway, on this particular day, we get a phone call at 10pm, demanding I mowed the 1/4 acre lawn.\n\n\nYes sir, not a problem I will do that right away. \n\n\nNow, a relevant piece of information here is that my lawnmower at the time was a cheap old Briggs and Stratton number which I found in a skip.  It worked fine, but there was no recoil starter, and no muffler.\n\n\nSo, I drag the mower out, start it using a half knackered drill and mowed the lawn.\n\n\nEvery fucking inch of it.\n\n\nWas on until 1am, had a couple of neighbours come and scream at me, explained it was at the landlord's behest and I didn't want evicting, talk to the landlord.\n\nCouple of days later the landlord comes to bitch at me because I did exactly what he said to.  \n\n After that he just started trying to send a bloke around to mow the lawn.",
        "created_utc": 1524387844,
        "upvote_ratio": ""
    },
    {
        "title": "Not a disabled space?",
        "author": "jbax006",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/8e23gt/not_a_disabled_space/",
        "text": "One day when my son (who has Cerebral Palsy and has never walked) was three, I took him to a popular shopping centre.  Drove around for a little while but couldn't find a vacant disabled parking space.  I did find an empty Parents with Prams designated space though. \n\nI pulled in, opened the rear hatch of our van, lowered the wheelchair ramp and leaned in to undo the restraints.  Until I heard this bellowing from behind me.\n\n\"YOU SHOULDN'T BE PARKED THERE. YOU PEOPLE COMPLAIN WHEN WE PARK IN YOUR SPOTS. WHAT DO YOU THINK YOU'RE DOING. YOUR KID HASN'T GOT A PRAM. GO FIND A DISABLED SPOT.\"   There was more, but you get the idea.\n\nI was a bit shocked. I hadn't thought before I parked, how unfair it obviously was I had taken this space when my disabled son was in a wheelchair, not a pram.  so I fastened the restraints on the wheelchair again and closed the ramp and hatch. Mr. Social Justice stopped shouting and watched smugly.\n\nAs I reached in to the van, pulled out the stroller, placed my son it it and walked away.  Whilst Mr. Social Justice, his wife and small child, sat in their car and watched.",
        "created_utc": 1524386777,
        "upvote_ratio": ""
    },
    {
        "title": "Malicious compliance from a student",
        "author": "EZWINEZLIFE",
        "url": "https://i.redd.it/pe6jn9u73ft01.png",
        "text": "",
        "created_utc": 1524384153,
        "upvote_ratio": ""
    },
    {
        "title": "Hmm",
        "author": "pandubb420",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/8e1pl9/hmm/",
        "text": "[removed]",
        "created_utc": 1524380255,
        "upvote_ratio": ""
    },
    {
        "title": "They told us to stack the chairs",
        "author": "Xythren",
        "url": "https://i.redd.it/z3mimrboqet01.jpg",
        "text": "",
        "created_utc": 1524379941,
        "upvote_ratio": ""
    },
    {
        "title": "Enough Rice and ID.",
        "author": "Stoneheart7",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/8e1me6/enough_rice_and_id/",
        "text": "So I used to work at a Chipotle and honestly most of my customer interactions were fine, but I just found this sub so I figured I'd share two stories.  \n\nOne day in the middle of the lunch rush, going from customer to customer, I got an order and started making it. I scooped in the normal amount of rice, and began to hand it off to the next worker when the customer snarkily asked \"Um, does that look like enough rice to you? \"\n\nNow, rice wasn't a big deal, if you wanted more rice just ask. There's not even a surcharge. But she was so rude about it, that I just thought about what she asked me. She did not ask for more rice, she asked \"Does that look like enough rice to you? \"\n\nSo I looked at it said \"Yep\" and asked the next customer for his order. The manager saw the whole thing, and was trying to hold back his laughter when he pulled me from line because there had, shockingly been a complaint. \n\nThe second story I have is from management. They had informed me that I have to request ID for every alcohol purchase, no matter how old the customer appears, or if they are regular. \n\nThe next day I was on cash happened to be the day that a nearby retirement home decided to have a little field trip and stopped for lunch in our store, during the lunch rush. \n\nI think I was 10 senior citizens in when they asked me to stop. ",
        "created_utc": 1524378812,
        "upvote_ratio": ""
    },
    {
        "title": "I guess this counts?",
        "author": "tylerr147",
        "url": "https://www.reddit.com/r/BoJackHorseman/comments/8dxqhj/just_got_my_shirt/?utm_source=reddit-android",
        "text": "",
        "created_utc": 1524359984,
        "upvote_ratio": ""
    },
    {
        "title": "This is the only way to make receiving money annoying",
        "author": "Tashbabash",
        "url": "https://i.redd.it/zoac6s84ebt01.jpg",
        "text": "",
        "created_utc": 1524348700,
        "upvote_ratio": ""
    },
    {
        "title": "Not sure if this fits but I think its pretty good",
        "author": "[deleted]",
        "url": "https://i.redd.it/zoac6s84ebt01.jpg",
        "text": "[deleted]",
        "created_utc": 1524348164,
        "upvote_ratio": ""
    },
    {
        "title": "Way to rub it in!",
        "author": "zripcordz",
        "url": "https://www.reddit.com/r/funny/comments/8dy1f5/stay_petty_my_friends/?utm_source=reddit-android",
        "text": "",
        "created_utc": 1524347558,
        "upvote_ratio": ""
    },
    {
        "title": "Wear something sexier",
        "author": "Bistrooka",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/8dyqjz/wear_something_sexier/",
        "text": "This actually recently happened to my cousin who works in a betting window (it's also a place with those betting machines, roulette.., but not a typical casino). \n\nSo, she's been working there for almost a year and there are 6 of employees: 5 girls and one guy. Everything was okay until a new manager came 2 months ago. He presented them this plan about making players happier and make them bet more.\n\nHe asked of them to dress sexier, to show more skin (they already had uniforms and he asked them to wear smaller numbers so more skin would show), to flirt with guys... (You get the point). And he also said two girls should drop a few pounds if they wanna keep working there and if any other girl gains weight they'll pay fines.\n\nAs you can guess, employees hated the idea. This isn't a fancy 'casino' and a lot of trash comes there so it's a rough job to do. Being dressed like that would be really humiliating but it's hard to find a job so they started respecting the rule.\n\nEvery one of them. Even the guy. He showed up wearing really, really, really short shorts and tight V shirt with a clevage. This was a tall, strong and hairy guy dressed 'sexy'. He gave his best to 'flirt' with players too. It was hilarious.  \n\nManager was furious when he saw him. And I mean furious: he was screaming at them at the end of the day, called them names and tmr day no one of employees showed up at work.\n\nDunno what happened with manager but my cousin starts working at a new job next month and the tall, hairy guy got a job in a restaurant.\n\n*Update*\n\nWow. I definitely didn't expect this to explode so I'd like to explain a few stuff. I apologise for grammar mistakes and English isn't my first language.\n\nI'm from East Europe and that kind of attitude towards employees isn't legal but laws simply aren't respected. Suing that guy would do absolutely nothing but problems for employees since they'd have hard time finding another job because they sued previous employer.\n\nThank you guys, this was a bit weird but great experience :) ",
        "created_utc": 1524345902,
        "upvote_ratio": ""
    },
    {
        "title": ":(",
        "author": "imharmless",
        "url": "https://i.redd.it/3g0v0vxfuat01.jpg",
        "text": "",
        "created_utc": 1524332774,
        "upvote_ratio": ""
    },
    {
        "title": "Well, I guess they got their discount",
        "author": "dlgeek",
        "url": "http://i.imgur.com/HKB20gw.jpg?",
        "text": "",
        "created_utc": 1524329475,
        "upvote_ratio": ""
    },
    {
        "title": "[META] To the people who are only on here to get mad at the people who post these stories, why are you even here?",
        "author": "Srelathon",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/8dwiyx/meta_to_the_people_who_are_only_on_here_to_get/",
        "text": "[removed]",
        "created_utc": 1524325477,
        "upvote_ratio": ""
    },
    {
        "title": "Malicious compliance at its best!",
        "author": "Me-Myself-and-PIE",
        "url": "https://i.redd.it/956d38j527t01.jpg",
        "text": "",
        "created_utc": 1524320599,
        "upvote_ratio": ""
    },
    {
        "title": "The pothole is under 50mm deep. No need for repairs.",
        "author": "COMPUTER1313",
        "url": "https://imgur.com/gallery/CD4mSMT",
        "text": "",
        "created_utc": 1524319961,
        "upvote_ratio": ""
    },
    {
        "title": "“Could I get a bacon and egg roll with cheese?”",
        "author": "[deleted]",
        "url": "https://i.redd.it/ass6w7w2s5t01.jpg",
        "text": "[deleted]",
        "created_utc": 1524278639,
        "upvote_ratio": ""
    },
    {
        "title": "I asked for a timer for 10 minutes labeled \"food is ready\", got a timer for 10 labeled \"minutes food is ready\"",
        "author": "[deleted]",
        "url": "https://cdn.discordapp.com/attachments/431189130526064642/437054522893008918/Screenshot_20180420-195758.png",
        "text": "[deleted]",
        "created_utc": 1524272598,
        "upvote_ratio": ""
    }
]