[
    {
        "title": "Teen asks to go to bathroom. Told no by Teacher. Cue Malicious Compliance.",
        "author": "OfficialEragwyn",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/10uw5ph/teen_asks_to_go_to_bathroom_told_no_by_teacher/",
        "text": "At the time I (15F, now 40) was in high school, and was good friends with a guy (Tim 15M) who had a severe bladder issue (damage from surgeries from being hit by a car the year prior). Everyone in our Year 10 class was aware of it (with no hate either, it was just a thing Tim lived with after his accident).\n\nWe had a relief teacher in this one class after lunch break. Tim asked to go to the bathroom, which wasn't unusual as all the teachers were made aware of his condition, and this class was right next to the bathroom block on that floor. \n\nRelief teacher denied him, even when he said he had a medical issue and was backed up by several other students. We were all told to sit down and be quiet, and not to be disrespectful of the lesson he was trying to teach.\n\nI think it was a power play on the teachers part, but he again refused Tim 5 minutes later when he approached the desk politely and asked to go again. Relief told him loudly to get back to his chair, sit down and under *no circumstances* would he be allowed to leave \"his\" classroom for the bathroom, and that Tim should have gone at lunch. Anyone who protested on Tims behalf was given detention.\n\nSo, cue the malicious compliance.\nTim went back to his chair and sat down. He wasn't embarrassed, just angry, but he apologised quietly to those closest him, and then sat there with a grin on his face and wet himself. The teachers attention was drawn by muffled laughter and the sound of bodily fluids hitting the floor.\n\nHe was horrified and called him disgusting and told him to get out of his classroom immediately. Tim replied by saying he had just told him that under no circumstances should he be allowed to leave, so the Principal (Headmaster) was called in. When he arrived and saw the scene, boy, was he furious.\n\nThe shocked look on the relief teachers face when the Principal ordered the relief leave the classroom was so satisfying, especially when the Principal immediately and profusely apologised to Tim.\nHe dismissed the class early, and personally helped Tim down to the nurses station so he could wash and change. \nWe never saw that relief again, and Tim became a legend that day.",
        "created_utc": 1675653476,
        "upvote_ratio": 1.0
    },
    {
        "title": "\"Fix it!\"",
        "author": "Ancient_Educator_76",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/10uusg3/fix_it/",
        "text": "More grading issues from the land of nod. \n\nI say this as I stand sleeping at my stand-a-desk in my (and many other peoples') classroom at your local community college. I gave a test a couple of weeks ago, which resulted in the post you'll see on my home page. This is about the very next test, which I turned back to the students this evening. My error in grading caused a domino effect that, yet again, ended in some pretty decent MC. \n\nAs I passed the tests back, my college-age students (varying in age from early twenties to mid forties), some of the students who are either friends or acquaintances start comparing notes on the test scores. I encourage this sort of comparative thought, especially on Math test. As I finished up passing things out two students came up to me with the snark and attitude of a middle schooler or someone complaining about getting the wrong order and trying to look all cute about it: \n\n\"Um yeah you grader *her* paper and she got question 7 right, but you graded *MINE* wrong and I got the same answer as her...\" \n\nI looked at them, and thought I'd give them a shot to not push the issue by saying \"Hmmm, will you look at THAT... maybe you should both take a look at that problem again...\"\n\nIt was at this point that I looked and realized that they BOTH got the answer wrong, and that I missed marking it on one of the tests. I remember going through it and seeing it was wrong, and actually swore that I marked it wrong... but I guess not... \n\nThey took it back to their seats for a second, pretended to look at it and came back as I was about to hit the podium \n\n\"Yeah, it's wrong...you did it wrong... it's wrong!  You're not *PERFECT, op...* you need to FIX IT!\"\n\nThis time I really, really tried to give the students a chance. They didn't pick up what I was putting down. So, I have little choice ...okay I do, l but it's still time for... \n\nMalicious Compliance\n\nI took both tests back while making eye contact with one, then the other... and slowly returned to my standing desk and opened my laptop. I took both tests and looked at them to make sure I had it right (I had). I changed the person whose score was correct by marking it wrong, entering it in the gradebook, and handing it back. \n\n\"It looks like you both missed that question, I must have overlooked it. My bad. Looks like it was *Wrong* after all.\" \n\nTLDR-  Was told by someone half my age that I need to see the error of my ways, and change the grades to keep them equitable. I did.",
        "created_utc": 1675649538,
        "upvote_ratio": 1.0
    },
    {
        "title": "TENSION ABOUT FRUIT OF YOUR EFFORTS",
        "author": "unityofreligions",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/10uumkf/tension_about_fruit_of_your_efforts/",
        "text": "[removed]",
        "created_utc": 1675649089,
        "upvote_ratio": 1.0
    },
    {
        "title": "No personal mobile phones at work!",
        "author": "MrWacko",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/10usu2i/no_personal_mobile_phones_at_work/",
        "text": "Long time lurker. Recently managed to inflict my own little bit of malicious compliance. Enjoy!\n\nI (33M) work in IT Cybersecurity, and my work has been on a big multi-factor authentication (the SMS codes from your phone or authenticator apps type thing) push to better secure our systems. As a result, basically every system or software requires a phone to access. Like many other places, my work does not supply phones to its workers unless they are sufficiently far up the leadership chain.\n\nFriday, my boss sends one of those directives that manglement bosses always do, to try and be \"commanding.\" He tells me that personal device use at work is not permitted, and *specifically* cites mobile phones as an example.\n\nQue malicious compliance.\n\nTo comply with the directive, I uninstall all the MFA code applications on my phone that are needed by work, and submit tickets for getting the desktop versions. IT Fulfillment's response? \"Uhhhhh... What desktop version?\" Boss is backpedaling, but it wouldn't matter at this point, as the tokens for the MFA apps are gone.\n\nFor extra irony, Boss rushes approvals for software installs, but gets stuck in the new software approval process he created.\n\nEnd result? I spend Friday browsing the Internet while he runs around rushing software approvals for the MFA desktop apps we need.\n\nTLDR: Boss says not to use personal phones at work. I stop using personal phones at work and can no longer access systems.",
        "created_utc": 1675644301,
        "upvote_ratio": 1.0
    },
    {
        "title": "Request an innocent sounding song? Sure, i can do that!",
        "author": "AMGamer94",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/10unmit/request_an_innocent_sounding_song_sure_i_can_do/",
        "text": "[removed]",
        "created_utc": 1675631429,
        "upvote_ratio": 1.0
    },
    {
        "title": "You want me to deliver on time? I’m not going to keep doing other people’s jobs for them, then.",
        "author": "1836492746",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/10umf7n/you_want_me_to_deliver_on_time_im_not_going_to/",
        "text": "First time posting here but I randomly remembered this small bit of malicious compliance from my teen years. \n\nEvery morning for about 4 years I’d wake up at 7am to deliver papers around my neighbourhood. Sleep schedule was PERFECTLY TIMED so everything ran smoothly. Then the shop I worked for got new owners. They would slowly start adding papers to my round but didn’t pay me any extra. They were *weird* additions too — like clumps of 3 or 4 houses 10 streets away. I eventually found out that every time a kid quit their street, the owner split up their round and tagged it onto other people’s rounds. Instead of getting new workers. Before long, the amount of papers I had to deliver had doubled. \n\nI had to wake up earlier and earlier to take on this extra amount. Every week I would be surprised with extra papers so I wasn’t used to this and delivered late frequently. I also slept through my alarms from my sleep schedule being messed up. Customers started complaining to my boss. Every week I got more texts “deliver on time or we’re giving your round to someone else” \n\nI bit my tongue for a while. I waited *patiently*. Then finally it happened again. Delivery sheet said I had 10 new papers. All for streets miles apart. It would have added an hour onto my round. Perfect. \n\nWhat did I do? I left them on my curb. Waited for that angry text from my boss. “Blah blah hasn’t gotten their paper” Messaged my boss “You wanted me to deliver on time and I have. I think you made a mistake because these aren’t my papers so I left them on the curb for you to pick up”. She eventually turned up and had to deliver them herself 6 hours late. The next morning, the extra papers were gone. Probably tagged onto some other poor teen’s round but from then onwards she never messed with me again. \n\nTLDR boss gave me increasing workload and got mad when I couldn’t deliver on time. Next time she increased, I pretended she’d made a mistake in order to comply with her wishes.",
        "created_utc": 1675628599,
        "upvote_ratio": 1.0
    },
    {
        "title": "Are you curious about the shocking truth behind human trafficking scandals? Want to know how this illegal trade operates and the measures that can be taken to prevent it? #OC",
        "author": "mohamedemam85",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/10uk4h7/are_you_curious_about_the_shocking_truth_behind/",
        "text": "[removed]",
        "created_utc": 1675623131,
        "upvote_ratio": 1.0
    },
    {
        "title": "\"He always gets to do the easy job! I want it!\" No wuckas mate",
        "author": "Dertyhairy",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/10u7xem/he_always_gets_to_do_the_easy_job_i_want_it_no/",
        "text": "I worked at a furniture delivery place a couple years back. I did a 420km trip to a truck stop and waited to swap trucks with another driver then made the same trip back. Give or take 850 each way. I did this Mondays and Tuesdays with the occasional Wednesday. One of the boys get's annoyed and speaks up saying \"Why does he get the easy job? All he does is drive. I want to have a turn!\"\n\nI told him go for your life. What he didn't realise is there is literally nothing to do other than pull over for a 5-10 minute break and your lunch. You can't cruise like if you were an offsider (Most crews had 2-3, one being a designated driver and the others being labour. You'd chill in the cab, sometimes have a nap and wait till the next location and maybe move 3 items max per job and build a couple). It was a total of 8-10 hours driving.\n\nI've always loved long drives. I love long airplane trips and stays in hospital. I'm just weird. I chuck on my music and go about it. I don't NEED to interact with people.\n\nHe lasted one round trip. The moment he got back to the yard he said \"This is bullshit. You can have it back\" but I said \"Nah, I like this more. You told them you wanted the run, you can have it\"\n\nHe took me out for a night on the piss and I got the run back lol",
        "created_utc": 1675586426,
        "upvote_ratio": 1.0
    },
    {
        "title": "Let’s have some fun finally",
        "author": "Twinkletoeme",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/10u4bkq/lets_have_some_fun_finally/",
        "text": "[removed]",
        "created_utc": 1675575205,
        "upvote_ratio": 1.0
    },
    {
        "title": "Need a car?",
        "author": "MC_Throwaway999",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/10twb11/need_a_car/",
        "text": "Throwaway for obvious reasons....\n\n\nBackground:\n\nI'm a police officer in a large city in the south of England.\n\nIn the police there are 4 levels of driving, for ease I'll call these 1, 2, 3 &amp; 4. \n\n4 being the lowest level (normal driving) and 1 being the highest (high performance cars, blue lights). All levels of drivers can drive any police vehicle.\n\nCast:\n\nMe - Me, a PC of 18 months service at the time of this story. Level 4 driver.\n\nTom - A PC called Tom, who was (and probably still is) a dick. A newly qualified level 2 driver with 3 years service at the time.\n\nSgt - A Sgt on my team\n\nThe Story:\n\nA few years ago I was on a response team (answering 999 calls). The general rules on vehicle allocations is first come first served, however if there are NO vehicles available then lower level drivers have to give up their vehicle to higher qualified drivers - simple!\n\nOn this faithful day several years ago the high powered vehicle was away for a service, and in its place an old shitty Vauxhall Astra Estate so we weren't short of a car. Also on the fleet was a brand new (less than 1000 miles) Ford Focus Estate.\n\nNow I was the first out of the briefing room and into the yard, so I made a beeline for the brand new motor and whipped the keys out of the ignition! Tom also made a dart for the vehicle, realising I got the keys he clapped his hands together and gestured for me to throw him the keys. Nope, no chance. What a dick.\n\nHe started to complain that he's the higher qualified driver and so needs the car. My response? The shitty Astra's still available. Off I went to check my emails before heading out.\n\nAs I'm logging on, a private call on my radio. It's the Sgt.\n\nSgt: \"Tom says there's no cars and you won't give him your car\"\n\nMe: \"I'll pop into the office\"\n\nOff I went to the office and explained how Tom was a dick, and was being a dick and that there is a car available - the shitty Astra which he just doesn't want.\n\nSgt: \"Make sure Tom's got a car, as long as it's got 4 wheels it'll do\"\n\nMe: \"No Worries\" \n\nI think you can see where this is heading....\n\n\nOff I go into the yard and collect the keys to the shitty Astra.\n\nMe: \"Tom, Sgt said to make sure you've got a car, here you go\" I give him the keys to the Astra.\n\nTom: Big shit eating grin\n\n\nUnfortunately I didn't get to see the outcome, but I'm reliably informed that when Tom got out to the yard and hit unlock on the fob he went ballistic! Calling me all the names under the sun and refusing to use the car for the whole shift. He wouldn't drive it any further than the next nearest station to pick up a different car.\n\nHe didn't challenge me on vehicle allocations again, and generally stayed out my way until he left a few months later👌",
        "created_utc": 1675557715,
        "upvote_ratio": 1.0
    },
    {
        "title": "Okay, if you insist ...",
        "author": "realSailorJim",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/10ts3hm/okay_if_you_insist/",
        "text": "Just a stupid little story from my military days.\n\nI was on liberty in San Francisco, just walking around the city in a fairly nice set of duds.  A blue button-down, tan slacks, and comfortable shoes (not sneakers).  I'd stopped at a good place for lunch, kind of upper crust but still affordable (even on a sailor's salary, provided one didn't make a habit of it).  A good selection of seafood and a great salad bar.\n\nThey also had valet parking for those who desired it ... which brings us to the point.\n\nI was walking out, trying to make up my mind about what to do next.  I could cable car to the wharf or take the bus back to base, but neither really appealed to me.  What I really wanted to do was head over to the North Shore and catch a movie, but I didn't have the funds for the necessary taxi rides to do so and there wasn't any time to catch a cross-town before the movies started.\n\nThen a brand new Lincoln Continental pulled up.  An overdressed woman got out and tossed me a set of keys, saying \"I'm meeting somebody for lunch, so park it somewhere close because I don't know when I'll need it.\"\n\nI looked at the keys and said, \"Um ... I'm sorry, but I'm not ...\"\n\nShe interrupted me with \"I don't care where you park it, so don't worry.\"\n\nI tried three more times to get it through to her that I wasn't the valet or anything, but she kept shutting me down, progressively getting ruder and ruder.\n\nSo ... okay.  I got behind the wheel and drove to the movies.  I found a nice garage, one where they parked the car, and handed them the keys.  That was the night I saw Star Wars, so it worked out pretty good.",
        "created_utc": 1675546806,
        "upvote_ratio": 1.0
    },
    {
        "title": "If you must know...",
        "author": "LT08",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/10tkshm/if_you_must_know/",
        "text": "SO and I were talking about my old boss and what a delight s/ she was, and I recalled something that happened that was perfect to share here. \n\nAlso not sure if needed, but\n\nContent Warning: bodily functions\n\n\nSome backstory, my boss, we'll call Mrs. Scott, kept the room we worked in about 5-10 degrees too warm to save money on cooling costs. Now I'll admit that I run hot and it was more irritating to me, but other coworkers had complained so there was that. Also I was on my feet walking around for most of the day. \n\nThese factors, along with my thick thighs, led to a few painful skin problems, namely 2 boils on said thighs that got really swollen over a weekend.\n\nSunday night I go into an urgent care for some relief from the terrible pain and they end up lancing the boils. Felt so much better after but I knew I would need at least a day or two to take care of the new wounds before going in to work, so I texted Mrs. Scott. I even attached a picture of the work note the Dr. gave me for good measure (that backfired splendidly though because the timestamp was 4 hours off and I should have told her sooner?!?!)\n\nAnyway it was the usual lecture, \"we don't have enough people for you to just call out whenever...blah blah blah.\"  \n\"I totally understand I know I'm needed but Dr's orders.\"\nAfter that back and forth we come to an agreement that I'd be back in two days. \n\nOk, good, texting with her was done I could relax and focus on getting better.\n\nBut no, one more text from her...\n\n\"I know you don't have to tell me but why where you in the ER?\"\n\nSO got so pissed at that text and reminded me she has no right to that information, but I knew something about her; she is so squeamish at everything there is to possibly be squeamish about, and I had a plan.😈\n\nI happily let her know in graphic and colorful detail why I went to the ER, and made a small dig about how the temperature of my daily environment might have some effect on this reoccurring. \n\n\n\n\"I wish I never asked.\"\n\n\n\nDamn right.\n\nOh, and the thermostat got turned down a few degrees when I got back in. 🤣\n\n\nTl;dr: boss asked about protected medical info, and got more information then she ever wanted",
        "created_utc": 1675528962,
        "upvote_ratio": 1.0
    },
    {
        "title": "Bully boss closed my laptop for taking minutes of meeting",
        "author": "vijaysrinivasan1",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/10tkhje/bully_boss_closed_my_laptop_for_taking_minutes_of/",
        "text": "[removed]",
        "created_utc": 1675528202,
        "upvote_ratio": 1.0
    },
    {
        "title": "You don’t want a combo? So be it",
        "author": "auburn2eugene",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/10tjujr/you_dont_want_a_combo_so_be_it/",
        "text": "I work at a national fast food chain. There is a certain Sega video game franchise with the same name. \n\nAnyway people all the time want to tell me they want a number 3 for example. A “number 3” comes with a side and a drink. So while taking their order when I ask what drink they want about half the time people will say I don’t want a drink which makes me have to delete everything and put the order back in with all their edits to the burger then put the side back in. The kitchen is watching the screens and it throws them off when I have to delete everything and start over. So anyway the people will continue with their order and order a number of things that can be made into combos to save significant amounts of money. But nope. Once you yell at me and say you don’t want the combos you aren’t getting the combos. \n\nNever mind if I hit this one little button it will combine everything into a combo at the cheapest price for you… no… you want to take your frustrations out on me? Cool story bro. I’ll just not hit the combo button and save you that money. \n\nI legitimately could have saved a customer over $20 yesterday by combining his order into combos. But yell at me again Skippy… let’s see how it works out for ya. \n\nAfter a lifetime working as a fast food manager, for the life of me, I cannot understand why people want to be rude to the people making your food.",
        "created_utc": 1675526584,
        "upvote_ratio": 1.0
    },
    {
        "title": "You have to use your vacation days",
        "author": "PandorasPenguin",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/10th9bx/you_have_to_use_your_vacation_days/",
        "text": "First time poster in this sub (but long-time lurker), so if I've done something wrong, please let me know. English not my first language, etc, etc. In fact, for context, this takes place in The Netherlands, which has a very different working culture and legislation than the US.\n\nRecently I got a message from HR that I still had a lot of holiday hours open, many of which would lapse as of July first, as a matter of law. I was aware of this, but in the past I was always able to sell them for money. In the COVID years I've hardly been away for mostly obvious reasons, and I'm getting 32 days per annum. \n\nIn other words, my vacation days had piled up and my current balance was a grand total of 390 hours, and that's excluding the new 32 days from 2023.. So, that's almost 10 weeks of holidays. Of these, I had to finish roughly 200 hours, or 5 weeks before July 1. Possible of course, but hardly ideal. Not for my employer, our customer, or for myself. Which is why I thought it wouldn't be a problem to \"sell\" these hours for extra salary, as I had done before. \n\nBut I was quite wrong.. HR told me to contact my manager, who denied my request. I explained to him exactly how many days I had still open. He'd ask the CEO but the CEO sent me a message about how they care about work-life balance and mental health etc. \n\nFor the record, I fully agree with this stance in principle, and frankly, I think the measly amount of holidays people in the US get is shameful. And the culture in which it's sort of \"not done\" to actually  take your holidays, I find outright toxic. I'm glad I'm working in a country and for an employer where this situation is much better.\n\nBut on the other hand, one has to be practical. Covid was inflicted upon us all, and you can't compensate for a lack of holidays taken in the past, with taking copious amounts of holidays now or in the near future. I love to travel and to socialise, but I/we couldn't go anywhere or do much, and I didn't see the point in taking holidays just to sit home more. In fact, my work provided me with some much needed structure during the lockdown times. And working from home meant that work was actually much more stress-free than it was in the office. \n\nSo anyway, I brought up my situation and my reasoning but it was still denied. I was just told it's good to take off some days, and to go on holiday, and so on. Again, I'm not opposed to this at all, but the scale of the \"problem\" seemed to have just escaped the manager and the CEO. I had and have already planned on traveling for 2 weeks (to Sicily and Greece, if anyone's interested, maybe also mainland Italy again), but after that I'd still have 3 weeks which I'd need to finish.. I also have a long weekend planned to Iceland, but that only takes several paid holidays because of the weekend in the middle.\n\nIt is then that I decided to start complying maliciously. Instead of trying to argue the point again with my CEO, I planned a meeting with my line manager and the account manager of the customer I am working for. I told them I wanted/needed to take every Friday off basically until July or my days would lapse. I didn't ask for permission because whilst paying out holidays is voluntarily, they need a very good excuse to deny leave requests (such as denying requests for key figures last minute when you're in the middle of a big project with deadlines etc), but my request wasn't one of those, and obviously they're not allowed to deny a payout AND my leave request anyway. It'd be super hypocritical too. \n\nSo as a good and diligent employee, I wanted to make sure that our customer was aware of my sustained de facto reduction in capacity and wanted to discuss how we could best bring up this potentially touchy subject with them. After all, this structural reduction of capacity is different from a normal 2 week vacation or just some days off here and there, which is a pretty normal situation here, even for contractors. Since they're a key account and I'm working for them as a senior DevOps/Cloud Engineer, I had anticipated to have a slightly awkward meeting with my manager and the account manager discussing the details, after which I already half expected they'd U-turn at some point and decide to pay out my vacation days after all. \n\nBut they exceeded expectations because when I entered the meeting, not a word was spoken about my 2 denied requests for converting my holidays, or about the framing I had given this meeting about how and who wanted the honour of telling the big customer they'd be losing 20% of my capacity (and my employer would get to charge 20% less). Instead, the account manager just asked for how many days I still had open, which we were easily able to see in the system. He then proposed to just pay out all my open holidays from 2022 and before (so 10 weeks instead of the requested 5), so the \"backlog\" would be cleared and this situation wouldn't occur again. Happy days, I have already received 2,5 months extra in salary and I still have all my 32 days from this year, so I have more than enough days for my holidays and for general R&amp;R, so my work-life balance is really not in danger.",
        "created_utc": 1675519806,
        "upvote_ratio": 1.0
    },
    {
        "title": "Spoke up in a DEI meeting. I am not doing that again.",
        "author": "sabazurc",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/10tgfc4/spoke_up_in_a_dei_meeting_i_am_not_doing_that/",
        "text": " \n\nI  work at a job. I like my job. I  like my coworkers. I have to attend DEI  meetings. I don't like these meetings. We were discussing patterns of white supremacy like having deadlines or expecting high standards, or individualism. My stupid ass thought I should share my opinion about how expecting people to be on time and do a good job is not white supremacy. That went sour fast.\n\nDid I mention I would like to keep my job?\n\nLong story short, I had to talk to three levels of superiors. They assured me this is a safe space to share my opinions. Really?! Then why am I in your office for sharing my opinion?\n\nWhat   I am trying to say is, I said the truth as I see it, and I nearly lost my job. I am taking a break from speaking my mind on this subject.  Those who can afford to speak up should keep doing so, I can't.\n\n&amp;#x200B;\n\nNotmystory",
        "created_utc": 1675517337,
        "upvote_ratio": 1.0
    },
    {
        "title": "Spoke up in a DEI meeting. I am not doing that again.",
        "author": "sabazurc",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/10tge86/spoke_up_in_a_dei_meeting_i_am_not_doing_that/",
        "text": "[removed]",
        "created_utc": 1675517248,
        "upvote_ratio": 1.0
    },
    {
        "title": "Schedule me for more than you needed . Pay me for more than you needed.",
        "author": "AccomplishedLaw49",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/10t7497/schedule_me_for_more_than_you_needed_pay_me_for/",
        "text": "Let me start off with saying I work in a hospital. Dealing with patients meals and such. The shifts are 12 hours. 6am-6pm every day even though it is extremely easy to get your work all done no later than 5-5:30 and is almost impossible to still have work left until 6 pm unless you were really dragging your feet all day.\n\nI am PRN staff, or per shift needed. Meaning I’m on call all the time for when people are sick or something comes up. So I work a lot of half days, coming in at lunch to finish the last of someone’s shift. And it’s even easier to finish all your work earlier then because the majority of our days work happens before our lunch break. \nSo hey, easy money all day every day.\nBut recently my manager started messing with the schedule in weird ways. She started scheduling me to come in at 2, 3, and even 4 pm and leaving at 6:15, or 7:30 that night.\nNow because of our shifts and the times the food is served I know good and well I wouldn’t have any work at all to do if I came in at those times. As dinner is being served at 3, and if I came in at 2 the person I’d replace would be responsible for majority of dinners workload. \nBut I didn’t question it.\nWe got paid the other day so I go to the online portal to check my direct deposit. Only to see it being flagged for clocking out early multiple days. On those days I’d had permission from management to leave because I wasn’t needed anymore. And apparently management hadn’t signed off on my early leave. So I got flagged and had point deducted from my department lead. (If we get enough points we get write ups and fired) \nHere comes the malicious compliance.\n\nSo the other day I come in at 3 like I was scheduled. To see there was obviously no work for me to do. Everyone questioned why I was even there. \nI sat around for 4 hours doing nothing. Playing on my phone, eating, cracking jokes with coworkers, and just chilling. Only to get angry calls from management about how I need to leave if I’m not working, asking why I’d shown up if I knew I wouldn’t have work, telling me I need to do the late persons work since I was there. (The late person is a set scheduled person from the department that is scheduled to stay an extra hour after every other person just in case a nurse or patient needs something. And I was not the scheduled late person.) \nThey got mad when I said I wouldn’t do it because I wasn’t clocked in as a late person, and the late person was still there working, that I was scheduled to work from 3-7pm and I would stay from 3-7 pm on the clock even though I had no work and nothing to do.\nShe threatened to write me up. For following the department lead’s directions to not leave earlier than scheduled? \nLong story short, the department lead told her she couldn’t do anything because I was following his own rules. That she should be more careful when making a schedule and only schedule the labor she needs. And to top it all off told her that she cant even change the current schedule because the entire month of February has already been posted. So basically, I get an entire month of half days where I know I will have no work to do and they will be completely overstaffed. Days they’ll have to pay me to sit in the office on my phone.",
        "created_utc": 1675492353,
        "upvote_ratio": 1.0
    },
    {
        "title": "Hoping for help with some malicious compliance please!",
        "author": "rachface13",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/10svmuh/hoping_for_help_with_some_malicious_compliance/",
        "text": "[removed]",
        "created_utc": 1675459254,
        "upvote_ratio": 1.0
    },
    {
        "title": "New York City Transit Police real fear",
        "author": "Acrobatic-Nerve2233",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/10st7bz/new_york_city_transit_police_real_fear/",
        "text": "[removed]",
        "created_utc": 1675453363,
        "upvote_ratio": 1.0
    },
    {
        "title": "Boost your reddit",
        "author": "Benediction-Ad-3573",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/10spdbx/boost_your_reddit/",
        "text": "[removed]",
        "created_utc": 1675443906,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can you accept my invitation so that I can get a free item?🎁 https://temu.com/s/RwJkwxyzTaGi2",
        "author": "Turbulent-Layer-2476",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/10sp3rc/can_you_accept_my_invitation_so_that_i_can_get_a/",
        "text": "[removed]",
        "created_utc": 1675443282,
        "upvote_ratio": 1.0
    },
    {
        "title": "\"You shouldn't do that when someone else is in thr room.\" Ok then...",
        "author": "CarltheWellEndowed",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/10skivz/you_shouldnt_do_that_when_someone_else_is_in_thr/",
        "text": "Back in high school, I used to help my dad out around the Church that he was the head pastor of. \n\nWe happened to be in the restroom at the same time, and I let rip an extremely loud, and rancid fart. \n\nHe looked at me and said, \"Carl, you really shouldn't do that when someone else is in the room.\"\n\nI was a little shocked, because the restroom is obviously the best place to do it. \n\nBut I knew what to do. \n\nI waited for him to leave his office to pick up something from the printer, ran in, and let another one rip. \n\nHe walked in and just stared at me, so I said \"What, you said not to do it when someone else was in the room.\".\n\nThankfully he thought what I did was funny, but he did decide to work at the conference table instead of his office for the next little while.",
        "created_utc": 1675431532,
        "upvote_ratio": 1.0
    },
    {
        "title": "Stolen reservation calendar",
        "author": "Western-Search3310",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/10sjgfp/stolen_reservation_calendar/",
        "text": "I was hired at 16 to be a hostess in a very popular steak house. My manager was terrible, he was very nice to the customers but super disrespectful to the staff. \nHe didn't pay us all our hours, he often hired 2 waiters in the same shift and made them compete to know who he was going to keep, made sexual and degrading remarks in front of everyone etc. \nMy boss and the two assistant managers would often meet in the lobby of the restaurant in front of me to discuss who they were going to fire that night. \n\nAnyway, I ended up getting fired too. The reasons given were ridiculous. When I left, I stole the whole paper reservation calendar while no one was looking. There was no back up. \n\nI was afraid for a moment that my crazy boss would come and ring my doorbell to get it back but it never happened. He must have never made the connection. \n\nSorry for my mistakes, English is not my first language.",
        "created_utc": 1675428286,
        "upvote_ratio": 1.0
    },
    {
        "title": "Want my section because I make more money. Go ahead I will still make more than you.",
        "author": "iwasthechubbylady",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/10sh0m0/want_my_section_because_i_make_more_money_go/",
        "text": "This all happened about 18 years ago. I was a waitress for a Village Inn. I worked the morning shift because it had the most business. Now this is back when smoking was still allowed in restaurants and we had a smoking section and a non smoking section. Our seating chart was designed for this in mind and never changed even after the restaurant went full non smoking. Now on Sunday we had your wonderful church rush that would pack the entire place for hours. So Sunday was totally non smoking until 3pm.\n\nOn the weekends we would have about 8 servers. This ment that smoking side had 2 while the other side had 6. So if you worked the smoking side you had 10 tables to take care of while the other servers had 4. Management knew I was good at what I did and would always put me in the biggest section on Sunday and I could take care of all 10 of the tables no problem. Now servers always talk about their tips and without fail I always made more than anyone else. This caused anger from some of the newer servers and they said it was because I always got the better section.\n\nManagement came to me and told me what was going on that's when we decided on malicious compliance. Ok you can have my section next Sunday I will take this small section. But since I am on the other side of the restaurant I will not be able to help you much. I then got to enjoy a less stressful Sunday did my job like normal turned my tables and made a ton of money. The other server was running around like crazy and not getting much done. At the end of the shift they learned that they made less than the week before because of how bad they were taking care of their tables and the church crowd are horrible if you aren't taking care of them right. \n\nIt was always great to hear the server say you can have your section back I don't want it ever again. Now this was not a 1 time thing this happened many times over the 5 years I worked there. Everytime it happened I still made more money. Everytime we would get a new server complain I just smiled and said go ahead take my section I could use a break.",
        "created_utc": 1675419545,
        "upvote_ratio": 1.0
    },
    {
        "title": "World Created by God as sacred as Him",
        "author": "unityofreligions",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/10sd8e6/world_created_by_god_as_sacred_as_him/",
        "text": "[removed]",
        "created_utc": 1675405448,
        "upvote_ratio": 1.0
    },
    {
        "title": "Starting my very own loan company with my last $2",
        "author": "Forward-Ant-4433",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/10sbvum/starting_my_very_own_loan_company_with_my_last_2/",
        "text": "Borrow my last $2 pay me back $4 whenever. When I receive the $4 I will keep $1 doubling the net amount indefinitely (lending out $3, $5, $9, infinity). This experiment will last as long as I eventually get paid back. Put your CashApp to be the first.",
        "created_utc": 1675401061,
        "upvote_ratio": 1.0
    },
    {
        "title": "Just Desserts",
        "author": "Divayth--Fyr",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/10s13tc/just_desserts/",
        "text": "For many years I worked at Pizza Hut.  Or, Schmeetza Schmut.  I don't know why people avoid the names.  Anyhow, I have a million stories, and while many are malicious, only a few contained much compliance.  At this time I was a dish dude/phone getter/whatever-needed-doing person.  \n\nI was persistently amused by how quickly even the most trivial amount of power could go to people's heads.  One waitress, who I will call Donna and then never use that name again in this whole story, was given some sort of title, like Grand Overlord of Wait Staff or something, which conferred upon her the power to do the same job as before but with more work.  She wasn't actual management, not that I would have cared much if she was.\n\nI showed up early every day, as was my habit, and one evening I was somewhere in the back wandering about, 20 minutes before my shift.  The phones were ringing, and being ignored by just about everyone as usual, so the Leading Team Lead of Leading Wait Staff, who was the Leader of the Waitering People, ordered me to answer it.  If she had asked, I would have done it, as I had a thousand times before, but this was a Decree from On High.\n\nI informed her that my shift didn't start for a while yet, but this detail failed to impress.  I said I would have to clock in before I could use the order taking computerizing thingy, and a manager would have to approve me doing that (they were oddly strict about that for a restaurant).  These audacious challenges to the orders of the newly minted Executive Vice President of People Who Carry Food To Tables endgendered some exasperation.  She said she was a manager and just do it.  I did not.\n\nSo she swiped her card into the magic order screen, and yelled politely to just fucking take the phone order.  Under her card, her name, off the clock.  OK.\n\nHumbled by my public defeat, I meekly picked up the phone and proceeded to thank the caller for choosing etc etc, and took the order.  As I did so, I added 7 Bigfoot pizzas with extra whatever, a dozen bottles of beer (for delivery), and a couple of dessert pizzas.  \n\nI told them their real total (before all the added nonsense) and the call ended.  The thing is, we had stopped selling Bigfoot pizzas a few years before, we hadn't carried dessert pizzas since the mid 15th century (but they were still in the system), and we did not deliver beer as doing so might be illegal.  \n\nThe cooks were confused, the actual managers were confused, and questions were being asked.  I assume so, anyhow, since I went outside for a smoke.  The Royal Duchess of Waitressing came storming out the back door a bit later, and said a bunch of words or something, then went back in.  As I learned later, after clocking in, she had to get the help of an actual manager to delete all that stuff and change the total, which messes up their numbers or something--I don't really know why but they sure didn't like deleting things.  And she had to tell them she had me use her swipey name thing to take the order because I was off the clock, and they really did not care for that at all. \n\nRight in front of the assistant manager, she threatened to write me up, which she did not have any authority to do.  \n\nNo customers were harmed in the making of this compliance, since they got the actual stuff they ordered, and there was no wastage since no one could make a Bigfoot or dessert pizza if they had wanted to.  Just a bit of extra paperwork and a very annoyed Wait Queen.",
        "created_utc": 1675372511,
        "upvote_ratio": 1.0
    },
    {
        "title": "A Beard's A Beard",
        "author": "MorsInvictaEst",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/10rytet/a_beards_a_beard/",
        "text": "[removed]",
        "created_utc": 1675367021,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is “Compliance”?",
        "author": "ShakesZX",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/10rymsz/what_is_compliance/",
        "text": "So I was reading this sub, as I am won’t to do during breaks, and I came across a rather interesting/funny story. I was so bemused that I decided to leave a comment commending the author on their work. However, once scrolled down, the first words to grate my eyes were the words “Not malicious. No compliance.”\n\nNow, this was the umpteenth of such comments on nearly as many posts, so it got me wondering: What does the majority of this sub consider “malicious” and “compliance?”\n\nThought in my brain, I then decided to ask said query of my internet brethren. On the way to write it all out, I chanced to stop by **Da Rules!!** to check whether it would be considered possible to do so. Much to my dismay, the first rule of r/MaliciousCompliance reads:\n&gt;All posts must be a story that must contain some form of malicious compliance. \n\nMy heart sank, but then a mischievous idea slithered from my unconscious. Why not make a story out of it to ask your question?\n\nAnd so, renewed in my glee, I hastened to the “create post” button and typed up what you have now read. And I dare those pedants to say I’m not complying with the rules against their spirit!",
        "created_utc": 1675366586,
        "upvote_ratio": 1.0
    },
    {
        "title": "\"You need to grade my test ACCURATELY! It's for a SCHOLARSHIP!!\" - Oh is it, now? Let the pettiness ensue.",
        "author": "Ancient_Educator_76",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/10ryb5f/you_need_to_grade_my_test_accurately_its_for_a/",
        "text": "Good morning, all! \n\nAs much as I'd like to start this off by saying things like \"Let me tell you a little bit about me\", or \"I'm so petty I performed at the Super Bowl Halftime Show in 2008\" and then go into a diatribe about just how petty I could be, this is far from the truth. Perhaps in some alternate petti-verse where over a dozen college students were playing the part of (and absolutely nailing) whiny middle school students complaining about course requirements... or if they happened to begin to repeatedly harass me by way of being on ingrate-demo-mode, or spinning the wheel-of-you-suck-at-teaching to come up with yet another complainsult wrapped in a thinly veiled \"question\" about me and how I run my course....perhaps *then* I'd let nature take it's \"course\" and let my pettiness bloom, like a flower transplanted from an artificial habitat to a campus-bordering field, in the form of Malicious Compliance. \n\nAnd wouldn't you know it? Somehow. Some way. Petty finds a way. \n\n&amp;#x200B;\n\nThat being said, I really try to be a positive, supportive, caring, empathetic, far-from-sardonic college instructor. My clientele, as referenced above, are mostly college-age students who enrolling in what is basically a Pre-Algebra course my community college likes to call \"College Math\". I have the occasional young whiz kid who enrolls in my course to be super advanced. But for the most part, young adults in their 20s and 30s are who I teach, and Solving Systems of Equations by Substitution is currently what I teach them. \n\nI have many students who struggle and require additional tutoring, and I'm always happy to oblige. There is this one student who I wish would show up to our makeshift tutoring group but never does.... let's call her \"Mara\". \n\nMara acts like she's the zhit. She seriously acts like we're back in high school, interrupt my demonstrations (miraculously, because I literally direct instruct for 3-5 minutes before I popcorn around the room and treat it like a very large standard tutoring session). \"Mr. OP, my Dad says this isn't the way to solve it...\", \"Mr. OP, why don't you teach at ASU? (our partnering major university we transfer students to) What did you do wrong that youre teaching at this place?\", the list goes on and on. For brevity's sake (ha) I'll make sure this story doesn't. \n\nWe have an exam that about half the class got a 90 or better on, followed by most of the rest getting B's, C's etc. I know that this community college, despite it's cheap cost, still has many students on full scholarship for one thing or another, whether it be sports, personal hardships, activities, etc. That being said, if I notice a student tanked the test I may just grade the thing on a curve to allow them to get the most points possible. This is what I chose to do for Mara, and she wound up with an 18/25 on her exam. I typed in the score, took a glance at her paper afterward and realized she actually missed yet another question, a major one, that would have brought her grade super super low. I decided to look the other way. Part laziness, part... being nice. Let's not say how much each part's worth, but they ain't equal. \n\nSo it's time to return the tests that I already had graded in the system when Mara starts up with her questions again. They are literally too tiresome to include. I will say her final piece, however: \"Mr. OP, I noticed that you gave me an 18/25 on my last test, could I take a look at the test and see what I got wrong? I definitely didn't miss that much.\" \n\nI tried to use inflection to let her know that she should probably just be happy with the 18, by saying \"Yeahhhhh I thiiiiink I'd be happy with the 18 there kiddo\" \n\nThen she suddenly dropped a petty pebble at the top of a snowy hill...\n\nShe continues.... this time standing, walking toward me, and pointing her Cruella DeVille finger at me, saying\n\n\"NO! You can't just put WHATEVER you want for my grade, 18 out of 25 is not even possible!! I need to keep my GPA high because of all my scholarships!! You need to grade my test ACCURATELY!\"\n\nEnter PettyLicious Compliance.\n\nI knew good and well that she did NOT deserve, by any stretch of the imagination, anywhere NEAR the 72% that 18/25 is. She didn't master 72% of the content. She didn't get 72% of the questions correct. I'll be honest and say that when I grade dozens of exams I tend to look at the most important questions on each test and ensure these are 100 percent accurate. I always pepper in some spiraling thinky-type questions, you know, stuff with rigor, but I don't grade a*gainst* it. If I ever make an error in grading, it 150% of the time favors the student. \n\nI took her particular course's papers out of my Blah-tache case, file through the exams and find her particular one, and look at it... quizzically... then I look back at here while my head is still positioned toward the paper. I'm trying so hard to give her an out...she wouldn't budge... \n\nSo I say \"You know what? You're right... I did make an error... oh, crud, more than one.... \"\n\nI then behind my desk where the students couldn't see what I was lookng at I graded her paper right then and there. By this time I had memorized the answers to the exam without even needing to pull out the key, but I did so I made sure she knew I was grading it thoroughly... you know, ACCURATELY. \n\nShe wound up with a 14/25.   I handed it back to her right then and there, and let her know that I had changed the grade accordingly in her gradebook. That 14 she got (one of the solutions to the system she just managed to solve for Y but not for X) turned her High C to a solid D. She looked through the exam, scouring it, looking like the toy man from Toy Story, using an infinitely increasing series of overlapping lenses to look for one miniscule error on my part. I also made sure I took a picture of the test before handing it back, so she couldn't pull the \"See, I made it negative... it's right\" sort of thing. She's done that in the past. \n\nShe quickly whipped out her phone to see how much this grade impacted her overall. She was livid without a direction to hurtle it toward. I could see that this act of Petty MC on my part was a little too far.... I actually feel bad for \"Mara\". \n\nAs she looked up at me I could see her eyes well up a little bit... it was that \"too quiet\" right before something bad was about to happen... My spidey senses were tingling (side note, this is why I hate Avengers End Game... Spider-man looked surprised at his death... he should have sensed it, right? But I digress). Before she started to take her clenched arms (that she looked like she was trying to remove the top of the desk from it's connected chair) and turn them on me, I offered a solution. \n\n\"Look. Mara. Remember you can do corrections on the exam for a fourth of the credit back, right? That will get you almost all of the points that you were gifted in the first place. Whaddya say?\" \n\nShe sheepishly agreed, wound up with a 17.5 out of 25, and has yet to give me a hard time since...  but I'm pretty sure my semester survey will suffer greatly.",
        "created_utc": 1675365818,
        "upvote_ratio": 1.0
    },
    {
        "title": "Every Request Needs a Ticket? Understood.",
        "author": "pizzaholic1981",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/10rw27e/every_request_needs_a_ticket_understood/",
        "text": "A few years ago I was an I.T. Analyst for an aerospace company in Toronto. There were three sites, and one analyst for each site. I was barely able to keep up with the workload for my site but managed. One day I found out that one analyst had given a month notice and had already quit. The company did not replace him. I had to drive daily between cities to manage both sites. Shortly after, my boss was let go. And I was given a new boss who lived in another country.\n\nThe work piled up, and several employees at a time would have non-working computers because there was nobody to help them. I had to stop supporting projects that I was involved in with other managers, like getting 20 computers for the factory floor. This was definitely going to blow up, and I needed to cover myself. I had a talk with the GM and explained that I'd get walk-ups, phone calls, texts and emails because most of the employees refused to use the ticket system. I'd even have employees coming up when I was on a call and try talking in my ear. The GM decided that all requests must come in the form of a ticket.\n\nI adopted a no ticket = no work policy and enforced it on all employees and managers. I also stopped answering texts and calls. I'd answer all email requests with \"Please open a ticket.\" Most managers refused, so I would just thank them for their time while they fumed off to file a complaint against me. A week went by with no copier on the main floor because everyone refused to open a ticket to request more ink. Everyone had to walk downstairs to make their copies. A week went by with several lathes in the factory not working because everyone refused to open a ticket. Several computer illiterate / lazy employees would now have to ask their coworkers for help because they refused to open a ticket, and now they're behind on their work. Sometimes a new employee would spend 2 or 3 days in the office with no laptop and no user account because the requests never came in the form of a ticket. Employees would go on business trips without laptops because they refused to open a ticket.\n\nThis went on for several months and I was able to partially manage both sites, but it was exhausting arguing with everyone every day. I'd get threatened by management all the time but nothing would ever come of it. I found out one day that the company wasn't planning on replacing the employee who quit, so I had enough. I spent a few weeks declining requests as usual, but when they came from a manager I'd add \"and if you don't like it, then fire me. Request denied.\" Eventually I decided my mental health was more valuable than the company, and when the last Analyst went on vacation I simply left my phone and laptop on my desk and stopped coming in for my shifts, 0 notice given.\n\nA week later I get a call from HR, they found my wife's # as an emergency contact, and said I let them down and there was nobody to help. I replied with \"Good, now you know how it feels\", and left it at that. Six months later the only analyst left tells me the company replaced my position with two, but they're still in rough shape. All they had to do was replace an employee.\n\n&amp;#x200B;\n\ntl;dr - Aerospace company doesn't replace IT staff when they quit, workload doubles, I get permission to decline requests that don't come in the form of a help desk ticket. Everyone refuses tickets, I refuse work, no work gets done.",
        "created_utc": 1675360454,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can't get paid overtime? Don't call us outside of work hours.",
        "author": "tokiohy",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/10rup9y/cant_get_paid_overtime_dont_call_us_outside_of/",
        "text": "Ready for another story about my ex-boss? \n\nFor the longest time working at the previous Home Health, I've noticed some coworkers would work couple of minutes past end of the shift. From my understanding, this was to prevent any field agents contacting whoever is on call until the next day. Now quick backstory... the person on call is the boss, aka OWNER, DON, ADMIN, ETC. One day, we had a conference meeting that the boss wasn't happy some of us were working past work hours and makes a statement to clock out exactly at the time we close for the day. Of course that meant she refuses paying us overtime if we're working over 8 hours. So since our work hours are from Mon - Fri 8 hours each day, we have to make the best of it being productive within those hours. Why emphasis about the days and hours you ask...? Since the calls have been transferred to on call, which is the boss, this also means she's responsible taking calls until office opens. You'd think she'd know the basic knowledge what to say or instruct when someone calls.... wrong. She'd basically call one of us late at night to assist her with any issue and it usually takes 1-2 hours tops to finish assisting the issue. Here's the malicious compliance.\n\nOne day, half of the coworkers were on vacation and we're understaffed. We finished work for the day and transferred calls to the boss. At this time, I wasn't feeling so good and I wanted to rest for remainder of the evening. It wasn't even 8pm and I received a call from my boss.\n\nMe: Hello, ma'am?\n\nBoss: Oh good! I'm able to reach you on time.\n\nMe: Ok. What's wrong?\n\nBoss: I need you to call this patient and...\n\nMe: I'm sorry... I cannot do that at this time. I will follow up in the morning.\n\nBoss: No! This needs to be done NOW!!\n\nMe: I understand, ma'am. But I cannot work outside hours as you officially said. I will follow up on this patient in the morning.\n\nBoss: I DID NOT PAY YOU TO BE STUCK UP!! NOW HELP ME OR YOU WON'T WORK FOR ME ANYMORE.\n\nMe: But don't you remember what you told us. Because we cannot work overtime and it's past work hours, we cannot assist. This issue with the patient will be done soon as I come into the office TOMORROW. -hangs up-\n\nThe next day, I come into the office and the alt DON arrives in time asking what happened last night. I explained to her the scenario and she took my side. We had a three way call with the boss and the alt DON gave her a long lecture how she told everyone we are NOT to be bothered after work hours even when she told us we cannot work OVERTIME. The shivers I can hear from her side of the call belittle her. After that, we were allowed to work extra 15 mins with extra pay past work hour to complete whatever needs to be done. She slowly stopped contacting us late at night but would bug the alt DON instead. \n\nAnd the issue she wanted me to assist that time with the patient.... the patient couldn't find their pillbox and end up finding it later in the morning. So what the actual fudge.",
        "created_utc": 1675357089,
        "upvote_ratio": 1.0
    },
    {
        "title": "Told to start clocking out or don’t get paid",
        "author": "dmanthony41",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/10rugu4/told_to_start_clocking_out_or_dont_get_paid/",
        "text": "[retail assistant dept manager] I always get to work on time but would usually work for an extra hour many days. I was doing stuff I enjoyed doing, so it didn’t feel like work. Mostly extra planning, computer tasks, or building new displays.\n\nMy hours were always manually added to the system and my pay was always accurate. One day, I was told I needed to start clocking out if I wanted to get my full pay; they weren’t going to continue manually adjusting it in the system.\n\nSince then, I have been clocking out on time and walking out the door. Once I clock out, I stop thinking about work and use the extra time doing stuff that is more meaningful to me. I have been growing my many FB pages and groups and the extra time away from work has been super helpful with these. \n\nTLDR. I was told to clock out or not get full pay. Now I clock out and leave on time. Now I have more me time and family time.",
        "created_utc": 1675356537,
        "upvote_ratio": 1.0
    },
    {
        "title": "Parking hogs",
        "author": "chachachanclas",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/10ripzv/parking_hogs/",
        "text": "My mom lives in an apartment complex that is literally so huge and crowded, I hate it so much ESPECIALLY the parking shituation. So in her little area there is extra parking for visitors, the parking closest to her apt was full and I drove around to where there is quite a bit more parking available. 3 spaces SHOULD be open but a large company van is taking 2 which ok i can understand a bit they have ladders on top and if one falls on a car thats a huge 'oh fuck' moment but the other is a black car with the tires on the wrong side of the line and lastly a green car parked with the back L tire over the line  🙄🙄 the problem is i drive a large SUV that would  most definitely not make it without hitting either car so i grab my mums keys to a tiny car and move her car besides the green car and go out through the back like literally could not get out through any of the 4 doors. i was still in the lines but just barely and im fat so i would have dinged someones shit. took vid of my mums car and the license plates of the 2 cars besides her the car that did nothing wrong is parked with the passenger side to mums car so all is well and unfortunately while green cars driver side is impossible to get in they have more than enough space to get on through the passenger side. This is not as grand as some other malicious compliance stories but man it felt so good and i giggled so much, even on my way out the back of the car. im so happy",
        "created_utc": 1675318477,
        "upvote_ratio": 1.0
    },
    {
        "title": "If you're well enough to work, you're well enough to come to the office - Covid",
        "author": "darthtrakad",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/10ria37/if_youre_well_enough_to_work_youre_well_enough_to/",
        "text": "To preface this, I am not happy about what I have done, but the company is a pile of shit and just pushed me too far. \n\nSo last week I started to feel really bad, so performed a Covid test and voila, I have Covid round 2.\n\nLast year when restrictions were in place I was off for one day, then worked from home for 2 weeks. \nI'm lucky enough that 90% of my job is computer based and my home set up is adequate to do this. \n\nOf course this time around my immediate reaction was to tell my boss and start WFH. \nThey seem open to the idea and everyone understands and appreciates that I'm continuing to work, but keeping them safe. \n\nThe week comes to an end and my last daily report to the boss I say it seems to be working well, I'll stay WFH so long as I am displaying symptoms.\n\nCue the response \"if staff are well I prefer them to be in the office\"...\nSo Monday rolls around and I'm back to the office. \nStill with some symptoms, still testing positive but that's the bosses wish, I make sure that everyone knows I'm positive and to stay away and the only reason I am there is due to this statement that I am openly showing anyone who has an issue with me working.",
        "created_utc": 1675317029,
        "upvote_ratio": 1.0
    },
    {
        "title": "Getting paid to play video games",
        "author": "Supervisorconfession",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/10rg2l8/getting_paid_to_play_video_games/",
        "text": "I had a job years ago at a contractor that I HATED. It was 2 years of my life I will never get back. They kept promising me raises and bonus but they never really materialized. I actually did quit once because my wife was going to do a short term program across the country. We were looking to start over and we were just going to move there. They begged me to stay and said they would pay for flights and expenses. I eventually agreed, however later found out that they took those expenses out of my bonus. My boss, who made 5 times more than me, would always complain about how expensive I was (I made $45k a year). They kept pressuring me to do bigger jobs that I wasn't trained for and some ended badly. Finally, I had enough and I was done with those jerks. \n\nI was able to find another job (my current one now) and I put in my notice. My new boss wanted me to start on the 1st of the month which was about 1.5 weeks notice. I had not problem with this but my old boss wasn't having it. He insisted on 2 weeks which, which with the weekends as closer to 2.5 weeks. I ended up starting on the 7th of the month. The only problem was that by the 1st, I had already handed over ALL of my existing work and literally had no active projects. Other than answering the phone and sending out people for quick service calls, I had nothing to do. I spend those few days taking extra long lunches, playing video games and even going to a local park and taking a nap. On my final day, my boss wasn't even in the office so I never even said \"good bye\" to him. I said bye to a few friends, had a 10 minute meeting with HR for an exit interview and never looked back.",
        "created_utc": 1675310355,
        "upvote_ratio": 1.0
    },
    {
        "title": "Have to sign out and get permission before leaving the building? You got it, boss",
        "author": "everydaybeme",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/10ree0m/have_to_sign_out_and_get_permission_before/",
        "text": "My boss recently implemented a new policy that requires employees to sign out and get permission *in person* before leaving the building for any reason, including during lunch. \n\nThe building where the sign out book is kept is a good 10 minute walk from where my office is, but lunch break doesn’t start until I’ve actually left the building. \n\nSo today I spent the 10 minutes walking over to log my departure on the sign out book, then waited 5 more minutes for the boss to come by so I could get permission to leave, then another 10 minutes walking back to my car so I could finally go \n\nThat’s 25 minutes of time that could have certainly been spent more productively, but the boss wants me to sign out and get permission before starting my lunch break, and I’m not one to bend the rules 😉",
        "created_utc": 1675305658,
        "upvote_ratio": 1.0
    },
    {
        "title": "You want to know why my video game isn't a waste of money? Sure thing!",
        "author": "SBrB8",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/10rbhar/you_want_to_know_why_my_video_game_isnt_a_waste/",
        "text": "At my old job, there was a coworker of mine, Joy, who was really anti video games. I never really found out why, except they were \"just stupid\". Not a big deal though, I just never really talked about games around her, and didn't think much of it, just ignore any jokes or comments she made about them.\n\nSo back in the first few months of the pandemic, my job was trying ways of keeping us all connected and social, but not just focused on work. So I started doing a weekly Among Us night for anyone interested. A good number of people were interested. Of course Joy wasn't one of them, however aside from a couple of dumb comments early on, she never really said anything.\n\nA couple months later, things are starting to somewhat open up, so it's possible to got to a bar with a group, which Joy did as soon as she could, and she was telling people about it. A day or so later, I posted to our staff when the next game night was, and anyone was welcome to join.\n\nJoy then sends me a private message about how annoying it is that I'm still posting about the night and it's \"Especially stupid to keep having these nights now that we can go out again\". She said it was a waste of money, and I said maybe to her, but not to me.\n\n\"Oh yeah? Prove to me right now it's not a waste of money!\"\n\nSo I just smirked and responded. \"Okay, you went out with your friends the other night. How long did you go out for?... About 3 hours? OKay and what did you have in that time?... 5 drinks and a meal. So that was about $8 per drink, and a 20 dollar meal, that was about $60, is that right? Okay. So you spent $20 per hour to socialize and have fun with your friends. I spent $6 on this game 4 months ago, have had about 15 gaming sessions of 2 hours each where I had a lot of fun with my friends/coworkers. That works out to about 20 cents per hour to socialize and have fun. You tell me which was more of a waste of money.\"\n\nShe never responded to that message, but in all the time I worked there, she never once made any more comments or criticisms about games around me, and I heard from a coworker who was closer to her she pretty much stopped ragging on games in general.",
        "created_utc": 1675298164,
        "upvote_ratio": 1.0
    },
    {
        "title": "Very compliant, but a little malicious in the end, for self entertainment value.",
        "author": "SSNs4evr",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/10rbayt/very_compliant_but_a_little_malicious_in_the_end/",
        "text": "[removed]",
        "created_utc": 1675297736,
        "upvote_ratio": 1.0
    },
    {
        "title": "OK, Drive Drunk",
        "author": "Kazbob48",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/10rb977/ok_drive_drunk/",
        "text": "[removed]",
        "created_utc": 1675297607,
        "upvote_ratio": 1.0
    },
    {
        "title": "You won’t pay for my hotel? Ok I’ll drag your name through the mud and you’ll pay for a more expensive hotel",
        "author": "Sorrymomlol12",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/10r9w74/you_wont_pay_for_my_hotel_ok_ill_drag_your_name/",
        "text": "I promise I am the least petty person you’ll meet, but this “ask” just took me over the edge. \n\nI work for a very large company, make very good money and work long hours often, which up until this point I’ve been totally fine doing. Night meetings until 10pm? Fine. Drive 2 hours to major plant multiple times a week? Alrighty. But this past week we had a global supplier team fly in from Japan. FaceTime at the plant is incredibly important. This means I need to be at the plant every single day for the next 2.5 weeks. \n\nI have two bosses, a direct boss man, and the big boss lady. We’ll call them BM and BBL. When discussing this trip from our global counterparts (25k each person), BM and I talked to BBL about spending a couple nights in a local hotel so we could cut back on driving. She said “that’s not necessary, you guys can just drive. I’ll approve 1 night at a hotel so you can do relationship building with the Japan team.” \n\nI might have lost y’all already with the crazy hours and long driving, but I could MAYBE get on board with this, if it wasn’t for Tuesday mornings. Tuesday mornings we have a couple critical global calls at the plant, and with the Japan team in town, we should really be there in person for collaboration. Myself, BM, and BBL all agree on this. I pushed back on BBL and mentioned the Tuesday morning early calls. No dice. \n\nY’all, the meetings are at SIX AM. On top of this, we have Monday night meetings till 9:30pm. So I’d have to try to quickly fall asleep after the night meeting, then wake up at 3/3:30 and leave before 4 to be there on time. Driving 2 hours in the dead of night. In January. In Wisconsin. After maybe 5 hours of sleep, if I’m lucky. There are 3 Tuesday mornings with the Japan team in town.\n\nSo what did I do? I booked hotels Monday night anyway. Nice ones. Then proceeded to tell EVERYONE that I’d be local on Monday nights for relationship building. “That’s cool the company is helping you cut back on driving!” “Nah, they wouldn’t pay, but that’s fine. I’m just paying out of pocket.” I was honest, professional, but not shy that the company was not paying for this. I knew this would not look good. \n\nThe first Monday night my poor BM was getting ready for the trek home and said “Hey don’t stay to late, it’s a long drive.” And I comfortably said, “Actually I got a local hotel, so I’m 10 mins down the road. But drive safe!”\n\nThe longest, pregnantest, pause.\n\n“But, but BBL said we can’t stay local while the Japan team is in town…?” \n“Nah she said she wouldn’t pay for it, which is fine, I’m just going to pay for it out of my own pocket.”\n\nYALL THE PAUSE GOT LONGER\n404 DOES NOT COMPUTE\n\n“Are you visiting a local friend or something?”\n“Nope, just for work. I just found it to be a SAFETY CONCERN to drive at night after just a few hours of sleep, so I paid for it out of pocket. Oh and I told the Japan team we can get dinner a few nights on Monday since I’ll be local.”\n\nWTF IS HAPPENING, BUT BUT BUT BBL SAID NO\n\n“Well… I can talk to BBL and see if we can cover it under company expenses since it work related. Have you booked yet?”\n\n“Whatever you think is right. And yep, it’s booked and non-refundable.” \n\nThe next day I got an email from BBL informing me that if I felt so strongly that it was a safety concern to stay local on Mondays, to expense the 3 hotel days through the system retroactively. The same way I would if I forgot to pay with my company card. I 100% knew they wouldn’t make me pay (what should be) a company expense or punish me for making a good safety choice. BM gets to stay local for the next 2 Mondays too! \n\nThe sugar on top? Every time I drive to and from the plant, they pay me about $120 in miles.\n\nThey could’ve literally booked me a cheap hotel for the same price. Instead they’ll be paying for my $220 a night in hotels of my choice which I specifically picked in a fun area and upgraded to get a shitton of rewards points. \n\nDon’t cheap out on your invaluable employees.",
        "created_utc": 1675294274,
        "upvote_ratio": 1.0
    },
    {
        "title": "Pre-COVID: \"No working from home; it'll cost you if you do!\", During COVID: \"Please work from home..\"",
        "author": "Anthwaite",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/10r8lna/precovid_no_working_from_home_itll_cost_you_if/",
        "text": "So I've been at my place of work (very large corporation) for five years now and before I started I have them the lowdown on my disabilities and yes, I will have more sick days than most, but I made clear from before the start and throughout that some days I won't be well enough to travel to the office but will be well enough to work from home.\n\nDue to the business ops, all staff are provided a laptop which you can plug in at any desk or work remotely on visits or even home!\n\nMy managers didn't trust people to do work from home* and when it inevitably happened a few months in I let them know I am up for doing my work as usual, no problem, but I won't be able to physically commute to the office today.\n\n- just a note that my work was all business admin on a computer so I could perform my duties to the full same standard wherever I was.\n\nMy managers told me if I was not well enough to attend site, then I'm clearly not well enough to work so I had to take or sick day or else admit I am well enough to work and therefore well enough to attend site and get in the car now! They were adamant, despite my explanations proving otherwise, that it was all or nothing.\n\nI didn't want to take a sick day as even though the first x amount were paid (scheme subsidised by the government), you only got so many per year before you didn't get any pay. But they told me not to work again by phoning me when I logged in anyway just to set my Out Of Office auto-reply on and reschedule a couple meetings (which were happening virtually anyway). So I took the day off, enjoying my rest and feeling much better as the day went on.\n\nSo this happens a few times and I keep complaining and even bring it to HR and senior managers but apparently it was my managers' discretion so wouldn't help me.\n\nMy days added up and sure enough the first 2 years of my employment I lost a few hundred due to too many sick days when I was not actually sick, just unable to physically get to work.\n\nThen COVID happened.\n\nNo-one was allowed to attend site. Everyone HAD TO work from home. But due to all my complaining over the last two years I had heaps of evidence in writing from my managers (and essentially backed up my seniors and HR) that I was not allowed to ever work from home. So I didn't.\n\nThey were not happy but I held my ground. My partner was in her third trimester so I was looking forward to having all the extra time to help her and be with the baby. They logged it as 'sick leave' despite me stating and even getting a fit note from the doctor confirming I was fully fit and well enough to work.\n\nPay ran out within a number of weeks. I was pissed but semi-expecting it - didn't think lockdown would be so ongoing! But without pay it was going to be untenable for me going forward so I had to fight it and what I wanted fixing was my absence not being 'paid leave'. I gave them the alternative option though that I could work from home and, as my personal health and job circumstances had not changed, they would have to admit they intentially forced me to take sick leave unnecessarily over 2 years - meaning they would have to pay that back instead.\n\nThey did not budge so I sued.\n\nThey did their best to ignore the suit so I started building up my case formally including a Subject Access Request where they have to give me any documents, or even notes, held on the system that are about me in any way.** This included emails between my managers asking HR how they could fire me and HR apologising that they couldn't find legal grounds too unless I changed my story at any point - i.e. if I gave up the suit and continued working for them then they would view my lawsuit as fraudulent and terminate my employment.  Anyway, this backfired on them as seeing this showed me that I could NEVER drop the case.\n\nI won't go into the full logistics but when it went in front of a judge their lawyers were embarrassed and before the case was over they offered me a settlement to more than cover my lost wages. Even though I was never doing any of this to make money, but to just be treated fairly and respectfully as an employee, I decided to let the case finish and at the end, without me saying anything they doubled their first settlement offer with the condition that we agreed that we would all move on from the entire ordeal, I was allowed to work from home and after COVID continue to do so at my own, unchallenged, discretion. So I accepted.\n\nTL;DR managers told me I couldn't work from home ever, tried to change that policy when COVID happened, and because of their own hubris and contradiction, ended up paying me large amount of money so they could amend their policy to what I wanted in the first place.\n\n\n*Okay, I actually believe it wasn't trust issues in general but me personally, BECAUSE I am disabled.\n\n**There's actually an exemption that you don't have to follow SARs if there is an ongoing legal challenge but luckily for me they didn't bother checking that!",
        "created_utc": 1675291177,
        "upvote_ratio": 1.0
    },
    {
        "title": "Free advice is seldom cheap",
        "author": "OneGlassOne",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/10r7ads/free_advice_is_seldom_cheap/",
        "text": "I work for my country‘s customs administration. Me and a colleague are responsible for all import related inquiries within a certain geographic area, me handling private imports while he is in charge of commercial (business) imports. If you import something into my nation as a business, you have to input a ton of information into a centralized system which then calculates how much you owe the government in import fees and VAT.\n\nCompanies that are engaged in importing goods usually do the aforementioned administrative tasks either in-house or hire a forwarding agent. The process is fairly complicated so there are various ways my colleague tries to help businesses that haven‘t gotten the hang of it yet, especially when they are newly formed and quite small.\n\nMy colleague gets a call (calls are always put on speaker so there is another person who can confirm what is being said) from what I can only describe as the most obnoxious woman I have ever had the misfortune of hearing.\n\nThe woman explains without even a greeting, that she has opened some sort of thrift store for small trinkets relating to crystal healing (no…no joke…that’s the type of shop she opened). She then explains that she has ordered a rather large amount of merchandise from abroad and now wants us to make the necessary system entries into our system.\n\nMy colleagues is nice. Very nice. After confirming in our database that this is the first time the woman makes a business import, he kindly does it for her on his computer while explaining the whole procedure to her. The whole brouhaha takes about 90 Minutes. After everything is done, he tells her that next time she will have to do it herself or hire a forwarding agent. The woman just says that she will be expecting the bill for the import duties in the mail and hangs up.\n\nOne month goes by. Another call from the obnoxious woman.\n\nThis time she bluntly states that the next import is due and that she „has another order“ for my colleague.\n\nMy colleague, still with a voice like honey, explains to the woman that this time he won‘t be able to oblige. He explains that last time was to show her how it works and that he would be happy to give her an industry site listing the various forwarding agents who can help her.\n\nUnfortunately it doesn’t go any further, as the woman immediately cuts my colleague off. She informs him that she „knows the law“ and is thus „aware that he is required to help her fill in the forms, whether he wants to or not“.\n\nMy colleague obliges. After another 90 Minutes he wishes her a nice day and tells her that the bill will be coming in the mail again.\n\nAfter that, my colleague takes a deep breath and opens a form on his computer I haven‘t seen before. Seeing my confusion he proceeds to tell me what the form is for.\n\nApparently, the customs administration is indeed required to make the system entries for businesses if asked. However, in order to not interfere with the free market (and probably as not to incur the wrath of the forwarding agent mafia), the customs administration can charge businesses for the time our employees spend on such requests.\n\nMy colleague then shows me the fee table and my jaw drops through the floor while my eyebrows visit the back of my head. The fee is charged for every 15 minutes of work and makes the hourly fee of the greediest forwarding agent look like a bargain.\n\nMy colleague prints out a single single bill, containing the import fees as well as the charge for his time spent on the woman’s request (the charge being higher than the import fees) and drops it into the mail.\n\nWhat happened next was handled by a different office, so I will have to summarize.\n\nWoman complains that charging her for my colleague’s work is illegal…and is shut down because it is perfectly legal. Woman then complains that she didn’t know about the law…and is shut down because me and my colleague confirm that she said she knew the law. Woman then pays up.\n\nShe never called my colleague again.",
        "created_utc": 1675288150,
        "upvote_ratio": 1.0
    },
    {
        "title": "Done being bullied by the Coast Guard",
        "author": "skiloup509",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/10r6a7r/done_being_bullied_by_the_coast_guard/",
        "text": "So my buddy is a very regular salmon fisherman on the Columbia River. The river qualifies as navigable water through the locks of the dams. The Coast Guard regularly does safety checks and such which he’s very familiar with. \n\nHere’s an example encounter for context of bullying. On this particular day he’s brought his two young daughters with him. They’re leaving the marina and the Coast Guard speeds up to his boat 6 or 7 people strong all dressed in black with black masks and their rifles out and quickly board his boat. His daughters (wearing life vests) are playing with Barbies are startled and crying. They do their checks and leave. His daughters took a long time to go boating with him again because of “the scary black men with guns”. They return to the dock because their day is ruined. +1 for another unfriendly encounter with CG. \n\nThe malicious compliance really starts with his next encounter. Coast Guard is going boat to boat for safety checks. He gets all the items they check for out at the rear of the boat to expedite the process when they get to him. They start barking orders for safety check items and everything is good until they get to his registration. He JUST renewed and it’s in his tow vehicle. He remains calm and asks if they can call in for verification. He has the new annual sticker adhered to his boat so it’s pretty clear he has registered. Nope they want to see it, board his boat and say, “Show it to me!”  He’s like okay but it’s a long boat ride. The CG makes him boat 13 miles to his tow vehicle while his buddy keeps doing checks. They get to the truck. He backs it in and loads the boat and shows the guy the registration. The CG is like, “What are you doing? How am I supposed to get back?” My buddy says, “Not my problem. You’ve ruined my fishing so I recommend calling your coworker.” Then proceeds to drive off.",
        "created_utc": 1675285850,
        "upvote_ratio": 1.0
    },
    {
        "title": "Bully your flatmate? I’ll ruin your fun!",
        "author": "sixtyfoothigh",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/10r1igu/bully_your_flatmate_ill_ruin_your_fun/",
        "text": "I work in student halls of residence for a smallish campus based university in the UK. This involves malicious compliance after a group of students had been bullying one of their flatmates (I’ll call her Sara) and happened within the last 10years.\n\nSara was neurodiverse and had plenty of interests. None of these interests involved going out partying. She preferred to live in a quieter/cleaner environment. The other four all had similar interests to each other; very typical first year in halls stuff. There were kitchen parties after clubbing at 3am, alleged drug use, post party leaving strangers passed out on kitchen floor, empty bottles everywhere, and piles on rubbish/washing up… generally messy. \n\nNormally, a student would report this - we give out contact details that can be used for anonymous reporting. Or we’d offer flat meetings to help them find compromise (eg agreeing to limit parties to X times a week, checking with each other before planning one in case someone has a big deadline and needs quiet on a specific night, cleaning rotas etc.) And the cleaners could issue fines if it was a mess on weekly cleaning day. \n\nBut Sara was terrified of reporting anything and found interacting with staff very difficult. We only knew there was an issue because she would tell her mum, and her mum would tell us. We’d offered a swap, but she told her mum that she didn’t want to move as it would disrupt her routine and it “wasn’t fair for her to be punished when she’d followed the rules”. So we were working with her and her mum to try and get her to the point where she could formally report it, referring her to wellbeing services, and doing random flat checks at night to see if we could catch the students using drugs (and had the cleaners on the look out for evidence as well).\n\nThis carried on until term 2 and by then the four had clearly decided they just didn’t like her and thought she was “weird”. The inconsiderate behaviour had escalated to bullying. She’d recorded them calling her some horrible names and played it back to us, but again refused to send us the recording and wouldn’t formally report it. (I appreciate she wasn’t helping herself, but I dont think she was being deliberately difficult, she just really struggled with certain things). Her flatmates had definitely figured out what pushed her buttons. We were trying to mediate (flat meetings, trying to enable her to feel safe in reporting their behaviour formally etc.) but it was obvious to staff that they wanted to push her to move out and they had a friend who was always hanging out in their kitchen who clearly wanted to move in. One day she must have snapped and she threw a glass across the room causing it to smash on a wall. It didn’t hit anyone, but they jumped on this and all their parents were on the phone about how their daughters were living with someone “dangerous”. At this point we have no evidence of their bullying or breaches of their tenancy, but they have evidence against her and had all en mass filed reports. We have no choice but to move her.\n\nHere comes the malicious compliance; not even before we’d sent cleaners into her old room we start getting requests for the friend to move in. Apparently a “supportive person” would help with “the trauma” and someone else in the room would give them “closure”. The idea of them getting their way in this manner infuriated me. Instead we asked one of our older and more experienced Resident Advisors (a final year student) if they could move in. This is someone they would not be able to bully and had a good idea about what had been really going on in that flat. It was a nice flat in a very new building, so it was a bit of a perk for them as well.\n\nThe best bit was the parents ringing to complain about how we’d moved a stranger in and how upset their daughters were. When I explained we’d put a very experienced Resident Advisor in there who had training in peer support, all their arguments collapsed. The requirements: supportive person and room relet for closure? Tick and tick! Sorry. No more kitchen drug parties for your daughters this year.\n\nPs - Sara didn’t have any further action taken against her for the glass throwing. She did actually get some additional well-being involvement and it was deemed that the move was penalty enough (and incident unlikely to reoccur). She loved her new flat. It was a single occupancy studio, in a really nice building, and we kept her on lower rent. Her mum said the studio was perfect as she could control the mess and no one moved her stuff - she felt safe. She actually rebooked a studio for the following year and did go to finish her degree. I have no idea what happened to the other students. I hope they look back and reflect on what they did, but sadly part of me doubts it. At any rate… given we’d ruined their party venue I hope they managed to get some studying done.",
        "created_utc": 1675274980,
        "upvote_ratio": 1.0
    },
    {
        "title": "Attack a cop? Okay!",
        "author": "HuntingTheWumpus",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/10r0z48/attack_a_cop_okay/",
        "text": "I've been a community organizer and activist for decades, and there was a time I used to go demo-hopping just for the experience of throwing fists with riot cops.  One day I was at a particularly raucus protest, fully masked in balaclava and wearing a combat helmet and leather trenchcoat, ready for battle.  The cops were trying to seize our sound truck, so I headed over to help stop them.  \n\nI have a lot of experience dealing with cops, and one of the things I've learned is they are trained never to allow anyone to get behind them.  You can get an entire line of riot cops to retreat just by getting a few people behind them.  I saw a cop trying to get into the back of the sound truck, so I got right up behind him until he could feel my breath on his neck.  He spun around in place and immediately ordered me to \"BACK UP!\"\n\nBy this time the crowd had surged towards the truck as they had spotted the same thing I had, the cops trying to waylay our truck, and now I was surrounded -- with a cop right behind me, doing to me what I had done to the cop in front of me.  The cop in front of me couldn't see this, because the crowd had now pushed in, pressing us literally face to face.\n\nThe cop screamed in my face, spittle flying: \"BACK UP NOOOWWW!\" and began shoving at me, without much effect because we were pressed in so tightly by the crowd.\n\nI shrugged and asked him reasonably, \"Where would you like me to go?\"\n\nThe cop, face red and eyes bulging with rage, just screamed, \"BAAACK AWAYYY!\"\n\nI grinned and told him, \"There's a cop right behind me.  If you're *ordering* me to knock him down, I'll be happy to comply.  Is that what you're telling me?  Are you giving me a direct order to attack the cop?\"\n\nAnd he realized there was nothing he could do.  We stood like that, pressed belly to belly and face to face, him glaring daggers of hate into my eyes and me grinning toothily back into his face, completely immobilized, for ten minutes until the riot cops arrived and began dispersing the crowds.  I managed to slip away before getting arrested.  It was a lot of fun.  I miss those days.",
        "created_utc": 1675273745,
        "upvote_ratio": 1.0
    },
    {
        "title": "I'm sick of malicious comments on CWS",
        "author": "Big__Carl",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/10r0mi4/im_sick_of_malicious_comments_on_cws/",
        "text": "I develop free chrome extensions for facebook users, absolutely no paywall.\n\nSince this month, some extension already have 1k+ users, but some users leave 1-star reviews because I use facebook host permission (If I don't use it, how can I provide functionality?),\n\nin time I try to contact They, show them the source code of the extension, and they simply ignore it. How do you deal with these users?\n\nI feel so bad, it's a free extension, you don't have to pay anything, don't install it if you don't want to, if you get confused, I can just provide the source code, why leave a 1 star review?\n\nThey take pleasure in it?",
        "created_utc": 1675272915,
        "upvote_ratio": 1.0
    },
    {
        "title": "Barselona Vs Arsenal highlights Match",
        "author": "Plenty-Childhood-839",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/10qzdmf/barselona_vs_arsenal_highlights_match/",
        "text": "[removed]",
        "created_utc": 1675270008,
        "upvote_ratio": 1.0
    },
    {
        "title": "Yell at me because we've been erroneously compensating you? Let me fix that for you.",
        "author": "BeTalkinToYah",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/10qzcub/yell_at_me_because_weve_been_erroneously/",
        "text": "Working in a health insurance company where calls come in and the majority of them are, \"I went for a massage and it wasn't paid. Why?\" and \"My card was blocked at the pharmacy. Why?\" \"I bought my glasses and only 50% was paid. I thought I was fully eligible! Why wasn't I paid?\"  \n\n\nSo the call that started this story was \"I've been sending my son to counselling under my plan and I've been getting paid... but my son's last appointment states that the professional they saw isn't a licensed professional so I can't get the money back. (Raised voice and threatening tone) I've been sending him to the same counsellor this whole time.  What kind of monkey show are you running? I work all day and I pay SOOOOO much into this plan for you to turn around and deny  me!? Who do you think you are!?\"\n\n&amp;#x200B;\n\nFirst,  based on their employer's creation of such a generous plan, their health plan is fully paid for and it costs the employee $0.00 to participate in this plan. Second, getting psychological counselling as part of a benefits package is outrageously amazing in this part of the world. Third, if you get a message stating that your professional is not eligible but you've gotten away with it, why push for this one, now? That's just crazy.  \n\n\nEnter the MC : \"That would put a crimp in my day so I fully understand that impact on your wallet. Our insurance team is very strict but sometimes they read something quickly and can make mistakes. Allow me to escalate this for immediate review. Once done they have the automatic email response so you'll be the first to know of the outcome.\"  \n\n\nThe customer ate it up. \"That's right. I have no idea how you can operate like this. I suppose that's how IN-SUR-AAAAANCE works. Stealing as much as they can, and overcharging when able. Thank....YOU!\" and they hung up.  \n\n\nBonus : this was all in French, so as I am one of only a few French speaking employees. (Not Quebec, Not Ontario. Raised in NS, so NS-French) That same employee called back and this is how it went. \n\n&amp;#x200B;\n\nAGENT: \"Hi, I'm \\_\\_\\_\\_\\_ and thanks for calling \\_\\_\\_\\_\\_, can I start with your ID to get your file?\"  \n\n\nANGRY employee, let's call her KAREN: \"Man-a-gerrrr....NOW!\"\n\n&amp;#x200B;\n\nAGENT trained to at least capture details of the reason before escalating. Captured it all but I already knew what was going to happen.  \n\n\nKAREN: \"I am being told to pay back $1200.00 in claims! What the HELL!?\"  \n\n\nAGENT dials the Escalation Manager and explains call #1 by memory and then explained the current call and the KAREN's concern. I went back in the KAREN's history and forwarded all the images and receipts they'd submitted declaring that these are all ineligible but yet we paid. This needs fixing. Our Insurance Team created a Claw-Back instantly.  \n\n\nMANAGER: \"Heh heh. This ought to be good. Put her through. Good job catching that.\"  \n\n\nAGENT: \"Thank the Karen. She self-reported.\"\n\n&amp;#x200B;\n\ntl:dr : Karen gets denied claim (outside the rules) and accidentally NARCS herself for claims she was getting away with causing the insurance company to get the money back.",
        "created_utc": 1675269955,
        "upvote_ratio": 1.0
    },
    {
        "title": "If you encountered bossware, what would you do?",
        "author": "KolideKenny",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/10qywxe/if_you_encountered_bossware_what_would_you_do/",
        "text": "Since the pandemic and rise of remote work, a lot more companies have reported to use bossware, or employee surveillance. Whether it's keyloggers or productivity monitoring tools, it's become rampant.\n\nHave you worked for a company that's implemented it? Have you had to implement it yourself because management has told you to? How do you feel about it? What do you make of the potential for abuse?\n\nMost importantly, if you did find out your employer was using these tools, how would you make it fun? Luckily, there are [regulations](https://www.kolide.com/blog/your-company-s-bossware-could-get-you-in-legal-trouble) to deter it that are looking to be enforced more.",
        "created_utc": 1675268859,
        "upvote_ratio": 1.0
    },
    {
        "title": "Anti-Brit Irish bar carded me, so I showed them my Paddy Passport..",
        "author": "Blimeydog",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/10qx1yq/antibrit_irish_bar_carded_me_so_i_showed_them_my/",
        "text": "This was a few years ago and I was working in the US for a month or so - I'm from UK and I was about 35. We were a mixed bunch of Europeans and we were near Boston and we had a night out. We saw and Irish bar and went in. They seemed happy to see us and were asking about our work there and where were we from until I spoke. I told him I'm from UK. The friendly facade dropped away and he immediately asked for ID, I'm no baby face and there were others younger than me in our group. So I showed him my Irish passport. He was so confused. Still hated me, but now I think it was because I was more Irish than he was. I explained my dad was Irish, but I do get to visit the relatives once in a while. \"Have you ever been?\" I asked, no answer.",
        "created_utc": 1675264298,
        "upvote_ratio": 1.0
    },
    {
        "title": "My company tries to make me brake the rules",
        "author": "Munken1984",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/10qw719/my_company_tries_to_make_me_brake_the_rules/",
        "text": "In my company, we have PC users and tablet users, a while ago we got an email telling us to go and do a computer/internet security course, all the emails from this outside company comes with a security warning telling us to NOT open links from outside emails, now 15 email reminders later i have still not done the course, im not breaking rules to do a course...\nIm a tablet user, and the tablet has no connection to the companys network, we are told to keep it on mobile network...\nThey can keep sending me reminders, and i will keep ignoring them...",
        "created_utc": 1675262118,
        "upvote_ratio": 1.0
    },
    {
        "title": "Save a nickel to spend a dollar",
        "author": "ICEeater22",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/10quyhu/save_a_nickel_to_spend_a_dollar/",
        "text": "I’m salary. Company I work for sent me to a two week training. Mixed between salary and hourly employees. Everyone’s flights were booked for Saturday, the day after the final day of training. I said hey training is done at 4 there is a 7 o clock flight I can make Friday. Gal in charge of the bookings told me no it would mess with time sheets. I don’t get paid overtime. A week into training I brought it up again that I would like to leave Friday as it would get me home at midnight instead of 5 pm Saturday, a 17 hour difference of my time. They conceded and said sure but you’ll have to pay the $60 price difference. I added up the hotel and the per diem to a total around $250 and said certainly I’ll pay the $60 price difference if I get the $250 that you’re not paying for me staying another day. \n\nI got on the flight Friday night, no charge.",
        "created_utc": 1675258776,
        "upvote_ratio": 1.0
    },
    {
        "title": "Karen told me to hang up, so I did",
        "author": "ithinkitmightbe",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/10qme6c/karen_told_me_to_hang_up_so_i_did/",
        "text": "So I work for a large electronics company doing sales over the phone, we get a lot of calls daily and take credit card details, to place orders, as well as place finance orders.\n\nSince fraud is such a big deal our company we’re taught that only the account holder for the CC or finance account can place an order.\n\nQueue Karen calling to place an order for finance, go through everything, get her name/address/number, and payment details. just before I place the order, she goes “oh, the cards in my dads name, that’s fine right?”\n\nI tell her no, her dad needs to place the order as he’s the account holder, queue her arguing for about 5 mins how she's his daughter and I need to finalise this order now.\n\nI tell her, I’m sorry but I can’t do that, as I’ve mentioned the account holder needs to place the order.\n\nShe started cussing me out, calls me a stupid fucking idiot and that I know nothing, and demands I place the order.\n\nI’ve had enough at this point, since she started swearing and getting aggressive I said “I’m sorry, but if you continue to speak to me in such a manner I will terminate this call.\n\nCustomer says: “Well terminate it then”\n\nSo I did with a “ok then thank you for calling, have a nice day”\n\nI heard her go “no wait” as I hung up on her.\n\nGod that felt good.",
        "created_utc": 1675232188,
        "upvote_ratio": 1.0
    },
    {
        "title": "Happens More Than It Should",
        "author": "Stewgots73",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/10qhw4i/happens_more_than_it_should/",
        "text": "Short &amp; sweet- this happens enough to make this a general MC and not specific to just one occurrence. Insurance industry manager in an office open to the public. Some customers don’t realize we’ve heard it all before and see it alllll the time, so when they come in with a very minor issue, usually of their own doing, they like to say their lawyer will handle it if they don’t like the first explanation-hint: lawyers don’t take cases when your policy lapsed because you didn’t pay the bill, you didn’t get the mail, you think your claim is taking too long, etc. Point is, as soon as the lawyer gets mentioned, it’s an immediate game over. ‘ Ah, ok I’m glad you mentioned that-have your lawyer contact us directly with their letter of representation and we’ll resolve this with them. Since you’ve retained counsel you don’t have to try to handle this yourself any longer. We can get this resolved for you once we get that letter but I can only discuss your issue with them now. Was there anything else I can help with today, besides this of course? Now is the moment when they can’t take it back and look like a total ass, and they obviously have no lawyer so that’s never gonna happen, and every one of them makes the same ‘oh shit what do I say now’ face. So I hustle them on out- not one has ever admitted there’s no lawyer, so off they go.  Problem unresolved- and some notes in there about how you like to pull the lawyer card when you don’t pay your bill.   Hasn’t happened yet this week but we still have 3 days to go- I have faith.  And to be clear- if your problem is legit of course we’ll do our professional best to help, and if you act like a decent human we’ll go out of our way to look for other ways to help you out-potential discounts, policy recommendations, whatever.  Don’t pull the lawyer card- it kills whatever your issue is.",
        "created_utc": 1675218054,
        "upvote_ratio": 1.0
    },
    {
        "title": "No pets past this point? Fine, we'll eat right here!",
        "author": "Ok-Barnacle-7617",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/10qdn5l/no_pets_past_this_point_fine_well_eat_right_here/",
        "text": "My (26F) husband (35M) and I have four cats and a dog. The dog is a lovely mixed-breed. She's around 35 pounds and super docile. We usually take her with us whenever we go out as long as she's welcome there. So, one day, when we had a couple of things to buy and wanted to grab a bite to eat, we decided to go to a mall. We took our dog with us, because all malls where I live are pet friendly. Pets aren't allowed in food courts, though, but they will set aside an area exclusively for people with pets to be able to sit and eat. \n\nHowever, one of the oldest malls where I live refused to get with the times and, despite the fact that their food court is huge and it's so widespread that you literally have to walk across it to get to most parts of the mall, they had no pet friendly area by the food court. The three of us walked and walked around searching for the designated space for pets, but all the entrances to the food court had a large colorful sign saying \"NO PETS PAST THIS POINT\". We were shocked when we realized that there was nowhere we could sit down with our dog and, boy, were we STARVING. My husband and I stopped by one of the stupid signs and debated on what to do when the table closest to the sign, furthest away from the food court, vacated. \n\nCue the malicious compliance.\n\nThe table was nailed to the floor, but the chairs were not. Since the now free table was so close to the sign, all we had to do was push my husband's chair back, past the sign, and tie our dog's leash to it. That way, she stayed outside the \"danger zone\" and we were free to use the table to finally eat. During the time we stayed there, two or three staff members passed us by and gave us glances: one was definitely smiling, but some looked confused, like they wanted to say something but didn't know what, because... Well, there WAS no pet past that point.\n\nWe did that same thing once or twice more and I've witness other people with dogs using the tables closest to the signs in a similar fashion. I guess eventually management took the hint of how stupid it was to allow pets in the mall, but leave no place for the people with pets to sit and get a effing ice cream, because we stopped by that mall last week after a while and, lo and behold, they now have pet friendly tables beside the food court.",
        "created_utc": 1675206805,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why did they get in for free? Let me fix that.",
        "author": "NotOutrageous",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/10q5nu4/why_did_they_get_in_for_free_let_me_fix_that/",
        "text": "I used to work as a bouncer/doorman at a bar that charged a $2 cover on weekend nights.  Everyone paid to get in with only one exception, party busses.  We had an agreement with the different party bus operators that if they brought their groups to our bar they would get in for free.  (lively crowds are good for business)\n\nSo one night I'm working and a guy comes in with his girlfriend and I tell him its 2 bucks a head.  He grumbles about it and I give him the same line I tell anyone who complains: \"A $2 cover is the cheapest thing you will buy here tonight, if you can't afford it you might want to go somewhere else.\"   He doesn't want to look cheap in front of his lady, so of course he pays.  \n\nA couple minutes later he's back saying he just talked to some people who didn't have to pay, and wants to know why he got singled out.  I tell him about the party bus rule and say those people must have come in on a bus.  He motions towards some people sitting with his girlfriend and tells me, \"You didn't charge my friends, and they didn't come on a bus.\"   I recognized the people and when they came in I asked them if they were from the bus, and they had said yes.  So they lied to me, It happens and normally I wouldn't worry about it.\n\nI tell him, well it sounds like I made a mistake, I guess its their lucky night.  (That's my hint to him that he should let it go) That's not good enough for him.  He gets louder and keeps demanding I refund his $4 \"to keep things fair\".   I've had it with him.  I tell him, \"You're right. Its not fair.  Let me fix it for you.\" He smirks because he thinks he's getting a refund, but he doesn't realize all I'm giving is some sweet MC. \n\nHe smirk disappeared when I stepped away from the cash drawer and walked over to where his friends were sitting.  In my most polite voice I said, \"Hey, sorry to bother you guys, but there's a $2 cover tonight and your friend here told me you didn't pay. I must have misheard you when I asked if you were with the party bus, but I need to collect the cover from you now.\"  \n\nThe looks of betrayal they gave him were priceless.  I collected their covers, smiled and loudly thanked him for being so honest.   Then I walked back to my post and watched them proceed to rip him a new one.",
        "created_utc": 1675187753,
        "upvote_ratio": 1.0
    },
    {
        "title": "Want to escalate the fact that we made a mistake? Sure let’s go ahead and fix that for you",
        "author": "opulentbum",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/10q5lfa/want_to_escalate_the_fact_that_we_made_a_mistake/",
        "text": "Obligatory mobile formatting disclaimer.\n\nSo I’m not entirely sure if this belongs here, but I thought this sub would be the most fitting. I work in retirement services at a large financial institution you all probably know. Many people reading this will have accounts with my employer. Something we often see in my department are people who need to pull funds out of their 401k or 403b etc. for various hardships. Obviously, being that it’s a *retirement* account, there are rules about when, how and why you can take funds out. It’s not a checking account and money directed towards these accounts should essentially be forgotten about until retirement. But nonetheless, there are perfectly sufficient reasons laid out by the IRS as to why you could withdraw early i.e. preventing eviction, uninsured medical expenses, burial or funeral costs for a family member, or in this particular case I’m discussing today, for post-secondary education expenses (college tuition). Things of that nature classified as financial hardships.\n\nWe’ll skip ahead to last week, where I had to take an escalation (part of my role as a supervisor) from a woman who was pissed we couldn’t approve her hardship withdrawal due to her paperwork not meeting IRS guidelines. She really made a fuss, called multiple times, and eventually was handed to me. Turns out her last hardship was taken for the exact same reason with the exact same paperwork, but a note was made in our system that the prior instance was approved in error and should not have been permitted, and thus we can’t permit the new one. It was due to a technicality in the paperwork vs what is required by the IRS. So this naturally made her upset, which I understand. But she couldn’t just leave it alone. \n\nThe woman began making demands that it go over my head even, threatened to involve her employer as well, and was spouting out nonsense about discriminatory practices. When people do things like this, just for anyone who’s never done customer service, it makes the employee not give a shit about helping you anymore. Just an fyi for the uninitiated. \n\nSo fast forward to another day, another conversation, and she decides she can’t let this erroneous approval go. Needs the matter escalated further because it concerns her that it’s possible for a mistake to occur in a financial setting. As if human error never occurs in any other high-stakes industry. But okay. Fine. Have it your way. \n\nI reached out to an administrator in another department responsible for the plan’s compliance, and explained the situation. Little does she know, she is technically right that accepting non-compliant paperwork is a big slip. So big that it jeopardizes the plan’s qualified status which doesn’t just impact her, but everyone at the company she works for. So it has to be remedied now that it’s been brought to the attention of that other department. And how do we fix that problem, you might ask? A process called asset recovery. Since we let money out that we shouldn’t have, we need to get it back. SO, she now not only doesn’t get her current withdrawal request. She has to *pay back* the erroneous one she was permitted to have. If she had just let it go nobody would be any wiser and it probably would never have impacted her or anyone else negatively. But since she insisted, we have to comply. If that isn’t some type of karma I’m not sure what is.",
        "created_utc": 1675187593,
        "upvote_ratio": 1.0
    },
    {
        "title": "I will do this thing that you ask, but no more",
        "author": "SubstantialTerm3843",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/10q4z7n/i_will_do_this_thing_that_you_ask_but_no_more/",
        "text": "[removed]",
        "created_utc": 1675186153,
        "upvote_ratio": 1.0
    },
    {
        "title": "Full-time work for part-time pay? No.",
        "author": "ForgotMyNameAgain6",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/10q4xaj/fulltime_work_for_parttime_pay_no/",
        "text": "[removed]",
        "created_utc": 1675186028,
        "upvote_ratio": 1.0
    },
    {
        "title": "No more overtime. No more services on the customers yard. Now I drive around most of the day.",
        "author": "jakobair",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/10pyd6j/no_more_overtime_no_more_services_on_the/",
        "text": "I'm a diesel mechanic that works for one of the largest two fleets in the United States. My job is to work off-site for a single customer which is on one of the largest middlemen of the product they ship in the US. I can't much more about the product because it would give away exactly who they are and this isn't a throw away account. \n\nAnyway, my job is to load up my truck at the shop with parts and oil, travel to the customer's site, take inventory of the units on their yard, compare the list to overdue and coming due services, work on the customer write up list, work on our internal company campaign list, send an email AND internal memo about any truck I work on AND receive info about, pay attention to the internal group text, keep up on my training online, do repairs on-site, and look at drive ups as they come in. I have to keep track of EVERYTHING. It took some getting used to but I'm decent at it now.\n\nIn the state I work in the law states that during our required 30 minute meal period we are to be paid if we remain on the clock or have to do anything work related during the mall period. My first few days I clocked out for lunch but was immediately interrupted by a drive up. Our time keeping program has no allowances or adjustments to state that I had to work on my meal period. I don't mind working when I'm trying to eat so I simply don't clock out for lunch as I tend to nibble through the day anyway. The customer likes that I'm always available and I get 30 minutes overtime everyday. With the days I work I get 2 hours overtime every week. If I work a day extra I get a lot more. The customer is happy which makes my box happy which gets me more money and makes me happy. Win win win. \n\nLast week I was notified by my company that were on now on ZERO minute overtime and we MUST take our lunches and breaks. No problem. I'm pretty compliant because my boss is cool. I wash also told that we can no longer do any repairs or services on site. They have to be done at the shop. Again, no problem. I don't really care where they want them done. ANY overtime has to be pre-approved by my boss's boss's boss. I've worked with him in the past and he's also pretty cool, but he's very busy and rarely responds ridge away.\n\nHere's the malicious compliance part. I now come back to the shop for my breaks and lunch near the end of the day because I'm not interrupted here. That's an hour not at the customer's yard. I also have to come back here to do services so I'm rarely at the customer's yard now. As any overtime requests go mostly unnoticed, I don't do anymore overtime. I get drive ups during the day and I have to tell the driver's to contact corporate as I have to adhere to these new rules or I'll be fired. The broken down tractors and trailers are piling up in the customer's yard because I'm barely there, and they're piling up in the shop yard because I now spend most of my time driving back and forth and the other staff count at the shop hasn't increased. No overtime, more driving in circles, much less actual work. \n\ntl;dr - I like overtime but can't do it anymore and the work is pilling up. It's what the customer and my employer want so I spend most of my day driving to and from the shop. I haven't listened to so much radio in years.",
        "created_utc": 1675169855,
        "upvote_ratio": 1.0
    },
    {
        "title": "Footballer is promised a house for every year of his contract.",
        "author": "JamezPS",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/10pxm2g/footballer_is_promised_a_house_for_every_year_of/",
        "text": "When negotiating a contract, small details make all the difference as German striker Guiseppe Reina found out the hard way.\n\nWhen Reina signed a three-year deal with Arminia Bielefeld in 1996, he requested a brand-new house for every year of his contract.\n\nUnfortunately for Reina, he forgot to elaborate on size and Arminia Bielfield took advantage - building three Lego houses Ed Sheeran would be proud of.  \n \n\nSource:\nhttps://www.beinsports.com/au/football/news/footballs-strangest-contract-clauses/370745",
        "created_utc": 1675167602,
        "upvote_ratio": 1.0
    },
    {
        "title": "\"can i speak to your manager?\"",
        "author": "persimmonling",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/10px69j/can_i_speak_to_your_manager/",
        "text": "a few years ago, i worked as a cashier at a fast food restaurant.  i don't eat fast food, so i don't know how it is with other places, but with this establishment, everything cost extra.  you want sauce with your tacos?  that's $.50, please.  substitute your sour cream with guacamole?  sorry, you have to pay for that.  you want *ranch* with your *salad*?  that'll be extra.  all of these prices were very prominently displayed on a giant menu in the middle of the lobby, by the way.\n\nnow, i was paid minimum wage.  i, nor any of the other cashiers, could not give a damn about all that.  it also made the prices ridiculous, as a lot of customers naturally wanted add-ons.  so, usually, we wouldn't charge for most of those things, but we could only do so when our manager was not in the front, as she was the strict type.  yell-at-you-in-front-of-the-customers-for giving-away-a-free-sauce type.\n\non a slow day, an older woman walked in and ordered a salad.  by the time it got to the register, she'd loaded it with a bunch of extras.  to be completely honest, there was no rhyme or reason for what i chose to charge people for; it really depended on my mood.  her salad was pretty accessorized, so i felt like i had to charge for something, but i was having a good day, so i just charged her for the salad and extra guacamole and that's all.  the price was something like $12.50.  she immediately started to complain about the price.  i explained to her that it was $11.50 for the salad and $1 for the guac.\n\n\"that's ridiculous.  it shouldn't cost that much just for a salad.  even $11 is way too much!\"\n\n\"i'm sorry ma'am, but that's the price that's on the menu.\"\n\n\"why did you raise the price so high?  a salad should not cost that much.\"\n\ni tried to explain that i was only a cashier and did not, in fact, control the menus, but she would have none of it and only grew increasingly rude.  then, she dropped the classic, dreaded line.\n\n\"can i speak to your manager?\"\n\ni hesitated, looked her in the eye, and said, \"you don't want to do that.\"\n\n\"no, get your manager.  right now.\"\n\nso i went to the back and explained to my manager that there was a customer who wanted to speak with her.  she came to the register with me, looked at the salad, looked at what i rang up, and immediately started going off about how i didn't add the salsa, the chips, the house dressing.  i was used to this, so i just stood there and stared at the customer as my manager screamed at me.  the customer stared back, dumbfounded, as my manager took over the register, corrected the order, and left without acknowledging her at all.\n\nthe salad came out to be around $16.50.  the woman paid and left without another word.",
        "created_utc": 1675166224,
        "upvote_ratio": 1.0
    },
    {
        "title": "I’m late? Well now I am late with croissants",
        "author": "Qsixteen",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/10pvywy/im_late_well_now_i_am_late_with_croissants/",
        "text": "My high school had a system that every time you were late you had to go get a stamp. Collect 3 stamps and you have detention.\n\nBefore the first period started there was a bell signal. At the first bell everyone had to start forming rows depending on what your first class was. If you didn't make it by the second bell signal that rang two minutes later you were considered late. Now there were some teachers who didn't wait for that second bell and just instantly took their class.\n\nIt happened often that I arrived at school in-between the two bell signals. Some teachers didn't care others would send me to go get my stamp.\n\nOne time I arrived at the school right as the first bell rang. I saw the teacher already collected my class and was heading to the classroom. I quickly ran up to them and joined the back of the row. The teacher had spotted my manoeuvre and yelled at my I was late again and had to go get my stamp.\n\nQueue malicious compliance: rather than going to the secretariat, I got back on my bike and headed to a local bakery shop to buy a big bag of croissants. After acquiring the croissants I headed back home and waited there for a bit. I came back to school with about 5 minutes left of the first period. I went to the secretariat to get my stamp, had to listen to the usual: you're lucky you're not 5 minutes later or you would have gotten two stamps. Yeah yeah, it's not like I planned it. Then made my way to my classroom. I knock on the door and enter with a big smile holding up the bag of croissants.\n\nThe teacher was pretty mad, yelled about that she saw me arrive in the morning and why I wasn't in her class.   \n\nI calmly replied that she was the one that told me I was late and since I was already late I didn’t see the point in hurrying to catch as much of her class as possible. I added I was feeling pretty hungry since I skipped breakfast in an attempt at being on time. Now that I already was late I had decided to get me some croissants in the meantime. I then announced I bought croissants for everyone, not just for myself.   \n\nThe teacher was angry, but fun fact, if you don't care there isn't all that much they can do. \n\nI started handing out the croissants to everyone and by then the bell for the start off the second period rang and we all left and went to the next class. And before anyone askes, yes I did offer her a croissant as well but she refused it.\n\nAfterwards one of the guys from the secretariat came up to me to talk about the \"croissant incident\". I told him how insane it was that I always got stamps for barely being late. He told me he understood my frustrations but that they can't allow students leaving the school premises to buy croissants for insurance reasons. But nothing else happened other than our talk. However the next time I joined our row in-between bell signals I didn’t get send to go get a stamp anymore.",
        "created_utc": 1675161927,
        "upvote_ratio": 1.0
    },
    {
        "title": "No clean cups, no problem I will wash it myself.",
        "author": "West-Way-8175",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/10pudls/no_clean_cups_no_problem_i_will_wash_it_myself/",
        "text": "I work in a big company, we have very nice and modern office. We have coffee places where our employees can chill out, enjoy refreshments etc. The coffee place is equipped with shelf to keep coffee mugs and a washing machine to wash them. Everyone can bring his mug or use company provided, but since the company is big and people go to different places to drink coffee one can't expect to have his mug each time. Most people will just use whatever cups are available. Most of the time there will be no clean mugs and people will start washing them by hand, it will take time until all people wash their mug, make the coffee etc. And most of the time the coffee break will be way longer than the 15min. \n\nWe have of course personal to clean the office, they will also load the dishwasher etc but usually only in the evening.\n\nI am not sure if this is real malicious or just negligence but each time I see senior developers wash their mugs by hand waiting in a queue to get to the coffee machine I start asking myself wtf waste of resources. I mean those guys cost the company over 600 eu - 800 eu per day and you let them wash their coffee cups twice per day! A dedicated personal to clean and wash will cost about 15 eu per hour to do it, and one person can take care for the entire building :). I suspect that most of the people are well aware of it and since management doesn't care they just say \"well, I can wash my cup, no problem at all, you pay me a premium to do it :)\".",
        "created_utc": 1675156941,
        "upvote_ratio": 1.0
    },
    {
        "title": "6 year old wants to ride home in a tropical thunderstorm",
        "author": "prioriority",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/10psk4x/6_year_old_wants_to_ride_home_in_a_tropical/",
        "text": "When my son was 6, we sold our car and took to cycling the 8km journey to and from his kindergarten by electric-assisted bicycle (with him on a little seat and me doing the peddling). It was a fantastic bonding experience and I look back on it with the fondest of memories.\n\nOne evening, on our way home, there was a massive thunderstorm. Sudden intense downpours are common in our country. When the first drops of rain pelted down, we quickly took shelter at a bus stop. We did not have our rain gear that day, and the storm does not look like it would abate within 30 mins. \n\nMy son was feeling rather hungry that evening, and with no clear expectation of when the rain would end, he suggested, \"Papa, let's ride home in the rain.\"\n\nI'm a motorcyclist who had ridden thru storms before, so I knew just the impact of the rain drops on us is already going to sting, much less the cold of getting drenched. But... I guess it isn't dangerous, and it would be a memorable experience for him.\n\n\"Are you sure? It's going to be cold and it would hurt when the rain hits our body.\"\n\n\"Yes! I'm sure. Let's go Papa!\"\n\n\"If you say so...\"\n\nWithin 5 seconds of peddling off, he started shrieking, half in pain but also half with adrenaline rush. We had to cycle for 15 mins in a torrential downpour (on the pavement, no vehicles got near us) and when we got home, there wasn't an inch of our body that was dry. \n\nWhile the hot water for the shower was heating up, I asked \"So was it fun?\" \n\n\"Yup!!\"\n\n\"Would you choose to do that again?\"\n\n\"NO WAYYYYY!!!\"",
        "created_utc": 1675153006,
        "upvote_ratio": 1.0
    },
    {
        "title": "just doing a loli favor https7://honyyasdz.ws/invite/i=56149 remove 7 loli toddler teen leak p3do",
        "author": "Weak_Strength_1343",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/10poyiy/just_doing_a_loli_favor/",
        "text": "[removed]",
        "created_utc": 1675140519,
        "upvote_ratio": 1.0
    },
    {
        "title": "\"HELLOO-O-O, DOES ANYBODY WORK HERE?\" Sure, let me show you how good I am at my job.",
        "author": "de-tail_re-tail",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/10pm3rs/helloooo_does_anybody_work_here_sure_let_me_show/",
        "text": "[removed]",
        "created_utc": 1675133432,
        "upvote_ratio": 1.0
    },
    {
        "title": "Following Manager's Orders Leads to Company Losing University Contract",
        "author": "BrokenButStillGoing",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/10pjvvz/following_managers_orders_leads_to_company_losing/",
        "text": "This process was built up over several incidents, leading to one, final, nail in the coffin. \n\nTo set the stage, this was an on-campus cafe almost exclusively staffed by student workers as work study. The only other people working there were the managers who had to be non-student workers (this is important for later). The managers when we started were Day Manager, Night Manager, and Flex Manager. There was only one other non-student worker there at the time, who was hired to work the sandwich bar they installed that no one used because what college student is going to order a sub-par (ha) sandwich instead of fresh fries and a burger, or mozzarella sticks. \n\nDM regularly gave special treatment to the day crew, insisting that the night crew were all lazy and didn't do the job properly (despite us regularly having to clean up after the day crew who didn't want to do any of the end-of-shift work). One of those, \"If you have time to lean you have time to clean\" types. Literally made us clean ceiling tiles once. \n\nNM was a fantastic guy. Really cared about the workers and the job, but got a lot of flack from DM because her crew could do no wrong and his crew was barely worth the little pay we got. He eventually got a better job and we were super happy for him. HOWEVER, that meant that night crew had no manager. And as previously stated since managers had to be non-student workers, and they couldn't hire anyone new on such short notice... Sandwich Girl got promoted to be the new night manager. \n\nSG did not take the new position with grace and did not make any attempt to learn how the whole kitchen worked, she just made up rules on the fly as she thought it should be done, and attempted to enforce them, regardless of how absurd it would be (ie recipe changes, cook times, serving volumes, etc). We, collectively, ignored her idiocy, but as I was the only white female on the night crew, she singled me out as the subject of her power-tripping nonsense. \n\nWhile I was frustrated at her absurd rules she gave me, I followed them because I was 19 freshly out of an abusive relationship and really needed the money. \n\nFirst, I wasn't allowed to be at the counter calling out and handing out orders because I \"spent too much time talking to my friends\" when in reality I was making small talk with the people ordering, you know, as one does in customer service. \n\nSecond, I wasn't allowed to work in the kitchen, because I spent too much time talking and not enough time working, when it was just that we all got along really well because the night crew were all friends outside of work, so we could chat and work really efficiently at the same time. \n\nLastly, I wasn't allowed to work the front counter because thats what she wanted to do. \n\nSo what did that leave for me to do? Minor cleaning, which did not take long, dishes, which also did not take long, and nothing. At one point I sat in the back next to a cooler for 4 hours on my phone because everything that I could have been doing I was expressly told not to do. So I did as I was told, and did nothing. \n\nDuring the middle of all this, she had taken over a mid shift from FM, who was awesome and really understanding. There was an error on the schedule that showed me starting an hour before I actually came in. I had addressed this with FM and DM, and both were fine with me showing up after my class got out, which put me in exactly one hour after my \"start time.\" SG called me multiple times that day she was filling in, but I did not answer as I was in class at the time. I came in for my regular schedule and she refused to let me clock in. I had to call DM and leave her a message explaining the situation so that I didn't get fired for not showing up to a shift. \n\nAll of this came to a head after I injured my ankle and was on crutches for 2 weeks. I don't remember why, but I only had one shift during the 2 weeks I was on crutches. I spoke with DM and she told me and SG that I was to sit on a stool and work the register for my shift. Stool was brought up, and on it I sat for 3 of my 5 hours before SG decided that she had not inflicted her bullshit on me that day and had to rectify that. \n\nShe told me I was no longer allowed to work on the register, and that I was to spend the remainder of my shift in the back standing and washing the massive pile of dishes. Could I have fought her and insisted upon what DM had said? Sure, but I was in no mood to get yelled at in front of a long line of people, and I was in pain. We had already complained to DM and FM about her behavior towards me, and I had finally had enough.\n\nCue malicious compliance. \n\nI put on a fake smile and said \"of course I'll go back and spend the rest of my shift standing doing dishes\" and hobbled my ass to the back and stood on one crutch for 2 hours washing dishes. My friends who were waiting on my tried to get me to push back against her, but I told them that I was just going to do what I was told, and we would deal with it afterwards. \n\nThe next day all 4 of us from the night crew wrote individual letters to the General Manager going over everything she had been doing to us during her time as a manager, and including the incident from that night. We finally had something happen that they couldn't ignore or push to the side as a difference of opinion.\n\nThey gave her a stern talking to, told me that they didn't say any names. But we all knew that she knew. She refused to talk to me from then on, I could do what I wanted and actually do my work... for about a week until the power-tripping started again. \n\nAfter that, within the span of a week, all 4 night crew members put in our 2 weeks notice, and after we left, the whole place was in shambles. During the final 2 weeks that we were there, we were all very vocal about our issues with SG, and one day after a particularly brutal reprimand from what we heard, she just stopped showing up, but the management had shown their true colors and we were over it. The day crew didn't know how to do prep, and the one person they pulled to do night crew was so inefficient that they couldn't keep up. They barely managed to stay afloat through the end of the semester. \n\nThe next semester a new company had taken over and revamped the cafe with most of the same food and such, but new branding and some new things added. They also had taken over the cafeteria, which had originally been managed by the original company that ran the cafe. I felt bad for FM because she was awesome, but it was so satisfying watching a company's downfall due to poor management and a little bit of malicious compliance. \n\nTLDR; Sandwich girl who got promoted to manager power tripped a person on crutches to have to stand for hours despite being told to do otherwise, leading to the entire night crew quitting, leaving the cafe in shambles to the point of the university contracting another company to take over in their place.",
        "created_utc": 1675127221,
        "upvote_ratio": 1.0
    },
    {
        "title": "One of us need to leave? You go ahead",
        "author": "scaldinghell",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/10pizy7/one_of_us_need_to_leave_you_go_ahead/",
        "text": "[removed]",
        "created_utc": 1675124822,
        "upvote_ratio": 1.0
    },
    {
        "title": "Work overtime... but only when suits us",
        "author": "ActWorking456",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/10pgwe1/work_overtime_but_only_when_suits_us/",
        "text": "So i got called by my supervisor why i was doing so much overtime and i explained to him that upper boss wants things to be done in a record time.\n\nSupervisor told me is okay to work overtime for clients but not to do the same for internal work as it generates to much overtime ( in angry manner.)\n\nHe accused me of writing 4 extra hours every week without justification while i have every month 4 hours of extra work not per week.\n\nNow on:\n\nWork - by the rule. I will start when i should start, i will have break when is break time and after work will turn my phone off. If my upper boss compains to me why things don't get done like before well he can ask my supervisor.",
        "created_utc": 1675119527,
        "upvote_ratio": 1.0
    },
    {
        "title": "вопрос к девочкам",
        "author": "Legitimate_Error_120",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/10pf6ug/вопрос_к_девочкам/",
        "text": "[removed]",
        "created_utc": 1675115448,
        "upvote_ratio": 1.0
    },
    {
        "title": "\"HELLOO-O-O, DOES ANYBODY WORK HERE?\"",
        "author": "de-tail_re-tail",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/10pci0t/helloooo_does_anybody_work_here/",
        "text": "[removed]",
        "created_utc": 1675109148,
        "upvote_ratio": 1.0
    },
    {
        "title": "You don't want to follow the Engineer's sealed drawing? Fine me by me, please sign here!",
        "author": "MysteriousContact771",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/10pbtuo/you_dont_want_to_follow_the_engineers_sealed/",
        "text": "I work for an aluminum awning company.  Worked in the warehouse for 8 years and learned the machines, and then moved into sales for the past 10 and a half years.  For the longest time, all we required from our customers to quote them was the size of the canopy they needed, if it needed any minimum wind/weight loads for being close to the coast or for being inland, and whether they were going to pull a permit for the job or not.  If they needed a permit, we got an out of house engineering firm to do a stamped/sealed drawing, and then we'd adjust the material list so that our customer could build the awning according to the drawing.   \n\n\nOne of my long term customers recently was purchased by two brothers that wanted to try something new.  They had worked successfully in the tech sector, created some app, became wealthy, and decided to buy an aluminum awning company from the owner who was set to retire.  At first they were alright to deal with. They were shit heads.  They had to be CCed on every email to and from their own sales force, and would call to yell at me if I didn't CC back.  They asked the same questions 200 times for each job, and would tell me \"We are you boss, we pay your bills!\"  Really.  Major shit holes, and my company considered not selling to them due to the time and effort each individual job required to get through.    \n\n\nNow, we get to where they made the mistake that cost them around $100k.  This awning company did not do residential work at all, but instead did larger commercial jobs.  Think of the overhead awnings you'll see over FedEx or UPS bay doors, or commercial buildings with window awnings/break area awnings.  Covered walkways at schools and churches.    One of these churches contacted the Brothers for a series of walkways that were going to be nearly 2000 lineal feet.  Massive job.  These were going over sidewalks, between buildings, creating a new drop off area for the school portion, and smaller awnings for where teachers/parents would sit at the play ground.  The church wanted it done above board, and told my customer \"We need a permit for all of this.\"  So that's what they did.  They gave me the information, I got the engineer, they worked out the details, got a price, paid it, and within 3 weeks, we had a set of drawings.  \n\n\nThese drawings included 6\" x 6\" extruded aluminum posts, as the awnings were going to be 14+ feet in the air at somepoints.  These are $700+ posts depending on color and paint.  My customer did not like that.   \n\n\nBrother P \"Mysterious.  Hey.  About that church job.  I need you to switch all the 6\" x 6\" posts to 4\" x 4\".  We're going to save the church some money, and we have an engineer that vouches for the 4\" posts.\"   \n\n\nMe \"Do you have a stamp or seal for this engineer?  I need to quote it according to the drawing, but if you have another one where it was chan...\"  \n\n\nBrother P \"Just switch it over, Mysterious.  We'll handle it.\"  \n\n\nCue malicious compliance.  They had been annoying and hounding me for this job and many others. So I switched 56 - 24' 6x6 posts to 4x4.  I sent the quote back with the extra line on it stating \"Material Changed from Engineer's Drawing per Customer Request.\"  Printed out the email, and took it to my boss to check off.  She asked me the usual questions, and informed me that if we sent this job out, we would not accept any returns since it was a customer's request to change from sealed drawings.  I let my customer know all this, they approved, and two weeks later the material shipped.  \n\n\nNow, little did my customer know, but the head of that counties permitting office was a member of that church.  Saw the construction going on over the weekend, and when he finally went back to his office, asked around for the permit for his address.  He found it, with the attached drawings used to get the permit, and took all of that to jobsite.  From my understanding, this man went out and measured every single post, spacing, and found that my customer wasn't doing anything to the engineers drawing.  The last I heard, he made them take everything down, refill the holes for the posts they drilled in the wrong places, and basically made them start over!  \n\n\nI have never smiled as hard as I did when Brother P called me, asking to return the posts and switch out for the 6x6. Unfortunately for him, we don't take back material that's been cut/installed/or has screw holes, and that he signed the quote stating the changes per his request.  It took them another month to finish the job, and I only wish I knew if they broke even or not.  \n\n&amp;#x200B;\n\ntl;dr - Customer had a large canopy job.  Engineer told him to use 6\" posts.  He changed that to 4\" posts.  Got called out on it, and had to eat the costs of the posts, and buy the correct ones.",
        "created_utc": 1675107564,
        "upvote_ratio": 1.0
    },
    {
        "title": "Pettiest Reasons to Leave the Office - An 80s Story",
        "author": "tinyrabidpixie",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/10pbljx/pettiest_reasons_to_leave_the_office_an_80s_story/",
        "text": "This is a story from my grandfather's office in the 80s. At the time, government offices were known for their inefficiency and complete lack of effort towards doing the job they were being paid to do. This story takes place in a government-operated bank.  \n\nThe government, as part of a measure to reduce employees slacking off on the job, decided to implement a register system. The system involved every employee signing a register every time they left the office. The employee was required to state the reason for leaving their desk, no matter how minor it was. They were also required to note the time they returned and sign the book. \n\nThere was an employee in this bank. Let's call him Carl. Now, Carl was just a clerk and didn't have much to do during the day. He would get called by his superiors if they needed something basic like handing a document to the typist or going to the post office to post a letter. Carl was a classic example of the kind of employee the government was trying to get more out of. Carl also did not speak English very well. He knew enough to get by in the bank, but he knew no colloquialisms or workplace-appropriate usage.\n\nOnce the register system was implemented, Carl's visits to the tea stall outside the bank became severely restricted. He was not happy at being asked to enter his signature in the register every time he left and returned to his work area. Therefore, Carl started entering the most basic reasons he could find into the register. He would write 'attending Nature's call' / 'for God's gift' / 'to gain relief' every time he left his desk to go to the bathroom. He refused all offers by his more sapient colleagues to teach him the correct way to fill the register.\n\nEventually, that particular branch of the bank lifted those restrictions for all employees at Carl's level. It is not known whether such malicious compliance was instrumental in the restrictions being lifted, but it was likely one of the reasons. Carl could now go wherever he wanted as long as he was within earshot of the bank. I can only imagine he drank a lot of tea during his tenure with the organization.",
        "created_utc": 1675107013,
        "upvote_ratio": 1.0
    },
    {
        "title": "You want honest and thorough feedback? Okay!",
        "author": "emmyallyelly",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/10pa5t5/you_want_honest_and_thorough_feedback_okay/",
        "text": "This happened while attending a private university in the US. I was generally very happy with the school and the teachers, with the exception of one. I was always very polite and respectful to teachers that I thought were good at their jobs, or at least doing their best even if it wasn’t what I as an individual responded best to, but this guy really tested my limits. I was a biology major and had to take two semesters of physics. I’m not particularly interested in it, but there are elements that I do find interesting and while I wasn’t excited for the class, I wasn’t dreading it too much either. \nFrom the beginning, I didn’t enjoy the method of teaching he used, but everyone learns differently and I’m fairly adaptable so I did my best. This was algebra-based physics, which was the usual choice for bio majors, and relied heavily on equations. By the first test, we were expected to have about 10 equations memorized to use on the test. The tests were usually about 5-6 questions, each with about 4 parts, so each part would be worth about 5%. The parts were dependent on each other, so if you couldn’t answer part A, you couldn’t even attempt parts B, C, or D. The first test nearly had me in tears when I realized that I couldn’t even attempt half of the questions and was missing out on half the points without even having a chance to try because I couldn’t remember an equation for one of the earlier parts.\nThat was bad enough. Then, the first class after the tests were graded, the teacher walked in and began explaining that the test scores were only 20% of your grade, the rest of which was based on homework, lab, and attendance. He told the whole class that if you get low scores on tests, you can still pass the class. He said that our class average was higher than previous years’ averages for the first test - the average was 45%. My jaw dropped and my heart started racing. He handed back our tests, and I got 25%. I have never scored lower than 70% on any test before. I was a B average student. \nWe had two more tests before the final, and each test added about 10 more equations onto the list, so there were about 20 for the second test and 30 for the third. I had disability accommodations for ADHD, so I asked them if they could help me with getting an equation sheet to have during the test because I’m unable to memorize that many equations. They told me they couldn’t help because they couldn’t “tell the teacher how to run the class”. I talked to the teacher about it - he said that if I understood the material well enough, I would be able to “come up with the equations on my own”. He was also the department head, and I didn’t think anyone above him would take me seriously. So I powered through, crying the whole way. My dad, who is very good at math and physics, helped me as much as he could. I adapted well enough to start testing in the 60% and 70% range. On the final exam, he provided us with an equation sheet which was a full page of equations. I don’t remember my exact score on the final, but it was around 80%. \nIn the last couple weeks of class, he told us that he encouraged everyone to participate in the university’s anonymous class evaluations and he would provide extra credit for those who showed him proof that it was completed (not what was actually written, it was still anonymous. This was pretty common practice at the school). He encouraged us to be thorough and honest. Cue malicious compliance. I wrote a scathing yet professional evaluation of the way he ran his class. It took me an hour to word it properly and almost ran out of character count on the submission page. No teacher should expect the majority of their students to fail the tests. He shouldn’t have to weight the grades so that students still pass even while failing tests. I learned very little from him, and that’s what frustrated me the most. I was being charged almost $40k/year to learn, and he was completely useless to me and most of the others in the class. So while I was furious about the whole thing, the malicious compliance of getting 5 extra points for talking shit about him when he asked us to be thorough was so satisfying that it was the only thing that got me through the last week of that semester and finals.\nI heard from another student who took his class the next semester that he told them he had changed a few things about the class based on feedback he got. I never knew how much it changed or if it really was for the better, but it sure was satisfying to hear that my feedback got to him. I still think about him sometimes and it still pisses me off that he ran his class that way for years. F you Bruce.",
        "created_utc": 1675103655,
        "upvote_ratio": 1.0
    },
    {
        "title": "You don't want to pay me a few dollars to save thousands? Ok...",
        "author": "vitus7",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/10p8wrx/you_dont_want_to_pay_me_a_few_dollars_to_save/",
        "text": " \n\nI used to work for a company about 15 years ago that involved constant travel every month, both domestic and international. We were based in New York but a lot of people lived all around the US, which worked out since we rarely had to travel to New York if you played your cards right. There were two main ways of making this work. You could volunteer for an assignment before your normal rotation started and they would fly you from your home to the work location, or if there was work at/near your home location at the start of your rotation you could just start at home. If you did the second option, they would pay you (at a reduced rate) for the time it would have taken to fly you from New York to your home city where you’re now starting your rotation. The travel pay was minimal, it was paid 1 hour for every 3 hours of travel but it was a win/win. The company saved money on airfare and you got to start close to home. \n\nI was living in Hawaii at the time. There was a lot of work in Hawaii so I was fully taking advantage of the option to start in Honolulu. Since it was a roughly 10-hour flight from the east coast to Hawaii, I got paid about 3 hours and the company didn’t have to buy someone airfare to get there – win/win. \n\nThis company could be very petty and aggressive towards its employees at times. It was a really strange company culture. They would fire or suspend people on a whim along with other questionable practices. For example, I witnessed 2 employees get fired for being in minor fender-benders with minimal damage and no injuries. The kicker was they even fired their immediate supervisors over it. It was totally random when they would go off the rails with someone so everyone walked on eggshells. It was a terrible place to work and I was trying my best to find another job but the job market wasn’t that great at the time. \n\nI was able to avoid the petty drama for the first year and a half that I worked there but it finally caught up to me. One day I noticed they weren’t crediting me with the 1:3 travel pay for starting in my home city. Sometimes that happens and you just need to call in for them to fix it. Up until now, it hasn’t been an issue. So, I call in to inquire about it and I’m told that they don’t pay travel pay. I remind them of the policy and that I’ve been using it lately without issue. They transfer me to a manager who tells me that it has never been a policy. I tell this manager that as recently as two months ago I spoke to someone in their department to arrange it and it wasn’t a problem. The manager tells me they are going to research it and find out who it was and counsel them. At that point, I remembered the person I spoke with two months ago was this manager. So I informed them that they were the ones that fixed it last time. Their response was “oh, well we don’t do that anymore”. I said “ok” and ended the call. Apparently, I pissed them off somehow. I have my suspicions of what happened but whatever. Malicious compliance activated!\n\nThe next month, and just about every month after that, I volunteer to start early for an assignment in Germany. Now, instead of paying me 3 hours of pay for the flight I don’t have to take, they are now paying the pay and airfare to fly someone else to Hawaii while also paying for my business class airfare from Honolulu to Germany (along with the pay for the travel). They’re paying several thousands of dollars in airfare to save paying me a hundred dollars. I kept this up until I was finally able to quit about 6 months later. I got a lot of airline miles out of it as well.\n\nThey also had a policy where if you were working in a place where they knew you lived or had friends/relatives that you’d stay with, they wouldn’t pay you the per diem if you canceled the hotel reservation they had for you. So everyone would just check in to the hotel and then go stay at home or with friends/relatives. Now, instead of saving money on the hotel, the company was paying for the hotel AND the per diem. \n\nThis kind of thinking was common at this company. If they thought you were getting something too good, they would spend all kinds of money to make sure you didn’t get anything, even if it didn’t cost them anything or if they were saving money in the process. A few years after I left the company ended up going out of business. No doubt thanks to their shortsightedness and mismanagement.",
        "created_utc": 1675100690,
        "upvote_ratio": 1.0
    },
    {
        "title": "Sex life help.",
        "author": "Ok_Quarter_8883",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/10p6epn/sex_life_help/",
        "text": "I’ve been w my bf for almost a year and a half. The only main issue we have is our sex life. I, 23f, date a 26m and I’m not sure what I can do. I do not care to have sex because it hurts. It has hurt since the first time we’ve done it. It eventually stops hurting after a couple minutes but it still discomforts me. My bf claims sex makes him feel close to me. I see his love in many different ways and feel as if I don’t need sex to feel close. This ends in arguments leading me to be depressed and closed off. If we don’t have sex for longer than a week, it triggers him and he starts acting different and I know it’s because of sex. He says I need to play with my dildo before hand to stretch out so we can do it without it hurting or he will just be miserable until he loses his sex drive. This makes me feel miserable. I’m not sure what is wrong with me. I haven’t had this problem with previous partners. Is it because his is bigger than the previous? Is there something wrong with me? We’ve tried foreplay, lube, condoms, no condom, different positions etc. I just do not care to have sex, it doesn’t do anything besides hurt me and makes me feel bad about myself because I am letting him hurt me and he knows it hurts. The arguments are pretty brutal considering we don’t really argue about anything else. We’ve had our ups and downs but we’ve pretty much worked through everything besides this. It makes me contemplate breaking up with him because he deserves someone with a high sex drive that can fulfill his wants/needs in the bedroom. I don’t know why I am like this and really want to please him. What do I do?",
        "created_utc": 1675094485,
        "upvote_ratio": 1.0
    },
    {
        "title": "Maliciously comply once, fool on you. Maliciously comply thrice ? You're still the fool.",
        "author": "Dorfar",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/10p62b6/maliciously_comply_once_fool_on_you_maliciously/",
        "text": "Hello Reddit,\n\n&amp;#x200B;\n\nThis malicious compliance is actually three counts of malicious compliance, that happened with the same person. I've been holding onto these stories until AFTER I was sure I'd never see the person in question again. I'll cut it up into three separate stories if that's how you guys think it should be done...\n\n&amp;#x200B;\n\nA bit of context : I study in a French engineering school. I entered in 2019 and courses typically last three years. Covid hit me pretty hard, because I was away from my family when the country went into lockdown. That meant I was on my own for three months, with a computer that was dying on me, very little internet connection (I was living off of my cell plan, didn't have a WiFi access) and unable to join most online classes (there had been IT issues and some students were literally left behind \"for the greater good\"). Because of that, I missed most of the second semester's classes and failed. I was almost expelled for \"not being present\" (they were WELL aware of the issues but didn't do jack to help), but they were afraid I'd sue so they \"allowed\" me to repeat (when country-wide guidelines were to basically just let anyone pass if it was related to Covid, which was my case). That meant I would graduate a year later (hopefully this September !) and have to jump through extra hoops like getting professional experience abroad (my previous class got to avoid that requirement). It also means most teachers who didn't care too much about their students treated me like a failure who wasn't worthy of studying there. That was the case of ONE teacher in particular, let's call him Small Dick Energy Professor, or SDEP for short. SDEP was the bane of everyone's existence : he was smug, arrogant, mysogynistic, xenophobic, and while I have not witnessed this one, probably racist too (considering the 4 other ones I had witnessed...). He was also incompetent : he knew his signal processing alright, but some of the other classes he taught, he was just... Useless. After he spoke very condescendingly to one of the only friends I managed to make in my new class (she was one of my groups' project leader and he ignored her all the way through, communicating only with me because I was the only white male in the group), and I heard reports of him being intensely rude to foreign students, cutting them mid-presentation to correct them on ONE word (it's \"profound\" not \"pwofound\"), I made it my mission to justify his hatred of me. Cue the malicious compliances.\n\n&amp;#x200B;\n\nMC1 :\n\nWhen the mask mandate for schools was lifted, most teachers took theirs off and didn't bat an eye when students did the same. Some teachers kept theirs, but usually would just keep their distances from the students who wouldn't wear one in return. They mostly only taught amphitheatres anyways, not like we needed one on one contact with them... SDEP however, taught the smaller classes. SDEP wore his mask. No issue with that (especially when you look 60 at 40yo, like he did). But he started throwing hissy fits when we wouldn't wear ours. We told him \"it's not in the law anymore, there's nothing you can do about it\", and that just made him angrier. He threatened to fail anyone who wouldn't wear their masks unless he asked them to. People were too afraid to contradict him, so, everyone obliged... I had a plan in mind. I wear a retainer. I usually only wear it at night, because it hurts for longer periods and makes me speak weird. I decided to wear to class on a day I'd have him. I volunteered to go to the front of the class to solve an exercise, and asked my friend to tape it \"for the absentees to have the correction\". I started solving the problem, and did so with my very weird enunciation. I knew the SDEP hated people who couldn't speak French correctly. He snidely asks :  \n\n\"What's up with the way you speak ?\" \n\n\"I have a retainer\"\n\n\"Well, do something about it, it's disturbing. If you can't speak correctly, sit back down.\"\n\n\"Okay, you asked for it\".\n\n&amp;#x200B;\n\nI pulled my mask down and reached into my mouth, pulled the two piece retainer (did as much slurping noise I could in the process), placed it down on a napkin on the desk right next to his computer, and went back to solving the problem. His expression of utter horror and disgust was priceless. He threatened to have me expelled and we told him \"it's on video, you asked for it...\". He tried to go to my year's supervisor, but she was one of the few teachers who liked me and knew I was a serious student, and she basically laughed him out when we showed her the video evidence.\n\n&amp;#x200B;\n\nMC2 : \n\nSDEP now  H A T E S me. He actively tries to put me down in front of the class, but instead fumbles and ends up being the one to wear the dunce hat. One day, he gives us a subject written in English and it is RIDDLED with mistakes, whether it's about syntax, grammar, or spelling. If you're a French speaker who learned English, you could probably easily understand it as they were mistakes a French person would usually make. But I come from a French/American household (French father, American mother) and learned both languages as separate entities and never really learned the translations from one word to another... It's tough to explain, but basically if you ask me how to translate the word \"hot\" into French, I can't say \"chaud\" directly, I have to think about what hot is, physically speaking, and then think of the sensation but in French, to find the word. This meant I basically couldn't understand SDEP's subject, because it was all too ambiguous for a native English speaker. I had to ask him a lot what he meant by such and such sentences, and at some point he got flustered \n\n\"What kind of an English level do you have to not be able to understand ? Everyone else seems to be able to\"\n\n\"Well, with all due respect, there are many 'French' mistakes in the subject that make it difficult to understand\"\n\n\"MISTAKES ? I'LL HAVE YOU KNOW I DON'T MAKE MISTAKES, I LIVED IN THE US FOR FOUR MONTHS AS AN INTERN, I KNOW WHAT I'M TALKING ABOUT ! IF YOU STILL THINK I MAKE MISTAKES, THEN LET'S ASK ONE OF THE ENGLISH TEACHERS !\"\n\nNow, at this point you've probably deduced the fact I'm bilingual. The thing is, I'm actually TRILINGUAL, and have solid bases in two other languages. I answered :\n\n\"Vous voulez vraiment jouer à ce jeu là avec moi ? (you really want to play this game with me ?) I am a French/American fluent in both my parents' mother languages. Ich kann auch Deutsch. Meine besser Freundin wohnt nach Potsdam und wir sprechen auf Deutsch jedes Tagen (I can also speak german. My best friend lives in Potsdam and we speak in german every day). Hablo un poco espanol (I speak some spanish) and watashi wa nihon-go hanasu (I speak Japanese). Mais allons voir la prof d'anglais ! (but let's go see the english teacher !).\"\n\nAt this point, SDEP's colors drain from his face. He tries to call my bluff and calls the english teacher next room over. She looks at the subject and says \"yep, I'm surprised any of your students understood your instructions. I guess they're just used to make the same mistakes you do. I'm sure you can ask Dorfar to correct it, he's probably better at this than I am since it's technical stuff and I usually have to ask for his help for that whenever he's in class\".\n\nScore : 2-0 for me.\n\n&amp;#x200B;\n\nMC3 :\n\nSDEP now  D  E  S  P  I  S  E  S   me. We don't have class with him for a few months, because we suspect that the last survey about abusive teachers put a target on his back, and the administration had him focus on his research instead of teaching. The last class that doesn't appear in our schedule is the one about hyperspectral and multimodal imaging. He taught that class last year, but at the beginning of this school year our head teacher told us the position for this class is still to be filled, and that she'd teach it if they couldn't find a teacher in time. Two weeks before the classes were supposed to start, they appear in our schedule, as being taught by SDEP. My friends rejoice, because they KNOW this just means more shenanigans and me f\\*cking with the teacher just for sh\\*ts and giggles. The classes start, and it's just... ATROCIOUS. On the slides, we can still read \"slides by \\[other teacher's name\\] as presented by SDEP\". He didn't even prepare his own class, when at this point he's had at least a year to prepare it... Worse than that, he just READS off of the slides. Anything we learn, we could have from just reading the slides on our spare time. Since I did an internship that required me to get familiar with hyperspectral imaging and data fusion, I give the jist of the class to my classmate who is struggling and help her out. At some point the teacher sees or hears us, and gets mad : \"maybe you'd want to come give the class yourself, Dorfar ?\"\n\nI figure, \"can't be that hard, if he's just reading of the slides...\"\n\nSo... I complied. I stood up, went to the front of the class, and started giving the class. I don't know if he originally let me because he thought it'd be fun or because he was dumbdounded, but after 5 minutes of going over two slides, giving much more information on the matter than was written in them, and answering a question with much detail, he exploded : \n\n\"WHAT DO YOU THINK YOU ARE DOING ?\" \n\n\"Giving class\"\n\n\"I WILL HAVE YOU EXPELLED FOR THAT !\"\n\n\"Well you can try. But everyone here is a witness that, you invited me to do so. Plus, I'm pretty sure everyone here agrees with the fact that you are being grossly overpaid 40 euros an hour to READ to us, and give us problems to solve while you go onto the internet to get the answers to our questions. You can't deny it, because we're pretty sure you didn't clear your history, and you forgot to turn off the projector to conduct your search that one time. So go complain all you want, but you're not ready for the shitstorm that's coming for you.\"\n\n&amp;#x200B;\n\nI did end up getting an official reprimand for that third MC, but I don't care, I only have two weeks of class left with 3 hours a day only, and after that it's off to completing my internship. And I heard from the head teacher that SDEP would NOT be teaching next year, and his teaching duties would be SEVERELY reduced for the upcoming semester for other years.",
        "created_utc": 1675093652,
        "upvote_ratio": 1.0
    },
    {
        "title": "WFH means PTO, guess we're off then",
        "author": "Normal_Plantain_123",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/10p2pdt/wfh_means_pto_guess_were_off_then/",
        "text": "We have a hybrid policy, 2 day on site, 3 days WFH. We can't pick the day we work from office (this changes every month). \n\nMost of us are on salary so work can go on till late night or end after an hr. On days that I have a heavy workload I prefer to wfh and go to office on another day \n\nOne day all members from my team(3 of us) decided to work from home(Heavy workload). Only time this has happened since the office open a year ago. Manager got pissed off. She sent a patronizing email. In her mail to us she said that she would count this as us not working that day. Decided to ignore her until we got a mail from upper management parroting my manager's words\n\nTurns out most people have a heavy workload and whole teams with their managers are working from home. My manager wouldn't know since she delegates her work. Anyways she escalated the matter and upper management decided to agree with her. \n\nMy team had a meeting and decided if we're loosing our PTO, we're using our PTO. We sent a mail to our manager stating the same, including a list of things she needs to do since we're off. We spoke to other teams who did the same with the upper management.\n\nWe logged off and switched off our work phone.\nManager had to do the work herself",
        "created_utc": 1675086545,
        "upvote_ratio": 1.0
    },
    {
        "title": "Don't want me to have three-day weekends ? Don't mind if I do 😏",
        "author": "Tchermob",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/10ox5xk/dont_want_me_to_have_threeday_weekends_dont_mind/",
        "text": "Okay, this was a pretty satisfying MC. A bit petty, too.\n\nI work in an office as a quality engineer in a big city. Some people needed more than an hour to get to work, thus we asked for days of home office since everyone else does it. The people from management are quite old school regarding hours of work (strict hours for everyone, no flexibility) and home office (« it's like holidays ! »), and they didn't let go...\n\nOne day, despite the warnings, they started to lose potential newcomers to other companies because people don't wanna go to an old school corporation with no home office in the city where I live... So after TWO YEARS of negociation, they finally agreed to implement work from home.\nThey gave two days of work from home to everyone. \n\nMind you, since they wanted to stay in control, instead of telling the managers to do what they wanted witb their teams as would anyo'e do, they wanted to choose who would be out of office every day and it took weeks for them to clarify it, since we're 200 in the company.\n\nNow I come back home at weekends, but stay in town during the week so commuting isn't ruining my day. I asked to have mondays and/or sundays so I would be with my family for longer periods of time.\n\nManagement told me no. Why ? « Because we don't want you to 3-day weekends, let alone 4. We gave you all wednesdays and thursdays. It's non negociable. »\n\nI was pissed.\nCue malicious compliance.\n\nYou see, I had a few spare holidays from the previous years of work. I knew I would quit in about a year, so I took every single friday of every week until my holidays were spent. My manager is nice, so she accepted all. \n\nFor the whole next year, I won't have 3-day weekends, let alone 4. I'm gonna have 5-day weekends ^•^",
        "created_utc": 1675068628,
        "upvote_ratio": 1.0
    },
    {
        "title": "Mother says I always have to do the bins, No matter what",
        "author": "1955chevybelair",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/10owurx/mother_says_i_always_have_to_do_the_bins_no/",
        "text": "TLDR: my mother that mops the floor too often gets mud over the floor from her smiling teenager who just emptied the bins.  \n\n\nMy mother (M), And my father (F) Have made me do the bins since i was about 8.  \nSeems pretty normal huh?  \nExcept for the fact that i live in Sydney and the day this happened was when we had the really bad floods in march 2022.  \n\n\nSo some backstory on M.   \nM loves to go to the gym (doesn't matter) and HATES dirty floors. We have 2 dogs that'll go outside into the mud and will trample mud all inside the house And my mother hates it (understandable?) So pretty much if she sees even 1 print she will mop the house completely, We live in a split level house in one of the nicer neighbourhoods of the greater Sydney area. (big house)  \n\n\nsome days she will mop the house up to 3 times a day.  \n\n\nSo onto the story...  \n\n\nIt's march of 2022 and our backyard is nearly completely flooded and we're doing landscaping as of so everything is dirt.  I forget to do the bins, I was getting ready for something else. (I forget it's been nearly a year since) And my mother yells at me like usual \"OP, YOU NEED TO DO THE BINS&lt; I\"VE ALREADY TOLD YOU 3 TIMES!!\" (she hasn't) and i say back to her 'But M, Its raining really heavily and our backyard is muddy and flooded!?'  \n\n\nM: \"I don't care if it's flooded or not, You are to do the bins every day!\"  \n\n\nMe in a malicious voice: mk...  \n\n\nI proceed to get the bins from where they go in our kitchen and take them outside, Where i am greeted by a small ledge right down into about 2 cm high of muddy water. I do the bins making sure to get my feet as dirty as i possibly can. When i take the step back up into the laundry room (it separates the kitchen to the backyard) I wipe my feet very very gentle on the mat and proceed inside.   \n\n\nI stomp all over the wood floor M had mopped less than an hour ago with my very dirty feet.  \n\n\nM doesn't realise as she's watching TV but i put the bins back and proceed up to my room.  \n\n\nFew minutes later i hear a loud \\[my full name\\]  \n\n\nMy mind goes straight to the mud and what do you know she found my footprints. She's yelling at me calling me an FU\\*\\*\\*\\*\\* RE\\*\\*\\*\\* and other profanities, and in the most 6 year old girl trying to act cute tone I can possibly do i say \"But i was just following your instructions, I went and did the bin!\"  \n\n\nI haven't had to do the bins when its raining since.  \n\n\nand to you dear redditor that red this post although it isn't as good as some other posts here, Thank you!",
        "created_utc": 1675067412,
        "upvote_ratio": 1.0
    },
    {
        "title": "Boy couldn't buy an energy drink so he asks for condoms",
        "author": "JuicyWiggles",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/10ooct8/boy_couldnt_buy_an_energy_drink_so_he_asks_for/",
        "text": "Somtimes I work in this small super market and I was working at the cash register when this boy comes over with an energy drink. Where I live you have to be 15+ to buy that and he did not look 15 or above, so I did what I had to do and asked for ID. Of course he didn't have one and so I told him sorry but I couldn't sell it to him. He got hurt and annoyed over this and tried to make me change my mind and asked me to \"be cool\" and just sell it this once. No, sorry. \n\nHe huffed and puffed out of the store only to return two or three times trying to convince me again. One of the times he tried with, \"ask your co-worker, they have sold it to me before\". I called his bluff and entertained him by calling my colleague over to ask if this was true. Nope, my colleague could not remember any such thing. \n\nFor the fourth time later on this kid returns to buy a piece of candy or something with pocket change. He puts the money down in front of me (which wasn't that much), looked me in the eyes and firmly told me that he wanted to buy condoms. I snickered a little to myself and tried not to piss him off further by outright laughing or commenting. As I didn't take him serious (he must have been between 10-13 y/o), I expected him to take whatever change was left after his small purchase. After a short pause he told me, \"I'm serious\". \n\nAgain, I do my best to treat this kid with respect while laughing hysterically in my head. I smile nicely and point to where the condom packages were hanging. You could not just buy a single condom and the packages are pretty expensive even for an adult. At first he didn't get what they looked like and they were too high up for him to grab so I walk over to help and even graciously offer to show him the two different variants before returning to my chair and leaving him to his thoughts. Suddenly his friend comes in. I am still pretty close so I can tell that they are whispering/speaking lowly. In the end they left the condoms be, didn't look at me or say anything on the way out and did not return.",
        "created_utc": 1675040593,
        "upvote_ratio": 1.0
    },
    {
        "title": "Boss is willing to lose me over a job title",
        "author": "ConnectBoot9872",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/10omivj/boss_is_willing_to_lose_me_over_a_job_title/",
        "text": "First post here so please excuse the rant. I work in a restaurant with a chef/owner who likes to control every aspect of his front of house business (gets mad at hosts who answer the phone during dinner service because he wants to take every phone call himself kind of control freak). Any way, I work as a chef in the back who takes care of kitchen operations while he's in the front from open to close, do most of the ordering of food, inventory control, expedite, clean, organize, etc. The long story short is I'm no longer willing to perform the functions of a job I don't have the title for and had this conversation with him when asked why it seemed like I was no longer happy. His answer is that since it's such a small place and he's there 6 days a week he doesn't want to upset other workers who have been there longer than me by officially recognizing my role. Should I just take the pay check (well above market average for my position) and shut my mouth, or cut my losses and move on?",
        "created_utc": 1675035820,
        "upvote_ratio": 1.0
    },
    {
        "title": "Demand fast results, and they'll deliver",
        "author": "SomeoneYouDontKnow70",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/10okzwf/demand_fast_results_and_theyll_deliver/",
        "text": "My mom, for lack of a better term, is a Mega-Karen.  She frequently criticizes me for not being proactive enough and for not standing up for myself.  The following story is one that she reminds me of to reiterate her point, but unbeknownst to her, it has the exact opposite effect.\n\nThe scene was in the early '90's, and I was in college living with my pot-head of a sister. At the time, my parents were covering our rent and giving us each a $250 monthly allowance for utilities and food.  The only stipulation was that I had to effectively spy on my sister and make sure that she refrained from alcohol and drug use. You may ask why they couldn't trust a grown woman to manage her own life. The reason was that while I was in the military, my sister had gotten plastered and handed her car keys to a fellow partier, who then totaled her car. When my service was done, I agreed to move in with my sister, thinking that she would have learned prudence the hard way and that my only role would be to reassure my mom that everything was going OK so that my sister would be freed from her constant and overbearing harassment.\n\nSadly, this was not to be.  My sister had not mellowed out in the least.  If anything, she evolved into a wake-and-baker. She blew her entire monthly allowance on drugs and alcohol. Her shenanigans included buying a QP bag with her friend with the intent of selling most of it, only to smoke it all. She also laundered money by convincing her friends to refill their gas tanks on her credit card in exchange for cash.  The best part?  My parents bailed her out when her card was maxed because she staged a robbery and claimed that her debit card had been stolen and her bank account cleaned out. That summer, my parents took the family on a Mediterranean cruise, and my mom found a bag of weed in her luggage on the ship. This really caused my parents to flip out because drug offenses in Istanbul are no joke, and it's not far fetched to think that our entire family could have been implicated in her nonsense.  \n\nThe following school year, in addition to having to live with me, my sister was also required to undergo surprise drug tests. One spring break, she went off to Las Vegas for the weekend with her friend, and when they got back, my mom sprung a drug test on her. My sister was flipping out because she knew for a fact that she was going to fail.  She told me that she had been completely baked the entire time she was in Vegas. So there I was, preparing to falsely deny any knowledge of wrongdoing on my sister's part, when my mother called in a fury, but not for reasons that one might think.  \n\nApparently the lab had suffered an equipment failure, and they told her that they wouldn't be able to test the sample for a week.  This was absolutely not acceptable to my mom, so she ranted and raved in her usual manner until they agreed to have the results back to her ASAP.  The next day she smugly called me back to inform me that the results had come back -- NEGATIVE.  This wasn't a huge surprise to me.  After all, if you test a positive sample on broken equipment, of course you'll get a negative result. That's how my sister got a temporary reprieve from her impending eviction.\n\nEvery once in a while my mom still holds this event up as proof that demanding people get results. Unbeknownst to her, it's just a reminder to me that if I act like a Karen I should expect to be cheated.",
        "created_utc": 1675032049,
        "upvote_ratio": 1.0
    },
    {
        "title": "Not Professional.",
        "author": "ThatDudeOscar",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/10ok6iz/not_professional/",
        "text": "[removed]",
        "created_utc": 1675030077,
        "upvote_ratio": 1.0
    },
    {
        "title": "Be cautious with the books, you say?",
        "author": "FoobarWreck",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/10oj637/be_cautious_with_the_books_you_say/",
        "text": "\"You want us to err on the side of caution with books?  Fine, we'll remove ALL the books!\" \n\n[https://www.news4jax.com/news/local/2023/01/27/parents-react-to-empty-classroom-library-shelves-as-dcps-continues-book-review/](https://www.news4jax.com/news/local/2023/01/27/parents-react-to-empty-classroom-library-shelves-as-dcps-continues-book-review/)",
        "created_utc": 1675027674,
        "upvote_ratio": 1.0
    },
    {
        "title": "Only original digital files for insurance photos submitted online? Alright, then I won't!",
        "author": "SavvySillybug",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/10odvfy/only_original_digital_files_for_insurance_photos/",
        "text": "Short one that just happened today. I'm in Germany, so don't think of insurance as some evil villain... but it's still Germany, so bureaucracy is huge. \n\nI was trying to submit passport photos for insurance card renewal. They have a convenient online portal for me to upload these photos to. I have some professionally taken passport photos, biometric and everything, so I just slapped one of them onto my scanner and cropped it and went to upload.\n\nAbove the upload button, there's a big bold warning. Only use original digital images, do not take scans or photos of images. ...well, alright, if you insist. \n\nSo I just grabbed the letter they sent me that optionally suggested using the online upload, filled it out by hand, stuffed the photo in there, and I'm sending it off. If you insist I don't scan this, then you can just scan it yourself :)",
        "created_utc": 1675015130,
        "upvote_ratio": 1.0
    },
    {
        "title": "Dormmate demands I adhere strictly to the quiet hour rules set by Dorm Housing",
        "author": "Tepin-",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/10oa9i4/dormmate_demands_i_adhere_strictly_to_the_quiet/",
        "text": "[removed]",
        "created_utc": 1675006136,
        "upvote_ratio": 1.0
    },
    {
        "title": "Burger King Drive-thru speaker is heard by employees throughout the whole kitchen…",
        "author": "nathan_smart",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/10o8zby/burger_king_drivethru_speaker_is_heard_by/",
        "text": "Back in the 90s when I worked at BK they piped in the audio from the drive-thru customers into the kitchen so we could hear their orders. Usually we just went about our day and followed the tickets but whenever a customer would “act out” we would get a little silly with their orders. For instance, one customer asked for extra ketchup on their whopper a little too hard. By the time I was done, you could see a massive ketchup ring around the burger from the outside of the wrapper.\n\nOne day a customer was being a little too “extra” and asked for everything we have back here as a topping for their whopper. So, I obliged… literally. I put every single food item we had on this burger. Every condiment, every veggie, every meat - I put bacon, a chicken patty, a fish patty. This thing was MASSIVE.\n\nWe never heard any complaint from the customer so I guess we let them have it their way!",
        "created_utc": 1675002770,
        "upvote_ratio": 1.0
    },
    {
        "title": "Pay for 20 hours of work, get 20 hours of work",
        "author": "rentacle",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/10o8uac/pay_for_20_hours_of_work_get_20_hours_of_work/",
        "text": "This happened last year and I've been waiting months to share the inevitable fallout, so please enjoy this lengthy tale of corporate stupidity.\n\nI'll begin by saying I work for a software company. I was working on a project for a client, to customize part of the software and stuff. The project was very open-ended, mostly because the client kept changing their mind about what they wanted, so the contract was \"time and materials\". Meaning that I had an hourly rate, I would log all the time worked on the project (in half hour intervals), and every week my company would bill the client company for the hours spent on the project. The client said they didn't care how much effort it took; they wanted a good product and they wanted it before the end of the year, so they could present it at their big internal meeting.\n\nAt the beginning, the project went great. Every week I had a meeting with the client and I would get feedback on the progress, as well as new requests they might have, and then I'd spend however long it took to implement the changes. I'd bill them 15 hours, 20 hours, 25 hours, or however many it had been. Slowly, over time, the client started requesting more and more. I told them during the meeting \"this feature will require X days of work\", \"changing that will require Y more days\" and so on, but again the client insisted they needed all those extra features. They also complained that the project wasn't advancing quickly enough, and insisted they needed the project completed before the end of the year.\n\nI talked to my manager and explained the situation. To be able to finish quickly enough, I needed to work full time on this project. My manager moved my other projects to different people, and we told the client that until the end of the year I would work full time on the project to ensure we will hit all the deadlines. The client was overjoyed... for about a month.\n\nThe following month, the client is pissed and is demanding to know why we're charging them so much. I pull out my time sheets and explain that, as agreed, I've been working full time (and more) on their project. Every week I've logged between 45 and 50 hours of work, and I have detailed notes specifying exactly how I've spent that time. I'm not particularly concerned about being accused of stealing time, because I'm a fast worker and most tasks have been completed more quickly than the original estimates. Besides I point out that I'm now working twice as many hours as before, so it's costing the client twice as much per week, but I'm also completing tasks twice as quickly and will be finished in half the time.\n\nThe client, unfortunately, doesn't appreciate my use of logical reasoning. They accuse my company of taking advantage and they say that starting from next week they no longer want to pay for more than 20 hours of work per week. I tell them, sure, we can do that, but it's October already and you want the project completed by the end of the year. Given the amount of work still left to do, I will need more hours to finish. The client doesn't let me explain and says that we're not to bill them for anything more than 20 hours per week, they will not pay us for more than 20 hours per week, and they want this in writing or they'll cancel the entire project.\n\nAnd my manager says, of course, the customer is always right. (This was an evil evil act of malicious compliance, so please read until the end before getting angry at my manager, he's a great guy.)\n\nSo my manager sends the client an email confirming that, starting from \\[date\\], my engagement with them will be capped at a maximum of 20 hours per week. He also attaches a spreadsheet of the estimated time to develop all the new features of the project, how many hours I'd spent so far, and how many hours I projected to spend to complete it. The client smugly acknowledges this.\n\nBefore the end of the week, my manager gives me back my other project, as well as a new one. You see, at the time we were understaffed because we were growing too quickly, and we were getting more requests for new projects that we could handle. So there would have been no point in stealing hours from this client and pissing them off, when we can take on a couple of new clients instead and bill everyone for the actual work and keep everyone happy.\n\nSo, starting from next week, my new schedule is 20 hours with Pissy Client, 10 hours with client B and 15 hours with client C. It works great for me. It doesn't work that great for Pissy Client. At our next weekly meeting, one of the features they requested isn't ready yet. At the following meeting, I tell them we'll need to move the deadline for the next milestone by two weeks. Then it's the beginning of December, and they ask me if I would be able to make some last minute changes and still deliver the project by the end of the year, and I say oh there is no way the project can be finished by the end of the year.\n\nWe have yet another meeting with the client and my manager. My manager asks me why I'm missing this huge deadline. I say: do you remember when I was talking about all the work that still needed to be done and how long it would take? In October we estimated the project needed another 60 days of work. I worked 10 days in October and 10 days in November, because you said 20 hours max per week. It's going to take about 40 more days of work to finish the project. It's December. Even if I work overtime, there are not 40 days left before the end of the year.\n\nManager is like, yep, makes perfect sense. Client does the shocked pikachu face. They act like this is the first they've heard about not being able to meet the deadlines, even though I've been telling them for weeks. Unfortunately they are the kind of person who never listens to what they don't want to hear. At first they wanted the work done quickly, so they didn't think that if I worked more hours I would bill them for more hours. Then they wanted to be billed for fewer hours, so they didn't consider than I would work fewer hours on the project and things would get done much more slowly.\n\nUnfortunately for the client, who would like to pretend that we were springing this on them at the last minute, we had tons of emails to show we had told them well in advance. My manager's email back in October had even included an estimate of when the project would be completed based on number of hours worked per week. Our ass was well and truly covered.\n\nNow, as for the fallback. The client kicked and screamed and demanded that I go back to work on their project full time, or even that my company should provide a second person to help me meet the deadline at the end of the year. It's January and the project is still unfinished, so you can guess how well that went. Client had to move the big presentation of the new software and was not happy about it (and about having to explain it all to their own CEO) but we told them very nicely in corporate tones to pound sand.\n\nI was already scheduled to work on two other projects for the next few months, and it had been hard enough to put me full time on this project the first time. My manager is not going to leave another two clients hanging, especially not to please this Pissy Client who keeps changing their mind and threatens to cancel their contract every other week. As a company we do our best to keep the client happy but there is a limit to everything, especially when someone goes out of their way to not listen when we try to explain how cause and effect works.\n\nTL;DR: Client demands I work more slowly. I work more slowly. The work is not completed by the time client needed it, and client is upset, but I don't care because I get paid anyway.",
        "created_utc": 1675002388,
        "upvote_ratio": 1.0
    },
    {
        "title": "Please, I'm not being malicious. Can I sue my previous employer after a settlement was agreed?",
        "author": "Me230413",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/10o7km3/please_im_not_being_malicious_can_i_sue_my/",
        "text": "\n\nI won against a previous employer for unfair dismissal as I was suffering and signed off for diagnosed depression and other treatment causing trauma and financial struggle but I settled in small claims because of my depression and they took 5 months to uphold my appeal so I was unable to keep up with financial commitments and I just did not wanting to increase my hurt. However, can I sue them for what I deserved because they had me sign the agreement which not of sound mind with depression, they also agreed a small promise to me which they didn't fulfil.",
        "created_utc": 1674998684,
        "upvote_ratio": 1.0
    },
    {
        "title": "I ordered a large drink! Sure, that would be 80 cents extra…",
        "author": "ItsAlwaysSunnyInCali",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/10nzbbm/i_ordered_a_large_drink_sure_that_would_be_80/",
        "text": "This happened many, many years ago when I was a teenager. I used to work at a fast food restaurant as a cashier handling the both the drive thru and people walking in. From time to time, someone would get a wrong item and come back telling me how they ordered this but got that. Most of the time they actually got exactly what they ordered but I didn’t really bother arguing with people. I’d just grab them whatever they wanted or ask the cooks in the back to make it for them.\n\nOne particular day, this lady comes in the drive thru. I put her order into the computer and repeated it back to her before asking her to drive to the window. When I comes to the window, I take her payment and then give her the drink she order. All of a sudden she goes apeshit about how I got her order wrong. “I ordered a large Coke! You guys always mess up my order, I don’t understand why you can’t get a drink right! I don’t want a small drink, give me a large!” Usually, I’m happy to correct the order for people and don’t even ask them to pay the difference if it is more expensive. But this lady was probably the most rude and obnoxious person I had to deal with working there. I didn’t want to be nice to her, cue malicious compliance.\n\nI tell her “Sure, that will be 80 cents extra.” She hands me the extra money and I walk over to the drink fountain. You couldn’t see the drink fountain area from the window so I poured the small drink into a large cup and then added ice to fill it to the top. I gave her the large drink with a smile on my face. “Have a nice day!”",
        "created_utc": 1674968078,
        "upvote_ratio": 1.0
    },
    {
        "title": "I was ask to stop giving the complains phone number",
        "author": "NomisLegnots",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/10nv5i7/i_was_ask_to_stop_giving_the_complains_phone/",
        "text": "[removed]",
        "created_utc": 1674954988,
        "upvote_ratio": 1.0
    },
    {
        "title": "Sfg",
        "author": "[deleted]",
        "url": "",
        "text": "[removed]",
        "created_utc": 1674946545,
        "upvote_ratio": 1.0
    },
    {
        "title": "suuuu",
        "author": "hoodie_mur",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/10nrsbl/suuuu/",
        "text": "[removed]",
        "created_utc": 1674945734,
        "upvote_ratio": 1.0
    },
    {
        "title": "Electronics store power trip.",
        "author": "drock121",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/10nmtow/electronics_store_power_trip/",
        "text": "When I first started working I got a job at a large electronics store.  We had a manager that was on a total power trip 24/7. He was never very accommodating of anything and always went out of his way to make things worse for everyone.  \n\nEventually, I decided to get a tattoo that ment a lot to me.  I thought about it a lot and one of my family members decided to get one with me.  I got the tattoo on my left wrist. It is around 3 inches in diameter. Most people don't notice it at first.  \n\nSince we wear short sleeve shirts as part of our uniform, my new tattoo was exposed.  After a few days of working with my manager, he noticed my tattoo and told me it was unacceptable.  It isn't vulgar language or anything offensive, but he thought tattoos were not professional.  He told me I was required to wear long sleeves any time I was working.  The long sleeves that they offer are sweaters.  I was responsible for unloading truck shipments and it would get ~100+ degrees inside the truck in the summer.  Regardless he made sure that I wore long sleeves.  \n\nOne day I asked if I could cover it with an arm band.  He said that would be fine.   That night I went online and purchased an arm band that had the exact same logo on it.  My next shift I wore it, and placed the logo directly over my tattoo.  This made the logo even more obvious.  Since it was music related and we sold that artists cds in the store, there is pretty much nothing he could say. \n\nWhen he saw it he glared at me for a good 5 minutes.   He literally didn't say anything.   I could tell he was ready to implode.  This was almost 15 years ago and it makes me so happy thinking about it to this day.  \n\nHe eventually changed the stores policy on the required work hours with led to me losing my job.  I could tell he was happy about that but I could care less at that point.  Oh well :)",
        "created_utc": 1674932989,
        "upvote_ratio": 1.0
    },
    {
        "title": "Employer won't allow employees have water, so I got a doctor's note.",
        "author": "horsewoman1",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/10nlpsn/employer_wont_allow_employees_have_water_so_i_got/",
        "text": "[removed]",
        "created_utc": 1674930166,
        "upvote_ratio": 1.0
    }
]