[
    {
        "title": "Sneks are icky. Especially at night.",
        "author": "Not_An_Ambulance",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/88uti8/sneks_are_icky_especially_at_night/",
        "text": "Respond to this if you want to be added to the approved submitter list. We are not going to participate in the blackout, but... it occurred to me I should get some kind of list together anyway. Right now it’s like me and r/ComplianceAuditor, which... he’s cool and all but I suspect that would not be enough to really get a party vibe.",
        "created_utc": 1522623816,
        "upvote_ratio": ""
    },
    {
        "title": "\"All top-level comments must be quotes from the article\"",
        "author": "[deleted]",
        "url": "http://reddit.com/r/worldnews/comments/88sjjl/russian_bots_are_rallying_behind_embattled_fox/dwn0meu",
        "text": "[deleted]",
        "created_utc": 1522621330,
        "upvote_ratio": ""
    },
    {
        "title": "Just do your job",
        "author": "TenTimesTheTrojans",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/88ua4u/just_do_your_job/",
        "text": "LTL : FTP. Sorry it’s a long read. There’s a TLDR at the bottom for you. Enjoy!\n\nWhen I was a passenger check-in agent for an international airline, I’ve had the pleasure of meeting tons of people from across the world. Unfortunately, that also meant I met alot of assholes in my line of work. One of them stuck out in particular.\n\nWhen passengers come in from a connecting flight, most of the time they’re not informed that they’re transferring flights. This is also means that they had no clue that they’re flying with another airline with a new set of rules and policies. There’s alot of rules we have to follow. The most common issue we get is with carry-on luggage.\n\nGuys, I get it. You don’t want to pay for extra checked-in luggages. You have very important things and want to keep on you at all times. It just seems ridiculous that airlines are being that strict about carry-ons and what you can and cannot carry. Trust me, I completely understand and I’m here to help.  But not if you’re gonna be an asshat.\n\nAsshat rushes right up to the counter with his two friends who are also travelling with him. I notice that they’re coming from a connecting flight and I begin to check them in normally. Now, it’s time to check their carry-ons. I weighed Asshat’s carry-on and it weighed 11kg. According to policy, carry-on luggages can have a maximum weight of 7kg but we try to be flexible.\n\nMe : Excuse me, sir. I’m sorry but your carry-on is too heavy to be brought on board. It’s currently at 11kg. Is there any way to remove some of the weight?\n\nAsshat : What?\n\nMe : I’m sorry sir. It’s a safety issue. Your carry—\n\nAsshat : I travel with this bag all the time and I’ve never had this problem! Why didn’t you guys tell me before? \n\nMe : I’m sorry sir. Your previous airline has different baggage allowance from ours. Is it possible to remove maybe 2kg from your carry-on? I can let it go at 9kg.\n\nHe begins to angrily open his bag and remove some items. He gives it to their friend to hold. The bag is weighing at 10kg.\n\nAsshat : Well?\n\nMe : I’m sorry sir. It’s just a tiny bit over. Do you think you can remove one more kg?\n\nAsshat : Are you kidding me? Unlike you, I actually have to be somewhere. You know, this wouldn’t have been a problem if you just knew how to DO YOUR FUCKING JOB!\n\nAt this point, I’ve never been openly yelled at like this at the counter in front of everybody. Asshat’s friends were actually pretty nice and tried to calm him down. Even my supervisor looks over to me with concern and sees if I need her help. I smile back to her and let her know I’ll handle this. After all, the customer’s always right. Asshat finally gets his carry-on to 9kg.\n\nAsshat : There! Are we done here?\n\nMe : I’m sorry sir but according to airline policy, carry-ons can only have a maximum weight of 7kg.\n\nAsshat : What?! But you said 9kg. \n\nMe : Im sorry sir but I’m just doing my job.\n\nAsshat : You —\n\nAt this point, you can see him starting to become bright red in the face. Whether it be anger or embarassment, I don’t know. He holds his tongue and angrily removes items until the scale read 7kg.\n\nMe : Ok the weight is good. But I have to check the size. \n\nThen, I took his carry-on and brought it to a mock carry-on container that measures its size. It did fit but I had to do my job right?\n\nMe : Your bag did fit the model that we have but I have to make sure. One second please.\n\nI took a measuring tape that we rarely used and proceeded to measure the carry-on’s length, width, and height just to waste his time. \n\nMe : Additionally, can you please answer the following security questions for me concerning your carry-on and checked- in luggage?\n\nBy the time he had gotten his boarding pass, it was well over 30minutes. He snatched his boarding pass and stormed off screaming my absolute favorite saying. \n\nAsshat : I’M NEVER FLYING WITH YOU EVER AGAIN!\n\nThe cherry on top? As Asshat walked off, I made sure he heard me say this to his friends. \n\nMe : Oh, your carry-ons? They look fine. Here’s your boarding pass and enjoy your flight! \n\nTLDR : Asshat complained about his carry-on and told me to do my job. So I did and wasted his time.\n",
        "created_utc": 1522619104,
        "upvote_ratio": ""
    },
    {
        "title": "No cleaning? You got it!",
        "author": "imffbrgr",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/88u1p6/no_cleaning_you_got_it/",
        "text": "Hard to say whether this belongs in r/pettyrevenge instead of here but I’ll give it a go. To preface, I’ve graduated high school for a couple years now and work at McDonalds as a side job besides university. I’ve been working at McDonalds for a couple years now and I’ve been promoted to a “team leader” position (one step under being a manager). After one of our managers left, they were replaced by some snobby know-it-all who we’ll call Jane for anonymity. Now I’ve been working for quite some time without running into any problems with other managers (most of them really like me) but Jane here likes to point out the little things, even when there are bigger issues to deal with. We’ve got 10 orders on screen? “MAKE SURE THE PICKLES ARE NOT TOUCHING ON THE BURGERS!” Jane here has even had gripes with several of the managers meaning not a lot of people are a huge fan of hers. Now here’s where my malicious compliance comes in. A couple of days ago, while the kitchen was quiet and not a lot of orders were coming in, I decided to do Jane a favour and clean the area outside of the kitchen as it had become very messy from lunch time. I was brushing off crumbs and debris onto the floor to sweep up and when I get to the sweeping part Jane starts yelling at me about how I’m a team leader and that I should be in the kitchen to ensure quality and speed and blah blah blah. I look over and see no orders on the screen so I tell her that I’m trying to make good use of my time but she’s not having any of it. Jane tells me “there’s better things for you to do then sweeping, go find someone else to do it.” So I go and find some poor soul to clean up the huge mess of crumbs on the ground and make sure to apologize to them while I went to stand in the kitchen and stare at an empty screen. Fast forward to today, to the moment where I finish my shift after Jane has asked me to stock up the floor before I go. After doing so, I realized that I had accidentally spilled some lettuce on the floor but instead of cleaning it up I remembered what she had told me: “there are better things for you to do than sweeping”. Assuming clocking out and going home was more important than sweeping, I left the mess as it was and went home. I later found out that she asked another manager to clean it up later (my friend that I’ve told the story to,) to which she responded “there are better things for me to do than sweep up this mess.”",
        "created_utc": 1522617027,
        "upvote_ratio": ""
    },
    {
        "title": "Prevent me from doing my job and then chew me out for it? Let's see how you like it!",
        "author": "JakexDx",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/88tvxf/prevent_me_from_doing_my_job_and_then_chew_me_out/",
        "text": "For the past few months I have been working as a Desktop Tech for a pretty big company. When I was hired they were just starting their big CPR (Computer Platform Refresh) Project, and I was assigned to the project. What the project detailed was imaging the new computers with Windows 10 and deploying the computers to employees/users whose current machine reached the end of their life cycle. I was hired as a sub-contractor, which means the company I work for is a contractor for a company that is a contractor for the main company. The supervisor for the project is a guy I will refer to as \"Sam\" who works for the contractor that contract the company I work for (I know confusing!), I work alongside the Infrastructure Admin who I will call \"Jane\", the Infrastructure Manager who I will call \"Mark\", and there is also Sam's boss \"Ryan\".\n\nSo here is a quick break down of the chain of command.\n\nMark -&gt; Jane -&gt; Ryan -&gt; Sam -&gt; Me.\n\nSo every morning Sam has a mandatory meeting that has the desired function of wasting time talking about things that could be easily sent out in an email. I don't really have a problem with Sam he can be a bit micro-managey but overall I generally like the guy, but this particular day the morning meeting was running extra long because Sam keep talking about how we need to \"step it up\" and get more imaging done because we aren't hitting our imaging daily goals. This was mainly due to us being busy with deployments or other tasks Jane/Mark asks us to do, since they work for the main company their errands take priority over the project. When I finally got out of the meeting I was 30 minutes late for a deployment for a \"VIP User\" or someone at the company who makes more that X amount of money. When I got there I explained I got caught up in a meeting and the user was more than understanding and basically forgot I was coming, so I do my tasks, finish and head on back to where I work.\n\nThe next day Sam pulls me aside and starts riding me for being late to a deployment for a VIP user and how that makes us all look bad, and I quickly tell him that I was late because his meeting ran long and you wouldn't let me leave the 3 times I said I have a deployment in X amount of minutes. He just brushes me off and tells me to not let it happen again and make sure I hit my daily image numbers. So this just pissed me off so I decide to try to do my job in a way to directly inconvenience him, about a week before this he told us that if we had a we had a busy deployment schedule we could ask him for help imaging to make sure we hit our numbers for the day.\n\nI started scheduling deployments in the morning the same time as his morning meeting, pack in as many deployments as possible, and always be the first to volunteer for errands that Jane/Mark needed help with so I was too busy to do any imaging. I would then email him asking for help with imaging due to my hectic deployment schedule, which would make him have to stop his other work to take time to help with my images. I even had a fellow tech do the same thing so then Sam would have to help us both with imaging, it got to the point where Sam had to spend all day imaging just to make sure we hit our numbers. Since Sam was always busy helping us his boss Ryan started chewing him out for focusing on the CPR project and not doing his other assign tasks. After a few weeks we started to feel bad about all the shit Sam was getting so we stopped, but I will occasionally make another busy schedule just to keep Sam on his toes.\n\nTL;DR - Supervisor prevents me from doing my job, so I started doing my job so well it stopped him from doing his.",
        "created_utc": 1522615655,
        "upvote_ratio": ""
    },
    {
        "title": "If you insist...",
        "author": "RyanMakesMovies",
        "url": "https://i.redd.it/7ngl9m0qncp01.png",
        "text": "",
        "created_utc": 1522611517,
        "upvote_ratio": ""
    },
    {
        "title": "Mom told me to bring pudding to Easter. She did not specify.",
        "author": "Munchlax_1147",
        "url": "https://imgur.com/Mt8RKEA",
        "text": "",
        "created_utc": 1522608040,
        "upvote_ratio": ""
    },
    {
        "title": "All Cheeses",
        "author": "arrakchrome",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/88s3ax/all_cheeses/",
        "text": "I worked in restaurants for over a decade.  Most places have a policy of \"No Ticket, No Food.\"  In essence, if it wasn't put into the point of sales system it was not to be made.\n\nThis guy I worked with, he placed a staff meal order essentially customizing his quesadilla from the ground up.  All said and done it was chicken, barbecue sauce and \"all cheeses.\"  So I set at it, cheddar, mozzarella, Parmesan.  But wait we have blue cheese too!  Doesn't he hate blue cheese and bitch and complain when he has to touch a plate that has blue cheese on it?  He says all cheeses so he must be wanting to give it a try.  If he wants to try it I have to make sure it is in every possible bite, right?\n\nI make it as he ordered it and put it up for him to grab.  a few minutes after he takes it, I can here him scream my name from the back.  He demanded a new one be made, but I can't, I don't have a ticket.\n",
        "created_utc": 1522600905,
        "upvote_ratio": ""
    },
    {
        "title": "We won't hoard our sick days!",
        "author": "3kidsmakemecrazy",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/88rdfz/we_wont_hoard_our_sick_days/",
        "text": " The state of Kentucky is in a crisis right now over teacher pensions. The governor has made some disparaging comments about teachers, among other things accusing them of hoarding sick days to increase their pensions. \n\nwww.soundcloud.com/heraldleader/gov-bevin-hoarding-sick-days\n\nLate Thursday night a pension reform bill was pushed through illegally. On Friday, over 25 Kentucky school districts were forced to close because of teacher absences. We're not hoarding our sick days boss!\n\njournal.com/story/news/2018/03/30/kentucky-teachers-shut-down-schools-protest-over-pension-bill-heres-what-we-know/472303002/\n\nEdit to Add TL;DR - We shouldn't save our sick days for when we know we need one? Okay, we'll all use one today because this policy change makes us sick! \n \nThanks u/NotAHeroYet for the TL;DR!",
        "created_utc": 1522594891,
        "upvote_ratio": ""
    },
    {
        "title": "Now your kid hates skiing, I hope you're happy",
        "author": "Reticul",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/88qv3g/now_your_kid_hates_skiing_i_hope_youre_happy/",
        "text": "So this happened a couple of months ago, during the Christmas rush at an unnamed ski resort. \n\nI was in charge of a group of the youngest kids (4 and 5). This group in particular was just barely able to go up the chair lift. This was exciting, as it meant I could take them away from the crowds of adults who were learning to ski and get them to some more space with harder terrain. Everyone was really excited except for one kid, we'll call him Blue, for his jacket. Blue seemed apprehensive and quite. Whatever, some kids are. I run them through the checks, get the supervisor go ahead and take them up the lift. Blue goes face down in the snow. Won't get up. I scoop him up and start to get them going down the hill. Blue panics, refuses to let go of my leg. So I basically carry him for two runs before cutting my losses and taking everyone in; I can't teach the rest of the kids if I have to give all my attention to Blue.\n\nEnter Dad. Dad says he saw me carrying Blue down and doesn't understand why I'm not giving him a chance. Dad takes Blue on the chair all the time. He bitches to my supervisor until I get called over. I gently explain that, while your 4 year old is physically capable of doing this, he's emotionally unable to do something that scary without his father. Dad says \"Yeah well I paid for him to go up there, so you need to take him up again.\" Yeah, whatever, we'll see how that goes.\n\nSo I request back up from my supervisor, who sends me up with another instructor. And up we go. We're not even half way down before Blue is in tears again. Hysterical. Can't even see to ski. I take him down. Right past Dad. We have the following exchange:\n\nD \"What's wrong with him? Why isn't he skiing?\"\n\nMe \"Well sir, your son is clearly not in a state to ski. I have to take him inside until he calms down.\"\n\nD \"Give him to me, I'll fix him up.\"\n\nMe \"I'm sorry sir, that's against company policy. Liability reasons. I'm sure you understand. If you want to pick him up you'll have to go inside and speak to my boss.\"\n\nKilled an hour of the dude's time picking up his kid and I don't think either skied for the rest of the day. Maybe next time you'll listen when a professional tells you what your kid is ready for.",
        "created_utc": 1522590161,
        "upvote_ratio": ""
    },
    {
        "title": "\"Call someone who cares\"",
        "author": "SaltyUmbrella",
        "url": "https://v.redd.it/sj4xzbo5y8p01",
        "text": "",
        "created_utc": 1522566476,
        "upvote_ratio": ""
    },
    {
        "title": "An acceptable alternative.",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/88p085/an_acceptable_alternative/",
        "text": "[removed]",
        "created_utc": 1522564716,
        "upvote_ratio": ""
    },
    {
        "title": "\"Not in my job description\"",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/88ogq9/not_in_my_job_description/",
        "text": "[deleted]",
        "created_utc": 1522558203,
        "upvote_ratio": ""
    },
    {
        "title": "\"I don't want no Mexicans helping me, ok?\". \"Yes ma'am, no Mexicans..\"",
        "author": "cudada",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/88nu34/i_dont_want_no_mexicans_helping_me_ok_yes_maam_no/",
        "text": "EDIT: I was going to fix electronic to El, but I am thoroughly enjoying the fan fiction.\n\nAbout 15 years ago I worked at a large grocery store.  A disabled woman in a wheelchair would come into the store about 2x per week to shop. She'd request some help shopping.  We had good people but our payroll was for shit.  I was the front end manager and couldn't help her myself, and I certainly couldn't pull any cashiers, so I'd have to get one if the baggers.  Most of them were Hispanic (town was ~30% Hispanic.  It was a very rich mix of central Americans and some South Americans mixed in.  I learned a lot of Spanish.\n\nAnyways, the guys who were available to help her always had a degree of English proficiency (in my 6 years there I saw guys go from no English to 100% fluent, it was awesome).  She would get mad at this, even though I'd give her the best English speaker I had.  She finally got fed up by this.  One busy Saturday morning I was on the register trying to gets the lines down a d she wheeled in, demanding (never asking) for help like it was an expected service.  Fine.  I went for the microphone a d started to call for Luis, but she cut me off before I could make the call \"I don't want no Mexicans helping me, ok?\". \"Yes ma'am, no Mexicans..\". Do she gets Davíd, an electronic Salvadorian with great English.  I'll have David meet you in the produce section.  Of course, she wheels back yelling a few moments later.  And yelling and yelling.  She eventually wheeled out of there and called in a complaint.  The store manager wasn't crazy about my malicious compliance but was happy she complained in such a racist way that no one could get in trouble.  And I don't remember seeing her again for the rest of the 2 years I was at that particular store.  Maybe she only came in early weekdays like we had asked her all along so we could actually give her her choice to shop with, but u never had to deal with her hateful self again.  Oh yeah, and Davíd was delighted by his part in all this.",
        "created_utc": 1522551434,
        "upvote_ratio": ""
    },
    {
        "title": "Racist apartment owner tells me “don’t rent to THOSE people.”",
        "author": "cbelt3",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/88l8jv/racist_apartment_owner_tells_me_dont_rent_to/",
        "text": "Back in the early 80’s I was the temporary superintendent for the summer of an apartment building next to my University. Mostly part time repair guy/ janitor / landscaper. The owner lived in the penthouse, but had a job driving freight trains. So he was gone a lot. \n\nWe had an apartment open up, and he gave me forms, how to do a credit and reference check. And verbal instructions to adhere to his opinions.\n\nI knew well enough that he was asking me to break the law. So my compliance went like this after I rented to a nice young African American couple (graduate students). \n\nHe screamed at me. And I replied : “They are named Jones. Not THOSE.”\n\nNeedless to say I was instantly kicked out and threatened with a beating. I left rapidly and moved in with my girlfriend. The dude was later jailed after attacking a resident.\n\n",
        "created_utc": 1522526427,
        "upvote_ratio": ""
    },
    {
        "title": "After /r/GlobalOffensive mods delete every single post about racist remarks Sadokist, a famous CS:GO caster, made on a livestream, the community creates an entirely sarcastic thread \"praising\" said caster and the mods, to not violate the (completely inconsistently enforced) rules",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/GlobalOffensive/comments/88iiui/who_do_you_guys_think_is_the_best_csgo_caster/",
        "text": "[deleted]",
        "created_utc": 1522522909,
        "upvote_ratio": ""
    },
    {
        "title": "Malicious Appliance",
        "author": "RUBIXWARRIOR",
        "url": "https://i.redd.it/gpq78cz665p01.png",
        "text": "",
        "created_utc": 1522521418,
        "upvote_ratio": ""
    },
    {
        "title": "No short e-mails.",
        "author": "Wflagg",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/88kell/no_short_emails/",
        "text": "No short e-mails\n\nI posted this on /r/talesfromtechsupport/ some years ago, but I think it fits here as well.  Rewritten to focus on the MC side of things though.    \nI worked in tech support for Hosted Exchange.  1-3 times a week, our sales team lead would ask if we offered support for 3rd party compliance archiving on on cheap plans (no).  He would send an e-mail to everyone on our team every time (not use our ticketing system) and promptly forget the provided answer.  One day in a fit of frustration, one of my coworkers sent him a one word response.  \n\n\"Nope\"     \n\n&amp;nbsp;\n\nDue to office politics and our call center and overall service going through a downward spiral that eventually closed down the company, our direct supervisor was very much a  \"dont rock the boat, dont get noticed and maybe we wont get fired like all of the rest of support\".   Unfortunately, while I understand the attitude, and might even have backed him, he abused his agents, lied to them, and would throw them under the bus to protect himself.  Out of fear of someone complaining about us and reminding upper management we where still employed there, he made a new rules any time he thought we might cause problems. this was one of those times.   \n\n\n&amp;nbsp;\n\n\n\"No one word 'unprofessional' responses to outside departments\".  \n\n\n&amp;nbsp;\n\n\nWith added threats of writeups and firing.  This was before we figured out that our small group was the only one he was even loosely qualified to manage, and he wouldn't actually write any of us up for fear of drawing attention, and wouldn't fire anyone because then he wouldn't have anyone to manage.  \n\n\n&amp;nbsp;\n\n\nSure enough a few days later, we get another identical request. As we all debated who would get to respond this time, I had an idea.  Our boss was away from the desk, so we had to act quick.  I told everyone to go back and find a different instance of him sending this same e-mail. Then to reply to the newest request with a message along the lines of \"As stated in previous e-mail subject [subject] date [date] this is not a feature we support\" one from each of the 8 of us, all of them referencing a different e-mail where the same request had been made.  \nsales guy didnt ask that question again for a few months.  \n\n\n&amp;nbsp;\n\n\nOur boss asked us what happened.  We looked at him and took turns explaining that we complied with his request to send professional e-mails.  He eventually threw up his hands in defeat and wandered off.  Our second supervisor who worked the late shift and had come in after the e-mail had gone out heard about it and laughed. It was a victory on all fronts.     \nThinking back, I think this is about the time that we realized our team was basically untouchable.  \n\n&amp;nbsp;\n\n&amp;nbsp;\n  \nTL:DR - Not allowed to send one short e-mail?  everyone sends a long one that professionally points out what a failure they are at doing their job.",
        "created_utc": 1522519188,
        "upvote_ratio": ""
    },
    {
        "title": "You can do better, hand it in again",
        "author": "baryonyx257",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/88k9so/you_can_do_better_hand_it_in_again/",
        "text": "This is from about 2001/2 in High School. I had completed an essay on Macbeth for English Literature class. English Lit wasn't my strongest subject, I preferred Sciences. She gave me back my essay and said \"You can do better, hand it in again\". She had given me a C grade, which I was quite happy with. I was dropping English Lit at the end of the year, and was running low on fucks to give about the subject. Later that day, I went to Biology, but the teacher was sick. So we were left with a 'babysitter' that basically told us to be quiet and do some homework. Fine with me. I pull out my 4 page essay, and wonder how I can improve it. This is when I notice the teachers' grave mistake. Every correction, every note, everything that she has written, is in pencil. So I grab my trusty eraser, and remove her notes and corrections. Page 4 was a problem, she had written 10 or so lines of 'notes'. So I just rewrote the 5 or so lines that I had written verbatim. The next day, I handed it in. Next English lit class, as soon as I walked in, she asks to speak to me. My thoughts were along the lines of \"Fuck, I'm boned. Well, nice knowing you folks, I'm about to be shouted at at a volume that would make Krakatoa seem like a Mayfly's yawn\". But, no, she said \"Good job\". I got a B+.",
        "created_utc": 1522518179,
        "upvote_ratio": ""
    },
    {
        "title": "He's not wrong",
        "author": "frcdude",
        "url": "https://i.redd.it/7bw8d0c743p01.jpg",
        "text": "",
        "created_utc": 1522507627,
        "upvote_ratio": ""
    },
    {
        "title": "Man Legally Changes Gender So He Can Retire 5 Years Earlier",
        "author": "diogenesofthemidwest",
        "url": "https://www.dailywire.com/news/28809/gender-equity-man-legally-changes-gender-so-he-can-james-barrett",
        "text": "",
        "created_utc": 1522506472,
        "upvote_ratio": ""
    },
    {
        "title": "No Shit Sherlock.",
        "author": "Spiceri",
        "url": "https://vgy.me/k3hCK1.jpg",
        "text": "",
        "created_utc": 1522494104,
        "upvote_ratio": ""
    },
    {
        "title": "If you want to use the bathroom, you get homework.",
        "author": "Salemsmeowmix",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/88h6li/if_you_want_to_use_the_bathroom_you_get_homework/",
        "text": "In second grade I had a teacher that was pretty bad. Among a bunch of problems she had this rule that if you wanted to use the bathroom outside of recess or lunch break you’d be given a sheet of math problems as homework. I get why she did it but 7yr olds are not great at timing pee breaks. Being the super quiet new kid with English as a second language I never wanted to interrupt the teacher. And being given homework because of using the bathroom seemed like punishment. So of course I went home with stomach cramps from holding it in too long. \n\nWhen my mom found out about this, she flipped out, and this is where the malicious compliance came in. I was told to ask for the homework every morning, that way I could use the bathroom all I liked. So I started asking for the work in the morning, doing it during recess, and turning it in by the end of the day. Problem solved. \n\nExcept all the kids figured it out, and soon were doing the same thing, we even helped each other with the problems during recess. By 2 weeks the system was useless and she stopped using it all together. My mother and her had a huge fight because I broke her system. \n\nA month or two later I was moved to a private school, where I did really well in math thanks to those sheets.\n\n\nTL;DR You wanna give me homework for using the bathroom? Fine I’ll ask for the homework, and do it in class just in case I want to use the bathroom later.\n\nEdit: Wow! I didn’t know withholding bathroom breaks was so common. I really hope this isn’t done anymore. ",
        "created_utc": 1522481747,
        "upvote_ratio": ""
    },
    {
        "title": "For months, SiriusXM have been sending me spam, and calling me weekly... they want a response? Fine.",
        "author": "Colinm478",
        "url": "https://i.imgur.com/kVwrQES.jpg",
        "text": "",
        "created_utc": 1522472004,
        "upvote_ratio": ""
    },
    {
        "title": "Are you sure you want two copies?",
        "author": "Harelipfrog",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/88g02q/are_you_sure_you_want_two_copies/",
        "text": "I worked for the government at the time this happened. This is really minor, but I got a lot of enjoyment at the time and still share it from time to time.\n\nI spent a lot of my time copying files for two particular very nice ladies who did hearings (always together).\n\nI got an e-mail from LadyA asking me to make two copies of a particular file. I got these e-mails all the time and this was no different, but the file in question was (I don't know how many pages) about 3-3.5 feet long. It took up most of two shelving sections.\n\nI remembered copying it when it came in before shipping the original out to the county and decided to call LadyA to see if they could make do with one copy, considering the size of the thing.\n\nUnfortunately she was having a bad and about took my head off and insisted that she needed two copies and that it didn't matter how large it was.\n\nI went to work, dual-wielding copiers to get this massive file done. I finished around lunchtime the next day (I got it late the day before and my copiers were not speedy). I very carefully loaded them into my cart (I normally just carried them up) and my supervisor gave me his elevator pass (long story).\n\nI gingerly maneuvered my cart as there was nothing holding these stacks together but gravity. I parked outside her cube, stuck my head in and asked her where she wanted them. She pointed at the windowsill and went back to what she was doing. I maneuvered my cart in and shifted both files onto her windowsill. I waved and off I went.\n\nAfter that she only asked for a  single copy.\n\nEdited: Grammer",
        "created_utc": 1522466200,
        "upvote_ratio": ""
    },
    {
        "title": "I make my girlfriend a Spotify account and she asks me to pick her username.",
        "author": "TheEpitome0fAwkward",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/88fp7t/i_make_my_girlfriend_a_spotify_account_and_she/",
        "text": "[removed]",
        "created_utc": 1522462807,
        "upvote_ratio": ""
    },
    {
        "title": "Leather pants are Catholic-approved, right?",
        "author": "halfarab",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/88bud9/leather_pants_are_catholicapproved_right/",
        "text": "Before I get started, I want to preface this with saying that I was called in by the Dean of Women 42 times for dress code violations between sophomore and senior year.\n\nOkay, so this is a story from my Catholic school days. Up until my sophomore year, I attended Catholic schools with the whole porn-star getup: plaid skirt, pressed shirt, saddle oxfords, and knee socks. I actually liked it - I never had to think about what to wear and the guys had just as many restrictions as the girls. It was a fair system and still helps me put together a Halloween costume at the last minute.\n\nBut then my parents retired and I transferred to a different Catholic school in Arizona. \n\nThe dress code wasn’t even a uniform. You had to wear a polo but the bottoms were up to you. There were just some stupid restrictions: you couldn’t wear blue denim (but other colors were okay for some reason), shorts had to be “Bermuda length” (whatever that means), no leggings, and no skirts.\n\nI really tried to abide by the dress code at first so I contacted both deans, the principal, and the president to figure out what length “Bermuda” was but got no response. So I bought some khaki shorts, got them tailored, and tried to look as professional as possible. But I still got called in even though they never responded to my calls and emails in a three-week period. My punishment was JUG - “Justice Under God” - which is like detention. From that point on, I made it my sole purpose to skirt the line every day.\n\nNow, I have a bunch of stories about dress code (the multiple times my well-tailored shorts “distracted classmates”, the time I changed out of leggings mid-class, and the time I bought a child’s polo and wore a giant push-up bra to piss off our Dean of women are some of my favorites). But I think the one most fitting for this sub \n\nI’m not a big fan of super tight colored denim so in the winter time, I wore wool slacks with some kitten heels. Yet  I still got called in because my pants only had buttons and no zipper. \n\nThe Dean of Women then told me that the rule is that pants must have (1) a noticeable waistline and (2) a zipper. I smiled and told her, “Yes ma’am!” and went home to plot my next move.\n\nThe next day, I walked into school in what I can only describe as an outfit made for a dominatrix in training. I have a pair of black leather pants with a zipper that goes all the way down the side of my leg with a high rise waistband. Waist? Check. Zipper? Check. The Dean took one look at me and called me in.\n\nI have to say that it was wildly satisfying to look her in the eye and say, “Do you like my zipper?”",
        "created_utc": 1522428998,
        "upvote_ratio": ""
    },
    {
        "title": "You don't tell me what I want! I want the whole file, and I want it now!",
        "author": "JohnQK",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/88b50i/you_dont_tell_me_what_i_want_i_want_the_whole/",
        "text": "**Background:** I often represent people in a type of case that boils down to turning their medical conditions into money. The average case takes about 2-3 years from start to finish, and requires going over about a decade worth of medical history in order to prove what I need to prove in order to win. \n\nIn one such case, I represented a lady who was also going through a messy divorce. I did not represent her in the divorce. She had a condition that affected a lot of different areas of the body, and so she had to visit a lot of different specialists. This meant that her file was much larger than average. \n\nAfter a few years, we ended up winning the case. When a case is won, we get a notice that the case had been won and then, about a month or two later, we find out how much we won in a 1 page summary letter. \n\nAbout a week after we found out that we won the case, and well before we would find out how much we won, I ended up receiving a subpoena for me to fax over the lady's file from the guy representing her husband in the divorce. A subpoena is basically a court order requiring someone to turn over something or risk penalties. \n\nNow, it's obvious what this guy actually wants. He wants the one page letter saying how much she is going to be getting. That's the only thing relevant to the divorce because it affects support calculations. He doesn't want the other stuff, he probably just doesn't know exactly what the thing he wants is called, and so he's casting a wide net. \n\nThe normal procedure for getting that information would be to just give me a phone call and ask for the number. If there's a dispute, he could also ask for proof of that number. It's quick, it's easy, and it's polite. Instead, this guy went straight for the subpoena. It's a little rude, but, whatever, maybe he just doesn't like talking to people on the phone. I get that. \n\nWhen I get the subpoena, I give the guy a call. I want to let him know that the thing he's after won't be available for up to another month and to confirm that he only wants the one page letter, not the entire file. He's having none of it. He starts the call angry and he ends it quickly. He treats me like the opponent, which I'm not, and doesn't let me get more than a word or two in at a time before interrupting me. He keeps repeating, \"You don't tell me what I want, I tell you what I want! You send me the whole file or you'll be getting a show cause [a show cause is asking the court make someone do something the court already told them to do].\"\n\nYou probably see where this is going. He wants a single page letter, but he was mean and he specifically demanded the entire file. So, I faxed him the entire file. All 8,964 pages of it. \n\nWe use electronic faxes, so on my end it's no different than attaching documents to an email. On his end, his fax machine is tied up for at least a few hours burning through several reams of paper. And that's not even the best part. The best part is that he then has to skim through all of those pages looking for the one sentence he actually wants, and it's not in there, *because it's not a part of the file yet.*\n\n**Disclaimer:** It's entirely possible that he uses electronic fax or that he started canceling the faxes as they came through to save on paper. I never heard back from him, so I can't know for sure what the situation looked like on his end. \n\n**TL;DR:** A guy wanted a single number on a single page. He was rude and he demanded the entire file. I complied and sent him the entire 8,964 page file. The single page that he actually wanted was not in the file because it hadn't been created yet. He at least lost a few hours of time, and at most lost a few hours of extra time and a whole bunch of paper.",
        "created_utc": 1522423477,
        "upvote_ratio": ""
    },
    {
        "title": "Roaming charges",
        "author": "scruit",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/88a9t1/roaming_charges/",
        "text": "Who remembers the ridiculous roaming charges on cellphones back in the 90's?  Where you'd pay money to originate a call from outside your home area?\n\nI had a cellphone that my company paid the bill for.  Rule was that we had to get a special $300/mo plan, and they'd cover the regular bill and we'd cover the overage charges.  If we could demonstrate the overage was due to work calls then they reimbursed the overage charges too.  If you were sent to another city to work, they reimbursed any calls you make to your home.  This is the important bit...\n\n\nI was sent to New York for a month on business and I went to the CFO's office (small company) and warned him that a month of roaming calls home would be very expensive and suggested I upgrade my phone plan to include roaming calls.  He refused the extra $100.  \"Just use your cellphone, we'll reimburse calls to your home.\"    OK.\n\n\nWell, I was a young newlywed and a month in the big city was very lonely.  I spent about half an hour a day on the phone to my new wife at home.  Every day.\n\nAfter I got home and the phone bill arrived I put in for reimbursement, knowing it would be a shitshow.  Sure enough, CFO comes storming into my office beet red - \"$1200 dollars for a phone bill?  What the f...??\"\n\nI explained that the bill was usually $300, and that I spent about 30 minutes a day calling home at $1/min.  Hence $1200.   I also reminded him that I could have upgraded to a $400/mo service that would have included roaming charges.\n\n\nAfter a few seconds of contemplating different things to day he said next time I go to New York I should get the $400 plan, and then didn't talk to me for a week.  I was ok with both of those things.\n",
        "created_utc": 1522415970,
        "upvote_ratio": ""
    },
    {
        "title": "No Food in Class",
        "author": "luluprevails",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/889cun/no_food_in_class/",
        "text": "When I was in high school one of my math teachers had a rule: No food in class and no drinks unless they had a lid. I didn't really have a problem with this rule because I am the oldest of seven which means you learn to eat fast or you don't eat, so I usually finished my lunch long before I had to go back to class.\n\nAnyway, one day a friend of mine bought me one of those tiny ice cream cups (which was really cool of him, thanks Noah), but since he bought it toward the end of lunch I had to take it to class with me. I didn't really think much of it, just put it on my desk and got to work. About halfway through, I remember it and go to take a sip (since it's Florida so it's 100% melted at this point). My teacher looks up at me and says, \"I know you're not eating food in my classroom.\"\n\nI look at him. I look at my melted ice cream. I look back at him. \"Technically this is a drink now, and we're allowed to have drinks as long as they have lids... which this does... so...\" he let me drink my ice cream but he changed the rule after that.\n\n(Not particularly great, but very satisfying in the moment.)",
        "created_utc": 1522405343,
        "upvote_ratio": ""
    },
    {
        "title": "[Startup Struggles] - Episode 2 - So you're telling me you won't do your job?",
        "author": "GTAIVisbest",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/8893ln/startup_struggles_episode_2_so_youre_telling_me/",
        "text": "[Episode one here](https://www.reddit.com/r/MaliciousCompliance/comments/85g0rd/startup_struggles_episode_1_you_want_me_to_come/).\n\nOne of the many tasks that I had to complete in the earlier days of the startup was taking care of the administrative back-log that seemed to pile up constantly. Some of it had to do with classing invoices and organizing papers, but clearly the most difficult, tedious and time-consuming practice of them all involved company banking.\n\nEvery time our company wants to do some kind of transaction, usually moving money around within our internal accounts or making a deposit into one of our supplier's accounts, we'd have to print out an official page, sign it, stamp it, and bring it to one of our banks in person to have it scanned by the bank manager himself to their central office. As you can imagine, this always causes great delays and problems for everyone involved.\n\nOne day after we moved into our new office my boss hands me some printed out papers to indicate a deposit into some supplier's account. I go to the closest bank, which is a stone's throw from the office.\n\nI arrive there to see a long line of people waiting silently and the loud screeching in the distance of a 40-something post-menopausal monster on the phone. The security guard and teller seemed to be cringing in fear every time the voice cackled and laughed in the distance.\n\nI patiently waited in the line until it was my turn. I presented myself to the teller, told her I had two papers to stamp and scan to the central agency. The teller pauses, looks around, nervously sweating, and finally tells me that he would have to get approval. He meekly walks over to the closed door of the bank manager and knocks on it, tepidly, to which the voice from within, annoyed at being interrupted on the phone, replies \"Send him in!\".\n\nI walk into the office and am presented with the sight of a large-and-in-charge woman sunken into her office chair behind her counter, jewelry and earrings dangling loudly while she enthusiastically talks loudly on the phone. I wait for her to finish, looking around for a bit, and when she finally does hang up and sighs towards me with an air of indignation, I present to her the two papers. \"I need these to be stamped and sent to the central agency, per policy\".\n\nImmediately she starts contesting me, loudly asking how many times I will be bringing her such papers. I told her that since we just moved into our new office nearby, it will be at least once per day. \"That's not possible\", she answers. I stare at her and ask her what she means.\n\n\"Well, you know, this stamp that I'm going to put on your paper is a big risk for me. What if your paper never reaches the central bank? I'd get in trouble\".\n\n\"Sure\", I answer her. \"I get you. Will you be able to put the stamp and scan it?\"\n\n\"Well maybe I can do it just this once but you know, really, I shouldn't, and I won't do it in the long term [...] \"\n\nShe's about to stamp it when I remember that my boss always demands Proof of Deposit for any document, so I ask her if she can give me a PoD for this deposit. She immediately gets huffy again and loudly exclaims that she cannot do so. After a bit more back-and-forth from both of us, me softly asking if she can sign it, and her loudly smirking and exclaiming she can, but can't, I finally ask say:\n\n\"That's fine then, I just need to take your name for my boss, as we will most likely be filing a complaint with the central office of the bank\".\n\nOh boy, that was a mistake.\n\nShe immediately gets defensive and screeches out that *no*, I may *not* have her name, and to get out of her office immediately. After lampooning me some more in front of the dozens of stunned customers, tellers and the security guard in the lobby, I walk back into the lobby and call my boss.\n\n\"Boss, the bank manager at the bank outlet close to our house doesn't want to scan the paper\".\n\nI hear more screeching from behind as the banker lady claims that I'm misrepresenting her words. My boss calmly tells me to go back to the office, and I understand what she's going to do. Meanwhile, the banker lady tells me to get out of the bank.\n\nNo problem ma'am, I will leave.\n\nI walk back to the office and my boss meets me there. I explain to her as we drive back to the bank in her car what happened, and that the banker lady didn't scan my pages because I was soft-spoken and non-aggressive. She parks the car on the curb in front of the bank and marches in.\n\nImmediately my boss walks over to the front of the line and enters into the banker lady's office (who was back on the phone and probably low-key shit talking). My boss proceeds to absolutely **demolish** this banker lady, demanding her to hang up, and then going through the names of the CEO and the investors of our company, as well as reciting all her high-placed contacts at the central office of the bank. She says that it is bank policy to bring these sheets to any office, and that any office must scan them to the central agency. She then loudly exclaims that she will be filing a complaint directly with the top customer service rep of the bank, as my boss shows the banker lady his private number on her phone. \n\nAt first the banker lady tried to fight back and to explain herself, but then she just fell into a mortified silence. At the end of it all, she vigorously apologized to me for my inconvenience and started trying to compliment me on my Arabic (this story takes place in North Africa). Sweating and groveling to the max, as she scans the sheets of paper, she bows her head to us  as we're walking out and tells us that we're welcome back any time and that she'll be glad to scan anything we bring her.\n\nYes, I'm sure you will, banker lady, I'm sure you will.",
        "created_utc": 1522401800,
        "upvote_ratio": ""
    },
    {
        "title": "*right* here",
        "author": "asciiaardvark",
        "url": "https://i.imgur.com/LSX4HeC.jpg",
        "text": "",
        "created_utc": 1522396012,
        "upvote_ratio": ""
    },
    {
        "title": "He wanted to roleplay... [X-post]",
        "author": "MechanizedProduction",
        "url": "https://i.redd.it/kq5phkewyro01.jpg",
        "text": "",
        "created_utc": 1522390566,
        "upvote_ratio": ""
    },
    {
        "title": "\"Trying to be professional'",
        "author": "oh-dear-toph",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/8886du/trying_to_be_professional/",
        "text": "I worked at this dinky little camp for a summer in hopes that it would restore my love for camp.   I used to work at a major camp with hundreds of kids a week and not enough staff = everyone burns out. Which lead me to be jaded about camp. But I thought I'd try this little one in the middle of nowhere. Some friends told me great stories about it and I thought it would be great.    \nNope. I arrive late to staff orientation because I was in a wedding. I arrive my friend gives me the tour, tells me what's what. I expect my supervisor to officially tell me everything or the camp director because it's a tiny camp, but nothing of the sort.       \n\nOne of the rules in spring was breakfast from 8 -8:30 then staff meeting from 8:30-9. Pretty standard. I'm not a morning person, plus I eat slow (especially in the morning). I'm also an avid snacker. College trained me to snack while being lectured at. It helped keep me awake,  to figit less and pay attention. Now one of their rules was breakfast was to be done by 8:30 to start the meeting. I thought that was a dumb rule. So I would intentionally wait and eat in the meetings. Every day I would do this expecting someone to talk to me so I could ask the reasoning behind it.        \n\nIt took them 2 weeks to talk to me about it. And when I asked \"why?\" There was no reason given. \"That's how it's been\" some more stammering and scrambling to think of something. \"We're wanting to be professional.\" \n\nInternal thoughts while hearing this. - professional? There are only 3 year round staff. The rest are just college kids. This camp is too small to pull off being professional. Because you've always done this? You are no leader. You can't give an actual reason. It took you 2 weeks to talk to me about this? Can't be that important. You are genuinely surprised the new kid asked why, seriously? It's taking you this long to come up with answers? I'm glad you pulled me aside, you don't need others seeing your failed attempt at this. What did I get myself into? My old camp is professional and no one had issues with anyone eating in meetings. \n\nWe talk a bit. He's a nice guy. He's genuinely thrown thrown by me asking why. I can tell no one asks questions around here. I should have headed for the hills, but my stupid ass committed the whole summer to be there. Under the brain washing, micromanaging, miscommunication, shit of a camp. He asks me to stop eating in the meeting and I say \"I'll try.\"\n\n\nI def's ate in half the meetings after that, just on the sly. \n\n\nAnd to have some redemption. The crap leadership of that camp left. It was an off summer. I've since visited with the new leadership and it's doing well. ",
        "created_utc": 1522388673,
        "upvote_ratio": ""
    },
    {
        "title": "Steal our bins. We’ll fill them no matter where",
        "author": "Pinkfatrat",
        "url": "https://i.redd.it/wo21kjldvto01.jpg",
        "text": "",
        "created_utc": 1522383922,
        "upvote_ratio": ""
    },
    {
        "title": "How to make an iPhone sing.",
        "author": "Swifty2000",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/884ror/how_to_make_an_iphone_sing/",
        "text": "I work as a shipping and receiving manager for a very old and very large hospital. On a light day we probably preform 100ish receiving transactions, all of which are tracable by our employee numbers. On a heavy day we can easily perform 400 or more.\n\nSo my manager is one of those special kinds of idiots that equates amount of emails sent to amount of work done. She recently sent an email to my team that she believes productivity is down because we haven't been emailing. Its not, we bust ass and don't need to email her for every issue... you know, because we're competent.  What's even worse is my manager CCd in the director of our department who then proceeded to scream at us. \n\nThis is classic manager behavior; if she really wanted to know what we're doing she could search the system for our employee ids and see our work history. She has a bad habit of distracting our director away from her own short comings by making up issues in other departments. And since she's in the middle of a union lawsuit, she has a lot of shit to shuffle to keep her job.\n\nAnyhow, after ripping us a new one we decided to comply to the best of our ability. The program we use allows for an emailed receipt to be sent for any receiving transaction.  Normally we don't use this option, but what the hell, we set it to be sent to her email.\n\nThen we said, \"hey, why stop at receiving transactions?\" And set the system to alert her via email anytime we did anything in the system. \n\nAnd then we said, \"know what? Let's CC her on every email.\" \n\nAnd then we went wild. We instructed every vendor, every department, everyone who emails us for any reason to CC her in. We started this two days ago btw.\n\nNow a week ago, she stormed into our office demanding we all put our work email addresses in our phones. The director was in tow of course, and she lectured us on always being \"available\" during the work day. Mind you, phones are banned at our work stations. So there is literally no reason to have our work email attached. \n\nI hear her phone chime continiously all day. And my manager is one of those assholes who will never silence her phone because it makes her look important to constantly have messages... And of course she sets alerts to max volume. I've been watching her, slowly going mad with each alert. She keeps shooting us death glares as we receive, cancel, receive, edit, and submit every transaction all day long.  Best thing is, my team is so good our commitment to pissing her off hasn't affected productivity in the least.",
        "created_utc": 1522356194,
        "upvote_ratio": ""
    },
    {
        "title": "Always follow instructions (xpost /r/funny)",
        "author": "DwarfApple",
        "url": "https://i.imgur.com/LSX4HeC.jpg",
        "text": "",
        "created_utc": 1522355284,
        "upvote_ratio": ""
    },
    {
        "title": "No talking in class!",
        "author": "alexthenotadragqueen",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/8846bl/no_talking_in_class/",
        "text": "This is from when I was in 4th grade.  We’d all been given planners from the school which had appendices with things like time tables, maps, etc.  One of them was the ASL alphabet.\n\nAnyway teacher banned talking in class because she said it caused a disturbance.  So the entire class learned the ASL alphabet and used that to communicate instead because it was technically not talking.  Best part is that we could communicate with people on the other side of the classroom which we couldn’t by just talking unless we wanted to yell.\n\nIt worked for a week but then she banned ASL",
        "created_utc": 1522351722,
        "upvote_ratio": ""
    },
    {
        "title": "Forbidden coffee",
        "author": "b1tchlasagna",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/883yu2/forbidden_coffee/",
        "text": "This isn't any thing as amazing as everyone else's stories, but just a little snippet of a tiny amount of malicious compliance. Sorry for any spag errors, as I'm on the phone.\n\nAt work, we have vending machines where you can get OK coffee for about 10p/cup. It used to be 5p.... (Not that that bit matters) We also have other really good (and free) coffee, and the machines are really good too. There is however one caveat.\n\nYou are only allowed to use the good (and free) coffee machines, for external meetings only. These coffees are also about double the size of the ones you get in the vending machines. They are situated in the meeting rooms. \n\nI'm in a meeting with a couple of people from a supplier company, and I offer them coffee. Over the process of about four hours, I end up having a latte machiato, and a moccacino, both which you can't get from the regular vending machines. Normally, I wouldn't have that much coffee and I'd opt for something fairly weak ,however as the people I was with were a) external, and b) having a meeting with myself, it meant that I could go ahead and have some of the forbidden coffee\n\nFor reference, the machine is also quite loud, and there aren't many cups at that machine, so even if you tried to get away with it, you really wouldn't except for moments like this. \n\nAgain, nothing amazing. Some minor success on my part though",
        "created_utc": 1522350156,
        "upvote_ratio": ""
    },
    {
        "title": "Always follow instructions",
        "author": "[deleted]",
        "url": "https://i.imgur.com/LSX4HeC.jpg",
        "text": "[deleted]",
        "created_utc": 1522347361,
        "upvote_ratio": ""
    },
    {
        "title": "Old but hilarious story of malicious compliance",
        "author": "netflixnagger",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/2us9t4/the_inventory_control_numbers/",
        "text": "",
        "created_utc": 1522347228,
        "upvote_ratio": ""
    },
    {
        "title": "An old story I was reading that has hilarious instances of malicious compliance.",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/2us9t4/the_inventory_control_numbers/",
        "text": "[deleted]",
        "created_utc": 1522346626,
        "upvote_ratio": ""
    },
    {
        "title": "Use a spoon!!!",
        "author": "sparkleplentylikegma",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/882a7s/use_a_spoon/",
        "text": "So my husband’s grandfather is one of those super anal types, born in the 30s, child of depression era parents, super cheap etc. \n\nHe had all these weird rules like you cannot eat cheese without crackers because it was a waste of the cheese... I dunno. He was just fussy. \n\nOne day when all the family was at their house, my husband  who was around 16 at the time  (well, he wasn’t my husband then.. lol) was pouring sugar in his  coffee. His grandpa didn’t like that because you could waste the sugar and demanded my husband use a spoon to pour it in in the coffee, even tho it was the type of vessel that was meant for pouring sugar- had a spout. \n\nSo in order to comply, my husband holds the spoon over the coffee-slightly askew- and pours the sugar onto the spoon which then fell into the coffee in one fluid motion... \n\nEveryone cracked up laughing, including grandpa. \n\nGrandpa is still kicking at 86! And yes he’s still crazy fussy about stuff. Lol ",
        "created_utc": 1522338102,
        "upvote_ratio": ""
    },
    {
        "title": "(x-post /r/jokes) A boy scout says to his scout leader, \"Sir, is this snake poisonous?\" The scout leader says, \"No, that snake's not poisonous at all.\" So the boy picks up the snake, which bites him and the boy starts to spasm and foam at the mouth as the other kids look on in horror...",
        "author": "djb_thirteen",
        "url": "https://www.reddit.com/r/Jokes/comments/87ue6e/a_boy_scout_says_to_his_scout_leader_sir_is_this/",
        "text": "",
        "created_utc": 1522328556,
        "upvote_ratio": ""
    },
    {
        "title": "Divorce court ruling turned maliciously compliant",
        "author": "ChuushaHime",
        "url": "https://www.atlasobscura.com/places/plum-island-pink-house",
        "text": "",
        "created_utc": 1522321556,
        "upvote_ratio": ""
    },
    {
        "title": "Don't switch off every sentence!",
        "author": "ObtuseSquares",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/87zctl/dont_switch_off_every_sentence/",
        "text": "A few friends and I were in the same class (Economics). This is high school, we were seniors in our last semester and managed to get in a group together for a research project. \n\nWe had to present said report, and it filled maybe a page, in standard MLA. Not too long at all.\nSo we read it one sentence each , to pad time a bit. Teacher gets sick of this quickly and demands we stop switching off every sentence; she's clearly irritated. \nSo we glance at each other, and agreed to enact plan b. \n\nWe read one word, next person another word, next another, etc.\n\n...she made us leave the classroom.",
        "created_utc": 1522308283,
        "upvote_ratio": ""
    },
    {
        "title": "Green vehicles only",
        "author": "[deleted]",
        "url": "https://i.redd.it/scf9q9fyeno01.jpg",
        "text": "[deleted]",
        "created_utc": 1522305848,
        "upvote_ratio": ""
    },
    {
        "title": "Write 150 Characters in Chinese",
        "author": "72h2Hs7uwb2h1y",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/87yx67/write_150_characters_in_chinese/",
        "text": "So I just had my Chinese exam, and there was a composition question on the last page. It's instructions were \"Write 150 Characters in Chinese\", and the last word was in bold. We were supposed to write a letter to a friend about Chinese new year. I'm pretty bad in Chinese, so I came up with a plan.\n\n\nI began writing \"Dear Friend, The following is 150 Chinese characters. Please enjoy:\"\n\nAfter that were Chinese words simply lifted out of the question's bullet points.\n\n\nThe paragraph after that was in English.\n\n\n\"I am writing this to you as required by the Chinese exam. I would be wary, because some people may ask you to answer the questions. So I'd answer them first. I would be happy to translate them for you. Hope you write soon!\"\n\n\n\"Your Friend,\"\n\n\n[NAME REDACTED]",
        "created_utc": 1522302878,
        "upvote_ratio": ""
    },
    {
        "title": "Freshman wants to “practice his semicolons”",
        "author": "Quackattackaggie",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/87x3am/freshman_wants_to_practice_his_semicolons/",
        "text": "I worked in my college’s writing lab. I was an English major, strong writer, blah blah. So my job was to help freshmen and ESL students improve their papers. \n\nA freshman guy comes in and immediately tells me he’s only there because he has to be, but that he is a very good writer. Unlike me saying I’m a good writer 3 sentences ago, anybody else who points out they are a good writer is lying.\n\nMy style is to have the student read the first page out loud to me. I do this because when you read out loud, you find mistakes that you skim over when you read in your head. The first page is usually enough to get a sense of what they need help with.\n\nSo he reluctantly pulls out his crumpled paper from his bag and I see it as he smooths it out on the desk. I’ll never forget the sick feeling I felt; his paper was completely covered in semicolons. Where there should be a comma, semicolon. Where a period once lived, semicolon. Hell, he probably replaced capital letters and spaces with semicolons for all the trauma and therapy this paper has cost me. \n\nSo I gently ask him why there are so many.\n\n “I wants to practice my semicolons.” \n\n“Oh good, I actually taught a lesson earlier this week on using semicolons vs commas/periods. So you see, when you want to ...”\n\n“No I don’t need you to tell me how to use it, I just want to practice.”\n\n“Ok but”\n\n“Really, I already know how to use it. I just need to practice.”\n\nI’m really confused at this point, so I ask “like. Like. Like you want to practice hitting the semicolon key or something?”\n\nSo I take his paper and proceed to read it to him as it would be read properly with all the semicolons. I can’t even make it three sentences without praying for a stroke to take me. He tells me I’m being over dramatic and continues to be an overall wet turd, so I say fine let’s move on. The rest of the paper was also a disaster. \n\nSo at the end he asks me to sign a paper saying he came to the writing center. I sign it. Later that week I get an email from his professor asking if I saw the student and if so, why I didn’t correct his punctuation issues. I replied more or less saying the above. \n\nUnfortunately, I don’t know what happened to the student after that, but I assume he will one day be in congress or be my boss. ",
        "created_utc": 1522284019,
        "upvote_ratio": ""
    },
    {
        "title": "“er” day",
        "author": "[deleted]",
        "url": "https://i.redd.it/uhrw2i4najo01.png",
        "text": "[deleted]",
        "created_utc": 1522281427,
        "upvote_ratio": ""
    },
    {
        "title": "Big text",
        "author": "DerpT145",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/87we3l/big_text/",
        "text": "Recalled this from when I was in school a while ago. On mobile, sorry for bad formatting.\n\nWe had a substitute teacher at the time who gave us this assignment with really small boxes  that we were supposed to put our answers in. She wanted it in full sentences, despite the size of the box. I found this out after o was done, so she made me go back and redo all of them. She didn’t know that I had small handwriting, because I wrote large. So she told me that I had to do complete sentences. I decided to make those sentences in the largest size I could without looking suspicious. The end product was a huge jumble of words.",
        "created_utc": 1522277899,
        "upvote_ratio": ""
    },
    {
        "title": "X marks the spot",
        "author": "vk6flab",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/87vwlp/x_marks_the_spot/",
        "text": "As a software developer you come across some strange office arrangements. In the early days of my career I shared an office with three people. Our desks were placed in the middle of the room, clustered around a central point.\n\nOur office was no different from those up and down the hallway, in that desks were clustered around a central point where as I learned later the power points were located.\n\nThe thing that caught my eye one day, when most of my colleagues were out of the office for one reason or another was that the desks were not actually in the middle of the room, nor was each office the same.\n\nFor some they were sort of squashed against one corner, for others they were towards the back wall, another was close to the hallway, and the more I looked, the more random the placement appeared to be.\n\nWhen a spare moment arose in the schedule I managed to catch one of the senior staff and ask them about it.\n\nTurns out that this office was brand new, we were the first tenants, specifically built for the IT team, cabling, wiring, all purpose built.\n\nOne day during construction the facilities team turns up and asks the person in charge about the locations for power points and networking outlets. The person in charge proceeded to put a mark in the rooms that needed facilities, leaving the rooms that didn't empty.\n\nThe mark in question was a quick x-marks-the-spot with a pencil, [like this](https://i.imgur.com/ZPt7tkW.png).\n\nThe facilities team diligently measured the spot where the X marked and then proceeded to install the facilities at that exact location.\n\nBy the time anyone noticed the carpet was in place and furniture was being moved in.\n\nEdit: Spelling, image link.",
        "created_utc": 1522273801,
        "upvote_ratio": ""
    },
    {
        "title": "Undergrad Gov. Current Events Assignment",
        "author": "ElementaryHufflepuff",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/87uzyf/undergrad_gov_current_events_assignment/",
        "text": "Note: I did this more for my own personal amusement at the cost of a number of graded homework assignments.  \n\nI was taking an undergrad gov. course at a community college around 15 years ago and our professor assigned us to write a daily summary over a current event topic of our choice from any news publication.  Even though we had to write one daily, she had us turn them in only once every few weeks.  It was our job to keep track and make sure we turned in the appropriate amount for the number of days covered.  \n\nTowards the middle of the semester, this assignment started to really feel like the chore that is was.  So one night, while randomly re-reading the syllabus I noticed that she never specified what kind of sources could be used or that the current event topics had to be related to government or politics, it was only implied due to the subject of the course.  She was also the type of professor who had each of us sign and turn in a copy of the syllabus like it was a contract, so she could refuse late work later on, etc.  I decided to use this to my advantage.\n\nIf you ever stood in the check out line at a grocery store in the 90s, then you should be familiar with Weekly World News.  This was a tabloid that was the pioneer of 'Fake News'.  They were know for their fictional outlandish headlines about half-bat children, alien fist fights with Hilary Clinton, a movie enthusiast that was buried in a casket filled with popcorn, etc.  Just absurd stuff.\n\nI preceded to use this tabloid as my principle source for current events.  Don't get me wrong, by no means were these assignments half-assed.  I poured a lot of work into each one, much more than I would have if I was legitimately doing the assignment.  I even brought in legitimate news sources as supplemental material that I somehow tied-in to support my opinions and arguments about these extremely ridiculous stories.  I also wrote these current events papers in this serious completely dead-pan tone, refusing to even acknowledge the absurdity of it all.  The summaries also presumed that my professor would already have a certain amount of working knowledge on the subject, like they were national headlines.\n\nSo a few days after turning them in, she returned the assignments and each one had a failing grade.  I was able to argue my grade up to a minimal passing by pointing out that she never specified the subjects and sources in the syllabus she had me sign at the beginning of the semester.   I still wish I had these laying around, but they probably got trashed years ago.\n\nTLDR  Gov. professor assigned us to summarize current events daily.  Professor never specified to use legitimate sources.  I used tabloid stories about aliens and 'Bat-Boy' for the source material and wrote them in a serious dead-pan tone while not acknowledging the absurdity of it all.  After failing the assignment, I was able to user her own policies against her to argue my grade up to a minimal passing.",
        "created_utc": 1522266967,
        "upvote_ratio": ""
    },
    {
        "title": "China banned all mention of Kim Jong Un while he was in Beijing — so people called him 'fatty on the train' instead: As China banned all mention of Kim Jong Un on its internet during his secretive visit, people on the internet dodged the ban by calling him \"fatty on the train\" instead.",
        "author": "norax1",
        "url": "https://www.reddit.com/r/worldnews/comments/87r2zk/china_banned_all_mention_of_kim_jong_un_while_he/?utm_source=reddit-android",
        "text": "",
        "created_utc": 1522265155,
        "upvote_ratio": ""
    },
    {
        "title": "Cut that in half!!",
        "author": "Ol_Dirty_Senpai",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/87uo6c/cut_that_in_half/",
        "text": "Short story. On mobile. Be 15 at the time. My whole family will never let me live this down.  \n\n    So we're at my uncles house, and he cooks dinner for my mom, step dad, sister, himself, and I. Steak and potatoes. \n\n  I cut all of my steak into strips before I start eating. After eating a bite or two, my mother informs me that my pieces are too big.\n\n  \"You need to cut that piece in half!\" ... we all know how this is gunna go\n\n  So I pick my knife back up, cut the strip of steak into 2 chunks, scrape the two pieces off the fork, stab them both again with the fork, and put the meat in my mouth.\n\n  The whole table is staring at me, silent, until I was almost done chewing. The siblings laugh, my uncle laughs, my mom is trying to hide a smile, and my step dad didn't really care.\n\n  Needless to say, my mom made sure to tell me to cut them in half, and NOT \"shove\" them both in my mouth at the same time (I think shove is an exaggeration, but I digress). \n",
        "created_utc": 1522264486,
        "upvote_ratio": ""
    },
    {
        "title": "Portland Arts Tax",
        "author": "HerroReviWantaPho",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/87ungc/portland_arts_tax/",
        "text": "So I lost my job in 2016 and lived out my lease until early 2017, leaving in the first week of March.\n\nThe City of Portland has sent me a bill for the \"Arts Tax.\"\n\nI called and they said that even if I had lived in the city a single day into the new year, I owed them.\n\nI have written a integral equation on my check.\n\nAnyone else done this?\n\nEdit: https://imgur.com/a/5beEr",
        "created_utc": 1522264331,
        "upvote_ratio": ""
    },
    {
        "title": "Brutally honest",
        "author": "Raspite",
        "url": "https://www.reddit.com/r/memes/comments/87tha3/well_hes_not_wrong/?utm_source=reddit-android",
        "text": "",
        "created_utc": 1522263942,
        "upvote_ratio": ""
    },
    {
        "title": "China bans mention of Kim Jong Un while he was in Beijing. Chinese netizens call him \"fatty on the train\" instead.",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/worldnews/comments/87r2zk/china_banned_all_mention_of_kim_jong_un_while_he/",
        "text": "[deleted]",
        "created_utc": 1522263424,
        "upvote_ratio": ""
    },
    {
        "title": "Read this carefully. This restaurant is ripe for some exposed armpit compliance.",
        "author": "Bonkins",
        "url": "https://i.redd.it/e7p83l0yvho01.jpg",
        "text": "",
        "created_utc": 1522238789,
        "upvote_ratio": ""
    },
    {
        "title": "That's where the plans showed it, boss...",
        "author": "-DG--",
        "url": "https://i.redd.it/6c68zbhnnho01.png",
        "text": "",
        "created_utc": 1522236011,
        "upvote_ratio": ""
    },
    {
        "title": "This restaurant is RIPE for some exposed armpit compliance (read carefully)",
        "author": "Bonkins",
        "url": "https://i.redd.it/7h49z59rjho01.jpg",
        "text": "",
        "created_utc": 1522234689,
        "upvote_ratio": ""
    },
    {
        "title": "The Office",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/87oicp/the_office/",
        "text": "[deleted]",
        "created_utc": 1522205052,
        "upvote_ratio": ""
    },
    {
        "title": "Smoker’s Compliance",
        "author": "Newbosterone",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/87nfll/smokers_compliance/",
        "text": "Years ago, my state passed a law: no smoking in most public buildings.  Smokers adapted, and huddled the required 50 ft from the building entrance.  My company decided that looked bad, and extended it to within 500 ft of the buildings, which covered most of the parking lot. Smokers adapted, and huddled on the sidewalk beside the shared office building.  For health reasons,  they eventually banned smoking on company property and defined the sidewalk as part of the grounds.   One of the reasons given was that having smokers standing around was bad for the company’s image.  The smokers walked across the street and smoked in front of the neighboring building. \n\nThe malicious compliance?  Across the street, they mingled with smokers from *that* building, who were getting the same official disapproval, and convinced *them* to cross the street and smoke in front of our building. \n\nSo company X smokers stand in front of company Y and smoke, and company Y smokers stand in front of company X and smoke, and neither company can do a thing about it since it’s a public sidewalk. ",
        "created_utc": 1522195244,
        "upvote_ratio": ""
    },
    {
        "title": "Multiply events with 1 client",
        "author": "BlueberryKind",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/87mxy5/multiply_events_with_1_client/",
        "text": "Iam pretty much a maid. I help elderly or people with handicaps/diseases to keep their house clean, do the laundry and sometimes help with grocery shopping. There is also a social aspect because sadly enough iam sometimes the only visit those people get every week. I have some clients i go to every week but also many hours each week that i cover when the normal maid is sick or on holiday.\n\nOne of those clients i have been to many times over the last years.\nShe is an absolute stickler and nitpicker. Examples include putting the old paper box 90° the wrong way in the hallway and putting the blankets on the wrong chair when changing the bed (she had a chair on both sides i figured out she would complain if the blanket touched the ground i put it on a chair but even that was wrong).\n\nOne time i was dusting the bedroom, and those bedrooms are not big maybe 10 to 12m2. So when i was done i told her what should i do next. She said i had not spend enough time dusting so i should go back. Which meant me sitting down and browsing my phone for 10min afterwards she said it was so much better now. \n\nI know she wants perfection so even when i try really hard she just seems pissed that i do something well. She had a pillow in her lazy chair which i had to vacuum so i did it very thoroughly, which was of course not good because it did it to good and it would wear down that way.\n\nShe will also not believe that i did something if i said so. One time the centrifuge leaked a bit which i cleaned up when mopping the floor. She is a stickler for time so when time was up i was like well Madam iam leaving see you next week and she was like NOOOO!! you need to clean that water up. \"i already did that when i mopped the floor\" Ofcourse she would not believe so will shuffle to the washmachine saw the water was gone and be like hmmpff oke.\n\nSo to say the least she is not my favo client and everytime i think its only 2 hours and not every week.\n\nLike i mentioned before she was an absolute stickler for time. On a normal day you do a client before you go to her apartment. from 8.30 to 9 you will have 1 client and then her from 9.00 11.00. Considering the to people life on opposite sides of the building and it involves 2 elevators which more people use so sometimes you have to wait. There is no way i can finish at 9 and be at the next client at 9. So first thing she will say when you walk through her door is \"Until how later are you staying?\" \"Well its 9.05 now so that would be 11.05\"\nDoesnt matter how many times you try to explain that it takes time to move from apartments \"You should leave earlier then\" \"Well the i also will have to leave early from here to the next client\" \"hmmpf\"\n\nSo one day i saw they had messed my schedule up. For some sort of reason they had put her not on 9.00 on my list but later around 10. And the 8.30 client at 12. I knew that if i was 10 minute \"late\" according to her she will call the reception to complain blah blah blah. But i slept in for 1.5h and it was good.\nWhen i got to work reception was like Madam D called to say you where late but your schedule showed her at 10 so i told her you would be coming then. Most people know that she is not a pleasant person. \n\nWith any other person i would just have showed up at the normal time but because the planning made a mistake and i could finally piss off that client i slept in. Planning doesnt blame or even fault me its not like i can remember from hundreds of clients what their normal times are.\n\nMost of my clients are nice but sometimes you just wanna piss somebody off. \nI even asked reception after how many minutes she called to complain that they where forgetting her again, it was between 5-10 minutes like i knew she would.\n\nMaybe this is not malicious compliance enough for this sub. But it sure felt good to piss her of for ones. \n",
        "created_utc": 1522191022,
        "upvote_ratio": ""
    },
    {
        "title": "Make it classy, lots of stars",
        "author": "thumbsware",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/87m65h/make_it_classy_lots_of_stars/",
        "text": "In college, I worked at a local newspaper: ad layout guy using QuarkXPress. There was a local Sheriff election coming up. The incumbent wanted a quarter page ad. Worked up a design, we did our proofing, and sent it along. Newp. Sheriff hated the ad, and the next one, and my colleagues' versions, so he came in to instruct me.\n\n\"Make it CLASSY,\" he insisted, and demanded to my boss that he stand there to make sure I \"got it right.\" Every iteration, he'd get more irritated, and tell me, \"CLASSY! Make it CLASSY!\"\n\n\"What is classy?\" I asked.\n\n\"You know! Make it classy! Lots of stars.\"\n\nSo I started laying out the most garish ad possible. Stupid font, a border of little Sheriff tin stars, and went so far as to put every friggin' vowel inside a star. The guy friggin' loved it. He ran it in every issue and took out a full page color ad in the Sunday edition.\n\nHappily, Sheriff Classy lost that election in a landslide defeat. It had nothing to do with my ad, I'm sure. But gods it was satisfying as all hell.\n\nThereafter, when we had a difficult client, we'd just say \"make it classy\" to each other.\n\nEdited to add: This was in 1994/1995.",
        "created_utc": 1522184734,
        "upvote_ratio": ""
    },
    {
        "title": "Don't you love the HOA",
        "author": "Hand-of-Circa",
        "url": "https://i.redd.it/t6xqnitwvco01.png",
        "text": "",
        "created_utc": 1522178990,
        "upvote_ratio": ""
    },
    {
        "title": "Exactly as asked",
        "author": "seeunexttuesday123",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/87kvkt/exactly_as_asked/",
        "text": "[removed]",
        "created_utc": 1522175650,
        "upvote_ratio": ""
    },
    {
        "title": "They literally meant a box",
        "author": "[deleted]",
        "url": "https://i.redd.it/mykkb58c2co01.png",
        "text": "[deleted]",
        "created_utc": 1522168322,
        "upvote_ratio": ""
    },
    {
        "title": "\"Allergies\"",
        "author": "yaboymelv",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/87hvu4/allergies/",
        "text": "[removed]",
        "created_utc": 1522152617,
        "upvote_ratio": ""
    },
    {
        "title": "Well, it is green.",
        "author": "[deleted]",
        "url": "https://i.imgur.com/8AfG1KE.jpg",
        "text": "[deleted]",
        "created_utc": 1522151264,
        "upvote_ratio": ""
    },
    {
        "title": "/r/Vive user complies with minimum post length requirement",
        "author": "YM_Industries",
        "url": "https://np.reddit.com/r/Vive/comments/877yfm/will_vive_pro_wireless_work_with_normal_vive/",
        "text": "",
        "created_utc": 1522132121,
        "upvote_ratio": ""
    },
    {
        "title": "Thanks for clearing that up",
        "author": "HigherNoonThanYours",
        "url": "https://imgur.com/a/7o9s4",
        "text": "",
        "created_utc": 1522129436,
        "upvote_ratio": ""
    },
    {
        "title": "Well, it is green",
        "author": "[deleted]",
        "url": "https://i.imgur.com/8AfG1KE.jpg",
        "text": "[deleted]",
        "created_utc": 1522116169,
        "upvote_ratio": ""
    },
    {
        "title": "\"Green\" vehicle malicious compliance",
        "author": "randomguy186",
        "url": "https://imgur.com/gallery/pnUFB",
        "text": "",
        "created_utc": 1522107339,
        "upvote_ratio": ""
    },
    {
        "title": "Draw a keyboard, the teacher said.",
        "author": "-QuantumFury-",
        "url": "https://i.redd.it/p0yyvyss07o01.jpg",
        "text": "",
        "created_utc": 1522107255,
        "upvote_ratio": ""
    },
    {
        "title": "Malicious Compliance from the Government",
        "author": "BMWbamboozled",
        "url": "https://www.reddit.com/r/todayilearned/comments/878ei8/til_in_1994_the_kkk_applied_to_sponsor_a_section/?utm_source=reddit-android",
        "text": "",
        "created_utc": 1522101765,
        "upvote_ratio": ""
    },
    {
        "title": "What comes around, goes around",
        "author": "MiLaddo7",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/87cvx0/what_comes_around_goes_around/",
        "text": "When I was a wee lad of three, there was a fountain I was mesmerized by. \n\nI asked my mom \"can I put my hands in the water?\" \n\n\"No sweetie\"\n\n\"Okay...\"\n\nSo I went over to the fountain and put my head in the water instead.\n\nMy mother found it so funny she took a photo and it was on the wall at her house for decades.\n\n27 years later and I have a little one of my own, who's 3, and he saw a fountain and runs over to it. I wasn't thinking about my own youthful incident but I did manage to yell out, \"don't put your hands in the water!!\"\n\n\"Okay Dad!\"\n\nHe put his head in the water instead.\n\nMy parents were with me and they were howling. My dad even went over to join his grandson.  I snapped a photo for comparison purposes.\n\nSmh.\n\n[Photo of my dad and my son](https://imgur.com/gallery/ztSj9) ",
        "created_utc": 1522099690,
        "upvote_ratio": ""
    },
    {
        "title": "Pita Pit employee spits in customer's pita as requested",
        "author": "tr3ebag",
        "url": "http://www.shockmansion.com/2018/03/26/its-3-oclock-in-the-fking-morning-and-i-wanna-go-home-pita-pit-employee-fired-after-spitting-in-her-customers-food-after-they-asked-for-it-id-call-that-decent-customer-service/",
        "text": "",
        "created_utc": 1522099615,
        "upvote_ratio": ""
    },
    {
        "title": "This is some Very malicious compliance",
        "author": "[deleted]",
        "url": "http://www.shockmansion.com/2018/03/26/its-3-oclock-in-the-fking-morning-and-i-wanna-go-home-pita-pit-employee-fired-after-spitting-in-her-customers-food-after-they-asked-for-it-id-call-that-decent-customer-service/",
        "text": "[deleted]",
        "created_utc": 1522098983,
        "upvote_ratio": ""
    },
    {
        "title": "The KKK sponsored a section of the Interstate 55 near St. Louis, Missouri in 1994. Supreme Court ruled the state couldn't refuse the KKK's sponsorship. Missouri took revenge by renaming the entire highway the \"Rosa Parks Freeway\" (xPost from r/todayIlearned)",
        "author": "justmememeup",
        "url": "https://en.wikipedia.org/wiki/Rosa_Parks#1990s",
        "text": "",
        "created_utc": 1522091025,
        "upvote_ratio": ""
    },
    {
        "title": "Verify system is non-recoverable? Okay!",
        "author": "kaeroku",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/87bcsv/verify_system_is_nonrecoverable_okay/",
        "text": "About a year ago I was with a partner of mine visiting family. I usually bring my laptop so I can gel out a bit as there's often some downtime. This was a rainy day, and my laptop is in a case which isn't waterproof but it was turned off and only outside for the trip from the car to the house. My laptop is insured, and coverage includes water damage.\n\nSo after we all greet and talk a bit, things start winding down and  I go to set up my laptop, thinking I'll relax and play a game or something. I go to turn it on... boots, shuts off immediately. Uh oh. I try to boot again seeing if I can get to safe mode. This time it goes all the way to the OS, then locks up. I let it sit, come back an hour later. Still locked up. Not good. I try rebooting one more time. It turns off, won't come back on. \n\nAlright. Couple days later I'm home, decide to check it again. It turns on! But, immediately locks up again. I call the insurance, explain that I was visiting my family that day and it was raining, and after I turned it on it shut off a few times and then wouldn't come back on consistently and locks up immediately when it does. They tell me I have to take it to a repair shop for a diagnostic (out of pocket) to ensure the system is not able to be recovered before they can issue funds for a replacement. I ask if this is truly necessary, considering the system won't turn on. They say yes, that when I take it to the repair shop they'll be able to confirm whether there's water damage or not.\n\nI say okay, we hang up. I fill the bathtub with water. I turn the laptop on. I place the laptop in the bathtub. Soon enough, it turns off. I let it dry overnight, and take it to the shop the next day. The report comes back within 24 hours: system is non-recoverable due to extensive water damage. Insurance issues funds.",
        "created_utc": 1522088352,
        "upvote_ratio": ""
    },
    {
        "title": "The story behind the naming of Busch Stadium, home of the St. Louis Cardinals.",
        "author": "Totschlag",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/87ayy4/the_story_behind_the_naming_of_busch_stadium_home/",
        "text": "Busch Stadium in St. Louis is home to the St. Louis Cardinals baseball team. The Cardinals are extremely beloved by the populace, which means the current Busch Stadium is probably the most recognizable structure in St. Louis after the Arch. But Busch Stadium is actually known as Busch Stadium III. The 2 previous stadiums that the Cardinals played in were also known as Busch Stadium. So how did all of them get that name?\n\nThe year is 1952. The Cardinals owner, August \"Gussie\" Busch is tired of playing in \"Sportsman's park.\" He wants a name change. So he decides that he is going to do a bit of cross promotion with the other company he owns, Anheuser-Busch. He wants to promote his best selling line, Budweiser. He messages the MLB commissioner's office to say that the Cardinals will now be playing in Budweiser stadium. But this was 1952. The Commissioner's office didn't want to promote alcohol at that level yet. The Commissioner's office said the name wouldn't stand. They cite a rule stating that teams can not name things after Alcohol.\n\nGussie was pissed. He messaged the Commissioner's office saying that he would concede and decided to name it after himself. Thus, Busch Stadium. The Commissioner's office agreed and Gussie set his plan in motion for the 1953 season.\n\nFast forward two years. Gussie has been working on his plan for 2 years and in 1955 he decided that the recipe was ready. Gussie, with the knowledge that Major League Baseball already okayed \"Busch Stadium\" releases a new line of beer. Busch Beer.\n\nThe MLB is pissed. The Commissioner's office messages him.\n\nGussie's response: Well you said I couldn't name my stadium after a beer. You didn't say I couldn't name my beer after a stadium.\n\nThe Busch Stadium name has stuck for at least 73 years, as the current naming rights expire in 2026.",
        "created_utc": 1522085544,
        "upvote_ratio": ""
    },
    {
        "title": "You don't get paid these hours",
        "author": "tdaholic",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/87auez/you_dont_get_paid_these_hours/",
        "text": "There is a lot of back story you need to know to fully understand the whole situation, I'll try to detail it as much as I can but I barely scratch the surface.  I'm doing this on mobile so I apologize for the formatting.\n\n I work for a plumbing/HVAC company as the only electrician.  They want to expand their business and want me to grow the electrical side of things.  The previous electrician was very disorganized and the inventory reflected that. There has been a lot of drama as of late and our shop time is now considered non billable... People abused it in the past (especially the last electrician) so now we don't get paid any shop time.  \n\nSo here I am, hired on to take over the electrical and I inherited a mess, the inventory is out to lunch to name one of many things.  This is where my malicious compliance comes in.  The inventory was logged in under names that don't properly reflect what they are, trade names are not listed so when I do a job, I have to go through the inventory with the accounts receivable and ensure the right part number is selected.   This is time consuming and non billable time because I'm not paid for shop time and I can't bill a customer for the time for moral reasons.  \n\nWith it being slow, we were told to do inventory and asked to do it for 10 dollars an hour (average) less than our journey man rate, (plumbers, HVAC, electrician) all took pay cuts to count inventory. This is because the company has mismanaged their jobs and also don't receive timely payments from customers... So funds are hard to come by (if I knew this was the case when I started 4 months ago, I would of said fuck no to this job). We signed a piece of paper saying that our wage would be lower during inventory count...and since I didn't want to be that asshole that wouldn't take a cut, I signed it.  \n\nSo off I go, gathering up the many goodie boxes of electrical and taking it to the electrical area to be counted.   I do a count of all the breakers we have and since the inventory is messed up, I figured I'll fix the description for the breakers in the computer.  For anyone that isn't familiar with electrical, breakers do not have part numbers on them (supplier pns).  What you write on your job sheet is 2P20A, square d, push on; which is a 2 pole 20A breaker.   The inventory is so screwed up that even as an electrician it is hard to figure out what is what, nevermind the accounts receivable trying to decipher trade terms and find the product under vague descriptions in the computer (for eg. there are 7 items in the program that all have the same description so without knowing part numbers...you are fucked).  \n\nSo I created an Excel sheet of what the part numbers were and what they should be called in order to find them easily from the job sheet description.  I handed this in for the accounting to update the software with and went on counting other things.  So the next day as I came in, a secretary hired temporarily to adjust numbers and log inventory counts came up to me holding my Excel sheet.  Without asking me why I did what I did, she told me very rudely that I would not be paid for the time I wasted writing out new descriptions  and to solely use the sheets provided for counting without anything supplemental.  So in other words, I'm told from a temp employee who knows nothing about electrical, is not my boss, that I would not be getting paid for time I spent trying to make life easier for everyone.   I bit my tongue and went home to spend the day with the kids...fuck inventory.   If this was the only thing I've had to encounter...sure, a few hours....who cares.  But i have been consistently eating my time to make things work and this was the final straw, \n\nI was pissed.  I stewed over the weekend and came to the conclusion that I will comply.  I'll do exactly as the temp employee told me to do...count.  Come Monday, that is exactly what I did...knowing full well that my count would be a huge waste of time because A. They won't know what the product is on the software.  And B. Even if they do, the first job done with a piece that doesn't have a part number on it will fuck accounts receivable up and I'll have to go through and fix it then.  So fuck it, they want a dummy count, I'll give it to them and they can deal with the mess that will follow. \n\n\nTLDR: jman electrician took a pay cut to count inventory, decided to fix inventory to make life easier for everyone, told I was paid to count not fix, complied and let them sort out the mess. ",
        "created_utc": 1522084597,
        "upvote_ratio": ""
    },
    {
        "title": "You can come replace it now",
        "author": "moration",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/87a53o/you_can_come_replace_it_now/",
        "text": "Back in the early 70s my family lived in base housing. My Dad for some unknown reason^drunk fell through the sliding glass door and got cut pretty bad because it was not safety glass. My Mom calls up base maintenance to replace the glass ...\n\nMom: Can you replace it with safety glass?\n\nMaintenance: Sure we can.\n\nMom: Can you replace the other sliding door too? We have small children in the house and I'm worried they will get hurt.\n\nMaintenance: No mama we can't do that unless it's broken.\n\nMom: OK, hang on (puts phone down, launches chair through other sliding door) you can replace it now.\n\nMaintenance: Yes mama.",
        "created_utc": 1522079398,
        "upvote_ratio": ""
    },
    {
        "title": "Okay, Bye!",
        "author": "mbeavitt",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/8797yq/okay_bye/",
        "text": "When I was 10 I was a little horror - always trying to get attention, always making noise and inevitably, annoying my parents.\n\nOne sunny afternoon I went with my dad on a job he was doing for a friend (digging out an area for a water tank).\n\n He took me, erroneously thinking I'd find something to do and maybe play with his friend's son, but I just ended up asking him all sorts of stupid questions, getting in the way etc.\n\nAt one point, exasperated, he said \"oh just buzz off, will you?\", so off I went. After 3 hours and 4 people looking for me I simply sauntered in having napped in a bush. I'd even watched them go past looking for me.",
        "created_utc": 1522072117,
        "upvote_ratio": ""
    },
    {
        "title": "Fine, I’ll work on a different cart",
        "author": "thesaladcartographer",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/8769bt/fine_ill_work_on_a_different_cart/",
        "text": "Fairly short one, also first time posting here\n\nThis one happened a couple months ago. I work as a truck unloader/shelve stocker at a retail store. When we stock the shelves, we have carts that are loaded with items from one or two different aisles, and each department has a few aisles to stock. Sometimes there is more than one cart for an aisle. I was working in the same department as one of my coworkers who I enjoy talking to while we stock.\n\nAt one point, our manager walks up to me and tells me, “I don’t like you both working on the same cart. Go get another one and work on it separately.”\n\nSo I walked to the back, grabbed another cart from the same aisle out of spite, brought it back, and got back to working and talking.",
        "created_utc": 1522036564,
        "upvote_ratio": ""
    },
    {
        "title": "What's the best apology you've recieved/ given?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/874njs/whats_the_best_apology_youve_recieved_given/",
        "text": "[removed]",
        "created_utc": 1522020374,
        "upvote_ratio": ""
    },
    {
        "title": "Originally from r/amathenedit",
        "author": "[deleted]",
        "url": "https://i.redd.it/5mwnwhe6fzn01.jpg",
        "text": "[deleted]",
        "created_utc": 1522015226,
        "upvote_ratio": ""
    },
    {
        "title": "Server hates Cutlery rolls; Makes hundreds to prove point",
        "author": "kshao147",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/872aci/server_hates_cutlery_rolls_makes_hundreds_to/",
        "text": "My apologies if I've formatted this improperly, gotta start a shift soon.\n\nEDIT: For clarification, our GM has to approve any new rules for both front and back. Our service manager is not well liked and has caused a larger than average turnover rate at our store. She also has hypocritical tendencies, such as telling off people for doing one thing then reprimanding them for not doing it.\n\nBackstory: I've been working as a server at a family restaurant with a high standard of customer service for over 3 years now. Because of this, I've seen people come and go, including two General Managers and six Service Managers. One of our current Service Managers was transferred to our location due to \"bullying.\" In reality, she has some quirks that makes it...difficult to work with. If you can't settle with malicious compliance with her/shut up and nod, you're watched over for anything that can get you written up/put on her \"list\".\n\nStory: Our restaurant was starting to run low on cutlery. It was technically enough for all seats in the restaurant, but you never have a dishwasher wash everything instantly. Our General Manager is scheduled to go on vacation for two weeks. A couple days after he's left our Service Manager implements a new rule that all three cutlery bins must be filled before the server leads can go home. Each bin holds roughly 100 cutlery rolls. This rule is only in place because morning rushes need cutlery rolls, and otherwise someone *coughcough* would have to help servers set cutlery.\n\nFlash forward 2 weeks. Our general manager is back, and some of the other server leads have been grumbling about this rule quietly. It's my shift as a server lead and our general manager is closing the restaurant. \nThe shift is brutal, and the restaurant is a mess. I end up finishing my cleanups an hour and a half after closing. (As context, at late night we have two servers and usually a single greeter-seater.) I then wait on the dishwasher to finish washing up the cutlery. I spend the next hour rolling all the cutlery possible in the restaurant and tightly fitting them into the baskets. At around 2 AM, I go to the manager's office.\n\nMe: I've rolled as much cutlery as I can but we don't have enough to fill the third basket.\nGM: Wait what?\nMe: Yeah, as per the new rule, it's mandatory to have three FULL baskets, but I only have 2. I physically cannot roll anymore cutlery.\nGM: What rule?\nMe: The rule Service Manager A told us.\nGM: ...Alright. I got it.\n\nThe next day, he spoke with the Service Manager and told her that if she wanted to implement the rule we'd have to have more cutlery in the restaurant. About a day after we received the new cutlery, the rule was also lifted.\n\nAs a side note, server leads are paid an extra dollar an hour, our restaurant is attempted to cut hours, and the new cutlery was something we'd been asking for because we were running out on shift.\n\nTL;DR : New rule goes up that no one can complete, I protest the rule to our General Manager, he gets the rule taken down plus we have extra tools to help complete our jobs.",
        "created_utc": 1521999706,
        "upvote_ratio": ""
    },
    {
        "title": "Not enough Detail? you asked for it.",
        "author": "thebladeofchaos",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/871n8y/not_enough_detail_you_asked_for_it/",
        "text": "I'm on Jobseekers allowance in the UK, effectively 'you're not employed, here's some money to help you survive until you get your next job with the condition that you prove your looking', which amounts to putting in your applied jobs and what your doing to make sure your doing it. they say do 35 hours a week but what they mean is 'have X amount of jobs applied for'.\n\nSo I have a record of putting in minimalist details due to not knowing what they were looking for. things like 'applied for x x y job on z site' which had gotten me through for the most part, until I got up to a month or so ago. and the adviser I had informed me that it wasn't good enough and to give them more detail.\n\nBefore I was doing roughly one entry a day, saying what I'd applied for and where.\n\nAfter that I had done about 11 pages of updates. it's something like 15 updates a page and 250 characters max an update. still doing my job search but putting in things like 'I applied here for job -web link-, contact name x email y' or 'this job -web link- didn't apply for due to Y reason'\n\nSurprisingly they were more annoyed then before that I went from one extreme to the other, but they couldn't exactly fault me over what I'd done. In fact their biggest complaint was having entries that seemed irrelevant. My counter point: it's the time I'm starting and ending.\n\nThey actually asked why I hadn't done this before, and my answer was an honest 'I didn't know how much detail you wanted'. They then told me that I was doing too much.\n\n'you asked for more detail, I simply fulfilled that requirement'",
        "created_utc": 1521994164,
        "upvote_ratio": ""
    },
    {
        "title": "Blackjack Quickie",
        "author": "buffingtron",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/871l74/blackjack_quickie/",
        "text": "I'm a blackjack dealer at an Oklahoma casino.\n\nHand is dealt. Asshole player generally being rude/never tipping me recieves a hard 12 with a table max bet of $200, which he proceeds to grumble about. Dealer shows 2.\n\nHe's pretty irritated, because he's been losing all night(duh). In his grump, he decides to DOUBLE DOWN on his 12, now betting $400.\n\nI shoot him the \"Are you *sure*, dude?\" glance I've become so accustomed to in my line of work. \n\nHe responds to my look with angry shouting, \"Just fucking **hit** me!\" \n\n\"Alright, brother.\"\n\nFace card, player bust. $400 gone in an instant. Dealer flips 12 and draws a 9 for 21. All the other players lose, but they were a group of friends, and none of them were tipping or calling out their asshole buddy, so I don't really care. Icing on the cake. \n\nTL;DR Asshole blackjack player makes a reeeeeeeally dumb move, that not only fucked him, but also everyone else at the table. During his hand he cursed me, so I took a great deal of internal pride in delivering his bust card to him, then wiping out his buddies.\n\nEDIT: typo",
        "created_utc": 1521993697,
        "upvote_ratio": ""
    },
    {
        "title": "We aren't allowed to speak English? Ok.",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/871i4y/we_arent_allowed_to_speak_english_ok/",
        "text": "[deleted]",
        "created_utc": 1521992958,
        "upvote_ratio": ""
    },
    {
        "title": "Mark them all as perennials? Ok.",
        "author": "waldo06",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/870mmj/mark_them_all_as_perennials_ok/",
        "text": "TL:DR at bottom.\nAbout 10 years ago I worked at a garden center (big home improvement store that also sold plants) as a \"Plant Specialist\". Basically I was paid $10 an hour to arrange plants, trim them, and read the tags to people to explain what they needed to grow (shade, lots of water etc).\n\nThe big boxgarden center had a policy that any perennials were guaranteed for a full year. If they died for any reason bring them back for an exchange or your money back. Not a bad deal except they had a huge problem. I work in Upstate NY where if it can't live over winter at 0 degrees, it isn't a perennial. Well we got in a shipment of tons of plants that in NY were annuals (will die come winter) but in Florida (Where they were originally destined) they are perennials because it doesn't get as cold. \n\nMe: Hey, Lame Manager (LM), we need to take out these tags and put them with the annuals.\nLM: No, put them with the perennials\nMe: Uhh, they will all die and be returned.\nLM: Just do what the tag says.\n\nSo I did, I load all these plants in the perennial section and continue on with my normal tasks. In walks in a guy from a landscaping company who we will call \"Cheap Skate\" or CS for short. He always was browsing the partially damaged plants to go put in for people so he could save a few bucks. \n\nCS: Wait, what? why are these annuals marked as perennials. They will die by September for sure here.\nMe: LM told me to do that.\nCS: Does the guarantee still apply?\nMe: Yes. Just keep your receipt and the original packaging that says perennial\nCS: No Shit *calls up a worker*\n\nCS has another guy arrive with a truck and they buy ALL of the mismarked plants. Like $15k in plants. They load up and take off. The next day \n\nLM: I'm going to get a huge promotion! We made our biggest sale day EVER\nMe: I bet in September you're going to get fired\nLM: Why?\nMe: They are landscapers and I guarantee they will be back in September when all $15K worth of plants are dead and get their money back since we can't exchange because they will all be dead or out of stock.\n\nLM spent hours asking every employee who the landscaping company was and tried in vain to contact them to get them to return them but no dice.\n\nI went back to school end of August, but when I came back the next spring LM was gone and there was a mandatory \"Training\" for all staff as to what perennials were and how they needed to be marked.\n\n*edit* for those asking about the return, according to a full time employee the guy came back in September or October  and got the store manager and basically said \"here are my receipts, here are the tags that all say these \"perennials\" will die if it gets below freezing, it's 18 out as we speak so they are all either dead, or dieing. We can either go through each container and plant individually or you can save us all several hours and realize the mistake and just give me the store credit (I forgot it was store credit not refund, but for a landscaper that spends thousands there a year it isn't a problem.) The manager had already been warned that this was possibly going to happen by some of the cashiers that didn't like LM and basically just credited the entire sale to the guys contractor account.\n\n*edit 2* adjusted names of the stores so it won't get removed by a mod\n\nTL:DR Manager doesn't know what perennials are, sells 15k of annuals as perennials to a landscaper  and then gets fired because they all get returned when they die for a loss of 15k.",
        "created_utc": 1521984036,
        "upvote_ratio": ""
    },
    {
        "title": "When my sister's dinner order is taken literally...",
        "author": "TheEngine1781",
        "url": "https://imgur.com/ik5RhL3",
        "text": "",
        "created_utc": 1521955962,
        "upvote_ratio": ""
    },
    {
        "title": "How do you spell first and last",
        "author": "hicctl",
        "url": "https://www.youtube.com/watch?v=YK7-SiWn95Q",
        "text": "",
        "created_utc": 1521953176,
        "upvote_ratio": ""
    },
    {
        "title": "James Fridman is a god of photoshop malicious compliance",
        "author": "selenagomezfart",
        "url": "http://jamesfridman.com/",
        "text": "",
        "created_utc": 1521941313,
        "upvote_ratio": ""
    },
    {
        "title": "In Elementary School, I made sure to turn in my story to my teacher.",
        "author": "ticktock1001",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/86xfy8/in_elementary_school_i_made_sure_to_turn_in_my/",
        "text": "So when I was in 3rd grade, I had a teacher Mrs.Scott. She was very mean and I didn't like her much. I remember some time in the fall portion of the year, she assigned us to write a story and turn it in. She stressed that this would be a big part of the grade and we could not turn it in late. I enjoyed writing stories (fictional) so I very happily hand-wrote my 2 pages and submitted it. \n\n\nAbout two weeks later, she asked me why I didn't do my assignment. I said I did and she said she didn't receive it. I told her I definitely gave it in (we would just drop it in a large pile so I just assumed she didn't check carefully) but she insisted I didn't give it in. She told me she would bring this up during our parent-teacher conference and for the next week as punishment, I would have to sit out during recess (basically I would have to sit on the sidelines and couldn't play with my friends, or if it was a movie recess, I would have to sit in the administrative office) and that was basically devastating. She also didn't let me write a new story as it went against her \"turning it in late\" policy which also infuriated me as I KNEW it was her fault.\n\n\nI was super angry as I had put a lot of effort into writing it and I knew I had definitely submitted it and was being unfairly punished by her misplacing it. Fast Forward a couple months later, after we returned from winter break, she pulled me aside and told me she found it in her bag (??? HOW DO YOU EVEN NOT NOTICE IT) and it had some coffee stains on it. Obviously, I was outraged that she had misplaced it as I suspected, and even spilled some stuff on it. Instead of apologizing however, she told me to remind her next time I submitted an assignment so we \"wouldn't have this situation again.\" Of course, I complied.\n\n\nSo as a tangent, I'll talk about my public library. To print something, each page would cost 2 cents, and we were given 20 pages to print. However, I had multiple library card numbers as I had \"lost them\" and asked for a new one but then realized it was in my desk or whatever. I had used my printing pages every now and then but I had well enough for a few printing jobs.\n\n\nFor our next assignment, we had  a printed story which was again 2 pages. She again reminded us that it was important to turn it in on time as it was a big part of our grade and would not be accepted if turned in late. So I wrote my story, and printed my 2 pages...10 times. You see, in elementary school, we had 10 periods. Some of these periods of course were art,lunch, and science where my primary teacher, Mrs. Scott, wouldn't be teaching but she WOULD be moving us to the designated areas.\n\n\nOn the day of submission, I brought all of my copies in a folder and carried it with me for most of the day. In the beginning of each period, I would make sure to hand in my submission, in person, with a cheerful smile while saying \"To avoid our last unfortunate situation, I'm making sure to remind you of my submission.\" In the event I couldn't talk to her in the beginning of the period, I made sure to give it to her asap, with same cheerful smile and same line. If she was moving us to a different area, I would make sure to hand it to her after she dropped us off so she would have a bit of light reading to do on her way back to our classroom. At the end of the day, I was absolutely certain that I had submitted it, and that she had received it.",
        "created_utc": 1521939310,
        "upvote_ratio": ""
    },
    {
        "title": "Teacher said I talked too much",
        "author": "aloneindankness",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/86x4n5/teacher_said_i_talked_too_much/",
        "text": "I talk a lot, I will admit. I try to be respectful, however, and I am straight up with teachers about it. Usually, after the first class, I'll tell them that they are within rights to ignore my hand in the air.\n\nThis teacher was a piece of work. She was straight up mean. After our first essay, she berated the entire class for an hour, before trying to teach us how to write. The essays weren't that bad, she was just an asshole.\n\nHalfway through the semester, she handed out a mid semester evaluation for herself. It was basically questions about whether we liked the class and what could be improved.\n\nThe next class, she went through our ideas as a class. For her last point, she said, in front of the entire class, \"There is a student who talks a lot. This student tends tell long anecdotal stories to make their points. Some students want this student to leave room for other students to contribute.\" Everyone was staring right at me as she said it. They ALL knew who the student was.\n\nNow, I don't have a problem her talking to me about this. It is a valid complaint, and I would have been happy to work on it, but she said it in front of EVERYONE. She put me right on the spot, and made me feel like such shit. I talked to her about it after class, and she basically told me that multiple students had complained, and she wanted to make sure they knew I had been talked to. She told me to stop talking in class, and leave room for other students.\n\nMaybe you disagree with me on this, but it felt really rude. I was actually hurt and deeply embarrassed. Friends of mine, who were in the class, were shocked that it had happened. I told them it was fine. I would do as she asked.\n\nThe next class time, I kept my mouth shut. I didn't raise my hand, I didn't speak, I didn't contribute at all.\n\nThe problem was, neither did anyone else. Those \"multiple people\" who had complained apparently didn't actually have anything to say.\n\nI didn't say a word for a total of three class sessions. Those sessions were the quietest, most awkward sessions of any class I had been in. \n\nSee, no one wants to be the first person to talk. I had talked a lot, yes, but I also started the conversation.\n\nAt the end of the third session, she pulled me aside and apologized. Things went back to normal next session, and no one ever brought it up again.\n\nEdit: The teacher had multiple complaints filed against her. She was an adjunct professor, and she was not asked to come back.",
        "created_utc": 1521936297,
        "upvote_ratio": ""
    },
    {
        "title": "Not what she meant: German Club malicious compliance",
        "author": "liltooclinical",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/86vyv3/not_what_she_meant_german_club_malicious/",
        "text": "Short one, quick backstory: in high school I took German as my foreign language because of family heritage. I grew up around relatives that spoke it, though rarely, and already knew a handful of things like a dinner prayer, some slang terms and a few swears my 1st generation uncles used on the farm.\n\nAs a senior you could join the German Club which was basically just an excuse to hang out and practice speaking after school but once a year we had a big party with all of the other foreign language clubs. We would compete in various activities and pass the trophy around from year to year to whichever club won the most. That year I was on the club volleyball team and not much of an athlete, but volleyball was something I could actually play. During a particularly intense volley I messed up and allowed the other team to score.\n\nIn the moment I cursed. \"Ah, shit!\" I barked in front of every teacher in attendance. My German teacher, as she should have, tried to correct me for the inappropriate slip, but all she said was my name in a serious tone. So I corrected myself, \"Of course, *auf Deutsch. Ah, ~~sheise~~ Sheiße!\"*\n\nEveryone, including the other language teachers, laughed, however she didn't find it nearly as funny as everyone else. I sat out the rest of the competition.\n\nEDIT: It's been almost 20 years, my German spelling sucks.",
        "created_utc": 1521925304,
        "upvote_ratio": ""
    }
]