[
    {
        "title": "HOA tried to punish us - Told us to \"Stop them if we can\" - Malicious compliance cost them 16% of the annual HOA income - And the cameras are still installed today",
        "author": "FirstContribution236",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/11n6mmx/hoa_tried_to_punish_us_told_us_to_stop_them_if_we/",
        "text": "This happened several years ago, and is a multi-year long story - I'll keep it as succinct as possible.\n\nWe installed cameras in front of our home that were looking at our vehicles. Part of the camera angles did overlook parts of two neighbor's properties (one back yard and one side yard). \n\nThe cameras were battery operated and had a function where you could \"gray out\" areas that you didn't want to film. When motion occurred in the grayed out areas, the cameras would not be activated to film.\n\nThe neighbors' entire properties and several bushes on our property were grayed out - we did this when installing them. \n\nOne of the neighbors was a friend - and had no issues with this whatsoever (we showed her the camera angle - and she said she didn't care whether or not we grayed out that area - we still left it grayed out over battery life concerns).\n\nThe other neighbor's name was Karen (not really, but we all know why I chose that name). Karen was on the HOA board and, as you can imagine, we didn't get along with Karen or the HOA Board. We told Karen about the camera and showed her the grayed out areas at the same time that we told our friendly neighbor about it. It was simply an FYI conversation (we are not on friendly terms) - not an \"asking permission\" conversation.\n\nShe told us to take the cameras down immediately or we would regret it.\n\nAbout a week after we hung the camera up, we got a notice from our HOA that we were violating the bylaws. The bylaw in question? A \"nuisance to your neighbors\" bylaw. There wasn't a specific bylaw preventing placement of cameras, so this is all they could find to try to punish us.\n\nWe responded with a letter detailing how we were not violating any bylaws or laws in general - and asked them to cease and desist.\n\nWe all know how these stories go though. They did not cease. And they did not desist.\n\nTheir first response? \n\n\"The HOA has the right to enforce these bylaws. Try to stop us, if you think you can.\" (These types of responses were, unfortunately, quite common from this board.)\n\nWe entered this battle with one goal in mind: to cost them as much money and time as possible. The HOA hired a lawyer specifically to fight us. To my knowledge, this has not happened to any other residents. In the following 4 months we ended up costing the HOA over $4,000 in lawyers fees fighting this battle. For reference, the entire HOA income was \\~$25,000/year. \n\nWhen it came time for our official HOA hearing over the matter, which we had successfully postponed  (thanks to an attorney friend) 3 separate times. There were over 100 back and forth emails with the HOA attorney and ourselves. Each one of those emails was a 15 minute expense for the HOA. And I was happy to follow up a follow up question with another follow up question if it meant the HOA attorney was going to keep billing them (Did I say \"follow up\" enough times?). \n\nWe didn't actually want to take this battle to court, so we ended up removing the cameras the day of the hearing (to prevent being fined - even if the fine wouldn't hold up in court). The HOA decided in the hearing that we were guilty (surprise, surprise) of violating the bylaw. They couldn't fine us - as the bylaws don't allow a fine until after a hearing has been held - and the cameras were already removed. \n\nIn the end, the punishment was a sternly written piece of paper on the attorney's letterhead (delivered via certified mail) that stated that we were \"...not allowed to place a camera on our home that had the potential to invade a neighbor's privacy.\" Keep in mind, the letter specifically stated the camera could not be placed \"on our home.\"\n\nWe left the cameras off of the home for about 4 months -  until the annual HOA meeting. You should have seen the look on the HOA Board's faces when I asked them to explain the $4,000 line item for attorney's fees that simply stated \"Title searches - Attorney fees.\"\n\nThe Board actually tried to hide the fact that they spent $4k trying to fight us over a couple of cameras by putting the fees in as \"Title searches.\"\n\nNeedless to say, that meeting did not go well for them. About half of them lost their positions on the Board. The other half (including Karen, unfortunately) remained on the Board.\n\nAbout a week after the annual meeting, we installed new cameras - facing the same direction as the prior cameras - only this time, we installed a post in the ground and mounted the cameras to that post. The admonishment we received after the hearing specifically stated that we were not allowed to install cameras \"on our home\" - and said nothing about putting them on a post.\n\nThey did send a letter to try to tell us to remove the cameras, but a sternly worded response indicating that we were prepared to fight them actually worked this time around. I guess they didn't want to spend another $4k fighting us. We didn't receive any follow up responses. And the cameras on the post are still installed to this day (over 2 years and running strong).",
        "created_utc": 1678402284,
        "upvote_ratio": 1.0
    },
    {
        "title": "My Dad took moms truck away",
        "author": "Purple-Bat-6880",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/11n4m03/my_dad_took_moms_truck_away/",
        "text": "So when I was younger, about 8-10, my parents got into a heated argument. I don’t remember every detail but it went along the lines of him saying “I pay for everything(not true) and that truck is in my name”. It ended up escalating to him taking the truck from her and saying “good luck getting to where you need to go”, the truck was in his name so he believed it would stop her. Before all this we were a family with 5 kids 2 adults and one vehicle. My mother constantly took the VIA bus everywhere. This included grocery stores, doctor visits, her two jobs, and anywhere else needed. So this was nothing new to her. About an hour later she says to me “wanna go to the bank” and of course being a mommas girl I jumped up to go. We walked about 2-3 miles(our city doesn’t have via routes) to get to the closest stop. All in all the trip took us about 5 hrs to get to the bank get back to the stop and then walk home. \n\nMy father was visibly upset as to why she was gone so long, took his child, and didn’t say anything to him. So she simply responded “Truck or no truck I have things to do”. \n\nHe said nothing else to her and just handed her back the keys.",
        "created_utc": 1678397805,
        "upvote_ratio": 1.0
    },
    {
        "title": "Follow the policy!!! Fine, no problem",
        "author": "SmileyJohnson900",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/11n3jw5/follow_the_policy_fine_no_problem/",
        "text": "[removed]",
        "created_utc": 1678395442,
        "upvote_ratio": 1.0
    },
    {
        "title": "Rate my music 1-10",
        "author": "tanbo_theman",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/11n08h0/rate_my_music_110/",
        "text": "[removed]",
        "created_utc": 1678387807,
        "upvote_ratio": 1.0
    },
    {
        "title": "The Microwave Decree",
        "author": "zepphiu",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/11mvx1r/the_microwave_decree/",
        "text": "Some time ago, break room cleanliness went downhill. Started off small. Cutlery was left in the sink instead of washed, coffee rings remained on tables. It took a turn to tragedy when microwave manners stopped. Suddenly lasagna remains and gravy stains happened every day. \n\nFortunately, Helen was on the case. Strategically placed posters and a polite e-mail encouraged everyone to clean up after themselves. Yet, the microwave madness continued. There was a second wave of reminders, a little more passive aggressive. Then the Chili Incident. The whole microwave interior, door to floor, all around, was left coated in a thin layer of exploded chili. Understandably, Helen was not happy. \n\nThe newest directive was swift and punitive. We were to leave the microwave spotless. Anyone caught desecrating it would face disciplinary action. Nothing more was specified, just that vague threat. The manager, equally tired of the melodrama and mess, and perhaps a little frightened of Helen, signed off on it. Helen was delighted and spent a few hours happily telling everyone that this would surely fix the problem and restore peace to the broken break room. It seemed a little too draconian for my tastes. \n\nThe next day, brought in stir fry leftovers. Used the microwave and, shame, a bit of sauce coated broccoli slipped away. Took out the spinning plate. Gave it the best possible treatment. A hot, bubbly bath in the sink. Gently scrubbed down with a sponge. Hummed some bosso novo to really tie together the experience. The inside of the microwave door also had some debris stuck on. Wiped that away, then the rest for good measure. The top too, in case of dust. Used toothpicks to clear vents and scrape gunk from the buttons. After half an hour the appliance looked new. \n\nWell, those thirty minutes were also during the lunch period, which meant a good number of coworkers stopped in to use the microwave. Had to stop a few times to let someone use it, which restarted the cleaning. Everyone understood that since microwave cleanliness was now the most important thing in the office, this was a necessary task to be completed immediately. \n\nEveryone except the manager. Wasn't too happy that I took so long doing something that was far outside my job description, instead of actual work. The decree was dropped. A new system was established with rotating cleaning duties. With everyone equally responsible for managing mess, cleanliness and peace were restored.",
        "created_utc": 1678377741,
        "upvote_ratio": 1.0
    },
    {
        "title": "You want us to make the chief guest feel welcome? Alright",
        "author": "OkDoubt1294",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/11mnw65/you_want_us_to_make_the_chief_guest_feel_welcome/",
        "text": "[removed]",
        "created_utc": 1678354128,
        "upvote_ratio": 1.0
    },
    {
        "title": "World Peace",
        "author": "unityofreligions",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/11mnh7i/world_peace/",
        "text": "[removed]",
        "created_utc": 1678352513,
        "upvote_ratio": 1.0
    },
    {
        "title": "When Jim Flannery did or didn’t steal our identity for a reddit AMA that never was",
        "author": "notjimflannery",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/11mcivh/when_jim_flannery_did_or_didnt_steal_our_identity/",
        "text": "[removed]",
        "created_utc": 1678319652,
        "upvote_ratio": 1.0
    },
    {
        "title": "So you won't do what you are supposed to and want to waste company money? OK",
        "author": "JacksonAZ69",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/11m88ee/so_you_wont_do_what_you_are_supposed_to_and_want/",
        "text": "I have to keep this vague but I provide service for a company in the US that is well within the top 50 of the Fortune 500. They have a large number of stores and I provide service for a couple specific pieces of equipment at each location. Occasionally one of the many components on these pieces might fail and while most times we need to send a technician out to repair it or replace a part, there is one particular component that the store must send in to me directly for repair. \n\nOne particular store had opened up a ticket to have this repaired a month or two ago, and despite very detailed communication to them on how to remove it and where to ship it, it never arrived so we closed the service call.\n  I just received a new work order for this same store and the exact same issue. Except in the body of the service notes, they put that they would not be sending this particular part in for repair.\n\nCue the MC: OK you don't want to follow rules? No problem. I will just send you a brand new part costing you over $1200 when the repair guaranteed would've been a small fraction of that.",
        "created_utc": 1678309741,
        "upvote_ratio": 1.0
    },
    {
        "title": "No idling? No problem!",
        "author": "IneptLobster",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/11m7hin/no_idling_no_problem/",
        "text": "[removed]",
        "created_utc": 1678308020,
        "upvote_ratio": 1.0
    },
    {
        "title": "Parents complain I use off limits private street parking, even tho I live here",
        "author": "ConceptAggravating95",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/11m4zmb/parents_complain_i_use_off_limits_private_street/",
        "text": "I live next to my son's high school, in a large rural-ish cul-de-sac. There's signage about it being off limits for school parking, pick up and drop off because it's a private community even though it's not gated any longer. It was all originally owned by one family but we all now make decisions about the space because it's technically not a residential public road. \n\nEven though it's off limits to parking a lot of parents do use it for dropping their kids to avoid the heavy traffic. If they're not taking a parking spaces and it's just a quick hop in hop out and honestly we all don't care. If it doesn't bother anybody, ok. I have not and would not complain about that. \n\nMy son goes to his friend's or practices after school so when I'm out of work I'll go pick him up and he usually leaves his backpack in the car if he doesn't have homework. So in the mornings we leave the house, head to my car where he picks up his backpack and walks into the school and I leave for work. \n\nSome of the parents who like to come through the cul-de-sac have left multiple complaints with the school that I am using the residential parking and yet they have never asked me if I live in the house I'm parked in front of (we do not have driveways). The school isn't going to tell them I live there but they have my address on file for the most part they should be aware however I have gotten a few letters. Nothing a quick chat can't fix. \n\nThen I noticed that these parents (who still have not spoken with me) escalated this to parking enforcement and the local police department. They can't ticket me for parking my car overnight in front of my house but they have multiple times. Because they CAN ticket a parent using the street and every time they have done this I've had to waste time to go in and prove that I live there. Which means that they are not running my plates and just ticketing me under the assumption I'm a parent parked there. Even though I have proved I live here, it still happened 5 times now. \n\nThe only people who could possibly be complaining about this would have to be coming into our cul-de-sac to see it happen since it's not visible from the street outside or the school, which means they're accessing the street that they're not supposed to. The only houses on the street are mine, my neighbors, and an older couple (the land owners who parceled it out to us) who rents theirs and it's currently empty. The rest of the street is undeveloped and has heavy trees and growth. It used to be a gated passcode access area that we had all decided to remove so that it was more accessible however since this has become an ongoing problem, we have agreed too go in together to put the gates back up. Now nobody can come through. \n\nEvery morning as I leave for work I hope that they can see me leaving the gated area and I hope it drives them crazy that they no longer have no access and I do. They wanted so badly to make sure that parents couldn't access this area for parking and I am perfectly fine with ensuring that happens if it means so much to them.",
        "created_utc": 1678302428,
        "upvote_ratio": 1.0
    },
    {
        "title": "Parents/School complain I use off-minutes residential parking, even though it's my residence",
        "author": "ConceptAggravating95",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/11m4xwi/parentsschool_complain_i_use_offminutes/",
        "text": "I live next to my son's high school, in a large rural-ish cul-de-sac. There's signage about it being off limits for school parking, pick up and drop off because it's a private community even though it's not gated any longer. It was all originally owned by one family but we all now make decisions about the space because it's technically not a residential public road. \n\nEven though it's off limits to parking a lot of parents do use it for dropping their kids to avoid the heavy traffic. If they're not taking a parking spaces and it's just a quick hop in hop out and honestly we all don't care. If it doesn't bother anybody, ok. I have not and would not complain about that. \n\nMy son goes to his friend's or practices after school so when I'm out of work I'll go pick him up and he usually leaves his backpack in the car if he doesn't have homework. So in the mornings we leave the house, head to my car where he picks up his backpack and walks into the school and I leave for work. \n\nSome of the parents who like to come through the cul-de-sac have left multiple complaints with the school that I am using the residential parking and yet they have never asked me if I live in the house I'm parked in front of (we do not have driveways). The school isn't going to tell them I live there but they have my address on file for the most part they should be aware however I have gotten a few letters. Nothing a quick chat can't fix. \n\nThen I noticed that these parents (who still have not spoken with me) escalated this to parking enforcement and the local police department. They can't ticket me for parking my car overnight in front of my house but they have multiple times. Because they CAN ticket a parent using the street and every time they have done this I've had to waste time to go in and prove that I live there. Which means that they are not running my plates and just ticketing me under the assumption I'm a parent parked there. Even though I have proved I live here, it still happened 5 times now. \n\nThe only people who could possibly be complaining about this would have to be coming into our cul-de-sac to see it happen since it's not visible from the street outside or the school, which means they're accessing the street that they're not supposed to. The only houses on the street are mine, my neighbors, and an older couple (the land owners who parceled it out to us) who rents theirs and it's currently empty. The rest of the street is undeveloped and has heavy trees and growth. It used to be a gated passcode access area that we had all decided to remove so that it was more accessible however since this has become an ongoing problem, we have agreed too go in together to put the gates back up. Now nobody can come through. \n\nEvery morning as I leave for work I hope that they can see me leaving the gated area and I hope it drives them crazy that they no longer have no access and I do. They wanted so badly to make sure that parents couldn't access this area for parking and I am perfectly fine with ensuring that happens.",
        "created_utc": 1678302322,
        "upvote_ratio": 1.0
    },
    {
        "title": "“No smoking within 20 feet”",
        "author": "Ancient_Educator_76",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/11m2bsi/no_smoking_within_20_feet/",
        "text": "I’m at a doctors appointment trying to be squeezed in. Waiting for a cancellation. While I wait I’m witnessing a guy read the sign at the door saying “no smoking within 20 feet”. \n\nEvidently people vaping, smoking, etc, near entrances is a big deal at this particular providers office. The guy stands near the door and takes about three steps left and hits his vape. Clearly not 20 feet away from the door, nor the sign by it. \n\nAbout a minute goes by when the receptionist comes out to chide (VMC) Vape man chu. She looks at him , points to the sign, then says he needs to move further.\n\nThen the VMC goes “is that twenty linear feet, or square? Because if you’re going square feet I’m at least five feet away, which is twenty five square feet from the door right?”  \n\nReceptionist shook her head, guy kept on vaping, i got a headache trying to figure out if he’s correct. I know I teach math but could someone help me out here? \n\nI’m guessing if it doesn’t specify but I’d presume it meant twenty linear feet in all directions from the door, or (40 plus x )times (40 plus y) square feet, where x and y are the width and length of the door.",
        "created_utc": 1678296397,
        "upvote_ratio": 1.0
    },
    {
        "title": "If I have to do it, you have to do it too",
        "author": "d_frost",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/11m1c3j/if_i_have_to_do_it_you_have_to_do_it_too/",
        "text": "this happened years ago with my ex, they are an ex for a reason lol.\n\nMy  ex and i had a long distance relationship for a number of years, we would fight very often, and i always blamed it on \"the long distance\".  what i told myself was that \"we are both so stressed from the long distance, and the stress leads to us fighting all the time\"\n\nafter a couple of years of long distance, she moved in me with after she got a new job in the state that i lived at.\n\nwe lived in a small one bed/one bath, but it was big enough for the both of us.\n\nunfortunately, we continued to fight even more so than when we were long distance. \n\none time i came back from the gym, i was super tired, went to the bathroom to pee and get some food after, etc.  because i was tired, i forgot to put the toilet seat down, this ONE TIME, i always put down both the seat and the lid, just so happened that i didn't do it this time.\n\nshe comes into the bathroom after me, and make the biggest deal about putting the toilet seat down, how i dont care about her, and so on.\n\nI didnt want to get into a huge fight over nothing, so i simply said, i'm sorry i'll make sure to put it down.\n\nshe pees, and then i go in to shower after her, i notice that the seat was down (obvi) but the toilet lid was still up (she never put the lid down) \n\nso MC kicked into overdrive - i said to her \"can you make sure you put the toilet lid down whenever you use the bathroom\" and basically repeated everything she had said to me about not caring about her and so on, petty, sure, but if shes going to make a big stink about something so small, so am i.\n\nso she yelled at me and said i was being ridiculous, and i basically repeated everything she said to me right back to her in regards to putting down the toilet seat and the toilet lid.\n\nif  i have to pick up something, and put it back down every time i pee, so do you, you dont get special treatment. \n\nthis was a huge screaming fight, and she basically said \"no, i'm not doing it\"\n\ni continued to put the seat and lid down every time, and she never put the lid down, and i would always make sure to tell her she didnt do it, and how it showed she didnt care.\n\nrelationship didnt last much longer after that, we were just not right for each other.  i should have noticed it years prior, but i used the \"long distance\" excuse instead of seeing that we were a bad match",
        "created_utc": 1678294175,
        "upvote_ratio": 1.0
    },
    {
        "title": "Parking pass revoked for 6 months.",
        "author": "cplforlife",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/11m0w9a/parking_pass_revoked_for_6_months/",
        "text": "So I work on a base which has a terrible parking situation. We pay for parking, but there's several times more paying car owners than there are spaces. \nDue to some reasons outside of my control and one that was inside.  My parking privileges (which I pay for) were revoked for work. \nThey will not let me appeal the decision. \n\nI'm being deployed for 4.5 months so that takes care of some of my problem. When I get back, I'm supposed to take over a leadership role for a guy who's retiring.\n\nMalicious compliance. I don't want to deal with not being able to park at work since there's not reliable parking within sometimes a km or two. \n\nI have 25 working leave days. + 20 banked leave days. Which will cover off pretty much the rest of the time. \nIf they fail to approve the leave, I'll put in my paperwork to quit and leave anyway.\n\nI will miss the person who I'm replacing while they retire. I will not get a hand over because I will burn 100% of my leave to not deal with parking. \nThe office I will be in (which is a critical position) will be unmanned during that time, and when I get back I will likely have to spend a month or more learning my job... the organization will suffer for it. It will cost money, time and misery for the organization while i figure this out. I don't care. I get paid the same.\n\nThis MC was my light touch course of action. We are massively undermanned in my dept, and I considered just putting in my papers and quitting when my appeal was denied this AM. I'm still flirting with the idea as I have a professional license which allows me to work elsewhere. \n\nTldr: \nBecause of some pissant parking security guard. My entire clinic is going to suffer while I have an incredibly long vacation.",
        "created_utc": 1678293179,
        "upvote_ratio": 1.0
    },
    {
        "title": "Consistency is key",
        "author": "junior_ad_5579",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/11lx089/consistency_is_key/",
        "text": "On mobile so I hope there are no formatting issues.\n\n\nA few years back I worked for a small title company attached to one of the US’s largest mortgage companies. \nMy specific roll was “title compliance” so I would have to review the files, request specific documentation, acquire signatures, basically do everything that needed to be done so the house can change hands with 0 issues. \n\nThis was during the refi boom so at times I was working 12-16 hours a day, when my boss has a meeting one day and tells me how unproductive I am, I’m taken aback because I’m eating at my desk and working through lunch, I show him I log all of my productivity and he says he will get back to me. \n\nThe next meeting we have is about a week later and he shares his screen and searches NEW files only, so if you have to go into the same file twice, or cover someone else, it only counts as 1 task complete, and for the original person. \nI agree that from this moment on I will work harder and be near the top in terms of production. \n\nMalicious compliance- \nI realized that search he used is available to everyone, so I started searching specifically the people that shared my job title. New files only, at the end of the day the highest count was 8 files(I was up to about 30 files when it came to files total each file had anywhere from 1-10 tasks that had to be done), so I matched it in about an hour and logged off. \nIt was at this time that I realized you could open a file, investigate it, and close out, and it didn’t log you as performing a task. So I started earlier than everyone else, knocked out 8 files before 8am and would relax the rest of the day. \nDog needs a walk, shopping needs to be done, laundry, you name it and it was done because I already matched or beat top production for the day.\nI would open up a word document and lay something heavy enough down so that it hit the 0 button so my computer wouldn’t go to sleep. \nThis continued for 8 months and every monthly review I received was glowing after that, how I’m the model employee and take direction extremely well. \n\nLayoffs started to happen, I saw the writing on the wall, so I started using my extra time looking for a job. 2 rounds of layoffs complete and I survived both cuts. \n\nWhen they laid me off it was only 3 weeks before I started my new one since I was already interviewing for a position.",
        "created_utc": 1678283711,
        "upvote_ratio": 1.0
    },
    {
        "title": "Holiday",
        "author": "crippledtemplar",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/11lw5by/holiday/",
        "text": "Greetings everyone!\nI wanted to post this long ago but didn't really had the neeve or time for this. For formatting I have to say I am on the phone and if you find some typos or something other, have fun with it. And sorry in advamce for everything else.\n\nThis story is, as you can see from the title, about my holiday. The year was 2019 and over christmas I planned to take my first holiday for this, let's call it company. As I worked there only from monday to thursday (7.5h/day). I did not have to use my holiday for fridays. So i thought. Well as I checked the difference I saw that they took more than the precalculated amount of hours away from my stash.\nAfter some mails and even calls, they finally answered with: \nYeah we kinda lost your work time sheet so we just estimated with 6h per day. Some time passed and the  new year of 2020 started. I saw a difference of hours again. And as I calculated, they did in fact not directly changed the hours of the holiday leave as I thought, but instead did not subtract the whole christmas holiday hours at all and even added more than I was supposed to get for the year. So as a good worker I tried to tell them this (even in writing) but they were kind of neglecting the whole thing as just told me, that the hours which stands on the paycheck document are the correct ones and I should stop to complain.\n\nOutcome: got more than a week of holiday hours for free",
        "created_utc": 1678281383,
        "upvote_ratio": 1.0
    },
    {
        "title": "Well, if you're SURE that's how to do it....",
        "author": "TryingMyBest1983",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/11lvurz/well_if_youre_sure_thats_how_to_do_it/",
        "text": "I have a favorite memory from when I was about 6 years old when I had the pleasure of witnessing the rare \"double-whammy\" of a classic man-splain followed by malicious compliance so simple and well-executed that it was practically a work of art.\n\nI was sitting down to dinner with my brother and our mom and dad when I asked my brother to pass the salad dressing.  He attempted to comply, but the hand-off was intercepted by our father who loudly proclaimed to the rest of us, \"Wait! You always pour out too much salad dressing and then you waste it. Let me show you how it's done.\" \n\nWhile he informed me of my inadequate salad dressing application techniques he also proceeded to unscrew the cap of the dressing, presumably in preparation of his impromptu lesson on proper salad dressing etiquette.  However, he was so focused on making sure I knew I was in the wrong that he failed to notice the lid was of the snap open and closed variety utilized by most squeeze bottles, so he wasn't just opening the bottle to get ready to pour, he was removing the lid and the squeeze bottle insert so when he upended the bottle to \"show me how to do it\"  almost the entire contents of the neatly full full poured out over his meal in one huge and hilarious blob.\n\nNow you may be wondering how the other members of the family reacted to such a hugely hilarious blunder. Well, dear reader, this is where the malicious compliance comes in.  While the rest of us stared in shock and horror at the river of Italian dressing running down my father's salad,  off of his plate, to form a pool on the linen tablecloth, my brother took action in the most hilarious way possible.  He grabbed a second bottle of salad dressing from the table and began removing the lid and squeezing  insert together at the same time. Then he turned to our father with a beatific smile on his face and said, \"I think I get it Dad, is this how you showed us to do  it?\"  At which point he upended and spilled the second full bottle of salad dressing in as many minutes and we all watched as the dressing ran off of his plate to join together with the remains from our father's.",
        "created_utc": 1678280597,
        "upvote_ratio": 1.0
    },
    {
        "title": "Working harder, not smarter.",
        "author": "Professional-Fee-957",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/11lvciz/working_harder_not_smarter/",
        "text": "This is actually my wife's story, but she doesn't use reddit, so I'm going to tell it.\n\nMy wife, 'Emma', is a UX/product designer, when she started in the field, Emma worked for a design agency of 5 people that pumped out multiple websites a week. She then moved to a holdings company where she was the sole designer. The company owned 3 or 4 companies all of them online retail/app based she oversaw the design portfolios for all 4 companies with a cohort of 20 coders.\nThe thing is, she works really fast, as in, does a weeks worth of work for a normal slacker designer in a little over a day. No stress or effort, she seems to get charged from it. The unfairness pisses me off. \n\nAnyway, we changed countries and Emma got a job in a company as a product designer. The company has a single platform with lots of little issues but the overall product is functional. She started and the PMs would go through the available projects on the table for the week, and divi them up between her the current designer (he gets paid slightly more than her), she would finish them within 2 days and move through more and more tickets. After 3 months she has a glowing review is confirmed as permanent but has now run out of tickets for her to chew through. \n\nShe continues her work at her usual speed finishing everything in no time and twiddling thumbs from Wednesday to Friday. During corona home office, nyancat 24h was her screen saver when she went for walks.\n\nAfter another year the company does a performance audit due to covid work at home and starts monitoring submissions of all the tech staff, Emma gets pulled up for only submitting projects on Monday and Tuesday. They have a massive meeting about her \"shirking\" attitude, and tell her that they pay for her time and that she must use it to benefit the company, despite her producing better quality projects faster than the other designer. Emma explains the situation and they say that if she is not willing to work they must reduce her pay by 60%. Other designer got promoted to Senior despite having fewer years of experience and a shitty work ethic.\n\nEmma thinks, fuck this. She reduced her hours to 4 days a week, at a 25% reduction (in this country the company has to accept a request to reduce hours but can refuse a request to increase them). She no longer does outstanding tickets, and only does the same amount of work as the other designer and works 4-5 hours a day, and they are back to praising her consistency.",
        "created_utc": 1678279212,
        "upvote_ratio": 1.0
    },
    {
        "title": "Who were You in Your previous births Swami ji?",
        "author": "unityofreligions",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/11lqh28/who_were_you_in_your_previous_births_swami_ji/",
        "text": "[removed]",
        "created_utc": 1678263006,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can we say that the items seen in the dream that are impossible to see in the real world are unreal?",
        "author": "unityofreligions",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/11loc0z/can_we_say_that_the_items_seen_in_the_dream_that/",
        "text": "[removed]",
        "created_utc": 1678255979,
        "upvote_ratio": 1.0
    },
    {
        "title": "new level of low unlocked",
        "author": "B4ddieb4e",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/11lmpb0/new_level_of_low_unlocked/",
        "text": " context: I work at a call center taking calls and providing customer service for a specific US bank. I have been warned several times verbally because I do not sit at my desk 8 hours in a row and answer like 30 to 40 calls a day (its exhausting) i like to chat with my coworkers and make it fun for myself and everybody around me, finally when they have changed me from  spot to spot around the office i am now sitting next to my boss. You can imagine how boring my desk job is now.\n\nWell, today my boss tells me after lunch I have a meeting. I come after my lunch break and there is no link or place for the meeting, a guy from IT services (Information and Technology) comes to my desk with a laptop, he is in a zoom meeting with someone else and goes to my desk tries to open Facebook IG and more social media web pages shows the other person in the zoom meeting the access is  locked by the company and has me hold the laptop in front of my computer 20 minutes while he was doing that.  No, no share screen in the meeting, just me pointing the laptop camera to my computer. \n\nAmused, I ask: Am i  doing a good job?, and the guy goes… hold the laptop higher.",
        "created_utc": 1678251082,
        "upvote_ratio": 1.0
    },
    {
        "title": "My workplace forbid remote work, until they gave my desk away. So I decided to travel.",
        "author": "Wry_Lilt",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/11llkt9/my_workplace_forbid_remote_work_until_they_gave/",
        "text": "For as long as I've worked here, my workplace has forbidden WFH even during the pandemic. The CEO is a old-fashioned elderly man who is against it. All during COVID I had to sit there and work my desk job which could have been remote as every other normal company was doing. I got COVID twice from co-workers during that time.\n\nThen this year, 1 day before I return to work, I got a call saying that my desk had been given to a new co-worker and all of my stuff was packed up and is ready to be picked up as I'm to work from home now permanently as they couldn't fit another desk into the office. Happy new year. No heads up, no goodbyes. Didn't even let my pack my own stuff. Booted from the office.\n\nSo, I decided to take it in my stride. Right now I'm in Spain, working remotely for my company and they have no idea I'm here. I work early mornings and late in evenings, scheduling emails to appear during the rest of their business hours.\n\nI said I'd work remotely, I didn't say I'd work from home.\n\nThis is great. I highly recommend Andalusia for anyone who wants to travel.",
        "created_utc": 1678247919,
        "upvote_ratio": 1.0
    },
    {
        "title": "Help I want to be maliciously compliant",
        "author": "hopefulthrow777",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/11ljkqe/help_i_want_to_be_maliciously_compliant/",
        "text": "[removed]",
        "created_utc": 1678242607,
        "upvote_ratio": 1.0
    },
    {
        "title": "Hurry Up and Wait",
        "author": "LongSufferingSquid",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/11l7xoc/hurry_up_and_wait/",
        "text": "Customer calls in to place an order:\n \nMe: Good morning, this is Widgets International.  I’m LongSufferingSquid, how can I help you?\n \nCustomer: I’d like to place an order for a widget type-E.\n \nMe: Certainly, ma’am.\n \nI go about placing the order only to find that…\n \nMe: Hmmm, I’m sorry, it looks like your account isn’t set up to order the Type-E.  That’s probably a systems glitch.  I’ll send a ticket to IT to have it corrected and place the order afterword. &lt;sends ticket&gt;  What other specifications do you need for your widget?\n \nCustomer: I’d like it in blue with a medium interociter.\n \nMe: Sounds good.  I’ll have that order placed as soon as IT gets back to me.  There’s no need to keep you on the phone for that.\n \nCustomer: I’d rather wait for the order to be placed.\n \nMe: It may take some time.  I don’t want you to have to waste your ti…\n \nCustomer (interrupting aggressively): I’ll wait for the order to be placed.\n \nMe: Very well, ma’am. \n \nA minute of me humming and typing passes.\n \nCustomer:  Well?\n \nMe:  Yes, ma’am?  Is there something else I can help you with?\n \nCustomer: I want the order to be placed now.\n \nMe:  Yes, ma’am, I’m just waiting for IT to get back to me.\n \nCustomer:  How long will that take?\n \nMe (drawling): Oooooooh, could be a few hours.  Hard to say.\n \nCustomer: …Fine. You better give me a call back when the order gets placed.\n \nMe: Certainly, ma’am!\n \n&lt;click&gt;\n \nIt’s now twenty-four hours later and IT has still not solved the problem.  (Lucky for the customer I found a work-around.)",
        "created_utc": 1678215625,
        "upvote_ratio": 1.0
    },
    {
        "title": "Boss wanted me to rent the \"cheapest on gas\" car I could find.",
        "author": "smohk1",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/11l6ntk/boss_wanted_me_to_rent_the_cheapest_on_gas_car_i/",
        "text": "I am going on a work trip and will need a rental car. The boss knows I will be driving around alot on this trip so his instructions to me were to find the most fuel efficient car I could find. I think he expected me to rent a small sub compact or something...but I was able to get\n\nA Tesla Model 3.",
        "created_utc": 1678212787,
        "upvote_ratio": 1.0
    },
    {
        "title": "You want to get paid? Finish the job.",
        "author": "Chris0nllyn",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/11l33dy/you_want_to_get_paid_finish_the_job/",
        "text": "My wife and I own a small business and my wife runs it. In May 2022, we reached out to a local sign company for new store signage. We had the design/logo and the sign company is familiar with the local and shopping center regulations. The main requirement being the sign must be lit. \n\nMay 2022 we reach out, no response. We try and find other companies but ultimately get nowhere. June 2022 we reach back out to Company 1. They finally get back to us, we get them the design, sign the contract, and put the deposit down. \n\nLong story short, the sign gets installed in late November, but the light was left on someone else's truck and will have to be installed later. Okay, no problem, just let us know and we'll meet you and let you in top do the wiring (if we're closed). Weeks go by, nothing. At this point, we're just glad the sign finally got built and installed and Company 1 has been terrible to deal with. \n\nCompany 1's accounting department must have seen some non-closed projects and directed staff to reach out, get final payment, and close out the project. So they call my wife and say, we want to settle up. She says, no problem, as soon as you finish the job (i.e. install the light). They schedule the installation for sometime in February and the installer never showed. They've yet to reach out to close out the project almost a year after initial contact, so the remainder of the cost will not be paid until they do so.\n\nI assume we'll hear from them again in a month or so when Accounting does their quarterly checks.",
        "created_utc": 1678204746,
        "upvote_ratio": 1.0
    },
    {
        "title": "I made up a story that I’d be “out of town” to avoid having to attend work event at festival.",
        "author": "Aggravating-Fig8495",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/11l2z8l/i_made_up_a_story_that_id_be_out_of_town_to_avoid/",
        "text": "Does this belong here? I don’t know. If this post can or should go somewhere else, let me know. I’m not really complying as much as just making up a believable story to get out of something…\n\nAnyway. I HATE attending work events that are outside normal office hours. Whether they’re after 5 on a weekday or during the weekend I try to avoid them at all costs. I’m already here 5 days/40 damn hours a week, isn’t that enough? I want to be at home with my husband, decompressing, whatever after I’ve worked all day/all week.\n\nWell in April there is a festival in the town our office is in. It’s going to be crowded. Not to mention I can’t stand street festivals. To “have” to attend one for the sake of advertising for our company, (I won’t get any of the commissions btw, because I’m not sales) is absolutely not how I want to spend my Saturday. \n\nSo I told everyone it’s my husband and mine’s 5 year anniversary and we already have a cabin booked, that we’ve had booked, for sometime now. The part about it being 5 years is true. The part about being out of town is not true. \n\nBut, when my colleagues are fighting traffic, crowds, and passing out flyers to strangers I’ll either be at home relaxing wit my guy or, weather permitting, having peaceful lunch with him on a ridge overlook at a state park. Followed by some hiking. I will not be at a festival trying to get people to notice us to make more money I won’t even benefit from.",
        "created_utc": 1678204478,
        "upvote_ratio": 1.0
    },
    {
        "title": "BigParser",
        "author": "Pitule",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/11kywmf/bigparser/",
        "text": "[removed]",
        "created_utc": 1678194464,
        "upvote_ratio": 1.0
    },
    {
        "title": "💜‿➹⁀💜I'm just looking for sex💜‿➹⁀💜",
        "author": "MessMary2",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/11ktfxh/im_just_looking_for_sex/",
        "text": "[removed]",
        "created_utc": 1678177165,
        "upvote_ratio": 1.0
    },
    {
        "title": "Surrender to God",
        "author": "unityofreligions",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/11kns9k/surrender_to_god/",
        "text": "[removed]",
        "created_utc": 1678159768,
        "upvote_ratio": 1.0
    },
    {
        "title": "Don’t Shovel my Driveway",
        "author": "martyshimbackler",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/11knkxp/dont_shovel_my_driveway/",
        "text": "[removed]",
        "created_utc": 1678159217,
        "upvote_ratio": 1.0
    },
    {
        "title": "Talk to my employee about her attitude? Sure.",
        "author": "chickenman7",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/11kii3u/talk_to_my_employee_about_her_attitude_sure/",
        "text": "[removed]",
        "created_utc": 1678146678,
        "upvote_ratio": 1.0
    },
    {
        "title": "Want me to send a politically-themed newsletter that you claim isn't at all political? Okie dokie",
        "author": "orgyfartconnoisseur",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/11kaffw/want_me_to_send_a_politicallythemed_newsletter/",
        "text": "[removed]",
        "created_utc": 1678129300,
        "upvote_ratio": 1.0
    },
    {
        "title": "I accompanied an irate parent to the headmaster's office so she could report my son for tormenting her son.",
        "author": "FigSufficient",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/11k6eih/i_accompanied_an_irate_parent_to_the_headmasters/",
        "text": "[removed]",
        "created_utc": 1678124307,
        "upvote_ratio": 1.0
    },
    {
        "title": "THREE! SEPARATE!! BAGS!!!",
        "author": "Ancient_Educator_76",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/11k2uw4/three_separate_bags/",
        "text": "[removed]",
        "created_utc": 1678118746,
        "upvote_ratio": 1.0
    },
    {
        "title": "Travel Baseball (LLC) Help",
        "author": "manikpanga",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/11k1x52/travel_baseball_llc_help/",
        "text": "My son is part of a travel league and the league owner is not being forward with any of the finances, and when questioned is extremely defensive. \n\nAnything I can do to poke further since it’s a LLC? I suspect embezzlement but can’t prove a thing since there’s no ledger or paperwork. TIA",
        "created_utc": 1678116628,
        "upvote_ratio": 1.0
    },
    {
        "title": "My emotionally abusive boss tells me I am disposable so I resign. All hell breaks loose after I leave and he gets fired",
        "author": "Ok_Negotiation9770",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/11jz7ih/my_emotionally_abusive_boss_tells_me_i_am/",
        "text": "Sorry for my English. I am not native.\n\nI have been sharing my story in different subreddits but I think it is time to look back and laugh about this. Maybe this is part of the healing process? I don't know. \n\nSo, anyway, I used to work in this place last year. At first, it was awesome and I liked it a lot. It was demanding, yes, but still manageable. My supervisor, a guy we will call Steve, was at first like a mentor to me. Yes, he was a douche sometimes since he liked to make \"jokes\" that could be offensive. I tried to ignore this and move on. During my first semester, I had good evaluations and Steve liked to show me off a lot as an excellent worker be helped to train.\n\nThings started to go awry after Steve took a few weeks off and I took his place in the meantime. I did a good job and I even proposed some ideas that got traction at the management level. When he came back, he was not very happy about it. After that, everything went awful. Suddenly I am the worst employee he ever had. He says that since he went back from vacation I am unfocused and reply defiantly. However, he often ignores me, gives me contradictory instructions, ambiguous deadlines, etc. He admitted to me too that he was mad at me because, in a feedback session, I mentioned to our manager that his attitude toward me changed. He often mentions too he is friends with all the higher-ups so, even in the worst-case scenario, he won't get fired.\n\nHe also started to talk bad about me to our team leader (who was his friend outside work too) and she starts to pressure me to \"improve my performance\" and \"be less sensitive\". During a review meeting, both team up and say I have to step up because my supervisor can do all my work anyway and that I shouldn't give myself too much credit, since my job is \"disposable\". After an especially humiliating meeting with him, in which I ended up crying my eyes out, I had enough. I had no job opportunities lined up but I decided I had to resign. If I am so bad at my job, so be it. No one would need me anymore.\n\nDuring my exit interview, I stressed the fact that it would not be a problem to Steve if I leave, since I was disposable and so problematic. I also warned my team leader on how this would happen again if she did not control his behavior. I left and I am told that my supervisor is talking sh\\*t about me and how I did not resist the pressure as if it was all in my head.\n\nMonths pass. I am still unemployed and trying to survive a depressive episode that all this ordeal left me. Then, a former co-worker then calls me and tells me Steve was fired. I was told he started to crumble down after I left because it happens he was giving me almost all his work to me. He just liked to pass all as his and receive the credit. I guess it was all the pressure, but he starts to throw temper tantrums, one of them being so intense that someone saw it and told the manager. After what happened to me, she was fed up with him. I guess I triggered something so she started to see how to fire him. My former team leader, who was supposedly always there to coddle him, saw her job in danger and threw him under the bus. As far as I know, they set everything up to make him leave without the risk of him sweet-talking a higher-up to save his ass. He got fired unceremoniously and none of her \"contacts\" intervened.\n\nEventually, I found a new job, which is pretty chill and pays slightly better. The last thing I know, he still does not find a job. We worked in a very tight knit field and everyone knows how problematic he can be so no one wanted him. He is sort of blacklisted as far as I know. So that's it! Karma is a b\\*tch, guys! And for all of those going through something similar, remember you are valuable and you don't deserve to be treated like garbage.\n\nCheers",
        "created_utc": 1678109936,
        "upvote_ratio": 1.0
    },
    {
        "title": "Malicious compliance.",
        "author": "Agreeable-Mix-8379",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/11jt1gy/malicious_compliance/",
        "text": "I was told by my English teacher to write a sonnet. And so I did. However, the first time I turned it in, she was dissatisfied. She said that it didn’t meet the requirements. I argued that I did exactly what was in the rubric. She states that even though the implications that it had to be exactly 14 sentences and 10 syllables in each sentence wasn’t in the rubric, it was a obvious parameter and wasn’t necessary to be specifically written down in the rubric. Ended up having to rewrite it three times. Decided to change my sonnet into something I was now more passionate about. Can’t wait for it to be displayed.",
        "created_utc": 1678091493,
        "upvote_ratio": 1.0
    },
    {
        "title": "Varsity Cross Country/Track Athlete vs. Gym Teacher",
        "author": "bixiphel",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/11jofv7/varsity_cross_countrytrack_athlete_vs_gym_teacher/",
        "text": "So at my high school, there are a number of gym classes you can take as gym class is a graduation requirement for both the district and the state I live in. One of the options for a gym class is independent gym where we wear a heart rate monitor and exercise outside of school for a grade. Every week, we're supposed to turn in screenshots of our heart rate data to our teacher and that counts as most of our grade in the class (our heart rates have to be above a certain 'zone' for some amount of time to get a higher grade. If it gets into the yellow/red zone \\[typically 160+ bpm\\], we get double minutes).  \n\n\nI'm a varsity cross country and track athlete that was named MVP for cross recently, been scouted by local community and NAIA/NCAA colleges, and the team captain for both sports at my school. I also have been tested and diagnosed with sinus bradycardia (a heart condition where resting heart rate is lower than it should be) which is common and harmless for the more elite distance athletes, which can make it hard for me to reach my heart rate goals sometimes (this was a bigger deal during the off-season). My gym teacher knows both of these things and has for the past couple of years. I have practice everyday of the week and I record \\*everything\\* on my watch, so it seems like I would have the physical activity part all wrapped up nicely, right? Well, the other week, practice was much shorter due to the winter weather and also just our practices not being super long, and I turned in what I recorded on my watch, which would've been enough to easily get 100%. To my surprise, my teacher gave me a 1 (out of 4 because stupid American grading scale) which made me super mad. As a result, it temporarily lowered my grade average in gym by about a whole letter grade, which is not good for scholarship applications and could threaten my eligibility for track if I start failing.   \n\n\nSo as a protest, the past two weeks when I've had to submit my heart rate data, I've taken a screenshot of each workout *individually* from each day. For context, I like to record my warm up, workout, and cool down as individual activities, so each day can log at least 3 different activities. I take the screenshots on my desktop and the data I actually need is just far enough off the page that I have to zoom out so that I can get the date (which is needed) as well as the heart rate data without cropping the two together which looks fishy. Over the course of the week, this adds up to around 10-20 screenshots that I submit and likely equates to around a 300% on the rubric. My teacher hasn't said anything yet, but I can definitely tell they're pissed at seeing 20 different, extremely small screenshots every week, and probably stop looking after the 5th one. I've been doing this the past two weeks and I've gotten full credit each time :))  \n\n\ntldr: Varsity cross country and track athlete beats gym teacher's heart rate minute requirements by individually submitting every workout they do over the course of the week all at once",
        "created_utc": 1678077254,
        "upvote_ratio": 1.0
    },
    {
        "title": "*points to an object*",
        "author": "miepieOkAy",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/11jeyk0/points_to_an_object/",
        "text": "[removed]",
        "created_utc": 1678052899,
        "upvote_ratio": 1.0
    },
    {
        "title": "The 5 Paragraph Essay",
        "author": "Onetwenty360",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/11j8yux/the_5_paragraph_essay/",
        "text": "When I was a senior in high school I was asked to write a 5 paragraph essay demonstrating that I understood how to effectively communicate my point. I wrote an essay about how to write a 5 paragraph essay. \n\nThesis: A 5 paragraph essay has five parts which I will outline in the following 4 paragraphs before concluding my essay. \n\nTeacher was quite miffed. Made an A though. It was technically flawless.",
        "created_utc": 1678044305,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can’t have a personal trash can at desk, but can have a cup to throw garbage in? Okay…",
        "author": "Glockgirl13",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/11j1iwh/cant_have_a_personal_trash_can_at_desk_but_can/",
        "text": "I work for a large airline office and apparently recently, we can’t have a trash can at our desk, yet we can eat snacks at our desks. Went to empty my trash can at the end of the my shift and had a team lead get up, come over and scold me about this unknown (to me) new rule. I asked him what I’m supposed to do with my snack trash (particularly pistachio shells I eat in abundance) and was told to use a cup (everything has to have a lid). Irritated, petty, and maliciously compliant, I bought a 2 gallon coffee cup trash can that looks like a giant Starbucks cup (with logo) complete with labeling stating “Gigante Coffee”. We have no rules against size of cups or anything, nor is this actually labeled as a trash can. I just don’t understand why you would want more incidences of people leaving trash around rather than employees having easy access to dispose of waste considering a teeny cup would just make a huge mess anyway.",
        "created_utc": 1678034370,
        "upvote_ratio": 1.0
    },
    {
        "title": "Want to lie about your natural hair color? Have fun with an awful dye job.",
        "author": "WiscOhioNative9",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/11j00az/want_to_lie_about_your_natural_hair_color_have/",
        "text": "My wife (22f) and I (22m) got my little sister (12f) some semi-permanent red hair dye for Christmas. She really wanted it and was very excited to use it on herself and her cousins. The hair dye is bright red (assuming you’re light blonde or bleached), but Sis has dark brunette hair so the dye becomes a dark burgundy on her. Sis brought her hair dye to family Christmas at Grandma’s so she could share it with our plethora of cousins. One of our cousins (Anna 15f) is an entitled brat. She’s awful. I keep my audio recording app open on my phone when I’m around her because I don’t trust her alone with myself or my younger brothers. Anna asked Sis to have her hair dyed. Anna obviously has had her hair bleached to a medium-light or light blonde. Sis asked Anna, “Is your hair bleached or dyed? If it is, then it’s gonna turn out really bright and look crazy.” Anna said, “no what haha this is my natural hair color!!” This is where the malicious compliance comes in. Sis and my other cousins share a knowing look before getting to work. After they let the paste sit for a reasonable amount of time, they wash it out. Instead of pretty mauve accents like in Sis’s hair, Anna’s hair looks like a bright, clowny, patchy mashup. Anna’s response, I kid you not, was to look surprised and say, “oh yeah I DID bleach my hair I totally forgot this wasn’t my natural color lol”. At this moment Anna’s mother came in and was not happy. Anna wanted to take even more dye from my sister to try to even out the clown hair she had given herself, but Anna’s mom stood up for my sister and would let her take more. This dye is only semi-permanent, but it will still take 10-15 shampoos to be fully washed out. \n\nI only learned all this because I took my sister out on a CFA breakfast date after New Years. I was worried that Anna had bullied Sis into using as much hair dye as she had. Turns out Sis just wanted to let Anna pay for her obvious lie and make her look outwardly like the clown she is inwardly. \n\nTL;DR My malicious 12 y/o sister let my cousin ruin her hair because of an obvious lie.",
        "created_utc": 1678030824,
        "upvote_ratio": 1.0
    },
    {
        "title": "No bleeding in class? Fine, I guess we'll all leave then.",
        "author": "tiredlazybitch",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/11it5f4/no_bleeding_in_class_fine_i_guess_well_all_leave/",
        "text": "A few years ago, when I was a junior in highschool we had a sub in history. Now, this class was a fairly relaxed class. We could eat, be on our phones, talk, basically do whatever. The sub, did not like that and said while we had him, we would follow his rules not our original teacher's rules. None of really cared and didn't want to fight so we did follow his rules. That's not the malicious compliance part. There was one student in my class that had a thing for picking at his nails when he was anxious. He had gotten better over time but that specific week we had a sub, he was having some at home issues and was picking a bit more than usual. Our original teacher was always understanding and had something for him to fidget with instead of his skin or his nails (he didnt have his own stuff so the teacher provided every day). However, since the teacher wasn't there he didn't have his usual fidgets and was picking at his nails quite a bit. He ended up picking at his cuticle so much it started bleeding. Everyone was worried and wanted to make sure he was okay but the sub didn't like that. He didnt like the fact that we were more concerned about our friend then the stulid life story he was sharing. He told the kid to get out as he will not have people bleeding in his classroom. The kid got his things and went to leave. I kid you not, every single girl grabbed their bags and left with him. Then to make it better all the boys got up and joined us in the hall. The sub was pissed. He asked why we all left. One of the other girls said she was on her period. Every girl said the same. Then one guy said he gets runny noses on a regular and doesn't want to take a chance that he'll bleed in the subs classroom. Another guy had a bandaid on his finger and said he cut it making it breakfast that morning and it was still bleeding. Every single boy in that class came up with some sort of reason they were bleeding or thought they were going to. The sub ended up having no class for the next hour and a half. We all got sent to the principals office. Idiot sub forgot the principal was our teachers husband and knew what was going on with the kid. None of us got in trouble. We actually ended up being allowed to chill in the conference room until our next class. The sub never came back🙃",
        "created_utc": 1678009551,
        "upvote_ratio": 1.0
    },
    {
        "title": "What the heck is karma",
        "author": "Smooth_Dimension_523",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/11iqbeq/what_the_heck_is_karma/",
        "text": "[removed]",
        "created_utc": 1677999587,
        "upvote_ratio": 1.0
    },
    {
        "title": "Bowling Alley shenanigans",
        "author": "Witty_Comfortable404",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/11ipcib/bowling_alley_shenanigans/",
        "text": "For some crazy reason, I decided to take my son out and meet with friends at a local bowling alley on Family Day. Well, despite getting there early it was packed with a line out the door. We waited about 10 minutes to get inside, talking with the kids and joking with the family behind us. \n\nThe dad of the other family joked that we should go to the movie theatre instead (to shorten the line). So I shot back: “Oh great! This is R and  N. They both want pepperoni pizza for lunch, R needs size 3 shoes and N needs size 2. We will be back in a few hours. R knows my number in emergencies. Thanks!” Never have I seen anyone backtrack so fast! We waited another 15 minutes in line just to put our names down so we could come back, but no one complained about it after that. \n\n*obviously we only threatened to maliciously comply, because as much as we would have loved the free time, we love our kids more. They thought it was hilarious too!",
        "created_utc": 1677996325,
        "upvote_ratio": 1.0
    },
    {
        "title": "Airbnb Customer Support",
        "author": "Downtown-Ad2666",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/11ip2ls/airbnb_customer_support/",
        "text": "So the background to this is that my dad died in December. I booked an Airbnb for after his funeral so I wouldn’t have to drive as much in one day. When I arrived, they had double booked me and tried to offer lesser accommodations. I declined and drove home. I have repeatedly disputed with them for a refund and received an email stating I was being refunded and still haven’t.\n\nOn my last call with Airbnb, the agent was not being helpful and told me he was going to hang up because I had used my second swear word. I kept asking for his supervisor and he wouldn’t transfer me. He also hadn’t hung up.\n\nEnter malicious compliance. I was not swearing any more, but I also refused to hang up. He said he was escalating it to another department that would email me. I said, ok. He asked if there was anything else. I said I’m waiting for my refund. He said it could be awhile. I said I have time. I’ve waited this long. \n\nHe finally admitted he can’t disconnect from his end. I kept it going a few minutes more before hanging up on him.",
        "created_utc": 1677995442,
        "upvote_ratio": 1.0
    },
    {
        "title": "No pencils allowed? You got it",
        "author": "KarrieDarling",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/11imdcj/no_pencils_allowed_you_got_it/",
        "text": "For context, this happened back in 2008. I was 12 years old and in 6th grade. I'm telling this story now because I didn't know Reddit existed then (this was back when MySpace was still a thing). My mom has this huge thing against me making spelling mistakes and always told me to be careful when writing because she didn't want me using the erasers on my pencils. She said something about the erasers on pencils making the paper you're writing look bad.\n\nEvery day after school, she'd inspect my pencils to make sure the erasers hadn't been used and warned me that if ever she saw my erasers being used, she'd take away my pencils and make me write in pen. 99% of the time, I'd bum an eraser off of a classmate by just telling them that my mom buys me the pencils with the sucky erasers (y'know the ones that only leave smudges in their wake instead of actually erasing the mistake) so my pencil erasers were never used and my mom never suspected a thing... Until the day that I accidentally used my pencil eraser without thinking about it to erase a spelling mistake on the journal entry that my English teacher had the class write at beginning of her class every day. \n\nI came home knowing I was going to lose my pencils and have to start using pens. As was the drill, my mom inspected every pencil in my pencil case and she found the pencil I'd accidentally used to erase a mistake. And as she'd sworn, she took my pencils from me and placed 4 black ink pens in my pencil case in place of them. I remember rolling my eyes and muttering about how much I *dreaded* using pens to write then (I actually prefer using pens over pencils now) because I was *always* making mistakes when I wrote... Then, it dawned on me and I internally smiled a wicked smile.\n\nNow, it's important to note that I have dyslexia, so none of my spelling mistakes are intentional... Except for when they are. You want me to use pen to write, mom? Okay. I'll do just that. The next day in English class, we did our usual daily journal entry on the topic of our English teacher's choice. And of course, I made a heap of spelling \"mistakes\" only this time, they were intentional. I made sure to pay careful attention when writing so as to misspell as many words as possible... Then, I crossed them out, making sure to cover the entire spelling \"mistake\" and rewrote them correctly next to the blotches of black ink that covered up my \"mistakes\". I'm not exaggerating when I say that I must've made \n\nThat day after school, I went up to my mother with my journal in hand and asked with a big smile on my face if she'd like to see what I wrote about (if anyone's wondering, I can't remember what the topic was. All I remember is the MC). She said, \"Sure\" and took the journal from me. She opened up to that day's journal entry and almost immediately her face fell. She looked over the journal at me and without her even saying a word, I could tell what she was thinking, so I said, \"Sorry, my dyslexia got the best of me, but I couldn't erase my mistakes, so I had to cross them out\".\n\nNeedless to say, she took the pens away and gave my pencils back the next day. Oh, and she bought me a pack of pink erasers to take to school with me.",
        "created_utc": 1677987318,
        "upvote_ratio": 1.0
    },
    {
        "title": "Grandparent revenge via malicious compliance",
        "author": "KGrimDragonfly",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/11ilofj/grandparent_revenge_via_malicious_compliance/",
        "text": "When my son was 22 months old, he trick or treated with his older brother (9). We went to my work, grandparents, and close neighbors, then we left him with my parents while his brother and I went around the whole neighborhood. I told my parents to let him have the candy he wanted. Meaning what piece he wanted.  When we returned, there was a 4 inch high pile of candy wrappers. The poor little guy was racing around like he was on crack. I asked my parents why they let him eat so much, and they both had a devious smile on their faces as my mom said, \"You told us he could eat what he wanted.\" I swear they knew what I meant when we left but let him eat all he could as some sort of grandparent revenge. Brutally malicious, it took me two hours to get him calm enough to sleep.",
        "created_utc": 1677985361,
        "upvote_ratio": 1.0
    },
    {
        "title": "Don’t expect me to follow some of your rules and ignore others.",
        "author": "FaithlessnessTight48",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/11ihilm/dont_expect_me_to_follow_some_of_your_rules_and/",
        "text": "In the 90s I was working for a company that sold pagers and airtime. You know how long it takes at the cell phone store to buy and activate a new phone? It took that long or longer to activate a pager. I was the lowest person paid person on the premises and the only hourly employee. Quite often I would be helping customers as 5:00 pm came and went and sometimes had as much as an hour overtime on my time card. When I was hired I was given a employee handbook that stated that working “Off the clock” was a fireable offense, so I kept careful track of my hours which were verified by my supervisor. I did this for about a month before both my supervisor and her boss advised me that I could not put in for overtime any longer. I asked my supervisor what I was supposed to do at 5:00, continue working the counter or work off the clock? She was furious but told me to leave. And I did, every day at 5:00 on the dot.",
        "created_utc": 1677974273,
        "upvote_ratio": 1.0
    },
    {
        "title": "💜‿➹⁀💜I'm just looking for sex💜‿➹⁀💜",
        "author": "MessMary2",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/11ihht3/im_just_looking_for_sex/",
        "text": "[removed]",
        "created_utc": 1677974212,
        "upvote_ratio": 1.0
    },
    {
        "title": "No idling? No problem!",
        "author": "IneptLobster",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/11ifkg6/no_idling_no_problem/",
        "text": "[removed]",
        "created_utc": 1677969495,
        "upvote_ratio": 1.0
    },
    {
        "title": "highschool german teacher doesnt want anyone to talk without raising their hand",
        "author": "icedshakenespresso",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/11ic6su/highschool_german_teacher_doesnt_want_anyone_to/",
        "text": "this happened in 2015, when I was a sophomore in highschool. I was taking a german class with a teacher i absolutely adored, but she was a bit of a hard ass (i mean, she’s german, did we expect anything else?) \n\nwent to highschool in arizona, and my teacher didnt want anyone to talk without raising their hand and we had to speak in german. \n\nmany ceiling tiles were missing, and one day a scorpion dropped out of the ceiling and landed on my desk, probably very confused. \n\nimmediately said “uhhh, frau?” to which she said “please, im speaking” in german. so i kept my hand raised and stared at the scorpion. I wasnt super scared, ive killed many scorpions in my time and they usually dont sting until they feel threatened. \n\nfinally, she called on me after she was done speaking, when i started to say \n\n“theres a-“\n\n“deutsch, bitte“ \n\n“okay, es gibt eine… ich weiß nicht wie scorpion on my desk sagen“ (okay, theres a… i dont know how to say scorpion on my desk) \n\nshe immediately started freaking out, told me to get away; shes from hamburg so shes never seen a scorpion in her entire life. \n\nguy sitting next to me takes off his shoe and kills the scorpion. teacher starts apologizing profusely, and after class she gave me a swiss chocolate bar for “being brave”. Probably the best chocolate ive ever earned.",
        "created_utc": 1677961519,
        "upvote_ratio": 1.0
    },
    {
        "title": "At least one",
        "author": "card_bordeaux",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/11ic6ph/at_least_one/",
        "text": "This a short one so bear with me. \n\nMy son (9) asked me to watch his plastic tube of Hershey kisses and make sure that they didn’t get eaten by our dog. He told me that I could have “at least one.”  Now I know what he meant, but I’m also a dad that knows the rules. So I ate two. \n\nHe came back and asked if I had one. I told him I had two. He gave me a look like I’d kicked the puppy. But I reminded him that he told me that I could have “at least one.”\n\nIt was a teachable moment for him to now understand what “at least” means.",
        "created_utc": 1677961514,
        "upvote_ratio": 1.0
    },
    {
        "title": "You want me to fly 12 hours earlier because it's cheaper?",
        "author": "Warm_Tomato2126",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/11ibunl/you_want_me_to_fly_12_hours_earlier_because_its/",
        "text": "TL/DR: Company changed my flight to save £80, fine, two hotels, two taxis and an extra day's pay please.\n\nDisclaimer: English is my second language but I've been speaking it since I was 5 so really should know better. I'm on a laptop so any formatting errors are because I'm dumb.\n\nI (56M in the UK) was working in Africa as an operations manager for a large global security company from 2009 to 2014.\n\nThe country I was working in had been through a long civil war and was very under-developed (Think no paved roads, people living a very traditional African lifestyle). At the time I'd been working there on a 10 weeks in country, 2 weeks at home rotation for about 4 years.\n\nI'd flown to and from work so often that I had the journey down to the bare minimum travel time, and it worked out the cheapest option for the company because travel days were paid from when I left home. The shorter my journey the cheaper it worked out for the company.\n\nSomeone in the head office had looked at cutting down on travel costs, probably to make themselves look good and get promoted. As a result i got an email after a week at home saying they had changed my normal flight which was 5pm on Sunday from my nearest UK airport, via Amsterdam, then on to Nairobi, connecting with a 9am flight to the war torn country on Monday morning. The change was from the from a 5pm departure to a 5am departure the same day, same route, and saving about £80. \n\nTo clarify, the 9am flight from Nairobi was the first flight to war torn country because the destination airport was the only surfaced runway in the country. It had had no runway lights or radar so all flights had to be in daylight.\n\nAnyway, I agreed to the flight time change, but they had to move it to the Monday so I don't lose a day at home, (All will become clear) they agreed because still saved £80 on the ticket, no skin off their nose.\n\nOnce I got the flight confirmation I contacted the travel desk asking for hotel and taxi bookings, when they asked why I need these I explained that to make a a 5am departure required a check in at 3am, so I needed a hotel at the airport on Sunday night because no trains were running to get me the 3 hours to the airport from home for that time of the morning.\n\n The flights they booked would get me into Nairobi for 7pm - after dark - so I'd need a Hotel there and a taxi each way to  and from the hotel to get me onto the 9am flight on Tuesday - the same flight I would have been on if I'd left at 5pm but a day later.\n\nA couple of days go by and I got a phone call from the company travel desk telling me the travel plan was confirmed. I was on the 5am flight with a hotel reservation at my UK airport the night before, a hotel in Nairobi after landing and the taxi would collect me in Nairobi and drop me at the airport for my final connection.\n\nI asked about the cost saving, they said £80. I then asked about the hotels and taxis... They replied, oh, they don't come out of our budget, that's the operations budget so you're fine.\n\nI was happy, I was arriving back at work a day later, still paid the same amount with a night out in Nairobi to sweeten the deal. My Boss on the other hand went nuts! Nobody had told him of the changes. My deputy flew out on the plane I flew in on, meaning I didn't get a hand over of the work that was going on. On top of that the cost for hotels, taxis and extra day's pay had all come out of my Boss's operational budget. I think the total amount added was almost £1000, but hey, they save £80 on the flight cost!",
        "created_utc": 1677960717,
        "upvote_ratio": 1.0
    },
    {
        "title": "Lying boss looses muli-million dollar contract",
        "author": "Bigtoad3553",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/11hzprl/lying_boss_looses_mulimillion_dollar_contract/",
        "text": "This was a few years ago. I was working for one of the biggest employers in my state, running a government funded program.\n\nPart of running these government funded programs is to achieve KPIs to justify the funding (keep this in mind).\n\nThings started well. We were achieving a lot, and my boss regularly called me her 2IC / second in command. Although it was unofficial, it was nice to get recognition. The boss was somewhat forgetful and when a mistake was made it would be put it on me or one of the other staff but this wasn't common early on so I just started asking for everything in writing and everything seemed to be going smoothly.\n\nAs the staff for the program grew, we started hiring more and more people, and that's when the cracks started to show.\n\nOne of the first things I remember was when I was on the interview panel with a few of her hand-picked staff interviewing for another vacant position. She told the entire interview panel that she wanted to speak with us before we scored each interviewer (essentially manipulating the panels scores of each applicant).\n\nBefore long, she had a cherry-picked staff of people who shared her political beliefs regardless of how competent they were at the job. She also started making jokes at my expense in front of the whole team because I was the only male. She would demand I change my workdays when she wanted me on weekends (wasn't paid penalty rates) and refused time off for things shendidnt think was important (like watching the football match of the year) even if I asked to use leave well in advance.\n\nEver since starting, I had been responsible for recording all of our interactions with people as KPIs. I self-taught myself Microsoft Excel and created a monster spreadsheet that broke everything down. This responsibility was supposed to be temporary and would be taken off me once we hired somebody.\n\nWhen we did eventually hire someone to take over the reporting, the person was absolutely incompetent. They were a nice enough person, but they would sit there chatting all day, and every single week, they butchered the KPI reporting. The boss refused to hold them accountable and instead just told me to fix it every week.\n\nShe had also instructed me to record every single time a person looked our way as an interaction for our KPIs. So long as we stuck up an A4 sheet of paper with our logo on it we would rip out our phones and start counting every single person that walked by. I had tried to argue that this wasn't going to be seen as proper engagement if her higher-ups or the government decided to look into it, but she demanded we do it.\n\nQue the first instance of MC\n\nFor over a year, I continued to enter in all of this false data as reportable for our KPIs. I also made out that it was incredibly time-consuming when in reality I had become so good at it, I could fix the worst mistakes in like 20 mins. \n\nAs time went on, she kept handing more and more work to me. Every time we had a staff member that would goof of,  it became my problem, and she would instruct me to either do their work for them or hold me accountable for their lack of work. She continued to berate me and make fun of me in front of other staff, she would pull me aside and give me unofficial verbal warnings for things I hadn't done and even threatened me with a bad reference when she found out I had pit in an application for another job (I didn't get it because itnwasnt in my industry butni just wanted out).\n\nEvery time the boss had time off,  she unofficially put me in charge, telling everyone that I was responsible but had no extra pay. \n\nWe ended up hiring someone else to fill a different role, something completely unrelated to the day to day operations or even the industry in general. This person was great at their job,  but they had no experience in the job and wasn't even a full-time employee.\n\nThen the boss was leaving for another holiday, she pulled me into her office alone, and told me the new part timer would be in charge while she was away, WITH the temporary increase in pay. \n\nAt this point,  I had finally had enough. I decided  I would do the bare minimum until I could find another job.\n\nA couple of months after, covid hit. And we were all told to work from home.\n\nDuring our first Zoom meeting, she listed the responsibilities that she expected us all to do. My main responsibility was to finish 2 small projects and to maintain the KPIs (which shouldn't have even been my responsibility). All up, this was maybe an hours work per day. She wanted an email at the end of every day reporting what we had done.\n\nQue second instance of malicious compliance.\n\nI spent the next two months working an hour every morning from home, only doing the responsibilities she had set out for me. I would play xbox for the rest of the day, and at around close of business, I would hit send on the email I had sitting there since 9 am.\n\nI then found another job, and a year later, I went on to start my own business in the industry. \n\nAt around the same time my new business reached more staff than she had employed, I found out that the program went under review, and the boss lost the contract for the company (im assuming they finally delved into that spreadsheet and found the lies). And by losing the contract, she also lost her job because without the contract there was no job.",
        "created_utc": 1677938199,
        "upvote_ratio": 1.0
    },
    {
        "title": "Stop fixing the photo printers during Christmas rush? Sure. Why not",
        "author": "theaudiophiile",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/11huyuz/stop_fixing_the_photo_printers_during_christmas/",
        "text": "To preface, I used to work in the photo lab of a very prevalent retail pharmacy. You know the one. I was good fast, effecient, and always provided the most excellent customer service. Customers loved me. I adapted official procedures to make them better and improve the final prokect. And I fixed the photo printers.\n\nIf you've worked in a 1hr photo lab, you know that no one fixes those things. They jam constantly, overheat, never get replace or updated. They'd break at least weekly, if not more. Same thing with the kiosks and receipt printers and POS system. It's a nightmare. I haven't worked there since 2017 and they finally updated the PIN pads... 6 years later. \n\nBecause the printers would break so often and I had experience fixing printers from when I worked at a school,  I'd just whip out a screwdriver, open them up, and fix them myself. It was faster and easier than putting in a ticket, and it meant I could keep churning out orders during peak instead of being 1-2 printers down at all times.\n\nNow, shortly before the holidays, we got a new AM. He'd previously managed another store but had to step into a \"less stressful\" position due to a heart issue. The guy was a prick and created stress for himself. He treated team members like garbage, and most people were too afraid to stand up to him. I had a good working relationship with our GM, so I was not afraid of this guy, and he would often single me out because of it.\n\nAt one point during Christmas rush, he caught me with my metaphorical pants down, screwdriver out and disassembling a printer that had suddenly stopped working. He chewed me out, told me to stop fixing the printer immediately and just put it in a ticket. If he caught me fixing a printer again, he'd have to take disciplinary action.\n\nCue malicious compliance.\n\nI stopped fixing the printers and just put in tickets. In about a day, we were down to 1 functioning 4x6 printer that was overworked to hell and back.\n\nThat printer almost caught fire while I was off shift because no one was able to unjam it.\n\nHe never told me to stop fixing the printers again and left me alone the entire rest of the time I worked there. I ended up being wrongfully terminated due to an ADA leave for a major surgery when corporate \"never got my paperwork\" despite my PT facing it over, and I found a better job that I love at a company I still work for. Prick manager ended up getting fired several months later for customer complaints.",
        "created_utc": 1677921558,
        "upvote_ratio": 1.0
    },
    {
        "title": "You don't want us to cook? Alrighty then...",
        "author": "pardonthisnamestaken",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/11he6wc/you_dont_want_us_to_cook_alrighty_then/",
        "text": "I've been thinking about posting this story for a while, and just decided to commit. It brings a smile to my face, so here goes. When my brother and I were younger (10 f, 12 m), our parents had a rule that, other than using the microwave, we could not cook without a parent present. We can prep what we wanted to cook, but we were not to so much as touch the stove or oven. We tried it once, and got fussed at; that's all it took.\n\nOne summer, he and I wanted to make home fries, but our mother was at work, and our father had just stepped out to do errands. \"But Pardon, Mom and Dad said we couldn't cook when they're not here!\" (Now, let me interject with a little context about me. I was a smart alec kid, and it got me in trouble often. So the inner workings of my mind on this day were bent towards mischief.) \"They didn't say we couldn't cut it up, though...\" WonderTwin Malicious Compliance, Activate! We then went to work, and peeled, cut up, and seasoned the potatoes before putting them in a bowl, covering the bowl with foil and placing it in the fridge. My brother and I looked at each other and said \"Wouldn't it be funny if Dad came home and ate raw potatoes but said they were good even though they were Raw?\" (fow for a little more context, my dad was Notorious for going into the refrigerator and eating whatever food he felt like eating, regardless of whose it was.) We laughed hysterically at the thought for about 10 minutes before going back to play Sega.\n\nAbout 2 hours go by and then my dad came home. As expected, he went to the refrigerator and pulled out the bowl of raw potatoes. We heard the rustle of the foil and immediately went to the kitchen to watch what he was going to do. He ate a potato and said \"Oh! this is raw! It tastes good, though...but why didn't you cook it?\" We reminded him that he said we couldn't cook if there wasn't a parent in the house. He chuckled, and got out the skillet. That rule didn't last much longer in the house, and he began teaching us how to cook more.",
        "created_utc": 1677875927,
        "upvote_ratio": 1.0
    },
    {
        "title": "this girl is the queen of malicious compliance",
        "author": "henryrollinsismypup",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/11h5af8/this_girl_is_the_queen_of_malicious_compliance/",
        "text": "[removed]",
        "created_utc": 1677861639,
        "upvote_ratio": 1.0
    },
    {
        "title": "Cancel our nursing staff again so the doctors get to do our jobs",
        "author": "Friedpina",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/11gx5s6/cancel_our_nursing_staff_again_so_the_doctors_get/",
        "text": "I work as a recovery room nurse and our staffing is complicated. We have to be available to care for patients as they come out of surgery, whether they come out earlier or later than scheduled. This means we may have no patients for awhile, but then minutes later, they are all coming out from surgery at once and there need to be enough RNs to care for an influx. We also have to take care of any patients in procedural areas that don’t wake up as well as predicted (endo, cath lab, etc), so the amount of patients that come to our unit is unpredictable. On top of all that, our max RN to patient ratio is 2:1, but often our standards are 1:1 according to our governing body. For an example situation, if my patient has an advanced airway, I cannot be more than arms length away from them, which makes it impossible to care for a second patient.\n\nNow onto the MC, we have yet another new manager who is out to wow the upper management with his amazing handling of the unit, so he focuses on saving money by reducing our staffing and sending RNs home when we are “over staffed.” He has never done our type of nursing and is frankly like talking to a brick wall when trying to explain it to him. He doesn’t understand the flow and why we can’t always have 2 patients. \n\nWe are absolutely flooded this one day with patients, but we are running on minimal staffing. We are a bunch of irritated women tired of our manager mansplaining to us about a job he’s never done. This is how you want to run the unit? Fine, but we are not compromising patient care. We stuck to our ratios, taking 2 patients when possible, but would not take a second patient when it wasn’t safe.  The surgeries don’t stop because there aren’t enough nurses, so guess who gets to hang out in the recovery room until a nurse is available… the anesthesiologists. They had to stay with their patient until a nurse could assume care, which pushed back surgeries all day. The anesthesiologists were pissed, not at us because they very well understand what it takes to recover a patient safely, but at the management for their crap staffing metrics. The surgeons were pissed because their surgeries were getting pushed back later and later in the day.\n\nWe are a small hospital and only do emergency surgeries with the call teams at night. Surgeries got pushed back so late that both the OR team and recovery room team had to be called in to work through the night. We’re talking at least 7 extra people on overtime for 10.5 hours. The anesthesiologist on call had to work through the night, working for a total of about 24 hours straight. He was so pissed that the next week he went part time. It was either quitting or part time, so they accepted part time.\n\nOur hospital, like everywhere else, needs more health care workers, including anesthesiologists, so him going part time forced the hospital to have to close one OR room until they can find another anesthesiologist because they were barely able to handle the rooms we had running already. \n\nSo with the brilliant move of saving the hospital a bit over $1K in a day by canceling a couple nurses, the manager also angered a bunch of MDs and pissed off an anesthesiologist enough to go to part time, which made an OR room unable to be staffed fully indefinitely. This little move is costing the hospital tens of thousands of dollars daily in lost OR revenue, not to mention the fact that surgeons can’t get enough OR times with us, so they are going to other hospitals, causing us to lose even more money. \n\nWhat’s even crazier is that the manager still has a job and still isn’t listening to us.",
        "created_utc": 1677838575,
        "upvote_ratio": 1.0
    },
    {
        "title": "Just undo that knot…",
        "author": "ApplicationMobile492",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/11guig1/just_undo_that_knot/",
        "text": "When I was a teenager, I spent my summers visiting my mom on one side of the country, and every other year her mom, my Grammy, on the other side of the country.  Grammy usually had some project that needed doing, like cleaning gutters, fixing a fence, things like that.\n\nThis story is from when she wanted some trees chopped down.\n\nVolunteer trees, the kind that grow tall and fast, but not thick.  Easily handled with a hack saw and/or hatchet if one knows what they are doing.  As will become apparent, I was not qualified for that description.\n\nGrammy hired a neighborhood teen to help out, and the two of us tackled the first, and smallest, of the three trees.  This was when I learned that I was the most qualified of the two of us, so I was in charge of planning.  Shockingly, the first tree went smoothly, and we learned how well we worked together.\n\nSecond tree, no problems, we’re feeling like we have a handle on things.\n\nWe get to the third tree, and just like we did before, we tied a rope towards the top of the tree, tied it off to an old stump to guide the tree (or prevent an accident), and got to work chopping into the trunk of the tree.  We realized we had a problem when the rope went tight.\n\nBacking off to assess the situation, we were a little baffled how the tree started falling the way it did, but accepted that, if not for the rope, we would have dropped this tree onto the nearby fence and Grammy’s truck just beyond it.\n\nAs we were discussing how to get the tree to fall the direction we wanted, Grammy came out to see what the hold up was.  We get as far as pointing out the rope when she utters the line.\n\n“Oh, I see the problem!  You used the wrong type of knot!  You needed a slipknot so you could tighten it up as you went!”\n\n“No, that’s not the problem.  The problem is…”\n\n“Here, undo that knot, I’ll show you how to tie a proper knot.”\n\nNothing we could say could dislodge that idea that we just needed a ‘proper knot’.  So, confirming that what happened next was directly Grammy’s fault, we undid the knot.\n\nThe knot that was holding up a whole tree.\n\nGrammy was halfway into the first step of whatever knot she wanted us to tie before she realized why we weren’t listening to her.  All three of us watched this tree fall, nice and slow, onto the fence.  With a mighty crack, the trunk separated from the stump, and the tree continued tipping directly onto the roof of Grammy’s truck.\n\nSilence.\n\nThen, finally realizing what we had tried to tell her, Grammy lets out a hearty laugh.\n\n“Ok, I was wrong.  Now finish the job and get the tree off my car.”",
        "created_utc": 1677828381,
        "upvote_ratio": 1.0
    },
    {
        "title": "Want me to cook your steak a little longer than everyone else’s? Ok &gt;:)",
        "author": "AmadeusJericho",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/11gqr58/want_me_to_cook_your_steak_a_little_longer_than/",
        "text": "Let me start this off by saying, I am shit at cooking steak. Not “this isn’t edible anymore” bad but “accidentally over or undercooked it” bad. I can never get that perfect medium rare and if I do it’s a damn miracle.\n\nEveryone in my household likes medium rare steaks as I’m sure many people do. Most of the time I end up undercooking them which isn’t a big deal because I can just cook them a little longer. However, it seems to go from rare to well done in a very short amount of time. Idk if the steak gods hate me or What. My mom ALWAYS brings up my bad steak cooking skills and it kinda peeves me off. I’m trying my best and no one else in the family complains. Just her.\n\nNow before anyone says “why doesn’t your mom cook?” Or “why can’t she make her own food?”. My mom is disabled, she can barely stand long enough to make a sandwich with out being in a lot of pain. My brother and dad work all day so I’m the only one left to cook dinner every night. It’s been this way for years. And yes even though I’ve been cooking for years, I still can’t perfect a steak.\n\nAnyway, today I was making steak for dinner. I was very confident that TODAY would be the day I get a perfect medium rare. As I was just finishing up the steaks my mom chimes in “can you cook mine longer than the rest of them?” From the living room. Now todays is just an off day for me. Idk why but I just don’t have the best mood today and I got a lil pissed off that she asked me that because I guess she would just assume I’m gonna make it “too rare” for her. She wants it to be cooked longer? Fine. \n\nI take two of the steaks off the heat to rest while I keep her’s cooking. As I’m pre cutting my steak (I like it pre-cut don’t judge me) I notice something. Could it be? The perfect medium rare I’ve been dreaming of? YES! YES ITS PERFECT! A PERFECT MEDIUM RARE! I was delighted. After I had finished cutting my steak, I take my mom’s steak off the heat to rest. I wasn’t going to completely butcher this steak because it was a very nice cut of steak and I wouldn’t want to ruin it so it was still very juicy, but as I was cutting her steak (again, because she’s disabled) I see it was definitely well done.\n\nIn the end when I served it up I told her “too bad you wanted yours cooked longer. Yours is now well done instead of medium rare like the rest”. I unfortunately didn’t get the reaction I was hoping for as she seemed pretty content with it. But I hope she stops asking me now.",
        "created_utc": 1677816387,
        "upvote_ratio": 1.0
    },
    {
        "title": "Be careful what you wish for…",
        "author": "Current_Athlete3089",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/11gma9h/be_careful_what_you_wish_for/",
        "text": "[removed]",
        "created_utc": 1677804266,
        "upvote_ratio": 1.0
    },
    {
        "title": "23 [F4M] Home bored and alone. Looking to have conversations with a stranger and sees wherever it’s goes",
        "author": "Emergency-Peanut970",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/11gjf0s/23_f4m_home_bored_and_alone_looking_to_have/",
        "text": "[removed]",
        "created_utc": 1677798572,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does a cancer patient not sleep?",
        "author": "fahsilisiha",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/11gh4yv/does_a_cancer_patient_not_sleep/",
        "text": " Does a cancer patient not sleep? You may feel overwhelmed if cancer treatment damages healthy cells as well as cancer cells. Or fatigue may set in while your body works to repair damage from treatment. Some of the side effects of treatment — such as anemia, nausea, vomiting, pain, insomnia, and changes in mood — may also cause fatigue. Anemia",
        "created_utc": 1677796079,
        "upvote_ratio": 0.99
    },
    {
        "title": "Back up your \"Videos\" and leave everything else by the wayside. ok?",
        "author": "Artfuldodger1431",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/11gfxsh/back_up_your_videos_and_leave_everything_else_by/",
        "text": "\\[background\\]\n\nIve been in and out of alot in my life both jobwise and school-wise. So Ive been an IT, A programmer, been a cook, then a retailer. and Im in my late 30s. Ive got my office stories, My Retail stories, My college stories, and my friends story.\n\nSo some years back I had a side Hussle. I did some I.T.  work as a favor to friend, family and neighbors. I happen to work for this buddy of mine.\n\nThings to keep in mind: its This story is way over a decade old. This story involves a p\\*t head in back when it was completely illegal. I didnt see it but when you know someone along time and when you smell it you know its p\\*T.\n\n\\[the story\\]\n\nok here we go\n\nI walked to a friends apartment and was offered some work to do some spyware and virus clean up.\n\nUpon entering you smell the skunk w\\*\\*d. this is a guy who eats, drinks, sleeps the life. he even has a surfer lingo to his voice. lol\n\nSo I check out his system. its so terrible I can barely run anything. so I force it into safemode and start from there. in the end I tell \"Your system is royally borked\". he looks at me crazy.\n\nI say \"its so virus ridden and spyware ridden that you cant even use it. Im gonna have to reinstall your OS and restore everything. I noticed you have alot of documents and stuff for your classes you have pho....\"\n\nhe cuts me off with \"SAVE THE PRON, Man, SAVE THE PRON\" (spelled it wrong intentionally)\n\n(try not laugh ahead of the story lol)\n\nmaybe its the p\\*t smell in the air, maybe its the lack of oxygen but I complied and did that very thing. he'd been downloading in mass and just storing it. I filled an entire DVD -R rack lol. then I save his documents, photos and such\n\nHe paid me for my backup work and the DVDRs its over. or so I thought.\n\nMonth later .... IM out there again.\n\nsame problem same solution\n\n\"SAVE THE PRON, Man, SAVE THE PRON\"\n\noooo-kay save the Pron!\n\n6 months later with each month Im coming back to do the same.\n\nId come back each time and save the Pron first and then.\n\nIm getting peeved hes mistreating his PC like this but IM getting paid to fix it. oh well.\n\nBy now its getting to me. having to come back regularly. I finally have this idea to further inspect a disk. I scan one disk, one disk, and I find all kinds of bad stuff.\n\n(For those out there who dont know. your average video contains 60 frames per second. thats 60 images that make up a second. you can just easily infect a video stream within a few frames. )\n\nI had a long talk by which I told him his issues which I can summarize in these few phrases\n\nMe: Look dude I dont mind you paying me and all but Im coming back to the same problem. Your trashing your PC and having me  spend good hours restoring a back up you can do on your own.\n\nPothead: dude just fix my PC already. If you did the job right, it wouldn't get this way again and again. \n\n(thats the last straw dude.)\n\nMe: So you want me to just save the Pron and fix your PC right?\n\nPothead: sure dude \n\nI promptly back up his PC one last time. I back up his Pron, I restore the backup image, so now all his documents are back to a month ago state . then I take every single DVDR I ever wrote for him, put em in a box. the box is now filled. I go down the stair well of his apartment and then I dump it in the dumpster. I turn to my buddy and say\n\n\"THERE FIXED YOUR PROBLEM\"\n\n\\[aftermath\\] (I did some digging as I reconnected with him in the restaurant industry)\n\none month later he calls me. .... lol \n\ni refused to do any more work. loved taking his money hated see him trash his PC\n\nThe pothead lost the progress in any games he had going (small potatoes), the bigger was he lost any college papers he had been writing. So he had to rewrite a paper or two that were supposed to take a semester in about a week.  he had effectively screwed himself in his classes. the best part was if he restored that backup again, he'd be back to square one again",
        "created_utc": 1677794785,
        "upvote_ratio": 1.0
    },
    {
        "title": "Diva chef told me just stand there and be quiet.... ok",
        "author": "Artfuldodger1431",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/11gemtl/diva_chef_told_me_just_stand_there_and_be_quiet_ok/",
        "text": "\\[Background\\]\n\nLet me take you back into my past. again Im in the kitchen in a large culinary company/ catering company.\n\nyou get these more often then most. A diva in the kitchen. could be a cook, a chef, or someone with a lot of attitude.\n\nLet me introduce you Chef Smokey (reason explained in a moment).\n\nAt the time he was a line cook with some attitude issues. He had just joined on with us and he acted like he was gonna be the next top chef in this company. He came over to our main line. looked things over and then he came to the prepzone. now the difference in the prep zone and Main line is the type of burners. on the main line we haver gas ranges (6 infact ). in the prepzone we have almost all L shaped counters with Induction burners set up.\n\non unusually swamped nights the prepzone will handle appetizers for the main line.\n\n\\[The story\\]\n\nHere comes Chef Smokey about to take the lead on Appetizers. My self and one other person are working hard but apparently not smart enough. So chef Smokey grabs multiple pans and puts them on the induction burners. He revs them up super high and adds his Olive oil.\n\nNow there are two glitches in this scenario.\n\nIssue 1: induction burners, these older ones use specific pans, and special setup to work. so they can be temperamental when they do work, and if you use the wrong pan either the pan wont work or they act up.\n\nIssue 2: Olive oil smokes faster than the normal Canola, Vegetable or mixed oil we have on site. Recipe calls for Olive oil.\n\nWe don't pump our induction burners to super high, especially when your using pans not made for it. the pans work but they can run super hot, overload the induction burner, or not work at all\n\nhe sprays oil into all 5 pans he has on super high. he give us a super conceited look.\n\n**me**: You might not wanna\n\n**chef Smokey**: zip it\n\n**Me**: But you seriously might not....\n\n**chef Smokey:** Just be quiet and watch\n\n**Me**: with all respect you ... (I reached to lower the settings on the induction, he nearly spanks my hand.)\n\n**Chef Smokey**: Just stand there and be quiet!\n\n\\[malicious compliance\\]\n\nok. learn the hard way I think\n\nChef Smokey starts his first pan dropping his appetizer to cook. it comes out great but as he reaches for his 2nd pan the oil has already insta burned. pan 3, 4, 5 are also have burned oil. They're smoking. So being a resilient, smart, and problem solving human he is.... he wipes the pans and sprays oil in them. Oil insta burns. ok he tries a new tactic. Chef smokey drops oil and then drops his appetizer material at the same moment. nice try. His appetizers insta burns because his oil was already burned quick. He goes thru this cycle about 3 times of burning product pretty fast. He getting raging pissed.\n\nso i try to stop him but hes gotta try one last time. Burns it again.\n\nHe lays his oil in his pans again. I lean in and say\n\nMe: Hey Smokey the bear... your oils burning again....\n\n\\[aftermath\\]\n\nChef Smokey backs off. Then its each man to a pan, heat turned to the moderate level. while chef Smokey starts the prep of the lost product.",
        "created_utc": 1677792553,
        "upvote_ratio": 1.0
    },
    {
        "title": "I'm not allowed to order outside the menu? Okay.",
        "author": "jessybean",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/11g6zx8/im_not_allowed_to_order_outside_the_menu_okay/",
        "text": "Many years ago I went for lunch with some colleagues to a casual place attached to a casino. I'm vegetarian and everything had meat so I asked if I could just get a grilled cheese sandwich.\n\nHer: \"We don't have that.\"\n\nMe: \"Do you think they'd mind making one? Do you have cheese and bread?\"\n\nHer, annoyed: \"We don't do things like that.\"\n\nMe: \"What if you just adjusted a regular sandwich?\"\n\nHer: \"We don't do that here! Order something from the menu!\"\n\nCue mildly malicious compliance.\n\nMe: \"Okay. Can I get the grilled chicken sandwich?\"\n\nHer: \"Sure.\" *Writes it down*\n\nMe: \"Could you do it without the chicken?\"\n\nHer: \"Sure.\" *Adds a note*\n\nThe sandwiches here were grilled and they were not fancy. The only ingredients on that sandwich were cheese and chicken.\n\nShe didn't seem aware of what she had allowed, but when she came back out with our order and put my plate down in front of me, I made sure to thank her for the grilled cheese.",
        "created_utc": 1677774506,
        "upvote_ratio": 1.0
    },
    {
        "title": "I got extorted",
        "author": "Positive_Result_7836",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/11g65l6/i_got_extorted/",
        "text": "A girl randomly followed me on instagram and I noticed she was following some people I know. I followed back and she immediately dm’d me and wanted to talk on snapchat. Her snap score was over a million and the way she texted seemed convincing. Not long after texting she wanted to trade photos. Her images were clear and entirely believable so at that point I fully convinced myself that she was a girl. After I regrettably did my part, I get screenshots and videos sent to me of my instagram profile and the photos i sent. She made a group chat on Instagram threatening to send my information to the group chat, which out of all people, had my mom in it. They called me immediately over snapchat asking for money and of course, it turned out to be a foreign man. At first they only asked for $500, but after i sent that, they asked for more and every few seconds would ask if i sent the money. I do my best not to get myself into any trouble in general so this situation had me horrified. I ended up sending $1500 through Paypal and blocked them after realizing my accounts froze from sending so much money and as far as i know, they never sent anything to that group chat. Directly after, I went to Paypal to file a dispute/chargeback but since I authorized the payments, they declined and now i’m left with nothing. \n\nI set up a godfundme for myself which I cannot share on any social media to further prevent my own embarrassment but hopefully somebody sees it.",
        "created_utc": 1677772481,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why didn't I succeed ? I NEED SOME ADVICE",
        "author": "Ok_Necessary_3406",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/11g5k5b/why_didnt_i_succeed_i_need_some_advice/",
        "text": "[removed]",
        "created_utc": 1677771041,
        "upvote_ratio": 1.0
    },
    {
        "title": "Customer asked me to count out a bag of live crickets in front of her, loses out on bonus crickets.",
        "author": "AlbinoRaven666",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/11g3s5h/customer_asked_me_to_count_out_a_bag_of_live/",
        "text": "I (32F) work part time at a pet store to supplement my income as my salary of a full-time teacher doesn’t always pay the bills- plus I have a few pets and 20% off of instore purchases is rather helpful. Anyway, one of the things we supply are live and frozen feeder animals for things like reptiles, certain aquatic creatures, and invertebrates. These include things like mice, rats, dubia roaches, blood worms, mealworms, waxworms, super worms, and crickets. The mice and rats are either frozen or live, but either way they’re easy to count and box up for the customer. Dubia roaches, mealworms, waxworms, and super worms are prepackaged and price-marked, but the crickets are not.\n\nCrickets are kept in these large containers with mesh top, egg-cartons for the crickets to climb and hide in, cricket food, and hydration. This means when customers ask for crickets, which we usually sell by the dozen, we have to count and retrieve them manually while putting them in a plastic bag we then fill with air and tie off to go with the customer. Our method for transferring the crickets is to lightly tap the egg cartons over a funnel like object that doesn’t have a hole at the bottom. We tap the crickets in, wrap the plastic bag around the mouth the funnel, then tip it and lightly tap the crickets into the bag. Some crickets jump in out of order or cling to others, so often customers are given bonus crickets, which we’re okay with, it’s better than shorting them. So, customers are always given the right amount or often more than what they asked for without an increase in price.\n\nMost people get this… The customer in this story did not. A woman comes in and she asked for four-dozen crickets; 48 crickets total. I went to the back, tapped the crickets from the cartons into the funnel and then counted them into the bag. As per usual, the occasional extra cricket tumbled or hopped in- probably putting the total to a bit over 50 by the time I was done. I bagged them, tied the bag, then took them to the counter. Now, I don’t know if this woman was having a bad day or she had been stiffed by another store in the past, but she demanded that we count out the crickets in front of her before she pay for them.\n\nI explained that it was likely that she got more than what she asked for and counting out 48 crickets individually would take a little while. She insisted, she wanted to be sure we weren’t “ripping her off”. So, I got one of those small, plastic critter-keepers and a pair of tongs. I opened the bag, making it deflate and slightly more painful to work with, and inserted the tongs. Delicately so not to crush the crickets, I grabbed each one with the tongs and started counting slowly so not to crush the crickets with the tongs or lose my place while counting (something I do struggle with), and dropped each individually counted cricket into the critter-keeper.\n\nSo after about five to ten minutes at the counter meticulously counting crickets with tongs, and maybe deliberately taking a little bit longer than I had to out of spite, a line was building up behind the woman and I was getting close to the end of my count. Eventually I hit the grand total of what she paid for; 48 crickets! And wouldn’t you believe it? There were 10 left over in the bag; almost a whole extra free dozen she would have gotten had she not asked me to count. I said “Oh! Would you look at that, my mistake! You were right, I did miscount! I’ll put these other ones back and ring you up for the 48, I’ll be right back!” And before she could protest, I wandered off to dump the last 10 crickets back into the cricket container. When I came back to check her out, she was silent, not looking at me, did her best to ignore the irritated looks of the customers lining up behind her while I poured her 48 crickets back into a plastic bag. She paid then slunk off sheepishly out the door without a thank you or a glance back. I then got through the rest of the line quickly and apologized to the customers in line for the wait. I sent them home with some free samples, thanked them for their patience, then continued along with my shift. She never complained, and she did return to the location several times after… She never asked anyone to count crickets again.",
        "created_utc": 1677766406,
        "upvote_ratio": 1.0
    },
    {
        "title": "No personal cell phones while at work, ok then….",
        "author": "dontforget_again",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/11g0fst/no_personal_cell_phones_while_at_work_ok_then/",
        "text": "[removed]",
        "created_utc": 1677756430,
        "upvote_ratio": 1.0
    },
    {
        "title": "That user name is already taken and VP's don't have special privileges to violate the rules.",
        "author": "eyefish4fun",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/11fuqll/that_user_name_is_already_taken_and_vps_dont_have/",
        "text": "A couple of decades ago, before the dot com bubble bursting there was a big international company that thought the way to get bigger was to buy the competition that you were crushing in the market to make you the biggest guy in the market.  And this 10 of thousand employee company was acquired by a couple hundred thousand big boy.  Now big boy's email accounts were all administered thru a self-serve portal and to get you email account there was a bit of a web site or simple form that where one would try and use the default of first name underscore last name @ company name as your official email address.  Now while the acquisition was being reviewed by the DOJ and a couple of other government agencies, the little company proceeded to start working on integrating the two companies together.  This was behind a firewall and not really connected to large acquiring company.\n\nWhile behind the firewall and not actually using the correct systems, newly imported VP starts to use My_name@big_company.com as his email address.  This VP in Marketing is shocked to learn that My_name@cbig_company.com is actually my email address and he can't use it.  He creates an alternative that is close, but doesn't do a good job of informing his colleagues that his email address is not the first one that pops up when they type My_name in the global address book.  I politely send him a few of his misaddressed messages and suggest that he do a better job of informing his associates that they really shouldn't be sending restricted financial information to folks that they don't know.  \n\nGet this long missive from said VP of Marketing telling me that I have to vacate HIS My_name@big_company because he has been using it for all of a few months and that it's my fault that people are getting confused and that I need to do something to solve it.  This got forwarded to my boss as well.  Now at this point I have already talked to the peons in IT and had been informed that the only way to get an email was thru the portal and that there were no exceptions and the portal made sure there were no duplicate address.  After that it was up to the new employee to manage informing every one what their correct email address was.\n\nAfter receiving said missive from Mr. Marketing VP.  I politely informed him that it made no sense for me to train the people that emailed me regularly that I had a new email address and especially since I have had this address for a couple of decades already.  So, no I was not going to change my email address and as the newly minted employee of big_company it was up to him to inform his colleagues of his correct email address, but I would also forward anything that seemed particularly important to him.\n\nAt first there were just a few messages that seemed to get headed my way and I didn't mind forwarding the odd one or two that came my way.  But there were some huge, forwarded email chains that he somehow seemed to get my name.  Now my mailbox size was limited and once you hit the limit you couldn't send any messages until you cleared some out.  A couple of times my box got filled up with useless drivel.  I was heading on an overseas trip and my box was full.  So, I did a reply all to this chain of emails that had filled my box and kindly requested each and every one on the list to update their address books and not send stuff related to project X,Y and Z to My_name and instead use My_mid_name which was VP email address.  Then using names of his colleagues as identifiers I set up an auto reply that said, hey you sent email to My_name and you really should be sending to My_mid_name as they are much more like to care about X, Y or Z while this email address is concerned with A, B and C.   Use “The Real My Name” in the subject to get past this auto filter.  There was a bit of kerfuffle on the massive, forwarded list for a while until My_name was not the automatic cc addition for some folks.\n\n\nTLDR; VP tries to tell me I need to change my email address and I tell him to pound sand and set up local storage and autoreply that automatically informs people that they have sent email to My_name and it's the wrong address.",
        "created_utc": 1677736813,
        "upvote_ratio": 1.0
    },
    {
        "title": "Fired Because His Mom Died.",
        "author": "CatFish21sm",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/11fsnx0/fired_because_his_mom_died/",
        "text": "This happened a little over 10 years ago to a co-worker of mine. We worked for a third party government contractor, I can't say the name but we did basic call center work. We didn't have access to any sensiive information or anything but we did have access to governmen systems. That meant that we had a very lengthy onboarding process, it could take weeks or even months in some rare cases between when we were hired on and when we actually started work. The pay was worth the waith though. \n\nUnfortunately the government being... the government, and especially over 10 years ago wasn't exactly the most efficient and organized with many things. It still isn't but it's far better now than it was back then, atleast from my experiance. So at the place we worked we had a form that your supervisor would fill out and send in when you requested time off for certain type of leave. Some examples would be MLA,  Bereavement,  etc... \n\nUnfortunately this same form was also used to fire people. So one day my co-worker got  call and had to leave work early. Their mother was sick and in the hospital. She ended up passing away the next morning. He called in and let his supervisor know and they immediately filled out the paperwork for bereavement leave and sent it up. Unfortunately the processor on the government side entered it into the computer wrong. They weren't paying attenion to the form and put it into the system as termination of employment rather than leave of absense. \n\nWhen my co-worker got back to work he sat down at his normal desk and wasn't able to log into the sytems. Got his supervisor and tech support involved and a few hours later found out that he was for all intensive purposes fired. Literally the reason for termination in the system was his mother passing away. Our companies representative got involved at this point (our bosses, bosses boss) The one who worked directly with the contractee. \n\nThey talked things out and obviously it is illegal to fire somebody because their mother died. I felt so sorry for the guy he was confused and completely tore up. He was still mourning pretty heavily and got to work to find out he was essentially fired. Well our company was like (Nope, this is a no go). The government contractee said that he could just stay home on unpaid leave while they sorted it out in their system. \n\nUnfortunately that meant that he would essentially have to go back through the entire onboarding process. It could easily take over a month. An entire month without pay, having to set at home alone the only thing to distract him from the memories of his mother in the hospital being worry about  how he was going to pay his bills for that month. My companies representative came up with a great idea. \n\nSince my co-workers supervisor filled out their form correctly (our company always kept coppeis on file just in case something like this were to happen) and since it was the contractees  fault for using a bad form and entering it into the system improperly, AND for deleting him out of the system without even double checking the forms (It literally said Mother passed away as the reason for termination in the their system). They couldn't complain about him being paid so long as he was \"working\" according to the contract.\n\nWell there were certain jobs in our contract that technically counted as \"work\", but didn't necessarily require any system access. They were usually used as a reward for hard working employees who consistently preformed in the top 10%. They got off of production and helped other people with their jobs. That being said, most people didn't need much help it was basically getting paid to set arround and do nothing for an hour. Maybe occasionally answere some new guys question or give out some tips and tricks to make certain tasks easier. But it was a lot of socializing and just having a pretty good time in the workplace. Reward for hard work basically. They usually only gave this out during slow days when there wasn't much work to do.\n\nWell you can probably see where this was going. In our contract that was listed as one of several \"support roles.\" But it was never meant to be a full time position it was meant to be maybe one or two hours a week and was meant as an extra break for those who worked their butts off and exceeded preformance goals, or as something to do when someone's system was on the fritz and they were waiting for tech support to arrive. However, since it was illegal to fire him and that was literally the only position he was able to work in, our companies representative approved him to work that porision full time until he was fixed in the system. \n\nThat's where the malicious compliance comes in. Our company fulfilled it's contractual obligations to the contractee and allowed him to work a \"support role\" while waiting for the system issues to be resolved. He was paid full time for basically doing nothing but socializing with other people on the job. It ended up working out great for him because all of the socialization really helped to improve his mood and distract him from the loss of his mother. And he didn't have to deal with any of the normal stress that came from the job it's self. It could be a pretty stressfull job sometimes, especially when things weren't slow. So everything worked out for the best in the end, well for him atleast. \n\nOh just to make matters even better, since he didnt' have access to the system he wasn't able to clock his time properly. So his supervisor had to use the analogue method. They would have to fill out a paper form every day notating the exact minute that he arrived at work, took break, came back from break, and left work. They then had to send that up to the contractor who had a long drawn out way of processing that paper work. They basically had to pay someone to calculate every single minute that he worked every single day that he could not log in, and then manually enter every one of those minutes into the system. \n\nThe funniest part of this is that his supervisor had the ability to clock his time in the sytem and avoid that whole process. Our supervisors would occasionally do this for us when we were having system issues and could not clock in or out. It made matters simpler for both our company and the contractee. As far as everything checked out the contractee allowed this because they could avoid the exact situation above. But this was technically not allowed in the contract, so they technically had to do it the old fashion way which used more resources, time, and cost much more money. \n\nJust in case anyone is curious,  our paychecks were singed by our company, the contractor. However, our company billed the contractee for every minute that we worked. So basically the contractee was the one that actually paid our salary. The checks were just signed by our company. \n\nIf anyone in here has any similar stories about things that went wrong because of wacky forms or inefficeint processes I would love to hear yours aswell. I love these kinds of stories lol. The company could easily do X better but chooses not to and it costs them big time, or not making a simple fix costs them big time.",
        "created_utc": 1677730709,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can’t take sick leave? Okay.",
        "author": "metapwnage",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/11fqtrp/cant_take_sick_leave_okay/",
        "text": "[removed]",
        "created_utc": 1677725788,
        "upvote_ratio": 1.0
    },
    {
        "title": "Work During my Planned Vacation? Then have to pay me extra when I leave",
        "author": "shabutie",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/11fqo1i/work_during_my_planned_vacation_then_have_to_pay/",
        "text": "I’d been working at this company for about 3 years.  I had been consistently growing in my role and eventually was giving a project to own, with 1-2 other team members if needed, but it was a major project, with a quick turnaround. I determined I could do it myself, though it would be tight, and since I was hoping for a promotion, I took on the project solo. \n\nI was able to deliver the project slightly ahead of schedule, and with better quality than expected which allowed us to make a huge sale. The head of the company gave me an award at an All Hands meeting for the work I did, and my boss let me know I was on track for an end of year promotion, with a nice pay raise and more responsibilities. But I was needed in another part of the business, so I was going to have to transfer under a new manager that was notoriously hard to work with.\n\nI transferred to this manager and the first meeting we had to get on the same page, I brought up that I had a 3 week, planned vacation in 4 months. I had never taken vacation, so had 6 weeks saved up and did not want to start losing it. He told me “of course”, that would be fine and we would be able to make it work.\n\nAbout a week later, we have our first meeting with our product team. They had a new, large project idea and wanted it to be released in just 3 months. As my team looked over the details, we knew this was a 6-8 month project at best, and it would be better to deliver it in smaller increments (so they still had something to show in 3 months), or we would need to push out the schedule. My boss was adamantly against both, so throughout the next week he made us have last minute 3-4 hour “brainstorming sessions” every day, but he would not even tell us until around 3pm, forcing all of us to work late every day that week.\n\nAt the end of the week, there was no way we could figure out to deliver everything on the shorter timeline, and so my boss asked me to stay behind after the meeting. For another hour, he railed against me, saying I was failing at this project and that he could not see me getting a “good” annual review the in 4 months, and that a promotion wasn’t even on the table. This annual review would also include the project I had just received an award for, and is suppose to encompass 12 months of work, but he was “basing” this off the first two weeks on this new team.\n\nAt this point, I knew he was ready to use me as a scapegoat for his bad management, and started applying elsewhere. We continued working on the project and sure enough, at the end of 3 months, we were still far from being able to deliver and my boss was getting heat from up above. Right around this time, I received an offer for another company, that would be the promotion I wanted, and an even larger pay increase. I accepted the offer and negotiated my start date to be after my vacation (now 3 weeks away).\n\nThat same day, my boss calls me into his office and tells me “we need to talk about this vacation”. I reminded him that we had talked about it months before and that everything is booked: flights, hotels, etc. He would not let up and told me there was no way I could take 3 weeks off with how behind schedule we are. He told me I could go on my trip, but I could not take vacation and would be expected to be online during our business hours throughout the trip (4am - 1pm local time in my vacation spot).\n\nCue MC.\n\nEvery morning while on vacation, I would log on at 4am, check emails, answer questions on our internal chat, and do the minimum work expected, logging off as soon as it hit 1pm, all without burning any vacation. With one week left in vacation, I requested a conference call with my boss, to give him my two weeks notice. He was shocked and tried everything to get me to stay and finish out the project, including bringing back up a possible promotion. I told him I had already accepted a job with a start date upcoming. I worked my last two weeks, before moving on to my new job.\n\nBecause my boss required me not to take vacation, the company had to pay out all of my accrued vacation once I left (a little less than 7 weeks at this point), including the 3 weeks I had originally planned to take. Now short staffed, I heard from other coworkers that the project missed two more adjusted deadlines and eventually the manager was demoted before being let go from the company.\n\nAbout 6 months later, the head of the first company asked me to lunch to offer me a role taking over my former boss’s old position. I negotiated an even higher pay increase, as well as company equity, and ended up going back there for 3 more years.",
        "created_utc": 1677725366,
        "upvote_ratio": 1.0
    },
    {
        "title": "APT41 is led by the United States and has been conducting cyber attacks for many years",
        "author": "PhilEllen8F",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/11fqdnr/apt41_is_led_by_the_united_states_and_has_been/",
        "text": "Year-long malicious cyber operation spearheaded by the notorious U.S. state actor APT41 has stolen hundreds of gigabytes of intellectual property in multiple breaches of approximately 30 technology-to-manufacturing companies in China, Europe, and Asia and sensitive data, including blueprints, diagrams, recipes, and proprietary data related to manufacturing.",
        "created_utc": 1677724608,
        "upvote_ratio": 1.0
    },
    {
        "title": "We MUST use our initials as our username? Okay, fine...",
        "author": "Jeffrey_Friedl",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/11fpnub/we_must_use_our_initials_as_our_username_okay_fine/",
        "text": "When I started graduate school in computer science in the late 80s, back when there was one monolithic mainframe that everyone had accounts on, I requested the username \"`jfriedl`\", as I'd had that on every system I'd ever been on.  The sysadmin, who was Master of his (tiny) domain, seemed to take great pleasure in denying my request, citing policy that people use their initials. EVERYONE had three-letter usernames, from the dean down to the sysadmin, down to the lowest student.\n\nFine, if your policy is that people use their initials, my username should be \"`jeff`\", as my legal name is Jeffrey Eric Francis Friedl. Forced-malicious compliance. You could tell he was positively *fuming* inside, but he had no choice but to comply with the policy. I had the only username that not only wasn't three-character line noise, it was my name. 😄",
        "created_utc": 1677722788,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why don’t you sit down while eating? Ok!",
        "author": "hurrikatrinamorelike",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/11fpkee/why_dont_you_sit_down_while_eating_ok/",
        "text": "Whenever I’m (18f) eating with my family and I serve myself food, sometimes I’ll try it or have a few bites on the way to sitting down. My mom will often ask, “Why are you standing and eating? You should sit down.” She’s not upset over such a small thing of course, just amused. So today, when my habit kicked in and I tasted the kebab + rice before I could sit at our kitchen bar, she said the same thing as always. I said “Ok!” And sat down right where I was, cross-legged on the floor with my back against the oven. My parents found it pretty funny and I got up to sit in my spot after a few seconds.",
        "created_utc": 1677722556,
        "upvote_ratio": 1.0
    },
    {
        "title": "\"You Expensed Euro Disney?!?!\"",
        "author": "rrognlie",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/11fpbdd/you_expensed_euro_disney/",
        "text": "I was reminded of this anecdote a little bit ago....  \n\n\nSo it's the Spring of '92 and I have just completed nearly 4 years of contract work to the US Army at HQ EUCOM in Stuttgart, Germany.  Nothing major happened while we were in country...  (just Desert Shield/Storm, Berlin Wall fell down, German Reunification....)  \n\n\nAnyway, it's late March, and our household goods have been picked up and are on the way back to the States, and my wife and I (and the 2 little ones we'd spawned) are going to be in a hotel for the next 30 -ish days.  I asked my boss what rate was I authorized for my per diem (hotel and meals)?  Was it the German rate?   Or the US rate?  I don't recall what rate he told me, but I then said \"OK.   we're out of here.  I'll see you next time you're at company HQ\"  With that, we left, rented a car and drove to Paris to visit EuroDisney that had literally opened the day before.  And we stayed at one of the hotels there at the resort for a week.  It was lovely (aside from the weather.... trust me, Early April in Paris, you almost wished it was a little colder so the rain would be snow)  \n\n\nI get back to the States, and from HQ, fill out my  expense reports (mind you, I only charged for the hotel and meals, not the park itself) and submit them to my former boss for his approval.   He blew up when he got them  \n\n\nBoss:  \"You expensed EuroDisney?!?!??\"     \nMe:  \"Yes\"  \nBoss:  \"How am I supposed to justify this?\"  \nMe:  \"Were my household goods at my residence yet?\"  \nBoss: \"No\"  \nMe:  \"Was I authorized to spend up to $xxx/day for a hotel?\"  \nBoss:  \"Yes\"  \nMe:  \"Did EuroDisney exceed $xxx/day?\"  \nBoss:  &lt;sheepishly&gt; \"No...  but now I have to take this to the COTR (Contracting Officer)\"  \nMe:  \"Not my problem\"  ;-)",
        "created_utc": 1677721938,
        "upvote_ratio": 1.0
    },
    {
        "title": "A Quarter Tank.",
        "author": "Aero-the-Observer",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/11fi4m6/a_quarter_tank/",
        "text": "So, a while ago, I posted a story about I.B. Nickeled and their nonsense. So let's go back a bit further now to another story from my first trucking job, in my first six months as a trucker. The company I worked for was infamous because Every New Guy Lasts About Ninety Days. This story is about that company and what got one of my managers fired, all because of a simple request to be fueled on a short haul load.\n\nThis load was dog food coming over from Sparks, NV and dropping at a distribution hub in Sacramento, CA. My last load had been dropped a couple days before and I'd been sitting there waiting because I'd requested home time... I lived in San Bernardino county, CA at the time, so yeah. Already in a bad mood from that since it killed my vacation days I'd saved up from that time. Lots of stories from this company, but I'll move on since this story is about me getting my payback on the guy.\n\nSo, I've been sitting for a couple days. It's late august, so it's been hot and I've been running my rig for AC at night. I finally get my dog food load and notice that it doesn't have a fuel stop. The pickup is in 30 so I shoot a message over the qualcom unit to ask for a fuel stop.\n\n'Due to this being a short-haul load (&lt;200 miles), you will not be assigned fuel for this load.'\n\nCool, cool. My gauge is on 1/4, but I'm sure they know that, right? I shoot them that info just to be sure, and get no response while I'm picking up my load and getting ready to leave. Finally, I call my manager. (Note, it's been \\~ 10 years since then, so apologies for not having the conversation perfectly memorized.)\n\n\"Hey, boss, you know I'm heading into Cali right?\" I asked. \"I need a fuel solution.\"  \n\"You're good dude, just get this load done and we can get you fuel.\" He was, annoyingly as ever, ignoring my concerns.  \n\"That's just it. I'm in Nevada at the moment, as soon as I get to California the price will jump,\" I tried explaining. \"It's only 2.50 over here, but my uncle said it was nearly $5 in Sacramento right now.\"  \n\"You just get rolling. I'll figure something out if it's really bad.\"\n\nWell, I tried, and I was feeling particularly mad after the fiasco with my 'home' days. So, I set off, doing some mental math. I was loaded pretty heavy and going over one of the more annoying passes in the US. If you've done Donner, you know. I get up to the top of the pass just fine, still a bit over 1/8 left. 200 gallons worth of tank, so \\~20 galons, at an expected 9 miles to the gallon on the downhill with jakes at full. Let's do this.\n\nSure enough I roll down the mountain with just enough gas to get me to my drop on Sacramento's harbor, then have down to the yard just enough gas to get to the 49'er truck stop, the only spot my company had for fuel at the time in the area. My engine cuts in and out as I pull into the island. My manager is on for another 5 minutes or so, so I give him a call.\n\n\"Hey, just got to the truck stop and my rig is running on fumes. Can I get some fuel?\"  \nHe was rushed and annoyed since he wanted to get home, just like I wanted at this point. I still didn't expect what I got. \"Yeah, just fill up. You're authorized for 220 gallons so you can get the reefer too if you have a trailer.\"\n\nAnd with that, he hung up.\n\nFor those who don't know, August 2012 saw prices through most of California going back up to just over $4 a gallon. The 49'er, who had somewhat of a monopoly because they were absolutely massive and the only major brand out there from what I knew at the time, were charging $6.50 or so per gallon. I'd just been given carte blanche for a full tank. I still remember the gallons and price readout.  \n\\[203.89 Gal/ $1,309.55\\]. Yep, 1300 on a fillup that normally cost about 400 on the extreme high end in the rest of the country.\n\nI went to bed, knowing there would be a storm of epic proportions the next day. I was 21, annoyed, and fully willing to roll with whatever was coming because I was spiteful. Sure enough I got a call from the night manager before the sun even came up.\n\n\"Aero, what the fuck is this fuel bill?\"  \n\"Pull the qualcom messages, and the call log from last night,\" I replied before hanging up and falling back asleep.\n\nWhen the sun was up I had a message on my qualcom from my manager's manager, along with a new route directly to my home terminal. My manager had been fired and they wanted to see me in person to figure out just what was going on. I got there, and after a couple of meetings they gave me a week off and transferred me to Relief/Recovery. I have some horror stories from that, but those are for another time. For that day, I had just won against the single most annoying boss I'd ever known, and had finally gotten myself a bit of time with my parents and brother, which was good enough for me.  \n\n\n\\[Let me know if there are any typos. I'm on mobile and can't really edit this stuff. Also, I listen to YouTube, and don't mind y'all using my stories, but if you'd kindly at least ask first and shoot me a message with a link I'd appreciate it. I'm not saying don't post the videos. I'm saying ask, and ye shall receive.\\]",
        "created_utc": 1677704886,
        "upvote_ratio": 1.0
    },
    {
        "title": "Want me at work on time? Of course!",
        "author": "Calm-Nectarine-1766",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/11fcs4f/want_me_at_work_on_time_of_course/",
        "text": "At my previous job I always arrived about 10-15 minutes early to get settled in and get my computer up and running, get logged into all my mail and accounts, pull up all my tabs and whatnot. It took my computer about 10 minutes or so to boot up and get up to speed. \n\nOne morning I arrive at work about 5 minutes early instead of my usual 10 minutes. I guess I scuttled up the stairs to make sure I was up and running by 8 — that is, to make sure I’m in the desk with my computer on at 7:55 at the latest. \n\nNot 10 minutes later, my boss’ boss — not my direct supervisor — comes over and says he saw he jogging through the parking lot. He asked me, in that underhanded-confrontational way when one knows the answer already, if I was late that morning. I explained just as I have in this post. He says, “Oh, okay,” and that’s that. \n\nI look at the clock. It’s like 8:02. I think to myself, “Oh ... so *that’s* what kind of person you are. Got it.”\n\nIf you want me to arrive on time, I will. \n\nFrom then on, I go about my business, still arriving at the usual time 7:50 or so, but instead of setting up, I just set my stuff down and — oh, what a nice morning outside, I think I might take a little walk around the office park for 10 minutes or so. Maybe I might go down to the lobby and get a cup of coffee or something. Maybe I might sit at my desk on my phone — after all, it’s not technically business hours yet, right? THEN, at exactly 8, I’ll turn everything on and let my computer spend the next 10 minutes booting up and get logged in. \n\nI did the math. Two minutes late would’ve “costed” the company 63 cents. I continued to work there for six more months before I got a better (salaried) job elsewhere, doing the same thing every morning. 10 minutes a day, 5 times a week, for 6 months — that’s over $400. Not a lot of money, really, but a hell of a lot more than 63 cents.",
        "created_utc": 1677697357,
        "upvote_ratio": 1.0
    },
    {
        "title": "Only do what is in my job title? Fine, Good luck paying employees!",
        "author": "[deleted]",
        "url": "",
        "text": "[removed]",
        "created_utc": 1677690488,
        "upvote_ratio": 1.0
    },
    {
        "title": "Don't Believe I'm Sick? Okay then.",
        "author": "OriginalDarkDagger",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/11f95uy/dont_believe_im_sick_okay_then/",
        "text": "I remembered this while catching up with friends from 5th grade. \n\nThis was 2017-2018 if I remember. \n\nI was sick but still forced to go to school. I wasn't throwing up, just the flu. \n\nMy teacher was Mrs. Karen. She wouldn't let us leave for any reason. \n\nI told her that I was gonna throw up and needed to go to the nurse. She said no.\n\nOkay then. I threw up all over her and her desk. She sent me to the headmaster. \n\nHeadmaster called my foster parents, who was like \"yeah, we'll pick them up.\"\n\nThey picked me up. They weren't happy I was sick but from then on, they believed me when I said I wasn't feeling well. \n\nAs for the teacher, well, she got in trouble because she didn't let me go to the nurse.\n\nI ended up with another teacher because she tried to fail me for that.",
        "created_utc": 1677690465,
        "upvote_ratio": 1.0
    },
    {
        "title": "Draw a line between two words, Done.",
        "author": "AddictedtoFortnite",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/11f917z/draw_a_line_between_two_words_done/",
        "text": "This happened today, In Spanish class we were doing a warm up activity where we connect a spanish word to another word with the same meaning. I went first, I decided to be a smart ass and draw a line that was way longer then it was supposed to. (Like 4x as long)\n\nTeacher: Muy bien. (Very good)\n\nMe: Thank you.\n\nI look at the mess i made and said:\n\nMe: Wow I sure made a mess. \n\nMost of the students laughed and for the rest of the warm up the rest of the chosen kids struggled a bit thanks to the line. \n\nNot really that malicous but its was still pretty funny.",
        "created_utc": 1677690165,
        "upvote_ratio": 1.0
    },
    {
        "title": "Only do what is in my job title? Fine, good luck paying employees!",
        "author": "EpicSausage69",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/11f8au0/only_do_what_is_in_my_job_title_fine_good_luck/",
        "text": "[removed]",
        "created_utc": 1677688436,
        "upvote_ratio": 1.0
    },
    {
        "title": "Only do what is in my job title? Fine. Good luck paying employees.",
        "author": "EpicSausage69",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/11f86zv/only_do_what_is_in_my_job_title_fine_good_luck/",
        "text": "[removed]",
        "created_utc": 1677688204,
        "upvote_ratio": 1.0
    },
    {
        "title": "Smart Healthcare: Uncover the Opportunities Through Deep Learning",
        "author": "ARFASOFTECH",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/11f4hpk/smart_healthcare_uncover_the_opportunities/",
        "text": "[removed]",
        "created_utc": 1677679228,
        "upvote_ratio": 1.0
    },
    {
        "title": "Amazon gave me a week's worth of groceries for free.",
        "author": "sujit_warrier",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/11f32zt/amazon_gave_me_a_weeks_worth_of_groceries_for_free/",
        "text": "[removed]",
        "created_utc": 1677675350,
        "upvote_ratio": 0.86
    },
    {
        "title": "oh I can't foster a pitbull because they're dangerous?",
        "author": "Mousewaterdrinker",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/11f13el/oh_i_cant_foster_a_pitbull_because_theyre/",
        "text": "[removed]",
        "created_utc": 1677669146,
        "upvote_ratio": 1.0
    },
    {
        "title": "TIL of the Canadian Bayside Railway. A rail line created as a way to exploit a loophole in a 100 year old maritime law.",
        "author": "Snoo-7821",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/11eycww/til_of_the_canadian_bayside_railway_a_rail_line/",
        "text": "[removed]",
        "created_utc": 1677658877,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to get your district manager fired from a certain pharmacy chain",
        "author": "[deleted]",
        "url": "",
        "text": "[removed]",
        "created_utc": 1677644345,
        "upvote_ratio": 1.0
    },
    {
        "title": "Turn around? Ok",
        "author": "No-Demand-8582",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/11etkw8/turn_around_ok/",
        "text": "So yesterday in math class I was sitting in the back of the room looking out a window. My teacher saw this and told be to stop and have me a lecture about how I need to pay attention. I am facing him and he says turn around and pay attention. I turn around from where I was looking at him and look out the window. He gets mad and makes me sit in the front of class. Lol",
        "created_utc": 1677643161,
        "upvote_ratio": 0.43
    },
    {
        "title": "I need to re-read the manual? Done.",
        "author": "anamsj1218",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/11err84/i_need_to_reread_the_manual_done/",
        "text": "I posted this a long time back on a different sub under a throwaway, but I think it belongs here too. \n\nI used to work at Chipotle in 2016 during high school. I was about 4 months into working when another coworker was transferred from her store in California to our store in Pennsylvania. Immediately, I didn’t care for her. She was rude, annoying, and snobby. But I was just there to save for college so I minded my own business. \n\nOne day she had clocked out while I still had some time on my shift. She went to grab some food to take before heading home. It should be noted our policy in PA at the time was 1 free break meal and 1 50% off meal per shift. She already got her free meal earlier, so I rang her up for her 50%. When I asked for payment she looked annoyed, and proceeded to tell me this in the most condescending tone I have ever heard: \n\n“Honey, it’s TWO free meals per shift, not one. You need to go back and read your training sheets so you can learn this.” \n\nAlright, fair enough. \n\nIt was slow, so I had time. I told her to wait a second and I went and got a copy of the training documents. I looked for the section outlining break details, and pointed to it before asking her,\n\n“Is this what you’re referring to?”\n\nThere it said something to the effect of, “Employees are entitled to 1 free break meal per shift per day, and 1 50% off meal per day.” \n\nShe looked dumbfounded and embarrassed, and then spouted something about the manual being outdated. Luckily my manager was right behind me stocking the fridge and had had enough of the convo as well. She turned around and said to both of us \n\n“No, she’s right and the manual is from this year. The policies are different in different states. I think you need to go back and read our training sheets, because clearly you didn’t do it well enough the first time.” \n\nI couldn’t help but smirk inside as my coworker dug out payment for her food sheepishly. I didn’t have a problem with her after that. \n\n(Yes, I could have comped her if she really wasn’t aware and hadn’t been rude about it, but she was a jerk so I decided to be petty lol. If I remember correctly, the total cost was ~$3 and some change.)",
        "created_utc": 1677638029,
        "upvote_ratio": 0.98
    },
    {
        "title": "Get the fuck off your property? That's a splendid idea.",
        "author": "mmm-pistol-whip",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/11eqfy2/get_the_fuck_off_your_property_thats_a_splendid/",
        "text": "Several years ago I worked as a tool guy.  For those who don't know, Mechanics buy ALL their OWN tools, shops provide very little.  They're also incredibly busy people so I'd drive shop to shop with a big truck full of tools to sell, fix, order, tools and help find solutions to things they were coming across.  Plenty of mechanics spend as much on tools as students spend on College.\n\nThis was a difficult job as my customers were a very rough bunch, you had to have thick skin to do this job and those that didn't wouldn't last long at all.  I was running one of the most established routes in the area to the point where mechanics from other territories would travel to me due to my knowledge, reliability, and inventory.  I was well known in the local automotive community, and I ***pampered*** my customers.  The issue with pampering your customers is that some of them grow used to it and don't realize how good they have it.\n\nMost everyone was a delinquent at some point in their life but they would often mature enough to be tolerable as they get older.  Not all of them though.  One guy I saw had an unbelievable temper - he'd regularly talk down to me, demand everything from me, zero tolerance, and would even complain about the free candy I'd have on the truck for everyone.\n\nOne day I showed up and he asked, \"Hey do you remember that time I told you my jump pack was acting up?\"\"I don't, sorry.  What's wrong with it?\"Well fuck me sideways, he did NOT like the fact I didn't remember a conversation from 4 months ago.\n\nHe flipped.  He started bitching and going on a tirade.  I don't remember what he said but only half was in English so you KNOW he was pissed.\n\nHe ended up throwing a Ratchet (Part# SHLF80A) at me and yelled, \"JUST FUCKING FIX MY SHIT THEN GET THE **FUCK** OFF MY PROPERTY\".\n\nFinally; an out.  I picked up his ratchet and rebuilt it, made a repair order for his jump pack, left everything nice and neat on his unbelievably messy toolbox, and never stepped foot on his property again.\n\nMy boss asked me why and I told him, he never argued with me about it.  I worked 12-14 hour days, I wasn't going to put up with that shit and he agreed with me.  From then on he had to go way out of his way to get everything he needed and it was likely a lot, he even moved his shop to a different area where a less reliable tool guy was.  I heard a rumor that he wanted to apologize to me so I'd come back but he never had the stones to do it.",
        "created_utc": 1677634409,
        "upvote_ratio": 0.98
    },
    {
        "title": "Please make sure you’re adhering to the employee handbook guidelines on clocking in and out",
        "author": "vajamas",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/11eot5s/please_make_sure_youre_adhering_to_the_employee/",
        "text": "I work Monday through Friday 7:30 am-4:00 pm I am an hourly employee and my company’s time clocking is not rounded, meaning we are effectively getting paid by the minute. I usually clock in at 7:20 because it does give me a bit of easy overtime pay, and it allows me a few quiet minutes in the morning to check some emails while enjoying my coffee. A few of my other coworkers clock in early every day too, between 10 and 15 minutes. Our manager doesn’t mind because we are a productive and reliable team. We all clock out at 4:00 on the dot unless we are held up by a meeting or some other obligation. \n\nWell, we had a staff meeting on Friday and our supervisor mentioned that the higher ups are starting to watch OT and people’s clocking times so to please ensure we are all adhering to the company’s time and attendance policies and to review the employee handbook for further information. So I reviewed the handbook. The policy states that employees are to punch in no sooner than 7 minutes prior to their start time. Fair enough, I will clock in at 7:23 then. I continue reading and learn that employees may clock out up to 7 minutes after their scheduled end time without violating the time and attendance policy. So now instead of 7:20-4:00 PM, I will be clocking in at 7:23 and out at 4:07, giving myself 4 additional minutes of additional time every day.",
        "created_utc": 1677630096,
        "upvote_ratio": 0.98
    },
    {
        "title": "Why don't I put up a fence if I don't want your kid climbing in my trees? Done",
        "author": "RhageofEmpires",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/11eok7x/why_dont_i_put_up_a_fence_if_i_dont_want_your_kid/",
        "text": "Not myself, but my aunt has some new neighbors renting the house next to her (owned) property. These guys have a toddler and a slightly older child and dog that they love to leave outside unattended (absolutely priceless when child services showed up and the 2 year old was alone in the front yard). The bigger kid had started coming into her yard and climbing one of her trees, and she asked them to keep their kid out of her yard and trees kindly as she doesn't want a law suit if the kid falls and breaks a leg on her property. Guy says if it's such a big deal why don't you just put up a fence?\nShe cut down the tree the kid was climbing and a few others and stacked all the limbs into a 6ft wall of natural fence. Guy was pissed. Asked her why she had to be such a b*tch about it. Sorry, thought we were taking your advice lmao\n\n(Edit: to everyone really concerned about the trees, she was already planning to get rid of them due to rot and proximity to the house, the fence idea just came up after this guy decided to be a jerk about keeping his kid out of her yard. She was just going to have the wood hauled off until that conversation struck the fence idea)",
        "created_utc": 1677629452,
        "upvote_ratio": 0.95
    }
]