[
    {
        "title": "Time tracking salaried workers is ridiculous...",
        "author": "kickapoo52022",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/10nl16t/time_tracking_salaried_workers_is_ridiculous/",
        "text": "Sorry for any formatting issues. I'm writing this on my phone. Tldr at the end.\n\nMy company decided to install time tracking software on everything a few years ago, but didn't make a big deal out of it. When asked, management said to not worry about it and keep doing your normal workday.\n\nRecently, time worked has become a bigger issue. HR is coming down hard on everyone I know. According to them, we are only working 50% or less of our required hours. This didn't make any sense, because the work is still getting done, and everyone is still online all day. \n\nBecause of time being a bigger issue, I started tracking my time very carefully. I was logging over 9.5 hours of work a day, but only getting credit for maybe half that. Cue malicious compliance.\n\nI tested a bunch of different scenarios and learned what is tracked and what isn't. Scheduled meetings are always tracked. So now I am in a meeting every minute of my normal workday. And once I hit the 8 hour mark, no matter what I am doing, I drop it, and quit for the day. This has started to affect how much is being done in total on a weekly basis. But I am finished with working for free.\n\nTldr: company complains it's workers aren't putting in enough time, so now I put in the exact amount required, reducing work completion by almost an additional full day a week.",
        "created_utc": 1674928460,
        "upvote_ratio": 1.0
    },
    {
        "title": "AITA for calling out my Psychologist on her BS when I followed up on some medication?",
        "author": "Humble-Guard2412",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/10ni4qd/aita_for_calling_out_my_psychologist_on_her_bs/",
        "text": "[removed]",
        "created_utc": 1674920983,
        "upvote_ratio": 1.0
    },
    {
        "title": "So I'm not allowed text documents for descriptions? Ok, I'll code my own.",
        "author": "RSVDARK",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/10nhish/so_im_not_allowed_text_documents_for_descriptions/",
        "text": "I'm a programming student, and we had an upcoming test where we're allowed to refer to out previous projects we coded, as long as we know exactly how it works (no searching up random code on the internet). \n\nBecause all of our projects had to have very specific names, I asked if we were allowed to use text a text document so I could type out what each project did, and while the teacher understood why I was asking, he explained that it wasn't allowed to use anything except the programs themselves, or the detector would instantly fail me.\n\nI then asked if I could make a new program with, in comments, the descriptions of the projects, which he also didn't allow.\n\nSo I decided to program a simple text document, with scrolling (one of my first times with that programming language btw), so I could get a description of my projects. The teacher saw it and, while slightly upset, he was mostly impressed, and allowed me using it on the test, because I was able to explain exactly how.everything worked.",
        "created_utc": 1674919364,
        "upvote_ratio": 1.0
    },
    {
        "title": "Pull The Door Logs? FU, Pay Me.",
        "author": "Bundabar",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/10ngen2/pull_the_door_logs_fu_pay_me/",
        "text": "I’ve done cleared contract work for more than 20 years.  One downside of cleared work is that there is no sneaking in late or out early as everything is logged.  A few years ago I discovered that one upside is also that everything is logged.\n\nI was hired onto a 5 year contact and for the first 4 everything was fine.  I rode the train to work, did my required 40 hours, went home, and had no problems.  Into year five the same thing happens that always happens in contacts, people start to leave.\n\nThis is not unusual as the end of a contract holds some uncertainty so people will find another new contract to move onto so they don’t have to worry about it.  Unfortunately, the immediate effect is that the workload shifts to the people that stay and things start to slip.  Why not hire more people?  Nobody wants to come onto a contract that’s in its last year.\n\nWell, on this contract I stayed because I liked the customer and intended to ride out the final year shenanigans.  Things started to fall behind (we were down from 15 engineers to 5) and the customer complained that the company was not meeting their contract obligation.  What did the company do to fix this?  Offer hiring bonuses?  Pay overtime?  Make lucrative offers for people to stay?  Nay!  They called in their ball-busting “everybody is inherently lazy” boomer project manager to handle things.\n\nFrom day one boomer manager (BM) tells everyone that our lack of progress by 5 people on more than 100 active projects is simply a time management issue and he threatens to “pull the door logs” to see who is actually at work for 8 hours a day.\n\nI figured he was bluffing and I didn’t worry because having been on the train’s schedule for 4 years I knew that everyday I was in the building from 7-4 except for occasionally walking down the street to grab lunch.  The key point here is that being a contractor I couldn’t work overtime without authorization so for 4 years I had just put 40 hours a week on my time sheet.  You may see where this is going…\n\nThe fateful day comes when BM actually pulls the door logs and 2 of our engineers get a talking to about their time in the building and how claiming 40 hours without being there for 40 is fraud.  I was upset by this because everybody that was left was working very hard and the two guys BM had confronted had been working on COOP projects at our offsite location for years so unless he pulled those logs as well, he didn’t, they would be short.  So what did I do?\n\nI stopped by BM’s office and asked what my door totals were.  He told me I was fine and not to worry about it.  I told him I just wanted to be sure my time-in matched my timesheet as I didn’t want to get caught in timesheet fraud.  Again, he said not to worry about it so I headed down to see my buddy Tony in security and he pulled my logs for me.\n\nNext week I walked in BMs office, closed the door, and told him I had a problem.  I had pulled my door logs and over the last 4 years I had averaged almost 44 hours a week in the office but had only ever charged 40!  I had almost 800 hours of unreported labor and didn’t know what to do about that.  He told me not to worry about it, it wasn’t a big deal.\n\nNext step I contacted our company rep and explained the situation to her.  She did not think it wasn’t a big deal.\n\nIn the end I signed a NDA but BM got removed from his role, I bought our whole team beers and lunch, and a memo went out to the team telling us specifically to charge what we worked even if it had some overtime.",
        "created_utc": 1674916311,
        "upvote_ratio": 1.0
    },
    {
        "title": "MC Bossy big sister edition",
        "author": "Noobinoa",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/10nbxvc/mc_bossy_big_sister_edition/",
        "text": "When my sister and I were teenagers, she liked to boss me around because she was older. She was always ordering me to do things or get things for her. Several times a day, it was water, \"get me a glass of ice water!\" \n\nOur folks often had parties, and occasionally that meant lots of crushed ice left over the next day. On one of those days that there was a lot of crushed ice in the freezer, she made her usual demand. \n\nI brought her a glass with one tiny ice cube and a tiny bit of water. She yelled at me to go get her a glass of ice water and it better be full, with lots of ice!\n\nYeah, I was ready for that. I rammed as much crushed ice as could fit in the glass, and just enough water to melt it and freeze together.\n\nI took it to her, and got rewarded with seeing her try to drink the water, tipping the glass almost upside-down and barely getting a mouthful.\n\nShe screamed at me while I laughed!",
        "created_utc": 1674901327,
        "upvote_ratio": 1.0
    },
    {
        "title": "You want me to go home? Alright.",
        "author": "McdonaldsShowerFries",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/10nauhu/you_want_me_to_go_home_alright/",
        "text": "[removed]",
        "created_utc": 1674897185,
        "upvote_ratio": 1.0
    },
    {
        "title": "Attendance Policy",
        "author": "Outrageous_Jacket933",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/10n8zv8/attendance_policy/",
        "text": "I’ve been working for small Railroad company for almost 5 years and they recently updated the attendance policy for being late. If you are  even one minute late, you will be charged half a sick day. If you are anymore than 2 hrs late, you are charged a full sick day.\n\nOne day while headed to work I called ahead and informed my Train Master that I’m going to be 5 minutes late due to a major traffic accident. Because of the new policy he was going to charge me half a sick day. I argued that I had never been late before and that I should be exempt for calling ahead for a mere 5 minutes.\n\nThe stubborn train master was not persuaded  and insisted he was gonna charge me half a sick day. My response “ok. I’ll be there in 2 hours”",
        "created_utc": 1674890058,
        "upvote_ratio": 1.0
    },
    {
        "title": "I Poured Water On Someone I Used To Be Freinds With",
        "author": "ameliexxxx",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/10n7ynw/i_poured_water_on_someone_i_used_to_be_freinds/",
        "text": "[removed]",
        "created_utc": 1674886340,
        "upvote_ratio": 1.0
    },
    {
        "title": "Micromanaging Job Interviews",
        "author": "Significant_Wall_607",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/10n776o/micromanaging_job_interviews/",
        "text": "It doesn't matter how qualified, educated, experienced, skilled or talented a person is.... Say one incorrect thing during a job interview and you will get written off just as quick as a snap of a finger... That's what happened to me.\nI didn't use the technical term the manager was looking for when asked to describe a process... Interview over.... Job shot... Next",
        "created_utc": 1674883686,
        "upvote_ratio": 1.0
    },
    {
        "title": "They want us to pay the tax on our hotels, we started checking out over 30 days..",
        "author": "Bobby_Rage41",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/10n6c0q/they_want_us_to_pay_the_tax_on_our_hotels_we/",
        "text": "So this has multiple  layers. Follow me on this journey\n\nSo I work for a defense contractor,  it's one of the big 3. We are based in Guam, but in Florida for Training until the summer.  We are all in hotels and here we are a few months into out trip and all the sudden the person doing our expense reports keeps kicking them back. Now we are incuring late fees which we all refuse to pay. \n\nShe is saying that after 30 days we are responsible for the tax on the rooms which is $13 a day, almost $400 a month. In our contract the company has stated they will pay for a trip to our home of record once a month, which none of us have been doing because we have been so busy...here comes the MC....\n\nNow we are all scheduling trips home each month to break up the 30 days so we don't pay the tax on the hotel, while the company is now paying for flights to our homes of record. One guy is from Guam and his tickets are almost $2,000 for round trip. So now it's costing them another 700-2000 for flights each month. \n\nIn another instance years ago coming home from Japan, my flight had an 8hr layover in Tokyo.  I found a flight that was shorter but cost $200 more. They rejected it because it wasn't the lowest fare available.  I'm paid doorstep to doorstep when I travel, meaning I'm on the clock from when I leave my house until I get to my hotel at my final destination. Many of these travel days end up being around 23hrs . I thought the company would be cool with me saving them 8hrs of me on the clock, but nope. Ok then...13 hours of double time at $100 an hr, so $1300 over a $200 price difference.  I'll take all that money. \n\nThe people who write these contracts really don't think shit through.",
        "created_utc": 1674880883,
        "upvote_ratio": 1.0
    },
    {
        "title": "Yup, sure. Don't listen to the guy who operates the machinery. F around and find out, I guess.",
        "author": "Bambuskus505",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/10n6ba7/yup_sure_dont_listen_to_the_guy_who_operates_the/",
        "text": "So I work in a Metal Fabrication Plant. We build all sorts of stuff there, but mostly we build elevator and farming equipment parts. I'm stationed in the Finishing department where we do powder coating, and my job is to operate a large industrial oven that melts the powder coat into a solid coat. *However,* our system is... sub-par at best. There are so many little things wrong with everything that, if fixed, would make our whole area ***SO*** much more efficient. One problem we constantly keep running into is cross contamination. Part A is supposed to be *x* color, but because Part B was also being coated with *y* color, they both come out of the oven all speckled and gross. Some companies we work with couldn't care less, but we have two companies who are ***really*** picky about how the parts look when they're finished. \n\nOne day, we had come in for overtime on a Saturday, and I noticed that the speckle problem was especially bad, and so I started looking for the cause, as all of those parts now had to be redone, and the goal of catching up for the next week had now been ruined. At first, I thought my oven was dirty, but that couldn't have been it, because I cleaned it that morning, and had done a thorough deep clean a few days prior. Then I thought maybe the parts had been sitting beside the oven for too long while I waited for space to put them in, but that typically wasn't an issue, so I put that one on hold. Then I thought maybe I had put them too close together, so I decided to let one color cycle all the way through the oven before putting in the next color, *but it **still** came out speckled...* At this point, I knew it couldn't have been something I was doing wrong, so I went over to the powder coating area to investigate, and I immediately found the problem. They were using both booths at the same time, coating two different colors, and there was an air current blowing yellow powder into the black powder booth. Mystery solved. I immediately notified my supervisor about what was happening, and told her we probably shouldn't be coating two different colors at the same time, because all of the parts are coming out bad. But she told me that there was no way that was the issue, and that it had to be something I was doing wrong... but I had just checked everything that had previously been a cause of speckles, and I knew for a fact that this couldn't be the case. So I hatched up a plan. I waited until the oven was completely empty again, and I pulled her aside and said. \"Alright. You see that? The oven is completely empty, and you **watched** me clean it this morning. So you and I are gonna do a little wager. I bet you **this weeks entire paycheck**, that even though there are absolutely no yellow parts currently inside that oven, that these black parts are gonna come out yellow anyways. And they'll be coming straight from the booth. they won't be sitting out exposed to any debris... they'll just go straight in, and they'll still be yellow anyways.\"\n\nShe thought this idea was absolutely ridiculous, and saw absolutely no reason how she could ever be wrong, despite the fact that she knows nothing about how the oven system works... and she took the bet. \n\n45 minutes later, the parts come out, and whadaya know... the black came out yellow. Turns out that sometimes the people who operate the machinery know more about said machinery than those who have never touched it.\n\n**TL;DR:** My supervisor thought I was doing my job wrong, I bet her the entire next paycheck that I was actually right, she took the bait and I won.",
        "created_utc": 1674880820,
        "upvote_ratio": 1.0
    },
    {
        "title": "\"I rejected your estimate!\" Ok ma'am",
        "author": "plogan56",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/10n34o3/i_rejected_your_estimate_ok_maam/",
        "text": "For context: the software development company i intern at uses a special sheet to estimate the cost of building a certain software for a client. This sheet includes: employees working on the project, how long they estimate it'll take, yada yada yada. After an intern goes around the departments collecting this info from the various employees we then calculate the cost &amp; send it to the client to \"accept\" or \"reject\".\n\nSo the day was slow &amp; they mostly had me man the phones and go on coffee runs, typical intern stuff; then a client calls in saying she wants a piece of \"Clock in\" software for her employees so she can more accuarately track their work hours. By this point into my internship, i had done at least 4-5 of these sheets at least and i was taught by my supervisor how to identify which departments would be needed for which projects so after gathering the details from the client i hang up and translate the needs for the employees(essentially explain it in programmer jargon).\n\nHalf an hour later, i'm done with the sheet &amp; i have checked the calculations 3 times so i email it to the client and i swear not even 2 minutes later i get a \"Estimate Rejected\" message on the company smartphone i was given. She added a reply stating \"This estimate is non compiable with me\" so i respond to it with \"We are sorry to hear that ma'am, please enjoy the rest of your day\" and then i go about my business. Roughly an hour later she emails the phone again asking \"is that all you have to say?\" By this point i realized what she was trying to do and report to my supervisor that ms.karen was trying to haggle the price.\n\nMy supervisor calls Karen's phone and asks if she would like to have the estimate resent to her so she can accept &amp; Karens outright tells her she wants a cheaper price; to which my supervisor tells her the price is non-negotiable and to take it as is, so Karen uses her signature move of \"let me speak with your manager, but my supervisor simply informed her that she'd get the same response and just hung up on her.\n\n Karen eventually did call back and even showed up to the building to \"renegotiate\" the price but was shot down everytime &amp; she evetually stopped.",
        "created_utc": 1674871380,
        "upvote_ratio": 1.0
    },
    {
        "title": "Hold a \"Spring Festival Gala\"? Guo Wengui will be a demon again!",
        "author": "Unusual_Toe_9754",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/10n2lv6/hold_a_spring_festival_gala_guo_wengui_will_be_a/",
        "text": "[removed]",
        "created_utc": 1674869933,
        "upvote_ratio": 1.0
    },
    {
        "title": "Travel Policy Unintended Consequences - Part 2",
        "author": "NPHighview",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/10mztsx/travel_policy_unintended_consequences_part_2/",
        "text": "I worked in a Fortune 100 company in a lower-level management position, and led a group providing IT and analytical services for projects both at headquarters and at the regional headquarters on another continent. Part of the project involved days-long sessions with people at the regional headquarters, and time-zone differences made videoconference-based meetings impractical, requiring travel and physical presence instead. Organizing meetings on my end was simple. This was our responsibility, high priority, so we'd do it whenever convenient for the staff at Regional HQ.  \n\nOK - meeting set up and scheduled.  I made airline reservations, Business Class (same travel policy for intercontinental travel as my other posting).  Oops - Regional folks can't make the meeting they agreed to, but re-scheduled for two weeks later.\n\nThis happens twice more. Finally their management gets involved and says \"hold the damn meeting!\" Flights get rescheduled yet again, but by now, rescheduling penalties have pushed the total ticket cost above the First Class fare, so my team and I get first class tickets from our city to our destination, and back. Nice!",
        "created_utc": 1674862767,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can't talk? Sure.",
        "author": "Old_Try4801",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/10mw0gc/cant_talk_sure/",
        "text": "[removed]",
        "created_utc": 1674853452,
        "upvote_ratio": 1.0
    },
    {
        "title": "Manager wanted me to file false First Aid report...So I withdrew from duty roster",
        "author": "canadabushguy",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/10mvakt/manager_wanted_me_to_file_false_first_aid/",
        "text": "Well here's one. I had a manager in a grocery dept I worked. This guy was something else, had been there since he was a young guy, and was \"large and in charge\" and got away with a lot of BS. He was a workplace bully,and really had a target on me, but would also lay it on others, getting the young kids who worked there to be \"{his little slaves, I work 'em hard\" were his words once! \n\nI have many many stories of that department/store I could write a book, so I'll cut to the chase!\n\nOne day, on one of his tirades against management because they told him to do his job, and he was venting at me. He was threatening to quit, calling his boss all sorts of nasty, and being a show... He says to me, \"I am just going to pull the wrong pallet, and hurt my back! I'[ll get you to fill out the report, and I'm out of here!!\"  Now, I was enjoying seeing him melt down, but when he said that, I just went along with him, empathy, sympathy, apathy and all the lip service... But, I knew him, his games and I kept what he said in my mind. I also went to the Management upstairs, and asked to be taken off the First Aid duty sheet, I told them that due to all the calls I was handling, I needed a break for a bit, and let the younger guys get some action.. (I was Level 3 with experience, so everyone would bypass other F.A.'s and call me... which really pissed my manager off!!\"\n\n Some months after, I came in for my closing shift, around noon. Mr manager comes to me, all sad and doe-eyed...\"I hurt my back this morning, and I need your help, can you write up a report!\"...He tells me that he (surprise!!) pulled a pallet, and hurt his back.. at 7:30 that morning. A golden gift was given to me that day!! I told him  I was sorry, I was off the duty roster, and he would need to call one of the other attendants...\n\n Well, I heard him sputter, and I saw that look on his face... I can't describe it, but it was like he had been deflated...utterly deflated that he couldn't get a visit from the \"compensation fairy\"!!! If that had been a real emergency, he should have reported it right away, and it would affect any claims he put in for comp...And the \n\n Had he or anyone got injured for real, I would have jumped in to help, but I'm not risking my job, my First Aid cert, or a criminal charge just so that someone, especially that bozo, could have a bit of time on Easy Street.\n\nI know this has been long winded, my first real post, but I greatly enjoyed that moment, and will remember it with a smile!",
        "created_utc": 1674851678,
        "upvote_ratio": 1.0
    },
    {
        "title": "Delete me from my own systems, enjoy doing my work.",
        "author": "HInesDawg",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/10muzy9/delete_me_from_my_own_systems_enjoy_doing_my_work/",
        "text": "Malicious compliance seen at work not 30 minutes ago.\n\nNew position in an organization that has been managed loosely and are getting poor results as a reason. Thus they hire me to fix things.\n\nI start with traditional stuff but quickly realize there are further issues with reporting and lead generation. Create some easy reports showing the sales team isn't getting the help they need, received extremely well.\n\nToday I come in to look at efficacy of leads but I don't have access to the reports as they are in an old phone system that my boss administered and maintained. However when he tries to login he has no account..\n\nI'm told to escalate to the IT director, since that's who removed my bosses permissions. Junior IT person comes over with a laptop to let me get what I need.  But I have no idea how to get that data as I've never used the system. I send the it person to my boss, who could pull it in 30 seconds, but he declined.\n\n\"If they are going to pull my access, they can do the work\". 1 quick text to ownership and I have an email from the IT director telling me it will take time to generate that report, but he will be over to help me this afternoon...\n\nI'm at lunch salivating over what that conversation will be like between my boss and head of IT.. should make a slow Friday afternoon spicy!",
        "created_utc": 1674850952,
        "upvote_ratio": 1.0
    },
    {
        "title": "Expected me to work 2 hrs a day for free",
        "author": "decidedly_confused_",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/10mub8f/expected_me_to_work_2_hrs_a_day_for_free/",
        "text": "I worked in a 40 hr / 8-5 job where I was looked badly at if i left the office at 6 since that was the latest I could pick my son up from daycare. When I informed them that I was pregnant with my second child I requested that that upon returning from maternity leave I would need a schedule working 30 hrs from the office and 10 from home. If this was not doable for them I would resign at the end of my pregnancy and not accept maternity benefits from them. (Where I live if you accept maternity leave you are then tied to the company for 6 months upon returning to work). The company had too much turn over of staff and was finding it extremely difficult to employ new people as it was steadily gaining a reputation for how staff is treated, so they accepted.  One week before ending my maternity I am called in by HR to sign an agreement stating that in order to be able to work 10 hours from home I was then required to work an additional 10 hours a week on call over and above the 40 hours. When asked if I would be reimbursed for that time they said that I would receive a 20 eur allowance per month to cover using my phone during those 10 hours. Needless to say I refused the agreement and the phone allowance and told them that from that day onwards unless they paid me overtime rates I wouldn't stay a minute after my time and would disconnect on anyone who called me work related on my phone. If they wanted me to be available on the phone they had to provide one even during work hours when I was working out of the office. I ended up making much more money because I then claimed every minute of overtime. Needless to say on the 5th month from returing from maternity leave I informed them that the day my 6 months tied to the company was over I was resigning at the busiest time of the year for the business.",
        "created_utc": 1674849314,
        "upvote_ratio": 1.0
    },
    {
        "title": "Move all the furniture to get new carpet",
        "author": "DragonBard_Z",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/10mtj1r/move_all_the_furniture_to_get_new_carpet/",
        "text": "I don't like moving, I've never not paid a bill on time,  and I take decent care of things because I don't like living in a place that's a shithole. My SO is tidy and responsible as well.  I'm the one who deals with things like leases in the relationship but he's happy to go along or push issues if needed. \n\nBecause of this,  we make a pretty good and loyal tenants.  So much so that our most recent landlord regularly praised us as his least annoying tenants, and during the pandemic when house prices were going up offered to sell us the house at a discount (more than he paid by a lot, but a lot less than adjacent houses were selling and we're still well ahead at the current market).\n\nAnyway, 15 years ago, (the place before this) I moved into an apartment with my S.O. for about $700/ month.  It was 2 bedroom and had huge closets...so big I threatened to make a guest room out of one for my mom when she visited since I was pretty sure I could fit a twin bed in. (That got vetoed).   It was pretty decent but the carpet was some super cheap stuff that was only meant to last 3-5 years since they replacned it after every move out.\n\nNo big complaints for the first 4 or so years. There were some roaches thanks to neighbors but they dealt with it and the water heater broke in the closet but I didn't have anything too important there and they fixed the damage from that too.\n\nMeanwhile, the rent went up every year. Plus there were added fees for upgrades. We agreed to pay for access to the new gym...for a monthly fee. I got a shaded parking spot...for a monthly fee. We got a cat and paid additional pet rent. Whatever, but I was up to about $900/ month by year 4.\n\nThe 5th year was ending and the carpet was indeed looking a bit rough.  I'd paid myself to have it cleaned twice but it was wearing. So when it came time to renew the lease, I mentioned it and they said they'd look into replacing it for me,  so I signed. \n\nI did remind them a few times that year and so did my SO...he got them to give us another carpet cleaning for free but no action.\n\nEnd of year 6... this time I say we need them to replace the carpet and that I'll move the furniture from each room as they're ready.  They verbally agree and I sign. \n\nNo action. I remind them and they tell me they can't do one room at a time... they can only do it all at once and I'll have to move out all my furniture. They can rent us another apartment in the building that's for short term  use for a couple of weeks for like $500...what?!\n\nI know that's a lie that they can't do one room at a time.  Not only does that not make sense but remember when the water heater broke? It ruined the carpet in the closet and mold grew since it took about 2 days to notice.  They had come in and replaced the carpet... only in that closet.  Plus they HAD verbally agreed. \n\nGot another carpet cleaning.\n\nEnd of year 7.  New management.\n\nI told them about the prior years and they made lots of understanding noises and said ofc they could replace the carpet given it'd been so long compared to the other units (it was near a military base...most tenants stayed just a year or two.)  I wrote that on the contract which they didn't like but we all signed for another year... rent is now about $1100.\n\nSo about a month later I remind them. \n\nSomehow I get the same story as the old management had that sure they can only do it, and will honor what was on the agreement that I wrote on but only if they do it all at once and we move out all the furniture for a week or two. Um... what?\n\nThis time I don't even get an offer to rent a second apartment to temp move into. \n\nTry again later that year, same answer.  I warn them if I have to move all my furniture out to get new carpet, I won't be moving it back in.\n\nNearing the end of year 7.  The lease renews in Feb, renewal due in January. December, my SO starts looking at houses for rent and we start checking them out on the weekends.   Because why not?  We find a nice 4 bedroom for only $1150/ month ($50 over my current place for close to 2x the space) and spend a few weeks moving in. And guess what? It has brand new high quality carpet. \n\nThe last day to renew my lease or give move out notice comes.  We give notice.\n\nImmediately I get asked why we're leaving and what they can do to make us stay? \n\nI bring up I've been here 8 years and the last 3 was promised new carpet and ended up being told I could only have it if I moved all my furniture. \n\nThey had the gall to claim they were under new management (again!!) and hated to lose a good tenant that was one of their longest. They'd knock some fees off the rent and would absolutely replace the carpet (sure...)\n\n I told them we'd already moved most of the furniture out, would finish by the end of the month,  and they could do the carpet whenever they'd like because I no longer cared.\n\nThey even gave me an offer in writing a week later that included 2 months free on the next lease,  but we were already very much enjoying our nice new place. \n\nAs promised, if we had to move all the furniture somewhere else to get new carpet,  we would not be moving it back. I only wish I'd made and kept that that sooner.",
        "created_utc": 1674847464,
        "upvote_ratio": 1.0
    },
    {
        "title": "classic time theft",
        "author": "iggyphi",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/10mtcju/classic_time_theft/",
        "text": "no really malicious, probably more anti work.\n\nAfter working at mcdonalds a few weeks i'm put on the closing shift with another coworker and a manager. a pushover kid and a selfish adult. After the store closes there is about minutes of work left before we can leave, this includes waiting for the computer system to run its stuff and the manager to log it. to do that the workers need to be clocked out, which usually happens after our work is done.\n\nbut this manager had been clocking out the workers while they were still working so they can finish faster.\n\nI noticed the computers turned off while mopping the floor and asked if she clocked us out, she said yes and tried to make it sound like she was doing us a favor by getting us home early. I have no idea how long this had been going on, the other kid had been doing this for a while. I said i guess im done working and dropped my mop to sit in the lobby and wait for the paperwork to finish. it took a minute but eventually the other kid realized what was right and joined me in the lobby.\n\nthe manager did try and complain higher up, but was obviously told she was wrong. i wasn't put on night shift anymore and i hope that other kid stopped putting up with her bullshit",
        "created_utc": 1674847055,
        "upvote_ratio": 1.0
    },
    {
        "title": "Don't get in my way if you know what's good for you! Sir, yes sir.",
        "author": "SkyrakerBeyond",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/10mrx0e/dont_get_in_my_way_if_you_know_whats_good_for_you/",
        "text": "[removed]",
        "created_utc": 1674843719,
        "upvote_ratio": 1.0
    },
    {
        "title": "Not allowed to work from home so I don’t",
        "author": "The379thHero",
        "url": "/r/antiwork/comments/10lympc/not_allowed_to_work_from_home_so_i_dont/",
        "text": "",
        "created_utc": 1674841666,
        "upvote_ratio": 1.0
    },
    {
        "title": "Size Doesn’t Matter",
        "author": "ItchyRedBump",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/10mopot/size_doesnt_matter/",
        "text": "This happened about 5 years ago and I was just reminded of it today.  I thought that I’d share.\n\nThe cafe near an old job used to sell overpriced 12-oz drinks.  The location was convenient, so I usually bought from there anyways.  One week, they ran out of 12-oz cups and started using 8-oz cups instead.  I asked for a discount, but was told the size of the cup didn’t matter as long as it was filled to the top.\n\nCue compliance: I bought a 32-oz ceramic cup and brought it the next day.  After purchasing the drink a gave the barista the cup.  He looked at me, looked at the cup, and stared me straight in the eyes for 30 seconds.  Then he filled the cup to the top and gave it back to me without saying a word.  The next day the 12-oz cups were back.",
        "created_utc": 1674836083,
        "upvote_ratio": 1.0
    },
    {
        "title": "The principal of the school asked everyone to be 30 min early for the exam. She paid the overtime and had to do monitor students herself.",
        "author": "Djorgal",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/10mojrx/the_principal_of_the_school_asked_everyone_to_be/",
        "text": "[removed]",
        "created_utc": 1674835681,
        "upvote_ratio": 1.0
    },
    {
        "title": "Thanks, but I don't need my script",
        "author": "Clayith13",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/10moff4/thanks_but_i_dont_need_my_script/",
        "text": "I was a theater kid back in high school, and our program was overall surprisingly good. We usually had decent sized budgets, and my junior and senior year we sold out almost every show we performed. A lot of our success came from an extremely hard working director who was really good at motivating us to try new things and take risks. The Stage Manager (SM), who was a student, decided it was actually her that kept the place running, and decided she wanted to start imposing rules. These rules were conveniently only ever enforced before the director arrived (director was a teacher who would frequently stay late in her classroom to help students who were struggling cuz she's a legend like that.) \n\nThey weren't very major at first: no eating in the theater, be onstage for warm ups when start time rolls around, etc. Then, she suddenly had the brilliant idea of punishing us if we left anything in the theater. Any sweatshirts, bags, or even schoolwork that got left in the theater overnight became \"hers.\"\n\nA few weeks into a show my senior year, she made the rule that \"any scripts left in the theater overnight become mine until you pay me $5.\" Yes, a student decided to start taking others scripts that got left in the rehearsal space (you know, so we could rehearse with them) and holding them for ransom. She probably made about $20 before I left my script in the theater one night. Cue malicious compliance.\n\nNext day, she comes to me holding my script, holds out her other hand, and says \"where's my money?\" I reply \"oh nah you can keep that, I don't carry cash.\" SM got confused, \"but you need your script, how are you going to read your lines and learn your blocking without your script?\" \"I honestly don't think I need it, I'm pretty sure I have all my lines memorized.\" She says \"fine, your funeral\" and walks away.\n\nWhile I was good at memorizing lines, I knew I was not completely memorized yet, and she was right, I probably couldn't learn my blocking without taking notes in my script. The director arrives, and we begin working on a scene. I think the SM told Director I was off book, but didn't specify why, so when I started to mess up lines, she says \"just go get your script, you have three more weeks until you need to be memorized.\" \n\n\"Oh, well SM took my script, and I don't have the $5 to pay her for it.\"\n\nWHAT??\n\n\"Yeah, I left it in the theater last night, and her rule is I can't get it back unless I pay her $5.\" \n\nSM is beet red, and director asks her what the fuck I'm talking about. SM tries to explain her rule, and says she didn't actually want to enforce it, but since I said I was off script she just kept it. Three other students pipe up pretty quickly stating that she had indeed charged them $5 for their scripts. Director sends her home, gives me my script, and we move on. The real kicker was that SM was genuinely surprised her rule wasn't law, and that she wasn't allowed to charge other students money for their own belongings.",
        "created_utc": 1674835378,
        "upvote_ratio": 1.0
    },
    {
        "title": "Boss says \"If you're 1 minute late I'm docking 15 minutes from your time\" gets mad when I don't work the 15 minutes I was docked for free.",
        "author": "Righthandedranger",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/10mmqix/boss_says_if_youre_1_minute_late_im_docking_15/",
        "text": "Posted this in another sub and got told to try it here too.\n\nThis happened about 4 years ago. I do construction and we start fairly early. Boss got tired of people walking in at 6:05 or 6:03 when we start at 6:00 (even though he was a few minutes late more consistently than any one of us were), so he said \"If you aren't standing in front of me at 6 o'clock when we start then I'm docking 15 minutes from your time for the day.\"\n\nThe next day I accidentally forgot my tape measure in my car and had to walk back across the jobsite to grab it, made it inside at 6:0. Boss chewed me out and told me he was serious yesterday and docked me 15 minutes. So I took all my tools off right there and sat down on a bucket. He asked why I wasn't getting to work and I said \"I'm not getting paid until 6:15 so I'm not doing any work until 6:15. I enjoy what I do but I don't do it for free.\"\n\nHe tried to argue with me about it until I said \"If you're telling me to work without paying me then that's against the law. You really wanna open the company and yourself up to that kind of risk? Maybe I'm the kind to sue, maybe I'm not, but if you keep on telling me to work after you docked my time then we're gonna find out one way or the other.\"\n\nHe shut up pretty quickly after that and everyone else saw me do it and him cave, so now they weren't gonna take his crap either. Over the next few days guys that would have been 1 or 2 minutes late just texted the boss \"Hey, sorry boss. Would have been there at 6:02 and gotten docked, so I'll see you at 6:15 and I'll get to work then.\" and then sat in their cars until 6:15 and came in when their time started.\n\nSo between people doing what I did or just staying in their cars instead, he lost a TON of productivity and morale because he decided that losing 15 minutes of productivity per person and feeling like a Big Man was better than losing literally 1 or 2 minutes of productivity. Even though everyone stands around BS-ing and getting material together for the day until about 6:10 anyway.\n\nAfter a few weeks of that he got chewed out by his boss over the loss of productivity and how bad the docked time sheets were looking and reflecting poorly on him as a leader because we were missing deadlines over it and it \"Showed that he doesnt know how to manage his people.\", and then suddenly his little self implemented policy was gone and we all worked like we were supposed to and caught back up fairly quickly.\n\nWorker solidarity for the win. Not one person took his crap and worked that time for free after he tried to swing his weight around on them.\n\nBut obviously I was a target after that and only made it two more months before he had stacked up enough BS reasons to get away with firing me when I called in a few days in a row after my mom fell and I took off work to take care of her and monitor her for a while during the day.\n\nTL;DR- Boss told me because I was 1 minute late he was taking 15 minutes off of my time, so I didn't work for 15 minutes. People saw me and I accidentally triggered a wave of malicious compliance in my coworkers and the boss got chewed out over it.",
        "created_utc": 1674831229,
        "upvote_ratio": 1.0
    },
    {
        "title": "Talk to every rejected applicant? Well, of course you may!",
        "author": "Still-Tonight-3935",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/10mmplx/talk_to_every_rejected_applicant_well_of_course/",
        "text": "I work in a recruitment capacity for the military (not US). I like my job, for even though I am bodily impaired I can serve in an important position. In my line of work I interview a lot of great, highly motivated and skilled people. Unfortunately a lot of strange individuals are drawn to the military too, and it's my job to weed out the worst for the safety of everyone else.\n\n\nEnter my new boss (pre-Corona). His promotion is - among other things - dependent upon filling open positions quickly and producing few complaints. \n\n\nBefore inviting applicants to an interview we usually do a thorough background check and screening of cv. So one of the first decisions he made was to veto each and every screening rejection without even looking at it. He has no background in HR or psychology and so held firm on this despite being advised that this would cause our complaints to rise.\n\n\nUnsurprisingly our rejections in person rose and the complaints of the rejected applicants did too. So his next decision was for us to bring every disappointed applicant to him to calm down for he thought he would be better at it than trained psychologists.\n\n(Let me add that I am known among my colleagues for being friendly and curteous. If I get a complaint you can bet it wasn't because I have been rude or didn't try to exhaust every option. Having 4 kids myself and years of work experience in HR, education, rehab, psychiatric and forensic settings, I can get along with people of all walks of life respectfully.)\n\n\nYou want to see every reject, boss? Every single one? \n\n😁 You got it.\n\n\nThe racist a*hole I found on pictures of illegal demonstrations sporting swastikas? You bet.\n\nThe drunken guy that reeked so badly I became dizzy just being in the same room? Come along pal!\n\nThe very loud and very angry convict who was on day-release from doing his sentence for grievous bodily harm at that time? Absolutely.\n\nThe dedicated homophobe? Sure. (Brought him to my boss's office right away where a big picture of his husband and himself was prominently displayed.)\n\nThe blubbering depressive who couldn't stop crying and had her eyes swollen shut and snot hanging on her sweater? I sure did. (And I might have used the opportunity to revisit that budget cut for office tissues.)\n\n\nIt took only a couple of days for my colleagues to follow my lead as I shared how helpful the chefs input was (not arguing with the applicants myself got me a lot more time for coffee) and how magnificently he stopped the complaints (against me...hehe). We are talking about about 2 to 4 people a day. Took half his workday. Every day.\n\n\nOrders changed again after 2 weeks. No more talking to the boss after that. And no more vetoing our screening choices.\n\nWe got along splendidly ever since.",
        "created_utc": 1674831159,
        "upvote_ratio": 1.0
    },
    {
        "title": "Am i a bad person for killing bird?",
        "author": "HotExtension01",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/10mjegc/am_i_a_bad_person_for_killing_bird/",
        "text": "[removed]",
        "created_utc": 1674821747,
        "upvote_ratio": 1.0
    },
    {
        "title": "I was told to smile more, so I did",
        "author": "greyest",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/10mg94n/i_was_told_to_smile_more_so_i_did/",
        "text": "A few years ago, a group of three coworkers who always talked to each other called out to me as I was about to leave my cubicle at the end of the workday. I don't regularly work with them, but knew their names from meetings and email chains. One of them said: \"Hey greyest! You dropped something.\"\n\n\"Oh, what?\" I'd been concentrating on something.\n\n\"Your smile!\" All three of them were looking at me and smiling themselves. Ah, ok. I nodded and they walked past me. I ran into them a few minutes later outside the building. I decided I'd smile brightly this time and look into each of their eyes. Happily, but like, turned up to 11. Either I'd fool them or creep them out, probably the latter, and either was a win for me.\n\n\"You're...smiling now,\" one of them noted as we crossed paths, and I chirped back at them: \"Yes! I am! Have a good one!!\" as I passed them while walking to my car.\n\nThen went back to normal afterwards. Anyways I hate being passive-aggressive, except in this case I gave them exactly what they wanted, and they never asked me to smile again after that.",
        "created_utc": 1674809203,
        "upvote_ratio": 1.0
    },
    {
        "title": "Force me to have a retirement ceremony, ok sure.",
        "author": "devoduder",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/10meiem/force_me_to_have_a_retirement_ceremony_ok_sure/",
        "text": "I was retiring from a 20 year career in the US military and that typically involves a retirement ceremony with speeches, medals, and cake. I never planned on a retirement ceremony but as the months got closer, my boss (didn’t really care for him) keep bugging me for details about my retirement ceremony and I kept saying I’d get to it.  \n\nI finally told him I wasn’t having a ceremony and he flipped out and said I HAD to have one, I rolled my eyes and said I’d set something up. Now, I was retiring from a base in California and we’d planned a summer road trip to see friends in Colorado so I came up with a plan and made some calls. \n\nA month before I left active duty and my boss kept harping on me for ceremony details and I said invites were going out that week. That day I sent a formal retirement invite to my entire California unit to a ceremony in Colorado. Ten seconds after I hit send my boss was screaming my name “Why the HELL is your ceremony in Colorado?” “Sir, you said I had to have one, you didn’t say where. You are more than welcome to take leave and attend.” He didn’t and my retirement ceremony was a bbq in Hawaiian shirt and mini medals.",
        "created_utc": 1674802161,
        "upvote_ratio": 1.0
    },
    {
        "title": "Not allowed to work from home so I don’t",
        "author": "Loud_Adagio2222",
        "url": "/r/antiwork/comments/10lympc/not_allowed_to_work_from_home_so_i_dont/",
        "text": "",
        "created_utc": 1674800288,
        "upvote_ratio": 1.0
    },
    {
        "title": "WELL, YOU JUST BRING BACK THE JEEP!",
        "author": "aquelviejitocochino",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/10mclhq/well_you_just_bring_back_the_jeep/",
        "text": "First time post and I'll try to make it as brief as possible.  This happened over 20 years ago.\n\nI had just pulled myself up from a long, drawn-out and draining divorce.  To get my spirits up I thought about getting a toy and decided on a new Jeep.  I shopped around and found one that I really liked.  Just prior to me picking it up I had the dealership trick it up with large wheels &amp; tires, tube bumpers, light bar, etc.  When I picked it up, it really looked like one of those remote-control trucks that youngsters get at Christmas.  It soooo looked like a toy but only for adults like me.  The salesman at first was great and although we haggled a bit, we both knew he was going to get his percentage from the accessories I asked for.  I traded in an SUV that I had when I was married and was happy to part with it--might as well divorce from my SUV, too.   Nevertheless, I drove away happy and I thought the salesman and the dealership was, too.\n\nIt wasn't but a couple of days later that I received a call from the dealership.  The manager called me telling me that while they did take my car in trade it was on the condition that it could be sold to a wholesaler.  I informed him that this was never brought to my attention and never discussed when I signed the contract.  He responded by telling me that it was the salesman's fault for not telling me and that he should have known better.\n\nWe argued for a good 5 minutes on the phone while I simultaneously scanned through the copy of my sale documents.  I didn't see anything regarding a wholesaler and nicely told him to pound sand.  We went back and forth until his response was \"WELL, YOU JUST BRING BACK THE JEEP!\"\n\nFor a few minutes I thought I had somehow been fucked.  My ex screwed my credit so I had to get the the Jeep dealer financed.  During our terse conversation, I remember him saying something about cancelling my credit and the entire sale.  My first thought was they're doing something shady or criminal and I called my divorce attorney who directed me to one of his comrades in the DA's office.  \n\nThe guy in the DA's office told me that the dealership was owned by a well-known affluent member of the community and because it was election season, I was shit outta luck.  It just so happened that the affluent member was a big contributor to the DA.  He also told me just return the Jeep and get another one from someone else.  \n\nI was disheartened.  Just a couple of weeks ago I had to part with a number of things to an ex-wife and now I had to give up this, too.  I also believed that my credit would be screwed even further because of this deal falling through.  And to top it off, I had already showed it to a chic I was interested in and made plans to go camping with it.  FML!\n\nI was still feeling mopey until the dealership called me and left a message expecting the Jeep back by the weekend.  Listening to the message again I could still hear the manager telling me \"WELL, YOU JUST BRING BACK THE JEEP.\"\n\nNow I was pissed.  OK...I'll bring the Jeep back. \n\nBefore any of you start thinking that I was going to trash it out or put a kajillion miles on it let me first say that I had at the time a sensitive and high-profile job.  I couldn't do stuff like that.  Besides, I had been through a lot and aside from buying the Jeep all I wanted to do was crawl into a hole and keep a low profile.  The last thing I needed was Mr. Affluent-Member-of-the-Community calling my boss and complaining about me trashing his car.  I wasn't going to do anything malicious and like the DA guy said just take my business elsewhere.\n\nI went to another dealership just on the other side of town.  I found another Jeep that I wanted and negotiated a good deal.  Things were getting better.  While waiting for loan approval I just began to make small talk with the young salesman.  It wasn't solicited and I didn't tell him about my previous ordeal.  Nevertheless, the salesman told me that he used to work at the aforementioned dealership and directly for Mr. Affluent Member.  He also told me that they parted rather curtly after him being called a shitty salesman and irresponsible.  It so happened that at his previous job he misplaced a set of keys.  He was fired for it, but not until after he was called a shitty salesman and the cost of the keys taken out of his final check.  I could tell that still he hadn't gotten over his previous experience--much like me.   \n \n\nI then told him about what happened to me.  His eyes lit up and while I shared my experience it was obvious that he savored the opportunity to get back at his old boss.  Like most of us who have been wronged by a boss at one time or another, he soooo wanted to return the favor.  It was at that point that I asked him if he would be interested in doing me a favor instead.  He happily obliged and for once, karma was there for me.\n\nAnd so here come's malicious compliance.\n\nThe next day we drove up to Mr. Affluent Member's dealership.  I drove my new Jeep, my new salesman buddy drove the one to be returned.  We both drove up to the very front at the showroom just minutes after the dealership opened.  All of Mr. Affluent's sales staff were there staring at us and they all recognized their previous coworker.  We both walked in but my new buddy wanted to do the honors.  I still had to go in though.  I approached Mr. Affluent.\n\n\"Well, I brought back the Jeep.\"\n\nMy buddy followed up.\n\n\"Here's the keys.\"",
        "created_utc": 1674795455,
        "upvote_ratio": 1.0
    },
    {
        "title": "Always earning some how",
        "author": "sondria-spanish",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/10m9y7m/always_earning_some_how/",
        "text": "[removed]",
        "created_utc": 1674787251,
        "upvote_ratio": 1.0
    },
    {
        "title": "29.99 Airline upgrade or $13k medical bill",
        "author": "Heavy_Ape",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/10m8xfd/2999_airline_upgrade_or_13k_medical_bill/",
        "text": "Company travel policy does not allow for  non coach airline seating. I'm 6'5\" tall and only fit in coach only if my knees are wedged between the seats in front of me.\n\nOld boss allowed the upgrade to exit row seating typically for around $30. I explained this to the new boss but he expected me to comply with policy. I reiterated the pain this causes and it typically lasts for days. He replied 'make sure you report the issue for an injury report if it bothers you that much.'\n\nOk. I'm cheap and stubborn, so...4 hour flight, wedged in. Still sore 2 days later and our safety officer notices me limping a little so I explain that it was from the flight. An incident report was filed and she recommended I be seen at urgent care if I continued to have pain.\n\nNext day, still sore but getting better. Safety person checks in, asks me to go to urgent care. \n\nUrgent care visit, xray, prescription ibuprofen, and work restrictions. Bill was sent to me instead of workers comp. Nearly $13k.\n\nWrecked the bosses target of reducing recordable injuires likely impacting his bonus, nearly 13k medical, and reduced output due to work restrictions. \n\nWorth it?",
        "created_utc": 1674784242,
        "upvote_ratio": 1.0
    },
    {
        "title": "Not allowed to work from home so I don’t",
        "author": "wonderwall7",
        "url": "/r/antiwork/comments/10lympc/not_allowed_to_work_from_home_so_i_dont/",
        "text": "",
        "created_utc": 1674780931,
        "upvote_ratio": 1.0
    },
    {
        "title": "“Your job is done. I don’t want you to do anything related to the project ever again.”",
        "author": "wheresmychin",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/10m7mhc/your_job_is_done_i_dont_want_you_to_do_anything/",
        "text": "Apologies for length. TL:DR at the end.\n\nI work in technical theatre design, and I was approached by a writer/producer to direct her show after I had been recommended to her by a mutual friend (let’s call her Jane). Jane had been working on this script for a couple years, and it was her baby. The script was actually pretty good, and the cast she had already hired was awesome, so I agreed to do the job.\n\nThe show had already began rehearsals before I was hired, as the previous director had suddenly quit. After one rehearsal, i immediately realized why.\n\nJane was an absolute nightmare. She had no idea what she was doing. She had never produced theatre and knew nothing about any aspect of live event productions (blocking, lighting design, etc). However, she also wanted to control and micro manage everything. A majority of my job ended up consisting of her freaking out about something I had done, then me spending 20 minutes explaining why it had to be done.\n\nThe cast hated her, and she made every rehearsal miserable. She wasn’t interested in watching the scenes to see how good the actors were. She would spend every rehearsal buried in her script and getting upset each time an actor missed a word, or said them instead of they, or other minor easily fixable things. The only reason the cast stuck around is because this woman did have some industry contacts, and she was inviting them all to the show. She constantly bragged about it, and said she would share all her connections with the cast so they could benefit from the show.\n\nAbout two weeks before tech week, I realized she hadn’t hired a lighting designer, booth operator, stage manager, or anyone at all to run the show. She had been expecting me to do it all once the time came. I almost quit on the spot, but I ultimately stuck in because the cast was so great, and I knew the show would never happen if I left. She’d never be able to do anything on her own.\n\nI ended up calling in a couple favors, and someone we got everything done. The show actually turned out great, and the audience loved it. She had paid a guy to professionally film two performances, and she really got great stuff on tape.\n\nAfter the show ended, the cast asked for a list of emails/numbers of the industry that was in attendance so their agents could follow up. Jane betrayed them and refused to share any info about her contacts. She said she didn’t want them bothering people she knew.\n\nI was furious, so I sent her an email saying “you need to share that list. It’s what you promised. You owe it to them.”\n\nShe replied “This is no longer any of your business. Your job is done. I don’t want you to do anything related to the project ever again.”\n\nCue malicious compliance.\n\nOne week later, she sent me an email. Apparently she was trying to raise funding to do the show again, and had entered the video she had recorded into an prestigious online theatre festival.\n\nThe audio didn’t turn out great in the recoding. She realized that she didn’t have any of the sound effects, the marked production script, the Qlab show file, the projections, the blocking notes, nothing. I had done all the work, and had all the files. She had never even asked to see them before.\n\nIf she wanted to replicate the show, she’d need these things. Otherwise, she’d have to pay someone to start from scratch. If she wanted to fix the audio, she’d need all the music and sound files.\n\nShe demanded that I send her these things immediately. I replied:\n\n“Per your previous instructions, I am not to do any more work on this project. My job is done.”\n\nThen I deleted everything. She was royally pissed. Her realizing she had nothing tangible to re-mount her show almost made it worth two months of painful rehearsals.\n\nTL;DR: Was hired to direct/design a show. Theatre producer makes everyone’s life hell, then refuses to honor her promises to the cast. She’s tells me to get lost, then is dumbfounded when she realizes I have all the important files. I delete them and she can’t reproduce her show without starting from scratch.",
        "created_utc": 1674780414,
        "upvote_ratio": 1.0
    },
    {
        "title": "Telling on myself",
        "author": "Supervisorconfession",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/10m7k9u/telling_on_myself/",
        "text": "So many years ago, we were working on a job that had some scaffolding. This is very easy to install scaffolding that doesn't require a mason or professional scaffolding company to install. It's made of fiberglass and just locks together very quickly and easily. However, the scaffolding we had was getting pretty old and beat up. It was already at the end of it's life and it needed to be replaced. So I approach my Assistant Director and ask for authorization to buy new scaffolding. I already had a quote for $18k so I just needed approval. AD takes it to the Director and surprisingly, he says \"Yeah, we actually have some money for equipment and safety supplies right now. But we should ask the other shops to see if anyone else needs equipment too\". The Director gets a huge wish list of equipment from all of the various shop. We end up near the bottom of the top 10. All this discussion and back and forth gets us nowhere. I was begging the AD every few weeks that we needed this scaffolding and he just shrugged his shoulders and said that the Director was \"still deciding\". 6 months later and we still don't have approval to buy the new scaffolding. \n\nAround the 6 month mark, I get contacted by a member of our safety team, Sarah. A photographer was visiting various jobs on campus to take photos for an in-house newsletter. One of the photos was of our scaffolding and Sarah saw the photo. She noticed that some of the braces weren't installed correctly (a minor error that was still safe) and she just wanted to let me know to have it corrected. Here's where the malicious compliance came in. I suddenly got the idea to have a site visit with Sarah and another safety person, Anne, who was the primary scaffolding trainer. I invited both of them to personally inspect it and give their advice. While we were there, I pointed out EVERYTHING that was wrong with the scaffolding. Told them how old it was, how many parts had already broken and how I was really wanting to replace it. The both agreed that the scaffolding was unsafe and tagged it as \"out of service\" and told me to no longer use it. Aww, shucks! :)\n\nI ask for them to put it in writing, which they do right away. I print off the email, march right into AD's office and hand him the email. I told him that the scaffolding isn't safe to use anymore and that we had to stop our job immediately. We were right in the middle of a large, complicated job and no other equipment could be used. I told him, \"If I order that new scaffolding, I can have it here in 2-3 weeks.\". He sighed and gave me approval. I immediately ordered it and he approved the purchase the next day. A few weeks later, we got our shiny new scaffolding.",
        "created_utc": 1674780230,
        "upvote_ratio": 1.0
    },
    {
        "title": "Not allowed to work from home so I don’t (I’m not OP) Just thought this belonged here.",
        "author": "sleepisforburgers",
        "url": "/r/antiwork/comments/10lympc/not_allowed_to_work_from_home_so_i_dont/",
        "text": "",
        "created_utc": 1674779659,
        "upvote_ratio": 1.0
    },
    {
        "title": "No one ever makes it hot enough? Ok then, you asked for it!",
        "author": "SnooPears4832",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/10m61m8/no_one_ever_makes_it_hot_enough_ok_then_you_asked/",
        "text": " \n\nI used to be a chef in a Mexican Restaurant in a small town in Australia nearly 40 years ago. We were modestly popular and I loved working there. One night a young man came in to dine with a young lady. It was very obviously a first date. They ordered a nachos to share with a side of jalapenos for their entrée, and he ordered a steak vera cruz (hot) for his main and the young lady ordered a chicken burrito (mild) for hers.\n\nI, as I usually did throughout the night, would walk around the tables and ask if people were enjoying the food. After the nachos I checked on them and the young man informed me that the chilli that accompanied the nachos were not hot at all and that he loved hot food. I was informed that he had travelled extensively and had eaten some of the hottest food in the world and that no one had ever made a dish too hot for him. He reiterated that he wanted his steak main extra hot. To be honest I found him to be pompous and rather obnoxious in the way he was speaking down to me and found myself taking a disliking to him.\n\nI will add at this point that the young lady was looking a little uncomfortable and I got the impression her date was not going as she had expected.\n\nI headed to the kitchen. I made her a lovely chicken burito while putting together his steak. He wanted it hot?? He was going to get it!\n\nOur steak vera cruz was usually a steak cooked and topped with our house tomato sauce base with some capsicums (bell peppers for you Americans) and onions with a touch of chilli. On this occasion I set to work. Keep in mind this was Australia back in the 80's and we did not get a lot of different chillies back then and a jalapeno was considered hot by most Aussie palates. Hey, we were an uneducated bunch!\n\nI had a few birds eye chillies in the kitchen that were mainly there for the staff and the resident Mexican guitarist's meals so I started with those. I finely diced about 10 of those with their seeds. I then started sweating off my onions and capsicums. I then threw in the chillies and then I added about a tablespoon of chilli powder and about a tablespoon of cayenne.\n\nI soon felt the fumes hit my nose and the back of my throat and my eyes started watering. I ran to the door of the kitchen to get a breath of breathable air as the air in my tiny kitchen was rapidly becoming unbreathable. I ran back to my pan and put a ladle of the house tomato sauce in. I then let that simmer for a few minutes. I then added some chopped up jalapenos from a jar in my fridge and thought why not, and in went a bit more chilli powder.\n\nI then put the flash fried steak in to finish it off in the sauce. I served it all up on a plate with some rice, served up the chicken burrito and hit the bell for the waitress to serve it to the table.\n\nThe waitress came back and told me that as she placed it in front of him he said 'This had better be hot'. She assured him the chef had done as he requested. I went to the door of the kitchen, joined by my waitress, to watch the show unfold, and unfold it did!\n\nI watched with glee as he sliced the steak, took a piece on his fork and with a smug look on his face, he put it in his mouth. He took a chew and then realised his mistake. I saw it. That moment when his face changed but he was trying so hard not to show it. He couldn't. He was on a date and he had bragged so hard and now he had to go through with it. He ate the steak. I could see every ounce of pain on his face. He struggled. He struggled hard. His date watched him with a slight smile on her lips and I got the impression that she was thoroughly enjoying his pain. He went through several jugs of water. He sweated. He barely spoke. He looked damned uncomfortable.\n\nAt the end of the meal I came out of the kitchen and asked him if he had enjoyed his meal. His words? 'Could have been hotter.'\n\nHe never came back. His date? She became a regular and told us he was an insufferable fool and she never saw him again. I have no regrets other than I wish Carolina Reapers had been around then.",
        "created_utc": 1674776054,
        "upvote_ratio": 1.0
    },
    {
        "title": "Not allowed to work from home so I don’t",
        "author": "StuckInLazlosBasemen",
        "url": "/r/antiwork/comments/10lympc/not_allowed_to_work_from_home_so_i_dont/",
        "text": "",
        "created_utc": 1674769431,
        "upvote_ratio": 1.0
    },
    {
        "title": "I'd like to speak with your manager. Not a problem!",
        "author": "as2k10",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/10m2riq/id_like_to_speak_with_your_manager_not_a_problem/",
        "text": "A few years ago I was working casual as a bar manager at a major sports stadium after my housemate (who was running the corporate dining) hooked me up with the job as a nice little side earner. \n\nThe role was pretty straightforward, turn up, set up the bar, serve beers and snacks, clean up the bar, go home. This made it ideal for uni students, particularly international students who could pick up 3-5 hour shifts without it causing too much disruption to their studies. \n\nWhile the 5-6 staff I managed were continually changing individually it was mostly Indian international students, as well as a the same colleague Anoop week in week out who were invaluable at keeping the show running. \n\nGiven my housemate and I lived together and he had hooked me up with a job I was happy to take on a new person or two per shift who'd never worked in a bar setting before to give them a quick rundown on pouring beer, using the register etc. If it was one trainee I'd pair them up with me, two trainees I'd pair the second one up with Anoop. The bar was a 'members only' bar that had it's own private room that came as a perk of the $800+ membership people were paying to the sports club each year. It meant, along with getting beer in real glassware rather than plastic, that the queues were also much shorter as well and there were usually a few ex-players kicking around to give the odd speech.\n\nDuring one particular shift just after the game started I was doing my thing at one end of the bar when Anoop came up to me and said that there was an issue at one of the registers. I went over to see and the young student there told me that the patron standing opposite the bar had mocked her accent when she tried to explain to him she was still learning how to use the register. \n\nThe guy looked at me and said he just wants a beer. Summing the situation up quickly I leaned into a tool that I'd learned from my housemate \"Sorry, based on what my staff member has just told me you made a comment making fun of her accent. I'd like to believe is that's a comment you wouldn't normally make, which leads me to believe you must be intoxicated. I'm not able to serve you any more tonight, however I'd be happy to serve your friends but they will only be able to buy one drink at a time.\"\n\nNeedless to say he wasn't happy with this, and after a couple of minutes back and forward he asked to speak with someone else about the issue. \"Absolutely, not an issue\" I said and asked Anoop to quickly duck off and find the Corporate Dining Manager.\n\nAfter 5 minutes or so of waiting (the game has re-started at this point, so our patron is now missing the game as well) the Corporate Dining Manager, aka my housemate, arrives wearing his lanyard, suit, polished shoes etc. I give him a quick summary, the guy pleads his case that he should be allowed to keep drinking her because he's a member and he's paid good money to be there. \n\nMy housemate hears him out and then says \"Based on what my staff member has told me you've made a comment towards a member of my team which is inappropriate, and he's made the right decision to prohibit you from buying any more alcohol at the bar. However given you've argued that point and your friends here haven't stopped you from doing so it leads me to believe that all of you are intoxicated, which means unfortunately none of you will be able to be served at this bar for the rest of the night. If you'll excuse me I'll need to get back to the corporate suites, and if there's any further issues we'll have to get security (points to guy standing at the door who checks everyone's membership before you can enter) to escort you out.\"\n\nWith that he turns and leaves. Racist patron and his friends take the L and ask me where the nearest retail outlet is that serves beer. \"Not a problem, we're on level three at the moment so you'll need to take the two flights of stairs down to level two, and then take a left and wander past the food, merch and toilets and it will be on your left hand side.\"\n\nGiven their seats were on level three that's a fairly decent walk to complete several times throughout the game, and I'd like to think it gave them time to pause and reflect, however I suspect that wasn't the case.",
        "created_utc": 1674767809,
        "upvote_ratio": 1.0
    },
    {
        "title": "Ceded",
        "author": "BubblyHabit",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/10m1f5b/ceded/",
        "text": "[removed]",
        "created_utc": 1674764428,
        "upvote_ratio": 1.0
    },
    {
        "title": "How my 10 year marriage ended in divorce.. plus a free house 🏡",
        "author": "Kahle_Bride25",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/10m0rfi/how_my_10_year_marriage_ended_in_divorce_plus_a/",
        "text": "I started dating my ex-husband when I was 23 years old. By the time we were 25, we were engaged to be married. In 2011 within the first year of our relationship, we bought a house together. Both of our names were on the mortgage. Our agreement was he would pay the mortgage and I would pay the other bills electric, water, trash, &amp; groceries. We did that for a decade from 2010 to 2020. \nWell come 2020 I find out he’s having an affair. I file for divorce &amp; tell him because I have a work from home position, I want the house. I now made enough money to where I can pay all the bills on my own, he would have to sign the house over to me. Because he was dumb enough to cheat. He was dumb enough to sign over our house that he’s been paying the mortgage on for the past decade. Once I did the calculations, he had put over $150,000 worth of money into the house which is more than the house is worth when we bought it. \nJokes on him, I sold the house the next summer for $120,000 more than I bought it for and took the profit with me to my new home.\nMoral of the story- don’t cheat.",
        "created_utc": 1674762784,
        "upvote_ratio": 1.0
    },
    {
        "title": "Want me to cc you on every. Single. Email? Fine",
        "author": "biblicalplagueshouse",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/10m0nl7/want_me_to_cc_you_on_every_single_email_fine/",
        "text": "I'm working with a manager from another team for a while, and he is way more micromanaging than my actual manager. He asked me to send him a status update everyday (on projects where turnaround time is 2-3 days for change) and cc him on every email I send related to the project. \n\nThe ccing thing really irked me for some reason, but I didn't want to argue or make a scene. So, I started what turned out to be a two week campaign. I cc'd him on every email I sent. Routine hardware swap? Cc'd. Ten requests for ten people in ten emails asking for access to a lab? Cc'd. \n\nBut also; important status updates? Cc'd. Emails requiring action on his end? Cc'd. He couldn't even filter me out. I didn't tag him in the email body or anything helpful, making it difficult to decipher when his help was required.\n\nOver the course of two weeks, he missed two emails that required him to do something, causing other people to be annoyed with him. \n\nEventualy he relented and told me to use my judgement when cc'ing him. Honestly I'm surprised he hasn't hit this issue before since he manages like seven other projects. But all's well that ends well, I fought the power and got my email autonomy back!",
        "created_utc": 1674762511,
        "upvote_ratio": 1.0
    },
    {
        "title": "If you want to change companies, don't let the door hit your ass on the way out.",
        "author": "Controlled01",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/10lzsoj/if_you_want_to_change_companies_dont_let_the_door/",
        "text": "I work at a small company delivering potable water to people who don't have access to either city water or a private well.  So we deliver to the same customers pretty much every week.  Some customers are great and go out of their way to make deliveries easier or at least make sure that they don't make them any more difficult than they have to be.  A few customers just don't give a shit and expect us to make deliveries no matter what they do to make things inconvenient.  \n\nRecently one customer over the last couple of years had made several changes to their property that made making deliveries significantly more difficult.  I'd spoken to my boss about them and he laid out the conditions that would need to be met before he would consider dropping a paying customer.  And they were literally just barely with the limits.  And to their credit they did keep up with their bills... dammit.\n\nI dreaded seeing their name on the delivery list every other week, then they changed to wanting deliveries every week because their children were moving into the house as well.  After that payments started being more sporadic.  The checks we were getting changed names from the home owner to their daughter.  My boss only takes cash or check, not credit cards as he feels no compulsion to give any money to CC companies or to increase prices and pass the cost on to the customer.  \n\nOne day while I was in the office doing some end of day tasks the phone rang, caller ID was this problem customer.  Boss answered and I eves dropped.  It was the daughter, she wanted to to start paying by credit card.  Boss said no.  Then she decided to drop her \"threat\" to change companies.  Such hope in my heart as I saw the boss' face turn red.  He HATES bullies and being bullied.  Boss immediately agrees that that would be best and hangs up on her.  Walks over to the delivery schedule calendar and crosses their name off of the list.  \n\nTwo days later I got called into the office to hear a message left by the daughter begging us to make deliveries again she apologized and everything.  Turns out she had discovered that we were by far the cheapest option for them.  One of the things that made them frustrating to deliver to was not just the physical difficulty of the delivery but they only have a 350 gal holding tank.  It was a lot of work and time to deliver such a small amount of water.  And we have the lowest minimum delivery rate in town.  While all the companies around town are at about the same price/gallon most other companies have a 800 gallon minimum delivery rate, while our minimum at the time was only 500 gallons.\n\nThe boss and I shared a chuckle over the call, I don't believe he bothered with calling her back.",
        "created_utc": 1674760369,
        "upvote_ratio": 1.0
    },
    {
        "title": "Boss tells me catering orders to be for 20 before due",
        "author": "Frequent_Internal455",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/10ly9rq/boss_tells_me_catering_orders_to_be_for_20_before/",
        "text": "I’m gonna start this by saying on Sunday I had to place 2 orders for catering where I was told that we are given a 15 minute Grace period to deliver it. Yesterday I had a call in for in order to be delivered by 12pm today. I set the order to be ready for 11:15 because for the past 6 months timed orders have been going out about 10-15 minutes after the designated time. The order arrives at 11:45 and the woman calls the store and complains that’s it early. My boss calls me to complain and tells me that my manager never would have told me there was a 15 minute Grace period. So from now on no matter how large the order is I will be putting them for 20 before the desired time. Advice on what to do when this inevitably backfires and the boss gets mad again?",
        "created_utc": 1674756555,
        "upvote_ratio": 1.0
    },
    {
        "title": "How Are Programming Languages Invent?",
        "author": "ARFASOFTECH",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/10ltt0q/how_are_programming_languages_invent/",
        "text": "[removed]",
        "created_utc": 1674745365,
        "upvote_ratio": 1.0
    },
    {
        "title": "Don't care about people calling me on your old number? I'll sort it.",
        "author": "beerbellybegone",
        "url": "/r/ProRevenge/comments/10lraxd/dont_care_about_people_calling_me_on_your_old/",
        "text": "",
        "created_utc": 1674739094,
        "upvote_ratio": 1.0
    },
    {
        "title": "Don't care about people calling me on your old number? I'll sort it.",
        "author": "fin008",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/10lr6ql/dont_care_about_people_calling_me_on_your_old/",
        "text": "This was about ten years ago, also English is my second language and I'm writing this on my phone, TL;DR at the end, yadda yadda..  \nI had just moved to Australia and gotten a new phone, but as it turns out my number was someone else's old number. Every other week I'd get calls by a tradie who wanted to know why I wasn't \"on site, mate\", or \"what I wanted done with building project ABC ..\".  \nEvery time I explained at length that they got the wrong number and quite often folks on the other end were absolute rude or thought I was taking the piss and insist I answered their questions or show up \"on site, NOW\".  \nI was over it, so I googled my own number and did some digging and eventually found out the guy who had my number before, then his new number and then I called him. I politely explained my dilemma, pointed out that there were two websites still having his old (my now new) number and if he could please change this and let his contacts know about his new number and to delete the old one as it was getting quite tedious for me. By that time I had used my number for work, visa applications and landlords and friends and changing it would have been a huge pain. I explained all of that.  \nWell, of course he was just as pleasant as most of his contacts and told me something along the lines of \"I don't give a fuck, mate, that's not my fucking problem. Get fucked, sort your own shot out, mate.\"  \nWell, the universe provides and so I got a great opportunity to do just that only a few weeks later.   \nI received a call in the early hours of one morning by another disgruntled guy telling me he was early and demanding to know where I wanted the sand put down and how to get in. I asked what sand and was told he had a full truckload of sand as ordered and no one was on-site and it was all fenced off.   \nVery briefly did I think about launching into my explanation but I was tired and over it and then realised the opportunity provided, I snapped back at him with no uncertainty: \"Mate, it's all good, dump it all right in the driveway, front of the fence, we'll sort it out when we get there\"  \nThe guy said: \"You sure mate? It's a lot of sand.\"  \nMe: \"Absolutely sure mate, thanks a lot\"  \nHim: \"Alright then boss\" and hangs up.  \nWell, I go back to bed, snoozing for another hour with a big smile until my phone rings again and I see it's old mate with his new number who I had saved when I called him a few weeks ago. I pick up rather chipper and he doesn't waste anytime launching into a series of swear words and how he has no access to the site and that he has to move a literal tonne of sand by hand and whether or not I told the sand guy to dump it all there.  \nI replied: \"You told me to sort this out myself, this is me sorting this out. You can remove the numbers and let your contacts know or not. Totally up to you. Mate.\"  \nHe was fuming, called me a few more choice words, promising to find me and a lot more before we ended the conversation. However the numbers disappeared from the internet really quickly after that and I never got another call again, I still have my number and every time I see a truck with sand I chuckle to myself thinking of this guy moving a tonne of sand by hand and losing a fair few hours of labour because he was a douchebag and couldn't be bothered sending a few texts.  \nTL;DR: Got someone's old number, tried to ask them to let his contacts know and was cussed out and told to sort it myself. Guy ends up shovelling a tonne of sand by hand and losing at least a half day of labour.",
        "created_utc": 1674737822,
        "upvote_ratio": 1.0
    },
    {
        "title": "Teacher won't let me stay warm, now he isn't coming back",
        "author": "Throwingmylifeawai",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/10loczv/teacher_wont_let_me_stay_warm_now_he_isnt_coming/",
        "text": "The school I attend it dirt poor, and it's super old. Because of that, we don't have ant working heaters. We have heaters in out classroom, we have 4 each, but they are broken. We also have hooks that we hang our coats up on in the hall, but someone ripped mine and a few other's out, so I don't have any other choice than to bring it into the classroom and have it under my desk. We stay in the same classroom all day anyways.\n\nWhen winter came, our classroom was freezing. when we checked, it was 11 degrees celcius (about 51 in f). Since we don't have a heater, I was wearing my coat, and no teacher really minded. Than we had english. Our english language teacher is the worst. He has failed students because he don't like them, he has almost his students, made the girls really uncomfterble, and so on. He saw a few of us wearing coats, and he told ut to take it off. The stupidest part was, he was also using a coat, but he refused to remove it.\n\nI decided to do what he said. I took it off and within minutes i was shivering. I was so cold, I couldn't feel my body after 30 minutes, and I get cold really easily. Before the class was finished, I started crying cause I was that cold. My friend ended up taking me to the principle, who called my dad who picked me up. My friend stayed back and gave detail about the situation. My friend stayed at school, cause she was wearing warmer clothes, so she was pretty unbothered.\n\nBy the way, I was the only one who removed my coat, cause I know I don't handle cold well (ironically), and that I could take it up with the principle who would take it seriously, and since people were in the classroom, everyone knew.\n\nI came back the next week (I ended up sick from something else) and the teacher weren't there. I asked my friend, and she told me he was tranferred to another school, and wasn't allowed back.\n\nSo yeah, since he decided it was better to let students freeze, he managed to not be allowed back in the school.",
        "created_utc": 1674726932,
        "upvote_ratio": 1.0
    },
    {
        "title": "Insisting on cheating off me? Okay!",
        "author": "Alarming_Tell1208",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/10liiks/insisting_on_cheating_off_me_okay/",
        "text": "I saw a post earlier that reminded me of this story. I was in high school, and in NY at the end of the year you have to take Regents exams for all your subjects. Essentially they’re state mandated tests for public schools to make sure kids can pass. So I was taking the biology Regents, which is a huge one so they put about 100 desks in the school gym, all evenly spaced out and then they shove us all in there.\n\nI was sitting next to one of my best friends, about six feet between our desks. All of a sudden this girl appears on my other side, I hadn’t spoken to her since middle school but she recognized me as one of the “smart” kids. (It happened a lot, people always tried to get freebies off me because I felt bad telling them no.) So she goes “Hey! I really need to pass this to graduate early, so I’m gonna copy off you!” And she dragged the closest desk about two feet away from mine. \n\nNow, I was super shy in high school, so I wasn’t going to go up to a teacher and tell on her, and to my dismay no one noticed her do it. I look over at my friend like “help!” and she just shrugs. \n\nSo this girl, as the test is starting, says “okay just leave your booklet on the edge so I can see it during the test!” At this point, 15 year old me is not going to tell her to f*** off. \n\nCue the malicious compliance. \n\nSo these state test graders don’t grade your booklet, only the Scantron (bubble sheet). So, as I took the test, I bubbled in the correct answer on my sheet, which I tucked under my test booklet, then circled something different on the booklet where she could see. Oh, I gave her a few of the right answers, but probably not enough to pass if she copied every single one, which it looked like she did. \n\nAfter the test she goes “Thanks girl, good to see you again!” and she leaves. When I told my friend what I did, she thought it was hilarious and well deserved. \n\nI have no idea what that girl got on that exam, but it doesn’t matter. I got an A.",
        "created_utc": 1674704464,
        "upvote_ratio": 1.0
    },
    {
        "title": "hat Time Company Lawyers Told Me To Contact Law Enforcement",
        "author": "MoralLogjam",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/10lifv3/hat_time_company_lawyers_told_me_to_contact_law/",
        "text": "This took place years ago but still makes me laugh at the sheer stupidity of it all. \n\nIt starts as all truly great sagas published on the internet begin... When I met a random guy through a friend at a bar in the city. Let’s call the guy I met \"Marc\" for the purpose of this post.\n\nMy friend had introduced me to Marc because for few years leading up to that introduction I shared an idea I had for a business with anyone who would listen. I was told Marc wanted to start his own business, had worked in the industry, knew a lot about the subject matter required, and thought my idea was good.  \n\nMarc and I met up for a lunch, we hit it off, he said he'd start the business as the CEO and agreed to me taking a part time operational role. I agreed to help solely in a part time operational role because I couldn’t afford to quit my day job.  I put in 15% of the cash for 5% ownership since Marc was going to put in founder hours (80+hours a week) and agreed to put up 85% of the cash which was more money than I could afford to risk on a new venture. \n\nI worked part time, I did what I said I would do, I even tried to be of assistance on things I had no experience with. I connected Marc with a fella I had done business with before, we will call him Paul. Paul and I got into a dispute ourselves (more on this later). \n\nAnyway, lets fast forward a few months and I got into a dispute with Marc over stationary. Yes, stationary not being to his liking caused him to flip out. This was despite him picking the stationary out. \n\nNext up, the contract I got from Marc was not what we agreed. The legal work required a few months to get done and I had expected delays but when I finally got it the paperwork didn't represent what I had agreed to own. Not only that, but my investment wasn’t being acknowledged under the terms we had committed to when I put the money in. Now, as I said, I wasn't able to risk much and I only invested what I could afford to lose, so this wasn’t a huge sum of money. I didn’t want to make a big deal about it since the amount was small and he began promising a new contract when the business could pay for the lawyers to make changes.  I signed nothing. \n\nThen it worsened, Marc and I start to fight anytime we are in a room together. As I think back, it’s almost comical how angry he would get in my presence. I have other things to do with my time than squabble over stuff like stationary so I worked on my areas of the business and hoped things would grow. I stopped in whenever I could and would help out regularly as needed with as little Marc interaction as possible. Paul would intervene sometimes when Marc would get particularly difficult to be around. \n\nAnyway, fast forward about two years, and Marc can’t help but tell everyone who will listen that the business is going well. I have no idea how well things are going because Marc isn't giving me any updates. \n\nI get a call around Christmas from Marc, he wishes me a happy holiday then drops the bomb on me that he wants to terminate my involvement and refund my investment. I decline the investment refund and say I’m happy to no longer work with him. In my head I think its kind of hilarious that he thinks this will just end that easily but I say nothing to that accord to him. Marc and I hang up with him aggravated about my refusal to take the refund on my investment. Marc then sends me an email that I had resigned. This had no basis in fact but certainly was creative about what we had just discussed. I correct him immediately in a reply stating that he wanted to no longer work together and that I can see that being the case but want to discuss my investment. A few days later Marc demands I come pickup a check for a reimbursement of my investment. I do not come and get it. \n\nNext thing you know the company attorney huffs and puffs and tries to scare me with some strongly worded letter. This is the same idiot attorney who screwed up my contract to work on the business and my investment agreement. Lets call this Attorney Mr. Cohn for the sake of this story. \n\nI send an email response to Mr. Cohn that he screwed up, the company seems to be doing well, that I hear rumors about how well, that I want to be on this for the foreseeable future, and I will not take a 1:1 cash out for what I put in. \n\nThe attorney then emails me back, stating in writing, that Marc never accepted my electronic transfer into the company account. Instead, Marc has another company he accepted the money into. A company I’ve never heard of. A company that is different than the name of the recipient on my electronic transfer, a company that would be committing wire fraud to accept the money I sent. \n\nOn that note, I did some sleuthing online. I found out Marc had been forming one company every month or two. Then there were media reports and documents he let slip in shared drives he forgot I had access to from when we agreed to work together (Marc was too cheap and stupid to pay for tech help so he was using my shared folders I had created and I certainly wasn't obligated to turn off the shares if he wanted to work out of them). Those documents showed me Marc had recently raised money in the company I sent the payment to at 200X the valuation I had bought into it at, and Marc didn’t disclose my investment to the new investors. Marc had however put me on documents showing my ownership to previous investors. Not on documents I had ever seen before but documents he had been sending around. \n\nWhen I share my suspicions that Marc is committing wire fraud with Mr. Cohn I am told I am the one breaking the law by knowing anything about the investment documents the company has used. Mr. Cohn tells me that by not picking up my check I will not be entitled to any money and to contact law enforcement if I think something illegal has happened, he cautions though that I’ll be the one in trouble. \n\nCue the MC. \n\nI let the different respective members of the securities and exchange commission along with law enforcement know what happened to me. I provided them all of the documents I had from the matter. It took about five years for the investigation to conclude, for charges to be brought, for a trial to conclude, and for Marc to go to jail. They say government is slow but they aren't kidding with just how slow. Maybe it was slow because Marc was running a large (tens of millions of dollars large) fraud? Anyway, Marc will be serving time for about 30 felony charges they found uncovering the details of his Ponzi scheme. He will be away for a long time. \n\nI never did anything wrong. With the information I was able to provide Mr. Cohn ended up getting disbarred. There were other things Mr. Cohn did outside of what is shared in this post that I cannot share or it could help to identify me to the folks involved.  \n\nThe investigators credited me with bringing the fraud to their attention. \n\nI lost my money in this ordeal but gained an education and I got to help bring down a crook. The sheer stupidity of Marc is that he didn't even follow the business plan I had. He just used it as a story to convince investors to give him money. It is a business model that works very very well. \n\nIt took a few more years but I'm now in a position to be pursuing this business full time, with people of high integrity, who all work together to ensure each others success. We expect to have an extremely profitable year in 2023 after proving the business model worked in 2022.",
        "created_utc": 1674704225,
        "upvote_ratio": 1.0
    },
    {
        "title": "You wont honor my school schedule but want me to do extra work? OKAY",
        "author": "DeadestBug",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/10lfic2/you_wont_honor_my_school_schedule_but_want_me_to/",
        "text": "so I used to work for one of the largest Contractor companies in the US. While I was there I was initially told I would be installing TV's home security etc. when I came in I was told I would be working to install and repair satellite cable services. Now I was already annoyed but at this point it was whatever, my final week of training was with a guy (who well call John, ob. not his real name) who had worked for this company for about 10 years doing just about everything you could do. \n\nwe started working together and he showed me the ropes on how to hang TVs install thermostats and set up various different things, just about anything you could purchase at that big blue electronics store which i wont name here as i currently work for them now and greatly like my job. \n\nanyway,\n\nI informed my boss and supervisor on day one of training/orientation that i was going to school at the same time, they told me to just let them know what my school schedule was and they would keep a handle on it and make sure those days i wasn't given to many jobs, this worked for my training month and about 2 weeks afterwards when i was finally moved over to the home theater's install side of the company due to john liking my motivation and willingness to work and him needing help as well. \n\nAfter the 2 weeks we were both given 4 jobs of which we had to help each other with due to them being larger TV's that one person couldn't do on their own. so 8 jobs total. Some of which had various things go wrong and didn't work out very well most of the time. We were equally getting off at about 6 or 7pm each night. (note: I had school at 6 and John had to pick up his son at 5, as he was a single father and had sole custody of his child) we went in and explained that we both had other commitments that were more important than our job, the supervisor said don't you want to make money? like yes but we also had prior commitments we needed to complete. \n\nfor about 3 months i saw my husband maybe 3 or 4 times not including the weekends. at this point I personally had a conversation with both of them, after being frustrated I went home, and the next day went back to work, low and behold I had to take my company vehicle into be serviced so I rode along with john that day, i then picked up a tv and pulled something slightly in my shoulder not really hurting much I went about my day shortly after i had it reinjured due to a mishandling by a tv and a client stopping in front of john and having to skid to a stop, at this point I was in so much pain i called the boss and he of course was FURIOUS that i got injured and went to the Doc and had to take a few days off. \n\nWhen I came back and was cleared to work again we were back to the same ol routine of not getting off on-time to fulfill our commitments. we went to the boss again and he instructed us that we MUST be at Big Blue Electronics warehouse by 7:30AM Sharp or he did not want to hear our complaining about failing to meet our commitments. \n\nCue MALICIOUS COMPLIANCE, \n\nwe both started getting up at 5:30AM and making sure we got our work vehicles by 6:20am (mind you we were NOT hourly we got paid per job per line item so this was done all on our personal time) we got to the warehouse at exactly at 720 if not before every morning we worked, to prove the point that it didn't matter how early we got there we still had to wait for it to open and all of their in house people to get their products first, also with the amount of jobs we had we still didn't have time to get it all done by our commitment times. \n\nBosman still wasn't having it and wasn't willing to listen, so I did the next logical thing I could think of, myself and john came up with a plan. We realized that this entire job line was placed on 2 people (technically one till I came along and helped him) if we left then the entire job line would go down the drain, but we didn't just want to quit right away, we enjoyed meeting with the clients and actually helping them out. so I told John I would work for the rest of week and then leave on a Saturday (we got our new schedules Sunday) week went by and it was terrible as usual. when i left i dropped off all my gear emptied out my work van and transferred everything from my work vehicle to my personal vehicle. and just left the key on my warehouse managers desk, next week went by and i was told by john who still stayed for the next week and was told that they were pissed and scrambling to reschedule and modify work orders. the next week goes by and that Friday John calls me and asks for help emptying his work vehicle because I had a truck and he needed more space, the supervisor and boss already left for the day but the warehouse manager was still there. he handed over the keys to his van and left, the bosses were scrambling harshly because they didn't have anyone to cover the next weeks jobs due to both people who they relied on for an entire business' line, quit with no notice.\n\nin the end I am much better mentally and very happy where i work now, and last i heard they tried to hire more people, but they all quit because of the terrible treatment by Bosman and Supervisor (both of them have NO idea how to do the physical/work side of this business' line)  \n\n&amp;#x200B;\n\nTL;DR Boss and Supervisor refused to work with us when they knew ahead of time our prior commitments, so we brought down an entire business' line.",
        "created_utc": 1674695611,
        "upvote_ratio": 1.0
    },
    {
        "title": "Gramps, and the Orbital Stump Incident",
        "author": "slice_of_pi",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/10lffxj/gramps_and_the_orbital_stump_incident/",
        "text": "[removed]",
        "created_utc": 1674695426,
        "upvote_ratio": 1.0
    },
    {
        "title": "Make Me Skate Knowing I’ll Fall? Ok.",
        "author": "SaturnScooter",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/10ldt4p/make_me_skate_knowing_ill_fall_ok/",
        "text": "[removed]",
        "created_utc": 1674690967,
        "upvote_ratio": 1.0
    },
    {
        "title": "Car Stereo goes out... Well replace it with the oldest POS we can find... TLDR",
        "author": "P4ddyC4ke",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/10la0jj/car_stereo_goes_out_well_replace_it_with_the/",
        "text": "About 24 years ago, I was a sales manager for the now defunct Circuit City. This one particular day I was acting as the floor manager. We had the Ops (Operations) manager there as well as the Road Shop Manager (Car Audio).\n\nI get a call on the floor manager phone asking me to come to Customer Service to speak to someone. Customer Service is the part of the store where customers would come in to return items or have them serviced under warranty, be in the manufacturer’s or the Circuit City Extended warranty. This department was headed by the Operations Manager, with a Customer Service Manager and associates working for them.\n\nAs a Sales Manager, I was over several of the departments in the “sales” part of the store. For the most part, the Ops manager was the end of the line for Customer Service issues with a rare occasion of something escalating to the Store Manager. As a Sales Manager, there wasn’t anything I could do, that was beyond what the Ops Manager could do. In general, we didn’t cross those lines unless requested to, or if we were covering for another manager on break or some other circumstance. This is why a request to speak to someone in Customer Service was out of the ordinary. Also, this particular day and time, the Store Manager was not there.\n\nSo, I walk into the Customer Service department and see a customer standing there with the Road Shop Manager and Operations Manager behind the counter. I greet the customer politely and step behind the counter as the Operations manager explains that the customer had a car stereo that was not working, and that it was well outside the return period (30 days), but still within the manufacturer’s warranty with no Extended Warranty. The customer was insisting on a new stereo, and it didn’t take long to figure out that he was heated and somewhat belligerent. \n\nTo add a bit more context, within Circuit City, Car Stereo was like a Store within a Store. The Road Shop Manager was THE Store Manager for all of the car stereo, and in this instance would have been the “highest” authority on a car stereo issue.\n\nAnyway, I think they needed someone fresh and level headed to start over with the customer. As I began talking to the customer, the other two managers left the service department. We began discussing the situation with him telling me what he wanted and me responding with, “well, what I CAN do for you is…” We went back and forth for quite a while. He kept insisting that he wanted a new stereo while becoming louder and more aggressive. I just kept telling him what I could do for him, rather than what I couldn’t do. \n\nThe solution I repeatedly offered, was that we could pull his stereo and send it in to Service to be repaired under his manufacturer’s warranty and put in a lender stereo he could use until his came back. Offering the lender radio was generally reserved for someone with a Circuit City extended warranty, which this guy didn’t have. It was pretty much a stale mate. Through it all I kept a calm, respectful demeanor. It was funny, because this guy, suddenly “broke,” as if breaking character. He started to grin and said something to the effect of,\n\n“Aw, man! You’re good. Really good. I was just waiting for you to get upset or raise your voice or something and I was going to come across that counter, but you’re good.” I got the impression that he wasn’t exaggerating what he was willing to do.\n\nI responded with, “Great! Let’s get you set up.” I get the Ops manager back in there to process the service, while I shake his hand and head back out to the floor. \n\nOn the way to the floor I cue up the malicious compliance. I call back to the road shop and talk to the road shop manager. I tell him, find the oldest radio you can to put in his vehicle for a loaner and call me if you have an issue. He’ll be back there in a few minutes.\n\nUnbelievably, the Road Shop Manager finds an old radio with a tape deck instead of a CD player. Now mind you, this is around 1998-1999. In dash CD players and CD changers were the big thing after market, but weren’t the standard equipment in new vehicles till the late 90’s.\n\nAbout 45 minutes later I get the call asking me to come to the road shop. I absolutely know what’s waiting for me. I figure I’ll be spending an hour or so telling the customer “what I CAN do for you is…” \n\nI go to the road shop and step outside and see the customer from earlier “talking” to the Road Shop manager. To my surprise, the customer looked up, saw me, and then looking defeated said, “Nevermind.”\n\nHe snatched his keys from the Road Shop Managers hand, got in his car and left.\n\nWe laughed about this for quite some time afterwards. \n\nFiguring some would ask, I’ll add, I never saw the customer again, so I’d assume he received his repaired stereo and had it reinstalled without any issue.\n\nTLDR: Customer in retail store demands replacement radio. We agree on a loaner while his gets serviced. We install the oldest POS we can find as a loaner.",
        "created_utc": 1674681490,
        "upvote_ratio": 1.0
    },
    {
        "title": "It's the worst ice storm in twenty years and we still have class? Well okay then.",
        "author": "SkyrakerBeyond",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/10l969p/its_the_worst_ice_storm_in_twenty_years_and_we/",
        "text": "[removed]",
        "created_utc": 1674679455,
        "upvote_ratio": 1.0
    },
    {
        "title": "Want to copy the exam on me? Suit yourself.",
        "author": "AbouMba",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/10l6ces/want_to_copy_the_exam_on_me_suit_yourself/",
        "text": "I just remember this MC. It happened when I was in middle school. I was really good in the French class, always getting 20/20 mark.\n\nIn one of the exams, this guy came to sit next to me and bothered me to show him my answers. He would do that for 30 minutes straight and I couldn't focus. So I told him just shut up, look at my paper and write what I write. So he does just that.\n\nWhen the teacher gives us our mark, we both get 20/20 unsurprisingly. But this guy who used to have very low marks getting the perfect all of a sudden was sus. So the teacher took him apart, gave him the exact same exam, and told him if you manage to get half the mark, I will give you the full mark. Of course he couldn't so he just wrote him up for cheating.\n\nThe teacher knows he copied off of me as he was sitting next to me during the exam and wanted to write me up too but me denying any complicity + first of the class privilege I got away with it.",
        "created_utc": 1674672774,
        "upvote_ratio": 1.0
    },
    {
        "title": "Venting about unfair removals",
        "author": "saruech",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/10l4dwn/venting_about_unfair_removals/",
        "text": "[removed]",
        "created_utc": 1674668192,
        "upvote_ratio": 1.0
    },
    {
        "title": "Your rules are more important than my safety? Okie dokie!",
        "author": "LeozMJilliumz",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/10l48r3/your_rules_are_more_important_than_my_safety_okie/",
        "text": "[removed]",
        "created_utc": 1674667856,
        "upvote_ratio": 1.0
    },
    {
        "title": "Have me sign a weird contract or I fail? Ok.",
        "author": "SunshotDestiny",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/10l1odv/have_me_sign_a_weird_contract_or_i_fail_ok/",
        "text": "Last semester I had to take a class from a professor who wasn't bad as being incompetent, but definitely was one of those \"I have a new way to teach that I developed\" kind of professors. She also gave the vaguest instructions on what she did want in her turned in work, and didn't believe in study guides as she wanted to encourage \"reading the material\". Honestly I got more out of the book than her class, and buying the book alone would have been far cheaper. Trying to get direction out of this lady was worse than trying to pull teeth, met with mostly \"do your best\". \n\nOn top of this she apparently handed out a \"grading contract\" on the first day to everyone we had to sign and return, I missed this due to being sick so I didn't get it until later. Said contract basically boiled down to indicating what grade you wanted at the start of the semester. You either met the conditions for that grade, or you would fail. So basically by saying you wanted an A you either met the qualifications for an A or you would fail even if you could have gotten a B or C instead. If you decided to play it safe with saying you wanted a C, even if you exceeded and would normally get a B or A you would just get a C. \n\nSo to cut out a lot of the drama of the semester, two things. First being I had surgery at the beginning of the semester. Second is I was working full time while at school to pay for said school. Both ended up with me missing a lot of work, and normally I would just cut my losses except I am very close to my degree and my professor said I could make up the work. Otherwise I would fail and need to retake the class anyway in the spring. So I decided I had nothing to lose and buckled down with basically getting next to no sleep for weeks, I had over a month and a half at least amount of work and two weeks to do it in.\n\nNow, finally, this is where the malicious compliance comes in. During an exchange where I was emailing my work she told me I still hadn't done her contract. Which at that point only a few weeks out from finals I didn't get the point. But she told me either I did the contract or I would fail. She also had let slip that not doing the final would drop you a letter grade, but not fail you. The only exception to her weird contract that wasn't in it, and one I confirmed very deliberately in writing. At this point I was bone tired, and honestly forcing myself to continue working on anything. Which may not sound like much but with my mental health history was herculean effort. I just wanted the pain to stop and a full night's rest.\n\nSo I decided if not doing the final just dropped me by a letter grade, then I would just do the work for a B and end up with the grade I thought was fair for how the semester had gone. This meant for even more work, but it also meant I didn't need to worry about a final and could finally just sleep. Which I explained as much to the professor when she asked me why I didn't have a final turned in on the last day. That so far has been the last I ever spoke to or seen of her.\n\nImagine my surprise when I actually ended up with an B in her class. Personally I take this to be her never wanting me in her class again, and I don't know if it makes me a bitch overall. But I do know she apparently has it now not doing the final is an automatic D. So sorry to anyone who got her after me.",
        "created_utc": 1674661583,
        "upvote_ratio": 1.0
    },
    {
        "title": "24[F4M]home alone and horny asf💦🍆I’m down for Quickies 🤤Hmu on snap:baskyo22",
        "author": "kajhsndjx",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/10l0md3/24f4mhome_alone_and_horny_asfim_down_for_quickies/",
        "text": "[removed]",
        "created_utc": 1674658891,
        "upvote_ratio": 1.0
    },
    {
        "title": "Management took away bathroom breaks, lost half of the team",
        "author": "throwmeaway27560",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/10kzomr/management_took_away_bathroom_breaks_lost_half_of/",
        "text": "[removed]",
        "created_utc": 1674656389,
        "upvote_ratio": 1.0
    },
    {
        "title": "A little mileage or a lot of taxi fares? Oh you want taxi fares? Done",
        "author": "Bibby_M",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/10kzdsi/a_little_mileage_or_a_lot_of_taxi_fares_oh_you/",
        "text": "I live in a commuter city about 60 km from my old workplace. \n\nI traveled for work pretty frequently and needed to get to and from the airport. \n\nMy office happens to be about 8 km from the airport. \n\nFinance instituted a rule that they would only reimburse mileage the lesser of the distance from home or the distance from the office. \n\nSo when of driving to the airport, and being reimbursed for 68km each way, I was reimbursed for 8. After reimbursement and leaving extra time to park jn the value lot and take the shuttle, I saved the company a lot of money on my 1-2 night trips by driving. I was deep in the “we are a family, is this good for the organization” mindset. \n\nCue the malicious compliance. \n\nTaxis were just reimbursed with little oversight from Finance. I told my director how I was being screwed in exchange for my early mornings, and we agreed I’d no longer drive and submit expense reports. Instead I’d just cab it. \n\nBy letting someone else drive me I saved an hour in the morning before I took off and and hour after I landed, and the company just had to pay double for a taxi or airport limo. \n\nPedantic expense policies for the win!",
        "created_utc": 1674655555,
        "upvote_ratio": 1.0
    },
    {
        "title": "the work area isn’t for telling jokes? got it.",
        "author": "whoknowsidrc",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/10ktevl/the_work_area_isnt_for_telling_jokes_got_it/",
        "text": "I was catching up and laughing it up with a coworker of mine, AFTER both of our shifts, and my manager decides to tell us that from then on telling jokes at the office will lead to a thorough “correction of behavior”. So I, slowly over a span of 2-3 weeks started shifting things up in my managers office and just all around where it was subtle and generally unnoticeable and waited for the Friday of the last week. I then carefully executed the worlds funniest joke where for the entirety of the 8 hours I was there I would make a clever and ongoing joke assisted by the careful placements of the office items. My coworkers found it hilarious. My manager? Not so much. So there I am in his office getting a stern talking-to and he threatened to terminate me (me knocking over a glass vase had something to do with it I’m sure). I had to explain to him that it was all for the bit but he really didn’t appreciate the reason too much.",
        "created_utc": 1674633182,
        "upvote_ratio": 1.0
    },
    {
        "title": "I am easily replaceable. Ok",
        "author": "Wahawahe",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/10kszq7/i_am_easily_replaceable_ok/",
        "text": "[removed]",
        "created_utc": 1674631420,
        "upvote_ratio": 1.0
    },
    {
        "title": "Make me take PT every month, will you?",
        "author": "egilbe2003",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/10kpob7/make_me_take_pt_every_month_will_you/",
        "text": "I was in the US Army and the Army National Guard for over 20 years. I did finally get my pension, but I was ready to throw all that time away because of the inability of a 1st Lt to count to 8. \n\nWe had an annual APFT scheduled as part of a drill weekend. A drill weekend consisted of 4 Unit Training Assemblies, or UTA's. Each UTA was equivalent to a day of active duty pay. The duty day started at 7am, lunch at 12, final formation at 4:30pm, then released for the day unless an overnighter was on the training schedule. \n\nPromotions were contingent on passing the Army Physical Fitness Test, as well as a bunch of other random qualifications such as military schools, professional development, military awards and decorations, Rifle qualification, civilian training and/or schooling and college degrees. \n\nThe APFT consisted of three events: pushups, situps and a 2 mile run. It has since been changed, but that was what it was when I was in. \n\nI'm a natural runner. I ran track in high school.  Tall and lean with good stamina. Not too fast, but I was steady, 6 minute miles all day long. Situps were never a problem for me. Pushups however, not much for upper body strength. I've always struggled with pushups. It's the only event of the APFT that I ever actively trained. I could max out the other two events, but pushups...I was happy if I could make the minimum required to pass the test. \n\nI was up for promotion, I trained pushups for months prior to the test. On the day of the test, one of the smokers in the unit wanted to run with me, to pace off me so he could pass the PT test. I did the required number of pushups to pass that event and I was flying high, knowing the other two events were easy for me. We ran on a quarter mile high school track, 8 laps for two miles and as we passed our scorer, in this case, the idiot 1st Lt, we'd yell out our last name and he'd check off the completed lap. My buddy and I ran side by side for all 8 laps and when we got to last lap, the LT said I had another one to do. We explained that we ran together for all 8 laps and if one of us passed, both of us passed, but he wasn't buying it. He made a mistake and couldn't admit it. He was adamant that I had to run another lap and because I was running slower than I normally would have to let the smoker keep up, I couldn't complete another lap in the time required to pass the test. I was marked as a PT failure and wasn't eligible for promotion. \n\nBecause I was an NCO, there wasn't that many slots that opened up in a year in my job classification. The opening went to another NCO farther down the promotion list than me. I was pissed. \n\nMy civilian job was in manufacturing, we worked a 3 on, 3 off schedule. I worked nights. Weekends were our big money weeks. In order to attend a drill weekend, I'd have to miss work Friday night, Saturday and Sunday night. I would lose about $600 for attending drill. Occasionally we could be approved for missing drill as long as we made it up during that month, or we could just take no pay for drill and miss those days towards creditable retirement. At some point, leadership decided that all PT failures would take a PT test every month until they passed. Failure to show up for the PT test would be an automatic forfeiture of pay and retirement points. \n\nEligibility for retirement was based on having a \"good year\". A good year was 50 points. Each UTA was 1 point. Annual Training was 15 points, leaving 35 points needed from drill weekends. In a year I could miss 3 drill weekends and as long as made all the rest, I was eligible for a \"good year\". I saved those excused drills for the weeks I was scheduled to work fri, Sat and Sun, so I wouldn't lose the $600 difference from my civilian job and drill pay.\n\nNow, back to those mandatory PT tests every weekend. Leadership decided that we couldn't miss the scheduled training so the PT test would be held before drill, at 5:30am at an armory 30 miles farther away from my unit's armory. To be at the PT test armory on time for the test meant that I had to get up at 3:30am, get dressed, drive almost 2 hours, then do the test.\n\nCue malicious compliance. If I was going to be inconvenienced by this idiocy, so is my scorer. I would show up for the test, sign in, do one pushup, one situp, one lap and call it good. Drive to my unit and report that I failed the PT test and go to work and still get paid. Every month. \n\nMy 1st Sergeant pulled me aside one day and asked what was going on. He said he knew I could pass the test. I explained that I already passed the test but that the Lieutenant never passed kindergarten counting. If they wanted to hold the PT test during duty hours, I'd be more than happy to try to pass, but there was zero incentive for me to do so as long as I had to drive two hours to take the test at 5:30am.\n\nAnother drill weekend, it snows quite a bit and it slows my drive down so I get to the PT test a few minutes after it started. The LT in charge said it was too late and I couldn't start now. OK, whatever, drive to my unit to report in that I wasn't allowed to take the test. Then I'm informed I'm getting an unsat for refusing to do the PT test and wouldn't be paid for that UTA. Ok, if I'm not being paid, I'm leaving and will be back in four hours. \"Nope, if you leave you'll get another unsat.\" I realized then, that means I don't have a good year, I'll only have 49 points. Fuck it, I quit then. I had over 18 years in, re-enlisted for 6 more right before the failed PT test I passed and I just walked away. No more stupid chicken shit and no more losing money. \n\nIn years past, some National Guard units were known to carry soldiers on their rolls. The unit would report that the soldiers were present for duty when they were not and unit administrators would pocket their pay, or create company slush funds. Sometimes, those soldiers were almost ready to collect pensions and were kicked out and the state saved those pension payments. Now, after 18 years, soldiers are locked in and units are unable to discharge them. You can quit, like I did, and ask for a discharge and the National Guard bureau will kick it back, denying it, like they did with me. I still had four years on my current enlistment. They wouldn't, and couldn't, release me. \n\nMeanwhile, the State National Guard bureau would get a report of soldiers not showing up for drill. My name kept appearing. Uncomfortable questions were asked why someone with all this time in at my rank would just walk away. My situation became an embarrassment for the state. How are they going to get my name off this report every month? Why did this happen? How did we fail a soldier with one year left until retirement eligibility? \n\nA friend of mine was a senior NCO and in one of these meetings he raised his hand and volunteered a way to get me off this list and not do anything illegal or fraudulent. I was transferred to his unit, I attended drill at this unit, just a few miles from my house on my days off, during the week, and reported to him. All I needed was 50 points and that would give me a good year and I could retire with my 20 years in. I could also do military correspondence courses for retirement points, which wasn't available when I \"quit\". \n\nWhen I attended enough UTA's and completed the courses, I got my 50 points, I received my eligibility for retirement letter and promised my friend he could have half of it.\n\nUnfortunately, my friend passed away at age 55 a year or so after he finally retired after 30+ years in uniform. At his funeral, another retired senior NCO spoke and reflected on my friends  ability to think outside the box and referenced my situation. Yes, I'm happily collecting my pension, but I'll never forget him and what he did for me.\n\ntl;dr\n\nNational Guard unit tried to fuck me over on a promotion, I quit and retired anyway.",
        "created_utc": 1674619792,
        "upvote_ratio": 1.0
    },
    {
        "title": "Penalised for inquiry",
        "author": "EmployeeOnly9642",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/10knuuz/penalised_for_inquiry/",
        "text": "2 years ago, I was hired to manage a national program and pulled from my home state, a desirable tropical location, to live in the mainland for the company because it requires high travel time and expense that would be hard to navigate from a remote island.\n\nLast month, I was invited by my home tropical location to come visit their local programs that pertain to my national position and approved for travel there by the national company. One night (out of 5) of the housing accommodation I booked was above company budget, so I sent HR a request that I would be happy to pay the difference for the hotel. My son was born next to this hotel and spent the first 4 months of his life there in my husbands company’s dime at the time 5 years ago, it’s a special place to our family. I expected my company to calculate the difference in policy approved lodging vs the cost of the expensive room and send me a check request for the difference, or at least advise me on how to navigate the request, which I was entirely transparent about. Also, it’s company policy that family can travel with you for business as long as their expenses aren’t included in your accounting. Which they weren’t, aside from the single night in the overpriced room, which is why I made the inquiry for guidance.\n\nI was met with a formal disciplinary warning for misuse of company funds and now they’re requiring I document every single movement, payment, and request of trip for approval ahead of transaction, which is not company policy. I was also asked retroactively to pay for the trip entirely on my personal expense, which was later redacted partially after I resisted. I have no history of abusive credit card use with the company and was perfectly transparent about the request. I am not willing to waste my time documenting every move I make for no policy or behaviour  related reason and I’m super uncomfortable. I want to rage quit and go home to my tropical paradise, despite moving my whole life from there for this job. I’m very disappointed because I loved this job until this bizarre issue came up. Any advise how to deal? I absolutely don’t want to be insulted by wasting my time documenting things as if I’m guilty of theft, when theres no basis for it.\n\nCurrently I’m being asked to pay for the work night at the overpriced hotel entirely at my expense, as well as not being given any weekend days for the 3 week trip (I’m visiting multiple states), and having my every move monitored due to my transparent inquiry to HR. I’m deeply conflicted about how to respond.",
        "created_utc": 1674614335,
        "upvote_ratio": 1.0
    },
    {
        "title": "tell me how to stack products? ok! let me redo all the work halfway through!",
        "author": "kaburnicas",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/10klkax/tell_me_how_to_stack_products_ok_let_me_redo_all/",
        "text": "I'm not sure if this belongs here or petty revenge but I think it's more malicious compliance. I work at a factory that makes those little Plastic pieces you put in dirt to mark plants. For my job I don't operate the press, I pull product off it, measure it, and put it on a pallet. There's this press operator who's extremely picky to a point where it's annoying and bothers me quite a bit, let's call him bob. Bob like to take bundles of product and restraighten it and tell me how to do tiny things that don't have any impact on the final product, things like them not being perfectly straight, what direction I need to start a stack (from my station the pallets go to packaging so as long as the bundles stay the same direction, the way you start doesn't matter) things like that because \"if I mess up it's his head\". I'm contracted through a different company so it's not his head, it's mine. My malicious compliance starts when he says I need to put the odd bundles out in the middle and not flush with the side (it doesn't) and that if I can't do it right I should find another job. Do it how you tell me? If you insist! I started taking every bundle and restraighting it, making sure it was perfectly flat and putting the odd bundles in the middle. We had gotten 47 out of 50 bundles done when I started \"fixing\" everything. I also double checked that in his eyes he was the boss and if I messed up it was on his head, which he confirmed. He followed me back explaining that's why he was so picky even though I had told him it was on my head and watched me move a bundle to the pile I had \"fixed\". He gave me a confused look and asked me what I was doing to which I replied \"I'm just doing it the way you taught me, I don't want you to get in trouble!\". He told me that wasnt what he meant and to put them back how they were originally, to which I asked \"you want them *exactly* how they were?\" And he said he did. I had gotten a few layers down and when I Put them back, I put them *exactly* how they were, with all but one odd bundle flush with the side. Not much has happened since. Was it petty? Yes. Was it rewarding? Also yes",
        "created_utc": 1674607780,
        "upvote_ratio": 1.0
    },
    {
        "title": "You only pay mileage for the shortest possible trip? Ok, then you have to pay my tolls. An Update.",
        "author": "newtekie1",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/10khc25/you_only_pay_mileage_for_the_shortest_possible/",
        "text": "First, I want to apologize for not getting this update to you all sooner. December and January are my busiest times and I just haven't had the time to sit down and write it out.\n\nHere is the link to the original post: [https://www.reddit.com/r/MaliciousCompliance/comments/vimvmr/you\\_only\\_pay\\_mileage\\_for\\_the\\_shortest\\_possible/](https://www.reddit.com/r/MaliciousCompliance/comments/vimvmr/you_only_pay_mileage_for_the_shortest_possible/)\n\nThe TL:DR of the original is a new bookkeeper at my company accused me of stealing from the company because I was taking a slightly longer route to and from our satellite office. The company was reimbursing me for milage. She insisted I take the shortest route, said the company will only pay for milage for the shortest trip, and there would be no further discussion on the topic. I had her put this all in writing in an email to me. This saved the company about $5.85 in milage every 2 weeks, but it costs the company about $130 in tolls every 2 weeks.\n\n**Well on to the update.**\n\nThis extra cost to the company went on all last year. By my estimates it cost the company about an extra $6,500 last year.\n\nSo the 3rd week of December we have our annual budget review with all the department heads. It's usually just a quick chit chat about how things went over the year, then we all get a nice catered lunch. This year went a little different.\n\nFirst, Karen bookkeeper asked that we have a projector set up in the conference room so she could give a presentation on how much she has saved the company since she was hired at the beginning of the year. This was great for me, I prepared my own presentation.\n\nShe starts off the meeting going over each department, going over the changes she has made to save money. Her big cherry on top of her savings was how much she has saved by cracking down on excess expense reimbursements. Now, I should say here, that she is not liked by any of the department heads. Most of the employees have complained to their department heads about her bull, and they've been forced to just take the complaints with no power to do anything about it. I, on the other hand, am a 1 person department.\n\nSo, her presentation ends with a big hooray on how cutting down on expense reimbursements has saved the company a whole $3,500 last year.\n\nThen we start going over each departments budgets. Everything is going normally until they get to my budget. \"Wait...why is it so far over budget?\"; my boss asks.\n\nAnd this is when my short powerpoint gets played. I bring up the first slide. It's the slightly longer route I was taking between offices. I explained this was the route I was taking and what the milage reimbursement was. The next slide was the new shorter route. I explained that Karen forced me to take this route because the milage reimbursement was less, saving the company about $5.85 every 2 weeks(a little more after the milage rate went up in July).\n\nThen I showed them the next slight of Karen's email included in that email is a part about this being final and there will be no further discussion on the matter.\n\nThe final slide was all the toll reimbursements I was paid over the year, including the appproximate total YTD that was a result of this new shorter route. I explained that had I been able to discuss the matter with Karen, I could have explained that the shorter route had these extra tolls. And I said that's the reason I'm so over budget this year.\n\nThe room was silent for what seems like forever. Then the owners of the company asked everyone except Karen to step out of the room for a few minutes. When the door opened back up, Karen walked out silent, went to her desk and started packing up her things.\n\nThat was the end of Karen.",
        "created_utc": 1674597002,
        "upvote_ratio": 1.0
    },
    {
        "title": "[Update]You only pay mileage for the shortest possible trip? Ok, then you have to pay my tolls.",
        "author": "newtekie1",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/10kgzq3/updateyou_only_pay_mileage_for_the_shortest/",
        "text": "[removed]",
        "created_utc": 1674596163,
        "upvote_ratio": 1.0
    },
    {
        "title": "Make fun of me and dont allow me to talk? Okay.",
        "author": "meloqnn",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/10kgk73/make_fun_of_me_and_dont_allow_me_to_talk_okay/",
        "text": "In 5th grade I went to a new school, here in my country school system is different but that doesn't matter. It was not easy to make friends, at all. There is this one girl who I'll call Anne. Every time I would literally say anything no matter what, she would either roll her eyes or just say \"stop talking you are annoying\" or \"you said that 1000 times\" even though I never mentioned whatever I said ever in front of her.\n\n&amp;#x200B;\n\nIn 7th I had enough. We had this after school activity which I don't know how to translate but in it we had to like \"have a fake family and plan trips, food, house etc\" Anne was the mom of one family and I was her daughter. When our teacher assigned me in the family she just rolled her eyes and was like \"why her! noo!!\". I got covid around this time and couldn't go to school for like 2 weeks. During that time, all of the \"family members\" made a gc without me, had a whole presentation to make and no one even told me.\n\n&amp;#x200B;\n\nWhen I came back and found this out I got very angry. And to add salt to the wound, Anne told me that there was a \"family portrait\" but that the girl who drew didn't include me in the drawing. There was no portrait at all, she was lying, but back then I thought that there really was a portrait.  When I got home I just started crying. My mom talked with Anne's mom (which is not something that I wanted but alright...) . After that she just \"apologized\" (she didnt mean it). I confronted her about not adding me to the fam gc. \n\nEver since that no one talked to her. Everyone just gossiped about her and said how she is so 2 faced. (which is true). She cried in history class bc the teacher yelled at her for something THAT SHE DID. Ever since then everyone hated her and laughed at her.  Even after this she tried gossiping with me about a girl I am friends with and I refused. Btw she just uses the friend for homework and stuff and always gossips about her. When I told the friend that she stopped talking to her and sending her anything at all.\n\n&amp;#x200B;\n\nlike I said idk if this belongs here but i rlly wanted to share this.",
        "created_utc": 1674595122,
        "upvote_ratio": 0.99
    },
    {
        "title": "You want to force the problem upon me? Have fun dealing with my phone calls.",
        "author": "TheIrishBearcat",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/10keijz/you_want_to_force_the_problem_upon_me_have_fun/",
        "text": "I moved into a house that I was renting from our landlords (lovely people, BTW). They had an account for the house, since they were the legal owners of the house. I told the energy company that I wanted to temporarily take ownership of the account as I was nominated to be in charge of paying our gas and electric bills while my friends and I lived there, but I was told that I can’t and that I’d have to create a separate account under my name. Mind you, I’m only 22 years old, and this is my first time dealing with utilities. I had been paying into a (what I later found out to be) redundant account for months, all while our landlords were getting bills for their account, and it got to the point where the energy company was saying that they’d cut off service to the house if we didn’t pay the next bill. I got on the phone with them and *finally* managed to put my name on the correct account. I check the account, and I see that there’s a $1,000+ charge on the account. Mind you, I had been making payments *on-time* into that redundant account on the order of $950 over the course of multiple months. The energy company was being difficult to deal with when we first moved into the house and had continued to be so all throughout. You want to make my life stressful? Alright, just be prepared to get pestered with phone calls. I pester them with 45 minute long calls once a week to keep getting shit moving along, and I finally got them to transfer the funds I had paid into that old account over to the correct account. Never fuck with someone who has the time and patience to fight BS with a phone in hand.",
        "created_utc": 1674590223,
        "upvote_ratio": 1.0
    },
    {
        "title": "Unknown person added to Spotify family plan",
        "author": "Orphodoop",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/10keg81/unknown_person_added_to_spotify_family_plan/",
        "text": "I don't know who this person is or how they got into my family plan. But I love the solution I decided on.\n\nI checked out their playlists and discovered it's nearly all rap with explicit lyrics. Instead of kicking them from my account, I turned on their explicit content filter.\n\nI just wish I could observe their reaction.",
        "created_utc": 1674590061,
        "upvote_ratio": 1.0
    },
    {
        "title": "Take care of it myself? Alright.",
        "author": "throwaway20232023202",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/10kdoru/take_care_of_it_myself_alright/",
        "text": "My apartment is not up to code. Most of it I was willing to deal with but my stairs are falling apart. I brought this to my landlord’s attention and they said that there’s nothing wrong with the stairs and to keep using them. My wife fell down them because of how unsafe they are so we again told the landlord and they once again said be careful the stairs are fine. We explained that they are in-fact not safe so they told us “you can deal with it yourself if you want but we aren’t doing it”. Those where the magic words. I called the county and told them that my stairs aren’t up to code and they got an inspector out here fast. He didn’t even look the stairs over that well before saying “nothing here is up to code. These whole stairs need to be torn apart and replaced. They’re so bad I’m condemning them” so they now only have 15 days to tear down and replace them. I was surprised at that but not upset. I told him “there’s also stuff inside that isn’t up to code.” And he wrote all of it down and in total it’s thousands of dollars of repairs required within 15 days. I would have been happy if my landlord had just done minor repairs to the stairs that would have cost a couple hundred dollars but now they have thousands in repairs they legally have to do within two weeks. Shouldn’t have told me to take care of it myself",
        "created_utc": 1674588183,
        "upvote_ratio": 1.0
    },
    {
        "title": "the day pay per call backfired",
        "author": "ithestormband",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/10kd7ij/the_day_pay_per_call_backfired/",
        "text": "This was 3 years ago. I no longer work for the company for stupid reasons I'll get into later as it deals with the premise as well.\n\nI worked for a phone insurance company as a customer representative working from home.\nJob wasn't hard, paid training and 3k sign up bonus for work from home employees.\nThe job stated it was 16/h and then we all got bumped to 17 once training started.\n\nIn the middle of training our supervisors told us that they were implementing a new pay policy that involved tying into more of a sales role.\nWe now had the 'choice' to be pay per call or hourly.\n\nSince they highlighted the choice it made it seem like we'd have the option to stay hourly.\nNope.\nHad to try the new pay for 6 months before you were allowed to submit a request to go back to hourly.\n\nThe pay is aligned like this:\n$1 dollar per call.\n$20 is added if a sale is made on the call.\n$2 if the customer was happy with the service.\n\nThis was to drive sales and put in your head that without sales you aren't eating.\n\nMalicious compliance:\n\nIn the beginning of the new year 2021 our system got hacked and we were down for a day.\nUsually I got 30-50 calls per day with 3-4 sales.\nWhen the system went down we were given a outage script and told to hangup immediately after.\n\nI'm a very fast talker when needed and immediately saw the chance to make my biggest pay check.\n\nIn the span of a 3 day outrage I had taken over 900 calls.\n\nAnd my next check was the last installment of the bonus.\n\nI told my supervisor that we will get paid the 3 dollars per call still and they said yes. \nEnded up getting a check of over 3k just for the calls from those 3 days plus 1k for being the last installment of the bonus plus my sales for the 2 weeks.\n\nLater got fired because the laptop they issued got reset and I couldn't log in anymore.\nCalled it and they told me to submit a ticket.\nCouldn't submit ticket cause I didn't have access to system.",
        "created_utc": 1674586998,
        "upvote_ratio": 1.0
    },
    {
        "title": "Enter the Matrix",
        "author": "jbdubya2",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/10kd0ww/enter_the_matrix/",
        "text": "[removed]",
        "created_utc": 1674586575,
        "upvote_ratio": 1.0
    },
    {
        "title": "You're not sharpening those drill bits correctly, Sergeant.",
        "author": "slice_of_pi",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/10k9udk/youre_not_sharpening_those_drill_bits_correctly/",
        "text": "**TL:DR - Army Lieutenant discovers who actually runs the unit.**\n\nI feel like WW2's chock of military stories is one of those bottomless veins of gold, where you discover more, the more you dig.  This story comes to us from my grandfather, from whom I inherit my love of pranks, most of my sense of humor, and probably my deep appreciation for schadenfreude - like many of his stories, I heard this one as a kid many times, usually in front of a fire with snow falling outside, and *always* accompanied by an eyeroll and a tart comment or two from my long-suffering grandmother.\n\nGramps was a master machinist, going into the war, and he had quite a bit more experience than most people with engines and engineering.  He was one of those guys that would look at just about anything mechanical with both reverence and a critical eye for making it *better*, and his knack for success inspired the Army Air Corps to snatch him up and plop him back down in the Midwest as a crew chief.\n\nMy understanding - and, I don't have any military experience here, but this is what I've been told - is that the senior NCO in charge of the maintenance, repair, upkeep, and general functioning of a squadron is the guy that actually owned those planes.  From what Gramps always said, his attitude was that he loaned the pilots *his* planes, and they were expected to bring them back in roughly the same condition as they were in when they went up.  When they were on the ground, the aircraft and everything used to maintain them was part of his kingdom.\n\nOne fine day, a very new, fresh-out-of-the-box Lieutenant, still with that New Officer Smell, introduced himself to Gramps and the other guys in the unit, as they were sitting in back of one of the maintenance bays, sharpening up a big double set of drill bits that'd been getting more use than usual....and by introduced, I mean came in shouting about how they were doing it all wrong.  He knew all about what they were doing, of course, and so just *knew* that the drill-bit sharpening they were doing was actually going to ruin the bits and waste war resources, and did they want the Krauts to **win???**  He showed them all the right way to do it, and wasn't going to take any lip.\n\nMy grandfather was not the sort of guy that was able to keep his mouth shut, which is probably another reason they put him in charge of mechanical things that tended not to get uppity with him (I also inherited this congenital condition, but that's a separate tragedy entirely).  He protested that the Lieutenant's direction actually was incorrect, and got about 2/3 of the way into what he was about to say before the officer decided that he'd had enough back-talk, and gave him weekend night-shift guard duty.  Gramps eyeballed him a bit, and would always say at this point in the story that he felt compelled to obey the Lieutenant, because he was just so....*shiny*, so he smiled and said, \"Yes, sir,\" shut his mouth, and that was that.\n\nThis was well before the Army had put tons of resources into things that weren't war-critical - the \"airbase\" Gramps was stationed at was essentially a dirt/grass airfield, with hangars plopped down, and utterly without any pretense at pavement anywhere in sight.  Consequently, the main traffic artery right behind the hangars, and which one had to go down when entering or leaving the base at all, was parallel to the airstrip and was the sort of thick, gooey, sticky, oobleck-mud that one gets in Nebraska when it's been raining a lot and people have been driving Army jeeps over the same patch of ground repeatedly.    About halfway down, in the middle where the traffic had been heaviest, there was what Gramps described as a \"puddle\", and which he later clarified was nearly three hundred feet long, thirty feet wide, totally unavoidable, and which would swallow up the unwary interloper who didn't keep going - go too fast, or too slow, and you're fucked one way or the other.  Go through slowly and *don't stop*, and you'd probably be okay.\n\nGramps positioned himself on Saturday night with his rifle and, grimly determined to protect this Nebraska airbase in the middle of fucking nowhere from the Huns, waited about two thirds of the way down this Charybdis-like vortex, and waited.  Lt Shiny, along with a lot of the other guys on the base, really liked taking his weekend pass in town, because there were *girls* there, which any self-respecting soldier knew was an opportunity one did not lightly pass up (and which was the reason that Gramps had been assigned *weekend* sentry duty, as just an extra little fuck-you).\n\nPretty soon, Lt Shiny came trundling back to base...and not in an Army Jeep.  Oh no.  His family evidently had money, or pull, or something, because he had an actual nice car to get around in, with those big swoopy fenders and the floorboards just outside the doors on both sides.  He was playing it safe, Gramps said, by not driving down the middle of the road masquerading as a muddy pond - he was going along the side where it wasn't quite as deep and he was less likely to get stuck....but that also meant that the driver's side of the car was almost overhanging the deepest part of the mud.\n\nYou can probably see where this is going.\n\nThe duty of a sentry, of course, is to stop anyone they don't recognize from being on the base or near anything vital, and while Gramps knew perfectly well that Lt Shiny was where he was supposed to be, he *also* knew that there was no way in hell during war-time he was going to get questioned about it...so he advanced, just as Lt Shiny got abreast of a particularly bad spot and hollered **\"HALT!!!!\"** in his best Drill Instructor voice.  It got the message across, and the car stopped immediately (danger, Will Robinson...).\n\nWindow rolls down.... Top of Lt Shiny's head pokes out, and he yells back, \"Lt Shiny, sentry, returning from off-base pass.\"\n\nGramps yelled back, from about 30' away, \"Advance and be recognized,\" meaning, of course, *I can't see you clearly where you are, come to where I can see you.  Or else.*\n\nFrustrated, Lt. Shiny opened the door (dangerously close to the surface of the awaiting mud) and leaned out so the light caught him.  He was in uniform, of course, all duded up as Gramps said, and wearing decidedly non-regulation boots with his uniform that came up to his knees and were polished to the sort of shiny finish that NASA uses on telescope mirrors today.  He yelled back again who he was, and was obviously frustrated and hoping he hadn't just gotten stuck....but he also hadn't gotten any closer as he'd been commanded to by the *very armed sentry* that had just challenged him, and on some level he knew it.\n\nNext steps....racking a round into the chamber as a warning, and a repeated command.  \"Advance...and be recognized.\"\n\nDesperate, but knowing there was no way out of this other than forward, Lt Shiny stood on the floorboards of the car, now just level with the surface and starting to inch closer to it slowly, and declared himself again, and was greeted with a loaded weapon pointed at him, and a repeated command to advance and be recognized.\n\nI asked Gramps once what would have happened if he'd actually shot Lt Shiny, and he always said he was pretty sure he'd have been court-martialed at the least, but goddamn it if he wasn't determined to make a point about this....and so, Lieutenant Shiny finally stepped off the sideboards of his car, sank immediately to his knees with muddy goo slopping over the top of his boots, and sadly advanced.  Gramps let him get two steps forward, before shouldering his weapon again and snapping him the smartest of salutes.\n\n\"Sir, thank you.  You may proceed.\"  Lt. Shiny sadly got back into his car and valiantly tried to get it moving again, to no avail.  Mud was everywhere, inside and out, mud flying everywhere as his wheels spun....and eventually, he gave up and trudged off to his barracks.  By morning, they ended up having to use two jeeps and a come-along to yank that car out of the mud.  Gramps said that he got talked to briefly by someone above Lt. Shiny and basically told *don't do that again*, but he said nothing much further came of it.\n\nOddly enough, the subject of sharpening drill bits never came up again, and Lt Shiny was always very careful about staying out of the maintenance bay unless he was going to be taking an aircraft up.",
        "created_utc": 1674578851,
        "upvote_ratio": 1.0
    },
    {
        "title": "Want to switch sections? Okay.",
        "author": "iamjayjayisme",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/10k9d77/want_to_switch_sections_okay/",
        "text": "A couple of years ago I was waiting tables at this restaurant in Jersey.  This story took place during our slow season and it was pretty competitive between all the servers.  Every server wanted the better section and the bigger tables since our overall tips were lower than usual.  We didn’t pool tips.   It got pretty cutthroat at times.  I was doing okay financially so I wasn’t as money-hungry as everyone else.\n\t\n\nI personally get time anxiety so I hate being late to things.  So if my shift starts at 5, I’m walking into work at 4:45 to get settled, then clocking in at 5 to get to work.  My coworker Kayla however had a different attitude.  She would walk into work at 5:00 on the dot and clock in and then head right to the bathroom to put on her makeup which took her about 15 minutes.  On most days it was slow enough that it wasn’t an issue but it still wasn’t right.  Call me old fashioned but when your shift starts at 5, you should start working at 5 and not apply makeup while on the clock while you have other duties to take care of.  I’ve never had to deal with putting on makeup but it just seemed to me that she should’ve taken more time while getting ready to come to work to put it on.  I always let it slide because I’m non-confrontational but it bothered other co-workers however management never got around to addressing it.\n\t\n\nOne day I walked in at my usual time and as I clocked in at 5 I saw Kayla clock in as well and scurry off the bathroom.  I roll my eyes and walk over to the host station where there are two people waiting.  The host asked if Kayla was here yet, because she was up for her first table in the rotation.  I told her she was getting ready in the bathroom.  The host rolled her eyes and went to tell her she was going to get sat.  (We all knew she was putting on her makeup, we weren’t going to hassle her if she was on the toilet.)  I didn’t hear the exact back and forth they had but it took longer than I had expected.  The last thing I heard Kayla say was ‘Just switch my section I’ll take the next one, I don’t care’.  So the host sauntered back to me with a grin saying, ‘You’re up for this table, want to help me set it up?’  I’m confused.  Set it up?  It’s only two people?  “Oh no it’s a party of 14.  This is Mr. MoneyBags niece and nephew.  The rest of the family is on their way.”  For context, Mr. MoneyBags (not his real name obviously, but it would’ve been awesome if it was) was a very wealthy and well-known man in our area.  He made his fortune in landscaping and then moved on to real estate.  And believe it or not, he was one of the few affluent people in our area that wasn’t an entitled dick.\n\t\n\nMe and the host set up the table in record time just as the rest of the party arrived.  Everyone began to sat down as I greeted everyone, and just as luck would have it, I gave Mr. MoneyBags a handshake as I locked eyes with a dolled up Kayla as she entered the dining room and she realized that she did to herself.  The next two hours I waited on my 14-top table as Kayla waited on two-tops.  She actually had a table not tip at all (which is awful and I don’t condone, but in this particular situation oh well).  And of course she kicked herself again when she looked over at my table’s check and saw the fat tip I was getting off my big table.  Oh well.  Get ready for work before work not at work.",
        "created_utc": 1674577616,
        "upvote_ratio": 1.0
    },
    {
        "title": "Want to switch sections? Okay.",
        "author": "iamjayjayisme",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/10k9cho/want_to_switch_sections_okay/",
        "text": "A couple of years ago I was waiting tables at this restaurant in Jersey.  This story took place during our slow season and it was pretty competitive between all the servers.  Every server wanted the better section and the bigger tables since our overall tips were lower than usual.  We didn’t pool tips.   It got pretty cutthroat at times.  I was doing okay financially so I wasn’t as money-hungry as everyone else.\n\tI personally get time anxiety so I hate being late to things.  So if my shift starts at 5, I’m walking into work at 4:45 to get settled, then clocking in at 5 to get to work.  My coworker Kayla however had a different attitude.  She would walk into work at 5:00 on the dot and clock in and then head right to the bathroom to put on her makeup which took her about 15 minutes.  On most days it was slow enough that it wasn’t an issue but it still wasn’t right.  Call me old fashioned but when your shift starts at 5, you should start working at 5 and not apply makeup while on the clock while you have other duties to take care of.  I’ve never had to deal with putting on makeup but it just seemed to me that she should’ve taken more time while getting ready to come to work to put it on.  I always let it slide because I’m non-confrontational but it bothered other co-workers however management never got around to addressing it.\n\tOne day I walked in at my usual time and as I clocked in at 5 I saw Kayla clock in as well and scurry off the bathroom.  I roll my eyes and walk over to the host station where there are two people waiting.  The host asked if Kayla was here yet, because she was up for her first table in the rotation.  I told her she was getting ready in the bathroom.  The host rolled her eyes and went to tell her she was going to get sat.  (We all knew she was putting on her makeup, we weren’t going to hassle her if she was on the toilet.)  I didn’t hear the exact back and forth they had but it took longer than I had expected.  The last thing I heard Kayla say was ‘Just switch my section I’ll take the next one, I don’t care’.  So the host sauntered back to me with a grin saying, ‘You’re up for this table, want to help me set it up?’  I’m confused.  Set it up?  It’s only two people?  “Oh no it’s a party of 14.  This is Mr. MoneyBags niece and nephew.  The rest of the family is on their way.”  For context, Mr. MoneyBags (not his real name obviously, but it would’ve been awesome if it was) was a very wealthy and well-known man in our area.  He made his fortune in landscaping and then moved on to real estate.  And believe it or not, he was one of the few affluent people in our area that wasn’t an entitled dick.\n\tMe and the host set up the table in record time just as the rest of the party arrived.  Everyone began to sat down as I greeted everyone, and just as luck would have it, I gave Mr. MoneyBags a handshake as I locked eyes with a dolled up Kayla as she entered the dining room and she realized that she did to herself.  The next two hours I waited on my 14-top table as Kayla waited on two-tops.  She actually had a table not tip at all (which is awful and I don’t condone, but in this particular situation oh well).  And of course she kicked herself again when she looked over at my table’s check and saw the fat tip I was getting off my big table.  Oh well.  Get ready for work before work not at work.",
        "created_utc": 1674577563,
        "upvote_ratio": 1.0
    },
    {
        "title": "Want to switch sections? Okay",
        "author": "iamjayjayisme",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/10k99do/want_to_switch_sections_okay/",
        "text": "     A couple of years ago I was waiting tables at this restaurant in Jersey.  This story took place during our slow season and it was pretty competitive between all the servers.  Every server wanted the better section and the bigger tables since our overall tips were lower than usual.  We didn’t pool tips.   It got pretty cutthroat at times.  I was doing okay financially so I wasn’t as money-hungry as everyone else.\n\tI personally get time anxiety so I hate being late to things.  So if my shift starts at 5, I’m walking into work at 4:45 to get settled, then clocking in at 5 to get to work.  My coworker Kayla however had a different attitude.  She would walk into work at 5:00 on the dot and clock in and then head right to the bathroom to put on her makeup which took her about 15 minutes.  On most days it was slow enough that it wasn’t an issue but it still wasn’t right.  Call me old fashioned but when your shift starts at 5, you should start working at 5 and not apply makeup while on the clock while you have other duties to take care of.  I’ve never had to deal with putting on makeup but it just seemed to me that she should’ve taken more time while getting ready to come to work to put it on.  I always let it slide because I’m non-confrontational but it bothered other co-workers however management never got around to addressing it.\n\tOne day I walked in at my usual time and as I clocked in at 5 I saw Kayla clock in as well and scurry off the bathroom.  I roll my eyes and walk over to the host station where there are two people waiting.  The host asked if Kayla was here yet, because she was up for her first table in the rotation.  I told her she was getting ready in the bathroom.  The host rolled her eyes and went to tell her she was going to get sat.  (We all knew she was putting on her makeup, we weren’t going to hassle her if she was on the toilet.)  I didn’t hear the exact back and forth they had but it took longer than I had expected.  The last thing I heard Kayla say was ‘Just switch my section I’ll take the next one, I don’t care’.  So the host sauntered back to me with a grin saying, ‘You’re up for this table, want to help me set it up?’  I’m confused.  Set it up?  It’s only two people?  “Oh no it’s a party of 14.  This is Mr. MoneyBags niece and nephew.  The rest of the family is on their way.”  For context, Mr. MoneyBags (not his real name obviously, but it would’ve been awesome if it was) was a very wealthy and well-known man in our area.  He made his fortune in landscaping and then moved on to real estate.  And believe it or not, he was one of the few affluent people in our area that wasn’t an entitled dick.\n\tMe and the host set up the table in record time just as the rest of the party arrived.  Everyone began to sat down as I greeted everyone, and just as luck would have it, I gave Mr. MoneyBags a handshake as I locked eyes with a dolled up Kayla as she entered the dining room and she realized that she did to herself.  The next two hours I waited on my 14-top table as Kayla waited on two-tops.  She actually had a table not tip at all (which is awful and I don’t condone, but in this particular situation oh well).  And of course she kicked herself again when she looked over at my table’s check and saw the fat tip I was getting off my big table.  Oh well.  Get ready for work before work not at work.",
        "created_utc": 1674577338,
        "upvote_ratio": 1.0
    },
    {
        "title": "The AntiChrist Among You",
        "author": "RexTheAntiChrist",
        "url": "/user/RexTheAntiChrist/comments/10k1558/the_antichrist_among_you/",
        "text": "",
        "created_utc": 1674552377,
        "upvote_ratio": 1.0
    },
    {
        "title": "Won't pay me for days in traveling without work to do? OK!",
        "author": "djskaw",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/10jzvst/wont_pay_me_for_days_in_traveling_without_work_to/",
        "text": "To start off, this was one of the best bosses I ever had, but it was a new team and he was learning how to manage a team that traveled 100+ days per year. I had already been doing similar work for a few years, so I knew the ropes. \n\nI am based in Seattle. I had 3 events in New York in about an 8 day span. One day for each event.  I asked my boss if I can stay in NY between events, expense the hotel and bill my 8 hours a day. He said if I'm not working, I can't bill my hours. \n\nOK. Malicious compliance activated. \n\nI flew home between each event, billing 12 hours travel time per flight and each flight was double the price I would have spent on the extra hotel nights. \n\nI sent him my expense report and timesheet.\n\n\"OK. Next time you can stay and bill your 8 hours plus hotel.\" \n\nHe never questioned me again. I even got my Hawaii vacation paid for because coincendently, an event popped up in Hawaii during my vacation that took me half a day to do and I showed him the numbers of my flight and hotel that I booked months before was way cheaper than sending one of my coworkers. I told him I will work it if he paid for it all (included my friends hotel) and he said yes.",
        "created_utc": 1674544665,
        "upvote_ratio": 1.0
    },
    {
        "title": "Obeying Orders from Family",
        "author": "Appropriate-Estate77",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/10jwo7d/obeying_orders_from_family/",
        "text": "My nephew (23) has been troubled with drugs and alcohol since his teenage years. Him and his wife have a real bad domestic violence relationship. ( it’s actually on both sides). He is a nightmare to us all when he drink. He has stolen my grandma’s car and wrecked it and many other things like demanding that things be done his way right then. Well, tonight he got out of hand again and bit my grandmother’s phone line in to pieces. I got hot.\n That was the last straw. My sister told me to handle it so I did and turned him in for taking the car. Now there may be some peace.",
        "created_utc": 1674533107,
        "upvote_ratio": 1.0
    },
    {
        "title": "Our Salty Teacher got a taste of his own medicine when a student responded to his bad attitude.",
        "author": "jaddy_",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/10jvn9g/our_salty_teacher_got_a_taste_of_his_own_medicine/",
        "text": "I 16F take World history AP which is one of the hardest classes you could take to receive college credit in high school. This story actually happened to my friend that takes the class, but I thought it was too good to not share with the world of reddit.\n\nIt really all starts at the beginning of the year when we first entered his class. The first red flag was the first thing he said was \" guys I know some of you make want to drop this class but I recommend you don't, I'll have the councilors send you right back to me. \" . The second red flag was that we as a collective asked his past students about him and them all say he was ASS.  Even the ones from TWENTY  YEARS AGO complain about him . In my opinion that's just crazy to me . I WOULD ALSO LIKE TO SAY THIS MAN IS A PATHOLOGICAL LIAR . He says things and just takes it back or completely lies . Like the way I've learned not to trust a thing he says is just wow . \n\nSo, Let's get to the actual story.  \n\nmy friend P ,16F had been in his class for a semester before she was forced to drop the class . He had never liked P from the beginning and he would just at random times call her out for either talking quietly or not paying attention , when the literal other half of the class is sleeping . He would even send her parents emails and complain about her in ridiculous ways . He would nit pick little things and complain in a long rant over email to her parents. So of course came n=time for parent teacher night . Her mother came in . (her mother is Latina and her father is white ) . Our dear teacher decided as the \"cultured white man' (he makes his whole personality about how he has friends of different ethnicities and how he travels, tries different foods and speaks like eight languages,  he is obnoxious and brings it up anytime he gets the chance he even said once that he would take away a kids Asian card {AS A WHITE MAN} ). P mom was speaking in English until P's grandma called , then P's om switched to Spanish . He took this as an opportunity to talk to p's mom in Spanish for the rest of the conference. he basically talked shit about P the whole time in Spanish of course . Later on, we had an assignment in class that P couldn't get to because she was taking care of her grandmother (P is a licensed care giver / nurse, I don't know her exact title but she is qualified by state and went through program to get that ) . The teacher said that he wasn't going to take it late because she should have done it on time , and it should not be her job / focus to take care of her grandma, or any other patients that she has . P then asked her dad who is a coach at the school to send the teacher an email to see if she was able to still do the assignment. Th teacher was absolutely; livid and said \"I DONT APPRECIATE YOU SENDING YOUR DAD TO DO YOUR DIRTY WORK \". She of course complained to administration , and they said nothing could be done for P because she didn't have proof of the conversation . A few weeks later he decided to make some misogynistic comment about the way girls dress and stared directly at P because she was wearing shorts. A month later he assigned a project to where you could not turn it in a day late he said \" I will not be taking any projects late , even if you are absent I expect you to take a picture of it at home and send it in that day . I don't even care if you're on your death bed I need your project \" She happened to have an emergency that day and she had to take her baby sister who is about 4 to the hospital (her parents couldn't take her because her dad was at an away game 2 hours away and her mom was out of town at the time . So P left school and took her sister to the hospital and her dad showed up later in the day , when he could make it which was pretty soon for how far he was . P then comes in the next day and tries to turn in her project and he doesn't except it . She begged and pleads and cries , but he rolled his eyes and laughed in her face . She then gets a zero on the project which brings her grade up to a 36. Sh tried to report him to the AP's office but once again they said they couldn't do anything about it . She ends up beings able to bring her grade up to a 68 , but she still had to take his final exam because she did not meet the grade requirement to skip t=he final  (I would also like to add that he gave me shit for not taking the final exam in front of the whole class , he said it was the dumbest thing he had ever heard that I wouldn't take the final to boost my 89 to a 90.He acted like he didn't just give out a review sheet that had 50 topics he had never taught in class 3 days before the motherfucking final) . On the day of the final he then comes back to P's desk and says she has to make a 98 to stay in his class , she makes a 70 and when he read out P's score he smiled in her face . Her comes the part for the malicious compliance .He had told her over and over again to drop his calls and go to on-level world history= , she eventually did but did not go without a bang .She sent over remind which is a classroom chatting app where you can send your teacher messages . She foud away to semd the teacher a message anonymously and this is what she mopther fucking sent \" HI WAS WONDERING WHAT YOUR SEXUALILITY IS SINCE YOUR WIFE LEFT EVERYBODY IS DYNG TO NOW SINCE YOUR A LONELY MOTHERFUCKING THAT STILL BABY(in the CLASSROOM may I add) TALKS THE ONLY THING IN YOUR LIFE , YOUR SWEET DOGS . YOU ARE A SAD BASTARD YOU MOTHERFUCKER . GET A FUCKING LIFE AND GET FUCKED .YOUR WHOLE PERSONALITY IS BEING A CULTURED WHITE MAN THAT JUST SO SAD . I FEEL LIKE THE REASON W=YOU DION'T WANT TO COME OUT OF THE CLOSET IS THAT YOU HAVE DADDY ISSUES . I PERSONALLY THINK THAT ITS BECAUSE YOUR DAD WAS A STRICT MILITARU=Y CATHOLIC THAT ALLOWED YOU TO DO NOTHING WITH YOUR LIFE . ANYWAYS MERRY CHRISTMAS YOU FUCKING SAD SACK OF POTATOES . So P spsppp ***(P is a licensed care giver / nurse, I don't know her exact title but she is qualified by state and went through program to get that*** *)* . The teacher said that he wasn't going to take it late because she should have done it on time , and it should not be her job / focus to take care of her grandma, or any other patients that she has . P then asked her dad who is a coach at the school to send the teacher an email to see if she was able to still do the assignment. Th teacher was absolutely; livid and said \"I DONT APPRECIATE YOU SENDING YOUR DAD TO DO YOUR DIRTY WORK \". She of course complained to administration , and they said nothing could be done for P because she didn't have proof of the conversation . A few weeks later he decided to make some misogynistic comment about the way girls dress and stared directly at P because she was wearing shorts. A month later he assigned a project to where you could not turn it in a day late he said \" I will not be taking any projects late , even if you are absent I expect you to take a picture of it at home and send it in that day . I don't even care if you're on your death bed I need your project \" She happened to have an emergency that day and she had to take her baby sister who is about 4 to the hospital (her parents couldn't take her because her dad was at an away game 2 hours away and her mom was out of town at the time . So P left school and took her sister to the hospital and her dad showed up later in the day , when he could make it which was pretty soon for how far he was . P then comes in the next day and tries to turn in her project and he doesn't except it . She begged and pleads and cries , but he rolled his eyes and laughed in her face . She then gets a zero on the project which brings her grade up to a 36. Sh tried to report him to the AP's office but once again they said they couldn't do anything about it . She ends up beings able to bring her grade up to a 68 , but she still had to take his final exam because she did not meet the grade requirement to skip t=he final  ***(I would also like to add that he gave me shit for not taking the final exam in front of the whole class , he said it was the dumbest thing he had ever heard that I wouldn't take the final to boost my 89 to a 90.He acted like he didn't just give out a review sheet that had 50 topics he had never taught in class 3 days before the motherfucking final*** **)** . On the day of the final he then comes back to P's desk and says she has to make a 98 to stay in his class , she makes a 70 and when he read out P's score he smiled in her face . Her comes the part for the malicious compliance .He had told her over and over again to drop his calls and go to on-level world history= , she eventually did but did not go without a bang .She sent over remind which is a classroom chatting app where you can send your teacher messages . She  decided  to send the teacher a message anonymously and this is what she mother fucking sent\n\n **\" HI WAS WONDERING WHAT YOUR SEXUALILITY IS SINCE YOUR WIFE LEFT EVERYBODY IS DYNG TO NOW SINCE YOUR A LONELY MOTHERFUCKING THAT STILL BABY(in the CLASSROOM may I add) TALKS THE ONLY THING IN YOUR LIFE , YOUR SWEET DOGS . YOU ARE A SAD BASTARD YOU MOTHERFUCKER . GET A FUCKING LIFE AND GET FUCKED .YOUR WHOLE PERSONALITY IS BEING A CULTURED WHITE MAN THAT JUST SO SAD . I FEEL LIKE THE REASON W=YOU DION'T WANT TO COME OUT OF THE CLOSET IS THAT YOU HAVE DADDY ISSUES . I PERSONALLY THINK THAT ITS BECAUSE YOUR DAD WAS A STRICT MILITARU=Y CATHOLIC THAT ALLOWED YOU TO DO NOTHING WITH YOUR LIFE . ANYWAYS MERRY CHRISTMAS YOU FUCKING SAD SACK OF POTATOES .**    \nHe then replies as , this is extremely inappropriate and once I find out who you are I will deal with you . She then returns to school like nothing happens , then he decides to stop her in the hallway and say I hope you're doing better in your new class with a snarky tone . \n\nWhen I tell you I lost my shit once I heard . I  bursted out laughing and enjoyed the rest of my day . I'm just happy that Mr. , sad sack of potatoes posted on linkdin after she sent the message that he is looking for a good job out of teaching . Thank the lord because that man doesn't know how to teach .",
        "created_utc": 1674529860,
        "upvote_ratio": 1.0
    },
    {
        "title": "HR restructure troubles",
        "author": "littlewasknown",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/10juncy/hr_restructure_troubles/",
        "text": "So I work in Health  and I'm also the union delegate for my hospital. I'm often called upon by the Union to offer advice to other workplaces with their issues. I have a bunch of restructure stories that all involve Malicious compliance and for reference this happened in Australia. The only surprising thing about health managers decisions is that they continue to surprise me with \"interesting\" decisions.\n\nSo my union represents everyone in health except Doctors and Nurses. We represent  cleaners, clerks, physiotherapists, speech pathologist ,radiographers, porters, security etc and even managers up to the executive level .The new HR boss  notifies the union of an upcoming restructure and publishes a mammoth 400 page plus document about what they are doing. Its a slash and burn to middle management. Basically making the department head look after three times as much and claim it will improve management of the workforce. It won't. It will strip leadership and clinical oversight out of the hospitals.\n\nWe get to the first meeting to discuss the restructure and HR propose a few things we agree on.\n\n1. That all affected staff will be consulted in a honest and genuine manner\n2. everyone being made redundant will get full entitlements\n3. that union cannot be involved with non union members\n4. All departments restructure will not employ any new staff for two years except for clinical staff.(they thought we were being helpful with this but we had a plan)\n\nThe first department to be restructured is the HR department, the staff(union members) on the ground are left alone however the entire executive(non union members) are let go leaving just the new head of HR. Over a dozen senior HR executive are gone. Now the Head of HR is trying deal with 40-50 HR staff by herself(she did get more pay out of all this) and the restructure in an organization of thousands of staff. We hear stories of her working 16 hours a day seven days a week.\n\nThe head of HR schedule's a union meeting to discuss  the next department to be restructured . We got every manager to document all their concerns plus the staff under them to do the same. First department outside HR to be restructured and we respond with a 300 page document basically expressing concerns and asking over 500 unique questions. We remind her of the first point we agreed on about genuine consultation. She now confesses to that she needs more staff and can we break our agreement?  We remind her of point four of no new new staff for two years. She also  balks at this level of consultation and we head to industrial court where the judge rules in our favour. \n\nShe now has this enormous about of work to do and to respond to over 500 questions. We hear both the ceo and board are very annoyed by the lack of progress. In six weeks we get an email about her going on indefinite leave . we never see her again. Three more Hr managers in next 18 months(none of them could deal with the workload) and the restructure never goes further than HR. No union member job losses.",
        "created_utc": 1674526840,
        "upvote_ratio": 1.0
    },
    {
        "title": "It's been almost a month since my finest piece of malicious compliance.",
        "author": "michaelg1590",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/10jua3u/its_been_almost_a_month_since_my_finest_piece_of/",
        "text": "My (14m) teacher in honors bio is pretty archaic, and doesn't believe in the concept of bathroom passes. As a result, we only get to go to the bathroom in her class 3 times a semester. Once we're out of those, she refuses to let us go. One day last semester, I DESPERATELY needed to urinate, but was out of passes. So, I walk up to her desk, and offer to get in that week's homework in that day in exchange to get 1 more bathroom pass. She refuses, saying \"No exceptions, just pee yourself if you're that desperate.\" I may or may not have taken that too literally, and a few minutes later I volunteered to answer a question, walked up to the front of the room, and let it go...\n\nShe started yelling at me, saying \"gEt To ThE oFfIcE rIgHt NoWwWwW!!!!111\" but I responded in a sarcastic tone, \"Oh my god, i'm so sorry...\" in a way that she thought I was being serious but they didnt.\n\nThe next day, I shockingly didn't get in any trouble, and my stunt with the response managed to ward off bullying. She reset everyone's bathroom pass counter and vowed to raise the limit semester 2.\n\nSemester 2 is now beginning, and she has indeed raised the count from 3 to 5.\n\nAll because I pissed myself.",
        "created_utc": 1674525734,
        "upvote_ratio": 1.0
    },
    {
        "title": "Teacher got my honors taken away for plagiarism for checking answers in a non-mandatory workbook",
        "author": "mayasingsx",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/10jtbpg/teacher_got_my_honors_taken_away_for_plagiarism/",
        "text": "In college I had a French teacher that assigned us these grammar workbooks to do every night in no particular order, and bring the book in to show that we had done just something. So when I was out of time sometimes I would just copy from the back of the book. When covid hit and we had to do some of our classes remotely, we sent in photos of our workbook instead. My teacher said nothing until the very end of the term and he called out every single student for plagiarism and ultimately failed all of us from the class, took away our honors and threatened to suspend some of us who had prior infractions. \n\nI was furious. All of the other students accepted the infraction- suspensions revoked if we all redid the entire workbook (would take weeks!) but I thought it wasn’t fair and I was ready to fight. They seemed to be more concerned about plagiarism rather than not doing the work (because it was ungraded) I talked to them about the infraction and said “how can it be plagiarism if I’m writing in the book the answers came from?” They said because I didn’t cite my sources. I threatened to take it further but they blackmailed me and say they would consider all of my other infractions and I could potentially get expelled (two weeks from graduation) I said okay and I had a plan.\n\nwhen I went to “redo” all of my questions I just put a proper citation next to each question from the back of the book. The chancellor called me in and said even though it wasn’t respectable technically it was passable because I cited my sources so it was no longer considered plagiarism.\n\nGot my honors taken, but passed the course and still got my French major. Bygones will be bygones. Wish I could have done more but that little bit felt good and saved me hours of work that the other students had to do.",
        "created_utc": 1674522930,
        "upvote_ratio": 1.0
    },
    {
        "title": "Said she had to see vomit, OK.",
        "author": "Tyberious_",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/10jsb76/said_she_had_to_see_vomit_ok/",
        "text": "This happened many years ago when I was in 3rd grade but just thought about it the other day.\n\nAs most kids, I did not like sitting in school all day and would play the nausea card to get to go home.\n\nSometimes I even went to the restroom and would return saying I threw up. Usually mom was called and I was picked up and went home.\n\nNow my teacher must have been getting suspicious but I must have been the most convincing 3rd grader ever, right? I guess not, one day I said I was sick and went to the restroom because I was going to throw up. She let me go to the restroom and I did my usual of hanging out for a few minutes, when I came out she was standing in the hall waiting on me. She went in and looked then came out and said I was lying (how dare she 😆)and she heard no vomiting or toilets flushing. As she took me back to class she made the statement that from now on if she doesn't see the vomit it didn't happen. (Or something along those lines).\n\nNow I don't remember if this was the same day or a few days later, surely I was smart enough to wait. I raised my hand and said I wasn't feeling well, she excused me to the restroom. When I got there I thought \"Well, she needs to see puke\", so I gagged myself. Now most will think, now he went and got her and brought her to the restroom; no my brain didn't work like that. As I vomited I caught it in my mouth and went back to class. As I opened the door she asked sort of smugly how I felt, at that moment I \"puked\" right in the middle of the first 2 rows of desk causing my classmates to scramble and my teacher having the most shocked look on her face.\n\nWell, my mom was called and I got to go home but this was not the big win I thought it was. My mom, she was no dummy and had been on to me for awhile. She told me if I kept having stomach problems we would have to start going to the Doctor whenever she picked me up.",
        "created_utc": 1674520055,
        "upvote_ratio": 1.0
    },
    {
        "title": "Well, They Told Me I Had To Show Up",
        "author": "LandboundStar1085",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/10jr4pg/well_they_told_me_i_had_to_show_up/",
        "text": "Weather is calling for a major storm. I am scheduled to work, and being an essential service and shortstaffed, was reminded I could not call off. So, I asked if I could just come in early and stay overnight til it was safe to drive. My boss had no idea how to answer. Neither apparently does anyone in my company. I am having fun that I left work, and they still haven't found an answer. It did not help that I pointed out I could pack a bag and walk to the 24 hour convenience store down the hill and sleep in my car. (No, I am not driving the better part of an hour in a blizzard, so I am having fun watching them freak out.)",
        "created_utc": 1674516887,
        "upvote_ratio": 1.0
    },
    {
        "title": "A loophole in the dress code let me where whatever I wanted",
        "author": "Ok-Love-6269",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/10jlhne/a_loophole_in_the_dress_code_let_me_where/",
        "text": "Ten years ago I worked at a fairly well-known electronic store, where instead of uniforms people were (allegedly) required to dress professionally. The dress code was stringent for men, white shirts and ties were mandatory. Women had to wear white shirts if they wore dress pants, however - if you wore a skirt you could wear any color top.\n\nSo I'd show up to work completely decked out gothed out with dark makeup and triple pierced ears. And No One could say anything about it. They could glare in disapproval, and management conspired against me, but I denied their satisfaction one day when I voluntarily handed over my name badge after three and a half years.\n\nDuring that time I was only sent home to change Once. Cruel irony, it was also the Only day did I come in with a white shirt. They heckled me over fractions of a centimeter on my skirt. Guess they weren't too fond of the school girl get-up😆",
        "created_utc": 1674503119,
        "upvote_ratio": 1.0
    },
    {
        "title": "Company will only reimburse parking, not transit? alright then.",
        "author": "WolfieVonD",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/10jjtri/company_will_only_reimburse_parking_not_transit/",
        "text": "A few years ago, I was working in Downtown Los Angeles, but living in San Diego. For those of you know, that's over 175-mile per day commute. I wasn't about to put my car through that, and so I took the train every morning to Union Station, then backtracked via Subway to the jobsite. The cost of the Amtrak weekly pass was basically the same price of gas, but I thought I'd try to get that extra $3.50/d from the subway covered since I wasn't using the \"parking reimbursement\" in my contract. The $20 or so per week wasn't going to bankrupt me, but I figured I'd try.\n\n\nCame to the boss and asked, basically, \"Since I'm not driving to work and getting reimbursed for parking at $10, could I submit my subway receipts at $3.50 and get that covered?\" And was told to pound sand.\n\n\nNow, the way the reimbursement worked was that you pulled a parking slip when you got to work and paid it at the end of the day. Then, on mondays, you would submit all 5 parking slips from the previous week, and the $50 would be added to your paycheck (untaxed, obviously).\n\n\nSo, every day from then on, when I took the train into work, I just walked into the parking structure and pulled a ticket. I didn't have a vehicle and so I didn't need to worry about paying for the ticket to leave, but the contractor didn't know that. They didn't have access to the system (which is why they didn't validate everyone's parking and skip the middle man) and as far as they knew, I was just driving in like everyone else.\n\n\n&gt;tl;dr - Contractor refused to cover my $17.50/w subway toll in good faith because it wasn't in my contract, and so they ended up paying me the $50/w reimbursement that *was* in my contract.",
        "created_utc": 1674499092,
        "upvote_ratio": 1.0
    },
    {
        "title": "Farewell…",
        "author": "osamalady0810",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/10jh6hs/farewell/",
        "text": "It’s January 23rd 2023, long story short this is the last thing that anyone will ever hear from me. \nMy life has been sh*t up to the earliest age i can remember.. im not gonna sit here and go detail for detail but basically im a failure and I’ve really come to the conclusion that , thats all ill ever be. People will constantly tell you “it gets better” but I promise you for me it hasnt, it never will. Ive come to terms with the fact that this is the only way i can be happy. I tried to many times to fix shit .. to make things better but i always fail.. im destined to be a failure.. i feel like my purpose in life is was just to fail.\nI know my absence wont affect anyone\nI held on as long as i could, I wish I could’ve been a better person.",
        "created_utc": 1674492861,
        "upvote_ratio": 1.0
    },
    {
        "title": "Sharing Household Chores",
        "author": "webstackbuilder",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/10jg150/sharing_household_chores/",
        "text": "[This post](https://www.reddit.com/r/MaliciousCompliance/comments/10i6e2s/college_roommates/) about cooking for room mates inspired me to write my first MaliciousCompliance post.\n\nI learned to cook when I was pretty young (elementary aged) because of family issues. I'm not a chef: I cook home-style, without super expensive / exotic ingredients, and with the intent to feed a number of people. But I've always paid attention when other people cook, read cookbooks, and generally tried to be better at it. I'm also a guy.\n\nNone of the women I've been in serious relationships with in my life had any idea to cook. I don't care; they were all professionals and smart, but didn't grow up in environments that taught them to cook. But it became an issue in my first serious relationship.\n\nShe was in a doctoral psychology program and also did work study. I was in an undergraduate STEM program full-time and worked full-time. I easily put in twenty hours a work more of work than she did, but it didn't bother me. What *did* bother me was cooking dinner for the two of us **every night** during breaks.\n\nSo I made her an offer: I'll cook twice for every time you cook, which meant she had to cook twice a week (we went out to a restaurant together once a week) and I cooked four times per week. If any dinner offers came up, it came out of her share (coincidental since one of her nights was when we usually got invited to eat with one of our families).\n\nThere was a lot of conflict at first, and I didn't get it. I thought she was trying to get out of our agreement (I also did most of the housework and shopping and I felt taken advantage of) because we ended up having take-out on her nights the first few weeks. Since we had a common budget, that didn't feel fair, and I told her that.\n\nSo on the first night that she was going to cook, I stayed around just in case she needed help. We were both in our mid-20s at the time. Finally, she broke down crying in the kitchen. She was going to make mac 'n cheese and hot dogs, but **she didn't know how to boil hot dogs** (no microwave for us back then). More than that, she didn't know how to boil water.\n\nI felt a mix of feeling really bad for the situation and inwardly wanting to... well, laughing wouldn't have been very nice. So I showed her how to put water in a pan, put it on the stove, and wait until it boiled.\n\nThe Malicious Compliance? *It wasn't on my side...*\n\nWe were together for another four years or so after that. We continued our agreement on sharing the housework over that period (e.g. me doing the vast majority of it while working ten or twenty hours more per week than she did). Once she mastered the basics of store-bought mac 'n cheese (boil the noodles, melt butter in a pan, add the prepackaged seasonining, etc.), she never felt the urgency to move on, to grow as an aspiring chef. We had mac 'n cheese and boiled hot dogs 4 years x 52 weeks x average of 1.7 times per week = some 350 more times after that.\n\nIf I asked if she might consider cooking something else \"this week\", she'd say she'd be happy too... except she was really in the mood for hot dogs and mac 'n cheese, so maybe next week?\n\nMy friends started joking (privately, with me) about how wasteful just throwing out all of that dirty hot dog water was, and how many *other* things she could make with it... dirty hot dog water soup, iced dirty hot dog water cocktails, etc. One friend had Dirty Hot Dog Water shirts made and gave them to us for Christmas gifts. I was a little mortified... but my other half didn't get it, thank goodness. One of my friends ended up going the stand-up comedian route, dropping out of school to do it. He ended up pretty successful (staff writer for a popular syndicated sports radio show).\n\n*And he made dirty hot dog water jokes constantly* whenever he got back to town, and some of them made their way onto the sports program he wrote for. One time he came back and did a headline act at the club he got started at on open mic night. He got us a dozen tickets, and our group of friends (and my other half) got premium placement at a table front and center in the club. He did his whole act on dirty hot dog water. Out table was howling in laughter, and every single person in the club was silent (including my other half) until they started booing.\n\nIronically, later in life I discovered what we were really wasting was the pasta water. I've always just thrown it out after cooking noodles. But really, use it anywhere you need water in a recipe and it makes sense - especially home made spaghetti sauce!",
        "created_utc": 1674489997,
        "upvote_ratio": 1.0
    },
    {
        "title": "You are to stop using the expensive Shell petrol station in your town…",
        "author": "SnooPies5174",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/10jd04v/you_are_to_stop_using_the_expensive_shell_petrol/",
        "text": "Remote Manager going through our expenses and fuel cards issued a cease order to stop using our local Shell garage.\nHe had just got a app that gave him the cheapest prices for fuel in any part of the country that set up the email too. \n\nHe gives us the name of the petrol station and address we now have to use. \nSo we all comply after trying to reason with him unsuccessfully. \n\nSo the new garage is 30 minutes drive away from the old petrol station….  To save 2 pence per litre…. \nSo 30 minutes to the station and thirty minutes back to the office at engineers wage rate to save 75 pence !!!!! \nThe favourite sandwich shop was in the same area so we would buy our lunch on the way back. As we were forbidden to eat in the cars or vans we then spent another hour in the canteen.",
        "created_utc": 1674482047,
        "upvote_ratio": 1.0
    },
    {
        "title": "Teenage Malicious Compliance",
        "author": "DOAHJ",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/10jbgn7/teenage_malicious_compliance/",
        "text": "[removed]",
        "created_utc": 1674477340,
        "upvote_ratio": 1.0
    },
    {
        "title": "Move your boots",
        "author": "Horror_Onion1992",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/10j4xef/move_your_boots/",
        "text": "A bit of short, sweet malicious compliance from my darling fiance. \n\nWhen I woke up the other day, his boots were sitting in the bathroom. I said \"You need to get your boots off this bathroom floor please.\"\n\nWell, he certainly got them off the bathroom floor. About twenty minutes later, I go in the bathroom, and his boots are now sitting on top of the closed toilet seat lid. /Sigh",
        "created_utc": 1674452010,
        "upvote_ratio": 1.0
    }
]