[
    {
        "title": "You are all equal. There is no seniority.",
        "author": "tompcomp",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/10e1o3u/you_are_all_equal_there_is_no_seniority/",
        "text": "CDL driver story. Our fleet has claw trucks to fill trailers and shuttle trucks to empty trailers. We have swap points designated across the town based on where the claw trucks are operating removing debris. Shuttle trucks stage empty trailers there and wait for claw trucks to arrive with full trailers. Number of trailers and number of shuttle drivers corresponds with how many claw trucks are operating and time/distance to dump site are all a consideration. You know...logistics.\n\nAs it happened, one day we were short-handed. Immediate supervisor was out. Alternate supervisor was out, too. So me being the senior shuttle driver on the clock made the simple, appropriate plan of action (the same no-brainer I was taught by previous senior drivers) to make sure empty trailers were always available at each swap point.\n\nI tell new driver to go to the east side of the city and handle the east side trailers and run with the 2 other shuttles. Those 3 drivers can easily handle the demand for the east.\n\nMyself and the other senior driver will handle the west side and take on the extra burden of being a man down, but we'll make it happen.\n\nWhile we're away on our run, CB starts going off...my claw trucks are asking where the empty trailers are on the east side. Production is at a halt and we're an hour away. I start having to do the missing supervisor's job and find out where all the shuttles are. Effing new guy just decided to leave the east side and pull west side trailers and run them.\n\nFfwd to supervisor being available.\n\nI relayed the story of how production came to a halt after new guy didn't do what he was told and what will be done about it. Supervisor explained none of us are the boss based on seniority and nothing can be done about it. Oh? This is a surprise. Did something change because we've always had senior drivers running things out in the field? Nope. You're all the same. None of you can tell each other what to do.\n\n10-4. You don't ever have to worry about me telling people what to do again. And don't ask me what they're doing, either. Lol",
        "created_utc": 1673926453,
        "upvote_ratio": 1.0
    },
    {
        "title": "Follow the rules ok!!!",
        "author": "Veriden_",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/10e0ihk/follow_the_rules_ok/",
        "text": "Ok so a few years ago i was working for a typical retail store. The job was easy but, like every job i ended up having that one co-worker. The messed up part is this co-worker was actually my supervisor who we will call Z. So i would come in early or even on days off to do simple task or help get things prepared for shipping back to the warehouse. Now z was technically in charge of making sure this stuff happened but would never do it because a pallet jack is required to move the heavier pallets. Me being me i don’t care because its an extra work out for me until one day when Goofball gets hired. Now goofball is a good guy but  a terrible worker he does not pay attention and often just neglected work. So Z decides to put goofball in charge of prepping pallets for the warehouse. I would still stop by and help just to be certain its done. then,i get lets just say yelled at for coming in when he (goofball ) can do it. Mind you Z has not shown goofball anything so he does not know how to do the paperwork or put hazardous stickers on the pallet etc. sadly he could not even wrap a pallet without help. So after z yells at me I still make sure goofball is ok and he has done everything properly. I.e. i do everything and then he signs off. After leaving i decide I’ve had enough of z being lazy and costing on my work. During z’s rant i remember the words “Just follow the rules”. So i decide to do just that i show up only at my time and leave on time never staying late. Then i stop coming in to help with everything else. Goofball would constantly call and i would ignore him. See goofball liked to brag about everything and made the mistake of mentioning his pay and the fact that he and z have been friends for years. Not only did goofball make more money then me and im training him but was slowly starting to get the better shifts and being required to do less. With that in mind i ignored his calls and proceeded to enjoy my time off. I walk in the following morning and Z is ticked off. I get pulled into the office and demanded to explain myself i say i followed the rules. Z figures out I’m throwing her words back in her face and tells me to leave the office and go to work. Through out the day little comments are made z even offers to buy me lunch. Red flag z is selfish and only does for others when she wants something. So at time to end my shift she walks over and ask if i can cover because goofball called out that morning. I laugh punch out and go home. Skip forward a few weeks the Regional and District manager show up to figure out why the pallets going back are all wrong and missing items as wells as the company had to pay fines for unlabeled hazardous material. Z of course blames me i get pulled into the office and proceed to explain I’m off the day of prep but usually come to help until z blew up on me. The regional manager looks at Z and ask why her and goofball need my help to do it. Z basically said because thats his job. Both upper managers mouths were hanging open and they said you are supposed to know this. Im told to leave they call goof ball into the office he tells them that I’m his trainer and basically he calls me to fix issues. They leave a few days later I’m offered a raise and z has been transferred and demoted and goofball fired. I left shortly after this for a better opportunity but still keep tabs on z who was not promoted again.\n\nSorry my grammar is terrible and I’m doing this from a phone.",
        "created_utc": 1673923193,
        "upvote_ratio": 1.0
    },
    {
        "title": "It’s in the dress code…uh no it’s not",
        "author": "31spiders",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/10e0bxz/its_in_the_dress_codeuh_no_its_not/",
        "text": "[removed]",
        "created_utc": 1673922674,
        "upvote_ratio": 1.0
    },
    {
        "title": "Moving pallets of unknown destination",
        "author": "Muad_Dib_of_Arrakis",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/10dzp1t/moving_pallets_of_unknown_destination/",
        "text": "At my workplace, we have an automated packing machine that uses palletized cardboard. This machine is set in a corner of the warehouse that also houses LTL pallets. What that means is if there's a pallet, usually containing one or two large or bulky items, that wouldn't fit in or don't belong on a standard truck, they're set aside in this area for staging.\n\nThis machine also goes through cardboard frequently enough it needs replacing a couple times a day. Normally it's the job of the lead, but today he was AWOL and it fell to me to replace it. \n\nWell, the LTL pallets were completely blocking the way. Asked a manager to get someone to move them, he replied \"today that someone is you, just move em to the side.\"\n\nOddly enough, I'm in maintenance and normally have very little to do with shipping or LTL pallets, beyond repairing equipment. So naturally I have no idea where any of these pallets go, what order if any they need to be in, etc. \n\nI gleefully moved as many pallets aside as would grant me access, and was shortly after accosted by the person responsible for LTL. \n\n\"Sorry, [manager] told me to move them. I didn't know what they're for, I needed to replace the cardboard.\"\n\nManager in question wound up, much to his chagrin, rearranging the pallets. \n\nHopefully this will help cut down on the extraneous demands on my time.",
        "created_utc": 1673920955,
        "upvote_ratio": 1.0
    },
    {
        "title": "Ex-wife wanted me to file her taxes improperly",
        "author": "originalbeeman",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/10dtp5s/exwife_wanted_me_to_file_her_taxes_improperly/",
        "text": "This one is from a few years ago but as I've been emotionally unpacking I remembered this gem. \n\nMy ex-wife never did taxes in her life and never cared to learn so when we got married I went through years of papers and sorted her out and we actually got a bit of a return too which was great because we were always strapped for cash. She decided that because I'm the \"Man of the house\" she didn't have to work anymore and we fought about money a lot. Eventually I convinced her she needed to work again but our fighting didn't end.\nWe separated for 2 years as we tried to mend our relationship. She moved to a new town and she got a job as a nanny. The people she was working for gave her the option to work for them or to be considered a contractor. I told her to take it as an employee job because she wouldn't like the paper work that came along with it but she liked the idea of having more money in hand. She was paid well but still lived paycheck to paycheck so she got another job. She eventually went no contact with me during that time but reached out to \"fix\" our relationship when tax time came. \nI again had to file multi year forms. As we were legally separated I checked the laws about filing on behalf of another person and it stipulates that even if you believe the taxes are fraudulent you must file it as it is reported and there wasn't any liability to the person filing the tax. \nWhen I told her she needed to report her nanny income and pay the tax out of pocket she told me she didn't want that included. She took out that part of her tax filing and just like that, she owned no taxes and, because of her church donations, she was getting a small refund. \nI filed for divorce a couple months after that and at the divorce hearing she told me to watch out because CRA, the Canadian Revenue Agency, got a hold of her and that they would be coming after me next.\nThere were a lot of complex emotions that day and spiteful pleasure was one of them.\n\nTL:DR Ex-wife runs to me to fix her taxes but withholds her true income. I report it as it's presented and she gets a visit from the tax man.",
        "created_utc": 1673906281,
        "upvote_ratio": 1.0
    },
    {
        "title": "Broken bowling lane? Well, you still need to pay",
        "author": "chilldude890",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/10dspst/broken_bowling_lane_well_you_still_need_to_pay/",
        "text": "[removed]",
        "created_utc": 1673904469,
        "upvote_ratio": 1.0
    },
    {
        "title": "Pay for youe time, it's our policy",
        "author": "chilldude890",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/10dsevs/pay_for_youe_time_its_our_policy/",
        "text": "[removed]",
        "created_utc": 1673903962,
        "upvote_ratio": 1.0
    },
    {
        "title": "You just wanted a ride home? Sure, but it's going to cost you",
        "author": "jnelsoninjax",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/10dr1r2/you_just_wanted_a_ride_home_sure_but_its_going_to/",
        "text": "[removed]",
        "created_utc": 1673901724,
        "upvote_ratio": 1.0
    },
    {
        "title": "Being Unprofessional.",
        "author": "freddyboomboom67",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/10dqp7r/being_unprofessional/",
        "text": "Many years ago I was working a \"temporary to permanent\" role for a company I refer to as \"Crooks, Thieves, and Goons\".\n\nWhen the time came to make me a \"permanent\" employee, they wanted to extend my three month contract by one month as I had apparently made \"disparaging comments about other members of the service delivery team.\" I couldn't get them to say what comments, or about who, or when, but I was supposed to do better.\n\nWhen my extension was ending, my team had a new manager (the sixth in four months), so when I asked the head dude in the main office about it, he said I'd get another extension so my new manager could better evaluate my performance.\n\nOn with the tale.\n\nMy contract ended on Thursday, and I had not received either the promised extension to my temporary contract, or a contract converting me to full time.\n\nSo I filled out my timesheet for the week, and took it into my manager's office.\n\nManager: What's this? Timesheets aren't due until tomorrow.\n\nMe: Today is the last day of my contract. I can't come in tomorrow.\n\nManager: So you're quitting?\n\nMe: No, my contract ends today, so I'm no longer working here.\n\nManager: You're being very unprofessional about this.\n\nMe: No, if you can get me an extension to my contract, or a new contract, I'll be happy to come back.\n\nManager: But you're quitting.\n\nMe: No, my contract expires today.\n\nManager: You're being very unprofessional about this.\n\nEtc.\n\nAround and around about how unprofessional I was because I wouldn't work without a contract.\n\nIt ended with him saying \"you'll never work for this company again\", and I haven't.",
        "created_utc": 1673901134,
        "upvote_ratio": 1.0
    },
    {
        "title": "来GETTR看 NFSCTV直播 2023.01.01 新中国联邦2023元旦大直播",
        "author": "ssrs_james",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/10dpgwg/来gettr看_nfsctv直播_20230101_新中国联邦2023元旦大直播/",
        "text": "[removed]",
        "created_utc": 1673898566,
        "upvote_ratio": 1.0
    },
    {
        "title": "don't offer options if you aren't willing to follow through with both...",
        "author": "PM_CIRCLE_KEYS",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/10dnvho/dont_offer_options_if_you_arent_willing_to_follow/",
        "text": "(posting from mobile sorry if there are formatting issues)\nWhen I was a kid my parents gave me and my siblings 30 minutes of computer time a day. This was strictly enforced, and at the time we had no game consoles in the house. I spent most of my time on Webkinz if that gives you a good age estimate.\n\nI have never been able to keep my bedroom clean for an extended period of time. I'm a full adult now and I just live with clean clothes on the chair and make sure I clean out anything that might attract bugs, my space my rules. Obviously as a kid this did not set well with my parents.\nEventually I was given an ultimatum: either I would clean my room, or I would not be given any computer time until it was done.\n\nI looked at my thirty minutes a day in which i could maybe finish my daily webkinz tasks and play two games. I looked at my room that I was perfectly happy living in. And I did not play another video game until I was a teenager.\n\nA deal was offered and I accepted.",
        "created_utc": 1673894949,
        "upvote_ratio": 1.0
    },
    {
        "title": "Manager tries to crackdown on dress code, I respond by wearing yoga pants to work.",
        "author": "GingerlyForged",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/10divkl/manager_tries_to_crackdown_on_dress_code_i/",
        "text": "   So I 34m used to work at a popular convenience store (really popular with a cult like following) chain years ago. I've always been a bit of a clown but very good at following rules while doing so. After working there a few years and seeing managers come and go we got in a new woman who was just miserable and really wanted to flex her authority. \n\n  Shortly after she started she posted the Uniform portion of the handbook in the breakroom and started complaining about people's attire but clearly took the biggest issue with girls wearing yoga pants. So me being the petty rule follower I am combed through the policy and noticed some things in the wording. The rules stated that yoga pants are allowed as long as the ankles flared and there was no gender designation for these articles. Que malicious compliance, I and a friend went to Walmart after work and bought me a couple pairs of flared yoga pants (Now mind you I'm not a huge guy but I am chubby and have a big beard). I began wearing them almost every day I worked and especially if she was working. This infuriated her, I would regularly hear her protests and even saw her go to the AGM and GM. Their response was always \"I can't say anything he's in dress code l.\" This continued for a month tops before she requested a transfer. But what made it even more fun was trolling weird pervert customers, they would stand at the deli area and gawk at the young ladies working especially if they were bent over the hot food table. When I would notice this I would sidle over beside them and give the boys 2 butts to look at before whipping my head around and making eye contact with them. The level of disgust on their faces filled my heart with joy.",
        "created_utc": 1673886442,
        "upvote_ratio": 1.0
    },
    {
        "title": "the time my dispatcher tried to micro manage me",
        "author": "eat-TaRgEt-xX",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/10derpm/the_time_my_dispatcher_tried_to_micro_manage_me/",
        "text": "So, this happened about 8 years ago. Im a cdl truck driver. That being said. We have ceetain fmcsa rules we have to follow such as 11 hours max drive time a day, 14 hour max of on duty a day., theb a 14 hour clock that ticks down from the second you leave off duty or sleeper berth status, then theres also cpmpany policies such as we are supposed to start driving once our 10 hour break is up (this will become vert relevant later on) Now, i was always on time with my deliveries, never had any issues when it came to that. There was one trip i was on, i went from somewhere in california, to some construction site in indiana. I had plenty of time to do the trip and be early as i usually was. So the night before my delivery appointment, i parked at a truck stop roughly 30 miles away. I gave myself 2 hours in the morning to get there and still be an hour early. I annticipated traffix, but what i didnt anticipate was natures urgent calling. I ended up being 30 minutes late due to the combination of those 2 things. My dispatcher msged me, upset that i was late. I explained whqt happened, then she gave me grief because i was late and had been off duty for 14 hours total, and company policy says im required ti start driving aftee my 10 hour break. I asked her not to micro manage me, and she responded with she was going to put a service violation on my report. I told her go ahead ,and ill be following dot and compant rules TO THE T to avoid any future issues. Now, wheb cdl driving, anything you do in ir with the truck is supposed to be logged as on duty, or driving. I hauled flatbeds. I was reponsible for securing my loads, and twrping them. That can take on average anywhere from 45 minutes, to some times 2 hours. Almost all drivers onpy log about 30 minutes though (saves time on our 70 hour clock), myself included. We also only log aboit 30 minutes on duty for loading and unloaded, then go into off duty status (always takes over an hour minimum to get loaded or unloaded). The 10 hour breaks are reulquired to reset your 11 hour drive time, and 14 hour daily clock. If youre off duty for 9.5 hours, and go on duty again, you have to restsrt your 10 hour break. I was in the habit of always parking as close to my delivery as possible, and i ran my truck so i was parked by 5 or 6 in the after noon. That week, if i parked 10 miles from the customer, and i had a 9 am unload time, id drive to the customer as soon as my 10 hour break was up.about 4 am id head 10 miles down the road for a 9 am unload. Id go off duty, at 9. Id go back on duty to log the entire unload time. My dispatcher msged me asking why i went so early to the custoner, and i reponded back with the company policy. She wasnt happy because that severely limited how many miles i could go for that day. I constinued this process of maliciously gping on duty for the most mundane things, being extremely early, and in general, destroying my 70 hour work clock with a bunch of senseless on duty time that (per company policy) was required to be logged even though its like an unwritten rule to just log 30 minutes and go off duty to preserve your clock. I usually averaged 2500 miles a week. That week, i barelt got 1,100 miles because i was consistantly running out of time on my 14 hour clock. Every time ky disoatcher fussed at me, i cited the company policy or fmcsa rule relevant to why i had gone on dity at what ever time. She never sa8d a word to me again about how i run the truck. Sorrt for the long read. I tried to shorten it, lol",
        "created_utc": 1673876315,
        "upvote_ratio": 1.0
    },
    {
        "title": "Don't want to pay overtime, but wants overtime.",
        "author": "Local_admin_user",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/10demuy/dont_want_to_pay_overtime_but_wants_overtime/",
        "text": "I've spoken to you many times about the rules on this project, so we do not need to go over this again:\n\n1. You must take any overtime worked during the week on the Friday.\n\n2. You cannot do overtime on the Friday.\n\n3. You cannot negotiate this, we've been over it a million times. I am not interested in discussion.\n\n&amp;#x200B;\n\nSo this is how the discussion with my boss began back when I did support. To give context this was a two year plan of migrating remote sites, it wasn't particularly complicated but in order to make things smoother we'd suggested migrating most of their data overnight, this would occur a couple of hours of overtime each week which the company were not happy having to pay - so they insisted we \"take time off on the Friday instead\". The problem was that two hours could easily jump to 4 or 5 if there was a complicated server setup and a lot of data. These were old legacy systems with terrible connections, you had to babysit them and there was zero documentation.\n\n&amp;#x200B;\n\nOne week well into the project the migration at night takes almost 7 hours, I'm in work the follow day (Tuesday) and I'm exhausted having had about 3 hours sleep. I'm refused the day off as \"it must be Friday\". By Friday I have recovered and I'm looking forward to my 30 minute working day at this point.\n\n&amp;#x200B;\n\nI roll in, there's been a ransomware incident at the previous weeks site. The I'm told to go there and help handle it. So I do.\n\n&amp;#x200B;\n\nI spent my 30minutes driving to site, call up my boss \"Hi Boss, just clocking off as it's a Friday to take my hours back. Can you send X out here now as it looks like a right mess, see you on Monday.\"\n\n&amp;#x200B;\n\nThey quickly organised overtime payments for the remaining 23 weeks the project had to run. FYI I did get told off on the Monday for my attitude but there was nothing they could do about it.\n\n&amp;#x200B;\n\nTL;DR Don't set inflexible rules then expect flexibility.",
        "created_utc": 1673875928,
        "upvote_ratio": 1.0
    },
    {
        "title": "I watched Schindler's List and realized that it was just malicious compliance",
        "author": "AtrociousCar",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/10d9buv/i_watched_schindlers_list_and_realized_that_it/",
        "text": "[removed]",
        "created_utc": 1673857849,
        "upvote_ratio": 1.0
    },
    {
        "title": "I complied with a stranger's request to stop manspreading.",
        "author": "sh0hburner",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/10d15cf/i_complied_with_a_strangers_request_to_stop/",
        "text": "I was on the subway today when this girl got on the train. Backpack with 84 with a different progressive slogan, food from Pret, resting \"You're being problematic face.\" I will bet my life savings she owns a Notorious RBG shirt. Anyway, she sits next to me. Now I am a 6'2 and used to swim. I have the shoulders to prove it. As soon as she sat down, I leaned forward, spread my legs and rested my elbows on my thighs. It's the only other way to sit comfortably on the train. This girl decides it's a problem. \n\nShe very loudly tells me she is sick and tired of men taking up so much space and could I PLEASE stop manspreading. I smiled and said suit yourself, then leaned back all the way in my seat. With my back now comfortably resting, I can close my legs and sit straight. But my shoulders are now pressed against hers and she was getting squeezed into the railing. She was saying something to me and was patting me on the shoulder trying to get my attention. I had my headphones on and ignored her.\n\nUnfortunately, I had to get off in two stops so I couldn't comply with her request for longer. But for about five minutes, this girl was very uncomfortable as per her request.",
        "created_utc": 1673832167,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to get breakfast and lunch",
        "author": "magnificy",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/10czrcp/how_to_get_breakfast_and_lunch/",
        "text": "Happened a today. I was ordering a take-out order by phone because I woke up late. It was 1:40 pm when I called and I ordered 1 smoothie bowl and a chicken dish. But then the lady on the phone told me that I can't order the chicken because that's on the lunch menu which starts at 2pm. \"Ok, can you just make it at 2pm and I'll pick it up when it's ready?\" I asked. \"Yes, that's fine. But the smoothie is part of the breakfast menu so we can't make it after 2pm.\" She replied. So I insisted \"Could you make the smoothie before 2, hold on to it, make the chicken after 2, then I pick it up?\"\nMy questions seemed to start annoying the person so she blurted out \"No because when we hold food it gets cold.\" \"But it's a cold smoothie ma'am. Could even hold it in a fridge.\" \"No, but the food also gets soggy\" \"But it's a smoothie bowl ma'am, it's already soggy\".\nI think she kind of realized it was a tad ridiculous so she agreed. She told me to wait, came back and said \"Oh actually the system doesn't let me put in an order with both breakfast and lunch menu items.\" I've worked in restaurants and I know there are bypasses for exceptions like these but I wasn't about to ask her to call the manager so I relented \"I see, that's a shame. In that case could I just order the smoothie bowl?\" \"Yes that's ok.\" She put my order, all good and I hung up.\nAnd then I called again \"Hello, I want to order a chicken for pick-up after 2pm please.\"\nWhen I went to pick it up they even put it in the same bag. I just hope they didn't spit in my smoothie.",
        "created_utc": 1673828483,
        "upvote_ratio": 1.0
    },
    {
        "title": "\"MOVE YOUR CAR!\" \"Lol, Ok\"",
        "author": "OP-RandomBystander",
        "url": "/r/MaliciousCompliance/comments/mgu6tu/move_your_car_lol_ok/",
        "text": "",
        "created_utc": 1673821108,
        "upvote_ratio": 1.0
    },
    {
        "title": "Check with your boss about your availability? Sure!",
        "author": "theinvisibun",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/10csuz6/check_with_your_boss_about_your_availability_sure/",
        "text": "A bit long, but there's a TL;DR at the end if you want!\n\nI'm the HR Manager of a medium-sized company based out of the United States. We are in an industry that relies heavily on most people having an assistant to manage their schedule, handle their phones, etc.\n\nI had someone tell me on a Wednesday that their assistant was leaving. Let's call the assistant Andy. I talked to Andy who said his last day would be the next Friday. It's less than two weeks' notice, which is annoying but not illegal, and I understand that things happen, so I'm not gonna put up a stink about it.\n\nAndy was a nightmare for the next week and a half. When trying to schedule interviews for replacements, he kept insisting on prioritizing certain candidates because he wanted to do it his way. He wouldn't follow our recruiting protocol and complained to his boss that we were pushing back, when we most certainly weren't. But the worst part was scheduling the transition meeting/exit interview.\n\nAt my company, our policy is to conduct a transition meeting and exit interview together. I do these meetings, and they are usually pretty harmless. I'll give the employee their final paycheck as required by law, tell them about how to sign up for benefits after they leave if they want (COBRA), share info on porting over their retirement, etc. After going over all the transition information, I'll conduct a brief exit interview asking them about how we can improve the working experience, etc. I always tell  them that this exit interview is for their benefit as a final means of giving feedback to us, but I also make it clear that they don't have to share anything they don't want to. All in all, these meetings usually take somewhere between 15-20 minutes.\n\nAt first I had a time on hold with Andy to do an exit interview on his last day. He then emailed me and said he wouldn't be able to do an exit interview because his priority was wrapping things up for his boss (let's call him Ben). I let him know that I needed to be able to give him his final paycheck and additional information; he told me to just leave the paycheck on his desk.\n\nBy this point I'm fed up with him because his emails are incredibly rude, so I cc my boss, the Head of HR (let's call her Carol). I tell Andy that there's more than just the final paycheck that I need to share, and that I'd be more than happy to share more about our company policies in our meeting. I also said he's welcome to reach out to anyone on the HR team to ask.\n\nAndy ignores my email. I follow up the next morning. I run into him in the elevator and he literally refuses to acknowledge me—not even to say good morning or smile awkwardly. He ignores this email too.\n\nBy the afternoon I'm over it. I tell Carol, who calls Andy. Carol says, \"Hey, I heard from theinvisibun that she's having a hard time getting a hold of you to schedule an exit interview.\" He responds that he's just soooo busy wrapping things up for his boss and he really appreciates us following up but no, he won't be available, and if there are any issues, we can reach out to his boss. Cue the malicious compliance.\n\nCarol lets him know that this isn't optional, and that it'll only be 15 minutes, but if he's so busy we can certainly reach out to Ben to make sure there's time carved out. He stutters and isn't able to make a coherent sentence, then says we don't have to do that. Carol says it's ok, we understand the need to make sure Ben is on board, so we'll call Ben on his cell—and she hangs up.\n\nWe then call Ben, and she tells him, \"I'm so sorry to do this, but Andy let us know he won't be available for an exit interview. Could you make sure he has time for it? We're trying to schedule something and are having a hard time.\" He asks how long, and she says 15 minutes; he says \"That's fucking ridiculous, he should have 15 minutes. I'll call him and take care of it right now.\" Carol thanks him and we continue to have our meeting.\n\nA few minutes later, Andy comes by and is fuming. He demands that we do the exit interview at that moment; I calmly tell him that there are important documents I need to prepare which is why we are trying to schedule time. Carol then calmly tells him that there are policies and procedures to follow when you leave a company. The assistant says he doesn't appreciate us going to Ben, and that he felt really disrespected; Carol gently reminds him that he said it was ok to check in with Ben, and we're glad it's a priority now, and how does 10am sound tomorrow?\n\nAndy stormed down the hallway, and we had our exit interview the next day at 10am. Best part? It would have been a brief 15 minutes, but then Andy got argumentative and we went over time.\n\nTL;DR: assistant who has been a major pain when quitting refuses to do an exit interview and tells us if there are issues we should talk to his boss. We call his bluff and the boss has a convo with him, which makes him mad, but we were just making sure it was a priority!",
        "created_utc": 1673811843,
        "upvote_ratio": 1.0
    },
    {
        "title": "Read the Syllabus",
        "author": "chilldude890",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/10coo8s/read_the_syllabus/",
        "text": "I've been reading posts from this reddit for yearssss and i finally decided I'll post. Though it's a nerd problem, I thought it belonged here.\n\nYears ago, when I was in college, I was obsessed with getting a perfect GPA. It's a long story why, but I wanted one. Everything went great for the first three years of college, and there were no issues. That is, until I took this one awful computer networks class. The class itself was super easy, and for the most part, I had no issues with the material. I got the highest score on the first test and actually helped teach one of the labs since my recent internship taught me a lot of the skills that the lab required. \n\nThen came the second test. I was president of a club that had to travel for a competition on the day we had a critical lesson for questions on the second test. I made up the lesson (after also telling the prof that I'd been gone two weeks in advance). A small percent of my grade went to participation, but his syllabus specifically said that the grade was based on participation and not specific days attended. \n\nI get through the test with a decent score and think nothing of it. I ace the third exam, and he inputs our final grades. I noted that he specifically lowered my grade to an A- which ruined my GPA. He lowered my participation by a massive amount of points. When I asked what the hell that was about, he said that I missed a critical class and missed the question on the test related to that class. When I asked him how that impacted my participation score, he didn't give an answer other than I should read the syllabus.\n\nSo, I did. I wrote a one page letter outlining his entire participation policy and even gave specific examples of how I participated in the class. I copied the dean of the school (since I actually knew them from an unrelated incident) and sent him the letter. \n\nNeedless to say, I have never seen a professor backtrack so hard in my life. He apologized profusely and gave me the right score (literally needed to add 3 freaking points). It was probably one of the satisfying arguments that I ever won.",
        "created_utc": 1673801909,
        "upvote_ratio": 1.0
    },
    {
        "title": "Cyber Security VS Software Engineering: Tug of War!",
        "author": "ARFASOFTECH",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/10cin4h/cyber_security_vs_software_engineering_tug_of_war/",
        "text": "[removed]",
        "created_utc": 1673785584,
        "upvote_ratio": 1.0
    },
    {
        "title": "Pay me the right hours!",
        "author": "Ancient_Educator_76",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/10c8oqe/pay_me_the_right_hours/",
        "text": "Babysitting blues…here we go. Our family has decided to meet with our cousins to do Disneyland this year, after a few years of skipping it due to the pandemic and financial constraints. We knew that this meant tha mom and dad (me) were going to be picking up some extra work this year. I took on an additional minimum wage ish job slinging burgers while my wife scans the facebook groups for nanny and babysitting gigs. My daughter, oldest in the house, ends up covering a few shifts mom can’t cover. We agreed that she would be paid for those coverages. So far so good.\n\nNow there arises a full time opportunity to watch “DD” in our house. Korynn wants this gig badly, and mom can’t really cover the necessary hours, so we pass along my daughters info, and before you know it “DD” is a fixture in our household. He’s as adorable as he is physically demanding. I love the little guys vans. How do they make them so small and charge so much? No entiendo. Anyway, so far so good.\n\nFast forward a month or so and suddenly my daughter “torynn” doesn’t have time to watch him many days. DD still comes over, and Tory is the main communicator with Dd s family, but more weekends than not my wife is watching him, rocking him to sleep for his nap with a bottle, because Tory says “he doesn’t go down for me”.  What started as a one hour thing has become three to four, and torynn offered to give mom half the pay that gets Zelled to mom as a thank you. At first mom said no, but after this became a regular occurrence we agreed that this was fair. \n\nAfter about another three torn weekends it’s suddenly becoming mom watching the Deedster 80 to 90 percent of the time, while still only taking half payment. It’s a different excuse every time: oh my friend wants to go with me to buy work pants , oh the yogurt shoppe called me in early, oh I’m so tired. Mom has had enough, and tells her she needs to watch him more. Tory goes “But I’m paying you. Oh, and by the way you need to give me the right pay and pay me the right hours! That’s why I’m so mad cuz I don’t even get all my money, you gatekeep it!”\n\nFinal straw.\n\nEnter malicious compliance. The next time DD was dropped off we decided to not do anything DD. No changing diapers, waking her up early to clean in preparation for his coming over, no special magic happy times, no nothing. It was great. I got my wife back today, and she chose to play a board game with me. Which one? Life. The SpongeBob edition with all those fun wonderful colors. It took no more than an hour before Tory was in near tears trying to get moms attention while we’re playing life. She finally acknowledged the situation long enough to say “Your father and I work a total of 140 hours not including housework and rarely see each other. We love you Tory but this is all you today.” She then said a minute later “ohh you have to entertain him, you have to make him more interested in something than what we’re doing, oh you need to figure it ouuutt”  I added my own two cents by picking up a little tab that said “life” and quipped “welp I guess that’s life” with my dad joke voice. \n\nWe let it steep for long enough for her to realize the error of her ways, and then invited DD to do what he’s been dying to..come destroy our LIFE.",
        "created_utc": 1673751503,
        "upvote_ratio": 1.0
    },
    {
        "title": "Bad Car Starting Instruction",
        "author": "Zoreb1",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/10bvxdb/bad_car_starting_instruction/",
        "text": "Semi-malicious compliance since I wasn't trying to get revenge.  My mom had an operation where she couldn't drive for a few weeks (but can be driven).  I came over to drive her car (so it didn't sit unused) and pick up groceries (which the store put in the trunk) as well as some other chores needing a car.  My car is so old Fred Flintstone would consider it dated.  My mom's car has a push button starter.\n\nI get into the car and put my foot on the break before pushing the button.  She says no, foot on the gas (she gets excited if you mess with her settings).  Didn't make sense (due to safety issues) but I heeded her.  Lights go on but car engine won't start.  Do it a couple of times until she gets frustrated and gets the car going (she had to get into and out of the passenger seat which caused her a bit of pain).  Same thing happens at the places we stop at (plus it was raining so she gets wet or wetter than necessary).  We get back to her garage and I try it again; still won't start for me.  My brother calls and she mentions the issue and I yell that my foot was on the gas.  My brother tells her the car won't start; you have to be on the break.  She then laughs over it.\n\nOne reason that I didn't follow my initial instinct is that she would make a big scene if I was on the brake, so I didn't; plus I was unfamiliar with that ignition system so thought I might be missing a step or something.  I now have a new car with the same push button start, so I learned something from that experience - how to start my new car properly.",
        "created_utc": 1673721861,
        "upvote_ratio": 1.0
    },
    {
        "title": "Limit the quantity I can order online? No problem. I'll just place multiple orders!",
        "author": "dazablue",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/10bvifu/limit_the_quantity_i_can_order_online_no_problem/",
        "text": "This is Malicious Compliance with a Twist!\n\nI own a business which I run from my home. Much of my supply shopping is done online. One particular retail store (think blue and yellow) limits online quantities to 12 for most items, but I needed more than 12 of most of the items I was ordering. They have three stores fairly close and equidistant from my house, so I just placed an order for 12 of each of the items at each of the stores, figuring I'd do pick ups in a circle, all taking less than an hour. \n\nI got a note that the heaviest items would ship to my door in three days instead of being available when I picked up, and shipping is free. EXCELLENT! \n\nThen I start getting messages that my orders will arrive sooner than expected. EVEN BETTER!\n\nThe first day, I get a delivery from a local store delivery driver. There are three of the 36 items in a bag on my porch. An hour later I get a second delivery from a different store delivery driver. This bag has one. A couple hours later, another delivery from another store delivery driver. This bag has 6. Over the next 24 hours, I get three more deliveries of four, one, and one item from different store delivery drivers, for a total of 16 of 36. Six deliveries, six different drivers.\n\nOn the original scheduled delivery date, I get the rest of the order in one shipment but three different boxes from Fed Ex. The items are glass bottles, and each bottle is wrapped in some weird but protective wrap. Thie product normally comes in small box cases of six, so that is what I was expecting. I don't view the 17 plastic bags, three cardboard boxes, and an armload of protective plastic and paper wrap as a bonus.\n\nOverall, I think the blue and yellow retailer paid something like $80-$90 to deliver a $133 order.\n\nMaybe they can't have cashiers any longer because all of their employees are busy delivering one order in seven separate trips.",
        "created_utc": 1673720891,
        "upvote_ratio": 1.0
    },
    {
        "title": "Don't Make Others Uncomfortable?",
        "author": "intrepidshe",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/10bseuf/dont_make_others_uncomfortable/",
        "text": "This is long, but it has to be to provide the needed details about what happened.\n\nAbout 10 years ago I worked in a team of scientists (which is almost enough the drop the mic right here 😄) when one day our boss told me others perceive me as \"contemptuous.\" I was shocked beyond words. I certainly did not feel superior or feel contempt for anyone. I was so flabbergasted I was silent for probably 2 solid minutes. \n\nI asked for an example of when something I had said or done gave someone that feeling. He said he couldn't divulge that information. OK. Then I asked for an example he had experienced or observed himself. He said he had none. I said, \"Since I have no clue what I've done, how am I supposed to adjust my behavior?\" He said he didn't know. \n\nI said, \"Basically then, I just need to not talk?\" He said he wasn't sure. I knew right then what to do. \n\nI am pretty introverted; and as a child I didn't talk for years. I rarely spoke until I was about 13 years old. Got lots of notes from teachers about how quiet I was. I would answer questions when directly asked, but rarely spoke otherwise. \n\nSo, my malicious compliance in this situation was easy for me. I just stopped talking except when asked a question. I made a point of smiling, showing I was listening, nodding agreement, etc. I was extremely polite and agreeable. \n\nPretty soon some big issues came up that I had specific knowledge about. I knew how to solve them, but no one else asked. A huge conflict came up between two of our labs because one group wanted it one way and the other group had a different opinion. They fought and fought. People were having secret meetings in their offices to try to win. And when they finally arrived at the action they chose it was wrong. In fact, both groups were wrong. And the whole experiment failed. \n\nIt's important to know no one was hurt, no property damage or anything like that. Just a LOT of wasted time and expense on materials. But I never said a word. This went on for three weeks. The lab's budget had to be revised. They had to cut travel expenses, which I was ok with because I didn't want to travel anyway. \n\nSo, no conferences for anyone. This is a big deal for a lot of researchers because it's how we gain notoriety to be able to get grants, among other things.\n\nFinally a colleague asked me why I hadn't spoken for so long, why I was so quiet. Was something wrong? I explained about being told others perceive me as contemptuous. She had the same expression I did when I was told. She said she didn't believe anyone had said that about me. \n\nI honestly was surprised again because I believed our boss. Then she asked me what I thought about the experiment design and why it was failing. I told her about the solution I believed would work, which was actually surprisingly simple. She recognized it had a good chance of succeeding and asked me to share the idea at the next department meeting. \n\nAt that meeting she asked me again in front of everyone and I repeated what I told her. Several people asked why I hadn't spoken up sooner. I explained I had been given feedback that indicated I caused others to feel uncomfortable. The whole table of colleagues also looked stunned at me. I said I was committed to not causing such bad feelings and couldn't figure out how to communicate because the feedback didn't give me any specific guidance.\n\nEveryone looked at the Director at that point and he said, we shouldn't discuss personnel issues. Ha! It was my issue, so I said, \"if anyone here perceives me as contemptuous and said as much to our boss, that's the reason I haven't been talking. If you don't feel that way about me, let me know and I will stop being silent.\" \n\nSomeone else said we needed to hold a vote so there wouldn't be any more confusion or talking behind anyone's back. They voted 100% for me to talk normally and that they didn't agree that I was ever contemptuous. \n\nThat Director slowly stopped coming to work, month by month after this episode, until he was only showing up 1 day a week. Finally he took a lab position elsewhere and one of my colleagues was promoted to Director. \n\nAnd... the experiment was a success. The next year I got a grant to keep the research going and paid for two people to be able to travel to the related conference to present our findings.",
        "created_utc": 1673713345,
        "upvote_ratio": 1.0
    },
    {
        "title": "No more backpacks in school",
        "author": "Dadzia246",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/10bqkxf/no_more_backpacks_in_school/",
        "text": "[removed]",
        "created_utc": 1673708762,
        "upvote_ratio": 1.0
    },
    {
        "title": "Lodha Hinjawadi maked new life 2 BHK and 3 BHK apartments",
        "author": "Ok-Wrangler445",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/10bmg89/lodha_hinjawadi_maked_new_life_2_bhk_and_3_bhk/",
        "text": "[removed]",
        "created_utc": 1673696143,
        "upvote_ratio": 1.0
    },
    {
        "title": "Vague Mask Mandate at High School",
        "author": "random_ad_",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/10bhior/vague_mask_mandate_at_high_school/",
        "text": "The first week back to school or administrators implemented a one week mask mandate in the dorms, for reference our dorms are the size of a medium closet, we have to wear them all sleeping while going to classes and while walking about the campus. What they didn't specify was whether or not we had to shower with them. So a couple of friends and I waterboarded ourselves to prove a point, it's not about the mask mandate, it's about the fact that they didn't tell us when we had to wear them, yet some of us got punished for not wearing them in our own rooms. (yes we did take full showers with them on)",
        "created_utc": 1673677586,
        "upvote_ratio": 1.0
    },
    {
        "title": "Wanna stay late when I can’t ask you to leave?? Fine with me!!",
        "author": "ItsStrib1978",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/10bfe7h/wanna_stay_late_when_i_cant_ask_you_to_leave_fine/",
        "text": "TL;DR at the bottom. It’s a read, but worth it. 🤣\n\nThis was a hot minute ago…mid-to-late nineties. I was working evenings slinging coffee at a well-known international coffee chain (you know the one) while I finished my degree.\n\nThe coffee chain had just introduced a ***BRAND NEW*** blended frozen beverage that made all the baristas’ lives a living hell. I still can’t drink the shit to this day…but it was pretty popular, especially with younger patrons.\n\nAs my location was right next to the only mall in the area, we were inundated by teenagers pretty regularly. Most were respectful and nice…except this *one* group of girls. They were there nearly every evening…not tipping, being loud and obnoxious af, making and leaving messes everywhere. We all despised them. When the new blended frozen drinks came out, the group of teenage succubi found a new, *improved* way to make our lives difficult. They would descend upon our location en masse…even bringing NEW nasty girls with them. They’d all order the blended frozen drink, but each order would be just a *liiiiiiiiittle* bit different. This would ensure that we could only make one drink at a time in the ONE BLENDER we had. The little slogs would even lean over the counter and monitor us to make sure every one of their drinks were EXACTLY made to specification and to ensure we “didn’t screw it up.” \n\nThe girls had also picked up the *lovely* new habit of staying past closing. Rules of the coffee chain (at that time) were that we couldn’t ask anyone to leave after we closed. We could start cleaning duties…even turning some lights off here and there…but we couldn’t be like, “hey, we’re closing…can you take your beverage outside?” Dumb rule, but most people would see us starting to shut down and head for the door.\n\nNot the succubus brigade. Ohhhhh NO. Their “leader” confronted one of my coworkers one night as he swept and mopped near them, roughly 15 minutes past closing. “YOU CAN’T ASK US TO LEAVE MY AUNT IS A MANAGER AT (coffee chain) SO I KNOW.” Dude hadn’t even acknowledged them. This wasn’t an everyday occurrence, but believe me when I say we were DOOOOOOONE.\n\nAbout two or so weeks after they’d confronted my coworker, I was closing. Had one other person with me, and I had volunteered to close the front of the store. The Mean Girls were camped out in their usual corner. I started wiping down tables. I heard giggling and looked in their direction. They had knocked a piece of coffee cake on the floor. Crumbs were EVERYWHERE. Not only this, but they were ALL LOOKING AT ME AND SMIRKING and the ringleader shrugged and said “oops!”\n\nI was fucking done. \n\nI finished wiping down the tables while I formulated my plan. I ducked behind the counter and motioned for my coworker to join me in the back. I told her my plan, grabbed a mop, and moved back behind the counter near the flavored syrups. I poured a nice amount of raspberry syrup into my mouth and headed back into the general vicinity of the flock of biznatches.\n\nAfter a few moments of totally inconspicuous mopping, I lurch toward the girls clutching my abdomen, with a terrified look on my face. This is quite successful in diverting their attention toward me. Exactly what I want.\n\nAfter I make a few more puke-like lurches, I spew forth the raspberry syrup all over the floor. It went EVERYWHERE and looked like I had vomited blood.\n\nTo say that they freaked out would be an understatement. A collective high-pitched screech rose up from the group as they grabbed their purses and scrambled for the door. Drinks were spilled. One girl tripped and fell. Chairs were knocked over. It surpassed my highest expectations.\n\nIt. Was. ***GLORIOUS***.\n\nThey were still scrambling around the parking lot and crying as I calmly walked to the door and locked it, with my coworker laughing hysterically in the background. We started cleaning up the absolute (worthwhile) mess…still falling out…as they silently watched for a few moments before piling into three cars and leaving.\n\nNever heard anything from management. Never got written up. ***NEVER*** saw those girls again. Will forever be remembered as the single greatest event in my retail career.\n\nTL;DR - a gaggle of rude-ass teenage girls loses a game of “fuck around and find out.”",
        "created_utc": 1673670618,
        "upvote_ratio": 1.0
    },
    {
        "title": "Its been over 5 years and I fear he will never be brought to justice.",
        "author": "Watcherofmesa",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/10bdrsv/its_been_over_5_years_and_i_fear_he_will_never_be/",
        "text": "[removed]",
        "created_utc": 1673665654,
        "upvote_ratio": 1.0
    },
    {
        "title": "1. To outsmart; and 2. To screw a piece of shit 70yo (35+year attorney) as a 21yo w a high school diploma.",
        "author": "interwoventhreadfbrc",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/10bc8gg/1_to_outsmart_and_2_to_screw_a_piece_of_shit_70yo/",
        "text": "I had worked for (Hands-Down The Best) NY style Pizza in the city. A man walks in and is observing me work. I believe he liked how I interacted with people. One day he asks me if I would be interested in answering the phone for his office (he was an attorney). Being one to pounce on an opportunity- and it was an opportunity(albeit the unbeknownst-to-me bullshit I was going to deal with), I said, sure!\n\nA few weeks later, The attorney Skypes me from across the globe letting me know he may not be able to return for a bit (ended up being 3 months) and that I’d have to handle a bit more. Again, as a knowledge hungry little human, I accepted— mind you, it was the attorney(Vietnam USMC Veteran), then me. No other employees/owners.\n\nI learned the job; and I had to learn how office etiquette worked, how printers, faxes, handheld phones and computers worked (I was not big on tech); from client screening and intakes to drafting correspondence and pleadings, to negotiate liens, and settling cases… hell I even filed the SI for his corporation and filed his personal and corporate taxes, prepared P&amp;Ls and other documents for his various companies he was a shareholder of. It was knowledge porn.\n\n1. However, some things I caught on to was the fact that if I wanted something, I ABSOLUTELY had to use reverse psychology. Want overtime? Ask for a day off for family emergency. Want a day off? Ask for more hours/money. It was hilarious after I figured that out.\n\nThree years after beginning my legal career, this attorney said/did something that crossed my line in the sand. I won’t go into specifics but, essentially, he insulted my mother. It wasn’t merited at all. At first I considered beating the old man and throwing him off the 12th floor. But I figured if he survived, I would 100% get sued for all the minimum wages he paid me. I kept myself calm(it was Friday) called him out on it, which he outright denied like we weren’t the only two people in the room to hear it.\n\nThat Monday I came in with my letter of resignation and hid it under his desk. And didn’t come back afterwards. He called me, my relatives, my friends(we were taking care of some cases for a few of my friends).\n\n2. I decide to reply to his text letting him know I would not be coming back in. You see that Monday, the governor of California issued a notice that everyone was to stay quarantined or something like that due to the pandemic. I told him the governor superseded him and in an unprecedented time like now I could not risk my life- this is funny because I could care less about Covid. Too many people on the planet anyways. \n\nI started at a new firm that Friday. My salary has multiplied by 3 since then. I would text other persons from our suite-the beautiful receptionist- just to keep tabs on the attorneys misery. Each subsequent employee lasted a few months at most.\n\nTake that you stupid fucker.",
        "created_utc": 1673661190,
        "upvote_ratio": 1.0
    },
    {
        "title": "Penny Wise, Pound Foolish",
        "author": "woodiedebris1953",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/10b9nib/penny_wise_pound_foolish/",
        "text": "Years back, I worked in regional sales. My base was in Portland, but the job had me traveling to Seattle on a regular basis. We had a small branch there. It had been downsized, leaving me with the responsibility to manage their existing accounts. The business was on a long, downhill slide, but that's a story for another day.   \n\n\nWhen I made these monthly or so visits, the drive was far enough that it required an overnight stay. The unspoken rule was, stay somewhere decent, but not extravagant. Knowing that the company was suffering a bit, I chose a national chain hotel that had several advantages; it was clean and safe, within walking distance of the branch office, offered a continental breakfast, and free parking. Free parking is not all that common at hotels in Seattle,   \n\n\nWe were also given a per diem for each of three daily meals. I chose the hotel based on the fact that I would not need a breakfast, and therefore saved the company money by staying in lodging that offered a free one. That worked well for me, because I'm not a huge breakfast eater, and when I was up there, I liked to maximize my time with branch personnel, and our customers. I had to pack a lot into short, 2-day visits.   \n\n\nOn one trip, I had to get up very early in the morning to begin a particularly packed day. I skipped both breakfast and lunch altogether. I simply didn't feel that I had the time to waste. Plus, Seattle is big, traffic is bad, and often there were many miles between customers.   \n\n\nI'd started out at 7am, and finished about 6:30PM. I was tired, but even more famished. I went to a nice, but not overly expensive place for dinner. When I got the bill, it was about 10 dollars more than my dinner per diem limit. I figured it was no problem, since the total was only about 10% more, and still far below the daily allowance for all three meals.   \n\n\nAbout a week after I got back, the branch manager in Portland barked at me;\"Come into my office!\" I hadn't a clue what I'd done wrong, but the look on his face told me he wasn't pleased. He pulls out my expense report and says, \"What's this charge for dinner? You know that's more than you're allowed, right?\" I think he expected me to fall on my sword, and beg for mercy for having violated policy. I did the opposite.   \n\n\nI said, \"DB, please understand that I never charge for breakfast, although I could. Also on the day in question, I skipped lunch as well. So, the total, while above the limit, is still far below what I'm entitled to for daily meals.\" He grunted. He still wasn't happy. I continued, \"I know the company is struggling. That's why I choose to stay where I stay. It's affordable, has free parking, and free breakfast. If you look back, I've never charged the company for it, and only about half the time for lunch.\"   \n\n\nHe knew I was right, but he decided to show me that HE was the manager, and that I had to adhere strictly to the rules. \"Well, that's all well and good, but the per diem limits are clear, and you are never to exceed them again. I don't want to see another expense account like this on my desk ever again! Is that understood?\" He peered at me over his glasses with a stern grimace. \"I said, perfectly!\" and left his office.   \n\n\nFrom that day forward, I charged the maximum allowed per diem for each and every meal. Over the next several years, it cost the company many hundreds more than it needed to, but since reason and accounting skills weren't my manager's  forte, I felt more than justified for strictly adhering to the rule, and was a richer man for it.",
        "created_utc": 1673654156,
        "upvote_ratio": 1.0
    },
    {
        "title": "Do ONLY what I'm told? I will watch you burn.",
        "author": "lezanon",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/10b7yxp/do_only_what_im_told_i_will_watch_you_burn/",
        "text": "[removed]",
        "created_utc": 1673649875,
        "upvote_ratio": 1.0
    },
    {
        "title": "stay away from the front desk? you got it",
        "author": "dnc498",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/10b7llc/stay_away_from_the_front_desk_you_got_it/",
        "text": "This is gonna be a short one.\n\nI, 27m, work for a small security company. My post consists of condos. Each condo has a front desk and all the amenities a 4 star condo would have, minus the breakfast. \n\nI received a text from bossman that I made the front desk ladies uncomfortable. How? The only thing I say to them outside of business related topics is \"hey, how's it goin\". So I honestly don't know what I did and he won't tell me. I was told to avoid being at the front desk. No problem. \n\nI avoided EVERYONE that works there unless it was business related. Except for the front desk. Any time the front desk had an issue that I needed to handle, I told them to contact my supervisor and have him relay the information to me so I may handle the situation due to the fact of my supervisor telling me to stay away from the front desk due to making the front desk employees uncomfortable.\n\nI'm just doing what I was told to do by my superior. Well, it didn't last long. I'm being moved to a different post starting tomorrow. So we'll see how this one goes.",
        "created_utc": 1673648963,
        "upvote_ratio": 1.0
    },
    {
        "title": "They fire me to save money due to bad resource management. They get to pay an extra salary to me for said attitude as well",
        "author": "rolling4days",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/10b6k4h/they_fire_me_to_save_money_due_to_bad_resource/",
        "text": "This is my first post. Hello.\n\nA company that recently fired my was under red numbers. It is a company overseas from my country that, being in South america, meant they have quite an interesting range of professionals with different aptitudes. Some managers you could tell from a glance they reached their position through sheer social manipulation rather than being knowledgeable and skillfull.\n\nCompany exports fruit all over the world. They messed up since they treated commercial offices like gods that, since they got the money from clients, they cannot do wrong? Right? Right?!\nCue the container crisis it is still up to this day. Because containers get late, fruit arrives rotten, and the company starts bleeding money. Hard.\nThe ceo, since he notices that their financial areas are too incompetent to understand what is going on, contracts and external company to get help. Their solution? Start firing people.\nOur area suffers the most, especially our office. We get fired and mostly disbanded. Since we aren't an office that directly handles money, we are laid off first. \nThey must have thought we are useless idiots. \nWe handle documentary control and due diligence from customers. I was even one of persons that complained of the commercial office complete lack of a plan (they put all their sales on one customer, who, when rejecting the fruit, left then without option of where to sell).\nThey fire people from areas they deem useless (like ours) whilst preserving the idiots that got us in this mess to begin with.\n\nCue malicious firing:\n\nTheir first mistake was that we received the news in a meeting. They must have thought that we were receiving a favor by telling us 2 months in advance through a team's meeting. Never got a written letter at all.\n\nTheir second mistake was how they demonstrated they cared little for the overall quality of the service offered. Their ingenious plan was to take my role and give it to the department assistant (who is paid half my salary), and suddenly she would do my job and hers without a raise. My boss then assigned the duty of training her to me, since she could bother to do things herself.\n\nWhat they should have seen coming was that a person with nothing to lose is not the kind of person you expect to give continuity to your important work. I never bothered to give complete training to my succesor.  Nor did I explain about the database infrastructure i did for the company (they barely handle excel btw, much less a real working database on a server)\n\nShe quit halfway when realizing that she did not have the professional qualification and that she was being exploited.\n\nDuring those 2 months, i stood mostly quiet. Biding my time.\nHR noticed 19 days before my last day that they had to calculate my severance pay. They took me in a meeting and I told them i expected a written email, for which I would respond according to *my* countries' laws.\nThey never bat an eye to what I meant.\n\nThen the shitstorm started. I write back telling them that the law in my country states that all firings must be written and that until then, this was the first written document I have received.\nThe HR supervisor was indignant. To her, I was nothing short of a leech that had received the company's goodwill by being told 2 months in advance (where it should have been 1) and that I should have been happy.\nI wrote to her that I didn't care, the law is the law, and they should abide by it. She escalates to the global manager, and they get ridiculed. In my country, we get free legal advice related to worker rights, and she gets shafted the final warning:\n\nSince they didn't *legally* give me 30 days in a written notice, they now have to pay the difference, and since we are paid bi-mensually, not by hours (it is their way to try to avoid paying extra hours), they have to pay me for the full 2 weeks, not just 11 days. It is that, or lawyer up with the ministry of work.\n\nThe extra salary covered more than half the severance pay. I heard the director of the site got so desperate with the budget she had to remove the water machine. Lol.\n\nThe cherry on top is that due to the internal dispute, I had an excuse to avoid the job that was piling up. On the system for the clients, i put all requests to be suspended until the day after i was already gone.\nI can only speculate as to how screwed they are with the customers... even until my final hours I had a mountain of work and they never bothered to think that it affects their precious sales.",
        "created_utc": 1673646422,
        "upvote_ratio": 1.0
    },
    {
        "title": "Crew did as they were told and were fired by shortsighted manager.",
        "author": "Thefunkbox",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/10b1r86/crew_did_as_they_were_told_and_were_fired_by/",
        "text": "This goes back at least 25 years. So, late 90s? I worked for a now defunct deep discount chain in Florida. I got a position on 3rd shift doing night stock. The crew was small, only about 5-6 of us. We had a good time. We'd talk to each other across aisles, crack jokes to a video that played constantly in a corner, and make the best of it. Our supervisor was a complete power tripper. \n\nI hadn't worked there very long, but even in the short time I was there I could see the crew leader wasn't a reasonable dude. During one shift, we were all clocking out for out lunch break. As we went in to punch the clock, we were told, \"Don't punch back in if you're going to continue talking\". OK. We didn't. We did just sit around the front of the store talking until the manager came in for the day. \n\nStore manager got there (I can't remember if an assistant arrived first). We gave him the quick lowdown. We were told not to punch in if we were going to talk so we didn't. He simply fired everybody on the spot. Being new, I asked for my job back and got it. The crew leader stayed, and maybe one other. I think new people were brought in.\n\nIt wasn't until some time later that the lead was demoted and replaced by me. He quit soon after that. It was clear that as a crew we all worked better when he wasn't there. \n\n&amp;#x200B;\n\nTLDR: WE all did exactly as we were told, and fired by a manager who didn't care enough to get the details.",
        "created_utc": 1673634760,
        "upvote_ratio": 1.0
    },
    {
        "title": "You to see my key, fine.",
        "author": "Background_Ad9812",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/10amo5w/you_to_see_my_key_fine/",
        "text": "This happened when I moved out of my Dad’s house, which was a WHILE ago and I have sense grown out of my petty attitude.\n\nSo, back when I was in my early years of high school I was spending a lot of time with my mom and friends. Which absolutely pissed off my father. He hated that I wasn’t spending all my time with him, he voiced it multiple times. Seeing how he was pretty abusive to me growing up, I ignored this. \n\nOne day, I came home from school and the garage door was unlocked. Which wasn’t usual, 99% of the time it was. I walked inside to see my dad smoking a cigarette, which was never unusual at this time of day. \n\n“Look your finally home. How many days has it been since you were last here?” My dad asked, which was hilarious to me considering I’d been home all week he had been sleeping, smoking, or at a bar the entire time I was there. So, I told him just that. \n\n“Do you even have your front door key? Because you never use the front door.” He was finding something to pick at, which also was never unusual for him. \n\nI held up my keys and showed him the keychain with all the keys on it. Including the garage key and the front door key. \n\nMy bedroom was in the basement, so I frequently used the garage door anyway. It was easier to drop off my bag and then go upstairs than go down and up. \n\nHe crushed his cigarette and took my keys to make sure both keys on their were his and not my mother’s house keys. \n\nHe was set on the fact that I didn’t need a key for her house if I didn’t live there full time. Surprisingly enough, I had two key chains. \n\nWhen both keys worked he started a routine of everyday making sure I had my keys. It would be a text or a video call or an in person thing. Paranoid I didn’t have my keys. \n\nEventually, two days before I moved out- months after this incident- I got tired of it. I knew I was going to move out and I wasn’t going to leave the whole key situation alone. \n\nI bought myself resin and a silicone mold with HIS money that I pocketed from his truck. \n\nThe night before I moved out I put the keys into a resin mold and got to work. \n\nI made an ashtray out of the mold, tossing his away and replacing the tray that morning. \n\nI left the new key ashtray on his end table in the garage, packed up my shit and left.",
        "created_utc": 1673588963,
        "upvote_ratio": 1.0
    },
    {
        "title": "be careful when you complain to little caesar's",
        "author": "Lost_Championship105",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/10al0m4/be_careful_when_you_complain_to_little_caesars/",
        "text": "When I was in high school, I had a part-time job at Little Caesar's working the register, handing pizzas to customers. It was in a rougher part of town, so there were plenty of scary/weird customer interactions, however there's one that was intensely satisfying. \n\nOn a random weekday, some woman came in and ordered a pizza with a wide variety of toppings. Completely normal so far, she leaves and comes back 10mins later to pick up her pie, and leaves. She comes back another 5mins later with the pizza, saying that the toppings fell off when she was trying to eat it, called us lazy and demanded that we remake it. I guess she'd never had a pizza before? :/\n\nSo I take the pizza to the back, explain the situation to the guy making the pizzas, and tell him to put the toppings under the cheese... Little did I know this would create the most disgusting looking pizza I had ever witnessed. All of the sausage, veggies, pepperonis and whatever else was completely covered by the cheese, but could be seen slightly because melted cheese is a little translucent. It looked like the cheese had subtly turned different colors of brown, green, orange (from grease underneath), and wasn't pretty and smooth like pizza usually is. It was lumpy like chunky throw-up. It was absolutely vile, and I was counting down the minutes for her to return.\n\nPretty soon after the pie was finished, what I assume to be her husband came inside to pick it up. As per standard procedure at my store, I opened the box to show him the final product. \n\nMy creation. My monster.\n\nThe poor man looked absolutely appalled and heartbroken. He asked me in a very disappointed voice, \"...what did she say to you guys..?\", and I simply explained to him that because the pizza's toppings fell off when she tried to eat it, we simply put them UNDER the cheese. He just apologized and left with the pie. NGL, I kind of wished the woman had picked it up because I'm sure we would have gotten a better reaction, but it still warms my heart to know that she probably ate it.",
        "created_utc": 1673583829,
        "upvote_ratio": 1.0
    },
    {
        "title": "Don’t want me to help you anymore? Fine by me",
        "author": "hand_thantsd",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/10akk92/dont_want_me_to_help_you_anymore_fine_by_me/",
        "text": "When my younger sister is stressed she can be a bit unpleasant. I understand the stress, but I also don’t want to deal with it.\n\nIn this case, she told me to help her with her social studies studying, since I like social studies and plan to study it for college.\n\nHowever, she was studying a a topic I never learned because the curriculum changed by the time she got to high school. So what I learned when I was in her grade was a completely different then what she’s learning now.\n\nIt was stressful because when I didn’t know something she’d be like “you’re helping me at all”, “you’re being useless”, etc. And nothing I did seemed to be ‘right’. \n\n(Before you bring out your pitchforks, understand that she does face a lot of pressure because she has a 4.0 GPA and maintaining grades often is a stressor for her)\n\nHowever, it got to a point where I finally just told her to Google the answers since I knew nothing about the French Revolution. And she got pissed when I told her this. \nSo she said “if you’re just gonna tell me Google the answers, then you may as well just leave and not help me”\n\nSo I was like “okay” and walked away",
        "created_utc": 1673582494,
        "upvote_ratio": 1.0
    },
    {
        "title": "You want to prioritize speed over not over whelming the end of the line? Got it.",
        "author": "Sloth_King96",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/10ak61s/you_want_to_prioritize_speed_over_not_over/",
        "text": "So, this happened about 3 years ago at the shittiest job I have ever worked. It was a fish factory which also sold French toast and onion rings. Anyone who has ever worked in a factory knows that the machines there are prone to breaking down and messing up their one job. Factories are also notoriously understaffed and overworked. This job was no different. \n\nThis story takes place on the onion ring line. At the front of the factory, frozen onion rings were stuffed into bags which were stuffed into boxes. My job was to both shove these rock-solid rings down so the top of the box would be flat when they went through the tape machine and keep the line moving as fast as possible. That tape machine sucked and was constantly getting stuck on itself which led to back ups since stopping the line was never an option. At the very end of the line was one person doing the job of three people. He had to stack tall 9-pound boxes as they came onto wooden pallets while also wrapping it with saran wrap and preparing the next pallet as needed. The end of the line had room for about 4 boxes before it would jam up the tape machine. I could see the end of the line from where I was standing so I knew when it was getting backed up. \n\nNow on to the malicious compliance! One day I was keeping an eye on the number of boxes that was stacking up at the end of the line. This just meant I was taking 1 or 2 off the line to keep it moving and reduce the amount I was sending at once. I wasn’t putting them on the ground, just off to the side on the conveyer belt. They were off to the side for maybe a minute or two before I sent them. This strategy gave the guy stacking boxes a little bit of a break and kept the tape machine from getting overwhelmed. A win-win situation, right? Wrong.  \n\nMy line lead came over after a while and asked what I was doing. I don’t remember the exact wording anymore, but I basically told her that I was trying to keep the line moving while not overwhelming the box stacking guy. She then told me that I didn’t need to worry about him and just send the boxes. I shrugged my shoulders and said okay! I then proceeded to send the boxes at regular speed with no regard for what was going on at the end. The tape machine went from working flawlessly to being jammed in a matter of minutes. My line lead then had to go and help fix the tape machine and help him catch up. Nothing changed after that sadly but seeing my lead have to deal with the tape machine warms my heart every time, I think about it.",
        "created_utc": 1673581344,
        "upvote_ratio": 1.0
    },
    {
        "title": "You need have the right due date",
        "author": "Ancient_Educator_76",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/10ajqpm/you_need_have_the_right_due_date/",
        "text": "Student comes to me before I go to lunch about an assignment. He’s fuming that I have the due date for this project tomorrow. He says I need to change it because his family is strict and will limit his privileges (despite being an adult) if there’s anything due that isn’t finished. I had already explained into this dude that the due date is fluid, and that I’ll even write a note saying such but I’m not gonna log back into my laptop for this. \nHe says rudely that my due date needs to match the assignment actual due date. \n\nI goes “fine” and log back in, type a note explaining that my due dates need to match the actual, so pleas have this done by to morrow.\nThe great thing is that he was smiling thinking he won. Until that night.",
        "created_utc": 1673580131,
        "upvote_ratio": 1.0
    },
    {
        "title": "Every step I do enough for you?",
        "author": "Low-Act8667",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/10ai0gb/every_step_i_do_enough_for_you/",
        "text": "[removed]",
        "created_utc": 1673575390,
        "upvote_ratio": 1.0
    },
    {
        "title": "Don’t want my help? Sure! Go ahead and get yourself fired",
        "author": "Remote-Syllabub7412",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/10ah0nn/dont_want_my_help_sure_go_ahead_and_get_yourself/",
        "text": "First-time poster, long-time lurker, so please forgive any mistakes!\n\nTLDR: jerk is such a jerk that his own actions get him fired.\n\nA bit of background: A while back when I was still in high school, I worked at the local cinema to earn a bit of pocket money and experience. I stayed for a couple of years, working weekends when school was in session.\n\nI think it was halfway into my second year when the target of this revenge came into the picture. We’ll call him Luke. Luke was a new hire and was just learning the ropes (this was common as turnover was high since we were all students). He seemed alright at first, and everyone was nice to him since we were all pretty close and knew one another from school and we welcomed him in.\n\nI don’t think even a week passed before the problems started. The first issue I heard of was that Luke was trying to flirt with one of the girls. Thing was, this girl was already in a relationship with one of the other employees, and everyone knew this, including Luke. That didn’t stop him though, and eventually, the girl told him to his face to cut it out. It only got worse from there.\n\nNow, I do my best to see the good in people and give them the benefit of the doubt. Despite what the others were saying, I still tried to get along with him. This unfortunately changed during the first real conversation I had with him. We were on break at the same time, and about five of us crowded into the little break room for lunch. I forget what exactly we were talking about, but I remember it was an uncomfortable topic, and Luke was using a lot of explicatives. The break room was NOT soundproof and there were patrons outside, especially children. I tried to warn him about using that language so loudly, and that he might get in trouble if a customer heard him. Immediately, his attitude toward me changed, and he responded with something along the lines of “I can say what I want, I have the right to free speech. Don’t tell me what to do.” …what? Sheesh okay, chill, I was just concerned but you do you.\n\nA few minutes later, the convo had switched to high school, and Luke was raving about how Caucasians were the majority in all the high schools in our district. Now for my high school, this isn’t true, as most of the community and students attending were Latino and made up about 70% of our student body. I told him as much:\n\nMe: “That’s not the case for \\[high school\\],”\n\nLuke: “Uh, yeah it is? White’s the majority everywhere. I have a friend that goes there.”\n\nMe: “…I actually go there, it’s mostly- “\n\nLuke: “why are you talking?”\n\nMe: “…excuse me?”\n\nLuke; “who invited you to this conversation? I wasn’t talking to you. Who asked?”\n\nNow, this irritated me. I know it’s a joke about looking for “who asked”, but this was before that became a thing, and I found it extremely rude. But, in a moment of clarity, the best comeback came to mind, like arguing in the shower by yourself, and to this day I could only wish to be able to recreate the moment.\n\nSmiling, I threw his words right back in his face: “free speech”\n\nThe others at the table were laughing as I threw away the rest of my lunch and left the break room. My heart was beating too fast from the weird adrenaline rush I got, and I spent the rest of my break in the back of concessions until it was time to clock back in.\n\nI think that convo was what sparked Luke’s hatred of me. Ever since then, he would glare at me whenever I walked by, would dump the trash from his bin when we were sweeping the floors for me to pick up, and generally was a jerk. His behavior kept getting worse: he would threaten to fight people (he was a short potato of a boy so no one was really scared), argue, say rude, passive-aggressive, or down right racist things, and was just generally a jerk.\n\nAt some point, during a shift I wasn’t there, he cornered the girl he had been eyeing and kept verbally harassing her to the point that she hid in the manager's office where he couldn’t get to her. She was a sweet and loyal girl and a friend, and she and her boyfriend could be described with the phrase “puppy love” and had been together for a long time. The boyfriend was angry when she texted the group chat about what had happened, and wanted to get Luke fired. However, people were hesitant about this, saying that managers wouldn’t want to because he’d claim discrimination (he was trans) and that he hadn’t done anything blatantly wrong.\n\nThen another one of the employees made a suggestion: Luke was incompetent, we all knew this. Why not make the managers see it too?\n\nRevenge time.\n\nIt wasn’t hard to do, since Luke would tend to shoot himself in the foot. When possible, we’d point him out to managers when reviewing the cameras in the halls about him dumping his trash can when sweeping onto the ground in front of patrons. When he was cursing up a storm during break, a text would be sent and someone would lead a manager to him to be caught. He rarely cleaned up, was rude and loud, and the incident with the girl didn’t help his case. It still wasn’t enough, and week after week his name was on the schedule.\n\nThen my opportunity came.\n\nSee at the cinema, there’s a position called ‘Point’, aka the ticket taker that lets you into the theater area. It’s the second most dreaded position (the first being self-serve cleanup) as you have to stand in place and interact with customers at a rapid-fire pace, smiling and listening for theaters to be called at the same time. When the night ends, the last person on Point has to close and clean the self-serve stations. Today, to my initial dread, Luke and I were both on point.\n\nThe entire time, Luke would leave his station and pace the lobby. Toward me, then back, not even sweeping the ground as he went. He wasn’t supposed to leave Point and had to walk around customers to get back to his podium to help them. He was told off by a manager once or twice for this, but he continued his antics anyway. Then, as things slowed down, one of the managers approached me and told me we were going down to one Point (one person at the center rather than at both entrances) and that I’d have to explain to Luke how to close Point before I went back to help clean concessions. It had to be this way since I had already taken the sanitation test and Luke had yet to do so and therefore wasn’t allowed behind concessions.\n\nWhen I finished closing my point, I walked over to Luke and told him to move his podium to the center so he could take closing Point. He did, though scowling at me. When he was set, I began to explain.\n\nMe: “so you’ll be closing point tonight after the last movie starts. You’ll need to go to th-“\n\nLuke: “go away”\n\nMe: “what?”\n\nLuke: “I don’t need your help, so don’t talk to me.”\n\nMe: “but I need to teach you how to close point-“\n\nLuke: “I don’t care, shut up”\n\nMe: “i know you don’t like me, but this is work. You need to-“\n\nLuke; “no, I don’t want your help. Shut the hell up.”\n\nMe: “but-“\n\nLuke: “Fuck off, don’t talk to me.”\n\nAt this point, I was beyond upset. I was furious. I was trying to help, even after how he had acted, how he treated everyone here! I didn’t care what he said in the break room, but it shouldn’t affect work. This was ridiculous!\n\nI must have snapped or something, because I complied, walking away, saying: “fine, I don’t care. Don’t ever talk to me again.”\n\nLuke: “Hey I said-!”\n\nMe: (waving a hand over my shoulder) “don’t talk to me ever again.”\n\nI went behind concessions to help, where he couldn’t reach me. I don’t know when, but I started crying out of frustration, and one of my friends came and hugged me, bringing me to a corner to cool down. I don’t get angry often, and when I do, it makes me scared. I was just sick of his antics, sick of the way he spoke to me, just sick of his attitude.\n\nI’m not sure how long I sat back there, but soon enough that same friend came and waved me to the front of concessions. I wiped my face and walked out, and he pointed to Point. There was Luke, being instructed by the manager on how to close point, and the manager did not look happy with him. Arms folded, frowning, flat tone, everything spoke of irritation. My friend said they’d already explained that Luke refused my help when the manager asked them what was going on, as Point can be seen and heard from almost the entire lobby. Seeing the scene lifted my spirits a bit and I was able to end the night relatively easily.\n\nThe next weekend when the schedule came out, I didn’t even have to check my email. It was posted in the group text, specifically the section with Luke’s name. It was blacked out. If he had quit, his name would have been removed, but the fact it was blacked out meant it was a sudden event\n\nLuke had been fired.\n\nI’m not sure what it was that they fired him for anymore, but considering we were always low on staff and they had to worry about discrimination, I’m guessing there were enough complaints that they had to fire him. I’d like to think that last interaction I had with him was the final nail in the coffin, but I was just glad to see him go more than anything. I heard he worked at a common fast food place for a while, but ended up getting mcfired from there too.\n\nGood luck in life Luke. You weren’t missed.",
        "created_utc": 1673572776,
        "upvote_ratio": 1.0
    },
    {
        "title": "A Stinky Surprise",
        "author": "Tabitriialiquaneeze",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/10ae9fh/a_stinky_surprise/",
        "text": "So several years ago, I worked in a daycare in the infant room. The state regulations said diapers had to be changed every 2 hours or when the caregiver noticed the diaper was soiled - whichever came first. There was a boy that drank a lot and so he peed a lot and therefore, got changed a lot. He was also one of those babies that only ever pooped if his diaper was dry. \n\nOne day, his mom went on a rant about diapers so I told her the state regulations and she told me \"Well don't check his diaper, just change him every 2 hours. They're expensive and you're using too many of them.\" My boss agreed, so I did as I was told.\n\nA few days go by and he started getting a rash. She sent cream and said \"I don't know why he getting rashes all of a sudden.\" To which I just said, \"yeah, that's weird, huh? I'll make sure to put cream on him.\" \n\nA few days later, he was due to be changed about 20 minutes before mom was due to pick him up. I realized he also hadn't pooped all day, I knew it was coming. About 5 minutes before pickup time, I smelled it but I did NOT change it. (I want to add: if this had happened earlier in the day, he'd have been changed when he finished pooping and I'dhave just dealt with the bitchfit she threw. The only reason I didn't was to make a point and I knew she'd be there in a matter of minutes.)\n\nWhen she got there, she took him and walked to the car and finally smelled it. I watched out of the window as she stormed back into the daycare in a rage screaming \"Why didn't you change him? He pooped! You know he has a rash!!\" My time had finally come. \n\nI told her, \"Ma'am, I did exactly what you asked me to do. If you check his daily sheet, you'll see that he was just changed 20 minutes ago. You told me not to check his diaper and to only change him every 2 hours.\" She changed him and stormed off to find my boss who surprisingly told her the same thing that I did.\n\nShe never complained about diapers again after that and I changed him as I felt was necessary.",
        "created_utc": 1673565812,
        "upvote_ratio": 1.0
    },
    {
        "title": "Not allowed to have my lights off at work? Ok, I'll just use blinds.",
        "author": "Working_Seat7979",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/10a8ps7/not_allowed_to_have_my_lights_off_at_work_ok_ill/",
        "text": "[removed]",
        "created_utc": 1673552805,
        "upvote_ratio": 1.0
    },
    {
        "title": "EARN $3.5 PER ANSWER CLICK THE LINK AND SIGN UP NOW",
        "author": "Mobile_Emphasis7959",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/10a60sl/earn_35_per_answer_click_the_link_and_sign_up_now/",
        "text": "[removed]",
        "created_utc": 1673546370,
        "upvote_ratio": 1.0
    },
    {
        "title": "Malicious compliance culinary school style.",
        "author": "Witchywomun",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/10a4xi7/malicious_compliance_culinary_school_style/",
        "text": "The other day, we were making pommes normande in class. If you’re not familiar with the dish, it’s apples cut so that they fan out after cooking, and they’re cooked in a butter/sugar sauce then lit on fire with applejack liquor before plating and serving. The pan my partner and I were using were about 12in in diameter. Chef came by our station and said we needed a bigger pan, even though the pan I was cooking in was cooking everything perfectly. So my partner ran into the kitchen and grabbed a 30in pan. The sauce was perfect, but the alcohol didn’t ignite.",
        "created_utc": 1673543679,
        "upvote_ratio": 1.0
    },
    {
        "title": "Ok I will get rid of the promotional mp3 players as they have no value.",
        "author": "NukeStorm",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/10a298a/ok_i_will_get_rid_of_the_promotional_mp3_players/",
        "text": "[removed]",
        "created_utc": 1673537130,
        "upvote_ratio": 1.0
    },
    {
        "title": "I complied with at my school",
        "author": "Civil_Transition1318",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/109y69z/i_complied_with_at_my_school/",
        "text": "So I have a week hands because of the doctors taking out blood and replacing it with Iv so I have to use a backpack nobody said anything until I got to my third period class where my teacher said you can’t have a backpack so what I did was I got a supply bag then my teacher the same one said uh uh uh you can’t have a backpack and said oh uh uh uh this a supply bag",
        "created_utc": 1673525505,
        "upvote_ratio": 1.0
    },
    {
        "title": "Fffffuck",
        "author": "[deleted]",
        "url": "",
        "text": "[removed]",
        "created_utc": 1673505366,
        "upvote_ratio": 1.0
    },
    {
        "title": "\"If you think you know everything, why don't you do it yourself?\"",
        "author": "dispensable4444",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/109plvp/if_you_think_you_know_everything_why_dont_you_do/",
        "text": "So this happened during a group project in my 4th semester during college. For context, I study psychology, and we had to do a psych. eval. report for a mock case and then write a group essay about the importance of proper administration of psychological evaluation methods (such as structured, non-structured, and semi-structured interviews, psychological tests, etc.).\n\nSo we were a group of 6 people (including myself), randomly assigned. Now, I'm not the best with new people, but luckily, got assigned with a friend I knew for about a year and a half. Let's call her D.\n\nD was the more sociable (and less harsh) person between the two of us, so she told me that she would relay my messages to the group so I wouldn't have anxiety issues.\n\nSo we start working on the project, which was due in 15 days at 11:59 PM. At first, we divvied up the work, and each person started working in pairs for each part. I even offered up to do the bibliography since I was well familiar with the APA format required. So D tells the group to just copy and paste any links at the bottom of the document, and I'd do the references. \n\nI had specifically requested this because some people weren't that good with APA format, and it took longer to check for mistakes and correct them rather than me doing it myself.\n\nAnyways, a couple of red flags perk up in my mind when 5 days later, I find the reference list full of sloppily done references (some in the wrong format), and a pair (let's call them M and C) haven't even started their part.\n\nI ignore that, and fix the reference list, and tell D to remind them that all they need to do is copy paste the links.\n\nCouple days later, I find (alarmingly so) that they have done a lot of things wrong. They have used the wrong tests for the case. The case was about a patient who was seeking vocational orientation, and yet they had administered unrelated tests, and have omitted important tests.\n\nD and I tell the group about this problem, and even tell them the pages and graphs in the textbook they needed to refer to. We not only told them that it was wrong, but WHY, and most importantly HOW to fix it. Concerningly, our messages were left on read.\n\nThis pattern repeats for a couple days, until the literal day before the deadline, where an argument ensues. One of the members, M, had even uploaded an Instagram story about how she had \"shit luck with groups this semester\" and how we \"only criticize but never tell us (the group) how to fix it\". I even got some messages verbally insulting me on Instagram by people I didn't know. My IG has been temporarily deactivated for a while due to my inbox receiving literal harassment from 5-6 people I didn't even know.\n\nWe (D and I) argue against them, sending them screenshots about how they've literally left us on read. We even told them how we pointed out the pages and graphs they needed to see.\n\nAt one point, we mention how C (M's pair) hasn't even started his part, with less than 30 hours remaining until deadline. Apparently, M and C were friends, so when D mentioned the fact, M lashed out and said \"If you guys think you know it all, why don't you do it yourself? Do you think you're better than us?\". D and I were literally flabbergasted by the audacity of this bitch.\n\nThen, I heard a lightbulb go *ding* in my head. I took screenshots of the group chat, the IG story, every evidence that would help us.\n\nAfter the argument died down, and we settled on C finishing his part until 5 PM the next day (the day of the deadline) and each member fixing their parts, and leaving comments on the doc with the book chapter, page number, and graph number (if used) so I could add them to the reference list.\n\nAt around 2 AM on deadline date, I message D a Google Docs link containing the project, with only our part of the work (which was around 50% of the work done, *in a group of 6*). I tell her we *are* going to do it ourselves, since she told us to. We literally rushed the work so we could meet the deadline, and in about a day of work (and enough caffeine to energize a small country), we handed the project in, with only the names and student codes of D and I.\n\nA small problem arised when we found out that the group had handed their project in, and we forgot to delete our names from it. We sent an email to the professor briefly explaining the situation, telling her which paper to grade us on, and sending her some screenshots of the conversation once she asked for proof.\n\nWe find out that the group received a 55% (you need a minimum of 65% to pass) on their final grade, while we receive an 85%. How? On our next project (where similar stuff had happened, and D and I decided to just leave the group altogether), M sends a message saying \"Guys, we need to put in our best efforts💪 so we can get our final grade average up 💯\" or something among those lines, emoji and all. I remember sending D a private message with a screenshot of it, and jokingly saying \"sounds like a you problem chief\". I also have screenshots of how C hadn't finished his part 1 hour before deadline.\n\nTL;DR: A friend and I had done most the work in a group project, tried helping group on how to solve problems, but they started blaming us when group project wasn't progressing well. A member told us to fix it ourselves if we were so better than them and knew it all, so we did. They failed the project, we didn't.",
        "created_utc": 1673495891,
        "upvote_ratio": 1.0
    },
    {
        "title": "UPS took me to collections over a $40 Brokerage fee, what’s the best way to pay this that’ll be a pain in the ass?",
        "author": "ACanadianPenguin",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/109nj4q/ups_took_me_to_collections_over_a_40_brokerage/",
        "text": "As the title suggests, I’m looking to be a nuisance since UPS took me to collections over a $40 charge\n\nUPS charges Canadians [Brokerage fees](https://www.ups.com/media/en/ca/ca_brokerage.pdf) simply for doing the job they’re paid to do and deliver packages across the border. **Brokerage fees are not duties** and literally is just a fee they charge to bring your item across the border. They charge this fee based on how much your item is declared at; so even if the package is tiny, yet worth say $500, you’ll get dinged huge fees and those are on top of border duties \n\nIt’s a bullshit fee, so I want to give them some headache for dinging my credit score over $40 \n\nMy girlfriend suggested sending them 40 $1 cheques, anyone have any other suggestions?",
        "created_utc": 1673490062,
        "upvote_ratio": 1.0
    },
    {
        "title": "Lost my jobs because I lost my temper for a Karen",
        "author": "ShoddyAnalysis9",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/109gxi8/lost_my_jobs_because_i_lost_my_temper_for_a_karen/",
        "text": "[removed]",
        "created_utc": 1673473418,
        "upvote_ratio": 1.0
    },
    {
        "title": "have a party on my birthday? then we will drink all your beer.",
        "author": "Ugg225",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/109b7rx/have_a_party_on_my_birthday_then_we_will_drink/",
        "text": "This happened in the late 80's when I was in college.  I'm on my phone, so please excuse any format issues. This also a bit long due to the background info)\n\nTL:DR at the end.\n\nI went to UConn (University of Connecticut). In my sophomore year I was assigned to room in a \"quad\". During the 80's, the school ran out of dorm rooms so they converted study rooms into dorms. These were deemed \"quads\" so 4 student roomed there. My three room mates were seniors, all graduating. \n\nSince I was the \"owner\" of the room (uconn had an elaborate system to assign rooms), three friends approached me to be the fourth,  so as to guarantee the room for next year. I am pretty easy going, so I said yes.\n\nThis was a big mistake since I find that I am not compatible with others, and we constantly butted heads. One example- One of the room mates volunteered to bring their record player for the room, but then didn't allow me to play my records on it because \"it was the devil's music\" (for the record, I had Led Zeppelin,  Pink Floyd, that kind of music). And no. This person was not religious,  he was just being a jerk.\n\nThe list of complaints could on, but it all came to a head on my birthday. Weeks before my birthday I informed my mates that I was throwing a party on my birthday,  and would like to have party in the room. This was not unusual; there had been parties here before, thrown by one or the others.  This was my first request for the room. The others said fine, and I started to invite my friends.  I planned about 10 people.\n\nA few days before my birthday, all three came to me to tell me that they were going to throw a huge party on my birthday.  When I protested, they said my friends could come as well, but the cover charge was 5 bucks. \n\nI pushed back, saying that I was buying my own supplies, so my friends shouldn't have to pay. They agreed.\n\nLater I find that they invited ALOT of people, and I wasn't going to even see my friends, let alone celebrate with them.  \n\nThe night of the party, my room mates tell me to \"have my friends identity themselves so they won't get charged\". This is where the malicious compliance comes in. \n\nI was really pissed that these guys were doing this, so I went down to the ground floor of our dorm, and told anyone coming to the party that if you told the person taking money that you were there for my party, and you won't be charged.\n\nYou can probably guess the rest. The party was a huge success! All the beer drunk, roomates out all their money, I having some sort of satisfaction. \n\nGuess you shouldn't have scheduled the party on my birthday. \n\nOnly bummer was that I really didn't get to hang out with my friends because it was way to crowded. \n\n\nBefore anyone questions how did just about everyone got in free without my roommates figuring it out:\n1. People were coming in staggered- so 50 people didn't all just show up at the same time to make it obvious, and\n2. All three were collecting the money at various times, so they didn't know that everyone was claiming to be for my party, until the end when they pooled their money.\n\nTL:DR : Roommates had a party when I asked them not to, so my \"friends\" drank all their beer.",
        "created_utc": 1673460061,
        "upvote_ratio": 1.0
    },
    {
        "title": "A 6 month process needs to be done in 2 months or it will cost us 100k? Okay.",
        "author": "AlwaysColtron",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/1099awc/a_6_month_process_needs_to_be_done_in_2_months_or/",
        "text": "Long-time listener, first-time caller.\n\nEarlier this year I left a company I had been with for about 4 years. I started off doing IT work and moved my way up to doing system administration for a training system. \n\nRight after I joined in 2020, the team received a new manager. He manages me and a team of 5 others. Let's call him Jay. Jay had no training, education, system admin, or support experience. He was an \"if I use buzzwords, people will think I'm smart\" kind of guy. He and I did not get along at all, which kind of made this story a bit sweeter.\n\nIn 2022, the decision was made to move our platform from one system to another. By this point, I had become the sole expert on the current system and knew it very well. I was not super thrilled about the idea of the migration but I also understood the reason for it and that it was the best thing for our company. \n\nAfter some initial conversations, I quoted the resources and time I'd need to complete the work so that our customers were impacted as little as possible - as well as training the team on the new system. TL;DR I need help from the entire team and a minimum of 6 months to complete the work, work that mostly only I could do. Not that the others could not help, they'd help a ton, but they had jobs and my job was the system so it was mostly on my to-do probably 75% of the work. This conversation was in June/July 2022.\n\nAdditionally, our contract for our current system was up in December with the final possible date it would be usable without a new minimum of a 1-year contract being February. This was good timing if we had started to do the work in June/July, it would be close but we could get it done and not need to re-up our contract - which was a minimum of 100k per year.\n\nJuly - No word done\n\nAugust - No work done\n\nSeptember - No work done\n\n\nEvery week I asked when we were approved to start on the work. I had already outlined what needed to be done, we just needed his approval. Nothing. \n\nBy August, I told Jay if we did not start right now it would be impossible to get everything done without paying for a new contract.\n\nJay made himself such a central person for upper management to go to when it came to questions on the platform, instead of me, even without knowing anything about it at all. \n\nI worked with our team, external teams, and other departments, all in the hope to try and get something done to help cut down on the possible last-minute shifts. While most people were helpful, Jay would roadblock all of them as he needed to be the final decision-maker for some reason. \n\nJay was middle management, and especially in an era and in a remote company (we were remote that time but the company has gone back to fully in-office as of now, ugh), middle managers are basically useless and all they do is try to make themselves seem important to the process.\n\nThe final straw: Had a planning meeting to discuss where we were at. I set it up, and invited as many people as I could that would be involved. I stated very clearly the timeline of events that had led us to that meeting and that it is now impossible to complete the project in the timeframe I quoted 3 months prior. Jay takes his turn to talk and says I have 2 months to complete it with no help from the team because that is all the resources/time I need. \n\nStarted applying elsewhere. I knew if/when this project didn't go as planned, Jay would point the finger at me. After a week of looking, I found a fully remote job that paid better. My role is very sought after so I knew it would not be hard to find somewhere else to go. I didn't want to leave but I knew this could potentially lead to being fired so it was the better of the two options. Put in my notice and left in September. \n\nI'm still in touch with my team, minus Jay, who stayed and they are scrambling to try and do my job. I help where I can and did write down a lot of my processes before leaving. I gave them all to my team and gave them all to Jay and, you'd guess it, Jay claims I didn't handoff nearly as much as I needed to.\n\nFunny enough, Jay got let go in October. He tells people he left but I think after my very rashly written exit interview, they knew what the real problem was. I was offered to come back but they could not match my new pay. And since his departure, things have been going smoother. The team is still f'ed due to the timeframe but slightly improved. \n\nThey are now forced to sign a new contract for 1 year of continuous service for 100k or else once Feb. 1 hits they will be locked from the system and lose all data.",
        "created_utc": 1673455575,
        "upvote_ratio": 1.0
    },
    {
        "title": "Malicious Compliance cost yearly £1 million per year",
        "author": "thernker",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/10977x7/malicious_compliance_cost_yearly_1_million_per/",
        "text": "Was thinking to write about this for sometime. So here it is. Apologies for the long post.  \n\n\nThis happened around 15yrs back. I used to lead a back office process for a Shared Service Centre which wholly owned by a major European Telco. The offshore unit was based of India.\n\nOne of the processes that we had was SIM activation which was a manual process. New SIM card activation used to come in an excel sheet which the team use to activate based on certain pre-requisite checks. It was a 15 member team which worked 24/7. \n\nWe came up with an idea to automate and using macros was able to automate almost 85-90% of the process. My stakeholder back in EU was happy and we were able to redeploy 12 members to different units outside my processes.\n\nCouple of months come our new Compliance Head. As a part of his induction we showed him our process and he was quick to point out the automation and how it was not compliant since it was not made by IT. Any one who has worked in corporate knows IT turnaround for simple automation. \n\nHe made us shut down the automation and manually restart the process. And we had to raise a request to IT to automate this. This was a Friday.\n\nDuring the weekend customer service received huge escalations and complaints. It was also not a good onboarding experience. \n\nThe stakeholder was not happy and raised an escalation with the Indian management team. The head of compliance blamed us for not following process. I had already briefed the stakeholder on what transpired and he was supportive. \n\nAfter a week we got the IT team coming back to us stating that the entire automation would be done in a month's time and it would cost us around £20K (using RPA). So the original free automation would now cost an extra 20K. \n\nThe stakeholder was really not happy with the experience and vowed to move the process to third-party. Eventually within a year my entire process moved to third party who did the automation free of cost. While people got redeployed, it still cost the offshore unit  £1 million which was the cost of my team every year. I choose to join the third party where the process moved and while leaving dropped an email on how the impulsiveness of the Compliance Head cost us our reputation and loss of business. \n\nHe eventually got fired after 8 months.",
        "created_utc": 1673450396,
        "upvote_ratio": 1.0
    },
    {
        "title": "https://siiack.com",
        "author": "fratelo98",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/10924kq/httpssiiackcom/",
        "text": "[removed]",
        "created_utc": 1673435192,
        "upvote_ratio": 1.0
    },
    {
        "title": "You don’t want heavy bags? ok then one item per bag.",
        "author": "Frosty-Payment4222",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/108zkbn/you_dont_want_heavy_bags_ok_then_one_item_per_bag/",
        "text": "So this actually didn’t happen to me, it happened to a coworker but I was there when it happened. This actually happened during the beginning of the pandemic. \n\nI worked as a cashier at a Walmart and this day I actually worked in the registers where we sold tobacco and alcohol. It was early in the morning so around 7:30-8am and a customer comes up to my coworker (Ana) and starts putting her stuff on the conveyor belt, Ana asks the customer if she wants any bags and the customer says yes but to not make them too heavy. We live in California where bags are charged 10¢ per bag which is why Ana had asked if the customer wanted any bags. Usually when a customer says to not make the bags heavy we would put 2/3 items depending on how heavy the item is which is what Ana did, the customer got so angry when she saw she was putting 2/3 items in the bag and started yelling at Ana telling her to not put too many things in the bags cause they were too heavy for her to carry and started saying she was incompetent and was being super rude so Ana with a big smile on her face started putting one item per bag and charged her for each bag, it was a total of like 30 bags so the lady had to pay an extra $3.",
        "created_utc": 1673425091,
        "upvote_ratio": 1.0
    },
    {
        "title": "I got Malicious Complianced",
        "author": "margrunt69",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/108dxj1/i_got_malicious_complianced/",
        "text": "**typing this on my phone, so please excuse any grammatical errors**\n\nMany, many years ago I was in the US Marine Reserves.   We used to do field training 3-4 times a year at a Army National Guard base here in my state.  When we did that, a advance party would got up the day before to get everything setup so that when the unit arrived they could roll into training and not waste time setting up.\nThis particular time I was the NCOIC (NCO in charge).  We spent the working getting barracks setup and getting the training ranges ready. I took everyone to the e-club for evening chow (dinner for you civilians).  Afterwards a couple of the Marines asked since we were pretty much done for the day, can they have a couple of beers from the e-club bar.   I was ok but only two beers, no more.  I didn’t want a bunch of drunk/hungover Marines the next morning.\nI step outside to make a call back home to my girl friend, come back in 10 mins later, and saw their compliance.   Each had ordered 2 of the Foster Oil Can beers.\nA normal sized can or bottle is 12 oz, the Fosters Oil cans were 24 oz.   They were like “Sgt Margrunt, you said only 2 beers, never anything about what size!”  Everyone was laughing…..including me.",
        "created_utc": 1673367969,
        "upvote_ratio": 1.0
    },
    {
        "title": "The Good Fight",
        "author": "lawrenceoftokyo",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/108dqf1/the_good_fight/",
        "text": "In my hometown (as I suspect in many hometowns the world over), there is a fellow who has built up a not insignificant following spreading covid conspiracy theories and anti-vax sentiment. He even ran for councillor of the community (but thankfully lost). At first I answered his mis-/disinformation directly on Facebook, but realized that it was just giving him the attention he desired. So when he tagged me (multiple times) in the comments to his post asking his critics to complete a 21-part questionnaire, I decided to have a little fun with it on my substack.  [https://zacharyhache.substack.com/p/the-good-fight](https://zacharyhache.substack.com/p/the-good-fight)",
        "created_utc": 1673367484,
        "upvote_ratio": 1.0
    },
    {
        "title": "Best Programming Languages For Hacking In 2023",
        "author": "ARFASOFTECH",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/1089wb6/best_programming_languages_for_hacking_in_2023/",
        "text": "[removed]",
        "created_utc": 1673357477,
        "upvote_ratio": 1.0
    },
    {
        "title": "Gold bullion bars",
        "author": "alexhales698",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/1086s8u/gold_bullion_bars/",
        "text": "[removed]",
        "created_utc": 1673347327,
        "upvote_ratio": 1.0
    },
    {
        "title": "I'm an average delivery driver? Alright then",
        "author": "Dertyhairy",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/10865tk/im_an_average_delivery_driver_alright_then/",
        "text": "Awhile ago I used to deliver wine for a company. Very fancy restaurants, very busy places. I enjoyed the work and the people I worked with. During my time there I accomplished runs most guys couldn't (They would complain there is too many jobs on the run, needed their lunch break, whatever)\n\nI also didn't play around. I knew the best side streets and everything else to avoid traffic and maximise my route. I thought while going through all this that my employer would see my initiative and pay me more for the work I was doing. I skipped my breaks and focused on the customer. Until...\n\nI got my first performance review. Now, to say I was good at my job was an understatement. They told me though to never put a 5 (On a 1-5 point scale). But I was that 5. I got given a job when 2 of my colleagues called in sick and had to travel about 300 kms with a deadline of 2pm for one job (Legally you would've been there by 6pm) but I was there at 2pm. I made it happen thinking they would sort me out\n\nGuess what? They didn't. And the fact he thought I was worth a 3 (Needing improvement?) really pissed me off. I don't think he knew I could see his grading sheet, but he should've covered it a bit better\n\nSo. I became a 3. I stopped at every yellow light. Every loading zone? I stopped for the entire minute they allowed. I cruised into every stop there could be. I started my runs at 8am and used to finish by 11. Now I finished at 2-3pm. So late they had to start asking the guy in the office who used to do the runs to pick up the pieces. But, when customers called he wasn't there to answer which put pressure on the staff in the office\n\nThey were hopeless and they got hopeless",
        "created_utc": 1673344952,
        "upvote_ratio": 1.0
    },
    {
        "title": "I'm not paid to think? You got it!",
        "author": "Tall_Tyrion68",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/107uz9e/im_not_paid_to_think_you_got_it/",
        "text": "So this is something that happened a long time ago. Probably before a lot of you were born, back in the dim, dark recesses of the late 80's. I was working at a local pizza joint for $2 an hour and .15c a mile for a manager who, TBH, was mostly okay, but she definitely had her moments...\n\nI forget what the original issue was, but she was giving me instruction on something. I'm not confrontational, and I have always been the kind of employee who will do whatever I am asked, but I also try to suggest something different if I have an idea. If you don't like my idea, that's fine, you are paying me, I'll do it your way. But I also think that making a suggestion can be valuable. Not all people in charge agree, of course.\n\nSo she's telling me how she want's something done, and I speak up and say\" Well, I think...\" And that was as far as I got.\n\nShe snaps at me \"You're not being paid to think, you're being paid to DO!\" \n\nOkay, then. You got it, Boss.\n\nThe other thing you need to know is she was a huge fan of a sixties band that was experiencing a surge in popularity at the time, due to a surprise hit single. There was a concert scheduled for a town about an hour away, but she found out about it too late to get a ticket. Sold out. She was incredibly disappointed. The local radio station had a few pairs of ticket that they were giving away, however, and she was desperate to get her hands on them. She had entered not only her own name, but her husband's name and even her children's names to increase her chances of winning. \n\nIt was a week before the show, and she was on pins and needles, hoping for a call. She had given the radio station the number for the pizza joint because she knew she would be working. The other piece of information you need to know at this point is that while she had a very common name, it was spelled in an unusual way, so people who didn't know were constantly mispronouncing it.\n\nI'm taking phone orders when I get a call asking for my manager, but using the mispronunciation of her name. I recognize the voice, of course, it's the DJ who was on the air at the time. Hmmm.... why would he be calling here? Did he need a pizza delivery?\n\nCue malicious compliance.\n\nI'm not being paid to think, I'm being paid to do, so naturally, I tell him that there is no one here by that name.  \n\n\nTL/DR: Manager doesn't want me to think so she misses out on tickets to a show she wanted to see.",
        "created_utc": 1673309808,
        "upvote_ratio": 1.0
    },
    {
        "title": "Insist on superuser privileges? Hope you like getting up in the middle of the night.",
        "author": "rjwut",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/107uo4v/insist_on_superuser_privileges_hope_you_like/",
        "text": "I worked at this company as a software developer, and as it was a relatively small business at the time, all the developers took turns being on call for dealing with issues with our production site. People who were part of this rotation could get notified of a problem any time of day or night, and were given superuser privileges to configure and manage our production systems, so that they could have the ability to address any problems that arose.\n\nAmong these superuser utilities was something that allowed us to re-execute all or part of our overnight reporting runs. This could be used for testing (overriding the recipient with an internal address so only we would get the reports), or to send corrected reports after an error. Originally, these tools were available to any employee, but we quickly changed that when we had people messing around with the controls without understanding what they were doing and accidentally sending our customers duplicate reports.\n\nWhen access to these tools was taken away, some folks (mostly in sales) would ask us to run certain reports for them. Usually we were fine with this, as long as they were reasonably respectful of our time. One sales guy, however, decided he couldn't wait for us to have time to do his tasks, and wanted direct access to these tools. Knowing that our bosses wouldn't give him access, he started directly pestering developers to grant him superuser privileges. We'd tell him no, but he'd just come back and keep asking, thinking that at some point somebody would give in.\n\nWhen he came around to me, I decided to take a different approach. I told him that I certainly could make the required changes to give him access to these tools. He looked pleased. Then I told him that I'd just have to add him to the rotation. When he asked what that meant, I explained that because these privileges were so powerful, they came with responsibility, and that everyone who had them was part of the system monitoring rotation. \"So if the production system goes down at 3 am, for example,\" I said, \"You'd receive alerts on your phone so that you could help with resolving them.\"\n\nThis was patently ridiculous, as he didn't have any of the required skills, but the part about being woken up at 3 am was what grabbed his attention. He looked like he'd been told he'd have to eat a live rat, but he tried to be casual, saying that on second thought maybe he could get along without superuser rights. He never bothered any of us about it again.",
        "created_utc": 1673309020,
        "upvote_ratio": 1.0
    },
    {
        "title": "I gave Booking.com a 5 star review after a horrible experience",
        "author": "AdviceDetective",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/107t706/i_gave_bookingcom_a_5_star_review_after_a/",
        "text": "[removed]",
        "created_utc": 1673305471,
        "upvote_ratio": 1.0
    },
    {
        "title": "You're talking to the wrong guy",
        "author": "Willnotholdoor4Hodor",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/107qrfx/youre_talking_to_the_wrong_guy/",
        "text": "Worked front desk at a hotel while in college where I first learned how terrible humanity can be. One day my manager saw some guy park his truck in our lot and leave, clearly not staying at the hotel. So he prints up some paper saying please do not park here as its an insurance liability yada yada. He leaves for the day so then the guy later calls in and yells into the phone \"I want to yell at the guy who left this letter on my truck\" and I tell him he's out of the office but I can transfer it to his voicemail but instead the guy launches into this whole tirade about how we don't know anything about him or his life and how he's going to go back home and tell all his friends and family not to stay at our hotel...that's three states away in a tiny city with a capacity for 100 people lol. Guy does not stop yelling for honestly like 5 minutes allowing me to literally put the phone down and check in a guest and whatnot. Eventually he tires himself out and says \"Now will you tell your manager everything I just said?\" at which point inspiration struck and I was just like \"No\" and I only wish I could've recorded the literal sputtering this guy did before he finally asks \"Why not?\" and I respond with \"Because I'm not the guy who left the paper on your truck\" and he goes \"Let me talk to your manager!\" and I respond with \"That's what I've been trying to get you to do this whole time!\" He hung up lol.",
        "created_utc": 1673300018,
        "upvote_ratio": 1.0
    },
    {
        "title": "That door is for members only!",
        "author": "tpb772000",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/107oqhp/that_door_is_for_members_only/",
        "text": "I was not the malicious compliance engineer, rather just a participant.\n\n&amp;#x200B;\n\nSo, a while back, I  worked for a country club and occasionally we would have a tournament/game where people would come play a few holes at night. We also had other activates as well. Not only was it fun, but due to the abnormal hours, the tips were usually above average so I tried to work these events when they came up. Another plus side was if you worked this party, you automatically got to come in later and were not scheduled for for the morning shift. \n\nThis time when the tournament/party rolls around, we have some renovations going on. Due to this party being out side, we have to carry the things we need..... outside. However, no one thought of this and the double bay doors we normally use were no longer available. They put pallets of concrete and old tile in front of them (was not a fire escape door so no biggie I guess?)\n\nDue to this, now we had to carry whatever we needed down the hall, use the elevator and then go down a make shift ramp that led to the basement so we could go out the golf cart bay doors. This not only disrupted the kitchen staff but also disrupted the cart jockeys. If we were almost at the end of a the tunnel leading out side a cart jockey was trying to bring in a cart he had to wait and vise versa for us and the same thing went when we used the kitchen elevator and walk way. \n\nWe started getting ready for the party around 6:00. We would take the needed items over to the shelter and store them there until it was closer to start time. \n\nIt took a lot of time due to complexity of carrying/rolling huge tables around the entire country club especially the elevator. Some of our tables were so big we had to shove the light fixtures up a little bit to get them to fit. \n\nAround 9:00 we were getting the last of the supplies when my co-worker Steve has the bright idea, hey its been dark for about 45 minutes, lets go out the front door and since it is on the same level as our storage we have no elevator or small hallways to worry about!!\n\nWell we take one load out, load it in the cart, take the second load out load it in the cart, no problem. Right as we were loading the 3rd and final load our banquet/planning captain comes rushing over. NO NO NO NO NO NOOOO that door is for members only!! You cannot use it to load that stuff. \"Sorry we we figured that since no one had been golfing in the past hour it was fine.\"\n\n\"Well it is not okay and if I see anyone use this door for anything else you will face disciplinary actions. You cannot use this door unless you are a member.\"\n\nwell shittttt. We both proceeded to take the rest of the load out the more difficult way and then carry it all the way around back to where our cart was waiting with the other 2 loads. \n\nWe drive off the the event and start getting set up as it will begin soon. \n\nWhat we discovered later on, is that no one told the last cart jockie that none of us had a key to 1 unlock the door or 2 to lock it when we leave. So naturally we tried all the usual doors we can enter in, even the one from the break room for smokers to use. - nada. \n\nSteven says hold on ill be back, runs to the front and lo and behold one of the doors to the front was unlocked. Too bad it is for members only and none of us are members. \n\nThe 5 of us decide its worth the extra time to be petty, so Steven calls the banquet coordinator (our boss) and lets her know. After much discussion, she realizes we cant leave it at the shelter as it will most likely ruin our chairs and some of the wooden tables as well as the decorations we have and she has to come in. \n\nBy the time that we are finished, it is almost 4:30, it was a lot faster with no kitchen personnel or cart jockeys but still took a while especially with the added time it took her to get there. \n\nWell guess who showed up at 4:30...... our general manager.... he used the front door that we found was unlocked. He saw our boss and asked why she was here so early, which she replied we were locked out so she had to come let us in. Then he asked her why we didnt just use the front doors since they were wide enough and unlockable from the inside (unlike the cart doors)?\n\n&amp;#x200B;\n\nThis brought a hell storm of rage upon the 5 of us. She came speed walking in her heels looking like she wanted to turn us to stone like medusa. \n\n\"5 of yall and non of yall tried the fucking front door? Really?? Why the hell did no one check the bloody front doors before calling me?\"\n\nAt this point, I was like ah shittttttt \n\noutta no where here comes Steven with \"You said we couldn't use that door or we would face disciplinary actions. \n\nIf looks could kill, Steven would be dead. She glared at him, then her eyes glazed over, she turned around and went to go get ready for her shift. \n\nThere was never another word about it but we all laughed about it for a few weeks. \n\nBy the next time we had an event outside, the construction/restorations were complete so we just used our normal doors to go out.",
        "created_utc": 1673295487,
        "upvote_ratio": 1.0
    },
    {
        "title": "teacher finally give in and the students regret it right away",
        "author": "Ghostietheraccoon",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/107mq1s/teacher_finally_give_in_and_the_students_regret/",
        "text": "[removed]",
        "created_utc": 1673290936,
        "upvote_ratio": 1.0
    },
    {
        "title": "Contract work and Fines.",
        "author": "WhitestWhiteEver",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/107km2j/contract_work_and_fines/",
        "text": "Not story but my brother's. He works at waste water management company that will pay to get him certified in things they need and these certifications come with benefits of being necessary to do side jobs for places that don't need a full time inspector on the clock but do need someone to come out and do monthly inspections. So after getting a specific certification, a company to see if he'd come do a monthly inspection for a few hundred dollars and his family could use the extra income so he agrees. Few months go buy and he's doing the inspections and then notices the checks stopped coming after a few months so he calls and they tell him they'll get him his money. Next Month rolls around and he does the inspection but they still haven't paid him for the last few months and he figures they'll tack it onto this upcoming check and then another month passes, still no check and the inspection is due. He decides to just stop wasting his gas and doing the inspections. Half a year goes by and he gets a call asking why he stopped doing the inspections and he told him he hadn't been paid for so he assumed they no longer needed him and he couldn't afford an attorney to go after them for not paying so he just stop going all together, they then sent him the money they owed for the 4 months they hadn't paid him and included the next inspection which they asked him to do ASAP. My brother's fee was about $600ish a visit, the fines are roughly $10,000 for not getting these monthly inspections and for the entire 6 months my brother hadn't been doing the inspections, they had to pay the fines.",
        "created_utc": 1673286148,
        "upvote_ratio": 1.0
    },
    {
        "title": "funny realization",
        "author": "rainbowskitttles666",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/107k3r6/funny_realization/",
        "text": "I f20 was playing on my Xbox when the Xbox said the disk was dirty or smth I looked at it and it was super scratched I just got it and haven't played it yet and I'm too lazy to return it so I snapped it for fun and realized how very hard it was to break. This is where the funny realization comes in when I was about 7 I was obsessed with this Disney barbey movie that I watched 24/7 one day I found it on the ground in pieces and cried to my Father about it he said that our cat must have done it I'm just now realizing that he snapped it out of annoyance 💀🤣",
        "created_utc": 1673284989,
        "upvote_ratio": 1.0
    },
    {
        "title": "My Aunt tells me to deal with it myself, so I do.",
        "author": "AccomplishedFly4782",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/107e0fu/my_aunt_tells_me_to_deal_with_it_myself_so_i_do/",
        "text": "[removed]",
        "created_utc": 1673269766,
        "upvote_ratio": 1.0
    },
    {
        "title": "Grid",
        "author": "geepatton",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/1079z2d/grid/",
        "text": "[removed]",
        "created_utc": 1673256047,
        "upvote_ratio": 1.0
    },
    {
        "title": "Left my friend 3 years ago",
        "author": "Rob_will_be_nice",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/10762x5/left_my_friend_3_years_ago/",
        "text": "[removed]",
        "created_utc": 1673242939,
        "upvote_ratio": 1.0
    },
    {
        "title": "Just fucking leave? Well alrighty then!",
        "author": "Arizona_Coyote",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/1071xj8/just_fucking_leave_well_alrighty_then/",
        "text": "So my ex wife used to pull the bullshit move of getting out of the car and walking whenever there was an argument, knowing my stupid ass would follow her and try to convince her to get back in so we could go home.\n\nOne night she started an argument accusing me of “flirting with the waitress” who was the mother of one of my high school friends. Definitely wasn’t on my radar of women to flirt with, and I let her know that in no uncertain terms. \n\nAs usual, she jumped out of the car and starts walking. \n\nSo here I go, driving next to her, window down trying to coax her back in the car. \n\nNow on this particular evening, it was raining. And cold. And I had really just had enough of this stupid habit of hers. \n\nSo I asked her twice to get in, and I told her I’d leave if she didn’t. She said “Just fucking leave!! Go home!”\n\n\nSo I did. \n\nWent home, cracked open a cold Pepsi, grabbed my new book, plopped my ass down in the recliner and started reading. \n\n30 minutes later she flings the door open, looking like a drowned rat and extremely pissed. She starts yelling “WHERE DID YOU GO? WHY DIDN’T YOU COME BACK FOR ME???”\n\nI calmly said, “Well you told me to leave and go home, I just figured you needed some time to cool off!”\n\nFunny, you know she never got out of the car again for some reason 🤔🤔🤔",
        "created_utc": 1673230995,
        "upvote_ratio": 1.0
    },
    {
        "title": "She said \"...contact a lawyer.\" ... ok",
        "author": "JoephNightwolf",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/106ygyg/she_said_contact_a_lawyer_ok/",
        "text": "Injured at work.  Ambulance, hospital, doctors, in patient therapy, out patient theapy excellent, first class.  Insurance did not cut corners.  During hospitalization some small nerve damaged was found.  I was told it could last for years or fix itself.  Immediate solution; a pill.  Used for the treatment of mild Parkinsons, one a day if needed.  It worked well.  During my eight months of therapy I used about 15 to 20 pills a month.  Physical therapy completed (great therapists) I returned to work.  The pills were prescribed in a frequency greater tnan my use, but the pharmacy would call on schedule to pick up more.  At one point I realized they had not called, so I called.  Prescription expired I was told.  Had plenty of unused pills so not in a rush for more, I contacted the Insurance Company.  Told \"Case Closed\".  I argued that this was part of the original diagnosis and might continue for years.  \"Case Closed\" was the response.  I offered to pay for the pills but needed the script from rhe doctor to get more.  I was told that all I could do was reopen the claim.  \"ok, thank you.  How do I do that?\"  The answer was given.  \"call a lawyer\", she said.  I had been treated very well by the Insurance Company up to this point without litigation, but OK.  $84000 plus their legal fees.  The pills were $0.34 each, $81 dollars a year.  All I wanted were the pills.  NOTE to Underwriting.  Don't be in such a rush to end Workmans' Comp Claims.  I just wanted the pills.",
        "created_utc": 1673221877,
        "upvote_ratio": 1.0
    },
    {
        "title": "You must work the weekend",
        "author": "Connect_Basket2698",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/106x36s/you_must_work_the_weekend/",
        "text": "I was an IT contractor for a company doing a large new project. There were about 30 people writing code. We were allowed as much overtime as we were willing to work and I could use the money. I was working 12 hours, 5 days a week. On the weekends, I would go racing, usually out of state.  It was common on Thursday to get called into a meeting saying we needed to work 8 hours Saturday, 4 on Sunday. Most people would have 52 hours in total. I would do it if available putting me at 72 or 76 since 4 hours is stupid. Other times, I would point out I would already be at 60 and had plans. I was given an exception the first couple times. Then I was told I was not being a team player. So I clarify: If I work 12 hours between 5 pm Friday and 9 am Monday, is that good? Yes. Well OK then.\n\nI left the office at 9pm on Friday. 4 of the 12 down. The race trailer was already loaded up and ready to go. I headed out in the morning for a 4 hour drive. After the race I headed back. Since I was driving near the office and the parking lot was empty, I pulled in trailer and all around 3am. I figured just badging in wasn't enough to demonstrate compliance. I sent an email out to the group with every task I completed.  I completed everything I had been assigned. There was a white board with unassigned tasks. I sent an email that I was pulling a task, then another when completed. I had my full hours in at 11am.\n\nI was being a smart ass. However,  I didn't really expect the manager to get as annoyed about it as he did. A bit later, my contract was cut by that manager for my \"abrasive personality\". The fallout seems to have been against me, but not in the end. My contract was cut. I was told on a Thursday morning and given the next 3 full weeks notice. By Thursday afternoon, I had a job interview scheduled for Monday. By Monday afternoon, I had a couple more scheduled. I started a new position with no gap.\n\nThat is pretty much the malicious compliance. Below is the fall out from the retaliation.\n\nThe manager blamed the \"abrasive personality\" comment on the business. They are the people asking for and defining the project. I only worked with one. During my notice, I was working with her. I said something about someone else having to do the next phase. She says yeah, that sucks. After giving cat butt face, I tell her that I was told the business wanted me gone. Since she was the only business I dealt with... wavy hand motion. She just got a pissed look and stormed off. Her anger went up the org tree and back down my branch. Manager was told \"I want OP on this project, deal with it\". I had multiple people (HR, manager's peers, etc) ask me if I wanted to stay. They would have to \"make the s\\*\\*\\* hit the fan\" to do so. They didn't want to do that if I was leaving anyway. I said I already had accepted an offer. I just wished he had to be the one to ask me to stay. He was made to ask me if I could extend the notice period to provide training sessions on my techniques. Me: \"So you want my productivity, just not me?\", \"Well, yeah\", \"No, I am already scheduled to start a new position.\"\n\nDuring my notice, 12 people found new positions and gave their notice. The attitude was that if the company was willing to cut me, they could cut anyone at any time. They would rather leave on their terms. That was not a problem for coders at that particular point in time.\n\nI was still working 60 hours a week during my notice period. On my last day, when leaving, the only person still there was that manager's boss. When I said bye, he said he had meant to talk to me before I left. I sat down and talked. I said you must be wondering why I would be working late on my last day. I wanted the section of software I was on to be working before I left so no one could blame me for it not getting done. I said I was the only one left in the last few months who was working on it. All tests had passed that day. Another section with similar work has 6 people working on it and is not done. He began to question the manager's decision making. He thanked me and said he may reach out in the future.\n\nA couple months later, someone reached out to me to see if I would come back. The manager's contract was cut as were the other 3 people from his contract house. An employee who was buddies with the manager was moved off the project. Apparently since the manager was also a contractor, he could not technically cut my contract. It was done by this employee. I didn't go back as my new \"abrasive personality\" manager and I got along great.",
        "created_utc": 1673218547,
        "upvote_ratio": 1.0
    },
    {
        "title": "want me to stock cigarettes till they are full? OK I will.",
        "author": "Agreeable-Book-7018",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/106vbh3/want_me_to_stock_cigarettes_till_they_are_full_ok/",
        "text": "A few years ago I was a cashier at a gas station. I worked 2nd shift. Each shift had a list of duties that they had to complete, most was the same except 3rd shift had to clean machines. However, there were other things they didn't have to do, such as stock the cooler, change the outside trash. One thing that was required was all shifts had to stock cigarettes. We would stock them, then do a cigarette count, then we would have to track what we sold. That was company policy for all shifts. Well, they had one person leaving at 10, with 3rd shift coming in at 10:30 and the other 2nd shifter leaving at 11. We would get busy about 10 and sell alot of cigarettes. 3rd shift was often late so we would barely have time to count our drawer and do our paperwork then leave. Well our boss chose to ignore how busy it was and decided that 3rd shift didn't have to stock, but 2nd shift had to. She kept complaining that they weren't being stocked on 2nd shift and 3rd shift didn't sell enough to justify stocking. She said she was gonna write me up if they weren't stocked the next time I worked. So we had a back wall for display purposes then our overhead where we stocked. The next night I worked I looked at every row and column to see what had less than the alloted amount, 9 packs for the first 2 rows, 19 packs for the other 2 rows, 3 columns across. I then proceeded to open new packs and stock each one full, the extra packs were put on the display case where the labels said they went. The next day my boss was complaining about how she had to count all those cigarettes and how it took her so long. I told her she said if I didn't fully stock them I would be wrote up, so I fully stocked them. Needless to say, she never complained about me not stocking cigarettes again.",
        "created_utc": 1673214365,
        "upvote_ratio": 1.0
    },
    {
        "title": "\"Sure no problem I will wait\"",
        "author": "jakethatgeek",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/106o6cx/sure_no_problem_i_will_wait/",
        "text": "I (24M) travel a lot for work and have over half a million points for a very reputable hotel group. Most of the time I do not travel very far between hotels so I tend to arrive earlier than the check-in time for many hotels. \n\nOn this day, I arrived less than an hour before the check-in time and was told I would have to wait until that exact time to check in. Sure, no problem I will wait. I then proceeded to sit in the chair directly in front of the desk while they milled around and tried to pay no attention to me. About thirty minutes pass and an elderly couple come in to check in (mind you, it's still not time to check in). The elderly couple is then checked in and ushered to their room, while a line begins to form from more people waiting outside to check in. I am still sitting in the chair directly in front of the desk, while the clerk checks in two more groups. She pauses before the third group and then asked for me to come up and everyone in line seemed disgruntled. She takes my ID and card and realized that I am a member of the highest honor point program they have and started apologizing profusely. I checked my watch and it was still ten minutes before she told me she could check me in anyways. No problem. I'll wait.",
        "created_utc": 1673197429,
        "upvote_ratio": 1.0
    },
    {
        "title": "Shitty management",
        "author": "BootChemical4773",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/106kjrr/shitty_management/",
        "text": "[removed]",
        "created_utc": 1673188174,
        "upvote_ratio": 1.0
    },
    {
        "title": "Cancel the service? you bet",
        "author": "miraculousladybug93",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/106fkho/cancel_the_service_you_bet/",
        "text": "I work in Roadside assistance as a 3rd party for a lot of insurance companies. \n\nLike most customer service jobs we get a heck of a lot of abuse. \n\nBut the most of it comes from long wait times and/or not being fully covered. \n\nThis happens often but I very rarely am in the position where I get to see the fall out.\n\nRecently I had a woman call in. She was completely pleasant but in a huge rush so she was a little snippy.\n\n No worries I get it.\n\nBut then it comes to letting her know that she is not covered for assistance and she has a huge out of pocket expense. \n\nShe whines about the fact that he knows she has roadside. Then that she supposedly set up the service earlier so not only am I trying to charge her but it's taking too long.l and therefore the price should be waived. \n\nFinally she gives up and tells me I'm useless and says \"Just cancel it and hangs up\"\n\nBeing the good rep that I am I call her back to confirm the disconnect was intentional. She picks up then hangs up immediately then sends me to voicemail on follow up calls. \n\nSo as instructed I cancelled the job request. \n\nI should note intake doesn't take long but it's annoying to go over and of the customer doesn't know their exact location like being on a freeway it takes can take some time.\n\nA few hours later I get a new call from an angry customer wondering where her service is at. \n\nI apologize for the frustration ask for her reference number and inform her that unfortunately there isn't any service in the system. \n\nShe starts going off. I do my best to calm her down and extract the needed information. \n\nHalf way through the call I realize it's the same angry pants woman as before.\n\nWhen we start going over location I remember the drop off location and she gets excited and says oh, \"you found my service? Is the driver on the way? It's ridiculous that it's taking this long, you should get this prioritized or expedited.\"\n\nTo which I reply in my nicest CSR voice, \"No Ma'am, your service isn't in the system. I remember when we spoke earlier. As you requested I cancelled the job at that time so it is only getting opened now and the amount will be X\"\n\nHer - that's more than it was earlier.\n\nMe - yes the pricing changes through our the day to continuously match the market, stay competitive, and incentive drivers to continue taking jobs at unpopular times.\n\nHer - silent\n\nMe - also we have longer etas at this time so you will want to get this payment taken care of ASAP so we can find a service provider to avoid a longer wait. I can send a text message to you to complete payment. \n\nHer - Stutters... But but I never told you to cancel it before.\n\nMe - (starting to lose patience) Ma'am our calls are recorded, I notate obsessively, and I called you back multiple times trying to confirm.\n\nHer - I want to speak to your supervisor... (Ranting to make me scared)\n\nMe - No problem, one moment... It looks like there is currently a 20 minute wait for a supervisor I'm happy to wait with you.\n\nHer - fine the. Get my service started\n\nMe - certainly I'll send the text for payment...\n\nShe finally broke down and paid it and gave up waiting for a supervisor. She swore up and down that she was going to report me. Either way I felt vindicated with my tiny bit of malicious compliance.",
        "created_utc": 1673171998,
        "upvote_ratio": 1.0
    },
    {
        "title": "Ho shit",
        "author": "Parking_Reveal9464",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/106bqjl/ho_shit/",
        "text": "[removed]",
        "created_utc": 1673158413,
        "upvote_ratio": 1.0
    },
    {
        "title": "Required to work your irrelevant event, AND I have to wear the stupid shirt? OK, but you’re not going to like it…",
        "author": "vwscienceandart",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/106b9m1/required_to_work_your_irrelevant_event_and_i_have/",
        "text": "Many many years ago at uni, I was a music major at a small college where there wasn’t a teacher for every individual instrument, and like-instruments were grouped under a common teacher. It was frustrating because my prof was not an expert in my instrument, I was significantly advanced beyond the prof’s skill level and we had many disagreements in lessons because this prof would often try to teach me wrong things that apply to the prof’s main instrument but were completely wrong for mine. Prof would often give me bad grades from resentment because I refused to take on bad habits that would set me backward just because prof didn’t know better. Prof didn’t even own one of my instrument when we began (a common instrument, not the rarer ones), and when finally thought maybe they should do so if they want to be taken seriously, got the cheapest beginner version on the market that sounded like trash. Very frustrating when you are trying to get a university-level education in your craft from this person. \n\nOne day, prof decides to boost academic props by hosting a symposium for prof’s main instrument on our campus that will be very enriching for students of that instrument and largely irrelevant to the rest of us. Cool, good for them, enjoy your day. Rock on.\n\nThen as time gets closer it is announced that we are ALL expected to WORK hosting the symposium, not just those students who play that instrument, and our grades are held ransom to depend on it. I was furious. I was a very serious student academically with so much to do, I did not have this time to spare to dick around at some irrelevant event over multiple days. Prof had [EVENT DAY] shirts printed and tells us we all have to wear these as the uniform. \n\nOk, if you insist. You leave me no choice. But Prof never said the shirts had to be worn in their original condition as handed out. \n\nI am quite artistic. So in my petty rage, I go and buy fabric paint in bold, complimentary colors to the shirt design. In the blank space above [EVENT DAY] in a complimentary font to the design, I added the words: “I SURVIVED…” It looked just like it came from the printers, and it popped much more than the other shirts so it was an eye-catcher! I showed it to my other young colleagues who were equally as angry and disgruntled as me, and of course they wanted theirs done, too. All in all it was probably only about 5 of us, but we made sure to take the most visible positions: registration table, greeters, auditorium doors programs… All of us with our bold shirts that read, “I survived [EVENT DAY].” It was probably an hour in that prof wandered into the building deep in academic hobnobbing with colleagues visiting from different institutions. I will never forget the moment it registered on Prof’s face what we had done….how we rendered the subtle embarrassment, rebellion and middle finger. Prof trying to stay cool and pretend nothing was wrong and not lose face… Us smiling so big and friendly to the guests… Prof going from pale to green to furious red, trying to find just the right moment no one would notice to shoot me daggers because she knew instantly who was behind this. \n\nAnd if you are wondering, no, prof couldn’t/didn’t dock my grade because I did exactly as asked and clocked my hours and had witnesses to my impeccable charming behavior to our guests. I had already registered multiple complaints to the department chair about prof’s incompetence and I was a model student. It was already dubious whether she had authority to hold our grades hostage over this event anyway. So I called her bluff and got away with it.\n\nWish I still had that shirt!",
        "created_utc": 1673156925,
        "upvote_ratio": 1.0
    },
    {
        "title": "so excited!!!",
        "author": "Prestigious-Toe-627",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/106aqkr/so_excited/",
        "text": "So ... It's been aboutt a good five or six months and I've been able to be on Facebook be on a dating site do anything all because I meant some hooker on a dating site and her fat sister hacked my phone now there's images of me doing p*** and being in p*** all because she decided that she was too lazy to work and she would f*** for a living she thought that was like a way to get back at me I guess cuz I wouldn't just hand her thousands of dollars to go f*** other guys so here's what I'm asking I went to get on a dating site the other day and I'm blocked is that because she featured me in her p*** I was never a participating member in fact I called the police over at numerous times her name is Sarah Cole and she's from Saginaw Michigan and I definitely want to shame her because I think what she did was disgusting and it's still disgusting and she's still doing it to more people does anyone have anything any clue of what I can do about this thanks",
        "created_utc": 1673155265,
        "upvote_ratio": 1.0
    },
    {
        "title": "Not bringing ear protection to shoot guns? Very well.",
        "author": "deathskrieg",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/10631r0/not_bringing_ear_protection_to_shoot_guns_very/",
        "text": " I'm a bit of a gun nut. So naturally I visit the range often.\n\nI took a trip with a friend to an outdoor range and after a while of shooting, this other group shows up. I was coming back from setting up more targets when I notice a kid with them who's not wearing ear protection. One if the adults with him notices my concern and attempts to reassure me saying that \"he won't be shooting today\" I ask if they have hearing protection and he says \"we'll be fine, keep shooting\"  I then empty a 20 round magazine of 7.62×51. I look over after a couple of shots and notice they are all coving their ears with their hands\n\nDepending on the rifle, 7.62×51 can generate around 150 decibels.\n\nPermanent ear damage can occur at 120 decibels for any length of time.\n\nThey left as soon as my magazine was empty.",
        "created_utc": 1673133967,
        "upvote_ratio": 1.0
    },
    {
        "title": "(Not) taking out the trash",
        "author": "roirraWedorehT",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/1062aya/not_taking_out_the_trash/",
        "text": "I think I can count this as malicious compliance, but this is on behalf of a guy named Gill I worked with about 28 years ago, and this is one of several humorous stories about himself that he shared.\n\nFirst, some background:  I don't remember Gill's last name, and he's probably drank himself to death by now.  He had two tours of duty in Vietnam and two teenage kids who occasionally spent time in jail - even at Christmas - for trying to emulate stupid things they saw in movies.  Everything that came out of his mouth was deadpan, so it was impossible to tell when he was intentionally trying to be funny.\n\nGill  was telling me about the regular person whose job was to empty everyone's trash at a previous job.  Whenever this guy was about to be on vacation the next workday, he wouldn't empty the trash - opting instead for compressing the  trash in each can.  Gill would be the one to empty the trash while the regular person was on vacation, and since the trash was denser than it should be, it was a pain to empty it all.\n\nFinally, Gill got tired of it, so the whole week that the other guy was on vacation, Gill didn't empty any of the trash.  He compressed it all each day.  He would get on top of desks or other items and jump down into the trash cans instead for the amount of compression that would be necessary to make it last through the regular worker's vacation.\n\nI followed Gill's example in a more minor way when I later worked as a retail manager.  A different department manager's method was to overfill a weak trash bag in a can with his department's old food and that my employees would be responsible for emptying.  I finally just dragged that trash can, as he or his employees left it, to his department as it would be impossible to empty without creating a bigger mess.  I never heard from him directly, but I heard he was hopping mad at me.",
        "created_utc": 1673132131,
        "upvote_ratio": 1.0
    },
    {
        "title": "No bottle of Beer allowed",
        "author": "Professional-South83",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/105xyjx/no_bottle_of_beer_allowed/",
        "text": "This story takes place in Germany, some years ago.\nAs in the US and probably other countries around the world it is common for seniors at highschools to do a senior prank. In Germany it is called Abistreich. As is tradition, seniors stay overnight at the school to prepare the pranks and games that will take place the next day. Drinking age in Germany is 16 years, so alcohol can and will be consumed during the night, but normally things stay calm and good spirited.\nOur senior prank would be somewhat different. The government had shortened the time of highschool by 1 year and for us it would be 2 years at the same time finishing highschool (those that attended school for 13 years and those that attended for 12). For the last school year our school got a New director. Fresh from the ministry of education this bitch of a lady took the steering wheel of our school and implemented all sorts of bullshit. Not even the teachers were happy about her and called her \"the goddess\" behind her back. For us students many things changed, like sick reporting, use of phones for seniors etc. She was despised by everyone.\nCome around the time for our senior prank. Normally we seniors would get access and keys to the school during the night before the prank.\nDENIED.\nNormally senior could do any well spirited prank  during the day.\nDENIED, we had to send in a timeline and the type of pranks and games.\nBut most important of all a few days before the night we were informed, orally (by a teacher) and in written form that \"the director prohibits any bottle or can of alcohol to be consumed on school ground\".\n\nWe were pissed. All the years prior we saw other senior upholding the tradition of a good senior prank, allowed to be slightly intoxicated and we were not.\n\"What about barrels?\" Someone asked.\n\"What?\"\n\"No bottles or cans of alcohol allowed. What about barrels?\" \nThe teacher (who despised the director) read the document, thought about it, smiled and said \"it says cans and bottles\".\n\nAs the night came and no director or teacher was around several barrels of beer, small and big, made of wood and made of aluminium were rolled onto the school grounds. Some students brought plastic cups, other's 1L glasses, someone even a horn and we went at it.\nSun rises and no bottle or can of alcohol was found at school, instead empty barrels and shitfaced drunk seniors rolling on the floor, vomiting and giggling, shouting and dancing were found. Somehow someone even forgot to close all the windows at school and some drunk idiots broke into school and sprayed with fire extinguishers in the hallways. It was a shitshow.\nAll of this could have been avoided, all of this could have been a civilized senior prank with tipsy, slightly drunk seniors as is tradition if we would have been allowed cans and bottles of alcohol in small amounts and given the keys to prepare the prank.\nInstead we had abnormous amounts of beer in barrels and no real senior prank to speak of.",
        "created_utc": 1673121240,
        "upvote_ratio": 1.0
    },
    {
        "title": "You want a full refund? Sure, let me process that right now for you!",
        "author": "JadieBear2113",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/105w4hp/you_want_a_full_refund_sure_let_me_process_that/",
        "text": "[removed]",
        "created_utc": 1673116642,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can’t leave work for doctors appt? So call out instead.",
        "author": "jlynn123",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/105uqsd/cant_leave_work_for_doctors_appt_so_call_out/",
        "text": "I work in a hospital pharmacy. I rarely call out. At this particular job, I think I called out twice in 6 years. One day I was covering the ICU. I had been sick for about a week. So I called my doctors office and got in that day. Asked my boss if I could leave a couple of hours to go. Offered to stay later to make up for it. Boss tells me to go to urgent care after work instead. \n\nSo I go to urgent care and they tell me not to go to work the next day. So I got to call my boss and tell her I went to urgent care like she said and they told me not to come in the next day. So then she had to find coverage for me the next day.",
        "created_utc": 1673113233,
        "upvote_ratio": 1.0
    },
    {
        "title": "Since you don't need me, I'll just go I guess",
        "author": "Buddy-Lower",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/105qpip/since_you_dont_need_me_ill_just_go_i_guess/",
        "text": "So I worked as a teacher last year at a school. Me and 4 other co-workers also worked during the summer holidays to take care of the kids whose parents were working. Due to Covid there weren't many kids, maybe 20-25. \n\nOur boss didn't like that since according to some contract each teacher had to have 10-12 kids to take care of. So she asked if anyone was willing to work less. I volunteered because I had another job too so that was all cool and done. \n\nAt school however, we had a coordinator, who didn't like me, for god knows what reasons. I told her I'll be working less and that I've already talked about that with my boss. She didn't realize that we were overstaffed and for the first time we didn't have many kids over summer. But she got mad and told me they don't need me. I mean, I know she said all that because she was angry but I really didn't care anymore.\n\nI worked there for a month and it was really easy and chill because there weren't many kids and we could all have our own little group. I really enjoyed it.\n\nThe next month school started again and they had over 80 new students that stayed longer at school. That means the coordinator plus the 3 other co-workers had to take care of them. But hey they don't need me, right? So I left lol. I do feel bad for the students if I'm honest but f that toxic work environment.",
        "created_utc": 1673102870,
        "upvote_ratio": 1.0
    },
    {
        "title": "When “however you like” crosses a smarty pants",
        "author": "NotGoodty1",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/105qpfb/when_however_you_like_crosses_a_smarty_pants/",
        "text": "Short version: my swimming coach said to go the other side of the pool however you like, so I walked.\n\nLong version: I have said this story in other places, and I might as well post it here. It may not be as malicious as other stories, but it does have its share of compliance.\n\nHere is some context;\n1. This story took place back in 2019,  so some information might be off.\n2. I was taking swim lessons at my local outdoor pool. Swimming is one of limited sport options for my area under the umbrella of Special Olympics (SO) [there are more sports out there in my area, but not run and operated by SO].\n\nI show up for the session just like any other day. Change up my clothes, take a shower, and then hop into the pool. It’s just another day at the pool. \nIn total, there are 3 of us that showed up (two athletes, and one coach).\n\nWe do our thing going back and forth in the water (with some technique changes along the way), and then the coach came over. The coach wanted us “to get to the other side of the pool, HOWEVER you like” (have to e one word bolded, as that will be important later).\n\nWith that, the other athlete swam to the other side, while I did my thing. After a few moments, I decided to hop out of the pool.\nAs a note, the pool in my area is 25 meter (75 foot give or take for those in the US of A), so it wasn’t too far.\n\nThe coach noticed that I got out of the pool, and asked if I was ok. I said that I was ok, and that I am going to the other side of the pool, as it fits “however you like.” After I said that, the coach had THAT face of “I know what I did wrong.”\nI did get to the other side, and the other athlete asked why I walked over. I believe I said that I was following instructions.\n\nThat was single handedly the best thing I have ever done, and I have not been close to topping it since. I did try to do this a few times in 2022, but the coach seen right through it (this is a new coach at this point).",
        "created_utc": 1673102862,
        "upvote_ratio": 1.0
    },
    {
        "title": "Piss",
        "author": "Uxiry-I",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/105ozc7/piss/",
        "text": "[removed]",
        "created_utc": 1673097930,
        "upvote_ratio": 1.0
    },
    {
        "title": "not allowed to work on that side of the bench? ok!",
        "author": "urmumisamilfhaha",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/105nt9g/not_allowed_to_work_on_that_side_of_the_bench_ok/",
        "text": "I'm currently working in a factory, and a couple weeks ago we moved into a new building. This new building was originally made specifically for my shift, however the longer shift has claimed it as theirs as they work longer - fair enough. \n\nThe supervisor for the longer shift is a pain in the ass. She takes pictures of how the desks were left and if anything has moved in the slightest she complains. Any mistakes? She complains, even though they make more mistakes! \n\nIn her recent rampage directed at our shifts supervisor, she kicked me from the desk I've been using as I \"make too much mess\" and was told I have to work on the other side of the benches with everyone else. I have never left the desk in a mess, i always swept that entire side of the floor as i'm the only one who worked that side, always filled all the tubs of screws and things up, just always kept it how it was left.\n\nWhen i came in the next week, she had left loads of her stuff on my new desk (paperwork, light fittings, pencils, she'd plugged chargers into the plugs), and it was at this point that I decided that none of their stuff would be allowed on my desk, it had to be left exactly as it was and I've started taking pictures. The other side of the benches remains untouched by our shift and has started to accumulate huge piles of dirt and the bins have become mountains. She asked why that side hasn't been cleaned, so I told her if i'm not allowed to work there, I won't be cleaning it, as it's not my mess. She's not happy but knows there's nothing she can do!",
        "created_utc": 1673094082,
        "upvote_ratio": 1.0
    },
    {
        "title": "Recycling a bottle",
        "author": "Lngdnzi",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/105imbh/recycling_a_bottle/",
        "text": " I was walking home from school one day and had just finished drinking some coke.  I was looking for somewhere to dispose of the bottle and I saw a recycling bin in someone’s front yard. I reached over the fence and lifted the lid of the bin.\n\nLittle did I know the owner of the house was waiting and watching from some unseen location.\n\nThis old man comes outside and starts yelling at me “don’t put anything in my bin you little sh!t! “ etc. etc. he goes on.\n\nI then lower the lid of the bin and he calms down. I take a look at him and another look at the empty plastic bottle in my hand. I throw the bottle onto his grass/lawn and start running.\n\nI hear him yelling and carrying on. But I don’t look back.\n\nWas it wrong?",
        "created_utc": 1673075004,
        "upvote_ratio": 1.0
    },
    {
        "title": "When malicious compliance meets world history",
        "author": "DnD-Nerd-and-Artist",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/1058q6p/when_malicious_compliance_meets_world_history/",
        "text": "So this happened years ago when i was in high school. I remembered it a while ago and figured i could share it because it was one of my proudest moments of sticking up for myself (and the teacher eventually got a kick out of it)\n\nThis starts in my American history class in 7th grade- the teacher was an okay guy, but he was honestly a bit clueless with his students sometimes. He liked to put \"smart\" kids with \"dumb\" kids (i say this with parentheses because honestly the only difference back then was work ethic.) when we had class projects.\n\nOne such project was to get in a group he assigned and make our own \"colony\" and make rules and laws while our 'mainland' was too far away to do anything. I was pretty chill about it because i liked putting effort in, but that's when he gave us our partners. For this story, i'll call them Rex and Riley (not their real names, but they did both start with matching letters to one another).  Rex and Riley were twin brothers and an absolute nightmare- never took class seriously, never tried, always 'joked' around and were absolute jerks. To top it off, they were my *bullies*. When i heard who i was supposed to work with, i dutifully went to the teacher's desk and asked to work alone, because alone was better than with those two.  I was told this was meant to be a group project, and to tough it out.\n\nWell i decided to 1) not take their crap for once and 2) go above for this project because i knew the potential backlash could hurt my grade. The first thing i did was tell Rex and Riley that i was not, in any circumstances, \"working with them\"  because they would just make me do all the work and put their names on it. The second thing i did was the actual project the teacher wanted... then i took it a step further.\n\nWe were meant to make our own \"colonies\" like the revolution, so i drafted a 'declaration of independence' from the per-established group. I listed my grievances and demands (which was literally just to turn the project in on my own), signed it like John Handcock, made my own flag to go with the colony and turned it in to the teacher's desk separately from the assignment itself. I did see him laughing later and looking at me when we were meant to be working on it, and he did end up taking my solo project, but i did get a half-hearted comment about 'teamwork', but i was a pretty quiet kid who didn't make waves often, so he sort of knew he'd messed this up. I never had to work with those two in his class again, but they were still jackasses.",
        "created_utc": 1673046733,
        "upvote_ratio": 1.0
    },
    {
        "title": "The Platinum Blonde &amp; The Green Hairspray",
        "author": "Edymnion",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/1057d00/the_platinum_blonde_the_green_hairspray/",
        "text": "This is a fairly minor one from over 20 years ago, but I was recently reminded of it.  Please remember I am a native English speaker typing at a keyboard, so any spelling/grammar mistakes are my own dumb fault. :)\n\nSo my family owns a costume store, and as a teenager I of course helped run it.  Now, having grown up with this place, I actually knew WAY more about makeup than any heterosexual teenage boy should know.\n\nIts a Friday afternoon in October, people are coming through getting their Halloween costumes and makeup.  I'm answering the phone and running around helping people find things after getting out of school when in walks... well picture a dried up old barfly of a woman with way too much plastic surgery and the most bleached platinum blonde hair you can imagine (down to nearly her butt) carrying an expensive purse.  I'm sure the image you have in your head is kinder than what she actually looked like, but we'll have to work with what we've got.\n\nSo she's picking out her stuff, and asks if we have colored hair spray.  \"Yes ma'am, its right over here, but I wouldn't recommend it for...\"\n\n\"I DON'T NEED SOME BOY TELLING ME HOW TO DO MY MAKEUP!  I KNOW WHAT I'M DOING!  JUST GIVE ME THAT!\" and grabs the can of green hairspray I was holding out of my hand.\n\nOkay, great.  I was about to tell you \"This hairspray will stain\" but you said you know what you're doing.  Yes, have a nice day, ma'am!\n\nFast forwards to the evening of the following Monday, and here comes the Platinum Blonde, only now her hair absolutely freaking MINT GREEN!  She launches into an absolute hissy fit over how she had washed her hair three whole times and it still wasn't coming out.  She points me out saying how I'm responsible for all this.\n\nI mentioned this was a *family* business, right?  The \"manager\" she was screaming to was my mother.  Who also happened to have been up front running the register the previous Friday and had heard the entire exchange.\n\n\"Well ma'am, as my son tried to tell you on Friday, this brand of colored hair spray is known to cause stains if your hair is damaged or over-treated.  You said you were aware of how it worked and to just let you have it, so we did.\"\n\nSee folks, normally hair that is healthy has these little flaps that lay down, its why hair is slick if you run a finger down it one way, but rougher if you run it up the other way.  If you bleach your hair and treat it badly, those little flaps curl up, meaning any kind of dye you put on them ABSOLUTELY sinks in and will NOT come back out.\n\nNormal \"permanent\" hair dye has got NOTHING on what happens when you try to put what is basically colored varnish in messed up hair.  And her hair was bleached WHITE.  Don't know if it ever came out, but to this day it gives me warm fuzzies just thinking about how I hope she tried to \"fix\" it with more bleaching and watched her long hair freaking dissolve. :)\n\n---\n\nTL;DR - Woman who bleached her hair within an inch of it's life insisted she knew how costume makeup worked better than the person selling it.  Ended up with mint green hair that I can only assume either had to be grown out or she bleached the rest of the life out of it trying to fix it.",
        "created_utc": 1673043499,
        "upvote_ratio": 1.0
    }
]