[
    {
        "title": "This is what you asked for right?",
        "author": "Zaige",
        "url": "https://i.redd.it/aj7crat9con11.jpg",
        "text": "",
        "created_utc": 1537571615,
        "upvote_ratio": ""
    },
    {
        "title": "We won't get our earnest back? Fine, we won't be able to satisfy requirements for closing.",
        "author": "vivek1086",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/9huqw1/we_wont_get_our_earnest_back_fine_we_wont_be_able/",
        "text": "\nBeen a big fan of this sub, and can't believe I am finally ready to post here. Now, I would like to say that this situation doesn't apply to everyone, and perhaps may not be morally right too. But it's a question of $10k.   \n\nMy wife and I decided to finally purchase a home in Southern California - A brand new, decked out 4 bedroom home that really felt like something we didn't deserve. We gave in an earnest deposit of $10k towards an escrow account which would then go into the closing costs. The closing period we requested was Mid September. Meanwhile, my wife's employer informed her that her team may go through some corporate restructuring and she may be axed. Nothing big, it happens in her industry at times, with all likelihood that she would simply transfer to another team. However, what makes our situation tricky is that we are on a work visa. Which means finding another job and filing legal paperwork can be very dicey.\n\nWith this development, and our general desire to seek out better opportunities abroad, we were getting nervous about this commitment. We informed the builder and their lender that we are contemplating cancelling the loan because of this situation and we would like our earnest deposit. We never assumed it will be easy, but were hopeful someone would hear us out. We immediately got told by the sales agent that since our deposit has been in escrow for more than 30 days, and since we have a conditional loan approval, we won't get our deposit back. The lender was very understanding but for some reason was anxious to have us cancel the loan and said that he would be happy to work with me on future loans. I was a bit suspect since he was the builder's lender, he would always back the builder. I told him to hold off, since I didn't want to cancel before I fight to get my deposit back.\n\nWe requested the sales agent to reconsider and talk to her superiors, even offering to mediate a call between my wife's manager and them to understand the impact. The seller was under the opinion that unless she gets a pink slip, we don't qualify to get our money back. We started panicking but looked through the purchase agreement where we found a clause that if we failed to get financing, the buyer (us) is eligible for a refund. When a few back and forth emails didn't help, the seller agent simply asked if we would like to sign the cancellation agreement. The date was July 31st. Closing was a bit more than 45 days away. I realized, that while we would fight tooth and nail, our worst case scenario is we lose $10k. Whether it is on July 31st or we lose during Closing, it is the same to us. However, if we keep the agreement ON without cancelling, only for us to fail at closing, the seller can't find another buyer despite knowing that we won't be closing.   \n\nI emailed her saying that we are confident that we won't meet financing which is requirement for maintenance of escrow during closing, but we desire to continue with the closing date of Mid September and not cancel. This means, worst case we lose $10k in September. Worst case for the seller? They can't find another buyer till then. We immediately (within 10 minutes) got told that we are getting our deposit back! We were ecstatic! We felt sorry that we weren't able to close on our home, but we didn't want to be in a bad loan and put everyone else under stress.\n\nTL;DR - We were not eligible to get our earnest back. But at the same time, we knew we won't be able to satisfy the loan conditions to close. Hence, we were putting our seller at risk of not being able to find other buyers in good time. ",
        "created_utc": 1537569385,
        "upvote_ratio": ""
    },
    {
        "title": "High School essay MC",
        "author": "Tryford",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/9hqg1u/high_school_essay_mc/",
        "text": "On mobile, sorry. A MC I saw today reminded me of this. WARNING: might be NSFW\n\nIn my last year of High School, I had an essay to write in French class (this is in Quebec, Canada, so it's our mother tongue). This one was special, because we had to read the first half of a short story and they write the second half ourselves. The hard part is that we had to respect the author's style. This was meant to make us pay attention to the author's style (long sentence, abundant use of metaphors with greek mythology, extensive descriptions of the scenery and feelings of the main character, absence of any dialogue).\n\nSince I didn't like that teacher much, I decided to make my essay as unpleasant to read as possible.\n\nThe story was basically about a guy on a motorcycle getting a high while going superfast. The first part end ambiguously as it's not clear if he got an accident or not, but something happened.\n\nMy essay continued the story where I assumed the guy had the accident and decided he was torn in two. I detailed everything in gorier details, but in a poetic style. I couldn't tell everything I wrote to my best friend because he was disgusted to almost barf when I was only half-way through. I thought it was genius since I actually complied and she had to read this thing and give me a good grade for it (I was a good student, just not a model one).\n\nCue the class where she hands out our graded essay. I've never seen her smile like that. She always looked pissed, but now she was really happy. It was weird. She tells in front of the whole class \"I am glad to announced that for the first time, someone actually got it. Someone almost has guessed perfectly the essence of what the author was going to say!\" Turns out, the author did go into gorier details and there was a drain. That teacher apparently LOVED it. The only difference was that the author changed the point of view (to a newly introduced character), something that was impossible to guess if you didn't read the original story (that was used to root out cheaters I believe).\n\nTL;DR: Teacher ask to complete a story and guess what the author did. Complied by turning it into a horror story with gore to disgust her. That happens to be exactly what the author did.\n\nPS: feel free to tell me if it actually applies for MC, since I think it's technically a failed one.\n\nPPS: I have another story with that teacher where I tried to comply, but was in a panic and ended up doing some sort of unintentional malicious compliance. If anyone knows where such a story should go, let me know. Edit: It's down in the comments now!\n\nEdit: Typos corrected by /u/PocketSizedRat. Thanks!",
        "created_utc": 1537540104,
        "upvote_ratio": ""
    },
    {
        "title": "oof",
        "author": "[deleted]",
        "url": "https://i.redd.it/j95ijn27okn11.jpg",
        "text": "[deleted]",
        "created_utc": 1537527185,
        "upvote_ratio": ""
    },
    {
        "title": "Are you asleep yet?",
        "author": "ancient650",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/9hmin7/are_you_asleep_yet/",
        "text": "[removed]",
        "created_utc": 1537507839,
        "upvote_ratio": ""
    },
    {
        "title": "Want us to correct typos in the knowledge base? Sure thing!",
        "author": "Linkia",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/9hk029/want_us_to_correct_typos_in_the_knowledge_base/",
        "text": "[removed]",
        "created_utc": 1537485218,
        "upvote_ratio": ""
    },
    {
        "title": "Landlord cost $1800 but has a dog.",
        "author": "Herox-",
        "url": "https://i.redd.it/u1qo5ypxlgn11.jpg",
        "text": "",
        "created_utc": 1537478008,
        "upvote_ratio": ""
    },
    {
        "title": "Depression, Law Enforcement, and One Smart Teen",
        "author": "TeacherMcCool",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/9hiez5/depression_law_enforcement_and_one_smart_teen/",
        "text": "I am a high school teacher. \n\nOne of my classes is a course where students primarily learn about possible career options and college prep. Throughout the semester, they research careers based on personal interest while also learning about a college environment. I will also periodically give handouts which highlight specific careers. The handouts offer some reading and questions that need to be answered. \n\nToday, I gave one of those handouts which focused on a career as a police officer. \n\nOne student, a girl, came up and asked me for help. One of the questions prompted students to write a brief story about what it might be like to work as a police officer. The girl told me she honestly knew nothing about law enforcement and didn’t know what to write. \n\nWell, students make excuses every day of my life, so I brushed it off as laziness and told her to read the packet. It would give her all the information she needed to write something. \n\nWell, this part is key. She then asked if she could write about a police officer’s day off. I assumed she was being a smart ass and told her that wasn’t the point of the assignment and that she should pretend the officer doesn’t get any days off. She finally sulks away from my desk. \n\nFast forward to now. I am currently grading those assignments and I just read that girl’s paper. I will quote the relevant portion below. \n\n“I just can’t take it anymore. I always wanted to be a police officer, but I never thought it would be like this. I assumed I would get a day off some days. But no. Captain (my real last name) tells me I can’t ever have a day off. I can feel the depression coming on. I may need to end it all...”\n\nWell... um... I guess I did tell her that the officer didn’t get any days off. ",
        "created_utc": 1537473351,
        "upvote_ratio": ""
    },
    {
        "title": "Take Notes Throughout the Entire Investigation and Send Them in for Review? Okay?",
        "author": "StormDaDrains",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/9hht3j/take_notes_throughout_the_entire_investigation/",
        "text": "Long time lurker, first time poster. tl;dr at the end.\n\nSo a little bit of background for me. I'm a fraud investigator at a company who specializes in small businesses and contracting with larger companies in the Northern South Carolina/Southern North Carolina Area. I'm a trained forensic accountant however mostly I investigate arson and/or property damage. Usually the people we're investigating aren't the type for embezzlement or laundering so my job generally consists of going with another investigator to a burned down house/business and nodding and agreeing with everything they say as I'm not trained for arson. That being said, I spend most of my time doing paperwork in the office as we're in a pretty small area, though with Hurricane Florence finally wrapping up, I'm sure my workload is going to increase tenfold in the days to come.\n\nSo one of our main things to make sure that we don't lie or cheat during investigations is that as soon as we open an investigation we are required to take copious notes and even sometimes record conversations. This is all with a grain of salt as we're not going to record a woman crying incoherently. However, we just got a new investigator who was only brought in because he was a friend of one of the current partners who set up the group. We'll call him Dean. Only problem was, the other partners who headed the group were not completely convinced that he was the investigator the other partner said he was, so he was under a watchful eye. He was a good guy, and a hell of an accountant, so I liked him, but he also looked up to us for help.\n\nHere's where the big bad of the story comes in, we'll call him Mac. Mac had been with the firm for almost 15 years at this point and saw himself as a bit of a badass. He would never follow rules, harass our female coworkers, and often times come into work drunk. Him and I never worked together, but everyone called him \"The Private Eye\" because that's what he saw himself as. At some point in the summer, Dean, Mac, and I were paired up to investigate a report of embezzlement at a rather large chain in the area. Dean and I drove together, and Mac drove alone.\n\nWe get to the chain, and we see Mac has already gotten there, and immediately starts yelling at Dean for not taking notes already, as the investigation has started. Dean shies away and Mac gives me a dirty look but he also knows that I can't be bullied, so he leaves me be. Mac explains to Dean that everything must be recorded, no matter what. Me, feeling bad for Dean, tells him that I'll take all the notes, while Dean can record all the interviews, so on, so forth. \n\nWe get there and talk to the manager who was the one who noticed the problem in the first place, and I ask to take a look at the books to see if I can find any discrepancies, so on, so forth. Dean already has his microphone on, and I'm taking notes, when Mac tells me to \"f\\*ck off c\\*nt, that's my job.\" I know better than to argue, so I just nod. Dean goes with Mac while I interview the manager, and then talk to a couple of the other workers to take up time. \n\nMac and Dean come back from getting the accounting books, and Dean looks like he's about to break down. We wrap up and leave, and Dean and I get back in the car, where he explains he was verbally abused by Mac the entire time. We get back to the partnership, and I ask if Dean had his recorder on the entire time. He said yes. \n\nThis is where the malicious compliance comes in. The next day, I decide to go over the books again with Mac before continuing the investigation. I invite Dean in to see how we do things, so on so forth, and ask if I should keep on taking notes. Mac says, and I quote. \"Yes, everything, so that we can give it all to the partners for review.\"\n\nSo I take notes on everything. EVERYTHING. Every word spoke, every hand movement, every comment Mac made to us or anyone else, every number, every page turn, so on, so forth. When we went back to the business, I did the same. By the end of the week, I had a small novel worth of notes, and Dean had enough recordings of voices that he could voice act 7 seasons of a show. All of this included lewd comments, racial slurs, drinking on the job, bragging about stealing cigarettes when he was thirteen, berating his wife on the phone, telling Dean to \"suck his d\\*ck\", telling me to \"f\\*ck a duck\" and so on so forth, from Mac. \n\nWe pass the case on to our lawyers, and as a result, have to turn in our notes to the partners. Imagine the surprise on their face when I come in with 76 pages, front and back, of notes, and Dean walks in with a USB stick full of 5 days worth of Mac being a dick, and everyone else being generally pleasant. The conversation went pretty much as follows. (P= Partners, M=Me)\n\n&amp;#x200B;\n\nP: I see you've been taking notes.\n\nM: Yes I have, Mac being the senior member of the group told us to take notes on EVERYTHING.\n\nP: Well, yes, that is our policy. I've never seen this type of output though.\n\nM: Well, that USB stick has 5 days worth of conversation, and the papers have the same. \n\nP: Well, could you give us the minimum we need?\n\nM: I think you should go through it all. If not, at least read for the first couple pages and listen to a little bit of it. The most important stuff has stars at the top of the page.\n\nP: Alright, thank you.\n\n&amp;#x200B;\n\nI left the office and took the weekend off. Come Monday morning, I was called into the business office where the partners were. I was sat down and basically told that while they appreciate my commitment to my job and trying to guide Dean in the right direction, the amount of information we had compiled was unnecessary, but \"eye opening\" in how employees were working with one another. They thanked me for the good work, but lightly warned me that another note compilation would have more backlash, only because this one was for a good reason. As I walked out, I saw Mac on his way towards the business office. I excused myself to get some coffee and prepare for the day, and didn't see Mac until an hour later, angrily sitting at his desk. The next day, an email had gone out that \"Employees are to work together in a friendly environment.\" as well as an empty desk, and a \"Senior investigator position opening\". Wherever you are Mac, I hope you found that private eye job you were looking for.\n\n&amp;#x200B;\n\ntl;dr: Training new employee, senior guy decides to be a jerk and wants to bully new employee, followed his instructions to a T, ended up having a small novel of notes on how much of an ass the guy was being, ends up getting fired.",
        "created_utc": 1537469071,
        "upvote_ratio": ""
    },
    {
        "title": "\"This isn't a hotel...\"",
        "author": "thumbsofkolo",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/9hhe2u/this_isnt_a_hotel/",
        "text": "[removed]",
        "created_utc": 1537465992,
        "upvote_ratio": ""
    },
    {
        "title": "This sign always says something funny, but this one takes the cake",
        "author": "mint_o",
        "url": "https://i.redd.it/172du8wyqen11.jpg",
        "text": "",
        "created_utc": 1537455510,
        "upvote_ratio": ""
    },
    {
        "title": "This is for all the crazy drivers.",
        "author": "StupidDebate",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/9he67v/this_is_for_all_the_crazy_drivers/",
        "text": "Everytime I drive my vehicle I see others texting while driving, rolling stops signs, speeding just being generally bad drivers. Well I hate myself and other people. I drive the exact speed limit on single lane roads and in the right most lane of highways. My vehicle is a POS Ford Ranger. I get so much joy whenever someone tailgates me. It gets even better when I can see people in my rearview throwing up their hands and yelling. ",
        "created_utc": 1537439576,
        "upvote_ratio": ""
    },
    {
        "title": "Burger King hit me with a malicious compliance on my order.",
        "author": "Mattson",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/9hckmp/burger_king_hit_me_with_a_malicious_compliance_on/",
        "text": "[removed]",
        "created_utc": 1537420868,
        "upvote_ratio": ""
    },
    {
        "title": "It's nice that you want me to make money, guys!",
        "author": "Brock2845",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/9hboy5/its_nice_that_you_want_me_to_make_money_guys/",
        "text": "A few years ago, I worked in a grocery store as a bagger/delivery guy. I was 16-17 at the time and it was my first job experience.\n\nI was optimistic that if I volunteered for all the crap (sorting the empty bottles, emptying the can machines, cleaning, etc.), the staff would appreciate me and leave me, an awkward/anxious teen alone.\n\nSo, I did all the crap jobs that left me in the backstore and, if need be, they'd call me back when a rush came by. I didn't even care about tips. I enjoyed doing my thing by myself and helping out on rush hour.\n\nWell... it turned out that my coworkers used the time they now had to bitch on my back. I wasn't there for the huge orders, I wasn't there for the beginning of the rush, I wasn't there for other things that related to our job with the clients.\n\nThe staff (chief cashiers) heard their version and called me to their desk. I was told, almost angrily, that I wasn't to go to the backstore anymore, except to bring carts (full of empty bottles) to the back. **nothing. More.** they said it was unfair to the others that I wasn't there for the start of rush hour. \n\n(Who fucking cares about the \"start\" of the rush?! The moment the employee/client ratio counts is at the peak!)\n\nI said they could just call me earlier and I'd be there and it was much more useful if I was in the back, while the others hung out in the front.\n\n**NO** \n\nThey were right, in their minds, so I let them believe it and followed through with their idiotic policy.\n\nIt took two days with that policy, while the other guy who worked similar to me was off, for the backstore to become a cesspool.\n\nThe backstore was filled with empty beer bottles that weren't sorted and smelled like old beer. The can machines were sticky (as if soda had drooled over it) and were full more than in working order.\n\nThe staff didn't realize why it was happening, but they sure saw what was happening. Meanwhile, I was making a buck, hanging around with the cashiers and getting tips. Great for the wallet, bad for the store.\n\nAfter a while, the pressure was too much and they bent. They called all the baggers and told that we had to participate in the backstore's cleaning. \n\nI asked if that included me. She didn't answer, but her non verbal expression was enough for me to understand that I was even more hated.\n\nA few weeks later, the manager's nephew was hired. He was the laziest kid I met there, but it was clear he was to replace me and I'd be fired over some BS excuse. \n\nSo I did my best and showed him all around the place. Sorting the bottles, emptying the machines, cleaning, etc. He \"watched\" me do it and never cared a single second, even using his phone in my face as I spoke to him.\n\nSo I resigned before I finished his training. I wouldn't be blamed for his laziness. \n\nFrom a friend who worked in a different department, the kid lasted because he was part of the manager's family. The backstore became dirty again and the pallets of bottles became a subject where all the baggers argued that \"not me, someone else should do it\".",
        "created_utc": 1537412407,
        "upvote_ratio": ""
    },
    {
        "title": "You don’t want us inspecting trains all day? Ok boss.",
        "author": "xtrahot_buffalo",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/9h8tom/you_dont_want_us_inspecting_trains_all_day_ok_boss/",
        "text": "This was some great malicious compliance by my foreman a couple years back. tl;dr on the bottom. \n\nSo I work for a heavy equipment contractor. We specialize in railway work with very industry specific equipment. On this particular job, we were undercutting tunnels. Basically digging dirty or worn out ballast from underneath and between railroad ties and putting new ballast in. It took a hi rail backhoe for the digging, an excavator on a hytracker cart for removing the reject ballast and bringing in clean ballast, and a tamper for stabilizing the track when we were done. 3 operators, and a railway foreman were required along with the equipment. Cost got pretty high. \n\nNow, on the railway you need track time to complete any work on track. The foreman must get track occupancy permits (TOP’s) from radio traffic control (RTC) to insure our protection from getting blasted by trains. You can only do this BETWEEN trains. They will not stop trains to allow you to work. Trains make way more money than you cost. Especially container trains that have a guaranteed shipping date. Trains also cost a lot of money when they’re stopped, some close to a million an hour. \n\nWe had been getting lots of production through the week. Train traffic was in our favour. Until it wasn’t. It happens. Sometimes you get what we call a “train day”. Just so much traffic that RTC just won’t give you a track permit. We had gotten stranded out on track with no way out other than by rail with 9 trains in the line up before we’d get enough track time to get out of there. There was a lot of overtime billed out that day. \n\nThe supervisor called our foreman wondering why we got nothing done that day and worked so late. The foreman told him why and that it was out of our control. He wasn’t happy and proceeded to yell at him about how he doesn’t want to pay contractors to PK trains all day. (To PK a train means to inspect it as it goes by, incase there’s something wrong with the train. PK stands for pins and knuckles. It’s mandatory that you inspect a passing train and notify the train crew that you’ve done so). \n\nHe tells us the next day what happened and says we’ll be getting lots of work done today. It didn’t click with me until it actually happened. We got a TOP with an hour of track time attached. We knew that we couldn’t get anything done in that time but the foreman assured us it would be fine. We’re contractors, we do as we’re told. We start working. As the end of the hour approaches we’re still digging more ballast out of the track. At the state the track is in it would take at least another hour to make the track passable for trains. We keep digging...a half hour after our clear time was supposed to be. A train is now calling RTC at this time wondering why they’re stopping. And of course, it’s one of those very expensive container trains. \n\nWe are now an hour over our limit and RTC has been trying to get ahold of our foreman over the radio for 30 minutes. That’s when we start putting the new ballast in the track and tamping. We were able to get it back together in an hour and clear the track. Total of 3 hours on track, train stopped for nearly 2. We just cost the railroad almost a couple million dollars for that train being late, and who knows how many trains behind it we slowed down. \n\nNeedless to say the supervisor was furious. He called our foreman right as we got clear wondering why he’s getting called about this huge delay. The foreman simply replied with “you told me not to have contractors PK trains all day”. It was beautiful. \n\ntl;dr: couldn’t work one day because of train traffic. Foreman told by supervisor he doesn’t want us watching trains all day. Next day we held up a very expensive train for two hours to work. When asked why it happened the foreman said “you told me not to contractors pk trains all day”",
        "created_utc": 1537389415,
        "upvote_ratio": ""
    },
    {
        "title": "Yell at me for wanting to fix your PC? Oki Doki then",
        "author": "theowawaydjidbsjux",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/9h8g2b/yell_at_me_for_wanting_to_fix_your_pc_oki_doki/",
        "text": "Edit: tldr at the bottom   \n\nFirst off I'm on mobile so sorry before I start let it be known I am using my phone to type this up. Anyways, I am the head of IT for a large line of dealerships in west TN. These dealerships deal with the government ALOT. Mainly selling cars and stuff to police and emergency services. Because of this our cyber security stuff has to be tight as a barrel and locked down, which I usually do very very well. \n\n  I also have a coworker who we will call C*nty. She is in her early sixties and has smoked most of her life and has a thick trailer park accent. Her skin looks like yellow paper and she drinks nonstop. Her job is to run the cashier desk because her husband is the GM of the main dealership. \n\n  It was last Tuesday when I noticed an error from C*nty's computer. Now, her computer handles ALL of the credit cards and if it gets a virus it gets first priority. So I run a scan on her computer and low and behold she has a virus that's funneling data out like a hole in a bucket. So I go to talk to her and let her know I need to fix her computer.\n\nHere is the convo\n\nC*nty : grumble\n\nMe: hey C*nty , I'm going to need to fix your computer. You have a virus.\n\nC*nty : what?! No! You don't have the authorization to touch my computer!\n\nMe: I'm the head of IT I can do what I need to when needed\"\n\nC*nty : no you fucking can't I'll talk to my husband\n\nAt this point she yelled for a bit about my age (23 years old) and about how millennials lie. Then she gets up to get the GM/Husband. \n\nGM: don't touch her computer, we will have a professional look at it. (Meaning his son, NOT A PROFESSIONAL) \n\nMe: that's a really bad idea, we already have to let people know what's happened cause it's a breach in our security. If we get audited it would be even worse.\n\n(Here's where I got mad)\n\nGM: listen, your a kid and this is the adult world. Just do what I say. \n\nMe: silent rage building *nods*\n\nGM: besides we barely use you and we don't really need an IT department. We have operated for 30 years without one! \n\nMe: can you write down specifically what you want me to do? So that I know exactly what my duties are from now on?\n\nAt this point the GM and C*nty  both did so and signed the lists. \n\nC*nty : I hope you learn something from this!\n\nMe: I sure did!\n\n   After this I went home and decided that maybe we needed an audit. So I called some of the agencies we work with and hinted that they might wanna audit us. \n\n*fun starts here* \n\n   I walk in the next day and find out not 1 , not 2 but 4 of the agencies sent someone to audit our records and systems. WE FAILED SPECTACULARLY!! And the reason was because we had a virus on the main payment computer. I get called into the CEO/Owners office.\n\nOwner: what the hell happened to our system\n\nMe: virus got in it.\n\nOwner: How?\n\nMe: well it's mainly cause C-\n\nC*nty (interrupting): its cause he looks at porn!\n\nMe: nope it's cause C*nty  and GM told me not to fix their computers and changed my duties.\n\nC*nty : Pfft , That's a flat out lie!\n\n*GM got called in at this point and CEO asked him if this is all true* \n\nGM: no it is not we never -\n\n   Me(interrupting): here are the papers they both signed telling me specifically what to do, and here is the ticket for her computer she had me close.\n\n*slide paper across desk to CEO*\n\nCEO: thank you , go on and go do your work and fix the system. The two of you stay behind.\n\n  Later that day I walked by her cubicle and she was packing her stuff into a box. The GM was also packing his stuff and they were both apparently blackballed from working in the areas dealerships. We also lost 2 multimillion dollar contracts. \n\n   Best part was that when I walked out to my car she was sitting on the front step crying and she saw me and said \n\nC*nty : Can you give me a few bucks since you fucked me over\n\n   So I took out a dollar from my wallet and in big bold letters I wrote ,\" I hope you learn something from this\". And then I handed her the dollar and went on my merry way.\n\n\nTl;DR \n\nBosses wife yelled at me and made me not do my job. I got her and my boss fired. Then used her own words against her, cause I'm an ass.",
        "created_utc": 1537386857,
        "upvote_ratio": ""
    },
    {
        "title": "lmao ouch",
        "author": "[deleted]",
        "url": "https://i.redd.it/zz4tv1xim8n11.jpg",
        "text": "[deleted]",
        "created_utc": 1537381340,
        "upvote_ratio": ""
    },
    {
        "title": "DM grants a wish",
        "author": "bug_sports",
        "url": "https://i.redd.it/u0a68oflg0n11.png",
        "text": "",
        "created_utc": 1537377402,
        "upvote_ratio": ""
    },
    {
        "title": "If I can't do my job, you will.",
        "author": "GavinsMugger",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/9h6ypw/if_i_cant_do_my_job_you_will/",
        "text": "In college, I worked at a day camp one summer on campus. I had 4 co-workers, and 3 supervisors (two of whom we worked with regularly). I generally volunteered for the shit jobs to make it easier on my co-workers. So I'd drag a cooler across campus and back to get ice every morning, I'd pair up with the really awful supervisor so the others wouldn't have to, I'd be the first one there for check-in, then stay well after everyone left to clean the rooms and replace the plastic covers on the tables, and more. But most importantly, I was the disciplinarian. Anytime a kid needed a stern talking to, or punishment (the worst punishment we ever gave was to take away 5 minutes of their 1 hour swim time), I was the one to do it. Three of the other counselors told me how much they appreciated it, cause they hated doing it and it interrupted their positive relationships with the kids. The fourth counselor, Claire, would even some times use my name to get kids in line. I'd be working in the rooms when they came back from an activity, screaming and hollering, then I'd hear her say, \"I see Mr GavinsMugger in there, and I know he doesn't want to hear your outside voices in the hall.\" That would usually make them calm down. \n\nOne day, I took away 5 minutes of a girls swim time. If I'd known how it would affect her, I never would have done it. At pick up that day, her mother came up and asked why her daughter was crying. Claire just took her to the side, and I didn't think any more of it. About an hour later, I'm in the building alone, cleaning, and replacing the damaged table covers. Claire comes in with her dinner, making such a big mess that I ended up having to replace that cover as well. She informs me of what happened. The girl was distraught over losing that pool time because she thought she was going to get in a lot of trouble at home for it. If I had known this was the situation, I would have apologized in person, and given the mother my supervisor's contact info if she still wanted to complain. Instead, Claire told the mother what a shitty counselor I was, that I existed basically only to punish the kids, and that she needed to contact my supervisor to file a formal complaint. Claire continued telling me repeatedly for about 40 minutes how I was so awful. \n\nLuckily, the mother called my good supervisor, Jessica. So Jessica told me what had happened, and explained that she had calmed the mother down over what was honestly a minor incident. But she was still forced to give me a verbal reprimand. And it was the greatest (though possibly only, I'm not sure) reprimand I've ever gotten. She basically just told me to stop disciplining the kids. \n\nSo from that day on through the end of summer, I paired up with Claire at every opportunity. I'd spend my days hot gluing stuff and helping the kids assemble crafts. I'd pitch in with design ideas if a kid was having trouble, and escort them to the bathroom. I did everything except discipline them, no matter how out of hand they got. And when she'd give me the look of \"help me out, here\" as she tried to yell over top of 20+ screaming children, I'd just give her a sly smile and turn my attention back to the glue gun. By the end of camp, she looked like she was just short of a breakdown every day. She didn't come when we all went out for a beer on the last day. I think she even left school, maybe realizing that she wasn't cut out to be a teacher. Not 100% sure about that last part though.\n\n\n\nEdit: I get that I sound like I'm just glorifying myself. I'm not. I have to leave out some details to make it a little less easy to identify myself, my co-workers, the school, the camp, etc. Suffice it to say that my specialty in this camp was not best suited for the classrooms. So when the kids were in the class, I left the specialized work to the better specialized counselors. Hence taking on the shit jobs to make the others' jobs easier. \n\n\nEdits 2,3, &amp; 4: Yes, my user name comes from AH.\n\nAs to why the parent and child both got so upset, I can only speculate. But the current theory is that the mother expected nothing short of perfection. The daughter was obsessed with doing everything exactly right. And to the extent that attitude was, I feel like it didn't come naturally. Especially not for a seven-year-old. Meanwhile, the mother can't accept that the child did something wrong, so it must be some one else's fault.\n\nI should have said, \"while I was present, I was the disciplinarian.\" If I was not in the room, or even in the room but busy with something else, Jessica and the three other counselors handled any situations with no problem. Claire, and my bad supervisor (we'll call her Frumpus), couldn't keep the kids in line though. The only thing they always left me to do was yell over the kids if they were way too out of hand and things like turning the lights on and off had no effect. I had a booming voice when I wanted, so yelling \"Quiet!\" silenced them immediately. ",
        "created_utc": 1537376634,
        "upvote_ratio": ""
    },
    {
        "title": "Mulch that tree. Ok.",
        "author": "downcastbass",
        "url": "https://i.imgur.com/KnA8x7B.jpg",
        "text": "",
        "created_utc": 1537363985,
        "upvote_ratio": ""
    },
    {
        "title": "You want me to relocate my employee? Alright!",
        "author": "dexter3player",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/9h3u0e/you_want_me_to_relocate_my_employee_alright/",
        "text": "[removed]",
        "created_utc": 1537351359,
        "upvote_ratio": ""
    },
    {
        "title": "City made us get rid of the water reservoir because the neighbour complained. BUT it can be loaded in a truck so long as it leaves once a day... to be parked on the street...",
        "author": "[deleted]",
        "url": "https://i.redd.it/bd8j229hs4n11.jpg",
        "text": "[deleted]",
        "created_utc": 1537334930,
        "upvote_ratio": ""
    },
    {
        "title": "I'm the best girlfriend",
        "author": "Miradai",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/9h0fti/im_the_best_girlfriend/",
        "text": "I was laying diagonally across mine and my boyfriends bed because I have no concept of sharing and he asked me to straighten out so he could lay down because his back hurt from sitting too long.\n\nNow obviously he meant for me to just straighten out my legs or rotate a bit. But that's no fun and i am relatively flexible.\n\nSo i did what anyone would do and kicked myself up and across so i was lying across both pillows in one swift and graceful movement; very pleased with my work. \n\nNow another thing of note is that this bed is kind of small (for him anyway) so his legs barely fit if his head is against the headboard. Meanwhile i just about fit laying across it width ways if my legs are bent. \n\nHe points out that isn't straight so i shuffle my legs a bit until I'm in a perfectly straight position. \n\nHe just looks at me for a second and ultimately concludes i did exactly what he asked and lays down with most of his legs hanging off the bed.",
        "created_utc": 1537317248,
        "upvote_ratio": ""
    },
    {
        "title": "Embarrass my department in front of the whole company? Ahh, I do like to hold a grudge.",
        "author": "TheMightyGalah",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/9gzuy7/embarrass_my_department_in_front_of_the_whole/",
        "text": "Let me set the scene: \n\nIt’s April 2016. The company has received their customer service scores for the last 12 months and its mostly good, bar one department which is *just* below the expected level set by the company. Unfortunately, I work in that department. Now this was anticipated by just about everyone in our department because the overwhelming majority of our queries and complaints pertains to the cost of the work we do - a cost decided by the finance department who are completely separate to us and aren’t customer facing so don’t have to deal with the issues caused by these costs. \n\nThe results are announced on our internal website with a small note from the head of customer service. Reading the message, it’s clear she is very happy with the results until she reaches ours. Now I’m not going to post what she said as it would be very clear who I am if someone from work was to read this - in fact they will probably be able to tell anyway, but let’s just say it was incredibly unprofessional and threw us completely under the bus in front of the entire company.\n\nOur manager invites her to come and spend a day with us to see what we are up against but she declines. This pisses me off, because I see how hard our guys work every single day and she’s going to treat them like that?\n\nI’m a sucker for holding a grudge.\n\nNow it’s 2018, she’s blown over 100k trying to increase our satisfaction scores by investing it in the wrong areas, ignoring the real problem which remains the price (in fact, they increased them earlier in the year). Rather than take the blame herself, she puts it on her team and somehow gets away with it.\n\nIt gets to the point where she needs some results and has an idea, but it involves giving us more work on top of our already ridiculous workloads. In fact by doing what she wanted, we’d be slower at completing the rest of our work which would only have a negative impact on our scores but she doesn’t seem to get this. Needless to say, it fails. Who gets the blame? Not her.\n\nAt this point, she has no idea I read that note two years ago and certainly wouldn’t expect me to have remembered it for this long. Like I say, I’m a sucker for holding a grudge.\n\nShe calls to speak to my manager, but I’m covering. She needs us to come up with an idea that she can put to the board of directors 2 weeks after the call, but she’s going on holiday for 10 days and won’t be able to look into an idea herself. I see what is happening - I come up with an idea and if successful, she takes the credit. If it fails, I take the blame.\n\nI told her that it isn’t my responsibility but she insists. If my manager isn’t about, I’m going to need to take this on apparently.\n\n‘I’ll leave this in your hands. You email me but only when you’ve come up with something you think will work and we’ll go over it’. No deadline, even though I know there is one. But she just said when I come up with something I think will work. I can do that.\n\nShe comes back from holiday, I’ve taken a fortnight off. I’ve only been off for 2 days and won’t be back for another 12. I come back to work to find out she shit the bed in her meeting with the board because she didn’t even have half an idea, let alone one that would work. She makes contact with me, asks me what I am playing at and why I didn’t do as she asked. I said I hadn’t come up with an idea I thought would work yet. She tells me that she there was a deadline but I let her know that she hadn’t told me that - just to offer my idea when I thought I’d found one that would work which I still hadn’t. I was doing exactly what she asked.\n\nThe board were obviously pissed, revisited the situation with the 100k where her team practically threw her under the bus like she had with my department and then them when the 100k investment went wrong.\n\nShe’s got a review with the board this week and I’ve heard through the grapevine that she is shitting herself about being removed from her job role. Thankfully, not being sacked but no longer being in a position where she can fuck people over when she doesn’t perform.\n\nBeautiful.",
        "created_utc": 1537312610,
        "upvote_ratio": ""
    },
    {
        "title": "Work smarter not harder",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/9gxwp6/work_smarter_not_harder/",
        "text": "[removed]",
        "created_utc": 1537298744,
        "upvote_ratio": ""
    },
    {
        "title": "Trespasser Demands Police",
        "author": "DesiArcy",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/9gvrjh/trespasser_demands_police/",
        "text": "I'm a college kid who works work part time as a private security officer on the graveyard shift. I mostly do bicycle patrol, which means I'm riding from client property to client property doing nightly checks, as opposed to sitting a desk.\n\nOne night, I ride up to one of \"my\" properties and see that there's a trespasser in the back corner of the parking lot. As I get closer, I can see that it's an elderly guy with a walker \\*and he has his pants down.\\* I politely inform him that he's trespassing on private property and needs to move. He replies that \\*he's stuck\\* and demands that I help him get his pants back on. His expression and tone make it \\*pretty damn blatant\\* that he's saying this because I'm a female officer, and corporate says we aren't allowed to provide medical assistance under any circumstances anyway. So I tell him no, I'm not allowed to do that.\n\nHe completely loses his shit at being told no, and starts screaming that I'd \\*better\\* either help him up or he's going to call the police on me. I tell him that I'll be happy to involve the police, and proceed to inform him that he is now officially excluded from the property. We're supposed to tell \\*every\\* trespasser that because it is a legally binding notice of trespass, but we usually don't because going off on a multi-paragraph legal spiel is really annoying and tends to escalate situations. But he said he wanted police, and that means I'm going to do everything by the book and write a full report.\n\nNeedless to say, he gets madder and madder as I go through all the legally required points for exclusion and then call the police, and pretty much goes off on a litany of completely uncreative insults that every security officer has heard a thousand times already. I politely remind him that police are on the way and that he will likely be arrested for criminal trespass if he is still here when they arrive. Redoubled litany of insults, still no new ones. Sigh. Whatever, have it your way.\n\nA police officer arrives, faster response than usual for a non-emergency call. It's an officer I've met before, because *this* parking lot is one of her favorite spots to park her cruiser and do paperwork while patrolling this side of town. I point out the trespasser and state for the record that he has been formally excluded. He unironically demands that she arrest *me* for \"harassing him\", and goes off on her when she points out that *I'm* doing my job and *he's* trespassing.\n\nNote that the local police are generally *very* reluctant to actually arrest anyone just for trespassing; it's a lot of paperwork for what is ultimately a trivial misdemeanor offense. Legally speaking, if security has already issued an exclusion the police can make an *immediate* arrest for criminal trespass *without* giving the person any further chance to leave, but they pretty much *never* do this. They will give trespassers *every* opportunity to just pack up and leave quietly, which is fine with us because *we* don't want to do more paperwork either, but annoys our corporate masters who would like to impress our clients by generating arrests for every single trespasser we catch.\n\nBut this guy is stubborn enough to *actually get arrested*.\n\n&amp;#x200B;\n\nTL;DR: Trespasser threatens to call the police *on a security guard* for telling him to stop trespassing but refusing to help him put on his pants. Security guard calls police.",
        "created_utc": 1537284111,
        "upvote_ratio": ""
    },
    {
        "title": "SIR THAT IS NOT ALCOHOL",
        "author": "xxmomochanxx",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/9gtz7k/sir_that_is_not_alcohol/",
        "text": "xpost from r/TalesFromYourServer \n\n&amp;#x200B;\n\nOn mobile etc etc you know the drill. TLDR at the end\n\nI work at a small Chinese restaurant that generally only has locals and regulars with the odd visit from out of the area. Because its so small on a normal day or night we will only have 1 waitress on a shift.\n\n&amp;#x200B;\n\nWe were having a relatively quiet night so I was sitting around pouring soy sauce into bottles and cleaning chili jars. This table of 4 people walk in and they're all relatively nice and I give em the good old casual greeting and seat them down. They do their stuff and order their meal and for drinks they only get table water which is normal. When I bring out their food the old man (hence forth OM) asked for a bottle of the red wine. Now we don't serve alcohol nor do we even have a byo. I'm not yet 18 so I can't even handle alcohol if we did. I told him we don't have any alcohol, and he goes on this rage pointing out a bottle that was on our shelf. \n\n&amp;#x200B;\n\nI knew what he was pointing to. It was our Chinese vinegar. Now these bottles look remarkably like Asian alcohol. They're green with red on it and all the writing is in Chinese. And I told him that, \"sir that's vinegar not wine\" He went on an alcoholic rage yelling about how I couldn't know what alcohol was cause I was underage and how I was hiding alcohol from him and he would make a complaint on our Facebook page. His children and wife look embarrassed and are trying to hide themselves, and his wife gives me a look that just says \"do it and he'll regret it\" \n\n&amp;#x200B;\n\nSo I went and got a bottle of the vinegar and put it on the table. OM makes a really big deal out of it saying shit like \"AH wasn't that EASY\" \"waitresses in MY DAY would have done it in 2 seconds\" I walk away and when I turn around to check, he'd spat a mouthful of vinegar out and onto the plate and was trying to wash out the taste of CHINESE VINEGAR with water\n\nTo be fair the wife did come up to me later and apologise for his idiocy. They never made that Facebook post, and paid $20 for the bottle since we couldn't use it again. \n\n&amp;#x200B;\n\nTLDR; Most likely alcoholic old man demands a bottle of Chinese Vinegar thinking it's red wine. Instantly regrets decision upon trying to chug vinegar. Shoutout to best wife for co-conspiracy. ",
        "created_utc": 1537270112,
        "upvote_ratio": ""
    },
    {
        "title": "Nice birthday cake",
        "author": "SigShooter78",
        "url": "https://i.redd.it/z6cy2gja5zm11.jpg",
        "text": "",
        "created_utc": 1537268111,
        "upvote_ratio": ""
    },
    {
        "title": "So you don't want cookies",
        "author": "[deleted]",
        "url": "https://imgur.com/3Migvs4",
        "text": "[deleted]",
        "created_utc": 1537267541,
        "upvote_ratio": ""
    },
    {
        "title": "I need to get rid of my overtime hours?",
        "author": "creckers",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/9gsgiv/i_need_to_get_rid_of_my_overtime_hours/",
        "text": "So this happened to a buddy of mine. It won't be that long of a story.\nHe is a mechanic and works a lot. Does not really care for holidays, so he ended up having about 350 hours of overtime built up.\nOne day his boss comes up to him and says, \n\nBoss: buddy we need to make some sort of arrangement for your overtime hours this year.\nBuddy: i don't really need or want the vacantion so can't you just pay me the hours?\nBoss: no we do not want to do that. Just take some days off\n\nIt was the beginning of november at this point.\n\nBuddy: you got it boss. He cleaned up his toolcase, said see you next year boss, and went home.\nHe took a 2 month holiday and worked on his project cars.\nAppearantly the boss called a couple of times asking to come back, which he obviously declined.",
        "created_utc": 1537252958,
        "upvote_ratio": ""
    },
    {
        "title": "😘 😾😘 .sexy girls Invite you to FUCK them ...😘 😾😘 of six more coming.’",
        "author": "kamruzzaman5ndc",
        "url": "http://ky87QY4JYIII.redad.com.cn/?x3h4dO2MuHyynfEAZx8YQcyMS0N7UczjGgwyLWj1AIUmeIapATglB3=G43eE1dK9J1fcGa4j7Ppyh4fU23vC9KNVkQURMSwulmTMyj2EYHBJOkwrJM2LJJFLMwdkSpqOkp88B5hqV1dW.jpg",
        "text": "",
        "created_utc": 1537245496,
        "upvote_ratio": ""
    },
    {
        "title": "Can't you do any better?",
        "author": "PM_ME_UR_GOODIEZ",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/9gretl/cant_you_do_any_better/",
        "text": "[removed]",
        "created_utc": 1537242653,
        "upvote_ratio": ""
    },
    {
        "title": "This belongs here.",
        "author": "sneakyjoo",
        "url": "https://i.redd.it/bvfrr52daem11.jpg",
        "text": "",
        "created_utc": 1537235698,
        "upvote_ratio": ""
    },
    {
        "title": "Give me as much Diablo sauce as you can without getting fired.",
        "author": "ThisUserNameIsLawng",
        "url": "https://imgur.com/P4HEZLq",
        "text": "",
        "created_utc": 1537231058,
        "upvote_ratio": ""
    },
    {
        "title": "Well if you're sure....",
        "author": "BluebirdBunface",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/9gogdj/well_if_youre_sure/",
        "text": "Background: I work in a local chain of shops that uses the typical code system, where you type a number in to ring up the item, sometimes the codes are changed/updated but old ones often stay on the system in one way or another which results in mispricings, wrong items and odd sales data.   The assistant manager doesn't get on with most of the employees, does little work, is unfamiliar with the tills and likes to micromanage.  We have some of the lowest pay rates in the area for retail so we also get a collection of employees that are hard to fire as no one really wants to work here, which is compounded by the largely shitty employees.\n\nRecently the codes have changed and the red peppers which were previously priced by weight are now priced per pepper.  I was working on checkout when the assistant manager started hovering behind me, there was a bit of a queue but there was no one else available and he had no interest in actually doing any work so I sped up the transactions a little.  Of course he called me on it and asked me if I was going to offer the customer with an open backpack ready to be filled and two items a carrier bag, stupid policy, but still policy so I sweetly asked the customer, who by this time had already put the items away, if he wanted a bag.  The customer declined politely with a smile but left rather quickly in an obvious attempt to either avoid our insanity or not miss the bus.\n\nA few customers later a regular comes up with a few items including 2 red peppers and I tell her that the peppers aren't sold by weight anymore.  The assistant manager jumped in to 'correct' me and told me that I need to weigh the peppers and even so super-helpfully told me the old code, so I said 'okay.'.   I put them in a veg bag (sorry environment) then scanned everything else through, put them on the scale hit the old code in (same unit price as new code, but the unit is kg so around the weight of 6 red peppers) and immediately totalled the transaction, customer tapped her card and left.  The assistant manager told me the super-important ~~excuse~~ news that made him need to watch everything I did for 3 seconds (next week's rota is finally up in the break room.....which I can't see until my break and would have looked for during my break anyway) and left for the office where I assume he went back to browsing Facebook or whatever it is that he does in there while he's not working.  I then spent the day using the old code for 90% of customers and the new code for the 10% that I either routinely hate or happened to annoy me at the time.  I had vague hopes the manager would notice and I could dump him in shit, but oh well.\n\nSome things he does that annoy me: schedule me for the wrong number of hours 3 weeks in a row after being reminded each time of the number of hours I work (which is constant), accuse me of taking too long on my break (I had it cut short the previous day and was told to take extra by the manager), accused me of leaving a half-full mug of tea in the sink when I don't drink tea, which to be fair given that he spends 80% of his day holed up in the office doing nothing, another 5% sucking up to the manager and the final 15% of his time condescending, he had no reasonable way of knowing.",
        "created_utc": 1537219362,
        "upvote_ratio": ""
    },
    {
        "title": "Let Me Know What I Owe You? I definitely will.",
        "author": "johnn11238",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/9go74t/let_me_know_what_i_owe_you_i_definitely_will/",
        "text": "So this happened a while ago, back in college. I was working at a gas station for cash-under-the-table, as well as doing some side gigs, paying my own way through school. I worked with a ~~dipshit~~  irresponsible fellow we'll call Dave. Dave was also going to school, but on his parents' dime, so wasn't a busy, harried, or desperate as yours truly, just working for rent and beer money.\n\nDave worked the graveyard shift, 12am-8am, I worked the shift before, 4pm-12am. We didn't have a timeclock or anything, and we just got paid for the shifts we were scheduled for. Well....Dave started coming in late. Just 5 or 10 minutes most nights, but it really annoyed me, because I WASN\"T GETTING PAID for that time. He was. Finally, one night when I called his house at 12:10 and his roommate said he was STILL playing video games (he lived about 15 minutes away) I had it. I laid into him when he finally walked in the door - a full half-hour into his shift. He put on the whole \"reasonable guy being confronted by frothy-mouthed unhinged co-worker\" routine, eyes wide hands up, etc, and told me to let him know on payday \"what he owed\" me. I had considered going to the owner of the gas station, but then I had a better idea.\n\nI started keeping track of every minute he was late. Five minutes here, ten minutes there, sometimes 15 or 20. Weeks went by, and I'm sure he thought he was off the hook. I was being really nice, telling him to take his time getting in. No rush. Then, the week before finals, I walked into the store when he was covering a day shift for someone, pulled the schedule off the wall and handed it to him. \"Which two shifts do you want to take?\" I asked. He looked at me funny, and then realized what I was saying, rolled his eyes and reached for his wallet.\n\n“No, no, no. Leave your wallet where it is. I don't want your money. I want your TIME.\" I handed him the graph where I had meticulously recorded every minute he had been late. \"You owe me 16 hours. Two shifts. Pick them.\" \"DUDE, it's the week before FINALS!\", he whined. I told him I didn't get to pick which nights he came in late, so he didn't get to pick the week he paid me back. Unless he wanted me to hand the graph to our boss? He didn't. I had plenty of time to study that week.\n\nAced the finals.\n\nEdit: sorry for the formatting! Hope the fixes help Thanks for the props! I love this sub, and I’ve been telling friends this story for years, so I was excited to share it. And for those of you saying “no way this happened” or “Why didn’t he just say no”, I think it was mostly because he was a decent dude at heart, just lazy and irresponsible and realized he was being a dick.  I sort of expected him to fight me harder than he did about it.  And he was on time after that.\n\nEdit 2: For all of you sharpening pitchforks, I can only say that I'm sort of nonplussed that so many people think I was being unreasonably cruel to poor Dave. For the record, we went on to hang out a few times, get stoned and play games, etc. He was more \"yeah, you got me\" than \"you cruel bastard\" about it.",
        "created_utc": 1537217565,
        "upvote_ratio": ""
    },
    {
        "title": "This Rule Was Never Meant to Bean",
        "author": "LegionGaming2k",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/9gng92/this_rule_was_never_meant_to_bean/",
        "text": "Hey all! Long time lurker, finally making a post.\n\nThis one comes from a while back. I work at a grocery store in the produce department. Now this store chain likes to move managers/assistant managers around a fair bit, so the person who is managing your department might not be there next year.\n\nAnyways, when this story takes place, I had a manager who was quite the stickler for rules, and even making up a few bogus ones for the department itself. One rule that was implemented was that everything we took out of the boxes to put on display had to removed by hand, no dumping. Now in some cases, such as apples, citrus or tomatoes, this made sense. You could have a moldy piece of produce and not realize because you dumped all the produce onto the display and that moldy piece was smack-dab in the middle.\n\nBut for other items, this rule was absolutely idiotic. One such item, and focus of today's story, was green beans. We get our green beans in these sturdy wooden boxes, with a lid that can be lifted up to *dump* the beans out. It was a quick, simple way of refilling the green beans case, something that took all of about 10 seconds to do.\n\nSo Dumbass Assistant, who we'll call DA, would get on me constantly for dumping the beans out. Now yes, I was \"breaking a rule\" but it took more time than it was worth to take a handful of green beans and drop them into the case. I even had a couple of customers ask why I was placing the beans down instead of dumping it. I told them the rule, which they said was a dumb rule. \n\nSo after a few weeks of constant reminders of this rule and how I should be putting the beans down, I decided I had enough. I started to put the beans out by hand as per the rule, but I would do it one bean at a time, making extra super care in making sure each and every bean made it to the case safely. I didn't care if DA could see me or not, I did it regardless. \n\nNow here's the thing. The way of doing a handful at a time took maybe 5 or so minutes if I wasn't distracted by customers. This new method however, could easily take me half an hour if I was feeling extra petty. I remember I had a customer come up and ask,\n\n\n\n&gt; \"Why are you putting the green beans out one-by-one?\"\n\n\n\n&gt;Me, sarcastically, \"Well my assistant manager says that these little green beans need to be placed by hand, and that's what I'm doing.\"\n\nEventually, DA figures out it's taking me longer than usual to do the green beans. He came out of the backroom one day to find me doing this new method, which he did not like.\n\n&gt; DA: \"What the hell are you doing?\"\n\n&gt; Me: \"Putting the beans out by hand like you said.\"\n\n&gt; DA: \"That's not what I meant.\"\n\n&gt; Me: \"What did you mean? You said we couldn't dump the products out. You said we had to do it by hand, and I'm putting the beans out by hand. Never said how many pieces of products we had to include in one hand.\"\n\n&gt; DA: *glaring at me* \"Just dump the beans smartass.\"\n\nDA walked away a bit pissed off, and I happily dumped the beans. Continued to dump beans until he got transferred to another store some time later, and I still dump the beans to this day.\n\nTL;DR : Assistant Manager tells us to put products out by hand, not dumping it. I put out green beans one at a time by hand. Assistant Manager essentially creates an exception for the green beans.\n\nEdit: Someone had said I was more of a dick than malicious, because I was still having to inspect for mold. Green beans don't mold as quickly/as noticeably as something like a tomato or an apple. But the rule was to put all produce out by hand, which made some tasks take a lot longer than normal",
        "created_utc": 1537212465,
        "upvote_ratio": ""
    },
    {
        "title": "Try to charge me extra for parking...",
        "author": "mcpux",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/9gmmln/try_to_charge_me_extra_for_parking/",
        "text": "My wife and I went to go see a band that I really like last week. Since they don't tour often, I was willing to cough up the $200+ to go see them live. I was stoked. When we got to the venue, however, I was surprised to see people standing outside of the parking lot next to a \"Event Parking $10\" sign.\n\nI was obviously pretty upset. I mean, $10 on top of what I already paid isn't much, but it's the principle that they're trying to squeeze more money out of me, which I didn't like.\n\nAnyway, I pulled up and they asked for $10 cash. I didn't have cash, but asked if I could pay with a credit card because I'm an adult and it's 2018. They pointed me to another person further down the line with a credit card terminal. I pulled up and begrudgingly handed him my card when he asked for it. He charged it and handed me a receipt and asked me to sign.\n\nHowever, when I got the receipt, where I was supposed to sign it had the word \"DEMO\" printed across the signature line. I assumed this meant that they accidentally had their card reader in a testing mode and that any card they ran in that mode wouldn't actually get charged. I briefly thought about telling them about their mistake, but I was already miffed about being charged to park. So I happily signed the demo receipt. Then, we went and enjoyed the show. It was fantastic.\n\nThat night after I got home, I checked my credit card app. Sure enough, there was no $10 charge for parking. So I, and everyone else who paid with a credit card for parking that night, got to park for free.",
        "created_utc": 1537207147,
        "upvote_ratio": ""
    },
    {
        "title": "👉🏻👉🏻 👉🏻 FUCK pretty Girls NearToYou👈🏻👈🏻👈🏻 imagine the unarmed mariner to feel when he is rescued",
        "author": "handadesilva",
        "url": "http://4HC85r3ff.rtsw.win?qVHyGFaBHVOYX6hiFDb1OymrKt1AfR8qLFYirPqKpFoinS5wThuR0y=ArJj8MLEWjAMirpHtKl5xsEKw0gCJDsTUBZ186rPceiPmWOEzazYBRkGH6L7v6J02FOZ010QMHySAXKCAujTS.png",
        "text": "",
        "created_utc": 1537202023,
        "upvote_ratio": ""
    },
    {
        "title": "General manager: prove this is a problem!",
        "author": "chezzietaylor",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/9gjdvl/general_manager_prove_this_is_a_problem/",
        "text": "I work for a large home improvement store, stocking shelves at night. There are only seven people on my shift stocking the whole store, but we work extremely hard and go above and beyond. But, as night shift life normally goes, anything that can be blamed on us will be blamed on us. \nWe had our biannual meeting last night with the general manager, area managers and associates. My shift came in early to join the fun.\nAfter the meeting, my shift was asked to stay, as we’d brought up a few points the general manager wanted clarity on. Basically, the day shift at my store has stocking issues: they’re understaffed, so instead of taking the time to stock the correct item in the correct location, they’ll remove the label or put another item in the wrong spot. This creates all kinds of problems: my shift can’t find the location, the correct item never gets stocked which messes up ordering and inventory, or the customer tries to buy the wrong product, sometimes thinking it costs less than it actually does. \nBut my general manager basically told us we’re wrong. This isn’t a problem, we’re overreacting, and if we honestly believe this is a problem, we should send her a picture with every example we find, along with evidence of every other problem “we’re blaming on day-shift.”\nOkie dokie. \nWhen I left this morning, our night shift manager was gleefully composing an email with at least 10 pictures from each of the seven of us attached.\nGame on. \n\nEDIT: Thank you for all of the vicious ideas! An individual email for every problem would be so fun. I’ll be updating as soon as I learn what my general manager’s response was and if any action will be taken! \n\nUPDATE: so I did an update post that got removed, but I’m not sure why. Probably because it’s not compliancy enough. Anyways, I figured I’d just add it here! \n\nAfter the first night, when our general manager received 70+ pictures of an issue she didn’t believe was an issue, things actually went well! She thanked my manager and forwarded it to the area managers. She asked us to continue sending in pictures, which we did (in 7 emails a night, from each of us, because she couldn’t be totally off the hook). She didn’t love that, based on the clipped replies, but she didn’t complain. The problem seemed to slow down with fewer pictures every night. \n\nDespite her thanks, my gm still wanted revenge. After an extended manager meeting, she’d developed a strategy to blame a whole lot of things on night shift. \n\nWe have a very strict standard for topstock safety. Topstock is for any item that doesn’t fit on the shelf, and the rules are there to make sure it’s safely stacked, neatly arranged, and that no dangerous items, like corrosives or saw blades, are placed too high. Here lately, our topstock has been filling up with Christmas products (welcome to American retail!) and it’s gotten a little messy. It’s safe, but it’s not clean. This isn’t all our responsibility, as dayshift puts things in and takes things out of topstock, but guess what shift took all the blame for the mess? \n\nYou guessed it. \n\nBut! I’ve learned from this subreddit, and every bit of our work in topstock has been documented in before and after pictures emailed to the general manager and the respective department manager. So any further issues can be addressed to the proper department manager instead. \n\nThanks for all the ideas, y’all. Keep being malicious ✊🏼",
        "created_utc": 1537182635,
        "upvote_ratio": ""
    },
    {
        "title": "A difference in perception makes colouring in a little different",
        "author": "deadlydangers1",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/9gi7a9/a_difference_in_perception_makes_colouring_in_a/",
        "text": "My first year at my old school, we coloured in a lot. Often, people would ask me for crayons, and one day someone asked me for the “skin coloured” crayon. Now, I’m black in a majority white school, so whenever someone asks me for a skin colour anything, (crayon, pencil, paint) I’ll just give them their skin colour. However, that day we were starting a program where we were supposed to stop putting up with people’s shi*, and  I was told to get in touch with my identity. So after that, when someone asked for the “skin colour” crayon, I’d give them the black crayon. I’d get many complaints, and get called stupid, but later on we learnt about racism and everyone looked absolutely horrified as things they had done were described, treating people differently based on skin colour, and the day after I got a lot of gift baskets saying sorry. I didn’t mind that much, I just had to learn tolerance before my classmates.\n\nTL;DR: people called me stupid for giving them a black crayon when they asked for skin colour, have to give me a gift basket per time",
        "created_utc": 1537168728,
        "upvote_ratio": ""
    },
    {
        "title": "Only do my list of things? Yes, sir!",
        "author": "Cutecat42",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/9ggu9m/only_do_my_list_of_things_yes_sir/",
        "text": "(I just want to say that there is a long back story, but I believe that the malicious compliance at the end is worth it. There's also a TL;DR. )\n\nSo a few years ago, I was working in a National Forest (2-3 hours away from the nearest town depending on the town). The best part of the job was that I practically lived in the forest for a few months. It was beautiful! \n\nThe worst part about the job was the people I had to work with. I won't go into detail about everything, but I wouldn't recommend working there. This is only one of many stories from this job. The worst part was I got a write-up for not doing my job...on a day I was actually off. \n\nOf course they didn't care when I pointed it out to them, and from then on we had a list of things we needed to complete each shift. It started out as a single list for all of us to complete, but after I got in trouble for doing all the \"easy\" tasks, it was split into multiple lists (one for each person). \n\nI remember a few days after the list thing had started, I was given a list of 25 things while my coworker for the night had a list of 5. Yes, the tasks were of same complexity, but since the coworker was the girlfriend of the lead, it was only fair...right? \n\nWell, we were both given our tasks at the same time. She was scheduled to be off about 2 and a half hours after we got our tasks, and I was scheduled to be there for another 3 and a half (maybe 4, I can't remember).\n\nBy the time my coworker only had 30 minutes left of her shift, she had only completed 1 task (while I had completed about half of mine). She started complaining, because the manager asked her to stay until she finished her tasks. \n\nAlmost an hour later, she had gotten through 3 of her 5 tasks, and I was done with mine (minus for like 2 easy things). She was taking some stuff back into the kitchen to get washed, and I asked her to take a few spoons that I just found on the floor. She was going there anyways, what would 2 spoons hurt? \n\nApparently, a lot. She started screaming at me, and I was so done, that I'm afraid to say I screamed back. I worked in the employee dining room, and it was after hours, so there wasn't any witnesses other than the manager who came to intervene five minutes later. \n\nHere's where the malicious compliance comes into play. After the manager calmed us down (mostly her, as she was complaining that its way past her shift, yada yada), he asked me if I wouldn't mind finishing her tasks so she could leave. \n\nI explained that I could not, as I was told to do only my list of things, and nothing else. Also, I was done with my list, could I go back to my room now? I had a little bit of my shift left, but all my tasks were completed, and I was told to do only my tasks. \n\nSo yea, I ended up getting off a bit early that night, while they had to pull someone from the front of the house (where tourists actually ate) to help my coworker finish her tasks. To this day, I wonder if it was just the Lodge I was at, or if it was the whole national park with such a bad workplace. \n\nTL;DR: I had a long list of things with instructions to do only my tasks, and got to leave early while my coworker had to stay late to finish her short list of tasks.",
        "created_utc": 1537154249,
        "upvote_ratio": ""
    },
    {
        "title": "Yogi doesn’t break the rules.... just bends them sometimes;)",
        "author": "mcmike967",
        "url": "https://i.redd.it/cmesh8hempm11.jpg",
        "text": "",
        "created_utc": 1537151266,
        "upvote_ratio": ""
    },
    {
        "title": "[Story in Comments] When your boss says \"Everything by the book from now on\" so you have to throw out a tray full of profits.",
        "author": "jimmygrim",
        "url": "https://imgur.com/3yIoKaf",
        "text": "",
        "created_utc": 1537141201,
        "upvote_ratio": ""
    },
    {
        "title": "Is this classed as a manipulating boss?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/9geu05/is_this_classed_as_a_manipulating_boss/",
        "text": "[deleted]",
        "created_utc": 1537137009,
        "upvote_ratio": ""
    },
    {
        "title": "Malicious compliance on a toddler",
        "author": "inkseep1",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/9ge9lh/malicious_compliance_on_a_toddler/",
        "text": "Years ago I was eating at a Steak N Shake and nearby was a table with a young couple with a toddler.  The kid was very young, not old enough to talk much yet.   The father was feeding the kid some kind of small, greenish, bean shaped food.  I don't know what the food was but it looked like jelly beans from a distance but they were all light green.  The father ran out of them.  The kid started getting fussy and was then trying to reach towards a bottle of green, bean shaped hot peppers that Steak N Shake puts on each table.  So the dad sees the kid wanting the green, bean shaped things in the jar so he figures, why not?   I am watching this and see the dad get the pepper sauce and open it and pull out a pepper.  The whole time I am thinking 'do it, do it'.  Against his wife's objections, he hands the kid the pepper and the kid pops it in his mouth.  It took a few moments for the pepper taste to register and then the kid's eyes pop open real wide and he spits out the pepper and tries to wipe his tongue with his hand.  To the kid's credit, he did not cry though.",
        "created_utc": 1537132612,
        "upvote_ratio": ""
    },
    {
        "title": "American airlines turns it's back on first responders...",
        "author": "riseagainst2615",
        "url": "https://i.redd.it/axtlhmgmonm11.jpg",
        "text": "",
        "created_utc": 1537127801,
        "upvote_ratio": ""
    },
    {
        "title": "My wife said it’s time for Fall decorations &amp; asked me to put out the pumpkins... Done.",
        "author": "mycynical30s",
        "url": "https://i.redd.it/zq570b9lvmm11.jpg",
        "text": "",
        "created_utc": 1537118037,
        "upvote_ratio": ""
    },
    {
        "title": "okay then",
        "author": "[deleted]",
        "url": "https://i.redd.it/nsztnbmyhmm11.jpg",
        "text": "[deleted]",
        "created_utc": 1537113452,
        "upvote_ratio": ""
    },
    {
        "title": "Boss said I wasn’t using enough Wet Floor signs while mopping.",
        "author": "SadGravel",
        "url": "https://i.redd.it/eu3b2lf4plm11.jpg",
        "text": "",
        "created_utc": 1537103756,
        "upvote_ratio": ""
    },
    {
        "title": "Petty High School Malicious Compliance",
        "author": "TwistedRope",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/9g9o3m/petty_high_school_malicious_compliance/",
        "text": "[removed]",
        "created_utc": 1537094584,
        "upvote_ratio": ""
    },
    {
        "title": "Post no flyers",
        "author": "[deleted]",
        "url": "https://i.redd.it/2kfsncqvufm11.jpg",
        "text": "[deleted]",
        "created_utc": 1537033049,
        "upvote_ratio": ""
    },
    {
        "title": "Post No Flyers",
        "author": "[deleted]",
        "url": "https://i.redd.it/bvfrr52daem11.jpg",
        "text": "[deleted]",
        "created_utc": 1537032011,
        "upvote_ratio": ""
    },
    {
        "title": "Bruhhhh.....",
        "author": "ignatzioisntme",
        "url": "https://i.redd.it/i5s69xqmsem11.jpg",
        "text": "",
        "created_utc": 1537020185,
        "upvote_ratio": ""
    },
    {
        "title": "You shouldn't have hired an Anarchist to be an \"infrared laser control technician\" Karen.",
        "author": "MakeTotalDestr0i",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/9fz5gk/you_shouldnt_have_hired_an_anarchist_to_be_an/",
        "text": "[removed]",
        "created_utc": 1536989879,
        "upvote_ratio": ""
    },
    {
        "title": "Mutually Assured Malicious Compliance",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/9fuvb2/mutually_assured_malicious_compliance/",
        "text": "[removed]",
        "created_utc": 1536952262,
        "upvote_ratio": ""
    },
    {
        "title": "Bowling Alley - Lane Cleaning/ Oiling",
        "author": "Doctor_Blunt",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/9fu2fh/bowling_alley_lane_cleaning_oiling/",
        "text": "I used to work at a bowling alley in my student union at Indiana University - Bloomington. I was on the Friday and Saturday closing shifts as I was try to stay away from drinking after I developed a nasty drinking habbit. \n\n\nNow I used to happily close and had no issues till the bowling alley got a night manager let's call JW. He had a stick up his arse it used to seem and always tried too hard to make money and charge students more even though the bowling alley was there not for money, but for student enjoyment. \n\n\nI used to close Saturday alone since the people traffic was very little that day. This involved using a lane machine that would clean and then oil the lanes. When the cleaning liquid was running low you had to refill it after diluting it and when the oil was running low we had to refill the oil. Usually 2 people made it easier to fill the cleaning liquid as it was from a huge container into a funnel and corrosive as well. \n\n\nOne Saturday night the cleaning liquid was running low in the lane machine and mind you this is my second last week of work  because of horrible customers and JW is still learning the ropes and is working instead of me alone. The tank for the liquid is translucent so you can see how much liquid goes in, but we knew the foam on top meant we had to fill it till 3/4th or it would overflow. I inform JW of this while which he should already know. I hold the funnel and he starts pouring the cleaning liquid. As soon as the liquid hit the 3/4th mark I told him to stop pouring the liquid. He said that it looks only 3/4th full while I try to re-inform him that we should not fill it more of the cleaning liquid. He says what's the harm in trying and at 2 30 am I was done and said ok have it your way. \n\nHe starts to pour more cleaning liquid in the tank and as predicted it overflows a little so he stops. I tell him that we can't pour more, but he refuses to budge for some God forsaken reason. He says it doesn't look full so that people don't have to keep re-filling it we should fill more. I caution him again, but he insists. He pours more it now overflows out of the funnel onto the machine and the approach to bowl. A whole bunch of cleaning liquid is now on the approach to lane 3. We spend 20 minutes using rags to soak up this liquid, I finish the lanes and start to leave since it 3 am. While removing all the bowling balls from the lanes as the last action of the night I notice the lane 3 approach is now super rough and people can't physically bowl in that lane because the cleaning liquid had badly corroded the wood. I inform JW whose closing the cash and leave.\n\nNext morning all the employees get a mail from the main manager saying lane 3 is not to be used for the bowling classes or for games to be sold on that lane since the approach had become corroded and to rough to use. They ended up spending a huge sum of money to replace the wood on the approach since all lanes were used during the bowling classes Mon-Fri. Also a schedule change was made where the night JW closed alone another person was added to that shift. I heard he got a huge telling off by the main manager and the whole facility manager for over an hour and to listen to what employees who have been there for longer say. \n\nTl,dr - New night manager insists I fill corrosive cleaning liquid in the lane cleaning/oiling machine above the normal mark. This ends up in a spill on the approach to a lane. The approach is corroded beyond use and has to be replaced for a huge sum. New night manager gets a huge telling off and an employee is always made to work with him to ensure no more fuck ups. ",
        "created_utc": 1536946708,
        "upvote_ratio": ""
    },
    {
        "title": "If a disabled person asks you to do something for them...",
        "author": "w00tdude9000",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/9ftsxu/if_a_disabled_person_asks_you_to_do_something_for/",
        "text": "... It's generally considered polite to do it. We don't like asking for help often, so when we do, we actually need it. LTL, FTP, excuse mobile formatting, all that.\n\nI'm finally moving in with my boyfriend, and while he's sweet and I love him so much, he has a few times where he gets upset that I require accommodations for my various disabilities. Which is fine, it's an adjustment period, I don't hold it against him. It's still very frustrating and has caused more than a few issues. Nothing too bad, but... still frustrating and a bit hurtful.\n\nOne of those disabilities is an issue I have with blood sugar. I'm not diabetic or close to it, but if I've gone more than a few hours without food, I'm prone to dizziness, nausea, and even fainting. It's not as much of an issue while I'm sleeping, since the body uses less energy and I don't need as much food, but if I've slept more than usual, it is indeed an issue.\n\nSo I wake up one morning next to my boyfriend to find I've overslept, and I can feel my legs falling asleep even just laying down, which is a very bad sign. I ask my boyfriend if he could get me some food, and mister sleepyhead throws a bit of a fit.\n\n\"Can you get it yourself?\"\n\nOkay. Sure. I also just woke up and I'm more than a bit cranky, so I haul myself out of bed- and immediately fall to the ground, passed the fuck out. It was probably only for a few seconds, and I made sure I wouldn't fall on anything dangerous, but I still came to to find my boyfriend shaking me frantically (but gently).\n\nIt's a few hours later and he got me my food once we both calmed down, and he's reassured me he won't force me to get up next time. He's learned his lesson, and I've recovered nicely from my little fainting spell (though my back is a bit sore, but when isn't it?)\n\nTL;DR, man asks disabled boyfriend to get his own food. Disabled boyfriend gets up and immediately faints.\n\nEdit: Hey, thanks for such wonderful, supportive replies. I've been disabled for over 15 years and I know how to help myself, I just need some help sometimes because surprise, I'm disabled. If you're here to ask why I didn't do x, y, or z, please don't.\n\nEditedit: I'm a boy. He's my boyfriend. I'm gay. Thank you. ",
        "created_utc": 1536944844,
        "upvote_ratio": ""
    },
    {
        "title": "\"Call me when you get in\"",
        "author": "superzenki",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/9ftid3/call_me_when_you_get_in/",
        "text": "[removed]",
        "created_utc": 1536942742,
        "upvote_ratio": ""
    },
    {
        "title": "German Army: follows your orders!",
        "author": "Haeuslebauer",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/9fs1yw/german_army_follows_your_orders/",
        "text": "Well… here it goes:\n\n \n\nBack in the day, when Germany still had mandatory military service for young men I had to go too. It was the last year before this was suspended, but that’s a whole different story.\n\nI was drafted into the so called 3M-Quartal. The Bundeswehr drafted quarterly, and there were two draft dates per year where a lot of young well educated young men got drafted and there were two dates where almost the entire lineup consisted of school dropouts. I was in the “lucky” position to be a.) well educated (German Abitur) and b.) still being thrown into the 3M-Quartal.\n\n3M-Quartal: This has nothing to do with sticky tape. It’s short for: Maurer-Mörder-Metzger (literally: Bricklayer, murderers,butchers).\n\nSo there I am. 9 months of forced military service, where I had the honor to serve under a bunch of the most stupid people I have ever met in my entire life. The non commissioned officers were a special kind of people.\n\nCue to way after basic training. I had since tried to avoid damage to equipment or harm to fellow soldiers by pointing out certain flaws in orders I received. I was sent straight to the captain many times. One time, the captain straight up told me that he knew that my objections to certain orders were saving money, avoiding damage, etc, but he reminded me sternly that this was the military and an order is an order. After all, I had a month left to serve and should not risk to be temporarily imprisioned by MP for repeatedly not following orders no matter how stupid they were. He also told me that I was not liable for damage or waste of funds as a direct result of stupid orders but the order-giving officer was.\n\n19yr old me took that as an invitation for malicious compliance (mind you that, at the time, I did not know that phrase yet.). I was even looking forward to the clusterfuck that would follow the next order from a very special supervisior of mine. I could not wait to proudly shout “Jawohl!” and get to work.\n\nSome time after that, we went out with some offroad vehicles (Merceded G-Class, military code “Wolf”) and really really really covered them in mud. We were speeding through ice covered mud-puddles and covered the cars in thick mud completely.\n\nThe order came: „Obergefreiter Haeuslebauer! Take the pressure washer and clean the Wolf. I will personally check every inch of it afterwards. Make sure you get everywhere. “Little did sergeant CocoBanana know that in -10 degrees Celsius (approx. 10 Fahrenheit) a pressure washer becomes very similar to a snow cannon and a fine mist of water will immediately freeze upon contact with a cold surface.\n\nI  said “Jawohl, Herr Unteroffizier!” and went to work. Every nook and cranny got a thick cover of ice. The door, the locks, the hood, the cooler, the exhause tip, the coilsprings, the brakes, everything. The water that did not freeze on the cars surface or formed ice-armor in the door-seals or rendered the locks unuseable quickly formed a nice area of black ice on the ever so slightly sloped ground the car was parked on.\n\nA certain sergeant was later called into the captains office. Many loud words were shouted, I was never even asked about this and happily left the army some weeks later.\n\nThe same officer felt the urge to hold an improvised “motivational speech” in front of the 20odd hungover men who were already discharged, did not wear uniform and came together for a last muster.\n\nHe went: “I assume your time in the army taught you skills for your civil life. I hope you have jobs and opportunities waiting for you when you leave this place”.\n\nEven though I knew he really meant this in a positive spirit I spoke up and said: “Sure enough, I would have stayed in the army if I was unemployable elsewhere!”\n\nIf you have managed to chew through this wall of text from a non native speaker without biting into your phone/laptop/whateverdeviceyouareusing then let me add one more thing: I met many compassionate and well qualified people in the army and am good friends with some career army air-force guys. I do not say that all members of our forces are dumb people unable to get jobs outside, but I do say that such people exist. My “Unteroffizier” was certainly one of them.  ",
        "created_utc": 1536932213,
        "upvote_ratio": ""
    },
    {
        "title": "Crossposting OC from r/bootleg_memes for more karma",
        "author": "[deleted]",
        "url": "https://imgur.com/wbhjDt9",
        "text": "[deleted]",
        "created_utc": 1536901225,
        "upvote_ratio": ""
    },
    {
        "title": "Cross posting that OC for more karma. r/bootleg_memes",
        "author": "[deleted]",
        "url": "https://imgur.com/nDuQ0df",
        "text": "[deleted]",
        "created_utc": 1536900626,
        "upvote_ratio": ""
    },
    {
        "title": "My STBX Husband requested that I email him confirmation of receipt of final payment, so I made this website.",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/9fn9o9/my_stbx_husband_requested_that_i_email_him/",
        "text": "[deleted]",
        "created_utc": 1536883732,
        "upvote_ratio": ""
    },
    {
        "title": "school dress code",
        "author": "el_d0g",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/9fm0wx/school_dress_code/",
        "text": "my friend, let’s call them Jemima, is currently in year 10 (England). They got an industrial piercing last year, but the school uniform policy says no piercings other than one stud earring PER EAR.\n\nJemima decided to take out their lobe piercings and replace their industrial with two studs. Whenever a teacher questions it, they just say “it doesn’t say which ear the studs have to be in.” \n\nNo matter how pissed they get, they can’t do anything and I love it because loads of teachers used to pick on me over the stupidest things and I hate them all haha.",
        "created_utc": 1536873924,
        "upvote_ratio": ""
    },
    {
        "title": "You want all your data? Fine here it is.",
        "author": "moremattymattmatt",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/9fl6ou/you_want_all_your_data_fine_here_it_is/",
        "text": "I've had a few run-ins with my local town council in the past (I'm in England) so I decided to take advantage of GDPR and request all the data they held on me. I wasn't expecting anything juicy but you never know.\n\nFirst of all they give themselves an extension to the usual 20 day deadline to give themselves a couple of months to collate all the data. Finally they send me an email with all my information and I open the it with some interest.\n\nThat's weird - there are two pdf attachments that seem strangely large.\n\nSo I download them, open them up and find out why they are so large. The council have taken all the emails etc about me, printed them off, scanned them by in again and sent them through as images in a PDF document. No wonder it took them two months to get the data together!\n\nTechnically they've given me the data in electronic form as required. Practically I have 180 pages of PDFs that I can't search and can't be bothered to read.",
        "created_utc": 1536867929,
        "upvote_ratio": ""
    },
    {
        "title": "Megaphone manufacturer makes the product exactly as requested",
        "author": "nascentia",
        "url": "https://i.redd.it/zh2ip7c302m11.png",
        "text": "",
        "created_utc": 1536865334,
        "upvote_ratio": ""
    },
    {
        "title": "Drew a little diagram to help explain the new rules at work.",
        "author": "Tavia_Melody",
        "url": "https://i.redd.it/qkhq8ry990m11.jpg",
        "text": "",
        "created_utc": 1536865271,
        "upvote_ratio": ""
    },
    {
        "title": "Sorry boss; its one or the other",
        "author": "Alucard_1991",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/9fjkag/sorry_boss_its_one_or_the_other/",
        "text": "This was from a couple years ago:\n\nI was working at a gas station where at the time you could pull up to the gas pump, hit pay inside, and pump before paying (for obvious reasons, and the same reason i will discuss, this company, and virtually every gas station in the USA no longer does this). A big issue with this is you could obviously hit pay inside, pump, then drive off.\n\nThe company's policy to try and cut down, or catch \"drive-offs\" was then when we approved to turn on the pump, we were to do our best to write down the car make/model and license plate number. The store i worked at was also on a VERY busy highway/route to get to most of the other state, so in a standard shift, 1 cashier would do around $5000 of business, so we were busy most of the time, and never had time to write down info. However this was made somewhat obsolete with a camera system the was installed that would focus on the general area of where the license plate should be for every car at every pump. So when there was a drive off, the store director could just go check the cameras, and call the police.\n\nWell due to some unfortunate events, we had a newish store director of a couple of months(mind you, store directors usually have been working for the company a couple of years, as this one had). Also for a little background, this director was HORRIBLE at planning/scheduling people, and wouldnt make any changes, and would hit \"repeat\" when it was time to reprint the schedule, so then us workers and the assistant director would have to manually change it.\n\nAnyway, when there was a drive off, instead of checking the cameras, the director would then proceed to blame the worker who approved to pump for not writing down license plate number, instead of going back and reviewing the film (which not once did they do).\n\nAnyway, it was 5 o'clock rush, due to idiotic scheduling, The only people working was the store director and myself. I approved a \"pay inside\" and kept working the cash register as there was a large line, also due to the fact the director was \"doing the books\" and to not call for help so he could do the books faster (which would take him 3 hours, but a couple of years later i became a manager and learned books, and took me an hours MAX). So anyway, the person drove off, he came out and yelled at me for not writing down the info. So i kept working down the line, when someone else wanted to be approved to pay inside. I walked over to the far side of the counter, grabbed the binoculars (the cash register was in the back of the store) and looked at the car and proceeded to write down the info. No sooner that i finished writing down the info, the store director came out of the office and yelled at me for having a line, and doing something else other than work the cash register. I about yelled at him asking which one i should do....one or the other.\n\nThe rest of my time there (i was headed back to school in 2 weeks) i would make sure to write down any info, which would then cause a line, and then cause the director to ACTUALLY COME OUT AND HELP.\n\n&amp;#x200B;\n\nEDIT: added \"in the USA\" before \"virtually every gas station\"",
        "created_utc": 1536856680,
        "upvote_ratio": ""
    },
    {
        "title": "I made a push notification feed (desktop/mobile) for posts of r/MaliciousCompliance that have a minimum of 4000 Karma.",
        "author": "CEOofNothing91",
        "url": "https://pushmio.ml/feed/MaliciousCompliance",
        "text": "",
        "created_utc": 1536849383,
        "upvote_ratio": ""
    },
    {
        "title": "Co-Worker bites off more than he can chew…",
        "author": "inkwat",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/9fhwu9/coworker_bites_off_more_than_he_can_chew/",
        "text": "I have one of those co-workers who delights in other people making mistakes (despite making his own share of mistakes, some being potentially quite serious). We get on alright most of the time, but I doled out some malicious compliance today.\n\nI received an e-mail from him earlier saying that I had made a mistake in some of the leaflets we had ordered – one of the sentences had a typo in with ‘he’ rather than ‘the’. Fair enough. It happens. The leaflet had been reviewed by about 5 people before being ordered and we had all missed the typo, but not much to be done about it now – we’ve already received &amp; distributed the leaflets and we’d have been unlikely to scrap them &amp; re-order anyway over a minor typo.\n\nUnfortunately, he decided to snidely add in: ‘The leaflets should really be checked over by someone else before printing. You could always chuck them over to me for a second pair of eyes.’\n\nIt’s a passive-aggressive, ‘nice’ way of implying that he’s more competent. Maybe he is, I try not to measure myself against others. At first, I was annoyed, and I was going to tell him to fuck off (in the politest possible way), but I decided that I would take him up on his offer. For the whole project.\n\nThere are 50+ leaflets with thousands of words of content and a very text-heavy training website. It’ll keep him busy for a while.\n\nUpdate: Rather than just copying our boss in on his original e-mail (which would have been annoying enough), he sent a separate e-mail to her to tell on me. She told him in no uncertain terms that the leaflet had been looked over by a few people and clearly the typo had been missed (mistakes happen). She also told him that I am the project manager, that I have the project well under control and that he is not to interfere.",
        "created_utc": 1536844791,
        "upvote_ratio": ""
    },
    {
        "title": "Buzzfeed is back at it again",
        "author": "wileybahr",
        "url": "https://i.redd.it/c0lpycprpzl11.jpg",
        "text": "",
        "created_utc": 1536837620,
        "upvote_ratio": ""
    },
    {
        "title": "After Her Boss Enforced a Discriminatory Dress Code, This Woman Delivered a Master Class in Trolling",
        "author": "ShelIsOverTheMoon",
        "url": "http://remezcla.com/culture/boss-enforced-discriminatory-dress-code-woman-delivered-master-class-trolling/",
        "text": "",
        "created_utc": 1536825865,
        "upvote_ratio": ""
    },
    {
        "title": "At a bar",
        "author": "[deleted]",
        "url": "https://i.redd.it/7zogg70kmyl11.jpg",
        "text": "[deleted]",
        "created_utc": 1536824439,
        "upvote_ratio": ""
    },
    {
        "title": "I was extremely depressed, and that other guy extremely high and wishful for feces",
        "author": "Blazinter",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/9fd54t/i_was_extremely_depressed_and_that_other_guy/",
        "text": "If this doesn't count as \"compliance\" due to the nature of the incident, feel free to delete, report, whatever towards this post.\n\nThis is a story I already told to Reddit in some comments some years ago but I have discovered this subreddit, remembered this anecdote of mine, and though it'd fit.\n\nSeveral years ago, I was walking my dogs (two adult and hecking lovely border collies), like always every day thrice.\n\nIt was some afternoon, one of the streets I always cross by on my main walking route was blocked due to urban works, so I had to turn around other street.\n\nIn said street, I find a very restless looking person which suddenly would knife-point at me and yell in a rather ridiculous way: \n\n\"GIVE ME YOUR VALUABLES.\"\n\nI was extremely depressed, suicidal, with severe psychological problems. My worries were none.\n\nI looked at myself, looked at my hand, then looked back at that most likely high or drunken man, and I've replied very bizarrely in a calmly (and in retrospective extremely stupid and obviously unwisely) manner:\n\n\"Sir, please look at me. I'm walking my dogs. The very only I do have are my house's keys and this bag with poo from two large breeded dogs. Aside from the unwise idea that is robbing a man with two large dogs-\"\n\n\"GIMME YOUR FUCKING VALUABLES.\" He interrupted me.\n\nI just took the bag with my dogs' poo, and layed it gently on that man's hand (which have been opened during all this time like if he were waiting for a paycheck), and then just resumed with my walk.\n\nLooked back just once, to see how the guy was checking around the bag, like if he had the hardest time to process what happened and what he's holding; and then just continued to know nothing about that guy ever again.\n\n____________\n\nIt was imprudent and stupid AF by my side, but my mind wasn't precisely on the best state. At least nothing bad happened and *it was a win-win situation*. Regardless, I still get uneasy at times remembering this, knowing the probabilities of getting stabbed by a random presumably-not-rational person were inmensely high at one point, but that's other point and discussion.\n\nI am no longer depressed and way less suicidal btw. I want to live as much as nature allows me if not more.\n\nEdit: Typo/grammar.\n",
        "created_utc": 1536797356,
        "upvote_ratio": ""
    },
    {
        "title": "I guess I’ll never know...",
        "author": "joncohenproducer",
        "url": "https://i.redd.it/lrqrjkhddwl11.jpg",
        "text": "",
        "created_utc": 1536797131,
        "upvote_ratio": ""
    },
    {
        "title": "Teacher power move fail",
        "author": "BaptisteViloin",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/9fcet3/teacher_power_move_fail/",
        "text": "I was in highschool, and I already had some kind of a problem with autority. \n\nA French teacher asked everyone of us to buy a little notebook with letters on the side to write down the vocabulary words whenever we learned a new word. She had this kind of natural autority you don't see that often. So the classes were really calm.\n\nI also had the habbit to chat discretly with my classmates, but was pretty good in class and not sitting in the back of the class. It was at the beggining of the year. \n\nSo at one point, she asks all of us to take out our little notebooks and write down the new word. \nIt caused everyone to take out the book from our bags, go to the correct page etc... I quietly told my friend sitting next to me that it was a list of time and effort. \nShe heard me chatting with him. Probably catching a part of my \"doubts\". She then thought it was a good idea to say:\n\n\"Baptiste if you have something to say, you better stand up and tell everyone.\". Then she turned around, to face the blackboard again.\n\nBut as you expect by now, I followed her instructions, stood up and loudly explained: \"I think this notebook is a loss of time for everyone. Nobody is your to open it at home. We should better write the vocabulary as part of the lesson\". And sat down. \n\nShe turned back to me with the killer look and told me a freezing cold: \"We'll talk after class\". I could not answer anything else than a large smile.\n\nI got some minor disciplinary sanctions. 100% would do that again.\n\nTL;DR: Teacher told me to stand up and tell everyone what I was saying, but she expected me to stop chatting. I stood up and openly criticised her work.\n\n\n",
        "created_utc": 1536791323,
        "upvote_ratio": ""
    },
    {
        "title": "I don't care if you have to stay there all day!!",
        "author": "JakeFromStateFarm423",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/9fc9zj/i_dont_care_if_you_have_to_stay_there_all_day/",
        "text": "Tl;DR at the bottom as this will be lengthy\n\nI apologize for the vagueness as I still work here and don't want one of my coworkers to scroll across this ;) (Yes Mark im talking about you shhhhhh ill buy you lunch)\n\nSo a bit about my job first. I work as a Rental Manager for a pretty well know and well-off person in my community we'll call them BB for Big Boss. Currently BB has over 50 rental properties and buying 3-5 a year since I've been working these last couple years. My job is simple. At the beginning of the month I collect Tenants rent, update their files and on the 6th whoever hasn't paid gets a 3-day notice of eviction. The eviction notice is the real deal that I post on the door or hand to the Tenants if they are home but my boss is pretty lenient as long as you pay by the end of the month (although repeat offenders tend to only pull this off for a few months at most). If you give us a date you can pay, or arrange paying X amount each week or so as long as it pays your balance off by the end of the month, BB will let you slide.\n\nOn to the Story:\n\nSo BB recently bought a mobile home for a lot they bought and cleared about a month back. Now we can't just rent this out as it doesn't have: Running water/sewage, any form of heat or air, power and a few other miscellaneous permits, but for the most part these 3 are the biggest. Once all of this is done you get a Certificate of Occupancy by the local Building Department and you can rent it out to Tenants. It has taken 3 months to get just these 3 items set up as we had to dig a well (no water lines close by offered by the city), get our plumber (that is a friend and works personally with BB) to hook up the pump, get the A/C company to put a unit in (after several failed attempts due to elevation issues causing our Elevation Certificate to be turned down multiple times), and the electric company putting up the wrong size power pole (yes there are actually city/government regulations for power pole heights). Fast forward 3 months and finally we just have one more miscellaneous permit to get out of the way (Driveway Permit). At this point of course BB has been through several temper tantrums (understandably so) to the point of yelling at the Building Services inspector. Well the inspector passed us and we just need to take a copy of the Driveway permit to the Building Services. BB tells me to specifically hand it to a lady well call Alice even if I have to stay there all day! Now Alice has walked us through the process multiple times and been extremely helpful since the start of this cluster f\\*\\*\\*, but Alice also happens to be a sort of manager there and is often in meetings or not in her office. Now, I work 8am to 5pm and this was around 8:45 ish in the morning. I drive over to the Building Services, permit in hand, and ask for Alice that has been working with BB for --Property Address--. The lady at the counter tells me she will be out for most of the day and wont come back until after 3pm. I tell her I was specifically told by my boss to wait for her even if it took all day. They tell me I'm welcome to come back and I politely say Ill wait in the lobby since my boss insisted I wait for her. I then pulled out my phone and some earbuds and sat in the lobby enjoying some music I even take my standard 1 hour lunch break at 12pm. 2pm rolls around and my boss finally calls\n\nBB) WHERE ARE YOU ITS BEEN 5 HOURS IT CANT HAVE TAKEN THAT LONG TO GET A SIMPLE CERTIFICATE\n\nMe) Well Alice is out until 3pm so I'm sitting here waiting for her as you instructed\n\nBB) WHAT!?!? YOU COULDN'T HAVE COME BACK AND TOLD US THIS OR ASKED ANOTHER EMPLOYEE FOR HELP?!?!\n\nMe) You insisted I wait for Alice even if it took all day!\n\nBB) I- I.. \\*stammering followed by long silent pause\\* You said she'll be in at 3?\n\nMe) That's what I was told.\n\nBB) You're already there so just get it from Alice when she comes in \\*hangs up\\*\n\n3pm Alice shows up and is utterly speechless and confused when I tell her my instructions until a long burst of laughter by her followed by a few others in the office. I ultimately wait some more for her to gather the documents, print them, take them to get signed (its upstairs by some government official) and return to BB's office at 4:50pm with the Certificate. Clocked out at 5:07pm\n\nTL;DR Boss sent me at 8:45am to get a certificate for a house, told me to wait for a specific employee to show up even if it took all day, employee showed up at 3pm got the Certificate printed and verified after an hour or so, returned with Certificate at 4:50 Clocked out at 5!\n\n&amp;#x200B;\n\nEdit: So I figured a lot of people would find this controversial, but my boss is very know for getting very overly upset. We recently had a coworker quit, in tears, after he yelled at her for not filing a couple papers. Boss seems to think its my fault that the process is so slow and doesn't realize that it takes a long time for the city to send inspectors out of their way to inspect properties (seriously this is like 30 miles from our office, a 60 mile round trip that many people have made several times to make the boss happy). So after the constant berating and yelling from my boss (which he would never fire me because he knows I do a damn good job) I decided to give him a taste of his own medicine and after that stunt (which was a few weeks ago) he has definitely cooled off a bit.",
        "created_utc": 1536790322,
        "upvote_ratio": ""
    },
    {
        "title": "EU approves controversial Copyright Directive, including internet ‘link tax’ and ‘upload filter’",
        "author": "MuzzleO",
        "url": "https://www.theverge.com/2018/9/12/17849868/eu-internet-copyright-reform-article-11-13-approved",
        "text": "",
        "created_utc": 1536788407,
        "upvote_ratio": ""
    },
    {
        "title": "*UPDATE* to Don't touch the thermostat! Think your \"punishing\" me? Ok no problem.",
        "author": "SoaringPhenix13",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/9fbp34/update_to_dont_touch_the_thermostat_think_your/",
        "text": "[removed]",
        "created_utc": 1536786189,
        "upvote_ratio": ""
    },
    {
        "title": "Bottom of the Pile.....",
        "author": "Alucard_1991",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/9favgi/bottom_of_the_pile/",
        "text": "I work for a government office where part of my former duties was to respond to requests to view and/or copy files. So the law/rule set by the Supreme Court of my state mandates that when a request is submitted, we need to respond with in 3 business days of action being taken to fulfill the request, and then we have till 10 days to respond if the request is possible (ie can we provide it or not). Now days with any new files/cases being electronic (and old cases being scanned in) we usually can fulfill a request in less than a day; but in the days of old paper files, we sometimes needed the 3 days due to files possibly being in countless places within the office.\n\nAnyway, so we had a person call into the office and request copy over the phones, came in to the office in person and requested the file, submitted an email request form, emailed a supervisor directly requesting a copy, and also emailed the \"general questions\" email for the elected official over our office all for the EXACT SAME THING. So the other records clerk and I were already slightly annoyed. Well the person then called in 2 hours later demanding to know where his request was (remember he had submitted multiple requests at the same time, the same morning), which the workers on the phone reminded him (as well as told him when he requested it in person, on the phone, and email) that we have 3 days to respond. We then got a note saying the person called, but we had requests in front of theirs. Near the end of the day, the person called again. When my partner and i finally got to his request, the file was unavailable until the previous morning. When the following morning came, the person was there right as we opened demanding his copies. We explained we still had not received the file (which was true) and he needed to wait, and that it technically was only the 1st business day. Couple hours later, the person called AGAIN to check up. Finally we get the file from the Judge who had the file. We could have made the copy, but after constantly calling the office, showing up, and being reminded we have at least 3 days to contact him  (which him showing up and talking to us actually counts as contacting them within 3 days to alert to any actions being taken) but may take up to 10 days; we decided to make the person wait the full 10 days. Finally on the 10th business day we called and alerted him his copy was ready and when he complained about the time, we reminded him we were in full compliance of the law, we just left out the fact that we put him on the bottom of the pile of requests.\n\nMoral of the story, be nice to clerks and don't annoy us.\n\nFOLLOW UP: THEY NEVER PICKED UP THEIR COPIES!\n\n&amp;#x200B;\n\nTL:DR; Person couldn't wait 1 day for copies, kept annoying our office ever few hours, we made him wait 10 days within full compliance of the laws/rules.",
        "created_utc": 1536780546,
        "upvote_ratio": ""
    },
    {
        "title": "Refund from American airlines",
        "author": "jjprice89",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/9fa34v/refund_from_american_airlines/",
        "text": "First of all, hope everyone in the path of Florence is safe! \n\nThat said, I had a meeting scheduled in Charleston on Wednesday (today) but it was canceled when the governor declared a mandatory evacuation starting noon Tuesday (yesterday). Originally, flight was scheduled to land Tuesday night and I was scheduled to leave Charleston Wednesday night. No rain is falling yet, from what I'm told, so American Airlines was unwilling to refund my flight despite the mandatory evacuation. They were, however, willing to let me change my flights to a different time in the next 7 days without charge. This isn't helpful as the meeting hasn't been rescheduled and certainly won't take place in the next week. I was told the only way to get a refund is if the flight is cancelled which mine certainly wouldn't be. So I asked to change my flight.. I told the agent I wanted to land in Charleston at 0700 on Friday and depart Charleston that same morning at 0830 - during the predicted height of the hurricane. The agent was confused why I wanted to only be in charleston for an hour and a half but no flights had been canceled so she agreed to switch my flights, no charge. All of this happened last night.\n\nThis morning, I got multiple emails telling me Charleston Airport has been shut down all day Friday and they would like to offer me refunds on my flights or help me reschedule. I know for a fact my original flight last night left on time and my original departure for tonight is still on time.\n\nThanks for the refund American! They weren't particularly pleasant to deal with so I'll fly back on a different airline. ",
        "created_utc": 1536775267,
        "upvote_ratio": ""
    },
    {
        "title": "A group of people behind me said they lost something to try getting closer to the stage at a concert",
        "author": "somebodyeIse",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/9fa237/a_group_of_people_behind_me_said_they_lost/",
        "text": "[removed]",
        "created_utc": 1536775052,
        "upvote_ratio": ""
    },
    {
        "title": "How my new boss lost his fingers.",
        "author": "NGD80",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/9f9hsh/how_my_new_boss_lost_his_fingers/",
        "text": "Back in the early 2000s I was a management trainee for a manufacturing company in the UK, and I was responsible for quality control and production management. I was 22 years old, keen as punch and ready to change the world.\n\nAbout 11 months into the role, I got a new boss, let's call him \"Fred\". Fred was also the company owner's son, and was basically a 45 year old fuck up who had only ever been a drug dealer/DJ and now stood to inherit the entire company. His management style was, let's say, 'interesting' and he would deviate from \"screaming at you for the most benign thing ever\" to \"I can't deal with the pressure so I'll go home for the day\" in a matter of hours. He also thought he was a manufacturing GENIUS. His ideas were batshit crazy, but he would scream at anyone who questioned him.\n\nThere was a 52 year old machine operative, let's call him \"Roy\", who has worked on the same machine for over 30 years. Roy could tell when his machine was 2 weeks away from a breakdown, just because it sounded different. He was truly at one with his machine.\n\nFred decided that we would modify Roy's machine so that we could extend the range of products we could manufacture. In order to do this, he decided that we would add an additional spindle to the machine. The problem was that each product would finish at a different time and you would need to remove a product from the machine while the other one was still spinning.\n\nRoy protested and said he'd never use it, but Fred went ahead and modified it over the weekend with a subcontractor.\n\nOn Monday, Roy said \"you must be joking, I'm not using that\". Fred said \"you will use it, or you'll be looking for a new job tomorrow.\" Roy said \"it's not safe and I won't use it. If you try to make me I will report you to the HSE.\" And then Fred said \"if you report me, I'll make sure you don't find work ever again\".\n\nSo Roy smiled and said, \"ok, fine, I'll load the next job but you can run it first.\"\n\nRoy loaded on his next job, and took two steps back...he also looked at me and said \"stand back\".\n\nFred started the machine and all went well.... for about 30 seconds. \n\nThe first job had reached the diameter required and Fred pressed 'stop', however he now had to lean over the other job that was still running at 2,000 RPM. I didn't see it happen but I heard an awful scream and then saw blood squirting everywhere. Fred fainted onto the machine, narrowly missing the spindle with his face and greasy long black hair. We pressed the emergency stop and picked him up, and it was then I spotted his fingers in the machine. I picked up two middle fingers and gave them to a colleague to put into a freezer bag, which was a waste of time because they couldn't reattach them, they were too mangled.\n\nFred never came back to work. Apparently he told his father he wasn't cut out for running the company and I also left about 6 months later. I saw recently that it was bought out in a management buy out and good old Roy was the operations director. Good for him!",
        "created_utc": 1536771184,
        "upvote_ratio": ""
    },
    {
        "title": "You want addresses for your illegal spam? Ok, boss.",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/9f8smo/you_want_addresses_for_your_illegal_spam_ok_boss/",
        "text": "[deleted]",
        "created_utc": 1536766382,
        "upvote_ratio": ""
    },
    {
        "title": "NHAwD___Girls in the same city as you are looking for Ｓ Ｅ Ｘ _____k1FEMuz5jHnYwH",
        "author": "macnerd27",
        "url": "http://wzh.mobi/??MaliciousCompliance?LMCcf8iDT6fLiO=mY3ncmdhFpCJ4nY",
        "text": "",
        "created_utc": 1536752195,
        "upvote_ratio": ""
    },
    {
        "title": "On why you shouldn't play chicken with cancellations.",
        "author": "RedPalenciaTUM",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/9f3qoq/on_why_you_shouldnt_play_chicken_with/",
        "text": "Hello beautiful people (and Bill from IT, no, not you, you)!      \nObligatory LTL FTP. Also I'm not a native speaker, so -please- excuse any mistakes I make.    \nTL;DR at the end\n\nAs a backstory I work as a collection phone agent for a company that offers cellphone services, such company is (at least from my perspective as someone who lives in a different country and whose phone provider is way less reasonable) quite gracious in the way that when you can't pay your bill on time, you can actually call us and set up a Payment Arrangement that will secure your services and will prevent them from getting suspended as long as you fulfill your promise.  \nThe system however, will only allow for certain timeframes and won't let you do anything if the account is already suspended, since the customer must pay the full past due amount to resume his phone line.\n\nWhat I sometimes hate is that because of my accent (it's not even that thick) I get asked the \"where are you located?\" question quite a lot, but still, every time I hear it I do my best to exceed expectations and ~~know that I won't~~ cause a good impression so next time they don't ask to be transferred as soon as they hear me.\n\nI can't, however, help customers that can't even help themselves.\n\nSo, after that long introduction, I'm happy to present the cast of this beautiful ~~and not at all paraphrased~~ call.\n\n&gt;$Me: well, I guess me, yey!    \n&gt;$EC: Entitled customer. \n\n&gt;$Me: Hello, thank you for calling *wireless provider*, my name is $Me, how can I help you?  \n&gt;$EC: I want to speak with somebody in America!  \n&gt;$Me: Sir, I can assure you that you are speaking with someone in America.\n\n(Mexico is in America, *evil laughter*)\n\n&gt;$EC: Don't be smart on me, I want to speak with an American!  \n&gt;$Me: Sir, you are speaking with an expert from the financial department and I'm the correct person to speak with if you're trying to negotiate a payment date or restore your account, there are no transfers within departments, but if you want I can put you in the queue again though I know that the wait time is quite long now.  \n&gt;$EC: Well I want you to restore my services!  \n&gt;$Me: We can definitely look into that together, may I have your name and account information please?  \n&gt;$EC: *gives account information*\n\nAfter logging into the account, reviewing some previous broken payment arrangements and that the account had a past due and a current balance I came to the conclusion that the account simply wouldn't tolerate an exception, so I informed $EC and explained why.\n\n&gt;$EC: WHAT? THIS IS OUTRAGEOUS I AM A LOYAL CUSTOMER AND I DESERVE AN EXTEPTION!  \n&gt;$Me: Right now what we can do is restore the services with the payment of the past due balance and extend the current balance, that is the option we have available.  \n&gt;$EC: IF YOU WON'T RESTORE MY SERVICE THEN I WANT TO CANCEL!  \n\nAnd this is where my malicious compliance comes in, you see, collections cannot cancel the services of an account under all but one circumstance: that the account is already suspended for non payment.\n\n&gt;$Me: Sir, I'm terribly sorry you wish to do that and I can definitely help you with that, I must let you know that your account has and installment plan for one your devices, and that it will be accelerated if you cancel the services.  \n&gt;$EC: I don't care.  \n&gt;$Me: Ok sir, are you sure you want to proceed to cancellation?  \n&gt;$EC: I. TOLD. YOU. I. DO.  \n&gt;$Me: It will just take a moment sir, please do not hang up the call.  \n\n\nI then proceed to cancel the service as happy as if someone had given me a delicious Chile en Nogada and come back to $EC.\n\n&gt;$Me: Sir, I'm terribly sorry about all the issues you have been undergoing. I am glad to let you know that I managed to cancel your account successfully and you won't be charged for the services any longer. You will receive your last bill next month with the remaining installments and the existing balance.  \n&gt;$EC:....  \n&gt;$Me:....  \n&gt;$EC: YOU DID WHAT?!  \n&gt;$Me: I cancelled you account, just as you asked, is there som...  \n&gt;$EC: I THOUGHT YOU'D TRANSFER ME TO LOYALTY SO THEY COULD GIVE ME SOMETHING!!!  \n&gt;$Me: Oh, sorry sir, but since you explicitly said you wanted to cancel even after my confirmation the account got cancelled right away, where you not intending in going on with it then?  \n&gt;$EC: OF COURSE NOT! *insert some more rambling* So, there is no way to restore my services from suspension?  \n&gt;$Me: I wish there was, but the full past due balance had to be paid to do so.    \n&gt;$EC: Ok then, I'll pay you the past due balance to restore my services.  \n&gt;$Me: Well, now the services are cancelled, not suspended. You will have to pay the full balance to start the reactivation procedure.  \n&gt;$EC: *Rambles so more and finally gives in*\n\n\n**TL;DR: cx thinks he can play the \"I'm going to cancel\" game, but gets cancelled.**\n\n\n",
        "created_utc": 1536718518,
        "upvote_ratio": ""
    },
    {
        "title": "Don’t want to pay for a passport photo? OK, boss!",
        "author": "Rodfjell",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/9f2vob/dont_want_to_pay_for_a_passport_photo_ok_boss/",
        "text": "This just happened at my workplace. Customer comes in and wants to print out a 2x2 inch passport photo at our print kiosk.\n\nWe offer a passport photo service where we take your photo in front of a white background, digitally erase the background and give you two copies cut to size for $15.\n\nHe came in with a photo on a thumbdrive which I told him won’t pass their standard. He wanted us to white out the background, cut it to size and only charge him $0.39 (the price of a normal print). I explained to him the service we offer and that it costs $15. He starts cursing (in front of his 2-year old daughter) and asks to speak to the manager, told him I am the manager and then he cursed more about how we’re ripping him off... All he wants is his photo printed out and cut to size.\n\nSo I told him I can print his photo as a wallet size (2x3 inch photo repeated 4 times on 4x6 inch paper) and cut it down for him. He’ll get four copies of the photo. Total cost is $1. He decides to take the deal and thanks me after the transaction.\n\nHe told me he went to two other places just before here who refused to do what he wanted. Well I sure as shit did what he wanted and those photos are 100% gonna get refused by the government. I hope he sends in his passport application at the very last minute too and ends up screwing up his vacation plans.",
        "created_utc": 1536711622,
        "upvote_ratio": ""
    },
    {
        "title": "When you ask for extra cheese...",
        "author": "swingswingchopchop",
        "url": "https://i.redd.it/82yq8u9y5pl11.jpg",
        "text": "",
        "created_utc": 1536709890,
        "upvote_ratio": ""
    },
    {
        "title": "Southwest Airlines is the worst",
        "author": "SWAfail",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/9f1sdy/southwest_airlines_is_the_worst/",
        "text": "[removed]",
        "created_utc": 1536703052,
        "upvote_ratio": ""
    },
    {
        "title": "Saw this on r/powerwashingporn and thought it belonged here",
        "author": "[deleted]",
        "url": "https://v.redd.it/b9n20bs8iml11",
        "text": "[deleted]",
        "created_utc": 1536701732,
        "upvote_ratio": ""
    },
    {
        "title": "Sure i'll change gloves...",
        "author": "AegonIConqueror",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/9f19q6/sure_ill_change_gloves/",
        "text": "Alright so this is actually a story of my dad's taking place two years ago. So he worked as a cook at this restaurant and frankly the upper management was petty and just generally shitty. Now before we begin I should mention that the boxes of gloves they were given were quite large and that most people made their's last a month or two.\n\nSo the regional manager was making a monthly inspection and for whatever reason just didn't like my dad, so he went over to him and said that company regulation required him to change gloves every time he touched a different food item, he goes on about how he'd be in big trouble and all the usual stuff. So my dad does exactly that, using dozens of gloves every day. After several months and using over a thousand gloves and costing them a hundred bucks or so each month, the regional manager comes down to tell him that he needs to stop using so many gloves at it's cutting into profits which he happily complies with. ",
        "created_utc": 1536699137,
        "upvote_ratio": ""
    },
    {
        "title": "I’ll do it, but don’t try to enjoy lunch.",
        "author": "mbrowne76",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/9ezhks/ill_do_it_but_dont_try_to_enjoy_lunch/",
        "text": "When I started as an occupational therapist, my work offered to pay for a course in treatment for patients with Parkinson’s disease. As a wide-eyed young therapist eager to look good for the administrators I obliged. When I returned I voiced some concerns with the program, and because of that I never had anyone referred to me to be a part of the program. \nFast forward a year and a new mircomanager has taken over who informs me that by agreeing to take the course I’m responsible for the cost of the renewing my certification through them for the length of my time with the company. I asked if that was agreed upon before or if she just made the rule up and she more or less told me to shut up and do it.\nI had about 3 months on my certification and shortly after that meeting I get a referral for this program. So I happily set them up for their appointments but was also trying to move my lunches to later in the day. So I booked this patient at 12, the time when people from all departments came to eat lunch in the gym. \nI reminded the patient that intensity is the biggest part of this program is intensity of movement and vocalization. That means every exercise we do we count as loud as we can. \nNow here’s and aside: I coaches wrestling for 2 years in graduate school. If you’ve ever been to a wrestling meet, coaches aren’t quiet. And I’m one of the louder ones so I know how to project my voice.\nSo for the next 4 weeks, 4 days/week everyone’s lunch was interrupted by me doing this program that was so important for me to do at a volume that disturbed people in the front offices and the patient rooms. People couldn’t eat in the clinic and had to move their lunch places. The receptionists couldn’t answer the phones because all the people in the background would hear us me yelling “1!2!3!4!5!6!7!8!9!10”.\n\nMicromanager emailed a follow up to me after that and told me not to worry about renewing my certification for the program after that.",
        "created_utc": 1536686222,
        "upvote_ratio": ""
    },
    {
        "title": "This is awesome and gratifying",
        "author": "[deleted]",
        "url": "https://v.redd.it/b9n20bs8iml11",
        "text": "[deleted]",
        "created_utc": 1536682582,
        "upvote_ratio": ""
    },
    {
        "title": "Found on r/funny",
        "author": "[deleted]",
        "url": "https://i.redd.it/uovydasnkll11.jpg",
        "text": "[deleted]",
        "created_utc": 1536666406,
        "upvote_ratio": ""
    },
    {
        "title": "On why you shouldn’t lie about where you live when getting food delivered, and how I got a free meal",
        "author": "Fairleee",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/9ewqjp/on_why_you_shouldnt_lie_about_where_you_live_when/",
        "text": "This happened about a month or so ago. I live in the UK, and do delivery work on a part-time basis as a bicycle courier for a couple of food delivery platforms. Restaurants join them, customers place orders from the restaurants through an app or website, and then a courier gets assigned to deliver the order. The customer is charged a delivery fee, and the restaurant is charged a percentage of the order value in commission. The platform pays the courier a fee to deliver, and the rest of the earnings go to operations costs, and profits. On both of the services I work for, the couriers are self-employed, and on both platforms, the majority of couriers are on a pay-per-delivery model, which means you only get paid for each job you complete. However, because we are self-employed, we are given some latitude in what orders we accept, and we are allowed to cancel deliveries, as long as there is a good reason. When this happens, usually the customer is refunded, and the courier is free to dispose of the food how they see fit (of course, if you cancel too often, you’ll get kicked off the platform, so it’s not a good idea to do it without good reason).\n\nOn this occasion, the platform I was working for operates on a variable fee model, so that longer distances would get paid more, but short range trips would be paid a bit less. When you are assigned a delivery on the platform’s courier app, it shows you the address of the restaurant, and the address of the customer, as well as the designated payment for the trip. \n\nI was assigned a delivery from a mid range burger joint. I checked the order, and the trip was a very short range one - the address was in the city centre, about 300m away from the restaurant. As a result, the fee was only £3.85, the lowest amount the platform pays couriers under the variable fee model. However, for a delivery that would take less than 10 minutes to complete, I’d happily accept that. So I swiped to collect, and went to the restaurant, and picked up the order - a few burgers, a couple of portions of fries, and three milkshakes.\n\nI then swiped to start the trip. The app gives you navigation to the address, and also includes a small box with (optional) delivery instructions, if the customer wants to include any, e.g. “doorbell not working, please knock”. When I started the trip, I noticed there were some delivery instructions. In the instructions box was an address, and postcode - when I punched it into google maps, it brought up an address well outside the city centre, and also, importantly, a little outside the delivery radius (by a few hundred metres).\n\nNow, sometimes customers put in the wrong address by mistake - it happens. You order to a different location than usual, the app remembers it, and doesn’t always change back to your default address. People tend not to notice the address is wrong when they order. Usually when that happens, I’ll deliver to the changed address - it’s a pain, but I get that mistakes happen, and it doesn’t happen often. But, this was deliberate - this guy knew he was out of the area, and so had selected an address in the city centre, so the app would accept his order, and then put his actual address in the delivery notes. Usually when people pull this stunt they put the address at the closest point on the map that could be delivered to, and then message the courier that they in fact live a few hundred metres further down the road. However, because the fee we are offered is fixed at point of acceptance, if the order is further away, we don’t get paid any extra for the extra distance. So this guy was trying to make me do what would have been a three mile trip (the delivery radius is only 2.5 miles), for £3.85 - with traffic and road conditions it would have been around a 25 minute round trip. Not gonna happen.\n\nThis is where the malicious compliance comes in. Because we are self-employed, we are not employees. Effectively, each delivery we accept is a separate contract with the service, where they offer us agreed work, for an agreed fee. If the terms change after we have accepted, we are under no obligation to complete the work. Unlike an employee, they cannot make us deliver to the revised address. So, if the customer changes their address, although the service would prefer us to complete the order anyway, we are not obliged to. Therefore, I went to the city centre address the customer had entered as their location, and swiped on the app to say I had arrived. I then called the support line for couriers, and explained that I had arrived at the designated address, but the customer had let me know that the address had changed, and the address was in fact out of zone. The support staff asked if I was happy to go to the revised address, I told them I was not. They told me that was fine, and as I was at the assigned address, to swipe to complete the delivery so that I would still be paid for the trip, and I could dispose of the food as I saw fit. Sitting just down the road were a few other couriers - so, I swiped to complete the order, and the went to share my bounty with them, until my next delivery came through!\n\nAs for the customer? Well, per the Ts&amp;Cs of the platform, if the courier cancels the trip for reasons out of your control (if their delivery vehicle breaks down en route for example), then you get refunded. But, if the courier is unable to complete the delivery because of you - for example, if you aren’t at the address you designate - then the platform is under no obligation to refund you. Of course, out of a gesture of good will, they might offer you platform credit, but we couriers talk to each other, and we know not to complete deliveries out of zone, because it’s not good for us. So even if he got credit, if he tried to pull the same trick again, he was gonna end up in the same situation.\n\nTL;DR: customer tried to screw a hard working self-employed courier out of time and money by lying about his address to get his burger and shake fix. Instead, he paid for me and some fellow couriers to have a free meal. Cheers, guy!",
        "created_utc": 1536665743,
        "upvote_ratio": ""
    },
    {
        "title": "Where has JUSTNOMIL disappeared to?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/9eul8j/where_has_justnomil_disappeared_to/",
        "text": "[removed]",
        "created_utc": 1536641797,
        "upvote_ratio": ""
    }
]