[
    {
        "title": "I ain't even mad.",
        "author": "PMoneyAllStar",
        "url": "https://i.redd.it/8a8b4y9lij511.jpg",
        "text": "",
        "created_utc": 1529667928,
        "upvote_ratio": ""
    },
    {
        "title": "Want to throw your own dishes away? Sure, go ahead.",
        "author": "MonsieurScruffy",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/8t0ku5/want_to_throw_your_own_dishes_away_sure_go_ahead/",
        "text": "Not sure if this is more r/pettyrevenge or r/MaliciousCompliance.\n\nTL;DR: We move in with my grandma who refuses to listen to us, have a bad relationship with her. She throws away things without remorse, including dirty dishes that aren't washed immediately. We make sure the next batch of dirty dishes are  her own dishes. She picks them back out of the trash.\n\nI've never had a great relationship with my grandma; none of my siblings could ever stand her. She was always domineering but didn't have the guts to do things to our faces; always loudly complaining about us to her friends within obvious hearing distance. When the lease on our house expired and my dad was looking for new accommodation, my grandma showed up and pretty much waved a heavy and stout umbrella in his face, insisting that we moved in with her \"so she could take care of us\". (But we would still have to pay her a generous amount of rent.) My sister and I pleaded with my dad not to, but he eventually gave in \"because she's my mother\".\n\nWe move in, and not even a month in various altercations start. She complains that we have too much stuff. Consider that we have what is probably twice her stuff and quadruple the people. We stuff everything we can into this tiny storeroom, thanks to my dad's packing skills. Those she won't touch. But little things start disappearing after; the prized porcelain dish set that my dead mom bought with my dad two decades ago, my tiny mementos that i tucked inside my drawer, out of sight... And then we found them in the bin. No amount of pleading, arguing, convincing could get her to stop. The only things she wouldn't throw away were the things she couldn't physically lift by herself, and obviously nobody would help her. Guess why she left the storeroom stuff alone.\n\nWe get pretty sick of each other. At this point, we've already packed all our prized tableware away, and resolve to using only the cheap stuff that our previous landlord had given to us. My grandma proudly loads in her mish-mash assortment of random metal plates and plastic bowls. It looks like a freaking military cookhouse set. We've long learnt to keep our mouths shut and not argue, and just quietly retrieve anything she dumps into the bin and hope she doesn't find it again. That way we at least don't have to listen to her screaming about the house after every single time we poke holes in her logic. Literally her comeback every single time is (translated to English):\n\n&gt;Karma will bite you in the ass! Wait until you grow up and your children don't listen to you! If you're so unhappy why don't you move out? The sooner the better!\n\nIt hadn't even been two months since she threatened my dad to make us move in. Various little things happened, but basically she started to find fault with all our habits, like... not washing the dishes within 5 minutes of eating. Sometimes when you have a large meal, you just feel like leaning back in your chair and relaxing for a while, y'know? Oh no, not for dear old grandma. Everything has to be cleared *immediately*.\n\n&gt;Grandma: If you don't wash them immediately, I'll throw them all away!\n\nShe doesn't even bother to tell anybody. No \"can you go do the dishes now?\" We just walk in to do the dishes later and find them in the dustbin. We pick them out and wash them, and we're all pretty miffed. If we ignored her requests a dozen times and she does this; sure, we deserve such treatment. But it was the first time, and everything she did was pretty much out of sight. She would have thrown it away if we hadn't looked for the missing dishes.\n\nMy brother hatches a plan. We pick out her favourite dishes. Not the most expensive ones, just the ones that she uses the most often, and some of the new set that she bought. The next meal is cooked entirely with these tableware. Down to every utensil and plate. We finish eating, dutifully put everything into the sink, without washing them. Then we go back to the dining table, kick back, and relax. 15 minutes later we return to the kitchen and find my grandma staring at the pile of dishes. She looks at us. She looks at the dishes. She looks at us. She picks up all the dishes and dumps them into the bin.\n\nMy brother giggles.\n\n&gt;Go ahead. It's all your dishes. You like to throw stuff, we'll let you throw stuff. But don't touch our shit.\n\nHalf an hour later, she slinks back into the kitchen and quietly picks them all out of the trash. Guess her stuff isn't as expendable as ours.",
        "created_utc": 1529666757,
        "upvote_ratio": ""
    },
    {
        "title": "Deandre Ayton is definitely exercising some Malicious Compliance in this tweet! [x-post r/collegebasketball]",
        "author": "MiniHannibal65",
        "url": "https://i.redd.it/2ilh2arxsh511.jpg",
        "text": "",
        "created_utc": 1529647194,
        "upvote_ratio": ""
    },
    {
        "title": "#1 pick DeAndre Ayton is told what to put under his 1st sponsored tweet as an NBA Pro. Does as told.",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/CollegeBasketball/comments/8st0fp/deandre_ayton_posted_the_greatest_sponsored_tweet/?utm_source=reddit-android",
        "text": "[deleted]",
        "created_utc": 1529641803,
        "upvote_ratio": ""
    },
    {
        "title": "Kids will do the strangest things",
        "author": "cobigguy",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/8sygzo/kids_will_do_the_strangest_things/",
        "text": "[removed]",
        "created_utc": 1529641299,
        "upvote_ratio": ""
    },
    {
        "title": "Journalists aren’t allow to leak draft picks, but Woj found a way to work around that",
        "author": "[deleted]",
        "url": "https://i.redd.it/tmdihsu6cg511.jpg",
        "text": "[deleted]",
        "created_utc": 1529629455,
        "upvote_ratio": ""
    },
    {
        "title": "NBA draft malicious compliance",
        "author": "buriedbythesound",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/8sx1hs/nba_draft_malicious_compliance/",
        "text": "ESPN is covering the NBA draft this year and has a policy that none of their writers can confirm a pick prior to it airing, including the great Adrian Wojnarowski. \n\nAdrian has complied by identifying the pick but using words like focused or zeroed in on instead of confirming who will be selected.\n\n",
        "created_utc": 1529627687,
        "upvote_ratio": ""
    },
    {
        "title": "Sure I'll keep everyone in the loop.",
        "author": "micahamey",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/8swzqw/sure_ill_keep_everyone_in_the_loop/",
        "text": "I delivered very sensitive chemicals to other people and sections on site where I work. I do not hold that position anymore due to this incident. \n\nAfter getting a priority 1 delivery request for two pairs of new chemical, engineering requested there be a page sent (this is 2018 but we still use pagers) when I finished delivery. \n\nDelivery completed 20 minutes later I sent a page and went about my day doing much of the same. \n\nThe thing about this chemical is that it is time sensitive, once out of the freezer it has a shelf life of 24 hours or so depending on storage temperature. \n\nTWO days later I get an email;\n\nFrom: engineering person\nTo: Material Handler (me)\nCc: (mysupervisor)\n\nHey, just getting everything straight, we ordered this chemical priority 1. We understand there was an order made but we can't find it anywhere. Any information is greatly appreciated. \n\n••••••••••••••••••••••••••••••••••••••••••••••••••••••\n\nFrom: Me\nTo: engineering person\nCc: no one because I hit reply instead of replay all. \n\nHey, I delivered it (insert date and time). Have a good one, see you later. \n\n••••••••••••••••••••••••••••••••••••••••••••••••••••••\n\nFrom: engineering person\nTo: Material Handler (me)\nCc: (mysupervisor) (my entire chain of command) (practically everyone who could possibly be remotely related to the process in engineering)\n\nIn the future do not try to hide our correspondence Please keep correspondence in the pervue of everyone as this is an important matter.\n\nI would appreciate a better more descriptive explanation of events that would possibly lead you to think it was okay to just leave $28,000 worth of chemical without informing anyone on the receiving end, hold up production causing an additional $120,000 per day in hold ups, those two pails were the last on site as there were experimental. \n\n••••••••••••••••••••••••••••••••••••••••••••••••••••••\n\nFrom: Me\nTo: engineering person\nCc: (mysupervisor) (my entire chain of command) (practically everyone who could possibly be remotely related to the process in engineering)\n\nWasn't trying to hide anything sir, was attempting to inform you as quickly as possible.\n\nOkay, well here is a snapshot of the page I sent to you as per your instructions, sent (date and time of delivery) and here is the chemical location you asked for. Here is everything we have. For all intents and purposes it seems as though someone in your production team forgot to pick it up. \n\nHope all goes well.\nBye. \n\n\nIn the end he got released from his position, a total of $628,000ish lost in chemical and production time lost, and a pat on my back for doing my job correctly. I was releat from my duties as well but that's because they hired a bunch of contractors to handle deliveries so we could focus on our other duties. ",
        "created_utc": 1529627253,
        "upvote_ratio": ""
    },
    {
        "title": "Take some initiative and send a tech? Ok then.",
        "author": "McTouchButt",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/8swos9/take_some_initiative_and_send_a_tech_ok_then/",
        "text": "Had a customer call me freaking out, all of their systems are down and they're sick of having these problems. \n\nMe: So I see all of your systems are down, do you mind doing some troubleshooting with me?\n\nCx: Fine *grumble grumble* You know we're having these problems all of the time, you just need to make this right and give us a new system. \n\nMe: Right I just need you to go ahead and take a peek at the router and switch, please ensure that they are plugged in tightly at both ends.\n\nCx: yes they're plugged, why don't you take some fucking initiative and send me a fucking tech, I'm sick of this shit, it's your problem blah blah blah. \n\nAt this point I mute the phone and confirm with my manager that I'm going to make this TWO HOUR trip and tell the customer that I'm on my way...\n\nNow the last time this customer pulled something like this they expected it to be free. Anyways I make the two hour trip, I liked it, got to drive and get paid while jamming out. \n\nPull up to the shop, walk in and sit directly at his feet, grab this girls belongings and move them off of the switch....lo and behold IT'S NOT PLUGGED IN. \n\nPlug it in and look right at his face and say it's fixed, that will be the trip fee...He didn't have shit to say about cutting a check this time around..... A couple hundred bucks to plug in a switch, good times. ",
        "created_utc": 1529624425,
        "upvote_ratio": ""
    },
    {
        "title": "Wife got on to me for never replacing the toilet paper on the stand so now I freeroll it so I’m never at fault. I know this is minuscule but does anyone else do this so they don’t have to replace the roll on the spinner?",
        "author": "[deleted]",
        "url": "https://i.redd.it/10ug0xgrmf511.jpg",
        "text": "[deleted]",
        "created_utc": 1529620902,
        "upvote_ratio": ""
    },
    {
        "title": "Wake me up to read a sign on the bus? I will.",
        "author": "BigDrew923",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/8sw3iu/wake_me_up_to_read_a_sign_on_the_bus_i_will/",
        "text": "This happened about 11 years ago.  I used to commute to school and back via public buses.  My bus transfer is the first stop of this particular route while my high school was the last stop, and vice versa.  Many students at my school did the same morning and evening commute, so the seats of the bus are usually taken by students like me.  Many of the non student commuters did not like this, but we all pay the same fares so tough luck.\n\nOn this evening commute, I took the first non handicap/elder seat, and sat in the inner seat.  One of my friend sat on the outside seat next to me.  This commute is almost an hour long, so I fell asleep with headphones on while my buddy is playing Mario Bros on his DS.  Halfway through the trip, I felt someone pulling my shirt.  I thought it was my friend, and here's where the story starts.  Me=Me, F=Friend, OG=Older gentleman.  \n\nMy headphone gets yanked out of my ear\n\nMe: \"What the fuck F?\"\n\nF: \"Uh, that wasn't me.\"\n\nMe: \"Huh?\"\n\nI look around and I see this older gentleman grabbing my shirt to wake me up while reaching over F as he stood next to him.   He noticed that he finally got my attention.\n\nOG: \"Kid, can you read what this sign next to you say?  Do you understand English?\"\n\nStill groggy from waking up suddenly.\n\nMe: \"Which sign sir?\" \n\nI thought he wanted help to understand a specific ad on the bus\n\nOG: \"This one\" \n\nLooking smug, he pointed at a blue handicap sign that states the seat must be available for wheelchair or a person with disability.  However, this sign was next to the seat in front of me.  I thought he wanted my seat since the bus was full and he mistaken thought all seats had the same rule, which I didn't mind getting up for.  But as I stood up to offer my seat, I saw the bus was half empty with at least half the elder seats available in front of me.  Then it dawn on me that he targeted me specifically as he did not say a word to my friend who was sitting next to me, and he reached over him to wake me up.\n\nMe: \"This sign?\" \n\nI wanted to make sure as I stood up\n\nOG: \"Yeah, hurry up and read it\"\n\nMe: \"These seats must be vacated when wheelchair users need this space.  Good?\"\n\nOG: \"Yes good, now what you going to do?\"\n\nStill standing while half asleep, I did a stretch and sat back down.\n\nMe: \"Nothing, so fuck off\"\n\nI put my headphone back on and went back to sleep.  F burst out laughing.  I didn't wake up until my stop and by then OG is gone.  I heard later from F that OG started to swear at me but saw that I was intentionally ignoring him.  So he took a seat up front in the elder section and glared at me until he reach his stop.\n\nI still don't know why he targeted me, but I hope me being a different race from him wasn't part of the reason.  \n\n[Here's a pic of exactly the area I sat at.   I was in the inner seat of the row on the left.  The blue sign is what I read](https://sfbay.ca/home/wp-content/uploads/2016/08/20160805_155005-751x563.jpg) \n\n\n",
        "created_utc": 1529619431,
        "upvote_ratio": ""
    },
    {
        "title": "Just Following Protocol",
        "author": "bobafett8192",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/8sutlf/just_following_protocol/",
        "text": "[removed]",
        "created_utc": 1529609715,
        "upvote_ratio": ""
    },
    {
        "title": "Innocent Malicious Compliance",
        "author": "wilbertman",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/8sujhw/innocent_malicious_compliance/",
        "text": "Always thought I would only be a lurker of this sub, but realized I have a story that fits. \n\nWhen I was about 7 and my sister was 5, my parents got ambitious one summer to redo every floor in the house. My bedroom and my sister’s bedroom got carpet, then the living room got wood, all put in by contractors. The rest of the house was tiled by my parents over the course of a solid three weeks. \n\nMy dad ran the saw and laid (cemented?) the tile into place, then my mom would come in and grout. For those that don’t know, grout is the colored mortar you see in between the tiles. Now, I’m not sure if the method has changed, but as your putting down grout, you have to wash away the excess on top of the tiles before it dries. My mom did this with a bucket of water and a sponge, and it was my sister and I’s job to go empty the buckets in a big open topped tank outside my dad had set up, and refill them with water. \n\nWe were very excited to help out at first, but needless to say were pretty tired of running big buckets of water around after a while. My parents noticed this and decided to sweeten the deal and take us to an amusement park near us once the whole house was done. This put a little pep in our step, but we were still getting exhausted by the end of the days. After three weekends working all day both days and a few weekday nights after school, it finally came down to the last day and the last section of tile. \n\nOnce my mom was done she said to my sister, “Now [sister’s name], I want you to take that bucket of water and just chuck it!” meaning into the tank, of course. My sister took that very literally and chucked the entire bucket of dirty water over the entire newly grouted dining room. My mom couldn’t do anything but burst into laughter. ",
        "created_utc": 1529607552,
        "upvote_ratio": ""
    },
    {
        "title": "Want me to stop correcting his work? Aight, I will",
        "author": "Thrazkh",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/8su5kq/want_me_to_stop_correcting_his_work_aight_i_will/",
        "text": "So right out of university I was hired by what is still my current employer. During orientation week I encounter this other individual with similar credentials who seemed confused by .. pretty much everything. Let's henceforth call him **N**. N looked taken aback when we were given our forms to apply for company credit cards, he didn't understand having to fill out a form for reception of our laptops (which merely required a signature) and just generally seemed out of place in an environment that required any kind of rational thought ... or thought in general.\n\nI was rather surprised to realize that he had applied to work in the same department I was hired to. So after this week we were being assigned our first \"Junior Project\" (basically a normal project in my kind of job with an experienced consultant making sure that we don't fuck up too badly). \n\nBasically since we both knew shit about the trade the Senior made sure to put out small work packages for us to complete in order to bring the project to a satisfying go live. I completed mine with some difficulty, but always to some level of satisfaction as I like to think now. He ... didn't do so well. He wasn't a terrible or evil person, he was just utterly, utterly stupid. \n\nI wouldn't have minded so much, but whenever he fucked up at something, it's the project that suffered, and since I just got fresh out of university I was very eager to prove myself.\n\nSo whenever he was asked to complete something and I could gather that he was completely overwhelmed by the simplest tasks I simply did his work for him and reported my results to our senior. \n\nI have always been given props for my work, but have been reprimanded for not \"giving him a chance\". I don't hold it against the senior, he clearly just wanted to give us both a fighting chance and didn't experience the utter stupidity I did as I was working with N the whole time in the same office.\n\nAfter a few iterations of this I was told to stop doing his work, so I did. I kept to what I was assigned to, turning a blind eye to half of the features not working at all or being implemented incorrectly.\n\nAround Integration Testing time the customer was extremely annoyed by half of the stuff we promised not working. The gist of the matter was that the senior had to do an allnighter to implement all of the features that weren't done (which were 100% Ns and 0% mine). Again, I don't hold it against him, he was just trying to give both of us a chance and he apparently couldn't gather how completely incompetent N was. \n\nN has since left the company within 4 months of his trial period after a \"consensual\" decision between him and our management and I have experienced the freedom of working with competent people since, absolutely loving my job and the possibilities for growth.",
        "created_utc": 1529604752,
        "upvote_ratio": ""
    },
    {
        "title": "University lecturer tells me to delete half my presentation",
        "author": "Destroyer383",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/8stliq/university_lecturer_tells_me_to_delete_half_my/",
        "text": "This happened a few years ago, when I was in my final year of university. I had a fairly large group project that was the majority of the grade for that paticular module. The project consisted of researching some data, to answer one or more questions we come up with and do a 20 minute presentation. We decided to ask/answer four questions about our dataset.\n\n\nWe finish answering the questions and make our presentation, which turns out to be a lot of slides but not very much time spent on each slide. The week before the presentations take place, we have a opptiunity to get some quick feedback from the module lecturer. So when we open it up to show it to the lecturer, the first thing he says is \"It's too many slides, cut out the last two questions\", I try to reason with him, explaining that we go through the slides quickly. He insists that he won't even look at it untill we delete the 2nd half, so we lose our oppitunity to get any feedback. \n\n\nThe next week we give our presentation, and finish after about 10 minutes, before we move on to questions, the first question is the module lecturer asking \"Why is it only 10 minutes long, you have left far too much time for questions\", I reply with \"Well originally we timed it to be about 20 minutes long, unfortunately we were instructed to delete half of it\". He sat there for a moment in silence looking confuised, before realising that it was him that told us to delete it, then just replied \"Ok then\". \n\n\nThe previous groups before ours had some really difficult questions asked about techniques used in discovering these answers, but despite our extended question time, he only asked a few simple questions after that. I like to think my reply knocked him out of his flow.\n\n\nI was prepared to go above his head if he penalized us for a short presentation, but I ended up getting a 1st for that project, so it all worked out in the end.",
        "created_utc": 1529600747,
        "upvote_ratio": ""
    },
    {
        "title": "You can be on your phone, tablet, or computer, but no studying and no computer games.",
        "author": "4twentynope",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/8stdo0/you_can_be_on_your_phone_tablet_or_computer_but/",
        "text": "So I have this job, see... This is a job with a lot of down time. When I DO have work to do, it needs to be done quickly and without any mistakes, because these mistakes are costly. Needless to say this is a skilled job.\n\nSo, when i have downtime, I am allowed to browse my smartphone, tablet, or computer.  Note that these are all my own devices, not company issued. There is no company software on them, and no security risk associated with using them on the job. \n\nSo when I started working here, I was told these rules, and I've always thought they were stupid. If I've proven my ability to get shit done when it needs to get done, why should it matter if I spend downtime browsing reddit on my computer or playing a computer game? Why should I matter whether I'm reading for pleasure or reading to study?\n\nAt any rate, I've taken these rules to heart and now I play emulated games on my smartphone, and I use a tiny Bluetooth controller to play so I can relax while doing so. I also spend the rest of my downtime watching YouTube videos that are incidentally related to the subject I want to study to get a better job, because there's a lot of other shit that's fucked up about this place which I'm not going to mention here.\n\nSo when I leave in a few weeks with a much better paying job, I will have this hypocritical asshole employer to thank.",
        "created_utc": 1529599218,
        "upvote_ratio": ""
    },
    {
        "title": "All of these easily resolvable problems are none of my business? I don't know what I'm talking about? I have no authority? By all means then, solve them yourselves.",
        "author": "MyUsernameIsFree",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/8ssps7/all_of_these_easily_resolvable_problems_are_none/",
        "text": "Sorry for the long post... TLDR at the bottom. Might have started ranting a little bit, but life's been pretty crappy for me.\n\nHello, first post here. So let me clarify. My mother died about 6-7 months ago. IMO she was the last good person in my entire family. I'm mainly over it as sad as that sounds, but its an important detail when I discuss the rest of my family. See, my father is always hesitant to criticism, and does not like it when I propose any sort of rule in the house. My sisters are very entitled. They like to do whatever they want, with little regard for other people. I can see as an observer on the outside that this is due to a sort of negative emotional feedback loop. Very easy to fix, just love and respect each other right? Wrong. Here is how a conversation with my dad goes about my sisters.\n\nDad: You need to take better care of your sisters. Look at them.\n\nMe: Alright, how about rules X, Y, and Z that I've based off of common sense and actually reading child psychology books?\n\nDad: Look, you don't know what you're talking about and its none of your business. I make the rules around here and if you don't like it there's the highway. Unless you want things my way.\n\nAnd it doesn't end there. If I so much as attempt to get my sisters to do anything, they start blaming each other for everything and then tell me off. As such:\n\nSister A: Sister B and C did nothing around the house, I cleaned it all today.\n\nMe: Well I noticed some spots here and there so you didn't clean everything but that's okay. I also doubt you did it all yourself. To avoid this in the future how about you guys make chore lists and stick to them? It's alright every once in a while to cover for someone doing their homework, or to not do the chores at all to finish your other responsibilities. Not the end of the world.\n\nSister A: Look, I do everything in a certain way. It doesn't matter what you think is the right way, because it won't work. Besides, you have 0 authority, dad tells us what to do, not you. \n\n(Previously, the excuse used to be that I wasn't their mother, who tried to give me authority to make good rules in the house, but they still wouldn't listen.)\n\nThere is absolutely zero order in this household, and zero respect for anyone else. I've resorted to just sticking around in my room to get away from the negativity when I'm at home. But that leads to conversations like these:\n\nDad: (barging in without knocking, like he does always) Listen OP, your life really needs to change. You need to get off your (book, phone, computer, literally doing nothing at points in time) and get out of your (room/bathroom, either or) because you have a family that loves you. This life really needs to change.\n\nMe: You're 100&amp;#37; right dad. (Totally unenthusiastically and shut the door when he's out.) \n\nSometimes he'll pull one of these:\n\nDad: Your sisters never have any idea when you're home. They think you stay in your room way too much. Isn't that pathetic?\n\nMe: Well dad, they've been in their rooms pretty much all day too. You never let them go out, anyways.\n\nDad: You don't know what you're talking about.\n\nSo now here is where the malicious compliance comes in. This has depressed me and dragged me down for a long time. I call my aunt, the heaven-sent saint that she is, and this is the gold that comes out of her mouth:\n\nAunt: Well, if no one is listening to you, just back off. If they say you don't have any authority whatsoever, then just act like you don't. If its none of you business, it really is none of your business, they can apparently deal with it. If you don't know what you're talking about, then apologize and keep it to yourself, they probably wouldn't have listened anyway. Just be sure to remind them you love them. Go blind deaf and dumb and just focus on yourself for a while. I love you.\n\nI've followed that advice to a tee for the past two or three weeks, and I've never been happier. It's actually funny because now my sisters come to me to settle their arguments and I have to remind them that it isn't my business, and I have no authority over them. As for my dad, old habits die hard. If life continues the way it is with them I'm probably moving out soon. No reason to be unhappy because of other people. \n\nTLDR: Sisters and dad refuse to let me have any authority whatsoever, keep telling me their problems aren't my business, and that I'm stupid and have no idea what I'm talking about. I take some stellar advice from my aunt and finally listen to them, stop trying to help at all.",
        "created_utc": 1529594391,
        "upvote_ratio": ""
    },
    {
        "title": "You want me to fix it instead of me selling you a rebuild one?",
        "author": "Yvels",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/8sro6g/you_want_me_to_fix_it_instead_of_me_selling_you_a/",
        "text": "Its been years ago so if something doesn't add up: sorry in advance.\n\nWorking in a computer store (small owner) so we tried our best to offer the perfect service we could to retain customers.\n\nI had a lady come in with an old 1st gen P4 (one core), not enough ram, old hard drive; whole package to make work on this thing as painful as possible. Its to upgrade it and make it faster and clean-it up: dust and software; whole package.\n\nI'm all in for a service of this magnitude; I still tried to tell her that we just received some great PC's that might cost her less overall and make it even faster because CPU is more recent and whatnot.\n\nI received a tantrum on how I'm trying to sell her something she didn't need and I should be ashamed of myself etc.. Well, I apologized (customer is always right) and told her we will do everything she asked and I'll throw in 10% loyalty discount to make it up for my attitude. This calmed her down and she left.\n\nOverall total service on this thingies was over 600$ including her discount. I confirmed the amount with her and we completed the job. We even cleaned outside of the case to make it shiny and new.\n\nThe part that make us laughing like crazy for the rest of the day: she came in with her office it tech so he could verify that the job was well done.\n\nFrom the start he asked why the hell would she want to upgrade this \"fossilosaurus\"? Its amazing seeing someone so full of themselves lose all their rightfulness attitude. It didn't help that I included the estimate for rebuild system and mention \"refused by customer\" attached to the invoice.\n\nIt was glorious. I didn't have to make it clear to her that she wasted a couple hundreds on absolutely nothing; this guy did it very well. Some upgrades couldn't even be salvaged because not compatible anymore.\n\nCherry on sundae: we gained a new customer. IT guy liked that we tried to push a sale and lose on service to make it right. We started supplying stations to the whole company (about 100 users).",
        "created_utc": 1529586173,
        "upvote_ratio": ""
    },
    {
        "title": "Try to help petrol station owner, but get told to shut up. Get very cheap fuel due to malicious compliance.",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/8srnwv/try_to_help_petrol_station_owner_but_get_told_to/",
        "text": "[removed]",
        "created_utc": 1529586108,
        "upvote_ratio": ""
    },
    {
        "title": "My dog isn't allowed to take her indoor toys outside",
        "author": "[deleted]",
        "url": "https://i.redd.it/eo9koy7vqc511.jpg",
        "text": "[deleted]",
        "created_utc": 1529585962,
        "upvote_ratio": ""
    },
    {
        "title": "Pain",
        "author": "[deleted]",
        "url": "https://youtu.be/c1JqON4H4JU",
        "text": "[deleted]",
        "created_utc": 1529585703,
        "upvote_ratio": ""
    },
    {
        "title": "Software “update” leads to unintended consequences",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/8sr9pl/software_update_leads_to_unintended_consequences/",
        "text": "[deleted]",
        "created_utc": 1529582323,
        "upvote_ratio": ""
    },
    {
        "title": "Boy, 16, sent home from school for wearing shorts arrives back in a dress. (Link)",
        "author": "AlbaDdraig",
        "url": "https://www.mirror.co.uk/news/uk-news/boy-16-sent-home-school-12751025",
        "text": "",
        "created_utc": 1529579100,
        "upvote_ratio": ""
    },
    {
        "title": "Is there a sub for fictional MC?",
        "author": "SabeyTheWolf",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/8sqvt6/is_there_a_sub_for_fictional_mc/",
        "text": "[removed]",
        "created_utc": 1529578297,
        "upvote_ratio": ""
    },
    {
        "title": "Why My mother Banned Me From Superglue",
        "author": "LuvliLeah13",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/8sq8no/why_my_mother_banned_me_from_superglue/",
        "text": "Growing up, my younger brother and I had bunk beds.  I had the top bunk because oldest makes the rules.  One delightful day I hopped outta bed directly onto some stupid LEGO car which had been my brothers crowing achievement of the week.  Justifiably enraged by being hobbled, I smashed the thing to smithereens.  \nNow bro comes down to breakfast whining about his hard work being smashed, while I’m told by dad that stomping it wasn’t fair and not to break apart or mess up his legos anymore.  Since I have no control over where my brother puts them and it’s a scientific fact that LEGOs are feet-seeking land mines only one practical solution came to mind.  I would make sure they never came apart again.  So once I had enough time, I carefully took off each piece, applied the super glue, and put it back.  Since he didn’t have LEGO kits, the car needed to be salvaged for parts for his next build.  As he began the demolition, The look of disbelief and rage washed over his face like rain on a desert.  The authorities (parents) were alerted to my crime and passed down a judgement that I was to use a hammer to break them apart, and I was no longer allowed to use the super glue. I went outside and broke it apart happily and with much evil laughter as a celebration of my genius.  \n\nAnd now I (a grown ass woman) am still not technically allowed to use the superglue, rather the rules are no longer enforced.  Worth it.",
        "created_utc": 1529570240,
        "upvote_ratio": ""
    },
    {
        "title": "It's not a box cutter",
        "author": "[deleted]",
        "url": "https://imgur.com/a/VS9PDk3",
        "text": "[deleted]",
        "created_utc": 1529569267,
        "upvote_ratio": ""
    },
    {
        "title": "I need to send pictures of my ticket stubs to keep my MoviePass membership? Well then expect to see me peeing at the urinal every time.",
        "author": "BackpackingDrummer",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/8sp21t/i_need_to_send_pictures_of_my_ticket_stubs_to/",
        "text": "\nIf you’re not familiar with MoviePass, it’s a subscription service to use at your local theater. Basically, you pay $10/month and they send you a debit card that they preload with the money to see a specific movie. You go to the theater, check in on their app (which is location based so you can’t cheat), and then you can go to the specific movie you’re there to see. \n\nThey’re extremely particular about this: for example, you’re banned if you use it to buy concessions, buy a ticket other than a normal 2D showing, or try to use it more than once a day.  \n\nWhen I joined, the deal (which was getting a lot of media at the time) was that for $10/month, you could go see 1 normal movie a day. \n\nThey keep changing the terms and conditions though. Even though I got grandfathered in, they’ve now changed new memberships to only being able to see 4 movies a month. On top of that, even though my promotion still works, I’m now not allowed to see the same movie more than once, AND they now require you to take a picture of your ticket stub  and upload it to prove that you bought your ticket. \n\nSo now, every time I get my stub, I head to the restroom for the pre-movie pee, and take a picture of the stub directly in front of me peeing in the urinal. Someone at MoviePass is going to have to look at a picture of me peeing every time I go see a movie. ",
        "created_utc": 1529556041,
        "upvote_ratio": ""
    },
    {
        "title": "A well defined heel",
        "author": "checker280",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/8so7jn/a_well_defined_heel/",
        "text": "This is an apocryphal NYC Union story. I would like to believe it was true. OSHA rules states we need to wear a shoe with a well defined heel to prevent our feet from slipping off ladder steps and pole steps when working aloft. Problem is, not all of us work a loft, so wearing steel toed, fiberglass shanked boots with a well defined heel all day is a literal pain. One worker who worked mainly in the projects preferred to wear sneakers much to his foreman’s consternation. The two of them butt heads daily but given the worker’s seniority and experience, there wasn’t much the foreman could do without negatively affecting his completion numbers. \n\nOne day the worker, a burly construction worker type came wobbling into the foremen’s office wearing bright red pumps with stiletto heels. He calls out to his boss “how about these heels? Well defined enough for you?” The crowd loses it and the louder we laugh, the angrier his boss gets. “Son of a b..., get out! You are suspended. I don’t want to see your face for a week!!” The worker throws down his pumps and runs out of the office. And eventually the laughing stops and the room goes quiet until 10 minutes later when the work day officially started and the shop steward casually explains “you can’t suspend the guy based on what he chooses to wear on his own time”. \nThe foreman starts sputtering again and runs out to the parking lot but the worker is long gone. The foreman tries to call him but he’s not answering his phone either. During the week, the foreman drives by the worker’s home but he’s not there and nobody has seen him. \nThe following Monday, the worker shows up with the Stewards in tow and they successfully fight to get his back pay. \n\nEdited: spell checked stewards",
        "created_utc": 1529547975,
        "upvote_ratio": ""
    },
    {
        "title": "Too Much Information",
        "author": "cheryl333",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/8so66r/too_much_information/",
        "text": "I worked for a retail store that had a bridal registry.  If someone purchased an item from the registry, there was a very detailed form to fill out.  This included the purchaser's credit card number, exp date and other personal information.  If I were the person buying, I would not want my credit card info written down on a form that is sent all over the company for many eyes to see, so I started leaving parts of the form blank.  I also felt part of the form that wanted a \"story\" was senseless and left it blank also.  They wanted me to tell them anything I knew about the purchaser in this space (ex:  was this the bride's mom, sister, etc.).   Within an hour of me deciding that I was not going to fill out personal info beyond name and phone number, I was called into my bosses office.  She said I was to fill out every blank and if I dared to so much as leave the \"personal story\" empty, I would get a written warning.   (I should also say that this was in the 90's, before people were aware that we were sending their credit card info all over).  So I went back out to the floor and had my first bridal sale.  I filled out the \"paid cash\" for their credit card number knowing they had no way to cross reference, then I went to the story, and I went to town.  My first story went something like this:\n\nThis purchaser, while not directly related to the bride, is in the bridal party.  She is very worried about the wedding though because she fears the bride and the groom are not a good match.  She is also afraid that she wont fit into the dress because she recently found out she was pregnant.  She is contemplating if she should tell the bride now, or wait to see if she fits into the dress or not.  She also told me she is driving a red car and if you want to follow her home after, she will be heading south on mall road.  \n\nI got written up for providing them a bridal story....  hehe  I still permanently refused to fill out people's credit card numbers onto the written forms and they never caught onto me doing it.   I am sure that these days, they would never send credit card info to at least three different departments in two cities.... ",
        "created_utc": 1529547627,
        "upvote_ratio": ""
    },
    {
        "title": "It could have been a mistake, but...",
        "author": "Crashman2004",
        "url": "http://imgur.com/TnyR9BL",
        "text": "",
        "created_utc": 1529547278,
        "upvote_ratio": ""
    },
    {
        "title": "All he needs is to tag #BlackOps4 and #CallOfDutyPartner",
        "author": "LeonidasTMT",
        "url": "https://imgur.com/TnyR9BL",
        "text": "",
        "created_utc": 1529546745,
        "upvote_ratio": ""
    },
    {
        "title": "User sends all caps, condescending email demanding I do something I know will do the opposite of what she wants. So naturally, I did what she asked",
        "author": "TooMuchPants",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/8snyno/user_sends_all_caps_condescending_email_demanding/",
        "text": "I'm a Sysadmin at a medium sized company.  I'm going to try to keep the terms vague because I know some of my coworkers browse this subreddit.\n\nAlso, keep in mind all of the correspondence here is emails directly to me instead of IT tickets which she is supposed to do.\n\nI'm responsible for creating new users in all our systems when they're hired.  Our department policy is a 48 hour turnaround on new users, but the first thing I walk into this morning is an email from a user saying she has a new person starting and needs it done by 9:00 am so they can start working.  A little irked by this, but whatever.  Sometimes emergency hires happen so I go ahead and just make the user.  She is very specific in the new hire form that this user needs to be able to be assign work orders in one specific software we use.  She says they have over 50 work orders waiting and they need to be assigned to this person immediately.\n\nIn this software, there's lots of permission levels, but the ones we care about we'll call \"Regular User\" and \"Vendor\".  I make this user a vendor because that's the only permission that can be assigned work orders.\n\nAround noon, we have a network outage at one of our satellite offices, so I run over there and I don't get to emails for the rest of the day.  I come back around 5:00 to two emails from this user.  The first one is at about 2:15 pm and basically says \n\n\"Hello, can we make the user a \"Regular User\" in the software?  They need access to more features that vendors can't get to.\"\n\nThe second email was at about 3:30 pm.  It had my director and her director copied on it.  I'm going to just quote it directly (yes, the words in caps were really in all caps.  This user often sends emails in all caps):\n\n\"I really need this user to be a \"Regular User\" in the system NOW.  They NEED access to features x,y,z.  I emailed you about this OVER AN HOUR AGO and have heard no response.\n\nCan you please give me details about who I need to contact to get this done.  I don't understand why this is such a hard request.\"\n\nNow, I know they don't want this person to be a \"regular user\" in this software.  Not only can you not assign \"regular users\" work orders, it will delete all work orders currently assigned to them if I change them into a \"regular user\".  I know a work around where you create two users, and only put an email address in the vendor user, but leave the regular user email blank, but she was very specific in her email about what she wanted me to do.\n\nSo, naturally, I changed their permission level to \"regular user\" and replied to the email\n\n\"Apologies for the delayed response on this; I was out of office all day troubleshooting a network outage.  The user is now a \"Regular User\" \"\n\nThis is probably going to mean 2-3 hours of work for this person to recreate all 50 of those work orders from scratch.  And it's also probably going to mean a meeting tomorrow with both our directors.\n\nBut it was worth it.",
        "created_utc": 1529545680,
        "upvote_ratio": ""
    },
    {
        "title": "DeAndre Ayton was paid to write a tweet with specific hashtags, so he did",
        "author": "orda_GO",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/8snxad/deandre_ayton_was_paid_to_write_a_tweet_with/",
        "text": "[removed]",
        "created_utc": 1529545337,
        "upvote_ratio": ""
    },
    {
        "title": "\"every minute accounted for\"",
        "author": "arachnophilia",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/8snw5r/every_minute_accounted_for/",
        "text": "we got a new manager a while back, and it's been kind of clear from the start that he doesn't really know what we do here. he worked at amazon previously, and he thinks we're amazon. we're not amazon. since he started, it's been change after change that just inconveniences and annoys the people who work here, and has driven some of us old die-hards out.  \n\nlike some previous people in that position, he's in love with numbers, metrics, and productivity tracking. which is all useless if you don't really understand the process, and what you should or shouldn't be tracking. for instance, \"units\" doesn't really make sense if your units aren't uniform; merely counting doesn't give you a good picture of productivity if some units take way longer and way more raw materials. but count the units we must. i was already tracking this as a side effect of tracking my much more useful metric, that i actually use for estimating raw materials needed and such. it's also a bit nuts because we don't actually have the software to make all this work -- we're literally doing it by hand, some with pencil and paper, some with excel spreadsheets.\n\nthe latest fascination is with logging our work. direct labor hours, indirect labor hours, what we were doing, etc. i've objected to this basically from the beginning. it's pointless, and they're just going to use the data to hurt us more but cutting people or moving them around more than they already have. my direct supervisor was out last week, and she told me to fill out the productivity trackers for that week. i didn't, because it was the second busiest week of the year for me, and as i told her, \"i have too much *real* work to do.\" when she came back on monday, she wasn't too happy about it -- she needs it for her pointless meetings, which have been turning her into a real micromanager. she caught me part of the way into monday, so i filled out a sheet that looked like this:\n\n|time started|time finished|direct labor|indirect labor|task|\n|:-:|:-:|:-:|:-:|:--|\n|8:00|8:30||0.5|meeting|\n|8:30|12:30|4||my job title|\n|12:30|1:30|||LUNCH|\n|1:30|5:20|4||my job title|\n\nmy job is complicated, and composed of a million little tasks, which i'm usually doing several at a time. i confirmed with the (also new) training coordinator that basically my entire job short of meetings counts as direct labor. i'm actually producing things, and everything i do goes into that. but monday night, i realized i could really drive this point home. when my boss was telling us about these sheets before, she said that we needed \"every minute accounted for.\" we couldn't be slacking off in the break room, or chatting with coworkers, etc, it all had to be in one of the two labor buckets. i'm sure you see where this is going.\n\ni accounted for every minute. mostly one by one. mostly *half* minutes, as my myriad little tasks don't take too long. tracked all the interruptions. everything independently. hell, i tracked my bathroom breaks.\n\nmost people hand in a sheet that generalizes, or puts things into large categories, because they're doing the same task all day. their lists, if they look really productive, are half a page, 3/4s max. yesterday, i turned in *nine pages* of productivity tracker. my boss didn't comment; she didn't get around to seeing it. so today i handed in another *seven* pages. she stops me as i'm handing it in.\n\n&gt; **boss**: ...i meant to ask you. what the hell is this?\n\n&gt; **me**: productivity tracker. you wanted every minute accounted for.\n\n&gt; **boss**: not individually! not every thirty seconds! how much time did you waste on all this?\n\n&gt; **me**: i think this whole thing is a waste of time. but i'm just trying to do what they want. they want information about what i'm doing, that's what i'm doing.\n\n&gt; **boss**: i think you're taking this a little personally, everyone has to do this. you're being an ass about it.\n\n&gt; **me**: well, look. it really feels like they don't trust me to just do my job. this is a skilled position, one i've trained for. one i have an education in. i've been here five years, i'm not some temp you pulled off the street. all this stuff i listed, that *is* my job. i'm pulled in a million different directions all day, and if you want specifics, that's what specifics look like.\n\n&gt; **boss**: you can generalize a little, like this bit here...\n\n&gt; **me**: i can generalize the way i did on monday.\n\n&gt; **boss**: well, we still want specific tasks, like, list this task from this time to this time, then this task...\n\n&gt; **me**: i'm usually juggling a bunch of things. you want me to just do one thing at a time? that'll hurt productivity way worse...\n\n&gt; **boss**: well, just generalize somehow...\n\nso the question is, what do i turn in tomorrow? back to two blocks of \"job title\"? do i just photocopy that and turn in a weeks in advance to save productivity? something else?\n\n**tl;dr: they don't actually want every minute accounted for.**",
        "created_utc": 1529545031,
        "upvote_ratio": ""
    },
    {
        "title": "Inspired by the sports post, here is my witnessed Malicious Compliance.",
        "author": "theenigma31680",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/8sned3/inspired_by_the_sports_post_here_is_my_witnessed/",
        "text": "My daughter plays 8U softball.  We had our last game of the season and we ended up having to play against an asshole coach.  It never ends well when the coach starts the game by walking up to the ref and saying \"I heard about you before...\"  To which our ref replied \"You too.  I heard you were a dick.\"\n\nEvery play is being questioned once play starts.  Its getting out of hand.  Well we make it to the last inning and the old rule book (which had been changed at the start of this season) was what he was going by.  This year, they implemented a 5 run inning per team.  The ump called the other team off the field when they got 5 runs in the top of the last inning.  These 5 innings tied the game.  Our girls take the field and he storms out.\n\nHe is in our umpires face (which is a woman no less) and screaming that wasnt the rules.  She calmly explained that the rules were changed.  He demanded that his girls take the field and continue play.  After more nos back and forth, She put her hand up and ejected him from the game.  He wasnt having any of that and the screaming got worse.\n\nNeedless to say, parents are upset.  See, 8U teams score doesnt matter and all teams play the tournament.  Parents are screaming to let them play.  Finally, one parent on this irate coaches team walks up and pulls her three kids from the field.  They get in their car and leave.  \n\nAfter seeing this, the umpire walked out past home plate and waved her arms in the air signaling the game was over.  She said loudly, game ends in forfeit.\n\nThat coach is up again screaming why?  She looked at him and said, \"Rulebook states teams must have a minimum of eight players.  You have seven.  Also, those players left.  Roster changes mid game MUST be approved by an umpire or the game must be forfeited.  There are two reasons.  Your team loses by forfeit.\"\n\nHe starts screaming that the game ended in a tie so its just a tie.  She said \"no, its a loss.  Remove your team from the field.  I am going to have a hot dog.\"   \n\nMost entertaining game of little league softball all season.",
        "created_utc": 1529540496,
        "upvote_ratio": ""
    },
    {
        "title": "You will never reach the ground if you fall from an infinite height",
        "author": "UnthawedAge",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/8sn3jm/you_will_never_reach_the_ground_if_you_fall_from/",
        "text": "[removed]",
        "created_utc": 1529537784,
        "upvote_ratio": ""
    },
    {
        "title": "Undo my work behind my back? Enjoy getting out ridiculously late tonight.",
        "author": "a-song-of-icee",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/8smq98/undo_my_work_behind_my_back_enjoy_getting_out/",
        "text": "Tl;dr: Manager undoes my work behind my back, then says I can't do it until a certain time, ensuring we'd get off really late. I work super slowly in revenge. Then she does the same work also early (10 mins early). So I undo her work. We later talk and somewhat work it out, I work at normal pace again, and she does the original work and helps me with extra areas.\n\nI work at a big-name pizza place as a delivery driver. We close at 12am, so I started breaking down the make line (where we assembly line make the food). Usually we just put all the food onto dough trays and put those on a table in the corner that way pizzas can still be made (if a little awkwardly) and I can start cleaning. This is important each night, but especially during the summer because we get a lot of late orders, so we have to be on the ball cleaning when we're in the store. (Food can remain at room temp for a certain amount of time and I'm always careful not to leave it out for more than 2 hours. I'd never risk someone getting sick just to get out early.)\n\nHowever tonight I was closing with a new manager. No big deal, it's busy so we're gonna be out late anyways, I have accepted my fate. But as she came in, the other manager (LM for leaving manager) told her that we're not allowed to break down the make line until 11:30pm. It was about 10:30pm when I took it apart. So while I was out on a delivery, CM put everything back together.\n\nI came back and was pissed. I knew it was LM's work, but he wouldn't fess up to it and left. CM wouldn't admit to it, either. So I told her that I was not going to take it apart again tonight; she could. I told her I was upset that someone undid all the work I did, setting me back, making us guaranteed to get out late, and they did it all behind my back instead of coaching me like a manager should. She said she sympathized, but I had to take it apart again at the correct time because \"it's your job.\" Oh hell no. I told her I'm definitely not doing it. (Note: this store is a joke. Employees have stolen money and not gotten fired or even reprimanded, and I'm the store favorite because of how good of a worker I am, so I knew I'd just get a slap on the wrist at most for the insubordination.)\n\nBut then I got to thinking. She wants to waste my time? I'll waste hers. I did my job at a snail's pace. I cleaned a table and it took about 15 minutes. And any time there was a new bit of dirt? Oh no, I have to clean it again. *I'm just doing my job.* Oh no, the wall is dirty. Better clean that, too.\n\nAnd then the icing on the cake: at 11:20pm, I came in from a delivery to find CM had broken down the make line and was cleaning it.\n\nMe: It's not 11:30, you're not allowed to break down the make line yet.\n\nCM: Oh, he said 10:30, not 11:30, so it's fine.\n\nMe: No no no, he *definitely* said 11:30, and I've closed with him before so I know that's his preference. He's your boss, and like you said, he outranks you so we have to do what *he* says.\n\nCM: It's just 10 minutes, it doesn't matter.\n\nMe: I'm just doing my job, CM.\n\nSo I put everything back. Stopped her from cleaning the area by physically blocking her with my body as I slid by to put the food back. She was *fuming*. I left on another delivery shortly after, and when I came back, she pulled me into the office. We had a discussion which ended with her helping me clean my area (including being the one to take everything apart again, ha!) and me returning to my normal working pace. The damage had already been done, though. I left at 2:30am, but she still ended up leaving at about 3am (for unrelated reasons).",
        "created_utc": 1529534592,
        "upvote_ratio": ""
    },
    {
        "title": "[PSA] Many of you simply suck at your job",
        "author": "PoeFool",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/8sm4g5/psa_many_of_you_simply_suck_at_your_job/",
        "text": "[removed]",
        "created_utc": 1529529784,
        "upvote_ratio": ""
    },
    {
        "title": "TAB Devs get it",
        "author": "[deleted]",
        "url": "https://i.imgur.com/ZpoWVei.jpg",
        "text": "[deleted]",
        "created_utc": 1529522509,
        "upvote_ratio": ""
    },
    {
        "title": "Don't like CinemaSins?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/8skfbk/dont_like_cinemasins/",
        "text": "[removed]",
        "created_utc": 1529517258,
        "upvote_ratio": ""
    },
    {
        "title": "Want me to follow the rules? That applies to you too.",
        "author": "csteacher17",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/8ske8w/want_me_to_follow_the_rules_that_applies_to_you/",
        "text": "Edit: Wow, this got lots of attention! As a result of some suggestions from commenters, I just opened a new subreddit to share stories like this:\n\nr/talesfromthefield \n\nI've looked for places to share my stories, and have a lot more that aren't really malicious compliance, so this seems like a good place. If you have stories of crazy parents, coaches or players, please share them here!\n\nTL:DR at the bottom. Sorry it's so long.\n\nI referee high school (American) football. Dealing with coaches and idiot parents is part of the job, but it provides a gold mine of malicious compliance. Here's one of my favorites:\n\nThe game is a little league (American) football game near the end of the season. The games are more important now because they'll determine who gets into the playoff and such. If any of you are familiar with little league sports, you know that they sometimes have weird rules that only apply to specific leagues.\n\nThis is hard for referees, because we only know and go by the high school rules. Whenever we work the little league games we depend on coaches to keep us informed about the unique league rules.\n\nOne rule that is the same no matter what league you're playing in is the rule that referees are entitled to a 2-3 foot space on the sideline. Coaches are not allowed in this area during plays, because referees need it to run up the field and not be in the way of players. Coaches understandably get excited and creep up into that space, and we'll usually remind them several times before calling any penalty.\n\nI had asked my sideline several times to keep back during the play, and they did an okay job. We'll call the team on my sideline team A for annoying and the other team B.\n\nAt halftime it was brought to our attention that team B had a roster mix up, and that one of their players wasn't allowed to play because of a wrong jersey number. Usually no big deal, even in a high school game. You just edit the roster and he keeps playing. But the coach of team A made a HUGE deal about the wrong jersey number, and said that the penalty for this infraction would be that team B has to kick off AGAIN to them at halftime. Team B had kicked off to start the game, and team A's coach wanted them to kick off again.\n\nTeam A's coach kept saying stuff like \"It's in the rules for this league, so we have to follow it\" and \"Sorry, we just have to follow the league rules.\" Since A's coach wouldn't shut up, B's coach agreed to it. He just wanted his kids to play, he didn't really care about the specific rules.\n\nI thought it was ridiculous, but team B kicked off again and we got started on the second half. It was a close game, and the playoffs were about to start so coaches were getting intense. Team A had the ball around midfield looking to score the winning touchdown. The QB handed the ball to his running back, and a huge hole opened up and he took off down the field with no one around him, and scores a touchdown. As I was running down the sideline following the play, guess who was in my way, partly out on the field? Team A's coach. As I run around him, I drop my penalty flag right at his feet so he knows exactly what I'm calling. He knew what it was because of all the reminders I'd given him.\n\nHe immediately freaks out and starts screaming at me to pick up that flag and not call a penalty. We call off his teams touchdown and penalize team A 15 yards from their previous spot for sideline interference. He was furious and the other referees came over to talk to him with me. He was screaming about how I shouldn't have called that penalty, how I have it out for his team, stuff like that. We just looked at him and said \"Sorry coach, we have to follow the rules. You were out on the field during a play, the penalty for that is 15 yards.\"\n\nI don't remember the outcome, but I think his team ended up losing. Moral of the story: be nice to refs. We give you a lot of leeway, and if you act like an idiot we'll stop treating you well.\n\nTL:DR A coach insists I penalize the other team for an obscure rule violation. I do, and I penalize him the rest of the game for other obscure rule violations, costing his team the game.",
        "created_utc": 1529517054,
        "upvote_ratio": ""
    },
    {
        "title": "What's that, you want me to take care of the baby? Fine with me.",
        "author": "supermario218",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/8sjk9e/whats_that_you_want_me_to_take_care_of_the_baby/",
        "text": "I work at a daycare where the kids are divided up by age into different rooms, and I am a floater who is sent to different rooms based on staffing need. Today I came into work and was sent to the baby room and I began playing with the children (as is the job) and I went to pick up one of the babies. My coworker, (CW) saw me do this and gave me her typical death glare. According to her, holding the babies (literally under 1 year old) shouldn't be allowed because they fuss when you put them down. However babies need attention. Because they are babies, and that means holding them from time to time. And yes, they will fuss when you put them down. Because they are babies. That is what they do. However in her mind, the more I hold the child, the more she has to hear a crying baby later. She would much rather feed the baby then leave it alone the next 2-3 hours until next feeding.\n\nWell today I picked up a baby and CW gave me the death glare and said \"Yeah you keep holding that baby, they just fuss when you put them down. I also noticed yesterday you didn't hold [baby 1] when he started crying\"\n\nWhile I was used to her little comments, I was so taken back by her critiquing my care from yesterday that I didn't know what to say. I literally got stuck in a logic loop trying to figure out what she could have wanted me to do, if I pick them up, she gets mad, and now suddenly when I don't pick them up, she gets mad. I also found it frustrating that CW failed to mention how Baby 1 was sitting right next to her the entire time, and yet she couldn't be bothered to look at him let along pick him up. She also didn't mention how I was busy playing with the EIGHT other children who were in the outside play area. There is an unspoken rule that one person does babies, and the other does toddlers. So I would have had no problem holding the baby except that I was responsible for toddlers.\n\nSo later the same day we are in the outside play area with the kids. It's the middle of summer, so probably around 90 degrees out. I'm playing with the kids and keeping them all happy and entertained, and even doing my best to include Baby 1 so that he doesn't start fussing. This was working for about 90 minutes before Baby 1 starts crying. I tried comforting the baby for a few minutes to no avail. Normally we would all sit out there and tough it out, hold and comfort the baby, and go inside as a group. But I just kept thinking about what CW had said to me at the start of my shift. So I decided if that's what CW wanted, then that is what she was gonna get. So I got up, took the baby and myself back into the AC, and sat in the comfortable rocking chair for 30 minutes while the baby calmed down and took a nap.\n\nMeanwhile she was left with the toddlers outside in the heat. (For those who may be concerned, there are three adult care givers, so she was not alone with 8+ kids). I found it extremely satisfying to know not only was she probably peeved that I was holding the child, but also that she couldn't complain tomorrow that I didn't hold the child. And if she complained that I left the main area, I could simple say I was doing exactly what she told me to do. \n\n**TL:DR - Coworker gets mad if I pick up baby, so I don't. Then she got mad when I didn't, so then I did.**\n\nEDIT: Removed some unnecessary adjectives\n\n\n",
        "created_utc": 1529511058,
        "upvote_ratio": ""
    },
    {
        "title": "Prices firm at yard sale? No problem.",
        "author": "inthiseconomy0514",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/8sjhaf/prices_firm_at_yard_sale_no_problem/",
        "text": "[removed]",
        "created_utc": 1529510475,
        "upvote_ratio": ""
    },
    {
        "title": "When I was your age, Pluto edition",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/8shpcu/when_i_was_your_age_pluto_edition/",
        "text": "[removed]",
        "created_utc": 1529495769,
        "upvote_ratio": ""
    },
    {
        "title": "Interrupt me, berate me and demand to do as you say? Enjoy not getting paid.",
        "author": "ahrgjkgfkm",
        "url": "https://www.reddit.com/r/talesfromtechsupport/comments/8sbpur/interrupt_me_berate_me_and_demand_to_do_as_you/",
        "text": "",
        "created_utc": 1529482913,
        "upvote_ratio": ""
    },
    {
        "title": "Tell the boss that you're overworked and that a certain project is too unwieldy and time-consuming for you to handle it on your own? I'll do that project in an afternoon.",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/8sd59w/tell_the_boss_that_youre_overworked_and_that_a/",
        "text": "[deleted]",
        "created_utc": 1529447494,
        "upvote_ratio": ""
    },
    {
        "title": "I did a \"huge\" part of my coworker's job in basically no time.",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/8sd2n3/i_did_a_huge_part_of_my_coworkers_job_in/",
        "text": "[deleted]",
        "created_utc": 1529446896,
        "upvote_ratio": ""
    },
    {
        "title": "Just do what I say",
        "author": "cas74656",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/8sculu/just_do_what_i_say/",
        "text": "I work as a manager at a retail pharmacy. One day I’m working a closing shift and our pharmacy is backed up so I’m helping them out. After about 5 minutes This lady comes up and says she would like her prescription filled. She hands me the prescription and i fill it for her. Well doing so I see the price is like $1,200 so I look for insurance issues and things like that. I see she has no insurance on file, so I checked our system and found one for her that covers all but $125 I call her name and i have her confirm her address. I go to ring her prescription up and she stops me mid sentence and says she found a car online that will save her money. I try to explain that we have insurance on file that covers it but she wouldn’t let me speak.  So I entered the card for her and the total comes to $1,006 and I tell her the total.  I try again to explain to her that the insurance covered more but still she wouldn’t let me speak.  She said that google said this is going to save me money and I think google knows more than you . So just ring me up. I try warn her that I can’t process refunds once she leaves . She says she is saving money so why would she want to return it.  Then tells me to hurry up. So I ring her up her total is $1,006. She says see less then $2,000. I was right. She pays for her prescription and leaves. ",
        "created_utc": 1529445184,
        "upvote_ratio": ""
    },
    {
        "title": "MC Teacher's Edition",
        "author": "3kidsmakemecrazy",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/8sc27k/mc_teachers_edition/",
        "text": "Back when I was a lowly student teacher, I was assigned to a 2nd/3rd grade classroom in an inner city school. There were a handful of ESL (English as a Second Language) students in the class.\n\nSomething else you should know about me, I enjoy learning new languages. I think it's fun. Yes, I know I'm weird. I took French in high school and passed the AP Exam (4). In college I took Spanish and Ancient Greek. Ancient Greek was awesome! I've also learned smidges of other languages through overseas trips or conversations with people. I can start conversations in Thai and Swahili and Romanian. I can't do more than ask your name and how old you are, but it's something. \n\nNow for the story. I was teaching a math lesson and my supervising teacher was sitting in the back of the room. I ask a question of one 3rd grade student, let's call her T. T doesn't answer the question. \"I don't know,\" she says. \n\nMe: What part didn't you understand? (Stupid question for a teacher to ask, but I was young and didn't know better) \n\nT: I didn't understand any of it. \n\nMe: Why not? Don't you understand English? (Really, really stupid question for a teacher to ask. I would never do that today. Please don't judge young stupid me for being young and stupid) \n\nT: No, I only understand Spanish. \n\nNow this is a game I can play. My Spanish is pretty solid. I re-explain the concept in Spanish. I even answer some questions from Hispanic ESL students. T sits there the whole time with her mouth hanging open. My supervising teacher is stifling giggles. Five minutes later...\n\nT: I changed my mind. I want French today. \n\nNo problem! I switch to French. I continue asking questions. One of the ESL students is from an Eastern European country (I don't remember which at this point, it was 15 years ago) and speaks a bit of French. So she raises her hand and answers a question. Supervising teacher and half the class are audibly laughing now. \n\nT: This is ridiculous! How many languages do you speak? \n\nMe: Seven or eight? I don't really keep track. What do you want to try next? \n\nT: Can I just answer the question in English? \n\nMe: Sure thing, T. \n\nLooking back, I can see lots of ways I could have handled this better. But it was a fun break to our day and helped me earn a bit of respect from T. My supervising teacher told me to never do it again, but thanked me for the laughs. I do still enjoy speaking other languages to my students every chance I get. It's a lot of fun.",
        "created_utc": 1529439184,
        "upvote_ratio": ""
    },
    {
        "title": "Is the table sanitized enough for you now? • r/TalesFromYourServer",
        "author": "ObnoxiousOldBastard",
        "url": "https://www.reddit.com/r/TalesFromYourServer/comments/8rmreu/is_the_table_sanitized_enough_for_you_now/",
        "text": "",
        "created_utc": 1529439119,
        "upvote_ratio": ""
    },
    {
        "title": "\"Please label the buttons\" -Ha ok",
        "author": "[deleted]",
        "url": "https://i.redd.it/vtvrvygu20511.jpg",
        "text": "[deleted]",
        "created_utc": 1529432615,
        "upvote_ratio": ""
    },
    {
        "title": "\"I need you to make a diagram showing exactly what all of the buttons do.\"",
        "author": "[deleted]",
        "url": "https://i.imgur.com/1UYxsfR.jpg",
        "text": "[deleted]",
        "created_utc": 1529429579,
        "upvote_ratio": ""
    },
    {
        "title": "Labeled the buttons? Check.",
        "author": "geek-craft",
        "url": "https://i.imgur.com/1UYxsfR.jpg",
        "text": "",
        "created_utc": 1529429398,
        "upvote_ratio": ""
    },
    {
        "title": "Health and Safety MadLads.",
        "author": "charlie_boo",
        "url": "https://i.redd.it/31nl0y12iz411.jpg",
        "text": "",
        "created_utc": 1529425616,
        "upvote_ratio": ""
    },
    {
        "title": "The silent ball",
        "author": "MuadLib",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/8s9due/the_silent_ball/",
        "text": "Obligatory \"ESL, forgive me for my near perfect English (apart from the abuse of commas).\"\n\nAlso, long. TL;DR at bottom.\n\nIn the 1940s Brazil was under a fascist dictatorship. In order to not be firebombed into oblivion by the US, our dictator Getulio Vargas agreed to join the Allies against the Axis despite being basically a tropical version of Mussolini (our labor code, for instance, is a servile translation of Mussolini's 'Carta del Lavoro').\n\n\nOne of the consequences of us joining the Allies while also being a dictatorship was that the ban against speaking foreign languages in public, punishable with prison, fines and other penalties.\n\n\nThe thing is, the southern corner of Brazil had an enormous immigrant population consisting of Italians, Germans, Poles, Ukrainians and others who had arrived in waves since the late 1800s. \n\n\nThere were lots of first or second generation immigrants who didn't even speak Portuguese. Heck, I was born in the late 60s and had schoolmates who only learned Portuguese in first grade.\n\n\nBack to the 40s. So the South basically had whole towns where almost nobody spoke Portuguese and also where speaking anything but Portuguese was a felony. That gave the members of the police plenty of opportunities to collect bribes, and for regular people to fuck with people they didn't like. My grandmother, for instance, lost her teaching job for speaking Polish and German with the kids to whom she was teaching Portuguese. She was denounced by someone who wanted her position.\n\n\nCHAPTER TWO: WHERE I FINALLY GET TO THE POINT\n\n\nThere was a family of German immigrants who owned a grocery store/bar and that also often held balls for the community (mostly Schützenfeste, shooting competitions / festivals). The community in this case being mostly German-speaking families. The police went to these balls and threatened to close the place and arrest the owners and party-goers, resulting in ending the ball and the cops collecting a substantial loot in bribes.\n\n\nThe owners were thinking of ending the balls altogether but decided to throw a last one, with a twist. They let the community know about the ball and how it would happen, and then *denounced themselves to the police* via an anonymous tip.\n\n\nWhen the police arrived, they peeked through the windows in order to catch people speaking German to give them cause to storm the place and make some arrests to look good and bully the rest into buying their way out of jail. The problem was, nobody was speaking German. Actually, nobody was speaking *anything*. There was a band playing instrumental music with no words. The gentlemen gestured their invitations to the ladies and took them by their hands to the dance floor without saying a word; the patrons at the bar pointed at the bottles to order their drinks; dinner was served in a buffet. Pen and pencils were available for the eventualities where gesturing could not solve.\n\n\nThe ball went on all night and after some time the cops gave up and went home. The news of the \"resistance ball\" spread to towns nearby and was spoken of for many years, but after this one there were no more balls until the war was over and the dictator fell.\n\nTL;DR: Dictator forbids immigrants to speak their mother tongue so they throw a silent ball.",
        "created_utc": 1529419268,
        "upvote_ratio": ""
    },
    {
        "title": "Work or Party?",
        "author": "mastorms",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/8s8w06/work_or_party/",
        "text": "Edit: [Photos and Work Visa](https://imgur.com/gallery/AtN3qtr) \n\nI wrote [About Charles](https://www.reddit.com/r/MaliciousCompliance/comments/8jpdtw/his_name_was_charles/) last month and wanted to share another short story. The recent [Diplomatically Compliant](https://www.reddit.com/r/MaliciousCompliance/comments/8s58d3/diplomatically_compliant/) story reminded me of this one. \n\nBackground: I dropped out of school not long after my time with Charles and McDonalds. Details are otherwise unimportant but I left Charles' McDonalds after being held up with a shotgun to my head. Turned out to be the only other black cashier who had been fired the previous month (for stealing from the registers). I decided to move on and get a real job. Eventually, I joined the Marines and ended up getting two passports. One is the standard American passport in blue. The other is brown and has an endorsement that says I am travelling on official business for the US Government. Blue passport photo was made when I had an epic beard and looked like Zach Galifianakis. The resemblance is more than passing but I can also pass as ethnically Middle Eastern. My callsign in Afghanistan was Fat Jesus. A televangelist I know thought that I had been sent to kill her based on my looks. The Brits saw me on a flightline and sent armed guards to stop an obvious terrorist from blowing up planes. Brown, official passport photo was taken right before my first deployment. For hazing reasons, there's a 'tradition' of having to shave your head prior to your first, actual deployment. I look truly awful and terrifying with a shaved head and no beard. Everyone agreed that I would never do that again.\n\nTL;DR - Blue Passport = Hangover Guy. Brown, Official Passport = Neo-Nazi / Unabomber.\n\n  I get out of the Marines in 2011, grow my beard out again, and get hired as a government contractor in Afghanistan. Six months after my first job ends, I get hired by a second company and they have me get a Qatari Work Visa so that I can get through their processing center and move easily between countries.\n\nBlue Passport with Epic Beard Guy now has official Qatari Visa.\n\nI land in Qatar and approach the customs agent. Qataris are very rich. I'd been told that IF they decided to do a job in the country, they were mandated by the government to get a starting salary of $150k. They also have an entire class of migrant workers that are held there as literal slaves. The Qataris take their passports for \"safekeeping\" and then hold them hostage until they die of exhaustion or poor living conditions. Foreigners can't own land either. This is an entire country of entitled slave masters that hold the keys to everything in their oil-rich empire. One does not silly walk in Qatar. The Qatari agent is immaculately clean. His robes are a Tide ad. His headdress is perfect. His beard is coiffed to millimeter precision and he has his edges freshly bladed. This dude is dripping perfectionism and importance. He is not to be trifled with and he knows exactly the power he wields as an agent. All that is going through my head as I approach him with Blue Passport at the ready. He blandly eyeballs me as the automatic photo is taken and I hand over Blue Passport. \"You here for work or party?\" in a vaguely British-Arabic accent. \"Work.\" as I nod to the Passport. He flips the pages in a very particular way, but with a look on his face that is trying just a tad too hard to say that he's bored. If I hadn’t been monitoring him so closely, I would’ve missed it. He flips the pages for a second time and then asks for a credit card. “I have a Qatari Work Visa. I’m here on business.” I nod again to the Passport. His glazed expression melts into attentive annoyance at my refusal to fall for his scam. “What work…” in a flat tone. “I’m just transiting through, on my way to Afghanistan as a contractor for the US.” That was the only answer I can give him. It’s not helping my case here. “So you are working here, or just Afghanistan?” “I’m not sure. I think Afghanistan but there’s positions here.” This goes on for a few more clarifications.\n\nAt some point I notice that I’m the only one still being processed. This is now a big problem. I am an American contractor, alone, in a vulnerable location and subject to their whims. There’s now a second agent, possibly a supervisor, in the same perfectly white robes and perfect grooming. The bluffing of the agent has gotten old but he keeps pressing me and feigning ignorance to the Visa that he keeps skipping the page on. I try to make it as crystal clear as I possibly can. “Look. I am just passing through here. My supervisor and I are going to meet up with another party, get processed, and then transit through to Afghanistan or wherever it is that I’m supposed to WORK.”\n\n  His eyes lit up like Christmas. Ok. Maybe not Christmas in Qatar. Maybe like a new Maserati dealership or sex trafficking ring had opened up at a mansion near him. “Ahhh!! You are here for PARTY! Credit Card.” Now I’m furious. He knows damn well what that meaning of ‘party’ is and he’s going to keep this up. I’m done. No more games. Brown Passport comes out. “I am on official government business. I am not here for ‘party,’ I said that I’m meeting another party. It means a group. Of workers. Government workers. On official business.” The other agent freezes. He’s never seen someone call their bluff or fight back like this. Agent is now out for blood and he can’t back down without admitting that he’s either stupid or a scammer. They both look down at the Passports as Agent opens it. They look at each other. They look at me. They look much closer at both pictures. Agent flips with ease to the previously-impossible-to-locate Work Visa. They look at each other again and start to speak Arabic. First it’s fast and quiet, then it’s louder. This is not a happy conversation. They just realized that I might not actually be an American Muslim going to party and pay for women. They’re both visibly angry and suspicious. With slit eyes watching every reaction I make, Agent leans in and slowly breathes: “Why you shave beard?”\n\n  I am painfully aware of how small I am, and how very foreign I am to this part of the world. This can go bad quickly, and deeply. My very existence is an affront to everything here. They thought I was scamming them, but now I’m an infidel with a beard that bothers them. I lean closer on the counter and slowly reply: “I’m here for work, remember? Meeting my ‘party.’” I hand over my company credit card. He doesn’t even look at the card. There’s a mix of emotions that I can’t discern on either of their faces. He charges me $225 and hands back the passports. Qatari Work Visa has its stamp too. Now I’ve nailed them. I walk through security and the Qatar Country Lead for the company meets me. He knew something was wrong but couldn’t do anything until I made it past security. I tell him what happened, including that I paid with the company card and he got excited. We walk back through the secure area and over to the actual Supervisor office. My boss starts hollering at the Qatari and holds the receipt up to his nose and then waving the Visa. Supervisor sheepishly cancels the charge, apologizes to my boss, and as we’re leaving there are lots of shouts over to the two agents. They’re about to have a really bad day…\n\nAfter I stored my gear, boss invites me over to meet the crew working in Qatar. He hands me a beer and we spend hours under the stars with BBQ and classic rock with a bunch of the best people Americans will never know about. My flight leaves in the morning and I’ll actually be getting shot at in two days, but for that night, it was a nice, relaxing party.\n\nTL;DR – Customs demands payment for non-work trips. Thinks I’m scamming them or that they’ll scam me. Whip out Brown passport. Agent is so shocked he charges my work card and thinks he got away with it. Gets him in serious trouble since I used a Visa, Official Passport, AND company credit card to thwart him. Could’ve escalated way out of hand. Wind up at a party less than an hour later.",
        "created_utc": 1529415173,
        "upvote_ratio": ""
    },
    {
        "title": "Drivers of all motorised vehicles must show photo ID.",
        "author": "emaren",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/8s7gtp/drivers_of_all_motorised_vehicles_must_show_photo/",
        "text": "I work in Central London. I commute 38 miles (each way) on a motorbike a few days a week to my office which has secure, underground, parking. \n\nThere are several layers of security, there is a manned security post at the entrance with two lanes - visitors and pass holders. There is an electronic barrier that needs an RFID card to allow you into the underground parking, then the lift from the parking to reception needs the same card, then the barrier to the lifts needs the card and then the office door needs a different card. Internally we have multiple secure doors that require cards and the server room needs both a card and a fingerprint. \n\nIt is all very, very secure. \n\nA couple of weeks ago, an e-mail went to everyone to remind us all that if we are bringing a vehicle onto the premises, we should be showing a photo ID at the security checkpoint from Monday onwards.\n\nI guess that you can already see where this is leading ? \n\nI've been using the same checkpoint with the same guards and the same underground parking for quite a few years. Additionally my photo ID is at least five years old and looks nothing like me - I had (longer) hair and no beard when the photo was taken and now I have almost no hair a quite a lot of beard and have changed my glasses - long story short, I only barely resemble my ID. I have never shown my ID - the guards always wave me though.\n\nAdditionally, I wear a full face helmet and full leathers, my journey is long and I take personal safely very seriously.\n\nOn day one of the new security regime, I pulled up to the security barrier, already in neutral, stopped, both feet down, pulled my photoID/pass out of jacket pocket and handed it to the guard, keeping my balaclava, helmet, glasses on...\n\nHe laughed about how he could not ID me.... \n\nBut as there were cars behind, he waved me though.\n\nOne day two there was a new guard, a complete jobsworth, I stopped and handed him my ID. He said I need to remove my helmet, I asked to talk to his supervisor....\n\nWhen the supervisor came over, he waved me through laughing and shaking his head..\n\nAt the end of the first week, the new guard was there alone. He demand my ID and that I take my helmet off - so I took off my gloves and handed them to him - 'here, hold these', then my glasses, then took my helmet off and handed that to him. To reveal my balaclava, which he suggested I took off, so I unzipped my jacket, and removed balaclava - remember I look nothing like my ID picture :)\n\nHe reluctantly agreed that it was probably me.\n\nSo I slowly got off the bike, put on my balaclava, zipped up jacket, put my helmet on, put my glasses on, then my gloves and then jumped back on bike - before I went I looked over my shoulder. There must have been thirty cars and bikes backed up behind me. So I took my time even more....\n\nI was not asked for my ID for several days - I thought the the regime had been re-thought. \n\nHowever other riders were getting asked for their ID's and getting frustrated the Slack '#bikers' channel was full of complaints and then eventually a vague plan to get a lot of us to arrive at 8:30 one day. \n\nAnd that is what happened, we were maliciously compliant. En-Mass. Many bikers arrived at around 8:30 on Thursday morning.\n\nWhen I arrived there was an absolutely  massive queue of cars blocking the road getting into the office in both directions. The traffic was literally backed up for about a mile in every direction. I filtered though the traffic to find about about a dozen bikers all in various states of undress making the (jobsworth) guards life incredibly difficult - so I joined them, as did many others that had also filtered though the traffic. \n\nBy the time I got through there was probably 25 or so bikers all insisting that the jobsworth guard should check their ID behind me. He had called for re-inforcements and the supervisor and several other guards were all trying to get us through the barrier and let the huge traffic jam behind us clear. All of the bikers insisted on parking in front of the barrier and taking off gloves, helmets, under-gear then spending an age 'trying to find' their photo ID, then asking the guard if they looked good in the photo etc. Apparently the jam did not clear fully until nearly 11AM by which time the police had been called..... \n\nLater that day a new e-mail went around saying that 'Motorcycle, Scooter and moped riders are exempt from the photo ID rules as consideration was not given as to the difficulties faced in identification of helmeted riders'. This morning the barrier was raised just as I turned into the property......",
        "created_utc": 1529399843,
        "upvote_ratio": ""
    },
    {
        "title": "MacAllan, Texas. The worst kind of Malicious Compliance, the kind used to dehumanize people.",
        "author": "TerancePickles",
        "url": "https://i.redd.it/fg5ozooi2x411.jpg",
        "text": "",
        "created_utc": 1529396318,
        "upvote_ratio": ""
    },
    {
        "title": "Create your own quiz!",
        "author": "ShuumatsuWarrior",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/8s768k/create_your_own_quiz/",
        "text": "I was not the best student in High School, I didn't do my homework about 95&amp;#37; of the time.  I could just coast by on getting good test scores and a C or B average in most classes.  Anything I could get done in a few minutes before class, that would be what I would show.  (I got much better in college after a few semesters really kicked my butt)\n\nLatin though, the teacher and I just never got along.  She didn't hate me personally or anything, I think she just hated lazy people.  Especially the ones that could manage to coast like I did.  One assignment she gave, we had to read a chapter and come up with 10 questions based on it that would be for a quiz.  Well, in the few minutes before class, I started counting words and would make questions like, 'What's the 78th word?'.  I counted all the instances of \"the\".  I told my friend what I was doing when he came in, and we had a good laugh over it.\n\nShe walked around the class to check everyone's work, and when she got to me she looked at the questions and got angry with me.  She asked me what I would get if I took that for a quiz, and I very confidently said I'd get 100&amp;#37; of it correct.  She refused to give me credit for the assignment.  I didn't care that much, my homework grade was crap anyways (still ended up passing with a C).  ",
        "created_utc": 1529395915,
        "upvote_ratio": ""
    },
    {
        "title": "Corporate Contact",
        "author": "Feck_Tu_Saigh",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/8s6h4c/corporate_contact/",
        "text": "I completely forgot about my last post, and should have mentioned I'm being forced to say, \"Welcome to Place!\" My language compliance has gone over surprisingly well, customers get a kick out of it, and more than a few have been working with me on my pronunciation. \n\n\nI also want to thank you all for your offers of additional languages, and would like to take you up on that.\n\n\nAnyway! As any retail survivor knows, nights are boring. Once everything is done, you're left bored until the next drunken idiot wanders through the door to argue about what time alcohol sales cut off. At which point they demand the information for corporate.\n\n\nWhich I don't have.\n\n\nBecause no one knows it, and if they do, they aren't sharing.\n\n\nI wish I was kidding. I know vaguely where our region offices are, and maybe our main US offices are in some state. But I don't know, none of the managers I've had know, and their bosses refuse to share.\n\n\nSee, I'm one of those weird ones that actually paid attention to their training. Every year I blast through the refresher training in 20 minutes, when it's supposed to take an hour or so. I can recite that shit on the spot. Thank you Army for that particular skill set. But nowhere in all of this, is information for corporate. I retook the training in advance, printed it, poured over it extensively, and nothing.\n\n\nIt's always bothered me that I didn't know where our Corporate Overlords were actually hiding. So what's a poor, beleaguered night worker to do? Ask Uncle Google. Which wasn't as easy as I thought it'd be, because they seriously do hide that shit. \n\n\nEventually though, the heavens parted, the internet took pity on me, and I found it. All of it. The name and location of our parent company! The corporate locations for all our areas. All. Of. It.\n\n\nI've got a small stack of slips I've printed with the information for our main corporate headquarters, and when the inevitable, \"I WANT THE NUMBER FOR CORPORATE!\" happens, I give them and angelic smile and hand them a slip of paper.\n\n\nHope you have international calling, cupcake. This number ain't cheap.",
        "created_utc": 1529387383,
        "upvote_ratio": ""
    },
    {
        "title": "RIP Rajan",
        "author": "[deleted]",
        "url": "https://i.redd.it/9gwtqnaso2501.jpg",
        "text": "[deleted]",
        "created_utc": 1529387159,
        "upvote_ratio": ""
    },
    {
        "title": "See you on Monday",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/8s6g8n/see_you_on_monday/",
        "text": "[deleted]",
        "created_utc": 1529387091,
        "upvote_ratio": ""
    },
    {
        "title": "Diplomatically Compliant",
        "author": "jisuanqi",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/8s58d3/diplomatically_compliant/",
        "text": "Many years ago, I lived in Southern China, right on the mainland, but close enough to Hong Kong and Macau to easily go there regularly.\n\nChina then (maybe 15 years ago), as it is now, is full of official stances on all sorts of topics and situations. These stances are more often than not of the \"close your eyes and tell it until it's true\" type. Meaning, that even though everyone on Earth can see otherwise, you stick to the policy or get in trouble.\n\nSometimes, as a non-Chinese person, it's really tedious and mind breaking to bend to these whims. It's not that I'm more enlightened. Chinese people, for the most part, understand the reality of the situation, but have inexhaustible strength to plow on ahead through the bullshit. Much stronger than I.\n\nPerhaps the most ridiculous example is the One China Policy, which dictates that Taiwan is a part of mainland China, no matter if it's ruled by their opponents in the civil war, they issue their own stamps, currency, ad passports, and act in every possible way as a country, rather than a province.\n\nSo, you have to be really careful when you have to navigate the high seas of bullshit when it comes to Taiwan.\n\nWhen you enter China, you have to fill out these little cards with all your information, most notably, \"List all foreign countries you have visited in the past 14 days\".\n\nNow, I took a trip to Taiwan. Had a blast, and was flying back via Hong Kong. I made it to the border crossing into Mainland China (Shenzhen).\n\nThere are thousands of people, all lined up in lines for Foreigners, Chinese citizens, HK and Macau Residents, and \"Taiwanese Compatriots\". \n\nSo I, being American, grab my little card and stand in the foreigner line and start filling out my info. HK isn't a separate country, and neither is Taiwan, so I technically didn't go anywhere outside of the country. I left the \"Places you've been\" field blank.\n\nI get to the counter and the immigration officer looks at my card, and the flips through my passport, where he notices an exit stamp from just a few hours ago from Taiwan.\n\nHe gets annoyed and asks me why I was lying on my card, and how declaring false information is punishable by jail time and then permanent expulsion. \n\nI asked him what was I lying about. I honestly wasn't thinking about it. I was thinking I misspelled my name or something.\n\nHe says \"You've not been anywhere but you have a Taiwanese visa in your passport?\"\n\nTo which I replied \"Oh, this asks me what COUNTRIES I've visited.  I've only been to Taiwan.\"\n\nRealizing his error, he looks around to see if any body else heard him, then stamps my passport and waves me through.\n\n\n\n",
        "created_utc": 1529374583,
        "upvote_ratio": ""
    },
    {
        "title": "Speed up the video? Sure!",
        "author": "Epicface227",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/8s557g/speed_up_the_video_sure/",
        "text": "First submission to this subreddit, so please be gentle.\n\nSo I'm working on a final project for the AP Micro class I'm taking, and we have to create a video which is essentially a character explaining economics. I eventually was assigned the task of editing the clips and putting everything together. Thing is, I was missing a lot of components and they never ended up giving them to me even when I asked several times.\n\nYet somehow the video was still almost 20 minutes long, when the limit was around 10 minutes. So they ask me to speed up the video and to make some cuts. I try to tell them that It will definitely decrease the quality of the video and whatever happens to it is out of my control. The response I got was essentially \"It doesn't matter, just do it anyway.\" Being a little pissed at this point, and a high school senior who doesn't care that much this late into the year I decided to give them what they wanted. I speed up the audio to x4 to get it under 10 minutes and now everyone talking in the voiceover sounds like chipmunks that got into a helium tank. I'm about to submit it online in a couple of minutes. The videos are going to be presented tomorrow and I don't think they have seen the final product yet. Wish me luck!\n\nEdit: My groupmates immediately looked at me when the video played, they tried to remain emotionless when it was playing, but you could tell they were pissed at me. My teacher seemed mildly amused so I dont know how its gonna be graded. \n\nEdit 2: I think I missed an oppurtunity with the video. I couldve done like an econ expaliner video but whenever an economic concept is mentioned it gets faster.",
        "created_utc": 1529373734,
        "upvote_ratio": ""
    },
    {
        "title": "Speed up the video? Sure!",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/8s52g4/speed_up_the_video_sure/",
        "text": "[deleted]",
        "created_utc": 1529373023,
        "upvote_ratio": ""
    },
    {
        "title": "There is a petition to criminalise the export of medical canabis from the UK, as the government insists it has no medicianl value.",
        "author": "web8564j",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/8s4x4j/there_is_a_petition_to_criminalise_the_export_of/",
        "text": "[removed]",
        "created_utc": 1529371672,
        "upvote_ratio": ""
    },
    {
        "title": "You Want Realistic Art?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/8s4s63/you_want_realistic_art/",
        "text": "[deleted]",
        "created_utc": 1529370434,
        "upvote_ratio": ""
    },
    {
        "title": "Pay per toilet flush, fine.",
        "author": "KoalaBear27",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/8s4jqt/pay_per_toilet_flush_fine/",
        "text": "[removed]",
        "created_utc": 1529368159,
        "upvote_ratio": ""
    },
    {
        "title": "You sure you want me to cook that much?",
        "author": "cycloscott",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/8s4bwy/you_sure_you_want_me_to_cook_that_much/",
        "text": "This takes place decades ago, when I was working at a clown based fast-food joint during my college years.  Whatever, needed the dough to pay for school.\n\nI actually liked working the opening shift.  It meant my day was done a little after lunch and I was free to enjoy the rest of the summer day.  What I didn't like was the normal morning manager who was more than a bit dim but thought her shit didn't stink because she was in management.  We'll call her L.   For Lynn.  Which was her name.\n\nI'm in one morning, we've barely unlocked the doors and it's so slow that there's pretty much no food in the bin.  Managers got rated on keeping their waste down, and food that's in the bin for more than about 10 minutes gets chucked and counted as waste.  (10 minutes sounds about right.  like I said, this happened decades ago)  So it behooves them to only order enough food for the next few customers when it's slow.\n\nI'm setting up my grill station the exact way I like it, getting english muffins ready to go, setting up egg flats just so, and I look over the pass to see 3 buses come rolling in.  L sees them as well and starts going crazy ordering food.  Gonna be the motherlode.  But what I also saw was the name of the charter company and the destination.  I let her know that it might not be what she thinks and we should see who gets off the bus first.  Nope!  She barks at me that she knows what she's doing, and to start cooking.  Sure thing!\n\n I start slamming down muffins, eggs, sausages, bacon, etc.  The fry station is cooking as many hashbrowns as they can.  I'm pulling double-duty on the second grill station to get flapjacks up as well.  At one point I had both grills completely covered with food.  No problem, everything she has asked for is headed through the pass within a handful of minutes.  The bin is completely stuffed with food, which should be enough for a small army, but not for 3 buses.  As quickly as her first order comes up, she's doubling down with another round.  Cool.  Makes my morning pass by a little quicker.  I have my doubts though.\n\nBy this point the buses have done their jockeying around the building, avoided the drivethru, and parked nicely down one side of the lot so as to not interfere with anyone else pulling in.  And who gets off?  Sure enough.  The drivers, and a couple dozen Hasidic Jews headed from Montreal to NYC.  Most everybody else stayed on the buses.  The drivers picked up some coffee, while the passengers that got off either stretched their legs in the parking lot or came in to use the bathroom.  Last I checked, the clown isn't kosher.\n\nAll of the food got tossed 10 minutes later.  L's food waste that morning was through the roof.   ",
        "created_utc": 1529366250,
        "upvote_ratio": ""
    },
    {
        "title": "Dealing with Parents in a tuition centre",
        "author": "Lightwalker123",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/8s3jkx/dealing_with_parents_in_a_tuition_centre/",
        "text": "I was a tutor about a few months back. I usually teach Grade 1-7 kids Maths and Science. Most of the parents were chill and trusted the centres rep. Parents rarely speak to the tutor as they will usually speak directly to my In-Charge. So when this parent asked to talk to me, I was quite surprised. Me will be Me, P will be Parent and IC will be In-Charge\n\nP: how is my child’s progress\n\nMe: Oh he is doing fine. He is learning Basic Algebra  \nbut I suggest he do more work at home. \n\nP: can you give him less homework?\n\n[*Diversion* the centre provides booklets and the students are asked to do alternate pages. I will be scolded if I have lesser homework than the number of pages he has done. Say he doesPages 1,3,5 I have to give 2,4,6. Okay back to the convo]\n\nMe: I can’t do that Cus yada yada yada company policy\n\nP: Then make him do less work in tuition.\n\n[*Diversion* it’s a 2 hours lesson. So most kids do at least 9-12 pages]\n\nMe: Okie \n\nSo from that week onwards, I made the kid do only 5 pages. My IC got angry with me. \n\nIC: Why are you making him do so little in class\n\nMe: Special request from parents. \n\nIC: Can you make him do more. \n\nMe: Speak with the parents and then let me know. \n\nThe kid and I had a great time. We bonded over common interests in cars and would talk about cars for a long time. \n\nOne day, the parent was looking very angry and incredibly frustrated and she asked to speak with me.\n\nMe: Hi what’s up?\n\nP: My sons grades haven’t improved one bit. In fact they have went down. Can you explain to me?\n\nMe: You told me to do less in tuition so I did?\n\nP: That wasn’t what I meant by do less. \n\nMe: mam I was only doing what you asked me to do. I have parents who actually want their children to improve to teach. So if you could excuse me, I have to go. Have a great day and goodbye. \n\nI felt bad that the kids grades dropped and I helped him on my personal time cus he was a good kid and he didn’t deserve the bad grades. He even got 100 for his Maths on his mid years \n\nTLDR; Parent complained about Son having too much work, resulted in the sons grade dropping \n\n**EDIT** added ending to what happened. ",
        "created_utc": 1529359627,
        "upvote_ratio": ""
    },
    {
        "title": "Military Bureucracy",
        "author": "rhodante",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/8s3fi4/military_bureucracy/",
        "text": "In my country men have to do a mandatory military service by law. \n\nMy dad did his service in the 80's. Back then if you had a college degree at the start of your military service you would be sent to a short educational program and as a result be given the rank of Third Lieutenant and basically complete your mandatory service with that rank. \n\nAt the end of the program the location of their assignment would be determined through a raffle. My dad was assigned to a small rural border village with harsh winters for two years. \n\nWhen he arrived at his post he realized he was the most ranking officer at that post and as a result he was post commander. He was basically in charge of about 15 privates. Mostly they did border patrols. \n\nDuring his two years his post was investigated and he was \"interrogated\" about 9 times.\n\nI say \"interrogated\" because, according to the military law, when an officer is being interrogated, he must be interrogated by the post commander. \n\nHe would basically have his typer type out whatever he wanted as his defense and sign the document twice: once for interrogating officer and once for defending officer. \n\nBureaucracy is a b***h sometimes. \n\nEDIT: It has been pointed out to me I may have inadvertently left the malicious part out. So here's an example of what happens because of this. \n\nBetween 1923 (the establishment of the Republic) and 1984 (when my dad was released from duty) the post was investigated a total of 16 times. 9 of those instances were during his time there. \n\nHe often did things that were big no-no's because he knew he'd be fine in the end. \n\nThe investigating officer was his SO who was posted elsewhere and if his SO decided to pull my dad from is assigned post, he would have to serve his remaining time directly under the SO instead of a God forsaken little border village. The SO would often get furious but couldn't do anything about it because he didn't want my dad with him everyday. \n\nOne example of the things he did that he wasn't supposed to: he had the unit bathroom renovated. Appearently the unit bathroom was basically a small room with running water and a wood burning heater. Essentially you would heat the water on the heater and pour it down your body with the help of an instrument like a cup. No shower head, no bath tub. Just a small room with water and a heater. The walls weren't tiled and the paint of course had water damage from the years of steam. The room housed one wooden stool that was covered in mold and moss for the entire unit to share. He had the bathroom renovated: tiled walls and floor, plastic stools (ond for every unit member) new washing equipment etc. He paid for the renovations out of his own pocket because \"in a place like that he couldn't spend the entirety of his salary no matter how hard he tried\". His SO basically asked him \"Do you think you are richer than the Military boy?\". My dad said since it was a hygiene issue he didn't have the time to wait for all the bureucratic bs for requesting funds for a job like that and if the military wants to they can reimburse him the total amount as evidenced by the invoices. ",
        "created_utc": 1529358781,
        "upvote_ratio": ""
    },
    {
        "title": "Please Leave A Review!",
        "author": "AdamReggie",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/8s30x0/please_leave_a_review/",
        "text": "On desktop and English is my first and only language. No excuses. \n\nI bought my car from a local dealership years ago. It was one of those dealerships that was a family of dealerships. For example, there was a **\\[Guy's Name\\] Honda** next to the **\\[Guy's Name\\] Ford** next to the \\[**Guy's Name\\] Nissan**, etc.\n\nI guess my contact info was still stored in their system all these years later despite never going to them for maintenance or repairs. I hadn't heard a peep from them in years... until one fateful day.\n\nI get an email asking about how I like my new, let's say, \"Subaru Outback\". First I am confused (I drive a, let's say, Chevy Malibu). Then I kinda panic thinking someone  stole my identity and bought a car in my name. So I frantically call up and try to figure out what's going on and am eventually told that the information of another customer with the same first and last name as me got merged with mine. I am assured that my information has not been compromised and that the issue has been resolved.\n\nThen I get a few more emails. Some from the dealership, some from Subaru. I give it a couple days and tell myself that some of these emails were automated the day the car was purchased and they'll eventually stop trickling in. And they do. For a while. Then I get a maintenance reminder for my Subaru. And then actual physical mail about my Subaru's warranty. Then I get a dealership survey. I call again and explain the situation. I reply to the emails (which allegedly go to the director of sales) and tell them I have never purchased a Subaru and request (again) to be removed from all mailing lists. I am assured (again) that my info has not been compromised and that I have been removed. It's worth noting that one reply email I received CC'd the other guy with the same name as me! So now I have his email and he has mine, which as far as I'm concerned is sharing my personal information with a third party.\n\nThe emails decrease over time, but don't ever actually stop. I get mildly annoyed each time and reply back each time, copying every manager I can find listed on their websites. And then after a few months of radio silence, I receive an email requesting me to \"Rate your satisfaction with your recent Subaru purchase!\" with links to the dealership's Facebook page, Yelp, Google review, etc. \n\nIt was kind of the straw that broke the camels back. So I comply and rate 1 star across all platforms and leave descriptive reviews of their customer service. I even explain that I haven't even been able to drive my new Subaru, despite receiving a confirmation email from them over 6 months ago. My reviews have been pretty popular. I received a sheepish reply from a manager again reassuring me my information has not been compromised and that he has elevated this concern to his higher ups and those responsible for their marketing distribution.\n\nI haven't heard from them in a while. I still let the BBB know just in case. \n\nTL;DR - car dealership mixes my contact info with another customer. Spams me for months despite my repeated request to be removed form the mailing list. They again spam me asking me to review their service. I comply. ",
        "created_utc": 1529355651,
        "upvote_ratio": ""
    },
    {
        "title": "Maliciously Compliant Child",
        "author": "cookiesndwichmonster",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/8s2yq9/maliciously_compliant_child/",
        "text": "As a child, and honestly still as an adult, I've got some cute, dimpled, pinch-able cheeks. All my life, people have pinched, pulled, poked, and even threatened to bite them. It happens less now, thankfully, but as a child it was a daily occurrence. I would tell people that I didn't like it, and ask them not to do it, and most would listen. Unfortunately for me, I had a teacher who would not. Every time she saw me she would come straight at me, hand out, and pinch the fuck out of my face. I repeatedly told her I didn't like it, and attempted to avoid her. Elementary school children don't have many ways to avoid their teachers though, and even though I told my mother about the situation, she had no advice that was useful. Finally though, there was a talk about \"stranger danger\" at school. There was of course the information about strangers, and lures like puppies or candy. Eventually the talk turned to \"bad touch\", and that adults should never be touching you in a way that makes you uncomfortable. We were told to say no, to escape, and to try to make the person stop right away. In this advice I found my path to a face that wasn't sore. \n\nSoon after the talk, I was again faced with my cheek-pinching nemesis. She approached me immediately, hand out. I was in a group of my classmates. I once again told her that I didn't like it when she pinched my face, but she reached out and tweaked my face anyway, with a hand on each cheek. I yelled \"NO!\", pushed her hand away, and slapped her across the face, hard. Naturally I was immediately sent to the principal's office. Once inside and sat down across from what seemed like an enormous desk, the principal began to berate me for attacking a teacher. She asked me to explain myself before she called my mother. I calmly said that the teacher had been touching me in a way that made me very uncomfortable, and had been doing so for a long time. I noted that I had repeatedly asked the teacher to stop, to no avail. I explained that I thought I would just have to put up with the bad and upsetting contact I was getting from the teacher until I had heard the \"stranger danger\" talk at school, and that it had taught me that it was ok to say no and fight back against the contact that was uncomfortable to me. \n\nThe principal's eyes became wider and wider as I spoke, and when I finished she was quiet for a few moments. She then told me she would not be calling my mother, that hitting the teacher had not been the right thing to do but that I would not be punished. I was sent back to class, and that damn teacher never touched me again. ",
        "created_utc": 1529355183,
        "upvote_ratio": ""
    },
    {
        "title": "You must see ONLY the clients marked on YOUR calendar.",
        "author": "old_and_busted",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/8s1go5/you_must_see_only_the_clients_marked_on_your/",
        "text": "Greetings again. Some of you may remember my post from about month ago when i started work at a new counseling clinic. If not, [here you go](https://www.reddit.com/r/MaliciousCompliance/comments/8l0gwj/you_have_a_week_of_training_left/)!\n\nThat story was perhaps not as malicious as it could have been, but this one most certainly is. It was so malicious I got the entire staff on board to do this with me, and in doing so took only four days to reverse this policy. I'm getting ahead of myself though.\n\nFirst you need a little information about my clinic. It's really big. The biggest in the region for the parent company that operates a series of clinics. The building is 3 stories tall, and built out of a converted shipping warehouse from a company that went out of business in the 60's. One floor is a counseling center, one floor is a medical clinic, and one floor is a crisis center where suicidal people, drug abusers, etc. are brought to try to get them stabilized. All 3 are operated by the same parent company, and as such we all work closely together with clients. Honestly, it's controlled chaos most days, but we all work cooperatively to ensure clients are seen and taken care of each day in as close to a timely manner as possible. \n\nWhile you can't bounce from therapist to therapist, anybody can take a first time appointment. Each of our schedules are built out so that we each take several first time appointments per day, but sometimes multiple people show up at the same time for that appointment (double booking) or someone makes a mistake and schedules a regular counseling session over the top of a first time appointment. In case you don't know, first time appointments are almost always strictly information gathering and diagnosing per insurance requirements. No therapeutic relationship is formed during these times.\n\nQueue the story. Last monday the VP for our region stopped by first thing in the the morning and called an all hands meeting. Just a reminder, OM is office manager and CD is clinic director.\n\nVP: Things are not as organized around here as the need to be. You guys constantly are pulling clients from one persons schedule to another, and have weekly reports that make no sense because of it. \n\nOM: Well ya, it's hectic around here on the calmest of days. We have nearly 3x the volume of the next largest center in the area. We all just help out where we can.\n\nCD: FTA's (first time appointments) are the easiest way to help even out the case load. When client's no show or a weird gap winds up in someones schedule, they'll take an FTA off of someone who is slammed or who hasn't had lunch that day. \n\nVP: This is unacceptable. We need more accurate reports, and this behavior messes up reporting. It works at the other clinics, so it should work here.\n\nOM: Yes, it may, but as I already said we have such a high client volume. Restricting schedules in this way will reduce our productivity significantly, and I guarantee that there will be client complaints due to longer wait times.  \n\nVP: If you stick to the schedule it will work out. \n\nA valiant amount of protesting followed by nearly all staff members, CD, and OM, but the battle was soon lost. The VP left with a door slam that said screw you i'm in charge, and we spent 5 or so minutes trying to work out a solution. Finally, when it seemed all hope was lost, I spoke up.\n\nMe: Why don't we just follow her rule maliciously.\n\nCD: What do you mean?\n\nMe: She said follow the schedule strictly. Let's do that. We all know it won't work. I've been here a month and can see that plain as day. So let's follow the rules so hard they come back to bite her in the ass.\n\nOM: I'll document everything to a T. I'll make sure we're covered, because this will blow up in our faces otherwise. \n\nCD: You seriously want to do this? It's going to be a very hard week.\n\nOM: She's put us in a box. I like his idea.\n\nCD: Alright, everyone in?\n\nAll of us of course grimly nodded yes. Some days you can have as many as 15 appointments scheduled on your calendar, with many being first time appointments we pass around as needed. Those people would have to stay until everything was completed, or the clients got pissed off and went home. \n\nEach day was worse than the last. Monday was tough, but most Monday's have relatively high cancellation and no show rates. It's Monday right? Everyone hates Mondays. \n\nTuesday was a nightmare. The complaints started rolling in slowly but surely as people had 2+ hour wait times. I was there until 6pm, one of the other therapists (as well as the front office staff) was there until 8pm. No one can leave until the lobby is cleared. \n\nWednesday was hell. People who had left/no showed on Monday and Tuesday had rescheduled for Wednesday. Complaints were piling up, and our complaint box had to be emptied mid day to allow the stuffing of new complaints. \n\nThursday was worse than the apocalypse. 3+ hour wait times, as no one had been helping each other out all week and we were all backed up as a result. Regular appointments take precedence over first time appointments, so newcomers kept getting pushed farther and farther back. Security had to be called because an actual fist fight broke out between 2 people who had been waiting for nearly 3 hours due them arguing over who would get the first appointment.\n\nDuring those four days we only were able to see around 60% of the scheduled appointments who checked in. That is unheard of, as normal numbers are closer to 95% kept/seen ratio. We also had an explosion in complaints, and while I don't have any numbers of how many we receive on average, this was way more than average. OM had been scanning and forwarding the complaints as well as our daily number to the VP, and on friday VP came back to our office.\n\nShe didn't call an all hands meeting this time. VP only met with CD and OM, but there was some shouting that could be heard from the conference room. VP was pissed, but OM had the documentation to prove this was VP's fault, and after 15 minutes or so VP left with a door slam that said she was very pissed at us. OM called us all into the conference room.\n\nCD: The VP has reversed her policy. We'll go back to doing things the way we were before.\n\nMe: I assume she didn't apologize for causing us all that grief this week.\n\nOM: No she didn't, but I'm authorizing overtime for everyone who stayed late. Even the salaried people. You guys deserve it. \n\nThere were a few more minutes of discussion, but generally we were all happy for a few hours of extra cash in our next checks. Aside from the front desk staff, god bless them, we all had extra down time during the day because instead of helping coworkers out, we watched youtube videos and goofed off. After all, what else could we do? Those client's weren't on our calendars for that time!",
        "created_utc": 1529343834,
        "upvote_ratio": ""
    },
    {
        "title": "Petty compliance at a restaurant",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/8s1d2i/petty_compliance_at_a_restaurant/",
        "text": "I had almost forgotten about this story, but one of the recent posts reminded me of my own malicious compliance. It's pretty short!\n\nWhile I was still in high school, I worked at a local restaurant in the kitchen. There were only about 5 of these restaurants total, and they operated pretty old-fashionedly. It was your typical steak and spaghetti house, and they still used handwritten tickets for orders. I was typically in the \"coordinator\" position of the kitchen, so basically I was like the computer. Servers placed their handwritten tickets on a wheel, and I would take the paper off the wheel and delegate the different parts of the order to the kitchen. After everything was made, it would all ideally come back to my table simultaneously so I could give the servers the order for the guest. I also had to pay attention to any special requests and the quality of the food leaving the kitchen.\n\nSo one Friday night, after a large dinner rush, everyone is trying to clean up and get ready to get their side-work done and leave. A server comes back to the window and says that the customer is unhappy with their pepper-steak. They didn't want any marinara sauce on top. A pepper-steak at our restaurant was just some diced steak tips with some medley of vegetables with marinara sauce on top. They bring us back the food, which I throw away because you can't take the sauce out of it.\n\nWe made an entirely new meal for the customer and sent it out. The server comes back a few minutes later:\n\nServer: Where did that other pepper-steak go that I had brought back?\n\nMe: I threw it away since it was covered in marinara, and they didn't want the marinara.\n\nServer: Well she wants a new one to take home to her dog.\n\nI started arguing with her that it was ridiculous for us to make another meal for free so she can take it for her pet. The front-of-house manager steps in and tells me to make another one regardless, as does my kitchen manager. So I had the grill cook make up another meal and box it up for this person's dog.\n\nAs I am the last person it comes across before it leaves the kitchen, I slap down a bright red streak of marinara across the top - exactly the same as the one we had already thrown away.",
        "created_utc": 1529343074,
        "upvote_ratio": ""
    },
    {
        "title": "Cheap engine oil, alright!",
        "author": "SrdelaPro",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/8s0gol/cheap_engine_oil_alright/",
        "text": "To preface the story, I was working in a water sports center. We had parasailing, all sorts of towable inflatables (which i will refer to as \"tubes\" in the rest of the story) which were towed with a jet ski, pedalboats, windsurf board, kayaks and wakeboarding.\n\n\nOne day, due to the increased volume of work and getting a crazy shark crazy ufo (big inflatable couch) my boss got a brand new yamaha fzs svho 260hp jet ski.\n\nMy job was pulling the tubes so the jet ski was my responsibilty. Keep in mind that you have to rinse the engine every day with regular water because the salt fries the electronics and corrodes everything and you have to change the oil every 7 days since it operates for 8 hours a day.\n\nI asked my boss to give me 75 euroes for 5l engine oil that goes into that engine (yamalube 10w 40) and he said that it's too expensive and that I was to buy the generic engine oil and pour it in. Allright boss!\n\nAfter 2 hours of work, the oil started smoking from the engine, I couldn't get more that 6,7k rpm (the engine goes up to 8k), after 5 days the supercharger stopped working, after 10 days, 2 cylinders broke at once and the engine was basically in a need for an overhaul. Total loss was around 10k euroes for the jetski and another 10k lost revenue that the jet ski generates.",
        "created_utc": 1529336277,
        "upvote_ratio": ""
    },
    {
        "title": "High School English MC",
        "author": "askylitfall",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/8rzydm/high_school_english_mc/",
        "text": "Not sure if this fits in the subreddit, but I was reading up on an askreddit thread that reminded me of high school.\n\nIn my senior year English class, we had to read Frankenstein and then write a paper on it. I can't remember the exact wording of the assignment, but it was something like \"Demonstrate your knowledge on the book,\" mostly a \"prove you read it and understood the underlying themes\" type assignment, and the teacher was very big into not assigning page counts, rather letting the essay be as long as it needed to be.\n\nSo I procrastinated on the assignment until due day, but I had read the book. I had to come up with something in the ten minutes or so between class, so I ripped out a piece of notebook paper and wrote, very sarcastically, \"I refuse to pursue knowledge after reading Frankenstein.\"\n\nThankfully, my professor understood that that meant I had read it and just been too lazy to write an essay, so he gave me an extension, but that's the closest I've been to having a sarcastic shitpost of an assignment be accepted. ",
        "created_utc": 1529332362,
        "upvote_ratio": ""
    },
    {
        "title": "Maliciously Compliant Manager",
        "author": "Internal_Fortune",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/8rzibn/maliciously_compliant_manager/",
        "text": "This happened a few years ago, whilst working for a famous chicken fast food place, our store was in a food court, so customer complaints were always face to face, and gee some people could be plain rude.  TL;DR at the end :D\n\nOne night I was working and this particular customer had ordered a chicken burger and large fries.  About 15 minutes after making their initial order this person came up to me complaining that his fries were too salty and wanted some new ones.  \n\nSure thing sir can I have your  chips so I can throw these out and replace them.  (Now we were required to ask the manager to approve all refunds, but when it was busy and someone was complaining about fries, it is easier to just throw the fries away and replace them.  Its not as if we are replacing a 21 piece feed.)\n\nThe customer handed me the box and there was probably 10-15 fries left in the box.\n\nMe: Sir, you've eaten nearly the whole box.\n\nC: I was hoping that they would get less salty as I ate them...\n\nMe: I can't replace these.\n\nC: Yes you can, there's fresh ones behind you.\n\nMe: No worries I will just get the manager to process that for you.\n\nI call my manager over and he listens to the customer's story about the salty fries.  The manager also argues that there is only 10-15 fries left and if he had brought the whole box back we could have given him a new large fries.  \nAnyway this customer starts getting louder about his shitty fries and how we need to fix his problem.\n\nMy manager looks at the customer, tips the fries onto the bench counts them, turns around counts the same amount of fresh fries into a new box and hands them back to the customer.  The customer looks absolutely stunned and turns around and walks off whilst I walk to the back of the store in fits of giggles at my manager's malicious compliance.\n\nTL;DR: customer thought fries were too salty and wanted us to replace the 10-15 remaining fries with a fresh box.  My manager counts how many fries are left and replaces only that many.\n",
        "created_utc": 1529328589,
        "upvote_ratio": ""
    },
    {
        "title": "Maliciously Compliant Busboy",
        "author": "jisuanqi",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/8rxc8r/maliciously_compliant_busboy/",
        "text": "Years ago, I worked as a busboy / dishwasher at a very famous local restaurant in my hometown. It was popular with locals and tourists alike, and thus it was extremely busy most of the time.\n\nNow due to it being so busy, there was often a high level of stress. My busboy colleagues and I handled it well, being high school boys. The older ladies who were the main core of the wait staff were like nagging moms who totally hated us, despite being the ones who made sure tables were cleaned, set, and ready to go for more customers, whose tips were not shared with us.\n\nAs busboys collect stuff from tables, we were constantly finding personal items left behind by diners. Umbrellas, lighters, keys, etc. We were told that, in no uncertain terms, that all items go to the (extremely bitchy) hostess at the front counter, where they are placed in lost and found.\n\nOne hellish Saturday night, we are closed technically but still have a waiting list of customers to feed (they would just not allow any more to be added to the list. So a 10PM closing time meant the kitchen often shut down at 1AM. Busboys then had to clean everything up AFTER that)\n\nOne of the naggiest waitresses interrupts me from cleaning one table to go and clean another in her section. \"You're affecting my ability to make money, and I'll have you fired if you keep it up\" was what she said to me.\n\nSo, I hopped over to her table, mainly to get this lady out of my hair. It was actually three tables pushed together. A huge party. I saw her tip on the receipt, which was tiny given the amount they spent. Laughing to myself, I notice an Amex Centurion card halfway wedged under a plate.\n\nI immediately run over to the counter to bother the evil hostess lady. \n\n\"Someone left their card at the table.\"\n\n(Looking bothered at me) \"For fuck's sake, just take it to the guy and leave me alone. He's walking to his car\" (points out of the front window)\n\nSo you want me to stop doing my job, and go against policy? Sure thing.\n\nI manage to catch the guy as he was getting into his car with some of his friends. \n\n\"Excuse me, Sir. I believe you left this at the table.\" \n\n\"Whoa. Thanks! You saved me a whole lot of trouble. I will be needing this later tonight\"\n\n (We live in a town with loads of casinos and resorts. Amex would have gotten him a new one in no time, but he was happy to not have had even that minor obstacle)\n\nAnd he pulls out his wallet, puts his card in it, pulls out 3, 100 dollar bills, and hands them to me. \n\n\"Sir, I can't take this!\"\n\n\"Please do. And make sure you let my waitress know. I love this place but she was really the worst tonight.\"\n\nSo I come back in, the hostess is furious.\n\n\"Where the hell have you been? Tables need bussing!\"\n\n\"I did what you said. I brought that guy his card.\"\n\n\"We are paying you to work, not hang out in the parking lot.\"\n\n\"Well, they are paying you to handle lost and found, but you sent me after that guy, who made it worth my while for going out there.\"\n\nAt this point I showed her the money, and bitchy waitress showed up to claim that I had taken her tip. Luckily, the tip was on the receipt and wasn't left on the table in cash.\n\nI suggested she contact the manage to review security footage, at which point the issue was dropped.\n\nI wish I could say that from that point on, they were a lot nicer, but they just weren't. Every time their hatred of their support staff came back to bite them, they just grew more bitter.\n\nTL;DR: wait staff screws up, busboy reaps rewards.",
        "created_utc": 1529303037,
        "upvote_ratio": ""
    },
    {
        "title": "My Brother Stopped Doing His Work",
        "author": "STEVIE003792",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/8rwuq9/my_brother_stopped_doing_his_work/",
        "text": "Mobile so sorry for formatting. \n\nSorry if confusing.\n\nWhen my brother was in elementary school he was doing relatively okay in that grade and decided to ask the teacher if he was going to pass the year. She made the ultimate mistake of telling that tiny child he was going to pass because he decided not to do any more work for the rest of the year which was about 2 and a half months left to go.\n\nNot sure if this is the correct area for this if not just say so.\n\nEdit: Something I forgot",
        "created_utc": 1529297229,
        "upvote_ratio": ""
    },
    {
        "title": "You want to call \"my\" manager even though I don't work here? Okay.",
        "author": "Clemen11",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/8rwaqo/you_want_to_call_my_manager_even_though_i_dont/",
        "text": "[removed]",
        "created_utc": 1529291226,
        "upvote_ratio": ""
    },
    {
        "title": "The time I passed algebra on a technicality.",
        "author": "GretaVanFleek",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/8rwa6u/the_time_i_passed_algebra_on_a_technicality/",
        "text": "Reading another recent post about not turning in homework reminded me of this short malicious compliance, and how I passed math class on a technicality my sophomore year. On mobile, so apologies for formatting. \n\n\nAs I said I was a sophomore taking algebra, and I'd hit a point in my high school education where I didn't really care at all about doing homework. I picked up on class material quickly enough and always did well to pass my algebra tests with at least a 90% score because the material came easy to me (I credit my first algebra teacher for making it easy and fun to understand - thank you, Mrs. S!) As a result I decided that I didn't need to do any homework at all for the entire semester because I already knew the material it covered, and so felt it was a useless exercise to me. \n\n\nMy teacher was obviously none too happy about this, and wrote many letters to my mom to say as much. He told me that I could be passing his class with an A if I'd just do my homework, that I would unavoidably fail if I didn't, but no. I flatly refused. \n\n\nSo the end of the semester came, I was failing the class by a dozen or two points, and one day my teacher called me aside after class to discuss my grade. I could immediately tell he was upset, but I didn't know why at the time. He'll be Mr. T for Teacher because I don't remember his name. \n\n\n&gt;Mr. T: GretaVanFleek, I want you to know first and foremost that I've rarely been so disappointed in a student for failing to even attempt to realize their potential.\n\n&gt;Me: Cool.\n\n&gt;Mr. T: I also want to impress upon you that if it were up to me, what I'm about to say to you would not be an option. If it were up to me, you would be failing and repeating this class next year, because despite the fact that you've proved you know the material through testing, you've blatantly refused to do any of the assigned homework for the class, and have been openly defiant when confronted about it.\n\n&gt;Me: ...\n\n&gt;Mr. T, with a sigh: But, because you've passed every single test that I've given you, I've been informed that apparently the district has a rule in place which says if you turn in ANY of the homework assignments - even a single one - and show mastery of the material through testing, which you have, then I'm not actually allowed to fail you. \n\n&gt;Me: Cool! \n\n&gt;Mr. T: So do you think you can manage that in your incredibly busy schedule, GretaVanFleek? Can you manage to turn in something - ANYTHING! - before the end of the semester next week?\n\n&gt;Me: Sure thing boss. \n\n\nSo, you know how this story ends. The next day I turned in the most recent piece of homework that he had assigned. I had answered a single question, and the answer I had given was \"X.\" Or, roughly translated, \"Something - ANYTHING!\" \n\n\nI got a zero on the assignment. A week later I passed the course with the bare minimum final grade necessary to do so. In retrospect I believe it was a 69. Nice. ",
        "created_utc": 1529291073,
        "upvote_ratio": ""
    },
    {
        "title": "I threw out the garbage like you told me to!",
        "author": "fibrepirate",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/8rw244/i_threw_out_the_garbage_like_you_told_me_to/",
        "text": "I'm 17, (this was years ago) and my mother decided we're going to go on a several thousand miles, or kilometres, trip from where we live to Toronto area.  My learner's permit had expired because she couldn't find the time to let me take my test and so she was going to be the only driver.  I couldn't even get it renewed because she would need to sign for it.  Okay, so she's stuck doing all the driving.\n\nNote that for future reference.\n\nAt the same time, the landlords were supposed to come in and repaint the apartment. The assistant landlord had come by multiple times during the day to ask when we would be leaving. So not only were we packing, but we took everything out of the closets, away from the walls, and more.  This was from the tenancy board and they were supposed to paint when we were away.\n\nNote that too.\n\nSo, we got harassed to go on our \"vacation\" earlier.\n\nIn the process of doing so, I would take bags, and bags, and bags down to the car.  Bags that were obvious for our luggage.  Then I had the garbage runs in between. She'd find garbage, bag it up in a grocery bag, and yell at me to take it out to the big bin below.  Bags for car - cloth or luggage.  Bags for the garbage?  Grocery bags tied with a knot.  Luggage - on the small bench we had.  Garbage? on the floor in front of the bench or where we hung the garbage bag.\n\nI obeyed. Everything on the bench went to the car. Everything that was a tied grocery bag went to the garbage.\n\nSee where I am going here?\n\nSo, we lock up the apartment and take off.\n\nAbout 4 hours in, she has developed a blister.\n\nAt 6 hrs, she stopped and searched through the luggage for the \"grocery bag with my shoes in it that I tied in a knot!\"  Searched through the luggage = tore the entire trunk apart in the middle of a road pull out.  She needed another pair of shoes, and fast.  A quick discussion, once she came down from ballistic, and it was guestimated that one of the bags on the floor that I had thrown out was her prized shoes.  I don't remember seeing shoes in any of the bags, but that's besides the point.  &gt;&gt;I&lt;&lt; threw them out.\n\nWe managed to get to the next mall, and found a Kmart (remember those?) and she bought two pairs of shoes - but no band-aids for her blisters, and kept on driving.\n\nThe entire vacation, I was grounded cause of her shoes, even though it was her fault.  If she had wanted the shoes, why weren't they in her luggage?  Of course, being grounded by her meant I got to stay in the AC in my room, while she and the rest of the family spent time outside.  No driver's license? Well, that meant she had to do all the driving.  Found out from my police officer uncle that I could have driven right across everything she drove and could have spelled her.  Found out the same thing from the border patrol when we made our trip back too.\n\nWe got back, and no painting in the apartment was done.  I laughed my arse off at all the work we had done and they, once again, didn't do what they were told to do.\n\nAnd where were her shoes?  Probably the landfill.  It took her years to replace them all, and I never had to make sure her shoes were someplace while I lived there.\n\nThe grocery bag I threw out.  Because she told me to throw out the garbage that was in the tied grocery bags.  That she was yelling and screaming at me to hurry up so she could keep on packing.\n\nTL:DR; Vacation. Pack the luggage, throw out the garbage. Pack the luggage in the garbage and it will get thrown out. \n\nAlso: make sure you have someone watching your place, especially if the landlords are supposed to fix things while you're gone.",
        "created_utc": 1529288851,
        "upvote_ratio": ""
    },
    {
        "title": "huge deals, awesome Wireless Headphones",
        "author": "mrupdated",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/8rvrs5/huge_deals_awesome_wireless_headphones/",
        "text": "[removed]",
        "created_utc": 1529286105,
        "upvote_ratio": ""
    },
    {
        "title": "\"Not on plate!\": 2 year old niece changing the game.",
        "author": "TheSexyMicrowave",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/8rvrqz/not_on_plate_2_year_old_niece_changing_the_game/",
        "text": "[removed]",
        "created_utc": 1529286094,
        "upvote_ratio": ""
    },
    {
        "title": "Sure, you can speak with my manager.",
        "author": "suprorganism",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/8rvpco/sure_you_can_speak_with_my_manager/",
        "text": "I was working the service desk at [enter grocery chain here] when I got a call from a customer. I am me, she is IC (irate customer)\n\n\nMe: This is the [town and store name] service desk, how can I help you?\n\n\nIC: Who am I speaking with?\n\n\n\nMe: The service desk\n\n\n\nIC: No, *who am I speaking with?*\n\n\n\nMe: The service desk associate?\n\n\n\nIC: *WHAT IS YOUR NAME*\n\n\n\nMe: Oh, [my name]\n\n\n\nIC: you know what, just get me a manager, you’re obviously going to be difficult.\n\n\nSo that’s just what I did, I handed the phone off to one of the most hard ass managers we have. I’m not even kidding this lady gets a kick out of arguing with people. She almost always gets her way, and it is beautiful.\n\n\n\nApparently IC wanted a refund on the meat that she purchased because it was too “gristly.” However this lady had already opened, cooked, put the meat into her taco soup, and then ate the taco soup. \n\n\n\nSo after hearing that explanation my manager did what she does best, and shut IC down. The pure confidence my manager spoke with was intimidating to me and I wasn’t even the one she was speaking to. IC yelled and hollered on the other end of the line, but my manager would not budge. After IC realized she wasn’t getting her way she said she was going to smear us all over Facebook and hung up.\n\n\n\nThe best part of this story, is that if IC had just talked to me, I could have done an exchange for her. Our return policy is very loose, and we have a satisfaction guaranteed on all food items. She still had the packaging for the meat, so I could have bent a few rules, and helped her out. However she wanted to speak to my manager, so that’s exactly what she got.\n\n\n\nEdit: you guys win, \"could of\" is now \"could have\" (ง'̀-'́)ง",
        "created_utc": 1529285402,
        "upvote_ratio": ""
    },
    {
        "title": "HAPPY FATHER´S DAY - mrupdated.com",
        "author": "mrupdated",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/8rv55d/happy_fathers_day_mrupdatedcom/",
        "text": "[removed]",
        "created_utc": 1529279934,
        "upvote_ratio": ""
    },
    {
        "title": "https://mrupdated.com/collections/computers",
        "author": "[deleted]",
        "url": "https://i.redd.it/b90movb3fn411.png",
        "text": "[deleted]",
        "created_utc": 1529279337,
        "upvote_ratio": ""
    },
    {
        "title": "I'm no till-girl.",
        "author": "MoonlightMeow",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/8ruz2v/im_no_tillgirl/",
        "text": "I work part time at a company where you get assigned to random bars in various venues around the city. Yesterday I was put in this particularly busy one which served an ungodly amount of guests who were there to see a famous musician. (The venue was a huge stadium and the event was almost completely sold out). \n\nThere were about 7 of us working behind the bar, but only 3 tills. In every bar I've ever worked in, the system is fine: You take the order, make the drinks, put it through the till and take the money. Done. However, *scoffs*... we don't do that here. Here, the manager's steadfast rule was that no one but three assigned people were allowed to use the till because that was their 'role'. The rest of us were only allowed to make drinks. If I so much as looked at the till, her sixth sense would bring her venomous self hurtling towards me and I would be lectured on staff rules for the next five minutes. Okay, whatever. That's the rules, can't fuck with that. Fast forward a few hours and the bar was heaving. I was taking customer orders, making the drinks and asking them to pay at the till at the other end of the bar. I was getting through the crowd, making as many drinks as possible, as quickly as possible, because if I slowed down my manager would start barking. The queue at the tills (where the customers had to queue up a second time just to pay) was getting longer and longer. \n\nThen, one of the assigned till-workers left. I have no idea where.  So the central till was vacant. I was standing near it handing people the drinks I'd made and once again directing them to the other till because under NO CIRCUMSTANCE was I allowed to use the till. Even though it would have cut down the queue by half. \nPeople were getting impatient. This one group of customers said 'Do you really expect us to queue up for a second time just to pay for our drinks. You're literally standing in front of an open till.' I explained to them the situation. 'Well can you bloody well hurry up and sort it out. If you don't, we'll just walk away.' I looked around and neither my manager or the till-worker were anywhere to be seen. \nThey were getting more and more agitated and mouthy. Then, I just kinda broke down and said 'There's literally nothing I can do. I really don't care what you do'. I maintained a lifeless stare as they scowled and me, and the whole group just walked away without paying. They must of had about £50 worth of drinks between them.  Minimum wage is not worth that stress. ",
        "created_utc": 1529278272,
        "upvote_ratio": ""
    },
    {
        "title": "Conffesception",
        "author": "River_tamm",
        "url": "https://www.reddit.com/r/confession/comments/8rt0lg/the_mods_removed_my_post_about_me_believing_i_was/?utm_source=reddit-android",
        "text": "",
        "created_utc": 1529274609,
        "upvote_ratio": ""
    },
    {
        "title": "You want me to work another shift? Sure, except for one thing...",
        "author": "rogeliana",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/8ru2as/you_want_me_to_work_another_shift_sure_except_for/",
        "text": "This was in a healthcare field, and someone had to be at the job at all times (as you might imagine, as you don't want to leave patients alone). The rule was that if someone called in sick or couldn't do a shift, and nobody else was able to cover the shift, that one of the supervisors would have to cover for them. They would HAVE to.\n\nThis one supervisor, Clara, kind of rubbed me and a lot of the other employees the wrong way. She wasn't awful but seemed not quite genuine.\n\nI was willing to work a little extra now and then, but I HATED 16-hour days, especially when you only had an 8-hour window to drive home, eat, shower, sleep, get up, and then drive back to work again. That's just inhuman. I'd do double shifts if I got next day off, but *hated* doing it when I had work the next day.\n\nSo one evening (I worked second shift) Clara the supervisor called me at work to say that the person scheduled after me couldn't make it and would I work an extra 8 hours (a total of 16 hours). And of course I would have to be back at work the next day. Clara knew that she couldn't make me do this and she also made it clear that if I didn't work the extra 8 hours she would have to come in to cover the shift for me.\n\nSo basically, I went to work at 3 pm and was supposed to get off at 11 pm, but she wanted me to stay at work until 7 am the next morning, then return back to work at 3 pm that same day.\n\nI hemmed and hawed. She was really trying to make me feel guilty for not wanting to do the extra 8 hours. I asked if I could come into work an hour later the next day (at 4 pm instead of 3 pm) so I could get a little extra sleep but Clara said no. (I don't really know why.)\n\nI finally had an idea (it wasn't \"malicious\" exactly but I had this inner feeling about her not being entirely on the level with me). I asked her, \"You typically have to get up very early in the morning, right?\" And she responded, a little too eagerly, \"Oh YES! VERY early!\" (I think she thought I was feeling sorry for her and her grueling early morning schedule, and poor her, she has to work this overnight shift too.)\n\n\"Oh,\" I replied, \"Then I have an idea! Why don't I work an extra 7 hours (until 6 am instead of 7 am) and since you get up early anyway, you can come in and relieve me then. That additional hour in the morning will give me some extra time to sleep before I have to rush back to work. That way all you have to do is get up a little earlier than you usually do instead of covering for a full shift!\"\n\nI could hear her pause and with a tone of barely disguised disgust, she said, \"Never mind, I'll just come in tonight at 11.\"\n\nI found out later that she never gets up early and she was just lying about being such an early bird.\n\nOh well, sucks to be you, Clara. I tried to work with you but no.\n\nI'm so glad I left that job a long time ago!\n\n**TL;DR: Supervisor won't compromise on scheduling, lies about her own schedule, and ends up having work 8 hours of overtime herself instead of just one extra hour.**\n\nedit: corrected a time error.",
        "created_utc": 1529269801,
        "upvote_ratio": ""
    },
    {
        "title": "Don't talk to you again? Sure thing.",
        "author": "TOO_AGGRESSIVE",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/8rsflf/dont_talk_to_you_again_sure_thing/",
        "text": "So this happened last month and I was inspired to post this after reading a good thread on r/bestof about abusive relationships (which you can read [here](https://np.reddit.com/r/TheBluePill/comments/8rcd58/when_trpers_talk_about_a_forcing_women_into_their/e0qgzz6/)), and I just wanted to share about how I finally cut out a parasitic friend.\n\nLet’s meet the main characters:\n\n**Me**: a late 20’s non-traditional college senior who’s juggling a part-time job, a volunteer position, full-time school, and leading/participating in multiple clubs/activities while maintaining a 4.0 (‘cause I’m working REALLY hard to be super hirable after graduation, and to maybe get that sweet, sweet, valedictorian status while I’m at it).\n\nIt’s important to mention that my part time job is working for the college in the main building, and my volunteer position is at the college’s radio station located at “Dorm A” which is right behind the main building.\n\n**AL:** a 21yo college junior who has no other obligations than school, which she is attending part time. I’m calling her       “AL” because she’s Always Late. She is also *incredibly* wishy-washy when it comes to making a decision and sticking to it.\n\nAL lives at “Dorm B” which is two blocks down the street from Dorm A and the main building, and does not have a car. It’s also worth mentioning that there is a 24hr shuttle service going between all these buildings I’ve mentioned.\n\n\\------\n\nSo it’s two weeks before the end of the academic year and I get a text from AL about needing to use my washer/dryer at my off campus apartment that weekend because she isn’t able to use the one in Dorm B. Not going into details, but the reason why she couldn’t use it was because a student (neither of us knew) had died the previous weekend in the laundry room. Understandably, no students could go in there in the meantime.\n\nDespite having laundry facilities at Dorm A (where AL has lived at previously) down the street, I figure that it’s understandable to want to get off campus, so I say of course, and ask if she could meet me at the main building Saturday after I get off of my job, to which AL says okay. About an hour passes and I get a follow up text from AL asking if I can also take her grocery shopping too since we have to wait for her laundry to be done anyway. Although I didn’t want to—I already had so much going on with finals—I figured I could use the time to get a few things anyway and agreed.\n\n*(I realize now in retrospect that I could have started saying no here to her requests here, but I have a history of not speaking up for myself and telling others when I don’t want to do something* *(which only enables these kinds of relationships of course)**. I’ve gotten much better at it as I’ve gotten older, but I can still be a bit of a push over.)*\n\nA couple days before our meetup, AL messages me saying that they’re able to use the laundry room again in Dorm B, but she’s spooked by it so she still wants to go shopping and do her laundry at my place, “oh and on Sunday instead.” I’m not shocked by her changing the day, or that she still wants to use my washer/dryer still, so of course I say it’s fine. I tell her that since it’s changed to Sunday, she should meet me at Dorm A after my volunteer shift at the radio station.\n\nAbout halfway through my shift, I get a message from AL, asking if I can just pick her up from Dorm B. At this point I’m starting to get frustrated because of the constant changing of the plan, but again, sure, it’s fine. I tell her that I get off at 8pm, and I’ll be there right after. It’s a max of a 5 min drive between the buildings so I wanted her to be ready to go because I was understandably tired and knew we still had to go shopping. As my shift winds down, I text AL as I’m leaving the station, telling her I’m on my way. AL texts me okay, but saying she’s still getting things together. Okay sure, so I head on over and text her that I’m parked next to the building and waiting, she responds okay and that she’s still finishing getting everything together. So I sit and wait for about 10 minutes before AL finally comes out with a *massive* bag of laundry. At this point I’m pretty grumpy and she notices, so as I pull away from the curb and she asks what’s wrong.\n\nI explain to AL that I’m frustrated with the changing of plans and having to wait on her after a long day, and that this is a constant (which AL does, literally 9/10 times) and it’s inconsiderate of my time. This is the first time I’d ever truly confronted her with these feelings—I’d danced around it in the past expressing my frustrations, but never head on. Now I didn’t yell or anything at AL, but I did take that frustrated mom tone with her—and I was really looking for a “sorry for making you wait, I appreciate that you’re doing me a favor” or just any kind of adult discussion about this from her and I would have deflated—but instead AL explodes.\n\nAL gets incredibly defensive, saying that she can’t believe I’d be upset at her, and that I should take her back to Dorm B immediately. So I shrug and don’t say another word and we sit in tense silence as I make it around the block to return her to Dorm B. As I stop in front of the building AL gets out of the car and turns around on the sidewalk and starts yelling at me, calling me a bitch, literally saying I’m a bad friend, telling me I’m holding grudges (apparently because I brought up the pattern of all the times I’ve been kept waiting for her), and other nonsense. I sat silently there and let her dig her hole for a minute so I could hear the extent of all the things she felt, to which I respond in a flat voice “Please take your laundry, I don’t want to be talked to like this anymore.”\n\nAL. was. Furious. She opens the back door and starts angrily grabbing her laundry bag and the laundry that’s spilt out, spitting between her teeth that I should never talk to her again. I shrug and I say again in a flat voice “okay” which makes her even MORE angry. AL finally grabs all her things and slams my car door, and stomps back into Dorm B.\n\nAs I’m sitting at a light on my way back home, I text her with a general message that basically expressed that I was sorry she felt that way, and that I would be honoring her request to not talk anymore. I then blocked her on my phone, and all social media, knowing that doing so was going to hurt her much more than me because I was one of Al’s few “close” friends who did quite a few favors for her. I guess I understand now why that is.\n\nAll said and done, it feels good to not have to constantly manage her and that friendship anymore, and it’s a weight off my shoulders. I’ve never just cut out someone toxic like this from my life before, but it really does feel good.\n\nedit: format\n\n**TLDR: friend who I was doing constant favors for yelled at me, calling mea bad friend and a bitch and to never talk to her again, to which I said okay.**",
        "created_utc": 1529255544,
        "upvote_ratio": ""
    },
    {
        "title": "I think this fits the bill",
        "author": "lanceparth",
        "url": "https://i.redd.it/1488lfvmak411.jpg",
        "text": "",
        "created_utc": 1529254885,
        "upvote_ratio": ""
    },
    {
        "title": "Stop watching the clock? Sure thing!",
        "author": "mermaid-for-this",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/8rrrgk/stop_watching_the_clock_sure_thing/",
        "text": "When I was 17 I worked as a swimming teacher at a pool in quite a posh area. Even though I was young I was a damn good teacher so trusted to take my own classes with the help of an assistant. \n\nI got the impression that some of the stuck-up mums didn't like that I was a teenager because they would always ask the other, older teachers for feedback on their child's progress. (Not, you know, the person who was actually teaching them.) They'd constantly question my lessons and teaching method, like asking why I wasn't teaching more complicated strokes when these kids were struggling to master backstroke. \n\nIt was really unhelpful for me to feel like I was constantly under scrutiny, they would sit in the stands like a coven and blatantly whisper about me while I was trying to teach. One day they finally went too fucking far. \n\nAt the end of my shift the senior teacher called me over and told me that the mums had complained that I was \"watching the clock too much\" and it looked like I didn't want to be there. For context, the pool clock was HUGE and took up most of the wall so it was hard not to look at it. I was teaching nearly 20 kids in one 30 minute class so timekeeping was important to make sure we covered every part of the lesson plan. These bitches were complaining about me making sure that they got the full lesson they were paying for. \n\nI'd like to say I immediately said \"Fuck them!\", but honestly I burst into tears. Teaching was the one thing insecure 17-year-old me was confident about and these women had taken that from me. The other teachers hadn't realised how bad it was and comforted me before helping me come up with a way to stand up to these shrews.\n\nNext lesson I didn't look at the clock once, going so far as to dramatically shield my eyes from it when I had to look in it's direction. Sure enough the lesson ran over and a third of the activities hadn't been done by the end. Becauses I wasnt concerned about time I didn't worry whether they were listening to instructions so behaviour-wise it was pretty chaotic as well. Being able to jump in at the deep end to finish the lesson was a big deal for the kids but I loudly stated \"sorry kids there's just not enough time\" and made them get out. \n\nThis time they had the guts to complain to my face at least. One of them told me her child would be very disappointed he didn't get to jump in and asked why the lessons wasn't very organised today. I ignored her attempt to guilt me and very politely told her that due to complaints about watching the clock I made an effort to avoid it this week and so the lesson structure had been affected. Then I smiled widely and stared at all of them waiting for a response. They had the decency to look embarrassed but after that they at least stopped complaining behind my back and asked ME about their child's progress.\n\nTLDR; Mums complain about teacher checking the time, so she doesn't!",
        "created_utc": 1529249405,
        "upvote_ratio": ""
    },
    {
        "title": "\"Finish your paperwork\"",
        "author": "PaneledJuggler7",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/8rrnwi/finish_your_paperwork/",
        "text": "So I do security and a few months ago I left my job at a plant manning the front gate.\n\nWe had a day shift and night shift. The day shift handles signing in contractors and logging the times they entered and left, just in case their parent company decides to double check their hours. Now, night shift usually doesn't have anyone come by and at midnight, they add up the total time each individual person was at the plant in military time and then add the total for every contractor on that page for a single number that allocates the total time for everybody. Sorry if it's confusing.\n\nAnyways, I usually had day shift which was 8 hours and there's one guard there who I really did not like. I'll use G for guard. G was to be my relief for the day and I had just finished writing down the exit time of the last contractor for the day. Like I said, day shift just logs entry and exit time as well as company name, contractor name, whether they walked or drove, inspected, etc. So as I get in my car and select my music, G walks up and basically shoves the paper in my face saying;\n\nG: you didn't do your paperwork.\n\nI do a once over and see I did everything day shift was responsible for.\n\nM: actually, I did my part. Day shift is over, it's yours now.\nG: well what do you want me to do with *this*?\nM: do your job and finish your paperwork.\n\nI was already off the clock and the plant security supervisor made it very clear we weren't to work unless on the clock. Next day I check our book for anything the captain wrote down and sure enough, there's a section about what day shift and night shift were responsible for. Did some digging and found a write-up because she didn't do her job since her paperwork was entirely wrong when I looked it over.\n\nTL;DR was told to do my paperwork that was already complete, co worker got written up for not doing her job. I'm sorry if this doesn't fit here.",
        "created_utc": 1529248428,
        "upvote_ratio": ""
    },
    {
        "title": "Religion Lesson Backfired",
        "author": "erichbacher",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/8rrjyf/religion_lesson_backfired/",
        "text": "When I was a sophomore in high school, I just could not be bothered to turn in my homework because I was an idiot. After failing a couple classes, my parents ended up moving me from the public school with my friends to a private Lutheran School nearby. It was substantially smaller than what I was used to, maybe 150 kids across 4 grades. \n\nTheir gambit paid off, I was mostly isolated from distractions and had a reason to focus on my schoolwork. I ended up getting all As that semester and they let me return to public school.\n\nBut while I was there I enjoyed it, despite it being a huge adjustment. For one it was the first time that I had encountered religion class outside of a movie. \n\nThankfully in retrospect, the class that semester was on world religions. I think if I had been required to learn some in-depth aspects of Lutheranism I probably would have been bored senseless. Over the course of the semester we learned about Islam, Judaism, Hindu, Buddhism, which was generally interesting, and briefly touched on many others including a segment on cults, which is where everything went a little sideways. \n\nI don't know if it's something particular to the sect of Lutherans that ran this school, or the teacher of the class himself, but as he presented the materials he made a hard-line argument that Mormonism was a cult. \n\nI took issue with this because my closest friend from childhood and his family were very active Mormons. I'd attended services and events with them. I didn't see anything different  about their church than the Methodist one I attended growing up. I've read in the intervening years some accounts of ex-Mormons that depict unhealthy situations, and some of the historic teachings  certainly give me pause, but can anyone point to a religion in which that is universally not the case?\n\nThe course material on cults referenced a list of 8 or 9 elements that were common to cults, as a sort of guideline for defining them. It even specifically mentioned that there wasn't a hard and fast rule, that these things can be found in other religions that are not considered cults.\n\n One that I remember offhand was that cults often have a strong central leader, which does apply to Mormonism, but also many other religions like Catholicism. They generally took the stance that when these elements became harmful to the lives of practitioners, a religion crossed the line into cult. \n\nFor a final project, we had to do an in-depth report on any of the religions that were discussed in the class. We were supposed to meet someone from the religion have a conversation with them and write about the central tenents of the religion, kind of an overview.  \n\nI opted to do my report on Mormonism. \n\nWhile still meeting the guidelines for the assignment, I also spent substantial time reviewing the elements from HIS OWN course material about what defines a cult, and tried to systematically demonstrate that Mormonism was not any more of a cult than other mainstream religions (emphasis on comparisons to Lutheranism), and also sort of poked at how weak and subjective a definition this really was compared to how certain and explicit he had been condemning Mormonism. By the time I was done, it was double the length it needed to be. (Remember, a year earlier I couldn't be bothered to turn in multiple choice worksheets.)\n\nA week later the paper came back to me, accompanied by stern, red-faced glares and with more red ink than black on it, including a full page of handwritten notes on the back about how I needed to be wary because I'd been tricked by the same kinds of lies that snared the followers of cults. \n\nA-\n\n\n\nEdit: spelling and grammar",
        "created_utc": 1529247457,
        "upvote_ratio": ""
    },
    {
        "title": "[Meta] Long time lurker, first time poster, sorry for formatting, on mobile.",
        "author": "GaianNeuron",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/8rr8b7/meta_long_time_lurker_first_time_poster_sorry_for/",
        "text": "[removed]",
        "created_utc": 1529244303,
        "upvote_ratio": ""
    }
]