[
    {
        "title": "He listened.",
        "author": "FierceFeyreisa",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/znt05k/he_listened/",
        "text": "As I’m scrolling through this thread, enjoying all of the MC stories, I tell my 2 year old to bring me a diaper. \n\nHe says “no.”\n\nI tell him that he needs to bring me a diaper. \n\nHe takes the dirty diaper that he’s wearing off and brings it to me. \n\nGuess I should have specified the kind of diaper I wanted.",
        "created_utc": 1671235207,
        "upvote_ratio": 1.0
    },
    {
        "title": "Guest complains about being sent to a 'no name' luxury hotel, gets sent to the bad side of the highway to a 'recognizable' hotel instead.",
        "author": "Remarkable_Panda952",
        "url": "/r/TalesFromTheFrontDesk/comments/znn0gp/guest_complains_about_being_sent_to_a_no_name/",
        "text": "",
        "created_utc": 1671232830,
        "upvote_ratio": 1.0
    },
    {
        "title": "Lawn Karen update",
        "author": "Nowjamessayswtf",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/znr5yw/lawn_karen_update/",
        "text": "Original post: https://www.reddit.com/r/MaliciousCompliance/comments/z8qbtk/lawn_karen/?utm_source=share&amp;utm_medium=ios_app&amp;utm_name=iossmf\n\nTLDR version: A customer bitched about me not removing all the leaves from her property, specifically the ones that were embedded in her pine straw. I went back and removed every leaf, along with the majority of her pine straw. She unsurprisingly called to bitch about the missing pine straw, at which point I told her that I would be willing to replace it for 400$.\n\nSo a week after the events in my initial post happened, I got a call from Karen. She asked if I was still willing to do the pine straw job for 400$. I told her I’d have no problem with it but asked why she’d want to use my services again when she wasn’t satisfied with my prior work. Apparently this lady “discontinued services” from 3 other landscape companies in the area and was having trouble finding anyone to do the job. I’m guessing that means they all fired her as a customer for being fucking ridiculous. I went and did the job this morning and upon finishing, she was at least content enough with the work that she requested bi weekly landscape maintenance moving forward.  I politely declined and when she asked why, I told her the truth. “Ma’am, you seem to be a bit unreasonable and I don’t have the desire to deal with it”. It didn’t go over too well, but she paid for the work today and I left. Anyone wondering why I’d go back for the one job in the first place….it was an easy 200$ profit for an hour of labor, why not?",
        "created_utc": 1671230163,
        "upvote_ratio": 1.0
    },
    {
        "title": "Oh water costs 2,5€ per glass? could I have ten?",
        "author": "urbandrawer",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/znqdf0/oh_water_costs_25_per_glass_could_i_have_ten/",
        "text": "So I'm at a short sea cruise between countries. Still very much intoxicated while writing this.\n\nIt's nearly midnight and I've been heavily drinking at my office part, because of mixed timetables I couldn't stay overnight. I take a taxi to the ferry, just cutting a few minutes short of being stuck in a foreign land for the rest of the night. \n\nOnce I got to the ferry, I did some short tax-free shopping and landed next to a cafe. I first ordered some food to reign in the hungover, but still needed liquids. I went to an on board care with a few cans of juice.\n\nAccompanied with some juice, I asked for a glass of tap water. \n\"No can do\", the glass of perfectly ordinary tap water costs a whopping 2,5€, or roughly as much as a 1,5l of Coca Cola back home. I noted the blown out price to the cashier, and asked for 10 glasses while I was at it. After all, I had a very thirsty party of one to keep happy. \n\nIn the end they refused to sell the water noting the ridiculousness or paying a quarter of 100€ for just under 2 liters of water.\n\nIn the end nobody won, well maybe the ferrying company. Whelp, I had my fun. Still very thirsty however.",
        "created_utc": 1671228110,
        "upvote_ratio": 1.0
    },
    {
        "title": "You want me to follow a script? Sure thing...",
        "author": "Bii4x4",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/zno7sr/you_want_me_to_follow_a_script_sure_thing/",
        "text": "Years ago, I worked at a call center doing tech support for a large company with multiple different services. I specifically worked on the \"You-Verse\" service... In a call center of 1500+ agents, I had the fastest call time, highest customer satisfaction rating, and lowest callback numbers (customers calling back within 48 hours for any reason, even unrelated issues/questions). So I ended up being the target of a lot of audited calls to see how I was doing it.\n\nNow we didn't have any rules about goofing off like using accents, etc... So I would see a local number calling in and drop my strongest southern drawl accent, or a New York number and give them the old Brooklyn pissy attitude. Customers think they got someone local and started chatting about local events, sports etc. But I also never followed the script... Literally never, and this was unacceptable to management.\n\nGot a performance review with some audited call feedback. I needed to follow the script. Doesn't matter I had the best metrics in the building, but I needed to follow the script exactly. \"Sure thing boss.\"\n\nEvery call for the next week was in an Indian accent, and half of my calls hung up before providing any information. Guess they wanted to call back and try to get someone in the US. Feedback from management came down facility level. \" Absolutely no accents allowed on calls, follow the script and no joking around.\" Sure thing.\n\nI followed the script to the exact letter, and when there was no scripted response, I repeated the last script again, multiple times, until there was an applicable script. All of this was in a perfect Ben Stein monotone voice with no accent. The numbers for the entire facility went from green on everything to red.\n\nThe problem management didn't anticipate was that despite being there less than 6 months, I had learned how to fix tier 3 issues as a tier one tech, and I would fix all of these issues for other techs. Now, the script requires I escalate to tier two, and they would have to escalate further. Call time average went from 9 mins to 25+. Customer satisfaction tanked. Repeat calls skyrocketed because the script had us tell them to try something we knew wouldn't work and call back tomorrow.\n\nManagement lost all their bonuses and they began asking me to train everyone and make some new scripts and get metrics back on track.\n\n\"I'm sorry, that's not in the script, I am only following directions.\" Done, once again, as Ben Stein. I walked 9ut a week later for a job closer to home that paid more and didn't require dealing with customers. The call center closed 3 months later.",
        "created_utc": 1671222480,
        "upvote_ratio": 1.0
    },
    {
        "title": "Oh you want individual emails? You got it.",
        "author": "phantommichaelis",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/znnj5q/oh_you_want_individual_emails_you_got_it/",
        "text": "Short little story from my new job I've had for a month. I recently moved to a new state and got a new job managing an office in a medical field. \n\nEvery morning, one of my responsibilities is emailing a list of patients by the type of appointment they had and the details of their appointment (called an encounter) to Records from the day prior. I separate documents by type of appointment and attach the files to a single email with the date. Having worked in records before, sorting by date and having sub-categories for type was easiest for me,  and this is the way the new place trained me to do it.\n\nAfter about two weeks of doing it the way I was told/the way I thought was easiest, I got a very abrupt passive-aggressive email in response. \n\"Send encounters each in individual emails. Thanks, AngryRecordsPerson. \" \nI tried to reach out for clarification. Do they want an entire list of one appointment type in an individual email? How the heck do you want it done? Just tell me. There was no answer from my question, so I just continued to send it how I was taught. \n\nAnother week goes by, and I get another passive-aggressive email. \"Per my last email, send encounters each in individual emails.\" No please, thank you, or response to my questions at all. \n\nSo I maliciously complied. \nIt took about 2 extra hours of my time, but I did as she asked and painstakingly sent each encounter in a separate email. One single encounter per email. That equaled about 60 emails back to back to back instead of one nicely laid out email sorted by type. \n\n2 days of this and I quickly got \"Please stop. You are cluttering my email. You may send me one email with the encounter types attached. Thanks, AngryRecordsPerson. \"\n\nYeah, I thought so. I continued to send the emails how I was trained, and I haven't had a problem since.",
        "created_utc": 1671220751,
        "upvote_ratio": 1.0
    },
    {
        "title": "Friend’s mom laid off, maybe?",
        "author": "BurnerAccount6767",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/znifc2/friends_mom_laid_off_maybe/",
        "text": "Long time fan of the page, first time posting. \nMy friend’s mom recently had to take time off of work due to an injury on the job and received workers comp (she works for a small plumbing company, less than 10 employees total). She is ready to return to work, but her boss says there’s “no work” for her at this time. In her absence her boss hired a new worker. We know from coworkers that there is plenty of work, and personally I think this is some sort of retribution for her taking the workers comp time off. I am hoping there is some sort of law or federal guidance that says her boss must lay her off if they can’t find enough work to pay her. She works hourly, so if she’s not on a job there’s no pay, and she can’t afford that at this time. If she is laid off she can get unemployment. \nTLDR: does an employer have to lay off an hourly employee if there isn’t enough work to pay them? How long can an hourly labor employee be unpaid by their employer before they have to call it a “lay-off”?\nThanks all.",
        "created_utc": 1671207410,
        "upvote_ratio": 1.0
    },
    {
        "title": "You say I can’t work over to catch up? Ok.",
        "author": "Keirazz",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/zngo5f/you_say_i_cant_work_over_to_catch_up_ok/",
        "text": "[removed]",
        "created_utc": 1671202936,
        "upvote_ratio": 1.0
    },
    {
        "title": "No purchase necessary? Don't mind if I do.",
        "author": "electron_sheepherder",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/zngkm9/no_purchase_necessary_dont_mind_if_i_do/",
        "text": "[removed]",
        "created_utc": 1671202697,
        "upvote_ratio": 1.0
    },
    {
        "title": "Tiny MC; no customer orders completed",
        "author": "PlatypusDream",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/zn619g/tiny_mc_no_customer_orders_completed/",
        "text": "Working as a seamstress, mostly putting group / school patches on uniforms.  Coming up to the end of the work day, about 20 minutes left.  \n\nThere were 2 orders left in my queue: the first had 4 patches, the second only 2 patches.  I had time to do the smaller order &amp; it would be shipped today. \n\nI started working on it *(was I given the right # of patches, the right size uniforms as listed on the order, put the order information on my job list for the day, etc.)*... but my supervisor insisted that I start on the larger order because it had been placed first. \n\nI've learned not to try to explain my reasoning, so returned the smaller order to the queue, got the larger one, and started checking it, changing the thread colors on my sewing machine, etc. \n\nGot **one** of the 4 patches sewed on before time to leave. \n\n.\n\nMC &amp; fallout: I did what the supervisor said to do, knowing that both remaining orders would be delayed (now shipping tomorrow); this is only the most recent instance of the supervisor not making sense or thinking things through",
        "created_utc": 1671165066,
        "upvote_ratio": 1.0
    },
    {
        "title": "Accidental Malicious Compliance",
        "author": "Lanky-Awareness-7450",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/zn5b3n/accidental_malicious_compliance/",
        "text": "\nDon’t know if this qualifies as truly Malicious Compliance, but some friends really enjoyed this so thought I would share.\n\nThis event occurred when I was in kindergarten.  I was learning to read.  When the class would go between rooms, everyone would line up and the teacher would walk us down the hallway.  \n\nOn this day, we were going from the music room back to our home room.  I was at the end of the line and we stopped at an intersection to let another class pass first.  While waiting in line, saw a red box with the words “Pull Down” on it in bright white lettering.  There looked to be a white handle under the letters so I pulled the handle….\n\nThe next day, our kindergarten teacher explained to our class what a fire alarm is and how we are only supposed to pull down on the handle if there is a fire…",
        "created_utc": 1671162708,
        "upvote_ratio": 1.0
    },
    {
        "title": "Won't pay me my travel time? Ok I will comply.",
        "author": "Bdrodge",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/zn3v1v/wont_pay_me_my_travel_time_ok_i_will_comply/",
        "text": "Another story posted here reminded me of this from many years ago.\n\nWas working for a large multinational installing new hardware/software and testing for a large client in San Francisco California. San Francisco was a 6 hour plane ride from my nearest airport. \nI had to be in San Francisco for Monday morning so flew out Sunday morning worked 2 weeks and flew home Saturday. \nSpent a week at home and repeat cycle. This went on for 9 months with 3 of us doing on site rotation with 2 people always on site.\n\nAirport limo from my house to airport was $80.\nFirst expense report I claimed 6 hours overtime for the Sunday fly out and 6 hours overtime for Saturday to fly home plus airport limo.\nOvertime denied. Why? I left from my home and not the office.\nCue compliance. \n\nAs a side note I closer to the airport than the office was.  I lived 30 minutes from airport. Office was 60 minutes from airport\nCome next Sunday I took a taxi from my house to the office. Taxi from my house to office was $80\nTook airport limo from office to airport. Airport limo from office to airport was $140. \nSince I started my trip from the office my overtime started from then. Time in the airport limo, time sitting in airport etc until I got to the hotel at the other end all accrued.\nNext expense report I submitted taxi and airport limo expenses and billed 12 hours for travel time each way. All approved.\nDid this for 9 months. Approved every single time.",
        "created_utc": 1671158229,
        "upvote_ratio": 1.0
    },
    {
        "title": "Try to trick me into eating a radish under the guise that it's a carrot? Okay, I'll bite...",
        "author": "BourgeoisMystics",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/zn2qxa/try_to_trick_me_into_eating_a_radish_under_the/",
        "text": "Last night I come home and walk into the kitchen where my mother-in-law and wife are standing with an an enormous bag of small carrot-shaped, white root vegetables. Exhausted from a long day, I absent-mindedly ask, \"are those \\*white\\* carrots?\", the existence of radishes, temporarily eluding my consciousness. My MIL and wife, in enthusiastic unison chime in that, yes, they are indeed carrots. \"Go ahead and try one\", my MIL encourages, with an overzealousness that brings me to my senses: no. NO, these are not carrots. Game on, mama, game on. I will eat this raw root vegetable and get you to as well! I rinse one off and snack into it as my wife and MIL attempt to stifle their giggles.\n\nI feign confusion at their reaction: \"what are y'all laughing about?\"\n\nMy wife laughs, \"whats it taste like?\"\n\n\"A carrot,\" I say, \"maybe a little less sweet.\"\n\n\"You're lying,\" my MIL shoots back. \"The lady who gave them to me said they're radishes.\"\n\nMy face betrays nothing. I have crunched the pungent, peppery taste and melded it into an earnest mask of enjoyment. The sporadic laughter from my wife and MIL has ceased.\n\n\"Well, I don't know \\*who\\* said that, but this definitely \\*tastes\\* like a carrot. Maybe I just got the one carrot mixed in with the radishes?\" I grab another, rinse it, and go to chomp town. Mid-chew I double-down, \"nope, these are definitely carrots.\"\n\nMy MIL, exasperated that either I am a master of deception or that she in-fact, \\*did\\* get the wrong bag of veggies, rinses one off, takes a massive bite, and immediately spits it back out. It is now I who am laughing. But not a tepid giggle. An uproarious guffaw of triumph. I have won. Now to get the taste of radish out of my mouth.",
        "created_utc": 1671154858,
        "upvote_ratio": 1.0
    },
    {
        "title": "Update on the situation where I am not allowed to drink water or go to the bathroom at work!",
        "author": "toomuchteatoday",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/zmyat8/update_on_the_situation_where_i_am_not_allowed_to/",
        "text": "[OG POST](https://www.reddit.com/r/MaliciousCompliance/comments/z9hckh/you_want_me_away_from_guests_at_all_times_so_they/.compact)\n\nSorry about lack of paragraph formatting guys I’m on my phone and freaking out. \nMy managers solution to my issue where I need to drink water and pee during my shift as a front desk agent at my hotel (see my previous post) was to revise the (already previously made and posted) next two weeks’ schedule and eliminate 8 shifts of mine! I am scheduled 16 hours for the next 14 days. Both on holidays that I don’t get holiday pay for because I’m within my 90 days. Mind you before I challenged this inhumane rule, I was working 40 hours a week consistently. I’m not sure if updates are allowed in this sub, but I am having an anxiety attack because I have no idea how I am going to even pay my utilities and eat now. :’)",
        "created_utc": 1671143467,
        "upvote_ratio": 1.0
    },
    {
        "title": "I'm not saying I did it, but I did it.",
        "author": "Sketchysiblings",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/zmvnh1/im_not_saying_i_did_it_but_i_did_it/",
        "text": "This semester has been a disciplinary shit show, and we teach preschool. These kids were at minimum 6 months old when the world shuts down for covid. They are wicked bright academically, but socially... oof. They make my squirrel for brains look like angels (my bio kids). I'm pretty fresh as a teacher but my lead has been doing this for well over a decade, even she is over some of our kids)\n\nWe have a school policy to ask parents to send healthy lunches, we have had kids come in with baggies of full size marshmallows. Kids who the parents admit the child has behavioral issues after consuming candy/to be sensitive to sugar coming to school with said behavioral triggers in their lunch etc. We have parents who will admit upon a negative behavior report that their kids ate straight up candy before coming to school, etc. This makes up at least half our class (less than 12), and all of them have perfect attendance...\n\nSure, it might not be the sugar.. but the sugary items has a direct correlation for MANY of our students. So save the sugar lecture, I'm using sugar to describe the types of foods for our story time here.. \n\n\nWe had our class party.. it was tame. Pizza, juice, chips, and a cookie for them to decorate and eat... I advocated for a few more treats for my kids, I was shot down mostly to keep costs down. My thinking was: why not? Let the parents see how they act when you send them in with cookies and marshmallows...\n\nSo, we have 100% parent participation today. All parents were with their kids as we handed out the cookies and then my lead, knowing my desire to get the parents in our shoes, hands me the icing to give a spoonful to each child. I knew then, I had to do it. \n\nEach child got a spoon FULL. Partially because I ran out of spoons and had to use knives and it was hard to judge how much I was getting out. Besides, nobody wants a bare cookie that can't hold its sprinkles.. \n\nOne parent goes \"oh wow! That's a lot of frosting!\" As I give a good glob to their child, this just so happens that is the be the parent who sends in undesirable behavior inducing foods. \n\nI came back, sympathetic: \"I feel you.. my kids (my bio kids) are eating the same thing with their classes too- least you can get out and let them run it out, mine have to come back to the classroom with me until the teachers leave, which is gonna be crazy couple of hours!\"\n\nMy kids class doesn't have the behavior issues that we do (first of all), even my kid who is in the other class of the same age group. And as a parent it grinds my gears what these parents are sending KNOWING the issues it causes, regardless of the rulebreaking. Regardless of being a teacher or not. It is academically/socially hurting other students (despite our best efforts to mitigate the issues). \n\nAlso my kids teachers pre-portioned their frosting into 2oz cups, half filled. Because they are smarter than me. \n\nMaybe we'll get less baggies of marshmallows in the new year.. or not.",
        "created_utc": 1671137306,
        "upvote_ratio": 1.0
    },
    {
        "title": "Ruin a Meter Maid's Day, Get a Free Burger",
        "author": "WarmWear2891",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/zmvk6p/ruin_a_meter_maids_day_get_a_free_burger/",
        "text": "[removed]",
        "created_utc": 1671137082,
        "upvote_ratio": 1.0
    },
    {
        "title": "Everyone needed to be trained. Including the computer servers.",
        "author": "skimtbca",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/zmu52a/everyone_needed_to_be_trained_including_the/",
        "text": "[removed]",
        "created_utc": 1671133562,
        "upvote_ratio": 1.0
    },
    {
        "title": "I did warn you this was a waste of time...",
        "author": "Tubist61",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/zmtox1/i_did_warn_you_this_was_a_waste_of_time/",
        "text": "Around 20 years ago I was working on a project to build out some new infrastructure in Brazil. Coming up to a weekend I got a call from my boss telling me I needed to go out to there the following week for several meetings over a couple of weeks. I responded saying that it would be better for a colleague to go as there were some things I was handing over and they would be better dealing with it because...\n\nIt was at that point in the conversation I was cut off and told I had better be out there or I could look for another job. A asked for confirmation by email that I simply had to go, got the email a few minutes later and went to see the office manager to get flights booked. Our office manager looked at my diary, asked if I was absolutely sure and I showed them the email from our manager. \n\nOK, the flights were booked and on the sunday I said goodbye to my girlfriend and got in a taxi to Manchester Airport. Booked in at Manchester then got the flight over to Paris Charles de Gaulle where I then spent most of Sunday watching planes take off and land. Boarded a flight from Paris to Sao Paulu at almost midnight and then landed in Sao Paulo at around 8 on the monday morning. I then had the 4 hour wait for a connecting flight to Porto Velho where I arrived at around 4pm. A taxi to the hotel and it was time for a meal and sleep. Up on the Tuesday and a trip into the office where I had one meeting and then had to head back to the hotel and pack my stuff before heading back to the airport for a flight back to São Paulo, sadly the return flight involves a stop overnight in Manaus before heading to São Paulo. Back at Sao Paulo on Wednesday morning. More hanging round until my flight back to Paris left at around 8pm, back to Paris and another wait in Paris before I arrived back in Manchester at around 7pm on Thursday night. \n\nFriday just happened to be Good Friday, a public holiday in the UK and if my boss had let me finish my sentence, I would have reminded him I was getting married on the Saturday and had a 3 weeek honeymoon vacation booked starting the week after I got married. I was in Porto Velho for less than 24 hours and had spent 4 days either on planes or in airports simply because he didn't listen. What the trip did allow me to do was buy my wife a rather nice gift from duty free on the way, plus I got a couple of business class amenity kits out of the deal. It cost the company a good few thoudand pounds for the tickets and I have to say it was nice sipping champagne with my feet up while being paid.",
        "created_utc": 1671132456,
        "upvote_ratio": 1.0
    },
    {
        "title": "Waste my time with small claims court will ya?",
        "author": "danexperiment",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/zmrgy1/waste_my_time_with_small_claims_court_will_ya/",
        "text": "My mother passed away in 2016, and one of the ways to keep her memory alive is to tell one of my favorite stories about her.\n\nI grew up in an Air Force town, and my mother worked on the base and it wasn't uncommon for spouses of people stationed at the base to offer babysitting services. More often than not, you would stay with a babysitter as long as you possibly could.\n\nThis story takes place sometime in 1989.\n\nMy sisters and I had been getting watched by a woman whose husband was in the Air Force and living in base housing. One day, while I was at school and my sisters were getting babysat, my mother received an urgent call at work. There has been a fire. She is old that everyone is ok, but there has been a fire.\n\nAs it turns out, the woman kept cigarette lighters in damn near every room in her house. A three-year-old kid she also babysat got a hold of one of the lighters and set one of the bedrooms on fire. Needless to say, my mother tells this babysitter that she will no longer be requiring her services. Mom finds another sitter and she thinks that is the end of it.\n\nThen the phone calls start coming from this babysitter telling my mother she still owes her twenty dollars for the previous week, which wasn't the case since my mother had paid her at the start of the week (the arrangement was to get payment for the week that was to come). My mom told her to pound sand considering that her carelessness could have resulted in my two sisters becoming seriously hurt.\n\nA short time later, my mother receives a notice that she is to appear in county small claims court over this twenty dollars. My mother once again tells this babysitter to go to hell, and that she'll see her in court.\n\nFor reasons unknown to me, it was decided that she ended up having to pay her the twenty dollars (the only reason I can gather is that the fire took place on a Friday and there was no advance notice of her not being needed any longer). The judge told my mother that she has thirty days to pay her by cash or check (late 80s, no debit cards). My mother did exactly as she was instructed....\n\n...By writing this woman forty checks for fifty cents. I was told later by my mother that she spent what seemed like an hour writing out the checks, one after the other. I then asked her why. Her reply was that both her and the babysitter both had accounts at the same bank, and she knew that you could only cash five personal checks a day. \n\nIt may be the most deviously brilliant thing I have ever seen.",
        "created_utc": 1671126984,
        "upvote_ratio": 1.0
    },
    {
        "title": "Cheesy Compliance",
        "author": "Emotional_Bat_279",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/zmr4au/cheesy_compliance/",
        "text": "This happened last week but I'm still giggling about it so hopefully it makes you giggle too.\n\nMy husband and I live in an area prone to hurricanes. This year we decided to buy some emergency hurricane food. They come in white little bags and you essentially rehydrate the food and cook it for 20 minutes. \n\nHurricane season came and went and thankfully we didn't have to touch our emergency supply but being curious as to how the food tasted we decided to start cooking and trying them out. We tried chicken noodle soup, stroganoff, cheesy broccoli rice and they were all pretty good. \n\nOn this particular night we wanted to try and make Mac and cheese which we both love. The supply came with powdered cheese and elbow macaroni in separate bags. The cheese packet had instructions for both single serving portions or you could make the whole bag of cheese sauce but would have to use two bags of elbow macaroni. Now I didn't have a tablespoon and I love to follow instructions so I was struggling to get started without the exact measurements. My husband told me \"Just make the entire bag and add the water slowly.\"\n\nNow I personally am very picky with leftover Mac and cheese and my husband knows this. So I reminded him about my pickiness and how he'd have to be the one who finishes the left over mac. He said \"I'm fine with it, I don't have a problem eating the same meal every day.\" A little jab at me that we both giggled about. \n\nI reply with \"Are you sure? This is what a single serving of macaroni looks like, keep in mind the pasta is going to expand.\"  He said he was sure. So I got to work. I started making the cheese sauce and boiling water when I get a whiff of the sauce. It's a strong, stanky cheese smell that I immediately know I'm not going to enjoy. I took a small sample and oof... It was strong. So I told him \"I'm out, this is all you. I'm gonna make myself some soup with an eggy.\" He shrugged but agreed the cheese was aggressively stinky for a Mac and cheese.\n\nWell half way through the cook time the macaroni expanded and I can see my husband's brain working which I start giggling about. He changes the pot of macaroni to a bigger pot now realizing how much fucking macaroni he committed himself to. We finish up cooking and start to eat. \n\nHe's got his plate of Mac and cheese and I've got my soup. I'm smiling as he struggles to eat the mac and cheese. The cheese sauce didn't exactly look good with the macaroni, kind of made it look dry to be honest. Half way through his meal he sighs and looks at the pot on the stove. Then looks at the plate in front of him and sighs again saying \"My eyes were bigger than my head.\" \n\nWe both laughed at his pain. He finished the mac and cheese in like 4 or 5 days. Ate it for lunch and dinner even though it basically became a brick after being refrigerated. I will give him props for sticking to his word though, I would've straight up chucked it in the trash. \n\nI love him bahahaha",
        "created_utc": 1671126110,
        "upvote_ratio": 1.0
    },
    {
        "title": "Sidekick",
        "author": "Julioscoundrel",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/zmqlzy/sidekick/",
        "text": "100% true story, from the olden days\n\nSidekick Part I\n\nBack in the days before computers and cell phones, I was drilling wells in central Texas for a major oil company, and I had a sidekick. The sidekick was large, somewhat belligerent, and only maliciously compliant.\n\nOne day we were out in the heat watching a well being drilled and he said “You know what we need? Music.” I didn’t say anything, but that evening he took off for the nearest city and came back with a very large and expensive radio. I commented on the amount of money he must have spent, and he replied “That’s okay, it’s going on my expense account.”\n\nThere was no way they would allow him to put a radio on his expense account, and I told him this. He just smiled.\n\nSo when we got back to headquarters and filled out our expense accounts for the trip, he showed me his. The radio was on it. He turned it in. He was called in to the manager’s office and was loudly told “You can’t put a radio on your expense account. It will have to come off.” I heard this clearly as my office was right next door.\n\nThe second largest corporation  in the world was actually very liberal with our expense accounts, but there were certain things they just would not stand for. Radios were one of them.\n\nIn those days, we used paper expense account forms that had horizontal columns for days and vertical columns for item types. And we make corrections with Liquid Paper/White-Out.\n\nSo about an hour or two later he brings me his revised expense account. The radio is gone, but the total, which was in the bottom right hand corner, had remained exactly the same. Meanwhile, every other dollar figure on his expense account had been whited out and changed. It looked to me like they had all been changed upward.\n\nSo he took it next door to the manager, and the manager looked at it and said “You’ve taken out the radio and changed things, but the grand total is exactly the same!”\n\nTo which my sidekick replied “Yes, it’s in there, but you’re going to play hell trying to find it.”\n\nThey gave up and cut him a check for the whole amount.\n\nSidekick Part 2\n\nMy sidekick was not the best of spellers, and neither was anyone else in central Texas. So one day when a vehicle got stuck in the mud and he had to go buy a winch from a gas station to get it out, he didn’t notice that the receipt was written on a plain vanilla receipt pad and instead of “winch,” it read “wench.” As in “Wench, $75.” I, feeling a bit malicious myself, did not bother to point this out to him.\n\nSo when we got back to headquarters and turned in our expense accounts, there was a cash item on his expense account labeled “Wench” for $75 with a receipt specifying that attached. We dropped them both off with our manager together and I went next door to my office to quietly wait for the certain explosion to come.\n\nAnd it was perfect. Our manager saw “Wench, $75” and yelled out, “Damn it, I knew that those sons of bitches were doing that, but I never thought any of them would have the damned gall to try to put it on their expense account!”",
        "created_utc": 1671124860,
        "upvote_ratio": 1.0
    },
    {
        "title": "2 dozen fajitas 2 minutes before close",
        "author": "Novel-Mistake7027",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/zmps8y/2_dozen_fajitas_2_minutes_before_close/",
        "text": "So, about 20 years ago, I was working my first job as a line cook and cashier at McDonald’s. as I’m sure everyone who’s ever worked in the fast food industry knows, you clean the stuff up early, you leave out what you know is going to be used and you make sure that everything is put away. Well, my location closed at 9 o’clock, at 8:57 someone comes through drive-through and orders two dozen chicken fajitas, we tell the gentleman flat out we don’t have enough of the fajita mix thawed for him to have two dozen fajitas, we would gladly give him what we had and give him courtesy coupons for whatever he wanted, free value meals, free dollar menu items whatever. These suggestions didn’t sit well with him, he wanted his 24 chicken fajitas. He screamed, he yelled. He wanted those fajitas. He sat the window, wanting those fajitas, needing those fajitas. so not wanting to thaw an entire thing of fajita mix in the microwave for 10 minutes after we’ve already closed, we took what we had, which was enough for 12 and we start throwing in some filler, diced up a grilled chicken breast, add some pickles, add some onions add some burger, add some Mac sauce, some extra salt some lettuce, pretty sure one or two even had a chicken nugget in them.\n\nNo complaint was ever made, we never saw him again. Why he needed those chicken fajitas so badly I’ll never understand, maybe he owed someone the fajitas and they took his life instead of our beat fajitas.",
        "created_utc": 1671122873,
        "upvote_ratio": 1.0
    },
    {
        "title": "I need to speed up my work. Everyone else is bored. Understood!",
        "author": "SaulTink",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/zmp9kr/i_need_to_speed_up_my_work_everyone_else_is_bored/",
        "text": "Context-\nI work at a paint plant, making water and oil based paints from base chemicals. We also do the packaging of the paints. \nCurrently, our main buyer is closed for 2 weeks, so we are barely making anything. On top of that, we are getting a new machine, and people are working on it today (thu) and tomorrow (fri), so we cannot make paint again until Monday.\nPackaging uses a compresed air pump and a trough with a spout at the lower end, we use a mallet to put the lids on, and stack 18 pails per pallet.\n\nWe had 2 batches of paint made, waiting a day for us to package them when we have nothing else to do. We started with a water based paint that goes into 5 gallon pails, usually 126 pails. On a normal day, it usually takes us about an hour and a half to package it, but, since we have nothing else to do for these 2 days, we are taking it extra slow. \n\nI'm waiting to do something, as one of the 2 odd men out, so I'm just checking my phone, sending a snap every now and then. 4 other guys are using theirs as well. After a couple of pallets are filled, I start filling up pails. I barely open the spout, letting a slow drizzle come out, same as the others. It's going a bit slower than theirs, though. \n\nThe supervisor sees and tells me to go faster, because everyone is bored and waiting for pails. I have my phone out, sending a snap, so he says to me \"you want to play on your phone? I'll do your job for you then. Go faster and get off your phone  everyone is bored. I'll do it for you, you want to play on your phone.\" \n\nI look at the 4 other guys on their phones and respond with \"You're going to bitch at me about being on my phone? Only me?\" And he just keeps saying the same stuff he said before. So I get frustrated and say \"alright, I'll go faster.\"\n\nI put my phone in my pocket and opened the spout all the way to full up the pails in just a few seconds instead of a couple of minutes. I end up filling 2 full pallets in under 10 minutes. Probably half the time it would take on a normal day. \n\nSupervisor goes next and opens the spout the same amount that I had opened it before, letting it go slow. We're about to finish up, and I'll be filling the last 2 pallets up just as fast as the others, giving us nothing to do for 2 days!",
        "created_utc": 1671121589,
        "upvote_ratio": 1.0
    },
    {
        "title": "I have to calculate all mileage from the office? Okay.",
        "author": "MageTomlan",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/zmm6m4/i_have_to_calculate_all_mileage_from_the_office/",
        "text": "I have a job that means that about half the week I have to visit various clients within a hundred mile radius using my own car. The company pays milage as long as you fill in a form saying where you went and how many miles you drove.\n\nI do this all the time, and I like to think I'm sensible with it, so I try to minimise the distance driven. For example, we have 3 clients approximately 90 miles south of work, so if I can I'll group them all together in a day and only drive around 180 miles on a round trip.\n\nI also live about 40 miles away from work, and have clients near my house, so some days I won't go into the office, I'll go see all them clients and only drive about 10 miles in a day and claim for 10 miles.\n\nThe story -\n\nOne day I travel to a big client that is 60 miles away from home. I travel straight there, spend the whole day there and travel straight home (as there's no need for us to go into the office every day as long as we're working). I did 120 miles and claimed as such.\n\nI put in my form a month later along with a few dozen other trips thinking nothing of it.\nThen I get a call from 'Compliance Carol' (not her real name), that goes something like this -\nCC - Two weeks again you visited [big client] and claimed 120 miles. But they are only 45 miles from the office so you should have claimed 90.\nMe - Oh yeah, as you can see from the claim I drove straight from home though, so I had to go further.\nCC - You can't do that, you have to calculate the distance from the office.\nMe - *having a slow morning* okay, so I just take the shorter of the two journeys?\nCC - No. All milage has to be calculated from the office. It doesn't matter how far it is. (she's instantly annoyed at my slowness and gets quite patronising). You calculate the distance from the office to the client and back again. NO exceptions. That's the policy.\nMe - Okay, got it. So I do that even if the actual journey is shorter? I claim for more miles than I actually did?\nCC - *Sighs* Calculate all milage from the office to the client and back. That's the policy. I don't want to have to check each journey. Just do it the way you've been told.\nMe - Okay. Thanks. Can you put that in an email to me so I don't forget please.\n\nShe does, and it mirrors our conversation (tone and all), plus she CC's in my manager and very frankly tells them to check my claims aren't wrong anymore. \n\nEnter malicious compliance.\n\nAs the email clearly stated that milage has to be from the office to the client and back, regardless of the actual journey it means a few things -\n- All those clients who live near my house, yep, I claim an 80 mile round trip for EACH of them. I see 3 in a day and only do 10 miles? Yep, I claim 240 miles.\n- I see three clients 90 miles away, I don't group them. I claim 180 miles for EACH.\n- I see a client on my way home from work, normally I'd only calculate the extra distance since I've got to drive home anyway. Nope, I can end up claiming 60 miles for a few hundred meter diversion.\n\nThe result - where my normal milage claim is around £2-300 a month, it now shoots up to £700.\n\nI did this tongue in cheek and walked the form over to my manager (I'd normally leave it on her desk but I thought she'd get a laugh out of it and tell me to redo it). She looks down at it, I see her eyes widen at the number. Without saying anything she opens her emails, reads the snotty email from Compliance Carol, looks at my form and says - 'Looks like you followed the rules to the letter'. She gives me a smile and signs the form.\nAt the end of the next month an extra £700 is on my wages and I don't get a call from Carol.\n\nThe cherry on the cake? Milage is 45p per mile and is supposed to cover fuel, servicing, insurance and depreciation of the car. I drive an old but efficient Ford Fiesta. My business insurance with extra miles is only £150 extra a year, there's no depreciation because its worth very little anyway and I did a mechanic apprenticeship in my youth so I maintain the car myself. Fuel costs me about £250 a month total. So in the last 3 months I'm up £1200. I have double checked with my manager twice since then and her response is - 'They set the rules and you're following them. Don't worry about it'.\n\nCan't wait for someone to work out what Carol's insistence on the rules is costing the company!",
        "created_utc": 1671113958,
        "upvote_ratio": 1.0
    },
    {
        "title": "Not going to remove the dirt you dumped on my property? Okay.",
        "author": "trw931",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/zmlwkm/not_going_to_remove_the_dirt_you_dumped_on_my/",
        "text": "I used to own the town home at the end of our building immediately next to an empty lot that was full of trees. The empty lot was a much lower grade and we had a large retaining wall built from stone that capped off our property about 3 feet before the property line.\n\nOne day, the trees started getting ripped out as it was clear someone intended to build. The process was slow. They hired two guys with a pickup to cut up all the trees and remove the debris. After about one year, they started bringing in dirt to better shape the property for building. They prepped 6 lots, right up to our property line.\n\nThis is where things took a turn. The team moving the dirt decided that they needed the grade to go higher than ours did, but they didn't want to do it properly. So they dumped pile after pile and used a small tractor. They crossed into our property with this dirt one day and when I saw it it was too late. The dirt was so high that they had completely covered our 3 foot gap between the property they were building on and ours AND completely covered our 3-5 foot retaining wall.\n\nI ran outside and started yelling at them to stop. The person turned off the tractor and brought out his supervisor. They told me they'd clean it up, but I said you have to stop now you are doing this wrong. They tried to tell me they would clean it up before the weekend so I let it go for the time being.\n\nFast forward to the weekend where they dug SOME of the dirt up, but not all. They left over half of it, and much of our retaining wall was still buried. They then BUILT A RETAINING WALL ON TOP OF IT on their side.\n\nI'd had enough. I took matters into my own hands. That weekend, I got out my shovel and started throwing the excess dirt into their property. But I specifically targeted digging out the area at the bottom of the retaining wall on my side of the property line. Creating a scenario where the wall would almost certainly collapse with no support and loose dirt.\n\nAfter an hour of digging I was approached by someone from the crew. They asked me to please stop and for my number for their boss. The boss called and asked what I want.\n\nTwo days later a crew of 5 to 6 was out there removing the entire retaining wall for a two or three day project, digging out the dirt they added and resurfacing our retaining wall. Then they rebuilt their wall correctly.",
        "created_utc": 1671113224,
        "upvote_ratio": 1.0
    },
    {
        "title": "Won't pay me for my cancelled event? Pay me to go instead!",
        "author": "Modokon",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/zmkvx7/wont_pay_me_for_my_cancelled_event_pay_me_to_go/",
        "text": "A few years back, I was working abroad for my company on a project and was away in California for 2 weeks, which turned into an unplanned **5 weeks** due to various IT problems.  This was 6,000 miles away from my lovely family and I was missing them.  It was tough, but I was senior project lead in my company and there was nobody else with my skills to fill in.\n\nRelevant later: I had an milestone birthday present which was driving a supercars around a circuit for a day. This was a big birthday present from my wife and worth around about £800 at the time. This event needed to be booked way in advance and the voucher was valid for 52 weeks.  Due to circumstances, I booked in week 50 of 52. \n\nProblem: Because the latter part of the unplanned extra 3 weeks overlapped the Driving Event day, I told my manager that I could not rebook as it was so late in and was non-cancelable. \n\nIf my company wanted me to stay that weekend, they would need to compensate me for the lost Event money.  My direct manager was fine with this, but the VP of IT point blank refused, saying it was \"unethical to refund a present\" to me and I should just attend it.\n\nOK then Mr Smartass VP!  Cost of flight back to the UK at short notice, returning the next day was £3,700 plus £200 in taxi fees to get me to/from home per company policy. So just under £4,000 in company expenses instead of paying me £800. 😊\n\n\n\n\nI had a speic",
        "created_utc": 1671110312,
        "upvote_ratio": 1.0
    },
    {
        "title": "Must not ask for our breaks lol ok",
        "author": "Artemis_Sapphic",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/zmjob7/must_not_ask_for_our_breaks_lol_ok/",
        "text": "This happened a few years ago (the manager has now stepped down). Cast: I- myself f 22 (19 at the time) N- manager f30? , not real initial of name! B- big boss man! Also ignore errors writing on mobile. \n\nSo N liked to go on power trips and say a rule one days and contradict herself another day. This one time she said (and wrote in our store group chat) that we were only allowed to take our breaks at the time that our online rota gave us, ok that’s fine cool. Then a few days later she told us (and again wrote in our GC)that we were not to ask for our breaks we must wait. Now always being put as a cashier on the main till we were often forgotten about for breaks. \n\nI heard that B was coming in and I knew I would be working a 9 hour shift (12-9)that day!  So cue malicious compliance, I as always was placed as the cashier on the main till, my break was due to be at 4:30 according to the online rota. 4:30 comes and goes and still no one comes to relieve me for my break, then in walks B who goes to check everyone’s time sheets for errors. B sees that my break time has come and gone and I still haven’t clocked out for my break. He asks N why I haven’t gone yet to which she replies: “oh well she hasn’t asked or reminded me that her break was due”\n\nThey get someone to cover me and I head to break, I call B over and show him. The messages that N had sent in the group which leads to N being made to step down and get reprimanded, I’ve never been so smug in my life",
        "created_utc": 1671106549,
        "upvote_ratio": 1.0
    },
    {
        "title": "Double check the invoices? Okay.",
        "author": "DarkwoodConsort",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/zmb6x4/double_check_the_invoices_okay/",
        "text": "  \n\nThis just happened this afternoon and I am still snickering about it. I recently started working in a small non-for-profit in the accounts payable department. When looking over a statement from vendor “M” I noticed there was 3 invoices where we showed they were paid but they did not. Okay let’s look into this. I have an obsessive personality to describe it politely and will spend an hour to track down a dollar balance. Oh, we paid amount X because they accidentally charged us sales tax. Our non-for-profit is completely non-taxable and we won’t pay sales tax. \n\nI sent a polite(ish) email to their accounting department. “Hey we were charged sales tax on these three invoices. Please issue credit.” No response. Next statement from M. Still there. Forward the email I originally sent add \\*\\*SECOND REQUEST\\*\\* and add a passive aggressive comment about “how is this coming”. \n\nResponse of paraphrased “Please send a tax-exempt certificate, fill out our form and double check your invoices to make sure that this location shouldn’t be charged sales tax.” \n\nOkay here we go. Double check my invoices sure. Here is a tax-exempt form again. They only get it twice a year at minimum. I pull ALL of my invoices for the this fiscal year and last fiscal year. Oh another invoice where we actually paid tax? I looked and we had paid a few invoices that shouldn’t have had sales tax. I requested our money back on ALL of them. It added to about five times the original total of my first request. \n\nI don’t know their response yet as this happened at the end of the day and will post an update. Thank you, vendor M! I wouldn’t have looked unless you told me to double check.",
        "created_utc": 1671075789,
        "upvote_ratio": 1.0
    },
    {
        "title": "Was soll ich machen?",
        "author": "Zealousideal_Gap_101",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/zmak9i/was_soll_ich_machen/",
        "text": "Mein Freund hat spaßeshalber gesagt, dass ich „ausgeleiert“ bin, woraufhin ich angefangen habe zu weinen. Er hat sich zwar mehrfach entschuldigt und ich habe auch gesagt, dass es okay ist und er das Gesagte nicht mehr rückgängig machen kann, aber seine Worte haben mich unheimlich verletzt. Das Resultat daraus ist, dass ich mich jetzt bei dem Gedanken, mit ihm intim zu werden unwohl fühle. Da ich vorher auch schon Selbstzweifel bzgl. meines Körpers und seinem Vergnügen hatte, war dieser „Scherz“ wie ein Schlag in die Magengrube. Vielleicht übertreibe ich ja auch, aber ich fühle mich richtig schlecht seitdem. Hat jemand Tipps, was ich tun soll?",
        "created_utc": 1671073878,
        "upvote_ratio": 1.0
    },
    {
        "title": "My work shift is 7am to 5:30pm? Sure!",
        "author": "Kaoz-Lord",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/zm9g1p/my_work_shift_is_7am_to_530pm_sure/",
        "text": "I used to work as a photojournalist for a local newspaper, I used to do a bit of everything there were days that almost all the newspaper was filled with pics I took, the work shift in the newspaper was kinda taxing as sometimes the work shift went from 8 up to 12 hours a day depending of the news and things happening in town.\n\nAfter 2 years here and there I was assigned to the Sports section, not a big fan of sports myself since I'm more of a computer geek, if it wasn't an e-sport I wasn't interested. But sports schedule was a bit over the top, there were times when there was pro Baseball, Basketball and even soccer in the city I was working at, that without even counting the school sports events... It was tiring as hell, we were 2 photographers working in the section but since the other guy was a little old the editor was more lenient with him.\n\nA year into the section and I was busted, I really mean it, super tired as hell, my wife was annoyed since I was leaving to work at 6am and sometimes back till 10pm and a times even later than that. In the weekends if there was too much events I surely was working, there was a season when I worked almost 2 months non stop, I mean it was all voluntary and I was paid A LOT for it.... I mean monthly I was cashing 7 or 8 minimum wages hence I was always available for them.\n\nMy editor was an old school journalist that was working in the newspaper since day one, we used to joke that the building was built around him and shit like that, he is a total grouch but sometimes can joke around and makes people forget he's got a temper.\n\nOn baseball season I was really tired after almost 2 months working non-stop, there was a baseball game gonna be held on saturday afternoon, my editor called me to his office to tell me that he needed  me on saturday, since I was totally busted but could really use the overetime I told him \"Sure, but for the game, I'll even be on the stadium and when the game ends I'll drive to the newspaper, deliver the material and go home\" my boss wasn't happy with that he wanted me ALL DAY from 7am up until closing since he had other events... I said no... and told him he should call the other guy since it was my weekend off and I really needed rest.\n\nNeedless to say he wasn't very happy with that, afterwards he was really bitchy with me in almost every occasion available and if I did something wrong he would scold me like if I were his son. Since sports is a sections that was an akward schedule I had some liberties with the check in time and at times I was up to half hour late... one day I checked in late only to find him right at the entrance waiting for me, he was super pissed... he scolded me for over an hour and after he was done he wrote me up with HR. \n\nThe memo from HR specified that the work shift was 8 hours and that I was to work from 7am until 5:30pm no more no less... enter Malicious Compliance... fron that day on I was at 7am sharp not a minute earlier not a minute later, sometimes I would arrive early but waited by the clock until it was 7am to punch in... and at 5:30pm I was out the door, it was already a week abiding by the rules when the editor came to me at 5:25pm he told me that there was this university basketball game, apparently they rescheduled and wanted the newspaper to cover it, the editor said sure and he wanted me to go... I just stated at him \"I would really love to go but as I recall in the memo HR made me sign my workshift is from 7am to 5:30pm... aaaand since it's 5:30pm.... I'll be seeing you tomorrow!\" the color from my editor's face went from white to anger red, his voice went a bit higher while he said \"If you go I'll be writing you up in HR!\"... With a devilish grin I just told him \"extra hours are voluntary... and I don't wanna do e'm\" and left.\n\nNext day I came in 7am sharp like a good boy and I sat in my spot, my boss came with a somber face and told me in the most fake sheepish voice he could muster \"Ok I guess there was a bit of misunderstanding with your work hours, since you work a bit over time when required the management said your workshift is a bit more flexible and you could be a bit later from time to time...\" I just smiled and said \"thanks!\".\n\nAfter that I went back to work but not full throttle like before as I was giving my family a bit more time and whenever the editor needed some extra hours he would ask the nicest possible way... Some companies like to go by the rules but when it doesn't favor them the same rules go out the window.\n\nSorry for the long post...",
        "created_utc": 1671070621,
        "upvote_ratio": 1.0
    },
    {
        "title": "MC Is the best way to teach children.",
        "author": "RatedMForMormon",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/zm57t1/mc_is_the_best_way_to_teach_children/",
        "text": "Reading these posts, I realize that I do much the same to my daughter. She's only two, but I think it still works.\n\nI have a couple examples.\n\nFirst is food. My daughter recently has hated getting in her high chair to eat food, she wants to eat by carrying stuff around the house and getting crumbs and leftovers everywhere, which drives my wife crazy. So I resorted to just not feeding her at all unless she was in her chair. \n\nYou don't want to sit in your chair? Then we won't feed you.\n\nNow she'll run to her chair when we get ready to eat.\n\nSecond is stuff I know will hurt her. You have to be careful not to let your child do anything too dangerous for their own good. Anyways, i would make oatmeal for our daughter all the time, and it comes out of the microwave/stove top piping hot, and I stick it in the freezer to let it cool down. \n\nDaughter freaks out that she's not getting her food NOW and is just constantly crying for it. One day I'm fed up with this behavior so I tell her it's \"hot\" and warn her it will hurt, she doesn't care (she's 2) and I feed her a tiny bite. It burns her mouth and she starts crying from the pain, spits out the oatmeal and everything.\n\nNow she is very patient when we say something is \"hot\" and she even mimics us blowing on the spoon to cool it off.\n\nHaven't had a crying fit about hot food since.",
        "created_utc": 1671059284,
        "upvote_ratio": 1.0
    },
    {
        "title": "You want to be part of the team? You got it!!!",
        "author": "leigh10021",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/zm4zpu/you_want_to_be_part_of_the_team_you_got_it/",
        "text": "So, I work at a middle  school  in which we are put on “teams.” That means all the teachers teach the same kids so they can best serve them. (We meet a few times a week to discuss issues, interventions, etc). They throw elective teachers on teams but they can’t really interact with the team in the same way because they have a different schedule/ kids from multiple teams etc…so they can’t be at meetings (and really don’t know all the kids on the team).\n\nTo be nice, we didn’t stress them with every little decision/email etc since they are pulled in different directions (for example - the music teacher has 7th and 8th graders from various teams but we only have a team of one third of the 7th graders.) most elective teachers appreciate not being included in everything because that would become overwhelming to juggle. One teacher, however, wanted to complain about not being included in the decision of our Halloween costume (electives usually do one together - which we know). \n\nYou want to be part of communication? No worries!! I decided to add him to our group text. You want to privy to everything? Be careful what you wish for. Ten people sending cat memes, complaining about administration, planning Christmas parties, asking about next year’s schedule, etc…..it’s mind numbing. Text notification after notification. One would think that you could just ignore the group, but of course, with 10 members someone gets left off from time to time, so the combo of people t ted always changes.  He eventually asked to be removed because it wasn’t applicable to him (mostly). Shocking…..",
        "created_utc": 1671058740,
        "upvote_ratio": 1.0
    },
    {
        "title": "No more time in lieu",
        "author": "littlewasknown",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/zm26s9/no_more_time_in_lieu/",
        "text": "So this story happen years and years ago. I work in health. The health care organization  was transitioning from paper payroll to a online one. It also important to know that you could take time in lieu instead of overtime. For instance work 2 hour overtime claim 3 hours time in lieu. You could take time in lieu only when there was staff to backfill you. Its health and backfill never happened so you could never take time in lieu leave, yet people still used to clock up a few hours of time in lieu just in case .\n\nWe are all sent off to a Q&amp;A session  about the new payroll where time in lieu is brought up . HR tells us that we all we need to take our time in lieu within 90 days or we will be paid out under the new payroll system as it was an award requirement  (i got paid out like 6 or so hours).Hr told us they understood under the paper system this didn't happen but it would now. \n\nOne of Nursing Unit managers asks can she cut a deal as she has quite a bit of time in lieu. She suggest maybe taking a day off a week or an hour a day until she runs out. She gets told there is no exceptions. We are all treated equally . She replies \"fine, I have over 600 hours in time in lieu.\" HR mouths drop open and than try to cut a deal in front of all of us. She tells them \"no everyone is treated equally. I will have the next 90 days off and you can pay me out the balance. \"  She did indeed have 13 weeks off and picked up a few weeks pay too. Hr also had to backfill her position for three months. When she returned she claimed overtime instead of time in lieu.\n\nHR could of cut a deal but choose not to. Cost them  13 weeks leave, a few weeks paid out and a replacement staff for the time the nursing unit manager was away.",
        "created_utc": 1671051915,
        "upvote_ratio": 1.0
    },
    {
        "title": "Aqui tem notícias em",
        "author": "Ranyellysck",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/zm1mhx/aqui_tem_notícias_em/",
        "text": "[removed]",
        "created_utc": 1671050490,
        "upvote_ratio": 1.0
    },
    {
        "title": "lost car sale",
        "author": "u2125mike2124",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/zlzw8h/lost_car_sale/",
        "text": "About 8 years ago was looking to buy a full size SUV after driving small sedans due to family.\nThis was going to be the first new vehicle I was going to purchase for myself for my own enjoyment. \n Did all my research before I even looked at dealerships went to one of the largest dealerships,\nall I wanted to do was a test drive .\nthe salesman kept asking me for my cell number.\n Finally got into the vehicle and he started pushing buttons and on the screen it said syncing. \n Unbeknowns to me this was one of the new features where you could actually sync your phone to the car itself.\n Did the test drive told him I'm gonna think about it I'll give a call in aday or two\n I got a call from him later that day ON MY CELL PHONE. that I never gave him \nwhat this creep did was sync my cell number to the car..\n Needless to say quite a few words were said by me to him, None of which should have been said in mixed company.\n Next day went to another dealership bought the car went back to the 1st dealership asked to see the manager and told him exactly what his sales person had did.\n Don't know and don't care what happened to that creep",
        "created_utc": 1671046146,
        "upvote_ratio": 1.0
    },
    {
        "title": "Not allowed to rent out our flat on AirBnB, no worries, we’ll get some druggies in instead…",
        "author": "BigBlueMountainStar",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/zlzo49/not_allowed_to_rent_out_our_flat_on_airbnb_no/",
        "text": "My mate owns a flat (apartment) in a converted house in a big UK city. The house had a total of 8flats and had a residents organisation and management company that runs the communal areas and overseas the rules for the building as a whole.  \nHe rented the flat out as he’d moved out to live with his girlfriend.  \nThe people who rented his flat, unbeknownst to him, then subletted his flat on AirBnB and were raking it in.  \nHowever, after about 6months of this, the management company called an emergency meeting of the residents organisation and highlights that subletting was not allowed in the contracts.  \nMy mate didn’t know his flat was being used as an AirBnB, this was the first he’d heard about, but the management company hit him with a threat of lawsuit for breach of contract (no previous warning given) if he didn’t evict his tennent (the one on the lease) within the next month.  \nHe put across some arguments and asked if there had been any issues, and none of the residents organisation could put forward any problems, but one specific woman (direct neighbour) was being particularly snooty and pushy about it. Some of the residents were even open to updating the contracts to allow it, but this woman was really pushy. There were other issues with this woman, but the AirBnB issue was the straw that broke the camels back.\nLong story short, my mate had to evict his tennent, but in an act of malicious compliance, he advertised his flat and specifically targeted people on rehabilitation lists, as there was nothing listed in the contracts that prohibited it. He didn’t need the money so was willing take a loss to mess with this woman. Ended up renting to an recovering drug addict with a criminal record. The neighbour was NOT happy!",
        "created_utc": 1671045558,
        "upvote_ratio": 1.0
    },
    {
        "title": "Big boss wants the restaurant quiet. Customers maliciously comply.",
        "author": "BuddhaMcDonald",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/zlybl7/big_boss_wants_the_restaurant_quiet_customers/",
        "text": "[removed]",
        "created_utc": 1671042238,
        "upvote_ratio": 1.0
    },
    {
        "title": "My music teacher thinks it's a good idea to ruin the day of my class",
        "author": "No_name_forever_man",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/zlwh1a/my_music_teacher_thinks_its_a_good_idea_to_ruin/",
        "text": "Ok, I know it's not that ridiculous than the rest of the stories, but... who cares.\nIn our school there is a music teacher who nobody, but absolutely nobody likes. She has always been very unpleasant to the students but 2 weeks ago she outdid herself. \nWe had a note about classical composers as our work with textbook and then the lady asked my friend to name them. He named a few and then said he didn't know any more (being dyslexic he was slow to read). The lady scolded him for not knowing and then told him to read more from the textbook. He started to read, but got confused. The teacher got mad at him and told him to write it correctly on the board. Suddenly the lesson ends so everyone wanted to leave but the teacher said \"you won't leave until he writes it few times correctly on the board\". The next lesson was P.E. so no one had time to change, so we were scolded by the P.E. teacher too.\n Super teacher, huh, makes me wonder who normal hires such people to work with children.🤮",
        "created_utc": 1671037916,
        "upvote_ratio": 1.0
    },
    {
        "title": "Please help me",
        "author": "Mmg141",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/zlswql/please_help_me/",
        "text": "I don't know if my post will get removed but there is no better place than this to ask for a malicious compliance advice. English not my first language.\n\nSo I (19F) go to class with S (24M). I sit in the back, next to the smart girl. S has been telling me how he needs to sit next to her because he's behind in some classes and therefore he needs more help.\n\nToday I sat in my place like I always do and on the lunch break I came to the class and found that he had moved my things to his desk and his things to mine.\n\nI told him to move and even tried to put my things back but he told me to \"stop being a child and just accept it\"\n\nSo I don't plan on fighting him, but I cannot stand losing so, do you have any ideas on how to malicious comply to his commands?",
        "created_utc": 1671029360,
        "upvote_ratio": 1.0
    },
    {
        "title": "Dad Hated The Guy She Dated (me) Kicked Her Out Of The House.",
        "author": "ty10drope",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/zls3kd/dad_hated_the_guy_she_dated_me_kicked_her_out_of/",
        "text": "This one’s kinda short. Might be MC or just a tale as old as Antony and Cleopatra. \n\nWe went to the same high school, but didn’t start dating until I was a young city worker and she was a sophomore in college. Like the title says, dad objected to “how things looked” and kicked her out of his house. \n\nShe was literally homeless and needed to stay at my apartment just for a few months until the end of the semester. Let’s fast-forward a few decades. Her dad now has two tall, intelligent, athletic, successful and beautiful (/humblebrag) grandchildren and two cute-as-a-button great-granddaughters. Apparently, he became OK with how they all look.",
        "created_utc": 1671027442,
        "upvote_ratio": 1.0
    },
    {
        "title": "Management says I can't wear scrubs in healthcare.",
        "author": "nellb13",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/zlmh80/management_says_i_cant_wear_scrubs_in_healthcare/",
        "text": "So about 10 years ago I (35m now) became a CNA (certified nurses aide) and worked at an assisted living. In many of these types of buildings cooperate does not want the \"nursing home\" so they make their nurses and CNAs wear a business casual clothes. The place I was at required is to wear a collared shirt and khakis or black pants. Now I'm a 6'3 male, on the skinnier side, that has been told my legs are so long I look like I'm walking on stilts. That being said finding khakis isn't easy and I usually need to custom order them, which can be pricy. Also, I'd like to note that this building had hard carpet everywhere, and I would end up kneeling down to help tie shoes or do other things while helping out my residents, and ended up blowing out the knees on my khakis often. \n\nOn the malicious compliance. One day management says that we were allowed to wear appropriate yoga pants that were black or khaki colored, with no reason given. This does nothing to help me and my holy khaki situation, and as I was making $12/hr custom ordered pants were very expensive to me. So I decided I was gonna buy black and khaki scrub pants bc they are cheaper and more durable. \n\nI go on wearing them for about a week without issue when management calls me in and states that the policy is no scrub pants, and I would be written up if I do it again. I try to explain the financial situation that each pair of khakis were costing me most of a days wage and the knees would wear it quick. They respond with, \"Tough shit, no scrubs\" \n\nI then grab the flyer they posted about yoga pants and start to make the case that if women are allowed to wear yoga pants which are much cheaper, I should be able to wear scrubs. Again they say, \"No it's not the same\"\n\nAt this point I look down and see the wording on the flyer is, \"As a thank you for your hard work, Management has decided to allow all Nursing staff to wear appropriate yoga pants if they would like.\" No gender noted, just that they must be black/khaki and not low cut. \n\nQue the malicious compliance, I go home and tell my gf at the time about this and ask her for a pair of her black yoga pants. Just an FYI she was barely 5'3 and when I tried them on they barely went past my knees, they covered my butt though so they worked. The next day I walked into work proudly sporting the high water yoga pants with my hairy calves, stilt like legs, and black \"JUICY\" lettering on my but. I made sure to tuck in my shirt so everyone could revel in my glorious bony ass.\n\n1 hr into my shift when management gets there I instantly get called into the office with my boss and HR. \"Nellb13, what are you doing? You are not wearing the correct uniform and we will need to send you home now.\"\n\nI grab the flyer and point out that no where did they ever say that this was only for women to wear, and they also don't say anything about length on it. I then say that they are at the appropriate height, put my hands on my hips, do a 180 to show off and smile at them looking over my shoulder. \n\nBoss, \"That's not the point, Nellb13, you know what we meant!\"\n\nHR, \"Actually that is the point... He's right, you did say nursing staff could wear these, and they fit the criteria You put in place.\"\n\nBoss has a wicked scowl on her face knowing she got beat, but then pauses and laughs. \"Ok, Fine wear your scrubs. Just no more yoga pants. I've already heard the female residents talking about your \"Juicy\" butt more then I'd like. Go home and change tho.\" \n\nFor a long time I got teased by a bunch of 85yo women about when I was gonna be showing off my \"juicy\" butt and legs again, but at least I got to wear scrubs!",
        "created_utc": 1671009692,
        "upvote_ratio": 1.0
    },
    {
        "title": "Something I did to the lunch lady when I was younger",
        "author": "Ihdkwhatimdoinghere",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/zlfh08/something_i_did_to_the_lunch_lady_when_i_was/",
        "text": "[removed]",
        "created_utc": 1670986593,
        "upvote_ratio": 1.0
    },
    {
        "title": "\"It's shouldn't be that expensive. No way it would involve retooling much of the factory. I'll just escalate the matter.\"",
        "author": "COMPUTER1313",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/zldw4x/its_shouldnt_be_that_expensive_no_way_it_would/",
        "text": "Generally there was a fair amount of communication between the product development departments and the production departments of upcoming products or revisions to existing one. No major dramas, usually.\n\nExcept for one particular incident.\n\nWe were looking at the specifications for a revised machined product to address a known issue. Except we saw some insanely tight tolerances, such as one with +/- 0.5 micron tolerances, or 500 nanometers. This was getting to the 1980's level of semiconductor manufacturing precision. There were other tolerances that weren't as extreme, but all in combined, it was going to be an incredibly expensive revision.\n\nAnd we were suppose to manufacture hundreds of these parts per day through highly automated production lines. So we can't do this relatively manual process of making perfectly machined parts: https://www.youtube.com/watch?v=feGrx29XR4Q\n\nSome references to understand just how small the tolerance they want us to work with:\n\nhttps://www.reddit.com/r/Machinists/comments/aqluwa/a_chart_i_made_to_explain_the_sizestolerances/\n\n&gt; \"If you want to know what a tenth (.0001in [2.54 micron]) is. Get a ball of shit and rub it between your fingers until there is nothing left but the smell.\" Old boss.\n\nhttps://i.imgur.com/BGGEdFh.jpg\n\nThe email and video conference discussions were getting more heated as whoever was in charge of the design team was adamant that we could implement the revisions with our existing production lines. I could tell the rest of the design team in those video conferences were disinterested in the conflict. My manager told us to come up with a proposal on how to rebuild our production line to meet the design team's requirements.\n\n- Rip out about half of our production line because our existing automated CNC machines simply lack the precision to hit those extremely small tolerances? Check.\n\n- Find automated CNC machines that can deliver those extreme precision, and in sufficient numbers to rebuild the production line? Machines that much of the production staff would be unfamiliar with? Check.\n\n- Replacing tooling much more frequently because they will wear down over time? Check.\n\n- Rewire/reprogram industrial control systems to accommodate the massive changes? Possibly even have to rip out some of the legacy control systems? Check. (this is the part where my main line of work is in)\n\n- Implement extremely tight climate control so that thermal expansion/contraction is controlled? Check.\n\n- Implement vibration control on every production machine, conveyors and robotic arms? Check.\n\n- Ramp up the number of quality inspection stations between the production stations, and also overhaul those stations to check for parts that are outside of the tolerance specifications because their existing tools would be completely inadequate? Check.\n\n- Rip out the existing automated quality inspection stations because they lacked the precision to inspect for 500 nanometers deviations? Check.\n\n- Still expect scrap rates to go through the roof? Check.\n\n- Still meet the cost-per-part goal, even ignoring the upfront costs of doing all of those installation and only looking at operating costs? LOL.\n\nThe glorious moment was when the design lead accused us of BSing the math and told us to bring that matter to the corporate headquarter, in email. That was because the design team was working under a different division than us, so it was above our plant's senior management. We went through our analysis report and tried our best to explain everything in 5th grade concepts in it before sending it off to the plant's management.\n\nRumors has it that the matter was escalated to the corporate headquarter.\n\nMy manager later received an email from plant management telling us to scrap the entire proposed revision and work with the design team on \"more economical\" revisions. A contact in the product development department said that the entire design team was told that unless they come up with their own production plans that were more economical than our plan, the design lead was politely told to work on \"better communications\" with the production departments and maybe they should visit the production lines in-person. Also the other division's management was not happy with the design lead because they were blindsided by the situation when they were asked what the hell was going on.",
        "created_utc": 1670982374,
        "upvote_ratio": 1.0
    },
    {
        "title": "Another minimum wage malicious compliance",
        "author": "PigsGoMoo-",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/zl9uby/another_minimum_wage_malicious_compliance/",
        "text": "The bunch of malicious compliance about minimum wage jobs reminded me of one from high school. I worked at a movie theater back in the day. \n\nOn this particular day, I was working as the person who cleans the theater after the movie ended. Usually by the time credits are halfway through and the lights are on, we start cleaning since most people are already gone. You usually get one or two stragglers grabbing their stuff but never more than 3-4 people. There’s always at least 3 of us to clean the theater since they’re too big for just one person. So the two of us start at different parts of the theater and the third is waiting for the straggler to leave. We clean. Move on to next theater. Work as usual. \n\nApparently someone complained that us starting to clean while they were still in the theater made them feel “rushed” so they “almost tripped” leaving the theater. So now we’re not allowed to be visible in the viewing room until *everyone* leaves. We can wait by the stairs just out of view but enough to see if the room is clear. This usually was never a problem and people stayed visible anyway just to not be in the hallway as guests tried to leave. Well, this one manager didn’t like how we weren’t listening to her directions. We were told to not step foot in until everyone left or we’ll be written up. \n\nWell ok. More traffic for people to leave trying to squeeze past us while we have cleaning supplies and block a lane in the hallway. Nothing big. Until one day, the best possible outcome: someone fell asleep during the movie. Well, as directed by our manager, we stood there for the next 30 minutes watching the guy toss and turn in his sleep. People from the next movie started to form a line. Manager saw it and came in and asked us what’s taking so long. “We can’t clean. There’s someone still here”. \n\nThe policy was changed a week later to be that we can help people leave (read: courteously kick them out) but can’t start cleaning until the last person left.",
        "created_utc": 1670972249,
        "upvote_ratio": 1.0
    },
    {
        "title": "Mini malicious compliance",
        "author": "FlyingTigerSpaghetti",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/zl6g3l/mini_malicious_compliance/",
        "text": "Hi Reddit, I come with offerings.\n\nMe and my partner have an agreement, any terrible joke made (dad jokes, cringe jokes etc) told by either of us has to make the next coffee. Now, I agreed to this, bad decision. Weeks of bad jokes slipping out and me having to make drinks. Now, I decided to find a loop hole. So, since I love coffee just as much as I love the face and exaperated sighs that are made from a bad jokes, I have now just taken it as a challenge. Now, I find the worst/best jokes (thank you r/dadjokes) I can and say them, enjoying the sighs and exasperation before turning on my heal, skipping to the kettle with glee.",
        "created_utc": 1670964388,
        "upvote_ratio": 1.0
    },
    {
        "title": "I Hate Green Beans",
        "author": "namagiqa",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/zl62uc/i_hate_green_beans/",
        "text": "This happened many years ago when I was still in grade school (I'm 53M). \n\nFor whatever reason, I hate canned green beans. I always have and while there are some foods that I hated as a child but have now grown to love, canned green beans are not on that list. Some people in my family like canned green bean casserole for Thanksgiving and I ask that they make it at their house so I don't have to smell it because it literally makes me sick.\n\nSo years ago I was in grade school and at lunch one day they served canned green beans. The lunchroom teacher announced that everyone had to clean their plate before they could go to lunch. She would inspect 'plates' - in reality they were the old cafeteria thick plastic trays with defined sections for food - before students dropped them off at scullery. I march up with my tray having eaten everything but my green beans. \n\nTeacher: You need to eat your green beans.\n\nMe: They'll make me sick.\n\nTeacher: That's in your head.\n\nMe: It isn't.\n\nTeacher: Yes, it is. Go eat them or no recess.\n\nWell, I'm 8 years old. I live for recess and the time to go out to recess was fast approaching. So I trudge back to my seat and I somehow choke down those green beans. I still don't know how I did it. I take my tray up for her inspection and she makes some snarky comment about how it was all in my head. I put my tray through the scullery window, walk back to my seat and promptly puke all over the table. I just spewed it all over the table, little bits of minimally chewed green beans glistening in my gastric juices for all to see.\n\nKids were screaming and crying and jumping out of the way and calling upon God for deliverance. I looked at the teacher and from 2 tables away I could see that her eyes were the size of silver dollars. The janitor came to clean it up. I got to go to recess. And I did not have to eat my green beans again.",
        "created_utc": 1670963523,
        "upvote_ratio": 1.0
    },
    {
        "title": "Of course I can go slower!",
        "author": "Kumquat-May",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/zl36xf/of_course_i_can_go_slower/",
        "text": "This story happened last December, but I only just got reminded of it by another story on here. It occurs in NW Europe, so the original conversation did not occur in English, but it translates well enough.\n\nSo last December I went out to a large mall that gets pretty busy this time of year due to the Christmas shoppers. I got lucky that a lady with her kids was just leaving as I pulled up outside the store I needed, and I went inside to get gift shopping. \n\nAn hour or two later, I headed back out to my car and started loading the many items into the trunk/boot and back seat. It should be noted that last year I tore my rotator cuff in my left shoulder, so by December I was able to lift the bags and boxes, but I was still recovering so it was a slow task.\n\n Anyway, I'm just about finished when I hear a car horn behind me. I turn around to see an irate, entitled woman in a Range Rover beckoning me over. She winds her window down and says \"could you go any slower?! Some of us have places to be!\" \n\n\"Sure!\" I say, then comply to her request to the letter. Can I go slower? Why yes of course I can! The last three bags took about as long as the rest of the shopping combined, then I spent a good five minutes rearranging the stuff in my trunk - I wouldn't want to make it all roll around! \n\nAs soon as she'd driven off, and swiftly got in my car and reversed, all too happily to let the next, much more polite lady take my place.",
        "created_utc": 1670956686,
        "upvote_ratio": 1.0
    },
    {
        "title": "You want multiple tickets? Ok.",
        "author": "Pale-Warrior",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/zl1mh4/you_want_multiple_tickets_ok/",
        "text": "In the not too distant past I was working for a large multi-national company (European owned), in a small office for large one off projects. 200 or so persons working under this facility. We did not have even one on site IT person.  Things just did not get done, the nearby corporate office would not like to dirty their hands and drive out to our remote location about 20 minutes away. They wouldn't even be regular with maintenance items and skip backups, etc. User tickets, eg. Software issues, licenses, etc were all moved offshore to a third party company. This company was based in India and further would hire third parties to work these tickets since they were in the off shift. It got to the point where we were basically left to our own devices. \n\nA couple of us were tired of this, we racked up a bunch of credentials in our off time, including html editing and automation(this is important for later). Things a normal company has internal support for and can help out. What we couldn't fix were issues outside of our control, physical network assets down, or remote devices down. \n\nCome to find out the third party using a third party way of handling tickets got out of hand. Seems some were exploiting the time difference between the US and India and committing some fraud. Claiming tickets they didn't do,etc. It was apparently 10-15 tickets or so which amounted to around 2,000 USD or 165,000 Rupee. Duplicate tickets someone double paid for. It was the first company who messed it up. So our support was restricted to 1 day on site if their was enough trouble. This was unacceptable and it showed. System wide issues would be addressed but only if multiple users reported the issue and since we were a small office would fall out of the que and be left behind again. \n\nMy fellow engineers and I devised a plan. We took our new skills and worked a plan. The ticket submission was a very simple web page. We had some automation software (usually for app testing, etc) and quickly worked to exploit this support stupidity.  We had a system issue, everyone in the office \"reported\" it as so. each separate task and resolution was its own group of tickets. since we had the software we could mask with randoms and make it seem like people were actually filling these out. 1 issue could end up with 10,000 tickets in a few minutes.  Additionally we could raise the severity each hour creating 3x tickets each hour 30,000 became 90,000 and so on. This ended up at the CTO level within 5 hours. About 11pm Europe time... \n\nThey the overlords in Europe figured out after 4 or so issues to go back to the we fix whats broke and not worry about a few bucks here, especially since it was the vendors issue that created it. The double third party stuff was stopped and we ended up with a slightly better third party team working our issues.",
        "created_utc": 1670953075,
        "upvote_ratio": 1.0
    },
    {
        "title": "We Don't Hire Marijuana Users",
        "author": "not_a_puzzler",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/zkxyc1/we_dont_hire_marijuana_users/",
        "text": "I'm an old-timer with over a decade of experience as a software engineer. \n\nA long time ago, when I was straight out of college, it shocked me to learn that cool, trendy software companies still drug tested their potential hires. So I quit smoking pot for several months, did the song and dance, and got a job. I've repeated this each time I've switched jobs, over the course of several years. \n\nIt's already a cumbersome and annoying process, made even worse by a prescription medication I have, which causes urine drug tests to false-positive all sorts of things. Unbelievably, it wasn't the urinalysis lab that called to clear this with me, it was the company wanting to hire me. I'm a private person. Discussing my medication with a potential employer, a stranger, rubbed me the wrong way, to put it lightly. The back and forth of \"No, I don't do drugs\" - \"Yes you do, look at these results\" - \"No I don't, look at this medication\" - \"Oh okay, you don't do drugs\" felt like such a ridiculous waste of time and money.\n\nSo I thought, yeah, it probably \\*is\\* a huge waste. After another job change and another round of urine-test-and-medication-clarification, I decided I wanted to prove how stupid this practice is. While comfortable at my job, with no real desire to change jobs, I started applying elsewhere. Everywhere.\n\nI got \\*many\\* responses, and followed up with as many as time (and my actual working life) allowed. I got through several rounds of phone interviews, webm/zoom interviews, online coding/\"IQ\" tests, all of that. I only followed through with in-person interviews for the three positions I would've actually accepted, if I'd been able. \n\nBut accepting them was never an option - I was smoking weed regularly during all of this. When the time came for the drug test, I smiled at the urinalysis techs, endured letting them watch me piss, and walked out whistling. \n\nSure enough, the calls came back the same way each time: \"Oh no! Your drug test returned positive for marijuana use!\" I admitted to smoking, of course, but played dumb each and every time it was revealed as a problem. I acted like I'd never in my life heard that smoking weed prevented you from getting a job. (I did this politely, mind you - obviously the girl on the phone is not in charge of the policy) - but with enough confusion to hopefully, maybe, warrant a message up the chain of command explaining what happened, and why they aren't hiring the otherwise-qualified candidate they'd spent months selecting. On one particularly memorable call with a smallish company, the representative smarmily said \"Sir, we don't hire marijuana users,\" to which I replied \"I guarantee you, you do.\" \n\nI know none of this accomplished anything. I know these companies didn't change their policies as a result of my antics. I know it was just pissing into the wind, so to speak. But it was immensely satisfying. Knowing how much of their time and money I'd wasted - and that it was only wasted because of stupid policy - felt great. Still does. I was perfectly polite and kind to every person I interacted with on these escapades. I know who deserves to be yelled at and who doesn't, and I take pride in that. So please don't imagine me badgering some poor intern on the phone.\n\nJust wanted to share my story and finally admit this to someone other than my wife. I don't have the time to do this anymore. I'm happy at my current job, still smoke regularly, and would gladly fail a drug test and work elsewhere, were my employer ever insane enough to issue a random test. These years later, I still stand by it being a stupid policy. I stand by wasting the time and resources of Fortune 500 companies. The only guilt I have is for the other candidates who were potentially rejected because of me. Having been on the other side of the hiring process, I know these candidates were almost definitely not impacted at all, but it is possible. That does still bother me a little. \n\nAnyway, thanks for reading, and have a good day.",
        "created_utc": 1670943991,
        "upvote_ratio": 1.0
    },
    {
        "title": "Following the court order",
        "author": "clisterdelister",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/zkx4n2/following_the_court_order/",
        "text": "Alt account, mobile. This is the first half of a decade long tale that is currently resolving in a delightful way. \n\nOver a decade ago, I came home to find I was being moved out by my wife. We weren’t in a great place, but I was blindsided. I was also served with a protection order that stated I could not come home without prior written permission, I had to go through my wife to see the kids etc. and it was in effect for 90 days. I was devastated. \n\nA relative connected me with a bulldog of a lawyer. This lady was brilliant and no-nonsense. She filed a rebuttal to the protection order, but told me these things take time and we were unlikely to see a judge before the 90 days were up. She was VERY clear that I must follow the court order to the letter. If there was ANY evidence otherwise, I’d be in an uphill battle if/when my wife renewed it. \n\nIt only took one day before my now ex needed me to take the kids. I had crashed at a friend’s house, so I had no place to take them. So we agreed I’d watch them at home. I waited a few blocks away while waiting for an email. Ex called me and I reminded her of the details of the order and that I wouldn’t come until I had permission. This happened twice more that I waited down the street within the first week. So I told her I wouldn’t leave where I was staying until I had the email.  It was about 20 minutes away. I texted her to remind her. \n\nThe very next day she again didn’t email. We were planning on me picking up the kids to take them to school since their school was only a few minutes from my work. However, because I had not received written permission, I ran out of time to drive to pick up the kids and then make it to their school and work. \n\nShe called furious that I wasn’t there. I reminded her about the permission, and that I was out of time. She ended up being VERY late to work that day. \n\nShe then wanted to write me blanket permission to come and go “as needed,” but my lawyer advised against it. Follow the order. \n\nThe culmination of this was a few weeks later when she again forgot to send permission. Her boyfriend was staying over, but didn’t have his car with him. They both had to get to work, and that was the day I learned that he was her direct supervisor. Ex had to call a friend from work to pick up kids and take them to school, and the friend found out. Of course it got out at their work. Within a week of that, the boyfriend was fired over their relationship and my ex was suspended. \n\nBy this time, I had my own place, so the kids ended up staying with me most days. \n\nI later learned that the protection order was the boyfriend’s idea.  Ex was quite mad about it as it  turned into evidence that I wasn’t a threat to her or the family, and the judge was quite harsh with her over it when we settled for support and parenting time. She called it “intentional and harmful parental alienation.”",
        "created_utc": 1670941851,
        "upvote_ratio": 1.0
    },
    {
        "title": "The only feet I have",
        "author": "Outrageous_Bet7212",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/zknhjg/the_only_feet_i_have/",
        "text": "This occurred  when my Gen Z daughter had to be 2 or 3. She did a great job if dressing herself but invariably put her shoes on the wrong feet..after pointing  it out  to her one too many times she looked at me exasperated...\" these are the only feet I have \"  dumbfounded I had to admit a toddler Gen z had outsmarted me. Carry on Gen z!",
        "created_utc": 1670909306,
        "upvote_ratio": 1.0
    },
    {
        "title": "But this is online",
        "author": "Boiswhocrygames",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/zklwof/but_this_is_online/",
        "text": "\n\nSo I work at a wonderful call center doing remote retail and I swear karens come in all shapes and sizes. But todays story has a very special one near and dear to my heart. Some WACKO calls in and says \n\nKaren: \"Hi I would like to place an order I noticed you have a sale of x going on\" \n\nMe: \"Hi no problem at all ma'am but I do regret to inform you that the promotion is online only\" \n\nKaren in an angry boomer demanding tone that just really tickles the I want to punt you into the unverse mood \n\n\"Well I am a VIP and waited 30 mins to place tbis order. Surely you can assist me\" \n\nMe:\"Again as I said before the promition is online only and I do apologize for the inconvenience. You would have to place it yourself online\" \n\nThis is the part where my mouth just dropped. I swear I lost so many braincells that you could form another human with how many cells exploded from my head after this bat shit fucking donkey balls licking backwards ass, is this reality whoops there goes gravity statement\n\n\nKaren: \"Well I called in so therefore its online\" \n\nAt this point the mic drop was so thunderous the neighbors fish that was just flushed down the toilet swam back up popped up and started to dance on the toilet seat \n\nMe holding every boomer screaching blow back as much as possible \n\nMe: \"well I am sorry ma'am you calling on the phone does not mean you are placing it online. It means you are doing it via the phone\"\n\nKaren:\" Well I am VIP. I waited 30 min on the phone and am treated like this?\"\n\nMe: \"I do apologize ma'a....*click*\"\n\nTo this day we will never know what happened to little mrs karen",
        "created_utc": 1670904692,
        "upvote_ratio": 1.0
    },
    {
        "title": "This may be better under Dangerous Compliance - Covid 19 Story",
        "author": "mydrivec",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/zklnht/this_may_be_better_under_dangerous_compliance/",
        "text": "At the height of the Omicron Varient (December 2021?), my Father in Law was in the hospital.  Wife  and I were visiting and knew they had a mask requirement.  So we put on brand new N95 masks just before we walk in the door.\n\nHospital screener takes one look at us and hands us those white/blue loose  over the ear loops.  I stop her and say, \"thanks, but we have masks\"....should be no issue right?\n\nOf course it's an issue.  \"I'm sorry, I can't let you in unless you wear our mask\"\n\nTo which I say, \"you understand that these are N95 masks and are far more effective than your paper mask?\"\n\nShe says \"I don't know anything about that, these are the rules\"\n\nYou get what you pay for people.  I'm sure someone will argue that she should be making a livable wage for enforcing rules without understanding or thinking for herself. \n\nYes, we wore the masks provided and tucked ours into our pockets.  Sometimes it isn't worth arguing.  Subsequent trips were frequent...we always walked in mask less from that day forward and let them hand us theirs.",
        "created_utc": 1670903969,
        "upvote_ratio": 1.0
    },
    {
        "title": "Italicise every single fact in this article? Sure thing",
        "author": "drymeasures",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/zkjcqs/italicise_every_single_fact_in_this_article_sure/",
        "text": "I used to work for a newspaper, and at one point we had a spate of mistakes make it into print. There wasn't really a reason for it (apart from us all being overworked and mildly burnt out). Just one of those unfortunate coincidences.\n\nAnyway, our boss was furious. She put up this board like those you have at construction worksites, saying: \"___ DAYS WITHOUT ERRORS\". We also had a long-standing practice where copyeds had to put changes they made in bold, so it would be easier for journalists to spot the difference. But our editor wanted a better fact-checking system. She told us we had to italicize every fact in our story to make it clear we'd checked it properly. \n\nAgain, we worked for a newspaper. Most of us weren't writing op-eds. We were doing general news. It was *all* facts.\n\nBut whatever you say, boss. We started writing entire articles in italics, before selectively de-italicising words like \"and\" and \"the\". Gotta get all the facts, right? The first time I did that, I got an angry call from this copyed who had worked for the newspaper for 50 years, took absolutely no shit from anyone, and was an institution in her own right. \"[Name], why is your whole story so hard to read? Why is it all in italics?\" Just following orders, ma'am.\n\nFortunately, the boss soon turned her attention to other problems, and we were able to return to whatever passes for normalcy in a newsroom.",
        "created_utc": 1670897693,
        "upvote_ratio": 1.0
    },
    {
        "title": "You want me to go to counseling for your bad parenting? Can do!",
        "author": "Smooth_Purchase539",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/zkezpt/you_want_me_to_go_to_counseling_for_your_bad/",
        "text": "My malicious compliance story starts with me being kicked out of the house unfairly (parents rent and are considered co-tenants). My family and I had a severe disagreement, which involved my parents gaslighting, lying and interpreting everything I had said as a threat. Basically taking everything as an attack to their ego, in other words. During this argument, my mom suggested that I seek counseling to \"adjust my shitty behavior.\"\n\nSo, like anyone on this subreddit would do, I did so. An initial consultation went something like this.\n\n- Talked about emotional abuse I had suffered as a child due to dad's alcoholism and mom's social anxiety, getting confirmation that this is in fact legitimate to address.\n\n- Offhandedly mention that my niece, who is in close contact with the parents and also my aggressive sister, reminds me of myself and my situation.\n\n- Talk about suicidal ideation a bit, mentioning that my dad keeps a shotgun by his bedside table.\n\nThe end result is still unfolding, but I can tell you right now: Child Protective Services is currently hopping mad, and an investigation is underway involving my niece. My counselor also said that, because my mother has immediate access to a firearm, I should file a report with the police station and mention her parole violation and my father's role in it (though this is something that I would have to do on my own terms). And, again, all because my negligent mother decided to pass the buck instead of take accountability for her part in my troubles.\n\nI'm going to love to see how they try to gaslight through this hell.",
        "created_utc": 1670886747,
        "upvote_ratio": 1.0
    },
    {
        "title": "No, you can call out all the numbers",
        "author": "Smeagol3000",
        "url": "/r/pettyrevenge/comments/zjsjr1/no_you_can_call_out_all_the_numbers/",
        "text": "",
        "created_utc": 1670883402,
        "upvote_ratio": 1.0
    },
    {
        "title": "siganme en insta",
        "author": "ariana_ok",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/zkcun6/siganme_en_insta/",
        "text": "[removed]",
        "created_utc": 1670882122,
        "upvote_ratio": 1.0
    },
    {
        "title": "Just Follow the Instructions? Okay!",
        "author": "vikingzx",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/zkbdda/just_follow_the_instructions_okay/",
        "text": "So during my high school years my family moved into a new place, and thus began the process of moving our pantry into our new basement. One of my parents bought a whole array of metal shelving from somewhere and told me to go down and assemble the first unit. I was informed that they were to be free-standing right where the box was, and not to move them because they wanted them *there*.\n\nLo and behold, as I unfolded the instructions and commenced reading through them *before* building said shelf, I noticed that they were *not* free-standing shelves, but were meant to be screwed into a wall, and there was even a step for that. The instructions themselves referred to them as \"not free-standing\" and warned that they should be built next to a wall and then screwed to it, or they would not hold weight.\n\nI returned to said parental unit and attempted to inform them of this, only to meet exactly what I expected. I was told I was just being lazy and trying to get out of a job. I was lying about what the instructions said because parental unit would *never* have purchased the wrong thing. Besides, who would sell shelves that *weren't* free standing? That'd be stupid. Etc etc. I suggested moving the shelves over to the wall for support and was told to stop being lazy and disrespectful, and to go build the shelves *now*, where they had been placed.\n\nAll right. So I went back down to the basement and did just that. They were flimsy as anything on their own, but they were up.\n\nSoon enough, parental unit attempts to fill them and the shelves fail, buckling. Parental unit starts reaming me out for \"failing to build them properly.\" I replied that I *had* failed to build them properly because I had been ordered not to build them properly, and once again pointed out that on both the outside of the box and the instructions it said that the shelves were *not* free-standing.\n\nParent replied that I was ... Honestly I don't even remember. But it was in the vein most of you would guess. Disrespectful, unable to follow directions, etc etc. And they were going to *prove it* by \"showing me how it was done\" and building another set of shelves, after which they were going to charge me for the shelving I had \"ruined\" with my laziness.\n\nAbout an hour later there was another crash from the basement as the second set of shelves buckled. They never said another word to me about it, but a day or so later the rest of the shelves were up and screwed into the wall as the instructions dictated, and they're still there all these years later.\n\nTL;DR: Was told shelves were free-standing when the instructions said they were not, was told to do as I was told rather than follow the instructions, and the predictable happened.",
        "created_utc": 1670878958,
        "upvote_ratio": 1.0
    },
    {
        "title": "Bad boss missed out $100m for treating his employee poorly",
        "author": "AngleFearless6776",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/zka5n4/bad_boss_missed_out_100m_for_treating_his/",
        "text": "[removed]",
        "created_utc": 1670876348,
        "upvote_ratio": 1.0
    },
    {
        "title": "You flirted with other girls because we had issues? Alright.",
        "author": "afroprincess0",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/zk8x88/you_flirted_with_other_girls_because_we_had/",
        "text": "So my boyfriend of 1.sth years viewed people's snaps, saved them and complimented them. This includes a girl I had told him I wasn't very comfortable about. \n\nHe even saves snaps in groups that we share.\n\nI saw it when he gave me his snap so that I change his outfit.\n\nHe told me that he doesn't see a problem as we were 'broken up' in other words we had an argument. He said he owes me nothing when we're not together.  We usually have those fights. I understand that sometimes we are broken up, but it's never lasted more than 2 days. I'm usually crying while he's flirting? And he thinks that's ok. But most of the time we just fought and no one wanted to apologise so we don't call/ text each other until we decide to overlook the issue.\n\nWell I realised I had no friends or anything so I couldn't issue a permanent breakup. I cried for days. It still hurts like hell.\n\nSo I toldhim it was ok. But I decided I would plan to start a whole relationship in a new country that I'm moving to then leave him stranded. \n\nAnyways,  today I went for swimming practice and the coach paid my pool entrance fee. Around 5 dollars-(Ksh 500). The uber guy told me to not to pay him half his money. I had given him half in cash and wanted to send the remaining half.\n\nHe was so mad. He said that the government even gives us 500 so how rich is he to just spend it on me.\n\nI tried to explain that it doesn't even hurt the coach to pay that for me when I'll be paying him more and he'll recover it. Just like a supermarket offer I guess. \n\nHe said he doesn't want to talk and he'll just sleep. I told him that I'd miss him though (on text) but just deleted it and said good night and a very unenthusiastic 'love you'\n\nNow this is something you should know. He struggles financially and he is about 1000$ in my debt already. His family gives him very little and he's usually unable to repay.\n\nHe said I should just delete all my messages. I told him he can't talk to me like that because of 5 dollars that aren't even his. If it really hurt him that bad, he should've sent me the 5 dollars and told me to decline the offer. \n\nHe then ended the call by turning wifi off and letting it do that reconnecting thing.\n\nI told him there's no use in reconnecting ut, and he should just boldly end the call.\n\nNow this is where the first part of the story comes. I guess we can now flirt with other people when we get in an argument and say we weren't together and we wanted to feel better.\n\nNow I'm one competitive person so let's see how things turn out. Already texted some lawyer friend of mine qnd set up a date. After all, I'm not obliged to be loyal to him when we're 'not together '\n\nHe's an aspiring lawyer",
        "created_utc": 1670873666,
        "upvote_ratio": 1.0
    },
    {
        "title": "Don't want your winnings? OK.",
        "author": "CountryMouse359",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/zk7w0y/dont_want_your_winnings_ok/",
        "text": "When I was a teenager, I worked in a stationary/newsagent store that also sold lottery tickets. When you buy a multi-draw ticket, and win on one of the draws before the last one, you can claim the money and the machine auto-prints a new ticket for you for the remaining draws. One day, a man comes in to check if he has won anything. For whatever reason, he has decided to laminate his ticket back to back with a shopping list. I scan his ticket, and it says he has won £10. Once the scan is done, there is no going back when it is under £100 - the prize must be paid out. I tell him he was won £10, and I have to keep his ticket, but here is your new one. Conversation goes something like this:\n\nMe: You have won £10, I just have to keep this ticket, here is your new one (I hold out a crisp £10 note and a new ticket).\n\nCustomer:  No, I still need that, it has my shopping on it, I don't want a new ticket.\n\nMe: Sorry but I have to attach this receipt \\[printed by the lottery terminal\\] to the ticket and put it in the safe. The old ticket is no longer valid\n\nCustomer: No, give me my ticket back.\n\nNow, at this point I'm really not paid enough to argue, so I offer him his old ticket, new ticket and winnings.\n\nMe: Ok, here you go.\n\nCustomer: No, I just want my ticket, I don't want the winnings yet.\n\nMe: You really need to take this now.\n\nCustomer: No\n\nHe is being pretty rude about the whole thing, so I comply with his request and only give him the old worthless ticket, leaving me with his £10 and new ticket. I pop the lottery receipt in the safe as that is all I have, and I leave the money and new ticket beside the till for the rest of my shift in case he realises his mistake, but he doesn't come back. I forget what I did with the money, put it in a charity box or something probably, but it didn't go to him or the shop that's for sure. The new ticket didn't win anything else...",
        "created_utc": 1670871436,
        "upvote_ratio": 1.0
    },
    {
        "title": "Don't want Teaching Assistants to do their jobs? Fine, but you'll have to find professors to fill our spots.",
        "author": "daemare",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/zk6sfe/dont_want_teaching_assistants_to_do_their_jobs/",
        "text": "So this happened the semester before COVID hit the states. I was working on my Masters degree in biology and worked as a TA. My duties included attending the class (a low level bio course), tutoring students, plus teaching and grading labs. Doing this allowed our professors to teach more of the large lecture classes (thus generating more money for the university as well). I'd been doing it for the past 2 years and the program has been doing it for 11 years without issue. \n\nNow in walks in the New Dean (ND). Several of us would refer to her as the Head Bitch in Charge and that was not a compliment. She has done many crappy things to the bio department since this, but this personally affected me and my money. A few days before the start of the semester, ND's office puts out a policy change to use saying 3 main changes needed to occur:\n\n1) TA's are now to be called Graduate Assistants. (Honestly who cares?)\n\n2) The GAs are no longer allowed to teach the labs.\n\n3) The GAs are not allowed to grade the labs. \n\nNow the teaching and grading of labs accounted for over half the hours I needed to fill for my agreement so we got paid. Also, us TAs 'taught' the labs. By that I mean we gave a 15min spiel at the beginning about the concept of the lab, then showed them how to do it from a preset lab manual. We didn't come up with the lesson plan or the labs ourselves. So technically we were not teaching, rather 'supervising.' Plus some of those labs took a while to grade as they were all hand written. \n\nNow each lab counted as 1 credit hour and each lecture counted as 3 credit hours too. Each lecture had 3 lab sections attached (the class divided evenly between the 3 sections). So due to these changes, each professor would have to either take overtime to teach the labs, or give up a lecture to teach 3 sections of lab. Or they would have to hire more professors to cover the positions. I remind you this is within a week of classes starting.\n\nSo we complied and did no prep before the start of classes. On the other hand, my amazing advisor and lab manager did the math. She took her time and wrote out all the money that would be lost. Then presented it to ND and her office, 3 days before classes started. ND realized they would have to hire new professors in 3 days, pay a bunch of overtime, or lose money from having to cancel classes. Needless to say, she backpedaled real fast. \n\nNow most of the TAs had been doing it for at least a year so we had no problem with the labs being taught, but we were a bit more crunched on time for scheduling which TA took which lab, so there were some hiccups. If any student complained, we got to be as petty as we wanted. I.e. \"Sorry. The new dean is having some trouble transitioning into her role and didn't know what us TAs do.\" After graduating, several of us wrote letters of discontent to our Provost with basically no response. This whole issue stressed and angered many of the professors in my department. Several of the best professors I know have left the university due to her toxic policies and behavior. I'm now off in med school and it's kind of fun to watch ND purpose sink the ship she is sailing.",
        "created_utc": 1670869141,
        "upvote_ratio": 1.0
    },
    {
        "title": "Coworker does 90% of sales mans job, gets nothing for it, started acting their wage and gets sh*t on for it",
        "author": "EtherealCream",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/zk6mpw/coworker_does_90_of_sales_mans_job_gets_nothing/",
        "text": "TL;DR: Sales guy is getting too much money for a job he only does 10% of. Coworker and I are pissed and acting our wage. \n\nI just started at this job about 3 months ago. I have already noticed that the sales man, we'll call him SM, gets 7% commission for the jobs we do. To put that into perspective, we did a large job that equaled out to around 67k, he made almost 5k off of that job alone. My coworker did 90% of the paperwork, phone calls, and everything else. The only thing SM did was sell the job, easily because it was needed, and visit the area of the job to make sure we could do what we promised. The icing on the cake was the manager asking my coworker to do paperwork for a program for the SM to earn EVEN MORE MONEY! Almost 1.5k more. My coworker is so fed up that they started acting their wage. She is making $18/hr to do SM's job, their own job as well and then some. They've been \"falling behind\" as the manager said, and they've been \"slacking off\". Our SM isn't even in the office for most of the day. He usually shows up for an hour (if we're lucky) and my coworker and I have to make calls and take calls regarding the sales department. I've also been talked to about my performance but I'm only making $15/hr. Which is barely even enough to pay my bills right now. We are just so tired of it and it is really tempting to go find a different job already but I've only been here for 3 months, my coworker has been here for 2 YEARS dealing with this shit. Not totally sure if this is the right place to put this kind of thing but I would greatly appreciate some advice or even to know that we aren't the only ones dealing with this type of thing. Thanks!",
        "created_utc": 1670868764,
        "upvote_ratio": 1.0
    },
    {
        "title": "I built a fence to annoy my neighbor’s son",
        "author": "macaroni_3000",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/zjzszq/i_built_a_fence_to_annoy_my_neighbors_son/",
        "text": "[removed]",
        "created_utc": 1670853448,
        "upvote_ratio": 1.0
    },
    {
        "title": "Compliance Backfired",
        "author": "Beethovenfan55",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/zjyt20/compliance_backfired/",
        "text": "About 25 years ago I was a concrete contractor in an East Coast (US) state.\n\nI had been working for this medium size city through a general contractor for 10 years. My company did 100% of the work, but I didn't have the financial wherewithal to obtain a general contractor license. (Stiff requirements).\n\nWe had a good working relationship with the inspector by doing good work. If you ever had to wait on constant inspections, you know how expensive they can become, because the clock keeps ticking whether your inspector is on time or not. He came by a couple times every day and let us pour concrete whenever we were ready.\n\nThen we got a new one, and he was a jerk. But the story starts at bid time.....\n\nThe plans called for a retaining wall and the bid documents included the number of units (square feet of the face of the wall), and I bid accordingly.  Their policy was always that payment was based on unit prices and the inspector would field measure actual number of square feet. \n\nThe day before the bid, an addendum was issued that the number of feet of wall had been increased, but the plans didn't reflect any changes. I couldn't get a straight answer, so I revised my unit price downward so as not to lose the entire job, as the wall was just a small part of it. The only thing I was told was that the wall would not be paid in unit prices but as a lump sum.\n\nFast forward to the day of pouring the wall, and Jerk Inspector finds a problem after he has already approved it, and concrete was on its way. 30 minute delay.\n\nProblem fixed, then Jerk wants to test concrete (in ten years, they hadn't tested it once). 20 minute delay. Concrete is now 70 minutes old. Jerk says it's too old, quotes the specifications, and makes me send it back at my expense. $700 out the window.\n\nFor those of you unfamiliar, most reputable concrete suppliers are very diligent about putting precise times on their concrete tickets. So a couple days later, I review the tickets and the specifications cited in the city's own spec book.\n\nPer THEIR SPECIFICATIONS, the concrete had to be unloaded within 90 minutes of the time water was added. I checked ticket times and the second truck after the rejected one was unloaded within the proper time permitted for the first one. He was trying to use a different, but more strict specification that only allowed 60 minutes that he decided willy-nilly he would pull out of thin air.\n\nThis jerk was a sociopath, and had everyone in the inspection department intimidated and they told me to just drop it, but I didn't. I held his feet to the fire and got my $700 back.\n\nThen they decided they would field measure the wall after all, and it would NOT be paid on a lump sum basis. So because of their ambiguous plans, specs, and outright lies, they short changed me $6000 on the wall.\n\nFortunately, it was only about 3% of the whole job, but when you only make 15% it was still a kick in the teeth. But hey, I got  my $700.",
        "created_utc": 1670850891,
        "upvote_ratio": 1.0
    },
    {
        "title": "Who wants to be owned and used, my master is always needing more money and needs useless faggots like me to pay him. Dm me so I can give you his details 🍆🍆🍆",
        "author": "Cuckforbullynh",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/zjqrxs/who_wants_to_be_owned_and_used_my_master_is/",
        "text": "[removed]",
        "created_utc": 1670828767,
        "upvote_ratio": 1.0
    },
    {
        "title": "My parents told me I'd have to pay for half of my car, insurance, and gas",
        "author": "herefordadia",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/zjkf7e/my_parents_told_me_id_have_to_pay_for_half_of_my/",
        "text": "When I was about to get my driver's license (in the states) my parents sat me down and told me that when I got my license they were going to expect me to pay for half of my car related expenses (the car, insurance, and gas specifically).\n\nWhat is important to know here is that I knew how excited they were for me to get my license. Both of my parents were working at this time and the idea of me being able to run quick errands for them or pick up my younger sister from school or her clubs or sports events was really appealing to them.\n\nSo I thought about it and then told them that I'd be getting my license and then I would be choosing to not have my own car. Since I was very involved in a lot of sports I didn't have time for a job for most of the year so I'd just stick to riding my bike to where I needed to go.\n\nThey definitely didn't anticipate this and knew I was serious right away. After all, the default up until then had been that I'd cycle to and from where I needed to go unless I arranged for other rides. I don't remember how long they tried to wait me out, but I think it was later that day when they came back and told me they'd buy a car (a crappy one) and pay for the expenses (with a few reasonable stipulations).\n\nTLDR; parents tried to make me pay for my car and gas when I got my license, I told them I'd rather cycle around. They wanted a third driver for errands and stuff so they changed their mind and paid for my car and expenses.",
        "created_utc": 1670813470,
        "upvote_ratio": 1.0
    },
    {
        "title": "My dad wants to to bring a bunch of tools and stuff into the basement, but said previously I can’t be down there.",
        "author": "NetherPlaysVR",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/zjk5yy/my_dad_wants_to_to_bring_a_bunch_of_tools_and/",
        "text": "Me (14-15 soon) m\n\nDad (47) m\n\nSo, today a bunch of Shit went down where my dad got Mad at me for not putting away the dishes and said I’m not allowed in the basement (where all of my gaming stuff is located) so obviously I comply, as I don’t want to get grounded (A Township Tale  super fun time event I fucking missed..).\n\nSo this happened around 30 minutes ago.\n\nMy dad asked me to take down empty Christmas decoration boxes, but I said to him, “You told me that I’m not allowed in the basement today.” \nMy dad said “If you don’t bring those boxes, you will be grounded for a month, damn it!”\nI reminded him “You said the exact same thing, ‘if you go downstairs, so help me god I will ground you for a month!’ So either way, I’ll get grounded for a month?”\n\nThat shut him up lol.\nNo hate please.\n\nTL;DR\nDad says I can’t do one thing, than says to do it basically.",
        "created_utc": 1670812910,
        "upvote_ratio": 1.0
    },
    {
        "title": "HOA towed my stepdad's car again. And instead of trying to help us figure out what is going on, the board member in charge of parking ignored me and then gave me passive aggressive responses. So I did my own investigation, figured out what happened, and came up with sweet sweet revenge.",
        "author": "coversbyrichard",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/zjj2qt/hoa_towed_my_stepdads_car_again_and_instead_of/",
        "text": " I did my own investigation and it turns out whoever is processing our application keeps putting the WRONG vehicle model. We have a Hyundai Genesis Sedan but they keeping putting Hyundai Tucson. We never owned a Tucson. We never even owned an SUV. My mom has driven Toyotas her whole life and my stepdad has owned this Hyundai Genesis Sedan since 2010. And I've only owned a bright red Genesis Coupe. No one in this household has EVER owned a Tucson. My car is always parked in the street because we are only allowed 2 vehicles on the property. I don't mind leaving my car in the street because I have no problem walking a few blocks when I need to go out once in a while.\n\nI voiced this concern to the board member (we'll call him Bob) because it was clearly a clerical error that led to his car being towed. We were hoping to resolve this amicably and get our money back, but instead of trying to understand and resolve the problem, Bob simply answered with \"submit an application\". To which I said, yes, we submitted our application 3 times already. What happened and whose car is this? And why are they assigned to our unit? \"Complete a parking application\". Hey, can you help us? \"COMPLETE A PARKING APPLICATION. Are you r\\_\\_\\_t\\_\\_ded?\".\n\nAlright. Screw you too then.\n\nI completed a parking application, photocopied it 365 times. And also photocopied each of his required documents - vehicle title, registration, and his driver's license - 365 times. Our plan was to submit a parking application every day for the next year. In the process of this, I also learned that our CC&amp;R's state that the board member processing the parking application MUST send us an email letting us know that the application has been processed for EACH application they receive. They never did this since we bought he property so I photocopied the part of the CC&amp;R's where it says this, highlighted the rule, and stapled it with the application to make it clear that he MUST do this.\n\nMy stepdad is retired. I work from home. We have time to screw around. I don't like being called r\\_\\_\\_t\\_\\_ded. And my stepdad has just about had it with this guy.\n\nAbout a week in, Bob reached out to me on Facebook telling me to stop sending parking applications because he simply \"doesn't have the time to deal with this\". Oh? But you think I have the time to deal with \"picking up our vehicle from the tow yard\"? I responded with, \"so it seems you finally got our parking application. Do you see where it says Genesis Sedan? Yes? Okay. Good. We have about 357 more applications coming. If you want us to stop, I want the $661.13 we paid to retrieve my stepdad's vehicle - I'll take $660 if you give it back to me in cash. Merry Christmas, Bob. Hope you have a good one. Oh, and don't forget to make sure it says Genesis Sedan, we don't own a Tucson.\n\nHe hasn't responded since. And I'm on my way to drop off ANOTHER copy of the completed parking application. :)",
        "created_utc": 1670810576,
        "upvote_ratio": 1.0
    },
    {
        "title": "HOA towed my stepdad's car again. And instead of trying to help us figure out what is going on, the board member in charge of parking ignored me and then gave me passive aggressive responses. So I did my own investigation, figured out what happened, and came up with sweet sweet revenge.",
        "author": "coversbyrichard",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/zjixki/hoa_towed_my_stepdads_car_again_and_instead_of/",
        "text": "[removed]",
        "created_utc": 1670810293,
        "upvote_ratio": 1.0
    },
    {
        "title": "Make me prosecute this case without probable cause? Fine, I’ll withdraw",
        "author": "Sensitive-Watch-924",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/zjhufp/make_me_prosecute_this_case_without_probable/",
        "text": "I was a new prosecutor for a mid-sized city in the Northeast and doing my time in the local courts bureau.  \n\nI had a DWI probable cause hearing one morning and the public defender approached me beforehand to show me the body cam footage from the stop.  Turns out, the officer had marked the defendant “missed” steps on the heel-toe walk when he had, in fact, not.  The officer also noted slurred speech and bloodshot watery eyes—none of which were present.  The defendant had refused the breathalyzer so the only evidence were the field tests.\n\nI called my supervising attorney relayed the same, requesting to dismiss the charge.  Instead, I was instructed to prosecute anyways based on officers report of smelling alcohol and poor driving beforehand (crossed center line).\n\nSo we go to the hearing and the officer’s testimony is a disaster.  When confronted with the cam footage on cross he crumbles and it’s clear he wasn’t actually watching the guy during the tests.  He couldn’t remember “for sure” whether he actually smelled the alcohol—only that if it’s in his report “I must have smelled it,” or words to that effect.\n\nI ask for a recess and call higher—again rebuffed and forced to proceed.\n\nThis time, however, I recalled a special provision in the Attorney Ethics rules:  a prosecutor can’t prosecute a case if they subjectively believe there isn’t probable cause that the offense occurred.  \n\nBack on the record, I cited the officers poor testimony, inconsistent records, lack of a breathalyzer, and otherwise fully compliant field side tests and promptly withdrew “personally, but not as a representative of the District Attorneys Office.”\n\nI called my supervisor, relayed the same—citing the exact sub-paragraph of the ethics rules—and waited for her to have to drive 30+ mins out to the local court to continue with the hearing.\n\nThe Court dismissed the case before she got there.\n\nEnded up getting fired a few weeks later, but that’s another tale.",
        "created_utc": 1670807994,
        "upvote_ratio": 1.0
    },
    {
        "title": "Table for ten in ten minutes? YES SIR!!",
        "author": "3-2-1-backup",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/zjf0fx/table_for_ten_in_ten_minutes_yes_sir/",
        "text": "This story takes place about fifteen years ago.\n\nI had my phone number for a while now, long enough that all the olds had it memorized as *my* number. So I really didn't want to change it for any reason.\n\nBut one day, almost like a switch, I started getting calls from people looking to reserve a table at The Cheesecake Factory. Way too many to be a practical joke by my friends, something else had to be going on. It turned out that the new location of the cheesecake factory was assigned the number (555) 555-1223.\n\nProblem was my number was (555) 555-1123.\n\n*IT WAS MADDENING!* I went from one wrong number a month to ten to twenty misdials a day! Even worse about half of them would hang up, *hit redial*, and boomerang right back to be! (And now they were mad at *me*, because.... Reasons?)\n\nFinally one day I snapped. (Cue the malicious compliance!) Instead of politely telling people that I was not the cheesecake factory, *I said yes to everything.* Jane, table for five at eight? Yes ma'am! You want to know what the wait time is? Well sir the dining room is empty right now! You need a table for ten in ten minutes and you know the owner? Well yes sir we can accommodate you!\n\nThe location is still open, but they changed their phone number not too long after that!",
        "created_utc": 1670802309,
        "upvote_ratio": 1.0
    },
    {
        "title": "Fine, I'll put every item out",
        "author": "OkMistake9553",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/zjd7vs/fine_ill_put_every_item_out/",
        "text": "So my boss had pulled stuff from our storage room to put on our shelves. I, doing what I thought was right, put anything that didn't fit on the shelves back in storage. A couple days later my boss says there's more for me to put out from storage. I notice that there are almost all of the items I haven't been able to put on the shelf amongst them. They said put it ALL out so I did. Are there items everywhere now? Yes. I did my best to keep it within its own price tag area but there were just so many.. If only I had a storage room to put the overstock. This is a retail setting that also has a pharmacy. Good luck doing inventory next week with everything everywhere. Btw its not like I had put everything in a pile in the storage area, I had put each item where it belonged.",
        "created_utc": 1670799031,
        "upvote_ratio": 1.0
    },
    {
        "title": "You don’t want your money?",
        "author": "Supersmoover54",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/zjbtnw/you_dont_want_your_money/",
        "text": "This happened in the 1970s. I (M68) was earning about £15/week (reasonable amount back then) and had been saving for an electrical item (about £9) I needed for home. I went to me local store and took [item] to the till, the girl on the till rang it up and I handed a £10 note. She gave me my change and I started to leave. As I walked through the door I realised I had the wrong amount of money in my hand. Now there’s a rule that once you’ve left a shop mistakes cannot be rectified. I walked outside, saying hello to a supervisor stood near the door as I left. Once outside I looked at my money, knowing that supervisor could see me. I turned and walk in, to the supervisor and told her I’d been given the wrong change (without being specific). “Once you’ve left the store I’m afraid there is nothing we can do about it” she said. I said “I know, but you saw me leave and return within seconds”. She reiterated “once you leave we cannot do anything, I’m sorry”. I looked at her and said “well, if that’s your decision… oh, by the way, till x will be £10 down at the end of the day. She gave me my change AND gave me my £10 note back. Thank you for the free [item]”. I’m quite honest and £10 was a lot of money but if they don’t want it that’s fine with me.",
        "created_utc": 1670797043,
        "upvote_ratio": 1.0
    },
    {
        "title": "Won't let me feed the crows from the balcony? Fine, all the birds are coming by at 8 every morning",
        "author": "IonlyusethrowawaysA",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/zj9d7k/wont_let_me_feed_the_crows_from_the_balcony_fine/",
        "text": "A year in the making, but oh so beautiful.\n\nI love crows.  They're my favourite animal, and just so cool and emotive.  They're awesome.\n\nI started feeding the local couple that were nesting near me, and come winter the entire flock was coming by every day.  I talked with my neighbours, found an agreeable time, and tossed out a few bags of weed as thanks for being chill.  Everything seemed like it was fine, except my one neighbour (let's call him SD for short) keeps making little comments once in a while.\n\nAbout four months in, my landlord comes into my workplace (I rent an apartment above my shop) and yells at me that the crow feeder is attracting rodents.  Apparently the mice in our building are climbing trees and then jumping a 2 meter gap onto our building, climbing to the crow feeder, and eating the food in it.  This seems unlikely to me, the feeder is only up for two hours a day and I've never seen mice parkour.\n\nIt comes out that SD complained, and fibbed quite a bit in his complaint.  Detail after detail keeps slipping.  There's a mouse problem in the building.  I've never seen one, or signs of any, but then again, I've lived on farms and still store my food off the ground, keep a tidy floor etc...  The restaurant next door is complaining about the place smelling like pot, and SD pointed him at me.  Landlord is absolutely convinced it's acrobatic mice making the leap to the balcony.\n\nI mention to the landlord that my shop was smelling like pot for the years that I was in it before renting the apartment upstairs, and that I ALWAYS go outside for a puff.  Also that I've lived on farms, and in plenty of buildings, and NEVER seen a mouse or rat decide to ignore ground floor entrances in favour of a leap of faith.  We go back and forth for a bit, I agree to stop feeding the crows, and tell him that without some kind of proof, he can kick stones over anything else.  I add that he is never to come in to my workplace without specific and declared need again, that I would be saving the recording of our interaction, and that he has on no uncertain terms crossed a line by coming into my workplace and raising his voice.\n\nAfter work I check my suite and shop, no gaps, no holes, no droppings, no signs of mice at all.  Knock on SD's door, see what's up.  He invites me in to talk (first time I've been in his suite), and suddenly, everything makes sense.  He has a few birds of his own, has an ashtray filled with roaches (tips of joints, not insects), and the floor is littered with bird seed.  Obviously SD doesn't want the landlord to know he has pets, that he blazes inside, and that he's the probably cause of the rodents.  I give zero shits what he has to say.  He had the opportunity to talk to me person to person, to find recourse that wasn't putting the target on me, or just fucking anything, I'm done.\n\nSo I look up the bylaws for feeding birds, and for peace and tranquility.  I called my local council to make sure I wasn't ruffling feathers, and got the go ahead.  Every morning I was going out at 8am, and feeding my crows about 10m from my font door (now just the nesting couple again)  and there are no complaints.  Come October, the entire flock is coming again, and I'm having to up the food amounts.  Within weeks the local seagulls are coming by too.  I could jury-rig another feeder to keep them away, but, instead I just up the feed amount to accommodate more birds.  Every morning is met with a chorus of birdsong, crow and seagull birdsong.  I personally love it.\n\nSD confronts me first.  I respond by being sympathetic \"Oh I know, it was way better before someone got the landlord involved.  We could agree on a time, be considerate of each other and shit.  Now they gotta be fed and done before 9am, and it has to be after 8am for peace and tranquility laws.  Oh well.\"  \n\nLandlord tried next.  I texted back that I was feeding them on city property ignored him until he came into my shop again, yelling again.  I recorded the entirety of his rant, and asked him if he knew where I was feeding the birds.  He did, and then I asked him where the property he was responsible for ended.  He left, and I forwarded a complaint to the property management company.\n\nNext come my other neighbours, and they get the same treatment.  \"Yeah, it sucks, I miss feeding them at 11 too.  But SD got the landlord involved and now I have to do it on city property, and that means my only window is between 8 and 9.  Sucks man, oh well.\"  No one's tried to ask me to not feed them, I think they have realized that the crows mean more to me than most things.\n\nAlso, the crows still chill on the balcony waiting for me in the morning, and I swear have started imitating my \"G'morning buds\" if in cadence alone.",
        "created_utc": 1670793392,
        "upvote_ratio": 1.0
    },
    {
        "title": "You want to \"feel it\"? How about feeling to loose?",
        "author": "Please_Dont_Ask_",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/zj1yhi/you_want_to_feel_it_how_about_feeling_to_loose/",
        "text": "Sorry in advance for all grammar mistakes, english isn't my native language.\n\nThis story happened a couple months ago. Our school had a big choir (more or less 200 students), but because of the pandemic many left (They finished school or just didn't want to go anymore). Because of that we only were around 100 students, which is still a lot. But the choir wasn't as good as it used to be. We older students had to sing even louder, so the smaller ones had some to listen.\nUnfortunately a month before our first concert in years, the teacher, who organised everything, broke his foot, so he sent another, newer one.\nLet's call him Mr. Know-it-all.\nMr. Know-it-all was an complete ass, since we began. He couldn't play the piano very well, but said it was because of our singing skills. He cut a third of the concert, which made us sad, because it was a really nice medley of \"Les Miserables\" and we all loved it. \nLater Mr. Know-it-all made us rap the lyrics of songs like \"Perfect\" (Ed Sheeran) or \"Signs of the times\" (Harry Styles) so that we \"know the song better\". We all already knew these songs, especially the lyrics.\nMr. Know-it-all then proceeded to tell us, that the other Medley we had were just wrong (they clearly weren't). After he told us, that we should sing the end of Queens \"Bohemian rhapsody\" in forte, even though it normally is pianissimo, some of us older started protesting. We couldn't just change everything, just because he said so. Also we sang Queen songs like at least once every two years, so we older students were singing it for almost seven years. Clearly longer than that stupid Know-it-all, who literally heard us singing it before our normal teacher broke his foot. And it was one of our good Medleys.\n\nI kept quiet, because he was also my normal teacher in Computer science and I didn't want dropping grades (Yes, Mr. Know-it-all is one of those teachers, who grade the sympathy and not your quality, but because I'm the only girl in his class, he always gives me better grades. He also tries to set me up with my best friend, that sucks way more).\nBut I got angrier and angrier with every comment he made about us being a shitty choir or us being selfish.\nMr. Know-it-all then changed the notes of \"Sign of the times\" so badly, that it was completely wrong. Like you didn't recognise it by the melody and even changed the lyrics, because what else should you do, after rapping the right lyrics for the fifth time?!\nSide note: I'm the best alto in the choir (I have the longest training and in the singing class I was the best graded alto, but there still were better sopranos; I'm not saying, I'm the best singer ever) so if I'm not there, you barely hear anything, because for the little ones there isn't anybody they can orient on. But I've also got some south-european blood in me, so when I explode, I shoot my opponents dead. Metaphorically. Normally I'm very good at hiding my anger, but then Mr. Know-it-all made me come out of my shell.\nThis conversation found place:\n(Mr. Know-it-all = Mr. K)\nMr. K: \"You have to sing it the way I'm telling you. Otherwise I can't feel it.\"\nMe (very loud) : \"I'm OUT\"\n(Everybody stares at me, as I'm packing my things)\nMr. K: \"Where do you think you are going?\"\nMe: \"Away from this shitshow. I'm not going to be at the concert. Not with you as a teacher.\"\nMr. K: \"Why? You should stay here, you are important for the alto.\"\nMe: \"But you are ruining everything. This is not why I entered the choir.\"\nMr. K: \"Just stop this nonsense. I really don't see, why you are leaving.\"\nMe: \"Well, I 'can't feel it'. Good luck to everybody, but I won't be there.\"\nSo I go out with the most dramatic walk I could bring, without seeming ridiculous. As I already said, I'm basically the lead singer in the alto. I've got some friends there and they started packing, too. I saw that and waited for them outside. I didn't think much of it, but then nearly everybody left and they said, only the younger students stayed there.\nI passed the window (the room has windows directly to the street) and peaked inside. There were no altos left, only a few sopranos and basses. One window was open, so I shouted: \"How about that feeling? The feeling of loosing!\"\n\nAs far as I know, the concert was horrible. Some students just left for that session and still showed up to the concert. I didn't.\n\nMr. Know-it-all wanted to feel the emotion, he got emotion.",
        "created_utc": 1670781846,
        "upvote_ratio": 1.0
    },
    {
        "title": "Hand or Hair? Hair!",
        "author": "Personal_Lavishness4",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/zj1bsu/hand_or_hair_hair/",
        "text": " I cringe every time I remember what happened. This is not your typical “stick it to the man/teacher/boss” story. \n\nOne of the “fads” in parenting some years back was “Love and Logic.” Essentially, it was about providing choices to children, so they feel some ownership/validation. The trick was that you have to be OK with either choice. It can be very effective with toddlers - Instead of asking, “Are you ready to get dressed?” your ask, “Do you want to wear the yellow shirt or the blue shirt?”\n\nAnyway, my 3-year-old daughter and I were walking down the street, and as toddlers sometimes do, she was singing a phrase over and over again happily. She liked to do that with phrases or sentences that rhymed or had a certain ring.\n\nShe sometimes runs a few steps ahead, but she knows that when we come to a crosswalk, she stops, holds my hand, and we cross together. To Be Safe.\n\n2 blocks from our house, she decides that she doesn’t want to hold my hand. I insisted. She refused, and it was gearing up to be a battle of wills. In desperation, I gave her a choice and said, “Hand or Hair?” meaning she could choose if I would hold her hand or her hair when we crossed the street. \n\nNo one would choose “hair,” right? Not even a 3-year-old who is still stuck in the terrible twos, right?\n\nWrong.\n\n“Hair!” she screamed happily. And would not move until I made her a ponytail and held onto it while we crossed the street.\n\nAnd then, for two long blocks, she skipped happily to the house. Repeating again and again.\n\n“Hand or hair? Hold my hair! Hold my hair!” over and over.\n\nWell, my dear readers. She had trouble talking and with the letter “r.” And every time she said “hair,” somehow it came out “whore”.\n\nSo what she said actually sounded like this, “Hand a whore? Hold my whore! Hold my whore!”\n\nLoudly. Again and again. For two very, very long blocks.\n\nIn my mind, windows were being thrown open, and my lovely neighbors were muttering, looking and judging me and how I raise my child.\n\nI kept my head down and tried to walk faster to make it home as fast as we could. \n\nI still cringe when I think of it.",
        "created_utc": 1670780818,
        "upvote_ratio": 1.0
    },
    {
        "title": "You can’t have your car, even for work",
        "author": "ProfessionSimilar510",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/zizq4d/you_cant_have_your_car_even_for_work/",
        "text": "This happened when I was 16. I got grounded for some stupid reason, probably arguing with my parents or fighting with my brother. They tended to ground me for long periods of time even for small things. They basically told me it was up to me to figure out a ride to and from work, as long as I knew it wouldn’t be from them. Okay! Sounds good. I got driven to work by a friend that day and then after my shift, I began my long walk home. And I do mean long walk. \n\nIt was about an hour and a half long and 45 minutes into the walk I started getting phone calls and texts asking where I was, and that I need to come home NOW. When I finally did come home, I told them I had no other ride and was left with no choice but to walk. Got my keys back that night because they didn’t want me walking out alone that late. Worked like a damn charm",
        "created_utc": 1670778175,
        "upvote_ratio": 1.0
    },
    {
        "title": "Malicious Compliance request",
        "author": "vik556",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/ziww0y/malicious_compliance_request/",
        "text": "Hello!\n\nI just bought an apartment, and I am already tied to buy it.\n4 days before moving in, I received messages from the current owner announcing me that some lights do not work and that I would have to redo the whole ceiling and hire an electrician as some plugs are not working.\n\n\nThe broker and the owner both told me it was my duty to check these (first time buyer, I make mistake but learn from them).\n\n\nWhat could I do to annoy the owner when I will sign the document, beside coming late I do not have ideas.\n\nWhat I can tell is that the owner was emotionally attached to the flat and had to leave because of a divorce.\n\nThanks for you advices",
        "created_utc": 1670773353,
        "upvote_ratio": 1.0
    },
    {
        "title": "Need A Maliciously Compliant Response To Ridiculous Request",
        "author": "SereneLotus2",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/ziw500/need_a_maliciously_compliant_response_to/",
        "text": "Boss upset/unhinged $$$ goals not being met. Have until December 31. It’s never going to happen. Boss is mega-micromanager on a good day.\nBesides making us document all interactions with clients in multiple formats, the new mandate is “must copy boss on ALL email”.\nWe are a professional team of highly educated individuals that send hundreds of emails each day and this is not just tedious, makes us feel not trusted but it’s also insulting. We asked repeatedly how copying boss on email will positively impact goals? Boss refuses to respond. (We are not stupid we know this is a CYA for boss when goal not met)\n\nWe are supposed to begin complying tomorrow.\n\nHow can We maliciously comply? All suggestions appreciated, (except “quit” cuz can’t afford it.) Thanks,",
        "created_utc": 1670772047,
        "upvote_ratio": 1.0
    },
    {
        "title": "my (17f) manager had me leave the new girl waiting tables on her own, so I took her at her word.",
        "author": "alexann23",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/ziq69a/my_17f_manager_had_me_leave_the_new_girl_waiting/",
        "text": "I, (17F), am a waitress/server/cashier at a semi local Italian chain. (Not going to say which, but it's considered a \"specialty\" of the DMV area.) I recently had to take a month off of work for health reasons, since I was in the emergency room and then had to spend time in inpatient. While I was away, there were huge changes at my job, including new managers and two new employees. \n\nI've only been working there since last June, but I picked things up pretty quickly, barring the first day I had to deal with a packed dining room by myself while still in training- I'd messed up pretty badly with the computer system and needed the Manager's help. Still, it happens. \n\nYesterday, I met the new girl for the first time (it was her third day, still in training.) She's my age and a complete sweetheart, and as the dining room slowly became more and more packed, we made a great team - she got to practice working with the computers and talking to customers while I took down the orders and showed her how everything worked. It was her first time \"properly\" serving there, and she really did great considering that, certainly at first. \n\nThe other two people who were working was a manager and one other hourly employee. The managers at my job will also serve and work the counters (basically, all waitresses have to do double the work, and we still get paid dirt but that's another story.) I was running between the dining room and the counters to try to keep up (although we can only serve max two people at the counters picking up or placing orders at a time.) It was to the point where my manager and her friend had bundled up and complained about how cold it was, while I was flushed, with my coat off, covered in sweat (cleaned myself up when dealing with the food, of course.) The manager and her friend were sitting down together, alternating between scrolling on their phones and talking, only getting up to answer the phones when they'd already rung 5+ times and having people wait at the counters to be helped for 10+ minutes. It was massively irritating, but I didn't have the time/energy to confront them. \nWell. \nAbout halfway through my shift, my manager told me that I can't just go in between the dining room and the counter, and if I didn't pick one or the other she'd withhold my tips for both, since I \"wasn't fully invested in either.\" Ouch. She gave me a choice on paper, but in reality made it perfectly clear that I was stuck behind the counter and the new girl, the trainee, was on her own. There was nothing I could really do, so I just stayed at the counter, though that was plenty slammed in and of itself, and I really, really could have used my two coworkers who were screwing around on their phones. I didn't have time to answer phone calls, pack up orders, check people out, and take to go orders all at once, and I had one particularly angry woman call me a \"lazy bitch\" for leaving her on hold for about two minutes (that stuck with me.) While I was doing all this, the new girl was stuck with a packed dining room and no help. \n\nAbout twenty minutes into it, my manager approaches me looking both angry and sheepish. Basically, the trainee had messed up and charged the wrong orders to the wrong cards and needed help- though the way she phrased this was, \"you know, you don't HAVE to stay by the counter the whole time, that's not what I meant.\" I looked over and could see her friend on her phone still, and the manager herself still had airpods on and a show playing on her own phone screen. I responded in my sweetest, most respectful voice, \"I'm sorry, but as we only get paid $10/hour, my tips are too vital for me to forfeit them, so I'm going to stay put.\" (Context, minimum wage is 15.65 where I live.) She was floored and instead of helping either of us herself, waddled back to her seat and resumed her show. \nOf course, I ended up checking in with the trainee and asked if she needed my help, and if the mistake was sorted out. She said that she had things back under control and a lot of the people dining in were headed out, which was great because the counter was still slammed. \n\nThe kicker? This morning apparently a customer called in and complained that \"the blonde girl (me) and the girl with braids (trainee) were so busy that they were sweating, while the two other women (manager and her buddy) were sitting on their phones.\" I only wish i saw her face when she heard about the complaint. \n\nTL;DR- manager told me to leave the new girl floundering because she and her buddy were busy on their phones, so I took her seriously and literally- even when she tried to take back what I said because there was a big mistake.",
        "created_utc": 1670761943,
        "upvote_ratio": 1.0
    },
    {
        "title": "whatever you drink.",
        "author": "CaptainBaoBao",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/zipwqq/whatever_you_drink/",
        "text": "Often, when someone receives somebody not accustomed to come to your home, the answer to the question \" what do you want to drunk?\" Is a variation on \"whatever\". Nobody want to be judged by the other, and some people don't drink alcohol in private , or despised it entirely, while other think that offering a liquor is the proper protocol, want it or not.\n\nA friend of my father solved the problem.\nOn his cabinet he has a bottle marked \" whatever\" which he will serve to people giving that answer. The taste and the colour is never the same, and it is often a strong spirit.\n\nWhen asked what it is, says that he put all the bottom of nearly empty bottles to that one, si he can buy a full bottle of the regular spirit.\n\nThere is literally Whatever in that bottle.",
        "created_utc": 1670761387,
        "upvote_ratio": 1.0
    },
    {
        "title": "How I Took Down a Difficult Client",
        "author": "ozzy82born",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/zij9am/how_i_took_down_a_difficult_client/",
        "text": "\n\nAs the manager of a small convenience store, I had always prided myself on my ability to handle difficult customers. I had been trained to always keep a cool head, and to use my customer service skills to defuse even the most heated situations.\n\nBut then, one day, a customer came into the store who pushed me to my limits. She was rude and demanding from the moment she walked in the door, and she didn't seem to care about anyone else in the store. She wanted everything her way, and she wasn't afraid to let me know it.\n\nAt first, I tried to handle the situation the way I always did. I smiled and nodded, and I did my best to accommodate her requests. But no matter what I did, it wasn't enough. She kept complaining and making demands, and she wouldn't stop until she got exactly what she wanted.\n\nI began to feel frustrated and angry. I knew that I was supposed to be patient and understanding with difficult customers, but this woman was pushing me too far. I felt like I was being taken advantage of, and I didn't know how much more I could take.\n\nAnd then, something inside me snapped. I realized that I didn't have to put up with this woman's behavior anymore. I could finally give her a taste of her own medicine.\n\nSo, with a smile on my face, I complied with her every demand. I gave her extra ketchup packets for her fries, and I even let her cut in line at the cash register. But I did it all with a malicious glint in my eye. I was determined to make her experience as unpleasant as possible, while still technically following her requests.\n\nAnd it worked. The woman grew more and more frustrated as I complied with her demands, but never gave her the satisfaction of actually meeting her expectations. She stormed out of the store in a huff, and I couldn't help but chuckle to myself as I watched her go.\n\nIn the end, I learned that sometimes, the best way to deal with difficult customers is to give them exactly what they want, but in the most frustrating and annoying way possible. It might not be the most professional approach, but it sure is satisfying.\n\n\n2 / 2\n\n\n\n\nJesse Osborn\nCreate a title for this story\n\"The Art of Malicious Compliance: How I Got the Last Laugh on a Difficult Customer\"\n\n\n\n\nJesse Osborn\nCreate another malicious compliance story\nAs a receptionist at a busy law firm, I was used to dealing with a wide range of personalities. Some clients were friendly and polite, while others were rude and demanding. But no matter what, I always did my best to remain professional and courteous.\n\nHowever, there was one client who was particularly difficult to deal with. She was a wealthy and powerful businesswoman, and she seemed to think that her money and influence entitled her to special treatment. She would often come into the firm with a long list of demands, and she expected me to drop everything and cater to her every whim.\n\nAt first, I tried to be patient and understanding. I would apologize for any inconvenience and do my best to accommodate her requests. But no matter what I did, it was never enough. She would always find something to complain about, and she would make my life miserable until she got her way.\n\nI began to dread seeing her name on my schedule. I knew that every time she came into the office, it would be hours of misery for me. And I knew that if I didn't do something to change the situation, it would only get worse.\n\nThat's when I decided to try something new. I decided to give her exactly what she wanted, but in the most annoying and frustrating way possible. I would comply with her every demand, but I would do it in a way that would make her regret asking for anything in the first place.\n\nThe next time she came into the office, I greeted her with a smile and a cheerful \"Good morning! What can I do for you today?\" She handed me her usual list of demands, and I nodded and said, \"Of course, I'll take care of that right away.\"\n\nBut instead of doing what she asked, I went out of my way to make her experience as unpleasant as possible. I took my time with every request, and I made sure to let her know exactly how much she was inconveniencing me. I smiled and nodded, but I never actually did what she wanted.\n\nAt first, she didn't seem to notice. She was used to getting her way, and she assumed that I was just being efficient and professional. But as the minutes ticked by and her requests remained unfulfilled, she began to get frustrated. She started to raise her voice and make demands, but I just smiled and kept stalling.\n\nFinally, after what seemed like hours, she threw up her hands in frustration and stormed out of the office. And as she left, I couldn't help but feel a sense of satisfaction. I had finally found a way to stand up to a difficult client, and I had done it without breaking any rules or compromising my professionalism.\n\nFrom that day on, I made it a point to always give difficult clients exactly what they wanted, but in the most annoying and frustrating way possible. It wasn't always easy, but it was definitely worth it. And in the end, I learned that sometimes, the best way to deal with difficult people is to give them exactly what they want, but in a way that makes them regret ever asking for it in the first place.",
        "created_utc": 1670742630,
        "upvote_ratio": 1.0
    },
    {
        "title": "How I Got the Last Laugh on a Difficult Customer",
        "author": "ozzy82born",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/zij68b/how_i_got_the_last_laugh_on_a_difficult_customer/",
        "text": "As the manager of a small convenience store, I had always prided myself on my ability to handle difficult customers. I had been trained to always keep a cool head, and to use my customer service skills to defuse even the most heated situations.\n\nBut then, one day, a customer came into the store who pushed me to my limits. She was rude and demanding from the moment she walked in the door, and she didn't seem to care about anyone else in the store. She wanted everything her way, and she wasn't afraid to let me know it.\n\nAt first, I tried to handle the situation the way I always did. I smiled and nodded, and I did my best to accommodate her requests. But no matter what I did, it wasn't enough. She kept complaining and making demands, and she wouldn't stop until she got exactly what she wanted.\n\nI began to feel frustrated and angry. I knew that I was supposed to be patient and understanding with difficult customers, but this woman was pushing me too far. I felt like I was being taken advantage of, and I didn't know how much more I could take.\n\nAnd then, something inside me snapped. I realized that I didn't have to put up with this woman's behavior anymore. I could finally give her a taste of her own medicine.\n\nSo, with a smile on my face, I complied with her every demand. I gave her extra ketchup packets for her fries, and I even let her cut in line at the cash register. But I did it all with a malicious glint in my eye. I was determined to make her experience as unpleasant as possible, while still technically following her requests.\n\nAnd it worked. The woman grew more and more frustrated as I complied with her demands, but never gave her the satisfaction of actually meeting her expectations. She stormed out of the store in a huff, and I couldn't help but chuckle to myself as I watched her go.\n\nIn the end, I learned that sometimes, the best way to deal with difficult customers is to give them exactly what they want, but in the most frustrating and annoying way possible. It might not be the most professional approach, but it sure is satisfying.",
        "created_utc": 1670742362,
        "upvote_ratio": 1.0
    },
    {
        "title": "Toddler outsmarts us",
        "author": "Underpaidcube6",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/zigv3s/toddler_outsmarts_us/",
        "text": "My son is almost 2 and, like any toddler, has an unbelievable amount of toys. He insists on taking a toy car with him to bed and out of the house. If you stop him, he’ll cry endlessly.\n\nHe also has cars of every size. This includes one that is so big, it has a lid and fits about 10 smaller cars inside it. \n\nA couple of days ago, it’s time for his nap. He gets into bed and starts crying saying car. So we let him go get one and we’re very insistent on one car as sometimes he can take more than one. I think you can see where this is going and we should have seen it too.\n\nHe comes back with this giant car as his one car. My wife just starts laughing as he’s technically not wrong as our toddler maliciously complied.",
        "created_utc": 1670737232,
        "upvote_ratio": 1.0
    },
    {
        "title": "Enjoy the game Karen.",
        "author": "FurtiveFox88",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/zigogb/enjoy_the_game_karen/",
        "text": "Sorry if format gets wonky, on mobile. Also sorry it's so long.\n\nThis happend around 2013 or so. I had a part time gig as Event Staff for a local university. I really enjoyed it because it brought in extra cash, broke up the monotony of my \"full time\" retail job (I could request Game Days off well in advance), and it was sign up per gig so I didn't have to work if I didn't want to. \n\nThe city this university is in was not designed to handle the massive crowds that attend college football games nowadays (super old city, like Vicorian houses are everywhere), so traffic is a nightmare anywhere near it. Most people opt for shuttle busses or pay like 20 bucks for game day parking at businesses and even people's drive ways, but for those that have season tickets, they get special assigned parking areas on campus. On regular days, these areas are free for students and guests to use, but if your in those areas on game day, your vehicle will be towed at your expense. \n\nSo game day rolls around and I'm in charge of Lot D. Only tow trucks and anyone that has a D hanging from their rear view mirror gets in, a movable plastic baracade was the gateway. As always, traffic on campus becomes bumper to bumper as fans inch their way to their assigned lots. So slow in fact that I can easily help point people in the right direction if they are lost (I kept a note pad and a map with me so I could jot down left, straight, straight, left, right for them) without ever leaving my post. \n\nSo everything is going smoothly, people are frazzled by the traffic, but very polite when talking to me throughout the day. I had just let in a vehicle and was moving the baracade back in place when a new, very ritzy white SUV whips in preventing me from fully closing the entrance. I immediately noticed that their mirror sign thingy did not say D, but instead said Brad Pad. I walk to the driverside window and see a young college aged man with an \"I'm so done with this shit\" look on his face. In the back middle seat was his very annoyed father and the passenger seat was occupied by his very \npissed looking mother.\n\nMe: Hi, yall folks need some help?\nDad. Yeah, we can park here right?\nMe. I'm afraid not sir, this is for D vehicles only and your pass says Brad Pad.\nDad. But our pass is blue and this lot is blue on the map!\n(Quick note about the map, parking areas were colored to make it easier to visually separate one lot from another as the same colors never touched. There was like 3 blues, 3 orange, 2 yellow, etc., but they had nothing to do with the parking areas at all.)\nMe. Oh, the colors don't matter sir, the only thing that matters is the letters and I can't let you in without a D or your vehicle will be towed.\nMom. Then where the hell are we supposed to park?\nSon. Mom, calm down!\nMe. That's a very good question, because your the first \"Brad Pad\" I've seen so let's see.... (I begin scanning the map)\nDad. This is fucking ridiculous.\nSon. Dad, he is trying to help us.\n\nThere is nothing on the map that says Brad Pad, but the basketball stadium is named Bradford So and So Stadium  and indeed has an assigned parking area around it (no Letter, just grey parking area)so I make an educated guess that that's where they are to park. Problem is it's on the other side of campus in the opposite direction they came from.\n\nMe. I believe you guys are supposed to be at the basketball stadium back that way. I'm not 100% sure, but that's your best bet.\n(The son rested his head on the steering wheel in utter exasperation)\nDad. The basketball stadium is in grey! And our pass is blue!\nMe. Sir, the colors do not matter. I have no idea why the university thought the colors were a good idea, but all that matters is what your pass says, not what color it is.\nMom. (Screaming at me) No! Our pass is blue and that means we can park anywhere that's blue! So let us in NOW because YOU are WRONG!\nSon. (Snaps his head up and looks at mom) Mom shut the fuck up!\n\nShe didn't acknowledge her sons outburst and just kept starting at me with a glare that could melt porcelain. I have dealt with rude customers before, but have never been yelled at like that before. I was stunned. After about 5 seconds that felt like an eternity, the words just flowed out of me.\nMe. Ughh, pfft, okay, go on in. (I said this in a very \"okay, but you'll be sorry\" tone)\nMom. See, that's better!\n\nNow, what I meant to do was watch where they parked so I could wave over the son and tell him to get his parents into the stadium and come back to move the SUV because none of this was his fault at all, poor guy just wanted to enjoy a nice game of football with his loved ones. However, at that moment people that actually belonged in Lot D started arriving in rapid secession and I had a job to do. I also didn't see where they parked. \n\nSure enough, about 45 mins later, a guy in a university golf cart pulls into the lot and starts walking around cars. 30 minutes after that, three tow trucks come rolling in. Each with different company names on them. Two students cars were removed as well as a new, ritzy, white SUV. I watched as they towed it down the street, Brad Pad sign dangling from the rear view mirror. \n\nAbout 30 minutes after the game started, the baracade was taken down and I was picked up by an event staff truck so we could start picking up traffic cones, so I never got to see the unfettered rage those people had to be in when the game was over. \n\nAlso, the university does not keep track of what company tows what vehicle so I'm sure that was even more fuel for the fire.\n\nAfter that day, I found a better job that paid more for 40 hours and paid overtime, so that was my last Event Staff gig.\n\nTo the college guy driving that day, if you are reading this, I'm very sorry your SUV was towed, but I hope that your parents paid to get it out of hock for you and learned something that day.",
        "created_utc": 1670736833,
        "upvote_ratio": 1.0
    },
    {
        "title": "I became a malicious property assessor",
        "author": "RecommendationNo191",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/ziaevz/i_became_a_malicious_property_assessor/",
        "text": "[removed]",
        "created_utc": 1670723411,
        "upvote_ratio": 1.0
    },
    {
        "title": "My grandfather gave a British officer a boy scout salute.",
        "author": "SilasBlackheart",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/zi5f3z/my_grandfather_gave_a_british_officer_a_boy_scout/",
        "text": "My great grandfather fought in WW2, he was sent overseas to India at the time with his men. From what I can remember he was just infantry for the US army, I'm not sure his rank but I know he wasn't an officer. While he was there he and his men had to work along side the British soldiers in the area, who at the time were not the easiest to work with. They always stuck their noses up at his group and whispered less than good things behind his back, for example, they were just lazy Americans, surprised they know how to hold a gun, things like that.\n\nWell one day one of the British officers approached him and his men expecting for them to salute him, however they did not. He got offended and ordered them to do so, they laughed and told him he isn't their superior so they don't have to do sh#t. So he reported them to their superiors and they were told they had to salute the British superiors.\n\nSo the next time the British officer approached they stood at attention and gave him a salute..... a boy scout salute. At the time the officer didn't know what they were doing and just thought it was a personal Salute they did, so he was satisfied. They never got in trouble or received any complaints after that but they always laughed about it from that point on, and every time a British officer approached they always gave the same boy scout salute. The officers always walked off looking smug like they won something afterwards.\n\nP.S. I know this story wasn't someone getting fired or getting screwed over but it was a story told in my family that I always found funny and I wanted to share it. Thanks guys!",
        "created_utc": 1670710732,
        "upvote_ratio": 1.0
    },
    {
        "title": "MC Christmas edition",
        "author": "Xayna76",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/zi3xu3/mc_christmas_edition/",
        "text": "I'm not very good at being maliciously compliant, so while I've loved reading the stories on here, I've never had a story I thought would fit enjoyably.   That is until I remembered Christmas many years ago. \n\nI've always enjoyed holidays with Christmas being my favorite.  My favorite thing about Christmas was trying to find the right gift for people.  I would spend hours upon hours going from store to store trying to find that perfect present.  \n\nI come from a large family (8 kids)  and in order to not break the bank each year we rotated which sibling (and their families as we got older)  we gifted presents too.   This particular year it was my turn to gift my sister, her husband and their toddler daughter.  \n\nI asked them what they'd like for Christmas to get some ideas.  My sister answered with \"no clue\" and her hubby told me \"everything\".  I asked them several times, and always got the same response.  I asked my mom for their Christmas wish list.   They didn't have one. \n\nSo my hubby and I went shopping.   I don't remember what we got for the toddler, some toy or clothes or both.  For my sister we got her the game clue and made a nice no label to put in front of the title.   Then for her hubby we got him  a card that said \"sorry we couldn't get you everything, but here's a little something to get you started.  He opened the package to find one of those toy shopping carts.  We got them what they asked for.",
        "created_utc": 1670707287,
        "upvote_ratio": 1.0
    },
    {
        "title": "Go check the radar!",
        "author": "Radiant-Art3448",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/zi3jae/go_check_the_radar/",
        "text": "Way back in the dark ages I was in the military as an Aviation Electronics Technician. One of our jobs was to perform preventative maintenance (PM) to make sure the electronics in the plane didn't fail prematurely.  One of the hardest things to check on an old C-130 is the radar since you had to raise the radome to access the radar antennae.\n\nNow older C-130's have lots of flight hours, which means they also have lots of landings and takeoffs. The radomes are humungous and heavy. Im talking like 8' high, 7 feet wide (Don't hold me to those numbers - this was a long time ago.) There are 4 screws (top left and right, lower left and right) and a hinge on top so it can be lifted. Getting those 4 screws to line up on a slightly twisted and bent airplane can be difficult. VERY difficult. It usually takes 4 -6 extra people pulling on straps to get the darned thing aligned. \n\nAlso, in my service there is a usually friendly rivalry between the electronics types (tweets) and the mechanics (nosepickers) and metalsmiths (rivet-rapers.) I say usually, but at my new air station it was well beyond the friendly stage to the point that the rivet rapers and nosepickers wouldn't even acknowledge the tweets, and visa versa. I had just checked in from a heavy maintenance overhaul facility and was placed on night check (the 4-midnight shift.)  This is the shift where most preventative maintenance is performed. I replaced the two tweets who had previously been assigned to night check. \n\nOnce I started working the shift, I quickly found out a couple things. First, these two were either lazy or had everybody buffaloed. The workload that had previously been assigned to both of them, I was able to accomplish in about a half shift. So I started asking for more work.  The other thing I found out was that they were the epitome of tweets that couldn't stand the mechs.  \n\nI was not a fan of that game and quickly became friends with mechs by helping them when they were shorthanded for major jobs. All of the tweets vs mechs BS stopped the night the night check Chief came out and saw me up on a check stand on my hands and knees holding the weight of an aileron (Another very big piece that forms most of the back side of the wing. Its used to turn the plane when it turns in the air.) The chief bellowed \"Who's the new guy on the check stand?\"  \"Thats the new tweet we been telling you about!\" \"Well don't let him screw anything up!\" That's about as close to a thank you for helping or OK he's accepted as it came with that guy. But I never had a problem with the mech's again on night check.\n\nWhen I asked for more work, it began. The two previously assigned guys started rumors that I was doing shoddy work, and even worse, pencil whipping my work (signing it off but not performing the work.)  The Chief in charge of assigning my work caught wind of it and decided to perform a test to settle the rumors once and for all. He assigned me to performing radar PM. OK not a problem I completed it, signed off the paperwork, and completed my shift.\n\nThe next day I was met by my Chief, and several other people, including the 2 smirking tweets that were assigned to night check. I was accused of not possibly being able to complete the radar card since I didn't ask for extra bodies to close the radome.\n\nThe malicious compliance:\n\nI had also heard the rumors that I had been pencil whipping my work and knew immediately what the Chief was up to with the radar PM. And I wanted to make those two idiots look like dummies, so I just took the assigned work (with a smile.)\n\nThen, I went to the Night Check Chief and told him I had to crack the radome tonight and asked for some help. He said no problem. Saying that radome was a bitch is an understatement. It took us most of the night and me buying the beers after work to get it done. But it was WAaaayyyy worth it.\n\nThe fallout: Back to the next day. After being outright accused of pencil whipping, I innocently asked what the Chief was talking about asking for bodies to help me. They work day shift. Why would I ask people to help me on night shift?  The Chief replied because it takes extra people to close a radome. I again asked innocently, but why would I ask day shift to help me on night shift when night shift has plenty of people that can help me?  \n\n\"What plenty of people? There's only you and you couldn't possibly close a radome by yourself. I smiled inward and said I never said I did it myself. The plenty of people were the mechanics. The two idiots both said, they would never help! I looked at both of them and said Yet they did. And I don't like being accused of being a liar, performing shoddy work, or pencil whipping my work. Where did those rumors come from anyway? \n\nEveryone just sort of stared at the two idiots and the Chief said, be right back. Don't anyone leave. Few minutes later he returned and apologized for keeping me from my work. He had confirmed my story with the night check chief. And we were all dismissed except the 2 idiots.\n\nI didn't see those two much after that. But that was a fun tour of duty for me!",
        "created_utc": 1670706362,
        "upvote_ratio": 1.0
    },
    {
        "title": "Not enough Big Mac sauce? I got you bro.",
        "author": "twinkiehouse11",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/zi1xct/not_enough_big_mac_sauce_i_got_you_bro/",
        "text": "I was working at McDonald's about 10 years ago.\n\nDespite what people might think, there's actually a lot of work involved, since we only had 6 people trying to do the work of 20. Likewise, getting yelled at all day in a 100+ degree kitchen (37C+) is also less pleasant than other jobs I've worked. \"Oh what's that? Drive-thru needs 20 McDoubles and you only have 19? Gee, I wonder if front counter took one of your McDoubles. If you insist, I'll make an extra McDouble for you. Oh hey, what do you know, we have an extra McDouble now.\" Just the smell of grease now makes me want to chainsmoke 10 cigarettes, even though I quit 5 years ago. \n\nDoes that mean I think everyone deserves $15/hr? Irrelevant. No matter how much someone makes, treat them with dignity, not like they're some animal just because they're making sandwiches for you. We're all human beings, and we're all deserving of love. You can't pay me enough to take that away, and you can't pay me too little to deem me unworthy of that. \n\nI say all that just to say, I worked as hard as I could every single day, but sometimes, things just rubbed me the wrong way so much that I completely acted like a fool over it. This was one of those times. I realized in the moment, \"I could probably get fired right now.\" I realize looking back, \"I'm really lucky I didn't get fired for that.\" Here's what happened:\n\nA guy comes in and asks for a McDouble with Mac sauce. So, I make a normal McDouble, and I put a shot of Mac sauce on it. We now have a McDouble with Mac sauce. Crazy concept, I know. \n\nThe manager comes back a minute later making a big scene. \n\nManager: THIS GUY WANTED MAC SAUCE! GIVE ME A MCDOUBLE WITH MAC SAUCE ON IT ASAP!\n\nI'm pretty sure the whole lobby could hear it, maybe even people in the parking lot.\n\nMe: I put Mac sauce on it.\n\nManager: THEN PUT *EXTRA* MAC SAUCE ON IT!!! \n\nOk, so it's *extra* Mac sauce you want? Oh, I've got *extra* Mac sauce for you friend! Here's one extra shot. And here's another one just for your trouble! But wait, that's only *one* extra Big Mac's worth! Did you possibly want an *extra* Big Mac's worth? Here's another 2 shots for you! \n\n12 shots of Big Mac sauce later, I thought, \"I hope *this* is sufficient for him!\" What we actually had at this point was a pile of Mac sauce with a side of McDouble. If anyone was paying attention, they could see the Mac sauce oozing into the paper. \n\nMe: One McDouble, EXTRA Mac sauce! \n\nIt gets sent out. \n\nA few minutes later, the manager comes back, looking very disappointed. The customer is looking at me like I just got done robbing his house. The manager says, \"Ok guys, this is completely disgusting. Can we please get a McDouble, with just a little bit extra Mac sauce?\" \n\nWhat was that? \"PLEASE?\" Why didn't you say so in the first place? Why yes, you may have a McDouble with a little extra Mac sauce! \n\nThe new McDouble got sent out, the man enjoyed his meal, and we all lived happily ever after.",
        "created_utc": 1670702484,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can't go to bathroom while I'm sick? Ok",
        "author": "Ephemeralwriting",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/zhzzlf/cant_go_to_bathroom_while_im_sick_ok/",
        "text": "[removed]",
        "created_utc": 1670697767,
        "upvote_ratio": 1.0
    },
    {
        "title": "Airport duty free shop and number of security bags",
        "author": "ipgcrg",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/zhzmfy/airport_duty_free_shop_and_number_of_security_bags/",
        "text": "Recently found the subreddit, and I love the stories, so I decided to share my recent somewhat malicious compliance.\nIt happend approximately a half year ago, when we (me and my wife) travelled to another European country by air to visit some family and friends.\n\nWe wanted to bring certain local alcoholic drinks as presents, and since we were travelling with hand luggage only, we could not buy it in the town, as it would not go through the security, so we had to buy it in the \"duty free\" shop (which is not really duty free as we stay in the EU).\nAt the checkout the casher lady scanned our boarding pass, noted that we are connecting in a third country, so the drinks must go into a secure plastic bag which she must seal (so if we need to go through security in the connecting airport by any reason, it will not be taken away from us).\nShe prepared two bags, and put the four bottles into them. I asked if I can get four bags, one for each of the bottles, as it would make us easier to showe them into the different hand luggages. But for some reason she refused it, and said that she can only put it in a way that two bottles are in each bag.  I asked why, and she said \"this is the way it is\".\n\nI was not really satisfied with the answer, I was expecting something more serious, for example something about air travel regulations, so I concluded it is just that she needs to seal less plastic bags at the end of the day.\n\nBut my urge to want my bottles separated was still there. So I told her that if she insists, I will buy the four bottles in four different transactions, so each bottle will end up in their own plastic bag.\n\nShe frowned up on us a little, and proceeded with the first transaction, scanning the boarding pass, having the bottle put into its individual plastic bag, me paying for it, receipt put next to the bottle, having the bag sealed (making sure she traps as much air as possible in them), repeated three more times, while the queue behind us and the disagreement on her face were constantly growing.\n\nWin-win, she got her own (or the shop's) rule complied with, while I still got my bottles in separate bags, later comfortably buried between our clothes (after we pushed out all the spare air from the sealed bags).",
        "created_utc": 1670696867,
        "upvote_ratio": 1.0
    },
    {
        "title": "You Want All Black Shoes?",
        "author": "heypeeps11",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/zhxia2/you_want_all_black_shoes/",
        "text": "So right after high school I delivered pizzas for the Hut. At some point our franchise was sold and the new district manager had a stick up her ass. The uniform was supposed to be all black shoes. Mine were all black with white soles.\n\nWell when I first met the new DM she said something about it. My general manager just kind of gave me this look of “please help me out with this.” So I did. I walked into the office and grabbed a permanent marker and all of a sudden my soles were black. Did they look good? No. Were they black. Yep. District manager never liked me much after that.",
        "created_utc": 1670691801,
        "upvote_ratio": 1.0
    },
    {
        "title": "Renovate Customer Experiences With AI Chatbots",
        "author": "ARFASOFTECH",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/zhr0dt/renovate_customer_experiences_with_ai_chatbots/",
        "text": "[removed]",
        "created_utc": 1670674094,
        "upvote_ratio": 1.0
    },
    {
        "title": "Safety systems have to stay on",
        "author": "ThePangolinofDread",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/zhqf3s/safety_systems_have_to_stay_on/",
        "text": "[removed]",
        "created_utc": 1670672058,
        "upvote_ratio": 1.0
    },
    {
        "title": "Malicious Budgeting",
        "author": "pottface2122",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/zhpw49/malicious_budgeting/",
        "text": "Last week I asked one of my coworkers to complete budgets on our budget spreadsheet template before our next meeting. When I arrived at the next meeting I was provided with paper copies of all of the sheets for each project with every budget item filled out in pencil. I guess I didn't specify it had to be digital! I had a fun afternoon of data entry.",
        "created_utc": 1670670500,
        "upvote_ratio": 1.0
    },
    {
        "title": "blue light special anyone",
        "author": "Wafer_Stock",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/zhkwbe/blue_light_special_anyone/",
        "text": "I work for an online e-commerce company that shares its name with a South American rainforest.  my job there is working in the ICQA/problem solve dept.  making sure that yall get your packages and there aren't any problems with them.  there are multiple ICQA/problem solve areas in my building dedicated to solving problems with packages that go out to different markets throughout the US and some places outside of the US.  \n\n\nI was working in the one area of the building called southwest ICQA tonight.  in that area they just recently opened up more dockdoors to be used to ship items out to even more markets.  most nights the southwest ICQA should be run by a minimum of 2 ppl.  the key word is should.  that does not always work out and most of the time there is only 1 person working back there.  \n\n\nI work two separate shifts 5 days a week, 7pm to 12am and 2:30am to 7:30am Friday thru Tuesday.  I have had some issues with one of the day shift managers that usually comes in before my morning shift on multiple occasions.  things like disagreements on how different things are done.  for instance there is one dept that is called oversized.  we are supposed to take large heavy items to oversize so they can be taken directly to the individual trucks, instead of being sent thru the conveyors, where they could cause jams.  we are also supposed to send thinner items to oversize also, items that are too big to fit into a plastic binand 2 inches thick or less.  she doesn't believe items like the thinner items should be sent over to the oversize dept.\n\n\nnow come to tonight and I am working back in the southwest ICQA dept and it is going fairly decently despite working back there by myself.  I had been gathering items on a cart to take to the oversize dept throughout my shift, I just had not had a chance to actually take them over to the one dept yet.  the one manager decides that about 10:30 tonight, that I should take all of the oversized items to their trucks myself, instead of taking them to the oversized dept.  \n\n\nwhen someone is not watching the conveyors for the southwest ICQA the line can get backed up and causes an annoying buzzer to repeatedly go off and a bluelight to flash until it is cleared out.  the longer it goes off the more that it can cause the conveyors to the actual trucks to backup, thus packages not being able to go out.  I waited until about 11pm tonight and the line was pretty full already, but not yet full enough for the blue light to go off.  then proceeded to do as the one manager said that I should do.  I made sure to walk as slowly as I possibly could taking the oversized items to each truck.  oops one specific item had to be taken to a door all the way one the opposite side of the building.  pretty much, I made sure that the ICQA  dept for that area did not have anything processed thru that area for the last hour of the night\n\n\nreally hope that it was worth making me take all of the oversized items to their individual trucks and not actually being able to send out any other items out of the building in that area.",
        "created_utc": 1670653154,
        "upvote_ratio": 1.0
    },
    {
        "title": "When the customer is always right, but the employee is always more right",
        "author": "Competitive_Size3168",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/zhgfxj/when_the_customer_is_always_right_but_the/",
        "text": "Hey guys,\n\nI work at a customer service call center, and we're always told to prioritize the customer's needs and make sure they're satisfied. But sometimes, the things they ask for are just unreasonable or impossible.\n\nToday, I had a customer who was insistent on returning a product she had purchased six months ago, even though it was well outside of the return window. She argued with me for a while, but I stuck to the company policy and refused to process the return.\n\nBut then she pulled the \"do you know who I am\" card and said she was a VIP customer and deserved special treatment. I couldn't resist the opportunity to be a little malicious, so I sweetly told her that I did indeed know who she was - she was the customer who was always right, but the employee was always more right. I apologized and hung up the phone.\n\nI know I probably shouldn't have been so sassy, but it felt so satisfying. Have any of you ever dealt with a situation like this? Share your stories in the comments!",
        "created_utc": 1670639441,
        "upvote_ratio": 1.0
    }
]