[
    {
        "title": "Malicious Alcohol Law Compliance",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/9cfcqt/malicious_alcohol_law_compliance/",
        "text": "[deleted]",
        "created_utc": 1535920904,
        "upvote_ratio": ""
    },
    {
        "title": "A green vehicle",
        "author": "[deleted]",
        "url": "https://i.imgur.com/aNoI8qO.jpg",
        "text": "[deleted]",
        "created_utc": 1535916520,
        "upvote_ratio": ""
    },
    {
        "title": "Corporate knows what customers like.",
        "author": "113420",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/9ce501/corporate_knows_what_customers_like/",
        "text": "I work in food service, catering to a large cafeteria. One of my responsibilities is to replace the giant boxes of soda concentrate which are hooked up to the dispensers in another room. Whenever the BokaBola or MesaMoisture runs low, I have to hook up a new box of the stuff so that the customers can have their delicious empty calories. I've done this for long enough to know exactly which concentrates run out the fastest- our chief offender is MaidAid Lemonade, one of a very few non-carbonated beverages that gets mixed with water at a much higher concentration than other drinks (resulting in this sugary mess that could give hummingbirds diabetes). It's noteworthy that we actually had two kinds of drink dispensers- one kept in a [large inline row](http://www.sodadispenserdepot.com/pics/sodadispenser228g.jpg) that you've probably seen in every fast food place ever, and several [standalone dispensers](https://www.cw-usa.com/common/images/products/main/bunn-iced-tea-dispenser-tdo-n-4-narrow-39600-0002.jpg) for our more specialty drinks.\n\nAbout a year back, Manager decided to swap out one of our drink mixes that was going out of stock (Whipton Spleen Tea) for a new product, which meant that we had to take down and rebrand one of our standalone dispensers for this new zero-calorie health drink- Yobei Tastyberry Healthwater. That was fine and all, but trouble was on the horizon- see, the drink was a hit, as it was almost unique among all the available drinks in that it didn't contain 700 calories in a glass, and thus there were a significant fraction of our customers who enjoyed taking shots of the nearly-flavorless Healthwater. Which got the attention of Corporate.\n\nSee, Corporate was always looking for ways to cut costs. It's what Corporate does. So, they decided, in their infinite wisdom, to swap out one of our heavy-duty inline dispenser slots for this new craze Tastyberry Healthwater. This, despite the fact that we already had a perfectly functional standalone dispenser, and that we would need to swap out one of our high-volume products for this 'Healthwater' crap. But the problems didn't end there- we had very few inline dispensers that would mix their concentrate with water as opposed to carbonated soda. And carbonated soda is *bitter*. So if you replaced one of the soda boxes with Healthwater concentrate, what you'd get is a bubbly cup of ass-tasting disappointment with a faint hint of whatever the hell Tastyberry is supposed to be.\n\nSo, Manager thought about it long and hard, and decided that the only thing to do was to swap out our MaidAid Lemonade with Yobei Tastyberry Healthwater.\n\nI believed this to be monumentally retarded. I repeatedly told Manager this, but he wouldn't have it. It was a command from Corporate, and Corporate knows what customers like. Corporate must be obeyed. So swap the damn Lemonade out for the Tastyberry Healthwater, and damn my objections.\n\nSo I did, and I watched the chaos unfold.\n\nThe first step, of course, was flushing the line of Lemonade to make room for the Healthwater. This involved hours of me being paid to make circuits between the dining hall and the concentrate storage room, slowly siphoning out every bit of the Lemonade. And those lines are not designed to change on a dime- the only reason they stop dispensing product when the bags run out is because the suction can't pull the product out of the rigid tubes we use to transport the product from the concentrate room to the dispenser. There are *gallons* of that crap hiding in the tubing. It takes a LOT of time to flush it all out. And once the lines were replaced, I then had to flush out all of the AIR, which would have sprayed our customers with a vaguely sugary shotgun of fluids being squirted out of the dispenser like a malfunctioning sprinkler. All of which I was getting paid for, thank you very much. \n\nNext up was the truly delightful detail of mix ratios. See, our little standalone dispensers had adjustable levels for the amount of concentrate as opposed to water, and the Tastyberry Healthwater stuff was a ratio of about 95% water to 5% concentrate. But the Lemonade dispenser was an inline dispenser with a set ratio- which was more like 70% water to 30% concentrate, which was, to reiterate, the HIGHEST ratio of concentrate to water out of every dispenser we had. So all the Healthwater stuff was coming out in this overflavored stream that was... not actually all that bad, in my opinion, but to anyone who disliked the taste of artificial sweetener, it was overpowering.\n\nAnd finally, there was the crippling problem of stock.\n\nSee, Corporate, in their infinite wisdom, figured that despite putting the Healthwater on the inline dispensers, we probably wouldn't need all that much more of the stuff. So they kept delivering it to us in the same quantities as we'd been getting before. Every week, we'd get a 3-gallon box of concentrate to replace what had been chewed through. But here's the clincher. Our MaidAid Lemonade concentrate comes in TWO boxes... of 5 gallons each. On an inline dispenser with six times the concentration of the standalone dispenser. Oh, and we didn't have the money to rebrand the standalone dispenser, so it was taken down. Which meant that every week, we would be completely out of Tastyberry Lifewater within a day of restocking... but we'd also get two more giant boxes of Lemonade concentrate that we had to put in storage, but couldn't actually use.\n\nIt was glorious watching customer after customer lodge complaints with management that A: We didn't have their favorite drink, B: the new drink tasted funny, and C: There was never any of the damn new drink in stock. This went on for two months, until we had such a collection of Lemonade concentrate that we literally didn't have anywhere else to store it. Oh, and apparently, *Corporate* had been running dry on the Tastyberry Healthwater stuff, too, because we *stopped getting it in our weekly shipments about a month in*. To say it was a complete farce does not do it justice. We were getting daily commentary about the stupidity of our selection.\n\nI finally asked Manager if we should switch back to just serving our damn Lemonade. He reluctantly said yes. But we also didn't have time to flush the lines. So I was instructed to just place the lemonade concentrate in there, and let the lines self-flush.\n\nFor weeks, we served this weird hybrid of Lemonade and Tastyberry Healthwater stuff until it was completely flushed out of the lines. I, personally, thought it was delicious.",
        "created_utc": 1535911591,
        "upvote_ratio": ""
    },
    {
        "title": "sure, you can punch me in the gut.",
        "author": "suliel",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/9ce25e/sure_you_can_punch_me_in_the_gut/",
        "text": "fun story of childhood bullying and malicious compliance all bundled up in one!\n\nas a child, i wanted desperately to be a figure skater, so my mom enrolled me in several skating and ballet academies, put me on a drill team, got me a private coach, and basically set me loose. now, until then i has been every bit the grubby, fishing-trip-going, grasshopper-catching, pet-snake having tomboy, and i was also conveniently one of only two WOC on the drill team.\n\nthanks to TLC, everyone knows that putting a bunch of rich pre-teen (7-11 yo) girls together in a competitive and looks-based sport always ends in tears and drama (toddlers and tiaras, anyone? dance moms?) and i had previously only ever hung out with boys and had no idea what a social heiarchy was.\n\nthere was one girl on the team— let’s call her bitch-queen— who was rotten rich. her dad owned several companies and her mom was like this gorgeous bombshell blonde french model. she was a huge brat, and to make it worse, her dad owned the rink our drill team practiced at, so, despite being a very mediocre skater and neither the oldest, nor the strongest, nor the prettiest girl on the team, if she wasn’t front and center, she’d bitch and whine and threaten to have the whole team kicked out until the coaches complied with her demands.\n\nshe had all the girls whipped— before i came, everyone was terrified of her. she would dictate who hung out with who based on looks, and you either got in line or got yourself kicked off the team, lest the whole team be exiled from her bitch-dom. \n\nin comes me! tomboy, roughhousing half-asian powerhouse skater, but from a less wealthy neighborhood a distance from the rink. i wasn’t super graceful, but after a childhood of running around the nearby lake with the boys from my neighborhood, i could push like hell in formations.\n\nso guess who got bumped down the row one spot to make room for me (taller, stronger)? that’s right. bitch-queen.\n\nthat made me team enemy number one, and bitch-queen made an official proclamation demanding everyone make fun of me. every single day we trained they mocked my second-hand skates and thrift-shop fabric, home-sewn dresses, made fun of my slanty eyes, called me both fatty (i always had fast food as my training snacks because that’s what we could afford) and twiggy (i was flat as a board for a long time), and generally tried to bully me off the team.\n\nobviously though, a lot of girls weren’t really interested in trash-talking the new girl, and I wasn't about to let them bully me out of my dream, so i made lukewarm \"friends\" anyways with the girls who didn’t want to badmouth me.\n\nthis made bitch-queen FURIOUS. NO ONE was allowed to supersede her law. i had begun a rebellion in her perfect, glittery pink bitch-dom and she needed to whip her subjects back under her control.\n\nso you can imagine my shock when i came early to training and bitch queen had backed my few \"friends\" up a ramp with her two lackeys backing her.\n\n8-year-old me marched right up to her with my already half-eaten bag of five guys fries in one arm and my jacket in the other and said something along the lines of:\n\n“excuse me. why are you holding them up here?”\n\nshe turned and gave me a shit-eating smile as one of the other girls snatched away my fries and threw them away, sneering at me all the while.\n\n“i’m teaching them a lesson! i told them not to make friends with a fat gook like you and they didn’t listen.”\n\nmy friends looked scared shitless. at the time i had no idea what “gook” meant and didn’t really care, but i knew that they were upsetting my friends and that do NOT sit well with me.\n\none of the other girls on bitch-queen's side backed bitch-queen up and said:\n\n“yeah! they don’t get to come down until they agree not to be friends with you.”\n\ni shrugged. they want to play, i’m gonna play. i prided myself in being a bit of a rebel and was ready to show her down.\n\n“okay. i’ll be friends with them up there.”\n\nso i shoulder past bitch-queen and stand with my friends on the ramp. bitch-queen looses her shit and screams like the spoiled brat she is.\n\n“NO! that’s not how this GOES!” \n\nshe stomps her skate and throws a fucking tantrum, waving her arms and screeching.\n\n“FINE! STAY UP THERE! but if ANYONE tries to leave the ramp, i’ll PUNCH them!”\n\nnow, i’d had my fair share of roughhousing with the boys from my neighborhood, so i knew for a fact that if i got punched on a full stomach i would vomit. it had happened before. i’ve never had the best health growing up, so things like vomiting and coughing or pain really didn’t phase me, and you KNOW i had just pigged out on five guys before training. so i devise an evil plan to pay this bitch back.\n\n“okay. so if i want to leave, i have to get punched?” i asked calmly.\n\nthis bitch brat-screeches like the spoiled twat she was before going “YES!” and i grin like the wicked witch i am.\n\n“okay.”\n\ni walk right up to her and snap “punch me, then” right in her fire-engine red bitch-queen face.\n\nthis girl immediately sucker-punches me right in the gut, and, as a gymnast, gives me a right good socking. jokes on her, though! i immediately projectile-vomit a mouthful of half-digested cajun fries and southern sweet iced tea all over her arm and her 500$+ skates. \n\ni stand straight up, wipe my mouth, and walk straight past her horrified lackeys to the rink doors and get on the ice for warmup without looking back. bitch-queen is screeching like a howler monkey, sobbing like mad as her friends awkwardly shoo her towards the locker room showers. my friends are laughing and following me onto the ice, and the coaches very confusedly walk past a sobbing, vomit-coated bitch-queen before coming to talk to the other girls about what the hell happened.\n\nmy friends back me up and i get off squeaky-clean. bitch-queen evades expulsion from the team with the help of her dad, who for ONCE reprimands his bratty spawn for being a deplorable despot, and i keep my friends. the bullying and harassment last until i got promoted to a bigger rink with a better coach, and even though i now have no friends, i still gloat over that glorious, puke-stained victory.\n\nmoral of the story? you never know what might come out when you punch someone, and sometimes revenge is not ice cream, but rather hot, sticky, and visually similar to cesspool sludge.",
        "created_utc": 1535910998,
        "upvote_ratio": ""
    },
    {
        "title": "Wall mural classified as an illegal sign. City orders couple to make the stone wall match the house.",
        "author": "toodlesandpoodles",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/9ccc28/wall_mural_classified_as_an_illegal_sign_city/",
        "text": "[removed]",
        "created_utc": 1535897730,
        "upvote_ratio": ""
    },
    {
        "title": "Malicious Napkin Compliance",
        "author": "AdequateHusband",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/9ccakq/malicious_napkin_compliance/",
        "text": "This happened just yesterday and shortly afterwards I thought of sharing it with you. TLDR at the bottom. \n\nI attended my niece's wedding with my wife and 2 children. My wife was particularly excited as our children were lucky enough to have important wedding roles as a pageboy and flower girl.\n\nMy son and I wore our formal kilt outfits and my daughter a special dress worth over £100. The wedding went particularly well and we progressed to the sit down meal and speeches.\n\nUpon sitting down we discovered that whilst the adults had large and thick cloth napkins, the children only had paper thin disposable napkins. My wife asked a passing server for an extra cloth napkin to protect my daughter's expensive dress. When it was not forth coming and after around 10 minutes, I asked a 2nd server for a cloth napkin, when this also didn't appear I asked the senior server for one. I was then advised that children couldn't have a cloth napkin, just a paper one.\n\nMy wife and I, knowing thousands had been paid for the venue, argued that we needed one to protect her dress as she was eating a meal with a sauce that would easily penetrate he flimsy paper napkin, plus the costs of washing an extra cloth napkin was negligible. The lead server refused and advised us that it was their policy that children got paper napkins and adults got cloth napkins.\n\nI advised this was fine, wrapped my daughter up in my cloth napkin, pointed out that I was missing a napkin and, as an adult, would like a cloth napkin please. \n\nTLDR: wedding venue insists cloth napkins are only for adults. I give my daughter my cloth napkin and request a replacement for myself. ",
        "created_utc": 1535897379,
        "upvote_ratio": ""
    },
    {
        "title": "Can't wear a \"Black Panther\" catsuit to the French Open? No problem.",
        "author": "zeromig",
        "url": "https://wokesloth.com/serena-williams-competes-in-a-tutu/mariam/",
        "text": "",
        "created_utc": 1535894786,
        "upvote_ratio": ""
    },
    {
        "title": "He did play dead, alright.",
        "author": "high_pH_bitch",
        "url": "https://i.imgur.com/636fqH2.gifv",
        "text": "",
        "created_utc": 1535889991,
        "upvote_ratio": ""
    },
    {
        "title": "I ordered chickfila online for the first time. There was a slider for \"extra pickles.\" I set it to max. This is what I got.",
        "author": "Pollyhotpocketposts",
        "url": "https://i.imgur.com/3RPnpqK.jpg",
        "text": "",
        "created_utc": 1535878259,
        "upvote_ratio": ""
    },
    {
        "title": "Smart kid",
        "author": "[deleted]",
        "url": "https://imgur.com/y3o6Lyv",
        "text": "[deleted]",
        "created_utc": 1535853669,
        "upvote_ratio": ""
    },
    {
        "title": "Sure, you can take over responsibility for the schedule!",
        "author": "abrk",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/9c7sld/sure_you_can_take_over_responsibility_for_the/",
        "text": "[removed]",
        "created_utc": 1535846050,
        "upvote_ratio": ""
    },
    {
        "title": "No rooms? No problem!",
        "author": "bakaneko718",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/9c7g1x/no_rooms_no_problem/",
        "text": "[removed]",
        "created_utc": 1535842973,
        "upvote_ratio": ""
    },
    {
        "title": "keep us reading until you clap.... but you wont so if you'll excuse me.",
        "author": "scribejun",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/9c6dwc/keep_us_reading_until_you_clap_but_you_wont_so_if/",
        "text": "[removed]",
        "created_utc": 1535834525,
        "upvote_ratio": ""
    },
    {
        "title": "You want to copy my answers even though we don't have the same version of the test? Sure go ahead.",
        "author": "xelferz",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/9c62dk/you_want_to_copy_my_answers_even_though_we_dont/",
        "text": "Note: I also posted this on r/pettyrevenge. My apologies if you see it twice.\n\n​\n\nAfter reading all the interesting stories on r/prorevenge, r/pettyrevenge and r/maliciouscompliance I decided that I would share my own story of malicious compliance/petty revenge. I guess this story mainly falls under petty revenge (from my teacher) and my malicious compliance with both my teacher and the cheating student. This is my personal story. Warning: Lots of letters below. TL;DR at the bottom.\n\n​\n\nThis story of MC/PR happened in my 5th year of high school in 2005. The Dutch high school system has three tiers of education with the highest tier (called gymnasium) lasting 6 years and preparing you for university life. Part of our mandatory curriculum was English language; lasting all 6 years and being part of the final exams. By no means did the English class demand that you spoke the language fluently, but it could be quite difficult to pass for some people. One of my classmates in particular had a difficult time getting passing grades for the course and he would often resort to cheating to get as close to a passing grade as possible. He usually cheated off of me. My teacher caught on to him cheating and decided to get back at the guy via me during one of the tests.\n\n​\n\nLet me first introduce the three people involved:\n\n1. Teacher as in Revenge Teacher or RT. He was from Scotland and spoke with a strong Scottish accent. He wasn’t the nicest or best teacher, but he also wasn’t the worst. The main thing I remember about him was that he always had the worst hangovers on Monday morning. He would be sweating profusely and have 2-3 buttons of his shirt open even though it was winter and it was close to freezing.\n2. Me. There are a few things relevant to this story about me. The first is that I suffer from hearing loss due to a medical condition I suffered from as a toddler. As a result I taught myself how to lipread. Almost nobody in my in my private and professional life know this about me, but RT did (this is relevant for the revenge). The second relevant thing is that I was born and raised in the Netherlands, but a large part of my family on my mother’s side is from Australia. This meant that I was exposed to the English language from a very young age. (Note: I am by no means a native speaker and I am generally bad at learning languages). My passing grades for English were always a perfect 5/7 (so 100% or 10 out of 10 in the Dutch system). This was the reason my classmate used me when he cheated. The last relevant thing is that I was known in school to be quite a mischief maker. I was always looking for ways to stir the place up a bit. The RT knew this which is why he decided I should sit up front with my desk directly connected to and facing his desk.\n3. Cheating classmate or CC. He was just not good at English, which could possibly be explained by the fact that he moved to the Netherlands at a young age and was not a native speaker of Dutch either. He was a nice guy though and we did get along so I had no problem with him trying to copy my answers. He was a bit pushy about getting me to allow him to copy my answers though. But I understand, he was just trying to get his high school diploma so he could go study Dutch Law (which doesn’t really require you to speak English at all).\n\n​\n\nPart of the tests for the English class consisted of so called ‘listening tests’. We would be given sheet containing approx. 25 questions with multiple choice answers and an audio tape containing multiple 5-10 minute conversations would be played. These conversations could be quite difficult to understand as they often contained speakers with quite thick accents and also often contained background noise.\n\nThe conversations were cut into small pieces (they were about 1 min each). The audio would stop after each short piece and we would have to answer a multiple choice question about each piece. We would sit in individual rows in class and each row had its own version of the question sheet. The questions were all the same, but the answers were in different orders. There were 3 versions of the sheet: A, B and C. The third answer option in version A could be the second option in version C etc. If you had version B that meant that the people to your left and right would have A and C. To avoid cheating of course.\n\nI was sitting in front of the class and CC was sitting directly behind me. This meant that we would always have the same version of the question sheet. CC would sit in such a way that he could see which answers I gave and would copy them one to one. CC would get a couple of perfect scores for the listening test, but he would struggle with all other parts of the class. Naturally, this made RT suspicious and he would quickly find out that CC was copying my answers.\n\nNote: We had the listening tests quite often on Monday morning so RT could chill for a bit and get over his weekend hangover.\n\n​\n\nOn to the revenge bit.\n\nOne Monday morning we came to class and we had another listening test. This time RT wasn’t his usual hungover and slow self, but he was quite cheerful and ready to go. For me this made it suspicious that we were having another listening test (I would soon find out why). Everything started like normal and RT started handing out the different versions of the question sheet. I had version B and CC had version B as well. The first few conversations played out and we would answer the first 10 (or so) questions with CC copying all my answers.\n\nRemember that my desk was connected to RT’s desk? And remember that RT knew about my lipreading skills? RT used this to apply some perfect petty revenge on CC.\n\nAfter question 10 RT would very quietly replace my version B test with version C. At this point I knew he was up to something. I looked at him and he inaudibly whispered: “play along, you have version C now, I’ll write it on your answer sheet afterwards”.\n\nAs CC was too busy not to get caught he didn’t see that the teacher swapped my version of the question sheet. He also, of course, didn’t hear my teacher speak. Being the little devil I am, I happily played along and let CC continue to copy my answers. I even intentionally sat sideways so it was easier for CC to copy my answers. This whole remainder of the test RT had the biggest shit eating grin on his face while CC was copying the answers from version C for his version B test.\n\nOnce the test was done RT asked CC how he think he did. CC said he was quite confident he would get a high grade. RT smiled and looked at me, I smiled back. A week later we got our test results back. I got my result first and got a perfect 10 out of 10 score. CC saw that and it made him happy. A few minutes later he got his result back and he scored a whopping 3.2 out of 10 (something like that at least - it was a long time ago). Puzzled by how this could happen CC wanted to compare answers with me. He must have thought that the teacher made a mistake in correcting. Our answers were identical (of course).\n\n​\n\nRT must have expected that CC would compare his answers to mine. For one final bit of glorious petty revenge, RT wrote on MY answer sheet next to question 10: “if you are going to cheat, make sure you don’t get caught 😊”. RT was a glorious bastard in the end.\n\n​\n\nIn the end RT did help CC improve his English and he did manage to get a passing grade (but barely).\n\n​\n\nTL;DR: Teacher caught classmate copying my answers, he got back at the classmate by changing my test without the classmate noticing. Classmate continued to copy answers from my test and failed miserably as a result.",
        "created_utc": 1535832009,
        "upvote_ratio": ""
    },
    {
        "title": "Askreddit compliance",
        "author": "[deleted]",
        "url": "https://i.redd.it/bxvygi9e2oj11.jpg",
        "text": "[deleted]",
        "created_utc": 1535824888,
        "upvote_ratio": ""
    },
    {
        "title": "Yes, your honour",
        "author": "TooHardToChoosePG",
        "url": "https://i.redd.it/jbmr4ghmbmj11.png",
        "text": "",
        "created_utc": 1535817916,
        "upvote_ratio": ""
    },
    {
        "title": "Coffee not sorry",
        "author": "Olives_oyl",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/9c3exy/coffee_not_sorry/",
        "text": "[removed]",
        "created_utc": 1535811879,
        "upvote_ratio": ""
    },
    {
        "title": "Big Boss tells Former Boss to change the schedule. So she did.",
        "author": "HeWhoMustNotBeNamed7",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/9c3c3q/big_boss_tells_former_boss_to_change_the_schedule/",
        "text": "Before I give you the characters in this story, I want to mention that this was 6 years ago and while it did involve me, I can't claim this as my own. All of it came from my boss at the time. Also, I like to make sure all the details are in there so this could be lengthly. TLDR will be at the bottom.\n\n​\n\nIntroduction to characters:\n\n**Former Boss--This one is a given**\n\n**Big Boss--My boss's boss**\n\n**Tenured Coworker --Been there since the dawn of time. I honestly don't know when she started at the job, but she had some major seniority. She has her Master's degree**\n\n**Newer Coworker---Only had been there for maybe 2 years before I started working there. She has her Master's degree. Both NC and TC are in their 50's at least.**\n\n​\n\nOn to the story. Six years ago, I was working part time at a junior college while I was finishing my Masters. I got hired part-time while I was working full time at another job outside of the college job. It worked out in my schedule. I taught two, lower level non-credit classes. I loved the job and I was glad to have a little bit more pocket money doing what I loved. The second semester working there (Fall 2012) was the same thing. Two lower level, non-credit classes and still working full time elsewhere. Towards the end of this semester is where the story starts to unfold.\n\n​\n\nFormer Boss starts working on the next semester schedule (Spring 2013) about halfway into the current one. This is typical. This is so every department head can see it and anyone higher up can make changes if need be. When Former Boss finishes and has it in draft form, she emails it to all the people in her department. I had told Former Boss before she made the schedule that I had quit my outside full time job to accept another job on the college campus. This meant I didn't strictly have to teach the evening classes, though I would if I was schedule to do so. I was still working on my Master's.\n\n​\n\nI expected my classes to be roughly the same. When I looked at the draft, I was surprised to be teaching four credit level classes, which is still considered part time. I was pleased to not only be teaching more classes, but also teaching those that are credit level. I was excited for the challenge. After looking at my schedule, I literally forgot about it and went about my day.\n\n​\n\nThe rest of this story is relayed from Former Boss in a meeting she had with me two weeks later. The events happened in a two week time frame.\n\nA day or two later:\n\nNewer Coworker: Hey, FB, is the schedule you sent out correct for next semester?\n\nFormer Boss:Yes it is.\n\nNewer Coworker: Okay. So there is no chance for it to change?\n\nFormer Boss: If it changes, it would only be minor.\n\nNewer Coworker:  Okay. Did you mean to give **hewhomustnotbenamed7** four credit level classes when she doesn't have a masters yet?\n\nFormer Boss:  Yes.\n\nNewer Coworker:  Okay\n\n​\n\nAnother day or two goes by and Newer Coworker sends an email to Tenured Coworker. In this email Newer Coworker rants about the schedule. Newer Coworker states that I don't have any experience teaching. I shouldn't be teaching any of those credit classes. I'm not qualified. I'm just stupid and how would I be more deserving than Newer Coworker or Tenured Coworker who has many many years of experience and Master's degrees.\n\nTogether, Tenured Coworker and Newer Coworker go to the Big Boss to complain and say nearly what was said in the email exchange.\n\nBig Boss tells Former Boss to change the schedule and have a meeting with me.\n\n​\n\nSo, here I am in the meeting with Former Boss dumbfounded about all that was said about me. Former Boss tells me she did have to change my schedule. I was a little upset but understanding of the reason why. Former Boss took one of my classes away and switched one credit level classes to a lower level class. So, my schedule was two credit level classes and one lower level non credit class.\n\n​\n\nThe sweet satisfaction I got out of the meeting was that she only changed my schedule and Tenured Coworker's schedule. Newer Coworker's schedule stayed exactly the same. Newer Coworker was still teaching all lower level non credit classes. I really wanted to be a fly on the wall when Newer Coworker found this information out.\n\n​\n\nTo this day, six years later, this woman hates me.\n\n​\n\n\\*Bonus story\\* My best friend was eating at Baco Tell and Newer Coworker was there as well. My best friend was talking about my former workplace and Newer Coworker chimes in talking crap about me. My best friend defended me and basically told her to shut her mouth.\n\n​\n\nTLDR: Entitled coworker took it upon herself to complain to the big boss about my schedule. Big boss tells my boss to change my schedule. Boss changes mine and another coworker's schedule leaving the entitled coworker with the same schedule she started out with before she made a fuss. \n\n​\n\n​\n\n\\*Edit\\* took away the abbreviations.\n\n​\n\n​\n\n​",
        "created_utc": 1535811222,
        "upvote_ratio": ""
    },
    {
        "title": "115 Ways to Be Your Own Boss",
        "author": "[deleted]",
        "url": "http://diceview.com/115-ways-to-be-your-own-boss/",
        "text": "[deleted]",
        "created_utc": 1535809543,
        "upvote_ratio": ""
    },
    {
        "title": "Karma... You asshole",
        "author": "mrawesometacosaurus",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/9bzzwj/karma_you_asshole/",
        "text": "This happened 20 years ago at a shitty university in the North East. \n\nIt was the beginning of freshman year and just prior to homecoming.  I had some time to kill before class and decided to go to the computer lab.  I had just learned about chathouse.com and was kinda addicted.  Anyways, it was drizzling and wet.  As I walked to the computer lab I notice a girl in a wheelchair, think cerebral palsy, literally stuck in between the door on the right and the door frame. The entry way was had three doors.  The handy capable door was on the right directly in front of the handy capable ramp.  She was definitely stuck and not going anywhere.  Not sure how she got that way.  As I walked up to the door I took the initiative, did the polite thing, and opened the door for the girl.  Hence freeing her from her captivity.  It took a moment, but instead of saying 'thank you' she started yelling at me.\n\n\"How dare you?\"\n\n\"You asshole.\"\n\n\"Did I ask you to help me?\"\n\n\"You asshole.\"\n\nI stood there and took it for a bit. I was scared shitless.  I had no idea what happened.  Why was she reacting this way? Did I do something wrong? Will I get in trouble? Who's going to believe me over a girl in a wheel chair? So finally I was like screw this and fast walked out of there before a crowed gathered. As I walked away she continued her tirade\n\n\"Get back here.\"\n\n\"You asshole.\"\n\n\"Don't you walk away from me!\"\n\n\"You asshole.\"\n\nThis was traumatizing for a kid from nowhere.  I ducked this girl for the next four years of university. \n\nThen finally...\n\nIt was beginning of second semester senior year.  It \nwas snowing and had been snowing for a bit. I walked to the same computer lab to start my thesis.  As I approached, no shit, I saw the same girl, in the same wheelchair, with the same cerebral palsy, stuck between the same handy capable door and the same door frame.\n\nAs I approach I was in disbelieve.  She was in disbelief.  Deja vu.  We made eye contact.  I stared at her.  She stared back.  I could tell at that moment she remembered me.  Her little wheels where spinning and not going anywhere.  She stared at me. I stared back.  She tried her wheels again.  More eye contact.  More wheel spinning. Finally I made it to her. I smiled, we looked into each others eyes, I nodded to her, I reached out to open her door, then I opened the middle door right next to her and walked right through.  I never looked back. I only heard her yell out\n\n\"You asshole.\"\n\n\"Help me.\"\n\n\"Help me.\"\n\n\"Help me.\"\n\n\"You asshole.\"\n\nI never saw her again. She might be dead.  Karma... You asshole.\n\n\n\n",
        "created_utc": 1535772488,
        "upvote_ratio": ""
    },
    {
        "title": "You screwed up your load and need me to add more cement? Sure, just pull that nice, clean, shiny truck under the plant.",
        "author": "Hippo_Singularity",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/9bzwh0/you_screwed_up_your_load_and_need_me_to_add_more/",
        "text": "When you mix a load of concrete, there are a lot of variables that determine the mix strength, but the two most important ones are A) the amount of water and B) the amount of cement.  Adding water raises the slump (fluidity) of the concrete and makes it easier to work, but it also raises that water/cement ratio, dropping strength.  To get around that, you can add a water reducer, a chemical made to raise slump without changing the W/C ratio.  High range water reducers, also known as superplasticizers, can [turn curb mix concrete into absolute snot](https://youtu.be/ICp4i_c0uIw) without weakening it at all.  I'm not sure on the reasons why, but unlike other admixtures (including low and mid range water reducers), superplasticizers go in at the end of the loading sequence.  That means that when the load finishes, the chemical hasn't had time to work its way into the load; until it gets mixed in, the slump meter inside the truck will still register the load as being dry.  That brings us to Jake.  \n  \nJake is not an inexperienced driver; he's been in the industry since I was in grade school.  Most of that time, however, was spent with another company.  He came to us because Jake likes to keep his truck clean...really clean...like \"Adrian Monk thinks you have a problem\" clean.  After many years (and several warnings), his previous employer got fed up with how much clock time he was spending washing his truck and let him go.  We were happy to have him, because he knows what he is doing and is willing to advise less experienced drivers (and, of course, his truck always looks fabulous).  Unfortunately, he's also a bit abrasive and set in his ways.  Dealing with Jake always begins well, but after a while, he starts getting under your skin, and before you know it, you're really irritated.  It's like stepping out of the shower and treating yourself to the fluffy, pink caress of Owens Corning's finest.\n  \nSo Jake pulls under the plant and gets loaded.  His load has superplasticizer in it, but he doesn't notice.  Where he used to work, they stamped the concrete tickets with big, red warnings for just about anything non-standard.  We don't do that here.  Bob, the manager, expects his drivers to read their tickets and consider what they have been loaded with before adjusting (adding water).  Jake doesn't look at the weights on his ticket; he just pulls out from the loading area, looks at the requested slump on his ticket, looks at his meter and slaps the water button like a colicky baby.  Of course, by the time he goes back to check his slump meter, the water reducer has mixed in, and, with the extra water, the load is now piss wet (NB: that is the actual term management uses for concrete that wet...management is mostly comprised of former drivers).  \n  \nJake calls Bob and says he needs his load dried up.  It's simple enough to do; you just drop in a little cement, with a bit of sand to help push it down.  A full load in a mixer is 10 yards, but technically they can hold up to 10.5, so there is some extra room for situations like this.   Bob's not too happy that Jake mucked up his load; Jake made a stupid mistake, and now the company has to batch some material we won't be paid for.  Still, it happens.  So he tells Jake to back up under the plant.  \n  \nThen Jake starts being Jake.  He tells Bob that the sand looks wet, and he just wants Bob to drop him some powder.  The sand isn't wet.  Bob has a moisture sensor telling him the sand isn't wet.  What's really going on is that Jake is worried he screwed up the load too much.  Either he's panicking or he's lying about what his meter is reading.  Either way, he thinks that one dry-up isn't going to be enough, and he wants to make sure there is room for a second one.  Bob doesn't hint at his irritation.  He just checks the direction of the flag out on the silo, gives Jake the 10-4 and tells him to spin up his drum (set the drum to full speed and rev the engine to turn it faster).  \n  \nNormally when Bob loads a truck, he lowers the plant hopper onto the truck's hopper.  That lowers a shroud around the back of the truck and turns on the dust collector (a vacuum system that sucks up any stray cement).  Bob is not lowering the hopper this time.  Instead, Bob loads up some cement powder, and, just like Jake asked, drops it.  The powder free falls into Jake's truck hopper and billows out into a dark, misanthropic cloud.  The yard is set up so that the prevailing West winds would normally push that cloud behind Jake's truck and across the yard (and, on this occasion, right into my windshield).  Instead, a nice, healthy Santa Ana wind (a dry, East wind that occasionally blows in Southern CA) catches the powder, and Jake's truck gets swallowed by The Nothing.  When it reappears, Jake's once immaculate truck looks like he's been pouring concrete in Herculaneum.  It's been over a year, and Jake hasn't asked for a dry up since.  \n  \nTL/DR:  Overly fastidious driver messes up his load and starts telling the manager how he wants it fixed.  Manager does exactly what he is told and blasts the driver's clean and shiny truck with cement powder.",
        "created_utc": 1535771521,
        "upvote_ratio": ""
    },
    {
        "title": "General manager told me to flip off the lights",
        "author": "CasiusG",
        "url": "https://imgur.com/a/zf1LB3M",
        "text": "",
        "created_utc": 1535769354,
        "upvote_ratio": ""
    },
    {
        "title": "short and sweet",
        "author": "treyhax",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/9bzi16/short_and_sweet/",
        "text": "[removed]",
        "created_utc": 1535767533,
        "upvote_ratio": ""
    },
    {
        "title": "I Did What You Asked Me To.",
        "author": "Muthusrinivaaz",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/9bx4bq/i_did_what_you_asked_me_to/",
        "text": "[removed]",
        "created_utc": 1535747318,
        "upvote_ratio": ""
    },
    {
        "title": "“Hey! That’s not a full shot!”",
        "author": "hardrockclassic",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/9bwob4/hey_thats_not_a_full_shot/",
        "text": "Saw this one go down one day back in the previous century.\n\nI was sipping on a beer in Cronin’s Tavern in Harvard Square.\n\nThere is a guy at the bar drinking a neat scotch whiskey from a six-ounce glass tumbler.\n\nHe finished it up and says to the bartender, “I’ll have another”\n\nThe bartender grabs the bottle and pours a generous splash of scotch into the guy’s glass. \n\nThe guy says, “Hey! That’s not a full shot!”\n\nThe bartender plonks a shot glass down on the bar in front of the complainer, picks up the glass of whiskey an pours it into the shot glass.\n\nThe shot glass overflows.  Whiskey spreads all over the top of the bar.\n\nThe bartender says, “There’s your damn shot!”\n",
        "created_utc": 1535744042,
        "upvote_ratio": ""
    },
    {
        "title": "What is wrong with everyone?",
        "author": "mechengr17",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/9bw6ny/what_is_wrong_with_everyone/",
        "text": "[removed]",
        "created_utc": 1535740595,
        "upvote_ratio": ""
    },
    {
        "title": "The Tinder Feedback Loop",
        "author": "[deleted]",
        "url": "https://i.redd.it/41delgbhbgj11.jpg",
        "text": "[deleted]",
        "created_utc": 1535731180,
        "upvote_ratio": ""
    },
    {
        "title": "AnsReply – Best Product Video Reviews Such as, Electronics, Computers, Clothing, Shoes, Jewelry, Home &amp; Garden, Sports &amp; Outdoors Etc.",
        "author": "CheapEar2",
        "url": "https://www.ansreply.com/",
        "text": "",
        "created_utc": 1535729620,
        "upvote_ratio": ""
    },
    {
        "title": "Serena Williams was told her Black Panther Catsuit was not appropriate for the french open, so she partnered with Nike to make an athletic tutu.",
        "author": "JudgeHoltman",
        "url": "https://i.redd.it/k7g3yoj5vfj11.png",
        "text": "",
        "created_utc": 1535725660,
        "upvote_ratio": ""
    },
    {
        "title": "\"It looks like there's a bit too little fries in my bag\"",
        "author": "Ionie88",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/9bsdd0/it_looks_like_theres_a_bit_too_little_fries_in_my/",
        "text": "I had been working at an extremely popular fast food place, for about 7 years at the point when this happened.\n\nWe had an electronic kitchen scale next to the fries-station and next to the ice-cream machine, to test ourselves every now and then that we don't accidentially make ridicculously large fries or ice-creams. Customer pays for 142 grammes of fries, so we get money for 142 grams. If a worker has shoved half extra, that's money straight out of the company's pocket, which trickles down to how many work-hours we get, and thus our pay, and so on.\n\nI've served untold thousands of customers and bagged untold thousands of fries. I've learned to see and feel how big those bags are to be, with a 5 gram margin, and I was quite proud of myself for that! Hell, sometimes when our shift-lead wanted to make small inspections, and had people weigh the fries or ice-creams they've made, just to see if we're on point, they were amazed time and time again.\n\nNow, I was serving a customer, like any other. Apparently, he had gotten workers that weren't as precise as me, or had the \"i don't care, i just work here\" -attitude (as a lot of fast-food workers in the age of 18-25 have), and was used to see fry-bags that were crammed full.\n\nCustomer: \"Excuse me, but isn't there a tad too little fries here?\"\n\nMe: \"...well, I can weigh it, if you like, to see that we get precisely what you're paying for!\"\n\nCustomer: \"Yes, please!\" (obviously thinking it's company standard to have it crammed full)\n\nMe, in plain sight of the customer, weighing the bag, noticing there was 10 grams TOO MUCH fries, reading the scale out loud, checking the printed sheet that's next to the fry-station, reading that out loud: \"Oh, a bit over 150 grams, let's see... Should be 142! Let's fix that!\"\n\nSo, I shook out a couple fries, weighed it again: \"143 grams! Close enough, here you go sir!\"\n\nCustomer, looking defeated: \"...thank you...\"\n\n**EDIT:** Wow, all the hate, yo! I'm not mad ya'll, though... Sure, 'twould be annoying to be on the receiving end of that, but the amount of the scum of humanity fast-food and retail workers need to live with? If we could bring a customer down a notch, and not get in trouble, we would in a heartbeat. Adults treating us like shit and as if we're too stupid for elementary school, teenagers not giving a damn about rules of the establishment... Hell yes, we'll take petty revenge at people if we can! Yes, we're assholes for it, and sometimes those that don't deserve it get caught in the crossfire. I'm not denying that either. Though most of the time, people deserve it. Be as it may, this corporate tool has moved on ages ago! The moment you realize you never have to serve another customer or bag another burger is the best day of your life (ask anyone who's gotten out of a low-paying fast-food job). You guys keep on redditing!",
        "created_utc": 1535710302,
        "upvote_ratio": ""
    },
    {
        "title": "Force a tennis champion to wear 'women's clothes'? Done.",
        "author": "dougfir1975",
        "url": "https://slate.com/human-interest/2018/08/serena-williams-catsuit-ban-continues-racist-sexist-policing-of-her-body.html",
        "text": "",
        "created_utc": 1535702498,
        "upvote_ratio": ""
    },
    {
        "title": "Get angry after requesting my paycheck after being 2 weeks late and tell me to go home because I don't work for free? Sure thing!",
        "author": "jamesgryffindor99",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/9bprum/get_angry_after_requesting_my_paycheck_after/",
        "text": "So for a few months, i *had* been working for a local contractor dude who does general stuff like painting, lawnmowing, building stuff, etc. I'll just give him the name Bob for this story to keep it short. I'll give the coworker the name Billy because Billy + Bob = BillyBob :).\n\nSo for the past couple weeks, I'd tried a few times to receive my check from him, and attempting to contact him wasn't very good. For some reason, most of the time he didn't  answered my calls or texts. I wasn't even called to do any work, which wasn't normal. I'd usually at least get something, like a couple lawns to mow. Well that is until earlier this week when I was told to come up Thursday and mow 3 lawns (30 miles away from my house, too). One of the lawns was usually done with 2 people, because it's such a large property. I stopped at Billy's house because he was going to be doing it with me, I ride with him up to the house that needs to have a lawn mowed, and he knows about how Bob is 2 freaking weeks late on my paycheck. Anyways, we call and he doesn't answer. 5 minutes later, we drive over to near Bob's house to see if he's home, and we see he is outside. Bob texts Billy that \"I'll call you in a few minutes,\" of course he never does. We drive over to his house and Billy stays in the truck while I get out to ask for the keys (so i can mow a couple other lawns later) and for my paycheck. It goes somewhat like this.\n\n/u/jamesgryffindor99: Hello\n\nBob: Hi there, here's the keys, and I'll get your check after you're all done.\n\n/u/jamesgryffindor99: No, sorry, I want my check now since it's been almost 2 weeks since payday, and I do not work for free.\n\nBob starts to rage and starts screaming shit like  \"YOU COST ME MONEY BECAUSE YOU MADE MISTAKES,\" \"I DID YOUR DAD AND BILLY A FAVOR BY HIRING YOU.\"\n\nThe malicious compliance part is when he screams \"Just give me the keys and go home.\" \n\nSo I left, after getting my check, which he had sealed in an envelope. He claims that he wants more people working, but then screams at me, one of his employees, for wanting my freaking paycheck when it's 2 weeks late.\n\nI get back to Billy's house and he goes back to chew out Bob, and Billy's wife gets me a list of hours I worked in case I need it. I went home and enjoyed the rest of my day instead of working for a narcissistic asshole.\n\nA few things:\n\nWhat the hell did he get high on, how is hiring me doing a favor for my dad? \n\nNext, he seems to be having personal issues and also trying to take on too many jobs. \n\n I feel he's using people as a scapegoat for his frustration, and I was in the line. I really don't want to be apart of that.\n\nAlso, I have made a few mistakes, but they weren't even that a big of a deal. \n\nFinally, why would he basically get rid of an employee when he's trying to find more? The world may never know.\n\nTL;DR: A boss gets pissed off when I ask for my paycheck, which is 2 weeks late, tells me to go home, and so I do. He loses an employee when he's actually looking for employees.",
        "created_utc": 1535682212,
        "upvote_ratio": ""
    },
    {
        "title": "“No one can access without my authorisation”",
        "author": "dfrance1991",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/9boqz0/no_one_can_access_without_my_authorisation/",
        "text": "I work in a very large hotel. It has over 200 rooms and is a 1970’s-style tower-block with 17 floors. During the winter we had major problems with our boilers which were ancient and not fit-for-purpose. They would cut out regularly leaving the whole hotel without hot water. Typically this would happen during peak showering times when the boilers could not cope during the demand for hot water. When this happened it usually meant a horrible day for guests and staff, so to avoid regular break-downs it became one of the staff’s daily tasks to go to the boiler room, check that it was running properly and reset/adjust it if necessary. The boiler room was located on the roof of the building, but it was impossible to fall due to it being walled 6ft on every side. Despite this, when our regional health and safety manager found out that staff had been accessing the roof daily she freaked out and decided nobody was to go up without her authorisation. Hotel manager explained that the roof area  was safe, and well-maintained and that the team were responsible enough to go up and not do anything stupid, but she insisted that she was the only one to authorise roof access. Fine. Hotel manager instructs all staff to call her before accessing the roof for EVERY boiler check. What she didn’t know was that due to the shocking state the boilers were  in, we were checking them hourly, 24/7. She lasted 2 days before she caved. ",
        "created_utc": 1535673565,
        "upvote_ratio": ""
    },
    {
        "title": "Follow the policy? So be it.",
        "author": "talibob",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/9bof94/follow_the_policy_so_be_it/",
        "text": "This is my husband's story but he doesn't Reddit, so I am relaying it to you fine folks. \n\n&amp;#x200B;\n\nMy husband works for a large call center. The work environment is not great and as a result, there is a lot of turn over. One day, Hubs walks in to find a sticky note on his desk. His work hours were being changed. His previous schedule had worked great. The new one, not so much. He went to his supervisor and asked to swap schedules with someone else. His request was declined. He asked to take the schedule of a coworker who was no longer there. Request declined. Hubs asked why. The answer?  It's company policy. Our hands are tied.\n\nGame on. \n\nOne of Hubs's duties is to process customer requests. There are two ways to do this, official policy and unofficial. Naturally, the official policy way takes at least 3 times longer and generates significantly more work for supervisors than the unofficial way. You can guess which one the supervisors prefer. Hubs also has the dubious honor of being one of the veterans, meaning he had survived more than a few months on staff. He was the person the newbies came to for help. There also just so happened to be a new class of newbies starting. Not only did Hubs begin using the official policy, he also taught the newbies to do it, neglecting to mention the unofficial process. In just a few days, the supervisors were swamped. Hubs's direct supervisor had so much work that he had to come in on his day off just to tread water. \n\nThe supervisors eventually figured out what was happening and managed to miraculously find a way to give Hubs a better schedule. Hubs graciously accepted the new hours but changed nothing. After all, it's company policy. His hands are tied. ",
        "created_utc": 1535670943,
        "upvote_ratio": ""
    },
    {
        "title": "Don't close your office door without asking? No problem.",
        "author": "V171",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/9bodm4/dont_close_your_office_door_without_asking_no/",
        "text": "So I am a lowly office worker in a large office space. The space is set up like a typical office where the cubicles are in the middle of the room and the offices are on the edges. I work at a research institution with several research centers (think departments) and I am a cubicle worker. \n\nBehind me, in an office, is a fairly high up research scientist in a different research center. He's at about the same level as my bosses bosses boss (but is not my direct superior) and it has gone to his head. This guy has kind of a reputation for being an ass and arrogant, but luckily I don't have to work work him because our paths of research don't cross. But this man does have an awful habit of hosting about 4-5 meeting is his office each day and he never, ever closes his door. This man is already naturally loud, but add to this 4-5 additional people and a conference call, it can be really hard to concentrate on my own work. \n\nI've politely asked him to close his door because it makes the whole space loud, but it didn't change his behavior.   I went to my center director about it, but there's not much she can do given that we share a floor in the building. She doesn't make the rules. So aside from going to The VP of the company, I'm SOL. \n\nI asked around for advice and a colleague said that she had a similar problem with a research scientist and she would simply get up and close his door and he would usually apologize. Not thinking it would work, I decided to try anyway. \n\nThe next time he had a meeting (that same day), I quietly got up and closed his door while mouthing \"sorry!\" As he was on his call. The moment his meeting ended, he came out and told me that I shouldn't ever close his office door without asking. \n\nFair enough. I get it. I'll ask. \n\nFor about a week, during every single meeting he had, I would loudly enter his office and say \"Hi David, sorry to interrupt, but would you mind if I closed your door while you are in this meeting?\" This happened close to 15 times in one week until lo and behold, David starts to close his door before his meetings start. But not before I interrupted a meeting with the VP of research, a reporter, and his grant advisory panel. \n\nI guess some problems just solve themselves!",
        "created_utc": 1535670605,
        "upvote_ratio": ""
    },
    {
        "title": "Mississippi's sex education law prevents teachers from showing teens how to use condoms. However, they CAN show kids how to protect their feet through correct and consistent sock use.",
        "author": "FrankieMint",
        "url": "https://www.youtube.com/watch?v=06kT9yfj7QE",
        "text": "",
        "created_utc": 1535668621,
        "upvote_ratio": ""
    },
    {
        "title": "Asshole takes up an extra parking spot, there were other places I could have parked and I waited 2 hours just to watch them figure out how to get in.",
        "author": "[deleted]",
        "url": "https://v.redd.it/8955vcwlsaj11",
        "text": "[deleted]",
        "created_utc": 1535664718,
        "upvote_ratio": ""
    },
    {
        "title": "The TV is for training purposes only",
        "author": "JellyCream",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/9bn7l0/the_tv_is_for_training_purposes_only/",
        "text": "[removed]",
        "created_utc": 1535660687,
        "upvote_ratio": ""
    },
    {
        "title": "Charge me for two hours? I’ll take the two hours.",
        "author": "letme-in",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/9bmys3/charge_me_for_two_hours_ill_take_the_two_hours/",
        "text": "This just happened today, so I’m still worked up over it. \nI booked a moving company to move 3 items; two medium sized dressers and one foam mattress. The move was 2k in distance and I requested two movers and a big truck. Messaging back and fourth with the owner he offered me a “spot for 12-1pm” which I accepted. The movers finished moving everything out of my place and into their truck after just 20 minutes. They then inform me that there is a minimum 2-hour charge. WHAT? They told me to call the owner who simply said if I wanted my things moved to my new place I had to pay for two hours. I was livid, my price just doubled and I still only got an hour of labour. \nMy malicious compliance? Okay Mr. Owner Man, if you want to charge me for two hours then I get two hours of their time. I then got the movers (two university students) to sit down in the shade and enjoy an hour break. :) ",
        "created_utc": 1535659008,
        "upvote_ratio": ""
    },
    {
        "title": "I’m not sure if this belongs here.",
        "author": "[deleted]",
        "url": "https://v.redd.it/ncwvaxbwo6j11",
        "text": "[deleted]",
        "created_utc": 1535656878,
        "upvote_ratio": ""
    },
    {
        "title": "Divorce Proceedings",
        "author": "benthany",
        "url": "https://v.redd.it/ylepnirl48j11",
        "text": "",
        "created_utc": 1535649424,
        "upvote_ratio": ""
    },
    {
        "title": "You won’t fire our unlicensed therapist? If you insist...",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/9bj5e1/you_wont_fire_our_unlicensed_therapist_if_you/",
        "text": "[deleted]",
        "created_utc": 1535631791,
        "upvote_ratio": ""
    },
    {
        "title": "Au5 - The Journey (ft. Trove)",
        "author": "Au5-TheJourney",
        "url": "https://soundcloud.com/monstercat/au5-the-journey-feat-trove",
        "text": "",
        "created_utc": 1535628800,
        "upvote_ratio": ""
    },
    {
        "title": "Work starts at 8:30 and ends at 5:30? Okay.",
        "author": "bh-1",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/9bhqa0/work_starts_at_830_and_ends_at_530_okay/",
        "text": "This is a bit long, apologies. \n\nWhen I was little, my mum worked for SEGA and would spend half of her time at work whilst we were with my nan, which wasn’t the best set up but had to be done. To try and combat this, my mum would come into work early at 8:00am, and start working (despite the fact she was only contracted from 8:30am onwards) and leave around 4:50pm/5:00pm, to get home earlier and spend time with us.\n\nThis wasn’t ideal for my mums manager Nigel, even though every other boss has agreed that my mum was still making the hours and doing more work than was expected, Nigel didn’t like it, stating that “We pay you to work 8:30am to 5:30pm, nothing different.” Here’s where the malicious compliance comes into play.\n\nMy mum strolls into work the next day, 8:00am on the dot still. Instead of doing work, and answering phones like she used too, she sits there, drinks her tea and reads the newspaper. As time passes, more phone are ringing and causing a bit of commotion, but hey! She’s not being paid until 8:30am right? \n\nBy the time 8:15am/8:20am comes around, Nigel appears out of his office, asking around as to why phones aren’t being answered. Sure enough, he makes his way to my mums desk, where she is just sitting and enjoying her early morning. After questioning why she isn’t doing any work, my mum gives the response I stated earlier - “Nigel, yesterday you exclaimed I’m not being paid until 8:30am. So, I will work when it gets to 8:30am.” And she did. She let those phones continuously ring without an answer for a couple of days until Nigel came around, and decided that MAYBE her previous set up of working early and leaving a little earlier was better.\n\nEDIT: My mother was not selfish and wanted to ditch work purely just to be with us. We left our house every morning at 5:00am with my dad on his way to work in central London because we lived 30 miles away, and he would drop us off at my nans where she and my mother would get us ready and drop us to school. She HAD to be there early, otherwise she would not had made the work day, leaving early was also so she could meet us at my nans in time and wait for my dad to pick us up, and drive the 30 miles home again. She had been working at SEGA for 10+ years and this was the only comprisable set up for when she met my dad and had kids.",
        "created_utc": 1535616484,
        "upvote_ratio": ""
    },
    {
        "title": "Want me to refund your purchase instead because you're a cheapo? Lose more money then.",
        "author": "hyattpotter",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/9bhff1/want_me_to_refund_your_purchase_instead_because/",
        "text": "TD;DR: Customer tried to cheat me out of EUR40 hoping I would waive it. I didn't offer to and customer demanded a refund instead of admitting she wanted it as a discount. Refund would have costed more than EUR40 due to currency changes and bank charges.\n\n\nI sell pre-owned watches on a well-known watch webmarket. Recently the webmarket started charging a 2% commission for each sale in their own currency on top of a listing fee so my margins are slim as it is after converting EUR back to my own currency. Due to this, I have been selling my watches at nett price.\n\n\nI usually have plenty of customers try to pull a fast one, usually I straight up do not respond because of the sheer volume of scammers or people just being plain unreasonable. Things like \"ship the watch to me first since it is used. I need to see the condition first hand\" or \"Please bring to me in person, I am in Paris\" etc so I've pretty much seen all kinds of things people try to pull.\n\n\nAnyway, my customer, Susan*, has been very polite all the way with me throughout the transaction. We agreed on the price including shipping and currency conversion fee as my bank automatically exchanges any other currency transferred into my own, following their rates. Usually I never get the exact amount because rates go up and down daily, so sometimes I make a little more, but more often times I get less than my asking price, sometimes up to four digit numbers which is painful because I do not mark up my prices to stay competitive. Anyway, Susan agrees to my price and says please proceed and we make payment arrangements and now I'm just waiting for her payment proof.\n\n\nLo and behold when I received the payment slip she sent me less than what we have agreed. Granted it is a small amount but she caught me on a bad day and I just absolutely hate cheap customers who pulls these kind of tricks (not the first time) banking on the chance that I might not be calculative with her because it's a small amount (about EUR40) but that was almost half of the shipping fee and I am already making a lean profit. I thought perhaps it could be an honest mistake and I tried to ask for the balance. Typically I would just waive it. I mean, I just want her to say it that she wanted it waived to prove my point that she did it on purpose. Instead, she went all huffy and told me \"OK, then return the money to me when you receive it.\" perhaps thinking that would scare me into waiving it for her but not today. If you want it, you have to ask for it.\n\n\nSo I told her OK, I can do that. However, I will send it in my currency as that is how I will be receiving it, and also minus any other bank service charges incurred. That would mean a typical loss converting EUR to my currency + telegraphic transfer and service charge by my bank + converting my currency back to EUR + whatever charges that could be on her end if any. So in trying to save EUR40, she has lost lots more by asking for a refund. Oh the satisfaction I got as I saw her typing and typing away wording her respond to me. After what felt like 20 minutes, she finally sent \"You want to break the deal over EUR40?\" So I told her \"oh no. I definitely don't. It's just that you asked for a refund, so I had to comply. If you wanted me to waive it, you could have just asked; I asked for the balance because we both agreed on the price and your payment was not complete yet.\"\n\n\nIn the end she said \"OK, Can't you waive the EUR40 as a little discount? I am also interested in buying a few more watches from you\" (they hardly do) which I responded with \"Yes I would be happy to\". Non-climactic ending. I always put up with customers like these so it was nice to just comply maliciously for once. It's petty but that felt good!",
        "created_utc": 1535612837,
        "upvote_ratio": ""
    },
    {
        "title": "You want me to point out the Big Green Shed? Rightio then!",
        "author": "erubadhriel",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/9bgxdv/you_want_me_to_point_out_the_big_green_shed/",
        "text": "Bit of a lurker, first time post with a little MC courtesy of my folks. MC at the very end. \n\nThey were on holiday somewhere, big long road trip around the country with their camper trailer. They were stopped in whatever town, figuring out what they were going to do for the day, have a wander around, grab some groceries etc. Dad said he wanted to stop at a Big Green Shed (BGS) hardware store (US readers think Blowes or Home Despot type place) for something, then 10 mins later changed his mind and decided that he didn’t need to stop in there anymore. \n\nSo they’re out driving through town, going past various stores including a BGS. About 5 blocks later, he asks Mum, “Now where’s the BGS in this bloody town?!?” Mum just looks at him and says, “We passed one 5 blocks ago”\n\nHim: “Why didn’t you say something?!?”\n\nHer: “Because you said you didn’t want to stop there anymore, duh!”\n\nHim: “You still could have told me it was there!”\n\nHer: “What, I have to point out every one do I?”\n\nHim “... You could have pointed that one out.”\n\nHer: *exasperated sigh*\n\nThey ended up stopping at the BGS but this exchange was not forgotten. For the rest of their trip, every town they drove through, she would point out every single BGS hardware store they drove past. Some places had just one. Some places they drove through had half a dozen. ",
        "created_utc": 1535607261,
        "upvote_ratio": ""
    },
    {
        "title": "Throwing away yucky food",
        "author": "ancient650",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/9bg26a/throwing_away_yucky_food/",
        "text": "I work at a fast food place. We have 3 types of dates on food:\n1. Best before - never required by law to throw away, but throw after 3 months because of quality\n2. Use through - basically guaranteed to be good on that date, after that, check for quality \n3. Use by - useable on that date but chuck the day after, even if it looks good\n(These are legal things)\nSo I'm going along, doing my job, and I see a bag of onion that I don't like the look of, dated for a couple of days in the future. Showed it to my manager to be recorded as waste and was told to use it, as we go based off the dates. Put it in the kitchen, someone else threw it away.\nSince then, I am a nazi about dates. Every shift, I check EVERY date. Things I wouldn't have cared about, straight into the bin. One time I threw out about 10 kg of lettuce which was still looking good. ",
        "created_utc": 1535598953,
        "upvote_ratio": ""
    },
    {
        "title": "Serena Williams stayed silent and unproblematic when the French Open banned her black catsuit ....and showed up in a mutherfudging TUTU!!",
        "author": "hulikal",
        "url": "https://www.independent.co.uk/life-style/serena-williams-tutu-virgil-abloh-nike-us-open-french-open-a8511946.html",
        "text": "",
        "created_utc": 1535597715,
        "upvote_ratio": ""
    },
    {
        "title": "Cold call x phone numbers per day. No problem.",
        "author": "onmuhphone",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/9bfk22/cold_call_x_phone_numbers_per_day_no_problem/",
        "text": "I briefly worked a car sales job. When they offered me the position I was apprehensive and said I'd only take it if they didn't make me do certain scummy things I listed(upsell people to cars they clearly couldn't comfortably afford, etc.) One of the specific things I mentioned was no cold calling. They assured me sales in the car business isn't like that anymore, yada yada.\n\nSure enough a month or two in they give me a stack of paper with hundreds of phone numbers to call, swearing it's not cold calling and all those people asked us to call them. Right...\n\nI don't do it at first but then in morning meetings they make a big stink about who did and didn't meet their call quota. They were checking phone logs to see how many calls we made. If we didn't get a hold of someone we were supposed to try again the next day.\n\nI gave in and tried calling some numbers. Of course no one was expecting a call. A good portion of the numbers were disconnected. From then on I just called the same disconnected numbers each day until my cold call quota was met.\n\nI ended up quitting after a few months. Partly because I was a shit salesman, partly because it was a clusterfuck with bloated staff, no foot traffic, and damn near no new inventory. They also wanted us to switch from 5 10s to 6 12s for minimum wage if we weren't selling x cars per month.",
        "created_utc": 1535594744,
        "upvote_ratio": ""
    },
    {
        "title": "Don't believe how much my ruined shoes cost? Ok I'll get you an official quote.",
        "author": "Quaf4",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/9bf7wp/dont_believe_how_much_my_ruined_shoes_cost_ok_ill/",
        "text": "So, my wife and I both work in the Theatre. Most times, we work for excellent companies with competent staff. Most times. \n\nThis time, my wife was in rehearsal for a show, and they had allowed the actors to wear the shoes that were part of their costumes during rehearsal. This is great because you get used to how they feel when you're dancing in them, you can break them in etc. Only problem was that my wife's feet are ridiculously small (size 2), so they didn't have a pair for her yet. She wore her own, as per usual. \n\nAnyways, the order came down from up high that they would be spray painting these rehearsal [Character Shoes](https://m.zappos.com/p/bloch-sfx-split-flex-black/product/7463157/color/3?ef_id=WXtzcgAAAXr8HRpH:20180830002544:s) silver, as it is cheaper to buy low quality black ones and spray them, rather than buy a bunch of silver character shoes. \n\nOne wardrobe department employee then goes into the rehearsal studio during the break and grabs ALL the character shoes in the room including my wife's custom made Capezio character shoes.\n\n Now, these are wayyy more expensive than you would ever think plausible. Also, they're kind of a bitch to get, as you have to have your feet measured in person in NYC, then wait the 6-8 weeks for them to be made specifically for you. \n\nObviously, my wife was quite upset at how they had completely ruined her beloved shoes. This was compounded by the fact that she has ridiculously small feet, so finding replacements is very difficult - thus the custom made pair she shelled out for a couple years ago. \n\nAfter a few back and forths between the higher ups and her agent etc, they reluctantly agreed it was on them to replace the shoes, and asked what they cost. \n\nIt had been a couple years so she couldn't remember exactly, and said $300-350, because that seemed fair and not ripping anyone off, especially since they weren't brand new and she had gotten a couple years use out of them. \n\nThis was met by an incredulous response from management. They didn't believe that they cost that much as they couldn't find prices that high on the even [higher end](https://www.laducashoes.com) brand of character shoes, and demanded a quote from LaDuca. \n\nSo, she requested a quote from Laduca for custom made shoes as requested, and it came back for $650. \n\nA check quietly arrived at her dressing room station a couple days later for the full amount. \n\nEdit: grammar ",
        "created_utc": 1535591932,
        "upvote_ratio": ""
    },
    {
        "title": "Don't like her last outfit? Here's an outfit to comply to your rules...",
        "author": "justanothermelody",
        "url": "http://huffp.st/a7eGu51",
        "text": "",
        "created_utc": 1535588523,
        "upvote_ratio": ""
    },
    {
        "title": "Are you trying to tell me our boss was *wrong* about the spreadsheet?",
        "author": "LAEuphoria",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/9be3pe/are_you_trying_to_tell_me_our_boss_was_wrong/",
        "text": "So this past Friday I worked alongside a terrible woman for a project who waited until after I compiled training sheets for over 200 employees and divided them between english/spanish speakers and then by department to tell me that I need to organize them by first/second shift. The deadpan look of frustration in my face made her laugh.\n\nBecause of this I gladly accepted and returned to my desk where I pulled up (*chose to USE) my bosses headcount rather than hers and proceeded to organize the training sheets. \n\nThe data was different and once asked about my work, I asked her \"Are you saying that the bosses spreadsheet is *wrong*??\". Of course she had no answer and I therefore proceeded to clarify with my boss who is a bit overwhelmed and forgetful (perfect) which he assured me that his was in fact correct (maybe). \n\nI quickly brought the stack of a total of 600 pages to her desk and smiled walking away. ",
        "created_utc": 1535582892,
        "upvote_ratio": ""
    },
    {
        "title": "Stay busy? OK how about TWO bathrooms.",
        "author": "LAEuphoria",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/9be0rt/stay_busy_ok_how_about_two_bathrooms/",
        "text": "[removed]",
        "created_utc": 1535582271,
        "upvote_ratio": ""
    },
    {
        "title": "Won't let me use the bathroom? Ok then.",
        "author": "akejjrh128",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/9bdxyy/wont_let_me_use_the_bathroom_ok_then/",
        "text": "Hey guys sorry for the formatting I'm on mobile. Anyways lets begin!\n\n\n   So this happened during year 7 in the U.S. (12-13), and back then I had a teacher called Mr.  G. Mr. G was a real grump and he liked to make really stupid rules. One of the rules he made didn't allow us to use the bathroom. Yeah it was really stupid. Anyway so one day I had to use the bathroom really badly, but he didn't let me go. This is how it went.\n\n\nMe: Mr.G can I use the bathroom?\n\nMr.G: No wait until the end of class.\n\nMe: But Mr.G I really have to go. \n\nMr.G: Too bad. Wait until the end of class.\n\n\n  So there I am just sitting there. Little seventh grade me was mad that he wouldn't let me go so I came up with a plan. You see, as well as having to use the bathroom I had to fart badly. So I decided to wait in my seat. Before I farted I asked one more time, but he just told me to sit back down. So I did, and I farted.\n\n\n\nIt. Was. Glorious.\n\n\n\n It was uber loud, as well as smelly. As soon as it happened everybody stopped what they were doing and they laughed. Although after the laughter died down they covered their noses with their shirts, as well as Mr.G, because like I said it was uber smelly. So afterwards, while everyone covered their noses with their shirts, I asked Mr.G once more if I could use the bathroom. He blushed, and said I could, so I went.\n\n\nAnd during the next class period we had, he lifted the ban for the rest of the year.\n\n\n\nEdit:Spelling",
        "created_utc": 1535581656,
        "upvote_ratio": ""
    },
    {
        "title": "Stupid stop sign",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/9bdxjx/stupid_stop_sign/",
        "text": "[removed]",
        "created_utc": 1535581573,
        "upvote_ratio": ""
    },
    {
        "title": "Am I in a Hydra Enlightenment Facility?!?",
        "author": "DuchessMichele",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/9bdukd/am_i_in_a_hydra_enlightenment_facility/",
        "text": "Mobile. Lurker. First time poster. TL;DR at bottom. \n\nIn the middle of my 7th grade year my family moved closer to my father’s construction business about 30 miles away. My parents enrolled me in the local Junior High School, and I’m not sure why, but I wasn’t placed in the honors program like I had been in at my previous school. \n\nThe science class I was in was Earth Science, which I found very interesting, however I had already taken it in 6th grade at my old school. The class was taught by Ms. J, who spoke to the class like we were 5 year olds. \n\nI’ve grown out of my shell, but at the time I was an extremely shy person. However, I have a pretty dry sense of humor and can be a little snarky at times. I usually spent the first 15 minutes during class doing the homework for that day which was posted on the white board. I spent the rest of the class doodling or reading books. \n\nMs. J caught on to the fact that I wasn’t really paying attention to her droll and utterly boring lessons. She asked me in the most condescending way that if I was finished with my homework then I should just sit there quietly and relax or finish my homework for my other classes. \n\nSince I typically finished my work during the other classes, as well, and usually had no other homework to do, I hatched a plan for some pretty ballsy MC. Since I wasn’t allowed to draw or read then I’d be happy to sit there and relax. The next day I brought a small pillow and after I finished my homework, I proceeded to relax and pretended to pay attention while resting my head on my pillow. I could have used a balled up sweatshirt, but where’s the fun in that! \n\nObviously she didn’t find it funny and I was asked to stay after class so she could talk to me. She said that she understands that although I had an A in the class and always turned in my homework, I still had to participate in class. After I told her that I had already taken this class and it wasn’t challenging enough for me, she called my mother and thankfully they arranged for me to take the honors program entrance exam. I thoroughly enjoyed my classes after that and was able to participate with the rest of the class. \n\nTl;dr After I finished my homework the teacher wouldn’t let me spend my free time drawing or reading so I pretended her class was interesting while resting my head on a pillow. ",
        "created_utc": 1535580906,
        "upvote_ratio": ""
    },
    {
        "title": "Simple request for help.",
        "author": "racist_sandwich",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/9bd6vv/simple_request_for_help/",
        "text": "[removed]",
        "created_utc": 1535576234,
        "upvote_ratio": ""
    },
    {
        "title": "Force me to do a bonus assignment? Okay.",
        "author": "whatmustido",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/9bd4x6/force_me_to_do_a_bonus_assignment_okay/",
        "text": "For a bit of backstory, my calculus BC teacher in high school hated me and did her best to make my life difficult. One example of this: My school district swapped over to required uniforms that year (my last year, in fact). On Fridays, we were allowed to wear \"jeans and a t-shirt\". I wore camo cargo pants. She sent me to the office because apparently \"jeans\" means \"blue jeans only\". The lady at the office sent me back to the class with a note telling her to lay off. So she went to the principal about it, who decided to side with her.\n\n​\n\nAfter this, I decided if she wanted to make things hard for me, I was going to return to favor.\n\n​\n\nLate into the year, another teacher in a history class came up with a bonus assignment where you either modify an existing song to make it about history or write your own song about history, then perform it in front of the class. Apparently she liked this idea and decided to have us do a similar assignment about math. She told us it was a bonus assignment that we were required to do. I asked why, if it was a bonus assignment. Her answer was because she told us to.\n\n​\n\nSo I picked \"Around the World\" by Daft Punk. For reference, that song consists of the words \"around the world\" repeated 144 times (I counted). I changed \"Around the World\" to \"Derive the Root\", because we were talking derivatives at the time.\n\n​\n\nWhen the time came for us to perform the songs in front of the class, the person who went before me performed his own original song, including music from his guitar. Everybody loved it. When I went up, I stood there and monotonously said the words \"derive the root\" until she told me to stop.\n\n​\n\nAt first she thought I was joking and she asked me to pull out my real song. I told her this very much was my real song. The small smile of disbelief faded and was immediately replaced by rage. \"So you just replaced two words in this song?\"\n\n​\n\n\"I replaced more than half of the words in the song, yes.\"\n\n​\n\n\"And you expect to get the same grade as \\*so-and-so\\* after he put so much work into his?!\"\n\n​\n\n\"Yes ma'am, I do. I followed the assignment to the letter. Are you ready for me to keep singing?\"\n\n​\n\nI got a 100. Her hatred of me only grew. It was fun.\n\n​\n\nEdit: For reference, all the students in the class loved it, including the guy who put so much work into it. I was very well-known for pulling antics like this in high school and all the students loved watching me work.",
        "created_utc": 1535575875,
        "upvote_ratio": ""
    },
    {
        "title": "You want me to show up... when?",
        "author": "madman1101",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/9b8lue/you_want_me_to_show_up_when/",
        "text": "TL;DR: Try to save the company money, boss tells us to show up earlier, so we do, doing nothing in the process.\n\n&amp;#x200B;\n\nSo, I got out of this job a few months ago, and I figured at least a few of you would enjoy. Basically I used to work for a micromanaging goof who always had to have things his way. When I was hired, I was told to show up at 7:30 every day. Which was fine. I'm not a morning person but I made it work. I got there on time. From there I proceeded to wait until 8 for everyone else to get done shooting the shit and start working. Literally everyone would stand outside smoking, talking, not working. So, to save the company some money i'd show up at 8. Nobody noticed. For about 4 or 5 months it was this way. Then, my boss caught on. Told me and another guy who had the same idea as me that we needed to show up \"on time\". Which was fine. We showed up \"on time\" again, and sat around while others smoked/did whatever. (most of the stuff we had to work on was multi person lifts because of weight/size/etc. Well, these 30 minutes every day added up. I'd have to estimate that the two of us combined to cost the company a few thousand a year over the following years just by showing up \"on time\"",
        "created_utc": 1535543696,
        "upvote_ratio": ""
    },
    {
        "title": "(wrong thread)HELP!!! This needs to be sent to the proper locarions, this woman sent a man to prison for fase rape charges.",
        "author": "Sindenky",
        "url": "https://www.reddit.com/r/confession/comments/9apjib/i_lied_about_a_guy_raping_me_in_college_years_ago/",
        "text": "",
        "created_utc": 1535541705,
        "upvote_ratio": ""
    },
    {
        "title": "There was nothing in the uniform policy about Sharpies.",
        "author": "Kolbentine",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/9b84y0/there_was_nothing_in_the_uniform_policy_about/",
        "text": "Once again, at the lovely grocery store in hell.\n\nMy department manager was the most anal person I've ever seen when it came to uniform policy. Go figure, he never picked on the females (probably because every single one of them would nail his ass to the wall for sexual harassment with how horrible he was about enforcing uniform policy).\n\nBut the one thing, the ONE thing he used to try nailing me on all the time was my shoes. I've got issues with my feet and can't simply wear dress shoes like he'd want us all to wear, nor can I wear just any old shoes. (I actually did this once, though that'll be a bonus addition.)\n\nSo he settled (because seriously, doing cart duty in dress shoes is PAIN) and started only going after people who didn't wear black shoes. Now, most people complied with no issues, but finding a set of full black shoes that my feet didn't immediately hate and that I could afford was a wee bit problematic. I was able to find some with dark gray stripes, and he still complained. I got a doctor's note and he backed off for a bit, but when upper management changed hands he declared that note invalid and continued harassing me over it.\n\nIt came to a head one day (he usually just chided me about it but let it be, as I arrived at work usually when he was getting off) when he told me to change shoes or go home, missing an 8 hour shift in a 16 hour week.\n\nAt this point, I had it. I cracked the employee handbook, noticed that there were no qualifiers on the shoe bit, just that they had to be black. Fine enough. Walked right over to the office supplies section, bought a big Sharpie, and marched back to the breakroom where he was on his break and colored the gray stripes in black Sharpie right in front of his face. Naturally, he protested, I told him to point out where in the uniform policy it says I can't do this.\n\nDefeated, he returns to his post angrily. And that was that.\n\n**BUT WAIT! THERE'S MORE!**\n\n(Though the compliance bit ended back there a bit. This is mostly just the aftermath.)\n\nHe began harassing everyone and trying to make an example out of me. My next shift he suddenly hung up a bunch of stuff in the break room declaring (probably in my honor) that it was uniform policy re-education week and that he'd be cracking down on everyone (possibly for my actions). He probably expected everyone would shame me into falling in line, which backfired tremendously. Save for one of us, everyone in my department looked out for eachother, and this was no different.\n\nAnd one of us? Had tenure and seniority on Mr. But Muh Uniform Policy. He also moonlighted as our on-site union rep.\n\nSo next time I see our department manager, I tell him as such: That I know he's trying to shame me, and if all his signage trying to indirectly shame me isn't taken down by the end of his shift, I'll be going to the union with $SeniorClerk in tow to file a harassment claim.\n\nHe *very quickly* backed down. And never bothered me about it again for the rest of my time there.",
        "created_utc": 1535539257,
        "upvote_ratio": ""
    },
    {
        "title": "\"No cheating on the test\", you say? OK!",
        "author": "ZauzTheBlacksmith",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/9b7vcc/no_cheating_on_the_test_you_say_ok/",
        "text": "[removed]",
        "created_utc": 1535536434,
        "upvote_ratio": ""
    },
    {
        "title": "Rules are rules boss. Gotta go!",
        "author": "Philip_De_Bowl",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/9b7p3u/rules_are_rules_boss_gotta_go/",
        "text": "I was told to post this here, so copy and paste:\n\nNot me, but my friends old place. \n\nMy friend was one to show up a half hour early before work and was a commission based salesman with salary, just like the other salesmen, who would always show up barely on time to hours late. \n\nFriday night comes along and management decides to hold a meeting to announce the new policy: If you're late, you go home for the day and if your late three days a month, you're fired. \n\nThe weekend goes by and everyone is on time. During the week, a few people call out sick right as the store opens. \n\nThe weekend is coming up and my buddy is scheduled for Saturday, but not Sunday or Monday, and he's going to Disney Land with his wife, who has Saturday, Sunday and Monday off. \n\nFriday night he packs his wife's car. Saturday comes along and he's in the parking lot a half hour early. He pops in his favorite cassette, fires up a joint, and proceeds to hot box his car. \n\nHe walks in five minutes late, reeking of pot, looks at the clock, and then to his boss in front of the whole sales floor, and  loudly says \"Oops! I'm late, guess I need to go home!\" With a shit eating grin on his face. \n\nThe bosses started backpedaling the policy and started to tell him it wasn't for him and they'll let it slide. He loudly stated that it wouldn't be fair if they made an exception for him and that he would see them Tuesday. \n\nWhen he got back to work on Tuesday, the policy was gone. \n\nSame company years later hired some absolute genius of an accountant who sold the idea to management that employees were making more than management, and that they should go from commission to salary. \n\nAll the top salesmen jumped ship ASAP. The reminding bottom feeders got a raise compared to their normal salary and commission, and they didn't have to do shit all day to get it.\n\n Less than a year later, they shut their doors for the last time...",
        "created_utc": 1535534525,
        "upvote_ratio": ""
    },
    {
        "title": "Stop opening doors!! Ok no bother then.",
        "author": "cokkiesdocrumb",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/9b7n9m/stop_opening_doors_ok_no_bother_then/",
        "text": "Years long lurker and my first post only made an account for the first time this week. Think this is more petty compliance who knows.\n\n\nOne morning me and my SO where just doing some of the housework together \n\nI went into the kitchen not knowing he was behind the door and it hit him in the back and he shouted \"stop opening doors !!.\" So I complied.\n\nI had to go into the sitting room but I couldn't the door was shut, so I shouted on him to come and open the door he sort of smirked and done it for me. Then I had to open another door and again as per his request had to shout on him to open the door for me because you know he asked me to stop opening them.\n\nHe then started to back track saying he only meant when there was a possibility that  someone was behind said door. So I asked very sweetly how am I suppose to know? I would hate to hurt you again. So over the next 20 minutes every door I got him to open for me including cupboards and debated with him if I was allowed to open the wardrobe door. After a while he said fine do what you want. So I sat on the sofa and let him finish off the housework. It felt good.",
        "created_utc": 1535533922,
        "upvote_ratio": ""
    },
    {
        "title": "Just one of the largest Airlines in the world playing with fire in one of its most precious markets.",
        "author": "grudgehound",
        "url": "http://imgur.com/gallery/LmGHwLP",
        "text": "",
        "created_utc": 1535528522,
        "upvote_ratio": ""
    },
    {
        "title": "\"Show your work!\" \"There was none.\"",
        "author": "scienceandjustice",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/9b6sv2/show_your_work_there_was_none/",
        "text": "Long time listener, first time caller. So this happened to my Dad like a million years ago and he told me like a hundred years ago--forgive me for skimping on the details, is what I'm saying.\n\nAnywho, once upon a time my Dad was a high school or middle school student, idk which, and was something of a math wiz. And boy, the math teacher did not appreciate him correcting him, showing him easier ways to do the work, etc.\n\nOne day there was a test and the teacher wanted the students to show their work. As you might have guessed from the title, Dad did not. I'm assuming (remember: a hundred years ago) based on the fact that he had to end up at the front of the class at some point for this story to make sense that he was called up at this point and they had the titular conversation.\n\nPretty sure the teacher's assuming my Dad's cheating at this point (don't know if my Dad said so or if it's something I read into the story, though), so the teacher writes up a bunch of problems on the chalk board and demands that my Dad prove that he can solve them in his head.\n\nWhich he does.\n\nThe teacher's fuming, but can't do shit other than send him back to his seat.\n\nOf course, said teacher was also his homeroom teacher and now his enemy for the rest of the year, so was able to make a lot of trouble for him after that, so this story doesn't exactly have a happy ending, but still.",
        "created_utc": 1535524084,
        "upvote_ratio": ""
    },
    {
        "title": "Parents told me I should of gone to a college farther away",
        "author": "darkecojaj",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/9b5min/parents_told_me_i_should_of_gone_to_a_college/",
        "text": "[removed]",
        "created_utc": 1535512324,
        "upvote_ratio": ""
    },
    {
        "title": "That's not what you asked.",
        "author": "Temprament",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/9b56ki/thats_not_what_you_asked/",
        "text": "This will be short and sweet. We just got a new manager and he was basically dropped into the deep end with 0 instruction on how anything works. For some reason, I am his go to for every question/rant.\n\nThe new manager pings me asking what the password is to our schedule document. I do not have this and respond accordingly. He pings the lead on his shift for the password. Lead provides it but also mentions he can just hit \"Read Only\" if he is only trying to view it.\n\nManager comes into the Command Center to berate me saying that all he needed to do was hit read only. I replied, \"You asked me for the password. Not how to open it.\" At this point everyone is trying not to laugh.\n\nHis response, \"You just misunderstood my question.\"\n\nMe: \"You asked me a specific question. I answered it.\"\n\n*He leaves the room*\n\nEDIT - To clarify, I do not report to the manager. He's 3rd shift and I am 2nd shift. Due to my skill sets my shift overlapped an hour so I can help out with things. About the lead, he has the password information and stuff because he was acting 3rd shift manager during the hiring process. He has turned down the manager position probably 7+ times. Lead could have retired 20+ years ago and now just works because he feels like it. (Super long story that I won't share due to personal reasons)\n\nEDIT 2 - To put my position in perspective. I am 2 pay grades below Lead Tech and easily half the age of the next youngest person here. IMO, low man on the totem pole shouldn't be the one answering questions.",
        "created_utc": 1535508701,
        "upvote_ratio": ""
    },
    {
        "title": "You really want this chocolate? OK.",
        "author": "Ranger7381",
        "url": "https://v.redd.it/d970mn2ctui11",
        "text": "",
        "created_utc": 1535503400,
        "upvote_ratio": ""
    },
    {
        "title": "I can't eat on the clock? Ok, I'll poop on the clock instead.",
        "author": "Lemawnjello",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/9b4ffe/i_cant_eat_on_the_clock_ok_ill_poop_on_the_clock/",
        "text": "I work in a restaurant, and I get a shift meal each time I work. I have been usually finding the least busy times to take my meal, and seeing that I'm type 2 diabetic, I have to eat at least a little bit every 4-5 hours to keep my blood sugar constant. \n\n\nRecently, however, my employer has instituted a zero tolerance \"no eating on the clock\" policy. I tried to argue that it is a medical necessity for me to eat a healthy snack during my shift, but they told me that another diabetic worker doesn't eat during his shift, so there should be no excuses. His shifts are only 3-4 hours long, and he does eat as soon as my boss leaves. My shifts are 4.5-5.5 hours long, making it more difficult for me to go without food (especially in a high paced work environment). They told me to suck it up and just eat before my shift.\n\n\n\nSo here's what I did. I started eating before my shift, but this has changed my pooping schedule to be due right in the middle of the shift. So instead of taking a 10 minute break during a non busy time to refuel, I am forced to take a 15 minute break regardless of whether it is busy or not, leaving other employees in the weeds for that time. But hey, at least I'm not wasting company time by eating during my shift.",
        "created_utc": 1535502591,
        "upvote_ratio": ""
    },
    {
        "title": "I’m a full time portrait artist. Sometimes people ask me for free drawings.",
        "author": "JonARTon",
        "url": "https://i.redd.it/j7b4esmdwwi11.jpg",
        "text": "",
        "created_utc": 1535495981,
        "upvote_ratio": ""
    },
    {
        "title": "I Maliciously Complied With the Ridiculous Navy Requirements When Preform Maintenance To My Benefit",
        "author": "Eskaminagaga",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/9b2xbu/i_maliciously_complied_with_the_ridiculous_navy/",
        "text": "Here is an old malicious compliance story from my time in the Navy. This isn’t the kind of story that will give you a justice boner like many others here, it is just one where being maliciously compliant worked out in my favor and ended up not being all that malicious in the end, though still ridiculous.\n\nI was stationed on a ship in the Navy and part of my job was to perform 3M (Maintenance and Material Management) maintenance which just included things like inspecting and performing preventative maintenance on doors, hatches, fire extinguishers, etc. It wasn’t hard work; so as a result, people didn’t really treat it all that seriously when doing it, skipping steps and taking shortcuts which wouldn’t really matter to a normal person. This was also how I was taught to do it at first when I started. Then, after I started getting some experience, my chief (boss) started having me do spot checks. This was how it begun.\n\nI did the maintenance item as I would normally do, making sure I didn’t accidentally skip anything, but at one point, I forgot to put on goggles when handling some silicone jelly. This resulted in an automatic safety failure on the spot check and a reaming from my chief. He told me that he wanted me to follow all the rules, no matter how ridiculous that I pointed out that they were. So, that is what I started doing.\n\nThe next spot check, I put on the goggles at the beginning, never removing them even when they fogged up and doubled up on nitrile gloves. I passed and the chief said that that is what he wanted to see. So, I started doing even more. I printed out every piece of paperwork on every tool required for the job, ordered pristine tools for all maintenance items so I could have the receipts to prove them, familiarized myself with every NSTM (Naval Ships' Technical Manual) and printed out multiple copies (highlighting the applicable sections), printed out both the fleet wide and the ship wide manuals on controlling hazardous materials, Printed out all applicable MSDS sheets, and had all 3M procedures printed out and ready to go. I organized them all into different folders ready to grab and go to any spot check at a moment’s notice.\n\nAfter that, I got really good at spot checks, so good that people would go out of their way to watch how I would maliciously comply with every rule during my spot checks. I would pull out my pristine tools with receipts still attached to prove against the paperwork that they were the correct and exact tools called out in the procedure, wear the appropriate PPE (personal protective equipment) spelled out in the MSDS, hazardous material guides, or procedure, sometimes needing to double up when multiple different types are called out, pull out NSTMs that have additional steps that aren’t included in the procedure on how to perform certain actions and go through them step by step,  and follow the ridiculous disposal requirements for benign materials simply because they were “technically hazmat”. \n\nFinally, after passing every spot check for over a year with this method, a 3M fleet guy game to do a ship wide inspection and I was the guy that was specifically chosen to do a spot check for him for my department. During the inspection, I went through my pristine tool set, answering all questions with printed out paperwork and the guy was very obviously trying to stump me on something. He even called me out saying that I don’t do this on all my other spot checks at which point my chief and a couple observers who wanted to watch said that I did. I started measuring out the detergent soap required with my pristine measuring cup (way more than was really needed for the job), then filling up the rest of the bucket 2/3rd of the way with water since the water amount could be approximated (3 gallons of water in a 5 gallon bucket) and the inspector seemed particularly irked that I measured out the soap for a non-measured amount of water. I wore two sets of different gloves since what was called out in the procedure was different than what was needed on the MSDS. Double bagged the detergent-water (the detergent was considered hazmat) in a trash bag with a specific label on it since that is how to dispose of hazmat in the ship-wide hazmat procedure. And, as a finisher, I used bar soap that I checked out from hazmat to wash my hands with gloves on per the ship wide hazmat handling procedure, then to wash my hands without gloves with the liquid soap in the bathroom since I handled hazmat per the fleet hazmat handling procedure. The inspector just got frustrated and left, leaving me as one of the few passing departments on the ship and possibly the only one that he was not able to get me on anything. \n\ntl;dr: I maliciously complied with all the ridiculous rules regarding doing maintenance in the Navy and my boss loved me for it.",
        "created_utc": 1535491164,
        "upvote_ratio": ""
    },
    {
        "title": "Testing",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/9b18zm/testing/",
        "text": "[removed]",
        "created_utc": 1535479644,
        "upvote_ratio": ""
    },
    {
        "title": "Cat.",
        "author": "_Thanos_____________",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/9b01wg/cat/",
        "text": "[removed]",
        "created_utc": 1535471396,
        "upvote_ratio": ""
    },
    {
        "title": "A r/legaladvice post on a postmaster who follows the exact formatting of addresses and refuses mail if it doesn't match the addressee/sender, and it pushes beyond the line of being evil MC.",
        "author": "Dawn_of_Writing",
        "url": "https://www.reddit.com/r/legaladvice/comments/9auc8n/the_post_office_is_refusing_so_much_mail_that_my/",
        "text": "",
        "created_utc": 1535466634,
        "upvote_ratio": ""
    },
    {
        "title": "Get That Food Out of the Hall!",
        "author": "vikingzx",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/9awbzo/get_that_food_out_of_the_hall/",
        "text": "[removed]",
        "created_utc": 1535434964,
        "upvote_ratio": ""
    },
    {
        "title": "Sausage and egg.",
        "author": "iambobdied",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/9aw7fm/sausage_and_egg/",
        "text": "Not sure if this belongs here, and can only apologise for anything obvious I have missed, this is my first ever post on Reddit! Anyhow..\n\nBack in the days of my apprenticeship, I always did the breakfast run. Got the orders, bacon and egg on toast, egg on toast etc... Last on the list, grumpy old git, asked for sausage and egg. \n\n'Just sausage and egg?' I ask, he replies with 'Just sausage and egg.'\n\nDidn't look too happy when he didn't have any toast, even less so when I refused to go back to get toast! Got what he asked for, I meanwhile got a sausage and an egg thrown at me. Good times!",
        "created_utc": 1535433553,
        "upvote_ratio": ""
    },
    {
        "title": "(adorable) Malicious Compliance",
        "author": "Peruda",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/9avv4m/adorable_malicious_compliance/",
        "text": "[removed]",
        "created_utc": 1535430044,
        "upvote_ratio": ""
    },
    {
        "title": "You must keep it in your possession at all times...",
        "author": "YesIStillHaveIt",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/9atuq9/you_must_keep_it_in_your_possession_at_all_times/",
        "text": "LTL, FTP, on mobile (apologies for formatting, this is a throwaway and all that stuff...\n\nThis is going to be a long long read so TL:DR at bottom.\n\nQuite a few years ago I worked for a small company that provided vehicles on lease to people... more specifically to those with *impaired* credit. As these people would not get approved for traditional methods of finance our rates were significantly higher. How much higher? Heaps! (A $20k loan over 3 years at rate of 20% means repayments of about $175pw.) We would charge, on average, an extra $100-125 on top. We'd include registration costs, insurance, a yearly service as well as cover a set of new tyres over the 3 year term. But remember its a lease and you have to hand the car back to us. But people with bad credit can't take the cheaper option and came to us.\n\nMy job was simple. Take an application, get their supporting docs and send all of it through to the credit team who were in head office in a different state. If they got approved (because there are those that even we wouldn't extend a line of credit to) then I'd put them into one of the many cars we had in the fleet. I'd run through contract docs, get signatures, take their deposit and smile and wave as they drove off in their leased vehicle.\n\nThe work was a bit tedious and processes were long and convoluted when they didn't need to be. Some customers felt entitled to getting a vehicle just because we helped those with bad credit and were very angry and belligerent when we declined them. \n\nEverything started off well and the commission for getting customers into cars was very healthy. I enjoyed the job as there were genuine people that had come into some difficulty but were great customers and just needed to be given a chance despite what their credit file said. For these customers I would even stay back outside of office hours so they didn't have to take time off work to come sign and collect their car. Once I became comfortable I started to take streamline the application process in an attempt to make life easier for everyone. I had gained enough experience that I could tell by looking at an applicant's docs if the credit team would approve them or not. Rather than get an applicant's hopes up and burden the credit team I'd politely reject their application without sending it to head office. \n\nHead office didn't like this because they felt I had become a law unto myself. I was chewed out as I was not authorised to approve or decline applications and firmly ordered to follow the process. Soon enough the credit team became shitty as they became inundated with applications and were back logged. Management then chewed me out again for sending \"rubbish\" to the credit team and wasting their time. When I asked what they wanted me to do moving forward I was told \"figure it out or find a new job\". That's when my enthusiasm for the job died and my attention turned towards malicious compliance.\n\nNow part of my job was taking a deposit when customers came to sign their lease contracts. The finance lady (FL) that dealt with and tracked the payments and deposits from customers worked in another state. (Thank God!) She was a nightmare to deal with. She wouldn't answer your questions as it wasn't her job to teach or instruct. Wouldn't respond to your emails or voicemail (she rarely answered her phone as she was always \"busy\") unless it was to ask for something she wanted. She would cut you off as you responded to her questions once she had heard what she wanted to. She could never be corrected and was just a PITA. \n\nShe talked down to me when she first told me of the process as if I had never been to a bank nor knew how they operated. \n\nFL: If you take cash it must never leave your possession until you bank it. Do you understand? If its not deposited you must have it at all times. Tell me you understand.\n\nMe: Yep.\n\nFL: Don't \"yep\" me. This is serious. I don't need stupid people cocking up something so simple. \n\nMe: Okay, I got it, I'll do as you say. \n\nI had to deposit the cash into the company account the day it was received. To make things more tedious I couldn't just do it as a lump sum it had to be individual deposits matching the amounts customers gave me. This was really painful when I couldn't get to the bank in time and had to use the ATM to each deposit. The ATM deposit takes 3-5 minutes for each transaction and the closest one was 15 minutes in the wrong direction when leaving for the day. It was extra annoying when I had already stayed back a couple hours for a customer then had to lose another 35 minutes before starting off for home.\n\nAfter getting chewed out I stopped doing the deposits the same day. I did them every other day then at the end of each week. I'd take an extra long lunch to stop by the bank and make the deposit over the counter. The teller would eye roll when they saw me because of how tedious it was for them as well. Nothing happened for two months and I never heard anything from head office about it.\n\nThen one Friday I left work at lunch as I had an appointment in the afternoon. I stopped by the bank on the way. The line was huge and I was in a crunch to make my appointment. I get to the teller and he punches in the account number and tells me its been closed. I get him to check the account number again and he confirms what he first said. I'm running late as it is so I figure I'll bring it up with head office on Monday.\n\nAs I pull up to office on Monday there's a lovely huge realtor sign on the building saying its on the market. I ask my other colleagues when that went up and they said it was done late Friday. Calls and emails to head office go unanswered. More cars go out that week and more deposits are taken. Management finally reach out at the end of the week and say that the company is looking for a new location for our office and its business as usual. I try to bring up the issue with deposits and get shut down instantly and referred to FL as that's her area. I send her two emails a day about it and even CC management and even print them out as a fall back as I've been bitten before. I also notice that my salary comes from a different bank now.\n\nAfter two months an email comes across from management that they are closing all offices at the end of the week. Attached to the email is details of my severance. It clearly states that all new and existing customers need to be directed to contact head office. Any contracts/cars that are to go out this week will still go out and that I am specifically not to tell them that the office will be closing.\n\nFriday rolls around and some hired security come to watch us clean out our desks. As I finish packing my stuff into a box a customer comes in to collect their car and sign the lease documents. I take their deposit and put it into the now full cash box that has held all the other deposits for the last couple months. I call FL to ask about the money and what I'm supposed to do with it. To my shock she answers her phone.\n\nMe: Hey about the deposits taken today...\n\nFL: Oh my god don't tell me you've lost them.\n\nMe: What? No! They are here with me but...\n\nFL: Then what's the problem? Are you stupid? Do as I said and don't let them out of your possession or I'll have your ass! Now I'm busy ask someone else your dumb questions and don't bother me. **click**\n\nI pull the receiver away from my face and stare at it in disbelief. How could she be such an ass on my last day? That bitch. I hang up the phone and look at the cash box. Then I smile and I put it in with the rest of my belongings and walk out ushered by security.\n\nI never heard from them again.\n\n\nTL;DR - I take cash deposits as part of my job. I'm told to never let the money leave my possession or I'm in the shit. The company account closes and I can't bank it. So I comply and keep it in my possession.\n\n\n",
        "created_utc": 1535412220,
        "upvote_ratio": ""
    },
    {
        "title": "Reverse Malicious Compliance at Coffee Shop",
        "author": "Protocol2319",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/9at4zs/reverse_malicious_compliance_at_coffee_shop/",
        "text": "I usually go to a local coffee shop to get my morning coffee every day before work.  They know me there and sometimes I don't even have to order.  My usual drink is a medium coffee with a little ice. Yesterday I was a little distracted and ordered a medium ice with a little coffee. And that is exactly what I got.  When he handed me the cup, I could tell he was trying his hardest to stifle a grin.  ",
        "created_utc": 1535406536,
        "upvote_ratio": ""
    },
    {
        "title": "Dad: put a fitting on the new impact. Me: got you fam",
        "author": "theearm",
        "url": "https://i.redd.it/a9j7ddmc6pi11.jpg",
        "text": "",
        "created_utc": 1535402481,
        "upvote_ratio": ""
    },
    {
        "title": "“As much sauce as you’re allowed to give me”",
        "author": "Tesnilowry",
        "url": "https://i.redd.it/9w7bkaye8mi11.jpg",
        "text": "",
        "created_utc": 1535399135,
        "upvote_ratio": ""
    },
    {
        "title": "Oh this is yours? No problem, let me get out of your way",
        "author": "czechmeout-",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/9aqs6n/oh_this_is_yours_no_problem_let_me_get_out_of/",
        "text": "My mum and I went down to the beach this afternoon. For context, this isn't regular sandy beach - it's not even a beach, really - but rather a rocky coast with flat concrete areas where you can lie down. We found one which was empty, and it even had two sunbeds. One was a little too far away from the other (the concrete areas are terraced so it wouldn't have been easy to move it), so my mum went on the sunbed and I just laid on the ground nearby.\n\nSome time later, a lady and her daughter arrive. They are eyeing the two sunbeds, clearly having originally intended to take one each. Without a word of greeting, without an \"excuse me\", without even a *hint* of an apologetic smile the lady barks at my mum in a tick accent \"dis is privat\" while pointing at the sunbed. \n\nIn all other cases, my mum would have apologised, said we didn't realise the sunbeds belonged to someone, and we would have moved somewhere else. Instead, my mum smiled, just took the towel off and placed it **directly** next to the sunbed and laid down there.\n\nThe woman had no choice but to admit defeat and take the other sunbed while (surprise, surprise) making her own daughter enjoy the concrete.",
        "created_utc": 1535389792,
        "upvote_ratio": ""
    },
    {
        "title": "School made us have clear backpacks this year...",
        "author": "[deleted]",
        "url": "https://i.redd.it/sb48w8ylsni11.jpg",
        "text": "[deleted]",
        "created_utc": 1535385750,
        "upvote_ratio": ""
    },
    {
        "title": "A 3 year old that listens?",
        "author": "tandemmom",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/9apndb/a_3_year_old_that_listens/",
        "text": "[removed]",
        "created_utc": 1535382081,
        "upvote_ratio": ""
    },
    {
        "title": "Not even a raise?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/9aphhb/not_even_a_raise/",
        "text": "[deleted]",
        "created_utc": 1535380871,
        "upvote_ratio": ""
    },
    {
        "title": "Just rediscovered this oldie, thought it’d fit nicely here",
        "author": "16_bit_dolphins",
        "url": "https://i.redd.it/6n5r3i851ni11.jpg",
        "text": "",
        "created_utc": 1535376512,
        "upvote_ratio": ""
    },
    {
        "title": "Oh you didn’t bring him here?",
        "author": "andykaufmanismydad",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/9anbqe/oh_you_didnt_bring_him_here/",
        "text": "This is going to be a bit ranty and on mobile, so I apologize. \n\nI work in a really rough bar. I deal with fights pretty frequently. \n\nThe bar owner, after I’ve dealt with several engagements, a few that threatened my life and caused me to call the police, has decided to implement a rule. \n\n“No one calls the cops until I’m called first.”\n\nSo lo and behold, a fight breaks out. I locked the aggressor out of the front door and the back door. He’s pounding on glass and I’m afraid he’s going to bust through it or go through a window. I called the owner and he comes out, immediately the guy, 28 throws the owner, 69, against the door. The owner pops in and squeaks, “Call the cops.”\n\nEdit: Clarity",
        "created_utc": 1535360047,
        "upvote_ratio": ""
    },
    {
        "title": "The Kind of Son/Brother You Said You Wanted",
        "author": "Adymir",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/9amio2/the_kind_of_sonbrother_you_said_you_wanted/",
        "text": "[removed]",
        "created_utc": 1535349691,
        "upvote_ratio": ""
    },
    {
        "title": "Entrance Fee",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/9alfsh/entrance_fee/",
        "text": "[deleted]",
        "created_utc": 1535338530,
        "upvote_ratio": ""
    },
    {
        "title": "Told not to come to class if I didn't want to learn",
        "author": "adogatemy",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/9agfrj/told_not_to_come_to_class_if_i_didnt_want_to_learn/",
        "text": "I just found this sub and it made me think of a story that happened 8 years ago. Also sorry in advance for phone editing.\n\nI was in my final year of school (small country school of 800 kids or so) and we were given pretty free range. We had random free periods so were rarely questioned when not in class. We just had to make sure we weren't caught off school grounds during school hours.\n\nAnyway, I was doing hospitality as one of my electives and as it's not a hard class we finished the syllabus a couple of months early. Now I'm a bit of a smart arse and found the subject easy, so I didn't want to do 2 months of revision. Naturally, I started spending every lesson being disruptive and shit talking with my mate. It also didn't help my GF was in the class and being a young male, I had to be super witty and impress her 24/7.\n\nAfter about a couple of lessons the teacher got the shits and yelled at me and my mate to get out of the class and come back when we wanted to learn. So we were like, Hell Yeah! Extra free period!\n\nFast forward a week. Hadn't gone to a single hospitality class and we are currently pegging a frizbee across the quad trying to see who can throw it the furthest. The teacher is walking to class late and sees us. Teacher: Mrs Schooled (Mrs S), me and my friend: smart arsed teens (SAT)\n\nMrs S: SAT!?!?! Why aren't you in class!?!\n\nSAT: You told us to only come back when we wanted to learn.\n\nMrs S: Get in class now!\n\nSAT: Are we still doing revision?\n\nMrs S: Yes\n\nSAT: We don't wanna learn yet so we'll pass.\n\nWe then ran off throwing the frisbee. Next minute the Vice Principle tracks us down, tells us to stop being smart arses and get back to class, which we begrudgingly did. \n\nTLDR: disrupting class, get told to leave until we wanted to learn, didnt show up for a week, gwt tracked down by the vice principle. ",
        "created_utc": 1535298099,
        "upvote_ratio": ""
    },
    {
        "title": "Leave late? Okay.",
        "author": "morelikeBUTTdriver",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/9afgqo/leave_late_okay/",
        "text": "I'm a bus driver. I drive a bus. This is a story about bus driving. \n\nEdit: For clarity, + means I'm early, - means I'm late. So -5 means 5 minutes late. \n\nI was driving on a quiet weekday afternoon, it was dead, so I was dragging my feet trying not to be too early. As I passed through a very busy highway interchange, I got a text through the bus from dispatch asking me to ease back to +2. Since I'm surrounded by semis barrelling past me at 30 over the limit while I'm doing 20 under, there's no way I'm popping my hazards and parking and getting rear ended or causing an accident if someone swerves around me. So I take my time at the stops until I find a bus bay or turn lane to kill my time, but he texts again. I ignore it and kill a light at the next major street where it's safe. He said ease back to +2, I'm +2. Perfect. \n\nAgain I'm taking my time, again I start climbing to +3, +4, +5, then comes another text. Nowhere safe to stop, I continue. Now he calls me. I try to explain the above safety concerns, he doesn't really care. Whatever, next major street, I ease back to +1 despite being asked to go to +2. Look at me going above and beyond!\n\nWhen I'm at the light right before the terminal station, I'm too early again. He calls again and reams me out, saying \"I'm gonna have to put in a report, you're not listening\", blah blah blah. I lose my temper a bit and basically yell \"you asked for +2, I went +2, you asked again, I went +1! It's dead out, it's not my fault! I eased back every time you asked me to. I'm driving safely. I'm not going to put anyone in danger for the schedule. What do you want from me? You've been on my case this whole trip. It's distracting, and bordering on harassment.\" He tells me \"if you know you're going to be early, leave late!\"\n\nOk. Fine.\n\nOne thing I should note at this point is that \"safety\" is a bit of a magic word where I work. You mention a reasonable safety concern, that's the end of the discussion. Now I can't say \"oh I need to stop and sit in a coffee shop for 45 minutes because safety\", but any real safety concern is taken very seriously. \n\nI get to the station, park my bus, and hit the head. I sit in the break room until I'm -5, then saunter over to my bus. I'm in the bus -8. I pull up to the Bay, pick up my people, and leave -10. Lots of people now, probably because rush hour just started!\n\n-12, -15, -20. He calls again when I'm about halfway up at -25. \n\n(tersely) \"Hello, morelikebuttdriver. May I ask the reason you are late for my report?\"\n\n\"Busy.\"\n\n\"Is it vehicular traffic, construction, passenger load? What is it?\"\n\n\"Yeah. All of that. I'm busy.\"\n\n\"Thankyougoobye.\"\n\nHe calls again on the way down. \n\n\"Hello, morelikebuttdriver, I'm going to need you to do a change off with bus number 1234.\"\n\n(this is when you switch buses with a driver going the opposite direction to get back on time)\n\n\"Can't do it. I need to use the restroom at the station.\"\n\n\"Okgoodbye.\"\n\nHe finally gets me to do a change off on the way up on my next trip. At this point I've been -30 to -40 for over two hours, basically completely fucking up his line.\n\nYou'd think I'd get called in to the office and chewed out, right? \n\nWrong. \n\nSee, he made a lot of mistakes that would land him in more hot water than me. First, the constant texts and calls could reasonably be called harassment, as he is singling me out and distracting from my duties. Second, he ignored the magic word, safety safety safety. Third, he *told* me to leave late, and I was just complying with his orders. Fourth, he must have been asleep at his console not to notice I left 10 minutes late from the station. And since all calls and texts are recorded, I have irrefutable proof of all of it.\n\nSo to cover is *own* ass, he just pretended the whole thing never happened. \n\nTl;dr: \"leave late\", \"okay, bitch.\"",
        "created_utc": 1535289545,
        "upvote_ratio": ""
    },
    {
        "title": "I became a moderator on a sub... then removed all of the other moderators and took over.",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/9aev59/i_became_a_moderator_on_a_sub_then_removed_all_of/",
        "text": "[removed]",
        "created_utc": 1535282643,
        "upvote_ratio": ""
    },
    {
        "title": "Write these words in alphabetical order.",
        "author": "imsorryisuck",
        "url": "https://i.redd.it/vmhi2n7w7ei11.jpg",
        "text": "",
        "created_utc": 1535269856,
        "upvote_ratio": ""
    },
    {
        "title": "MC at the gym.",
        "author": "danimalod",
        "url": "https://imgur.com/a/kFXjQxA",
        "text": "",
        "created_utc": 1535266330,
        "upvote_ratio": ""
    },
    {
        "title": "Don't Talk to Strangers",
        "author": "iyager",
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/9adbpw/dont_talk_to_strangers/",
        "text": "[removed]",
        "created_utc": 1535260947,
        "upvote_ratio": ""
    }
]