[
    {
        "title": "Video For Calculus Limit Review",
        "author": "Glittering_Chance800",
        "url": "https://www.reddit.com/r/math/comments/10gdtxt/video_for_calculus_limit_review/",
        "text": "[removed]",
        "created_utc": 1674163707,
        "upvote_ratio": 1.0
    },
    {
        "title": "Some new properties of the zeta function in the critical range",
        "author": "LowPerspective4975",
        "url": "https://www.reddit.com/r/math/comments/10gdn6i/some_new_properties_of_the_zeta_function_in_the/",
        "text": "[removed]",
        "created_utc": 1674163279,
        "upvote_ratio": 1.0
    },
    {
        "title": "Going to college and I can barely do long division. Where do I start?",
        "author": "MyFeetAreKillingMe",
        "url": "https://www.reddit.com/r/math/comments/10gdmbo/going_to_college_and_i_can_barely_do_long/",
        "text": "[removed]",
        "created_utc": 1674163230,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is my reasoning about the four color theorem correct?",
        "author": "parapampus",
        "url": "https://www.reddit.com/r/math/comments/10gdh6m/is_my_reasoning_about_the_four_color_theorem/",
        "text": "Suppose the color theorem would be incorrect. Then there must exist a map that is not 4 colorable. Take a minimal counterexample, in the sense  that any other map with less countries is 4 colorable. \n\nNow I believe that this counterexample can't  contain a 4 clique, thus no set of 4 countries that each share  a border. My logic is the following :\n\nTake any triangle. Either this triangle are the only countries that not landlocked, or there are no other countries inside this triangle. Let's suppose there would exist countries within this triangle as well as outside of it. A map of only the triangle and the interior countries would now be 4 colorable, by assumption of minimality. The same for the map of the triangle with the exterior countries.    But this would also mean that complete map is 4 colourable, which can be seen quite easily I guess. \n\nIf there indeed would exist a minimal  counterexample that contains a triangle, then there is also a minimal counterexample that has  a triangle that only has countries inside of it. In this map, any other triangle thus has no interior, since that would contradict our earlier claim. Thus no  4 clique can exist in this map, except if the outer triangle is a 4 clique. But then there can only exist 4 countries, which is a contradiction. \n\nSo there exists a minimal counterexample, without any 4 cliques. From the 5 colored proof, any minimal country  has minimum degree 5. \n\nSo far, does this make sense? Or am I missing something?",
        "created_utc": 1674162899,
        "upvote_ratio": 1.0
    },
    {
        "title": "Some new properties of the zeta function in the critical range",
        "author": "LowPerspective4975",
        "url": "https://www.reddit.com/r/math/comments/10gdgx9/some_new_properties_of_the_zeta_function_in_the/",
        "text": "[removed]",
        "created_utc": 1674162882,
        "upvote_ratio": 1.0
    },
    {
        "title": "Some new properties of the zeta function in the critical range",
        "author": "LowPerspective4975",
        "url": "https://www.reddit.com/r/math/comments/10gdd8k/some_new_properties_of_the_zeta_function_in_the/",
        "text": "[removed]",
        "created_utc": 1674162639,
        "upvote_ratio": 1.0
    },
    {
        "title": "Will i be able to potentially follow a university math major?",
        "author": "at_noober",
        "url": "https://www.reddit.com/r/math/comments/10gcr83/will_i_be_able_to_potentially_follow_a_university/",
        "text": "[removed]",
        "created_utc": 1674161228,
        "upvote_ratio": 1.0
    },
    {
        "title": "Problem solving an equation:",
        "author": "NickoB98",
        "url": "https://www.reddit.com/r/math/comments/10gcqql/problem_solving_an_equation/",
        "text": "[removed]",
        "created_utc": 1674161194,
        "upvote_ratio": 1.0
    },
    {
        "title": "iPad and Chalk Dust?",
        "author": "Log_of_n",
        "url": "https://www.reddit.com/r/math/comments/10gcjwv/ipad_and_chalk_dust/",
        "text": "This is only kind-of math related, but I hope y'all see why this is a good forum to ask it\n\nI use an iPad to write lecture notes, and read from it while teaching. This semester I finally got assigned a room with a chalkboard, no more dry erase! But oh my god, my iPad is filthy after teaching. The sweat from my hands mixes with the dust whenever I turn the page, it's awful\n\nThe iPad isn't officially dust or water resistant, so I'm worried it won't stand up to a whole semester of this. Has anyone faced this problem and have any advice?",
        "created_utc": 1674160754,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why does the series or integral over 1/(x*ln(x)) not converge?",
        "author": "l33dplayer",
        "url": "https://www.reddit.com/r/math/comments/10gc90w/why_does_the_series_or_integral_over_1xlnx_not/",
        "text": "Hey, I was wondering this because in the context of the geometric series you learn that the sum over 1/x^n converges for all n &gt; 1. One of my university TAs then expanded on that and said that 1 over any function that grows faster than x (linearly) converges for x to infinity under the sum.\nClearly, neither the sum over 1/(x*ln(x)) nor the integral from 2 to infinity converge. However, since ln(x) is monotonically increasing x*ln(x) clearly grows fast than just x. So why doesn‘t 1/(x*ln(x)) converge?",
        "created_utc": 1674160043,
        "upvote_ratio": 1.0
    },
    {
        "title": "area of a cube?",
        "author": "Eldamavaxd",
        "url": "https://www.reddit.com/r/math/comments/10gbuny/area_of_a_cube/",
        "text": "[removed]",
        "created_utc": 1674159110,
        "upvote_ratio": 1.0
    },
    {
        "title": "Fastest method of solving a system of linear equations by hand with matrices?",
        "author": "Roosterington",
        "url": "https://www.reddit.com/r/math/comments/10gbqq6/fastest_method_of_solving_a_system_of_linear/",
        "text": "What is the fastest method of solving a system of linear equations, with three or four unknowns, mentally? I'll probably have around 2 minutes to solve one or more during my exam without a calculator, so I want to know what is the fastest way. Currently I only know how to use Cramer's rule, Gaussian elimination and matrix multiplication, and I find Gaussian elimination to be the fastest but it still takes time. Is there a better way?",
        "created_utc": 1674158849,
        "upvote_ratio": 1.0
    },
    {
        "title": "I understand most of what’s happening in this unit until this. How is the (2+) becoming (2*).",
        "author": "loveeee201999",
        "url": "https://i.redd.it/4dpo0nluh3da1.jpg",
        "text": "",
        "created_utc": 1674157521,
        "upvote_ratio": 1.0
    },
    {
        "title": "is there a quantifiable ratio for numbers that contain the letter a vs those that don't?",
        "author": "BALLSBAALSBALLS",
        "url": "https://www.reddit.com/r/math/comments/10gb30x/is_there_a_quantifiable_ratio_for_numbers_that/",
        "text": "Not a mathematician by a long shot but this idea just randomly appeared in my head. The numbers 1,3,5,7,8,9 and 0 all contain Es when written in print, so forgoing groupings like \"hundred\"  or \"million\" and writing numbers as 2337 \"two three three 7\", across all numbers, would there be a quantifiable ratio between numbers that have an E and numbers that don't? Not looking for that ratio just whether or not there is one.",
        "created_utc": 1674157316,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why? My friend in Mech. Eng. does such calculations!!",
        "author": "vishrut707",
        "url": "https://i.redd.it/pmusbru5h3da1.jpg",
        "text": "",
        "created_utc": 1674157290,
        "upvote_ratio": 1.0
    },
    {
        "title": "Satellite Location",
        "author": "fbndv2403",
        "url": "https://www.reddit.com/r/math/comments/10gafjx/satellite_location/",
        "text": "[removed]",
        "created_utc": 1674155770,
        "upvote_ratio": 1.0
    },
    {
        "title": "What should this say in a few sentences or less, I have no idea what’s going on.",
        "author": "Educational-Log-7259",
        "url": "https://i.redd.it/dvi8q8apa3da1.jpg",
        "text": "",
        "created_utc": 1674155119,
        "upvote_ratio": 1.0
    },
    {
        "title": "Here's an interesting conjecture I came up with! I don't believe there's a straightforward proof, so I'm posting it here.",
        "author": "yeep-yorp",
        "url": "https://www.reddit.com/r/math/comments/10g9xxk/heres_an_interesting_conjecture_i_came_up_with_i/",
        "text": "(f,g)∈N1, gcd(f, g) = 1, (a, b)∈N0, P(f,g)={h|h∈N\\^h≠(af+bg)}, s(f,g)≥h∀h|h∈P, s(f,g)∈P\n\nconjecture: ∃s(f,g)∀(f,g)\n\nrephrased: for any two natural numbers f and g with a greatest common divisor of 1, there exists a set of natural numbers P such that for any number h within the set, there is no amount of (f multiplied by any natural number a) plus (g multiplied by any natural number b) that can equal h. s is the greatest possible number in the set P. prove whether s exists for any value of f and g.\n\nsimpler explanation with examples: imagine a little kid learning to add has any number of sticks of two different lengths, let's say 3 and 10. they want to find every number they can by putting some of those blocks together. they can put 3 + 3 + 10 together for 16, and 10+10+3 for 23, but there's nothing they can do to make 8 or 17. 17 is the biggest number they can't make, everything after that has a solution. now, replace 3 and 10 with f and g, and replace 17 with s(f,g). for every length of those two sticks, as long as their largest common denominator is 1, i want to prove that there is a biggest number they can't make; that s(f,g) exists. for 3 and 4, s(f,g) is 5.",
        "created_utc": 1674154643,
        "upvote_ratio": 1.0
    },
    {
        "title": "Probability that the average of a random subset of integers will be an integer",
        "author": "cwycyshyn",
        "url": "https://www.reddit.com/r/math/comments/10g9g9o/probability_that_the_average_of_a_random_subset/",
        "text": "I’ve been taking averages of large large sets of integers at work a lot lately, and have been wondering how often I should see an integer average. Looks like the probability should be low, but I’m not sure how to find out exactly",
        "created_utc": 1674153503,
        "upvote_ratio": 1.0
    },
    {
        "title": "Contribution Margin per Volume ratios.",
        "author": "Sprint_ca",
        "url": "https://www.reddit.com/r/math/comments/10g9fiq/contribution_margin_per_volume_ratios/",
        "text": "I am doing some analytics and can't figure out the mathematical formula for the following.\n\nContribution margin (CM) = Sales (S) - Costs (C)\n\nI need to do a ratio of CM per Volume so I do Total CM / Total Volume\n\nIf I want each individual CM that contributed to the Total CM, I do single product CM / Total Volume\n\nHere is the question:\n\nI am looking for a formula to tell me how much plus or minus each product increased or reduced the total CM based on the products CM and Volume. \n\nExample: Lets say my total CM is 0.7 per pound \n\nI have 2 products one contributed 0.6 of the CM and the other 0.1\n\neach individual CM per pound are 10 and 0.2\n\nI want to come up with something like Product one is +5 CM coefficient based on volumes while product 2 is -4.3 CM coefficient so the end result is 0.7 but now I know what is dragging my total CM per pound down and what is actually very good based on CM and volumes.  \n\n&amp;#x200B;\n\nThank you",
        "created_utc": 1674153453,
        "upvote_ratio": 1.0
    },
    {
        "title": "graduate school malaise",
        "author": "paracompacthopes",
        "url": "https://www.reddit.com/r/math/comments/10g837h/graduate_school_malaise/",
        "text": "[removed]",
        "created_utc": 1674150504,
        "upvote_ratio": 1.0
    },
    {
        "title": "Career and Education Questions: January 19, 2023",
        "author": "inherentlyawesome",
        "url": "https://www.reddit.com/r/math/comments/10g6uh1/career_and_education_questions_january_19_2023/",
        "text": "This recurring thread will be for any questions or advice concerning careers and education in mathematics. Please feel free to post a comment below, and sort by new to see comments which may be unanswered.\n\nPlease consider including a brief introduction about your background and the context of your question.\n\nHelpful subreddits include [/r/GradSchool](https://www.reddit.com/r/GradSchool), [/r/AskAcademia](https://www.reddit.com/r/AskAcademia), [/r/Jobs](https://www.reddit.com/r/Jobs), and [/r/CareerGuidance](https://www.reddit.com/r/CareerGuidance).\n\nIf you wish to discuss the math you've been thinking about, you should post in the most recent [What Are You Working On?](https://www.reddit.com/r/math/search?q=what+are+you+working+on+author%3Ainherentlyawesome&amp;restrict_sr=on&amp;sort=new&amp;t=all) thread.",
        "created_utc": 1674147613,
        "upvote_ratio": 1.0
    },
    {
        "title": "Looking for the odds of passing a test",
        "author": "Altruistic_Action687",
        "url": "https://www.reddit.com/r/math/comments/10g6slt/looking_for_the_odds_of_passing_a_test/",
        "text": "So there’s 30 questions that I don’t know at all . But there’s a one in four chance of me randomly picking the right answer. Out of fifty questions what’s my chance of passing.(60%)",
        "created_utc": 1674147490,
        "upvote_ratio": 1.0
    },
    {
        "title": "I dont understand how he got \"3(x-2)\" in the denominator, is there some sort of rule of factorization that i'm missing?",
        "author": "CurrentCreative4380",
        "url": "https://i.redd.it/4ckouuaa51da1.png",
        "text": "",
        "created_utc": 1674147160,
        "upvote_ratio": 1.0
    },
    {
        "title": "Which book to get for vector calculus ?",
        "author": "SSpotatoman",
        "url": "https://www.reddit.com/r/math/comments/10g5gsd/which_book_to_get_for_vector_calculus/",
        "text": "Hello there , currently I'm in an EM course where they're starting with some vector calculus but I'm finding the approach to divergence,curl,line and surface integration etc to be very non-rigorous , I understand how they are computed but I don't get how it connects to the geometrical intuition.  \n\nIs there a book which takes a more rigorous approach while also maintaining the intuition for these topicc ? A Real Analysis course is going on(Bartle-sherbert) and I'm self studying Linear Algebra(Serge Lang).  Should I pursue this topic now or wait till I am done with these two ?",
        "created_utc": 1674144379,
        "upvote_ratio": 1.0
    },
    {
        "title": "in mq, does the number of questions affect the result if the answers are random?",
        "author": "XxLORD_SxX",
        "url": "https://www.reddit.com/r/math/comments/10g59zd/in_mq_does_the_number_of_questions_affect_the/",
        "text": "[removed]",
        "created_utc": 1674143968,
        "upvote_ratio": 1.0
    },
    {
        "title": "Learn maths? (Programming)",
        "author": "Zimengs",
        "url": "/r/learnprogramming/comments/10fiyc5/learn_maths/",
        "text": "",
        "created_utc": 1674142897,
        "upvote_ratio": 1.0
    },
    {
        "title": "Roadmap to advanced Nevanlinna theory",
        "author": "NoFrosting3074",
        "url": "https://www.reddit.com/r/math/comments/10g3j3m/roadmap_to_advanced_nevanlinna_theory/",
        "text": "Hello, I know [this](https://link.springer.com/book/10.1007/978-3-319-59800-0) and [this](https://link.springer.com/book/10.1007/978-4-431-54571-2) great books which are nice introductions to the topic but I would like to know of a roadmap with books or papers that would allow me to reach the state-of-the-art topics and current problems in the field of Nevanlinna theory. Thanks a lot for providing a roadmap with papers and/or books towards the full understanding of this amazing topic.",
        "created_utc": 1674139699,
        "upvote_ratio": 1.0
    },
    {
        "title": "Something I noticed about Pascal’s triangle. Is there a name for this?",
        "author": "rnkjnf",
        "url": "https://www.reddit.com/gallery/10g2e9y",
        "text": "",
        "created_utc": 1674136788,
        "upvote_ratio": 1.0
    },
    {
        "title": "Noticed something about Pascal’s triangle. (Context in comments) is there a name for this?",
        "author": "rnkjnf",
        "url": "https://i.redd.it/3wjnaqomr1da1.jpg",
        "text": "",
        "created_utc": 1674136595,
        "upvote_ratio": 1.0
    },
    {
        "title": "Combinatorics: Number of strings containing k_{n} characters",
        "author": "throwaway778899661",
        "url": "https://www.reddit.com/r/math/comments/10g1x2i/combinatorics_number_of_strings_containing_k_n/",
        "text": "[removed]",
        "created_utc": 1674135508,
        "upvote_ratio": 1.0
    },
    {
        "title": "Difference between behaviors of discount and raise calculations regarding the sum and parts.",
        "author": "pestenkeranist",
        "url": "https://www.reddit.com/r/math/comments/10g17t5/difference_between_behaviors_of_discount_and/",
        "text": "Okay I will have to give an example to explain what I am asking exactly: (Apologies for not making the numbers simpler, sometimes it doesn't work with simple numbers)\n\n&amp;#x200B;\n\nQ: I am buying socks for 20$, 2 shirts for 25$ and a hat for 30$. The store gives 15% discount. does it matter if the discount applies to the total sum or each part of clothing I buy?\n\nA: Yes. First case is straightforward. (20 + (2 \\* 25) + 30 = 100$)  and 100 - 15 = 85$. But if we apply the discount separately: (20 \\* 0.15 = 3$), (25 \\* 0.15 = 3.75$), (30 \\* 0.15 = 4.5$) and then you would subtract the discount from the cost of each item, (20 - 3 = 17$), (25 - 3.75 = 21.25$), (30 - 4.5 = 25.5$) and then you would add the final cost of each item, (17 + (2 \\* 21.25) + 25.5 = 86.00$). So it makes a 1$ difference.\n\n&amp;#x200B;\n\nBut if we modify the question as raise instead of discount:\n\nQ: I am buying socks for 20$, 2 shirts for 25$ and a hat for 30$. The store raises prices by 15% . does it matter if the raise applies to the total sum or each part of clothing I buy?\n\nA: No, same result! First case is 100 + 15 = 115$. And second case 23 + (2 \\* 28.75) + 34.5 = 115$.\n\n&amp;#x200B;\n\nSo my question is where does the difference in behaviours come from exactly? Aren't they just the inverse of each other? I believe the nature of subtraction causes this difference but can someone elaborate on why this is the case?",
        "created_utc": 1674133507,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why are the spaces between squared numbers primes?",
        "author": "TheCoolerBreadoggo",
        "url": "https://www.reddit.com/r/math/comments/10g0xxh/why_are_the_spaces_between_squared_numbers_primes/",
        "text": "I noticed that the spaces between squared numbers are prime numbers.\n\n1^2=1\n2^2=4\n3^2=9\n4^2=16\n5^2=25\n....\n\nThere's 3 numbers to get from 1 to 4, 5 numbers to get from 4 to 9, 7 to get from 9 to 16 and so on. Those are all prime numbers.\n\nWhat's the reasoning behind this? Is it a coincidence? Also, does it have a name?",
        "created_utc": 1674132717,
        "upvote_ratio": 1.0
    },
    {
        "title": "Calculus books for the absolute beginner with solutions manuals that ACTUALLY exist",
        "author": "Cybeast9",
        "url": "https://www.reddit.com/r/math/comments/10g0pyp/calculus_books_for_the_absolute_beginner_with/",
        "text": "So I'm trying to find a textbook to teach myself(a 16yo high school student Calculus (the reasons: its fun, complex, and interesting, and i also need it to delve in other topics like Electrical Engineering and also Physics), but I just find the textbooks(Stewart, Briggs, Thomas...) on the \"Generating library\"(you know what i mean\", with no solutions manual for any of the old or recent editions.Any solutions ? (no pun intended)",
        "created_utc": 1674132036,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can someone do this thingy thanks",
        "author": "MistaCleanx",
        "url": "https://i.redd.it/0jlzrecod1da1.jpg",
        "text": "",
        "created_utc": 1674131905,
        "upvote_ratio": 1.0
    },
    {
        "title": "What’s wrong with 1.0=1.(0/1) be 1/(1/0)?",
        "author": "VanillaRoyal5222",
        "url": "https://www.reddit.com/r/math/comments/10g08b7/whats_wrong_with_10101_be_110/",
        "text": "",
        "created_utc": 1674130503,
        "upvote_ratio": 1.0
    },
    {
        "title": "explore على TikTok",
        "author": "Fit-Pea5951",
        "url": "https://vt.tiktok.com/ZS8SesmdD/",
        "text": "",
        "created_utc": 1674128387,
        "upvote_ratio": 1.0
    },
    {
        "title": "NASA’s Geotail Mission Operations Come to an End After 30 Years",
        "author": "Humble_Amphibian7448",
        "url": "https://www.nasa.gov/feature/goddard/2023/sun/nasa-s-geotail-mission-operations-come-to-an-end-after-30-years",
        "text": "",
        "created_utc": 1674127985,
        "upvote_ratio": 1.0
    },
    {
        "title": "Kolomogrov’s backward equation",
        "author": "italianimpostor",
        "url": "https://www.reddit.com/r/math/comments/10fy7ql/kolomogrovs_backward_equation/",
        "text": "[removed]",
        "created_utc": 1674123383,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does anybody have this program but the script part, I desperately need it ASAP, and can’t download programs on my TI-84. PLEASE PLEASE PLEASE if you have it please send it to me!!!",
        "author": "DistributionSea9095",
        "url": "https://i.redd.it/tmicul0exzca1.jpg",
        "text": "",
        "created_utc": 1674114373,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does anybody have this program but the script part, I desperately need it ASAP, and can’t download programs on my TI-84. PLEASE PLEASE PLEASE if you have it please send it to me!!!",
        "author": "DistributionSea9095",
        "url": "https://i.redd.it/j8r4fw65xzca1.jpg",
        "text": "",
        "created_utc": 1674114236,
        "upvote_ratio": 1.0
    },
    {
        "title": "how can i get the total amount of mass (in kilograms) that passed through a pipe in a period of 8 hours, when all the data i have is a set of average values of the flow rate ( kilograms/hour) where the average values are available in intervals of (1 sec, 5 sec, 30 sec, 1 min, 5 min, 10 min etc.)?",
        "author": "shaktimaanlannister",
        "url": "https://www.reddit.com/r/math/comments/10fuc9m/how_can_i_get_the_total_amount_of_mass_in/",
        "text": "",
        "created_utc": 1674108666,
        "upvote_ratio": 1.0
    },
    {
        "title": "Stalled math PhD student looking for advice",
        "author": "hjrrockies",
        "url": "https://www.reddit.com/r/math/comments/10fsvxi/stalled_math_phd_student_looking_for_advice/",
        "text": "[removed]",
        "created_utc": 1674103995,
        "upvote_ratio": 1.0
    },
    {
        "title": "bad at math good with word problems",
        "author": "Luetenantgeorge",
        "url": "https://www.reddit.com/r/math/comments/10fsrg6/bad_at_math_good_with_word_problems/",
        "text": "[removed]",
        "created_utc": 1674103606,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is there any good intuition as to why we have to \"reject\" certain solutions (e.g., a negative root of a subproblem does not fit the constraint for the broader problem, and so we ignore that case)?",
        "author": "kebabmybob",
        "url": "https://www.reddit.com/r/math/comments/10fsoic/is_there_any_good_intuition_as_to_why_we_have_to/",
        "text": "[removed]",
        "created_utc": 1674103346,
        "upvote_ratio": 1.0
    },
    {
        "title": "What number to the power of itself equals the smallest result?",
        "author": "necrorat",
        "url": "https://www.reddit.com/r/math/comments/10fskr4/what_number_to_the_power_of_itself_equals_the/",
        "text": "",
        "created_utc": 1674103030,
        "upvote_ratio": 1.0
    },
    {
        "title": "When I was younger one of my middle school T.As told me there will come a point in any hobby/career I choose where I will have to use math. I’m terrible at math and horrified of this prospect is it true.",
        "author": "Few_Post_3467",
        "url": "https://www.reddit.com/r/math/comments/10frs51/when_i_was_younger_one_of_my_middle_school_tas/",
        "text": "",
        "created_utc": 1674100630,
        "upvote_ratio": 1.0
    },
    {
        "title": "Hi! I need help answering my homework :’)",
        "author": "ender_grace7364",
        "url": "https://www.reddit.com/gallery/10fr7l7",
        "text": "",
        "created_utc": 1674098928,
        "upvote_ratio": 1.0
    },
    {
        "title": "Word for the square root of the sum of squares",
        "author": "hireurstandars",
        "url": "https://www.reddit.com/r/math/comments/10fqjkj/word_for_the_square_root_of_the_sum_of_squares/",
        "text": "[removed]",
        "created_utc": 1674097008,
        "upvote_ratio": 1.0
    },
    {
        "title": "In sequences, what is the name of the number representing the common difference/common ratio",
        "author": "NameisDevinM",
        "url": "https://www.reddit.com/r/math/comments/10fq0wv/in_sequences_what_is_the_name_of_the_number/",
        "text": "I understand that in an arithmetic sequence, the number is called the \"common difference\", but in a sequence that is neither arithmetic nor geometric, like if the sequence was 1, 3, 7, 13, 21, ... with each term going up by even numbers, I just don't know what the even numbers are supposed to be called.",
        "created_utc": 1674095504,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do Genetics and Mathematics intersect?",
        "author": "b1GR3d888",
        "url": "https://www.reddit.com/r/math/comments/10fpu07/how_do_genetics_and_mathematics_intersect/",
        "text": "I’m taking an intro level genetics course and we are tasked with writing a short, informal paper on anything genetics-related that we would like. Being the math major I am I want to find something unique to write about connecting the field of genetics to math.\n\nOf course there are a bunch of obvious things I could write about but I’m curious what good stories and cool things others might have to share! \n\n(Hopefully it’s cool to post this here—plz don’t ban me I love it here)",
        "created_utc": 1674094972,
        "upvote_ratio": 1.0
    },
    {
        "title": "some new ideas",
        "author": "LowPerspective4975",
        "url": "https://www.researchgate.net/publication/367240704_PROPERTIES_OF_THE_RIEMANN_ZETA_FUNCTION_IN_THE_CRITICAL_RANGE",
        "text": "",
        "created_utc": 1674094876,
        "upvote_ratio": 1.0
    },
    {
        "title": "I need help with something hopefully before February 2023",
        "author": "TysenM20",
        "url": "https://www.reddit.com/r/math/comments/10fpp4o/i_need_help_with_something_hopefully_before/",
        "text": "[removed]",
        "created_utc": 1674094593,
        "upvote_ratio": 1.0
    },
    {
        "title": "Vector question",
        "author": "No-Past-5509",
        "url": "https://www.reddit.com/r/math/comments/10fp5uh/vector_question/",
        "text": "[removed]",
        "created_utc": 1674093103,
        "upvote_ratio": 1.0
    },
    {
        "title": "[9th Grade Geometry] Is there enough information for me to prove it’s a rhombus? What can I know for sure? How do I prove it?",
        "author": "willowtree630",
        "url": "https://www.reddit.com/gallery/10fodu8",
        "text": "",
        "created_utc": 1674091342,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is the best method to find the number of combinations of r elements in a given array of size n, that cover all combinations of r-1 within the same array?",
        "author": "fndo84",
        "url": "https://www.reddit.com/r/math/comments/10fo7zy/what_is_the_best_method_to_find_the_number_of/",
        "text": "For example, let's say that you want to find the number of combinations of 16 numbers that would cover all the combinations of 15 numbers given an array of 25 numbers.",
        "created_utc": 1674090523,
        "upvote_ratio": 1.0
    },
    {
        "title": "Daughter's homework got me stumped help please",
        "author": "Royal_Perspective900",
        "url": "https://www.reddit.com/gallery/10fn1ly",
        "text": "",
        "created_utc": 1674087414,
        "upvote_ratio": 1.0
    },
    {
        "title": "Question about math in sound",
        "author": "ImDino87",
        "url": "https://www.reddit.com/r/math/comments/10flp2w/question_about_math_in_sound/",
        "text": "[removed]",
        "created_utc": 1674084024,
        "upvote_ratio": 1.0
    },
    {
        "title": "does anyone know any problems that equal to 30 and 9 (separately tho)",
        "author": "Specialist-Appeal-23",
        "url": "https://www.reddit.com/r/math/comments/10flmmq/does_anyone_know_any_problems_that_equal_to_30/",
        "text": "can someone make up a hard but not too hard of an equation that equals to 30 and 9, its for some projects and i barely know the basics of math",
        "created_utc": 1674083859,
        "upvote_ratio": 1.0
    },
    {
        "title": "Did there every come a point in your math career that you started preferring lemma-proof repeat type books?",
        "author": "BERCMJSJ-5",
        "url": "https://www.reddit.com/r/math/comments/10fki5b/did_there_every_come_a_point_in_your_math_career/",
        "text": "I think as I study more and more, I slowly get tired of the books which have too much fluff. Initially however, I rpeferred more fluff. What do you think?",
        "created_utc": 1674081149,
        "upvote_ratio": 1.0
    },
    {
        "title": "Do you know of any research paper that has analyzed actual game data for the Monty Hall problem?",
        "author": "KabobsterLobster",
        "url": "https://www.reddit.com/r/math/comments/10fjzub/do_you_know_of_any_research_paper_that_has/",
        "text": "[removed]",
        "created_utc": 1674079938,
        "upvote_ratio": 1.0
    },
    {
        "title": "Best Programming Language for Computational Proof",
        "author": "urethrapaprecut",
        "url": "https://www.reddit.com/r/math/comments/10fjx3d/best_programming_language_for_computational_proof/",
        "text": "Edit: To clarify \"computational\", I mean a Computer Assisted Proof. Apologies if confusion\n\nHello all. I'm wondering if there's any established norms for the best programming languages/systems for developing computational proofs. I've not yet done any of the higher level computational mathematics (abstract spaces, high performance computing, etc.) and most of my experience is in python but I remember learning a little scala and haskell back in the day and I know that different programming languages vary greatly in their approach to mathematics.\n\nIs there a specific language or development paradigm that lends itself to actual publishable computational proofs? My area of research would be in differential equations. I'm not shy or scared of putting time in to learn a new language/paradigm either. I just kinda felt like it'd be a bit of a shame to use python for *everything* when there might be better tools out there. Thanks",
        "created_utc": 1674079767,
        "upvote_ratio": 1.0
    },
    {
        "title": "Meaning of extraneous solutions in an asymmetric 1-D random walk problem",
        "author": "Aenonimos",
        "url": "https://www.reddit.com/r/math/comments/10fjwxm/meaning_of_extraneous_solutions_in_an_asymmetric/",
        "text": "The Problem:\n\nStarting at 0 on the number line, you walk right (+1) with probability 1/k, left (-1) with probability (k-1)/k. Given that this walk doesn't halt, what is the probability that you ever reach 1?\n\nThe Solution:\n\nLet the answer be p. First we see that p = Pr(reaching i| starting at i-1)] for all i given k. So p = 1/k +(k-1)/k *Pr(reaching i| starting at i-2). Then, noticing that Pr(reaching i| starting at i-2) = [Pr(reaching i| starting at i-1)]^2, we arrive at the polynomial p = 1/k + (k-1)/k *p^2. So p = 1, 1/(k-1). \n\n\nMy question:\n\n1/(k-1) is the actual answer for this problem. For example, when k=3 (1/3 right, 2/3 left), the answer is 1/2. What does the extraneous solution p=1 even mean? The answer can't be simultaneously 1 and &lt; 1.",
        "created_utc": 1674079756,
        "upvote_ratio": 1.0
    },
    {
        "title": "Four Adjacent Circles, Seemingly Difficult Problem?",
        "author": "[deleted]",
        "url": "",
        "text": "[removed]",
        "created_utc": 1674079023,
        "upvote_ratio": 1.0
    },
    {
        "title": "overthinking maths?",
        "author": "marogalaxy",
        "url": "https://www.reddit.com/r/math/comments/10fjjdr/overthinking_maths/",
        "text": "So.as you can see. Im pretty good at maths and i actually like &amp; enjoy it. Plus i use a lot of math since i am a programmer and working on games, basic physics simulations all the day. Sometimes (most of the time) i extremely overthink. Even the easiest stuff. I remember wasting my days on simple stuff like \"why does sin and cos draw a circle\" or \"F = m*a\" even though i work with them without problem. After a time, i start to feel stupid and get sad. I hate that loop and wanted to know if other people has experienced it.",
        "created_utc": 1674078903,
        "upvote_ratio": 1.0
    },
    {
        "title": "Covariant ratios for graphs",
        "author": "ElderberryEastern239",
        "url": "https://www.reddit.com/r/math/comments/10fjj99/covariant_ratios_for_graphs/",
        "text": "Hey guys and gals, I’m not really very good at math but this morning in my psych class my professor talked about covariant ratios for graphs, but she couldn’t explain how they were found. It’s r=0.7 or r=-0.7 and stuff like that. I googled it and it seemed like maybe it was the average of all (x,y) possibilities divided by the average of all plotted (x,y) points in a ratio. So it’s like r=0.7/1 and that’s the variation through points to show a positive or negative correlation. I was hoping someone could explain this in terms that someone dumb like me could understand or if it’s completely out of my range. Thanks!",
        "created_utc": 1674078894,
        "upvote_ratio": 1.0
    },
    {
        "title": "Examples of discrete properties exhibited by continuous systems?",
        "author": "not-alredy-taken",
        "url": "https://www.reddit.com/r/math/comments/10fizow/examples_of_discrete_properties_exhibited_by/",
        "text": "I'm interested in symbolical deep learning, which, aims at building deep learning models that present bigger robustness, make it easier to interpret and better overall performance in high level cognitive (human-like) tasks. \n\nIn current deep learning systems, we usually represent everything in continuous space, so that gradient-based optimization methods can work to achieve our goals (through the back-propagation algorithm). This has presented itself as very useful and integrated with current hardware acceleration methods and theoretical background. Due to that (and some other reasons) it's useful to maintain as much of this paradigm as possible. \n\nHowever, in contrast with symbolic reasoning, this paradigm assumes fully differentiable, continuous variables and everything is \"fuzzy\" when we try to make it discrete (e.g: words are generally encoded in high dimensional vectors that, in some \"learned\" way, encode in their vector space notions of syntax, not semantics, and we generally approximate the output to the closest vector/word).\n\nI'm aware of the existence of measure theory (that AFAIK treats formally these kind of discrete-continuous systems transitions) and all, but I'm no mathematician, so can you please cite some discrete behavior that emerge from **purely** continuous behavior?\n\nEmphasis on the **purely** part, as there are some procedures/functions/etc that seems to behave like asked, but don't, like the [Borwein Integrals](https://youtu.be/851U557j6HE) that seem to present this, but if you just analyze deeply the discrete transition from always resulting in pi to resulting in something different emerges from another **discrete** element: the fact that we added another term in the multiplication inside the integral (an discrete sequence element). \n\nThe **ONLY** example of this behavior that I could think of was the many **solutions** to and ODE, defined by it's **coefficients** (continuous parameters). E.g: The harmonic oscillator (y'' + a\\*y' + b\\*y = 0) can present 3 different **behaviors/functions/solutions** if we just change the coefficients (a , b).",
        "created_utc": 1674077721,
        "upvote_ratio": 0.5
    },
    {
        "title": "Problem of The Month",
        "author": "ItsDev1023",
        "url": "https://www.cemc.uwaterloo.ca/resources/potm.php",
        "text": "",
        "created_utc": 1674076849,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to take notes in a class with no book",
        "author": "th3cfitz1",
        "url": "https://www.reddit.com/r/math/comments/10fikcn/how_to_take_notes_in_a_class_with_no_book/",
        "text": "Ok. Very common thread here, but with a very specific twist. My upper level math class relies heavily on lecture, and the assigned textbook is used only for homework. Normally, my method is to take minimal notes and focus on the lecture intently, and then I can use the book as a resource for anything I might have missed. But what do I do when there is no resource? I've tried taking strong notes in class, but I miss 98% of the lecture and just end up reading my notes.",
        "created_utc": 1674075595,
        "upvote_ratio": 1.0
    },
    {
        "title": "Anyone know a list of books to self teach math?",
        "author": "AvailableUsertag",
        "url": "https://www.reddit.com/r/math/comments/10fhuw8/anyone_know_a_list_of_books_to_self_teach_math/",
        "text": "[removed]",
        "created_utc": 1674073911,
        "upvote_ratio": 1.0
    },
    {
        "title": "Math is Myth!",
        "author": "Huncko",
        "url": "https://youtube.com/watch?v=WJcxrYBAvm4&amp;feature=share",
        "text": "",
        "created_utc": 1674073744,
        "upvote_ratio": 1.0
    },
    {
        "title": "Question about implication operator",
        "author": "Pawn-to-D4",
        "url": "https://www.reddit.com/r/math/comments/10fhp9t/question_about_implication_operator/",
        "text": "Suppose I have propositions *p*, *q*, and a statement *p -&gt; q*.\n\nI can get the following results\n\n1. p is true, q is true, so p -&gt; q is true\n\n2. p is true, q is false, so p -&gt; q is false\n\n3. p is false, q is true, so p -&gt; q is true\n\n4. p is false, q is false, so p -&gt; q is true\n\nMy question is with conclusion (3). While I understand p -&gt; q is not necessarily false, I don’t see how p -&gt; q can be definitively true.",
        "created_utc": 1674073547,
        "upvote_ratio": 1.0
    },
    {
        "title": "Just a In this article I prove that the zeta function",
        "author": "LowPerspective4975",
        "url": "https://www.reddit.com/r/math/comments/10fhgvo/just_a_in_this_article_i_prove_that_the_zeta/",
        "text": "[removed]",
        "created_utc": 1674072986,
        "upvote_ratio": 1.0
    },
    {
        "title": "In this article I prove that the zeta function admits non-trivial zeros outside the critical line, could you help me verify the proofs?",
        "author": "LowPerspective4975",
        "url": "https://www.reddit.com/r/math/comments/10fhft3/in_this_article_i_prove_that_the_zeta_function/",
        "text": "[removed]",
        "created_utc": 1674072913,
        "upvote_ratio": 1.0
    },
    {
        "title": "I need help with a statistics problem!",
        "author": "Old_Construction_475",
        "url": "https://www.reddit.com/r/math/comments/10fh9rg/i_need_help_with_a_statistics_problem/",
        "text": "[removed]",
        "created_utc": 1674072515,
        "upvote_ratio": 1.0
    },
    {
        "title": "Roots?",
        "author": "fri3dpotato",
        "url": "https://www.reddit.com/r/math/comments/10fgzmo/roots/",
        "text": "My math text says that “every polynomial equation with a degree greater than zero has at least one root in the set of complex numbers”. It’s making me wonder about horizontal lines..they are functions with “no solutions”. Do horizontal lines have complex solutions?! Please help!",
        "created_utc": 1674071852,
        "upvote_ratio": 1.0
    },
    {
        "title": "Unit vector formula",
        "author": "MysteriousHawk2480",
        "url": "https://i.redd.it/mo8kqo12fwca1.jpg",
        "text": "",
        "created_utc": 1674071832,
        "upvote_ratio": 1.0
    },
    {
        "title": "Adding complex valued random variables",
        "author": "NickoB98",
        "url": "https://www.reddit.com/r/math/comments/10fgye1/adding_complex_valued_random_variables/",
        "text": "Hi, I have a problem, I‘m struggling a little bit with. Maybe it‘s more than one problem.\n\nI‘ve got two complex valued random variables n and i.\n\nn is circular symmetric zero mean gaussian distributed with some standard deviation σ_n:\n\nn = n‘ + j n‘‘ with n‘,n‘‘ ~ N(0,σ_n^2)\n\ni is with some probability r also circular symmetric zero mean gaussian distributed with some standard deviation σ_i and with probability (1-r) it is zero.\n\nNow, I need the probability density function of s = n+I\n\nI solved this for the real valued case, but I don’t even have a clue, where to start. How do I formally write down the distribution of r (since r‘ and r‘‘ aren‘t independent) and how do I get the probability density function of added complex valued random values?",
        "created_utc": 1674071768,
        "upvote_ratio": 1.0
    },
    {
        "title": "Confusion with converting.",
        "author": "jpdelta6",
        "url": "https://www.reddit.com/r/math/comments/10fgior/confusion_with_converting/",
        "text": "So I've never understood how to convert equations, and it's only gotten worse as I got older cause anytime I ask for help understanding I'm ridiculed for not knowing. Well, I've started a physics class today and immediately realize I'm fucked if I don't understand this. The first problem I've gotten makes little sense to me.\n\n“Bottle of peanut oil in your kitchen says: 709 cm^3. Weighed on the scale it is 680 g. When the bottle is emptied bottle weighs 58 g. (so the oil itself weighs 622 g, easy). What is the mass in kilograms of a gallon of peanut oil?”\n\nSo I understand that the oil is 622 g, but my teaching assistant ignored us saying we wanted to try it on our own first so he ended up confusing me more.\n\nApparently, 709 cm^3 is over 622 g (709 cm^3/622 g). First, I don't understand why centimeters cubed goes on top and grams on the bottom.\n\nSecondly, I don't understand where to start from here. Like I said I've never been taught conversion and out of embarrassment never asked. I would assume I start by 709/622 * 1 kg/1000 g but from there, if that's correct, I'm not sure where to go.\n\nI'm not looking for the answer, I know the answer cause the teacher gave it, I'm looking to learn how to do conversions like this consistently each time I get it. Cause I have a feeling they will be common.",
        "created_utc": 1674070737,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is it possible to find the exact value of any trig function and their inverse?",
        "author": "Patman1O1x",
        "url": "https://www.reddit.com/r/math/comments/10fghf4/is_it_possible_to_find_the_exact_value_of_any/",
        "text": "",
        "created_utc": 1674070657,
        "upvote_ratio": 1.0
    },
    {
        "title": "Question about Circles and Area",
        "author": "EnigmaticIdiot1273",
        "url": "https://www.reddit.com/r/math/comments/10fgdvv/question_about_circles_and_area/",
        "text": "[removed]",
        "created_utc": 1674070427,
        "upvote_ratio": 1.0
    },
    {
        "title": "Always felt dumb when I didn’t know hat notation. Just learned it!",
        "author": "MysteriousHawk2480",
        "url": "https://i.redd.it/xwy36skx8wca1.jpg",
        "text": "",
        "created_utc": 1674069773,
        "upvote_ratio": 1.0
    },
    {
        "title": "Some new properties of the zeta function on the critical line",
        "author": "LowPerspective4975",
        "url": "https://www.researchgate.net/publication/367240704_PROPERTIES_OF_THE_RIEMANN_ZETA_FUNCTION_IN_THE_CRITICAL_RANGE",
        "text": "",
        "created_utc": 1674069463,
        "upvote_ratio": 1.0
    },
    {
        "title": "Finally, a Fast Algorithm for Shortest Paths on Negative Graphs | Quanta Magazine",
        "author": "Marha01",
        "url": "https://www.quantamagazine.org/finally-a-fast-algorithm-for-shortest-paths-on-negative-graphs-20230118/",
        "text": "",
        "created_utc": 1674069382,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do you show your work? Especially during an exam.",
        "author": "TheWinterBee",
        "url": "https://www.reddit.com/r/math/comments/10ffnj1/how_do_you_show_your_work_especially_during_an/",
        "text": "[removed]",
        "created_utc": 1674068686,
        "upvote_ratio": 1.0
    },
    {
        "title": "What’s the most complicated differential equation we have an analytic solution for?",
        "author": "Lunar_Serpent",
        "url": "https://www.reddit.com/r/math/comments/10ffncx/whats_the_most_complicated_differential_equation/",
        "text": "",
        "created_utc": 1674068674,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is there any way to name the number in the Archimedes cattle problem?",
        "author": "Baspooka",
        "url": "https://www.reddit.com/r/math/comments/10ffl86/is_there_any_way_to_name_the_number_in_the/",
        "text": "https://en.m.wikipedia.org/wiki/Archimedes%27s_cattle_problem\n\nWiki article for those unaware\n\nThe solution is 7.76 x 10^206,544\n \nI know this is a stupidly large number, but it also got me thinking that there aren't a lot of names I could find for numbers that are super big (eg, centillion) and numbers that are impossibly big (googolplex), the stupidly large numbers like 10^100,000. I couldn't even figure out what the naming schemes would be. \n\nThe names of numbers has always been something that really intrigued me, so any input would be appreciated",
        "created_utc": 1674068526,
        "upvote_ratio": 1.0
    },
    {
        "title": "Someone help me with these questions. Thank you",
        "author": "Cool-Natural-6854",
        "url": "https://www.reddit.com/gallery/10feveu",
        "text": "",
        "created_utc": 1674066867,
        "upvote_ratio": 1.0
    },
    {
        "title": "What cuts would i have to make to cover this entire trailer roof with the least material wasted.",
        "author": "LocalStunt",
        "url": "https://www.reddit.com/gallery/10felsg",
        "text": "",
        "created_utc": 1674066254,
        "upvote_ratio": 1.0
    },
    {
        "title": "What cuts would i make to cover this trailer roof with the least amount of sheets.",
        "author": "LocalStunt",
        "url": "https://i.redd.it/sbrlzt2oxvca1.jpg",
        "text": "",
        "created_utc": 1674065984,
        "upvote_ratio": 1.0
    },
    {
        "title": "if I put $40 worth of quarters into a coinstar machine and it took ¢10 off each dollar, how much money would I have?",
        "author": "Stfkr",
        "url": "https://www.reddit.com/r/math/comments/10fecew/if_i_put_40_worth_of_quarters_into_a_coinstar/",
        "text": "Not a homework question I'm just trying to figure out how much money I'll get when I go to the coinstar",
        "created_utc": 1674065659,
        "upvote_ratio": 1.0
    },
    {
        "title": "[question] Can you create an amogus with cuadratic function?",
        "author": "wigetino2",
        "url": "https://www.reddit.com/r/math/comments/10fe7nq/question_can_you_create_an_amogus_with_cuadratic/",
        "text": "Like, can you make an amogus with parables and other graphic stuff?",
        "created_utc": 1674065359,
        "upvote_ratio": 1.0
    },
    {
        "title": "Looking for an internship when studying maths (Experiences)",
        "author": "Whathehell24",
        "url": "https://www.reddit.com/r/math/comments/10fci0k/looking_for_an_internship_when_studying_maths/",
        "text": "[removed]",
        "created_utc": 1674061412,
        "upvote_ratio": 1.0
    },
    {
        "title": "Removal of a question",
        "author": "schtruklyn",
        "url": "https://www.reddit.com/r/math/comments/10fcfeu/removal_of_a_question/",
        "text": "[removed]",
        "created_utc": 1674061244,
        "upvote_ratio": 1.0
    },
    {
        "title": "Quick Questions: January 18, 2023",
        "author": "inherentlyawesome",
        "url": "https://www.reddit.com/r/math/comments/10fceif/quick_questions_january_18_2023/",
        "text": "This recurring thread will be for questions that might not warrant their own thread. We would like to see more conceptual-based questions posted in this thread, rather than \"what is the answer to this problem?\". For example, here are some kinds of questions that we'd like to see in this thread:\n\n* Can someone explain the concept of maпifolds to me?\n* What are the applications of Represeпtation Theory?\n* What's a good starter book for Numerical Aпalysis?\n* What can I do to prepare for college/grad school/getting a job?\n\nIncluding a brief description of your mathematical background and the context for your question can help others give you an appropriate answer. For example consider which subject your question is related to, or the things you already know or have tried.",
        "created_utc": 1674061211,
        "upvote_ratio": 1.0
    },
    {
        "title": "If you ask people on the street random number from 1 to 10",
        "author": "sumekenov",
        "url": "https://www.reddit.com/r/math/comments/10fbr3z/if_you_ask_people_on_the_street_random_number/",
        "text": "So, the title. The question is then what will be the distribution of responses? Uniform, normal, or Zipf-like distribution? What is your opinion and why?",
        "created_utc": 1674059658,
        "upvote_ratio": 1.0
    },
    {
        "title": "Please. I need help with this Integral (I copied it from Wolfram and am totally lost)",
        "author": "Ludwig-D",
        "url": "https://imgur.com/a/DCYXF1W/",
        "text": "",
        "created_utc": 1674056509,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can anyone solve this problem?",
        "author": "Illustrious_News4091",
        "url": "https://i.redd.it/9t33xif24vca1.jpg",
        "text": "",
        "created_utc": 1674056033,
        "upvote_ratio": 1.0
    },
    {
        "title": "Probability question for the game Craps.",
        "author": "A_curious_fish",
        "url": "https://www.reddit.com/r/math/comments/10f9qhk/probability_question_for_the_game_craps/",
        "text": "[removed]",
        "created_utc": 1674054795,
        "upvote_ratio": 1.0
    }
]