[
    {
        "title": "Why is ℤ more important than ℚ+?",
        "author": "CHINESEBOTTROLL",
        "url": "https://www.reddit.com/r/math/comments/10wf2mo/why_is_ℤ_more_important_than_ℚ/",
        "text": "The most fundamental set of numbers is arguably the set of counting numbers ℕ+ = {1,2,3,...}. We can extent this set in various ways. The standard seems to be   ℕ  ⊂  ℤ ⊂ ℚ ⊂ ℝ ⊂ ℂ (at least this is what i learned in school). Each of these has a mathematical concept based on it (ring, field, completeness, algebraic closure). I was wondering why the set of ratios ℚ+ never seems to play any role. Just like we get ℤ from ℕ+ by introducing additive inverses we get ℚ+ by introducing multiplicative inverses. And ratios are much older than negative numbers or 0.\n\n(i was able to fnd the german \"Halbkörper\" - half field, which describes the kind of object that ℚ+ is. so maybe a better question would be: why are rings more important than semi fields?)",
        "created_utc": 1675808540,
        "upvote_ratio": 1.0
    },
    {
        "title": "Choosing a PhD program",
        "author": "eqn6",
        "url": "https://www.reddit.com/r/math/comments/10weqlz/choosing_a_phd_program/",
        "text": "I'm currently going through the admissions process with grad programs, and would really like advice if anyone has the time. There's three schools that have been interested in me so far:\n\nSchool A has fully admitted me to their program and graduate school with a TA position with full funding. This was a top 3 choice for me.\n\nSchool B sent an email saying that I seem like a good fit for their program and would like me to visit their campus in a few weeks. Not a formal acceptance, but sounds like one might be coming. This was originally my top choice school.\n\nSchool C reached out and said they will be sending a formal acceptance letter this week. Their program seems well structured and the faculty member I met was very friendly.\n\nOn paper, school C is the highest ranked of the three, followed by A, and then closely B. However, based on location preferences I'm strongly leaning away from C since it's on the opposite side of the country and I'd prefer to stay within driving distance of my parents, which is possible with both A and B.\n\nSince looking more into A, I believe that they are the best fit overall, and my recommendation letter writers basically said that all three are great choices and I couldn't go wrong with any of them. I'm a bit worried about fully commiting before visiting though. I'd like to at least see both B and A before deciding. \n\nI'm still not \"officially\" admitted to B, so I'm worried about turning down C right away. Is this unfair? I'd hate for someone else to miss a spot at C because I was waiting to hear back from B.\n\nI'm honestly starting to get stressed by this decision. My gut feeling is that A is the school for me, but its hard to fully commit to that before I've visited the campus or even seen B / C either. Sorry for the long rant-y post, I appreciate any input you all have :)",
        "created_utc": 1675807751,
        "upvote_ratio": 1.0
    },
    {
        "title": "Proof that 10 + 9 = 21",
        "author": "CookieSY1337",
        "url": "https://www.reddit.com/r/math/comments/10wemgd/proof_that_10_9_21/",
        "text": "[removed]",
        "created_utc": 1675807477,
        "upvote_ratio": 1.0
    },
    {
        "title": "Jim Al-Khalili talks to Mathematician Adrian Smith, Pres of the Royal Society and CE of the Alan Turing Institute about his efforts to convince statisticians of the merits of the now widely used Bayesian approach. As a civil servant he managed to keep funding for science as the coalition made cuts.",
        "author": "whatatwit",
        "url": "https://www.bbc.co.uk/programmes/m001hwwl",
        "text": "",
        "created_utc": 1675805674,
        "upvote_ratio": 1.0
    },
    {
        "title": "Help",
        "author": "mOBSCENE756",
        "url": "https://i.redd.it/etg6tahslvga1.jpg",
        "text": "[removed]",
        "created_utc": 1675805382,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is there anyway to figure out the whole circumference with just knowing the length of a segment. Don’t know the radius either.",
        "author": "SomePoorAfricanChild",
        "url": "https://i.redd.it/2rpxar7r7vga1.jpg",
        "text": "",
        "created_utc": 1675800667,
        "upvote_ratio": 1.0
    },
    {
        "title": "Learning a foreign language vs Learning mathematics",
        "author": "Independent-Ad-7060",
        "url": "/r/languagelearning/comments/10wbedh/learning_a_foreign_language_vs_learning/",
        "text": "",
        "created_utc": 1675799910,
        "upvote_ratio": 1.0
    },
    {
        "title": "maths experts of reddit",
        "author": "Etched_Gloweringdawg",
        "url": "https://www.reddit.com/r/math/comments/10wb08a/maths_experts_of_reddit/",
        "text": "[removed]",
        "created_utc": 1675798934,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is your favorite Linear Algebra textbook?",
        "author": "RdHdRedemption",
        "url": "https://www.reddit.com/r/math/comments/10wb047/what_is_your_favorite_linear_algebra_textbook/",
        "text": "I have already taken the course and am wanting to keep one around for reference, any recommendations?",
        "created_utc": 1675798927,
        "upvote_ratio": 1.0
    },
    {
        "title": "Small problem",
        "author": "Pete-B-and-J",
        "url": "https://www.reddit.com/r/math/comments/10wanz8/small_problem/",
        "text": "[removed]",
        "created_utc": 1675798113,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is there a database for the values of τ(n) ?",
        "author": "Cheezynton",
        "url": "https://www.reddit.com/r/math/comments/10w9dfx/is_there_a_database_for_the_values_of_τn/",
        "text": "I'm doing research for my bachelors thesis in number theory.  τ(n) here is the amount of positive divisors of n. Has anyone already done the work for calculating it for large values of n? 10e9 and larger? My math education isn't in english so i'm having a little trouble searching.",
        "created_utc": 1675795030,
        "upvote_ratio": 1.0
    },
    {
        "title": "MATH WHY",
        "author": "AbstractFunYT",
        "url": "https://www.reddit.com/r/math/comments/10w92rl/math_why/",
        "text": "[removed]",
        "created_utc": 1675794344,
        "upvote_ratio": 1.0
    },
    {
        "title": "About Vertices. Anyone know what kind of vertice this is ?",
        "author": "Ninjastarrr",
        "url": "https://i.redd.it/b0c7i4mp5tga1.png",
        "text": "",
        "created_utc": 1675793784,
        "upvote_ratio": 1.0
    },
    {
        "title": "What are some textbooks that gives a general overview of all the branches of mathematics?",
        "author": "eudueueeuu",
        "url": "https://www.reddit.com/r/math/comments/10w8qxo/what_are_some_textbooks_that_gives_a_general/",
        "text": "[removed]",
        "created_utc": 1675793578,
        "upvote_ratio": 1.0
    },
    {
        "title": "What are methods to counter careless mistakes?",
        "author": "oopsouchyikes",
        "url": "https://www.reddit.com/r/math/comments/10w8blm/what_are_methods_to_counter_careless_mistakes/",
        "text": "[removed]",
        "created_utc": 1675792601,
        "upvote_ratio": 1.0
    },
    {
        "title": "MandelBrot Toy",
        "author": "annullator",
        "url": "https://www.reddit.com/r/math/comments/10w7rm7/mandelbrot_toy/",
        "text": "Hi! I made a little toy for zooming into the Mandelbrot set:\n\n [Web Mandel - Web Mandel](https://webmandel.azurewebsites.net/) \n\nuse the mouse to select a rectangle in the image to zoom into the set. If you want to save an image, rightclick -&gt; Save Image As... should work.\n\nAlso try increasing the number of iterations and the New Colors button!",
        "created_utc": 1675791285,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can anyone solve this problem please?",
        "author": "udubhai",
        "url": "https://i.redd.it/rv494fdafuga1.jpg",
        "text": "",
        "created_utc": 1675791090,
        "upvote_ratio": 1.0
    },
    {
        "title": "Evaluating Solvability",
        "author": "RicardoDecardi",
        "url": "https://www.reddit.com/r/math/comments/10w7f5x/evaluating_solvability/",
        "text": "I recently started playing a little arithmetic game called 4=10. \n\nIn each level of the game you're given four single digit numbers and have to arrange them using only basic arithmetic and at most one set of parentheses so that the resulting formula equals ten. \n\nFor example if the level is: 2 6 8 5. The solution could be: 8 + 2 x (6 - 5) \n\nThe game itself has five hundred levels, and that got me wondering if that's every solvable set of four digits. Digits can repeat.\n\nI know that there would be 10,000 permutations, but a lot of those would just be the same digits in a different order, and there's probably a lot of sets that are unsolvable. \n\nHow would you go about figuring out how many levels are possible?",
        "created_utc": 1675790494,
        "upvote_ratio": 1.0
    },
    {
        "title": "0&lt;1? philosophy",
        "author": "zerofatal1",
        "url": "https://www.reddit.com/r/math/comments/10w78s7/01_philosophy/",
        "text": "[removed]",
        "created_utc": 1675790094,
        "upvote_ratio": 1.0
    },
    {
        "title": "Attempt to create a most intuitive Leibniz notation",
        "author": "Ihsiasih",
        "url": "https://www.reddit.com/r/math/comments/10w6hzy/attempt_to_create_a_most_intuitive_leibniz/",
        "text": "I've always found the following standard textbook statement of the chain rule to be very unsatisfying. The typical statement is something like this one from Stewart's calculus:\n\n&gt;If y = f(u) and u = g(x) are differentiable functions, then dy/dx = dy/du du/dx.\n\nThe main problem with this statement is that notation such as \"y = f(u)\" and \"u = g(x)\" rely on the notion of what I like to call \"functions with preferred letters\". One has to know that the preferred letter of y is u and that the preferred letter of u is x so that they can infer that it is possible for y to be interpreted as a function of x.\n\nAs we'll see below, there is quite a lot of setup required to interpret the above in the correct way. **I'm hoping that someone might have a less complicated, requiring less setup, that allows us to write the chain rule in the way we want to.**\n\n**Defn 1.** (Functions with preferred letters). A *function with a preferred letter* is a tuple (f,  𝜆), where f is a function and  𝜆 is a letter of the Roman alphabet {a, b, c, ..., x, y, z}. Informally, we say  \"f is a function with preferred letter  𝜆\" to mean \"(f,  𝜆) is a function with a preferred letter\".\n\n**Defn 2.1.** (The notation f\\_𝜇). Given a function f with preferred letter 𝜆, we will think of f\\_𝜇, where 𝜇 is some other letter of the Roman alphabet, as representing the function that maps the quantity represented by  𝜇 to the quantity represented by f.\n\nFor example, consider a particle that moves in one dimension with displacement x, velocity v, and where the elapsed time is denoted t. Then\n\n* v\\_x maps displacement to velocity\n* x\\_t maps time to displacement\n* v\\_t = v\\_x  ∘ x\\_t maps time to velocity.\n\nThis motivates the following notation.\n\n**Defn 2.2.** (The notation f\\_𝜇).\n\nFor a function f with preferred letter  𝜆 define f\\_𝜇 := f\\_𝜆  ∘ 𝜆\\_𝜇. \n\nOne would expect that 𝜆\\_𝜆 is the identity for all 𝜆, so we see that when 𝜇 = 𝜆 the definition reduces to f\\_𝜇 = f\\_𝜆, as it should.\n\n**Defn 2.3.** (The notation f\\_𝜇).\n\nFor any 𝜆 it is possible there exists a 𝜈 for which (𝜆, 𝜈) is a function with preferred letter. When this is the case, we can consider functions of the form 𝜆\\_𝜌. In this sense, preferred letters can be functions.\n\nIf there does not exist such a 𝜈, then we say 𝜆 *represents an independent variable*.\n\n**Defn 3.** (Omissions of 𝜇).\n\nLastly, given a function f with preferred letter 𝜆, we define some abuses of notation that allow us to omit the subscript on f:\n\n* df/d𝜇 := df\\_𝜇/d𝜇\n* If f does not appear as the argument of a derivative, then f := f\\_𝜆\n\n**Defn 4.** (Preferred letters of derivatives). For any function f with preferred letter 𝜆, the preferred letter of df/d𝜇 is defined to be 𝜇.\n\n**Defn 5.** (Coercion to the lowest common preferred letter).\n\nIf f is a function with preferred letter 𝜆, g is a function with preferred letter 𝜇, and the preferred letter of 𝜇 is 𝜆, then we interpret f + g to mean f\\_𝜆 + g\\_𝜆 and fg to mean f\\_𝜆 g\\_𝜆.\n\n**The revised chain rule.**\n\nWith all of this setup, the chain rule can now be stated as:\n\n&gt;If y and u are differentiable functions with preferred letters u and x, respectively, then dy/dx = dy\\_x/dx = d(y\\_u ∘ u\\_x)/dx = dy/du du/dx.\n\nPersonally I prefer to use f and g to state the chain rule:\n\n&gt;If g and f are differentiable functions with preferred letters f and x, respectively, then dg/df = dg\\_x/dx = d(g\\_f ∘ f\\_x)/dx = dg/df df/dx.",
        "created_utc": 1675788342,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to implement point halving for elliptic curve over finite field in sagemath?",
        "author": "stlcvshouhq",
        "url": "https://www.reddit.com/r/math/comments/10w6f3v/how_to_implement_point_halving_for_elliptic_curve/",
        "text": "[removed]",
        "created_utc": 1675788148,
        "upvote_ratio": 1.0
    },
    {
        "title": "wolfram alpha says distributive property is false?",
        "author": "VainVeinyVane",
        "url": "https://www.reddit.com/r/math/comments/10w6b6q/wolfram_alpha_says_distributive_property_is_false/",
        "text": "Was doing some physics using Wolfram Alpha. Tried a(b+c) === a(b) + ac in wolfram alpha. Got a false result. Can anybody explain why wolfram alpha is telling me that distributive property is false?",
        "created_utc": 1675787885,
        "upvote_ratio": 1.0
    },
    {
        "title": "Ideas for math project regarding plotting planetary motion using trigonometric functions?",
        "author": "John_spark",
        "url": "https://www.reddit.com/r/math/comments/10w5x07/ideas_for_math_project_regarding_plotting/",
        "text": "we have this school project for trig functions and so far I've used data of the ISS orbit to write sine equations for its motion in the x, y, and z plane. I was wondering if you guys had any ideas to further this and how I would do it if I was trying to plot the distance between two celestial bodies orbiting around each other on a graph.",
        "created_utc": 1675786929,
        "upvote_ratio": 1.0
    },
    {
        "title": "You are very very dead",
        "author": "diam-doitallmatt",
        "url": "https://i.redd.it/74vm0n121uga1.jpg",
        "text": "",
        "created_utc": 1675786304,
        "upvote_ratio": 1.0
    },
    {
        "title": "What are some good textbooks on analysis that cover both real analysis and complex analysis for beginners?",
        "author": "eudueueeuu",
        "url": "https://www.reddit.com/r/math/comments/10w5dhr/what_are_some_good_textbooks_on_analysis_that/",
        "text": "[removed]",
        "created_utc": 1675785617,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is this limit correct?",
        "author": "More-Presentation-43",
        "url": "https://www.reddit.com/r/math/comments/10w54r1/is_this_limit_correct/",
        "text": "&amp;#x200B;\n\n[If not can someone give a counter-example disproving this?](https://preview.redd.it/18sc66wifsga1.png?width=812&amp;format=png&amp;auto=webp&amp;v=enabled&amp;s=2475a8d525e75b0c59dbd1bb300c6ef578b8f120)",
        "created_utc": 1675785034,
        "upvote_ratio": 1.0
    },
    {
        "title": "Congratulations to Ingrid Daubechies, 2023 Wolf Prize laureate in Mathematics!",
        "author": "Nunki08",
        "url": "https://twitter.com/WolfPrize_/status/1622979503151542277",
        "text": "",
        "created_utc": 1675784826,
        "upvote_ratio": 1.0
    },
    {
        "title": "https://twitter.com/WolfPrize_/status/1622979503151542277",
        "author": "[deleted]",
        "url": "",
        "text": "[deleted]",
        "created_utc": 1675784797,
        "upvote_ratio": 1.0
    },
    {
        "title": "Find from the first principle of derivatives 3√3x+5",
        "author": "Atticus-Master",
        "url": "https://www.reddit.com/r/math/comments/10w4zad/find_from_the_first_principle_of_derivatives_33x5/",
        "text": "[removed]",
        "created_utc": 1675784649,
        "upvote_ratio": 1.0
    },
    {
        "title": "Guidebook for Getting Back into Math",
        "author": "Daybyday182225",
        "url": "https://www.reddit.com/r/math/comments/10w4lv0/guidebook_for_getting_back_into_math/",
        "text": "To be put shortly: \n\nMy brother has been thinking about going back to college, for either electrical engineering or some kind of business administration (he works in an electrical construction company, and his bosses want him to move up). Whatever he does, he'll probably need calculus at some point, but he's been away from school for a long time. I want to support him, so I was thinking about getting him a book on math to get him \"up to speed.\" \n\nAny recommendations?",
        "created_utc": 1675783726,
        "upvote_ratio": 1.0
    },
    {
        "title": "Trying to calculate battle odds for Levy&amp;Campaing series of games",
        "author": "jason-jo",
        "url": "https://www.reddit.com/r/math/comments/10w48nk/trying_to_calculate_battle_odds_for_levycampaing/",
        "text": "I am trying to calculate odds for the Levy &amp; Campaign series of board games. There are 3 currently published versions but the battles work the same. For this question we will only consider 1v1 battles.\n\nI posted the initial version of this on /r/askmath but no one answered.\n\n**Relevant Game Rules**\n\nSo the way such a battle works is, there are 3 phases: archery, horse and melee (foot). Defenders hit first in each phase, then attackers. The way the hits are done is you count up every unit which can contribute to that phase (e.g. for most of the series there are no archery without special capability cards that give other units archery as well). These hits may have to pass through something, depending on where the battle takes place (e.g. if you storm a castle then you have to do a roll to see what hits get through the \"walls\"). Finally, once the number of hits are known, the player receiving the hits determines which of his unit will absorb the hit, one at a time and rolls against that units defence. If the roll is defence or lower the hit is \"absorbed\" and has no effect. If it's greater than defence then the unit routes and is out of the battle.\n\nWhen all 3 phases are complete they start again from the top until one side gives up or is eliminated. There are scenarios, though, where the number of \"rounds\" (i.e. the 3 phases) are limited to 1-4 max (therefor in some cases we would only need to calculate odds for 1 single round).\n\n**Example Scenario Background**\n\nSo, for the test scenario the defenders have 2 Knights and 1 Seargant and 4 Men-at-arms. Normally a Knight would have 4 defence and the others 3, but the defender has a card which gives the other ones 4 as well. The attacker has have 2 light horse and 6 militia and a special ability that turns them all into archers, contributing half a hit rounded up. So this means the defender has no archery so the attacker contributes 4 hits. The defender must absorb these and then we will go to the horse phase where they start: the knights contribute 2 hits each and the Sergeant 1, so 5, then the defenders contribute 1/2 per light horse so 1 hit, then the defender 4 Men-at-arms contribute 1 each, so 4. Finally the 6 militia contribute 1/2 each so 3.\n\nThe key is, though, that if you lose your units before they can attack they won't actually be contributing here. Hence the math question which I don't know how to calculate.\n\n**The math question**\n\nSo the initial attack is 4 dice to roll which eliminate a unit on 5 or 6. So that means each roll is 2/6 or 1/3 to succeed. Of the 8 possible hits from the defender, only a max of 4 of them could have been eliminated. So the chance that one of them is eliminated is 1/3, the second one would be 1/3\\^2 third 1/3\\^3, fourth 1/3\\^4 and the rest 0. So trying to work through this I get:\n\nAttacker (archery) - 4 hits: (each) 1/3 to hit\n\nDefender (horse) - 6 hits: (base) 5/6 to hit (see note 1 below)\n\n1. 5/6 \\* 2/3 = 10/18 = 5/9 (\\~55%) to hit\n2. 5/6 \\* (1-1/3\\^2 = 8/9) = 40/54 = 20/27 (\\~74%) to hit (I switched to this because everything else I tried made this number smaller when it should be growing, i.e. becoming more likely)\n3. 5/6 \\* (1-1/3\\^3 = 26/27) = 130/162 = 65/81 (\\~80%) to hit\n4. 5/6 \\* (1-1/3\\^4 = 80/81) = 400/486 = 200/243 (\\~82%) to hit\n\nrest: 5/6 (\\~83%) to hit\n\nAttacker (horse) - 2 hits: (base) 1/3 to hit\n\nNow I'm really stuck at this point. There are 6 hits incoming with the percentages shown above, how likely is it that these even survived? I guess I could pick the unit most likely to absorb the hit (i.e. the one with best defence) and keep applying to hit percentage there which will reduce the likelihood of it being eliminated before firing, etc.\n\nNote 1: to make things more complicated, the Attacker horse actually have 1 defence on one but 3 on the other, meaning those odds are not 5/6 above but somehow 1/2 and 5/6 with the 1/2 getting less likely with every roll.\n\nNote  2: I realised that in the calculations above where I say \"to hit\" I actually mean \"to eliminate\"",
        "created_utc": 1675782817,
        "upvote_ratio": 1.0
    },
    {
        "title": "Any tips/sources for professionalizing your math writing?",
        "author": "Parking_Antelope8865",
        "url": "https://www.reddit.com/r/math/comments/10w2id1/any_tipssources_for_professionalizing_your_math/",
        "text": "As a PhD student, I am trying to make my math writing more professional. Not only for writing papers in the future, but also for homeworks and progress reports. Here are a couple hard rules that I already know:\n\n1) Never start a sentence with a math symbol.\n\n2) Even in the \\\\begin{equation} environment, math symbols are part of a sentence. So you should consider ending them with a period or comma, even in the \\\\begin{equation} environment.\n\nThere are also some conventions people follow, such as giving all definitions at the start of a paragraph, never in the middle.\n\nWhat are some hard rules or good conventions to follow?",
        "created_utc": 1675778382,
        "upvote_ratio": 1.0
    },
    {
        "title": "Any recommended books?",
        "author": "Mark__27",
        "url": "https://www.reddit.com/r/math/comments/10w22j1/any_recommended_books/",
        "text": "While I'm pretty good at actually doing maths, I'd like to read up on something that goes through the history and the intuitive side of it, as I feel like that's something I never really got to look into, would you guys have any recommendations for me?",
        "created_utc": 1675777205,
        "upvote_ratio": 1.0
    },
    {
        "title": "The Pi/Gamma Function",
        "author": "Galactic_7092",
        "url": "https://www.reddit.com/r/math/comments/10w0n7n/the_pigamma_function/",
        "text": "[removed]",
        "created_utc": 1675773059,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does anyone mind?",
        "author": "MiriTheCheesePuff",
        "url": "https://www.reddit.com/r/math/comments/10vzjpq/does_anyone_mind/",
        "text": "Hi. I'm currently in the process of getting my ged by may first, does anyone here mind helping me understand some math? I was taken out of school in second grade, and I've been working so hard to gain the knowledge and working with someone will help so much, we can phone call or video call. Dm me! ( please be platonic )",
        "created_utc": 1675769227,
        "upvote_ratio": 1.0
    },
    {
        "title": "can anyone differentiate this",
        "author": "Responsible-Oil5028",
        "url": "https://www.reddit.com/r/math/comments/10vzg9v/can_anyone_differentiate_this/",
        "text": "ycos(xy)",
        "created_utc": 1675768870,
        "upvote_ratio": 1.0
    },
    {
        "title": "what's the value of x1 and x2?",
        "author": "algrm",
        "url": "https://i.redd.it/faq1f59zcsga1.jpg",
        "text": "",
        "created_utc": 1675766102,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do I do this question?",
        "author": "Elitecastle8824",
        "url": "https://i.redd.it/pf7cdvee9sga1.png",
        "text": "",
        "created_utc": 1675764898,
        "upvote_ratio": 1.0
    },
    {
        "title": "I found this random exercise. Now I can't sleep without knowing the answer. Anyways this number is divisible by 36. Find this number",
        "author": "Bednozy",
        "url": "https://i.redd.it/r77bx2tn5sga1.jpg",
        "text": "",
        "created_utc": 1675763638,
        "upvote_ratio": 1.0
    },
    {
        "title": "Trying to start a math YT channel, any advice?",
        "author": "No-Map4711",
        "url": "https://youtu.be/vLsq_8NTVDg",
        "text": "",
        "created_utc": 1675759512,
        "upvote_ratio": 1.0
    },
    {
        "title": "Trying to get a math youtube channel started",
        "author": "LowAshamed2694",
        "url": "https://www.reddit.com/r/math/comments/10vx07p/trying_to_get_a_math_youtube_channel_started/",
        "text": "[removed]",
        "created_utc": 1675759303,
        "upvote_ratio": 1.0
    },
    {
        "title": "Just started learning probability and basic combinatorics, and it is not as intuitive as I'd previously thought!",
        "author": "BleachedPink",
        "url": "https://www.reddit.com/r/math/comments/10vut3v/just_started_learning_probability_and_basic/",
        "text": "I've been always curious about the probabilities overall and used my intuition to predict probabilities for fun, and it seems I'd been doing it wrong all the time!",
        "created_utc": 1675751125,
        "upvote_ratio": 1.0
    },
    {
        "title": "Are there any resources for finding curated lists of problems from textbooks?",
        "author": "CaptainBunderpants",
        "url": "https://www.reddit.com/r/math/comments/10vuir4/are_there_any_resources_for_finding_curated_lists/",
        "text": "Currently going through Rudin’s Functional Analysis and I’m not sure which exercises are worth focusing on over others. I don’t have time to do them all.",
        "created_utc": 1675750156,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to calculate how many times i will level up?",
        "author": "Jersuki",
        "url": "https://www.reddit.com/r/math/comments/10vu8r3/how_to_calculate_how_many_times_i_will_level_up/",
        "text": "So basically the rate required experience increases is 1.021596523 and x is current experience required for a levelup, while y is the ammount i will gain from a mob boss/mission. How do i know how many levels i will go up? What is the formula to calculate this.",
        "created_utc": 1675749276,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is the fast growing hierarchy for factorial",
        "author": "BlockOfDiamond",
        "url": "https://www.reddit.com/r/math/comments/10vslpu/what_is_the_fast_growing_hierarchy_for_factorial/",
        "text": "What is the largest ordinal for the fast growing hierarchy function attained by factorial? Probably not super high but who knows?",
        "created_utc": 1675744320,
        "upvote_ratio": 1.0
    },
    {
        "title": "how to calculate the most optimal dimension size?",
        "author": "Multiversal_Love",
        "url": "https://www.reddit.com/r/math/comments/10vs6cv/how_to_calculate_the_most_optimal_dimension_size/",
        "text": "[removed]",
        "created_utc": 1675743111,
        "upvote_ratio": 1.0
    },
    {
        "title": "Need help calculating average % change in values",
        "author": "mightyduck19",
        "url": "https://www.reddit.com/gallery/10vrqxx",
        "text": "",
        "created_utc": 1675741930,
        "upvote_ratio": 1.0
    },
    {
        "title": "Calc AB to multi variable/ lin alg",
        "author": "R_xal",
        "url": "https://www.reddit.com/r/math/comments/10vri9t/calc_ab_to_multi_variable_lin_alg/",
        "text": "I used to be gifted at math until my tutor made me hate it. I did terribly academically last year in Pre Calc Honors, this year I got myself together and found my love for math again (despite making the decision of AB instead of BC). Anyways, I aced the class with minimal effort, and taught myself what I forgot. Is it a bad idea to take multi variable calculus first semester and lin alg second semester of me senior year if I teach myself BC over the summer?",
        "created_utc": 1675741244,
        "upvote_ratio": 1.0
    },
    {
        "title": "Optimization problem",
        "author": "ignominieux",
        "url": "https://www.reddit.com/r/math/comments/10vrak3/optimization_problem/",
        "text": "So the problem starts off by saying I have a number that is the sum of two numbers and that those numbers can be either positive or negative, so n = x + y. It doesn't give me a constraint. Then it says to find the two numbers so that the sum of double the first number squared and the second number cubed would give a relative minimum value. \n\nSo I'm kind of at loss as to how exactly I proceed with this. I think I should try to calculate the minimum by taking the derivative of the second function and finding its zeros. But owing to the fact that I don't know the first value I'm really lost as to how to proceed. \n\nSorry if the problem isn't perfectly intelligible, I had to translate it from French.",
        "created_utc": 1675740645,
        "upvote_ratio": 1.0
    },
    {
        "title": "This is a serious post, please don’t remove it",
        "author": "obammala",
        "url": "https://www.reddit.com/r/math/comments/10vr3zm/this_is_a_serious_post_please_dont_remove_it/",
        "text": "I’m trying to start a discussion about math beyond the PhD level.\n\nThe future of maths beyond PhD\n\nThe most important thing they never taught you in math class was how to do mathematics itself. You heard me right. They forgot the most important part of math the math. Most students walk out of high school feeling like all math means is to shut up and calculate. And if you're smart, you'll know what to do with it.\n\n\nYou see, my friends, mathematicians do not sit around all day crunching numbers. We leave that to less creative individuals known as engineers. What it means to do pure math is not blindly follow rules created by somebody else. It means to create your own rules and be the architect of your own universe. Now, I am only partly joking about the engineers, but I don't want them confusing anyone.\n\n\nPure math is a wildly creative process. In fact, I would say it is one of the most creative things that a human being can do. Every mathematician has their own universe. There's Grassendique universes, von Neumann universes, Zermello Universes, and they each have their own rules. Once a mathematician has begun the architecture of a new universe, they put it up for a battle with another, like king of the Hill.\n\n\nAnd whichever's universe has the nicest structure wins. And then that universe's rules get taught in school. For those who are curious, the current leading universe is known as Zermelofrankel Set Theory. But there are many others that don't get taught. And that's because the Zermelofrankel Universe has verifiably the most nice structure that anyone has ever seen.\n\n\nBut this term nice structure is rather mysterious. It truly is what every mathematician is searching for. No one knows exactly what nice structure means, but it's something to do with having beautiful symmetries and an intricate completion which allows you to perform various operations in that allow the physicists to be happy, the engineers, and all the other wacky goofballs that use math for their own evil doing. And it breaks my heart that we're really only taught this one because people are left with the belief that there's only one right way to do math, when in reality, there is a whole multiverse of universes that never get taught. And even at the heart, some people pick up on this discrepancy, and they wonder, haven't you ever heard someone ask, what if other aliens had their own version of math?\n\n\nWell, guess what? We humans have thousands of versions of math, and you were never taught how to create your own version. So why don't they teach you? Well, it's no conspiracy. It's very simple.\n\n\nSee, if your teacher is, well, a teacher, then they have a degree first in teaching to be able to have the credentials to teach how to create your own math universe. They only begin teaching that after a PhD. So people can go whole degrees in mathematics without ever being taught that you're just following the rules that somebody else created, and you absolutely have the power to create your own rules. And see where they lead you. So then, yam, socks, you may ask will creating my own universe help me get a job?\n\n\nNo. Not even cloaks. But it will be so more satisfying than any job you could ever dream of. Till next time.",
        "created_utc": 1675740138,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can someone explain Stochastic Processes?",
        "author": "Total-Positive8231",
        "url": "https://www.reddit.com/r/math/comments/10vr14t/can_someone_explain_stochastic_processes/",
        "text": "[removed]",
        "created_utc": 1675739923,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does x-simple and x-regular mean the same thing?",
        "author": "Pomegranate6077",
        "url": "https://www.reddit.com/r/math/comments/10vqr40/does_xsimple_and_xregular_mean_the_same_thing/",
        "text": "[removed]",
        "created_utc": 1675739175,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to do steps to find the GCF and factor the GCF? I need help with the steps on how to do it due to my adhd it’s hard to do it in order.",
        "author": "Embarrassed_Cry_8605",
        "url": "https://i.redd.it/lzxc3gdx3qga1.jpg",
        "text": "",
        "created_utc": 1675738840,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to find GCF? I’m having a hard time doing it in order due to my adhd. Steps would be appreciated(college algebra)",
        "author": "Embarrassed_Cry_8605",
        "url": "https://i.redd.it/7pdhy7103qga1.jpg",
        "text": "",
        "created_utc": 1675738529,
        "upvote_ratio": 1.0
    },
    {
        "title": "Any Treaty on Orthogonal Polynomials and its application",
        "author": "wingsit",
        "url": "https://www.reddit.com/r/math/comments/10vq9xv/any_treaty_on_orthogonal_polynomials_and_its/",
        "text": "Over the years, I have encountered a few cool applications of orthogonal in signals processing, linear algebra, ODE, PDE, numerical analysis, etc. However the treatment of the orthogonal polynomial is not the first class citizen of the topic.\n\nIs there any book that cover different applications of orthogonal polynomial in various field/problem so I can further appreciate orthogonal polynomials?",
        "created_utc": 1675737889,
        "upvote_ratio": 1.0
    },
    {
        "title": "Looking for the 2007 MIT duel.",
        "author": "Advanced-Ticket9305",
        "url": "https://www.reddit.com/r/math/comments/10vpfr1/looking_for_the_2007_mit_duel/",
        "text": "[removed]",
        "created_utc": 1675735693,
        "upvote_ratio": 1.0
    },
    {
        "title": "What do I do with the 3x and the 8??",
        "author": "throwawaylva",
        "url": "https://i.redd.it/21zqr4k9ppga1.jpg",
        "text": "",
        "created_utc": 1675733910,
        "upvote_ratio": 1.0
    },
    {
        "title": "The future of maths beyond PhD",
        "author": "obammala",
        "url": "https://www.reddit.com/r/math/comments/10vnzl0/the_future_of_maths_beyond_phd/",
        "text": "Can someone explain to me what these math universes are? Do they have different rules so that 1+1 could = 3 etc…\n\n\nThe most important thing they never taught you in math class was how to do mathematics itself. You heard me right. They forgot the most important part of math the math. Most students walk out of high school feeling like all math means is to shut up and calculate. And if you're smart, you'll know what to do with it.\n\n\nYou see, my friends, mathematicians do not sit around all day crunching numbers. We leave that to less creative individuals known as engineers. What it means to do pure math is not blindly follow rules created by somebody else. It means to create your own rules and be the architect of your own universe. Now, I am only partly joking about the engineers, but I don't want them confusing anyone.\n\n\nPure math is a wildly creative process. In fact, I would say it is one of the most creative things that a human being can do. Every mathematician has their own universe. There's Grassendique universes, von Neumann universes, Zermello Universes, and they each have their own rules. Once a mathematician has begun the architecture of a new universe, they put it up for a battle with another, like king of the Hill.\n\n\nAnd whichever's universe has the nicest structure wins. And then that universe's rules get taught in school. For those who are curious, the current leading universe is known as Zermelofrankel Set Theory. But there are many others that don't get taught. And that's because the Zermelofrankel Universe has verifiably the most nice structure that anyone has ever seen.\n\n\nBut this term nice structure is rather mysterious. It truly is what every mathematician is searching for. No one knows exactly what nice structure means, but it's something to do with having beautiful symmetries and an intricate completion which allows you to perform various operations in that allow the physicists to be happy, the engineers, and all the other wacky goofballs that use math for their own evil doing. And it breaks my heart that we're really only taught this one because people are left with the belief that there's only one right way to do math, when in reality, there is a whole multiverse of universes that never get taught. And even at the heart, some people pick up on this discrepancy, and they wonder, haven't you ever heard someone ask, what if other aliens had their own version of math?\n\n\nWell, guess what? We humans have thousands of versions of math, and you were never taught how to create your own version. So why don't they teach you? Well, it's no conspiracy. It's very simple.\n\n\nSee, if your teacher is, well, a teacher, then they have a degree first in teaching to be able to have the credentials to teach how to create your own math universe. They only begin teaching that after a PhD. So people can go whole degrees in mathematics without ever being taught that you're just following the rules that somebody else created, and you absolutely have the power to create your own rules. And see where they lead you. So then, yam, socks, you may ask will creating my own universe help me get a job?\n\n\nNo. Not even cloaks. But it will be so more satisfying than any job you could ever dream of. Till next time.",
        "created_utc": 1675731912,
        "upvote_ratio": 1.0
    },
    {
        "title": "Collatz, 3n+1 solved?",
        "author": "Bert-Willem",
        "url": "https://www.reddit.com/r/math/comments/10vnokc/collatz_3n1_solved/",
        "text": "[removed]",
        "created_utc": 1675731112,
        "upvote_ratio": 1.0
    },
    {
        "title": "Understanding Math",
        "author": "Educational_Corner66",
        "url": "https://www.reddit.com/r/math/comments/10vnjvz/understanding_math/",
        "text": "[removed]",
        "created_utc": 1675730765,
        "upvote_ratio": 1.0
    },
    {
        "title": "What are the odds of what happened to my friend in Runescape?",
        "author": "Meekssss",
        "url": "https://www.reddit.com/r/math/comments/10vmiqc/what_are_the_odds_of_what_happened_to_my_friend/",
        "text": "He was going for an item with a 1/43 drop rate but didnt see it until 350 kills. What are the odds of him going so dry?",
        "created_utc": 1675728076,
        "upvote_ratio": 1.0
    },
    {
        "title": "please help",
        "author": "Tahaalsh",
        "url": "https://i.redd.it/dk0xu3ik0pga1.png",
        "text": "",
        "created_utc": 1675725614,
        "upvote_ratio": 1.0
    },
    {
        "title": "??",
        "author": "Ok-Smell930",
        "url": "https://i.redd.it/edkrex70yoga1.jpg",
        "text": "",
        "created_utc": 1675724743,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is the matrix calculus Wiki page wrong?",
        "author": "RiceIsBliss",
        "url": "https://www.reddit.com/r/math/comments/10vl79u/is_the_matrix_calculus_wiki_page_wrong/",
        "text": "https://en.wikipedia.org/wiki/Matrix_calculus\n\nShouldn't the trace entry here be A transpose?\n\nhttps://imgur.com/Nr1cfDn",
        "created_utc": 1675724722,
        "upvote_ratio": 1.0
    },
    {
        "title": "Magical Fibonacci Formulae",
        "author": "nightcracker",
        "url": "https://orlp.net/blog/magical-fibonacci-formulae/",
        "text": "",
        "created_utc": 1675724570,
        "upvote_ratio": 1.0
    },
    {
        "title": "is 0.01 or 0.025 bigger number?",
        "author": "littleghost-friend",
        "url": "https://www.reddit.com/r/math/comments/10vkrrh/is_001_or_0025_bigger_number/",
        "text": "Help im being gaslight",
        "created_utc": 1675723708,
        "upvote_ratio": 1.0
    },
    {
        "title": "Probablity with a dice",
        "author": "TheGMtoendthemall",
        "url": "https://www.reddit.com/r/math/comments/10vkj16/probablity_with_a_dice/",
        "text": "[removed]",
        "created_utc": 1675723126,
        "upvote_ratio": 1.0
    },
    {
        "title": "I made a website that gives you random contest math problems.",
        "author": "Eodmg",
        "url": "http://pnielsen2.pythonanywhere.com/",
        "text": "",
        "created_utc": 1675721497,
        "upvote_ratio": 1.0
    },
    {
        "title": "If something can happen at an average rate of 1/42 but it only happened once out of 350 attempts what are the odds of that?",
        "author": "Meekssss",
        "url": "https://www.reddit.com/r/math/comments/10vjs6f/if_something_can_happen_at_an_average_rate_of_142/",
        "text": "",
        "created_utc": 1675721338,
        "upvote_ratio": 1.0
    },
    {
        "title": "If something can on average 1/42 times but it only happened once in 350 times what are the odds of that?",
        "author": "[deleted]",
        "url": "",
        "text": "[deleted]",
        "created_utc": 1675721276,
        "upvote_ratio": 1.0
    },
    {
        "title": "Finding all possible combinations of numbers which add up to the same sum",
        "author": "OldFezzywig129",
        "url": "https://www.reddit.com/r/math/comments/10vin7u/finding_all_possible_combinations_of_numbers/",
        "text": "I’ll start off by admitting I am not very savvy when it comes to math. I’ve been looking for some kind of online calculator to find sets of numbers which add up to the sum of a particular number. This is for a project I’m working on involving gematria. If anyone has any tips or tricks on how to do this I would really appreciate it!",
        "created_utc": 1675718643,
        "upvote_ratio": 1.0
    },
    {
        "title": "Exponential approximation of cos(x)",
        "author": "MaxEin",
        "url": "https://www.reddit.com/r/math/comments/10vidsa/exponential_approximation_of_cosx/",
        "text": "    f(x) = 3e^(-x^2/6)-2  {-1.5597&lt;x&lt;1.5597}\n    1.5597 ~ pi/2 = 1.5708\n    f(0) = f''''(0) = 1\n    f'(0) = f'''(0) = f'''''(0) = 0\n    f''(0) = -1\n\nAny ideas for improving the function by e.g. making the interval more correct would be greatly appreciated!",
        "created_utc": 1675718043,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is a triangle with angle greater than 180",
        "author": "XxNoObXx89k",
        "url": "https://www.reddit.com/r/math/comments/10vhtwm/what_is_a_triangle_with_angle_greater_than_180/",
        "text": "[removed]",
        "created_utc": 1675716761,
        "upvote_ratio": 1.0
    },
    {
        "title": "Q: Examples of little-oh, preferable cs-like",
        "author": "victotronics",
        "url": "https://www.reddit.com/r/math/comments/10vh9ti/q_examples_of_littleoh_preferable_cslike/",
        "text": "Big-oh is easy enough to explain: bubble sort of Big-Oh n-squared and such.\n\nFor didactic purposes what would be a simple, preferably somewhat algorithmically-flavored example be of little-oh?",
        "created_utc": 1675715494,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can someone please help me figure this out!!",
        "author": "Elogant",
        "url": "https://i.redd.it/0bo9221x5oga1.jpg",
        "text": "",
        "created_utc": 1675715296,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to figure out a dollar figure for acceleration of work?",
        "author": "Sum_Mo",
        "url": "https://www.reddit.com/r/math/comments/10vg5da/how_to_figure_out_a_dollar_figure_for/",
        "text": "So I have a project I was schedule to complete in 268 days with an alloted 6080 hours. Ultimately I finished the job in 135 days using 11060 hours. Each hour has a value of $170. If I want to put a dollar amount on the acceleration effort to finish the job in 133 less days than scheduled, how do I go about it?",
        "created_utc": 1675712969,
        "upvote_ratio": 1.0
    },
    {
        "title": "Learning mathematics on my own.",
        "author": "RitaLovesRock",
        "url": "https://www.reddit.com/r/math/comments/10vfjht/learning_mathematics_on_my_own/",
        "text": "Hello, I have decided I want to teach myself mathematics. For context: I am in 9th grade (14y.o.) and I was in 7th grade when a teacher sparked my love for math and, back then, it was all new to me but in last year and a half it seems like I haven’t learned anything new and challenging. I have been putting off this for so long because of my own fear of failure but I think I am finally ready to challenge myself. Do you think this will colide with the next couple of school years and if it is a bad idea? Where should I start?\n\nThanks in advance.",
        "created_utc": 1675711579,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does anyone know how to solve this?",
        "author": "ashwdove",
        "url": "https://www.reddit.com/r/math/comments/10vf7qn/does_anyone_know_how_to_solve_this/",
        "text": "[removed]",
        "created_utc": 1675710839,
        "upvote_ratio": 1.0
    },
    {
        "title": "where did i calculated wrongly? ans is 79.5 &amp; i got 76.25.",
        "author": "katebushplaylist",
        "url": "https://i.redd.it/o1hx94oxnnga1.jpg",
        "text": "",
        "created_utc": 1675709256,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is linear programming?",
        "author": "Accelerator231",
        "url": "https://www.reddit.com/r/math/comments/10vedpa/what_is_linear_programming/",
        "text": "I've been reading 'red plenty', and apparently there's this type of math that would help out the soviet economic planning model, by optimizing the inputs and being able to max out the outputs for the hypothetical planned soviet economy, but the concept of the planned economy having any mathematical basis at all stuck with me. \n\nDoes anyone know what mathematics he means, and how to learn it? I keep searching for 'linear programming' but apparently its a programming concept and I'm searching for the kind of math that can be done using paper and pencil.",
        "created_utc": 1675708897,
        "upvote_ratio": 1.0
    },
    {
        "title": "can anyone help me solve this",
        "author": "Tahaalsh",
        "url": "https://i.redd.it/knmw892jmnga1.png",
        "text": "",
        "created_utc": 1675708789,
        "upvote_ratio": 1.0
    },
    {
        "title": "Randomly stumbled upon this beauty",
        "author": "Q2FI",
        "url": "https://www.reddit.com/r/math/comments/10vdjw3/randomly_stumbled_upon_this_beauty/",
        "text": "&amp;#x200B;\n\nhttps://preview.redd.it/cbdab70tzlga1.png?width=323&amp;format=png&amp;auto=webp&amp;v=enabled&amp;s=c234dae46520797003cb23d75bcc446ffac14232",
        "created_utc": 1675707032,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to calculate the break-even point?",
        "author": "haemol",
        "url": "https://www.reddit.com/r/math/comments/10vc1qv/how_to_calculate_the_breakeven_point/",
        "text": "Can someone help me how to calculate this? \n\nIf I have 10.000$ spend with a return of investment of 80%, and I want to stay at the same return of investment, how much would I have to increase the spend to break even if I take on a service with a commission that charges 3% of the spend?",
        "created_utc": 1675703618,
        "upvote_ratio": 1.0
    },
    {
        "title": "What if we were to replace the tax bracket system with this exponential curve?",
        "author": "DynaBeast",
        "url": "/r/economy/comments/10v3wrz/what_if_we_were_to_replace_the_tax_bracket_system/",
        "text": "",
        "created_utc": 1675703579,
        "upvote_ratio": 1.0
    },
    {
        "title": "What Are You Working On? February 06, 2023",
        "author": "inherentlyawesome",
        "url": "https://www.reddit.com/r/math/comments/10vbouw/what_are_you_working_on_february_06_2023/",
        "text": "This recurring thread will be for general discussion on whatever math-related topics you have been or will be working on this week. This can be anything, including:\n\n* math-related arts and crafts,\n* what you've been learning in class,\n* books/papers you're reading,\n* preparing for a conference,\n* giving a talk.\n\nAll types and levels of mathematics are welcomed!\n\nIf you are asking for advice on choosing classes or career prospects, please go to the most recent [Career &amp; Education Questions thread](https://www.reddit.com/r/math/search?q=Career+and+Education+Questions+author%3Ainherentlyawesome+&amp;restrict_sr=on&amp;sort=new&amp;t=all).",
        "created_utc": 1675702812,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does the high dimensionality of AI systems that model the real world tell us something about the abstract space of ideas?",
        "author": "Frumpagumpus",
        "url": "/r/singularity/comments/10vbjie/does_the_high_dimensionality_of_ai_systems_that/",
        "text": "",
        "created_utc": 1675702668,
        "upvote_ratio": 1.0
    },
    {
        "title": "Matrices",
        "author": "WrongAbbreviations18",
        "url": "https://www.reddit.com/r/math/comments/10va7to/matrices/",
        "text": "[removed]",
        "created_utc": 1675699325,
        "upvote_ratio": 1.0
    },
    {
        "title": "Derivative d/dx 1 ≠ 0",
        "author": "Wreior",
        "url": "https://i.redd.it/tmo659bzblga1.jpg",
        "text": "",
        "created_utc": 1675699015,
        "upvote_ratio": 1.0
    },
    {
        "title": "Definite integral ∫^{x}_{a} ξ(t) dt=1, ℜ(ξ(x)) = 0 ∧ ℑ(ξ(x)) = 0 as way of defining derivative d/dx 1≠0",
        "author": "Wreior",
        "url": "https://i.redd.it/d9pudqna9lga1.jpg",
        "text": "",
        "created_utc": 1675698112,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to pronounce Euler",
        "author": "Pedantc_Poet",
        "url": "https://www.reddit.com/r/math/comments/10v9p69/how_to_pronounce_euler/",
        "text": "Is it Yul-er or Oiler?  I've heard it both ways.",
        "created_utc": 1675698089,
        "upvote_ratio": 1.0
    },
    {
        "title": "Any tips to better at problem solving in business math?(Accounting,business and management ABM)",
        "author": "Sielvaneedshelp",
        "url": "https://www.reddit.com/r/math/comments/10v9530/any_tips_to_better_at_problem_solving_in_business/",
        "text": "[removed]",
        "created_utc": 1675696722,
        "upvote_ratio": 1.0
    },
    {
        "title": "could you help me with a riddle?",
        "author": "TheLapisBee",
        "url": "https://www.reddit.com/r/math/comments/10v90ab/could_you_help_me_with_a_riddle/",
        "text": "[removed]",
        "created_utc": 1675696386,
        "upvote_ratio": 1.0
    },
    {
        "title": "Question on preparation for IMO style competitions",
        "author": "aowxrie",
        "url": "https://www.reddit.com/r/math/comments/10v8ohk/question_on_preparation_for_imo_style_competitions/",
        "text": "[removed]",
        "created_utc": 1675695593,
        "upvote_ratio": 1.0
    },
    {
        "title": "nth term",
        "author": "_soti",
        "url": "https://www.reddit.com/r/math/comments/10v7ldc/nth_term/",
        "text": "[removed]",
        "created_utc": 1675692791,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is there a mathematical model / name for what I'm describing here?",
        "author": "5thYL",
        "url": "https://www.reddit.com/r/math/comments/10v798y/is_there_a_mathematical_model_name_for_what_im/",
        "text": "Say we have 200 tokens, and we have to distribute it to 100 people.\n\nEvery person gets least 1.1 tokens.\n\nA person with 1.1\\^x tokens gets x points. So a person with 1.21 tokens gets 2 points.\n\nWhat distribution of tokens will generate the highest average points?\n\nI know by common sense that if everyone gets the same number of tokens, average point will be the highest. So in this case log(200/100)/log(1.1) = 7.27 average point.\n\nHowever I don't understand why is this happening.\n\nI feel there's some kind of mathematical models behind this, and maybe something that can calculate some kind of an index according to how distributed the tokens are and stuff like that, though I don't know what they are called.\n\nCan someone point me in the right direction please?\n\nThe idea for question originates from how standard of living / wealth is calculated in a game called Victoria 3.",
        "created_utc": 1675691920,
        "upvote_ratio": 1.0
    },
    {
        "title": "The future of maths?",
        "author": "obammala",
        "url": "https://www.reddit.com/r/math/comments/10v6r1p/the_future_of_maths/",
        "text": "[removed]",
        "created_utc": 1675690489,
        "upvote_ratio": 1.0
    },
    {
        "title": "After a PhD there are different math universes? What!?",
        "author": "obammala",
        "url": "https://vt.tiktok.com/ZS8fBH6W4/",
        "text": "[removed]",
        "created_utc": 1675690369,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is your favorite integral?",
        "author": "NoElk292",
        "url": "https://www.reddit.com/r/math/comments/10v6h6b/what_is_your_favorite_integral/",
        "text": "[removed]",
        "created_utc": 1675689710,
        "upvote_ratio": 1.0
    },
    {
        "title": "5-3 * 5-3???",
        "author": "CucumbersAreFruit",
        "url": "https://www.reddit.com/r/math/comments/10v6bso/53_53/",
        "text": "[removed]",
        "created_utc": 1675689294,
        "upvote_ratio": 1.0
    },
    {
        "title": "How did this step has been evaluated? I'm having no clie except for some inverse expansion.",
        "author": "dhiman_eminem",
        "url": "https://i.redd.it/joc5si62tlga1.png",
        "text": "",
        "created_utc": 1675686762,
        "upvote_ratio": 1.0
    }
]