[
    {
        "title": "There is a big push in K-12 education to \"eliminate math anxiety\" but I would argue a reasonable amount of math anxiety is healthy!",
        "author": "jhertz14",
        "url": "https://www.reddit.com/r/math/comments/10r4vof/there_is_a_big_push_in_k12_education_to_eliminate/",
        "text": "Anxiety has a negative connotation to it. And \"math anxiety\" is a well know concept in education in both secondary/post secondary education. But, I don't like this idea that we say \"oh, he/she has math anxiety so it impairs them\" On the contrary, I think some anxiety can be helpful. I'm not saying children should be having panic attacks and crying. That's too much. \n\nBut, anxiety to some extent is healthy! It motivates you to learn and lights a fire under your butt to study. In general, I wish students had more math anxiety, not less. I think educators especially at middle and high level need to discuss this and also discuss what constitutes \"healthy\" anxiety and unhealthy. Just my two cents.",
        "created_utc": 1675282628,
        "upvote_ratio": 1.0
    },
    {
        "title": "Polishing intuition of unbounded partial sums whose sequence is convergent to zero",
        "author": "xTouny",
        "url": "https://www.reddit.com/r/math/comments/10r4qnu/polishing_intuition_of_unbounded_partial_sums/",
        "text": "Hello,\n\nI find it so curious for the harmonic series h_n = 1/1 + 1/2 + 1/3 + .. (limit of partial sums) to be unbounded, Even-though the sequence {1/n} converges to zero. I want to investigate this pattern more deeply, blossoming around it, to polish my intuition of series divergence.\n\nAn obvious inquiry, is to compute the rate of change of partial sums. In the case of harmonic series, It is proved h_{2^n} &gt; 1 + n/2. Loosely speaking, an exponential increase is required on n for a constant increase of h_n. That bound was proven by techniques of inequalities.\n\nCurrently, I am not confident of proving inequalities on sequences or series. Neither am I familiar with deriving closed forms. I feel this is a critical bottleneck on my pathway of learning analysis.\n\n**Discussion**\n- Is it a fruitful investigation, to learn more about the pattern of harmonic series?\n- Is it a good investigation, to learn about the rate of change of series?\n- Is it necessary to master inequalities or closed-forms proofs, to proceed in my investigation?\n- Do you see a better pathway, whether for understanding analysis, or polishing intuition on divergent partial sums?",
        "created_utc": 1675282314,
        "upvote_ratio": 1.0
    },
    {
        "title": "Baby Rudin Follow up Options",
        "author": "Chance_Literature193",
        "url": "https://www.reddit.com/r/math/comments/10r4m9p/baby_rudin_follow_up_options/",
        "text": " Baby Rudin has been like the bible to me this past year. I carry it everywhere with me. I am hoping to find my next classic, particularly a good follow up. \n\n1) The obvious follow up candidate is Papa Rudin and complex and real analysis. Is Papa Rudin as amazing as Baby Rudin? Other good books on Complex and Real Analysis?\n\n2) A book like Munkres Analysis on a Manifold: How is that as a follow up topic and is that a good book to cover it?\n\n3) What other Analysis topics coverable post-Baby Rudin are possible that wouldn't be covered in Real or Complex Analysis, like Analysis on a Manifold? \n\nI know the last one in particular is a broad question. If it helps, I am physics graduate student starting string theory research, but I am just primarily looking to figure out what the options are and determine what other quintessential books to read.",
        "created_utc": 1675282039,
        "upvote_ratio": 1.0
    },
    {
        "title": "How is this possible?",
        "author": "Beginning-Pie8270",
        "url": "https://www.reddit.com/r/math/comments/10r4148/how_is_this_possible/",
        "text": "[removed]",
        "created_utc": 1675280721,
        "upvote_ratio": 1.0
    },
    {
        "title": "Missing terms of sequense",
        "author": "icemanpunch",
        "url": "https://www.reddit.com/r/math/comments/10r3f1h/missing_terms_of_sequense/",
        "text": "1832, 35159, 320056, 1917605, 9202112, X, 128808944, X, 1063811320, X, 6009068552 \n\nI have this sequence with 3 terms missing, but I can't find the missing terms or explanations for this sequence. The sequences should be mathematical, but I don't see a formula here.",
        "created_utc": 1675279300,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do I solve this?",
        "author": "ineedkarmaplzcmon",
        "url": "https://i.redd.it/yjs1av0c5ofa1.jpg",
        "text": "",
        "created_utc": 1675279252,
        "upvote_ratio": 1.0
    },
    {
        "title": "Circle Theorems Problem",
        "author": "Melodic_Award1575",
        "url": "https://i.redd.it/12ut8uddxnfa1.jpg",
        "text": "[removed]",
        "created_utc": 1675276575,
        "upvote_ratio": 1.0
    },
    {
        "title": "Anyway someone could break this problem down for me?",
        "author": "Calm_Dog_1876",
        "url": "https://i.redd.it/vemedqlbwnfa1.jpg",
        "text": "",
        "created_utc": 1675276221,
        "upvote_ratio": 1.0
    },
    {
        "title": "graphing functions",
        "author": "bouncyballz007",
        "url": "https://www.reddit.com/r/math/comments/10r1y82/graphing_functions/",
        "text": "",
        "created_utc": 1675275960,
        "upvote_ratio": 1.0
    },
    {
        "title": "Multiple of K",
        "author": "Temporary_Penalty_73",
        "url": "https://www.reddit.com/r/math/comments/10r1xcx/multiple_of_k/",
        "text": "[removed]",
        "created_utc": 1675275908,
        "upvote_ratio": 1.0
    },
    {
        "title": "Help!",
        "author": "Calm_Dog_1876",
        "url": "https://i.redd.it/7jgdg9yavnfa1.jpg",
        "text": "",
        "created_utc": 1675275879,
        "upvote_ratio": 1.0
    },
    {
        "title": "Introducing MathCar - An Educational Math Racing Game",
        "author": "BogIronGames",
        "url": "https://www.reddit.com/r/math/comments/10r1t2h/introducing_mathcar_an_educational_math_racing/",
        "text": "[removed]",
        "created_utc": 1675275633,
        "upvote_ratio": 1.0
    },
    {
        "title": "Would this be considered “not enough information”?",
        "author": "Analtaccountforme123",
        "url": "https://i.redd.it/m43teburrnfa1.jpg",
        "text": "",
        "created_utc": 1675274692,
        "upvote_ratio": 1.0
    },
    {
        "title": "Choices are hard sometimes",
        "author": "PhilSciMath",
        "url": "https://www.reddit.com/r/math/comments/10r1bax/choices_are_hard_sometimes/",
        "text": "I got my bachelor's degree in Philosophy some years back. Being unemployed since. I started pure math a while ago to see if I could correct my life some way, to be more useful to society. I finished calculus (all 3 of them), linear algebra, and some other classes (all with Bs and As). I thought I was somewhat good for STEM, but this semester I got Physics 1 and Analysis 1. Though I'm loving Physics, I'm getting beaten by Analysis. I tried to like it, I really did, but it is so uninteresting to me. I understand the theorems and proofs, but when I have to prove something myself, I spend hours looking to the problem with no idea what to do. Sometimes I manage to do the simpler ones. \n\nWhen reading a book, quite often I see the author coming up with an expression out of nowhere (like Rudin's q = p - (p\\^2 -2)/(p + 2) right at the beginning of his book, no explanation given). Is that what is expected of me? Should I be learning how to pull rabbits out of hats? My professor does even crazier stuff. And I think to myself: \"No way I will ever be able to do that\". \n\nThere is more. Right at the beginning of the semester I sent a dissertation proposal to my College's Department of Philosophy and I was approved for a master program. But I just gave up to focus on my math course. I thought it wouldn't change my situation a bit. Now I have no idea if I can still do math, graduate level courses are probably full of analysis-like classes. I wonder if I should switch course to something like Statistics or even Physics, but I'm not sure.\n\nSo what would you do in my place?",
        "created_utc": 1675274522,
        "upvote_ratio": 1.0
    },
    {
        "title": "Circle Theorems Problem",
        "author": "Melodic_Award1575",
        "url": "https://i.redd.it/cz4s4j3vonfa1.jpg",
        "text": "",
        "created_utc": 1675273714,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can somebody please help me? Would be greatly appreciated",
        "author": "Melodic_Award1575",
        "url": "https://i.redd.it/lz47syshonfa1.jpg",
        "text": "",
        "created_utc": 1675273617,
        "upvote_ratio": 1.0
    },
    {
        "title": "union of two sets of natural numbers",
        "author": "bearybearbearrr",
        "url": "https://www.reddit.com/r/math/comments/10r0qcv/union_of_two_sets_of_natural_numbers/",
        "text": "for a set of natural numbers that defines all the factors of a certain number x, and another set of natural numbers that defines all the factors of a certain number y\n\nif u take the intersection of set X and set Y, there will be a largest number z in that intersection set\n\nis it true that set Z will always define all the factors of z?\n\nif so, why?",
        "created_utc": 1675273175,
        "upvote_ratio": 1.0
    },
    {
        "title": "i don't know if this helps anybody but here",
        "author": "Pieneon",
        "url": "https://i.redd.it/b9exa0q6mnfa1.jpg",
        "text": "",
        "created_utc": 1675272813,
        "upvote_ratio": 1.0
    },
    {
        "title": "Relationship between the angles of a triangle and it's medians?",
        "author": "A3RRON",
        "url": "https://www.reddit.com/r/math/comments/10r0bal/relationship_between_the_angles_of_a_triangle_and/",
        "text": "Hey guys, can't believe it has come to this, but I'm this close to losing my mind. Currently trying to solve some electromagnetic equations (for the curious: calculating the magnetic flux density generated by two parallel currents in an external point). When I tried to simplify some formulas I noticed some oddly similar angles and I got curious. Long story short, I tried to find the relationship between the inner angles of a triangle and the angles of its medians to their respective sides, but I can't for the life of me get there. Anyone wanna help me out? I'll post a picture in the comments to clarify.",
        "created_utc": 1675272168,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is the name for this type of problem?",
        "author": "wayngrove",
        "url": "https://www.reddit.com/r/math/comments/10qzv5v/what_is_the_name_for_this_type_of_problem/",
        "text": "(The mods at r/math removed for some reason.)\n\n2a x 7a = 22a1\n\nThe answer is a=9\n\n322323a ÷ 23a = 1377a\n\nThe answer is a=4\n\nThese were multiple choice questions, no calculators allowed, and the test was timed. Does anyone know the actual name for this question? I was recently hit with several of these during a job application aptitude test, and even though I passed this section, I have to redo the test due to a computer malfunction on the spatial reasoning section. I wanted to practice on these, because these gave me most difficult time, but I have no idea what they are called. Any help, preferably with links or tips?",
        "created_utc": 1675271140,
        "upvote_ratio": 1.0
    },
    {
        "title": "Quick Questions: February 01, 2023",
        "author": "inherentlyawesome",
        "url": "https://www.reddit.com/r/math/comments/10qzpn2/quick_questions_february_01_2023/",
        "text": "This recurring thread will be for questions that might not warrant their own thread. We would like to see more conceptual-based questions posted in this thread, rather than \"what is the answer to this problem?\". For example, here are some kinds of questions that we'd like to see in this thread:\n\n* Can someone explain the concept of maпifolds to me?\n* What are the applications of Represeпtation Theory?\n* What's a good starter book for Numerical Aпalysis?\n* What can I do to prepare for college/grad school/getting a job?\n\nIncluding a brief description of your mathematical background and the context for your question can help others give you an appropriate answer. For example consider which subject your question is related to, or the things you already know or have tried.",
        "created_utc": 1675270812,
        "upvote_ratio": 1.0
    },
    {
        "title": "Math videos to help towards SAT/ACT!",
        "author": "Hungry_Tangerine_40",
        "url": "https://www.youtube.com/channel/UC8GX6vbuQSiroJHAiPYT4cA",
        "text": "",
        "created_utc": 1675270265,
        "upvote_ratio": 1.0
    },
    {
        "title": "Learn math online",
        "author": "luka0550",
        "url": "https://www.reddit.com/r/math/comments/10qzacb/learn_math_online/",
        "text": "[removed]",
        "created_utc": 1675269782,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does anyone know where I can find practice questions like this?",
        "author": "No_Newt_1428",
        "url": "https://www.reddit.com/gallery/10qys8s",
        "text": "",
        "created_utc": 1675268541,
        "upvote_ratio": 1.0
    },
    {
        "title": "no idea on how to solve this problem",
        "author": "Far_Organization_610",
        "url": "https://www.reddit.com/r/math/comments/10qylzt/no_idea_on_how_to_solve_this_problem/",
        "text": "[removed]",
        "created_utc": 1675268128,
        "upvote_ratio": 1.0
    },
    {
        "title": "New digital sensor - solar angle",
        "author": "Powder_Run_108",
        "url": "https://www.reddit.com/r/math/comments/10qyd3p/new_digital_sensor_solar_angle/",
        "text": "[removed]",
        "created_utc": 1675267536,
        "upvote_ratio": 1.0
    },
    {
        "title": "I was told that to answer this would be litterly impossible but i figured a way to do solve this, can you? What is the A,B and C angles.",
        "author": "Hour-Paramedic-2296",
        "url": "https://i.redd.it/7dyes7mp2nfa1.jpg",
        "text": "",
        "created_utc": 1675266263,
        "upvote_ratio": 1.0
    },
    {
        "title": "Question about determining open intervals.",
        "author": "DontTrustAnthingISay",
        "url": "https://i.redd.it/rlb9loof0nfa1.jpg",
        "text": "",
        "created_utc": 1675265498,
        "upvote_ratio": 1.0
    },
    {
        "title": "What’s the probability of never winning of a scratch card?",
        "author": "aneternalgolden",
        "url": "https://www.reddit.com/r/math/comments/10qxbs9/whats_the_probability_of_never_winning_of_a/",
        "text": "",
        "created_utc": 1675264968,
        "upvote_ratio": 1.0
    },
    {
        "title": "We’re currently focusing on petersen graph, trying to study it, and see if there’s still any thing we can do about it for our undergraduate thesis. Do you have any recommendations?",
        "author": "Adhiarja_Citra",
        "url": "https://www.reddit.com/r/math/comments/10qx1dc/were_currently_focusing_on_petersen_graph_trying/",
        "text": "",
        "created_utc": 1675264258,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why stop at 170! ?",
        "author": "Credit_Radiant333",
        "url": "https://www.reddit.com/r/math/comments/10qx068/why_stop_at_170/",
        "text": "[removed]",
        "created_utc": 1675264179,
        "upvote_ratio": 1.0
    },
    {
        "title": "What type of aptitude question is this?",
        "author": "wayngrove",
        "url": "https://www.reddit.com/r/math/comments/10qwgnj/what_type_of_aptitude_question_is_this/",
        "text": "2a x 7a = 2,2a1\n\nThe multiple choice answer is 9, but does anyone know the actual name for this question? I was recently hit with several of these during a job application aptitude test, and even though I passed this section, I have to redo the test due to a computer malfunction on the spatial reasoning section. I wanted to practice on these, because these gave me most difficult time, but I have no idea what they are called. Any help, preferably with links or tips?",
        "created_utc": 1675262822,
        "upvote_ratio": 1.0
    },
    {
        "title": "Hello everyone, can anyone help with a geometry problem? So here it is. We have a MNP triagle, N angle is 20° P angle is 40° and bisector- BK is 5 cm. We need to find out how much bigger is NP than MN. Thanks everyone in advance this might seem easy but I am really struggling.",
        "author": "DeliveryBackground88",
        "url": "https://www.reddit.com/r/math/comments/10qwcr2/hello_everyone_can_anyone_help_with_a_geometry/",
        "text": "",
        "created_utc": 1675262533,
        "upvote_ratio": 1.0
    },
    {
        "title": "Algebra - Free online course",
        "author": "MDLearning",
        "url": "https://formationgratuite.net/Algebra/",
        "text": "",
        "created_utc": 1675260645,
        "upvote_ratio": 1.0
    },
    {
        "title": "Funky Face Constant Eyes Edge and Lip centre triangle!",
        "author": "Aarathana143",
        "url": "https://i.redd.it/2yw7h89ydmfa1.jpg",
        "text": "",
        "created_utc": 1675257942,
        "upvote_ratio": 1.0
    },
    {
        "title": "Doing a Master's in Mathematics after a Bachelor's in Computer Science",
        "author": "jilljackmuse",
        "url": "https://www.reddit.com/r/math/comments/10qudgn/doing_a_masters_in_mathematics_after_a_bachelors/",
        "text": "[removed]",
        "created_utc": 1675257064,
        "upvote_ratio": 1.0
    },
    {
        "title": "4=5 sophism \"proof\" help in comments",
        "author": "djgorik",
        "url": "https://i.redd.it/z1j09nx9xlfa1.jpg",
        "text": "",
        "created_utc": 1675252335,
        "upvote_ratio": 1.0
    },
    {
        "title": "Given any Diophantine inequality how many positive integer solution does it have?",
        "author": "quantum_physicist619",
        "url": "https://www.reddit.com/r/math/comments/10qqvrf/given_any_diophantine_inequality_how_many/",
        "text": "Hello everyone, I am trying to solve these sorts of problems for a few months and I couldn't find any general method.\n\nLet's say, we are give Diophantine inequality such as ax+by+cz+.....≤N, then how many positive integer solution does it have? Thank you!",
        "created_utc": 1675249773,
        "upvote_ratio": 1.0
    },
    {
        "title": "Best Low Budget Cars In India 2023 – Price, Specifications and Mileage",
        "author": "Individual-Math-1553",
        "url": "https://www.spinny.com/blog/index.php/low-budget-cars-in-india/",
        "text": "",
        "created_utc": 1675248783,
        "upvote_ratio": 1.0
    },
    {
        "title": "Help for a solution of a math logic problem",
        "author": "NoImpression1525",
        "url": "https://www.reddit.com/r/math/comments/10qqa78/help_for_a_solution_of_a_math_logic_problem/",
        "text": "[removed]",
        "created_utc": 1675248045,
        "upvote_ratio": 1.0
    },
    {
        "title": "Solutions for Languages and Machines 2nd Edition",
        "author": "samcdc6600",
        "url": "https://www.reddit.com/r/math/comments/10qpwff/solutions_for_languages_and_machines_2nd_edition/",
        "text": "Hello,  \n\n\nI have a copy of the book Languages and Machines (specifically the 2nd edition.)  \nI haven't be able to locate the solutions for the exercises at the end of the chapters. There don't appear to be any in the book itself.  \n\n\nIf anyone knows where I could find the solutions I would very much appreciate it. I can find the solutions for the 3rd edition, but I don't have that edition and I don't want to buy another copy.",
        "created_utc": 1675246436,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to represent the 12 tones in a sphere",
        "author": "miguelon",
        "url": "https://www.reddit.com/r/math/comments/10qovjy/how_to_represent_the_12_tones_in_a_sphere/",
        "text": "Hi, in music we've got the chromatic scale with the notes arranged in semitones, and the circle of fifths. As I see it, the first is useful for visualizing melody or intervals, the latter for harmonic movement.\n\n I was wondering if a 3d object could show both relations, taking advantage of perspective. This way I could draw at the same time harmony and melody.\n\nIt's just an intuition that I'm exploring. Please ask for further clarification. Thanks!",
        "created_utc": 1675242093,
        "upvote_ratio": 1.0
    },
    {
        "title": "New AI tool: Check what you know in math and where your skillgaps are",
        "author": "freducom",
        "url": "https://www.reddit.com/r/math/comments/10qouff/new_ai_tool_check_what_you_know_in_math_and_where/",
        "text": "[removed]",
        "created_utc": 1675241995,
        "upvote_ratio": 1.0
    },
    {
        "title": "help please frq",
        "author": "jtoyou3",
        "url": "https://i.redd.it/zceru6q8zjfa1.jpg",
        "text": "",
        "created_utc": 1675228775,
        "upvote_ratio": 1.0
    },
    {
        "title": "Any good books on the history of zero?",
        "author": "honeyplease",
        "url": "https://www.reddit.com/r/math/comments/10qlf5c/any_good_books_on_the_history_of_zero/",
        "text": "",
        "created_utc": 1675228727,
        "upvote_ratio": 1.0
    },
    {
        "title": "Any heuristic?",
        "author": "hardyconj",
        "url": "https://www.reddit.com/r/math/comments/10qle1z/any_heuristic/",
        "text": "[removed]",
        "created_utc": 1675228616,
        "upvote_ratio": 1.0
    },
    {
        "title": "Could someone tell me the answer to these questions with an explanation",
        "author": "jesuslover333777",
        "url": "https://www.reddit.com/gallery/10qlct9",
        "text": "",
        "created_utc": 1675228507,
        "upvote_ratio": 1.0
    },
    {
        "title": "Doing math independent study could someone help me with these questions please thank you [grade 10]",
        "author": "jesuslover333777",
        "url": "https://www.reddit.com/gallery/10ql7vh",
        "text": "",
        "created_utc": 1675228022,
        "upvote_ratio": 1.0
    },
    {
        "title": "A student challenged me to a math problem that I haven’t been able to quite solve 😬",
        "author": "cDontMiss",
        "url": "https://www.reddit.com/r/math/comments/10qjpd7/a_student_challenged_me_to_a_math_problem_that_i/",
        "text": "[removed]",
        "created_utc": 1675223292,
        "upvote_ratio": 1.0
    },
    {
        "title": "Defining the ∞-th derivative",
        "author": "SpareCarpet",
        "url": "https://www.reddit.com/r/math/comments/10qjg1o/defining_the_th_derivative/",
        "text": "When I was an analysis student the typical examination of non-analytic function e^(-1/z\\^2)  (which has nth derivative 0 at 0) always felt deeply unsatisfactory. If one looks at the nth derivative, one notices that the area in which the function remains close to zero shrinks.\n\n[0th-2nd derivative of e\\^\\(-1\\/z\\^2\\)](https://preview.redd.it/bjitjjsbyhfa1.png?width=796&amp;format=png&amp;auto=webp&amp;v=enabled&amp;s=d46fc7a08c2e12e44d4b844da81221c1bc97f566)\n\nMy initial thought was that, in some sense, it is probably the case that all finite derivatives of the function are 0 at 0, but that what is really happening is the non-zero derivative is being pushed to infinity-- so that traditional analysis is able to see the fact this function is non-zero. However, at the time, I couldn't really give any credence to this claim and gave up trying to understand it in this way.\n\nHowever, I've learned a lot more complex analysis since then-- and now I possess the tools to at least suggest that the viewpoint expressed above is *in some sense*, reasonable. In pursuit of this goal, consider the fact that e^(-1/z\\^2)=∑(-1)\\^n/(n!\\*z\\^(2n)). This gives our exponential function by expressing it as a power series about infinity. However, we can also write the sum as a contour integral using the residue theorem so that e^(-1/z\\^2)=∫csc(πw)/(2i) \\* z\\^(-2w)/Γ(w+1)dz. Now, notice that we can switch the direction of this contour integral (and pick up a negative sign), so that its encloses the space on the left half-plane, rather than the right half-plane. This allows us to turn this power series into a power series about ∞, to one about 0. In this case, we get the power series representation -∑(-1)\\^n z\\^(2n) /((-n)!) \\[starting at n=1 instead of n=0, since we switched the direction of the contour\\].  However, notice that this since 1/(-n)! = 0, this suggests that the function has nth derivatives 0 at 0. However, there is an extra residue at ∞ created by the growth of 1/(-n)!, suggesting that, in some sense, the ∞-th derivative of the function is non-zero. For instance, this is apparent in the following complex plot of the integrand\n\n[There are no residues on the left, but the function grows large at -∞](https://preview.redd.it/v45jh5ztyhfa1.png?width=946&amp;format=png&amp;auto=webp&amp;v=enabled&amp;s=3cc9efb0b0fbd3b091ef0b72e777bba4cb47ca3f)\n\n&amp;#x200B;\n\nWe can actually see that this growth rate at -∞ gives rise to a residue by mapping dz -&gt; d(1/z) and then integrating in the following way\n\n[Integration that picks up only the residue at -∞](https://preview.redd.it/nr6qe16xyhfa1.png?width=1350&amp;format=png&amp;auto=webp&amp;v=enabled&amp;s=f900120cbaaf1bc3e2906fb99e92d26dcd6ae98e)\n\nThus, at least in some sense, the ∞-th derivative of this non-analytic function is non-zero.\n\nMy hope is that there is some other way in which the ∞-th derivative can be computed-- hopefully in a way that doesn't require thinking about the function in the complex plane (i.e. relying only on real-analytic techniques). Does anyone know if such an idea has been developed before, or have some ideas on how to think about the idea?",
        "created_utc": 1675222507,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is there a reasonable way to define the infinity-th derivative?",
        "author": "SpareCarpet",
        "url": "https://www.reddit.com/r/math/comments/10qjbgm/is_there_a_reasonable_way_to_define_the/",
        "text": "[removed]",
        "created_utc": 1675222140,
        "upvote_ratio": 1.0
    },
    {
        "title": "How much of calculus did Newton rigorously prove when he invented it?",
        "author": "genericname1357",
        "url": "https://www.reddit.com/r/math/comments/10qj2rn/how_much_of_calculus_did_newton_rigorously_prove/",
        "text": "",
        "created_utc": 1675221447,
        "upvote_ratio": 1.0
    },
    {
        "title": "Finitely many primes of form X",
        "author": "Amber_Amy",
        "url": "https://www.reddit.com/r/math/comments/10qix27/finitely_many_primes_of_form_x/",
        "text": "[removed]",
        "created_utc": 1675220997,
        "upvote_ratio": 1.0
    },
    {
        "title": "Help me because I REALLY don’t know how to math.",
        "author": "NicheLilLeche",
        "url": "https://www.reddit.com/r/math/comments/10qi9gt/help_me_because_i_really_dont_know_how_to_math/",
        "text": "[removed]",
        "created_utc": 1675219093,
        "upvote_ratio": 1.0
    },
    {
        "title": "I am dumb help",
        "author": "Odd_Bicycle_5168",
        "url": "https://www.reddit.com/r/math/comments/10qhytr/i_am_dumb_help/",
        "text": "[removed]",
        "created_utc": 1675218273,
        "upvote_ratio": 1.0
    },
    {
        "title": "1000! =",
        "author": "Asasuma",
        "url": "https://www.reddit.com/r/math/comments/10qhvvo/1000/",
        "text": "[removed]",
        "created_utc": 1675218036,
        "upvote_ratio": 1.0
    },
    {
        "title": "I just want to move on from real analysis",
        "author": "AdFew4357",
        "url": "https://www.reddit.com/r/math/comments/10qhpsj/i_just_want_to_move_on_from_real_analysis/",
        "text": "Don’t get me wrong. I enjoyed real analysis, and I did well, but I’m just getting tired of my professors (statistics) telling me I “need more real analysis before you should touch measure theoretic probability”. I’m gonna be a phd student in statistics, and yes, I get that real analysis is important, but can I just move on? Everyone is telling me to take ANOTHER real analysis sequence in graduate school. Saying that, while I’m in a statistics program, I should try to audit the grad level real analysis sequence, because “you can never get enough analysis before measure theoretic probability”. Well, sure, but I just don’t want to relearn the same material over and over and over and over again. At what point does someone just accept that they know enough, and just move into like billingsley or Williams probability text. Like sure, maybe my undergraduate analysis sequence didn’t use baby rudin, my class iused abbot, and I actually technically read Pugh and tao alongside it because I sometimes read the same material from different texts to see various perspectives. Sure I never did all the proofs in rudin, but  I definitely learned the material in three different books, did exercises from three different books, and did well in the class and used three books which are well regarded. Idk what it is but my stats professors just have this mindset of “baby rudin or bust” where because I haven’t experienced that book for real analysis, I’m not ready for measure theoretic probability. I decided against their advice and I’m just hopping into the sequence in probability theory with billingsley in grad school.",
        "created_utc": 1675217572,
        "upvote_ratio": 1.0
    },
    {
        "title": "Do i have to answer a math question (sentence) with a sentence or saying the number conlusion fine? Exam in EU.",
        "author": "Joestarsama",
        "url": "https://www.reddit.com/r/math/comments/10qhhzm/do_i_have_to_answer_a_math_question_sentence_with/",
        "text": "[removed]",
        "created_utc": 1675216983,
        "upvote_ratio": 1.0
    },
    {
        "title": "Trying to turn a tea kettle's side into a shape so that i can engrave it. Is it possible to solve this given the current info?",
        "author": "atomsix",
        "url": "https://i.redd.it/4vtweky9zifa1.jpg",
        "text": "",
        "created_utc": 1675216681,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is this the most beautiful equation? I call this the Golden Identity.",
        "author": "ccube78",
        "url": "https://i.redd.it/3ubum7ibvifa1.jpg",
        "text": "",
        "created_utc": 1675215350,
        "upvote_ratio": 1.0
    },
    {
        "title": "Please help",
        "author": "nolessl0ri_17",
        "url": "https://i.redd.it/kzdkt2zdtifa1.jpg",
        "text": "",
        "created_utc": 1675214702,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can anyone reply me the explanation in solving this problem?",
        "author": "Sure-Weekend2243",
        "url": "https://i.redd.it/5vhe0awjbhfa1.jpg",
        "text": "",
        "created_utc": 1675214668,
        "upvote_ratio": 1.0
    },
    {
        "title": "Probability",
        "author": "Historical-Break8133",
        "url": "https://www.reddit.com/r/math/comments/10qgkq0/probability/",
        "text": "Chance off getting 499/500, reset, then 1/500.",
        "created_utc": 1675214474,
        "upvote_ratio": 1.0
    },
    {
        "title": "Handyman trying to figure this out… square footage of roof. I can’t believe public schools failed me this much….:/",
        "author": "Briggy1986",
        "url": "https://i.redd.it/eeslmt7rqifa1.jpg",
        "text": "",
        "created_utc": 1675213815,
        "upvote_ratio": 1.0
    },
    {
        "title": "What type of graph is this called ?",
        "author": "kenokeke2468",
        "url": "https://i.redd.it/g9nsrpbbhifa1.jpg",
        "text": "",
        "created_utc": 1675210639,
        "upvote_ratio": 1.0
    },
    {
        "title": "I’m confused on this math problem. Can I have some help?",
        "author": "slerqinator3110",
        "url": "https://i.redd.it/4m7wsw085ifa1.jpg",
        "text": "",
        "created_utc": 1675206577,
        "upvote_ratio": 1.0
    },
    {
        "title": "Translating Polar Graphs",
        "author": "hes-good-I-guess",
        "url": "https://www.reddit.com/r/math/comments/10qdgfu/translating_polar_graphs/",
        "text": "With basic knowledge of polar graphs, I’ve been trying to rotate a parabola and move it to a certain point away from the origin. \n\nUsing r=(sec theta)(tan theta), I’ve been able to plot it, and increasing/adding a value onto theta rotates the parabola. \n\nI’ve been having issues moving it away from the origin or either axis. I’ve looked up ways to do this, and all I’ve found is it’s difficult to translate polar graphs. Does anyone have any further guidance in achieving this?",
        "created_utc": 1675206334,
        "upvote_ratio": 1.0
    },
    {
        "title": "Real-world examples for systems of linear equations (Ax = b)?",
        "author": "dhfsaklasjk",
        "url": "https://www.reddit.com/r/math/comments/10qcazg/realworld_examples_for_systems_of_linear/",
        "text": "[removed]",
        "created_utc": 1675203521,
        "upvote_ratio": 1.0
    },
    {
        "title": "So you’re designing a trivia question",
        "author": "CookieCat698",
        "url": "https://www.reddit.com/r/math/comments/10qc5a2/so_youre_designing_a_trivia_question/",
        "text": "It’s about a kind of object in set theory whose existence is guaranteed by an axiom. Tell me what spawn of satan would drive you to pick any axiom other than the axiom of choice for this question.",
        "created_utc": 1675203126,
        "upvote_ratio": 1.0
    },
    {
        "title": "What would be the answer to 6÷2(6-2)",
        "author": "Jsulzeo",
        "url": "https://www.reddit.com/r/math/comments/10qbydy/what_would_be_the_answer_to_6262/",
        "text": "(This is not asking for homework help, I'm aware that's not allowed)\n\nThis is being debated on another sub, and I was originally going with 12, because this seems simple enough to just apply PEMDAS to.\n\nApparently I was wrong. I have seen debate on whether 6÷2 is actually '6÷2' or if it's actually '6/2' (six over two), which changes the format of the problem, although I'm not sure if that changes the answer. I've also been responded to by someone who supposedly has a degree in Astrophysics, who implies that PEMDAS is wrong here, so I'm not sure of anything at this point. This goes a *lot* deeper than I thought and I feel like someone here might have a definite answer.\n\nThe most popular answers I've seen so far are 12 and 0.75, if that helps.",
        "created_utc": 1675202656,
        "upvote_ratio": 1.0
    },
    {
        "title": "Instant Homework Solver for All Subjects - Free but Magical!",
        "author": "boyoung430",
        "url": "https://www.reddit.com/r/math/comments/10qbktt/instant_homework_solver_for_all_subjects_free_but/",
        "text": "[removed]",
        "created_utc": 1675201757,
        "upvote_ratio": 1.0
    },
    {
        "title": "Our future generation, unable to do simple maths.",
        "author": "datway220",
        "url": "https://i.redd.it/5w0c40zhtffa1.jpg",
        "text": "",
        "created_utc": 1675201357,
        "upvote_ratio": 1.0
    },
    {
        "title": "Infinitesimals make more sense than infinities.",
        "author": "sofa_king_notmo",
        "url": "https://www.reddit.com/r/math/comments/10qbcxg/infinitesimals_make_more_sense_than_infinities/",
        "text": "An infinity is unbounded, whereas an infinitesimal is bounded by zero.   Yet many mathematicians use infinities while poopooing infinitesimals as unsound.",
        "created_utc": 1675201212,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can someone help me solve this ive been doing alright on these revision questions until now and i have a test coming up soon and no one i know knows you know",
        "author": "RandomOnReddit01",
        "url": "https://i.redd.it/iphm8aaf6gfa1.jpg",
        "text": "",
        "created_utc": 1675200764,
        "upvote_ratio": 1.0
    },
    {
        "title": "Regret playing the status game",
        "author": "Wide_Razzmatazz1550",
        "url": "https://www.reddit.com/r/math/comments/10qaxaa/regret_playing_the_status_game/",
        "text": "[removed]",
        "created_utc": 1675200207,
        "upvote_ratio": 1.0
    },
    {
        "title": "I need help with an equation",
        "author": "[deleted]",
        "url": "",
        "text": "[removed]",
        "created_utc": 1675199628,
        "upvote_ratio": 1.0
    },
    {
        "title": "troubles solving a certain geometry problem",
        "author": "ExtremeChaosity",
        "url": "https://www.reddit.com/r/math/comments/10qacz1/troubles_solving_a_certain_geometry_problem/",
        "text": "[removed]",
        "created_utc": 1675198883,
        "upvote_ratio": 1.0
    },
    {
        "title": "Someone claims to have solved Collatz conjecture",
        "author": "Lapin_du_charnier",
        "url": "https://www.reddit.com/r/math/comments/10qa1n5/someone_claims_to_have_solved_collatz_conjecture/",
        "text": "[removed]",
        "created_utc": 1675198165,
        "upvote_ratio": 1.0
    },
    {
        "title": "If someone could prove this for me and show their full working it would really help settle an argument I've been having!",
        "author": "LNER4498",
        "url": "https://i.redd.it/8lgrhle2wffa1.jpg",
        "text": "",
        "created_utc": 1675197282,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is it true the set of functions with an infinite or undefined expected value forms a prevalent subset of the set of all functions?",
        "author": "Xixkdjfk",
        "url": "https://www.reddit.com/r/math/comments/10q93ys/is_it_true_the_set_of_functions_with_an_infinite/",
        "text": "[removed]",
        "created_utc": 1675195942,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is it true the set of all functions with an infinite or undefined expected value forms a prevalent subset in the set of all functions?",
        "author": "Xixkdjfk",
        "url": "https://www.reddit.com/r/math/comments/10q90hg/is_it_true_the_set_of_all_functions_with_an/",
        "text": "[removed]",
        "created_utc": 1675195705,
        "upvote_ratio": 1.0
    },
    {
        "title": "What does 40% lower mean?",
        "author": "_Ptyler",
        "url": "https://www.reddit.com/r/math/comments/10q87km/what_does_40_lower_mean/",
        "text": "[removed]",
        "created_utc": 1675193738,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does anyone know how to do this calculus problem?",
        "author": "Outrageous-Lab1852",
        "url": "https://i.redd.it/eu0ccu120hfa1.jpg",
        "text": "",
        "created_utc": 1675192732,
        "upvote_ratio": 1.0
    },
    {
        "title": "Caffeine Body Concentration Estimation",
        "author": "Memeliously",
        "url": "https://www.reddit.com/r/math/comments/10q78xm/caffeine_body_concentration_estimation/",
        "text": "[removed]",
        "created_utc": 1675191427,
        "upvote_ratio": 1.0
    },
    {
        "title": "Hi, I have trouble with function assigments, can you help?",
        "author": "SilverBugs77",
        "url": "https://www.reddit.com/r/math/comments/10q6vuj/hi_i_have_trouble_with_function_assigments_can/",
        "text": " the default function is f(x\\^3-3x\\^2+1) , calculate f(2-  √ 3)\n\nThis is the assigment, I don't know, and I struggle with these assigments. Can you help?",
        "created_utc": 1675190556,
        "upvote_ratio": 1.0
    },
    {
        "title": "Legendre’s formula",
        "author": "Powerful_Length_9607",
        "url": "https://www.reddit.com/r/math/comments/10q6rfa/legendres_formula/",
        "text": "[removed]",
        "created_utc": 1675190270,
        "upvote_ratio": 1.0
    },
    {
        "title": "Having troubles solving a certain geometry problem",
        "author": "Aromatic-Estimate-34",
        "url": "https://www.reddit.com/r/math/comments/10q6hs5/having_troubles_solving_a_certain_geometry_problem/",
        "text": "[removed]",
        "created_utc": 1675189657,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is it me; or, is this daily periodic rate on my Chase statement off by, well, two decimal places? Wouldn’t a .0003 DPR be a .11% interest rate? Can someone explain?",
        "author": "ExposeMyColorado",
        "url": "https://i.redd.it/7b36shl8pgfa1.jpg",
        "text": "",
        "created_utc": 1675189092,
        "upvote_ratio": 1.0
    },
    {
        "title": "Been working on this problem for like an hour and haven’t gotten anywhere, any help would be appreciated",
        "author": "UnicornCobra",
        "url": "https://i.redd.it/ysvcx0rcogfa1.jpg",
        "text": "",
        "created_utc": 1675188795,
        "upvote_ratio": 1.0
    },
    {
        "title": "A New Lower Bound in the abc Conjecture",
        "author": "hedgehog0",
        "url": "https://arxiv.org/abs/2301.11056",
        "text": "",
        "created_utc": 1675186980,
        "upvote_ratio": 1.0
    },
    {
        "title": "How should you read mathematics?",
        "author": "Baldingkun",
        "url": "https://www.reddit.com/r/math/comments/10q54yr/how_should_you_read_mathematics/",
        "text": "I was reading the preface for the student of Linear Algebra Done Right and this quote really catched my eye. I quote \n\n“You cannot read mathematics the way you read a novel. If you zip through a page in less than an hour, you are probably going too fast. When you encounter the phrase “as you should verify”, you should indeed do the verification, which will usually require some writing on your part. When steps are left out, you need to supply the missing pieces. You should ponder and internalize each definition. For each theorem, you should seek examples to show why each hypothesis is necessary. “\n\nWhat do you think? In my case, if I have a good enough feeling of what that particular section was about, I prefer spending more time working on the exercises than scrutinizing the text, since in many cases the exercises already make you re-read and exhaust the text (provided they are good problem sets, of course). I’ve also read from Paul Halmos that the right way to read mathematics is by reading the definitions and main results and then putting the book aside and try to discover the proofs for yourself. \n\nWhat’s your approach? I’m really curious!",
        "created_utc": 1675186518,
        "upvote_ratio": 1.0
    },
    {
        "title": "Are there any theories going more indepth on basic operations (addition, multiplication, etc)",
        "author": "Barrywarry",
        "url": "https://www.reddit.com/r/math/comments/10q4vlh/are_there_any_theories_going_more_indepth_on/",
        "text": "Just want to be surprised, because they don't seem like they can be expanded on more than 1 apple and 1 apple gives you 2 apples. Or are there any other basic operations which aren't talked about as much?",
        "created_utc": 1675185919,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can you solve the puzzle? Here's the deal: there's a smart person out there, and they're trying to figure out what puzzles are in this box. They have no idea what's inside, and they only have one hour to solve it.",
        "author": "Ok-Wish-6433",
        "url": "https://www.reddit.com/r/math/comments/10q4s84/can_you_solve_the_puzzle_heres_the_deal_theres_a/",
        "text": "[removed]",
        "created_utc": 1675185700,
        "upvote_ratio": 1.0
    },
    {
        "title": "Learn PDE constrained optimization",
        "author": "Due-Wall-915",
        "url": "https://www.reddit.com/r/math/comments/10q45pj/learn_pde_constrained_optimization/",
        "text": "I am trying to get started on the PDE constrained optimization specifically deriving adjoints and doing shape optimization. \n\nAre there any good resources on Adjoints of PDEs ?",
        "created_utc": 1675184277,
        "upvote_ratio": 1.0
    },
    {
        "title": "Finding a Shape using Area",
        "author": "TheLeadZebra",
        "url": "https://www.reddit.com/r/math/comments/10q3nlx/finding_a_shape_using_area/",
        "text": "Hi Guys, \n\nGot myself an interesting one, I was wondering if there is any way to approximate a shape with only data on diameter and surface area? \nFor example could I determine that a shape with a diameter of x and an area of y could be sphere-like, or cone like, or octahedron? I'm not expecting an exact answer, but some way of reasoning a similarity to regular shapes",
        "created_utc": 1675183094,
        "upvote_ratio": 1.0
    },
    {
        "title": "Career after studying",
        "author": "N00ukz",
        "url": "https://www.reddit.com/r/math/comments/10q2jf4/career_after_studying/",
        "text": "Hi! At the moment I'm finishing my bachelor's degree in mathematics after which I will proceed for a masters degree (in number theory probably). However, I'm a bit at a loss for future career paths and the possibilities. I'm told that the possibilities are almost endless, but it feels really vague. During the masters I would like to work 12 ish hours, but I have no idea in what field or whatever. Soooo I wanted to ask what you all do and if you have tips on what to look for :) \n\nTl;dr: career tips for a starter, where to look and what do you do?",
        "created_utc": 1675180462,
        "upvote_ratio": 1.0
    },
    {
        "title": "Effective Learning Approach For Noobs ?",
        "author": "Intelligent-Dot9293",
        "url": "https://www.reddit.com/r/math/comments/10q1vuc/effective_learning_approach_for_noobs/",
        "text": "[removed]",
        "created_utc": 1675178866,
        "upvote_ratio": 1.0
    },
    {
        "title": "I am bad at maths and I want to start from the beginning. Is there any good source to clear my concepts?",
        "author": "prrrrtat",
        "url": "https://www.reddit.com/r/math/comments/10q122q/i_am_bad_at_maths_and_i_want_to_start_from_the/",
        "text": "",
        "created_utc": 1675176897,
        "upvote_ratio": 1.0
    },
    {
        "title": "Software for math",
        "author": "Glittering-Table-595",
        "url": "https://www.reddit.com/r/math/comments/10q0ho5/software_for_math/",
        "text": "Is there any software like Pearson’s MyMathLab that someone could get without being a student? I think MyMathLab is great and would love to have something like that to keep up with my previous math topics while also tracking my progress of things I’m currently working on. So far everything I’ve found you can’t buy, you need to be a student.",
        "created_utc": 1675175456,
        "upvote_ratio": 1.0
    },
    {
        "title": "If I've had total of 464 meetings and missed 16 of those, what % of the total meetings did I miss?",
        "author": "BunX_2021_",
        "url": "https://www.reddit.com/r/math/comments/10q05t0/if_ive_had_total_of_464_meetings_and_missed_16_of/",
        "text": "[removed]",
        "created_utc": 1675174613,
        "upvote_ratio": 1.0
    }
]