[
    {
        "title": "New companion for med school journey!",
        "author": "kingkongjames23",
        "url": "https://i.redd.it/wkj81t1wrena1.jpg",
        "text": "",
        "created_utc": 1678652554,
        "upvote_ratio": 1.0
    },
    {
        "title": "Good luck to all for Match Week 2023",
        "author": "nsgy94",
        "url": "https://www.reddit.com/r/medicalschool/comments/11pop5o/good_luck_to_all_for_match_week_2023/",
        "text": "[removed]",
        "created_utc": 1678652434,
        "upvote_ratio": 1.0
    },
    {
        "title": "Should I wear my white coat?",
        "author": "justDOit2026",
        "url": "https://www.reddit.com/r/medicalschool/comments/11po938/should_i_wear_my_white_coat/",
        "text": "I am currently a med student on medical leave from school, and I shadow a doctor tomorrow (immunologist/allergy/asthma). Do I wear my white coat or just professional attire? TIA!",
        "created_utc": 1678651386,
        "upvote_ratio": 1.0
    },
    {
        "title": "M4 on rotation till end of month",
        "author": "erikos718",
        "url": "https://www.reddit.com/r/medicalschool/comments/11po7vk/m4_on_rotation_till_end_of_month/",
        "text": "Made the mistake of scheduling a rotation for March with what I thought would be a chill attending. He’s expected I act like a sub I, writing notes carrying a decent amount of patients, nothing too wild tho. \nI want to ask if I can not return after Match day even though I’m scheduled for like six shifts March 19-27. \nAnyone had any luck with this? Or do I just grin and bear it.",
        "created_utc": 1678651305,
        "upvote_ratio": 1.0
    },
    {
        "title": "Worst “read my mind” or unclear question?",
        "author": "burnout457",
        "url": "https://www.reddit.com/r/medicalschool/comments/11po4d0/worst_read_my_mind_or_unclear_question/",
        "text": "Attending: What is a tension pneumothorax?\n\nMe: When air builds up in the pleural space, causing pressure to increase and the mediastinum to shift?\n\nAttending: No. Sub-I, do you know what a tension pneumothorax is?\n\nSub-I: I thought it’s what the M2 said, I’m not sure\n\nAttending (rolling his eyes), to the intern: Do you know what a tension pneumothorax is?\n\nIntern: Uhh, if it’s not what the M2 said, I don’t know\n\nResident: It’s where air gets in the pleural space and can’t get out\n\nAttending: Correct\n\nLikeeeee fair, but he could’ve asked “Why does the pressure build up” and I would’ve understood. Less of a read my mind question, but what are some of the worst offenses you’ve gotten?",
        "created_utc": 1678651085,
        "upvote_ratio": 1.0
    },
    {
        "title": "Any other female students get annoying commentary about their personal lives?",
        "author": "rain6304",
        "url": "https://www.reddit.com/r/medicalschool/comments/11po0tl/any_other_female_students_get_annoying_commentary/",
        "text": "Inspired by the other post asking if we were mistaken for nurses a lot. \n\nI am obvi a baby in this whole process but I did work in the emergency room for 2.5 years and boy did I get comments... not just from patients but from family. \n\nThe first words out of my grandmother's mouth when I told her I got in: \"How will you ever find a husband now? You could've found a husband if you did computer science!\"\n\nMy mom: \"If you were my son, I would not want you marrying a girl like you. You're going into medicine and will be far too busy to care for him, the house, and your children.\"\n\nMy dad: \"You are going to have a really hard marriage going this route.\" (though he has been super supportive through this process - helped me with every interview and reading every personal statement iteration and editing secondaries - I would say my mom was more of the problem.)\n\nA lot of other little snippy comments too: \"Oh my, you'll get married quite late, then?\" \"How will you care for your children?\" \"Don't you feel guilty choosing your career over your future kids?\" (this was from a patient I was making small talk with and trying to make comfortable during triage). \"The only guys you'll meet are going to be doctors... I've heard doctor-doctor relationships turn out bad!\" (from a peer in a humanities class in undergrad). \"Aren't you worried about your kids having Down syndrome? Cause you'll have them so late\" (was seeing a patient with a Dr. who evaluates postpartum pts)\n\nLike... I have guy friends (whom I love, no hate at all) who are in med school and they get showered with nothing but praise. There's no questions about how they'll treat their wives or kids.\n\nI know it'll be really hard. I'm gonna do my best, because I want kids, and I am going to do all I can so that medicine is not my life (choosing specialty, etc). I know it will be hard and I've been honest with every guy I've dated about the realities of medicine.  But goddamn, does it get annoying as hell to get the constant commentary on a theoretical family I have not yet had the opportunity to 'ruin' simply for my gender. I know it's kind of a small, silly thing - many people have much bigger problems. But it's just kind of annoying. \n\nAny other female students relate to this frustration?",
        "created_utc": 1678650850,
        "upvote_ratio": 1.0
    },
    {
        "title": "No matter the result its gonna be okay tomorrow from a cardiologist who didn't get the news they wanted on match day",
        "author": "docmahi",
        "url": "https://www.reddit.com/r/medicalschool/comments/11pnw2m/no_matter_the_result_its_gonna_be_okay_tomorrow/",
        "text": "(US IMG Caribbean grad) \n\nFirst time I went through match I withdrew because I got no interviews (applied late) \n\nSecond time I applied rads and IM (rads had a historically down year) ended up with more rads than IM interviews but matched IM (was my backup).  Was super pissed on match day but made the best of it and it ended up being the best thing that could have happened to me, found cardiology and never looked back.  So for those who get wonderful news tomorrow I'm thrilled and happy for you - for those who don't get the news they want either today or friday, it will all work out and I'm wishing you the best. \n\n&amp;#x200B;\n\nGood luck and I'm proud of all of you",
        "created_utc": 1678650536,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is a 35 minute commute to school every day too much?",
        "author": "sendhelpimnotokay",
        "url": "https://www.reddit.com/r/medicalschool/comments/11pnkbx/is_a_35_minute_commute_to_school_every_day_too/",
        "text": "I’ve found a nice place to live but it’s pretty far from campus. In undergrad I lived maybe 5-10 minutes away from campus so I’m just curious if 35 minutes is too far to make every single day. Looking for advice from other commuters.",
        "created_utc": 1678649760,
        "upvote_ratio": 1.0
    },
    {
        "title": "Fox News Article",
        "author": "solitarynucleuss",
        "url": "https://www.reddit.com/r/medicalschool/comments/11pnjni/fox_news_article/",
        "text": "https://www.foxnews.com/politics/indiana-medical-students-dei-instruction-gender-basic-human-structure-course\n\nThis horrifying article came up on my smartnews feed today - I'm actually appalled by this article and the news clip they show at the top of the page. They act as if diversity in medical schools is the downfall of medicine and also imply that because medical schools talk about white privilege and racial disparities in Healthcare they are also failing to teach medical students about lifesaving measures. What are these people on??",
        "created_utc": 1678649718,
        "upvote_ratio": 1.0
    },
    {
        "title": "Help Please! Insightful Questions to ask during Observership",
        "author": "friend_of_the-pod",
        "url": "https://www.reddit.com/r/medicalschool/comments/11pn9o4/help_please_insightful_questions_to_ask_during/",
        "text": "Searched for previous posts asking this question but couldn't find any good answers. \n\nAnyone know any insightful questions to ask while shadowing? Like more than the common questions like \"how did you come to choose this specialty\"\n\nI'm an M1 who'll be shadowing in ENT all day tomorrow.",
        "created_utc": 1678649082,
        "upvote_ratio": 1.0
    },
    {
        "title": "What order did you do your MS3/4 rotations?",
        "author": "xHodorx",
        "url": "https://www.reddit.com/r/medicalschool/comments/11pn8pa/what_order_did_you_do_your_ms34_rotations/",
        "text": "Jw how everyone has done or did their clerkships.",
        "created_utc": 1678649017,
        "upvote_ratio": 1.0
    },
    {
        "title": "Anyone willing to review my Personal Statement for me for SOAP?",
        "author": "BrilliantOcean",
        "url": "https://www.reddit.com/r/medicalschool/comments/11pn7aj/anyone_willing_to_review_my_personal_statement/",
        "text": "I'm gonna be SOAPing tomorrow, and was wondering if anyone would be willing to please read my personal statement for me. I'd REALLY appreciate it! Thank you so much!!",
        "created_utc": 1678648923,
        "upvote_ratio": 1.0
    },
    {
        "title": "Half these PhDs would attempt to Frankenstein something if it were allowed.",
        "author": "Shonuff_of_NYC",
        "url": "https://i.redd.it/7ww7dnhmcena1.jpg",
        "text": "",
        "created_utc": 1678647420,
        "upvote_ratio": 1.0
    },
    {
        "title": "Literally don’t have the energy to SOAP",
        "author": "ruetheflamacue",
        "url": "https://www.reddit.com/r/medicalschool/comments/11pm8dm/literally_dont_have_the_energy_to_soap/",
        "text": "Still fried and burned out from having applied a surgical subspecialty from a weak home program. I do not feel I have the energy to SOAP should things not go my way tomorrow. I have nothing left to give to medicine.",
        "created_utc": 1678646706,
        "upvote_ratio": 1.0
    },
    {
        "title": "oh my….",
        "author": "Conscious-Brush9962",
        "url": "https://v.redd.it/zms8dkft7ena1",
        "text": "",
        "created_utc": 1678645803,
        "upvote_ratio": 1.0
    },
    {
        "title": "Thoughts on a reformed medical education?",
        "author": "TigerTheMajestic1",
        "url": "https://www.reddit.com/r/medicalschool/comments/11plifl/thoughts_on_a_reformed_medical_education/",
        "text": "[removed]",
        "created_utc": 1678645048,
        "upvote_ratio": 1.0
    },
    {
        "title": "SOAP tips from a former SOAPer PGY-1",
        "author": "samalander43",
        "url": "https://www.reddit.com/r/medicalschool/comments/11pl3zv/soap_tips_from_a_former_soaper_pgy1/",
        "text": "I'm sorry if you wake up tomorrow to the worst email. It's game time, put your ego aside and get to work. All of us who have had to go through SOAP are rooting for you!\n\nRule #1: TRUST NOONE.\nHave a good response for \"Why did you not match?\" and \"Why X specialty\" or \"Why X city/state\"\nUpdate personal statement, cater it to the specialty you are trying to SOAP into.\nDon't be afraid to ask your SO or a friend for help. \nUse a calendar like Google to schedule interviews.\nExpect lots of phone calls and turn off any spam filters.\nIf you live on western half of US, be prepared to interview from 5 AM until 5PM. \nTry to read through the lines on why a program didn't match all spots.\nMake sure you eat and hydrate throughout the day. Cortisol burns through your energy reserve.\nIts okay to be stressed, but try not to sound desperate. The programs are aware how stressful the process is.\nOn Wednesday night, make a rank list for yourself in case you get multiple offers.\nDon't be afraid to reach out to a Redditor offering help.\n\nFormer SOAPers, Please feel free to add more tips to this thread.",
        "created_utc": 1678644092,
        "upvote_ratio": 1.0
    },
    {
        "title": "Anyone's school have a medical interpreting elective?",
        "author": "Bomjunior",
        "url": "https://www.reddit.com/r/medicalschool/comments/11pkrbr/anyones_school_have_a_medical_interpreting/",
        "text": "Hi all. Trying to find some 4th year electives. Wondering if anyone goes to a school or knows of a school that offers medical interpreting or a language course tailored to medicine (prefer online but can be flexible). Looking for languages either in ASL, spanish, Korean, or Vietnamese!",
        "created_utc": 1678643280,
        "upvote_ratio": 1.0
    },
    {
        "title": "I knew this guy on bootcamp looked familiar",
        "author": "IndependentTrue",
        "url": "https://i.redd.it/1eeyzjvwgcna1.png",
        "text": "",
        "created_utc": 1678642844,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is it like to have parents that are doctors?",
        "author": "Salty_Bench8448",
        "url": "https://www.reddit.com/r/medicalschool/comments/11pkgvv/what_is_it_like_to_have_parents_that_are_doctors/",
        "text": "My parents are not even remotely in professions related to healthcare so I never talk to them about medical things except when it's one of us having a health issue. For people that have one or both parents that are doctors, what is your experience like? Do you get to discuss interesting cases? Do they help you understand difficult topics? Do you like being able to relate on that level? Personally I like not having doctor parents and medicine being \"my thing\" although now that I think about it it would be great to have my parents as mentors and role models in the medical field.\n\nFor people that don't have doctor parents, do you wish you did?",
        "created_utc": 1678642604,
        "upvote_ratio": 1.0
    },
    {
        "title": "Random Rant: Whenever I get Handoff in the Morning for ICU, the Night NPs/PAs Repeatedly Mess Up The Patients",
        "author": "NoImagination6",
        "url": "https://www.reddit.com/r/medicalschool/comments/11pk5pm/random_rant_whenever_i_get_handoff_in_the_morning/",
        "text": "Doing ICU in a community hospital (in a big city) that sold out its interests and lets NPs/PAs do a lot of ICU work with an ICU attending \"on call\" (like literally you'd have to call them to get them in the building). I'm lower on the totem poll so I can't really change much of the bureaucracy. However, I will admit that the night NPs/PAs whenever giving me handoff seem to mess up my patients. Some examples:\n\n&amp;#x200B;\n\n1. ESRD patient, intubated sedated- morning K+ is 3.4 mEq, they \"replete\" with 40 IV, 40 PO via NG/OG- instead of waiting for dialysis bath that is pending today, by 9 AM the patient is having an arrhythmia and I check a spot K+ and it's like 5.4...\n2. Overly sedating every patient that dares to move or make an utterance at night. For example, a cirrhotic patient on my list got 1g of Alprazolam for being \"difficult\" and then another 2g of alprazolam because \"he's a big guy\". We were planning on working towards extubation but he was just knocked out for 1.5 days\n3. Hemoglobin of 6.3 at 4 AM in another cirrhotic, who got banded like a week ago. Handoff is happening at 7AM. NP figured, \"he's always doing this, so I figured y'all might wanna call hepatology again\"- no transfusion in the interim, patient looks pale, has needed increased pressors. \n4. Another ESRD patient with an EF of 15%, who got dialysis on Friday in the afternoon, lactate going up. Tachypnea and tachycardia. \"Chest X-ray looked bad so I thought this was SIRS and gave 2L of fluid bolus and started a bag of NS at 125cc\", patient is literally getting drowned to death.  \n\n  \nI could go on and on, but for my sanity I think I'll pass...I know IM/CC has a fair share of decision making and some line placements, making it amenable for mid-level integration if you're a hospital, but I feel like whenever there's a differential in learning, there's going to be a differential in application. \n\n&amp;#x200B;\n\nYou wouldn't say that it is \"politically incorrect\" to call an AI that has undergone machine learning with more data for a longer period of time more optimal for processing and completing a task with higher fidelity than another program that has a simplified learning bank with less hours and less time for it's learning processing.",
        "created_utc": 1678641884,
        "upvote_ratio": 1.0
    },
    {
        "title": "To all those who will be expecting an email tomorrow.",
        "author": "phunterdot",
        "url": "https://www.reddit.com/r/medicalschool/comments/11pjuaa/to_all_those_who_will_be_expecting_an_email/",
        "text": "I wish you MATCH in your desired speciality, sending you all goood and positive vibes.   \nMay tomorrow bring you joy!",
        "created_utc": 1678641133,
        "upvote_ratio": 1.0
    },
    {
        "title": "Struggling with Life Goals",
        "author": "throwaway190102010",
        "url": "https://www.reddit.com/r/medicalschool/comments/11pjqo3/struggling_with_life_goals/",
        "text": "We're going to graduate and then we get to become a doctor. Cool. What's next?  \nHealing patients is amazing, but there's more to life than JUST that..right?  \nDid I choose the wrong field..?\n\nGet a fancy car? cool. The high off of that is only going to last 3-4 months max.\n\nGet a big house? cool. I now have a bigger living space that looks cool. That's basically it.\n\nTravel? I kind of find it weird that everyone's life goal is to travel around the world. I fail to see how it's fulfilling to just see new places. In perspective, pretend you're given a ticket to see each tourist attraction in the world. Now you come back home after seeing the last possible thing to see. What's next? Is that it? Does life's purpose just end when you see all there is to see?\n\nGet married and have a family? Wish I could, still single and pushing 30. This would probably be the biggest goal that I currently have. This is the only realistic thing that would give me satisfaction. Raising a kid and having them be successful in life would bring me joy but that's the only thing I can think of.\n\nI'm sorry y'all, this was such a Debby Downer post, but I refuse to put a smile on my face and say that I know what I want to do with the rest of my life.",
        "created_utc": 1678640901,
        "upvote_ratio": 1.0
    },
    {
        "title": "Babinski's sign",
        "author": "beatslayer23",
        "url": "https://www.reddit.com/r/medicalschool/comments/11piive/babinskis_sign/",
        "text": "For a stroke causing hemiparesis, do we expect a positive Babinski on the affected side? Or will it be  bilateral?",
        "created_utc": 1678638063,
        "upvote_ratio": 1.0
    },
    {
        "title": "Consulting",
        "author": "iamscared4209",
        "url": "https://www.reddit.com/r/medicalschool/comments/11pid2b/consulting/",
        "text": "How many of you want to open a private practice but it seems overwhelming. Thinking of starting a consulting company but not sure if there is demand or desire.",
        "created_utc": 1678637687,
        "upvote_ratio": 1.0
    },
    {
        "title": "Medical School Advice",
        "author": "Odd_Okra_6336",
        "url": "https://www.reddit.com/r/medicalschool/comments/11phqd5/medical_school_advice/",
        "text": "[removed]",
        "created_utc": 1678636180,
        "upvote_ratio": 1.0
    },
    {
        "title": "A call to be civil tomorrow",
        "author": "CatoIntern",
        "url": "https://www.reddit.com/r/medicalschool/comments/11phhtc/a_call_to_be_civil_tomorrow/",
        "text": "As Match Day draws near, tensions and emotions are understandably high. This is just a gentle request to everyone to please be considerate and civil to each other, no matter what ends up happening with your application. There are lots of human beings on this subreddit experiencing states of emotion tomorrow. And we're all colleagues and co-students here so we need to have each others' backs, because nobody else will.\n\nIf you matched but not to your first specialty, please don't over dramatize that and act like your life is ruined. Yes, it may not be the greatest feeling to get #3 when you thought you were a shoo-in for #1 or #2. But consider that people reading your comment may have gotten their #9 or #10. They may be facing the prospect of moving far away from family or breaking up with a significant other. Or any number of other huge problems that they must now tackle. Some people reading these comments may not even have matched at all.\n\nIf you SOAP'd, please try to internalize it with some civility and grace. **I myself SOAP'd** so I really intimately understand the pain, frustration and depression that comes with getting that horrible notification. But it doesn't mean that the medical students who got those positions instead of you are rich kids who had connections. It doesn't mean they're \"just better at schmoozing\" and that's why they got the offer. It doesn't mean the entire medical system is out to get you and needs to be burned down. In all honesty, it probably just means... your application wasn't that good, you had red flags, or you didn't apply broadly enough. There is no shame in admitting that. Nobody is perfect.\n\nGood luck tomorrow! The whole process is stressful and sucks, but there's a light at the end.",
        "created_utc": 1678635589,
        "upvote_ratio": 1.0
    },
    {
        "title": "Do I Dual Apply Med-Derm and IM?",
        "author": "cholla11",
        "url": "https://www.reddit.com/r/medicalschool/comments/11phd5k/do_i_dual_apply_medderm_and_im/",
        "text": "I have always planned to go into IM, and have made great connections with IM faculty and have IM based research papers. Recently, I have developed an interest in complex medical dermatology, and have looked into IM-derm joint residency programs. Additionally, I have one \"pure\" derm paper with 0 ties to IM at all. I would love to match into a top IM residency, but fear that doing an derm fourth year rotation when paired with my derm paper would make it seem to IM programs that I am using IM as a backup, when I am honestly not, and truly just find it interesting, and may consider applying into a few Med-Derm programs as well. How would you go about handling this to not make it seem distasteful? Any tips?",
        "created_utc": 1678635258,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why do I get hives only when I’m at a certain persons house?",
        "author": "annieleesh",
        "url": "https://www.reddit.com/r/medicalschool/comments/11ph37n/why_do_i_get_hives_only_when_im_at_a_certain/",
        "text": "[removed]",
        "created_utc": 1678634561,
        "upvote_ratio": 1.0
    },
    {
        "title": "Being a “known commodity” in your home program for competitive specialties - any stories?",
        "author": "SmexySkeltal",
        "url": "https://www.reddit.com/r/medicalschool/comments/11pgvfh/being_a_known_commodity_in_your_home_program_for/",
        "text": "If you are well-known and well-liked by your home department for a competitive specialty, how much weight does it have? Would it offset below average grades or Step 2 score?\n\nWant to hear people’s experiences - how did you become a known commodity and how did things end up?",
        "created_utc": 1678634032,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why do obstructive lung diseases mostly affect expiration?",
        "author": "SurprisingDistress",
        "url": "https://www.reddit.com/r/medicalschool/comments/11pgpai/why_do_obstructive_lung_diseases_mostly_affect/",
        "text": "With restrictive lung diseases the problems make more sense to me conceptually. I imagine the lung parenchyma to be more stiffened, so blowing them up like a balloon costs more effort, whereas the mechanism of deflating them isn't really affected (but if you inhale less, you will exhale less).\n\nWith obstructive lung diseases, I imagine the pulmonary walls to be slightly weaker, but also the lumens to be smaller (through smooth muscle contraction or literal obstructions like a tumor or excess mucus). I understand why this would cause wheezing and a prolonged expiration, but why doesn't this necessarily affect inspiration? There is less space for air to quickly move out of the alveoli, but there's also less space for it to move into them, right? Does the obstruction counterintuitively have little to do with the cause of the symptoms in obstructive lung disease? Is the problem mostly related to the weakened pulmonary vessels (outward airflow causes them to want to collapse)?\n\nAny insight is appreciated.",
        "created_utc": 1678633634,
        "upvote_ratio": 1.0
    },
    {
        "title": "ChatGPT usage in studying",
        "author": "vasyleus",
        "url": "https://www.reddit.com/r/medicalschool/comments/11pgh2g/chatgpt_usage_in_studying/",
        "text": "Hey,  \n\n\nWho has any experience related to the usage of ChatGPT in your clinical studying. Can it be somehow useful?",
        "created_utc": 1678633082,
        "upvote_ratio": 1.0
    },
    {
        "title": "Being overweight in med school",
        "author": "Chron_ill_and_gay",
        "url": "https://www.reddit.com/r/medicalschool/comments/11pg729/being_overweight_in_med_school/",
        "text": "[removed]",
        "created_utc": 1678632355,
        "upvote_ratio": 1.0
    },
    {
        "title": "What CRNAs think",
        "author": "Dr_trazobone69",
        "url": "https://i.redd.it/uesrhhj70dna1.jpg",
        "text": "",
        "created_utc": 1678631137,
        "upvote_ratio": 1.0
    },
    {
        "title": "Are your peers competitive or friendly?",
        "author": "plasticpumpkinpies",
        "url": "https://www.reddit.com/r/medicalschool/comments/11pfd79/are_your_peers_competitive_or_friendly/",
        "text": "[removed]",
        "created_utc": 1678630071,
        "upvote_ratio": 1.0
    },
    {
        "title": "POV: you are in your first year of college",
        "author": "Emotional-Weather960",
        "url": "https://www.reddit.com/r/medicalschool/comments/11pf5s5/pov_you_are_in_your_first_year_of_college/",
        "text": "[removed]",
        "created_utc": 1678629501,
        "upvote_ratio": 1.0
    },
    {
        "title": "Please support this M4 who had a stroke and has to pull out of the match",
        "author": "Md2be2021",
        "url": "https://gofund.me/48002ee0",
        "text": "",
        "created_utc": 1678629351,
        "upvote_ratio": 1.0
    },
    {
        "title": "Editing a manuscript",
        "author": "Lonely-Repeat-2093",
        "url": "https://www.reddit.com/r/medicalschool/comments/11pemc3/editing_a_manuscript/",
        "text": "Hello! My research supervisor has sent me an email asking me to edit a research manuscript and then be a co-author on it. I am absolutely ecstatic about this, but honestly, have never edited one before. Does anyone have any general tips on how to go about doing this? Does it mean editing for spelling grammar + looking at flow of the paper? \n\nAny help at all would be so incredibly appreciated!",
        "created_utc": 1678627897,
        "upvote_ratio": 1.0
    },
    {
        "title": "VSLO/4th Year Aways Planning",
        "author": "itsmiinh",
        "url": "https://www.reddit.com/r/medicalschool/comments/11pedq3/vslo4th_year_aways_planning/",
        "text": "[removed]",
        "created_utc": 1678627179,
        "upvote_ratio": 1.0
    },
    {
        "title": "X is going be a bloodbath this year. TL;DR path is underrated",
        "author": "match324",
        "url": "https://www.reddit.com/gallery/11pe79b",
        "text": "",
        "created_utc": 1678626622,
        "upvote_ratio": 1.0
    },
    {
        "title": "Working out in residency",
        "author": "RaspberryScary2839",
        "url": "https://www.reddit.com/r/medicalschool/comments/11pe5ld/working_out_in_residency/",
        "text": "M4 here starting residency soon. I have been really big into fitness the past year and it really changed my life. I am scared once I start residency, it'll all go back downhill. Those who are currently in residency, can you tell me how you incorporate working out with a busy schedule?",
        "created_utc": 1678626475,
        "upvote_ratio": 1.0
    },
    {
        "title": "Ortho vs ENT",
        "author": "Mofalcon",
        "url": "https://www.reddit.com/r/medicalschool/comments/11pdqqz/ortho_vs_ent/",
        "text": "Non-US/Non-EU entering their final year as a med student planning to do residency in Germany. I can't pick between those 2 specialities. Still have not rotated in any of them. My heart tells me Ortho but my brain tells me ENT.  \n\n\nWhat I'm looking for in a speciality:  \n\\-I want to fix problems not just manage them.  \n\\-I dislike medical management.  \n\\-I don't hate clinic but I don't love it either. I do realize I need those slow clinic days in order to enjoy those fun OR days.   \n\\-I am interested in private practice.  \n\\-Good work life balance post-residency. Still not sure how to define that.  \n\\-I'm not particularly passionate about medicine. Medicine is a job at the end of the day. I do love surgery and it is the only type of medicine I can imagine myself doing but it'll always be a job.   \n\\-Interested in doing international medical missions and traveling to underserved areas. I personally come from an underserved area.  \n\\-Interested in doing some Locum work at the early stages of my career.  \n\\-I tend to get bored easily and really quick. \n\n&amp;#x200B;\n\nOrtho:   \n\\-The initial reason I wanted to do medicine. I had multiple sport injuries as a teenager.  \n\\-Super high demand with a growing elderly population. Outside of sports and trauma, not the most interesting patient population.  \n\\-Really cool surgeries.  \n\\-Immediate impact on patients with great results.  \n\\-You restore the function of body parts.  \n\\-Never seen a more burnt out group of people in my life. In my hospital, ortho residents are the most overworked people I've ever seen. Also everyone hates the residents and attendings for some reason.  \n\\-Attending married to their speciality.  \n\\-Not a big fan of trauma or the ER setting.  \n\\-Private practice ortho is not my cup of tea.  \n\\-More opportunities to do Locum and travel on medical missions.\n\n&amp;#x200B;\n\nENT:  \n\\-Pretty cool anatomy  \n\\-A mix of medicine and surgery. Not the biggest fan of medical management, but I do realize that when I'm 50 I'd appreciate the slower nature of clinic.  \n\\-A lot of interesting reconstructive surgery with Head and Neck and Face Plastics. Free flaps and reconstructive surgery sounds like science fiction and is the coolest type of surgery.  \n\\-Can do plastics for the $$ if I want  \n\\-You restore the function of body parts as well.   \n\\-I kinda enjoy watching ENT surgeries more than Ortho (on youtube).   \n\\-A lot of outpatient procedures. Mixed feelings about this because procedures don't really fill my surgery itch.   \n\\-Never met an unhappy/burnt out resident/attending. Everyone seems to love ENT.  \n\\-The bread and butter seems to be more boring. Now boring is not always bad. Boring can be good in order to enjoy the less boring.   \n\\-The pediatric population is not my favorite.  \n\\-Not many Locum opportunities but some interesting options to travel on medical missions.",
        "created_utc": 1678625206,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do I report absences due to acute psychosis?",
        "author": "No_Protection_2903",
        "url": "https://www.reddit.com/r/medicalschool/comments/11pd8s5/how_do_i_report_absences_due_to_acute_psychosis/",
        "text": "[removed]",
        "created_utc": 1678623597,
        "upvote_ratio": 1.0
    },
    {
        "title": "How competitive/IMG-friendly is clinical genetics?",
        "author": "Life_Huckleberry6230",
        "url": "https://www.reddit.com/r/medicalschool/comments/11pcmgg/how_competitiveimgfriendly_is_clinical_genetics/",
        "text": "\nI’m a hungarian med student who wants to do the USMLE after graduation and I wanna be a clinical geneticist (in NYC or LA if it’s doable). I have many interests (psychiatry, haematology, dermatology) besides that but that is my number one interest rn. How hard it is to get in as an IMG in general/compared to the other three fields that I listed?",
        "created_utc": 1678621529,
        "upvote_ratio": 1.0
    },
    {
        "title": "Seeking advice on communication skills:",
        "author": "DiprivanDiva",
        "url": "https://www.reddit.com/r/medicalschool/comments/11pbzys/seeking_advice_on_communication_skills/",
        "text": "I’m a fifth year student in the EU, so getting close to graduating soon, and we have been spending a lot of time in the simulation lab. Unfortunately it’s been a pretty frustrating experience for me. I struggle with sitting around for hours watching cases, and when my turn finally came a few days ago the case was a disaster. \n\nThe case was pneumonia septic shock, so we had to do the whole thing from diagnosis to stabilization. I stepped back for the interview and let my classmates ask a lot of questions without interrupting because there were a lot of cooks in the kitchen. When we reached the workup I tried to insist on an CXR and urinalysis to rule in/out the two biggest suspects. My classmates “outvoted” me on that. Next when it came to fluid resuscitation I asked to hang two liters as an initial volume booster, and my classmate told me I should only order 1800 ml (kgx30ml) and just wanted to endlessly split hairs over dumb stuff. \n\nWhen it came to the debrief I was so angry because we lost points for not doing a correct work up (CXR, urinalysis and cultures), and over a few other things that I was alone on wanting to do. The instructor also commented that we didn’t work well together. \n\nI worked as a paramedic for a while before med school, and have spent a lot of time recently in the ICU and ED. In my past experiences there has been really clear leadership, and very little argument about who’s plan to follow. \n\nI really would appreciate some thoughts on how to navigate situations where the chain of command isn’t clear/clinical disagreements arise among peers. \n\nHow can I respectfully communicate with my peers when I see mistakes happening but they think otherwise? Is there a nice way to point out that something is within my area of experience without coming off like a pissing contest?",
        "created_utc": 1678619275,
        "upvote_ratio": 1.0
    },
    {
        "title": "How competitive/IMG-friendly is clinical genetics?",
        "author": "Matt01116",
        "url": "https://www.reddit.com/r/medicalschool/comments/11pb7l0/how_competitiveimgfriendly_is_clinical_genetics/",
        "text": "[removed]",
        "created_utc": 1678616434,
        "upvote_ratio": 1.0
    },
    {
        "title": "Question",
        "author": "notanisha1103",
        "url": "https://www.reddit.com/r/medicalschool/comments/11pb5xb/question/",
        "text": "FOR THE LOVE OF GOD CAN SOMEONE EXPLAIN THE DIFFERENCE BW GAMETE AND GAMETOPHYTE (I'm in 12th and I still don't know its shameful)",
        "created_utc": 1678616276,
        "upvote_ratio": 1.0
    },
    {
        "title": "Will my chances of matching be good if I apply to like 230 programs?",
        "author": "BruhYear",
        "url": "https://www.reddit.com/r/medicalschool/comments/11paru4/will_my_chances_of_matching_be_good_if_i_apply_to/",
        "text": "So I’m a US IMG, and had to stay in my country for undergrad due to family reasons,\n\nHowever, now I want to do an internship in the us, preferably general surgery or IM.\n\nI have a good LOR from my dean (who is a CT surgeon, as well as one from my anatomy HOD). Also I have 3 months of USCE. I graduated this year.\n\nI was going to apply to 100+ GS and 100+ IM programs and take a spot wherever I can get it. I have no interest in doing a fellowship so the prestige of the program does not matter. I have to stress that I will be applying extremely broadly , to community programs as well.\n\nIf I apply to this many programs, isn’t there a solid chance that at least one place will accept me? I checked out the NRMP charting outcomes and it showed a p=1.00 for more than 20 contiguous programs ranked.\n\nMoney is not an issue since I’ve been working on the side to save up.",
        "created_utc": 1678614912,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to overcome setbacks, adversity, and failure",
        "author": "Ok_Duck_4702",
        "url": "https://www.reddit.com/r/medicalschool/comments/11p9qji/how_to_overcome_setbacks_adversity_and_failure/",
        "text": "I made this video to help someone out with overcoming failure, setbacks, or adversity. Hope you find it useful. Constructive feedback welcome\n\n&amp;#x200B;\n\n[https://youtu.be/J\\_R70xtfgE0](https://youtu.be/J_R70xtfgE0)",
        "created_utc": 1678611053,
        "upvote_ratio": 1.0
    },
    {
        "title": "What are some unique ways to motivate someone to study harder?",
        "author": "bring_rice",
        "url": "https://www.reddit.com/r/medicalschool/comments/11p8io5/what_are_some_unique_ways_to_motivate_someone_to/",
        "text": "Hey r/medicalschool ! \n\nI'm dating this girl who is studying for MLE Step 1. She occasionally gets overwhelmed with the quantum of the syllabus. I'm not from the medical field, but I try to help out however I can. \n\nI am trying to come up with some unique ways to help her push herself. Could you please help me with some suggestions? What are some things that worked for you?",
        "created_utc": 1678606291,
        "upvote_ratio": 1.0
    },
    {
        "title": "Clinical outpatient specialties with some procedures besides family med?",
        "author": "SvenTheTon78",
        "url": "https://www.reddit.com/r/medicalschool/comments/11p5koi/clinical_outpatient_specialties_with_some/",
        "text": "So here I am a few rotations into my clinical years, and I have come to quite the realization: I really kinda hate being in the hospital. I think I always had a sense of this, but was pretty embarrassed about admitting it out of some amorphous fear that it made me something less than a proper med student. But I've gotten to do my fam med clerkship followed by my IM clerkship, and the difference is just night and day for me. I really love the feel of clinic and seeing patients. I had crossed surgery off my list very early because I don't love the OR, but I was surprised by how much I enjoyed doing smaller procedures in family med clinic. \n\nI still have some remaining hesitancy about primary care. I am the type of person that really enjoys deep diving into a particular thing, and would not mind seeing the same problems over and over again, vs seeing a million different things that walk in the door.\n\nI went through my preclinical years very undecided, and really hoped something would jump up and grab me during Y3. I haven't found that thing yet, but I do think this has been some good insight I have had. So I was wondering if anyone can speak to any other specialties that you can exist pretty much exclusively in an outpatient setting, and potentially have access to some procedures. Derm I suppose is an obvious one, but truth be told, I have not been really crafting my resume for that, and have doubts that I could be competitive for it starting now. Would be open to any suggestions!\n\nThank you!",
        "created_utc": 1678596544,
        "upvote_ratio": 1.0
    },
    {
        "title": "Half of my class when a professor says being obese is unhealthy",
        "author": "Opening_Suspect5632",
        "url": "https://i.redd.it/g5dp3yhk0ana1.gif",
        "text": "",
        "created_utc": 1678594941,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can’t find time/energy to work out",
        "author": "another_weird_premed",
        "url": "https://www.reddit.com/r/medicalschool/comments/11p4q71/cant_find_timeenergy_to_work_out/",
        "text": "Last year during my gap year, my schedule was so repetitive and I finished every day at ~5pm so I always had a set time to work out. \n\n\nMy sleep schedule is always incredibly sensitive to disturbance (I’m just like this, ive seen docs etc), so I’m always in the vicious cycle of catching up on sleep, catching up on studying, catching up with doing the dishes. When I do have spare time I’m just way too exhausted to go workout. I just melt into the couch. \n\n\nAny advice on breaking this cycle?",
        "created_utc": 1678593906,
        "upvote_ratio": 1.0
    },
    {
        "title": "Anyone else watch on 2x speed? 😏",
        "author": "I_want_to_die_14",
        "url": "https://i.redd.it/zpxja7khu9na1.jpg",
        "text": "",
        "created_utc": 1678592892,
        "upvote_ratio": 1.0
    },
    {
        "title": "[M3] How do I report an absence due to acute psychosis?",
        "author": "No_Protection_2903",
        "url": "https://www.reddit.com/r/medicalschool/comments/11p4b0f/m3_how_do_i_report_an_absence_due_to_acute/",
        "text": "[removed]",
        "created_utc": 1678592656,
        "upvote_ratio": 1.0
    },
    {
        "title": "So wait is med school like 2 years if we move during M3 and M4?",
        "author": "RelationOwn2581",
        "url": "https://www.reddit.com/r/medicalschool/comments/11p45hw/so_wait_is_med_school_like_2_years_if_we_move/",
        "text": "[removed]",
        "created_utc": 1678592196,
        "upvote_ratio": 1.0
    },
    {
        "title": "Anyone give me tips on answering ABO blood type discrepancies",
        "author": "Purchase_Busy",
        "url": "https://www.reddit.com/r/medicalschool/comments/11p44v7/anyone_give_me_tips_on_answering_abo_blood_type/",
        "text": "Please Im desperate for my tests. The given is like in a table form not situational. \n\nFor example: \n\nAnti A\nAnti B\nA1 \nB cells",
        "created_utc": 1678592142,
        "upvote_ratio": 1.0
    },
    {
        "title": "My dad always goes: “if only I had applied myself back in high school, I could have been a doctor too”",
        "author": "justafujoshi",
        "url": "https://www.reddit.com/r/medicalschool/comments/11p3w1x/my_dad_always_goes_if_only_i_had_applied_myself/",
        "text": "Not sure if it’s the correct subreddit, but it’s as the title says. For context I’m in my 6th year (MS4 equivalent for the Americans here) and I’ve been hearing this ever since year 1. \n\nMy dad always say this, but graduated university with a 2.5 GPA sooo 😐",
        "created_utc": 1678591431,
        "upvote_ratio": 1.0
    },
    {
        "title": "Step 2 study schedule advice",
        "author": "neuron95",
        "url": "https://www.reddit.com/r/medicalschool/comments/11p3kdz/step_2_study_schedule_advice/",
        "text": "Wanted advice on creating my step 2 study schedule. Planning to use just UWorld and Anking cheesy dorian and the 4 NBME exams + free 120. Have a little under 6 weeks.\n\nFinished a first pass of uworld shelf qs now at the end of M3 and going to reset it to try to do as much as possible on a second pass (80-120 questions per day). Also used cheesy dorian decks for every rotation except IM and FM (didn't have time).  I did not keep up with reviews for the other rotations though. So my plan is to do 5-6 hours of UWorld and 3-4 hours of Anki daily. Is this enough to catch up on Anki and finish second pass of UWorld? Any other suggestions?",
        "created_utc": 1678590491,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to prepare for rotations??",
        "author": "AdTiny1554",
        "url": "https://www.reddit.com/r/medicalschool/comments/11p3hpw/how_to_prepare_for_rotations/",
        "text": "Hey everyone!  I’m currently an almost 3rd year (pending passing step1 😅) and am trying to focus on the “brighter” future of rotations.  Any general tips on essentials to buy, how to get goods letters, what you wish you would’ve known, or anything in general would be appreciated!  \n\nAlso I’m interested in surgery so it’s my 3rd rotation so I’m not super nervous",
        "created_utc": 1678590280,
        "upvote_ratio": 1.0
    },
    {
        "title": "Help! On the verge of failing another shelf exam",
        "author": "callmeuncledrew",
        "url": "https://www.reddit.com/r/medicalschool/comments/11p3gu8/help_on_the_verge_of_failing_another_shelf_exam/",
        "text": "Hey everyone, I'm pretty distraught right now after possibly failing my second shelf exam. I came into med school with a 4.0 gpa, 520+ MCAT, and hit the ground running. I did great on all my preclinical blocks/exams, got involved with research/extracurriculars, passed Step 1, and have honestly loved med school. Clinical rotations have also been an incredible experience, and I feel like I do a decent job of working with the team, formulating A/Ps, etc. I've had some validation in my clinical performance after receiving honors on all my clinical grades (thus far) + great feedback... but I am consistently below average on shelf exams and already failed one. Not doing well on shelf exams has not been a huge surprise given I am usually only getting around 50% on UWorld question blocks.\n\nI'm pretty lost because I feel like my studying isn't as fruitful as I'd like it to be, and there's probably some aspect of a deficit in test-taking skills coupled with anxiety that hasn't been a problem for me in the past but is now hitting me with Step 2/Shelf stuff. I'm rambling a bit, but could someone give some practical advice as to what ya'll mean when you say, \"Anking and UWorld\" for shelf exams? Specifically, are you just unsuspending the cards with corresponding tags (eg. FM cards during FM rotation), and then going through UWorld? I always do the UWorld questions, but I feel like I'm not retaining the information and applying it as well as I'd like on the shelf exam--what do you do to retain it/review questions? Or do you just rely on the Anki premade decks to cover stuff?\n\nLastly, I have taken NBME practice tests and scored fine, but I always feel surprised on the real shelf exam--is this a normal experience? Why do the NBME practice exams feel so much easier than the real thing? I just feel like even with all the time/brain capacity in the world, I could never do well on shelf exams.\n\nUltimately, I came into med school with a hopeful heart and felt like anything was possible. I did well the first 18 months and planned on going into a surgical subspecialty, but now I'm worried that I'm not even going to graduate. I'd appreciate any practical advice you could share. Thank you!",
        "created_utc": 1678590205,
        "upvote_ratio": 1.0
    },
    {
        "title": "Journal Submission Advice wanted",
        "author": "Cynthnasty",
        "url": "https://www.reddit.com/r/medicalschool/comments/11p3f55/journal_submission_advice_wanted/",
        "text": "I wanted to publish something in medical education but my school won't cover APC fees - do y'all have any recommendations for journals to submit to?",
        "created_utc": 1678590077,
        "upvote_ratio": 1.0
    },
    {
        "title": "Anyone know where I can get the B&amp;B PowerPoints?",
        "author": "mshumor",
        "url": "https://www.reddit.com/r/medicalschool/comments/11p2vye/anyone_know_where_i_can_get_the_bb_powerpoints/",
        "text": "I have all the videos, but I would like the powerpoints if possible, and can't find them anywhere online outside of the official site.",
        "created_utc": 1678588590,
        "upvote_ratio": 1.0
    },
    {
        "title": "Looking for tips",
        "author": "NikolaCalaway",
        "url": "https://www.reddit.com/r/medicalschool/comments/11p2nqc/looking_for_tips/",
        "text": "Hi! I am a med student from Chile, im a phychiatric patient in a depression's treatment and part of the treatment is learn how to become a better student and in the future how to be a better doctor. Please give me the best tips you have. Thanks.",
        "created_utc": 1678587967,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can residency programs read your med school application?",
        "author": "solyblue22",
        "url": "https://www.reddit.com/r/medicalschool/comments/11p2650/can_residency_programs_read_your_med_school/",
        "text": "I wanted to use some parts of my personal statement in my residency app. Is that a red flag?",
        "created_utc": 1678586598,
        "upvote_ratio": 1.0
    },
    {
        "title": "Keep messing up on rotation and feel hated",
        "author": "Just_existing328",
        "url": "https://www.reddit.com/r/medicalschool/comments/11p1meg/keep_messing_up_on_rotation_and_feel_hated/",
        "text": "Can anyone please help me calm down a little and give me advice? 🥲 I’m an M3 in my IM rotation and we follow the residents only. And I feel so hated (and it’s my fault). \n\nI’ve messed up a few times, and I will spend the next 3 weeks doing better. But any consolation or advice would be much appreciated! \n\nHere are some of the things I’ve done wrong so far (I’m one of the med students that is engaged and also social and I think it backfires sometimes):\n\n-I was following a resident who I didn’t realize doesn’t like having students and I was asking her some questions about my patient, and I could tell she was annoyed so I stopped asking after 3 questions when in hindsight all cues suggested that I should have shut up after the 1st question. But the other residents watched her getting annoyed with me, and now the other residents behave the same way with me when they were happy to talk about patients with me before. \n\n-I was sitting a few seats away from the residents at the table writing a note, and didn’t realize I wasn’t being included in their conversation, and I just responded to something one of them said about the new Figs scrubs colors, and she said “Oh now you’re eavesdropping?”, and I was kind of shocked and shut up instead of apologizing right away. Later on, I heard that resident saying she likes this other medical student best because she’s polite 😕\n\n- The students usually leave at 3pm when the senior dismisses us, but no one dismissed us and we were there doing nothing at 5pm while the residents were writing notes, so the med students kept talking about how to get dismissed, so I (stupidly) just got up and asked the senior if it’s okay for us to go, instead of asking if there’s anything else we can help with. And only later did I realize that it looked like I didn’t want to be there to all of the residents. \n\nI’ve had a few more situations like these, and I feel like I can do no right and now I’m anxious. What should I do better moving forward 😞? I’m guessing I should just keep my head down and do my work without being social and friends and without being very engaged in the learning the way I am in other rotations?\n\nThank you for your help!",
        "created_utc": 1678585050,
        "upvote_ratio": 1.0
    },
    {
        "title": "Pneumothorax management",
        "author": "icutoo2327",
        "url": "https://www.reddit.com/r/medicalschool/comments/11p1hv9/pneumothorax_management/",
        "text": "[removed]",
        "created_utc": 1678584696,
        "upvote_ratio": 1.0
    },
    {
        "title": "Internal med residency ranking question",
        "author": "footbook123",
        "url": "https://www.reddit.com/r/medicalschool/comments/11p18tl/internal_med_residency_ranking_question/",
        "text": "[removed]",
        "created_utc": 1678583984,
        "upvote_ratio": 1.0
    },
    {
        "title": "How competitive/IMG-friendly is clinical genetics?",
        "author": "Matt01116",
        "url": "https://www.reddit.com/r/medicalschool/comments/11p16bm/how_competitiveimgfriendly_is_clinical_genetics/",
        "text": "[removed]",
        "created_utc": 1678583787,
        "upvote_ratio": 1.0
    },
    {
        "title": "[Meme] On My Family Med Rotation like..",
        "author": "O00coolzero00O",
        "url": "https://i.imgur.com/9QL6sih.jpg",
        "text": "",
        "created_utc": 1678579081,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can someone help me understand matching?",
        "author": "stormyskies7777",
        "url": "https://www.reddit.com/r/medicalschool/comments/11oz278/can_someone_help_me_understand_matching/",
        "text": "Hi everyone,\n\nI am a non-traditional student planning to start med school in about three years (when I am 28). I would like to do anesthesiology, emergency medicine, or opthamology. How realistic is it to think I could match to a program in Chicago doing one of these? How random is it?\n\nSorry if this is a dumb question but I really don't understand how the process works. \n\nThanks!",
        "created_utc": 1678578336,
        "upvote_ratio": 1.0
    },
    {
        "title": "Tips for M3 surgery rotation?",
        "author": "ahhhide",
        "url": "https://www.reddit.com/r/medicalschool/comments/11oynbd/tips_for_m3_surgery_rotation/",
        "text": "It will be my first rotation, first real time in the hospital really as a med student. \n\nNervous as hell. Any good resources out there to prepare for cases and what not? Any general advice?",
        "created_utc": 1678577327,
        "upvote_ratio": 1.0
    },
    {
        "title": "test region change",
        "author": "FreeAcanthaceae3264",
        "url": "https://www.reddit.com/r/medicalschool/comments/11oxfoo/test_region_change/",
        "text": "[removed]",
        "created_utc": 1678574415,
        "upvote_ratio": 1.0
    },
    {
        "title": "Recommendation-Nephro",
        "author": "3omda06",
        "url": "https://www.reddit.com/r/medicalschool/comments/11oxdh6/recommendationnephro/",
        "text": "Do you have any recommendations on sources to help me understand nephrology text books,videos..etc \nFrom the explanatory side of how disease develops and all..",
        "created_utc": 1678574269,
        "upvote_ratio": 1.0
    },
    {
        "title": "advice/venting - got kicked out of the hospital. AITA (not a joke lol)",
        "author": "almostdoctorposting",
        "url": "https://www.reddit.com/r/medicalschool/comments/11ow90y/adviceventing_got_kicked_out_of_the_hospital_aita/",
        "text": "ok so basically two weeks ago we started a new rotation at a state hospital 1.5 hours away from me by bus (i’m a US img). my group of 10 ppl and i were scrambling all morning to get our paperwork done all over the hospital, climbed like 10 flights of stairs, and finally were waiting to hand everything in to the secretary. i sit down in an empty chair far away from her and she says “EXCUSE ME you’re not allowed to sit without my permission.” obviously i laugh at this cause it’s fucking absurd. anyway that was the nail in my coffin cause this lady flips the fuck out, literally calls me a bunch of names and says she’s gonna kick me out of the rotation. meanwhile i leave for the day, text my own hospital coordinator (prof) and shes like it’s fine you’ll just do it at our hospital (15 min from my house). massive W right?😂😂😅😅😅😅\n\nanyway the days go on and the ppl from my group (who im not seeing daily anymore) are like texting me individually about how bad they’re being treated because the secretary told the resident she had a problem with me and now they’re somehow taking it out on the whole group by making their hours longer etc. so everyone hates me now (which..whatever) and ppl are like begging me to go back, apologize to this massive see you next tues and basically beg to be let back to this shithole hospital fucking hours away from my house. they harassed me so much that i offered to goand talk to her but said i wont be coming back cause i have an agreement with my own prof to do it at our hospital.\n\nlike ok i get i fucked up and shouldnt have fought with this lady and should have just been like OKAY SORRY MAAM UR RIGHT (i was told after that shes a nurse turned admin person and is a bitch to all med students, which…obviously). but everyone blaming their life problems on my after leaving is shitty, right??? or am i truly in the wrong and i should just try to make nice with everyone? (its not like i was bffs with my group before this😂)\n\nthis is obgyn lol\n\nhas anyone ever been kicked out of their program in america lol? i imagine it takes a lot more😅😅😅😂",
        "created_utc": 1678571569,
        "upvote_ratio": 1.0
    },
    {
        "title": "Tell me your biggest moment of senioritis so far",
        "author": "KushBlazer69",
        "url": "https://www.reddit.com/r/medicalschool/comments/11ow38m/tell_me_your_biggest_moment_of_senioritis_so_far/",
        "text": "I’m curious to see examples of people taking M4 to the limits (p.s - don’t say anything that will get you match violated tho)",
        "created_utc": 1678571166,
        "upvote_ratio": 1.0
    },
    {
        "title": "Taking a break from this sub before match might be a good idea",
        "author": "KushBlazer69",
        "url": "https://www.reddit.com/r/medicalschool/comments/11ovroe/taking_a_break_from_this_sub_before_match_might/",
        "text": "Fellow 4th year sharing some personal thoughts\n\nI have been able to almost entirely block out any stress in relation to the buildup for match day but I noticed as soon as I started browsing this subreddit my stress levels notably went up. It’s like, seeing everyone else stress out, I start to wonder if I should also be stressed lol. \n\nI used to struggle with some significant anxiety up until the start of 3rd year. A lot of reflection, meditation, and self evaluation has led me to come to a realization on dealing with stressful life events. \n\nWhen something big comes in my life as a major potential stressor, I think to myself “is there anything in this moment in time I can do to make the result in my favor?” If the answer is yes, I do it. If the answer is no, I tell myself that there’s literally no benefit in thinking about it, and proceed to do anything else. \n\nI know this sounds incredibly simple and some people will scoff at this and think to themselves “well I can’t just not think about it” but honestly the truth is, with meditation and the ability to build your will power (and ADHD that makes things out of sight almost completely out of mind), it’s actually very possible. It’s as straight forward as that. \n\nThe reality is there’s always going to be another major life stressors coming up, constant rumination brings no benefit and I learned after near crippling moments of anxiety that I don’t want to feel that way for the rest of my life. It’s an active choice and when you realize you are not your thoughts but the active observer of them, your control of the ability to acknowledge said thoughts becomes better of time. Sorry if I sound super philosophical or idealistic, but this approach has helped a lot for me and perhaps might for you. So get off this subreddit and have some fun! I’m almost certain it will help.",
        "created_utc": 1678570372,
        "upvote_ratio": 1.0
    },
    {
        "title": "Which is more important for pathology: Step 2 score or away rotations?",
        "author": "TheShrimpMeister",
        "url": "https://www.reddit.com/r/medicalschool/comments/11ovrav/which_is_more_important_for_pathology_step_2/",
        "text": "Sorry if this is a pretty specific question, but I know that pathology can be a little different than other specialties so I’m wondering if anyone has any advice about this. I’ve heard that away rotations and letters are weighted very heavily in pathology because they show interest in the field, but should Step 2 be prioritized now that Step 1 is pass/fail? I’m trying to figure out if I should only do one away rotation and take a longer dedicated for Step 2 (6-7 weeks), or shorten my dedicated to 4 weeks and do 2 aways. \n\nFor context, I’m fairly certain I’ll have a pretty low Step 2 score and having some extra time might help bump up my score a little bit. I have always struggled immensely with standardized exams throughout my life and even though step 1 was pass/fail this year, I think my score would have been in the low 220s based on practice exam scores. I also have not been doing that great on my shelf exams (low 70s). I’m a very average student at a pretty low-tier U.S. MD school and would like to match at a mid-tier program.",
        "created_utc": 1678570347,
        "upvote_ratio": 1.0
    },
    {
        "title": "Need stress motivation to study!",
        "author": "nonintelligent1",
        "url": "https://www.reddit.com/r/medicalschool/comments/11ovgz7/need_stress_motivation_to_study/",
        "text": "[removed]",
        "created_utc": 1678569645,
        "upvote_ratio": 1.0
    },
    {
        "title": "My (M30) wife is expecting our 1st child next week. I’ve had a rather bizarre experience with her. I put on some weight with minimal changes to lifestyle but then it came on quick. My doc has attributed it to stress, diet, and Couvade Syndrome! Thought some here might be curious about my experience.",
        "author": "Clydesdale__12",
        "url": "https://i.redd.it/e2pxwfx0m7na1.jpg",
        "text": "",
        "created_utc": 1678565833,
        "upvote_ratio": 1.0
    },
    {
        "title": "teacher is letting certain students review exams but not others. against school policy",
        "author": "Typical_Company_8258",
        "url": "https://www.reddit.com/r/medicalschool/comments/11otoog/teacher_is_letting_certain_students_review_exams/",
        "text": "There's a teacher at my school who is letting certain students review their exams and what they got wrong on the exams.\n\nBut this is against the course syllabus which forbis students from reviewing their exams and seeing what questions they got wrong. \n\nAllowing students to review exams GIVES Athem a HUGE Advantage for the final and other exams since they know how the teachers write the teacher writes the exams.\n\nShould I report this to administration? I've been peeved by this unfairness.",
        "created_utc": 1678565253,
        "upvote_ratio": 1.0
    },
    {
        "title": "how do i get rid of this?",
        "author": "NoMasterpiece1113",
        "url": "https://www.reddit.com/gallery/11otjhn",
        "text": "",
        "created_utc": 1678564901,
        "upvote_ratio": 1.0
    },
    {
        "title": "Teacher allows certain students to review exams and wrong answers, but thats against class policy",
        "author": "0PVhu890789",
        "url": "https://www.reddit.com/r/medicalschool/comments/11otfap/teacher_allows_certain_students_to_review_exams/",
        "text": "[removed]",
        "created_utc": 1678564628,
        "upvote_ratio": 1.0
    },
    {
        "title": "FA and Uworld only for USMLE",
        "author": "MosquitoBois",
        "url": "https://www.reddit.com/r/medicalschool/comments/11otf9z/fa_and_uworld_only_for_usmle/",
        "text": "Ok how doable is it to get a P on USMLE with just FA and Uworld? I don’t really like anki and b&amp;b doesn’t stick to me. I’m just religiously reading FA and answering about 20 uworld questions a day. Test is in about three months. What do you think?",
        "created_utc": 1678564627,
        "upvote_ratio": 1.0
    },
    {
        "title": "Anyone know that video?",
        "author": "Potential_Shallot_52",
        "url": "https://www.reddit.com/r/medicalschool/comments/11ot9t6/anyone_know_that_video/",
        "text": "[removed]",
        "created_utc": 1678564244,
        "upvote_ratio": 1.0
    },
    {
        "title": "TW: Can this actually get you kicked out of medical school?",
        "author": "Delicious-Trainer-77",
        "url": "https://www.reddit.com/r/medicalschool/comments/11os2o5/tw_can_this_actually_get_you_kicked_out_of/",
        "text": "So one of my friends is freaking out right now because someone threatened to get him kicked from med school. Apparently he made a r@p3 joke back in freshman year (I know, absolutely disgusting of him to do so) on a class GroupMe. Basically he said that a test was really hard in an extremely obscene way and likened it to r@p3.\n\nHe recently announced his med school acceptance in social media and some girl said she’s gonna send screenshots of his joke to the med school to get his acceptance rescinded. \n\nI know it’s absolutely a horrible thing to joke about, and he knows it too. I genuinely think he’s matured since that point, and while what he said is still unacceptable, I don’t think it’s something that should ruin his future. \n\nIs this something that actually happens/has happened to anyone you might know?",
        "created_utc": 1678561324,
        "upvote_ratio": 1.0
    },
    {
        "title": "I'm so fed up...",
        "author": "Elohan_of_the_Forest",
        "url": "https://www.reddit.com/r/medicalschool/comments/11or8zv/im_so_fed_up/",
        "text": "I have spent years building my research project, made the IRB proposal from scratch, found a mentor to be my PI, collected data for 2 whole years and wrote a manuscript, made my own figures, did my own stats. I've bled and cried over this fucking project for months. Today I received my fifth rejection from a journal. I just cannot man, I didn't sign up to be a researcher but goddamn it hurts. I just want this thing to be published so I can at least have something to show for it. What a waste of time, effort and energy, I regret ever giving a shit about doing more than just trying to excel academically. This whole research thing has taken away so much from me both academically and personally...",
        "created_utc": 1678559367,
        "upvote_ratio": 1.0
    },
    {
        "title": "Good luck🍀",
        "author": "itsamemalaario",
        "url": "https://www.reddit.com/r/medicalschool/comments/11or164/good_luck/",
        "text": "I know Monday is just around the corner, and the tension is as palpable as a 2+ carotid pulse on an SP: stay strong! Y’all got this and it will all be worth it in the end!",
        "created_utc": 1678558830,
        "upvote_ratio": 1.0
    },
    {
        "title": "Doing first chart review! Help please!!",
        "author": "friend_of_the-pod",
        "url": "https://www.reddit.com/r/medicalschool/comments/11oqv2c/doing_first_chart_review_help_please/",
        "text": "Doing my first retrospective study/chart review soon (using the National Surgical Quality Improvement Program database)\n\nDoes anyone know how long it should take? The number of patients that meet the inclusion criteria should be about 500.",
        "created_utc": 1678558423,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is removed during ultrafiltration in the setting of dialysis?",
        "author": "supinator1",
        "url": "https://www.reddit.com/r/medicalschool/comments/11oqkik/what_is_removed_during_ultrafiltration_in_the/",
        "text": "If a patient is on ultrafiltration, what would I see if I run labs like a renal function panel on the removed fluids?  Will it be distilled water, will it have the same electrolyte concentration as the patient's serum, or something else? If it is distilled water, does ultrafiltration run the risk of hyperkalemia as the existing potassium is more concentrated and if so, how do you determine if it is safe to perform ultrafiltration?",
        "created_utc": 1678557704,
        "upvote_ratio": 1.0
    },
    {
        "title": "Career Advice?",
        "author": "Odd_Okra_6336",
        "url": "https://www.reddit.com/r/medicalschool/comments/11oq9fp/career_advice/",
        "text": "[removed]",
        "created_utc": 1678556955,
        "upvote_ratio": 1.0
    },
    {
        "title": "[Advice needed] as an OMS1, what should I do this summer?",
        "author": "Here_To_Educate",
        "url": "https://www.reddit.com/r/medicalschool/comments/11op558/advice_needed_as_an_oms1_what_should_i_do_this/",
        "text": "I want to get into cardiology, so what should I do this summer to maximize my chances?\n\nIf I just chill during the summer, would that affect my chances of matching in the future? (My apologies if its a dumb question)",
        "created_utc": 1678554141,
        "upvote_ratio": 1.0
    },
    {
        "title": "can someone send me a link for sketchy medical videos please",
        "author": "ennuihyacinth",
        "url": "https://www.reddit.com/r/medicalschool/comments/11oogiz/can_someone_send_me_a_link_for_sketchy_medical/",
        "text": "Dm me, you'd be a lifesaver",
        "created_utc": 1678552423,
        "upvote_ratio": 1.0
    },
    {
        "title": "Gen Surg residents, need your opinion",
        "author": "phunterdot",
        "url": "https://www.reddit.com/r/medicalschool/comments/11ontxu/gen_surg_residents_need_your_opinion/",
        "text": "An IMG here. YOG will be 2 when applying for the match. With a score of 240 and 5 months of USCE( 3 months hands-on &amp; 2 months university observerships) and 8-12 publications.\n\nHow would you rate my profile with yours? Am I having big hopes for surgery or should I just apply IM?",
        "created_utc": 1678550824,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do I know if my med school will know of my Match outcome?",
        "author": "ComprehensiveVoice16",
        "url": "https://www.reddit.com/r/medicalschool/comments/11onh5c/how_do_i_know_if_my_med_school_will_know_of_my/",
        "text": "I’m a reapplicant. I could of sworn that I gave permission somewhere along the line, but is there anywhere I can check to see if my med school will be notified of my match status? I’ve kept close contact with them as they’ve helped even after graduation, so just wanted to check.",
        "created_utc": 1678549953,
        "upvote_ratio": 1.0
    },
    {
        "title": "2022 National Step 1 Pass Rate Drops 4%",
        "author": "CleanWombat",
        "url": "https://www.usmle.org/performance-data",
        "text": "",
        "created_utc": 1678548583,
        "upvote_ratio": 1.0
    },
    {
        "title": "Would you still pursue medicine as a career if you already had the financial stability a doctor's salary will provide you with in the future?",
        "author": "BoyWithNoGlasses",
        "url": "https://www.reddit.com/r/medicalschool/comments/11omwha/would_you_still_pursue_medicine_as_a_career_if/",
        "text": "If yes, would you pursue a different specialty? What would you do different?\n\nIf no, what would you do instead?\n\nThis is not research/a survey, I'm just curious  \n\nGreetings from a Spanish med student \n\n[View Poll](https://www.reddit.com/poll/11omwha)",
        "created_utc": 1678548487,
        "upvote_ratio": 1.0
    },
    {
        "title": "Indian hospital removes 300 kidney stones from 75-year-old farmer",
        "author": "nowadayswow",
        "url": "https://www.worldopress.com/post/indian-hospital-removes-300-kidney-stones-from-75-year-old-farmer",
        "text": "",
        "created_utc": 1678547999,
        "upvote_ratio": 1.0
    },
    {
        "title": "Thank you",
        "author": "Shonuff_of_NYC",
        "url": "https://v.redd.it/quga4eyr16na1",
        "text": "",
        "created_utc": 1678546923,
        "upvote_ratio": 1.0
    }
]