[
    {
        "title": "Match day, dog and pony show",
        "author": "EarProper7388",
        "url": "https://www.reddit.com/r/medicalschool/comments/10yael4/match_day_dog_and_pony_show/",
        "text": "Anyone else hate the idea of finding out where you will be living the next 3-7 years in an admin organized room of 300+ people? Only 1/3 of which you know, and the other 2/3 are strangers just looking/recording reactions. \n\nIt’s inhumane. Unreasonable. And honestly disrespectful. Maybe I’m just a bitter M4, but idk anyone in any other profession that would want to figure out what job they got this way? \n\nIt’s a dog and pony show for the admin. That’s it. And I don’t want to be apart of it.",
        "created_utc": 1675986786,
        "upvote_ratio": 1.0
    },
    {
        "title": "What pop culture references are in Sketchy?",
        "author": "premedthrowaway11",
        "url": "https://www.reddit.com/r/medicalschool/comments/10ya761/what_pop_culture_references_are_in_sketchy/",
        "text": "Obviously most of the time they're not allowed to directly name drop. But I was curious if we could make an exhaustive list\n\n- Adrenergics: Moonrise Kingdom\n\n- Beta lactams: Star Wars (plus Indiana Jones for Vanc and Histoplasma)\n\n- Roseola: totally-not-Catholicism\n\n- Anti muscarinics: Alice in Wonderland (obviously)\n\n- Cancer mAbs and caliciviruses: Game of Thrones\n\n- Metronidazole: Murder on the Orient Express\n\n- SSRIs: The Office\n\nAnyone got more?",
        "created_utc": 1675986267,
        "upvote_ratio": 1.0
    },
    {
        "title": "Classic pimping",
        "author": "mainstem_bronchus",
        "url": "https://i.redd.it/9v1cdymhbaha1.jpg",
        "text": "",
        "created_utc": 1675983523,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why is it ok for nurses/techs to grab medical students?",
        "author": "Failure2Thriv3",
        "url": "https://www.reddit.com/r/medicalschool/comments/10y8pay/why_is_it_ok_for_nursestechs_to_grab_medical/",
        "text": "[removed]",
        "created_utc": 1675982666,
        "upvote_ratio": 1.0
    },
    {
        "title": "Please Complete This Anonymous Survey! I would appreciate it so much!",
        "author": "MedStudent_Research",
        "url": "https://www.reddit.com/r/medicalschool/comments/10y7px2/please_complete_this_anonymous_survey_i_would/",
        "text": "[removed]",
        "created_utc": 1675980375,
        "upvote_ratio": 1.0
    },
    {
        "title": "The life inside dry and wet labs, PIs, (cancer) research institutes. Demystify it for me!",
        "author": "ankimedico",
        "url": "https://www.reddit.com/r/medicalschool/comments/10y7jqw/the_life_inside_dry_and_wet_labs_pis_cancer/",
        "text": "\nHello everyone! This question is mainly from US medical students, generally from everyone but would appreciate if some MD-PhD could also give their input.\n\n I'm from a non-US medicalschool and I have never seen actual real life research happening in my life except some bullshit cross sectional studies or case reports that our faculty does to meet the bare minimum number of papers per year. Outside medschool some biologists and other scientists do original research but they are hard to find. When I see US med students mainly MD-Phds I see them involved into some molecular level research which seems too mysterious and alien to me, I mean I'm a physician-to-be, studied basic sciences during my initial years in medschool but the kind of stuff those physician researchers are involved in looks very scholarly, mysterious, alien and godly to me. I wonder how to world looks like inside of many major cancer research institutions? How do normal medstudents view MD-Phds in US? How big is the knowledge gap between these two categories? How much normal MDs are well versed in that level of deep research? And how can one make entry into it if they have never done anything better than a case report or a cross sectional study? I mean how to get involved as an alien into the world of molecules and cytokines and tumor markers or even a routine clinical trial? \nPlus I've a sort of liking for that academia/research life, how should I enter in it to really know how it looks like?\nTldr: How to get foot inside a basic sciences research lab or a clinical trial when you don't know anything better than a cross sectional study or a systemic review? Also explain the knowledge gap between MDs and MD-Phds. \n\nP.s I'm using the word MD for all the US medstudents, including DOs.",
        "created_utc": 1675979994,
        "upvote_ratio": 1.0
    },
    {
        "title": "My last day on surgery",
        "author": "cookiefriend",
        "url": "https://i.redd.it/drjui4a3z9ha1.jpg",
        "text": "",
        "created_utc": 1675979352,
        "upvote_ratio": 1.0
    },
    {
        "title": "Explain it for me! the mystery around the world of labs, PIs, research institutes",
        "author": "MutedAd8449",
        "url": "https://www.reddit.com/r/medicalschool/comments/10y75b8/explain_it_for_me_the_mystery_around_the_world_of/",
        "text": "[removed]",
        "created_utc": 1675979006,
        "upvote_ratio": 1.0
    },
    {
        "title": "Attendings",
        "author": "Dr_M7",
        "url": "https://www.reddit.com/r/medicalschool/comments/10y5xs4/attendings/",
        "text": "doctor states\n “ when i was in med school i woke up at 4 am to get to hospital “\n\n“i couldn’t see my family for long”\n\nOr swam the indian ocean to get to university\n\nLike is this meant to motivate me or what ?\n\nIts not a competition on who had the most miserable life. Sorry ur life sucked. \n\nI don’t wanna become the best doctor.\nI don’t wanna make a new invention\nIm okay with ordinary.\nStop asking me to do researches and attend time wasting seminars. I wanna pass :)",
        "created_utc": 1675976159,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does anyone feel like the spacing on the NBMEs/step is absurdly close together?",
        "author": "nevetsonagrag",
        "url": "https://www.reddit.com/r/medicalschool/comments/10y5d10/does_anyone_feel_like_the_spacing_on_the/",
        "text": "I don't know if it is just me, but i have a really difficult time reading questions on NBMEs. Besides the garbage font, the spacing is so close together that i have a hard time distinguishing lines and keep ending up having to reread because i skip a line or move back a line. The highlighting overlap too just seems ridiculous. I really wish it was just like UWORLD format, especially considering you pay the same price for one STEP exam as you do for all of uworld.\n\nI made it so my uworld font is the same \"Arial Greek\" as the NBMEs/step, but considering theyll probably get rid of the exam before thinking about adjusting the format, does any one know of a way to make uworld single spaced instead of the nice double space to get more adjusted to it? This probably sounds ridiculous but ive misread and have wasted a dumb amount of time because of the crap format slowing me down.",
        "created_utc": 1675974751,
        "upvote_ratio": 1.0
    },
    {
        "title": "How much time have you had to do hobbies/see family/travel?",
        "author": "Aylabear730",
        "url": "https://www.reddit.com/r/medicalschool/comments/10y52xb/how_much_time_have_you_had_to_do_hobbiessee/",
        "text": "I know it’s different for everyone, but I’m hoping to get a general consensus. I’m hoping to matriculate in Fall of 2024, and I’m trying to figure out what to expect. Thanks!",
        "created_utc": 1675974089,
        "upvote_ratio": 1.0
    },
    {
        "title": "Question for the folks who honor every rotation",
        "author": "Fit_Future7613",
        "url": "https://www.reddit.com/r/medicalschool/comments/10y4yox/question_for_the_folks_who_honor_every_rotation/",
        "text": "Do y’all actually get a lot of feedback on areas to improve on at the end of the rotation meeting? I feel like everyone’s perfect haha",
        "created_utc": 1675973817,
        "upvote_ratio": 1.0
    },
    {
        "title": "Funding opportunity in the Healthy Longevity field",
        "author": "Civil_Influence_6177",
        "url": "https://www.reddit.com/r/medicalschool/comments/10y4orx/funding_opportunity_in_the_healthy_longevity_field/",
        "text": "The National Academy of Medicine opened the 2023 cycle of the Healthy Longevity Global Competition! Info from their LinkedIn page\n\n\"A funding opportunity unlike any other! Calling all innovators—creative researchers, trailblazing technologists, inspired non-profit leaders, and imaginative start-ups! The National Academy of Medicine’s Healthy Longevity Catalyst Awards is accepting bold, new ideas to promote health throughout the lifespan from January 23, 2023, to February 27, 2023, at 11:59 pm EST. Individuals and teams from all disciplines and sectors with novel ideas to extend human health and well-being, at any stage of life, are invited to apply. The competition is simple—a 2-page narrative submission is all it takes to be considered for an award worth $50K. Review the guidelines and start your application today!\"",
        "created_utc": 1675973172,
        "upvote_ratio": 1.0
    },
    {
        "title": "If you're tired of not knowing medicine and afraid of rounding, check this free course out",
        "author": "leche1dura",
        "url": "https://www.reddit.com/r/medicalschool/comments/10y49y3/if_youre_tired_of_not_knowing_medicine_and_afraid/",
        "text": "Hi all, \n\nI created a free IM bootcamp (it's like 4 hrs); it has everything from patient presentations, antibiotics, vent management, and more. It's great for anyone in 3rd-4th year and early interns. Message me for the link. ALL FREE. Literally don't even have to provide me your email. I just wanted to share since I already finished making the course. I have more courses in the pipeline as well, so all I ask is to provide feedback if possible. Thank you.",
        "created_utc": 1675972251,
        "upvote_ratio": 1.0
    },
    {
        "title": "What are you prioritizing for your match list?",
        "author": "plastic_coffee",
        "url": "https://www.reddit.com/r/medicalschool/comments/10y3yig/what_are_you_prioritizing_for_your_match_list/",
        "text": "I know for most people, matching into a top 25 medical school was the dream. What are people prioritizing now for residency? Is it just location at this point",
        "created_utc": 1675971501,
        "upvote_ratio": 1.0
    },
    {
        "title": "MD or NP?",
        "author": "Aylabear730",
        "url": "https://www.reddit.com/r/medicalschool/comments/10y3xf7/md_or_np/",
        "text": "I (21F) am really nervous about how much time/stress medical school takes. I also worry that I will giving up a lot of time with family and friends, and I don’t know if I want to spend my 20s like that. I know it’s a great investment, but money doesn’t really matter very much to me. I feel like I could achieve a lot of the same moral benefits by being a nurse practitioner over a family doc. I’ll be taking my MCAT in April, but I’m at a crossroads. Please offer any advice that you have!\n\nAdditional context: maybe wants to start a family in late 20’s, already engaged to somebody in cyber security, would love to build a house one day, good student (3.83 GPA as a junior premed), and very motivated. \nI just want to be able to provide for my family— that’s my biggest concern!",
        "created_utc": 1675971430,
        "upvote_ratio": 1.0
    },
    {
        "title": "Janki vs Anking",
        "author": "psk898",
        "url": "https://www.reddit.com/r/medicalschool/comments/10y3cgj/janki_vs_anking/",
        "text": "Also #shelf tag vs #resources\\_by\\_rotations tag? Has anyone who has finished MS3/ taken step2 give some input on these?",
        "created_utc": 1675970137,
        "upvote_ratio": 1.0
    },
    {
        "title": "Tips to prepare for FM sub-I?",
        "author": "HY_Strides",
        "url": "https://www.reddit.com/r/medicalschool/comments/10y3aqg/tips_to_prepare_for_fm_subi/",
        "text": "OMS-3 here looking to do really well during my sub-I at my top choice. Any (serious) advice is greatly appreciated.",
        "created_utc": 1675970026,
        "upvote_ratio": 1.0
    },
    {
        "title": "MD/PhD",
        "author": "Intelligent_Toe_5115",
        "url": "https://www.reddit.com/r/medicalschool/comments/10y37ky/mdphd/",
        "text": "[removed]",
        "created_utc": 1675969826,
        "upvote_ratio": 1.0
    },
    {
        "title": "Anyone have feelings about where they matched (optho/uro)",
        "author": "[deleted]",
        "url": "",
        "text": "[removed]",
        "created_utc": 1675969812,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can we be a little sad/disappointed with where we matched?",
        "author": "Ecnoyetam",
        "url": "https://www.reddit.com/r/medicalschool/comments/10y34tn/can_we_be_a_little_saddisappointed_with_where_we/",
        "text": "[removed]",
        "created_utc": 1675969658,
        "upvote_ratio": 1.0
    },
    {
        "title": "Are we allowed to be sad with where we matched?",
        "author": "Ecnoyetam",
        "url": "https://www.reddit.com/r/medicalschool/comments/10y32ej/are_we_allowed_to_be_sad_with_where_we_matched/",
        "text": "[removed]",
        "created_utc": 1675969516,
        "upvote_ratio": 1.0
    },
    {
        "title": "Making medical school friends",
        "author": "Primary-Assistance82",
        "url": "https://www.reddit.com/r/medicalschool/comments/10y2ttt/making_medical_school_friends/",
        "text": "[removed]",
        "created_utc": 1675969000,
        "upvote_ratio": 1.0
    },
    {
        "title": "Veterinarians get the coolest disease names",
        "author": "alkhalicious",
        "url": "https://www.reddit.com/r/medicalschool/comments/10y2d9o/veterinarians_get_the_coolest_disease_names/",
        "text": "Ascites is called WATER BELLY. Plasma cell pododermatitis? Nah, son. That's PILLOW FOOT.\n\nWhere did we go wrong?",
        "created_utc": 1675967951,
        "upvote_ratio": 1.0
    },
    {
        "title": "Seems onlineMedEd is changing their model away from free videos",
        "author": "HorrorBrot",
        "url": "https://i.redd.it/qnwaalukg7ha1.jpg",
        "text": "",
        "created_utc": 1675967083,
        "upvote_ratio": 1.0
    },
    {
        "title": "Bodybuilding and med school, how many of you are doing it?",
        "author": "Orchid_3",
        "url": "https://www.reddit.com/r/medicalschool/comments/10y1kro/bodybuilding_and_med_school_how_many_of_you_are/",
        "text": "[removed]",
        "created_utc": 1675966144,
        "upvote_ratio": 1.0
    },
    {
        "title": "HANDS-ON DEFIBRILLATION - is it REALLY worth it?",
        "author": "FOAMista",
        "url": "https://youtu.be/JtNbiwZxaC4",
        "text": "",
        "created_utc": 1675964752,
        "upvote_ratio": 1.0
    },
    {
        "title": "What Anking card do you constantly get wrong?",
        "author": "ghosttraintoheck",
        "url": "https://www.reddit.com/r/medicalschool/comments/10y0wax/what_anking_card_do_you_constantly_get_wrong/",
        "text": "I know I'm not alone in getting some cards wrong...every time.\n\nThe worst one for me (excluding things like embryo I barely care about) is \"Eukaryotic translation begins when a ribosome binds a(n) 7-methylguanosine cap\"\n\nLegitimately get it wrong any time it is a review longer than 3 days.",
        "created_utc": 1675964605,
        "upvote_ratio": 1.0
    },
    {
        "title": "What's the worst thing you've said to an attending? I accidentally told my attending \"I hate talking to patients\".",
        "author": "footballmonkeys",
        "url": "https://www.reddit.com/r/medicalschool/comments/10y0vik/whats_the_worst_thing_youve_said_to_an_attending/",
        "text": "In my defense- actually no there's no excuses. I messed up. I did that.",
        "created_utc": 1675964555,
        "upvote_ratio": 1.0
    },
    {
        "title": "residency programs w/ outdoor access",
        "author": "enchilada12",
        "url": "https://www.reddit.com/r/medicalschool/comments/10y0lbs/residency_programs_w_outdoor_access/",
        "text": "[removed]",
        "created_utc": 1675963909,
        "upvote_ratio": 1.0
    },
    {
        "title": "Just curious",
        "author": "medicshark",
        "url": "https://www.reddit.com/r/medicalschool/comments/10y0aqs/just_curious/",
        "text": "Do people at your med school constantly talk shit about your program for being low ranked",
        "created_utc": 1675963243,
        "upvote_ratio": 1.0
    },
    {
        "title": "In which country are physicians unemployed?",
        "author": "DrHabMed",
        "url": "https://www.reddit.com/r/medicalschool/comments/10y09sx/in_which_country_are_physicians_unemployed/",
        "text": "I have heard that there are too many doctors in Spain or Greece who cannot find work in the profession. Is this true?\n\n&amp;#x200B;\n\nAre there any other countries where there are no jobs for doctors?",
        "created_utc": 1675963183,
        "upvote_ratio": 1.0
    },
    {
        "title": "Unclear medical History ~ Unknown medical response as a newborn",
        "author": "AngryRomper",
        "url": "https://www.reddit.com/r/medicalschool/comments/10xz9ko/unclear_medical_history_unknown_medical_response/",
        "text": "\\- Sorry if this is not allowed here, I combed through the rules and didn't see anything specifically dis-allowing a question like this, but if I'm misunderstanding a rule, I will delete this post -  \n\n\nI have recently been reminded about a procedure I had done when I was a newborn, and I can't find many answers (I am also a little scared to delve too deep into the google results, as I am a bit squeamish and do not want to see images.) My mother said when I was born, I had \"Problems with my lungs\", and the doctors had to insert a long needle into my tailbone to treat it, and I was using a nebulizer pretty frequently until I was 5 or 6. I do not remember ever being told why I stopped using it, or what was wrong with my lungs in the first place. I have no allergies, I am not asthmatic, and I've never required special surgeries or anything else. I was born 2 weeks early, in 1993, in Alberta Canada,  I actually have a very defined dimple on my lower tailbone maybe 2mm right of the center, that I have had all my life, that my mother always said was a result of the needle? I do not have a family doctor, and my mother has since passed without me ever asking her for more details.",
        "created_utc": 1675960797,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why does the location of median nerve injury lead to different patterns of hand weakness?",
        "author": "rkbanana",
        "url": "https://i.redd.it/18ofgjomr6ha1.png",
        "text": "",
        "created_utc": 1675958533,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why do I chose med? WHY?",
        "author": "oberass",
        "url": "https://i.redd.it/ha26pik8k6ha1.jpg",
        "text": "",
        "created_utc": 1675956037,
        "upvote_ratio": 1.0
    },
    {
        "title": "First Aid for the USMLE Step 1 2022, 32nd Edition",
        "author": "No-Cry-8729",
        "url": "https://nursingmaterials.gumroad.com/l/byfpzg/",
        "text": "",
        "created_utc": 1675954132,
        "upvote_ratio": 1.0
    },
    {
        "title": "What does it mean to get a patient \"teed up for discharge\"?",
        "author": "Vegetable-Salary-341",
        "url": "https://www.reddit.com/r/medicalschool/comments/10xw8ab/what_does_it_mean_to_get_a_patient_teed_up_for/",
        "text": "[removed]",
        "created_utc": 1675953297,
        "upvote_ratio": 1.0
    },
    {
        "title": "Please stop posting half naked pictures of yourself in the class Group-Me 😡",
        "author": "I_want_to_die_14",
        "url": "https://www.reddit.com/r/medicalschool/comments/10xw7x0/please_stop_posting_half_naked_pictures_of/",
        "text": "Idk if it’s just my school, but people treat our group me like Instagram. This one girl, at least once per week, posts pics of herself trying on underwear/new cloths. Some of the photos are topless (back view) and some where she’s completely naked in a swimming pool. \n\nThis guy also does the same. He posts post workout pics of him in short shorts and shirtless. Also posts pics of him in leggings w/o a shirt with a large bulge clearly visible.  \n\nIt’s literally been going on for 4 years. They get ~10 likes (in a class of 150) per photo. Most people find it cringy. Please consider stopping. \n\nThat is all 🙄",
        "created_utc": 1675953269,
        "upvote_ratio": 1.0
    },
    {
        "title": "Cons of doing a gap year",
        "author": "IntelligentCoyote585",
        "url": "https://www.reddit.com/r/medicalschool/comments/10xtg4o/cons_of_doing_a_gap_year/",
        "text": "I am a medical student in Canada and have my sights set on a career in one of the specialities like plastics, derm, optho, etc. I decided late, but still have 10mo before my applications are due. Before residency, I am considering a gap year to do grad school. \n\nI have to decide really soon and need help with my cons list (i.e. why its a bad idea to do a gap year). This is what I came up with:\n\n- The opportunity cost of a year of attending salary\n- Hit on ego\n- Loss of momentum?\n- All my friends graduate and match and move \n- Just delaying my stress for a year\n- it could look like a red flag if I don't explain it well on my app - - my classmates \"didn't need\" a gap year.",
        "created_utc": 1675945369,
        "upvote_ratio": 1.0
    },
    {
        "title": "Thanks for the help GEORGE",
        "author": "magnum3290",
        "url": "https://i.imgur.com/nENBqbP.png",
        "text": "",
        "created_utc": 1675945284,
        "upvote_ratio": 1.0
    },
    {
        "title": "I fucking hate my GS rotation",
        "author": "hakminister",
        "url": "https://www.reddit.com/r/medicalschool/comments/10xs5d2/i_fucking_hate_my_gs_rotation/",
        "text": "so it’s only my 4th day in colorectal surgery and I absolutely fucking hate it. I’m getting roasted by my attending for literally everything. got told off harshly just bc I didn’t take the team’s coffee orders after he sooo graciously paid for everyone (like man I wasn’t even hard up for the stupid coffee LOL but I was told by the houseman he wld question you if you didn’t order). then later on in the day I went for his lecture even though I had another tutorial halfway through and was on the receiving end of snide remarks, in one instance for literally nodding lmfao. fucking sick of this toxic shit and I still have 8 weeks in GS",
        "created_utc": 1675940843,
        "upvote_ratio": 1.0
    },
    {
        "title": "When we will have a Medical AI Chatbot?",
        "author": "Verdictologist",
        "url": "https://www.reddit.com/r/medicalschool/comments/10xrrd4/when_we_will_have_a_medical_ai_chatbot/",
        "text": "Imagine training ChatGPT on all the medical literature: all the medical books from the last 50 years in all specialties (100,000 books?) + all the 35+ million articles on PubMed. This will be huge for studying, research, and consultations.\n\nWhat do you think will be the pros and cons?",
        "created_utc": 1675939476,
        "upvote_ratio": 1.0
    },
    {
        "title": "Step 1 pass rate dropped from 96% to 93% for US MD students. Is this in line what you have seen at your schools?",
        "author": "Dr_Cat_Mom",
        "url": "https://i.redd.it/obymnsmgn6ha1.jpg",
        "text": "",
        "created_utc": 1675939121,
        "upvote_ratio": 1.0
    },
    {
        "title": "boards and beyond Step 2-3 valid untill 0ct 14 2023 DM",
        "author": "Drdartman",
        "url": "https://www.reddit.com/r/medicalschool/comments/10xrav9/boards_and_beyond_step_23_valid_untill_0ct_14/",
        "text": "BnB Step 2-3 course valid untill oct 14 2023 ... Dm",
        "created_utc": 1675937770,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do med students/physicians function on so little sleep?",
        "author": "sukiyaki14",
        "url": "https://www.reddit.com/r/medicalschool/comments/10xqf4i/how_do_med_studentsphysicians_function_on_so/",
        "text": "I am shocked by how well so many people are able to function on so little sleep. I am a person who typically sleeps 8 hours a night, but it’s very difficult to swing with all of my commitments. I already feel anxious thinking about my clinical years and residency, and how little sleep most medical students and residents get. Is there some kind of secret to sleeping less and staying sane? Or is everyone just a zombie all the time and masking it well?",
        "created_utc": 1675934407,
        "upvote_ratio": 1.0
    },
    {
        "title": "Do you ever get asked about bad grades during residency interviews?",
        "author": "Cookyjar",
        "url": "https://www.reddit.com/r/medicalschool/comments/10xpyzs/do_you_ever_get_asked_about_bad_grades_during/",
        "text": "If yes, how do you explain them? If you pass your classes but the grades are kinda mediocre (Bs and Cs)",
        "created_utc": 1675932710,
        "upvote_ratio": 1.0
    },
    {
        "title": "UIC COM Rockford",
        "author": "sirhc8991",
        "url": "https://www.reddit.com/r/medicalschool/comments/10xogpc/uic_com_rockford/",
        "text": "Hi everyone, sorry if this post doesn't belong in this area, I really don't use Reddit much!\nI was just assigned to the Rockford location for the University of Illinois Chicago, and I was hoping someone more knowledgeable than me could tell me how they like the area/school/living situation, and (I'm ~really~ sorry for this very lame addition) are there cute girls there? Is there any undergraduate institution or something with bars or cafes to be around people my age that I don't already go to school with? Thank you for your insight :)",
        "created_utc": 1675927061,
        "upvote_ratio": 1.0
    },
    {
        "title": "If you’re a non trad, how do residency apps look like for you?",
        "author": "Crafty-Note2560",
        "url": "https://www.reddit.com/r/medicalschool/comments/10xofzz/if_youre_a_non_trad_how_do_residency_apps_look/",
        "text": "Do you include prior work experience? Can that be included if it’s related to healthcare? Not sure if I will be involved when clubs and such but I do have prior experience",
        "created_utc": 1675926991,
        "upvote_ratio": 1.0
    },
    {
        "title": "Start a business or med school?",
        "author": "jeleidjdb",
        "url": "https://www.reddit.com/r/medicalschool/comments/10xnn2s/start_a_business_or_med_school/",
        "text": "This might be the wrong thread and the wrong way to say this… \nJust a question to people out there who might be MDs and have businesses or something like that. Which one has better lifestyle with a lot of money? Like e-commerce or something and then invest in something else. \nI don’t want to work incredibly hard for 10 years just to end up burnt out, earning 150k for the rest of my life and have no life cause of ridiculous long hours smh. I would like to earn a decent amount but still have a life. (By decent I mean 200k not like 90k)",
        "created_utc": 1675924225,
        "upvote_ratio": 1.0
    },
    {
        "title": "Please name some of the helpful apps.",
        "author": "DRVecna",
        "url": "https://www.reddit.com/r/medicalschool/comments/10xndn3/please_name_some_of_the_helpful_apps/",
        "text": "[removed]",
        "created_utc": 1675923366,
        "upvote_ratio": 1.0
    },
    {
        "title": "Medical podcast",
        "author": "Next-Peanut-8319",
        "url": "https://www.reddit.com/r/medicalschool/comments/10xmqek/medical_podcast/",
        "text": "\nHi there, \nI’m currently producing a health and research related podcast. I hope to better understand podcast audiences and create a podcast that is educational and enjoyable. If you have some free time it would be great if you could answer some questions on your listening preferences! \nhttps://s.surveyplanet.com/i1qvyxaj",
        "created_utc": 1675921277,
        "upvote_ratio": 1.0
    },
    {
        "title": "Should I take a gap year as a Canadian medical student interested in dermatology?",
        "author": "IntelligentCoyote585",
        "url": "https://www.reddit.com/r/medicalschool/comments/10xm9g2/should_i_take_a_gap_year_as_a_canadian_medical/",
        "text": "[removed]",
        "created_utc": 1675919772,
        "upvote_ratio": 1.0
    },
    {
        "title": "Should I take a gap year as a Canadian medical student interested in dermatology?",
        "author": "IntelligentCoyote585",
        "url": "https://www.reddit.com/r/medicalschool/comments/10xm1lc/should_i_take_a_gap_year_as_a_canadian_medical/",
        "text": "[removed]",
        "created_utc": 1675919085,
        "upvote_ratio": 1.0
    },
    {
        "title": "Should I take a gap year as a Canadian medical student interested in dermatology?",
        "author": "IntelligentCoyote585",
        "url": "https://www.reddit.com/r/medicalschool/comments/10xlwxs/should_i_take_a_gap_year_as_a_canadian_medical/",
        "text": "[removed]",
        "created_utc": 1675918718,
        "upvote_ratio": 1.0
    },
    {
        "title": "Chatbot GPT : Generate Content Automatically with NLP Tech",
        "author": "Beginning-Arm8170",
        "url": "https://www.reddit.com/r/medicalschool/comments/10xlip5/chatbot_gpt_generate_content_automatically_with/",
        "text": "[removed]",
        "created_utc": 1675917500,
        "upvote_ratio": 1.0
    },
    {
        "title": "How old were you when you found out they are the same person",
        "author": "MikhailDovlatov",
        "url": "https://i.redd.it/763kmrbzc3ha1.png",
        "text": "",
        "created_utc": 1675917285,
        "upvote_ratio": 1.0
    },
    {
        "title": "Fee Structure for Pakistani Students to Study MBBS in China",
        "author": "studymbbschina",
        "url": "https://blindsmagazine.com/study-mbbs-in-china/",
        "text": "",
        "created_utc": 1675917041,
        "upvote_ratio": 1.0
    },
    {
        "title": "I’m down bad for the resident I’m with for this rotation, and she’s made a couple moves. To fuck or not to fuck?",
        "author": "Brocystectomi",
        "url": "https://www.reddit.com/r/medicalschool/comments/10xlcx1/im_down_bad_for_the_resident_im_with_for_this/",
        "text": "\n\n[View Poll](https://www.reddit.com/poll/10xlcx1)",
        "created_utc": 1675917014,
        "upvote_ratio": 1.0
    },
    {
        "title": "Eligibility and Application for Scholarship to Study MBBS in China - WriteUpCafe.com",
        "author": "studymbbschina",
        "url": "https://writeupcafe.com/eligibility-and-application-for-scholarship-to-study-mbbs-in-china/",
        "text": "",
        "created_utc": 1675916790,
        "upvote_ratio": 1.0
    },
    {
        "title": "Additional interests",
        "author": "Misanthrope6700",
        "url": "https://www.reddit.com/r/medicalschool/comments/10xl9v4/additional_interests/",
        "text": "[removed]",
        "created_utc": 1675916757,
        "upvote_ratio": 1.0
    },
    {
        "title": "Missed &amp; unused files",
        "author": "Electrical_Pay_6916",
        "url": "https://i.redd.it/127c9bfyn4ha1.jpg",
        "text": "[removed]",
        "created_utc": 1675915073,
        "upvote_ratio": 1.0
    },
    {
        "title": "Thinking about a pet parakeet in medical school",
        "author": "IdealNo5949",
        "url": "https://www.reddit.com/r/medicalschool/comments/10xkoks/thinking_about_a_pet_parakeet_in_medical_school/",
        "text": "I’m in medical school, single with no kids and I’m considering getting a parakeet. I know a lot of people have pets in medical school (I.e. dogs and cats) but I worry about how people manage with pets in medical school when they are on long rotations or working long hours and throughout residency. My friends’ small birds usually fair pretty well with 4 hours daily of time with you in the room (cage free but you doing your own thing). I know I can leave lots of foraging toys, play the radio or quiet calming music for my bird and make sure he’s out of his cage when I am home but still unsure. \n\nI know that somebody out there has pets like birds and dogs in medical school and wanted to know how you guys manage it in residency when you’re working long hours?",
        "created_utc": 1675915025,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why is breakfast the best meal served at a hospital cafeteria and what do you usually get",
        "author": "BurritoKingMD",
        "url": "https://www.reddit.com/r/medicalschool/comments/10xknun/why_is_breakfast_the_best_meal_served_at_a/",
        "text": "Don’t sleep on the hospital breakfast food.",
        "created_utc": 1675914964,
        "upvote_ratio": 1.0
    },
    {
        "title": "Most accurate medical tv shows ?",
        "author": "Searching4peaceplz",
        "url": "https://www.reddit.com/r/medicalschool/comments/10xkcw3/most_accurate_medical_tv_shows/",
        "text": "[removed]",
        "created_utc": 1675914077,
        "upvote_ratio": 1.0
    },
    {
        "title": "Postdoctoral fellowships",
        "author": "StartAlarming1399",
        "url": "https://www.reddit.com/r/medicalschool/comments/10xk8yc/postdoctoral_fellowships/",
        "text": "Hi I’m an IMG and am considering applying for a postdoc fellowship.\nHow important is it as a non U.S. IMG?\nShould I go for it?",
        "created_utc": 1675913759,
        "upvote_ratio": 1.0
    },
    {
        "title": "Do you intend to work full-time after finishing residency/fellowship?",
        "author": "LegitElephant",
        "url": "https://www.reddit.com/r/medicalschool/comments/10xk702/do_you_intend_to_work_fulltime_after_finishing/",
        "text": "I'm currently deep into residency and thinking about jobs. After talking to co-residents recently, I realized that almost none of us are planning to work full time for more than a handful of years if at all. That got me thinking about the physician shortage and whether this strong preference for part time work has actually been factored in by healthcare economists/forecasters at all. So what are your intended plans?\n\n[View Poll](https://www.reddit.com/poll/10xk702)",
        "created_utc": 1675913607,
        "upvote_ratio": 1.0
    },
    {
        "title": "Do any people regret their specialty choice immediately after matching?",
        "author": "Majestic_Stress_7876",
        "url": "https://www.reddit.com/r/medicalschool/comments/10xj7ki/do_any_people_regret_their_specialty_choice/",
        "text": "[removed]",
        "created_utc": 1675910907,
        "upvote_ratio": 1.0
    },
    {
        "title": "Should I take a club leadership position offered to me, even if I’m pretty busy?",
        "author": "barrys3",
        "url": "https://www.reddit.com/r/medicalschool/comments/10xit8o/should_i_take_a_club_leadership_position_offered/",
        "text": "I was just offered a spot as either VP or president of a club. However, I’m pretty busy as is (couple different research projects, treasurer of a club, and leadership position at a free clinic). I feel like I’d be stretching myself too thin, but is it that worth it to be president of a club? For what it’s worth, I’m interested in a surgical subspecialty so I know my app for residency has to be competitive.",
        "created_utc": 1675909815,
        "upvote_ratio": 1.0
    },
    {
        "title": "Forgot to submit an assignment before my rotation ended and now have a professionalism violation",
        "author": "eternallyconfused9",
        "url": "https://www.reddit.com/r/medicalschool/comments/10xhzum/forgot_to_submit_an_assignment_before_my_rotation/",
        "text": "It sucks because I feel like a lot of \"professionalism\" citations these days are silly, but this one is probably well deserved. I forgot to submit some of the requirements before the rotation ended and literally didn't even realize until I just got my eval back. I have no excuse other than I was feeling very overwhelmed at the time and just let things slip. I was planning on applying Neuro this upcoming ERAS cycle and now wondering how this will affect my chances at matching at my top choices. Anyone have any advice or insight? Just feeling pretty down rn and can use some guidance",
        "created_utc": 1675907664,
        "upvote_ratio": 1.0
    },
    {
        "title": "How does giving supplemental oxygen affect the A-a gradient?",
        "author": "gongoozler5",
        "url": "https://www.reddit.com/r/medicalschool/comments/10xhvjd/how_does_giving_supplemental_oxygen_affect_the_aa/",
        "text": "Is the gradient increased?",
        "created_utc": 1675907348,
        "upvote_ratio": 1.0
    },
    {
        "title": "The BMI is trash",
        "author": "Appropriate-Top-9080",
        "url": "https://www.reddit.com/r/medicalschool/comments/10xhp2o/the_bmi_is_trash/",
        "text": "I wish NBME, UWorld, etc., would stop using the BMI in question stems given that the basis of the measurement is completely ridiculous. \n\nI just wonder, when will the medical community realize that many fat people have poor health outcomes primarily because doctors are cruel and dismissive to them?",
        "created_utc": 1675906878,
        "upvote_ratio": 1.0
    },
    {
        "title": "Where to get a Letter of Recommendation for Summer Research Fellowship?",
        "author": "BillHarper1",
        "url": "https://www.reddit.com/r/medicalschool/comments/10xhct7/where_to_get_a_letter_of_recommendation_for/",
        "text": "Title says all.  Has anyone been in a similar position? I have no previous research experience but was wondering what I could do to secure a solid LoR for a summer research position after M1. I'm totally lost.\n\nAny advice on what kind of LoR I should get or faculty at my school to ask that will improve my chances and help advocate for myself? Should I reuse old LoRs? Also, any ideas for specifics I should ask a faculty member to include in the letter?  \n\nThanks!",
        "created_utc": 1675905983,
        "upvote_ratio": 1.0
    },
    {
        "title": "Currently doing 12 hours days on a surgical rotation as an MS4 …",
        "author": "1762Load",
        "url": "https://www.reddit.com/r/medicalschool/comments/10xglci/currently_doing_12_hours_days_on_a_surgical/",
        "text": "guys can you imagine working a full time job AND getting paid for it??? That must be great",
        "created_utc": 1675904021,
        "upvote_ratio": 1.0
    },
    {
        "title": "“Don’t let duty hours dictate your booty hours.” These little IG gems getting me through this clinical yr 😂",
        "author": "hemi_demi_semiquaver",
        "url": "https://i.redd.it/mrx0tl6wp3ha1.jpg",
        "text": "",
        "created_utc": 1675903618,
        "upvote_ratio": 1.0
    },
    {
        "title": "Loan interest rates",
        "author": "Jtherabbit21",
        "url": "https://www.reddit.com/r/medicalschool/comments/10xfznk/loan_interest_rates/",
        "text": "Any speculation as to how much graduate fed loans are gonna cost for 2023-2024?",
        "created_utc": 1675902476,
        "upvote_ratio": 1.0
    },
    {
        "title": "Do extra curricular officer positions matter?.",
        "author": "Crafty-Note2560",
        "url": "https://www.reddit.com/r/medicalschool/comments/10xfs11/do_extra_curricular_officer_positions_matter/",
        "text": " I’m not doing too hot in my classes (even though I’m passing) so don’t want to be involved as much",
        "created_utc": 1675901950,
        "upvote_ratio": 1.0
    },
    {
        "title": "PhiDe",
        "author": "medicshark",
        "url": "https://www.reddit.com/r/medicalschool/comments/10xfa88/phide/",
        "text": "Anyone have any experience with this organization in med school? Worth joining?",
        "created_utc": 1675900771,
        "upvote_ratio": 1.0
    },
    {
        "title": "How many years will artificial intelligence replace radiologists?",
        "author": "DrHabMed",
        "url": "https://www.reddit.com/r/medicalschool/comments/10xemwx/how_many_years_will_artificial_intelligence/",
        "text": "[removed]",
        "created_utc": 1675899194,
        "upvote_ratio": 1.0
    },
    {
        "title": "In how many years will artificial intelligence replace radiologists?",
        "author": "DrHabMed",
        "url": "https://www.reddit.com/r/medicalschool/comments/10xemck/in_how_many_years_will_artificial_intelligence/",
        "text": "[removed]",
        "created_utc": 1675899156,
        "upvote_ratio": 1.0
    },
    {
        "title": "Research hunt",
        "author": "DarkKn1ght743",
        "url": "https://www.reddit.com/r/medicalschool/comments/10xegpk/research_hunt/",
        "text": "Looking for advice on finding research. One of my mentors mentioned that I should find projects I am suitable for and will lead to a deliverable.\n\nEmailed one PI who says she has a project and asked me to complete the required research training which I have started (will have to do this regardless). My mentor/preceptor mentioned that the project may be more admin orientated and may not lead to a pub. Unfortunately do not have much more info and she has not invited to meet and discuss the project yet.  \n\n\nSecond PI got back to me shortly after and I will be meeting with him next week to discuss ways to get involved. \n\nI would love any guidance on how to navigate situations like this where you have multiple opportunities without burning any bridges. Technically, I have started the research training am kinda on track to work with the first person (however I have no details on the project and have not officially committed?). \n\nAt the same time I would love to avoid wasting time with projects that may not yield any deliverables.  \n\n\nWould love any help and advice. This is a large academic institution and I may very well end up here in residency so would like to maintain relations with all faculty in this specialty.",
        "created_utc": 1675898778,
        "upvote_ratio": 1.0
    },
    {
        "title": "Anybody have PAD,and have had surgery on your legs?",
        "author": "billburkle",
        "url": "https://www.reddit.com/r/medicalschool/comments/10xeg7m/anybody_have_padand_have_had_surgery_on_your_legs/",
        "text": "[removed]",
        "created_utc": 1675898745,
        "upvote_ratio": 1.0
    },
    {
        "title": "Advice about asking for help studying from a classmate",
        "author": "WhichButterscotch456",
        "url": "https://www.reddit.com/r/medicalschool/comments/10xdxwm/advice_about_asking_for_help_studying_from_a/",
        "text": "So basically, I'm taking anatomy courses in preclinical and there's this person I'm fairly friendly with that helped me study for my practical. I want to ask them for help again, but it feels a bit like I'm using them just for studying vs a friend/classmate helping out a friend/classmate as there's no reciprocity (this person is insanely good at anatomy and I don't think they're getting anything out of it). Should I be offering to pay them or would it make it weird? We are all taking anatomy labs at the same time.",
        "created_utc": 1675897577,
        "upvote_ratio": 1.0
    },
    {
        "title": "What 3rd party resource do y’all use for organ systems?",
        "author": "Hyperleo7",
        "url": "https://www.reddit.com/r/medicalschool/comments/10xd9e5/what_3rd_party_resource_do_yall_use_for_organ/",
        "text": "At my school we have daily quizzes over the next days lecture. Admin expects us to read 100+ pages of reading on top of going to 3+ hrs of mandatory class.\n\nPersonally, I don’t see this as very efficient since it burns 8 hrs of my day and I don’t feel like I’m even retaining much. Other than BnB and anking what do y’all use to learn the various organ systems (especially cards and pulm)?",
        "created_utc": 1675896049,
        "upvote_ratio": 1.0
    },
    {
        "title": "Looking to get in contact with a National Health Service Corps Scholarship recipient.",
        "author": "ComradeRutera",
        "url": "https://www.reddit.com/r/medicalschool/comments/10xcik0/looking_to_get_in_contact_with_a_national_health/",
        "text": "[removed]",
        "created_utc": 1675894344,
        "upvote_ratio": 1.0
    },
    {
        "title": "Help me pick out a medical-adjacent name for my new puppy!",
        "author": "Rbfondlescroteiii",
        "url": "https://i.redd.it/7jq6ogofe1ha1.jpg",
        "text": "",
        "created_utc": 1675893591,
        "upvote_ratio": 1.0
    },
    {
        "title": "Confirmed: Step 1 fail rate has increased",
        "author": "lilmayor",
        "url": "https://www.reddit.com/gallery/10xbhab",
        "text": "[removed]",
        "created_utc": 1675891971,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to speed up time after certifying rank list?",
        "author": "MassiveAttack69",
        "url": "https://www.reddit.com/r/medicalschool/comments/10xbee3/how_to_speed_up_time_after_certifying_rank_list/",
        "text": "Anyone got any ideas ?",
        "created_utc": 1675891803,
        "upvote_ratio": 1.0
    },
    {
        "title": "University at Buffalo vs University of Iowa for FM residency. Any advice?",
        "author": "sunfyre8",
        "url": "https://www.reddit.com/r/medicalschool/comments/10xb9uv/university_at_buffalo_vs_university_of_iowa_for/",
        "text": "Thanks",
        "created_utc": 1675891513,
        "upvote_ratio": 1.0
    },
    {
        "title": "A Guide to Medical School: Boards (Part 2)",
        "author": "majikarp",
        "url": "https://www.reddit.com/r/medicalschool/comments/10xb3u6/a_guide_to_medical_school_boards_part_2/",
        "text": "This is part 2 of a guide to medical school focusing on how to do well on boards \n\nPart 1 is here:  \n[https://www.reddit.com/r/medicalschool/comments/10s77ts/a\\_guide\\_to\\_medical\\_school\\_things\\_i\\_wish\\_i\\_knew/](https://www.reddit.com/r/medicalschool/comments/10s77ts/a_guide_to_medical_school_things_i_wish_i_knew/)\n\nI’m writing this as a fourth-year currently applying for residency. I got 250+ on both boards, got 20+ research pubs in a year without prior experience, completed 8 away rotations, went through interviews, and have had multiple conversations with residents/attendings about the inner workings of match. I am still awaiting my match result in March. \n\nI say the above solely to give context on myself, the author of this post, since its always always important to evaluate the perspective you're receiving. \n\nAlso, this is not the perfect guide, its just MY guide. If I had a time machine, it's things I would communicate to my past self as an M1/2/3  preparing for boards.\n\nI wrote this because there are many things I regret doing in medical school. I sorely wish I had someone who warned me ahead of time. Woulda saved a lot of time, energy, emotional wellbeing.\n\nWhile I have not seen the results of my match, I will not regret writing this if at least one person benefits. \n\nI'm hoping to help at least one of you, since when I was an M1/2/3, posts from random strangers on this subreddit helped me a ton throughout this journey. \n\n&amp;#x200B;\n\n==========\n\n# Follow the money! \n\n# 3rd Party Resources &gt;&gt;&gt; Curriculum Resources \n\n# Board Score &gt;&gt;&gt; Pre-Clinical Grades\n\nIn my last post, I wrote about how important your mindset is. This is of the utmost importance when approaching boards studying. \n\nYou need to have the right mindset to assess the advice given to you by admin, professors, and classmates.\n\nSo before I get into the actual things to do to do on boards, it's important to address the topic:   \n**Pre-Clinical Curriculum vs. Boards Curriculum**\n\nIn the beginning of medical school your professors will most likely tell you that in order to do well in medical school and on boards you need to do well on the lectures and exams provided by professors. \n\nThis is where it is SO important to get your mindset right. \n\nRemember in my last post, that the medical school system is not built to help you achieve your goals. It is built to ensure its own continuation. \n\n&amp;#x200B;\n\nWhen assessing someone's incentives, a useful exercise is to follow the money. \n\nFor better or worse, free market economics and financial incentives is part of what ensures competitive greatness and quality of products.\n\n&amp;#x200B;\n\nWhile professors usually mean well, they are often completely disconnected from the free market as well as the reality of board exams. \n\nSo remember, follow the money. \n\nIf Professors have mediocre lectures filled with redundant or low yield, will they get fired / make less money? The answer is NO, they just need to have the lectures not be inaccurate \n\nIf they have phenomenal time efficient lectures do they get more money? NO\n\nHave professors done Step1/2? Many are PHDs and are completely out of touch with what boards requires\n\n&amp;#x200B;\n\nNow on the other hand, consider privatized resources such as UWorld or First Aid. \n\nIf they have mediocre lectures filled with redundant or low yield, will they get less money? The answer is YES, students will move to USMLERx, Kaplan, etc. \n\nIf they have phenomenal time-efficient lectures do they get more money? YES, just look at how Pixorize and Sketchy exploded in popularity.\n\n&amp;#x200B;\n\nPrivate resources are almost entirely judged in the free market by their ability to get you a better board score. Students talk, they know what the gold standard resources are (UWorld, First Aid, Pathoma, BnB, etc.) that get you high scores. \n\n&amp;#x200B;\n\nProfessors are judged by their ability to fulfill their admin roles, make some lectures, and not have students fail. They are usually NOT incentivized to get you the highest score possible. \n\n&amp;#x200B;\n\nGranted, this is going to be school dependent. Some schools are more aligned with boards than others. A good way to assess this is to consider, does your school grade students based on professor made exams? Or do they grade students based on NBMEs? \n\n&amp;#x200B;\n\nIf your curriculum does not align with boards, I would suggest that you prioritize your boards at all costs no matter what any school admin tells you. In my experience, most school's curriculums have only about a 70%ish overlap with what you actually need for boards, and it often emphasizes the lowest yield details. \n\n&amp;#x200B;\n\nBoard scores are far far more important than pre-clinical grades as long as you don't fail your pre-clinicals. Just check NRMP charting outcomes or ask any 4th yr who just interviewed. Anecdotally, plenty of interviewers mentioned my board scores, one mentioned clinical grades, none mentioned my preclinical grades (I was not top quartile). Maybe other 4th yrs reading this can chime in in the comments. \n\n======\n\n# How to create a System: Consistency &gt;&gt;&gt; Tactics\n\n&amp;#x200B;\n\nDoing well on boards is not a matter of doing something extraordinary. \n\n**It is a matter of doing something ordinary for an extraordinary period of time.** \n\n&amp;#x200B;\n\nMost people who have asked me about help with boards undoubtedly start by asking what study resources I used as if there is some magical formula to doing well on boards. \n\nSorry to break it to you, there is no magical resource that will instantly get you to your dream score. \n\nEven UWorld or Anking, while they are amazing resources, they are useless if you do not commit to a consistent study system. \n\nIn contrast, I know people who have scored 250+ with the following tactics:\n\n1) Wrote paper flashcards for every fact on lectures and in UWorld. Reviewed them at the end of the night. \n\n2) Wrote one page summaries of every topic in BnB + UWorld \n\n3) Anking + UWorld\n\n4) Pixorize + Sketchy + Picmonic + UWorld \n\nI also know several people who matured Anking, did UWorld, and scored 220s/230s. \n\nWhat all the people who did well had in common was they followed systems, which gave htem rock solid and consistent study habits and plans. \n\nThey let their classmates frantically worry about the tactics of boards. \n\n&amp;#x200B;\n\nHere are some steps will help you create a system, which will help you stay consistent. I've tested this methodology with four different students that I helped, all of whom were at the bottom of their class / failing practice exams and ultimately were able to pass boards. I also used this system for Step 1 and Step 2. \n\n&amp;#x200B;\n\n0) START AS EARLY AS POSSIBLE\n\nNobody preparing for boards knows exactly what they are getting themselves into. The grind, the judgment, the self-doubt, the isolation. Starting early reduces the risk of random events and other mental/emotional fuckery from inhibiting your goals. You do not want to be stuck in a situation where you start your plan four weeks away from your scheduled board day (if you are in this situation you can still follow the below but it will require additional strategy, feel free to PM me for tips). \n\n1) Create a Plan: Know how many weeks you have left before you actual exam day\n\nExpectations are pacing are important. As soon as possible, figure out exactly what day you will take your boards. Then count the number of weeks you have left. Get a physical/virtual calendar and mark your exam day in there. \n\n2) Budget some ime for randomness/fuckery\n\nTypically when creating a boards plan, if I am far enough out I will try to budget for at least one month of wasted time. Life unpredictably happens whether we like it or not, you never know if your parents will need you to help with their house, is a loved one gets sick, if you have a mental health issue that needs to be dealth with, or if someone gets engaged and you want to go to their bachelor party. PLAN for this as much as possible. You should study as if your actual boards date is about a month earlier than the actual date. It puts you in a mindset where you will at worst be over prepared. \n\n2) Budget in your plan for mandatory events\n\nIn your calendar, block out mandatory days (weddings, school events), and curriculum days (exams quizzes etc.) \n\n3) Budget in your plan for rest\n\nYou WILL burn out. Your mind WILL get to a point where it is impossible to study. Accept this and budget for it. Personally, if I was studying 100% for a week without other commitments, I would budget for 3 days of full rest. My schedule would be M-Tues (100% studying), Wed (50% studying/optional rest), Thurs (rest), Fri Sat (\\~70% studying), Sun (rest). \n\n4) Recalculate number of weeks to reach your desired peak\n\nRecalculate for randomness/fuckery, mandatory events, and rest days. Set that new day in your calendar, number of days/weeks to that target day, and keep this constantly on your mind. \n\n4) Plan HOW you will rest\n\nIf you can, on rest days do stuff you love with people you love that changes your mental, physical, emotional state for the better. When it comes to rest days, you want something that will be physical, get you outside (change your setting), get you away from a computer (rest your eyes), give you some social recharge (be with people/animals who give you positive energy or be alone if you are introverted), AND are not cognitively demanding (no day long chess sessions). It is of the UTMOST importance that you properly follow the above with your rest days. HOW you rest is just as important as HOW you study. \n\nFor me that was surfing with my a buddy who was not in medicine, grabbing burritos after, and taking a fatass nap. I did this about 2-3x a week during the three months leading up to Step 1. \n\n5) Plan HOW you will study in a day \n\nIn a given day, know what blocks of time you will be studying and what times you will be resting. Know WHERE you will study, what food/drink you will need, supplies you will need. For me, I would start each day with a 20 min walk, eat oatmeal, start my first study block at 8-11:30, rest for lunch 11:30-2, study 2-5, rest 5-7, study 7-9, chill 9-11. The first study block was usually qbank or whatever was most cognitively demanding. The last study block was usually reviewing qbank or watching some relevant videos\n\n6) Plan WHAT you will be studying\n\nThis will be covered in the next section. But for each day you study, you should know what your GOAL of studying is for that day and how that fits into your study SYSTEM. \n\n7) Set expectations right\n\nIt's VERY important to have realistic expectations based on the system you created. If you try to get a 280 with three weeks left before boards, that is going to be very unlikely. Getting a 240+ with six months before boards (without prior studying) might be doable if you were a good student before. \n\n8) Learn to say NO\n\nPeople by and large are not actively out to hinder you. Nevertheless, they will ask you to help with research projects, invite you to a series of 12 salsa lessons, try to question your study strategy, have relationship drama that they will involve you with etc. All of these will hinder you. If you are one of those people who has trouble saying NO, I'm writing this specifically for you. You need to be laser focused. What you do NOT do is as important as what you DO. \n\n9) Work in silence. Work with the right people. \n\nThe right people will help you in your goals. The wrong people will doubt and undercut you either consciously or subconsciously. Do NOT broadcast your work, this will only inevitably invite people into your business that may hinder you. \n\n&amp;#x200B;\n\n&amp;#x200B;\n\n============\n\n# Resources: Application &gt;&gt;&gt; Learning\n\n&amp;#x200B;\n\nThere are three categories of resources: 1) Learning Resources 2) Qbank 3) Practice Exams\n\nUltimately, **Qbank &gt;&gt;&gt; Learning Resources**. The reason for this is because Qbank helps you learn as well, but also helps you apply your knowledge, recognize patterns of exam writers, and develop your test taking skills. \n\n**Practice Exams are &gt;&gt;&gt; Qbank**, but practice exams can and should really only be used once you have exhausted your qbank because, although imperfect, they are the best predictors of performance and can help assess whether we should push back our exam. They are also timed random, and you should not really do timed random 40 sets until you are ready (I make a point about this below)\n\n&amp;#x200B;\n\nHere are in my opinion the gold standards for resources separated by category and exam:\n\nStep 1: \n\n1) Learning: BnB, First Aid, Anking Deck, Pixorize (biochem/immuno), Sketchy Micro, Sketchy Pharm\n\n2) Qbank: UWorld, Amboss, USMLERx, Kaplan, BnB qbank NBMEs\n\n3) Practice Exams: UWSA, NBMEs\n\nStep 2:\n\n1) Learning: Being on the wards and reading about stuff you see, OnlineMedEd, premade Anki, BnB, FA Step 2\n\n2) Qbank: UWorld\n\n3) Practice Exams: UWSA NBMEs\n\nI'm sure I missed some, also keep in mind I took Step 1 a couple of years ago. But using some combination of the above can probably get you to success if you follow the right system for the right amount of time with the right #qbank questions completed. \n\n&amp;#x200B;\n\nBecause Qbank is so much better than learning resources in general, I'd recommend that whatever strategy you take should transition as quickly as possible into Qbank as possible. And when you do Qbank, you should transition as quickly into timed random sets of 40 that mimic the exam as possible. \n\n&amp;#x200B;\n\nSome tips/principles on scheduling your resources into your study system:\n\n1) When just starting, go system by system following the schedule of your curriculum\n\nWhile I am a huge proponent of 3rd party resources over curriculum, you need to at least not fail your curriculum. If you study the same systems covered in your school, you will at least get some overlap and be able to prepare for both boards and low yield school curriculum. Personally in preclinicals, for a 3 week block of cardio for example, I budgeted 1 week to go over learning resources for cardio, 1 week to finish cardio qbanks (about 300qs), and 1 week to cram curriculum materials. For Step 2 this is usually much easier since you have a month long block. \n\n2) Learn first, but do not dwell on learning. Go as fast as possible to qbank. \n\nDo NOT try to memorize at first. When you start a topic cold, you have no idea what is actually high yield. You should just make one pass through all the material for a topic so you at least familiarize yourself with the flow of topics, the general structure of a topic, and where you can review certain resources. Go as quickly as possible to qbank. \n\n3) Let your ego get crushed over and over by qbank as early as possible\n\nDo NOT be attached to your qbank scores. Do NOT be attached to how you FEEL when doing qbank. ATTACH yourself to the number of questions completed/reviewed properly. A 50% on a 40 timed set qbank reviewed well should feel better than a 75% on a 40 tutor mode set qbank that you did chilling in bed. \n\n4) Anki is solid but not a silver bullet. More Anki cards not necessarily = higher step score. \n\nAnking is a glorious deck that contains almost every fact possible. However, it is still at the end of the day a learning resource. Further, because it contains every fact, it by its very virtue contains a ton of low yield cards as well. It is really up to you to determine what is high yield and focus only on those cards. Some Anki cards &gt;&gt;&gt; Other Anki cards. Do NOT complete any Anki deck in its entirety, selectively unsuspend cards. Also, if you try it and hate it, you do NOT need to use it. Just try another learning resource on the above list instead. \n\n5) Estimate the time for learning / qbank down to the minute. Then slot it into your system. \n\nThis will require some calculating. Whatever learning resource you use, figure out how long it will take to complete some amount of it. Figure out how much you need to complete before your block is over. Then slot it into your calendar. Plan this out block by block. I'd approximately budget 1 week for learning resources and at least 1 week for qbank resources. If you have to choose, do more qbank resources, but always do at least some learning resources that cover all topics. \n\n6) Understand how qbank progression\n\nWhen you first start qbank, its going to crush you. You will not be able to do timed mode well because you don't recognize anything, no matter how much learning you did.   \nHere's how qbank should progress: 1) Tutor mode in one system 2) Timed mode in one system 3) Tutor mode all systems random 4) Timed mode all systems random. \n\n7) Properly reviewing qbank is the key to gaining from qbank. \n\nYour goal for reviewing qbank should be to identify a concise insight that, had you seen that insight while doing the question, would have led to a correct answer. It is also an opportunity to review a specific topic that is probably a weak point.   \nHere's my methodology for reviewing qbank: 1) Get a notebook / fresh Anki deck / power point 2) Quickly read through all qs 3) Read through all incorrect qs closely 4) For each incorrect q, quickly pullup the relevant learning resource and review that topic in &lt;5mins. 5) For each incorrect, write a single line that would have gotten you that question correct had you seen it beforehand. \n\n8) Budget practice exams for dedicated. Do them like the real thing. \n\nThis should be occurring in your last month or so before your actual exam. Always use practice exams as a mock exam. Do them with the same breaks restrictions as the actual thing. \n\n&amp;#x200B;\n\n=======\n\nStay tuned, the next posts will cover how to do research, mastering clinical, how to get someone to vouch for you, and mental health.\n\n&amp;#x200B;\n\nI know there was a TON of info above. Its kinda hard to convey on text, usually I talk these things out on the phone on an individualized basis. And I know everyone has a unique situation, strengths, and weaknesses. \n\nSo feel free to ask ANY question you might be curious about. I have a bunch of time these next few weeks, so I'm happy to help anyone who may need it.\n\nAlso far as boards goes, I've already coached a few people over the last three years who were failing classes and at the bottom of their class to passing board scores. I'm not an expert by any means, but if you're one of those people, don't hesitate to reach out about your specific situation and I will do my best to help.",
        "created_utc": 1675891133,
        "upvote_ratio": 1.0
    },
    {
        "title": "University at Buffalo vs University of Iowa for FM residency. Any advice?",
        "author": "sunfyre8",
        "url": "https://www.reddit.com/r/medicalschool/comments/10xb0yt/university_at_buffalo_vs_university_of_iowa_for/",
        "text": "[removed]",
        "created_utc": 1675890952,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is \"All of COMSAE\" quizlet enough to get above a 400 on a COMSAE?",
        "author": "HanSoloCup96",
        "url": "https://www.reddit.com/r/medicalschool/comments/10xayge/is_all_of_comsae_quizlet_enough_to_get_above_a/",
        "text": "I need to achieve that score in order to avoid sitting for a mandatory prep class and I would really rather prefer not to do that lol\n\nEdit: \"All of COMSAE\" QUIZLET : [https://quizlet.com/299157507/all-the-comsae-flash-cards/](https://quizlet.com/299157507/all-the-comsae-flash-cards/)",
        "created_utc": 1675890790,
        "upvote_ratio": 1.0
    },
    {
        "title": "Being forced to perform or receive an OMM procedure",
        "author": "ConfusedandAlone46",
        "url": "https://www.reddit.com/r/medicalschool/comments/10xat3t/being_forced_to_perform_or_receive_an_omm/",
        "text": "I am an OMS-1 right now, and in OMM we’re doing Sacrum and Innominate diagnosis. We have our practical coming up soon, and I have some concerns with one aspect of the innominate exam. It requires the person performing the exam to palpate the pubic symphysis to assess their symmetry. My classmates are nice people. But I don’t want them touching me there. Especially because a lot of people don’t know what they’re palpating and go lower than they need to. \n\nWe are each assigned either the sacrum or the innominate and we are paired with other students for the exam with a proctor in the room. I emailed my course director explaining that I feel uncomfortable with another student touching me in this manner and they told me that I have to do it. \nIs that allowed? Am I just forced to do whatever it is the school wants me to do without any recourse if it’s harmful to me? \n\nThis isn’t the first time that a technique has made me extremely uncomfortable, and I promised myself that I would speak up for myself if it happened again. And they tell us to speak up if we’re uncomfortable, but I did and it seems to not matter. I am considering just forfeiting those points if it comes down to it. I can compromise and get through administering the exam, but I absolutely do not want to be touched. I just don’t know how to word that without sounding like I’m “talking back”",
        "created_utc": 1675890451,
        "upvote_ratio": 1.0
    },
    {
        "title": "Which specialty is the most evidence-based?",
        "author": "Hx_5",
        "url": "https://www.reddit.com/r/medicalschool/comments/10x9evn/which_specialty_is_the_most_evidencebased/",
        "text": "So which specialty has had the most work gone into it in terms of research and evidence-base for treatment and patient management.\n\nLet's go...",
        "created_utc": 1675887217,
        "upvote_ratio": 1.0
    },
    {
        "title": "Which specialisations will be popular in the future?",
        "author": "DrHabMed",
        "url": "https://www.reddit.com/r/medicalschool/comments/10x9d8e/which_specialisations_will_be_popular_in_the/",
        "text": "Radiology and psychiatry have been very popular specialties recently. What specialties do you think will be popular in, say, 15 years' time?",
        "created_utc": 1675887105,
        "upvote_ratio": 1.0
    },
    {
        "title": "Competitiveness of Prelim-Medicine vs Prelim-Pediatrics vs Transitional Year",
        "author": "pramsotingz",
        "url": "https://www.reddit.com/r/medicalschool/comments/10x8qgw/competitiveness_of_prelimmedicine_vs/",
        "text": "Hello all,\n\n&amp;#x200B;\n\nI'll most likely be applying into a specialty with an advanced and prelim component. Just how competitive is each of these specialties, especially if you want a specific region of the country?",
        "created_utc": 1675885628,
        "upvote_ratio": 1.0
    },
    {
        "title": "When do you typically have to choose a specialty?",
        "author": "CantaloupeUsed8976",
        "url": "https://www.reddit.com/r/medicalschool/comments/10x86f2/when_do_you_typically_have_to_choose_a_specialty/",
        "text": "[removed]",
        "created_utc": 1675884281,
        "upvote_ratio": 1.0
    },
    {
        "title": "What Hogwarts House does your personality resemble the most and What specialty are you pursuing (or has pursued)?",
        "author": "stepneo1",
        "url": "https://www.reddit.com/r/medicalschool/comments/10x7xcd/what_hogwarts_house_does_your_personality/",
        "text": "Asking for science.",
        "created_utc": 1675883689,
        "upvote_ratio": 1.0
    },
    {
        "title": "Alternative to castle branch for background check, HIPAA/OSHA, drug screen?",
        "author": "WinifredJones1",
        "url": "https://www.reddit.com/r/medicalschool/comments/10x7bl3/alternative_to_castle_branch_for_background_check/",
        "text": "Please for the love of everything holy let there be some other fucking website I can pay for this shit through.  Thanks",
        "created_utc": 1675882245,
        "upvote_ratio": 1.0
    },
    {
        "title": "Chatbot GPT : Generate Content Automatically with NLP Tech",
        "author": "Hairy-Lie9026",
        "url": "https://www.reddit.com/r/medicalschool/comments/10x70z9/chatbot_gpt_generate_content_automatically_with/",
        "text": "[removed]",
        "created_utc": 1675881523,
        "upvote_ratio": 1.0
    },
    {
        "title": "in state tuition?",
        "author": "ODknowledge",
        "url": "https://www.reddit.com/r/medicalschool/comments/10x6usw/in_state_tuition/",
        "text": "[removed]",
        "created_utc": 1675881071,
        "upvote_ratio": 1.0
    }
]