[
    {
        "title": "Those who did computational bio/bioinformatics for grad school/research and med school, what was your experience like?",
        "author": "ambitiouslearner123",
        "url": "https://www.reddit.com/r/medicalschool/comments/111cvx6/those_who_did_computational_biobioinformatics_for/",
        "text": "Those who did computational bio/bioinformatics, do you still use it to improve your practice/research?",
        "created_utc": 1676304708,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to study for NBME Pre-clinical SHELFs?",
        "author": "leviack3",
        "url": "https://www.reddit.com/r/medicalschool/comments/111cqsm/how_to_study_for_nbme_preclinical_shelfs/",
        "text": "Hi, in my school we have Biochemistry, Physiology, Histology, Anato/Embryo, and Neuroscience SHELFs as final exams. I've been trying to find information online but it's been scarce. Does anyone have any recommendations on how to prepare and ace these exams? Thanks!\n\n[This is the NBME link about the exams](https://www.nbme.org/assessment-products/assess-learn/subject-exams/basic-science#overview)",
        "created_utc": 1676304359,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to study for NBME Pre-clinical SHELFs?",
        "author": "leviack3",
        "url": "https://www.reddit.com/r/medicalschool/comments/111ceu1/how_to_study_for_nbme_preclinical_shelfs/",
        "text": "[removed]",
        "created_utc": 1676303559,
        "upvote_ratio": 1.0
    },
    {
        "title": "Ultrasound Tech on OB",
        "author": "J_I_M_B_O_X",
        "url": "https://www.reddit.com/r/medicalschool/comments/111c31v/ultrasound_tech_on_ob/",
        "text": "On OB/Gyn I asked a Ultrasound tech while she was doing an 20w US if that was blood traveling up the IVC into the right atrium. And then she stated the “blood flow is reversed in babies”. I mean isn’t that a little inaccurate. She seemed kinda annoyed I asked. Am I dumb?",
        "created_utc": 1676302733,
        "upvote_ratio": 1.0
    },
    {
        "title": "MRW I'm in morning rounds and the nerdy med student tries to present on his complex patient that coded overnight",
        "author": "Autopsy_Survivor",
        "url": "https://v.redd.it/wtwstxrp5zha1",
        "text": "",
        "created_utc": 1676302291,
        "upvote_ratio": 1.0
    },
    {
        "title": "First day of medical school.... Wish me luck🤞🏻☘️",
        "author": "Wildest_Animal",
        "url": "https://i.redd.it/xln6e7fsl0ia1.jpg",
        "text": "",
        "created_utc": 1676301767,
        "upvote_ratio": 1.0
    },
    {
        "title": "amitriptyline",
        "author": "MagicianTop6079",
        "url": "https://www.reddit.com/r/medicalschool/comments/111bkya/amitriptyline/",
        "text": "[removed]",
        "created_utc": 1676301459,
        "upvote_ratio": 1.0
    },
    {
        "title": "Ortho vs Derm Specialty Decision",
        "author": "questionstoask1111",
        "url": "https://www.reddit.com/r/medicalschool/comments/111bih4/ortho_vs_derm_specialty_decision/",
        "text": "[removed]",
        "created_utc": 1676301286,
        "upvote_ratio": 1.0
    },
    {
        "title": "Ortho vs Derm Specialty Dilemma",
        "author": "advicewanted222",
        "url": "https://www.reddit.com/r/medicalschool/comments/111bcfv/ortho_vs_derm_specialty_dilemma/",
        "text": "[removed]",
        "created_utc": 1676300847,
        "upvote_ratio": 1.0
    },
    {
        "title": "Specialty Dilemma: Ortho vs Derm",
        "author": "advicewanted222",
        "url": "https://www.reddit.com/r/medicalschool/comments/111bb2w/specialty_dilemma_ortho_vs_derm/",
        "text": "[removed]",
        "created_utc": 1676300750,
        "upvote_ratio": 1.0
    },
    {
        "title": "Any insight appreciated!",
        "author": "LemonApple4529",
        "url": "https://www.reddit.com/r/medicalschool/comments/1119s7n/any_insight_appreciated/",
        "text": "Hey everyone, hope y’all are doing well. Just wanted some insighte/honest assessment on an interview situation. I had difficulty getting into a zoom breakout room and the PC messaged me and I first said “I tried that,i dont know!” And then he sent a couple other messages and I said “I tried that too, I don’t know!”. I then made sure to verbally say at the end “ty for helping me get to breakout room” and he said “No problem, we’re on the same team”. This was like my dream program and I’m worried that the messages I sent or exclamation points came across as rude and this would lead to a DNR or lower my ranking? If it matters, the PD responded to my TY email but he responded to all other applicants too but idk, just wondering what anyone else’s thoughts on this are, am I overthinking or not? Thank you very much!",
        "created_utc": 1676298591,
        "upvote_ratio": 1.0
    },
    {
        "title": "What specialities should I tell/not tell my OB-GYN residents I'm interested in? (Half serious, half shitpost)",
        "author": "msfrizzle123567",
        "url": "https://www.reddit.com/r/medicalschool/comments/1117qrj/what_specialities_should_i_tellnot_tell_my_obgyn/",
        "text": "I should definitely tell them I'm gunning for ortho bro or derm /s\n\nBut real talk, as a (truthfully undecided) dude I feel what I share when they ask can change their perception a nonzero extent. \n\nAside from full on lying and saying I'm into OB, what specialties would be viewed as more welcoming?\nMedicine, Peds?",
        "created_utc": 1676293438,
        "upvote_ratio": 1.0
    },
    {
        "title": "Proof that medschool is just sheer luck",
        "author": "tylerdurdensswife",
        "url": "https://www.reddit.com/r/medicalschool/comments/11170y3/proof_that_medschool_is_just_sheer_luck/",
        "text": "I had an IM osce today and there was that one examiner that was particularly malignant and we knew it even before we entered the exam.Most of the students came out of the exam talking about horror stories of him and how he kept asking irrelevant questions that are way beyond our knowledge. A friend of mine kept telling us about how he gave him all the right answers yet he was scolding him for no apparent reason and when my friend told him that something wasn’t in our curriculum the examiner kept exploded in his face and told him “ Don’t debate me “.  \n\nNaturally, I tried to avoid going into that exam room and was making my way into the next room when suddenly I was ushered by a dr to the first room where the scary examiner was. \n I gave in without a fight and thought to myself it’s alright you do what you have to do to survive lol. \n\nI was doing okay with the patient while the scary examiner was boring holes into my back and breathing down my neck. He asked a few questions that were relevant to the case and told me “you’re free to go you got the full-mark, it was the pulse examination that saved you” we had 2 examinations palpation of the spleen and examining the pulse and commenting on both, he didn’t even ask me to comment a full comment and he just let me go. Other students gave him a perfect full comment and he wasn’t satisfied yet he let me off the hook without even having to complete the examination. \n\nSo, that taught me that  grades have nothing to do with your competence and that sometimes luck is on your side. So regardless of your grade the real assessment is when you graduate and practise medicine for real.",
        "created_utc": 1676291156,
        "upvote_ratio": 1.0
    },
    {
        "title": "Netter's Anatomy is truly stunning!",
        "author": "CatMed",
        "url": "https://i.redd.it/jwlfbvkx4yha1.png",
        "text": "",
        "created_utc": 1676289909,
        "upvote_ratio": 1.0
    },
    {
        "title": "Contribution of Ellis Tissue Hemostatic Forceps to Clinical",
        "author": "jimymedical1",
        "url": "https://crankyfliers.com/hemostatic-forceps/",
        "text": "",
        "created_utc": 1676288393,
        "upvote_ratio": 1.0
    },
    {
        "title": "3D Printed GynePunk Disposable Vaginal Speculum",
        "author": "jimymedical1",
        "url": "https://pakaffairs.techzarar.com/disposable-vaginal-speculum/",
        "text": "",
        "created_utc": 1676287669,
        "upvote_ratio": 1.0
    },
    {
        "title": "Probable diagnosis in ent",
        "author": "Ar_dvane",
        "url": "https://www.reddit.com/r/medicalschool/comments/1115z8t/probable_diagnosis_in_ent/",
        "text": "A 60 year old male patient , k/c/o smoker and alcoholic, presented with complaints of hemoptysis, dysphagia and Right earache. What could be the probable Differential diagnosis for this patient.",
        "created_utc": 1676287387,
        "upvote_ratio": 1.0
    },
    {
        "title": "Potential Risks Associated With ENT Instruments - Oduku - The Newspaper",
        "author": "jimymedical1",
        "url": "https://oduku.com/2023/02/13/potential-risks-associated-with-ent-instruments/",
        "text": "",
        "created_utc": 1676287342,
        "upvote_ratio": 1.0
    },
    {
        "title": "Understand the Disposable Vaginal Speculum",
        "author": "jimymedical1",
        "url": "https://oduku.com/2023/02/13/disposable-vaginal-speculum-2/",
        "text": "",
        "created_utc": 1676287011,
        "upvote_ratio": 1.0
    },
    {
        "title": "Virtual Library Group!!!!",
        "author": "Key_Section_1264",
        "url": "https://www.reddit.com/r/medicalschool/comments/1115j24/virtual_library_group/",
        "text": "[removed]",
        "created_utc": 1676285675,
        "upvote_ratio": 1.0
    },
    {
        "title": "Medical school library",
        "author": "Key_Section_1264",
        "url": "https://www.reddit.com/r/medicalschool/comments/1115gwt/medical_school_library/",
        "text": "[removed]",
        "created_utc": 1676285422,
        "upvote_ratio": 1.0
    },
    {
        "title": "Virtual Medical school Library",
        "author": "Key_Section_1264",
        "url": "https://www.reddit.com/r/medicalschool/comments/1115g1l/virtual_medical_school_library/",
        "text": "[removed]",
        "created_utc": 1676285327,
        "upvote_ratio": 1.0
    },
    {
        "title": "Help for my college homework",
        "author": "Hoovy_Pootis_Guy",
        "url": "https://www.reddit.com/r/medicalschool/comments/111576d/help_for_my_college_homework/",
        "text": "I need help for my college homework, pls ASAP. Here's the case:\nMr. J, age 21, came to your pharmacy complaining of severe nasal congestion with headache and blurred vision for 3 days. Mr. J works as a painter and decorator. The patient said he had recently experienced flu-like symptoms. The patient also used 2 paracetamol tablets to relieve his headache even briefly. Mr J's friend told him to use antihistamines to treat his complaint. Therefore, Mr J would like to consult and seek your recommendation. Mr. J would like to consult and seek your recommendation as a pharmacist in the pharmacy.\n\nIt is known that Mr. J has a history of asthma since childhood and a history of allergy to penicillin.\n\nQuestions:\n1. What questions did you as a pharmacist ask the patient to assess Mr. J's medical condition?\n2. The patient was found to have yellowish-green nasal discharge for the previous 3 days along with facial and nasal pain. The patient also complained of loss of smell and taste since experiencing flu symptoms in the past week. No fever was found in the patient. Based on the symptoms, as a pharmacist you suspect Mr. J has acute sinusitis. What are the factors that can trigger sinusitis?\n3. What is the appropriate treatment recommendation for Mr. J's condition?\n4. Should Mr. J need to be treated with beclomethasone nasal spray? J need beclomethasone nasal spray therapy? If yes, please explain how to use the medication?\n5. Mr. J's complaints were not improving so he decided to see his general practitioner as Mr. J had a fever, dizziness, slight hearing loss and ear pain. The doctor then called you to ask for a recommendation of an appropriate antibiotic for Mr. J, what antibiotic did you recommend? Explain the reason for prescribing the antibiotic?",
        "created_utc": 1676284312,
        "upvote_ratio": 1.0
    },
    {
        "title": "Best Medical Colleges, Datta Meghe Institute of Higher Education",
        "author": "dmiherdu",
        "url": "https://www.dmiher.edu.in",
        "text": "",
        "created_utc": 1676280081,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is there any medicine that forces the body to produce hyaluronic acid?",
        "author": "[deleted]",
        "url": "",
        "text": "[removed]",
        "created_utc": 1676276985,
        "upvote_ratio": 1.0
    },
    {
        "title": "Advice for Incoming Medical Student",
        "author": "harryceo",
        "url": "https://www.reddit.com/r/medicalschool/comments/1112er3/advice_for_incoming_medical_student/",
        "text": "[removed]",
        "created_utc": 1676273314,
        "upvote_ratio": 1.0
    },
    {
        "title": "Soon",
        "author": "Inevitable-Way-1745",
        "url": "https://i.imgur.com/lQe4vBN.jpg",
        "text": "",
        "created_utc": 1676270599,
        "upvote_ratio": 1.0
    },
    {
        "title": "Pre-residency shopping list?",
        "author": "AtypicalMethod",
        "url": "https://www.reddit.com/r/medicalschool/comments/1110d1l/preresidency_shopping_list/",
        "text": "Any particular items you plan on buying before starting residency? A certain back pack? New laptop? Phone? Jacket? Anything at all.\n\nLet’s hear what items you plan on buying and any recommendations y’all might have!",
        "created_utc": 1676265810,
        "upvote_ratio": 1.0
    },
    {
        "title": "To the fellow 4th year that tried to scold me for walking into clinic 30 minutes late",
        "author": "KushBlazer69",
        "url": "https://www.reddit.com/r/medicalschool/comments/1110a78/to_the_fellow_4th_year_that_tried_to_scold_me_for/",
        "text": "Really bruh? In February?\n\nShout out to the resident who literally did not give a shit and signed my attendance sheet.",
        "created_utc": 1676265543,
        "upvote_ratio": 1.0
    },
    {
        "title": "new trend",
        "author": "Gaseous_And_Giant",
        "url": "https://i.redd.it/6xcfu0jlvvha1.jpg",
        "text": "",
        "created_utc": 1676262611,
        "upvote_ratio": 1.0
    },
    {
        "title": "MS4s, it’s ok to be slightly checked out rn",
        "author": "err4tums",
        "url": "https://www.reddit.com/r/medicalschool/comments/110z5z2/ms4s_its_ok_to_be_slightly_checked_out_rn/",
        "text": "Today I had my attending scold an MS4 for “not putting in 100%” on his elective in derm. (To be fair, attending didn’t know he isn’t ranking our program).\n\nTake the next few months and recover as much as possible before intern year :)",
        "created_utc": 1676261909,
        "upvote_ratio": 1.0
    },
    {
        "title": "How Do Nursing Homes Get Away with Things?",
        "author": "TrailMixedd",
        "url": "https://www.reddit.com/r/medicalschool/comments/110z40h/how_do_nursing_homes_get_away_with_things/",
        "text": "I see some crazy things during rotations cuz of nursing homes..Some patients have full on body sores or have to get there foot amputated or in septic shock. How do people not even sue them?",
        "created_utc": 1676261744,
        "upvote_ratio": 1.0
    },
    {
        "title": "which degree is worth it from community college?",
        "author": "Akashh23_pop",
        "url": "https://www.reddit.com/r/medicalschool/comments/110z3it/which_degree_is_worth_it_from_community_college/",
        "text": "Being in community college for the third year now and still not sure the outcome of getting accepted or not in radiography program. I don't know what to do. I just feel like my time is running out. I'm 26 now and not having the feeling of assurance just makes me feel overwhelmed and confused with my career path. I truly feel stuck and lost like what to do next.\nI'm completing pre reqs for radiography program and I was told by my advisor to create a backup plan for my career choice. It's like all this years I spend taking classes for pre reqs in hopes to getting reach the end goal but I don't even know what will happen. It just feels so scary like how much time will I keep wasting like this. I'm not getting that proper clarity and understanding from my advisor. I feel neglected. \n\nI'm trying to research on my own about tech field like i.t in hopes to find something I like. But healthcare and tech being different fields. It's like I'm starting from bottom. At the end, I'm feeling like I'm going in circles with no end goal.",
        "created_utc": 1676261700,
        "upvote_ratio": 1.0
    },
    {
        "title": "Psych vs. Derm",
        "author": "TrailMixedd",
        "url": "https://www.reddit.com/r/medicalschool/comments/110z32g/psych_vs_derm/",
        "text": "Which would you choose for residency? Pros vs Cons? It seems like with dermatology there are more things one can do? I am not sure if I could apply for psych as a backup or just do internal medicine as a backup...",
        "created_utc": 1676261658,
        "upvote_ratio": 1.0
    },
    {
        "title": "To all the single people on this subreddit",
        "author": "Charizard-MD",
        "url": "https://www.reddit.com/r/medicalschool/comments/110xkdy/to_all_the_single_people_on_this_subreddit/",
        "text": "I've been seeing a lot of posts on here about being single in medical school and I just wanted to impart two quotes that might help one person who might be worried about finding a life partner.\n\n\"The best relationships come when you least expect it\"\n\n\"You will know you have met the one because when you finally get to be with them; you will understand why it never worked with anyone else\"\n\nI hope these quotes bring some people some peace. Y'all will find your person. Just be patient and be open to them finding you. And when you do find them, cherish them.",
        "created_utc": 1676256896,
        "upvote_ratio": 1.0
    },
    {
        "title": "What would you do? (research)",
        "author": "36wings",
        "url": "https://www.reddit.com/r/medicalschool/comments/110xg7n/what_would_you_do_research/",
        "text": "lets say you’re interested in ortho. You have 1 or 2 ortho projects going on\n\nlet’s say a cardiologist you met, asks you to write up many small little case reports regarding cardio/covid/etc\n\nwould you do these small case reports on the side for the extra publications while you work on your ortho projects? Or do you thinks those pubs are “pointless” since it’s not ortho. Not sure I consider any publication being worthless tho as a pub is a pub",
        "created_utc": 1676256507,
        "upvote_ratio": 1.0
    },
    {
        "title": "Best foods in the morning or overall for good bowel movements for students on long clinical rotations?",
        "author": "[deleted]",
        "url": "",
        "text": "[removed]",
        "created_utc": 1676256142,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can hematocrit fall while Hgb stays the same?",
        "author": "northside-nostalgia",
        "url": "https://www.reddit.com/r/medicalschool/comments/110x722/can_hematocrit_fall_while_hgb_stays_the_same/",
        "text": "Once again I feel really corny asking this sub for homework help, but I looked at all the other medical-related subreddits and none of them seemed to be appropriate. Plus it's the weekend and everyone is posting memes so I figured why not.\n\nI'm a paramedic working on a paper about the case of a 61 year old male with a history of HTN, HLD, a-fib, and DM2. Takes metoprolol, simvastatin, metformin and dabigatran. He was stung by several bees and is now in anaphylactic shock (shortness of breath, hoarseness, tongue swelling, widespread erythema and puritis). He received multiple rounds of epinephrine and over 2L of IVF but he is still hypotensive (70/P) He also has an elevated troponin (0.01 ng/mL -&gt; 1.08 ng/mL ) I'm assuming the troponin indicates that this patient is having an MI due to the increased oxygen demand from epinephrine as well as reduced supply due to persistent hypotension.\n\nHere's what I don't understand: we are given two sets of lab values taken a couple hours apart, one in the field and one by the hospital. The first set has a Hct of 43% and Hgb 14.0. The second set has Hct 22% and Hgb still 14.0.\n\nI have looked everywhere (Harrison's, Rosen's, Dr. Google, etc) trying to understand if, and how, hematocrit could fall this much while hemoglobin stays the same. Unless there's something about the way that these two assays are performed in the lab, I can't understand why this patient's hematocrit would have fallen while the hemoglobin remained the same. I tried googling \"hemolytic anemia anaphylaxis\" but all I got was a few references to hemolysis in mice.\n\nShould I email my professor and ask if this was a typo? He's a very smart guy but also not a doctor so it wouldn't shock me if this were the case.",
        "created_utc": 1676255672,
        "upvote_ratio": 1.0
    },
    {
        "title": "Mods please don’t delete— I need urgent help and ideas from other students on how to report an online gamer for a despondent suicide threat tonight. All I have is his username.",
        "author": "Boop7482286",
        "url": "https://www.reddit.com/r/medicalschool/comments/110wyh1/mods_please_dont_delete_i_need_urgent_help_and/",
        "text": "[removed]",
        "created_utc": 1676254956,
        "upvote_ratio": 1.0
    },
    {
        "title": "When writing assessment and plan on EPIC, have you noticed that most use a hashtag \"#\" sign before each differential?",
        "author": "stepneo1",
        "url": "https://www.reddit.com/r/medicalschool/comments/110whlb/when_writing_assessment_and_plan_on_epic_have_you/",
        "text": "I'm wondering why is this so.",
        "created_utc": 1676253520,
        "upvote_ratio": 1.0
    },
    {
        "title": "When faculty ask you to write a draft letter of recommendation and they will sign it:",
        "author": "lowbudgetman_",
        "url": "https://i.redd.it/ijabssfp9wha1.jpg",
        "text": "",
        "created_utc": 1676249273,
        "upvote_ratio": 1.0
    },
    {
        "title": "Ms4 rain check “I’ll be happy when…”",
        "author": "thekillagoat",
        "url": "https://www.reddit.com/r/medicalschool/comments/110ukb8/ms4_rain_check_ill_be_happy_when/",
        "text": "Alright. I feel like I’ve always put off things in my life. I’ll do this when I’m done with mcat… with research… “with apps” …. “Med school interviewes”…. List goes on. \n\nSince my rotations ended. I’ve been feeling an empty void. I don’t feel good. I’m not eating healthy. I’m not working out. I guess I would describe it as being stuck in quicksand. I gained a significant amount of weight during the process and I thought when ms4 comes around, I’ll get my shit together. But I feel like I’m sitting under a cloud. \n\nI wouldn’t say I’m depressed. But more so feeling frustrated, lazy, lack of purposefulness. And I guess the difficult family relationships don’t help make anything better for being in this mindset.\nHad a successful journey so far however… sometimes I sit back and look at what I’ve done to my body in the process, I feel ashamed. \n\nAnyone else feeling the same. \nHow y’all doing?",
        "created_utc": 1676247558,
        "upvote_ratio": 1.0
    },
    {
        "title": "When is the best time to secure letters of rec for residency programs? I am hearing we need to have them by September of MS4",
        "author": "doctome",
        "url": "https://www.reddit.com/r/medicalschool/comments/110tklj/when_is_the_best_time_to_secure_letters_of_rec/",
        "text": "[removed]",
        "created_utc": 1676244684,
        "upvote_ratio": 1.0
    },
    {
        "title": "Additional finding?",
        "author": "ProDiJaiHD",
        "url": "https://www.reddit.com/r/medicalschool/comments/110sqev/additional_finding/",
        "text": "A 20-year-old male presents with **bloodstained postnasal drainage, left-sided lateral rectus palsy, hoarseness, and reduced hearing in the left ear** for two months. Likely findings in this patient include?\n\n[View Poll](https://www.reddit.com/poll/110sqev)",
        "created_utc": 1676242371,
        "upvote_ratio": 1.0
    },
    {
        "title": "My fellow future osteopaths... Can we please be the generation of physicians that gets rid of OMM from our curriculum?",
        "author": "Electronic-Abroad419",
        "url": "https://www.reddit.com/r/medicalschool/comments/110s2ba/my_fellow_future_osteopaths_can_we_please_be_the/",
        "text": "Seriously, this shit is so embarrassing to be associated with. I cannot think of a SINGLE way in which this will make me a better doctor. \n\nIt's a cancer in our profession and it makes us look so f\\*\\*\\*ing bad. I'm sick of it. It's time for change.",
        "created_utc": 1676240607,
        "upvote_ratio": 1.0
    },
    {
        "title": "The truth about MGH IM union",
        "author": "Beginning-Gene-7120",
        "url": "https://www.reddit.com/r/medicalschool/comments/110rter/the_truth_about_mgh_im_union/",
        "text": "[removed]",
        "created_utc": 1676239960,
        "upvote_ratio": 1.0
    },
    {
        "title": "Radiation oncology research",
        "author": "forevermedstudent",
        "url": "https://www.reddit.com/r/medicalschool/comments/110rocx/radiation_oncology_research/",
        "text": "[removed]",
        "created_utc": 1676239580,
        "upvote_ratio": 1.0
    },
    {
        "title": "Yo-yo on rounds….",
        "author": "hotcrossbun56",
        "url": "https://www.reddit.com/r/medicalschool/comments/110rdwg/yoyo_on_rounds/",
        "text": "MS4 on an ICU rotation. There is another MS4 from a different school on my team. She has been yo-yoing on rounds. At first she would walk the dog etc. while we walked between patient rooms. But now she yo-yos even while I and the interns are presenting and once even in a patient’s room. It’s very distracting. I get that we are almost done, but this just seems a bit too far…….\n\nThe attending hasn’t said anything at least publicly yet. I kind of don’t think he will either since he’s super shy. But I hope it shows up in her eval",
        "created_utc": 1676238821,
        "upvote_ratio": 1.0
    },
    {
        "title": "FM vs Peds. US-IMG needs help.",
        "author": "PhoneFuzzy",
        "url": "https://www.reddit.com/r/medicalschool/comments/110rcoa/fm_vs_peds_usimg_needs_help/",
        "text": "[removed]",
        "created_utc": 1676238727,
        "upvote_ratio": 1.0
    },
    {
        "title": "Getting More Program Exposure Outside of Away Rotations (Unofficial Aways)",
        "author": "loadingusername246",
        "url": "https://www.reddit.com/r/medicalschool/comments/110r7sn/getting_more_program_exposure_outside_of_away/",
        "text": "[removed]",
        "created_utc": 1676238372,
        "upvote_ratio": 1.0
    },
    {
        "title": "ChatGPT got me cryin in da club",
        "author": "thundermuffin54",
        "url": "https://i.redd.it/kn28bmy0vtha1.png",
        "text": "",
        "created_utc": 1676238184,
        "upvote_ratio": 1.0
    },
    {
        "title": "Attention all Medical students",
        "author": "Naiobabe",
        "url": "https://www.etsy.com/uk/listing/1415401587/",
        "text": "Are you a medical student or professional looking for a convenient and secure way to keep track of your clinical experiences and reflect on your growth? Our digital journal brand has the perfect solution for you! With our medical journal, which includes reflection pages, you can easily document your patient encounters, procedures, and observations, as well as reflect on your personal and professional growth. Our user-friendly digital platform offers customizable templates, secure storage, and easy accessibility, so you can easily access your journal from anywhere and keep your progress up-to-date. With our medical journal, you can create a lasting record of your journey as a healthcare provider and gain valuable insights into your strengths and areas for improvement. Join our digital journal community today and take your medical practice to the next level!\n\nA share would be great. Thank you so much to anyone who supports this new business.",
        "created_utc": 1676236866,
        "upvote_ratio": 1.0
    },
    {
        "title": "There are no dbz memes so I tried",
        "author": "Aggravating_Froyo990",
        "url": "https://v.redd.it/lzikrek1rtha1",
        "text": "",
        "created_utc": 1676236784,
        "upvote_ratio": 1.0
    },
    {
        "title": "Research Interests",
        "author": "Misanthrope6700",
        "url": "https://www.reddit.com/r/medicalschool/comments/110ql34/research_interests/",
        "text": " Has anyone found ways to study/research different topics in medical anthropology during their time in medical school?",
        "created_utc": 1676236743,
        "upvote_ratio": 1.0
    },
    {
        "title": "Outpatient hospital GYN clinic: what are the highest yield, most common, bread and butter things to prepare for?",
        "author": "msfrizzle123567",
        "url": "https://www.reddit.com/r/medicalschool/comments/110q6tv/outpatient_hospital_gyn_clinic_what_are_the/",
        "text": "I start outpatient gyn clinic soon and am having trouble understanding what to prepare for.\n\nAnnual well visits, STD's, nonemergent pain, but what are some high yield things I should be prepared to see?",
        "created_utc": 1676235724,
        "upvote_ratio": 1.0
    },
    {
        "title": "other then Biochem/Immuno, in which videos is Pixorize 'better' then Sketchy?",
        "author": "Maleficent-Factor-92",
        "url": "https://www.reddit.com/r/medicalschool/comments/110pqk3/other_then_biochemimmuno_in_which_videos_is/",
        "text": "[removed]",
        "created_utc": 1676234582,
        "upvote_ratio": 1.0
    },
    {
        "title": "Adrenergic receptor help",
        "author": "AKski02",
        "url": "https://www.reddit.com/r/medicalschool/comments/110ppxz/adrenergic_receptor_help/",
        "text": "Currently in cardio block and I am just so lost on keeping the adrenergic receptors straight.\nAny videos recommendations?",
        "created_utc": 1676234537,
        "upvote_ratio": 1.0
    },
    {
        "title": "What l theanin brand should I take uk? Does it matter?",
        "author": "axi5music",
        "url": "https://www.reddit.com/r/medicalschool/comments/110pkj1/what_l_theanin_brand_should_i_take_uk_does_it/",
        "text": "?",
        "created_utc": 1676234151,
        "upvote_ratio": 1.0
    },
    {
        "title": "I skipped an anatomy quiz that accounts for 15% of my grade.",
        "author": "Constant-Meat257",
        "url": "https://www.reddit.com/r/medicalschool/comments/110p3bg/i_skipped_an_anatomy_quiz_that_accounts_for_15_of/",
        "text": "[removed]",
        "created_utc": 1676232948,
        "upvote_ratio": 1.0
    },
    {
        "title": "Do you/did you use anki &amp; what is/was your class rank?",
        "author": "sappheline",
        "url": "https://www.reddit.com/r/medicalschool/comments/110p0pc/do_youdid_you_use_anki_what_iswas_your_class_rank/",
        "text": "Edited to include results option\n\n[View Poll](https://www.reddit.com/poll/110p0pc)",
        "created_utc": 1676232768,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is UCLA’s medical school or MSTP toxic?",
        "author": "Terrible-Wing4374",
        "url": "https://www.reddit.com/r/medicalschool/comments/110ozy3/is_uclas_medical_school_or_mstp_toxic/",
        "text": "[removed]",
        "created_utc": 1676232713,
        "upvote_ratio": 1.0
    },
    {
        "title": "Best books / resources for clinicals?",
        "author": "DoctorTF",
        "url": "https://www.reddit.com/r/medicalschool/comments/110ovo1/best_books_resources_for_clinicals/",
        "text": "Does anyone have a recommended list of books / resources that are the best for specific rotations? Plsss",
        "created_utc": 1676232409,
        "upvote_ratio": 1.0
    },
    {
        "title": "How my brain feels after 47 uninterrupted hours of sketchy before the micro exam",
        "author": "ZeekerMD",
        "url": "https://i.redd.it/absft3i9dtha1.png",
        "text": "",
        "created_utc": 1676232387,
        "upvote_ratio": 1.0
    },
    {
        "title": "Do you/did you use Anki, and what is/was your class rank?",
        "author": "sappheline",
        "url": "https://www.reddit.com/r/medicalschool/comments/110opz9/do_youdid_you_use_anki_and_what_iswas_your_class/",
        "text": "Title.\n\n[View Poll](https://www.reddit.com/poll/110opz9)",
        "created_utc": 1676232020,
        "upvote_ratio": 1.0
    },
    {
        "title": "How To Deal with an Ailing Grandparent in Preclin?",
        "author": "fencergirl55",
        "url": "https://www.reddit.com/r/medicalschool/comments/110oood/how_to_deal_with_an_ailing_grandparent_in_preclin/",
        "text": "Hi guys. I've known this was coming for a while, but it kinda came to a head. My grandfather took a fall and while he's going to be okay for now, he is not well, and I know there is not much time left. We always had a very special bond. \n\nI'm across the country from home in med school. Pre clin is insane and there's like 5 lectures a day as we're learning about the cardiovascular system. I'm pretty lonely and don't know what to do. If anyone has any experience going through this please lmk. I'm genuinely crushed. \n\nSending love to everyone. Hug your loved ones tight as always, and if you're away from home, give them a call. &lt;3 I promise, it's worth those extra minutes out of studying time. \n\nThank you.",
        "created_utc": 1676231935,
        "upvote_ratio": 1.0
    },
    {
        "title": "What’s the deal with shitting on dental students?",
        "author": "flamebirde",
        "url": "https://www.reddit.com/r/medicalschool/comments/110ooal/whats_the_deal_with_shitting_on_dental_students/",
        "text": "The top two posts today and yesterday were just about dental students thinking their program is harder than medical school, and then subsequently bashing the fuck out of them. \n\nFirst off, why dental students? They’re about the closest thing to med students besides med students. Their curricula in preclinicals is basically a light version of  medicine preclinicals plus teeth. They have to take full body anatomy, they have to take pharmacology, they take path and oral path… things that have nothing to do with dentistry like Crohn’s, xeroderma pigmentosum, reading an EKG, MS, liver failure, and osteoporosis are all part of the curriculum although obviously to a much lesser degree considering they also have to do teeth (which are way more complicated than I thought before I met my roommate). By the way, MD/DO students don’t know shit about the tooth which is honestly kind of a shame, but I digress.\n\nI doubt this is a popular opinion especially in this subreddit, but dental school is HARD. I won’t speak for M-3/M-4 year, because I haven’t been there yet, but for preclinicals at least the difficulty is at least on par if not slightly worse. I literally live with a dental student, and their life is so much worse than mine. Not only do they have to study roughly as much as I do, they have to go into lab and do a ton of micromanaged drilling/crown/veneering work every weekend. They put in *effort*, and I find it sad that the knee jerk reaction from this subreddit when dental students say this isn’t “man, dental school sucks too, we’re all in this together”. It’s “hahah you little bitch your program is so much easier than mine so stop complaining.” \n\nIn terms of clinicals, they likely have a better schedule than we do, and residency is optional for them. But for preclinicals I’d definitely say dental school is no cakewalk. A dentist and maybe a pharmacist are the only two professions I would feel comfortable referring to as “doctors” in a healthcare setting besides an MD/DO.\n\nRe: “if medical school is so east why didn’t you do it”? Well, asshat, it’s cause they wanted to do *dentistry*. If you had your heart set on dermatology or optho and they were separate programs from med school like dental is, wouldn’t you go to that program over med school? The dental students I’ve met have been, bar none, the most enthusiastic about their field across all the health professions. They just really like teeth. I don’t get it but there it is.\n\nIs med school hard? Sure is. Does residency suck? More than 90% of other jobs. But that doesn’t mean other things aren’t also difficult to do. Your own suffering doesn’t give you the right to laugh at others. The natural human reaction is to think that you have it worse than everyone else, and that’s true for medical and dental students both. Don’t fall into the trap.",
        "created_utc": 1676231905,
        "upvote_ratio": 1.0
    },
    {
        "title": "High Yield Topics for Surgery Shelf to Know Cold?",
        "author": "cholla11",
        "url": "https://www.reddit.com/r/medicalschool/comments/110okue/high_yield_topics_for_surgery_shelf_to_know_cold/",
        "text": "\\^\\^\\^",
        "created_utc": 1676231645,
        "upvote_ratio": 1.0
    },
    {
        "title": "OMFS from medical school?",
        "author": "big_tickal",
        "url": "https://www.reddit.com/r/medicalschool/comments/110oar6/omfs_from_medical_school/",
        "text": "Is this something that happens often or at all? I'm really enjoying head and neck anatomy and I have some experience being treated by an OMFS that was pleasant so I thought I'd look into it. All the programs I've seen only take dental students though",
        "created_utc": 1676230917,
        "upvote_ratio": 1.0
    },
    {
        "title": "cyst versus vesicle",
        "author": "HeroesandCheerios",
        "url": "https://www.reddit.com/r/medicalschool/comments/110o6vx/cyst_versus_vesicle/",
        "text": "I'm on a derm rotation...can someone describe the difference please?",
        "created_utc": 1676230644,
        "upvote_ratio": 1.0
    },
    {
        "title": "Any recommendations for improving scores at qbanks?",
        "author": "xxcarlosxx745",
        "url": "https://www.reddit.com/r/medicalschool/comments/110nh8t/any_recommendations_for_improving_scores_at_qbanks/",
        "text": "Today I had 2 blocks of self assesment for usmle step 1, and I had subpar grades. When I use the study mode at amboss my grades are quite higher but at the time of doing the exams I failed miserably.",
        "created_utc": 1676228801,
        "upvote_ratio": 1.0
    },
    {
        "title": "Should other healthcare providers require residency?",
        "author": "DoctorDiabeto",
        "url": "https://www.reddit.com/r/medicalschool/comments/110ndwh/should_other_healthcare_providers_require/",
        "text": "Just a thought, why is it accepted that only doctors need on-the-job training through a residency? Would it not make sense that pharmacists, PTs, OTs would also be more competent at their job through extensive on-the-job training? \n\nIt seems weird to me that even newly minted fresh out of residency doctors are seen as “inexperienced” by some, when they’re totally fine letting some PT learn at their own expense.",
        "created_utc": 1676228564,
        "upvote_ratio": 1.0
    },
    {
        "title": "Question about how to learn diagnosis",
        "author": "Ashamed-Series-8159",
        "url": "https://www.reddit.com/r/medicalschool/comments/110n2wr/question_about_how_to_learn_diagnosis/",
        "text": "[removed]",
        "created_utc": 1676227786,
        "upvote_ratio": 1.0
    },
    {
        "title": "What are your “everyday carry” items for clinicals?",
        "author": "MORPHINEx208",
        "url": "https://www.reddit.com/r/medicalschool/comments/110msn6/what_are_your_everyday_carry_items_for_clinicals/",
        "text": "Can be anything",
        "created_utc": 1676227038,
        "upvote_ratio": 1.0
    },
    {
        "title": "Medical student case reports",
        "author": "nochu1234",
        "url": "https://www.reddit.com/r/medicalschool/comments/110mslp/medical_student_case_reports/",
        "text": "[removed]",
        "created_utc": 1676227035,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can someone please talk down to and make me feel like a dumb little kid? (is there room for authenticity in residency applications/interviews?)",
        "author": "OkayNowCough",
        "url": "https://www.reddit.com/r/medicalschool/comments/110moc4/can_someone_please_talk_down_to_and_make_me_feel/",
        "text": "Hey lol.\n\nSo I have been carrying this incorrect opinion/mentality with me for all my life that has made my life more difficult in key moments and is now keeping me from doing as good of a job as I can as I apply to residencies and prepare for future interviews. I know it's wrong, but I'm pretty stubborn about it. I know I need to do some self reflection and prove to myself how silly/immature I'm being, and so I'm reaching out for someone to just lecture me to the point of regretting even posting this. Tbh I already feel pretty cringey for posting this, but I'm also looking to find out if just maybe my idea has some merit to it and see if anyone has tried anything similar with positive results.\n\nAnyway, I have a really hard time writing Personal statements, Letters of Rec, etc, or answering interview questions that ask me to highlight positive personal attributes and things of this sort. My \"incorrect opinion\" is that all the suggested responses I find online feel so synthetic, so typical, so uninspiring. Worse than that, it paints this picture of this perfect student who always knew what they wanted and never stumbled on their way. It also bothers me that we are asked to describe ourselves with this impressive list of adjectives that would make for a good physician as if that is proof of anything. Like \"look at me, i spent an hour on [thesaurus.com](https://thesaurus.com) and rehearsed these sentences so that i can say with confidence that I am empathetic and hardworking\". I have also never understood how professors and attendings are able to write letters of rec for all these students. Like how do they have the energy to pump out the same BS phrases and descriptions for a bunch of students they barely know?? I'm terrified of being in that position one day. \n\nIn my mind I have this fantasy that residency approval officials are secretly miserable having to read another paint-by-numbers application and wish someone would just take a chance and submit a personal statement or answer an interview question by highlighting all the mistakes they've made and how they have grown as a person, and how they seriously wished they didn't do medicine halfway into med school, and how they only realized they wanted to do specialty X instead of Y during the last year of the program and now their previous clinical experience or shadowing seems less relevant, etc. Is there really no room for being authentic and open about your hiccups and demonstrating how you have grown into a person that would make a great physician? Are the only ways to grow as a med student through clinical experiences?\n\nOkay so that's my childish little rant. Be as critical as you'd like, it's very much welcomed and appreciated. I realize that this mentality is immature and holding me back and I want to be rid of it. I'd like to point out that I do realize that it's all just part of the game. As much as I hate it it's not like I could come up with a better method of selecting candidates for residency. I guess I just want someone to let me know I'm not crazy? I am alone in feeling this feels so fake/gross? I guess it's also  obvious from my description that I am someone who stumbled a lot through medical school and realizes they have a lot to own up to and so I just can't stand the thought of trying to act like it's been all sunshine and rainbows and that I never experienced a doubt about any of it. I don't think it would be dishonest of me to describe myself as having the qualities needed to be a good doctor, but I just feel disgusted at having to present such an idealized version.\n\nThank you for reading this. It was therapeutic for me just to write it all out haha. I look forward to any insight I can get from your responses. And especially to be made to feel like a little child ;)\n\nTL;DR: is there any room to be authentic about your mistakes, your doubts, your mess of a medical school experience during your residency interviews or in the application? Am I alone in feeling this feels fake and gross? Thanks!",
        "created_utc": 1676226738,
        "upvote_ratio": 1.0
    },
    {
        "title": "flags",
        "author": "karakara12",
        "url": "https://www.reddit.com/r/medicalschool/comments/110mix9/flags/",
        "text": "Does anyone know how to keep the flags when exporting a deck ?",
        "created_utc": 1676226376,
        "upvote_ratio": 1.0
    },
    {
        "title": "My question about residencies on match data - very important for me",
        "author": "lolxacademy",
        "url": "https://www.reddit.com/r/medicalschool/comments/110m4f3/my_question_about_residencies_on_match_data_very/",
        "text": "[removed]",
        "created_utc": 1676225378,
        "upvote_ratio": 1.0
    },
    {
        "title": "Opinions on Boards and Beyond?",
        "author": "ArrowHelix",
        "url": "https://www.reddit.com/r/medicalschool/comments/110lnxk/opinions_on_boards_and_beyond/",
        "text": "I dont know if this a hot take, but I would consider Boards&amp;Beyond a very overrated resource. Everyone in my school spends all day watching his videos, but I don't think BnB is very good at all. \n\nDr. Jason Ryan is often just reading off facts from First Aid, and he rarely takes the time to explain things conceptually. If Step 1 was still scored and knowing low-yield facts was still the name of the game, perhaps I could see the utility of his videos as a supplement. But I think that watching Pathoma + doing a supplemental QBank is far more effective in actually understanding physiology &amp; pathology, and will prepare a student much better for Step 1 and the wards.",
        "created_utc": 1676224249,
        "upvote_ratio": 1.0
    },
    {
        "title": "Med Student Activist in the news yesterday, regarding pelvic exam consent",
        "author": "NumberOfTheOrgoBeast",
        "url": "https://youtu.be/6GB_2QVlCK8",
        "text": "",
        "created_utc": 1676223304,
        "upvote_ratio": 1.0
    },
    {
        "title": "Help! Anki interval changed",
        "author": "WoodburyAve",
        "url": "https://www.reddit.com/r/medicalschool/comments/110k08q/help_anki_interval_changed/",
        "text": "[removed]",
        "created_utc": 1676220108,
        "upvote_ratio": 1.0
    },
    {
        "title": "😱😱😱",
        "author": "Adamantane11",
        "url": "https://www.reddit.com/r/Damnthatsinteresting/comments/110eiyy/aspergillus_mold_in_my_date/?utm_source=share&amp;utm_medium=android_app&amp;utm_name=androidcss&amp;utm_term=1&amp;utm_content=share_button",
        "text": "",
        "created_utc": 1676220085,
        "upvote_ratio": 1.0
    },
    {
        "title": "imagine skipping preclinical",
        "author": "KermitTheFrogtor",
        "url": "https://www.reddit.com/gallery/110jyvn",
        "text": "",
        "created_utc": 1676220018,
        "upvote_ratio": 1.0
    },
    {
        "title": "Anyone know why Hypercalcemia causes metabolic alkalosis?",
        "author": "Xreal5k",
        "url": "https://www.reddit.com/r/medicalschool/comments/110jrrs/anyone_know_why_hypercalcemia_causes_metabolic/",
        "text": "Cant find a definitive cause",
        "created_utc": 1676219513,
        "upvote_ratio": 1.0
    },
    {
        "title": "Dissection struggles",
        "author": "InterestingPut4391",
        "url": "https://www.reddit.com/r/medicalschool/comments/110jrg8/dissection_struggles/",
        "text": "[removed]",
        "created_utc": 1676219492,
        "upvote_ratio": 1.0
    },
    {
        "title": "Practice NMBE shelf score explanation",
        "author": "loveofcamelot",
        "url": "https://www.reddit.com/r/medicalschool/comments/110jedz/practice_nmbe_shelf_score_explanation/",
        "text": "[removed]",
        "created_utc": 1676218578,
        "upvote_ratio": 1.0
    },
    {
        "title": "If you haven’t already been able to get your patients to quit…",
        "author": "Similar_Radish8623",
        "url": "https://i.imgur.com/P7xsNoV.jpg",
        "text": "",
        "created_utc": 1676217869,
        "upvote_ratio": 1.0
    },
    {
        "title": "Chapter 01: Honoring Your Past, Planning Your Future Claywell: LPN to RN Transitions, 4th Edition - Chapter 01: Honoring Your Past, Planning Your Futu",
        "author": "SuperGrades",
        "url": "https://www.stuvia.com/doc/2321303/chapter-01-honoring-your-past-planning-your-future-claywell-lpn-to-rn-transitions-4th-edition",
        "text": "",
        "created_utc": 1676217397,
        "upvote_ratio": 1.0
    },
    {
        "title": "Chapter 30: Personality Disorders Morrison-Valfre: Foundations of Mental Health Care, 7th Edition 2023 Update Solution A+ - Chapter 30: Personality Disorders Morrison-Valfre",
        "author": "SuperGrades",
        "url": "https://www.stuvia.com/doc/2321316/chapter-30-personality-disorders-morrison-valfre-foundations-of-mental-health-care-7th-edition-2023-update-solution-a",
        "text": "",
        "created_utc": 1676217379,
        "upvote_ratio": 1.0
    },
    {
        "title": "Global Business FVC1 Pre-Assessment Questions And Answers 2023 - Global Business FVC1 Pre-Assessment",
        "author": "SuperGrades",
        "url": "https://www.stuvia.com/doc/2336337/global-business-fvc1-pre-assessment-questions-and-answers-2023",
        "text": "",
        "created_utc": 1676217319,
        "upvote_ratio": 1.0
    },
    {
        "title": "Annual Competency Exam Questions And Answers 2023 Update - Annual Competency 2023",
        "author": "SuperGrades",
        "url": "https://www.stuvia.com/doc/2363222/annual-competency-exam-questions-and-answers-2023-update",
        "text": "",
        "created_utc": 1676217305,
        "upvote_ratio": 1.0
    },
    {
        "title": "Annual Competency Exam 2023 Update a+ - Annual Competency 2023 Update a+",
        "author": "SuperGrades",
        "url": "https://www.stuvia.com/doc/2363229/annual-competency-exam-2023-update-a",
        "text": "",
        "created_utc": 1676217291,
        "upvote_ratio": 1.0
    },
    {
        "title": "Thinking about pursuing an MBA/MPH Master",
        "author": "Upbeat-Friendship-51",
        "url": "https://www.reddit.com/r/medicalschool/comments/110ivxe/thinking_about_pursuing_an_mbamph_master/",
        "text": "[removed]",
        "created_utc": 1676217289,
        "upvote_ratio": 1.0
    },
    {
        "title": "Clinical Annual Competency Exam – Fresenius 2023 Update Q&amp;amp;A a+ - Clinical Annual Competency – Fresenius 2023 U",
        "author": "SuperGrades",
        "url": "https://www.stuvia.com/doc/2363237/clinical-annual-competency-exam-fresenius-2023-update-q-en-a-a",
        "text": "",
        "created_utc": 1676217278,
        "upvote_ratio": 1.0
    },
    {
        "title": "Fresenius Annual Exam 2023 Update Q&amp;amp;A (A+ Grade) - Fresenius Annual 2023 Update Q&amp;amp;A",
        "author": "SuperGrades",
        "url": "https://www.stuvia.com/doc/2363251/fresenius-annual-exam-2023-update-q-en-a-a-grade",
        "text": "",
        "created_utc": 1676217261,
        "upvote_ratio": 1.0
    },
    {
        "title": "Fresenius annual exam- Q&amp;amp;A 2023 Update - Fresenius annual - Q&amp;amp;A 2023 Update",
        "author": "SuperGrades",
        "url": "https://www.stuvia.com/doc/2363257/fresenius-annual-exam-q-en-a-2023-update",
        "text": "",
        "created_utc": 1676217244,
        "upvote_ratio": 1.0
    },
    {
        "title": "Clinical Annual Competency Exam – Fresenius 2023 Update Q&amp;amp;A - Clinical Annual Competency – Fresenius 2023 U",
        "author": "SuperGrades",
        "url": "https://www.stuvia.com/doc/2363272/clinical-annual-competency-exam-fresenius-2023-update-q-en-a",
        "text": "",
        "created_utc": 1676217229,
        "upvote_ratio": 1.0
    },
    {
        "title": "Maternal Child Rasmussen Exam 2 2023 Updated A+ - Maternal Child Rasmussen 2 2023 Updated A+",
        "author": "SuperGrades",
        "url": "https://www.stuvia.com/doc/2363289/maternal-child-rasmussen-exam-2-2023-updated-a",
        "text": "",
        "created_utc": 1676217151,
        "upvote_ratio": 1.0
    },
    {
        "title": "NUR 2459 Rasmussen Mental Health Exam 1 Modules 1-3 - NUR 2459",
        "author": "SuperGrades",
        "url": "https://www.stuvia.com/doc/2363301/nur-2459-rasmussen-mental-health-exam-1-modules-1-3",
        "text": "",
        "created_utc": 1676217136,
        "upvote_ratio": 1.0
    }
]