[
    {
        "title": "When I was growing up, residency interviews were in person...",
        "author": "Bright_Translator970",
        "url": "https://www.reddit.com/r/medicalschool/comments/119k0g2/when_i_was_growing_up_residency_interviews_were/",
        "text": "I've been a silent observer of residency applicants discussing Zoom interviews and how terrible they are if they last longer than 4 hours, complaining about the meet and greets, disappointment if swag isn't sent, etc. So I thought I'd share my experience from in person interviews. I don't have a horse in the race so I don't mind mentioning specific programs by name.\n\nI graduated from medical school in May 2019. My interviews started in November 2018 and ended in January 2019. I applied pediatrics because I knew before starting medical school that was the speciality for me.\n\nIf memory serves me, I applied for \\~50 pediatric residency programs. I received interviews for \\~35 of them. I was ultimately rejected from a few Mayo, Rainbow babies, and Michigan and heard from them about the rejections at varying times from October-February. I cancelled al my interviews in the state of Ohio, at Milwaukee, Tucson, and Wichita because I didn't want to travel there or I just changed my mind about wanting to live there. There were several that I never heard back from but to be frank, even though I wanted to stay in the midwest I had ample interviews and never reached out to them after being ghosted because I didn't need/want interviews there. My application was submitted September 15 and my first interview was offered on 9/18 to South Dakota, then OU Tulsa. The majority of my interview invites were sent in September-November.\n\nMy first week of interviews I did 4 in 5 days. My very first interview was the the U of Iowa and this was the only pre-interview dinner which paid for alcohol at dinner in addition to appetizers, entrees, dessert. The interview was the next day. Then I drove to Des Moines for the next interview. Wednesday evening was the pre-interview dinner in Chicago. Thursday I interviewed at Advocate Care-Oak Lawn. That evening was the pre-interview dinner in Springfield, IL with the interview the next day.\n\nInterview days from what I recall were all very similar: shuttle picks up all the applicants dressed in business dress at anywhere from 6:45-7:30a, there's a light breakfast served at the program which is usually fruit &amp; yogurt and pastries, an intro presentation from the PD, chiefs, tour of the hospitals/clinics, 15-20 minutes of downtime if you aren't in the interview cycle, 2-5 15-30 minute interviews with chief residents/rising chief residents, current residents, PD, faculty. An hour long lunch with current residents. Some lunches were boxed lunches that were already prepared (ex: grab the turkey sandwich box if that's what you want) or some buffet style mediocre food. There were almost always additional interviews/tours in the afternoon. The day typically ended around 2-2:30. Sometimes the day started with attending either grand rounds, problem conference, etc. In that case, applicants weren't excepted to participate, but this gave the applicants an opportunity to observe what didactics were like at that particular program. I do remember that every interview day started much earlier than I expected. As a result, I wasn't able to eat breakfast at any of these hotels because breakfast didn't start until \\~7 and the shuttle came before then.\n\nI wore my same suit (I am a female) for every interview. No I did not get it dry cleaned until the end of interview season. I did cycle through 4-5 different blouses. I got very good at packing a garment bag with pre-interview dinner clothes and everything else I'd need.\n\nI do have several of my interview emails saved still. I probably spent $1200 on flights. $400 on hotels. Another $100-200 on ubers. I probably put 3k-5k miles on my car. I can't even guess how much I spent on gas, road snacks, food, etc. I do remember getting my oil changed at a Jiffy Lube in Springfield, IL (2 states away from my home state) because I was due.\n\n**Interview day**\n\nBy far my least favorite interview was at Children's Hospital of Michigan. My 2nd interview of the day was with the PD. She had my printed application in front of her, said \"OK you're from X city, go to X medical school, what questions do you have for me because I've heard them all at this point.\" The 20 minute interview was a rapid fire attempt for me to find questions to keep the conversation going. I felt like it was a test that I would fail if I didn't think of any questions, it must mean I wasn't interested.\n\nPhoenix was the only program which made you sign up for a post-interview phone call \\~1 month after your interview date so that a faculty member with whom you interviewed could answer any additional questions you may have.\n\nMichigan State and Iowa both had me read aloud this standardized question about what would you do if you saw a coworker stealing office supplies.\n\nThe faculty at SIU were very foreign with thick accents which made it a little hard to understand their questions.\n\n**Swag**\n\nWisconsin gave interviewees a pint glass with the program logo etched on in addition to an actual glass bottle of beer.\n\nTennessee gave interviewees a really nice embroidered mini portfolio file &amp; a USB drive with the presentations they gave at interview day (what it's like to live in Memphis). I still use this USB drive to this day.\n\nNebraska gave t-shirts (they let us choose our size) with the saying \"Pediatrics: our patients are cuter than yours\" on the back. I still wear this shirt to sleep in.\n\nDes Moines also gave a USB in a really cute character USB drive.\n\nOU in Tulsa's hotel was a Doubletree so warm cookies were served at check-in. They also gave us our choice of an animal badge reel. I still have my frog badge holder. This interview was also the only one which advertised a business casual dress, if interviewees so wanted.\n\nMost other programs gave a bag of candy/snacks/bottled water in a paper bag.\n\n**Pre-interview dinner**\n\nAdvocate Health-Oak Lawn in Chicago had their pre-interview dinner at someone's apartment which was literally on Michigan Avenue. I could not find parking, got very frustrated driving around for a half hour, and ended up texting the second year resident that I was delayed in my travels and couldn't make the dinner.\n\nChildren's Mercy pre-interview dinner was at Jack Stack and was by far the best food.\n\nWisconsin had their pre-interview dinner at a couple residents apartment in a large gathering room. WashU did the same.\n\nTennessee had a resident couple host the pre-interview dinner in their home. There were so many applicants and residents there, I'm not sure how they fit everyone but it was so cozy and wonderful and generous as they also cooked for everyone.\n\n**Hotels**\n\nUniversity of Wisconsin, Children's Hospital of Michigan and Advocate Health Care-Oak Lawn did not pay for hotels. Obviously, none of them paid for flights. I drove to as many as possible (see above doing 4 interviews in 1 week). I did fly to Michigan to interview at Michigan State and Children's Hospital of Michigan back to back and also to Phoenix. Phoenix was the only program which didn't offer a pre-interview dinner but rather had pre-interview appetizers only served at their meet and greet. I wasn't terribly interested in this program anyway and used this as more of an opportunity to visit family in the area.\n\nIowa's hotel was by far the swankiest/coolest (The Graduate Hotel).\n\nA lot of hotels don't have mini-fridges/microwaves anymore, a fact you'd quickly learn when you brought leftovers from your pre-interview dinner back to your room only to find out there was no place to even properly store the food.\n\nThe Des Moines hotel was great but the breakfast wasn't free. This was the one hotel I remember that breakfast started serving early enough that the interviewees could actually eat breakfast, but it was up to us to pay for it.\n\n**Scheduling interviews**\n\nInterview broker, thalamus, direct e-mail to the residency program coordinator.\n\nLouisville sent out an invite which I immediately clicked on and they had no interview spots available. I signed up for the waitlist and one spot was ultimately available in January but I didn't attend because I was so burnt out with interviews by that point.\n\nOU-OKC waitlisted me and when there finally was an interview available at the beginning of January, I didn't sign up because I was so burnt out with interviews.\n\n**Bottom line**\n\nThis obviously isn't all the places I interviewed at and I don't mention the program I actually attended for residency. Not that this is at all relevant, but I love my job as a general pediatrician. I make $200k as a general pediatrician in the New England area and this is my first job out of residency. I had ample time to study for my boards and comfortably passed on my first attempt. I believe that any of these programs would have trained me well to pass my pediatric boards.",
        "created_utc": 1677114587,
        "upvote_ratio": 1.0
    },
    {
        "title": "How important is doing research in a consistent speciality?",
        "author": "snoopychan",
        "url": "https://www.reddit.com/r/medicalschool/comments/119jp7x/how_important_is_doing_research_in_a_consistent/",
        "text": "Title^ \n\nIf you’re not trying to get into one of those competitive specialities where speciality-specific research is important, how important is it for students to demonstrate a clear trend in their research?\n\nFor example, I don’t intend on going into academics but I want to experience a wide breadth of research settings while I’m still in school. Also, I’m the type of person who takes any research opportunity I’m offered to keep myself busy, so right now I’m involved in a wet lab project, a prospective clinical study, and a handful of basic chart review retrospective studies, all within pretty different medical disciplines. \n\nAssuming I’m very productive and able to get a few papers published, and able to talk about my projects well, does it matter that everything is all over the place, so to speak?\n\nMy first choice is anesthesiology if that matters.\n\nThanks, any insight is greatly appreciated.",
        "created_utc": 1677113801,
        "upvote_ratio": 1.0
    },
    {
        "title": "Constant vandalism on ERAS spreadsheets making them at times unusable",
        "author": "Ironsight12",
        "url": "https://www.reddit.com/r/medicalschool/comments/119jjiq/constant_vandalism_on_eras_spreadsheets_making/",
        "text": "There has been a really unfortunate amount of trolling on all the ERAS spreadsheets this year, particularly the anesthesia, OB, and rads ones. It's not clear whether it's an applicant or random reddit roll.\n\nThe anesthesia sheet right now is literally unusable right now because trolls are using some bot to repeatedly spam slurs against minorities in the chat. The front page of the sheet is even worse. Any efforts to delete these are instantly undone by their bot.\n\nNext year, applicants should really consider requiring people to use a throwaway email to gain edit privileges. Clearly anonymous usage isn't tenable once trolls find the spreadsheets.",
        "created_utc": 1677113381,
        "upvote_ratio": 1.0
    },
    {
        "title": "Nepotism is alive and well",
        "author": "UFAP23",
        "url": "https://www.reddit.com/r/medicalschool/comments/119jbin/nepotism_is_alive_and_well/",
        "text": "Bill gates just bought his daughter a penthouse apartment in New York. How much do we want to bet she matches in New York City? Coincidence?",
        "created_utc": 1677112819,
        "upvote_ratio": 1.0
    },
    {
        "title": "Plan B if Match doesn’t work out",
        "author": "DrH2OJr",
        "url": "https://www.reddit.com/r/medicalschool/comments/119img4/plan_b_if_match_doesnt_work_out/",
        "text": "I had gotten fewer interviews than I had expected while dual applying this cycle. Just wondering, if I happen to not Match, am I forced into SOAP? Or could I just apply to research year programs and reapply the next cycle? Just trying to figure my options. Would rather not be forced into a program that I don’t want to be at. Thank you",
        "created_utc": 1677111061,
        "upvote_ratio": 1.0
    },
    {
        "title": "peds or ob/gyn????",
        "author": "PinPuzzled5434",
        "url": "https://www.reddit.com/r/medicalschool/comments/119iii6/peds_or_obgyn/",
        "text": "[removed]",
        "created_utc": 1677110792,
        "upvote_ratio": 1.0
    },
    {
        "title": "Burnout Post Step 1",
        "author": "Temporary-Put5303",
        "url": "https://www.reddit.com/r/medicalschool/comments/119iak7/burnout_post_step_1/",
        "text": "[removed]",
        "created_utc": 1677110281,
        "upvote_ratio": 1.0
    },
    {
        "title": "My Psych Education Is Being Prioritized Over a NP Student?",
        "author": "TrailMixedd",
        "url": "https://www.reddit.com/r/medicalschool/comments/119i538/my_psych_education_is_being_prioritized_over_a_np/",
        "text": "It is what it is. Have no seen one patient by myself. The supervising NP has a nurse who is in NP school working under him. I was told I can't do suicide screening even though it is emergency psych lol..The other nurse told me she will try to get me patients though. It seems crazy that we have no power but I plan to tell the resident first...",
        "created_utc": 1677109823,
        "upvote_ratio": 1.0
    },
    {
        "title": "How old were you when you started med school",
        "author": "BabyPikachu53",
        "url": "https://www.reddit.com/r/medicalschool/comments/119hy3c/how_old_were_you_when_you_started_med_school/",
        "text": "Just curious, i started at 18, one year after high school\n\n[View Poll](https://www.reddit.com/poll/119hy3c)",
        "created_utc": 1677109352,
        "upvote_ratio": 1.0
    },
    {
        "title": "I was recently hospitalized and have been struggling to have my addiction treated appropriately by my healthcare team",
        "author": "FallGuyPigeonSkin",
        "url": "https://www.reddit.com/r/medicalschool/comments/119h5dt/i_was_recently_hospitalized_and_have_been/",
        "text": "I got admitted for an unrelated issue that I’m not comfortable going into detail about.  It’s been a few days getting it all sorted out with tests and imaging.  \n\nHowever, before this all occurred I’ve also been having a long-term addiction.  Nothing serious or illegal.  But the hospital and my residents/attending don’t seem to take it seriously. \n\nMy… life partner has had to make several visits a day to my hospital room to ensure that my needs are being taken care of. Several times, the resident has walked in while I’m trying to ensure I don’t have withdrawals. \n\nThey seem to be rather uncomfortable about this and haven’t directly addressed getting me help.  I’m really not sure how I feel about treatment but I do know that I need it.  I really don’t know how to bring it up since it’s so personal and embarassing.  \n\nAnyone have thoughts on how to go about discussing this or broaching the subject without risking serious consequences?",
        "created_utc": 1677107487,
        "upvote_ratio": 1.0
    },
    {
        "title": "ROL Certified",
        "author": "Mr_Dr_Schwifty",
        "url": "https://i.redd.it/dic0r9g54vja1.jpg",
        "text": "",
        "created_utc": 1677106994,
        "upvote_ratio": 1.0
    },
    {
        "title": "Watch out UWorld, ChatGPT is coming for you",
        "author": "jcarberry",
        "url": "https://i.imgur.com/vXv0G8j.png",
        "text": "",
        "created_utc": 1677106760,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to get better at exams?",
        "author": "Fillingavoid2468",
        "url": "https://www.reddit.com/r/medicalschool/comments/119glgv/how_to_get_better_at_exams/",
        "text": "I feel like I’m barely passing but honestly our tests are not hard and people I know are only missing 2-4 questions. \nPeople who do well or have gotten better, how do you prepare for exams. \n\nOur exams are multiple choice.",
        "created_utc": 1677106232,
        "upvote_ratio": 1.0
    },
    {
        "title": "Best hospitals wales deanery- if anyone works in wales deanery or Cardiff uni students- what is the best hospital to train at in South Wales?",
        "author": "Entire-Tonight-1001",
        "url": "https://www.reddit.com/r/medicalschool/comments/119ggmk/best_hospitals_wales_deanery_if_anyone_works_in/",
        "text": "[removed]",
        "created_utc": 1677105929,
        "upvote_ratio": 1.0
    },
    {
        "title": "Would you recommend working as a healthcare worker in the us or the uk ?",
        "author": "LameesAziz",
        "url": "https://www.reddit.com/r/medicalschool/comments/119g3sp/would_you_recommend_working_as_a_healthcare/",
        "text": "[removed]",
        "created_utc": 1677105140,
        "upvote_ratio": 1.0
    },
    {
        "title": "Advice please",
        "author": "Environmental-Fan953",
        "url": "https://www.reddit.com/r/medicalschool/comments/119fpti/advice_please/",
        "text": "[removed]",
        "created_utc": 1677104291,
        "upvote_ratio": 1.0
    },
    {
        "title": "Specialties that are “cerebral” but also have emergent SHTF moments?",
        "author": "Maybedoc1",
        "url": "https://www.reddit.com/r/medicalschool/comments/119fba5/specialties_that_are_cerebral_but_also_have/",
        "text": "[removed]",
        "created_utc": 1677103482,
        "upvote_ratio": 1.0
    },
    {
        "title": "Clinician Nexus?",
        "author": "strawberries_study",
        "url": "https://www.reddit.com/r/medicalschool/comments/119exe7/clinician_nexus/",
        "text": "[removed]",
        "created_utc": 1677102749,
        "upvote_ratio": 1.0
    },
    {
        "title": "Absolutely exhausted….and I’m an MS1",
        "author": "sukiyaki14",
        "url": "https://www.reddit.com/r/medicalschool/comments/119ex02/absolutely_exhaustedand_im_an_ms1/",
        "text": "I’m an MS1 feeling absolutely exhausted at the end of each day. I’ve been doing all of the things I’m supposed to do (exercise, sleeping 8 hours a day, eating right, taking days off), but I can’t help but be absolutely exhausted everyday. I feel like I can’t take enough time off to recover from just going to required classes, and watching lecture. How does everyone not feel like they’re about to melt by 3 PM eveyday???",
        "created_utc": 1677102728,
        "upvote_ratio": 1.0
    },
    {
        "title": "I don't know know if I can keep doing this",
        "author": "duden8r",
        "url": "https://www.reddit.com/r/medicalschool/comments/119ev29/i_dont_know_know_if_i_can_keep_doing_this/",
        "text": "I lost my dog, my best friend. I had to watch her go and I didn't want to leave her side. She was the one I could always turn to when I was at a low point. She was the common thread that held my family together in an already strained dynamic. My little brother doesn't want anything to do with my father, and I think he packed his stuff and left home. My father is suicidal and an emotional wreck. My mother is working herself to death. I tried so hard to keep my family together before and while in med school, and I failed. I can't even grieve properly because of how fucked up my family situation is. My med school's academic affairs office has absolutely no sympathy for the mental trauma I've endured, being more worried about policy over a student's well-being, and I went catatonic yesterday for I don't know how long. I feel like my mind's regressed to that of a child just so it doesn't hurt as bad. I have little motivation to eat, walk, get out of bed. I don't know how I can keep up with the rigors of med school with all this on my mind, especially in a school that evidently discourages humanity. I feel like I need therapy, but I don't know if I even have the strength to go see one.",
        "created_utc": 1677102635,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to interpret the MSACSR number?",
        "author": "catbuttluvr",
        "url": "https://www.reddit.com/r/medicalschool/comments/119esc9/how_to_interpret_the_msacsr_number/",
        "text": "[removed]",
        "created_utc": 1677102502,
        "upvote_ratio": 1.0
    },
    {
        "title": "I don't know if I can keep doing this",
        "author": "ta238966",
        "url": "https://www.reddit.com/r/medicalschool/comments/119eqsr/i_dont_know_if_i_can_keep_doing_this/",
        "text": "[removed]",
        "created_utc": 1677102428,
        "upvote_ratio": 1.0
    },
    {
        "title": "All about auto-splenectomy!",
        "author": "osmosisbyelsevier",
        "url": "https://www.reddit.com/r/medicalschool/comments/119eq3d/all_about_autosplenectomy/",
        "text": "[removed]",
        "created_utc": 1677102393,
        "upvote_ratio": 1.0
    },
    {
        "title": "First Aid for the USMLE Step 1 2022, 32nd Edition",
        "author": "No-Cry-8729",
        "url": "https://nursingmaterials.gumroad.com/l/byfpzg/",
        "text": "",
        "created_utc": 1677102285,
        "upvote_ratio": 1.0
    },
    {
        "title": "Better get your water bottles ready",
        "author": "stephawkins",
        "url": "https://www.reddit.com/r/medicalschool/comments/119el1u/better_get_your_water_bottles_ready/",
        "text": "Amazon closes One Medical acquisition.  Yall are going to be too busy to go to the bathroom.  So start learning how to pee into water bottles.\n\nOn the bright side, Amazon Prime will be available at a 5% discount.",
        "created_utc": 1677102164,
        "upvote_ratio": 1.0
    },
    {
        "title": "All about auto-splenectomy!",
        "author": "osmosisbyelsevier",
        "url": "https://i.redd.it/d3bqwom36tja1.png",
        "text": "",
        "created_utc": 1677101495,
        "upvote_ratio": 1.0
    },
    {
        "title": "Medical Schools with smaller class sizes, accommodations, and/or non-required lectures?",
        "author": "asadhoe2020",
        "url": "https://www.reddit.com/r/medicalschool/comments/119dqox/medical_schools_with_smaller_class_sizes/",
        "text": "Hello all,\nI’m currently a junior in college who’s starting to look at different med schools, and I’m noticing that their class sizes are all pretty big. Ive struggled with pretty bad anxiety in large classes (40+) throughout undergrad; I sit all the way up front so I won’t have to see everyone, but hearing people making noise, tapping their feet, chewing, etc makes me overwhelmed easily. I’m perfectly fine with being in small groups or one on one with people. I know medicine is what I want to do, but I don’t know how I’m going to achieve that comfortably in an extra large academic setting. What should I do? Does anybody else struggle with this? Are there med schools with small class sizes (&lt;100) or am I reaching? If there aren’t smaller med schools out there, I’m sure I can make myself get by on watching lectures or just sucking it up and going to class.",
        "created_utc": 1677100855,
        "upvote_ratio": 1.0
    },
    {
        "title": "Lord….",
        "author": "blood_transfusion",
        "url": "https://i.redd.it/5zzgdvciluja1.jpg",
        "text": "",
        "created_utc": 1677100726,
        "upvote_ratio": 1.0
    },
    {
        "title": "Sonography program 22 months",
        "author": "Tekevin",
        "url": "https://www.reddit.com/r/medicalschool/comments/119dhut/sonography_program_22_months/",
        "text": "Hi, my girlfriend recently got accepted to Sonography school and is excited but really scared. She wanted to know how hard it is any if anyone has any tips.",
        "created_utc": 1677100502,
        "upvote_ratio": 1.0
    },
    {
        "title": "No money between match and intern year?",
        "author": "plastic_coffee",
        "url": "https://www.reddit.com/r/medicalschool/comments/119cqlx/no_money_between_match_and_intern_year/",
        "text": "I won’t have any money between this time. I’ll be living with my mom but I’m worried about paying for the first month of intern year since I know we won’t get our paycheck weeks into it….",
        "created_utc": 1677099440,
        "upvote_ratio": 1.0
    },
    {
        "title": "God Bless all PCPs",
        "author": "DrZoidbergDO",
        "url": "https://i.redd.it/bc3lkxtzzsja1.jpg",
        "text": "",
        "created_utc": 1677099401,
        "upvote_ratio": 1.0
    },
    {
        "title": "Best study routine for when you get home after class ??",
        "author": "Tamalecakez",
        "url": "https://www.reddit.com/r/medicalschool/comments/119cj6m/best_study_routine_for_when_you_get_home_after/",
        "text": "[removed]",
        "created_utc": 1677099153,
        "upvote_ratio": 1.0
    },
    {
        "title": "What are some unhealthy habits that have helped you get through M2-M3?",
        "author": "Moist_Homework_2984",
        "url": "https://www.reddit.com/r/medicalschool/comments/119c9zu/what_are_some_unhealthy_habits_that_have_helped/",
        "text": "Avid consumer of the devil’s lettuce since high school. In anticipation of drug testing for clerkships, I quit before starting M1. \n\nEnd of M2. I work out 6 days a week and do bjj 4 days a week just to feel something. Studying 8 hours a day has me really close to relapsing on nicotine since I can’t smoke the za za. \n\nWhat are some bad habits, if any, that have helped you get through 2nd year and clerkships?",
        "created_utc": 1677098786,
        "upvote_ratio": 1.0
    },
    {
        "title": "Learn, pass, forget",
        "author": "DrHabMed",
        "url": "https://www.reddit.com/r/medicalschool/comments/119c788/learn_pass_forget/",
        "text": "I don't know about you, but as a student I have the impression that I am an \"expert\" at everything. I'm already explaining.\n\nOn Monday I am an expert in gynecology (because I have classes), on Wednesday, for example, I have a pass in family medicine (I also have to know all the scales there). Cardiology stays on Friday (of course I have to recite the meds from memory).\n\nAnd so for the whole 6 years.\n\nDoes studying medicine really have to be a process of cramming useless information? I don't know the basics, just need to focus on a lot of complicated stuff. And not from one field, but from several that I have during the year. Of course, the tests ask for details that I don't remember a week after passing.\n\nPlease tell me it's different with you. It's better, you know the most important basics, you're not afraid for your skills in working with the patient. You learn the most important things, and you do not start with the complicated ones that are important for a specialist in a given field.",
        "created_utc": 1677098683,
        "upvote_ratio": 1.0
    },
    {
        "title": "Who else’s school complains about people not coming to optional lectures",
        "author": "Tagrenine",
        "url": "https://www.reddit.com/r/medicalschool/comments/119c32g/who_elses_school_complains_about_people_not/",
        "text": "🤨 apparently it’s been a huge deal during meetings because they think us not coming is why the averages are lower that other classes…even though they changed to P/F at pretty much the same time",
        "created_utc": 1677098532,
        "upvote_ratio": 1.0
    },
    {
        "title": "What are your clinical \"body language hacks\"?",
        "author": "RelativeMap",
        "url": "https://www.reddit.com/r/medicalschool/comments/119buhk/what_are_your_clinical_body_language_hacks/",
        "text": "For both patient care and interacting with your senior resident/fellow/attending.\n\nExample for patient care: try to stay at eye level or lower than them to make them more comfortable around you. \n\nExample for Senior med staff: Not slouching in the chair when discussing patient care in order to look more attentive. I know this stuff sounds pretentious and borderline pedantic but especially with older doctors I feel like they tend to pick up on these small social cues",
        "created_utc": 1677098181,
        "upvote_ratio": 1.0
    },
    {
        "title": "Poster/Abstract Author Order",
        "author": "msox97",
        "url": "https://www.reddit.com/r/medicalschool/comments/119btsa/posterabstract_author_order/",
        "text": "Hi,\n\n  I had a question about author order for an abstract/poster I am finishing up. The poster is using data from a manuscript where I will be the second author. If I wrote up the entire poster/submitted/presented etc, would I still be the second author on the poster or would I be first author? I emailed the PI and haven't heard back.\n\n&amp;#x200B;\n\nThank you!",
        "created_utc": 1677098153,
        "upvote_ratio": 1.0
    },
    {
        "title": "Me listening to the OB attending call me a slacker at the end of my 6th 14 hour shift of the week",
        "author": "FedPrinter69420",
        "url": "https://i.redd.it/uoygt5qvtsja1.jpg",
        "text": "",
        "created_utc": 1677097366,
        "upvote_ratio": 1.0
    },
    {
        "title": "Do not assume the “good times” will last. Save, invest, and hustle",
        "author": "moosegeese",
        "url": "https://www.reddit.com/r/medicalschool/comments/119azmv/do_not_assume_the_good_times_will_last_save/",
        "text": "[removed]",
        "created_utc": 1677096952,
        "upvote_ratio": 1.0
    },
    {
        "title": "Surgery LoR for non-surgical applicant?",
        "author": "grave_plot",
        "url": "https://www.reddit.com/r/medicalschool/comments/119asjg/surgery_lor_for_nonsurgical_applicant/",
        "text": "Really impressed my attending, and he offered out of the blue to write me a strong letter. \n\n\nI’m applying neurology but I only have one LoR potentially lined up. Will it look weird to have a surgeon (senior faculty at big department, well known in his field) write a letter mainly speaking to my work ethic and enthusiasm?",
        "created_utc": 1677096687,
        "upvote_ratio": 1.0
    },
    {
        "title": "Class percentile",
        "author": "SelectionFar4188",
        "url": "https://www.reddit.com/r/medicalschool/comments/119ahl8/class_percentile/",
        "text": "It is good to be in the 30-40% in your class?  I have been struggle in my exams but I’m able to be in the 30-40% of my class, although I have been (in half of the exams) in the 50-60 percentile for two classes.",
        "created_utc": 1677096259,
        "upvote_ratio": 1.0
    },
    {
        "title": "Yall! I've found the cure for Anti-vaxx!",
        "author": "jasmineflower88",
        "url": "https://i.redd.it/28m360e8osja1.png",
        "text": "",
        "created_utc": 1677095450,
        "upvote_ratio": 1.0
    },
    {
        "title": "BuT enGlAnd’s nHS iS SO mUcH bEtTer",
        "author": "moosegeese",
        "url": "https://i.redd.it/3ggv11k35uja1.jpg",
        "text": "",
        "created_utc": 1677095206,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why is plasma coming out like foam?",
        "author": "emiliafrangedakis",
        "url": "https://i.redd.it/5h472sc84uja1.jpg",
        "text": "My mom was bit by a tick.. then removed it. She got cupping done on the tick bite the next day, and her plasma came out like foam. I can’t find anything about this online, so was hoping a medical professional would know why.",
        "created_utc": 1677094915,
        "upvote_ratio": 1.0
    },
    {
        "title": "The most hard and demotivating part about medicine for me is everyone else",
        "author": "PrudentBall6",
        "url": "https://www.reddit.com/r/medicalschool/comments/11993vf/the_most_hard_and_demotivating_part_about/",
        "text": "Out of every industry I’ve ever worked and I have never worked in an industry where people hate their jobs as much as medicine. Where is normal conversation and part of almost every conversation to complain about your job. Nothing scares me more than burning me out as how much my coworkers and Piers complain about and shit on something that I love so much 😢\nI understand why people get burnt out and stuff but I have a really hard time not letting other people’s negative energy suck out my energy",
        "created_utc": 1677094331,
        "upvote_ratio": 1.0
    },
    {
        "title": "Which specialties lend themselves best to consulting, pharma, and biotech?",
        "author": "theonlytelicious",
        "url": "https://www.reddit.com/r/medicalschool/comments/1198b2u/which_specialties_lend_themselves_best_to/",
        "text": "As the title says. I find myself at a crossroad between anesthesia, IM, and a surgical subspecialty. Which would leave the most options open for leaving clinical medicine for the above fields in the future?",
        "created_utc": 1677093103,
        "upvote_ratio": 1.0
    },
    {
        "title": "Surgery people, can you describe in detail how IM made you feel?",
        "author": "Blackhobo40",
        "url": "https://www.reddit.com/r/medicalschool/comments/11986hn/surgery_people_can_you_describe_in_detail_how_im/",
        "text": "This is NOT some kind of IM slander post. I simply want to know if I am alone in the way I feel. I have a history of ADHD and it seems that surgery is the only thing in the world that can make me focus for an extended period of time. I struggle immensely to maintain focus on IM rounds, especially if the team is discussing a patient that I am not following. This puts me in a cycle of zoning out, becoming bored, and making minutes feel like hours. \n\nI wish I enjoyed it more, I really do. But I feel beyond exhausted at the end of every day due to the persistent boredom. On the other hand, a 16 hour day of surgery where I’m constantly knocking out tasks on my to do list keeps me engaged and feeling productive; I feel energized when I get home. Am I the only one that feels this way? I’m hoping to find out whether this is a me problem or whether this is a problem that commonly affects students who are not interested in medicine. Thanks in advance for sharing your two cents!",
        "created_utc": 1677092808,
        "upvote_ratio": 1.0
    },
    {
        "title": "on call, in love?",
        "author": "813stemcell",
        "url": "https://www.reddit.com/r/medicalschool/comments/11982qp/on_call_in_love/",
        "text": "[removed]",
        "created_utc": 1677092564,
        "upvote_ratio": 1.0
    },
    {
        "title": "Fainting durin operation",
        "author": "ewedee",
        "url": "https://www.reddit.com/r/medicalschool/comments/11981e4/fainting_durin_operation/",
        "text": "Hey guys   \nquick question:  \ni have been to orthopedic surgery today and yesterday (yesterday two hip replacements, today a shoulder replacement)  \nEvery surgery I had problems with my own circulation and was close to fainting which lead to me leaving the operation room.  \nis there anything that I can do about this?  \nis this normal for the first few operation?  \nI am so interessted in the subject and I don't have a problem with the operation. but somehow my body does...",
        "created_utc": 1677092481,
        "upvote_ratio": 1.0
    },
    {
        "title": "PALS/ACLS certification",
        "author": "mochi-wiwa",
        "url": "https://www.reddit.com/r/medicalschool/comments/11981bl/palsacls_certification/",
        "text": "Do we need to obtain PALS/ACLS certification before starting residency? Or are those covered during the orientation?",
        "created_utc": 1677092477,
        "upvote_ratio": 1.0
    },
    {
        "title": "I am a med student with IQ lower than 99 ( I think 96-99)",
        "author": "chantalspencer",
        "url": "https://www.reddit.com/r/medicalschool/comments/1197xgx/i_am_a_med_student_with_iq_lower_than_99_i_think/",
        "text": "My exams are all done, sometimes my grades are higher than grades of my classmates with IQ over 115. Should I leave the school,because of my IQ ? I feel like I am less important and have no value between them",
        "created_utc": 1677092242,
        "upvote_ratio": 1.0
    },
    {
        "title": "Books to study for neurosurgery",
        "author": "Weirdli0n",
        "url": "https://www.reddit.com/r/medicalschool/comments/1197r1f/books_to_study_for_neurosurgery/",
        "text": "[removed]",
        "created_utc": 1677091829,
        "upvote_ratio": 1.0
    },
    {
        "title": "Any advice for studying Nuero?",
        "author": "JustSaiyan15",
        "url": "https://www.reddit.com/r/medicalschool/comments/1197m85/any_advice_for_studying_nuero/",
        "text": "I have to remediate my nuero block exam next week and it is one of the hardest topics for me to conceptualize and figure out. Was wondering if anyone had had similar difficulties and what they had done for it. Additionally, if anyone had advice or recommendations on how to approach it or resources that are strongly recommended. Thank you ahead of time for all your help!",
        "created_utc": 1677091518,
        "upvote_ratio": 1.0
    },
    {
        "title": "St Mary's Waterbury Connecticut internal medicine program?",
        "author": "TransportationTrue23",
        "url": "https://www.reddit.com/r/medicalschool/comments/1197ki7/st_marys_waterbury_connecticut_internal_medicine/",
        "text": "Hi guys! if anyone has any experience at st mary's in Waterbury, CT, can you please let me know how the program is? I liked it during the interview but i didn't get much of a feel about the culture, worklife-balance, and support\n\nany advice is appreciated!",
        "created_utc": 1677091404,
        "upvote_ratio": 1.0
    },
    {
        "title": "Questioning whether I should bow out before MS1",
        "author": "HodgesLab23",
        "url": "https://www.reddit.com/r/medicalschool/comments/11970io/questioning_whether_i_should_bow_out_before_ms1/",
        "text": "[removed]",
        "created_utc": 1677090132,
        "upvote_ratio": 1.0
    },
    {
        "title": "What knowledge should one have before starting his bachelor's on Pharmacy?",
        "author": "Several_Variety_9222",
        "url": "https://www.reddit.com/r/medicalschool/comments/1196yv0/what_knowledge_should_one_have_before_starting/",
        "text": "Hey guys,\n\n Next years I'm going to start to university. I'm from Europe and I'm considering to do a bachelor's on Pharmacy. But before I go there, I'd like to have a basic knowledge which school subjects I should know before starting.\n\n Is high school chemistry, physics, biology and maths enough?",
        "created_utc": 1677090031,
        "upvote_ratio": 1.0
    },
    {
        "title": "question",
        "author": "Maeassaf",
        "url": "https://www.reddit.com/r/medicalschool/comments/1196iew/question/",
        "text": "Ignoring liking one residency more than another, which residency would be better for someone who wants to have (or has) a big family and wants to be involved with their children",
        "created_utc": 1677088978,
        "upvote_ratio": 1.0
    },
    {
        "title": "Same Abstract in manuscript and for conference",
        "author": "JayHouse989",
        "url": "https://www.reddit.com/r/medicalschool/comments/1196i68/same_abstract_in_manuscript_and_for_conference/",
        "text": "I am submitting an abstract to present a poster at a conference. I already submitted the paper for publication. Can I just send to the conference the same abstract that I used in the manuscript?",
        "created_utc": 1677088963,
        "upvote_ratio": 1.0
    },
    {
        "title": "Audition Rotations",
        "author": "Ndtp-gen",
        "url": "https://www.reddit.com/r/medicalschool/comments/11969u8/audition_rotations/",
        "text": "How important is audition rotation at DO-traditionally schools (OSUCHS, PCOM, etc.) to get an interview and being ranked? Like is that still a thing? \nPCOM programs clearly state on their websites to strongly encourage students to do audition rotations there for interview invites. But for ex, in their IM program, most of their residents are from PCOM anyways… so I don’t know if it’s worth to do a rotation there…",
        "created_utc": 1677088446,
        "upvote_ratio": 1.0
    },
    {
        "title": "need reassurance",
        "author": "salsh344",
        "url": "https://www.reddit.com/r/medicalschool/comments/11965ps/need_reassurance/",
        "text": "\nlost motivation to study !\nI'm a med student in graduate year have my last finals in 3 months and i can't focus on anything, last year been a bit of a mess and I have piled up the 4 majors until now so i have to study 24/7 for the next 3 months..is it managable or the duration is too short to do it ...i dont wish A pluses just want to make it to graduate",
        "created_utc": 1677088175,
        "upvote_ratio": 1.0
    },
    {
        "title": "mandatory Sub-I scheduled by school for me is during prime interview season...",
        "author": "vucar",
        "url": "https://www.reddit.com/r/medicalschool/comments/1195ek4/mandatory_subi_scheduled_by_school_for_me_is/",
        "text": "so i go to a school where they put in our 4th year schedule a Sub-I that is part of the school (i.e. *not* an away) regardless of how much you want to apply to the program. we do not get to choose the date and our only hope of movement is switching our sub-i dates with other students, but obviously no one wants to trade for a sub-i during November-December, which is when mine was scheduled...\n\ni have no choice but to do this sub-i when its scheduled, and its required for graduation - so tanking it and dipping for interviews whenever i want is not going to fly well, probably. they have specifically and explicitly told us to not schedule interviews during our Sub-I's as well, which is extremely frustrating\n\ni feel like our school is shooting us in the foot and i don't know what to do. if i get interviews in November and December i'm taking them, 100%, but it will be obvious what i'm doing so if the residents/attendings want to, they can torch me on evaluations.  i feel set up to fail\n\npls help",
        "created_utc": 1677086385,
        "upvote_ratio": 1.0
    },
    {
        "title": "need reassurance",
        "author": "salsh344",
        "url": "https://www.reddit.com/r/medicalschool/comments/11959jd/need_reassurance/",
        "text": "[removed]",
        "created_utc": 1677086058,
        "upvote_ratio": 1.0
    },
    {
        "title": "Asking for LoR from doctor I have not met in person",
        "author": "mcatstudys",
        "url": "https://www.reddit.com/r/medicalschool/comments/11958qu/asking_for_lor_from_doctor_i_have_not_met_in/",
        "text": "I did some case reports with a doctor in my specialty of interest. I dont have any LoRs as of now (im a 3rd yr). The elective rotation that i did in specialty of interest, i spent pretty much no time with attendings. Is it okay to get LoR from them if we just did the case reports by communicating over email but never met in real life?",
        "created_utc": 1677086008,
        "upvote_ratio": 1.0
    },
    {
        "title": "need advice !",
        "author": "salsh344",
        "url": "https://www.reddit.com/r/medicalschool/comments/11950bf/need_advice/",
        "text": "[removed]",
        "created_utc": 1677085459,
        "upvote_ratio": 1.0
    },
    {
        "title": "ACCOUNTING #3 Chapter 6 Test Bank - ACCOUNTING",
        "author": "SuperGrades",
        "url": "https://www.stuvia.com/doc/2399302/accounting-3-chapter-6-test-bank",
        "text": "",
        "created_utc": 1677084937,
        "upvote_ratio": 1.0
    },
    {
        "title": "Accounting 2- Test Bank Questions And Answers 2023 Update A+ - Accounting 2",
        "author": "SuperGrades",
        "url": "https://www.stuvia.com/doc/2399308/accounting-2-test-bank-questions-and-answers-2023-update-a",
        "text": "",
        "created_utc": 1677084924,
        "upvote_ratio": 1.0
    },
    {
        "title": "NBME 20 answer",
        "author": "phunterdot",
        "url": "https://www.reddit.com/r/medicalschool/comments/1194s0h/nbme_20_answer/",
        "text": "Are the answers/explanations in the NBME 20 pdfs completely reliable?  \nThank you",
        "created_utc": 1677084916,
        "upvote_ratio": 1.0
    },
    {
        "title": "Accounting Chapter 4 test bank - Accounting Chapter 4",
        "author": "SuperGrades",
        "url": "https://www.stuvia.com/doc/2399313/accounting-chapter-4-test-bank",
        "text": "",
        "created_utc": 1677084910,
        "upvote_ratio": 1.0
    },
    {
        "title": "Accounting Chapter 10 test bank Q&amp;amp;A 2023 Update Review A+ - Accounting Chapter 10",
        "author": "SuperGrades",
        "url": "https://www.stuvia.com/doc/2399343/accounting-chapter-10-test-bank-q-en-a-2023-update-review-a",
        "text": "",
        "created_utc": 1677084892,
        "upvote_ratio": 1.0
    },
    {
        "title": "Accounting Chapter 12 test bank Q&amp;amp;A A+ Review Update - Accounting Chapter 12",
        "author": "SuperGrades",
        "url": "https://www.stuvia.com/doc/2399350/accounting-chapter-12-test-bank-q-en-a-a-review-update",
        "text": "",
        "created_utc": 1677084878,
        "upvote_ratio": 1.0
    },
    {
        "title": "Accounting Chapter 15 Test Bank Q&amp;amp;A 2023 Update - Accounting Chapter 15",
        "author": "SuperGrades",
        "url": "https://www.stuvia.com/doc/2399360/accounting-chapter-15-test-bank-q-en-a-2023-update",
        "text": "",
        "created_utc": 1677084866,
        "upvote_ratio": 1.0
    },
    {
        "title": "ACCOUNTING Test #3 Test Bank Chapter 7 Q&amp;amp;A 2023 Update - ACCOUNTING #3",
        "author": "SuperGrades",
        "url": "https://www.stuvia.com/doc/2399372/accounting-test-3-test-bank-chapter-7-q-en-a-2023-update",
        "text": "",
        "created_utc": 1677084837,
        "upvote_ratio": 1.0
    },
    {
        "title": "Accounting Test Bank Chapter 7 Q&amp;amp;A 2023 Update Review A+ - Accounting Chapter 7",
        "author": "SuperGrades",
        "url": "https://www.stuvia.com/doc/2399396/accounting-test-bank-chapter-7-q-en-a-2023-update-review-a",
        "text": "",
        "created_utc": 1677084825,
        "upvote_ratio": 1.0
    },
    {
        "title": "Accounting200 Test Bank Ch. 2 Questions And Answers 2023 Update A+ - Accounting200",
        "author": "SuperGrades",
        "url": "https://www.stuvia.com/doc/2399402/accounting200-test-bank-ch.-2-questions-and-answers-2023-update-a",
        "text": "",
        "created_utc": 1677084796,
        "upvote_ratio": 1.0
    },
    {
        "title": "Accounting200 Test Bank Ch. 3 Questions With Correct Answers 2023 Update A+ - Accounting200",
        "author": "SuperGrades",
        "url": "https://www.stuvia.com/doc/2399411/accounting200-test-bank-ch.-3-questions-with-correct-answers-2023-update-a",
        "text": "",
        "created_utc": 1677084767,
        "upvote_ratio": 1.0
    },
    {
        "title": "Advanced Accounting test 1 Q&amp;amp;A 2023 Update A+ - Advanced Accounting 1",
        "author": "SuperGrades",
        "url": "https://www.stuvia.com/doc/2399427/advanced-accounting-test-1-q-en-a-2023-update-a",
        "text": "",
        "created_utc": 1677084728,
        "upvote_ratio": 1.0
    },
    {
        "title": "Desperate for research experience but not getting any",
        "author": "stonemanli",
        "url": "https://www.reddit.com/r/medicalschool/comments/1194oza/desperate_for_research_experience_but_not_getting/",
        "text": "[removed]",
        "created_utc": 1677084712,
        "upvote_ratio": 1.0
    },
    {
        "title": "Advanced Accounting test/ Advanced Accounting test Questions And Answers 2023 - Advanced Accounting 2023 Update",
        "author": "SuperGrades",
        "url": "https://www.stuvia.com/doc/2399434/advanced-accounting-test-advanced-accounting-test-questions-and-answers-2023",
        "text": "",
        "created_utc": 1677084688,
        "upvote_ratio": 1.0
    },
    {
        "title": "ATI Comprehensive Practice B, ATI Comprehensive Final Quiz, RN Comprehensive Predictor 2019 A, RN Comprehensive Predictor 2019 Form B &amp; C- 2023 Update A+ Review - ATI Comprehensive Practice B, ATI Comprehensive F",
        "author": "SuperGrades",
        "url": "https://www.stuvia.com/doc/2399442/ati-comprehensive-practice-b-ati-comprehensive-final-quiz-rn-comprehensive-predictor-2019-a-rn-comprehensive-predictor-2019-form-b-en-c-2023-update-a-review",
        "text": "",
        "created_utc": 1677084549,
        "upvote_ratio": 1.0
    },
    {
        "title": "Chapter 1 - An Overview Test Bank\u0002Accounting Information Systems 14 Edition Test Bank Q&amp;amp;A 2023 A+ - Chapter 1 - An Overview \u0002Accounting Infor",
        "author": "SuperGrades",
        "url": "https://www.stuvia.com/doc/2399455/chapter-1-an-overview-test-bankaccounting-information-systems-14-edition-test-bank-q-en-a-2023-a",
        "text": "",
        "created_utc": 1677084536,
        "upvote_ratio": 1.0
    },
    {
        "title": "Chapter 11 Accounting test bank Questions And Answers A+ Review Update 2023 - Chapter 11 est bank",
        "author": "SuperGrades",
        "url": "https://www.stuvia.com/doc/2399469/chapter-11-accounting-test-bank-questions-and-answers-a-review-update-2023",
        "text": "",
        "created_utc": 1677084519,
        "upvote_ratio": 1.0
    },
    {
        "title": "Chapters 1-4 Test Advanced Accounting 2023 Update Q&amp;amp;A/Chapters 1-4 Test Advanced Accounting - Chapters 1-4 est Advanced Accounting 2023 Update",
        "author": "SuperGrades",
        "url": "https://www.stuvia.com/doc/2399474/chapters-1-4-test-advanced-accounting-2023-update-q-en-achapters-1-4-test-advanced-accounting",
        "text": "",
        "created_utc": 1677084508,
        "upvote_ratio": 1.0
    },
    {
        "title": "Intermediate Accounting- Ch1 Test Bank /Intermediate Accounting- Ch1 Test Bank Questions With Correct Answers 2023 Update - Intermediate Accounting- Ch1",
        "author": "SuperGrades",
        "url": "https://www.stuvia.com/doc/2399505/intermediate-accounting-ch1-test-bank-intermediate-accounting-ch1-test-bank-questions-with-correct-answers-2023-update",
        "text": "",
        "created_utc": 1677084480,
        "upvote_ratio": 1.0
    },
    {
        "title": "Investment Banking Advanced Accounting Questions 2023 Update A+/Investment Banking Advanced Accounting Questions - Investment Banking Advanced Accounting",
        "author": "SuperGrades",
        "url": "https://www.stuvia.com/doc/2399527/investment-banking-advanced-accounting-questions-2023-update-ainvestment-banking-advanced-accounting-questions",
        "text": "",
        "created_utc": 1677084468,
        "upvote_ratio": 1.0
    },
    {
        "title": "Test Bank Accounting Chapter 8/Test Bank Accounting Chapter 8 Q&amp;amp;A 2023 Update - Accounting Chapter 8",
        "author": "SuperGrades",
        "url": "https://www.stuvia.com/doc/2399541/test-bank-accounting-chapter-8test-bank-accounting-chapter-8-q-en-a-2023-update",
        "text": "",
        "created_utc": 1677084452,
        "upvote_ratio": 1.0
    },
    {
        "title": "Week 2- Advanced Respiratory Test Bank Jarvis Chapter 19 - Wk 2- Advanced Respiratory",
        "author": "SuperGrades",
        "url": "https://www.stuvia.com/doc/2399561/week-2-advanced-respiratory-test-bank-jarvis-chapter-19",
        "text": "",
        "created_utc": 1677084386,
        "upvote_ratio": 1.0
    },
    {
        "title": "Unethical or okay?",
        "author": "JayHouse989",
        "url": "https://www.reddit.com/r/medicalschool/comments/1194jzh/unethical_or_okay/",
        "text": "I am doing an oral presentation at a conference and I was wondering is it okay to use images from google on my presentation? Or if it’s copyrighted I can’t?\n\nIt’s would be images showing pathogenesis of disease or mechanism of action of drug",
        "created_utc": 1677084378,
        "upvote_ratio": 1.0
    },
    {
        "title": "Week 2- Advanced Respiratory Test Bank Jarvis Chapter 19,ACCOUNTING #3 Chapter 6 Test Bank,Accounting 2- Test Bank Questions And Answers 2023 Update A+,Accounting Chapter 4 test bank,Accounting Chapter 10 test bank Q&amp;amp;A 2023 Update Review A+,Accounting Cha",
        "author": "SuperGrades",
        "url": "https://www.stuvia.com/bundle/147514/week-2-advanced-respiratory-test-bank-jarvis-chapter-19accounting-3-chapter-6-test-bankaccounting-2-test-bank-questions-and-answers-2023-update-aaccounting-chapter-4-test-bankaccounting-chapter-10-test-bank-q-en-a-2023-update-review-aaccounting-cha",
        "text": "",
        "created_utc": 1677084339,
        "upvote_ratio": 1.0
    },
    {
        "title": "Should I disclose my gender status when applying to medical school",
        "author": "oh_noo_",
        "url": "https://www.reddit.com/r/medicalschool/comments/1194ao5/should_i_disclose_my_gender_status_when_applying/",
        "text": "Hello! I’m non-binary, most likely will have gotten top surgery sometime in the next year and am fairly androgynous in appearance. Should I say I’m non-binary in my demographics or just stick with  my assigned gender at birth? I’m not terribly prickly about pronouns or anything- but I would very much like to get into med school lol",
        "created_utc": 1677083765,
        "upvote_ratio": 1.0
    },
    {
        "title": "Yall! I've found the cure for Anti-Vaxx!!!",
        "author": "jasmineflower88",
        "url": "https://www.reddit.com/r/medicalschool/comments/11949v9/yall_ive_found_the_cure_for_antivaxx/",
        "text": "The next time you encounter a vaccine hesitant patient, please share this good news with them. Looks like science has finally found the solution.",
        "created_utc": 1677083714,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can it be March 17th already?",
        "author": "TrainingCoffee8",
        "url": "https://www.reddit.com/r/medicalschool/comments/1193opr/can_it_be_march_17th_already/",
        "text": "That’s all",
        "created_utc": 1677082315,
        "upvote_ratio": 1.0
    },
    {
        "title": "free Internal Medicine course better than OnlineMedEd",
        "author": "leche1dura",
        "url": "https://www.reddit.com/r/medicalschool/comments/1193nmp/free_internal_medicine_course_better_than/",
        "text": " \n\nHi all,\n\nI am an attending and I still remember how scary, difficult and important IM was for me.\n\nI wish there was someone or a course that taught you how attendings thought about each problem in more details. Now that I have years teaching and being a hospitalist, I created that course and I want to give it to you all for free (4hrs-5hrs).\n\nIt has everything from patient presentations, antibiotics, vent management, and more. It's great for anyone in 3rd-4th year and early interns.\n\nALL FREE. I just wanted to share since I already finished making the course.\n\nIf interested, simply fill out this form (I can't spam message everyone or I will get banned from reddit):\n\n[Link to fill out form here](https://form.jotform.com/230515722290146)\n\nWill send the videos to those who fill out the form only.",
        "created_utc": 1677082243,
        "upvote_ratio": 1.0
    },
    {
        "title": "What did you do the summer before matriculating into medical school?",
        "author": "justtryingtomed",
        "url": "https://www.reddit.com/r/medicalschool/comments/1193fsy/what_did_you_do_the_summer_before_matriculating/",
        "text": "[removed]",
        "created_utc": 1677081775,
        "upvote_ratio": 1.0
    },
    {
        "title": "Help me choose: ENT vs Anesthesia",
        "author": "Time-Nebula-",
        "url": "https://www.reddit.com/r/medicalschool/comments/11937ev/help_me_choose_ent_vs_anesthesia/",
        "text": "[removed]\n\n[View Poll](https://www.reddit.com/poll/11937ev)",
        "created_utc": 1677081290,
        "upvote_ratio": 1.0
    },
    {
        "title": "What's your Diagnosis?",
        "author": "Malunga_Paul",
        "url": "https://i.redd.it/n6tyazhrvsja1.jpg",
        "text": "",
        "created_utc": 1677079965,
        "upvote_ratio": 1.0
    },
    {
        "title": "Thank you to my attendings and residents for keeping me sane this year 🤙🏻",
        "author": "Chemical-Jacket5",
        "url": "https://i.redd.it/yshes33wusja1.gif",
        "text": "",
        "created_utc": 1677079667,
        "upvote_ratio": 1.0
    },
    {
        "title": "What should I do to increase my chances of going to medical school?",
        "author": "DrinkDrops",
        "url": "https://www.reddit.com/r/medicalschool/comments/1191qr1/what_should_i_do_to_increase_my_chances_of_going/",
        "text": "I'm in my 2nd year of college, I hope to graduate in 2 years but I may need to stay longer to retake classes since I was told medical school only takes B's. Besides grades, what should I do to increase my chances of making it to a school? Do internships matter to the schools? Things like that.\n\nAlso need some advice, I'm not doing good in chemistry. I like the subject but I just suck at the math which is costing me my grade. As for the concepts I have a decent grasp but I'd say that I'm average. It's general chemistry 2 and things are going pretty bad so the idea of just quitting my dream is weighing heavily on my mind. In y'all's opinions, should I just give up and accept that it's not for me or do I have chance?\n\nSorry in advance for the shit attitude, this has been a dream of mine since I was a kid but honestly it feels like it's becoming an impossible goal with how stupid I feel sometimes. From what I've learned in health classes, I like medicine, or at least from what I was learning. I even learned the blood flow of the heart and some of the parts of it like the atriums, ventricles, valves, stuff like that. Honestly, learning that 4 years ago it's still fresh on my mind and it was things like that that made me love the subject and gave me confidence in doing good in medical school. However, now I'm thinking otherwise because of how horrible this semester is going. \n\nThanks in advance.",
        "created_utc": 1677077716,
        "upvote_ratio": 1.0
    },
    {
        "title": "JEE MAIN 2022",
        "author": "Normal_Sherbert905",
        "url": "https://youtu.be/DzZ4QPKfkbA",
        "text": "",
        "created_utc": 1677077163,
        "upvote_ratio": 1.0
    },
    {
        "title": "Are there any schools with no/few problems?",
        "author": "The-Cysteine-Chapel",
        "url": "https://www.reddit.com/r/medicalschool/comments/1190va4/are_there_any_schools_with_nofew_problems/",
        "text": "We always hear about shitty admin or professors or mandatory BS, but we never hear about schools with minimal problems that actually care for the students.",
        "created_utc": 1677076199,
        "upvote_ratio": 1.0
    }
]