[
    {
        "title": "International Medical Graduate to U.S. Podiatrist/D.P.M. Does anyone know of anybody who has done this?",
        "author": "wd06",
        "url": "https://www.reddit.com/r/medicalschool/comments/10w80y8/international_medical_graduate_to_us/",
        "text": "Also posted on r/usmle, r/podiatry, and r/IMGreddit.\n\nHas anyone done this or know of anyone who has?  I was looking at Podiatry schools in the USA, and a few of them grant advanced standing to those who pass the USMLE.  The scope seems good for someone interested in surgery (and it is better than leaving the medical field altogether), but I was hoping to learn from those who have done this first hand.",
        "created_utc": 1675791887,
        "upvote_ratio": 1.0
    },
    {
        "title": "Here's credentials for Sketchy Premium account (valid 12 months till 28th Jan 2024)",
        "author": "Economy_Carry5672",
        "url": "https://www.reddit.com/r/medicalschool/comments/10w7qb4/heres_credentials_for_sketchy_premium_account/",
        "text": "So if someone needs it, I got my Sketchy Medical with a large discount my local Uni offers, I paid for it and I don't actually use it. So if someone needs it:\n\ngmail used for login: [erikantic7@gmail.com](mailto:erikantic7@gmail.com)\n\npassword is: SketchyPass12\\_\n\nSign in method is Google sign in - use Google native popup for login.\n\nAlso, there is 2-Factor-Authentication enabled, so I'll need to be by my phone to let you in. If you want me to disable it and fully transfer the Sketchy account so you can use it on any device, I would like you to refund me what I paid, which is $275 fo 12 months.\n\nLet me know in DM if you want use Sketchy.",
        "created_utc": 1675791198,
        "upvote_ratio": 1.0
    },
    {
        "title": "Here are the credentials for Sketchy Premium account (valid 12 months till 28th Jan 2024)",
        "author": "Economy_Carry5672",
        "url": "https://www.reddit.com/r/medicalschool/comments/10w79lj/here_are_the_credentials_for_sketchy_premium/",
        "text": "So if someone needs it, I got my Sketchy Medical with a large discount my local Uni offers, I paid for it and I don't actually use it. So if someone needs it:\n\ngmail used for login: [erikantic7@gmail.com](mailto:erikantic7@gmail.com)\n\npassword is: SketchyPass12\\_\n\nSign in method is Google sign in - use Google native popup for login.\n\nAlso, there is 2-Factor-Authentication enabled, so I'll need to be by my phone to let you in. If you want me to disable it and fully transfer the Sketchy account so you can use it on any device, I would like you to refund me what I paid, which is $275 fo 12 months.\n\nLet me know in DM if you want use Sketchy.",
        "created_utc": 1675790144,
        "upvote_ratio": 1.0
    },
    {
        "title": "VSLO LORs",
        "author": "7r0gdor",
        "url": "https://www.reddit.com/r/medicalschool/comments/10w76lq/vslo_lors/",
        "text": "My letter writer hasn't written a letter for aways before. Is there specific things I should tell them to write or is it basically the same as for ERAS just less detailed? Thanks!",
        "created_utc": 1675789948,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do you study during third year? Both for clerkships and Step?",
        "author": "evedh613",
        "url": "https://www.reddit.com/r/medicalschool/comments/10w6tui/how_do_you_study_during_third_year_both_for/",
        "text": "Starting rotations in 3 weeks and my first is surgery, so I'm gonna be busy. I wanted to get a head start.\n\nWhat's the move? Uworld and Anking enough? Little by little throughout the block?\n\nAny tips would be appreciated. Both for studying and any other third year advice",
        "created_utc": 1675789135,
        "upvote_ratio": 1.0
    },
    {
        "title": "Med School Spreadsheet ??",
        "author": "ODknowledge",
        "url": "https://www.reddit.com/r/medicalschool/comments/10w6iv3/med_school_spreadsheet/",
        "text": "[removed]",
        "created_utc": 1675788394,
        "upvote_ratio": 1.0
    },
    {
        "title": "Private clinic specializing in type 1 diabetes but not endocrinology fellowship trained?",
        "author": "gongoozler5",
        "url": "https://www.reddit.com/r/medicalschool/comments/10w6by7/private_clinic_specializing_in_type_1_diabetes/",
        "text": "Is there anything preventing a board-certified internal medicine doctor (who is not fellowship trained in endocrinology) from opening a private practice that only sees patients with type 1 diabetes?",
        "created_utc": 1675787939,
        "upvote_ratio": 1.0
    },
    {
        "title": "Question about IMG Clinical Clerkships (Elective programs)",
        "author": "MOKOUURR",
        "url": "https://www.reddit.com/r/medicalschool/comments/10w5xn4/question_about_img_clinical_clerkships_elective/",
        "text": "Hello everyone,\n\nI'm a 5th-year medical student in Jordan. We are required to do a 2-month training in any field of medicine we decide on, and since I am planning to continue my education in the US, I'm trying to apply for American Hospitals.\n\nI'd like to apologize in advance if this is a repeated question on this subreddit.\n\nI'm very passionate about Medicine and I'm doing good in terms of grades. I got two consecutive scholarships in the past couple of years. \n\nThe two issues I'm facing while trying to apply for an Elective are as follows, I still haven't done my STEP1 (Planning to do it in my last year), and my financial status doesn't allow me to pay the very high tuition/application fees that a lot of institutes are asking for.\n\nCould you guys please give me some advice on how to move on with this situation keeping in mind the two circumstances I mentioned?\n\nAnd if you happen to work in a hospital or know someone who works there, and is willing to help me train under their supervision, I'd highly appreciate it.\n\nI would like to train in Cardiology for a total of 8 weeks in the timespan between July 2023 and March 2024.\n\nThank you so much for your time!",
        "created_utc": 1675786971,
        "upvote_ratio": 1.0
    },
    {
        "title": "Weekly dumb questions thread?",
        "author": "derpgod123",
        "url": "https://www.reddit.com/r/medicalschool/comments/10w5i8p/weekly_dumb_questions_thread/",
        "text": "[removed]",
        "created_utc": 1675785934,
        "upvote_ratio": 1.0
    },
    {
        "title": "Once 3rd year starts, I’m buying a PS5",
        "author": "BigMacrophages",
        "url": "https://i.redd.it/v8o4e8jkxtga1.jpg",
        "text": "",
        "created_utc": 1675785130,
        "upvote_ratio": 1.0
    },
    {
        "title": "UWORLD QBANK",
        "author": "Fatimainchaos",
        "url": "https://www.reddit.com/r/medicalschool/comments/10w4uu2/uworld_qbank/",
        "text": "Does anyone have the breakdown of number of blocks per system in UWORLD step1 ?",
        "created_utc": 1675784351,
        "upvote_ratio": 1.0
    },
    {
        "title": "Rad Onc vs Radiology",
        "author": "Tagrenine",
        "url": "https://www.reddit.com/r/medicalschool/comments/10w4upi/rad_onc_vs_radiology/",
        "text": "MS1\n\nI have research opportunities for both choices, but there are more for rad/onc at my school. The physicians are very eager to engage with me in rad/onc and talked to me about how they match applicants in top programs. Also told me they have plenty of opportunities for me to get 1st author pubs (lol). \n\nRadiology is much more chill and I feel like they’re a lot less eager to engage but the life style may be better.\n\nI also keep seeing things about rad/onc not having good job prospects. Would it be a waste of my time to do rad/onc research if i decide not to try to match it? I don’t want to overwhelm myself by being involved in too many projects",
        "created_utc": 1675784341,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is it bad to be involved in multiple research projects",
        "author": "Red2016",
        "url": "https://www.reddit.com/r/medicalschool/comments/10w4rld/is_it_bad_to_be_involved_in_multiple_research/",
        "text": "For clinical research only: I'm interested in one particular field and will be applying into the specialty. If I have been working on two projects (two separate PI physicians), and add a third - but all are studying very different diseases within the same overall specialty-  would that be a bad idea in any way? \n\nThe first one I have been working with for the past year or so- no first author material but at least a couple of co-authorships on publications. I am not too concerned about publishing but the third PI is a big name person who would be great to work with in terms of mentorship. \n\nAppreciate thoughts all. Thank you",
        "created_utc": 1675784115,
        "upvote_ratio": 1.0
    },
    {
        "title": "3rd party Anatomy resource that doesn't bore you out",
        "author": "NegativeGreyMatter",
        "url": "https://www.reddit.com/r/medicalschool/comments/10w4fly/3rd_party_anatomy_resource_that_doesnt_bore_you/",
        "text": "Hey everyone!! I'm in the middle of studying anatomy and it's a doozy. I've been using a few textbooks and videos I see on YT but they're just not cutting it. I need something that's more interactive and keeps me engaged. Any suggestions? I'm open to all kinds of resources, apps, websites, anything that's helped you guys out in the past.\"",
        "created_utc": 1675783291,
        "upvote_ratio": 1.0
    },
    {
        "title": "is anyone familiar with This?",
        "author": "Desssyslava",
        "url": "https://www.reddit.com/gallery/10w4aph",
        "text": "",
        "created_utc": 1675782961,
        "upvote_ratio": 1.0
    },
    {
        "title": "Where can i find Online Psychiatry/Psychology Courses/Conferences?",
        "author": "super0nova",
        "url": "https://www.reddit.com/r/medicalschool/comments/10w3x5a/where_can_i_find_online_psychiatrypsychology/",
        "text": "Hello,\nI'm currently a postgraduate who's interested in pursuing a career in Psychiatry. I want to stay up-to-date with the current Psychiatry world, and i thought online courses/Conferences are a good way of doing that, as i'm unlikely to be able to travel outside my country right now.\n\nIf you would kindly point to me some websites/links i could follow to stay up-to-date with the latest announcements, i would highly appreciate it. Thank you very much.",
        "created_utc": 1675782022,
        "upvote_ratio": 1.0
    },
    {
        "title": "need help regarding AMC 1.",
        "author": "Adventurous_Call_805",
        "url": "https://www.reddit.com/r/medicalschool/comments/10w3fns/need_help_regarding_amc_1/",
        "text": "[removed]",
        "created_utc": 1675780781,
        "upvote_ratio": 1.0
    },
    {
        "title": "A Free Quick Reference app to Review Landmark Clinical Trials in Medicine",
        "author": "usamanasir",
        "url": "https://www.reddit.com/r/medicalschool/comments/10vzwj1/a_free_quick_reference_app_to_review_landmark/",
        "text": "[removed]",
        "created_utc": 1675770513,
        "upvote_ratio": 1.0
    },
    {
        "title": "mEq/L calculation in Normal Saline",
        "author": "KKM428",
        "url": "https://www.reddit.com/r/medicalschool/comments/10vzm1b/meql_calculation_in_normal_saline/",
        "text": "[removed]",
        "created_utc": 1675769453,
        "upvote_ratio": 1.0
    },
    {
        "title": "Benefits of Study MBBS in China in 2023",
        "author": "studymbbschina",
        "url": "https://abracada.net/study-mbbs-in-china/",
        "text": "",
        "created_utc": 1675769174,
        "upvote_ratio": 1.0
    },
    {
        "title": "What You Should Know About Single Use Instruments",
        "author": "jimymedical1",
        "url": "https://forbesonly.com/single-use-instruments/",
        "text": "",
        "created_utc": 1675768212,
        "upvote_ratio": 1.0
    },
    {
        "title": "The Difference Between Hemostatic Forceps and Hemostat Forceps",
        "author": "jimymedical1",
        "url": "https://www.postpedia.co.uk/2023/02/07/hemostatic-forceps/",
        "text": "",
        "created_utc": 1675767846,
        "upvote_ratio": 1.0
    },
    {
        "title": "What You Should Know About Disposable Vaginal Speculum",
        "author": "jimymedical1",
        "url": "https://fanoti.co.uk/disposable-vaginal-speculum/",
        "text": "",
        "created_utc": 1675767254,
        "upvote_ratio": 1.0
    },
    {
        "title": "Which Harry Potter house would every specialty sort into?",
        "author": "BeefLatte",
        "url": "https://www.reddit.com/r/medicalschool/comments/10vyo2v/which_harry_potter_house_would_every_specialty/",
        "text": "I thought this could make for a fun discussion with the new game coming out.",
        "created_utc": 1675765946,
        "upvote_ratio": 1.0
    },
    {
        "title": "PRODUCTIVTY AT ITS BEST",
        "author": "medically_aesthetic",
        "url": "https://www.reddit.com/r/medicalschool/comments/10vxe51/productivty_at_its_best/",
        "text": "[removed]",
        "created_utc": 1675760878,
        "upvote_ratio": 1.0
    },
    {
        "title": "sharing the vibes",
        "author": "Aggravating_Froyo990",
        "url": "https://v.redd.it/mws4hznx4qga1",
        "text": "",
        "created_utc": 1675757179,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is there any point in medical students attending national conferences?",
        "author": "Most-Star-7094",
        "url": "https://www.reddit.com/r/medicalschool/comments/10vujgb/is_there_any_point_in_medical_students_attending/",
        "text": "An attending at my school invites medical students to attend conferences with her. It is in a specialty that I am interested in, but I don't really understand the point of why I should go. I don't feel like I get that much out of them, despite actively paying attention and trying to.\n\nThese conferences are a good way to escape mandatory events at my school and the hotel/food is nice (and reimbursed), but does this somehow make me more competitive for residency/fellowship?\n\nI submit abstracts/posters to some of these, but is it worth attending a conference that I don't submit to?",
        "created_utc": 1675750220,
        "upvote_ratio": 1.0
    },
    {
        "title": "Dating a patient?",
        "author": "TheOnewhoFixes",
        "url": "https://www.reddit.com/r/medicalschool/comments/10vue0x/dating_a_patient/",
        "text": "The title says it. Now for some context:\n\nI'm a 4th year resident. Last year, I had a patient under my care, that spent two months in the hospital because of the need of IV meds. Was a nice patient and we got along well. After 6 weeks of taking care of them, I took a week off, and a resident took my place with the patient.\n\nAfter I came back, I took the patient under my wing again, and finally got to discharge her. She spoke very nice about my partner.\n\nLast week, the resident (two years my junior) came to me and told me he started dating her after discharge. I went to an office with him, and asked when it started, and how it happened.\n\nHe told me that the week that he took care of her, he had nice chats with her, always casual stuff. She showed him some of her art, spoke to him about sports, but he was professional: he kept to small talk, but on the inside started to enjoy the time. So, in the last day before I came back, she asked for his Instagram, and he gave it to her.\n\nThe he showed me that he started to talk to her three days after that.\n\nShe was no longer his patient, as she was mine to be more accurate and he only covered for me for five days. She has her routine checks with me. So, it's true that him and her are no longer doctor/patient.\n\nFor me, after that, it was nothing as long as he didn't do anything while being her doctor or while she was admitted. But today, my partner told me that it was unethical, that people may think he used his position of doctor to get a date, etc\n\nI had a lot of talks with him about life and stuff, and he is someone shy and respectful to people, it doesn't seem like a guy who tries to get an advantage over others.\n\nWhat do you think?",
        "created_utc": 1675749719,
        "upvote_ratio": 1.0
    },
    {
        "title": "Abusive Patients in Psych?",
        "author": "greygales",
        "url": "https://www.reddit.com/r/medicalschool/comments/10vtv27/abusive_patients_in_psych/",
        "text": "I'm genuinely interested in pursuing psychiatry but I'm having difficulty with this one patient during my inpatient psychiatry core clerkship. I have been enjoying every aspect of psychiatry so far and was otherwise happy to pursue the field but I am worried that this patient I have been assigned for over 2 weeks now is making me dread going into the hospital everyday. I want to stick with psychiatry because it's what I envisioned myself doing for so long and so many people I know say I'm a good fit for it, but I worry I can't handle this case.\n\nThis patient is in denial of her diagnosis, refuses to take almost every medication we offer aside from a select few which are not causing significant improvements, and has been hostile and verbally abusive to staff. She's being treated but refuses to acknowledge her violent actions, and just constantly yells whenever we try to discuss her symptoms or treatment plans. I have consistently tried to be kind to her, find common topics to talk about, or try to reframe concerns without calling her out or mentioning a specific diagnosis and using a symptom focused approach. She either refuses to talk to me (which is a relief when it happens) or yells and throws slurs at me. She's also stated she dislikes women, which further complicates things.\n\nI am trying my best to remind myself that part of a psychiatrist's job is seeing people at their worst and getting them through that phase. I am never mad at the patient because in her eyes, I can empathize that she feels like she's being jailed and not listened to (which can't be helped because she's actively psychotic still). However, I am struggling. I know logically not to take it personally but I can't help feeling bad. I want to pursue psychiatry, particularly OP, so this isn't a forever issue since I imagine this is more common with IP psych wards, but I'm not even sure how to cope for residency. Any advice on how to build a tougher skin? I don't really have support systems here and have just been ruminating about this particular patient everyday going home from the hospital.",
        "created_utc": 1675748042,
        "upvote_ratio": 1.0
    },
    {
        "title": "M4 when asked to go see the new patient",
        "author": "hc480",
        "url": "https://i.redd.it/zy9svi516pga1.png",
        "text": "",
        "created_utc": 1675745481,
        "upvote_ratio": 1.0
    },
    {
        "title": "FAERs MSARF program",
        "author": "oxytocinmotion99",
        "url": "https://www.reddit.com/r/medicalschool/comments/10vslcj/faers_msarf_program/",
        "text": "Could anyone who was involved in the MSARF program in previous years speak to their experience? Were you able to publish anything from the experience? \n\nAlso, does anyone happen to know how competitive it is to “match” into one of these programs, and how to evaluate your own application’s competitiveness. \n\nI’ve already submitted my app, but I just wanted some more input! \n\nThanks!!",
        "created_utc": 1675744290,
        "upvote_ratio": 1.0
    },
    {
        "title": "Pursue Medicine at 27 OR apply DMD this cycle and start at 29?",
        "author": "Soggy-Introduction18",
        "url": "https://www.reddit.com/r/medicalschool/comments/10vrqrs/pursue_medicine_at_27_or_apply_dmd_this_cycle_and/",
        "text": "27M finance career switcher that's looking to leave the corporate world.. Had an MCAT score that was set to expire, so I applied to medical school and was accepted. All said, I think my personality/interests lie in dentistry; however, I would have to submit a fresh app (+ take DAT) to potentially start at age 29.\n\nWhat would you do if you had interests in both? Medicine now at 27 or Dentistry at 29\n\n[View Poll](https://www.reddit.com/poll/10vrqrs)",
        "created_utc": 1675741916,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is the craziest case report or poster that you ever wrote or read?",
        "author": "eccome",
        "url": "https://www.reddit.com/r/medicalschool/comments/10vrdkj/what_is_the_craziest_case_report_or_poster_that/",
        "text": "What’s a patient case that made you say “WTF”?",
        "created_utc": 1675740879,
        "upvote_ratio": 1.0
    },
    {
        "title": "brain dump: home program for residency?",
        "author": "themessiestmama",
        "url": "https://www.reddit.com/r/medicalschool/comments/10vr6ua/brain_dump_home_program_for_residency/",
        "text": "TLDR:  main hesitations with staying at my home program are related to low self esteem and general itch to leave, not the program itself. i have a lot of benefits to staying here financially and emotionally. \n\n\\- just to preface: this is whether i would rank my home program 2nd or 3rd\n\nive been mulling over this for so long. i was in this city for undergrad, went to med school in the same city. my friends are here and some of my family too. i feel comfortable in the hospitals. i like the price of housing. my partner and his family are here. he has a nice job here. theres gunna be a huge recession soon which stresses him out regarding job markets with moving.\n\nbut i cant help but feel dread for staying. i feel like its bad to stay.. right? or not? idk? people tell me i should train somewhere else because it can be different... ? \n\nother reasons i feel like i should leave: \n\n\\- ive spent 4 years making stupid decisions, presenting shitty plans, being flat out wrong in front of so many people, and just being an annoying medical student and other random bullshit i blocked out of my memory because its embarrassing and cringe. ive felt like i cant be a doctor because of something an attending said on eval and how residents treated me during one of my rotations. makes me want to LEAVE and their words stick with me 1 year later.\n\n\\- ive started a lot of stuff here and was looking forward to not be around anymore to continue those things. is that bad of me? like extracurricular efforts and research and stuff. lol. would be cool to have a clean slate.\n\nreasons i should stay: this program is good. not prestigious but good. and big enough i may not ever see that attending again maybe? not sure. and i love the residents here. and love the program leadership. the amount of 24s and scheduling is on par with other programs i would rank highly anyway so whatever. and the things above.\n\ndoes anyone feel these feelings too? like wanting to create a new identity somewhere else? but also its difficult to make that jump because of the luxuries outside of residency (cheap housing, support system, partner that has a guaranteed job)....",
        "created_utc": 1675740356,
        "upvote_ratio": 1.0
    },
    {
        "title": "1 rotation left until I can go back home. Help me make it?",
        "author": "messoesso",
        "url": "https://www.reddit.com/r/medicalschool/comments/10vr09v/1_rotation_left_until_i_can_go_back_home_help_me/",
        "text": "I went through a shitty break up at the end of 2022. Still going through it. I have roughly 8 weeks left, 1 rotation left until I can go back home to my friends and family and leave this stupid city and my ex behind for good. \n\nThis rotation sucks. I’m basically treated like a scribe/MA, it’s in my least favorite specialty, my doctor has 0 personality and is the most serious person I’ve ever encountered, and it’s an hour commute. \n\nTips to help me get through it? I’ve been going to the gym as much as possible which helps. I try to fill my weekends with hobbies and studying. But I dread waking up and I start each day anxious. It’s hard to fight the sadness. And my best (and only) friend in this city got placed on rotation in her hometown so she’s gone for the rest of the semester.\n\nTips, positivity and encouragement needed :)",
        "created_utc": 1675739861,
        "upvote_ratio": 1.0
    },
    {
        "title": "Should I list the abstracts for my conference presentations on my CV?",
        "author": "scenicorchard",
        "url": "https://www.reddit.com/r/medicalschool/comments/10vqzmk/should_i_list_the_abstracts_for_my_conference/",
        "text": "Listing my presentations on my CV, just wondering if I should also list the title/citation of the abstracts showing that I'm first author on them? Was told by a doctor to highlight that I'm first author on those abstracts, but I assumed that listing them as conference presentations would imply that anyways, right?",
        "created_utc": 1675739810,
        "upvote_ratio": 1.0
    },
    {
        "title": "My Anki cards at 12am after a stressful day of feeling like an idiot",
        "author": "BrownEyeGivesPinkEye",
        "url": "https://media.tenor.com/4KYN3_KEY74AAAAC/back-back-back-back-again.gif",
        "text": "",
        "created_utc": 1675739194,
        "upvote_ratio": 1.0
    },
    {
        "title": "what type of bread would each specialty be?",
        "author": "coconut170",
        "url": "https://www.reddit.com/r/medicalschool/comments/10vq861/what_type_of_bread_would_each_specialty_be/",
        "text": "we talk about the bread and butter of each specialty, but what about the bread? I'll go first... \n\nFM - whole grain \n\nIM - sourdough \n\npeds - donut hole",
        "created_utc": 1675737754,
        "upvote_ratio": 1.0
    },
    {
        "title": "Australia vs. US medical education",
        "author": "Ndtp-gen",
        "url": "https://www.reddit.com/r/medicalschool/comments/10vpywq/australia_vs_us_medical_education/",
        "text": "Can anyone give insights on differences bw AUS vs. USA medical education regarding qualities, salaries, etc.?\n\nI live in the US. And to complete med school here, it’ll take 8 years (4 years of undergrad + 4 years of med school) before I’m being called “a doctor.” I struggled with MCAT as I’m an immigrant with English as a 2nd language, so I had 2 gap years (1 year to retake MCAT and 1 year to apply). So it takes me a total of 10 years to complete med school. So far I’m proud of my own journey.\n\nI’ve been looked down upon my Mom’s family who lives in Sydney, Aus. Three of my first-generation cousins who are native Australian got into 5-year medical schools straight out of high school and will get everything completed at 22 years old. I’m happy for them tbh! The thing is, as my aunts bragged about how well their children were doing ATAR and UCAT exams, I found out that they also said how bad I am for taking too long to complete med school (yes, they listed years that I failed exams and took multiple years to get into med school). They said I could’ve not been able to be a doctor if I live in Australia. That hurt me so bad.\n\nI couldn’t find anywhere on the internet where they compare the differences in medical education between Aus and Usa … So I don’t know how ppl can learn everything about medicine in just 5 years, like they don’t need to learn all the physics, inorganic chem, organic chem, genetics, etc…",
        "created_utc": 1675737070,
        "upvote_ratio": 1.0
    },
    {
        "title": "It's Time for the Scientific Community to Admit \"We Were Wrong About COVID and It Cost Lives\" | Opinion Kevin Bass - Medical Resarcher",
        "author": "Fragrant_Evidence_58",
        "url": "https://www.newsweek.com/its-time-scientific-community-admit-we-were-wrong-about-coivd-it-cost-lives-opinion-1776630",
        "text": "",
        "created_utc": 1675733504,
        "upvote_ratio": 1.0
    },
    {
        "title": "So you want to be an OB/GYN…",
        "author": "DesignerSmile_91",
        "url": "https://www.reddit.com/r/medicalschool/comments/10vodye/so_you_want_to_be_an_obgyn/",
        "text": "Hi guys, not sure if anyone can help but I’m an MS3 thinking of applying for an obgyn residency. I was wondering if anyone has some tips/advice/encouragement on how to go about that. I don’t have any research (currently working on that), I do volunteer when I can but I just want to make myself a better candidate. Thank you!",
        "created_utc": 1675732959,
        "upvote_ratio": 0.99
    },
    {
        "title": "Third party resources",
        "author": "dsmith3265",
        "url": "https://www.reddit.com/r/medicalschool/comments/10vnk76/third_party_resources/",
        "text": "I'm sure this will come with a heavy dose of opinion, but what are the best third-party resources for pre-clinical and Step 1 prep?",
        "created_utc": 1675730785,
        "upvote_ratio": 1.0
    },
    {
        "title": "I created Clinicle, a Wordle like medical semantic guessing game. Let me know what you think!",
        "author": "LV_unloader",
        "url": "https://www.reddit.com/r/medicalschool/comments/10vn5ck/i_created_clinicle_a_wordle_like_medical_semantic/",
        "text": "Hey guys! I made [this free medical reasoning game](https://www.cliniclegame.com/) after Wordle came out. Would love to hear your thoughts.\n\nThere's a new secret diagnosis every day (midnight eastern time). Each guess is given a \"similarity score\" and \"closeness\" to tell you if you're on the right path. Let me know if you think it's playable or boring!\n\ntl;dr: I made a totally free game that collects no user data and has no ads (just a fun side project). [Play Clinicle](https://www.cliniclegame.com/)\n\nEdit: please don't post the answers in the comments\n\nhttps://preview.redd.it/yttp3q44vnga1.png?width=1572&amp;format=png&amp;auto=webp&amp;v=enabled&amp;s=dff048e00dfa18af46c2c5738c741d0d38ced53e",
        "created_utc": 1675729720,
        "upvote_ratio": 1.0
    },
    {
        "title": "What shoes should I purchase for long hour surgeries?",
        "author": "Ill-Detective-1362",
        "url": "https://www.reddit.com/r/medicalschool/comments/10vn43c/what_shoes_should_i_purchase_for_long_hour/",
        "text": "I’ve tried yeezy’s, crocs, new balance etc, my problem is my heel and Achilles are super painful after long ass surgeries. Any reccomendations?",
        "created_utc": 1675729622,
        "upvote_ratio": 1.0
    },
    {
        "title": "Rotation Depression - am I doomed?",
        "author": "FlakyGur2177",
        "url": "https://www.reddit.com/r/medicalschool/comments/10vmyd7/rotation_depression_am_i_doomed/",
        "text": "Hey everyone,\n\nI’m an M2 who just started rotations last month. I’ve been in family medicine and geriatrics so far, and this is the most depressed and anxious I’ve been in a really long time. \n\nI don’t think rotations are necessarily harder than preclinical years, but waking up and getting out of bed to go to clinic takes every ounce of mental energy I have. Nothing feels meaningful. I catch myself asking “what’s the point?” at least once a day. I don’t feel interest in doing anything, I don’t know what to look forward to. I feel simultaneously stupid and like a cog in a big tainted machine. \n\nI think part of it is also the fact that I’ve been seeing a lot of chronic medical conditions and morbidity caused by lifestyle, and seeing other humans continuously doom their bodies to failure has been heartbreaking and frustrating. But I also am worried that this is just going to be how it is for me— I have classmates who are working way longer and harder shifts than me in OB, acute care, and surgical care, and handling it way better.\n\nI’ve dealt with chronic anxiety for half my life, with a few of times that I slipped into deeper depression, so this feeling isn’t new to me. But given the context, I’m honestly scared that this is just how medicine is going to be for me. It feels ridiculous to say it, but if this is just what it’s like, I genuinely don’t know if I’m going to survive residency. And I mean physically survive.\n\nHas anyone felt this? Does it get better? How do I get that sense of meaning back?\n\nMuch love\nFlakyGur",
        "created_utc": 1675729203,
        "upvote_ratio": 1.0
    },
    {
        "title": "Serious: PSA: 4th year is NOT necessarily the chill promised land",
        "author": "ChowMeinSinnFein",
        "url": "https://www.reddit.com/r/medicalschool/comments/10vmiz3/serious_psa_4th_year_is_not_necessarily_the_chill/",
        "text": "Jk this is a borderline divine plane of constant inner peace and bliss. What's a glomerulonephritis? There was something called an immune goblin idk I'm going to the pool 🌞",
        "created_utc": 1675728095,
        "upvote_ratio": 1.0
    },
    {
        "title": "Residency QOL in Bronx vs Brookyln vs Manhattan",
        "author": "Crafty-Roof-6630",
        "url": "https://www.reddit.com/r/medicalschool/comments/10vlz3r/residency_qol_in_bronx_vs_brookyln_vs_manhattan/",
        "text": "&amp;#x200B;\n\nMS4 looking at NYC for residency. Can anyone share with me what it's like to live in the various boroughs for residency in terms of what it's like and how habitable they are? Will be going into ROAD specialty FYI",
        "created_utc": 1675726681,
        "upvote_ratio": 1.0
    },
    {
        "title": "Imposter syndrome",
        "author": "Excellent_Flamingo50",
        "url": "https://www.reddit.com/r/medicalschool/comments/10vlyol/imposter_syndrome/",
        "text": "Any tips on how to overcome imposter syndrome? Third year going into fourth. Not sure what I want to specialize in but I enjoy watching procedures . However, most specialties that involve procedures seem very tedious and I’m not sure if  I keep counting myself out , but I’m scared to try . I don’t want to be the reason I don’t reach for the stars. Any tips on how to overcome this fear of failure or worse fear of success ?",
        "created_utc": 1675726652,
        "upvote_ratio": 1.0
    },
    {
        "title": "Let our professionals handle your research paper. Visit our website studybay.net",
        "author": "[deleted]",
        "url": "",
        "text": "[removed]",
        "created_utc": 1675726245,
        "upvote_ratio": 1.0
    },
    {
        "title": "Latest I can take Step2 for ‘23-24 ERAS cycle?",
        "author": "dewygirl",
        "url": "https://www.reddit.com/r/medicalschool/comments/10vko1w/latest_i_can_take_step2_for_2324_eras_cycle/",
        "text": "Basically, I got scheduled for an away rotation in my specialty of choice during most of July. Im planning on getting a much needed LOR so Im kinda locked in. Can I take step 2 early august or am I fucked?",
        "created_utc": 1675723459,
        "upvote_ratio": 1.0
    },
    {
        "title": "Cheap under scrubs? - ladies",
        "author": "summertimevibezz",
        "url": "https://www.reddit.com/r/medicalschool/comments/10vjlry/cheap_under_scrubs_ladies/",
        "text": "Any recs on cheap (yet comfy) shirts to wear under scrubs.",
        "created_utc": 1675720902,
        "upvote_ratio": 1.0
    },
    {
        "title": "Failed Internal Medicine Shelf Exam",
        "author": "AGsomething",
        "url": "https://www.reddit.com/r/medicalschool/comments/10vj7cn/failed_internal_medicine_shelf_exam/",
        "text": "So….I failed the internal medicine shelf exam and now I’m worried about my future in residency. I’ll be given a second chance to take it but it will show in my transcript for sure. I’m no interested in IM but I don’t know how this will affect my chances of finding a good residency in pediatrics. Is everything lost? How should I compensate? 😞",
        "created_utc": 1675719984,
        "upvote_ratio": 1.0
    },
    {
        "title": "What am I doing wrong here",
        "author": "cleverfox4",
        "url": "https://www.reddit.com/r/medicalschool/comments/10vj0yo/what_am_i_doing_wrong_here/",
        "text": "Feeling very dejected after my first exam score of this semester. I’m an M1, and all throughout the fall semester and the beginning of this semester, I’ve worked like crazy, always studying, just to barely tread water. I’ve passed all of my exams so far but just barely in some cases. It seems like my classmates can participate in all these extra curricular activities and take at least a little time for themselves but if I slack at all I will be so behind. \n\nCame to a head with this past block that just ended. It was in a subject I am passionate about, I did everything I could, felt great the whole block during quizzes, and even during the exam. Got the score back today to find I barely passed. \n\nI have to be doing something wrong here. I’m at a breaking point where I feel like I’m not seeing results for the effort put in. \n\nI go through all lecture materials provided by my school, fill out study guides, do practice questions close to exam time and re-do quizzes from class. I spend so much time studying I have become friends with the school janitor. \n\nPlease help",
        "created_utc": 1675719557,
        "upvote_ratio": 1.0
    },
    {
        "title": "Accommodations for migraines?",
        "author": "luminiferous_weather",
        "url": "https://www.reddit.com/r/medicalschool/comments/10vidn9/accommodations_for_migraines/",
        "text": "[removed]",
        "created_utc": 1675718034,
        "upvote_ratio": 1.0
    },
    {
        "title": "New surgery residency podcast!",
        "author": "zbuttress19",
        "url": "https://www.reddit.com/r/medicalschool/comments/10vhjy5/new_surgery_residency_podcast/",
        "text": "[removed]",
        "created_utc": 1675716119,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can Poli Sci Majors go to Med school?",
        "author": "SMILEY_ATTACK",
        "url": "https://www.reddit.com/r/medicalschool/comments/10vhaxy/can_poli_sci_majors_go_to_med_school/",
        "text": "Right now I’m a freshman undeclared. I applied poli sci aiming for the pre law track in hopes to me a malpractice attorney however I’m more and more interested in going to Med school. Would this still be possible?",
        "created_utc": 1675715562,
        "upvote_ratio": 1.0
    },
    {
        "title": "Resources to learn anatomy before surgery rotation?",
        "author": "littlee_j",
        "url": "https://www.reddit.com/r/medicalschool/comments/10vh79k/resources_to_learn_anatomy_before_surgery_rotation/",
        "text": "Title says it all - anatomy is not my forte and am wondering about best resources to learn it well before my surgery rotation starts. \n\nAlso curious if anyone has tried Sketchy Anatomy !",
        "created_utc": 1675715341,
        "upvote_ratio": 1.0
    },
    {
        "title": "ERAS withdrawal",
        "author": "ghostvinyl",
        "url": "https://www.reddit.com/r/medicalschool/comments/10vh2cl/eras_withdrawal/",
        "text": "[removed]",
        "created_utc": 1675715022,
        "upvote_ratio": 1.0
    },
    {
        "title": "Match withdrawal/ERAS",
        "author": "ghostvinyl",
        "url": "https://www.reddit.com/r/medicalschool/comments/10vgrdk/match_withdrawaleras/",
        "text": "[removed]",
        "created_utc": 1675714330,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is your outlook on healthcare with AI products like chatgpt?",
        "author": "sugarpimpdaddy",
        "url": "https://www.reddit.com/r/medicalschool/comments/10vgrao/what_is_your_outlook_on_healthcare_with_ai/",
        "text": "[removed]",
        "created_utc": 1675714323,
        "upvote_ratio": 1.0
    },
    {
        "title": "From A levels to Med School In America",
        "author": "shitakemushroom8",
        "url": "https://www.reddit.com/r/medicalschool/comments/10vgilb/from_a_levels_to_med_school_in_america/",
        "text": "Hi! Currently I am doing A levels and I want to study medicine in the USA but I am kind of confused at how things work. I was thinking of going through the community college pathway, I would really appreciate it if someone was to layout the pathway from community college to medical school to an A level student. Thank you!",
        "created_utc": 1675713788,
        "upvote_ratio": 1.0
    },
    {
        "title": "FORWARD: Looking for authors, editors and artists.",
        "author": "CM_1996_",
        "url": "https://www.reddit.com/r/medicalschool/comments/10vgci7/forward_looking_for_authors_editors_and_artists/",
        "text": " \n\nNOTE: I'm just forwarding the information, I'm sorry, I don't know the particulars.\n\n\\---------------------------------------------------------\n\nAdara Medicine\n\nWork:\n\n1. Individuals who can author medical textbook chapters.\n2. Individuals to edit and format medical textbook chapters.\n3. Individuals who can create medical images and drawings.\n\nPart-time. Set your own hours.\n\nYou will have to sign an NDA (all) and a Noncompete Agreement (if needed).  \nApplications will be accepted on a rolling basis.  \nAcknowledgements will be sent out in two weeks.\n\nCompensation:  \nYour name will be added to any and every chapter you work on. The same can be added to your CV under Publications.\n\nWho can apply:\n\n1. Medical background: Students, Graduates or Residents\n2. Excellent English Proficiency\n\nContact theadaragroup@gmail.com",
        "created_utc": 1675713426,
        "upvote_ratio": 1.0
    },
    {
        "title": "Looking for Authors, Editors and Artists",
        "author": "CM_1996_",
        "url": "https://www.reddit.com/r/medicalschool/comments/10vg1eb/looking_for_authors_editors_and_artists/",
        "text": "[removed]",
        "created_utc": 1675712721,
        "upvote_ratio": 1.0
    },
    {
        "title": "Outlook on rheum/allergy/endo",
        "author": "far_east_northwest",
        "url": "https://www.reddit.com/r/medicalschool/comments/10vfq39/outlook_on_rheumallergyendo/",
        "text": "\n\n\nHello! I’m currently an M4 going into IM. I’m mostly interested in these two specialties, and I was wondering how they are faring in the job market in the near future and job satisfaction aspects. Also, are they attainable from a well-established IM community program? Thank you!!",
        "created_utc": 1675711996,
        "upvote_ratio": 1.0
    },
    {
        "title": "After failing a year of med school due to Anatomy, I'm finally back.",
        "author": "winslow-revolving",
        "url": "https://www.reddit.com/r/medicalschool/comments/10vf3ng/after_failing_a_year_of_med_school_due_to_anatomy/",
        "text": "I failed a grand total of 13 times, but I guess 14th time's the charm. I was supposed to be in fourth year but it turns out you can't keep failing a subject and expect people to forget about it.\n\nGranted, in my defense, I did take everything else.\n\nThe kicker is that I passed because the head of the department got seriously ill and had to be replaced. I did study the material, but having the staff be seriously overworked because their boss bailed on them really did help. I'm pretty sure they didn't want to see me anymore.\n\nI've got the next seven months all to myself. I haven't had a single summer where I could relax since I started so this really doing wonders for my mental health. I can actually sleep normally now.",
        "created_utc": 1675710579,
        "upvote_ratio": 1.0
    },
    {
        "title": "Med School Activities v/ Exams",
        "author": "SharonFischer",
        "url": "https://www.reddit.com/r/medicalschool/comments/10veo3m/med_school_activities_v_exams/",
        "text": "[removed]",
        "created_utc": 1675709578,
        "upvote_ratio": 1.0
    },
    {
        "title": "Some say, this person is the Patron Saint of Midlevels (x-post)",
        "author": "stepneo1",
        "url": "https://www.reddit.com/r/medicalschool/comments/10ve966/some_say_this_person_is_the_patron_saint_of/",
        "text": "https://www.reddit.com/r/Damnthatsinteresting/comments/10uuu33/ferdinand_waldo_demara_jr_pretended_to_be_a_naval/",
        "created_utc": 1675708607,
        "upvote_ratio": 1.0
    },
    {
        "title": "fluctuation test",
        "author": "tejpatame",
        "url": "https://i.redd.it/5wt4f70mlnga1.jpg",
        "text": "",
        "created_utc": 1675708468,
        "upvote_ratio": 1.0
    },
    {
        "title": "featuring every psych patient on rural family med",
        "author": "Chemical-Jacket5",
        "url": "https://i.redd.it/ckktntvagnga1.jpg",
        "text": "So much mental illness",
        "created_utc": 1675706682,
        "upvote_ratio": 1.0
    },
    {
        "title": "ERAS 2024 changes: only 10 experiences and select top 3 most meaningful",
        "author": "SpiritedChaos",
        "url": "https://i.redd.it/abbbgbn4dnga1.jpg",
        "text": "this is interesting because previously it was unlimited amount of experiences that could be input. i wonder how this will be viewed when applying to a competitive specialty where research/pub# matters… any thoughts?",
        "created_utc": 1675705615,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is it normal that I've seen 0 cadavres when learning bones of human anatomy?",
        "author": "ucankunefe04",
        "url": "https://www.reddit.com/r/medicalschool/comments/10vcwvm/is_it_normal_that_ive_seen_0_cadavres_when/",
        "text": "[removed]",
        "created_utc": 1675705610,
        "upvote_ratio": 1.0
    },
    {
        "title": "Surgery SubI Shoes",
        "author": "Dr_Costanza",
        "url": "https://i.redd.it/jjcmmgxm9nga1.jpg",
        "text": "I’m starting a surgery SubI in the next few weeks and was looking for some appropriate footwear. Does anyone have experience with these shoes? They seem comfortable and waterproof, but I don’t want to risk upstaging my attendings.",
        "created_utc": 1675704441,
        "upvote_ratio": 1.0
    },
    {
        "title": "Super Paranoid about needle stick",
        "author": "No-Relationship-2955",
        "url": "https://www.reddit.com/r/medicalschool/comments/10vc6p2/super_paranoid_about_needle_stick/",
        "text": "Currently on my surgery rotation. I was suturing a very young pediatric patient when I grabbed the suture needle with my hand (rookie mistake) and felt a prick. I was super concerned I had gotten struck and checked my gloves right there but I didn’t see any puncture. I finished the suture, checked my gloves again, checked my finger and there was nothing. Washed my hands and checked again, then sprayed some alcohol to see if it stung or anything but nothing the thumb looks intact. I told my attending and hes not worried about it after telling him there was no puncture to the glove or my hand. Im freaking out and need some advice or someone to talk me off this anxiety ledge with some logic. Thank you 😭",
        "created_utc": 1675703933,
        "upvote_ratio": 1.0
    },
    {
        "title": "Panicking about thank you emails",
        "author": "nickysmokes",
        "url": "https://www.reddit.com/r/medicalschool/comments/10vbtt6/panicking_about_thank_you_emails/",
        "text": "Hi all,\n\nJust wanted to ask a question about some of the thank you emails I sent out. I mentioned in 7 of these emails that I was \"excited about the prospect of residency/being a resident there\" and \"excited about the program, but made no mention of rank order lists. I wanted to know if this should dissuade me from writing ROL intent to rank letters to my top 3 programs.\n\nThanks in advance!",
        "created_utc": 1675703111,
        "upvote_ratio": 0.99
    },
    {
        "title": "Endovascular Surgical Neuroradiology",
        "author": "ReachToMe",
        "url": "https://www.reddit.com/r/medicalschool/comments/10vbcu5/endovascular_surgical_neuroradiology/",
        "text": "M2 trying to narrow down on specialties. I am certain that I want to do procedures and love nervous system A&amp;P. Neurosurgery, although awesome, unfortunately does not provide the lifestyle I'm seeking out, so I saw endovascular surgical neuroradiology as a potential option. I know you can either go through DR/neuro and understand the types of procedures done, but do not know too much more about this specialty. Can anyone provide insight for this specialty? Eg, continuity of care, work-life balance, salary, etc? Any input is appreciated. TIA!!",
        "created_utc": 1675702018,
        "upvote_ratio": 1.0
    },
    {
        "title": "The freakery",
        "author": "Da_Glizzident",
        "url": "https://i.redd.it/hpwa2vd62nga1.jpg",
        "text": "",
        "created_utc": 1675701931,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to study for step 2",
        "author": "Tasty_Regular_9813",
        "url": "https://www.reddit.com/r/medicalschool/comments/10vazao/how_to_study_for_step_2/",
        "text": "[removed]",
        "created_utc": 1675701124,
        "upvote_ratio": 1.0
    },
    {
        "title": "Some fun 2024 ERAS changes - getting flashbacks to AMCAS",
        "author": "grave_plot",
        "url": "https://imgur.com/a/FbQvY2h/",
        "text": "",
        "created_utc": 1675698596,
        "upvote_ratio": 1.0
    },
    {
        "title": "The Syrian American Medical Society is raising funds for the earthquake in Turkey/Syria last night. Please don't give what you can't afford, but consider sharing the link. Thank you.",
        "author": "Osteo_Cartographer",
        "url": "https://m.facebook.com/nt/screen/?params=%7B%22fundraiser_campaign_id%22%3A880527999854774%2C%22post_id%22%3A880528019854772%7D&amp;path=%2Ffundraiser%2F&amp;refsrc=deprecated&amp;_rdr",
        "text": "A strong 7.8 earthquake hit south Turkey and North Syria today and caused major damage to the infrastructure and collapsed buildings in an area already suffering from a horrific humanitarian crisis due to protracted conflict. \n\nThe earthquake caused hundreds of causalities and many people are still trapped under the rubble.\n\nSAMS facilities in NW Syria have been providing medical and surgical treatments to the victims of the earthquake treating hundreds of seriously injured men, women and children within the last few hours. Unfortunately the scope of this natural disaster is way beyond our resources and capacity. Our doctors and nurses are overwhelmed and the supplies are running short. And on top of that 4 of our large hospitals were damaged by the earthquake and are out of service.\n\nWe are asking for your generous donation to help the victims of this earthquake, purchase medical supplies and medications, recruit extra medical help, repair and rehab our damaged hospitals including two busy maternity hospital that deliver more than 500 babies each month.\n\nOur doctors and nurses are willing to work tirelessly until all victims are healed but they need your support \n\nWant to join me in supporting a good cause? I'm raising money for Syrian American Medical Society- SAMS and your contribution will make an impact, whether you donate $5 or $500. Every little bit helps. Thank you for your support. I've included information about Syrian American Medical Society- SAMS below. \n\nMission\n\nSAMS is dedicated to delivering life-saving services, revitalizing health systems during crisis, and promoting medical education via a network of humanitarians in Syria, the US, and beyond.\n\nVision\n\nSAMS’ vision is to strengthen the future of Syria’s healthcare, delivering dignified medical relief where needed, fortified by a dedicated medical community.",
        "created_utc": 1675695966,
        "upvote_ratio": 1.0
    },
    {
        "title": "ChatGPT but for your school notes !",
        "author": "kind_pikachu",
        "url": "https://www.reddit.com/r/medicalschool/comments/10v88vs/chatgpt_but_for_your_school_notes/",
        "text": "Hey guys!\n\nWe've created a new AI tool that can help you find answers to your questions faster by using your personal notes.\n\nSince it's using AI, it's able to understand the question and provide the appropriate answer.\n\nWe wanted to know how this could help med students in their studies.\n\nI've joined a gif showing an example of it working\n\nWe would love to hear your thoughts and if you are interested in trying it out.",
        "created_utc": 1675694515,
        "upvote_ratio": 1.0
    },
    {
        "title": "Blockchain for EMR-management",
        "author": "DAOSeries",
        "url": "https://www.reddit.com/r/medicalschool/comments/10v87qv/blockchain_for_emrmanagement/",
        "text": "[removed]",
        "created_utc": 1675694432,
        "upvote_ratio": 1.0
    },
    {
        "title": "Same goes for Genetic typos",
        "author": "FirstConsulOfFrance",
        "url": "https://i.redd.it/zkwe3ty2xkga1.png",
        "text": "",
        "created_utc": 1675694070,
        "upvote_ratio": 1.0
    },
    {
        "title": "If med school was a medication, what side-effects would it come with? And who would be contraindicated from taking it?",
        "author": "green-with-envy",
        "url": "https://www.reddit.com/r/medicalschool/comments/10v8036/if_med_school_was_a_medication_what_sideeffects/",
        "text": "I’ll start. Some adverse effects may include severe FOMO and chronic regret.",
        "created_utc": 1675693878,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why do attendings say things in matter-of-fact dick-ish ways like I should’ve known them when I’m an M3 and I know nothing?",
        "author": "xpertnoise",
        "url": "https://www.reddit.com/r/medicalschool/comments/10v7fk4/why_do_attendings_say_things_in_matteroffact/",
        "text": "Obviously there are things I should know as an M3, but some things I don’t know how I would be expected to know, and some attendings seem to expect me to?",
        "created_utc": 1675692358,
        "upvote_ratio": 1.0
    },
    {
        "title": "My school put me at my 19th rotation site in the middle of butt fuck nowhere and I’m devastated",
        "author": "eggmed",
        "url": "https://www.reddit.com/r/medicalschool/comments/10v75db/my_school_put_me_at_my_19th_rotation_site_in_the/",
        "text": "I got royally fisted by the randomized, lottery algorithm. Almost everyone else got their top 5 sites, and a handful got screwed into their 16th-22nd site. Statistically, this was less than 1% likelihood of happening. I just keep getting fisted by this school. Three years I’ve given to my preclinicals because of corrupt policies that only apply when admin choose to let them apply. One thing after another. The only thing helping me get through it was the hope that I’d finally be out of this city and onto a brighter quality of life. Now, I’m going to a city that is, in all aspects, a significant downgrade. It’s even more underdeveloped and rural and I can’t even find housing. I want to be happy for my friends and peers who got their dream sites, but that should’ve been me too. It’s pathetic that my school refuses to acknowledge flaws with their practices. I’m trying to be optimistic, to have “grit,” but my drive to study for boards and show up every day to do my best is killed.",
        "created_utc": 1675691626,
        "upvote_ratio": 1.0
    },
    {
        "title": "EEG Interpretation Resources",
        "author": "NathanHenryW",
        "url": "https://www.reddit.com/r/medicalschool/comments/10v6x34/eeg_interpretation_resources/",
        "text": "[removed]",
        "created_utc": 1675690970,
        "upvote_ratio": 1.0
    },
    {
        "title": "tmw you’ve been gaslighting yourself that your recent fatigue was just med school burnout",
        "author": "dicemaze",
        "url": "https://i.imgur.com/gn9hQGH.jpg",
        "text": "",
        "created_utc": 1675689948,
        "upvote_ratio": 1.0
    },
    {
        "title": "Mississippi Psychiatry Residency Issues",
        "author": "EuphoricCry6530",
        "url": "https://www.reddit.com/gallery/10v6gq1",
        "text": "Posted on RCLU insta page. Thoughts?",
        "created_utc": 1675689675,
        "upvote_ratio": 1.0
    },
    {
        "title": "At least they usually have lukewarm pizza!",
        "author": "WillOfTheSon",
        "url": "https://i.redd.it/1rzmqxpxzlga1.jpg",
        "text": "",
        "created_utc": 1675689071,
        "upvote_ratio": 1.0
    },
    {
        "title": "The USNWR Medical School Rankings Mass Exodus: Winners &amp; Losers Edition",
        "author": "SedationWhisperer",
        "url": "https://thesheriffofsodium.com/2023/02/06/the-usnwr-medical-school-rankings-mass-exodus-winners-losers-edition/",
        "text": "",
        "created_utc": 1675687576,
        "upvote_ratio": 1.0
    },
    {
        "title": "A General Explanation of Hemostatic Forceps - Tricky Perks",
        "author": "jimymedical1",
        "url": "https://trickyperks.com/a-general-explanation-of-hemostatic-forceps/",
        "text": "",
        "created_utc": 1675684633,
        "upvote_ratio": 1.0
    },
    {
        "title": "Complete Guide to study MBBS in China",
        "author": "studymbbschina",
        "url": "https://24techhub.com/complete-guide-to-study-mbbs-in-china/",
        "text": "",
        "created_utc": 1675683476,
        "upvote_ratio": 1.0
    },
    {
        "title": "What You Need to Know Before You Study MBBS in China",
        "author": "studymbbschina",
        "url": "https://pashudhanjsnk.org/study-mbbs-in-china/",
        "text": "",
        "created_utc": 1675683130,
        "upvote_ratio": 1.0
    },
    {
        "title": "A Summary of Study MBBS in China",
        "author": "studymbbschina",
        "url": "https://techblogtrend.com/en/study-mbbs-in-china/",
        "text": "",
        "created_utc": 1675682860,
        "upvote_ratio": 1.0
    },
    {
        "title": "Anki Wrist Injury???",
        "author": "HeroesandCheerios",
        "url": "https://www.reddit.com/r/medicalschool/comments/10v46j2/anki_wrist_injury/",
        "text": "Okay so weird question; my wrist kind of hurts from anki and also just touching the labtop keyboard so much, so I was going to buy an external keyboard with lap-pad or something to get hands in a different position. Does anyone have any recs on products for something like this?",
        "created_utc": 1675682402,
        "upvote_ratio": 1.0
    },
    {
        "title": "🍪",
        "author": "Andre_Ferro7",
        "url": "https://i.redd.it/nsx7y13pdjga1.jpg",
        "text": "",
        "created_utc": 1675675378,
        "upvote_ratio": 1.0
    }
]