[
    {
        "title": "Woke-neutral residencies ?",
        "author": "Dischordserves",
        "url": "https://www.reddit.com/r/medicalschool/comments/11eayxr/wokeneutral_residencies/",
        "text": "[removed]",
        "created_utc": 1677597837,
        "upvote_ratio": 1.0
    },
    {
        "title": "Enjoying pregnancy while in medical school?",
        "author": "torptorp2",
        "url": "https://www.reddit.com/r/medicalschool/comments/11eaqcy/enjoying_pregnancy_while_in_medical_school/",
        "text": "Hi! So to keep it short, I'm currently preggo (5 months) and am an MS1. Due in July. I don't particularly enjoy pregnancy altogether (honestly not a fan of it), but know it's a special time and am TRYING to be present in the moment and try to enjoy (?) the next handful of months before baby comes.   \n\n\nWanted to see if any parents/any moms who delivered while in med school have advice? I typically feel way too busy/stressed to find time to enjoy any pregnancy things (like preparing the nursery, baby showers, etc), but am trying to be more mindful in doing so. Also, am trying reaaaally hard to give myself more grace and be okay with not scoring the grade I want, as long as I'm passing:)",
        "created_utc": 1677597559,
        "upvote_ratio": 1.0
    },
    {
        "title": "Need help deciding when to take Step 1 and Step 2.",
        "author": "LavCrizal",
        "url": "https://www.reddit.com/r/medicalschool/comments/11e9p11/need_help_deciding_when_to_take_step_1_and_step_2/",
        "text": "[removed]",
        "created_utc": 1677596328,
        "upvote_ratio": 1.0
    },
    {
        "title": "Heartbroken and seeking clarity",
        "author": "Current_Ad2993",
        "url": "https://www.reddit.com/r/medicalschool/comments/11e836r/heartbroken_and_seeking_clarity/",
        "text": " I figured I post here because I was lurking on this subreddit for a while to learn and saw a lot of posts about the difficulties of relationships. \n\nI was in a long-distance relationship with a med student and made an effort to understand her busy schedule. I even browsed the subreddit every day to learn and understand. However, the lack of quality time together basically caused me to have attachment anxiety. I slowly addressed what I needed so I didn't cause unwanted pressure. I even mentioned that I had a lot of free time so whenever she was free and wanted to chat, she could call and FaceTime whenever. Eventually, when I didn't get anything, we had to schedule it instead. We did manage to schedule a FaceTime call once a week, not enough, but it was better than going months or weeks without one like before. We even spent time together in person during winter break and there was no sign of anything wrong. All was good until she had to move back because of the start of the semester. Again, I tried to understand and thought I could take it temporarily because classes, matching, and boards were causing her some major anxiety and stress.\n\nA couple of days before, she seemed aggressive and mean through text. That continued the next day, and she seemed quieter than usual, so I asked her why she was quiet and if everything was good (my anxious attachment acting up). She lashed out again and told me that she was dying from studying, as usual. It just felt like she was saying I didn't understand her without saying it directly. Like I knew she was studying but just wanted to check up on her because it was causing me anxiety. I did something similar months before, but it was not as bad, and we clarified the misunderstanding because it is really hard to tell through text. Then the breakup text came right after.\n\nThe breakup came all of a sudden because even though she had told me how much she was stressed, she did not communicate the potential of a breakup. The reason she gave was that she could not meet my needs even though it was the bare minimum. She said she was too busy and anxious after the second semester her M2 started.\n\nI have been struggling to accept this as the reason because I feel this is something we could have talked about before at least. Even if I did something wrong or it was me I would like to know so I can fix these issues. I didn't even get a call, and it was all via text. No chance to talk it out or anything because I just accepted it at the moment. We never had any arguments before, and she never mentioned anything that she felt was wrong in the relationship. I even asked her to communicate anything that bothered her to me because all I wanted to do was support her.\n\nEven after the breakup, I did not argue back and just thanked her and went no contact. I do think it's best for both of us to have this space, and she can focus on med school and boards without unnecessary drama. I am just extremely hurt because I wanted it to work and gave it my all. I tried to communicate as much as I could but never got that in return.\n\nI know this is just my side of the story, and I am not going to contact her until she reaches out to me, which I feel is not going to happen ever for some reason. I feel like I was suffocating her in the relationship even though I just wanted basic things and communication. I want med students' opinions on my story.\n\nNote: I went down this rabbit hole about attachment theory. I saw a lot of anxious attachment in me, while I saw a lot of avoidant behavior in her which is causing me to not accept the reason she gave me.\n\nTLDR: Med school GF broke up with me because she did not have time for me, and I am confused about the real reason because of a lack of communication. I am going no contact for my healing but want answers from her.",
        "created_utc": 1677594380,
        "upvote_ratio": 1.0
    },
    {
        "title": "University of Colorado Medschool/residency: can you smoke weed?",
        "author": "XOTourLlif3",
        "url": "https://www.reddit.com/r/medicalschool/comments/11e8250/university_of_colorado_medschoolresidency_can_you/",
        "text": "Just curious. I always wondered what the policy was since it’s technically legal there. A quick search says that it’s a drug free campus but I wanna know the reality.",
        "created_utc": 1677594345,
        "upvote_ratio": 1.0
    },
    {
        "title": "I'll never say porcelain gallbladder again",
        "author": "Prestigious_Pride670",
        "url": "https://i.redd.it/ec11p1tkczka1.png",
        "text": "",
        "created_utc": 1677594105,
        "upvote_ratio": 1.0
    },
    {
        "title": "What signature should a doctor have?",
        "author": "ughidktbhh",
        "url": "https://www.reddit.com/r/medicalschool/comments/11e7rng/what_signature_should_a_doctor_have/",
        "text": "Maybe this might not be the right subreddit to ask, but I'm a med student  with an embarrassing signature (a simple stupid star). I want to change my signature to something professional and difficult. Could someone please give inspiration?\n\nTIA",
        "created_utc": 1677593999,
        "upvote_ratio": 1.0
    },
    {
        "title": "First nbme scores from people who did atleast 50% of anking",
        "author": "jalijali24",
        "url": "https://www.reddit.com/r/medicalschool/comments/11e6lt1/first_nbme_scores_from_people_who_did_atleast_50/",
        "text": "For the people who did atleast 50% of Anking, what were you scoring on first few NBME’s?\n\nHey all! Just trying to see for the people who did atleast half of the anking deck what they were scoring on there first few nbmes. I am trying to just single out how much anking can teach you for the nbme’s.\n\nIf you did anking but also finished tons of qbanks before nbme’s then please don’t answer in the poll as I am just trying to single out for answers from people who attribute there nbme scores from mostly just anking knowledge rather then having done 5000 questions as well at the same time\n\nI hope that makes sense\n\n[View Poll](https://www.reddit.com/poll/11e6lt1)",
        "created_utc": 1677592468,
        "upvote_ratio": 1.0
    },
    {
        "title": "For the people who did atleast 50% of Anking, what were you scoring on first few NBME’s?",
        "author": "jalijali24",
        "url": "https://www.reddit.com/r/medicalschool/comments/11e6fji/for_the_people_who_did_atleast_50_of_anking_what/",
        "text": "Hey all! Just trying to see for the people who did atleast half of the anking deck what they were scoring on there first few nbmes. I am trying to just single out how much anking can teach you for the nbme’s.\n\nIf you did anking but also finished tons of qbanks before nbme’s then please don’t answer in the poll as I am just trying to single out for answers from people who attribute there nbme scores from mostly just anking knowledge rather then having done 5000 questions as well at the same time\n\nI hope that makes sense\n\n[View Poll](https://www.reddit.com/poll/11e6fji)",
        "created_utc": 1677591988,
        "upvote_ratio": 1.0
    },
    {
        "title": "Antiplatelet drugs in Stable Angina",
        "author": "Adventurous_Beat_420",
        "url": "https://www.reddit.com/r/medicalschool/comments/11e64r1/antiplatelet_drugs_in_stable_angina/",
        "text": "[removed]",
        "created_utc": 1677591122,
        "upvote_ratio": 1.0
    },
    {
        "title": "What's the stance of the medical community on antivaxxers?",
        "author": "PublicMasterpiece589",
        "url": "https://www.reddit.com/r/medicalschool/comments/11e5yu6/whats_the_stance_of_the_medical_community_on/",
        "text": "[removed]",
        "created_utc": 1677590639,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why do we go to surgery M&amp;M but not OB/GYN?",
        "author": "Comfortable_Let_1015",
        "url": "https://www.reddit.com/r/medicalschool/comments/11e53mq/why_do_we_go_to_surgery_mm_but_not_obgyn/",
        "text": "When we’re on clinicals at my school, M&amp;M is mandatory for the general surgery rotation. Students, however are disallowed from attending the OB/GYN M&amp;M conference. I’m curious if it’s this way at every school and if so, why?",
        "created_utc": 1677588097,
        "upvote_ratio": 1.0
    },
    {
        "title": "I feel like the dumbest man alive",
        "author": "hornyaltprofile",
        "url": "https://www.reddit.com/r/medicalschool/comments/11e50hm/i_feel_like_the_dumbest_man_alive/",
        "text": "Had the second weekly class in the teaching hospital today, we're taken around by a doctor who shows us patients, hospital equipment, shows some basic stuff etc.\n\nI came in but couldn't find my group who somehow all telepathically knew where exactly to go. When I started asking in the group chat it was too late because they left their phones when changing into scrubs. But you can't enter the changing room without a keycard that the doctor has, and you can't go into intensive therapy where (I suspect) the class was without scrubs, so by coming just 5 mins earlier than the starting hour I was basically left behind for good. After 20 minutes of confused wondering had to give up and head home.\n\nThis is my favourite fucking class man. This shit happens to me all the time, I didn't show up for one of the anatomy exams once already because I assumed the wrong starting time, but I weaseled out of it with a bs online sick leave where you can claim diarrhea and there's no way to prove it. This shit just keeps happening to me and everyone seem to somehow intuitively understand where to go and when. I failed and successfully retook countless exams by now but nothing makes me more discouraged than this bullshit. Fuck.",
        "created_utc": 1677587817,
        "upvote_ratio": 1.0
    },
    {
        "title": "ECO 201-Quiz 7 (2023 Update) - ECO 201",
        "author": "SuperGrades",
        "url": "https://www.stuvia.com/doc/2420884/eco-201-quiz-7-2023-update",
        "text": "",
        "created_utc": 1677586827,
        "upvote_ratio": 1.0
    },
    {
        "title": "orthostatic hypotension",
        "author": "Opposite-Run-6161",
        "url": "https://www.reddit.com/r/medicalschool/comments/11e4hmh/orthostatic_hypotension/",
        "text": "[removed]",
        "created_utc": 1677586196,
        "upvote_ratio": 1.0
    },
    {
        "title": "Several Types of Hemostatic Forceps",
        "author": "jimymedical1",
        "url": "https://webvk.in/several-types-of-hemostatic-forceps/",
        "text": "",
        "created_utc": 1677585048,
        "upvote_ratio": 1.0
    },
    {
        "title": "What Are Arterial And Hemostatic Forceps? - Nairaland / General",
        "author": "jimymedical1",
        "url": "https://www.nairaland.com/7589642/what-arterial-hemostatic-forceps",
        "text": "",
        "created_utc": 1677584901,
        "upvote_ratio": 1.0
    },
    {
        "title": "Most of the medstudents I know are suffered by different levels of depression. How about you?!",
        "author": "Kaladolin",
        "url": "https://www.reddit.com/r/medicalschool/comments/11e42qz/most_of_the_medstudents_i_know_are_suffered_by/",
        "text": "You?!\n\n[View Poll](https://www.reddit.com/poll/11e42qz)",
        "created_utc": 1677584859,
        "upvote_ratio": 1.0
    },
    {
        "title": "Tips for Pediatric Rotation with Physical Disability",
        "author": "CuteCumberr",
        "url": "https://www.reddit.com/r/medicalschool/comments/11e40h8/tips_for_pediatric_rotation_with_physical/",
        "text": "Hey, being a pediatrician is all I've ever wanted since I spent a lot of time in hospital as a kid for a permanent physical disability. I don't want to give away what it is, but even though it's somewhat subtle, I've always gotten a lot of stares and questions and even bullying when I was young.\n\nDespite all that, I've always loved kids and want to give back and help kids the way doctors helped me. A friend recently brought up how I'd handle kids that make comments or don't react well to my disability and honestly, I hadn't even thought about it. I have my first peds rotation coming up in a few months and I just wanted to ask if anyone has been in this position or has any advice?",
        "created_utc": 1677584645,
        "upvote_ratio": 1.0
    },
    {
        "title": "Advantages of Microbrewer Use in ENT Instruments Surgery",
        "author": "jimymedical1",
        "url": "https://www.livepositively.com/Advantages-of-Microbrewer-Use-in-ENT-Instruments-Surgery/",
        "text": "",
        "created_utc": 1677584251,
        "upvote_ratio": 1.0
    },
    {
        "title": "match_and_dine",
        "author": "A_acarter",
        "url": "https://www.reddit.com/r/match_and_dine?utm_medium=android_app&amp;utm_source=share",
        "text": "",
        "created_utc": 1677583485,
        "upvote_ratio": 1.0
    },
    {
        "title": "Disposable Vaginal Speculum in The Emergency Room",
        "author": "jimymedical1",
        "url": "https://marketmagazinenews.com/disposable-vaginal-speculum-in-the-emergency-room/",
        "text": "",
        "created_utc": 1677583212,
        "upvote_ratio": 1.0
    },
    {
        "title": "😂😂😂😂this is crazy",
        "author": "Itz_dF",
        "url": "https://i.redd.it/626me0g2fyka1.png",
        "text": "",
        "created_utc": 1677582842,
        "upvote_ratio": 1.0
    },
    {
        "title": "EKG Question [VFib v Torsades?]",
        "author": "HeroesandCheerios",
        "url": "https://www.reddit.com/r/medicalschool/comments/11e2qeo/ekg_question_vfib_v_torsades/",
        "text": "How can you tell the difference between V Fib and Torsades on a telemetry strip? I'm bad at EKGs and they look similar? Just got a UWorld question wrong where I thought it was torsades so said next best step was Mag Sulfate; the answer was clearly defibrillation. Is the difference in the stem, or understanding the telemetry? Thank you?",
        "created_utc": 1677579958,
        "upvote_ratio": 1.0
    },
    {
        "title": "Which degrees are tougher Engineering or medicine?",
        "author": "ppnater",
        "url": "https://www.reddit.com/r/medicalschool/comments/11e1uf4/which_degrees_are_tougher_engineering_or_medicine/",
        "text": "If you could take the hardest classes from engineering and the hardest clases from medical school, which ones would be harder to learn?\n\n--Assuming for engineering you have a strong foundation in physics and calculus\n\n--Assuming in medicine you have a strong foundation in biology, biochemistry, and chemistry",
        "created_utc": 1677576560,
        "upvote_ratio": 1.0
    },
    {
        "title": "Where could I find medical equipment at a fair price?",
        "author": "Able_Hospital2114",
        "url": "https://www.reddit.com/r/medicalschool/comments/11e1olr/where_could_i_find_medical_equipment_at_a_fair/",
        "text": "Does anyone know a good website for stethoscopes (preferably littmann) that provides them at a good price?",
        "created_utc": 1677575932,
        "upvote_ratio": 1.0
    },
    {
        "title": "Suturing Masterclass: Free Subscription Link",
        "author": "MedSync",
        "url": "https://www.reddit.com/r/medicalschool/comments/11e1ocw/suturing_masterclass_free_subscription_link/",
        "text": "[removed]",
        "created_utc": 1677575908,
        "upvote_ratio": 1.0
    },
    {
        "title": "ADVICE!? I have no idea what any of this means...",
        "author": "LeightonBG",
        "url": "https://www.reddit.com/r/medicalschool/comments/11e123g/advice_i_have_no_idea_what_any_of_this_means/",
        "text": "[removed]",
        "created_utc": 1677573496,
        "upvote_ratio": 1.0
    },
    {
        "title": "looking for research opportunities",
        "author": "old_man78",
        "url": "https://www.reddit.com/r/medicalschool/comments/11e05rf/looking_for_research_opportunities/",
        "text": "[removed]",
        "created_utc": 1677570003,
        "upvote_ratio": 1.0
    },
    {
        "title": "Taking on multiple research projects at once?",
        "author": "MedAccount2019",
        "url": "https://www.reddit.com/r/medicalschool/comments/11dzb4k/taking_on_multiple_research_projects_at_once/",
        "text": "How bad of an idea is this? I sent out a few emails a few weeks ago, would wait a 3-5 days then send a few more. Well, some PIs from weeks ago barely replied now. I am interested in their work and they want to chat. I have agreed to another hop onto project with another PI already. How is adding 2 projects at once? Doable?\n\nI’ve been doing pretty well in classes and school.",
        "created_utc": 1677566852,
        "upvote_ratio": 1.0
    },
    {
        "title": "What to do with large gap between Clinicals and Residency",
        "author": "GroundbreakingAd8291",
        "url": "https://www.reddit.com/r/medicalschool/comments/11dyqid/what_to_do_with_large_gap_between_clinicals_and/",
        "text": "[removed]",
        "created_utc": 1677564795,
        "upvote_ratio": 1.0
    },
    {
        "title": "What are some tips you have for managing a busy schedule while preparing for Step 2 and juggling other responsibilities?",
        "author": "Gmedic99",
        "url": "https://www.reddit.com/r/medicalschool/comments/11dyksp/what_are_some_tips_you_have_for_managing_a_busy/",
        "text": "I just wanted to check in with all the other medical students out there and say hi! With Step 2 on the horizon, it can be hard to keep up with everything else life throws at us. I'm trying to balance my Internal Medicine rotation, my part-time job, and a recent breakup. It's been a lot, but I'm trying my best to take things one day at a time.\n\nI was wondering how you all are preparing for Step 2 while also taking care of other responsibilities in your lives. I'd love to hear any tips or advice you have!",
        "created_utc": 1677564245,
        "upvote_ratio": 1.0
    },
    {
        "title": "zhasglobals",
        "author": "Puzzleheaded-Ruin499",
        "url": "https://www.reddit.com/r/medicalschool/comments/11dxqyl/zhasglobals/",
        "text": "[removed]",
        "created_utc": 1677561522,
        "upvote_ratio": 1.0
    },
    {
        "title": "MS3",
        "author": "firepoosb",
        "url": "https://i.redd.it/ymeofe0b5vka1.png",
        "text": "",
        "created_utc": 1677561253,
        "upvote_ratio": 1.0
    },
    {
        "title": "Might have to remediate",
        "author": "Paputek101",
        "url": "https://www.reddit.com/r/medicalschool/comments/11dxmu5/might_have_to_remediate/",
        "text": "Just took my second (and final) immuno exam. I completely bombed the first one. I wasn't able to focus on any of the lectures or the exam itself. The second one went a lot better, but I still don't know if I got enough to pass the course. I was wondering if anyone has any advice. Currently an M1, was hoping to do EM. Thanks all",
        "created_utc": 1677561147,
        "upvote_ratio": 1.0
    },
    {
        "title": "Medical students whose parents are doctors...",
        "author": "gmdmd",
        "url": "https://v.redd.it/gjcif75k3vka1",
        "text": "",
        "created_utc": 1677560717,
        "upvote_ratio": 1.0
    },
    {
        "title": "Thoughts on VA HPSP?",
        "author": "Alternative_Point567",
        "url": "https://www.reddit.com/r/medicalschool/comments/11dxhsg/thoughts_on_va_hpsp/",
        "text": "I'm an MS2 and was just accepted to the Veterans' Affairs Health Professional Scholarship Program (VA HPSP). For those unfamiliar, you get a full-tuition scholarship that requires you to work at a VA facility for 1.5 years following residency per every 1 year of medical school that they pay for. Therefore, I would owe 3 years of work seeing that my M3-4 years are paid for.\n\nDoes anyone have any thoughts on how the award might impact residency matching? I plan to apply to a hypercompetitive specialty, and I wonder if the scholarship would have any significant effect on helping me stand out, or if it could possibly have any negative impacts.\n\nI ask since the conditions of the program state that I could be sent anywhere in the US to complete my 3 years at VA, and I won't know where until the end of residency. So, I have to decide if it's really worth it.\n\nAny thoughts?",
        "created_utc": 1677560692,
        "upvote_ratio": 1.0
    },
    {
        "title": "PM&amp;R questions",
        "author": "kiddiesmile",
        "url": "https://www.reddit.com/r/medicalschool/comments/11dxhoe/pmr_questions/",
        "text": "Hi there! Is there anyone I can privately message regarding questions about PM&amp;R? Thank you :)",
        "created_utc": 1677560680,
        "upvote_ratio": 1.0
    },
    {
        "title": "Away Rotations: Letter of Interest vs. Personal Statement",
        "author": "Slow-Ad4615",
        "url": "https://www.reddit.com/r/medicalschool/comments/11dx7ts/away_rotations_letter_of_interest_vs_personal/",
        "text": "[removed]",
        "created_utc": 1677559812,
        "upvote_ratio": 1.0
    },
    {
        "title": "Away Rotations: Letter of Intent vs. Personal Statement",
        "author": "Slow-Ad4615",
        "url": "https://www.reddit.com/r/medicalschool/comments/11dx6jk/away_rotations_letter_of_intent_vs_personal/",
        "text": "[removed]",
        "created_utc": 1677559699,
        "upvote_ratio": 1.0
    },
    {
        "title": "Inquiry: STEP 1 material for optional anatomy review sessions",
        "author": "panis69",
        "url": "https://www.reddit.com/r/medicalschool/comments/11dx2l0/inquiry_step_1_material_for_optional_anatomy/",
        "text": "[removed]",
        "created_utc": 1677559341,
        "upvote_ratio": 1.0
    },
    {
        "title": "Losing empathy: a follow up with my own experience",
        "author": "lateonarrival",
        "url": "https://www.reddit.com/r/medicalschool/comments/11dwtj6/losing_empathy_a_follow_up_with_my_own_experience/",
        "text": "[removed]",
        "created_utc": 1677558545,
        "upvote_ratio": 1.0
    },
    {
        "title": "failing everything. not sure what to do anymore",
        "author": "WitchWithDesignerBag",
        "url": "https://www.reddit.com/r/medicalschool/comments/11dwmdb/failing_everything_not_sure_what_to_do_anymore/",
        "text": "Title. Only passed anatomy first semester by a few decimals. Worked my ass off this prelim in this semester only to find out only 5 people passed out exam. I'm not going to give myself hope that I was one of those 5 people. If I fail anatomy for the year, I'm kicked out. I've failed every single block of neuroscience so far. Also failed biochemistry. I feel constantly suicidal. Getting yelled at every meeting by anatomy teacher and publicly shamed for my grades. Don't know what to do anymore.",
        "created_utc": 1677557900,
        "upvote_ratio": 1.0
    },
    {
        "title": "ERAS CV Format - submitted manuscripts",
        "author": "WorkedOutSoWell",
        "url": "https://www.reddit.com/r/medicalschool/comments/11dvk0m/eras_cv_format_submitted_manuscripts/",
        "text": "I need to submit a CV in similar format that will be required for ERAS CV. When listing works in progress or submitted manuscripts what is best format of this, and do I need to list all the authors even if there are \\~10?",
        "created_utc": 1677554678,
        "upvote_ratio": 1.0
    },
    {
        "title": "Need friends that complain less",
        "author": "Altruistic-Pair-746",
        "url": "https://www.reddit.com/r/medicalschool/comments/11dvcuh/need_friends_that_complain_less/",
        "text": "[removed]",
        "created_utc": 1677554093,
        "upvote_ratio": 1.0
    },
    {
        "title": "I am so scare of staircase, anyone know why?",
        "author": "drinkthecat",
        "url": "https://www.reddit.com/r/medicalschool/comments/11dv1sz/i_am_so_scare_of_staircase_anyone_know_why/",
        "text": "Is like every step are waving, I might gonna fall anytime.",
        "created_utc": 1677553226,
        "upvote_ratio": 1.0
    },
    {
        "title": "Has anyone use YOUsmle to help with reading comprehension strategies for the board exams? Any thoughts?",
        "author": "KenAdamsMD",
        "url": "https://www.reddit.com/r/medicalschool/comments/11dtqq5/has_anyone_use_yousmle_to_help_with_reading/",
        "text": "I feel my weakest part is reading comprehension/interpretation.",
        "created_utc": 1677549546,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why can't pulse rate be odd?",
        "author": "DrWhitecoatsyed",
        "url": "https://www.reddit.com/r/medicalschool/comments/11dtpb8/why_cant_pulse_rate_be_odd/",
        "text": "this question's been bothering me for a while now",
        "created_utc": 1677549434,
        "upvote_ratio": 1.0
    },
    {
        "title": "Did I shoot myself in the foot with a chance at a competitive specialty",
        "author": "crystalfire798",
        "url": "https://www.reddit.com/r/medicalschool/comments/11dtlyd/did_i_shoot_myself_in_the_foot_with_a_chance_at_a/",
        "text": "Currently interested in a pretty competitive surgical sub-specialty, but my clerkship grades are so far pretty sub-par (1 honors, 1 high pass, 2 pass) with one pass being in surgery (missed the high pass cutoff by a point rip). I’ve got a good amount of research with 10 pubs and a bunch of posters and abstracts, majority in general surgery but some in the specific field, and from a mid-tier US MD school. My step 1 was just a pass. I obviously know I’d have to kill the rest of my three rotations, step 2, and away rotations, but even with that, is my position basically a long shot for any realistic chance at a competitive surgical sub-specialty? Was considering DR as another possible option but that’s also becoming much more competitive too.",
        "created_utc": 1677549164,
        "upvote_ratio": 1.0
    },
    {
        "title": "Backing out of exec positions",
        "author": "wooshiemycoochie",
        "url": "https://www.reddit.com/r/medicalschool/comments/11dsil4/backing_out_of_exec_positions/",
        "text": "Got elected for a national position in a new organization I've not been involved with before bc I thought it looked cool and my grades are literally suffering because I feel like I'm working a part-time job at a startup on top of school. Deadlines are coming up for some positions in organizations I've been involved with throughout school and I'm second guessing running for things I've been excited about because of this one very stressful position that has me stressed more than school. I'm scared if I pull out, I'll have a bad reputation with some important doctors and have a harder time matching but I literally am wanting to go rural FM. This org has nothing to do with rural FM, if anything it's the opposite lol\n\n&amp;#x200B;\n\nPlz help does anyone have any similar experiences or advice",
        "created_utc": 1677546157,
        "upvote_ratio": 1.0
    },
    {
        "title": "Cureus site ,trying to publish this. Tried everything. any tips?",
        "author": "Economy-Ad5398",
        "url": "https://i.redd.it/hekjijhxutka1.png",
        "text": "",
        "created_utc": 1677545676,
        "upvote_ratio": 1.0
    },
    {
        "title": "Truelearn question writer",
        "author": "bbsm816",
        "url": "https://www.reddit.com/r/medicalschool/comments/11driiy/truelearn_question_writer/",
        "text": "Does anyone have experience as a question writer for the truelearn qbank? Was it worth it?",
        "created_utc": 1677543479,
        "upvote_ratio": 1.0
    },
    {
        "title": "What type of music do you study with (lyrical/non-lyrical/no music)",
        "author": "WillOfTheSon",
        "url": "https://www.reddit.com/r/medicalschool/comments/11dr9gs/what_type_of_music_do_you_study_with/",
        "text": "What type of music do you study with? I may make a poll to further clarify types of non-lyrical (like EDM vs. Classical) or types of lyrical depending on the results. I'm curious if I'm in the minority, which I expect based off what all my friends tell me.\n\n[View Poll](https://www.reddit.com/poll/11dr9gs)",
        "created_utc": 1677542802,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does anyone know where I can find the full image for this? It's in anking, I just want to be able to compare the blocked out version with the fully labeled image. I tried a reverse image search but can't find it.",
        "author": "Spicymango6969",
        "url": "https://i.redd.it/43ogyw8ultka1.jpg",
        "text": "",
        "created_utc": 1677542643,
        "upvote_ratio": 1.0
    },
    {
        "title": "Switching from ortho to IM",
        "author": "littlewaistbigpecs",
        "url": "https://www.reddit.com/r/medicalschool/comments/11dqzkh/switching_from_ortho_to_im/",
        "text": "Former ortho bro M3 here. Wanted to do ortho for the longest time but began feeling jaded about surgery and would prefer IM now. That led to me not getting the grades I’d need for ortho anyways (bunch of HPs and Ps). The weird thing is that I’ve been working in a couple ortho labs for several years and have 20+ ortho and gen surg publications. Do I need to do medicine research? Would IM programs think I’m dual applying and they are my second choice? What kind of IM programs am I destined for? Academic? Community? Top? Mid? Bottom?",
        "created_utc": 1677542100,
        "upvote_ratio": 1.0
    },
    {
        "title": "STEP 2 tips for mid student",
        "author": "nvuss",
        "url": "https://www.reddit.com/r/medicalschool/comments/11dqxzb/step_2_tips_for_mid_student/",
        "text": "I just finished rotations and will be taking STEP 2 in a month or so. Overall, I did pretty good on shelf as time went on except my lower scores are always in very general fields like FM/IM/surg when compared to more specific specialties like psych/peds/OB. I’m talking letter grades apart.\n\nI am not aiming for anything crazy on STEP 2. I’ll probably be good with anywhere from 245-250 tbh.\n\nAnyone have a similar issue and overcame it? Should I max out my strengths and stay mid on my weaknesses? Any tips, comments, advice is most welcome.",
        "created_utc": 1677541985,
        "upvote_ratio": 1.0
    },
    {
        "title": "When to start UW",
        "author": "TACOB34ST",
        "url": "https://www.reddit.com/r/medicalschool/comments/11dqwa0/when_to_start_uw/",
        "text": "Hello\n\nI am first year medical student I hear people say wait for dedicated other say start ASAP. The only problem with starting asap is that you’ll memorise the questions + answers. \n\nAny advice is appreciated. Thanks in advance.",
        "created_utc": 1677541862,
        "upvote_ratio": 1.0
    },
    {
        "title": "Advice for an older guy",
        "author": "Vio67",
        "url": "https://www.reddit.com/r/medicalschool/comments/11dqotu/advice_for_an_older_guy/",
        "text": " Good morning all,\n\nI’ve been wondering how best to ask these questions for awhile now, and figured that I should just get them out there and see what people in the field actually make of them. Apologies in advance if this isn’t the right forum to ask these questions in.\n\nSo the crux is I’m 37 years old and I would like to study medicine.\n\nI last graduated with a Bachelor degree in 2007 and I’ve spent the last 5 years working in IT. I’m pretty dissatisfied with the direction that my career and life are going in at the moment. The more I think about it, the more idea of being a doctor appeals to me.\n\nI’m trying to turn this appeal into a concrete series of steps to follow.\n\nNow the ask.\n\n1. Is 37 too old to study medicine and have a good career? I’m conscious of my age and I know I can’t turn back time, but am I too old to have a fulfilling career as a doctor?\n\n2. For any other mature age medical students, what was the transition back to study like and how did you prepare for it? I don’t have a family and I’m lucky not to have any debt, but any advice on how to balance work and study would be greatly appreciated.\n\n3. Again for mature age students, how hard did you find it to get into a medical degree? What were the steps that you took to prepare for it? I’ve already been told by one university that it’s been too long since I completed my Bachelor and they’d need me to go back and complete another one before I’d be eligible to apply for their medical program.  It’s got me somewhat dispirited, the idea of having to go back and complete another bachelor’s degree and I’m curious how other mature age students have tackled this.\n\nI’m an Aussie as well, so if anyone’s got specific experience with medical degrees from the land down under that would be great, but any advice would much appreciated.\n\nThanks in advance 😊",
        "created_utc": 1677541332,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to Win against the Anatomy Monster!",
        "author": "ImpossiblyLivid",
        "url": "https://www.reddit.com/r/medicalschool/comments/11dqf34/how_to_win_against_the_anatomy_monster/",
        "text": "I now have to learn and conquer this block which I don't want to admit that I'm struggling with but since this is something I have to face one way or another. \n\nWhat are some of the best resources for learning anatomy? I'm open to suggestions, big plus if it's a free resource because I'm broke for this month ~~because I bought myself a switch~~  \n\n\nAlso, I'm curious about how to effectively use these resources to make the most out of my study time. Are there any particular study techniques or strategies that work well for anatomy? How can I ensure that I'm retaining the information I learn?   \n\n\nThanks in advance! I would really appreciate any advice or recommendations you can give me.",
        "created_utc": 1677540638,
        "upvote_ratio": 1.0
    },
    {
        "title": "An ode to the angel who brings their personal TP to the hidden hospital bathroom",
        "author": "RufDoc",
        "url": "https://www.reddit.com/r/medicalschool/comments/11dq8lu/an_ode_to_the_angel_who_brings_their_personal_tp/",
        "text": "I’ve been using this bathroom for over a year now, even if it’s the furthest one from me me the hospital. I have walked 10 minutes to defecate in this particular bathroom. I can’t overstate how nice it is not to wipe with the stock toilet paper, which feels like they took scratch paper from the workroom. It’s honestly a miracle that patients don’t get fissures all the time. \n\nThis is just to express my gratitude to my anonymous Good Samaritan. Your secret is safe with me. \n\nAlso, I guess this is my first shitpost..\n\n(Dad humor)",
        "created_utc": 1677540183,
        "upvote_ratio": 1.0
    },
    {
        "title": "Research or Nursing",
        "author": "Virtual-Base-4186",
        "url": "https://www.reddit.com/r/medicalschool/comments/11dq7de/research_or_nursing/",
        "text": "[removed]",
        "created_utc": 1677540092,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can anyone explain what criteria people match into specialties by now?",
        "author": "BicarbonateBufferBoy",
        "url": "https://www.reddit.com/r/medicalschool/comments/11dq6oc/can_anyone_explain_what_criteria_people_match/",
        "text": "[removed]",
        "created_utc": 1677540044,
        "upvote_ratio": 1.0
    },
    {
        "title": "Ranking Prelim over categorical ??",
        "author": "UncleJ16",
        "url": "https://www.reddit.com/r/medicalschool/comments/11dpylf/ranking_prelim_over_categorical/",
        "text": "[removed]",
        "created_utc": 1677539481,
        "upvote_ratio": 1.0
    },
    {
        "title": "Ranking Preliminary over Categorical???",
        "author": "UncleJ16",
        "url": "https://www.reddit.com/r/medicalschool/comments/11dpxiw/ranking_preliminary_over_categorical/",
        "text": "[removed]",
        "created_utc": 1677539409,
        "upvote_ratio": 1.0
    },
    {
        "title": "I reported a PA for trying to pass herself off as a surgeon",
        "author": "the_hippocratic_oaf",
        "url": "https://www.reddit.com/r/medicalschool/comments/11dpcw8/i_reported_a_pa_for_trying_to_pass_herself_off_as/",
        "text": "My dad has been in the hospital for 20 days, and at this point my family and I are very well-acquainted with his physicians and surgeons. Over the weekend, a woman we had never met came in his room and introduced herself saying “Hi. I’m the person who did your surgery.” My mom and I looked at each other confused, because she was definitely not a surgeon we had met before. She went on to start talking about my father’s care, saying statements like “my team of nurses will do X” and “my partner surgeon, Dr. X, will be by tomorrow to see you.” I tried to look for a name and role on her badge, but it was covered up with a vital signs sheet. At this point, I said “Excuse me, but can you please clarify who you are?” And she said “I’m the person who did your father’s surgery.” I asked “So you’re a surgeon?” and she said “Well, I’m a PA, but I did the surgery.” I asked “Do you mean you assisted in the surgery?” and she replied condescendingly “Only two people have held your dad’s heart in their hands, and I’m one of them. I did the surgery.” \n\nI reported her to her department and the patient experience coordinator. I’m so tired of this. Med school has kicked my ass and I just don’t have the patience for people pretending to be doctors. Also, what a massive insult to the cardiothoracic surgeon who went through a million years of training to earn his position, and she’s out there taking credit for his surgeries.",
        "created_utc": 1677537980,
        "upvote_ratio": 1.0
    },
    {
        "title": "Graduating seniors who applied via ERAS and awaiting match day on March 17th, How did you choose your specialty?",
        "author": "stepneo1",
        "url": "https://www.reddit.com/r/medicalschool/comments/11doxt4/graduating_seniors_who_applied_via_eras_and/",
        "text": "Share us your journey!",
        "created_utc": 1677536970,
        "upvote_ratio": 1.0
    },
    {
        "title": "Tips for starting EM rotation?",
        "author": "ariamiller22",
        "url": "https://www.reddit.com/r/medicalschool/comments/11dofqx/tips_for_starting_em_rotation/",
        "text": "Any advise if appreciated",
        "created_utc": 1677535713,
        "upvote_ratio": 1.0
    },
    {
        "title": "Ugly Obgyn rotation",
        "author": "Coffeeinmedicine",
        "url": "https://www.reddit.com/r/medicalschool/comments/11dnz3d/ugly_obgyn_rotation/",
        "text": "[removed]",
        "created_utc": 1677534603,
        "upvote_ratio": 1.0
    },
    {
        "title": "Navigating Loans as a Medical Student",
        "author": "Astro_Artemis",
        "url": "https://www.reddit.com/r/medicalschool/comments/11dnt62/navigating_loans_as_a_medical_student/",
        "text": "Hi all, so I’m gearing up to attend medical school in the fall and have already filled out and submitted my FAFSA. I was awarded around $86K from combined unsubsidized and grad PLUS loans. This is enough to cover my tuition costs, but now am I left to seek out private loans to cover anything like meals, rent, etc? I’m just feeling a bit lost and I want to avoid being taken advantage of by having to sign up for loans with higher interest rates",
        "created_utc": 1677534202,
        "upvote_ratio": 1.0
    },
    {
        "title": "Honest Answer to Time Spent Studying or Doing Class Work",
        "author": "bmch",
        "url": "https://www.reddit.com/r/medicalschool/comments/11dnsvg/honest_answer_to_time_spent_studying_or_doing/",
        "text": "Hi all, I'm looking to get a honest sense of the amount of time you dedicate to class/studying/assignments in med school to help me with my future decisions. I was always interested in medicine, but for a variety of reasons went down a different career path after college and am currently an attorney looking to switch careers.\n\nRight now I am fortunate to be in a good place to do that -- my partner just got a tenure track professorship at a large state school and I would be able to enroll in a post bac and (hopefully) med school program for a significantly reduced rate. However I'm close to 40 and given past law school debts I really can't forego a salary. That being said I have a very sweet gig as a contract attorney and work maybe 2-3 hours a day and can easily afford my needs. Would med school allow for me to spend that time (even working 1 hr a day I could make enough to survive).\n\nI know med school would be difficult, but everyone said that about law school too, which it was, but my younger self definitely spent more than 2 hours most nights dicking around, not studying and going to the bars or hanging out with classmates and I did relatively well there.",
        "created_utc": 1677534184,
        "upvote_ratio": 1.0
    },
    {
        "title": "A question in pulmonology",
        "author": "Major-General-4411",
        "url": "https://www.reddit.com/r/medicalschool/comments/11dnetj/a_question_in_pulmonology/",
        "text": "Is Fowler segments considered a part of the posterior pulmonary lobe or is it the posterior lobe itself?",
        "created_utc": 1677533234,
        "upvote_ratio": 1.0
    },
    {
        "title": "Must have products or gadgets for surviving dedicated",
        "author": "fgh987",
        "url": "https://www.reddit.com/r/medicalschool/comments/11dn0vr/must_have_products_or_gadgets_for_surviving/",
        "text": "About to start 3 months of dedicated for step 1 and step 2 back to back. Give me all of your must have product recommendations and things to buy to help me get thru it (not study materials/resources). I mostly study on my couch but do have a comfortable task chair. \n\nLiterally anything: mug warmers, back massager, lap desk etc. All of your favorite products!",
        "created_utc": 1677532321,
        "upvote_ratio": 0.99
    },
    {
        "title": "Which one should I pursue?",
        "author": "Queasy_Mapp",
        "url": "https://www.reddit.com/r/medicalschool/comments/11dmtt7/which_one_should_i_pursue/",
        "text": "Like: direct patient care, work-life balance. \n\nDislike: surgery, research, night shifts, on-call. \n\nGender: F; Age: 30’s. \n\nResponsibility: have family to take care of. \n\nThanks\n\n[View Poll](https://www.reddit.com/poll/11dmtt7)",
        "created_utc": 1677531856,
        "upvote_ratio": 1.0
    },
    {
        "title": "FM applicants: how many Sub-I's are you doing?",
        "author": "concerned_bean",
        "url": "https://www.reddit.com/r/medicalschool/comments/11dm5q3/fm_applicants_how_many_subis_are_you_doing/",
        "text": "I'm not sure how many I should schedule. I have one set for August, waiting on another to get back to me for September. Is that enough? I see people at my school doing like 5-6 and I just don't think I have it in me to do that many lol\n\nObligatory: DO student, passed step and comlex, average clinical grades, average ECs, applying West Coast.",
        "created_utc": 1677530263,
        "upvote_ratio": 1.0
    },
    {
        "title": "Should I apply to General Surgery for the 2024 Match or take a research year?",
        "author": "PrizeAd4199",
        "url": "https://www.reddit.com/r/medicalschool/comments/11dkmm0/should_i_apply_to_general_surgery_for_the_2024/",
        "text": "Non-US IMG from a non-English speaking country with a **strong** interest in General Surgery. \n\n  \nStep 1: Pass; Step 2: 269 (was aiming for a higher score based on my self-assessments, but things didn't work out the way I'd hoped on exam day; ethics pulled my score down according to my score report. Nonetheless, grateful as it could've been worse). YOG: 2022. 3 pubs in general surgery (all international collaboratives; none as a first author). No USCE (trying to work on that). Spent the summers during my med school clinical years doing electives in general surgery in the UK (guess this could help show passion for the specialty). Ranked consistently in the top 10 of my year group and graduated in the top 5.   \n\n\nI know that as an IMG it's extremely competitive to match into general surgery, but is it possible to match into prelim surgery at a good university program with these credentials, or should I apply for a research position as soon as I can (and not wait for the 2024 Match)?",
        "created_utc": 1677526561,
        "upvote_ratio": 1.0
    },
    {
        "title": "Out of everyone in the operating theatre, who is making the most money?",
        "author": "Historical_Diet6376",
        "url": "https://www.reddit.com/r/medicalschool/comments/11djwry/out_of_everyone_in_the_operating_theatre_who_is/",
        "text": "[removed]",
        "created_utc": 1677524847,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is it better to reapply after a Prelim year vs Research Year?",
        "author": "DrH2OJr",
        "url": "https://www.reddit.com/r/medicalschool/comments/11djl7j/is_it_better_to_reapply_after_a_prelim_year_vs/",
        "text": "I’m trying to decide on whether it is worth ranking the prelim year programs on my list as separate entries aside from paired with advanced programs in the event I don’t match. Or have people seen more success after a research year? Thank you",
        "created_utc": 1677524093,
        "upvote_ratio": 1.0
    },
    {
        "title": "How often have you found people online claiming to be medical students when they clearly aren't?",
        "author": "katymp3",
        "url": "https://www.reddit.com/r/medicalschool/comments/11djcwk/how_often_have_you_found_people_online_claiming/",
        "text": "I'm always suspicious of people claiming they have expertise in anything online, especially given how easy it is for people to make random accounts at any time and use Google. Yet, people (probably trolls) will swear up and down that they're in the medical field no matter how much doubt you can express. Are there any dead giveaways you've found that reveal someone is lying about being in medical school? In your experience, how often has it turned out that the person claiming to be a student is just making stuff up? Any stories calling out people pretending are also encouraged.",
        "created_utc": 1677523527,
        "upvote_ratio": 1.0
    },
    {
        "title": "P/F or H/HP/P/F for clerkship grades?",
        "author": "1738firstclass",
        "url": "https://www.reddit.com/r/medicalschool/comments/11djc8o/pf_or_hhppf_for_clerkship_grades/",
        "text": "Hi everyone, I’m deciding between two schools and I’ve been leaning towards one with P/F for preclinical+clerkships (and no AOA) over the other with only P/F preclinical (has AOA) until a vascular surgeon I know told me “prestigious residency programs for competitive specialities want to see honors/AOA instead of just a pass”\n\nNow I’m thinking, could he be right? Honors and AOA could be a differentiating factor, but P/F will make my life easier right? Less competing and more time for research. I don’t know what to believe, what are your thoughts on what is more desirable based on your experiences?\n\nFor context, there is no significant difference in prestige between the two med schools here. I’d appreciate any help :)",
        "created_utc": 1677523487,
        "upvote_ratio": 1.0
    },
    {
        "title": "I absolutely despise the naming convention in medicine",
        "author": "crazyman2997",
        "url": "https://www.reddit.com/r/medicalschool/comments/11dj8jr/i_absolutely_despise_the_naming_convention_in/",
        "text": "[removed]",
        "created_utc": 1677523233,
        "upvote_ratio": 1.0
    },
    {
        "title": "I'm struggling with my first year of med school. and I'm honestly feeling depressed and not good enough. I need a pep talk and some advice.",
        "author": "pollo9869",
        "url": "https://www.reddit.com/r/medicalschool/comments/11dj5im/im_struggling_with_my_first_year_of_med_school/",
        "text": "Can someone please pep talk me. I need help studying. I am getting my ass beat in medical school. Like my mental health is legit going downhill. I'm tired everyday, I'm stressed everyday, I get migraines every other day. I can feel myself falling into a deep depression. This is gonna sound like venting. \n\nSo I'm not in American med school. I'm in an MD program out of the country but I'm American. This is all new to me. Nobody in my family has even gone to college. I'm barely 2 months into this, I'm a brand new freshman. \n\nToday was my third exam and I bombed it bad. Like I've been bombing all previous exams, I have 1 left before the block ends. On the first test I studied the way I did in undergrad. That doesn't work here so I amped it up with anki and reading before class, reviewing notes everyday, actively listening in lectures (I do my best since some teachers read 50 slides in 50 min). All of this and I still am doing bad on the exams. Like I understand the concepts but I'll have trouble understanding the nitty gritty. \n\nI'm beating myself up over all of this. My mental health is going downhill I can feel it. Like before an exam my anxiety Is through the roof, during an exam I feel miserable bc ik I'll do bad, after the exam I feel like someone just ran over me. Sometimes I feel like maybe I am just dumb, and I am not supposed to be here. Like is anything actually possible if you put your mind to it? \n\nAt this point I'm starting to realize that I'll most likely be repeating the block. Which gives me more anxiety bc I don't want to be in medical school for longer than 4 years. And then I'll like \"what if I'm wasting all this money\". So like I said, I read powerpoints, read before class, use anki, watch videos, review notes after class and it's still not clicking for me. I even go to tutoring in school. \n\nThe type of tests we have are crap. We get 50 multiple choice questions all A through E. These tests were told to us as being step 1 style. That way we have 2 years of taking exams that are up to par with step 1 when we actually have to take it. This is where I think is messing me up. The questions we get are things like \"a 49 year old patient has symptoms of ____. The patient is diagnosed with autism. Based on this where is the mutated gene located?\". Like I'm used to the teachers making questions using their powerpoints. These teachers just find some usmle questions related to whatever were learning, have it be genetics and immunology. And hope we can use what we learning in class to answer usmle style questions. \n\nThat's what I struggle with. It's like taking the mcat with your undergrad biology and chemistry notes. To me, I felt like what we learned in class in undergrad was not even close to the knowledge the mcat wanted. So again I feel like what I'm learning in med school through powerpoints and lectures is not even close to what the usmle wants, so how am I supposed to pass these types of exams every 2 weeks? \n\nSomeone please help. \n\nHere is a link for some of the questions we get. And this was a test for genetics and immunology... \n\nhttps://imgur.com/a/Ja7BDke",
        "created_utc": 1677523029,
        "upvote_ratio": 1.0
    },
    {
        "title": "How would you explain a 7 year gap in your application to a medical school that gives applicants scores based on productivity even when they were unemployment or not schooling?",
        "author": "uluzg",
        "url": "https://www.reddit.com/r/medicalschool/comments/11dj33s/how_would_you_explain_a_7_year_gap_in_your/",
        "text": " It has to have a self-employment aspect to it i.e. you used it to make a living. \n\nIt's the only Med school in my country so I don't have a choice. I was depressed, obese without any drive or vision; revealing that won't get me in.",
        "created_utc": 1677522871,
        "upvote_ratio": 1.0
    },
    {
        "title": "Which video resource for inflammation/injury/neoplasia?",
        "author": "jalijali24",
        "url": "https://www.reddit.com/r/medicalschool/comments/11disw7/which_video_resource_for/",
        "text": "Hello! I know pathoma is the goat for these topics but bootcamp is pretty new and probably updated on this so I was wondering if anyone who did pathoma and then bootcamp or just bootcamp in general for these topics recommend it or is pathoma still goat?\n\nThanks\n\n[View Poll](https://www.reddit.com/poll/11disw7)",
        "created_utc": 1677522200,
        "upvote_ratio": 1.0
    },
    {
        "title": "Best App for Anatomy?",
        "author": "LordhaveMRSA__",
        "url": "https://www.reddit.com/r/medicalschool/comments/11diorf/best_app_for_anatomy/",
        "text": "Title says it all. I’m about to tackle a beast of a block and I need all the help I can get.",
        "created_utc": 1677521930,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does this look like blepharitis?have woken up every few days for a few weeks with this swelling and redness and it’s itchy. I put Vaseline on it and it soothes it. Next day it’s gone and then randomly it comes back up. I woke up today like this so I wanted some advice please.",
        "author": "Moist_Inspection_298",
        "url": "https://i.redd.it/zlxl8lbpctka1.jpg",
        "text": "",
        "created_utc": 1677521504,
        "upvote_ratio": 1.0
    },
    {
        "title": "Memorising strategies",
        "author": "Major-General-4411",
        "url": "https://www.reddit.com/r/medicalschool/comments/11dielr/memorising_strategies/",
        "text": "I was wondering if u guys can share with us strategies you using to memorise large amount of infos at short and long term considering it’s something you have to deal with as a medical student",
        "created_utc": 1677521272,
        "upvote_ratio": 1.0
    },
    {
        "title": "Top IM programs, \"top\" applicant, research of a worm",
        "author": "SomewhatIntensive",
        "url": "https://www.reddit.com/r/medicalschool/comments/11di0b6/top_im_programs_top_applicant_research_of_a_worm/",
        "text": "Hey all, hoping some m4s and interns can chime in.\n\nI'm a \"top\" applicant from a no-name school. Top 5% of class, heavily involved in meaningful ECs and work, honored every rotation, and studying for Step 2 rn but have a high projected Step 2 score (260+).\n\nResearch though? Abysmal. Have like 1 poster and maybe 1 abstract before ERAS. \n\nHow does this affect me when applying to top IM programs like UPenn, UMich, Columbia, Cornell, Sinai, NYU, Wash, UCLA, BIDM etc etc assuming I get my in range Step 2 scores.\n\nShould I be doing aways at some of these places?",
        "created_utc": 1677520318,
        "upvote_ratio": 1.0
    },
    {
        "title": "Technology for medical school",
        "author": "Primary-Branch-7926",
        "url": "https://www.reddit.com/r/medicalschool/comments/11dhu14/technology_for_medical_school/",
        "text": "Hi all, I start medical school in 2 months and was wondering if I would be able to get through with a Surface Pro 9 or if there is anything that would require me to have an actual laptop/desktop? I love that I can easily take notes and use it as a computer but I don’t want to spend the money if it’s not allowed for certain steps in the degree.",
        "created_utc": 1677519883,
        "upvote_ratio": 1.0
    },
    {
        "title": "What Are Some Unique Hobbies You Guys Have?",
        "author": "TrailMixedd",
        "url": "https://www.reddit.com/r/medicalschool/comments/11dhsk4/what_are_some_unique_hobbies_you_guys_have/",
        "text": "What are easy hobbies to get into? I was gonna try crocheting but seems hard to do..",
        "created_utc": 1677519776,
        "upvote_ratio": 1.0
    },
    {
        "title": "Loans",
        "author": "haplessandhopeful",
        "url": "https://www.reddit.com/r/medicalschool/comments/11dgyfr/loans/",
        "text": "I'm approaching the end of MS2, and have received a document from the financial aid department reminding me that I've borrowed 101K in loans over the past 2 years \\*not counting\\* interest. \n\nI knew this. I've known this was going to happen ever since I saw my financial aid package before I started. But seeing it written it down so plainly hits differently. Plus with rising prices of everything related to cost of living is making me feel like I'm suffocating, because I don't see how I could cut back. \n\nPlease somebody remind me that I'm going to be able to realistically pay this off at some point? Please, please?",
        "created_utc": 1677517739,
        "upvote_ratio": 1.0
    },
    {
        "title": "Step 1 and 2 prep",
        "author": "Conscious_Prune9924",
        "url": "https://www.reddit.com/r/medicalschool/comments/11dgr45/step_1_and_2_prep/",
        "text": "[removed]",
        "created_utc": 1677517265,
        "upvote_ratio": 1.0
    },
    {
        "title": "Internal Medicine Prep Zoom Meeting and Intern year Q/A",
        "author": "leche1dura",
        "url": "https://www.reddit.com/r/medicalschool/comments/11dgjtl/internal_medicine_prep_zoom_meeting_and_intern/",
        "text": "[removed]",
        "created_utc": 1677516773,
        "upvote_ratio": 1.0
    },
    {
        "title": "How does this happen?",
        "author": "Ivebeendoingurmom",
        "url": "https://www.reddit.com/r/medicalschool/comments/11dgjaq/how_does_this_happen/",
        "text": "https://www.reddit.com/r/IAmA/comments/xo7a6/iama_a_28_year_old_who_has_been_told_he_may_not/\n\n\nHow can someone so young get this?",
        "created_utc": 1677516737,
        "upvote_ratio": 1.0
    },
    {
        "title": "I’m going to fail my surgery rotation",
        "author": "nightswatchman",
        "url": "https://www.reddit.com/r/medicalschool/comments/11dgg1y/im_going_to_fail_my_surgery_rotation/",
        "text": "I asked one of the fellows while tagging along on a consult if the patient’s penis had been resected, and she looked at me like I was a moron and was like “….No?” \n\nTurns out it was just small 💀",
        "created_utc": 1677516520,
        "upvote_ratio": 1.0
    }
]