[
    {
        "title": "Happens to all of us!",
        "author": "atanamayansantrafor",
        "url": "https://i.redd.it/e5zbo98g4qma1.jpg",
        "text": "",
        "created_utc": 1678372120,
        "upvote_ratio": 1.0
    },
    {
        "title": "RapidStop vs SICH tourniquet",
        "author": "FOAMista",
        "url": "https://youtu.be/d--9cTZPbWQ",
        "text": "",
        "created_utc": 1678368832,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to deal with people who think less of my acceptance because it’s a DO school?",
        "author": "dothrowaway2023",
        "url": "https://www.reddit.com/r/medicalschool/comments/11mro6c/how_to_deal_with_people_who_think_less_of_my/",
        "text": "[removed]",
        "created_utc": 1678367069,
        "upvote_ratio": 1.0
    },
    {
        "title": "What do y’all think about the Anti-Psychiatry sub?",
        "author": "balashaitankasaala",
        "url": "https://www.reddit.com/r/medicalschool/comments/11mq9n8/what_do_yall_think_about_the_antipsychiatry_sub/",
        "text": "[removed]",
        "created_utc": 1678362823,
        "upvote_ratio": 1.0
    },
    {
        "title": "Tips for Purchasing Gynecological Single Use Instruments",
        "author": "jimymedical1",
        "url": "https://blogswire.com/tips-for-purchasing-gynecological-single-use-instruments/",
        "text": "",
        "created_utc": 1678361947,
        "upvote_ratio": 1.0
    },
    {
        "title": "Usage and Selection of ENT Instruments",
        "author": "jimymedical1",
        "url": "https://thenyhour.com/usage-and-selection-of-ent-instruments/",
        "text": "",
        "created_utc": 1678361470,
        "upvote_ratio": 1.0
    },
    {
        "title": "Anyone with chronic disease?",
        "author": "user1822_",
        "url": "https://www.reddit.com/r/medicalschool/comments/11mplq2/anyone_with_chronic_disease/",
        "text": "[removed]",
        "created_utc": 1678360545,
        "upvote_ratio": 1.0
    },
    {
        "title": "What’s the worst piece of medicine you’ve seen someone do/suggest?",
        "author": "hotcrossbun56",
        "url": "https://www.reddit.com/r/medicalschool/comments/11mp7yb/whats_the_worst_piece_of_medicine_youve_seen/",
        "text": "Once had an EMT student seriously suggest applying a CAT tourniquet to the neck for a facial laceration with pulsatile bleeding…..",
        "created_utc": 1678359155,
        "upvote_ratio": 1.0
    },
    {
        "title": "Exam: anatomy, biochemistry about genetics",
        "author": "Commercial_Jury4933",
        "url": "https://www.reddit.com/r/medicalschool/comments/11mp7e4/exam_anatomy_biochemistry_about_genetics/",
        "text": "[removed]",
        "created_utc": 1678359096,
        "upvote_ratio": 1.0
    },
    {
        "title": "advice on building CV please (for peds or fm)",
        "author": "almostdoctorposting",
        "url": "https://www.reddit.com/r/medicalschool/comments/11moks9/advice_on_building_cv_please_for_peds_or_fm/",
        "text": "in summary i’m a US img (in europe) who is graduating this year. preparing for step 1 now, which i’ve pushed back multiple times. i got an email yesterday from the “ecfmg” website that they’ve closed application for pathway submission (proof of graduation for imgs as i understand it) for the match 2023 cycle. cue me freaking out all night 😔 i already was gonna take july to september just to get my application ready, but now i have a full other year before i can apply.\n\nwhile i prepare to take steps 1 and 2 i was planning on working as an MA, which i did for a year before med school. but i feel like this is a huge step backwards😔😔😔 i hate research but should i bite the bullet for a research job to pad my cv? or is that not needed for peds/fm? would being an MA be okay? or should i look into medical consulting or something? i’ve been looking for an observership too but theres so few in peds/fm \n\nany advice is helpful🙏🏻 i’m sooo disappointed in myself for pushing my step back and missing this damn deadline😞",
        "created_utc": 1678356755,
        "upvote_ratio": 1.0
    },
    {
        "title": "Mental health charity for medical students",
        "author": "letstalkwellbeing",
        "url": "https://www.reddit.com/r/medicalschool/comments/11mnvv3/mental_health_charity_for_medical_students/",
        "text": "[removed]",
        "created_utc": 1678354094,
        "upvote_ratio": 1.0
    },
    {
        "title": "School of Epidemiology &amp; Public Health, DMIHER, About Us, Wardha",
        "author": "dmiherdu",
        "url": "https://i.redd.it/qf3u55iuhnma1.jpg",
        "text": "",
        "created_utc": 1678340297,
        "upvote_ratio": 1.0
    },
    {
        "title": "For residents/attendings spying on the /medical school thread, what makes a Giga chad medical student in your opinion?",
        "author": "2Degen",
        "url": "https://www.reddit.com/r/medicalschool/comments/11mjywi/for_residentsattendings_spying_on_the_medical/",
        "text": "I am an MS3 applying anesthesia and I am genuinely curious what makes a medical student worthy of a god tier recommendation letter or eval. I have gotten shining eval from residents but meh ones from attendings.",
        "created_utc": 1678340169,
        "upvote_ratio": 1.0
    },
    {
        "title": "MS4 can’t sleep due to match anxiety",
        "author": "North-Hotel-5337",
        "url": "https://www.reddit.com/r/medicalschool/comments/11mjwkj/ms4_cant_sleep_due_to_match_anxiety/",
        "text": "Am I the only one who hasn’t had a good night sleep in months due to match stress? How is everyone dealing with the anxiety of match? I feel like these next few days are going to just be awful in anticipation. This is the first year I’m glad to have daylight savings as it gives us results on Monday an hour earlier lol.",
        "created_utc": 1678339954,
        "upvote_ratio": 1.0
    },
    {
        "title": "T-5 Sub-I as low-tier DO school M3",
        "author": "[deleted]",
        "url": "",
        "text": "[deleted]",
        "created_utc": 1678339736,
        "upvote_ratio": 1.0
    },
    {
        "title": "What resources do you guys use for studying the central nervous system?",
        "author": "Gullible-Ad9715",
        "url": "https://www.reddit.com/r/medicalschool/comments/11mjpb5/what_resources_do_you_guys_use_for_studying_the/",
        "text": "[removed]",
        "created_utc": 1678339308,
        "upvote_ratio": 1.0
    },
    {
        "title": "IMG in the dark",
        "author": "Wooden_Cat8564",
        "url": "https://i.redd.it/7d927h91toma1.jpg",
        "text": "",
        "created_utc": 1678338159,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is there a US medical schools that makes its recorded lectures and/or slides publicly available?",
        "author": "LimitlessAllTheWay",
        "url": "https://www.reddit.com/r/medicalschool/comments/11mj1ee/is_there_a_us_medical_schools_that_makes_its/",
        "text": "Hi! Was just looking online for a US med school that publishes its lectures/slides as some of the lectures at my school arent good. I searched online but couldn't find any. Would appreciate it if anyone has any info to share. Thanks!",
        "created_utc": 1678337294,
        "upvote_ratio": 1.0
    },
    {
        "title": "Definitely not",
        "author": "MaterialSuper8621",
        "url": "https://i.redd.it/hjkht47fooma1.jpg",
        "text": "",
        "created_utc": 1678336607,
        "upvote_ratio": 1.0
    },
    {
        "title": "Discussion on diversity in medicine and the mCAT",
        "author": "chairdesktree",
        "url": "https://www.reddit.com/r/medicalschool/comments/11mipuh/discussion_on_diversity_in_medicine_and_the_mcat/",
        "text": "I am a full-supporter of getting more Black and Hispanic people into medical school. Accomplishing this mission should not come at the expense of reducing standards, like eliminating the MCAT. Studies have shown that the MCAT is NOT a racist exam. To say that Black and Hispanic people cannot do well on the MCAT is such a racist thing to say, and I have no idea why people peddle this argument. I would hate the fact that people think I am incapable of doing well on it. \n\nI have worked with students and kids in the past, and there is nothing worse than expecting low standards from someone. When you tell people they are only worth so much or can only achieve so much, they WILL believe it. It's internalized immediately. Black and Hispanic people are in no way academically less capable than white or Asian students. Why are we assuming that they are? \n\ncitations: https://journals.lww.com/academicmedicine/fulltext/2013/05000/do_racial_and_ethnic_group_differences_in.19.aspx",
        "created_utc": 1678336339,
        "upvote_ratio": 1.0
    },
    {
        "title": "What do I need for med school?",
        "author": "DrOsteoblast",
        "url": "https://www.reddit.com/r/medicalschool/comments/11miks1/what_do_i_need_for_med_school/",
        "text": "[removed]",
        "created_utc": 1678335922,
        "upvote_ratio": 1.0
    },
    {
        "title": "Mind peeking at my COMLEX &amp; Step 1 plan?",
        "author": "MedicalMann",
        "url": "https://www.reddit.com/r/medicalschool/comments/11mi90w/mind_peeking_at_my_comlex_step_1_plan/",
        "text": "[removed]",
        "created_utc": 1678334954,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does AAMC FAP provide any discount to those applying via VSLO or ERAS?",
        "author": "stepneo1",
        "url": "https://www.reddit.com/r/medicalschool/comments/11mhsyz/does_aamc_fap_provide_any_discount_to_those/",
        "text": "I can't imagine those FAP applicants getting out of  their SES once they started medical school.",
        "created_utc": 1678333652,
        "upvote_ratio": 1.0
    },
    {
        "title": "Away Rotations Question",
        "author": "itsmiinh",
        "url": "https://www.reddit.com/r/medicalschool/comments/11mhd44/away_rotations_question/",
        "text": "[removed]",
        "created_utc": 1678332401,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do i convince an actively psychotic patient to take their medication in the hospital?",
        "author": "Chianie",
        "url": "https://www.reddit.com/r/medicalschool/comments/11mha4e/how_do_i_convince_an_actively_psychotic_patient/",
        "text": "Tomorrow's the last day of my psychiatry rotation, and my attending wants me to talk to a schizophrenia patient in the inpatient psychiatry unit. Without giving too much info, the patient is delusional, has very poor insight, and is refusing to take ANY medications, including their antipsychotics, for various reasons related to their delusions. The patient also really wants to be discharged (but they're on a psych hold).\n\nClearly, I can't lie or play into the patient's delusions. I don't want to just tell the patient their delusions are false because I might lose their trust. I also don't want to ignore the patient's concerns though.\n\nSo my plan is to acknowledge the patient's concerns \"I see... that sounds very scary/difficult for you... etc\". Then I will kinda barter with the patient by saying something like \"Unfortunately we can't let you go until you start to get better. And I believe that these medications will improve your condition so we can let you leave sooner\"\n\nDoes that sound like a good plan? Any advice for how to talk to this patient? How should I respond if they accuse me of trying to poison them or something? I would appreciate specific phrases or questions to impress my attending lol",
        "created_utc": 1678332168,
        "upvote_ratio": 1.0
    },
    {
        "title": "Need some motivation. We are just over a week away from match day. How do I function? How do I meditate? I'm in a constant state of anxiety and my hands are so shakey.",
        "author": "biganeurysmboi",
        "url": "https://www.reddit.com/r/medicalschool/comments/11mgwd1/need_some_motivation_we_are_just_over_a_week_away/",
        "text": "[removed]",
        "created_utc": 1678331104,
        "upvote_ratio": 1.0
    },
    {
        "title": "Need advice on when to take Step/Comlex this summer (OMS3)",
        "author": "LavCrizal",
        "url": "https://www.reddit.com/r/medicalschool/comments/11mgkbl/need_advice_on_when_to_take_stepcomlex_this/",
        "text": "Currently an OMS3, I decided a bit late that I want to apply radiology and need to take Step 1 &amp; 2 (and Comlex 2, but not as worried about that) this summer. I have a fairly light rotation schedule from now to the end of June, and a 4 week dedicated period in July. Starting auditions in August. I’ve been doing average to above average on my comats thus far, and about 2/3rds done with UW Step 2 with a \\~50% average for reference.\n\nAny advice or feedback on how to schedule these two exams? Step 1 before Step 2? Or Step 2 before Step 1? Thanks in advance.",
        "created_utc": 1678330212,
        "upvote_ratio": 1.0
    },
    {
        "title": "Advice needed on when to take Step 1/2",
        "author": "LavCrizal",
        "url": "https://www.reddit.com/r/medicalschool/comments/11mge1w/advice_needed_on_when_to_take_step_12/",
        "text": "[removed]",
        "created_utc": 1678329743,
        "upvote_ratio": 1.0
    },
    {
        "title": "You may think they’re filtered out by interviews, but you’re wrong.",
        "author": "Shonuff_of_NYC",
        "url": "https://v.redd.it/ew52dl303oma1",
        "text": "",
        "created_utc": 1678329410,
        "upvote_ratio": 1.0
    },
    {
        "title": "working while in clinicals?",
        "author": "DesignRemarkable5985",
        "url": "https://www.reddit.com/r/medicalschool/comments/11mfyoy/working_while_in_clinicals/",
        "text": "[removed]",
        "created_utc": 1678328558,
        "upvote_ratio": 1.0
    },
    {
        "title": "Unvaccinated..",
        "author": "Hot-Health-37",
        "url": "https://www.reddit.com/r/medicalschool/comments/11mfxzh/unvaccinated/",
        "text": "[removed]",
        "created_utc": 1678328506,
        "upvote_ratio": 1.0
    },
    {
        "title": "Diary of an OMS III with no home program",
        "author": "msg543",
        "url": "https://www.reddit.com/r/medicalschool/comments/11mfn2r/diary_of_an_oms_iii_with_no_home_program/",
        "text": "5:17 am: Jolt awake to the sound of a loud knock on my window. “You can’t park here!” says the homeless crackhead. \n\n5:18: Drive my car to the other side of the Walmart parking lot.\n\n5:20 am: Cry because I live in my car.\n\n5:21 am: Compare self to MD student counterparts with a home program.\n\n7:30 am: Brush teeth and splash bath in clinic bathroom sink.\n\n8:00 am: Tell my attending I’m a 3rd year medical student for the 15th time.\n\n8:13 am: Explain to MD attending why I didn’t attend a more reputable medical school.\n\n8:33 am: Listen to attending explain why it’s important to get big academic hospital experience.\n\n8:34 am: Choke back tears.\n\n8:45 am: Check school email. They did not attain affiliation agreement for my next rotation and somehow this is my fault even though I sent in the paperwork 6 months ago.\n\n9:02 am: Patient presents to federally qualified healthcare clinic with LBP.\n\n9:03 am: Ask patient if they would like a colonoscopy, shingles shot, mammogram, flu shot, another covid shot, tdap shot.\n\n9:23 am: Let patient leave without OMM.\n\n9:25 am: Complete patient log saying I performed muscle energy, BLT, and HVLA.\n\n3:00 pm: Mandatory student achievement zoom where we are told there’s no reason to consider anything whatsoever beyond primary care.\n\n3:07 pm: Student achievement team suggests we become involved in the community despite changing communities monthly to complete rotations in other communities.\n\n5:42 pm: Sit in Starbucks parking lot to leech off Wifi. Complete 20 UWorld questions with 30% accuracy.\n\n5:44 pm: Compare self to MD student counterparts with a home program.\n\n5:23 pm: Cry because I live in my car as an OMS III without a home program.\n\n7:58 pm: Complete OMM assignment where I lie about all the OMM I’ve been practicing during my family med rotation.\n\n8:05 pm: Group text med school friends who I never see because they live 5,000 miles away because they too are at a DO school without a home program.\n\n8:23 pm: Pop tart dinner.\n\n9:00 pm: Find a place to sleep for the night in Walmart parking lot.\n\n10:11 pm: Read article about DO who didn’t match and now works in health insurance.\n\n10:35 pm: Recline seat and drift off knowing that any nightmares awaiting me are not as bad as those I endure as an OMS III without a home program.",
        "created_utc": 1678327682,
        "upvote_ratio": 1.0
    },
    {
        "title": "I'm so tired",
        "author": "ChocRaspMochi",
        "url": "https://www.reddit.com/r/medicalschool/comments/11mfcr6/im_so_tired/",
        "text": " Current M2 and sometimes I don't even know what I'm grinding for anymore. Everything is piling up on me. STEP1 is coming up in a few months for me and studying seems like a bottomless vortex and I still have so much I don't know.\n\nMy research is also going nowhere - I have multiple pubs in the pipeline, but I still feel so behind because all of them are moving so slowly, mostly because of me. I just can't find the time to work on these projects now that Step studying is in full swing. I'm sure I'm a disappointment to my mentors - all of them are nice and haven't rushed me or looked for constant updates in my progress, but I feel so bad for not delivering like I promised. I look at all my classmates going to conferences and publishing left and right, and I wonder if I'm just not cut out for this.\n\nI was gunning for a very competitive specialty but I'm not even sure if I want it anymore - could I do something else that could make me just as happy without me needing to push it in the research rat race? I'm honestly so unhappy day-to-day because of everything I know I need to do but don't have time to do - if this specialty brings me no joy, is it even worth chasing?\n\nI'm so sorry for all the negativity - I just feel like I'm truly lost. Would appreciate any and all suggestions/advice/support, and best of luck to those who are in a similar situation &lt;3",
        "created_utc": 1678326929,
        "upvote_ratio": 1.0
    },
    {
        "title": "I suck at suturing",
        "author": "3romuculus",
        "url": "https://www.reddit.com/r/medicalschool/comments/11mewfa/i_suck_at_suturing/",
        "text": "I practice a good bit at home because I want to be good at it but when its my time to shine in the OR I fumble the bag so hard. Sub-cuticular running? puncture the skin. You want me to close that lil port hole? drop the pickups. Surely a simple interrupted will do? bent the needle. I think I am getting a little better? prob not.",
        "created_utc": 1678325691,
        "upvote_ratio": 1.0
    },
    {
        "title": "Niche subspecialties rushing to post their “diaries” to karma pharm and humble brag",
        "author": "MemeDoctor96",
        "url": "https://i.redd.it/x4y4jgllonma1.gif",
        "text": "",
        "created_utc": 1678324561,
        "upvote_ratio": 1.0
    },
    {
        "title": "M4 who applied general surgery- AMA",
        "author": "surg4life",
        "url": "https://www.reddit.com/r/medicalschool/comments/11me9yc/m4_who_applied_general_surgery_ama/",
        "text": "M4 who applied Gen surg and is being very unproductive. AMA",
        "created_utc": 1678324045,
        "upvote_ratio": 1.0
    },
    {
        "title": "my first old school experience",
        "author": "Responsible_Tang",
        "url": "https://www.reddit.com/r/medicalschool/comments/11mduqg/my_first_old_school_experience/",
        "text": "Okay, so a bit of context I'm in the middle of my very first clinical rotations, and got my very first old school doctor, she's clearly been around for some time, and I feel absolutely miserable, I don't know how to explain, it feels like she has a lot to teach me, but it's. Just. Not. Getting. Through. \n\nI really have a passion for this thing, I wanted to live and die doing this, but for the very first time I feel so done, she is rude for the sake of being rude, dry and generally unpleasant, pimps me all the time and I just get the feeling she just doesn't want to be there, and I feel like I'm doing something wrong, but I don't want that so I need help what do I do?\n\nI've tried to ignore it and be pleasant despite everything, I tried studying hard to know all the answers to the pimp questions, I tried being super early, ir always on time, I tried speaking a lot, not speaking so much, and even not speaking at all just shaking and nodding...\n\nI know it may sound menial, maybe it does, maybe it even is, but it's really bothering me It feels like I'm stupid or doing somethingdeeply wrong, it's not like it's just me but it feels harsher you know?",
        "created_utc": 1678322981,
        "upvote_ratio": 1.0
    },
    {
        "title": "Diary of a 4th Year Medical Student on Their Last Brain Cell",
        "author": "Chediak-Tekashi",
        "url": "https://www.reddit.com/r/medicalschool/comments/11mdsj6/diary_of_a_4th_year_medical_student_on_their_last/",
        "text": "7:00 am: Alarm goes off telling me to wake up. I don’t. I set my next alarm for 7:30 and snuggle back into my covers. \n\n7:30 am: Second alarm goes off. I tell myself ten extra minutes will be fine as long as I skip my lengthy skincare routine. I go back to sleep. \n\n7:40 am: Third alarm goes off. I wake up. \n\n7:50 am: I actually get out of bed once I finish scrolling through pasta recipes on the gram. \n\n8:00 am: I do that lengthy skincare routine I told myself I wouldn’t do. I’m fucking glowing baby. \n\n8:30 am: I was supposed to be at the hospital by 8:30 but it’s already 8:30 so I send a mobile order to Starbucks. Grande iced brown sugar shaken espresso and a bacon gouda sandwich. If I’m gonna be late might as well be hella late. \n\n9:00 am: Arrive to hospital and print out the patient list. I ask the third year if there’s any new admits. They say yes. I tell them I forgot my stethoscope so I’ll join them for the new patients and help with the HPI if needed. \n\n9:02 am: Steal paper out of the nursing station’s printer because I haven’t brought my notebook since November of 2021. I also find a dusty planet fitness pen missing it’s cap behind the printer. It still writes tho. I steal it. \n\n9:25 am: New patients are seen. \n\n9:30 am: We begin rounding with the attending. Today we’re with the young and chill attending that’s fresh out of fellowship with the shredded biceps. I already know it’s going to be a good day. \n\n9:34 am: Attending asks me what’s on my differential for this 54 y.o. patient with history of alcohol abuse, tobacco use, obesity, and uncontrolled diabetes that’s experiencing decreased sensation in their legs. I blank out because I haven’t been asked a real question since before my audition rotations. I blurt out B12 deficiency and nothing else. Attending stares then turns to the third year for other supporting answers. \n\n9:40 am: I fill in every “O” and “0” on my list with the planet fitness pen because it writes so smoothly and satisfyingly. Attending thinks I’m taking notes during rounds. \n\n10:35 am: Rounding ends. Attending spends the next ten minutes rubbing his biceps and telling us about his latest financial investments. States how you can never become rich from just being a doctor, only comfortable. We agree NFTs are for suckers. And that Hokas shit on Ultraboosts. Third year doesn’t say a word this entire time because they’re scared to clown with the attending. \n\n10:50 am: We go back and sit at the empty nurses station. I offer to do all the new patient notes so we can finish faster. \n\n11:06 am: I go on my phone and open Reddit to read the latest neurotic posts on r/Residencymatch2023. \n\n11:07 am: Third year asks me for help on how to set up their elective rotations. I say “VSLO is such a mess dude I swear I don’t even remember.” \n\n11:08 am: Third year asks me for advice on what resources they should buy for Step 2 and if they should do Sketchy again along with buying the First Aid Step 2 book. I respond “Nah you’re doing too much. Just get UWorld and finish the question bank.”\n\n11:09 am: I’m mentally drained from this mornings grueling work. Famished. Exhausted. Parched. I ask the third year if we should go ask the attending what else we can help with in the hopes of getting dismissed. They say uhh let’s wait till after lunch then ask. \n\n11:10 am: I walk over to the attending’s office and ask him if he needs anymore help with notes or other tasks. He says no and to head home for the day. I go back and tell the third year. He looks at me like I’m a Greek God when I say we can go home. \n\n11:11 am: I hide the crusty planet fitness pen back behind the printer so I can use it again tomorrow. I recycle the paper I stole from the nurses’ printer drawer because I didn’t write down a single thing on it. \n\n11:15 am: I go to the Starbucks in the hospital and cop myself another bacon gouda sandwich for the drive home. \n\n12:00 pm: Arrive back home. At this point I am drained and overworked. Immediately head upstairs to bed. I nap for three hours.",
        "created_utc": 1678322814,
        "upvote_ratio": 1.0
    },
    {
        "title": "Follow me for more helth tips",
        "author": "GulliblePrick",
        "url": "https://i.redd.it/socbdvq6inma1.jpg",
        "text": "",
        "created_utc": 1678322404,
        "upvote_ratio": 1.0
    },
    {
        "title": "Diary of an MS4 on a mandatory rotation",
        "author": "highondankmemes420",
        "url": "https://www.reddit.com/r/medicalschool/comments/11mdl5k/diary_of_an_ms4_on_a_mandatory_rotation/",
        "text": "0500: first alarm. fuck me, fuck my school for this requirement, fuck my team for NOT being cash money about this rotation\n\n0520: snooze my 14th alarm\n\n0530: shower (maybe)\n\n0600: grab coffee on my way in, cursing my fucking luck at the team I was assigned to for this bullshit rotation on a specialty I have 0 interest in\n\n0630: pull in, start chart checking while contemplating this rotation being my 13th reason why\n\n0700: finish seeing my patients, jot down illegible scribble on my paper and hope I can remember what I wrote when I have to present\n\n0730: more bullshit\n\n0830: finally round, listen to nonstop mouth diarrhea about electrolytes and pontification on treatment instead of, idk, just treating; scroll through r/buildapcsales looking for computer parts I don’t need and can’t afford; contemplate buying a 1 way plane ticket to New Zealand and becoming a hobbit\n\n1230: finish rounding; contemplate 5150’ing myself\n\n1245: eat lunch\n\n1300: crack out the shittiest notes I’ve written\n\n1400: ???\n\n1500: attending wants to do teaching, I pretend I’m not about to spontaneously combust, although I wish I would\n\n1530: attending still rambling, I’m pretty sure I’ve either dissociated or stroked out because it all sounds like word salad at this point\n\n1600: sell my soul to the devil in return for making it all stop; looks like it worked, gotta figure out what I’m selling him tomorrow\n\n1601: leave\n\n1630: finally home, 1st drink of the day\n\n1630: 2nd drink\n\n1631: jerk off\n\n1631: 3rd drink, order Uber eats while I boot up my ps5\n\n1635: 4th drink\n\n1900: wake up, my food has been outside for nearly 3 hours and is soggy. 5th drink. Play video games\n\n2300: sleep, go through my list of excuses to not come in before realizing I’ve used them all already\n\n2301: cry myself to sleep",
        "created_utc": 1678322297,
        "upvote_ratio": 1.0
    },
    {
        "title": "My Significant Other was Admitted into medical school. Pls help with gift ideas 🙏🏼",
        "author": "notseriousenough1",
        "url": "https://www.reddit.com/r/medicalschool/comments/11mdj8c/my_significant_other_was_admitted_into_medical/",
        "text": "My girlfriend got into med school and our anniversary is around the corner, do you guys have any suggestions on what I can get her that would be very useful or a necessity for med school? I greatly appreciate any insight or suggestions you guys could offer. Thank you and feel free to dm me for any additional details :)",
        "created_utc": 1678322159,
        "upvote_ratio": 0.99
    },
    {
        "title": "dang I didn't realize I had fungus floating in my eyes",
        "author": "bedpanAI",
        "url": "https://www.reddit.com/r/medicalschool/comments/11md93x/dang_i_didnt_realize_i_had_fungus_floating_in_my/",
        "text": "/s\n\nhttps://preview.redd.it/4dmzom7pxlma1.jpg?width=495&amp;format=pjpg&amp;auto=webp&amp;v=enabled&amp;s=cffeca20dfd8b00ab2184f49d80f6b64713135f0",
        "created_utc": 1678321451,
        "upvote_ratio": 1.0
    },
    {
        "title": "scared of malpractice?",
        "author": "ActuallyHockey",
        "url": "https://www.reddit.com/r/medicalschool/comments/11md86p/scared_of_malpractice/",
        "text": "[removed]",
        "created_utc": 1678321381,
        "upvote_ratio": 1.0
    },
    {
        "title": "Best medical advice from Dr. Scat",
        "author": "Impressive_Syrup_918",
        "url": "https://www.reddit.com/r/medicalschool/comments/11mctke/best_medical_advice_from_dr_scat/",
        "text": "[removed]",
        "created_utc": 1678320379,
        "upvote_ratio": 1.0
    },
    {
        "title": "NBME SA- Not able to access?",
        "author": "Best_Competition_867",
        "url": "https://www.reddit.com/r/medicalschool/comments/11mcs83/nbme_sa_not_able_to_access/",
        "text": "Anyone else unable to access an NBME form they just bought? Just bought 2 forms for OB and unable to access despite having it under my account + confirmation emails. Doesn't have any green button that says \"start your assessment\"",
        "created_utc": 1678320293,
        "upvote_ratio": 1.0
    },
    {
        "title": "Match day, gift idea",
        "author": "Wonderful-Ad9638",
        "url": "https://www.reddit.com/r/medicalschool/comments/11mcpma/match_day_gift_idea/",
        "text": "I have a family member in med school. With match day coming up, what is a good gift to get them for match day?",
        "created_utc": 1678320107,
        "upvote_ratio": 1.0
    },
    {
        "title": "How have, or how did, people react when you told them you got into medical school?",
        "author": "KissMyAsthma3",
        "url": "https://www.reddit.com/r/medicalschool/comments/11mcis8/how_have_or_how_did_people_react_when_you_told/",
        "text": "I’ve had some pretty different reactions from people after telling them my news and I was wondering if other people were having a similar experience or have had a similar experience.",
        "created_utc": 1678319647,
        "upvote_ratio": 1.0
    },
    {
        "title": "How hard is the USMLE and the whole process of starting residency in the US as am IMG?",
        "author": "Matt01116",
        "url": "https://www.reddit.com/r/medicalschool/comments/11mchrc/how_hard_is_the_usmle_and_the_whole_process_of/",
        "text": "[removed]",
        "created_utc": 1678319577,
        "upvote_ratio": 1.0
    },
    {
        "title": "Research in med school? Resources",
        "author": "DDD_232",
        "url": "https://www.reddit.com/r/medicalschool/comments/11mbgs0/research_in_med_school_resources/",
        "text": "[removed]",
        "created_utc": 1678317161,
        "upvote_ratio": 1.0
    },
    {
        "title": "Am I hard of hearing? Auscultation help.",
        "author": "StormyRuler",
        "url": "https://www.reddit.com/r/medicalschool/comments/11mavjf/am_i_hard_of_hearing_auscultation_help/",
        "text": "MS1 here. I'm not sure if I just have bad auscultation technique or am hard of hearing. I have not been able to hear a single heart sound on the majority of people/patients I've listened to. I can't hear heart sounds on myself at all after trying for hours over multiple days, even though I can feel my apical impulse. I haven't noticed being hard of hearing before, but I know I have intermittent tinnitus and I spent probably 10 years of my life going to super loud punk shows without ear plugs (oops).\n\nI have a Littman Cardiology IV (school-provided). I can hear the diaphragm while scratching it very lightly with my finger. I've tried changing to the smaller ear plug size with no difference. I tried blowing through one ear piece with the other closed to make sure the diaphragm is in tact. I tried squeezing the ear tubes together with the other hand to get a tighter fit in my ears, but that just made me start hearing a pulsing tinnitus in my right ear with no change in the left ear.\n\nAny thoughts on what I should do next? Are the amplifying and/or electronic stethoscopes legit? Should I talk to my school? Should I ask my PCP about seeing audiology?",
        "created_utc": 1678315836,
        "upvote_ratio": 1.0
    },
    {
        "title": "Unable to review NBME self assessment",
        "author": "shwangsta",
        "url": "https://www.reddit.com/r/medicalschool/comments/11matgg/unable_to_review_nbme_self_assessment/",
        "text": "Hi all,\nI recently completed a practice NBME but as shown here I am unable to open it up to review it! Has anyone else experienced this and how did you fix it?",
        "created_utc": 1678315704,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is medical school REALLY that bad...",
        "author": "wanie444",
        "url": "https://www.reddit.com/r/medicalschool/comments/11madmu/is_medical_school_really_that_bad/",
        "text": "[removed]",
        "created_utc": 1678314686,
        "upvote_ratio": 1.0
    },
    {
        "title": "Post for an M3 that needs some honesty about matching chances",
        "author": "interruptingc0wMoo",
        "url": "https://www.reddit.com/r/medicalschool/comments/11m9x4f/post_for_an_m3_that_needs_some_honesty_about/",
        "text": "So he (USMD) wants to do a surg specialty, but he has a sub 200 Step 1. He also failed a course (preclinical, made up in summer). He’s passed all his shelves just fine and honored some rotations, high pass in surgery. Step 2 is unknown. \n\nLots of volunteering and some research but no publications. Has some work (nonclinical) from before school. He’s a great person and will likely have a strong PS and good letters but the step score and preclinical failure are definitely red flags. He’s apprehensive but wants to move ahead with it anyway and have gen surg as his backup… he wants unbiased opinions and doesn’t trust the school right now.\n\nDoes he have any sort of a chance or if he doesn’t have a different back up will he find himself likely to 🧼 next year?",
        "created_utc": 1678313648,
        "upvote_ratio": 1.0
    },
    {
        "title": "Questioning whether becoming a doctor is worth it",
        "author": "Pretend-Spot-9471",
        "url": "https://www.reddit.com/r/medicalschool/comments/11m99vn/questioning_whether_becoming_a_doctor_is_worth_it/",
        "text": "[removed]",
        "created_utc": 1678312134,
        "upvote_ratio": 1.0
    },
    {
        "title": "Diary of Peds ED Sick Call",
        "author": "Notagunner96",
        "url": "https://www.reddit.com/r/medicalschool/comments/11m96w2/diary_of_peds_ed_sick_call/",
        "text": "\n7:00pm- On sick call this week. Currently gardening. Phone rings. Caller ID- “The Devil”. It’s the chief calling me in. I let it go to voicemail. Listen to voicemail. “Hey, peds resident #69 called in sick last minute, you have to cover the peds ED tonight. Shift starts at 8pm. I know it’s late so I’ll let you start at 8:05. Call me back”. Call back and let them know I’ll be there. \n\n7:15pm- Pick out peds ED outfit for the night. I choose my Looney Toons scrub cap, maroon scrubs, custom yellow Patagonia vest, and Toe Shoes. Kids love goofy outfits. \n\n8:00pm- Pull up to hospital. Pull out old parking ticket and put it under windshield wipers so I can park in the closer lot. \n\n8:15pm- Stock up on vending machine food. Toss in a Zynyrd Skynyrd and head down to peds ED. Say hey to PGY-5 Med-Peds resident. Tell them chief gave me til 8:30 but didn’t want them to stay too late so I came early.\n\n8:30pm- Med-Peds resident finishes signout on their two active patients. Dissociated while they talked about the rare syndrome they think one of the kids has, but I catch that one is pending appy rule-out, other is dislocated finger who has been here 5 hours and they were waiting for ortho to come and reduce while the attending is going to sedate. There are 6 waiting to be seen. Two are simple adult URIs they put back because the adult ED is overwhelmed. I don’t say anything, but Med-Peds apologizes profusely as they run out the door saying something about how they don’t see adults. They’ve signed a 5 year contract as an attending on our adult medicine teaching service. \n\n9:00pm- I’ve seen the 6 new ones. \n\nOne adult is shocky and needs sepsis workup. Nurse puts LMX on their right AC, left hand, and right temple. \n\nSecond adult eloped. Triage doesn’t remember if they placed an IV.\n\nTwo kids are URIs and parents heard we do viral testing. #1 has rhinovirus, mom says Urgent Care gave Meropenem and transferred by ambulance for admission for septic shock from double ear infection. Discharge. \n\nKid 2 coughs in my face. I ask mom to mute the tv while we talk. She turns it up higher. Kid Has both Strep and Mono. Dad says he thinks he has the flu and asks for a swab. \n\nKid 3 has a shunt with a seizure. And the last is there for “decreased appetite and bloody stools” by ambulance. Their mouth is covered with what I hope is chocolate while eating Flaming Hot Cheetos. They rub some on my arm. It’s not chocolate.\n\n9:30pm- I discharge Dad, explaining I don’t prescribe Codeine for the flu. They turn down Tamiflu, mumble about Big Pharma profits and how their PCP, Dr. Karen APRN HGTV already called them in Tylenol 3 + Z-Pack + a Medrol Dose Pack. \n\n9:45pm- Called by peds surgery yelling at me about how the appy rule out doesn’t have an appendix, it was removed a year ago. But to admit to them for serial exams. I never paged them. \n\n10:00pm- Call peds neurosurg about the kid with the seizure. Worried about shunt malfunction, luckily the resident who placed it is on call. They yell at me about how the kid is 18 and I need adult neurosurgery. Call adult neurosurg. It’s the same resident. They don’t seem to remember talking to me and go on a rant about how it’s not the shunt. \n\n10:15pm- I discharge the dislocated finger after saying Hi and accidentally having them self-reduce by making a fist. Dad makes a comment about how he’s glad the kid didn’t need admission cause they’d go home trans’d. \n\n10:20pm- Discharge decreased appetite kid, tell mom to stop feeding them Hot Cheetos. Mom threatens to sue because she knows her son’s body and “his temp runs low”. They leave. \n\n11:00pm- Attending comes back from their nap. I staff the patients. \n\n11:15pm- I see seizure kid getting wheeled away by flustered OR staff. Neurosurg resident comes screaming into work area yelling at me about emergent shunt revision and how I’m so stupid I wouldn’t recognize myself in the mirror. \n\n12:00am- Three kids come by ambulance. All together from home. 2 for belly pain, 1 for cough and congestion. Kids #1 and #2 are belly pain, #3 is cough. Examine them. Kids #1 and #2 have no belly tenderness but are wheezing. Kid #3 is frankly peritoneal. Ask mom and dad about smoke exposure at home. They deny anything. The room smells like a mix between my grow room and a 70s movie theater. Whatever. \n\n12:15am: Kid #3 is antibiosed and I head back to the room with peds surg. As we approach, we see mom thrown out of the room and smack her head on the floor. Seizes. I stabilize and intubate her. Call a trauma alert. Adult ED resident comes to take her to the bay. Peds surg resident is also covering trauma pager and goes with. Turns out “mom” is actually girlfriend, and real mom works for registration. Walked in on girlfriend and dad making out and lost it. Head back into room. Dad is nowhere to be found. Room smells like bleach for some reason. Kid #3 took a giant dump in the middle of the floor, belly is now soft. Kid #1 is eating it, while the other two are finger-painting. Admit to gen peds for social concerns. They ask me to consult Poison Control for Kid #1 as well as DCFS.\n\n1:00am- Finish notes, throw in a second Zyn and reflect on life choices. \n\n2:00am- Nurse tells me they got a line on the septic adult. I head in to tell them I’m admitting them. They have stickers on their face, head quadruple wrapped in Kerlex with a 22 in the scalp. Sitting on the peds social worker‘s lap eating a popsicle and watching Blue’s Clues on an iPad.\n\n2:15am- Nap. \n\n4:00am- Morning resident arrives. Asks where the attending is. I have no idea. I go home and go to sleep. \n\n2:00pm- Wake up. Email from overnight attending reminding me of the importance of sepsis bundles. Second email from DCFS about how they investigated my report, found no evidence of neglect, and how I need to respect their limited resources. Third email from hospital risk management about not taking patient complaints seriously. \n\n4:00pm- Sore throat. Swollen lymph nodes. Fever of 102. Phone rings. Caller ID- “The Devil”.",
        "created_utc": 1678311936,
        "upvote_ratio": 1.0
    },
    {
        "title": "My psych rotation is breaking me down",
        "author": "Noodlynight",
        "url": "https://www.reddit.com/r/medicalschool/comments/11m8yky/my_psych_rotation_is_breaking_me_down/",
        "text": "\n\n\nIm mid my psych rotation and seeing those young 20s schizophrenic being absolutely unaware is breaking my heart. I cant maintain emotional stability to take a proper history , I have always found it hard dealing with pts my age (smth that was rare throughout my previous clerks, but for some reason almost all the pts are 23-30s with broken relationships and heartbreaking stories - either their families abandoned them, they were arrested to drugs or just completely manic and not with us) it reached a point where it affects the whole day and I can’t bring myself to study or even enjoy my free time. What do you do to detach yourself from this?",
        "created_utc": 1678311393,
        "upvote_ratio": 1.0
    },
    {
        "title": "IMG in the dark",
        "author": "Wooden_Cat8564",
        "url": "https://i.redd.it/pi3lryctkmma1.jpg",
        "text": "",
        "created_utc": 1678311181,
        "upvote_ratio": 1.0
    },
    {
        "title": "GS vs EM",
        "author": "steak_blues",
        "url": "https://www.reddit.com/r/medicalschool/comments/11m8rhp/gs_vs_em/",
        "text": "Help a struggling new M4 make life decisions. Gosh, figuring out specialty has been the most mind-fucking gymnastics I've had to endure over the last few months. \n\n1) GS\n\nMan I loved the OR. Time flew there, even in specialties I was less interested in, even in cases I didn't scrub and had to watch standing 5 feet away, time just flew. I remember seeing a few cases that have stuck with me as just the most riveting, inspiring shit I've ever seen in my life and went home and daydreamed about that afterwards. That said, man am I TERRIFIED of how much life this career could suck out of me. I'm not a \"live to work\" kind of person. I'm not afraid of hard work and understand the weight of why the hours/training is so grueling, but I do have other interests/priorities outside of work and do not want a life of waking up &gt; working &gt; going to sleep. I have hobbies I'd like to continue, I enjoy down time, I don't want my relationships to suffer. I seriously get nightmares at night thinking about becoming a slave to the system and losing any semblance of life outside of the hospital. \n\n2) EM\n\nI love doing things with my hands, procedures are a must. I liked most things inpatient and could see this being a nice mix of it all. I love high acuity. I feel like I need resuscitation and trauma patients in my career to keep things exciting. I also don't mind some downtime at work and I'm sure the BS PCP type patients would be a nice break. That said, I don't like the idea of a career full of triage and not being the expert in anything. I went to med school to become someone's endpoint, I left the world of EMS because of this triage nature and not being developed enough to provide that endpoint care. The endless stream of initial workups that I'd never end up solving or partaking in also seem irksome. I'd miss being in the OR. Lines, tubes, suturing would be cool, but I'd definitely miss being in the OR. BUT I recognize this lifestyle is wildly better than GS and I'd have shift work, time off, be able to plan out time to do hobbies/family/travel. \n\nIt basically boils down to this - I'd gain the most career satisfaction being in the OR and being that endpoint expert with surgery. But I feel like I'd lose a lot my life to it and I'm not sure which trade-off I'd be happier with. More satisfaction with career or more satisfaction with life? \n\nI feel so lost in this process and I've changed my mind so many times. I feel like this is an exciting place to be in the journey and all I've felt lately is fear, anxiety, and trepidation with my fourth year coming up built out right now for surgery. I feel like I haven't been able to make a solid decision and stick with it and it's mentally exhausting. \n\nThank you for reading and any insight.",
        "created_utc": 1678310944,
        "upvote_ratio": 1.0
    },
    {
        "title": "VSLO",
        "author": "neuron95",
        "url": "https://www.reddit.com/r/medicalschool/comments/11m8q9k/vslo/",
        "text": "What is the consensus on withdrawing from VSLO apps to a school before they have accepted you? Does that affect chances of interviewing/matching at all?",
        "created_utc": 1678310863,
        "upvote_ratio": 1.0
    },
    {
        "title": "Are you guys going in to your rotations rotations on Monday of Match Week?",
        "author": "Pitiful-Turnover-531",
        "url": "https://www.reddit.com/r/medicalschool/comments/11m8o97/are_you_guys_going_in_to_your_rotations_rotations/",
        "text": "I just don’t wanna go in next monday lol. I’ll be super anxious and want to find out if I’ve matched with my support system. \n\nAre y’all going in?\nWhat’s the etiquette here? lol",
        "created_utc": 1678310727,
        "upvote_ratio": 1.0
    },
    {
        "title": "Nonconsensual Pelvic Exams?",
        "author": "Aredditusernamehere",
        "url": "https://www.reddit.com/r/medicalschool/comments/11m8f9g/nonconsensual_pelvic_exams/",
        "text": "\"Medical students are performing nonconsensual pelvic examinations when patients are under anesthesia\" has been in articles, on Twitter, and all over TikTok lately - on my rotation, the physician just got a message from a patient asking about it, so it's really spreading. \n\nWhile I'm sure it happens, it's being framed as commonplace and taking place in surgeries that aren't related to the reproductive system. Like the call I heard recently irl was regarding a minor who underwent a tonsillectomy. \n\nHave any of you personally heard of or seen this in your own experience??",
        "created_utc": 1678310162,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to handle an inevitable poor clinical eval",
        "author": "Accomplished_Age_686",
        "url": "https://www.reddit.com/r/medicalschool/comments/11m8bkj/how_to_handle_an_inevitable_poor_clinical_eval/",
        "text": "I am on a rotation where I got off to a really bad start with my preceptor who is notorious for writing evals that are mediocre at best. On my first day she got into a fender bender and basically took her frustration out on me. Since then, I feel as if I am a target for anything that goes wrong. \n\nFor example: I was told I was \"below the level of my peers\" because I refused to do a genitourinary exam on a teenage by myself (I am a male and told my preceptor I would be feel more comfortable to do it with her in the room). Throughout the rotation she has made several hints that imply she is going to write an eval that paints me as incompetent.\n\nUp until this point, I have outstanding comments on my evals which specifically mention I am a hardworker and demonstrate professionalism. This is a rotation for a field I do not want to go into. I was wondering what the best course of action would be to handle this? To this point, I have been writing down unprofessional things she has done to me thus far with timestamps. Do I wait until the end of the rotation to mention this to my school or can I let them know early what to expect?",
        "created_utc": 1678309933,
        "upvote_ratio": 1.0
    },
    {
        "title": "How would one immigrate to the US as an iMG with a partner?",
        "author": "QPRCHOC",
        "url": "https://www.reddit.com/r/medicalschool/comments/11m8aad/how_would_one_immigrate_to_the_us_as_an_img_with/",
        "text": "I'm aware and apologize in advance that this is rather a broad question. I'm a psychiatry trainee from a small European country, quite far into my training. The US strongly appeals to me for several reasons. \n\nI'm in a two-year relationship with my Bulgarian girlfriend. I know I'd need to polish off my USMLEs and start residency from scratch for any move, but what would the immigration process entail for us? My girlfriend is not a doctor.\n\nWould the process be aided if we were married? Would she be able to move with my without much trouble should I have a position in place myself?",
        "created_utc": 1678309852,
        "upvote_ratio": 1.0
    },
    {
        "title": "R E Lxa X - rate my song",
        "author": "tanbo_theman",
        "url": "https://m.youtube.com/watch?v=zikR2QLthfo",
        "text": "",
        "created_utc": 1678309076,
        "upvote_ratio": 1.0
    },
    {
        "title": "Match Day 2024",
        "author": "sangria247328190",
        "url": "https://www.reddit.com/r/medicalschool/comments/11m7wio/match_day_2024/",
        "text": "[removed]",
        "created_utc": 1678308994,
        "upvote_ratio": 1.0
    },
    {
        "title": "Diary of an Early March 4th year Medical Student",
        "author": "Prudent_Marsupial244",
        "url": "https://www.reddit.com/r/medicalschool/comments/11m7qi4/diary_of_an_early_march_4th_year_medical_student/",
        "text": "10AM: Wake up and ponder if I should show up today or not. Decide \"ehh why not\". Take my sweet ass time getting ready, pausing to read reddit and chuckle at resident's diary posts in between each step of my morning routine\n\n11AM: Show up and greet attending. He looks at me, blinking in confusion as to who I am since he hasn't seen me in 2 weeks, but then a wave of realization comes across his face. Drag my feet doing what is essentially shadowing since I am post-February M4 and refuse to see patients or write notes at this point.\n\n12PM: Announce \"It is noon. I am leaving. Goodbye.\" to no one in particular and leave without waiting for approval or a reply.\n\n12:15: Lunch.\n\n1: Take afternoon nap.\n\n2:30PM: Wake up. Realize I have nothing important going on since my match list has already been ranked. Remember I am in 2948 hours of sleep debt. Go back to bed. \n\n4:30: Wake up. Had horrible nightmare about matching at my 4th choice. God please don't let that be me. Can't fall back asleep this time. Elect to play video games.\n\n9:30PM: Dinner.\n\n10: Bed.",
        "created_utc": 1678308604,
        "upvote_ratio": 1.0
    },
    {
        "title": "We need to chill out rn",
        "author": "vikpib",
        "url": "https://i.redd.it/wcy4s9rgvkma1.jpg",
        "text": "",
        "created_utc": 1678308571,
        "upvote_ratio": 1.0
    },
    {
        "title": "Where do you think would be the WORST place/location to do residency?",
        "author": "Crafty-Roof-6630",
        "url": "https://www.reddit.com/r/medicalschool/comments/11m7ipd/where_do_you_think_would_be_the_worst/",
        "text": "And why?",
        "created_utc": 1678308091,
        "upvote_ratio": 1.0
    },
    {
        "title": "NRMP Source Code SOAP / View Unfilled Programs",
        "author": "anonree",
        "url": "https://www.reddit.com/r/medicalschool/comments/11m74j9/nrmp_source_code_soap_view_unfilled_programs/",
        "text": "Does everyone have the following on the NRMP source code page or is it just me? (I don't see any congratulations of any sort so am a bit worried)\n\n&lt;!-- View Unfilled Programs --&gt;  \n\n&lt;!-- SOAP dropdown --&gt;",
        "created_utc": 1678307181,
        "upvote_ratio": 1.0
    },
    {
        "title": "ATLS Post Test. MCQ With Answers 2023 Updated - ATLS Post Test. MCQ",
        "author": "SuperGrades",
        "url": "https://www.stuvia.com/doc/2451169/atls-post-test.-mcq-with-answers-2023-updated",
        "text": "",
        "created_utc": 1678306461,
        "upvote_ratio": 1.0
    },
    {
        "title": "CHAPTER 18: MATERNAL PHYSIOLOGIC CHANGES (2023) - CHAPTER 18: MATERNAL PHYSIOLOGIC CHANGES",
        "author": "SuperGrades",
        "url": "https://www.stuvia.com/doc/2451164/chapter-18-maternal-physiologic-changes-2023",
        "text": "",
        "created_utc": 1678306427,
        "upvote_ratio": 1.0
    },
    {
        "title": "I'm so tired",
        "author": "ChocRaspMochi",
        "url": "https://www.reddit.com/r/medicalschool/comments/11m6mz2/im_so_tired/",
        "text": "[removed]",
        "created_utc": 1678306075,
        "upvote_ratio": 1.0
    },
    {
        "title": "ATLS POST TEST QUESTIONS WITH ALL CORRECT ANSWERS (ADVANCED TRAUMA LIFE SUPPORT) - ATLS ADVANCED TRAUMA LIFE SUPPORT",
        "author": "SuperGrades",
        "url": "https://www.stuvia.com/doc/2451120/atls-post-test-questions-with-all-correct-answers-advanced-trauma-life-support",
        "text": "",
        "created_utc": 1678305729,
        "upvote_ratio": 1.0
    },
    {
        "title": "MATERNAL PHYSIOLOGIC CHANGES - Chapter 18: Maternal Physiologic Changes",
        "author": "SuperGrades",
        "url": "https://www.stuvia.com/doc/2451073/maternal-physiologic-changes",
        "text": "",
        "created_utc": 1678305690,
        "upvote_ratio": 1.0
    },
    {
        "title": "ATLS Post Test. MCQ With Answers 2023 Updated - ATLS",
        "author": "SuperGrades",
        "url": "https://www.stuvia.com/doc/2451091/atls-post-test.-mcq-with-answers-2023-updated",
        "text": "",
        "created_utc": 1678305631,
        "upvote_ratio": 1.0
    },
    {
        "title": "How I look at my resident/attending who won't dismiss me for the past 3 hours even though there's literally nothing left for me to do.",
        "author": "BlueVestDragon",
        "url": "https://i.redd.it/9dxm0ficmkma1.png",
        "text": "",
        "created_utc": 1678305498,
        "upvote_ratio": 1.0
    },
    {
        "title": "Help! What is the fast st way to remeber name of diagnosis in pathology? Photo as example of diagnosis",
        "author": "Lara_Salvatore",
        "url": "https://i.redd.it/zeelzxmw3mma1.jpg",
        "text": "",
        "created_utc": 1678305495,
        "upvote_ratio": 1.0
    },
    {
        "title": "Diary of an MS3 on Medicine Part 1",
        "author": "Zealousideal-Aide-16",
        "url": "https://www.reddit.com/r/medicalschool/comments/11m65fo/diary_of_an_ms3_on_medicine_part_1/",
        "text": "\n5am: wake up, frantically read the article I was assigned to give a presentation on. 4th one this week on hyponatremia, hard to keep them straight.\n\n5:45am: Get to the hospital to thoroughly chart check the two patients I am following.\n\n7:00am: Whewwww, barely had enough time to finish my chart checking. Those sodium levels don’t trend themselves you know. Don’t even get me started on their Mg/Phos.\n\n7:30am: Finish pre-rounding on my two patients. Twice the time it took me on surgery with 1/10 of the patient load. What can I say, those surgeons are only good for cutting, blowing through contact precautions, consults for constipation, and fecal disimpactions of course. Could I do the disimpaction myself? Sure, but why rob them of one of their greatest pleasures. \n\n7:31am: get an angry call from general surgery, why the fuck did we not pick up their consult call at 5:00am. Their patient has well controlled type I diabetes with a  fasting glucose of 101 and an A1c of 6.6%. They could have DIED in that hour and a half. \n\nI apologize and say we would be glad to manage their diabetes but as a consulting service only. The general surgery resident is incredulous, but they have this thing called HTN as well?!? How can they be expected to manage such a rare and mediciny sounding condition. I see that they are well controlled on their home meds with a BP of 120/80; I tell them to continue home meds and we can watch that as well but ONLY as a consulting service. \n\n7:40am: I began to craft a well thought out and researched plan for my two patients. I have combed through every UpToDate article, all PubMed articles published in the last ten years, and obscure articles published only in Japan, India, and China. I painstakingly translate each word through Google Translate. I shall not let anyone out Medicine me. \n\n8am: I receive a call from general surgery again, they say the patient’s POC glucose was 85 and ask how much of D10 they need to give. I explain that 85 is fine but they should also just let the patient eat breakfast if they are just going to ride the OR board for another 10 days. “He’s been NPO for 10 days already and just needs a sacral ulcer debrided, I’m sure he’s very hungry.” The resident is once again incredulous, how could I possibly even suggest giving a surgical patient a diet even though there is a -1,000,000% chance they will be going to the OR today.\n\n8:10am: I get a call from Orthopedic Surgery who wants me to admit a patient they just put an ex-fix on and will be taking to the OR at least 10 more times. I ask what medical conditions are going on and they respond with “Well the Cr thing in Epic is red, it’s 1.36, that’s bad right?” I shake my head and explain that is .01 over normal and the patient broke 69 bones and just completed an 18 hour operation, it’s normal for Creatinine to go up after such events. The Ortho resident cannot help himself he says “Niceeeeeeeeeee, thanks for taking my call so I can transfer the patient to your service right?”\n\n8:20am: Since my masterful tactical battlefield planning got interrupted, I decide to take a few minutes for reflection. I think how these individuals were once at the very top of their class. A step 1 score of 284 and step 2 score of 298 and a bench press of 550kg. Oh how the mighty have fallen I think to myself but I catch myself because it isn’t their fault. I instead thank my lucky stars that I don’t suffer from Cerebral Wasting Disease, an epidemic among surgeons. It will be the first epidemic I tackle after I finish my Infectious Disease Fellowship, my chance to truly stand tall and proud in the world after “only going into medicine.” \n\nThis needs a Part 2 because well, Medicine rounds last that long.",
        "created_utc": 1678305023,
        "upvote_ratio": 1.0
    },
    {
        "title": "Diary of a 4th year med student on dermatology rotation",
        "author": "ilostthegamespacedx",
        "url": "https://www.reddit.com/r/medicalschool/comments/11m61h6/diary_of_a_4th_year_med_student_on_dermatology/",
        "text": "1:00pm: wake up\n\n1:01pm: roll over, take a caffeine pill, go back to sleep\n\n1:20pm: jolt awake with an audible gasp\n\n1:21pm: jerk off\n\n1:28pm: go to the kitchen and have breakfast with my first drink of the day\n\n2:00pm: read the spreadsheet of a completely unrelated specialty because I have memorized every line of every page of the excel spreadsheet of my own specialty\n\n2:30pm: I get a call from the dermatologist's office... I don't have an appointment today?? I ignore it\n\n3:00pm: second jerk off of the day\n\n3:30pm: second drink of the day\n\n3:45pm: third jerk off of the day\n\n4:00pm: third drink of the day\n\n4:30pm: fourth drink of the day\n\n5:00pm: fourth jerk off of the day\n\n5:30pm: fifth drink of the day\n\n6:00pm: smoke a cigarette\n\n6:30pm: read the child neuro spreadsheet\n\n7:00pm: read my own MSPE letter\n\n7:30pm sixth drink of the day\n\n8:00pm: sixth jerk off of the day\n\n8:30pm: ???\n\n11:00pm: take a benadryl\n\n1:30am: have a stare-off with the hat man and the night man. They try to steal my dresser and my pants\n\n3:00am: seventh jerk off of the day\n\n3:45am: finally fall asleep feeling fulfilled.",
        "created_utc": 1678304778,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to Gather Knowledge About Residency Programs?",
        "author": "botantbotables",
        "url": "https://www.reddit.com/r/medicalschool/comments/11m5rmz/how_to_gather_knowledge_about_residency_programs/",
        "text": "Going to be applying to residency next cycle.\n\nIt seems like knowing each residency program's mission, culture and values is important for getting interviews and matching.\n\nHow do people gather this information?\n\nWhat have people thought is the best way to do this?\n\nOr am I totally off base and this is a non-issue?",
        "created_utc": 1678304166,
        "upvote_ratio": 1.0
    },
    {
        "title": "Adderall shortage",
        "author": "Iwantsleepandfood",
        "url": "https://www.reddit.com/r/medicalschool/comments/11m5qhc/adderall_shortage/",
        "text": "It’s finally happened to me. Affected by the Adderall shortage and ridiculously anxious about how tf am I gonna study for the rest of my remaining modules plus step 1. \n\nHelp. How are y’all surviving??",
        "created_utc": 1678304094,
        "upvote_ratio": 1.0
    },
    {
        "title": "Clearly I’ve just been warped by M3…",
        "author": "A_Sentient_Ape",
        "url": "https://www.reddit.com/r/medicalschool/comments/11m5prl/clearly_ive_just_been_warped_by_m3/",
        "text": "…but is there any conceivable downside to being let out early on a regular basis? On previous rotations I’ve *never* been the student who pushes back on being let out early or willingly stays late, but it’s happening so often now on my IM rotation (something I’m considering career-wise) that I’m actually becoming paranoid that it’s somehow indicative of poor performance….I’m talking like 2:30-3pm every day now. \n\nAm I just scarred from having to stay late on all my other rotations??? Or could this somehow actually be a bad thing?",
        "created_utc": 1678304049,
        "upvote_ratio": 1.0
    },
    {
        "title": "is it possible to get a piece of cannula broken off and left in the vain ? and if so what could happen?",
        "author": "psychosomatic-Frank",
        "url": "https://www.reddit.com/r/medicalschool/comments/11m5mgj/is_it_possible_to_get_a_piece_of_cannula_broken/",
        "text": "i had a cannula once and it fell out itself, and i often wondered could a piece be left in my vein? i have a pain around that region when i bend my arm, but this only come about 4-5 months after, could it be linked?",
        "created_utc": 1678303844,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does your school force you to buy their health insurance?",
        "author": "Total-Guarantee4926",
        "url": "https://www.reddit.com/r/medicalschool/comments/11m5k6p/does_your_school_force_you_to_buy_their_health/",
        "text": "[removed]",
        "created_utc": 1678303706,
        "upvote_ratio": 1.0
    },
    {
        "title": "Will your residency reimburse step 3 cost if you take it before starting?",
        "author": "plastic_coffee",
        "url": "https://www.reddit.com/r/medicalschool/comments/11m5h6y/will_your_residency_reimburse_step_3_cost_if_you/",
        "text": "Wanted to knock it out of the way but don’t want to foot the $1k bill.",
        "created_utc": 1678303518,
        "upvote_ratio": 1.0
    },
    {
        "title": "Chest X-ray. Does it look normal?",
        "author": "AdhesivenessOk5264",
        "url": "https://i.redd.it/fdwxiezmvlma1.jpg",
        "text": "",
        "created_utc": 1678302717,
        "upvote_ratio": 1.0
    },
    {
        "title": "Diary of an M4 who’s already submitted their rank list.",
        "author": "I_want_to_die_14",
        "url": "https://www.reddit.com/r/medicalschool/comments/11m4z57/diary_of_an_m4_whos_already_submitted_their_rank/",
        "text": "&gt;!                                !&lt;",
        "created_utc": 1678302396,
        "upvote_ratio": 1.0
    },
    {
        "title": "Non-US IMGs who scored 270+ on Step1, what specialty are you shooting for?",
        "author": "stepneo1",
        "url": "https://www.reddit.com/r/medicalschool/comments/11m4xfo/nonus_imgs_who_scored_270_on_step1_what_specialty/",
        "text": "Or course, this applies to this current cycle.",
        "created_utc": 1678302294,
        "upvote_ratio": 1.0
    },
    {
        "title": "What I thought hyperspace would be like as a kid",
        "author": "HashyBaby",
        "url": "https://i.redd.it/fdnehnpftlma1.jpg",
        "text": "",
        "created_utc": 1678301973,
        "upvote_ratio": 1.0
    },
    {
        "title": "Diary of a 4th Year Medical Student on Radiology",
        "author": "RiglersTriad",
        "url": "https://www.reddit.com/r/medicalschool/comments/11m4pql/diary_of_a_4th_year_medical_student_on_radiology/",
        "text": "8:30am: wake up\n\n8:45am: morning poop\n\n8:55am: eat breakfast and text the resident that I won't be coming in today because of a \"research meeting\"\n\n9:30am: play FIFA\n\n12:00pm: eat lunch\n\n1:00pm: daily nap\n\n4:00pm: wake up in a sweat; stress check ROL verification on the NRMP site (all three are green this time, but they might not be the next time)\n\n4:03pm: first drink of the day\n\n4:15pm: second drink of the day\n\n4:50pm: fifth drink of the day\n\n8:00pm: wake up\n\n8:10pm: dinner and sixth drink of the day\n\n9:00pm: jerk off\n\n9:01pm: play COD and seventh drink of the day\n\n12:00am: sleep, didn't set an alarm for the morning.",
        "created_utc": 1678301833,
        "upvote_ratio": 1.0
    },
    {
        "title": "Help, I'm so tired",
        "author": "ChocRaspMochi",
        "url": "https://www.reddit.com/r/medicalschool/comments/11m4niz/help_im_so_tired/",
        "text": "[removed]",
        "created_utc": 1678301690,
        "upvote_ratio": 1.0
    },
    {
        "title": "I'm so tired",
        "author": "ChocRaspMochi",
        "url": "https://www.reddit.com/r/medicalschool/comments/11m4l7e/im_so_tired/",
        "text": "[removed]",
        "created_utc": 1678301541,
        "upvote_ratio": 1.0
    },
    {
        "title": "What are some questions you have that you are otherwise too afraid to ask an attending?",
        "author": "Monkey__Shit",
        "url": "https://www.reddit.com/r/medicalschool/comments/11m3ze4/what_are_some_questions_you_have_that_you_are/",
        "text": "Title",
        "created_utc": 1678300153,
        "upvote_ratio": 1.0
    },
    {
        "title": "Starfield comes out in September, during prime audition and ERAS time",
        "author": "CornfedOMS",
        "url": "https://www.reddit.com/r/medicalschool/comments/11m34lc/starfield_comes_out_in_september_during_prime/",
        "text": "Why didn't Todd Howard consult us about the release timing? I'll just have to get my application done a little early. Anyone else planning to play Starfield during 4th year's downtime?",
        "created_utc": 1678298222,
        "upvote_ratio": 1.0
    },
    {
        "title": "Apparently 'blast'ing in this case is, in fact, not a great sign",
        "author": "WillOfTheSon",
        "url": "https://i.redd.it/r9peopd2ilma1.jpg",
        "text": "",
        "created_utc": 1678298149,
        "upvote_ratio": 1.0
    },
    {
        "title": "BNB President Takeover",
        "author": "applemaker123",
        "url": "https://v.redd.it/t6u07tdyzjma1",
        "text": "",
        "created_utc": 1678298011,
        "upvote_ratio": 1.0
    },
    {
        "title": "Financial steps to take after dropping out of med school?",
        "author": "il0vecarr0ts",
        "url": "https://www.reddit.com/r/medicalschool/comments/11m2wjz/financial_steps_to_take_after_dropping_out_of_med/",
        "text": "[removed]",
        "created_utc": 1678297699,
        "upvote_ratio": 1.0
    }
]