[
    {
        "title": "Tips for M1?",
        "author": "Nervous_Celery_8732",
        "url": "https://www.reddit.com/r/medicalschool/comments/11olbmn/tips_for_m1/",
        "text": "Hi guys. For some reason, med school seems extremely daunting. I'm extremely far from home/family and that is also playing a big role in increasing my constant anxiety and fears.\n\nI want to give myself the absolute best chance to match back home and that means researching a lot, getting leadership positions, and other ECs. At the same time, I took a gap year and feel like I forgot everything remotely science related. I'm scared I won't be able to balance school, research, EC's, and not feeling homesick.\n\nAny recommendations or stories of people who were able to do it? Any advice for a daily schedule or tips for M1 or pre-clinical years to remain focused for the 3 years before I can try for away rotations back home?",
        "created_utc": 1678544337,
        "upvote_ratio": 1.0
    },
    {
        "title": "Tips for Incoming M1?",
        "author": "Nervous_Celery_8732",
        "url": "https://www.reddit.com/r/medicalschool/comments/11olajb/tips_for_incoming_m1/",
        "text": "[removed]",
        "created_utc": 1678544252,
        "upvote_ratio": 1.0
    },
    {
        "title": "Friendly reminder to MS4: Continue to go to your rotations.",
        "author": "Biryani_Wala",
        "url": "https://www.reddit.com/r/medicalschool/comments/11okddy/friendly_reminder_to_ms4_continue_to_go_to_your/",
        "text": "It happens every year. Once medical students match, they skip out on rotations. Some even forge signatures on ED rotation sheets thinking no one will care. \n\nAt my medical school, there have been two students in the last few years who tried to not show up to rotations and lied bout being there. Both were not allowed to graduate and thus not able to enter residency.\n\nI know it feels pointless. I know you feel checked out. Just show up. No one will care if you aren't giving it your all. Just show up.",
        "created_utc": 1678541749,
        "upvote_ratio": 1.0
    },
    {
        "title": "BnB vs pathoma for certain specialities (step1)",
        "author": "Hydesx",
        "url": "https://www.reddit.com/r/medicalschool/comments/11ojms2/bnb_vs_pathoma_for_certain_specialities_step1/",
        "text": "Hi I use both these resources and heard they have their pros and cons.\n\nJust wondering which resource is superior for each of these specialities\n\n* Cardiology - I heard Bnb for this one\n* MSK / orthopaedics\n* Vascular\n* Renal\n* Respiratory system\n* Gastrointestinal\n* Endocrinology\n* Haematology - apparently pathoma is king here\n* Neurology\n* Reproductive system",
        "created_utc": 1678539652,
        "upvote_ratio": 1.0
    },
    {
        "title": "😔Congressman wants to make 32-hour workweek U.S. law to 'increase the happiness of humankind'",
        "author": "WerbenJaegerman",
        "url": "https://www.cnbc.com/2023/03/10/bill-proposed-to-make-32-hour-workweek-us-law-by-rep-mark-takano.html",
        "text": "",
        "created_utc": 1678539195,
        "upvote_ratio": 1.0
    },
    {
        "title": "Visual snow syndrome - https://www.visualsnowinitiative.org",
        "author": "VisualSnowHelp",
        "url": "https://www.reddit.com/r/medicalschool/comments/11oibzg/visual_snow_syndrome/",
        "text": "Hi everyone, I’m posting this here because I have a rare incurable neurological disorder that I want YOU to learn about. You’ve probably heard of tinnitus, well this is similar but is related to visual processing instead of auditory. \nI believe that if more medical professionals learn about VSS the more likely it is for research to become more regular. Could VSS get added to medical school curriculum? I’m interested to know. 2-3% of the population suffer with this according to recent findings. Thank you (26F, two months into this diagnosis)",
        "created_utc": 1678535696,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to assert dominance in med school",
        "author": "P-S-21",
        "url": "https://www.reddit.com/r/medicalschool/comments/11oi9nd/how_to_assert_dominance_in_med_school/",
        "text": "So our med school has these practical examinations wherein they take a 'viva' i.e make you sit in front of a professor and quiz you on a billion things. A friend if mine was in such one viva, and after it's finished, the professor outstretches his hand, presumably to ask for his answersheet so that he can sign on it.\n\nThe absolute madlad friend of mine reaches forward, and grasps the professors hand and initiates a handshake. \n\nLeaves.\n\nDominance asserted.",
        "created_utc": 1678535480,
        "upvote_ratio": 1.0
    },
    {
        "title": "Types and Advantages of Single Use Instruments",
        "author": "jimymedical1",
        "url": "http://businesstimeset.com/types-and-advantages-of-single-use-instruments/",
        "text": "",
        "created_utc": 1678535175,
        "upvote_ratio": 1.0
    },
    {
        "title": "how to prepare for family medicine pimping questions?",
        "author": "Sweet_Investigator63",
        "url": "https://www.reddit.com/r/medicalschool/comments/11ohyxr/how_to_prepare_for_family_medicine_pimping/",
        "text": "are there any good resources for commonly asked questions/topics?",
        "created_utc": 1678534500,
        "upvote_ratio": 1.0
    },
    {
        "title": "How ENT Instruments Help During Otorhinolaryngology Procedure",
        "author": "jimymedical1",
        "url": "http://businesstimeset.com/how-ent-instruments-help-during-otorhinolaryngology-procedure/",
        "text": "",
        "created_utc": 1678534272,
        "upvote_ratio": 1.0
    },
    {
        "title": "how to prepare for a family medicine pimping questions?",
        "author": "Sweet_Investigator63",
        "url": "https://www.reddit.com/r/medicalschool/comments/11ohjdb/how_to_prepare_for_a_family_medicine_pimping/",
        "text": "are there any good resources for commonly asked questions/topics?",
        "created_utc": 1678533059,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is it a good idea for men to apply to match to OB/GYN residencies?",
        "author": "Manoj_Malhotra",
        "url": "https://www.reddit.com/r/medicalschool/comments/11oc7hk/is_it_a_good_idea_for_men_to_apply_to_match_to/",
        "text": "[removed]",
        "created_utc": 1678514000,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is it possible to take STEP 1 very early?",
        "author": "CoconuttyCupcake",
        "url": "https://www.reddit.com/r/medicalschool/comments/11ob9el/is_it_possible_to_take_step_1_very_early/",
        "text": "[removed]",
        "created_utc": 1678510845,
        "upvote_ratio": 1.0
    },
    {
        "title": "How many of us are from impoverished backgrounds?",
        "author": "recoveringhorsechild",
        "url": "https://www.reddit.com/r/medicalschool/comments/11ob1bp/how_many_of_us_are_from_impoverished_backgrounds/",
        "text": "[removed]",
        "created_utc": 1678510114,
        "upvote_ratio": 1.0
    },
    {
        "title": "Could my relationship survive?",
        "author": "friedricelover23",
        "url": "https://www.reddit.com/r/medicalschool/comments/11oang8/could_my_relationship_survive/",
        "text": "hey all, I’m starting medical school this summer. my s/o will be applying to med school (he is an amazing individual and I’m hopeful that he’ll get in somewhere) \n\nhe’s applying to 50/50 programs in and out-of-state. beyond almost certainly doing long distance for medical school, we wouldn’t be able to couples match due to our difference in years. \n\nig my question is, how difficult is it to match into residency where your s/o already is? our relationship will basically have to be 8-10 years of long distance. as a 21 year old, this scares the sh!t out of me.",
        "created_utc": 1678508878,
        "upvote_ratio": 1.0
    },
    {
        "title": "program that connects patients with limited options to clinical trails/experimental procedures.",
        "author": "brightonquin",
        "url": "https://www.reddit.com/r/medicalschool/comments/11o8v5r/program_that_connects_patients_with_limited/",
        "text": "**hello, hello, medical experts and all in between!**\n\n*background info:*\n\nas a high school student interested in the health of patients and preservation of life, im looking for feedback, recommendations, opinions/ literally anything you'd like to say about the topic. i had a family friend named lindsey, she was about 45 with 2 children - one fourteen and the other eight, she unfortunately had to leave these kids behind. she recently died from liver failure as she was a major alcoholic, and was in route to receive a new liver and was on some transplant list. apparently \"they\" had figured out she consumed alcohol again in some capacity, which apparently disqualified her from a transplant, she died eventually.\n\nmy idea:\n\nthis gave me an idea. what if someone developed a software/network/program/whatever, that would connect patients/people in medical need and have limited options such as my friend lindsey, a something that would connect people with organ failure failure, cancers, immunodeficient issues, neurodegenerative issues ext. to clinical trails, experimental procedures, scientific trials and to professionals like researchers and bioenginers that may have a solution that is the the process of testing. a software where people who are almost certain to not make it can, #1 have the potential to save lives by helping people squeeze every drop of hope out of science and #2 help professionals find people who are wiling to undergo such 'experiments\" which will contribute to the science community.\n\nconclusion:\n\nthis was just a random idea i had, i figured i would put this out to a community of people who work with patients like this all the time, too see if people think this would be something of value. Is this worth the time? does something like this already exist?\n\nim open to any and all comments, questions, recs and opinions. please feel free to even say this is stupid and will never work!\n\nCheers!",
        "created_utc": 1678503305,
        "upvote_ratio": 1.0
    },
    {
        "title": "“There were just no cheaper options”",
        "author": "lowbudgetman_",
        "url": "https://i.redd.it/qogm1qzy82na1.jpg",
        "text": "",
        "created_utc": 1678500907,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to support my SO who’s in medical school? I’m not in the medical field",
        "author": "According_Opposite_4",
        "url": "https://www.reddit.com/r/medicalschool/comments/11o8010/how_to_support_my_so_whos_in_medical_school_im/",
        "text": "[removed]",
        "created_utc": 1678500705,
        "upvote_ratio": 1.0
    },
    {
        "title": "You can wipe your tears with your above average match list",
        "author": "lowbudgetman_",
        "url": "https://i.redd.it/h1c3h5g672na1.jpg",
        "text": "",
        "created_utc": 1678500305,
        "upvote_ratio": 1.0
    },
    {
        "title": "how to look for a research idea?",
        "author": "Early-Praline-2097",
        "url": "https://www.reddit.com/r/medicalschool/comments/11o7fcs/how_to_look_for_a_research_idea/",
        "text": "hi guys, so I have worked on multiple research projects that are cross sectional in nature. getting a research idea wasn't difficult because all I had to do is look for studies about knowledge and awareness of a certain thing that hasn't been done in my country and here we go. there is a research idea,. \n\n&amp;#x200B;\n\nbut now, I would like to try doing another methods, such as cohort or anything else. \n\nhow can I get an idea for a cohort study? \n\nI'd like to conduct a research in otorhinolaryngology, would it be impossible for a student to conduct a cohort study? thanks",
        "created_utc": 1678499069,
        "upvote_ratio": 1.0
    },
    {
        "title": "what do u think?",
        "author": "luanarelaxa",
        "url": "https://i.imgur.com/rDiF427.jpg",
        "text": "",
        "created_utc": 1678498988,
        "upvote_ratio": 1.0
    },
    {
        "title": "what are the various ways a med student can use chatgpt?",
        "author": "dumbgeek27",
        "url": "https://www.reddit.com/r/medicalschool/comments/11o6zht/what_are_the_various_ways_a_med_student_can_use/",
        "text": "Its an Ai",
        "created_utc": 1678497809,
        "upvote_ratio": 1.0
    },
    {
        "title": "test",
        "author": "[deleted]",
        "url": "",
        "text": "[removed]",
        "created_utc": 1678497029,
        "upvote_ratio": 1.0
    },
    {
        "title": "22 yo and don’t know how to proceed",
        "author": "Outrageous-Poem-3826",
        "url": "https://www.reddit.com/r/medicalschool/comments/11o6dip/22_yo_and_dont_know_how_to_proceed/",
        "text": "[removed]",
        "created_utc": 1678496126,
        "upvote_ratio": 1.0
    },
    {
        "title": "Free Clinical Medicine resource for rotations",
        "author": "leche1dura",
        "url": "https://www.reddit.com/r/medicalschool/comments/11o5bz8/free_clinical_medicine_resource_for_rotations/",
        "text": "[removed]",
        "created_utc": 1678493348,
        "upvote_ratio": 1.0
    },
    {
        "title": "Should I go into psychiatry if I have a history of PTSD?",
        "author": "yourgold",
        "url": "https://www.reddit.com/r/medicalschool/comments/11o4roe/should_i_go_into_psychiatry_if_i_have_a_history/",
        "text": "I'm an MS3 who is undecided about specialty, but lately I'm highly considering applying psych. It was one of my favorite rotations and I still think about the patients I interacted with and genuinely am really interested in the pathology, treatments. I think psychiatry is the most interesting part of medicine to me. Even on my IM/peds rotation, I found myself drawn to the psychiatry cases. The one thing I worry about is if it would be too much given my own history. I have unresolved childhood trauma myself that I've never been to therapy for and I don't know if it'll \"hit too close to home\" if I pursue it as a career. On one hand, I think it makes me more passionate about the field &amp; empathetic towards patients, but I don't know if I'd be able to detach as much as a physician should. On the other hand, I'm sure residency/training would help me become better at learning how to establish an improved level of distance from my patients. I'd appreciate any advice as I am very conflicted on medical specialties right now and this has been the most difficult decision we all have to make. Thank you guys.",
        "created_utc": 1678491917,
        "upvote_ratio": 1.0
    },
    {
        "title": "Anyone with ADHD please answer some anon questions about adhd for my research study!",
        "author": "MeerkatMer",
        "url": "https://docs.google.com/forms/d/e/1FAIpQLSev1OzkKSW7MT3PZ6Dy1GPF5GIrZ0tN-NZxuRsHeja0oCq_ag/viewformDownloadthisappforfreeat:https://itunes.apple.com/app/id1544827472",
        "text": "",
        "created_utc": 1678491119,
        "upvote_ratio": 1.0
    },
    {
        "title": "If you want to know more about the Match process, watch Bryan Carmody's Match: The Movie!",
        "author": "aimlesssouls",
        "url": "https://youtu.be/jRxHn5l6E4A",
        "text": "",
        "created_utc": 1678491082,
        "upvote_ratio": 1.0
    },
    {
        "title": "None of my third year rotations worked with residents. Any advice on how to audition?",
        "author": "aimlesssouls",
        "url": "https://www.reddit.com/r/medicalschool/comments/11o3zzq/none_of_my_third_year_rotations_worked_with/",
        "text": "What's a resident and how do I show residencies I can potentially be a good one if I've never seen one???",
        "created_utc": 1678489955,
        "upvote_ratio": 1.0
    },
    {
        "title": "Brand New Residents",
        "author": "Fearless-Attitude426",
        "url": "https://www.reddit.com/r/medicalschool/comments/11o3u8d/brand_new_residents/",
        "text": "Starting next week will be an extremely pivotal moment in everyone’s lives. \nThe start of the part of your journey where you start to learn what makes a physician, what it takes to be physician, and what it all means in the context of this profession. \n\nI want to wish everyone luck because I know all of this hard work for the past 4 years is about to pay off. For those that get news you weren’t expecting know the cliche saying of it only being a bump in the road is true. You’ll always find a way to keep striving forward and things have a way of working themselves out if you work hard at it. \n\nFor the new interns please take the time off in between now and residency. You aren’t expected to know a damn thing your first day. You’ll be surprised how well residency prepared you for itself. It’s something you can only experience by going through it yourself. You’re going to be evaluated on a 5 point scale and a 0-1 is a first year resident level performance. So come in ready to learn and absorb information. You guys are going to do amazing. Never be afraid to ask questions even if it becomes annoying. \n\nLastly have some pride! You guys are about to become doctors and have it be your prefix for the rest of your life. When you’re on wards or in the clinic or whatever don’t just write yourself off as just a resident. You have to come with the knowledge that people are depending on you and looking to you for leadership. As intimidating as that can be you’ll soon learn you are more than capable.",
        "created_utc": 1678489551,
        "upvote_ratio": 1.0
    },
    {
        "title": "Urgent! Should I go to the ED?!?!? Help!!!",
        "author": "I_want_to_die_14",
        "url": "https://www.reddit.com/r/medicalschool/comments/11o3smo/urgent_should_i_go_to_the_ed_help/",
        "text": "M4 submitted my rank list last week on my last day  of a non-required ED elective. Not going into EM. I’m scheduled to work from 10pm-6am and am considering not showing up. Attending is not working tonight and I’m assigned to a new grad NP.\n\nI have 0.5/10 pain in my finger from a paper induced laceration 3 days ago. Considering calling in sick. 🙃🙃",
        "created_utc": 1678489448,
        "upvote_ratio": 1.0
    },
    {
        "title": "Travel During M1",
        "author": "Zealousideal-Barber7",
        "url": "https://www.reddit.com/r/medicalschool/comments/11o3c4x/travel_during_m1/",
        "text": "[removed]",
        "created_utc": 1678488318,
        "upvote_ratio": 1.0
    },
    {
        "title": "Love trauma and trauma surgery but hate other surgeries, what’s the best course?",
        "author": "Sad_Platform9466",
        "url": "https://www.reddit.com/r/medicalschool/comments/11o34oe/love_trauma_and_trauma_surgery_but_hate_other/",
        "text": "As the title states:\n\nI’ve been aiming for emergency medicine because it literally encompasses who I am and I genuinely loved it until my surgery rotation and seeing trauma and absolutely LOVING it! Especially the exploratory surgery, loved it! Loved everything from A-Z about it.\n\nBut\n\nGeneral surgery fucking blows. It’s incredibly boring and tedious. Trauma surgery is tedious too but the stakes are higher and that gives me the adrenaline and drive to be tedious.\n\nBut idk, 5 years of awful fucking general surgery? I’m kinda heartbroken on this.\n\nShould I shoot for it? We know what we love, but is 5 years worth of boredom and terrible shifts worth it?",
        "created_utc": 1678487808,
        "upvote_ratio": 1.0
    },
    {
        "title": "How can I get a co-singer for residency relocation loans ?",
        "author": "epoxide-reductase",
        "url": "https://www.reddit.com/r/medicalschool/comments/11o33un/how_can_i_get_a_cosinger_for_residency_relocation/",
        "text": "Applying to private residency relocation loans but I need a co-singer. I put my parents but they make minimum wage and were not able to qualify as a co-signer.",
        "created_utc": 1678487748,
        "upvote_ratio": 1.0
    },
    {
        "title": "MS4s, this is your sign to have a giant sleepover Sunday night",
        "author": "burpingblood",
        "url": "https://www.reddit.com/r/medicalschool/comments/11o2uk2/ms4s_this_is_your_sign_to_have_a_giant_sleepover/",
        "text": "Have a huge sleepover with all of your med school friends that you trust. It’ll be a good way to distract you the night before, and then you can wake up and celebrate together, or give emotional support to people who need to SOAP.",
        "created_utc": 1678487138,
        "upvote_ratio": 1.0
    },
    {
        "title": "Incoming MS4s: don’t be like me and change your ROL after sending a letter of intent.",
        "author": "Hour_Seaworthiness73",
        "url": "https://www.reddit.com/r/medicalschool/comments/11o2opx/incoming_ms4s_dont_be_like_me_and_change_your_rol/",
        "text": "I changed my rank after sending a letter of intent.\n\nI had to. An immediate family member was diagnosed with cancer a week before ROL was certified and my partner and I decided it was better to stay much closer to home than we’d originally intended for the next few years. \n\nI still feel like an ass. I really loved the program I sent it too, and I know there’s still a change I’ll match there so I’m not doing anything. I know they probably don’t care that much about me anyway. But I did an audition there and built great friendships and relationships with the attendings and residents, I hate that those bridges may have been burned. \n\nWord of advice: don’t sent a letter of intent. At all. I got excited because I’d built up a repertoire with this program and was super confident I’d match with them. But you never ever know what will come up, and you don’t want to be feeling guilty like I am. \n\nScouring previous Reddit threads has reassured me this really won’t affect me in the long run. So I know it’s a personal problem and it’s not like I just changed my mind Willy nilly. But damn. I still hate myself lol.",
        "created_utc": 1678486754,
        "upvote_ratio": 1.0
    },
    {
        "title": "What makes a specialty competitive outside the US?",
        "author": "landofortho",
        "url": "https://www.reddit.com/r/medicalschool/comments/11o2ibz/what_makes_a_specialty_competitive_outside_the_us/",
        "text": "The US healthcare system is pretty unique among 1st world countries, so I was wondering what makes specialties desirable in other healthcare system settings.\n\nI will start: \n\nIn the US, the specialty association's lobbying power decides how much it is paid by medicare (and hence private insurance) dictating its income which is essentially the main factor when it comes to competitiveness followed at a distance by lifestyle\n\nAs a general rule, procedures pay more too.",
        "created_utc": 1678486327,
        "upvote_ratio": 1.0
    },
    {
        "title": "Blursed hemidesmosome",
        "author": "starbuck60",
        "url": "https://i.redd.it/b05p85fj11na1.jpg",
        "text": "",
        "created_utc": 1678486301,
        "upvote_ratio": 1.0
    },
    {
        "title": "MSSP Question",
        "author": "Prestigious-Put-7314",
        "url": "https://www.reddit.com/r/medicalschool/comments/11o24sx/mssp_question/",
        "text": "[removed]",
        "created_utc": 1678485453,
        "upvote_ratio": 1.0
    },
    {
        "title": "asian american woman being called Cristina",
        "author": "MajesticYam5",
        "url": "https://www.reddit.com/r/medicalschool/comments/11o14w3/asian_american_woman_being_called_cristina/",
        "text": "this has happened w two different people in the hospital, the attending/ resident calls me Cristina. I say no my name is MajesticYam and they apologize profusely. and then proceed to call me Cristina again later. also a random person, looked to be a patient, came up to me in the cafeteria and asked if my name was Cristina. my badge says MajesticYam and i introduce myself as MajesticYam. i can only assume this is related to Cristina Yang in grey’s anatomy bc my name is not even close to Cristina! has this happened to other asian american females?",
        "created_utc": 1678483051,
        "upvote_ratio": 1.0
    },
    {
        "title": "Would you accept an away rotation at an institution with no DO residents?",
        "author": "HugeDream",
        "url": "https://www.reddit.com/r/medicalschool/comments/11o12zf/would_you_accept_an_away_rotation_at_an/",
        "text": "OMS -3. I applied for an away rotation through VSLO at a really great hospital. To my surprise, they accepted me. The only issue is that there are no DOs in their IM residency program. Is it worth to accept it if they might not offer me an interview/spot in their program? Thank you in advance.",
        "created_utc": 1678482921,
        "upvote_ratio": 1.0
    },
    {
        "title": "Any tips for applying to clinical rotations outside of where your school is?",
        "author": "kirabeerah",
        "url": "https://www.reddit.com/r/medicalschool/comments/11o0naq/any_tips_for_applying_to_clinical_rotations/",
        "text": "My rotations are done in Georgia but I really wanted to apply for a clinical rotation in a Seattle area hospital.  Any tips?",
        "created_utc": 1678481891,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is there a list of 1 year derm research fellowship programs",
        "author": "cholla11",
        "url": "https://www.reddit.com/r/medicalschool/comments/11o0h4b/is_there_a_list_of_1_year_derm_research/",
        "text": "\\^\\^\\^\n\nLooking for info on this. If there is a list I would appreciate it. Thanks!",
        "created_utc": 1678481472,
        "upvote_ratio": 1.0
    },
    {
        "title": "Are female doctors still being mistaken for nurses in 2023?",
        "author": "FreshFuyu",
        "url": "https://www.reddit.com/r/medicalschool/comments/11o0g1w/are_female_doctors_still_being_mistaken_for/",
        "text": "First of all, I just want to say there's nothing wrong with being a nurse. Nurses are incredibly important to the medical team and likely help patients a lot more than I do as a medical student. \n\nHowever, I have been increasingly concerned about patients/staff perceiving female doctors as nurses after seeing a couple times where the work of the female doctor was undermined. One case that stood out to me was a patient in her 30s w/ GI complaints who became enraged because she \"had been in the hospital for 3 days and still hasn't been seen by a doctor.\" I knew for a fact that the female GI fellow had been seeing her everyday, so I gently informed her. The patient and her family were adamant that only nurses had checked in on her. The GI fellow always introduced herself as Dr.xxxxx, behaved very professionally, and wore her labelled white coat, so I feel like it's pretty difficult to mistake her accidentally. She was Black, so racial biases may have been at play too. This patient's family ended up creating a huge ruckus and complaining to the hospital that no doctor came to evaluate her. \n\nWhen I mentioned this to female residents I worked with, none of them seemed remotely surprised. A couple joked \"You can treat a patient for weeks, mention you're Dr.xxxxx everyday and they'll still call you a nurse at discharge.\" \n\nHave you guys seen/heard of similar situations? I'm curious if misperception of female physicians is a local problem or more widespread.",
        "created_utc": 1678481407,
        "upvote_ratio": 1.0
    },
    {
        "title": "Champagne? If I match my #1 program. Sponge? If I match my #16 program - to soak up my tears.",
        "author": "pinkelephant000",
        "url": "https://www.reddit.com/r/medicalschool/comments/11o00a2/champagne_if_i_match_my_1_program_sponge_if_i/",
        "text": "[removed]",
        "created_utc": 1678480362,
        "upvote_ratio": 1.0
    },
    {
        "title": "Be a published author program",
        "author": "Ahsanansarii",
        "url": "https://www.reddit.com/gallery/11nzks3",
        "text": "",
        "created_utc": 1678479353,
        "upvote_ratio": 1.0
    },
    {
        "title": "Applying EM, how many away rotations to apply to?",
        "author": "Lowlevelcomedy",
        "url": "https://www.reddit.com/r/medicalschool/comments/11nyi5i/applying_em_how_many_away_rotations_to_apply_to/",
        "text": "Ideally I have a 1 month period I’d like to do an away rotation in to get a SLOE. How many programs should I apply to to ensure I get a spot? My school advisor said no more than 4. My EM physician advisor said that 10 would be a good number to ensure I get an opportunity and that rejecting acceptances isn’t a big deal in EM if done timely.\n\nThanks!",
        "created_utc": 1678476862,
        "upvote_ratio": 1.0
    },
    {
        "title": "My ex-gf cites medical as reason for breakup. I’m not sure how to proceed",
        "author": "ThrowRA-hrtbrk-henry",
        "url": "https://www.reddit.com/r/medicalschool/comments/11nya0m/my_exgf_cites_medical_as_reason_for_breakup_im/",
        "text": "[removed]",
        "created_utc": 1678476325,
        "upvote_ratio": 1.0
    },
    {
        "title": "My girlfriend cites medical school struggles as cause for breakup, I'm not sure",
        "author": "ThrowRA-hrtbrk-henry",
        "url": "https://www.reddit.com/r/medicalschool/comments/11ny8o9/my_girlfriend_cites_medical_school_struggles_as/",
        "text": "[removed]",
        "created_utc": 1678476241,
        "upvote_ratio": 1.0
    },
    {
        "title": "Practice USMLE Step 1 Exam – Take a 280 Multiple Choice Practice exam for the USMLE Step 1",
        "author": "Better_Rush_9740",
        "url": "https://www.reddit.com/r/medicalschool/comments/11ny0ki/practice_usmle_step_1_exam_take_a_280_multiple/",
        "text": "[removed]",
        "created_utc": 1678475717,
        "upvote_ratio": 1.0
    },
    {
        "title": "First inpatient clinical experience today. Attending kept documenting a medication in the chart that doesn't exist.",
        "author": "just_premed_memes",
        "url": "https://www.reddit.com/r/medicalschool/comments/11nxxuw/first_inpatient_clinical_experience_today/",
        "text": "I hear her saying this into her dragon, over and over. I am too far away to read the chart, but I think I can guess the spelling. After the fifth patient and extensive googling, I become concerned that there is this huge knowledge gap I am missing. Why are all these patients with such different presentations all taking the same medication, why does it have this side effect, and why the hell can't I find anything on it?  \n\n\nAfter mustering the courage to admit my deficit in knowledge, I ask the attending:\n\n\"Can you tell me why all of these patients are taking Rumaire and how it affects the respiratory system?\"  \n\n\nRoom air. The patient is breathing normally on Room air. I am an idiot.",
        "created_utc": 1678475540,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is drexel really that bad of a medical school?",
        "author": "doctrspace",
        "url": "https://www.reddit.com/r/medicalschool/comments/11nxjkq/is_drexel_really_that_bad_of_a_medical_school/",
        "text": "[removed]",
        "created_utc": 1678474656,
        "upvote_ratio": 1.0
    },
    {
        "title": "SOAP assignments checklist option in MyEras",
        "author": "Walker7781",
        "url": "https://www.reddit.com/r/medicalschool/comments/11nxbtg/soap_assignments_checklist_option_in_myeras/",
        "text": "Hi all,\n\nI know its a very anxious period right now. Is it just me or does anything me else see an option of “SOAP assignments checklist” in the programs tab in MyERAS briefly for 2 seconds before it disappears. I’m freaking out!!!\n\nGood luck guys!",
        "created_utc": 1678474156,
        "upvote_ratio": 1.0
    },
    {
        "title": "Relationship devastated by medical school; seeking advice from med students",
        "author": "Reasonable-Court-416",
        "url": "https://www.reddit.com/r/medicalschool/comments/11nxayt/relationship_devastated_by_medical_school_seeking/",
        "text": "[removed]",
        "created_utc": 1678474098,
        "upvote_ratio": 1.0
    },
    {
        "title": "Dissertation project ideas on applications of AI (medicine)",
        "author": "Mean-Programmer-6509",
        "url": "https://www.reddit.com/r/medicalschool/comments/11nxa34/dissertation_project_ideas_on_applications_of_ai/",
        "text": "[removed]",
        "created_utc": 1678474038,
        "upvote_ratio": 1.0
    },
    {
        "title": "12 week dedicated recommended anki settings? already using ANKING settings",
        "author": "Doctadocta19",
        "url": "https://www.reddit.com/r/medicalschool/comments/11nx84u/12_week_dedicated_recommended_anki_settings/",
        "text": "[removed]",
        "created_utc": 1678473912,
        "upvote_ratio": 1.0
    },
    {
        "title": "Anki deck for sketchy physiology?",
        "author": "johanneskorneliussen",
        "url": "https://www.reddit.com/r/medicalschool/comments/11nx4bc/anki_deck_for_sketchy_physiology/",
        "text": "[removed]",
        "created_utc": 1678473654,
        "upvote_ratio": 1.0
    },
    {
        "title": "Will soap interviews to be over zoom or the phone?",
        "author": "Dr_Shlomo",
        "url": "https://www.reddit.com/r/medicalschool/comments/11nwkv8/will_soap_interviews_to_be_over_zoom_or_the_phone/",
        "text": "Asking for a friend...",
        "created_utc": 1678472415,
        "upvote_ratio": 1.0
    },
    {
        "title": "Please stop",
        "author": "BearsBay",
        "url": "https://i.redd.it/6fg7cnvmvzma1.jpg",
        "text": "",
        "created_utc": 1678472209,
        "upvote_ratio": 1.0
    },
    {
        "title": "Traveling during med school?",
        "author": "nontraddoc101",
        "url": "https://www.reddit.com/r/medicalschool/comments/11nwae4/traveling_during_med_school/",
        "text": "[removed]",
        "created_utc": 1678471752,
        "upvote_ratio": 1.0
    },
    {
        "title": "My NRMP Match® email came early!!! ^oh wait",
        "author": "ReignOfFire32",
        "url": "https://i.redd.it/6mmwawzvszma1.png",
        "text": "",
        "created_utc": 1678471286,
        "upvote_ratio": 1.0
    },
    {
        "title": "Question of HIPAA Violation: Clinic Responds to Negative Patient Reviews, disclosing visit details",
        "author": "albfutmd22",
        "url": "https://www.reddit.com/r/medicalschool/comments/11nvo8y/question_of_hipaa_violation_clinic_responds_to/",
        "text": "[removed]",
        "created_utc": 1678470313,
        "upvote_ratio": 1.0
    },
    {
        "title": "Tips and advice from people who did a research year!",
        "author": "applepeachmango",
        "url": "https://www.reddit.com/r/medicalschool/comments/11nv53x/tips_and_advice_from_people_who_did_a_research/",
        "text": "Hi everyone! I recently decided to do a research year at my home institution (mid-tier MD with a home program in desired surgical subspecialty). I wanted to get some advice and stories from people who had already been through a research year. What was your experience like? Did you feel like it was worth it? What were your reasons for choosing a research year? Any suggestions to make it the most productive year it could be?\n\nHere are my reasons for doing the research year:\n\n* I have some pubs but none yet in my desired specialty. I'm a 3rd year going on 4th.\n* I do want to go into academic medicine at this point (this could change tho), and I want to do a competitive fellowship.\n* My spouse has a specific job with a specific company that they can only work with in certain areas of the country, so I need to be competitive enough to match without applying to every program. Also my school is kind of in the region we want to end up.\n* Found the specialty late (see above)\n* They give a stipend and support traveling to conferences which would be helpful\n* My school does EVERYTHING pass/fail. Including clerkships (all pass/fail, no honors, high pass etc) and preclinicals. They don't rank internally or externally either. Also for AOA here they have us write like 3 essays and they look at those...\n\nI'd love to hear your stories! Feeling somewhat apprehensive about delaying graduation and a year of attending salary but also feeling like I might need this to match...",
        "created_utc": 1678469067,
        "upvote_ratio": 1.0
    },
    {
        "title": "Friend taking medical advice for free",
        "author": "throwwawayyyy2334",
        "url": "https://www.reddit.com/r/medicalschool/comments/11nuims/friend_taking_medical_advice_for_free/",
        "text": "I’m a medical graduate preparing for my USMLE. I work as a floor junior resident at a hospital as well. I have a friend who I’ve known for like 15 years. She’s not in the medical field and whenever we text or talk on the phone she almost always asks for advice on any condition she or any of her family member might have. It’s not just general counseling but proper medical consultation which I’m tired of. I know as a healthcare worker it’s my duty to be of service to people but here to me it feels like she’s leeching off of me and it’s very exhausting. I don’t want to be rude to her so I need advice on how to go about this thing without ruining my friendship with her.",
        "created_utc": 1678467636,
        "upvote_ratio": 1.0
    },
    {
        "title": "Work during med school?",
        "author": "amclexi",
        "url": "https://www.reddit.com/r/medicalschool/comments/11nugo8/work_during_med_school/",
        "text": "[removed]",
        "created_utc": 1678467523,
        "upvote_ratio": 1.0
    },
    {
        "title": "First time shadowing as a med student",
        "author": "femmepremed",
        "url": "https://www.reddit.com/r/medicalschool/comments/11ntzdo/first_time_shadowing_as_a_med_student/",
        "text": "Hey guys, I’m shadowing peds endo over my spring break and I haven’t shadowed since my premed years. Do you guys wear scrubs or business casual? This is going to sound nerdy but do you wear your white coat? Thank you!",
        "created_utc": 1678466386,
        "upvote_ratio": 1.0
    },
    {
        "title": "Working while in clinicals?",
        "author": "DesignRemarkable5985",
        "url": "https://www.reddit.com/r/medicalschool/comments/11ntsn2/working_while_in_clinicals/",
        "text": "\nFor those working while in clinicals, what types of positions are you taking besides tutoring?",
        "created_utc": 1678465938,
        "upvote_ratio": 1.0
    },
    {
        "title": "What makes OBGYN toxic?",
        "author": "FlagshipOfTheFleet",
        "url": "https://www.reddit.com/r/medicalschool/comments/11ntsji/what_makes_obgyn_toxic/",
        "text": "I am a Gyn Onc fellow and nearly 10 years out from med school (took time between residency and fellowship). I read on here all the time how OBGYN is the most toxic rotation. \n\nI am genuinely curious- what do you think makes this the case?",
        "created_utc": 1678465932,
        "upvote_ratio": 1.0
    },
    {
        "title": "I get how diastole would be affected. But wouldn't systole be affected as well?",
        "author": "autolifefire",
        "url": "https://i.redd.it/a4jdw6tzsxma1.png",
        "text": "",
        "created_utc": 1678465130,
        "upvote_ratio": 1.0
    },
    {
        "title": "amboss discount code",
        "author": "Hshark24",
        "url": "https://www.reddit.com/r/medicalschool/comments/11ntbxm/amboss_discount_code/",
        "text": "[removed]",
        "created_utc": 1678464890,
        "upvote_ratio": 1.0
    },
    {
        "title": "Would it be better to do a masters program and re-apply for medical school or go to Caribbean school ?",
        "author": "ABraveLittle_Toaster",
        "url": "https://www.reddit.com/r/medicalschool/comments/11nsv0y/would_it_be_better_to_do_a_masters_program_and/",
        "text": "Title says it all. I got accepted to a Caribbean school, but don't feel comfortable about it. Would it be better to do a masters program and boost my gpa and re-apply for medical school ?",
        "created_utc": 1678463826,
        "upvote_ratio": 1.0
    },
    {
        "title": "Research while practicing medicine?",
        "author": "chrisvaral",
        "url": "https://www.reddit.com/r/medicalschool/comments/11nsiw4/research_while_practicing_medicine/",
        "text": "[removed]",
        "created_utc": 1678463047,
        "upvote_ratio": 1.0
    },
    {
        "title": "Medical School Is Designed for The Children of Physicians",
        "author": "chairdesktree",
        "url": "https://www.reddit.com/r/medicalschool/comments/11nsi0u/medical_school_is_designed_for_the_children_of/",
        "text": "Half of my M1 class is children of doctors. I go to an extremely expensive private med school. The only reason the school can charge so much is because half the class is wealthy and the other half is forced to use the infinite fake money pot of federal student loans. It blows my mind that I have friends who will be graduating with half a million dollars in debt or more. It's fucked that the people running our schools all paid pennies for their educations and now they're forcefully slamming debt into the current generation just because they can. Wack",
        "created_utc": 1678462990,
        "upvote_ratio": 1.0
    },
    {
        "title": "🤡 I know there’s no point but still pisses me off time to time lol",
        "author": "TheAromaticGuy",
        "url": "https://i.redd.it/5s4x5p6mixma1.jpg",
        "text": "",
        "created_utc": 1678461617,
        "upvote_ratio": 1.0
    },
    {
        "title": "What would you do during a divorce happening 4th year?",
        "author": "NaughtyLlama2",
        "url": "https://www.reddit.com/r/medicalschool/comments/11nrqze/what_would_you_do_during_a_divorce_happening_4th/",
        "text": "My cowgirl wife of 9 years essentially left the weekend after my second board exam and right before interview season. I partially pursued rural family medicine for her sake. Neither of us were abusive or unfaithful and I'm honestly not sure why she left but we are going to mediation next month. Now I'm probably matching into a (great) rural FM program and wondering what y'all would do in that situation? Since I'm leaving the state, I have to give up custody of my 15 month old and I don't get the dog.",
        "created_utc": 1678461210,
        "upvote_ratio": 1.0
    },
    {
        "title": "Paid Animal work summer job vs 'research' volunteer with little (no) chance of pub",
        "author": "FlaminFatHippo",
        "url": "https://www.reddit.com/r/medicalschool/comments/11nr9zw/paid_animal_work_summer_job_vs_research_volunteer/",
        "text": "Hey all, \n\nA UK MS-1 (19 years) but a US citizen and planning on applying for residency in the US got offered 2 (different) positions. Wondering what you would think would be best as an **early career scientist who wants to publish**\n\nOpportunity 1:\nSummer work caring, cleaning, working with mice. At Cambridge and getting paid £18000 for ~36hr/week for 2-3 months. Only offered to friends and family of certain faculty (so would assume it's not slave labour/is quite good)\n\n* would this open up further opportunities to do research (especially handling animals)? It's paid, at a great institution and my PI who referred me says it would really be beneficial for future lab applications. Would most likely have to find accomodation etc. \n\nOpportunity 2:\n\n* Non paid research, nutrition lab in Canada. Unpaid, most likely will not get a publication during this time but is mostly remote and it is 'research' experience (even though it would most likely be grunt work/no real experience)\n\nI am leaning towards number 1 as it seems like a good transition to research, is paid at a prestigious institution and seems to open up more opportunities to do lab work down the line (esp with animals). Any further insight is much appreciated",
        "created_utc": 1678460067,
        "upvote_ratio": 1.0
    },
    {
        "title": "What are some of the worst ways your school is disorganized?",
        "author": "BigMacrophages",
        "url": "https://www.reddit.com/r/medicalschool/comments/11nr74h/what_are_some_of_the_worst_ways_your_school_is/",
        "text": "One of the biggest shocks I had in med school was just how disorganized the school is. It sounds like it’s a common thing though. What are some ways your school has messed up to the detriment of the students and their education?",
        "created_utc": 1678459846,
        "upvote_ratio": 1.0
    },
    {
        "title": "Step 2 ck tutoring",
        "author": "Difficult_Ad_2277",
        "url": "https://www.reddit.com/r/medicalschool/comments/11nqxgp/step_2_ck_tutoring/",
        "text": "[removed]",
        "created_utc": 1678459165,
        "upvote_ratio": 1.0
    },
    {
        "title": "3 days til Black Monday, 7 til Match Friday",
        "author": "Innominate_Student",
        "url": "https://i.redd.it/dq3j5jn2qyma1.gif",
        "text": "",
        "created_utc": 1678458232,
        "upvote_ratio": 1.0
    },
    {
        "title": "Resources for everything needed for med school?",
        "author": "scrotalman0",
        "url": "https://www.reddit.com/r/medicalschool/comments/11nqcad/resources_for_everything_needed_for_med_school/",
        "text": "[removed]",
        "created_utc": 1678457665,
        "upvote_ratio": 1.0
    },
    {
        "title": "Attending introducing me as a doctor to patients",
        "author": "ristrettoconzucchero",
        "url": "https://www.reddit.com/r/medicalschool/comments/11nq2rz/attending_introducing_me_as_a_doctor_to_patients/",
        "text": "So basically I volunteer at a free clinic pretty frequently, where I take patient histories and round with attendings on patients as well. Often when I enter the room with an attending they introduce themselves as Dr. So and So and then introduce me as Dr. \"my first name\". Although I'm sure some gunners would salivate at that, it makes me super uncomfortable, and I don't want to have patients think that I'm a doctor when I'm not. \n\nHas anyone had any experiences like this and if so, how did you go about handling the situation?",
        "created_utc": 1678456993,
        "upvote_ratio": 1.0
    },
    {
        "title": "Drop those radiology memes here",
        "author": "lateralview",
        "url": "https://i.redd.it/3c9xdmc9lyma1.jpg",
        "text": "",
        "created_utc": 1678456612,
        "upvote_ratio": 1.0
    },
    {
        "title": "is med school doable?",
        "author": "Nervous_Celery_8732",
        "url": "https://www.reddit.com/r/medicalschool/comments/11npedq/is_med_school_doable/",
        "text": "[removed]",
        "created_utc": 1678455344,
        "upvote_ratio": 1.0
    },
    {
        "title": "When do interns generally need to be ready show up to hospital ?",
        "author": "RudolfVirchowMD",
        "url": "https://www.reddit.com/r/medicalschool/comments/11nopru/when_do_interns_generally_need_to_be_ready_show/",
        "text": "Trying to start some planning around move",
        "created_utc": 1678453568,
        "upvote_ratio": 1.0
    },
    {
        "title": "Ideas for match day plans?",
        "author": "Doingmybestinlife",
        "url": "https://www.reddit.com/r/medicalschool/comments/11noe0c/ideas_for_match_day_plans/",
        "text": "Family is far, and afaik no classmates are holding any big events that day. Any ideas (aside from getting blackout drunk in my apartment)",
        "created_utc": 1678452731,
        "upvote_ratio": 1.0
    },
    {
        "title": "Cannabis and seizure",
        "author": "Lencovic",
        "url": "https://www.reddit.com/r/medicalschool/comments/11nochd/cannabis_and_seizure/",
        "text": "I got a shower thought the other day linked to recent experience with a friend.\n\nHe has smoked a \"joint\" (I'm not sure what this term encompasses) and both times it provoked a seizure. Last time we were in a bar in Amsterdam, smoked, and suddenly he lost conciousness and had involuntary jerks lasting seconds with a postictal phase. \n\nIs it a known trigger? Was there something else in the \"joint\" that was more likely the culprit? Does mixing alcohol and cannabis contribute? \n\nOn the other hand I've read that cannabis might actually work for people with seizure disorders where other medication hasn't?",
        "created_utc": 1678452623,
        "upvote_ratio": 1.0
    },
    {
        "title": "Littmann stethoscope question",
        "author": "Incrosys",
        "url": "https://www.reddit.com/r/medicalschool/comments/11no4f6/littmann_stethoscope_question/",
        "text": "So I was thinking about which color I should get, been leaning towards the grey one, but I’ve heard that, somehow, black scrubs stain the tube and it gets dirty pretty quickly, so if there’s anyone who has a grey stethoscope that is able to confirm/deny that, it’d be greatly appreciated.",
        "created_utc": 1678452033,
        "upvote_ratio": 1.0
    },
    {
        "title": "8 SOLE Foot Orthotics - What is it?",
        "author": "mobilisae",
        "url": "https://mobilisuae.blogspot.com/2023/02/8-sole-foot-orthotics-what-is-it.html",
        "text": "",
        "created_utc": 1678451726,
        "upvote_ratio": 1.0
    },
    {
        "title": "PMA 2023 Convention",
        "author": "FuzzyTrip8486",
        "url": "https://www.reddit.com/r/medicalschool/comments/11nnufc/pma_2023_convention/",
        "text": "[removed]",
        "created_utc": 1678451298,
        "upvote_ratio": 1.0
    },
    {
        "title": "Did not realize that VSLO away rotations have already been taken",
        "author": "imreadytolearn",
        "url": "https://www.reddit.com/r/medicalschool/comments/11nn7xk/did_not_realize_that_vslo_away_rotations_have/",
        "text": "So I have already gotten my documents but am I tripping, how can the main dates July-Sept. already be gone for certain specialities??? This is so sad because I had everything planned out smh. I messed up big time",
        "created_utc": 1678449593,
        "upvote_ratio": 1.0
    },
    {
        "title": "Care and Handling of Surgical Single Use Instruments",
        "author": "jimymedical1",
        "url": "https://styloact.com/single-use-instruments/",
        "text": "",
        "created_utc": 1678448288,
        "upvote_ratio": 1.0
    },
    {
        "title": "Should radiologists interpret scans without prior knowledge of the patient’s condition?",
        "author": "lonesomefish",
        "url": "https://www.reddit.com/r/medicalschool/comments/11nml9z/should_radiologists_interpret_scans_without_prior/",
        "text": "I wonder if this would lead to less bias on interpretation, because they would be more likely to see everything, rather than focus on a few specific areas that were indicated.\n\nOr perhaps their workflow software should force them to view imaging without patient info first, and then they should do a second pass with patient info to ensure they also viewed the pertinent structures more thoroughly.\n\nIdk anything about radiology (is this already the norm?). Just a thought that came to mind. What do y’all think?",
        "created_utc": 1678447736,
        "upvote_ratio": 1.0
    },
    {
        "title": "The Advantages of Study MBBS in China",
        "author": "studymbbschina",
        "url": "https://localdigitalbusiness.org/the-advantages-of-study-mbbs-in-china/",
        "text": "",
        "created_utc": 1678447729,
        "upvote_ratio": 1.0
    },
    {
        "title": "Looking to create a podcast network!",
        "author": "mb67432",
        "url": "https://www.reddit.com/r/medicalschool/comments/11nl8w5/looking_to_create_a_podcast_network/",
        "text": "Hey guys! \nI'm a 3rd year medical student based in Ireland, and I started a podcast last year and have been (trying) to put out episodes every month. \n\nI'm looking for other med/allied health students who also have a podcast/youtube channel (or want to start one) to launch a podcast network with. \n\nWe'll be able to reach audiences and grow faster together once we're in a network, and it'll be a one-stop shop for all medical students or prospective students to gain a little insight into various different aspects of medicine.\n\nI looked around for podcast networks that I can join, but they would either charge money, have lots of restrictive rules or weren't good enough.\n\nI won't be charging anyone, I'll set up a website with my own money and won't have any dumb rules about what can or can't be posted. \n\nI'll also help you set up your own podcast, let you know about all the stuff I've learnt myself so far, get your podcast onto all streaming platforms and just create a supportive environment were we can all share ideas, help each other grow and share our passion for medicine with everyone :)\n\nI haven't started the process yet, but I'm looking for at least 5 other students and will get things running after. \n\nDM me or comment any questions you have, or if you want to join and I'll share a discord link with you :)\n\nYou can also check out my podcast here: https://anchor.fm/maniandmed \n\nCheers xx!",
        "created_utc": 1678443400,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to be competitive in the public sector?",
        "author": "DrHabMed",
        "url": "https://www.reddit.com/r/medicalschool/comments/11nk8bf/how_to_be_competitive_in_the_public_sector/",
        "text": "Poland has so far had about 18 universities that educated doctors. From the new year it will be about 40 universities. It is planned that there will be about 14,000 new doctors every year. Currently, it is about 5,000.\n\nDo you have any experience with this in your country? What to do to be competitive in the public sector (where cheaper is better)? It is known that knowledge is important, but unfortunately future hospital presidents will employ the cheapest and not the best doctors.",
        "created_utc": 1678440024,
        "upvote_ratio": 1.0
    },
    {
        "title": "What happens to the products if the pharmaceutical company went bankrupt?",
        "author": "Individual_Mango_818",
        "url": "https://www.reddit.com/r/medicalschool/comments/11njzrp/what_happens_to_the_products_if_the/",
        "text": "[removed]",
        "created_utc": 1678439211,
        "upvote_ratio": 1.0
    },
    {
        "title": "Week end acads grind",
        "author": "medically_aesthetic",
        "url": "https://www.reddit.com/r/medicalschool/comments/11njvx1/week_end_acads_grind/",
        "text": "[removed]",
        "created_utc": 1678438860,
        "upvote_ratio": 1.0
    },
    {
        "title": "preclinical student here need help with neurology",
        "author": "Even_Acanthaceae972",
        "url": "https://www.reddit.com/r/medicalschool/comments/11njpt2/preclinical_student_here_need_help_with_neurology/",
        "text": "[removed]",
        "created_utc": 1678438277,
        "upvote_ratio": 1.0
    },
    {
        "title": "What would not doing residency after medical school look like?",
        "author": "2Degen",
        "url": "https://www.reddit.com/r/medicalschool/comments/11njk20/what_would_not_doing_residency_after_medical/",
        "text": "I’ve heard about medical consulting, but what would that look like and what type of compensation are we talking? Any anecdotal evidence of people trying something off of the beat the beaten path after getting their medical degree?",
        "created_utc": 1678437715,
        "upvote_ratio": 1.0
    }
]