[
    {
        "title": "Could somebody send me this amboss article as a pdf?",
        "author": "konijn_van_holland",
        "url": "https://www.reddit.com/r/medicalschool/comments/10v0nsh/could_somebody_send_me_this_amboss_article_as_a/",
        "text": "Hi! \nI’m rotating through the transgender clinic and would like to prepare for it, but unfortunately the german amboss doesn’t have an article about it and i don’t have access to the US version.\nSo if someone could pm me the pdf, i’d be super grateful! (: \n\nhttps://www.amboss.com/us/knowledge/Principles_of_transgender_health_care/ \n\nIf this post is somehow against the rules please delete it or let me know; it wasn’t my intention!",
        "created_utc": 1675668393,
        "upvote_ratio": 1.0
    },
    {
        "title": "step 1",
        "author": "PowerTurbulent9723",
        "url": "https://www.reddit.com/r/medicalschool/comments/10uz9d3/step_1/",
        "text": "[removed]",
        "created_utc": 1675663315,
        "upvote_ratio": 1.0
    },
    {
        "title": "Me trying to explain pathophysiology after learning everything from sketchy",
        "author": "Snapling",
        "url": "https://i.redd.it/w879b71zijga1.jpg",
        "text": "",
        "created_utc": 1675659152,
        "upvote_ratio": 1.0
    },
    {
        "title": "How stupid would it be to attend a wedding during my competitive surgery Sub-I?",
        "author": "BrilliantNo6445",
        "url": "https://www.reddit.com/r/medicalschool/comments/10uxikk/how_stupid_would_it_be_to_attend_a_wedding_during/",
        "text": "A very important and close friend is getting married in a city that is a 4-hour drive away. I would not be where I am today without her. \n\nI’ve confirmed with my program that I get one day off a week. This is what I was planning on doing with that one day:\n\n1. Take 1.5 hour flight to the wedding venue\n2. Attend just the evening ceremony and cocktail reception (total 1.5 hours)\n3. Take 1.5 hour flight back home, arriving around 11pm\n\nIs this a ridiculous thing to do on while I’m essentially auditioning for this insanely competitive residency spot (one of my top choices)? Will I be wiped out and too tired to perform well the following day or even week without fully resting on this one weekend day?",
        "created_utc": 1675657617,
        "upvote_ratio": 1.0
    },
    {
        "title": "Import media ankihub help",
        "author": "Electrical_Pay_6916",
        "url": "https://i.redd.it/26627i5cdjga1.jpg",
        "text": "[removed]",
        "created_utc": 1675657282,
        "upvote_ratio": 1.0
    },
    {
        "title": "Scolded by preceptor. What should I change going forward",
        "author": "RabidPanda95",
        "url": "https://www.reddit.com/r/medicalschool/comments/10uw5qc/scolded_by_preceptor_what_should_i_change_going/",
        "text": "Just started my FM rotation. First few days went great. I see half of my preceptors patients per day, present them, and write up a note which they later review and sign. Preceptor tells me I appear to be comfortable seeing patients and likes that I’m meshing well with the clinic. On Friday, my preceptor is off but put me with an NP to work in acute care for the morning. The NP tells me to go see the first patient and write up a note. Being much more efficient than I am, the NP is done seeing 3 patients by the time I’m done with the H&amp;P and the note. This basically repeats the rest of the morning. I thought the day went well, I had good convos with the NP and we seemed to get along. I then get a phone call on the weekend from my preceptor asking why I wasn’t seeing patient’s in acute care, accuses me of being disinterested, and says they can find me somewhere else to rotate if I don’t like it here. This caught me really off guard because I spent the entire week seeing at least half the patient’s and getting nothing but good feedback previously. I just apologized for coming across that way and said I’ll work harder in the future and be more engaged. Should I do something different going forward? This feedback really caught me by surprise and makes me scared of what kind of eval I will get because there seems to be a disconnect between what they tell me in person and what they really think.",
        "created_utc": 1675653478,
        "upvote_ratio": 1.0
    },
    {
        "title": "Do people still use Student Doctor Network?",
        "author": "slurpycronut",
        "url": "https://www.reddit.com/r/medicalschool/comments/10uw3l3/do_people_still_use_student_doctor_network/",
        "text": "I feel like it used to be such a big thing but now maybe Reddit has taken over? Curious about what others think/use.",
        "created_utc": 1675653307,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to take care of mental health in med school?",
        "author": "Conscious-Brush9962",
        "url": "https://www.reddit.com/r/medicalschool/comments/10uw2fg/how_to_take_care_of_mental_health_in_med_school/",
        "text": "Hey everyone, I failed my first exam of the block and I have been really going through it. I can’t get myself to eat or drink water, just crying nonstop. I deal with anxiety and this was really hard on my mental health. I have had a very hard year with lots of losses so It’s been so tough for me to deal with this, because school has always been so important to me. Dealing with some really dark thoughts and it all feels so life and death. any advice would be appreciated",
        "created_utc": 1675653212,
        "upvote_ratio": 1.0
    },
    {
        "title": "How DOA is your ERAS with a failed Step1?",
        "author": "evedh613",
        "url": "https://www.reddit.com/r/medicalschool/comments/10uvkme/how_doa_is_your_eras_with_a_failed_step1/",
        "text": "For a US MD student.\n\nI haven’t taken it yet, that’ll be in 2 days, but with me (and others) making the mistake of underestimating this P/F test, it’s going to happen more often.\n\nI honestly, as a silly little M2, know little about what matters/doesnt for residency applications. But how bad does a fail look? Is it just a bad tiebreaker or does it seriously limit options?\n\nAnd how would you feel taking it a few days after a 65% (93% chance to pass) practice test?",
        "created_utc": 1675651795,
        "upvote_ratio": 1.0
    },
    {
        "title": "So how DOA is your ERAS really with a Step 1 fail?",
        "author": "evedh613",
        "url": "https://www.reddit.com/r/medicalschool/comments/10uvhv7/so_how_doa_is_your_eras_really_with_a_step_1_fail/",
        "text": "[removed]",
        "created_utc": 1675651565,
        "upvote_ratio": 1.0
    },
    {
        "title": "First overnight on-call shift",
        "author": "RepublicLazy5643",
        "url": "https://www.reddit.com/r/medicalschool/comments/10uvghj/first_overnight_oncall_shift/",
        "text": "[removed]",
        "created_utc": 1675651460,
        "upvote_ratio": 1.0
    },
    {
        "title": "UMiami for anesthesiology?",
        "author": "Yuuuuuuuuhh",
        "url": "https://www.reddit.com/r/medicalschool/comments/10uv7bc/umiami_for_anesthesiology/",
        "text": "Thoughts?",
        "created_utc": 1675650722,
        "upvote_ratio": 1.0
    },
    {
        "title": "Are there residency programs that your school will not allow you to rotate at?",
        "author": "Humble_Ad6404",
        "url": "https://www.reddit.com/r/medicalschool/comments/10uuu4g/are_there_residency_programs_that_your_school/",
        "text": "[removed]\n\n[View Poll](https://www.reddit.com/poll/10uuu4g)",
        "created_utc": 1675649669,
        "upvote_ratio": 1.0
    },
    {
        "title": "[California] International MD degree with US MPH degree. Should I accept a clinical research assistant job?",
        "author": "alhadithy83",
        "url": "https://www.reddit.com/r/medicalschool/comments/10uunmj/california_international_md_degree_with_us_mph/",
        "text": "[removed]",
        "created_utc": 1675649169,
        "upvote_ratio": 1.0
    },
    {
        "title": "Are doctors (of medicine and optometry) supposed to know the NATO Phonetic Alphabet?",
        "author": "3cana",
        "url": "https://www.reddit.com/r/medicalschool/comments/10ut0m0/are_doctors_of_medicine_and_optometry_supposed_to/",
        "text": "I use \"doctor\" to refer to both Doctors of Medicine and of Optometry. My military friends and I have faced this issue many times with doctors, particularly optometrists and ophthalmologists, when they ask us to read aloud the optotypes in [an eye chart](https://en.wikipedia.org/wiki/Eye_chart). We are trained to say the [NATO Phonetic Alphabet's code words](https://en.wikipedia.org/wiki/NATO_phonetic_alphabet#cite_note-alpharadio-3), necessary to prevent confusion between letters (PARTICULARLY those [Sloan letters](https://en.wikipedia.org/wiki/Sloan_letters) in  the [Snellen chart](https://en.wikipedia.org/wiki/Snellen_chart)) and numbers that ambiguously sound too similar. \n\n&gt;[Even the types of letters used are carefully chosen. You’ll notice, next time you look at an eye chart, not every letter of the alphabet is used. Only the letters C, D, E, F, L, N, O, P, T and Z. Some letters aren’t used because they can easily be identified by the human brain even if they are too blurry to be seen clearly. Only the letters C, D, E, F, L, N, O, P, T and Z.](https://www.optometrists.org/general-practice-optometry/guide-to-eye-exams/eye-exams/why-do-optometrists-use-eye-charts/)\n\nObviously, the phonetic similarity between C and Z can cause confusion. Same issue with C and P, P and T, etc... \n\nBut some doctors  gawk at us as if I am nutty, having no clue what I just said. Then they ask us to read the optotypes in \"normal\" English, which is dicey for my aforementioned reasons. Then I have to spend five minutes explaining the NATO Phonetic Alphabet, before these doctors stop gapeing and thinking I am nuts. \n\n### 1. Do medical and optometry schools teach the NATO Phonetic Alphabet? Or at least make them aware? \n\n### 2. Ought doctors be savvy of the NATO Phonetic Alphabet? Or did these practicing doctors simply forget? \n\n## https://medicalsciences.stackexchange.com/q/31977",
        "created_utc": 1675644780,
        "upvote_ratio": 1.0
    },
    {
        "title": "More of a serious topic",
        "author": "sawnah",
        "url": "https://www.reddit.com/r/medicalschool/comments/10usx44/more_of_a_serious_topic/",
        "text": "[removed]",
        "created_utc": 1675644526,
        "upvote_ratio": 1.0
    },
    {
        "title": "Question about my CV",
        "author": "Tupacinator",
        "url": "https://www.reddit.com/r/medicalschool/comments/10urzs4/question_about_my_cv/",
        "text": "Currently an M2 working on updating my CV to apply for a couple of leadership positions. Should I include volunteer hours and other extracurriculars from before I started medical school?",
        "created_utc": 1675642142,
        "upvote_ratio": 1.0
    },
    {
        "title": "AITA if I score low on communication/ethics questions?",
        "author": "Designer_Breadfruit9",
        "url": "https://www.reddit.com/r/medicalschool/comments/10urhyx/aita_if_i_score_low_on_communicationethics/",
        "text": "These test makers are so holier-than-thou and so hard to mind-read. I can't stand it. I went into STEP 1 prep thinking it would be renal path or respiratory phys that will defeat me. But no; it's more likely this stuff :/ can't I just use my instincts around patients and apologize if I'm wrong--you know, like a normal human being??",
        "created_utc": 1675640936,
        "upvote_ratio": 1.0
    },
    {
        "title": "Which celebrity/public figure/fictional character do you think would have the best bedside manners?",
        "author": "DrDOzeNuts",
        "url": "https://www.reddit.com/r/medicalschool/comments/10urh3m/which_celebritypublic_figurefictional_character/",
        "text": "Alternatively, who would have the worst bedside manners?",
        "created_utc": 1675640874,
        "upvote_ratio": 1.0
    },
    {
        "title": "step 1 tutor",
        "author": "DRVecna",
        "url": "https://www.reddit.com/r/medicalschool/comments/10uqngm/step_1_tutor/",
        "text": "[removed]",
        "created_utc": 1675638801,
        "upvote_ratio": 1.0
    },
    {
        "title": "Where are my fellow metalheads?",
        "author": "einward",
        "url": "https://thehardtimes.net/music/metalhead-makes-it-through-med-school-solely-on-memorized-carcass-lyrics/",
        "text": "",
        "created_utc": 1675636595,
        "upvote_ratio": 1.0
    },
    {
        "title": "Having second thoughts about specialty",
        "author": "crystalfire798",
        "url": "https://www.reddit.com/r/medicalschool/comments/10uoxti/having_second_thoughts_about_specialty/",
        "text": "I’ve been planning on pursuing plastic surgery for the past several months during clinical rotations, but I’m having some second thoughts from hearing anecdotes and stories about surgeons not having time for hobbies, family, relaxation, etc. I place family/relationships and relaxation very high on my priority list, but I also love being in the OR and helping with operations. Any one have advice on good specialties that can match my interests:\n\n- Prefer being in the OR much more than clinic, but would still like 1-2 days of clinic for the patient interaction \n- Despise long rounds \n- Loved open procedures (hence why Plastics drew me in), but didn’t completely hate endoscopic and laparoscopic ones \n- Not a crazy schedule (including on call) given my partner is also in medical school and will be a future doctor, so would love to consistently be able to spend time with them \n\nHappy to clarify or add anything and thanks ahead for the advice",
        "created_utc": 1675634591,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to Upload Multiple Files to VSLO? Or combine pdfs?",
        "author": "WhichBanana",
        "url": "https://www.reddit.com/r/medicalschool/comments/10uoonp/how_to_upload_multiple_files_to_vslo_or_combine/",
        "text": "Title pretty much sums it up. I'm trying to upload immunization documents to VSLO, but as far as I can tell, they only allow us to upload one file for our immunization requirements even though they're asking for documentation of the vaccines. I would just combine the pdfs all into one file, but whenever I try, I get an error message which says the source pdf documents do not allow page extraction. I can't seem to figure out which pdf is secured, but I'm guessing it would be the AAMC standardized immunization form? Is anyone else struggling with this/how do I get around this?",
        "created_utc": 1675633986,
        "upvote_ratio": 1.0
    },
    {
        "title": "Step 1 links in Wiki not working?",
        "author": "y333zy",
        "url": "https://www.reddit.com/r/medicalschool/comments/10uoi0j/step_1_links_in_wiki_not_working/",
        "text": "[removed]",
        "created_utc": 1675633538,
        "upvote_ratio": 1.0
    },
    {
        "title": "ACOG videos",
        "author": "BegoneDegenerate",
        "url": "https://www.reddit.com/r/medicalschool/comments/10uoca2/acog_videos/",
        "text": "I’ve been seeing people recommend the ACOG videos for ob/gyn, however I haven’t been able to find them on their channel. Can anyone link me the playlist or one of the vidoes?\n\nThanks",
        "created_utc": 1675633153,
        "upvote_ratio": 1.0
    },
    {
        "title": "IMGs, how long does it take to receive your H-1B visa?",
        "author": "DanceRevolutionary56",
        "url": "https://www.reddit.com/r/medicalschool/comments/10unz34/imgs_how_long_does_it_take_to_receive_your_h1b/",
        "text": "For those IMGs who have Matched to programs that have sponsored their H-1B visa, how long did it take for you to receive it after Match day? How does it work?",
        "created_utc": 1675632264,
        "upvote_ratio": 1.0
    },
    {
        "title": "Do I need to do an away rotation to secure a department chair LOR? My core rotation site only has an FM residency.",
        "author": "Good-mood-curiosity",
        "url": "https://www.reddit.com/r/medicalschool/comments/10unn7k/do_i_need_to_do_an_away_rotation_to_secure_a/",
        "text": "So I'm a 3rd year hoping to go IM and do a mix of primary care and inpatient. I thought I was almost ok on the LOR front--I have two from FM and will be getting one from a cardiologist. My program lacks an IM residency and our inpatient IM rotations have us working with a new preceptor each week so getting a purely inpatient letter here is impossible. IM residency apps recommend (require) a department chair letter. What is this, how is it secured and will I need to do an away rotation at a place with an IM residency to get it?",
        "created_utc": 1675631476,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to do cross-listed shelf questions on UWorld",
        "author": "sparkvm",
        "url": "https://www.reddit.com/r/medicalschool/comments/10una27/how_to_do_crosslisted_shelf_questions_on_uworld/",
        "text": "I'm on my last clerkship of M3 doing surgery and studying for the shelf exam on UWorld. There are some surgery questions that are cross-listed in OB/GYN and random other shelf subjects that I already completed before this rotation. Is there a way for me to filter those cross-listed questions that I may have done already while preparing for a prior shelf exam months ago? Thanks!",
        "created_utc": 1675630625,
        "upvote_ratio": 1.0
    },
    {
        "title": "Yall need to chill 😭",
        "author": "sadasscat99",
        "url": "https://i.redd.it/gfqfab5n4hga1.jpg",
        "text": "",
        "created_utc": 1675630119,
        "upvote_ratio": 1.0
    },
    {
        "title": "Bronchitis v Bronchiectasis",
        "author": "HeroesandCheerios",
        "url": "https://www.reddit.com/r/medicalschool/comments/10umy40/bronchitis_v_bronchiectasis/",
        "text": "Would we be expected to differentiate between the two on CK clinically  without imaging? If so, how? Or is the dilation of the bronchioles the only giveaway? Thank you!!",
        "created_utc": 1675629843,
        "upvote_ratio": 1.0
    },
    {
        "title": "Anyone else get this?",
        "author": "Appropriate-Tip422",
        "url": "https://www.reddit.com/r/medicalschool/comments/10umt2g/anyone_else_get_this/",
        "text": "[removed]",
        "created_utc": 1675629510,
        "upvote_ratio": 1.0
    },
    {
        "title": "Matching without Step 2 score release?? Applying FM..",
        "author": "Latter_Chocolate5461",
        "url": "https://www.reddit.com/r/medicalschool/comments/10um4uk/matching_without_step_2_score_release_applying_fm/",
        "text": "[removed]",
        "created_utc": 1675627923,
        "upvote_ratio": 1.0
    },
    {
        "title": "Which specialties do you get the least exposure to?",
        "author": "Daring_Cabbage",
        "url": "https://www.reddit.com/r/medicalschool/comments/10ulpls/which_specialties_do_you_get_the_least_exposure_to/",
        "text": "Hi! My school offers 'Selectives' for al M1s, where one afternoon a week they can follow faculty from that specialty around to learn more about it. I'd love to get some input on what specialties I should try and shadow in that time, particularly ones that I probably wouldn't get much exposure to in a standard curriculum. Thank you!",
        "created_utc": 1675626917,
        "upvote_ratio": 1.0
    },
    {
        "title": "Anyone else having a bad time in M3 year",
        "author": "jendoverforme",
        "url": "https://www.reddit.com/r/medicalschool/comments/10ulmng/anyone_else_having_a_bad_time_in_m3_year/",
        "text": "I feel like all of my friends are having a great time and get so lucky with kind attendings and residents. I’ve definitely met some great people but it feels like a mixed bag. I feel like everything that could go wrong has, minus things that are more in my control like my shelf scores and step. It’s made me really resentful of medicine and not want to do this anymore, although I think that feeling will pass. I’m just scared of it always feeling like this. Why do I sometimes feel like I’ve made a massive mistake? I had a whole career doing nonprofit work prior to getting into medical school. Now, I’m kissing ass just so I can get a good grade from an attending. I thought I’d be better able to help people if I did this. I don’t think I’m helping anyone at all and, on top of that, I’m really hurting. I don’t know anyone at my school that feels this way.  They all seem so happy and content with what they’re doing. I want to feel that way too but I don’t. I can’t be the only one?",
        "created_utc": 1675626709,
        "upvote_ratio": 1.0
    },
    {
        "title": "Best peds textbook for 3rd year rotation?",
        "author": "Fit_Future7613",
        "url": "https://www.reddit.com/r/medicalschool/comments/10ulm30/best_peds_textbook_for_3rd_year_rotation/",
        "text": "Hi everyone,\n\nDoes anyone know a good, not too dense textbook for peds that I can finish in 5-6 wks? I’m a textbook rather than Anki person, so any advice would be appreciated :) \n\nThanks!",
        "created_utc": 1675626669,
        "upvote_ratio": 1.0
    },
    {
        "title": "I don't understand how NBME is predictive of shelf if Uworld is what you need to pass. Uworld questions are VERY loosely based off maybe 60-70% of the questions.",
        "author": "Sad_Platform9466",
        "url": "https://www.reddit.com/r/medicalschool/comments/10ukrnh/i_dont_understand_how_nbme_is_predictive_of_shelf/",
        "text": "I dont understand how NBME can predict your score if the questions are VERY loosely based off Uworld. And i mean LOOSE\n\n&amp;#x200B;\n\nFor isntance i missed a question about what else yo ugive a child who has intraventricular hemmorhage since he wasnt given vitamin k. \n\n&amp;#x200B;\n\nOn uworld, we were taught they they need vitamin k, it can cause bleeding, etc. Nothing else. So i see the child i hypotensive, so i said normal saline drip to increase blood volume.\n\n&amp;#x200B;\n\nThe answer was fresh frozen plasma. The reasoning is because it contains proteins c and s. I know vitamin k is necessary for those proteins, but wtf, i didn't know that was part of FFP?! How am i supposed to magically know random facts about random things to get the answers if Uworld doesnt present it?!\n\n&amp;#x200B;\n\nI know how G6PD works and i know what causes it, but how am i supposed to know if the mom took TMP-SMX however many months ago while she was pregnant that it would continue to affect the baby?! I was only taught it could affect the child if given to him, how am i supposed to know it crosses the placenta?!?!\n\n&amp;#x200B;\n\nend of rant. Fuck this",
        "created_utc": 1675624636,
        "upvote_ratio": 1.0
    },
    {
        "title": "What do you even study during 3rd year roations?",
        "author": "CartographerTricky83",
        "url": "https://www.reddit.com/r/medicalschool/comments/10ujn1v/what_do_you_even_study_during_3rd_year_roations/",
        "text": "M2 here wondering what the studying of 3rd year entails. Specifically I'm confused on the resources to use and outlines to follow (hard for me to imagine studying without lectures in an organized way). I've heard Uworld questions is big time but this also confuses me (do you come home from rotations and automatically start doing questions for the rotation you're in?) Is there a book like First Aid for 3rd year shelves that organizes the information we need know?",
        "created_utc": 1675621986,
        "upvote_ratio": 1.0
    },
    {
        "title": "VSLO Bio Suggestions",
        "author": "Euphoric_Spell_7185",
        "url": "https://www.reddit.com/r/medicalschool/comments/10ujgwy/vslo_bio_suggestions/",
        "text": "Hello everyone.\n\nIt looks like there was a discussion on this a year ago, but I just wanted to see what the prevailing wisdom was for our current class.\n\nFor those who are in M3 and doing VSLO, are you going to put anything in your bio?\n\nA couple fellow students of mine seem to think this is a required space for writing a personal statement.\n\nBased on last year's discussion here on this sub Reddit, it seems like it is not required at all, and unnecessary.\n\nWhat do you all think? To bio, or not to bio…",
        "created_utc": 1675621583,
        "upvote_ratio": 1.0
    },
    {
        "title": "(Accidental?) Racist Joke from Professor?",
        "author": "Eastern_Network_1498",
        "url": "https://www.reddit.com/r/medicalschool/comments/10uj7dr/accidental_racist_joke_from_professor/",
        "text": "[removed]",
        "created_utc": 1675620953,
        "upvote_ratio": 1.0
    },
    {
        "title": "Have any of you gotten scholarships? PA here, wanting to go through medical school.",
        "author": "Medium-Lemons",
        "url": "https://www.reddit.com/r/medicalschool/comments/10uiwe2/have_any_of_you_gotten_scholarships_pa_here/",
        "text": "Hi all!! \n\nI’m probably a crazy person, but for a variety of reasons, I want to go to medical school. However, I already have debt from my PA program and undergrad. I’m not able to take on significantly more without scholarships. I have all the pre-reqs for med school and have scored well on the MCAT. \n\nHow did you secure scholarships?",
        "created_utc": 1675620230,
        "upvote_ratio": 1.0
    },
    {
        "title": "When is the best time to start emailing schools’ financial aid offices for scholarships offers?",
        "author": "Alternative_Ad_2734",
        "url": "https://www.reddit.com/r/medicalschool/comments/10uipey/when_is_the_best_time_to_start_emailing_schools/",
        "text": "\nI’m fortunate to be accepted to seven schools and I’ll attend to any of these schools which gives the best financial aid. Since the plan to enroll date is coming up soon, when is the best time to ask schools about their financial aid offers? I heard you can negotiate offers if you have multiple acceptances.",
        "created_utc": 1675619776,
        "upvote_ratio": 1.0
    },
    {
        "title": "Antibiotics!",
        "author": "Woodleaguelad",
        "url": "https://www.reddit.com/r/medicalschool/comments/10uilca/antibiotics/",
        "text": "Hello!\n\nDoes anyone have any insight on how to get better at selecting antibiotics? I want to get better, but every time I try to formulate an idea, the words 'vanc and zosyn' creep into my mind and cloud my judgement, lol. I am always impressed at how attendings know which to use off the bat. Do I need to re-watch sketchy? is there something else that other people have done to get better at selecting the appropriate one for a certain patient? \n\n&amp;#x200B;\n\nThanks!",
        "created_utc": 1675619485,
        "upvote_ratio": 1.0
    },
    {
        "title": "Real surgical exposure",
        "author": "lonesomefish",
        "url": "https://www.reddit.com/r/medicalschool/comments/10uikla/real_surgical_exposure/",
        "text": "Torn between medicine and surgery. Hoping to decide soon so I can dedicate time to getting research experience.\n\nI have a good amount of medicine experience due to preclinical “clerkships” where we have to take histories, do physical exams, discuss differentials, and place orders for tests/imaging. This is good because it immerses me in what medicine would be like as a career.\n\nHowever, my only experience with surgery is shadowing. It’s frustrating because I have no real exposure into what it’s like to be a surgeon. I can sit and watch a procedure, but that is much more different being the one doing the procedure and handling pre/post op care. Even once I hit 3rd year, surgery rotations might not encompass the full scope of surgical responsibilities.\n\nSo is there any way to get real surgical exposure in preclinical years? How do people even decide on pursuing surgery before their surgical rotation?",
        "created_utc": 1675619436,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can you change residency?",
        "author": "jutrmybe",
        "url": "https://www.reddit.com/r/medicalschool/comments/10uicl3/can_you_change_residency/",
        "text": "A while ago there was that graph posted here of doctor burnout by specialty and I saw the discourse under the post discussing FM's poor placement in the graph probably being due to many doctors who had to go into FM after failing to match where they wanted. So they were burnt out and skewing the data, bc they hated it and didn't want to be there to begin with. But are they stuck there? The other day I read an article about an Ortho resident who switched to EM after disliking her ortho placement. How common is that? Is it possible to switch residencies or is it just kinda a fluke that she could make happen bc she matched ortho in the first place?\n\n&amp;#x200B;\n\nKinda unrelated but imma stuff it in: can you go to residency for several things or is it just residency then you do a fellowship if you want to learn something new? Like NPs can have several specialities, can MD/DOs? If time wasn't a factor, could you do it or is it med illegal? Not a super serious question, just wondering on this one.",
        "created_utc": 1675618889,
        "upvote_ratio": 1.0
    },
    {
        "title": "Productivity hacks",
        "author": "HeroesandCheerios",
        "url": "https://www.reddit.com/r/medicalschool/comments/10ui4ev/productivity_hacks/",
        "text": "Share your low key most productive actions (or lack of action...) that allow you to get more stuff done for longer.",
        "created_utc": 1675618355,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does your country have Community Medicine in its med school curriculum?",
        "author": "Significant_Yak8708",
        "url": "https://i.redd.it/4h50tlm04gga1.jpg",
        "text": "Med student from India here, we have Community Medicine ( Preventive and Social Medicine). \nApart from the Biostatistics Competency I find everything else pointless. \nWe learn things such as chlorination of water, insect and larve control methods, health programs in the country, water treatment methods, sewage treatment methods etc in detail. \n\nDoes your country have anything similar to this?",
        "created_utc": 1675617804,
        "upvote_ratio": 1.0
    },
    {
        "title": "Professor making racist joke?",
        "author": "Original-Rope-5513",
        "url": "https://www.reddit.com/r/medicalschool/comments/10uhsd0/professor_making_racist_joke/",
        "text": "[removed]",
        "created_utc": 1675617564,
        "upvote_ratio": 1.0
    },
    {
        "title": "4th Year Radiology Aways",
        "author": "gcs1738",
        "url": "https://www.reddit.com/r/medicalschool/comments/10uhn04/4th_year_radiology_aways/",
        "text": "[removed]",
        "created_utc": 1675617205,
        "upvote_ratio": 1.0
    },
    {
        "title": "Should I join my local IFMSA? Why or why not?",
        "author": "StudyOrNotToStudy",
        "url": "https://www.reddit.com/r/medicalschool/comments/10uhg5r/should_i_join_my_local_ifmsa_why_or_why_not/",
        "text": "Would be interested to hear your thoughts, especially from those who are members.",
        "created_utc": 1675616759,
        "upvote_ratio": 1.0
    },
    {
        "title": "Should I join my local IFMSA? Why or why no?",
        "author": "StudyOrNotToStudy",
        "url": "https://www.reddit.com/r/medicalschool/comments/10uhf63/should_i_join_my_local_ifmsa_why_or_why_no/",
        "text": "Would be interested to hear your thoughts especially those who are members.",
        "created_utc": 1675616696,
        "upvote_ratio": 1.0
    },
    {
        "title": "What does 'secondary to' mean?",
        "author": "OPPTime",
        "url": "https://www.reddit.com/r/medicalschool/comments/10uhcuv/what_does_secondary_to_mean/",
        "text": "I feel like this question is too stupid to ask the clinicians that have been using it in front of me and google has given me nothing. \n\nAt the risk of sounding like the stupidest redditor that has ever graced this sub, can someone please confirm what 'secondary to' means. Does it just mean caused by or is it more nuanced than that?\nE.g. lacunar strokes often occur secondary to hyaline arteriosclerosis",
        "created_utc": 1675616535,
        "upvote_ratio": 1.0
    },
    {
        "title": "ChatGPT",
        "author": "WillPass101",
        "url": "https://www.reddit.com/r/medicalschool/comments/10uh3za/chatgpt/",
        "text": "Think it can pass step/level/med school exams?",
        "created_utc": 1675615939,
        "upvote_ratio": 1.0
    },
    {
        "title": "Average age of surgery residents",
        "author": "ScoobyDogs",
        "url": "https://www.reddit.com/r/medicalschool/comments/10uguj9/average_age_of_surgery_residents/",
        "text": "What’s the average age of surgery residents?",
        "created_utc": 1675615272,
        "upvote_ratio": 1.0
    },
    {
        "title": "Advice to those applying to competitive or even semi-competitive specialties",
        "author": "dreamcicle11",
        "url": "https://www.reddit.com/r/medicalschool/comments/10ugre5/advice_to_those_applying_to_competitive_or_even/",
        "text": "I am the wife of a current prelim resident who did not match last year into a very competitive specialty and who even has concerns about matching this year. We have been through SOAP and have thought about this very thoroughly for over a year but we’re not really truly prepared for it last year.\n\n1. You are important, worthy of love, not a disappointment, and still cut out for medicine if that’s what you want to do regardless if you match or not. Please know that and make sure you don’t let this god forsaken system rob you of your joy and fulfillment.\n\n2. Make sure you are physically located by your medical school on Monday morning during Match week. We know people who didn’t match into general surgery, ortho, obgyn, etc. Make sure you are able to get to the medical school because they will usually have support staff there to help you navigate, edit your app, and provide counseling.\n\n3. Have someone with you if you’re able who you trust and can provide emotional support. \n\n4. Try to mentally prepare for best and worst case scenarios now. It will 100% help you. Begin thinking about contingency plans. If you already have a lot of research, maybe a prelim year is for you. Can you delay graduation? This might require you to not have completed requirements to graduate before match week. If you decide to try to SOAP into a different specialty, what would you want to do? There are only 45 (at least that’s what it was last year) applications you get. Do your research and some real introspection.\n\n5. If you decided to go into a different specialty, write alternate personal statements now. Ask for recommendation letters from faculty in those departments now. If you don’t know faculty in those departments, reach out to admin.\n\n6. If you think you might want to leave medicine altogether, please close Reddit and truly think about it. My husband might do this, but there’s really little chance of turning back if that’s what you choose to do. If you don’t see yourself actually practicing medicine and enjoy medicine/ healthcare for other reasons whether that’s research, business, etc. then there are likely other paths for you. It’s just a pretty serious decision that I probably wouldn’t recommend making until you’ve at least completed intern year in something. \n\nBest of luck and hope you all match and/ or are at least at peace with what happens!!!",
        "created_utc": 1675615064,
        "upvote_ratio": 1.0
    },
    {
        "title": "Please recommend which book you found best for learning clinical examination",
        "author": "SanSattasi",
        "url": "https://www.reddit.com/r/medicalschool/comments/10ughl3/please_recommend_which_book_you_found_best_for/",
        "text": "Looking for books recommendation for each system Cardiology, Neurology, Respiratory, Gastroenterology. For cardiac o have heard Abrams is good (however i couldn't find it anywhere ). Hutchinson covers basics but it doesn't cover each and everything (it's my favorite book btw). I am looking for advance books recommend for fellowships programs.",
        "created_utc": 1675614385,
        "upvote_ratio": 1.0
    },
    {
        "title": "Doctors Aren’t Burned Out From Overwork. We’re Demoralized by Our Health System.",
        "author": "SimilarPlate",
        "url": "https://www.nytimes.com/2023/02/05/opinion/doctors-universal-health-care.html?smid=re-share",
        "text": "",
        "created_utc": 1675613997,
        "upvote_ratio": 1.0
    },
    {
        "title": "Question banks",
        "author": "raspberryyy_",
        "url": "https://www.reddit.com/r/medicalschool/comments/10ug40v/question_banks/",
        "text": "Md2 from Aus here, wondering what everyone’s experiences are with question banks - I’ve heard US students using uworld, I’ve tried amboss and BMJ… anyone tried any/all of them or others and can recommend ?",
        "created_utc": 1675613433,
        "upvote_ratio": 1.0
    },
    {
        "title": "“We’re Still Gonna Say No”: Inside UnitedHealthcare’s Effort to Deny Coverage to Chronically Ill Patient",
        "author": "Intelligent_Web_7688",
        "url": "https://www.reddit.com/r/medicalschool/comments/10ufrx7/were_still_gonna_say_no_inside_unitedhealthcares/",
        "text": "[https://www.propublica.org/article/unitedhealth-healthcare-insurance-denial-ulcerative-colitis?utm\\_source=pocket-newtab](https://www.propublica.org/article/unitedhealth-healthcare-insurance-denial-ulcerative-colitis?utm_source=pocket-newtab)",
        "created_utc": 1675612605,
        "upvote_ratio": 1.0
    },
    {
        "title": "How does hypoxemia cause pulmonary hypertension?",
        "author": "wannabegoodandbad",
        "url": "https://www.reddit.com/r/medicalschool/comments/10ufn6r/how_does_hypoxemia_cause_pulmonary_hypertension/",
        "text": "So I know that there are many causes for pulmonary hypertension like obstruction and heart dysfunction, but how and why is low oxygen saturation a cause?\n\nWhat is the mechanism with which low oxygen (for whatever reason) causes the pulmonary arteries to constrict? It seems counterintuitive, because they should dilate to allow more blood flow to the lungs, so the O2 levels can increase.",
        "created_utc": 1675612271,
        "upvote_ratio": 1.0
    },
    {
        "title": "We figure out what's going on at some point, right? Right?",
        "author": "WillOfTheSon",
        "url": "https://i.redd.it/2rlwxqpenfga1.jpg",
        "text": "",
        "created_utc": 1675612216,
        "upvote_ratio": 1.0
    },
    {
        "title": "Hey Class of 2024, when do we start collectively freaking out about ERAS?",
        "author": "DocDino_",
        "url": "https://www.reddit.com/r/medicalschool/comments/10ufb6c/hey_class_of_2024_when_do_we_start_collectively/",
        "text": "Only asking so that I can have it in my calendar",
        "created_utc": 1675611396,
        "upvote_ratio": 1.0
    },
    {
        "title": "Any research or innovations which actually did something?",
        "author": "Plus_Yam_1889",
        "url": "https://www.reddit.com/r/medicalschool/comments/10ud4lk/any_research_or_innovations_which_actually_did/",
        "text": "Im curious if anyone who partook in any research program either as part of  the school curriculum or themselves out of passion and found themselves actually finding some really important information or developing some concepts, perhaps even going beyond  and turning it into some sort of venture \n\nI usually hear that students often just try and get this done for the heck of it to get their names on any paper",
        "created_utc": 1675605641,
        "upvote_ratio": 1.0
    },
    {
        "title": "Where can I get research with a low GPA?",
        "author": "sukhbaby",
        "url": "https://www.reddit.com/r/medicalschool/comments/10ucs45/where_can_i_get_research_with_a_low_gpa/",
        "text": "I’m an M1 and I’ve passed all of my classes but got too many C’s which messed up my GPA. Unfortunately that means I can’t participate in a lot of school extracurriculars including the small amounts of research I have.\n\nWhere can I get research where my grades won’t be asked about?",
        "created_utc": 1675604648,
        "upvote_ratio": 1.0
    },
    {
        "title": "Where can I get research positions with a low GPA?",
        "author": "sadnbadgal",
        "url": "https://www.reddit.com/r/medicalschool/comments/10ucqjg/where_can_i_get_research_positions_with_a_low_gpa/",
        "text": "[removed]",
        "created_utc": 1675604514,
        "upvote_ratio": 1.0
    },
    {
        "title": "On a psych rotation, scrubs ok?",
        "author": "Advicepls5",
        "url": "https://www.reddit.com/r/medicalschool/comments/10uc3rb/on_a_psych_rotation_scrubs_ok/",
        "text": "It's a third yr elective- more of a consult service- Ive seen a couple of the residents wearing scrubs- all the attendings wear something business casual. On my first week I also wore a button down- but curious if I can also wear scrubs? \n\nthanks all",
        "created_utc": 1675602623,
        "upvote_ratio": 1.0
    },
    {
        "title": "Transfer uni’s on GEM course",
        "author": "AddendumGloomy2193",
        "url": "https://www.reddit.com/r/medicalschool/comments/10ubgb2/transfer_unis_on_gem_course/",
        "text": "[removed]",
        "created_utc": 1675600552,
        "upvote_ratio": 1.0
    },
    {
        "title": "If you're considering a surgical specialty (or having kids in residency), a reflective piece from the partner of a surgeon",
        "author": "grape-of-wrath",
        "url": "https://www.reddit.com/r/medicalschool/comments/10uauky/if_youre_considering_a_surgical_specialty_or/",
        "text": "[\"Mama's at Work\" - perspective from a doctor's spouse](https://www.reddit.com/r/MedSpouse/comments/10st43n/mamas_at_work_perspective_from_a_doctors_spouse/?utm_source=share&amp;utm_medium=ios_app&amp;utm_name=iossmf)",
        "created_utc": 1675598346,
        "upvote_ratio": 1.0
    },
    {
        "title": "MONEY. All I want is MONEY",
        "author": "kewllol",
        "url": "https://www.reddit.com/r/medicalschool/comments/10u8jb7/money_all_i_want_is_money/",
        "text": "I don’t get the way most of y’all think. I don’t care about being “fulfilled” I’m here for the MONEY. I’m talking &gt;500k right out of residency. What do I need on my resume to get the most MONEY. Which speciality gets me PAID THE BEST. All I care about in this field is MONEY. That’s why I’m in med school. I don’t want to laugh and play with y’all. I don’t want to be buddy buddy with y’all. I’m here for the MONEY.",
        "created_utc": 1675588888,
        "upvote_ratio": 1.0
    },
    {
        "title": "I have a crazy appetite",
        "author": "Full-Reflection9228",
        "url": "https://www.reddit.com/r/medicalschool/comments/10u8drk/i_have_a_crazy_appetite/",
        "text": "I am gaining to much weight and want to know what  appetite suppressant I should try",
        "created_utc": 1675588229,
        "upvote_ratio": 1.0
    },
    {
        "title": "Poop",
        "author": "Background_Ad7656",
        "url": "https://www.reddit.com/r/medicalschool/comments/10u6kt2/poop/",
        "text": "When I try to poop, a liquid that looks like red wine comes out",
        "created_utc": 1675581172,
        "upvote_ratio": 1.0
    },
    {
        "title": "What are some related fun/informative discords to join?",
        "author": "twopeas_onepod",
        "url": "https://www.reddit.com/r/medicalschool/comments/10u6j8o/what_are_some_related_funinformative_discords_to/",
        "text": "[removed]",
        "created_utc": 1675581010,
        "upvote_ratio": 1.0
    },
    {
        "title": "PSA: Really useful IPhone feature for typing! Hold spacebar to easily move around the cursor!",
        "author": "I_want_to_die_14",
        "url": "https://v.redd.it/fezr0qzv3cga1",
        "text": "",
        "created_utc": 1675569336,
        "upvote_ratio": 1.0
    },
    {
        "title": "Anyone else notice \"The Office\" references on AMBOSS?? 🐐",
        "author": "Love_Medicine",
        "url": "https://www.reddit.com/r/medicalschool/comments/10tzwhq/anyone_else_notice_the_office_references_on_amboss/",
        "text": "I would post the screenshot if it wasn't against the rules but here it goes: \n\nA 44-year-old man is brought to the emergency department by a coworker 2 hours after accidentally burning his foot on an electric grill that he keeps next to his bed because he likes to wake up to the smell of bacon. He initially decided to go to work despite his injury but felt like it was “too serious to ignore.” ....\n\nI wish they had included a pic of M.J. Fox's burnt foot to answer this question about skin findings haha\n\nLoved their qbank for Step2/Level 2 but this is next level greatness right here.",
        "created_utc": 1675568126,
        "upvote_ratio": 1.0
    },
    {
        "title": "For residency applications do we need to write a personal statement for each program we apply to?",
        "author": "BlueVestDragon",
        "url": "https://www.reddit.com/r/medicalschool/comments/10tzdw0/for_residency_applications_do_we_need_to_write_a/",
        "text": "Title sums it up. Thank you.",
        "created_utc": 1675566557,
        "upvote_ratio": 1.0
    },
    {
        "title": "He strikes again - sexism part 2",
        "author": "Oupme",
        "url": "https://i.redd.it/yblqr5cn8aga1.jpg",
        "text": "",
        "created_utc": 1675564771,
        "upvote_ratio": 1.0
    },
    {
        "title": "He strikes again",
        "author": "Oupme",
        "url": "https://i.redd.it/f6vf9ncs7aga1.jpg",
        "text": "",
        "created_utc": 1675564606,
        "upvote_ratio": 1.0
    },
    {
        "title": "High MCAT, Low GPA students, how are you doing in medical school right now?",
        "author": "dilationandcurretage",
        "url": "https://www.reddit.com/r/medicalschool/comments/10txp4z/high_mcat_low_gpa_students_how_are_you_doing_in/",
        "text": "Was just wondering.\n\nI have a sub 3.2 for both cGPA/sGPA and +90th percentile MCAT. \n\nWas just wondering if you felt ready for medical school?\n\nI wanna believe I am, considering all the new study techniques I learned for the MCAT, but I just wanted to hear from other students with similar stats?\n\nI'm worried that, since I didn't get a high GPA I'm missing out on other habits that'd help me in medical school.\n\nMy main issue was just lack of maturity and family issues in undergrad. I was also not really valuing my opportunity to even be in school. But I've changed a lot and believe I'll succeed, but I'm not sure. 😅\n\nI plan to get in and learn from my own peer's schedule and habits.",
        "created_utc": 1675561618,
        "upvote_ratio": 1.0
    },
    {
        "title": "Those of you that switched intended specialty during med school, had you ever shadowed the one you originally wanted to do prior to med school?",
        "author": "throwaway15642578",
        "url": "https://www.reddit.com/r/medicalschool/comments/10twqq8/those_of_you_that_switched_intended_specialty/",
        "text": "I always hear that a lot of people switch specialties, but I’m curious as to how much you interacted with that specialty and those physicians prior to applying.",
        "created_utc": 1675558891,
        "upvote_ratio": 1.0
    },
    {
        "title": "If gynecology was its own specialty, would it be as competitive as the other surgical subspecialties?",
        "author": "ThinEvent",
        "url": "https://www.reddit.com/r/medicalschool/comments/10twij7/if_gynecology_was_its_own_specialty_would_it_be/",
        "text": "Is being tied to OB that much of a negative",
        "created_utc": 1675558281,
        "upvote_ratio": 1.0
    },
    {
        "title": "COMLEX Level 2 Ethics - Super PO'd and over it",
        "author": "poor_dentition",
        "url": "https://www.reddit.com/r/medicalschool/comments/10twe1h/comlex_level_2_ethics_super_pod_and_over_it/",
        "text": "Basically the title. Professionalism/Ethics makes up SEVEN FREAKING PERCENT of Level 2. The ethics questions I've come across on COMBANK are super niche - I've already bought and read Medical Ethics for the Boards &amp; done anki for it. It doesn't come close to answering most of these godforsaken questions.  \n\nI'm super annoyed, and for some reason I have an inclination to spite NBOME by reading the f@\\*$ing AMA code of ethics and making an anki deck of it. I want to spite them by absolutely smashing it. Yes this is nerdy spite.  \n\nI know it's too much... what else can I do though!??!? Ugh",
        "created_utc": 1675557942,
        "upvote_ratio": 1.0
    },
    {
        "title": "Deciding on a specialty",
        "author": "Agitated_Fault_2468",
        "url": "https://www.reddit.com/r/medicalschool/comments/10tuwrn/deciding_on_a_specialty/",
        "text": "I’m a little over half way through with my third year rotations and I’ve discovered that I love doing procedures and being in the OR. I’m having a hard time deciding on a speciality (surgery or anesthesia). Any recommendations or advice?",
        "created_utc": 1675553947,
        "upvote_ratio": 1.0
    },
    {
        "title": "Hospitals making money from trans surgery and medication",
        "author": "karrymchugh",
        "url": "https://youtube.com/watch?v=EgyTkiAEwTE&amp;feature=share",
        "text": "",
        "created_utc": 1675553030,
        "upvote_ratio": 1.0
    },
    {
        "title": "What are the most chronic illness friendly specialities for lifestyle and residency",
        "author": "Rose_455",
        "url": "https://www.reddit.com/r/medicalschool/comments/10ttx1e/what_are_the_most_chronic_illness_friendly/",
        "text": "Other than the obvious, which is psych",
        "created_utc": 1675551381,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can someone explain to me the hype of wearing Patagonia?",
        "author": "albasirantar",
        "url": "https://www.reddit.com/r/medicalschool/comments/10ttsw9/can_someone_explain_to_me_the_hype_of_wearing/",
        "text": "Mostly everyone at my school purchased an overpriced jacket for 200$. \n\nWhile I’m here wearing my hoodie from Goodwill. \n\nLmfao.",
        "created_utc": 1675551079,
        "upvote_ratio": 1.0
    },
    {
        "title": "Suggestions for antibiotic coverage?",
        "author": "Alexjff69",
        "url": "https://www.reddit.com/r/medicalschool/comments/10ttqa7/suggestions_for_antibiotic_coverage/",
        "text": "Hey, I am wondering how I should study antibiotic coverage. I am thinking of ditching first aid on this one (as the information seems kind of scattered...) and just memorizing a chart online, like the bugdrugdx one. What are your thoughts?",
        "created_utc": 1675550891,
        "upvote_ratio": 1.0
    },
    {
        "title": "Chances for Academic IM??",
        "author": "Ndtp-gen",
        "url": "https://www.reddit.com/r/medicalschool/comments/10ttkim/chances_for_academic_im/",
        "text": "I’m a DO student from the South. Passed Comlex 1 (&lt;430) but failed Step 1 before 3th year. Then I failed Comlex 2 (390), passed the retake (low 500s). I didn’t apply for residencies last year. I’m now considering if it’s worth to retake Step 1 to have chances at Academic IM programs? Especially now it becomes P/F. I want to do PCCM fellowship afterwards. Has anyone ever successfully matched into Academic IM programs after failing boards before? Please advice!!!",
        "created_utc": 1675550486,
        "upvote_ratio": 1.0
    },
    {
        "title": "Failed Step 1. Chances for academic IM??",
        "author": "Ndtp-gen",
        "url": "https://www.reddit.com/r/medicalschool/comments/10tt6g7/failed_step_1_chances_for_academic_im/",
        "text": "[removed]",
        "created_utc": 1675549478,
        "upvote_ratio": 1.0
    },
    {
        "title": "Great Value brand PQs",
        "author": "dbdnt",
        "url": "https://i.redd.it/bt5o89zxy8ga1.png",
        "text": "",
        "created_utc": 1675549419,
        "upvote_ratio": 1.0
    },
    {
        "title": "Of course he won’t admit that 500 of those daily cards are from the “how to talk to women” deck.",
        "author": "Shonuff_of_NYC",
        "url": "https://v.redd.it/073ts8jlgaga1",
        "text": "",
        "created_utc": 1675549402,
        "upvote_ratio": 1.0
    },
    {
        "title": "Fragile X",
        "author": "HeroesandCheerios",
        "url": "https://www.reddit.com/r/medicalschool/comments/10tszps/fragile_x/",
        "text": "I have read the FragileX is caused by a mutation in the FMR1 gene; I have also heard that it is caused by trinucleotide (CGG repeats); are these the same thing? IE; is the mutation that we have these repeats?",
        "created_utc": 1675549008,
        "upvote_ratio": 1.0
    },
    {
        "title": "My gf vs my career?",
        "author": "Appropriate-Ad-8945",
        "url": "https://www.reddit.com/r/medicalschool/comments/10tsx25/my_gf_vs_my_career/",
        "text": "Seeing an amazing girl for 8 months. She’s in law school. I’m in med school. We both had serious intentions when starting the relationship. I’m 28 and she’s 26. \n\nHowever, while we haven’t talked about it I keep thinking about our future. In 1.5 years she graduates and has to pursue an internship. I graduate in 2 years and will have to go for residency. \n\nA few times over the last several months she said that she wants to do her internship in a different state, living life, and exploring the world for a few years while she’s young. \n\nI want to do ENT and was talking to her yesterday about how I just need to grind through residency before being able to enjoy the fruits of my labor. She responded to me saying “Yeah that’s true but you won’t be able to live life to the fullest in what is supposed to be the peak years of your life.”\n\nThat really hit me hard when she said that and has made me think if medicine is even worth it. I feel like my gf will drop me in a year when she realizes the amount of work medicine is when I’m on my away rotations and how that impacts my ability to even maintain a relationship at its bare minimum. \n\nAlso, sometimes I think about whether sacrificing my 20’s and early 30’s was worth it for a career with declining prestige and pay when I will miss out on so many life experiences and relationships. \n\nHow do you guys cope with this struggle and how do you suggest I go about approaching my relationship with my gf? I don’t want to invest so much emotion and energy just to have my heart broken an year down the line.",
        "created_utc": 1675548826,
        "upvote_ratio": 1.0
    },
    {
        "title": "Study Playlist",
        "author": "danhoel999",
        "url": "https://www.reddit.com/r/medicalschool/comments/10tsw03/study_playlist/",
        "text": "Hey guys,   \nHaving a study playlist helps me enormously in studying for med school. Keeps me more focused and concentrated. Hope I can inspire someone here and/or help you guys out:",
        "created_utc": 1675548749,
        "upvote_ratio": 1.0
    },
    {
        "title": "Quitting, alternatives to explore?",
        "author": "Ginmajiryu",
        "url": "https://www.reddit.com/r/medicalschool/comments/10trrgm/quitting_alternatives_to_explore/",
        "text": "Got in and decided I don’t wanna do this anymore. I don’t like interacting with 15 different people with all their issues, documenting and all that I’ve realized. Medicine isn’t for me. I’d rather make a lower salary and not be stressed all the time. What are some alternatives you guys know? Finance? Accounting? Any help would be nice",
        "created_utc": 1675545946,
        "upvote_ratio": 1.0
    },
    {
        "title": "Student Employment VS Academic Performance",
        "author": "New_Willingness_3728",
        "url": "https://www.reddit.com/r/medicalschool/comments/10tro8y/student_employment_vs_academic_performance/",
        "text": "[removed]",
        "created_utc": 1675545714,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why is no one talking about this?",
        "author": "far_east_northwest",
        "url": "https://www.reddit.com/r/medicalschool/comments/10trn8h/why_is_no_one_talking_about_this/",
        "text": "Why do hospital scrub pants not have front pockets???",
        "created_utc": 1675545646,
        "upvote_ratio": 1.0
    },
    {
        "title": "just giving you all some entertainment with what it’s like dating as a dr in 2023 lol 🍵",
        "author": "almostdoctorposting",
        "url": "https://i.redd.it/3shbrx2b4aga1.jpg",
        "text": "",
        "created_utc": 1675545258,
        "upvote_ratio": 1.0
    },
    {
        "title": "“Why do you want to be a surgeon?”",
        "author": "Resident_Physician",
        "url": "https://i.redd.it/zf272y4f1aga1.jpg",
        "text": "Every M4’s response:",
        "created_utc": 1675544303,
        "upvote_ratio": 1.0
    }
]