[
    {
        "title": "Hobbyless",
        "author": "Temporary-Put5303",
        "url": "https://www.reddit.com/r/medicalschool/comments/10oht65/hobbyless/",
        "text": "Anyone else realizing as they start to think about applying to residency that they gave up most (if not all) of their hobbies just to survive in med school?\n\nI used to do a ton of fun things. I was very involved with music (literally got a Bachelors in it), but during med school, I barely touched my instrument. I just never had time or energy. I was in great shape, now I can barely run a few miles (though at least I can still put running down as a hobby I guess). I used to read for fun, now I can’t even remember the last thing I read.\n\nMy actual hobbies in med school have been sleeping, drinking coffee, something social once a month at max, and keeping myself and my dog alive. \n\nI think I am actually ok with the fact most of my hobbies died, but now I have to be judged on the fact that my new “hobbies” are boring/normal or that I didn’t “make” time for them? You literally can’t win in med school.",
        "created_utc": 1675024492,
        "upvote_ratio": 1.0
    },
    {
        "title": "Parent and med school",
        "author": "theonezepphyr",
        "url": "https://www.reddit.com/r/medicalschool/comments/10ohr8w/parent_and_med_school/",
        "text": "Hey all.\nI’m a rising 3rd year reflecting on the things I’ve done thus far as a med student leading up to clinical rotations. My spouse and I had a child very early on in med school, so a great deal of my time outside of school (“hobbies”) is taking care of my baby. As a result, a lot of the prior hobbies I used to do have been thrown by the wayside, and I haven’t really had the chance to spend any meaningful time doing community service or other activities. (Some small stints here and there.)\nI wanted to know if there was anywhere in the residency application, or where I might best reflect this on my application (eg. hobbies, personal statement)? Or if it is something that I should leave out entirely? \nLove to hear any thoughts on this; appreciate it.",
        "created_utc": 1675024368,
        "upvote_ratio": 1.0
    },
    {
        "title": "whats the difference Culturette between Starswab II",
        "author": "itsher_17",
        "url": "https://www.reddit.com/r/medicalschool/comments/10oh3t0/whats_the_difference_culturette_between_starswab/",
        "text": "hi pl help",
        "created_utc": 1675022816,
        "upvote_ratio": 1.0
    },
    {
        "title": "Anyone failed their first year in medical school but managed to match at a high tier program or a competitive specialty?",
        "author": "Spartichoke",
        "url": "https://www.reddit.com/r/medicalschool/comments/10ogyhr/anyone_failed_their_first_year_in_medical_school/",
        "text": " I failed my first year but have improved significantly and don't want a mistake I made so long ago to overshadow everything I've done since then. Unfortunately, I just have it in my heart to really want to enter ortho. I ended up getting a great step 2 score (\\~260) and have approximately 30 poster presentations and 4 publications but I'm just worried that good programs or competitive specialties will just screen me before seeing my entire application.\n\nI'd like to know if anyone has any success stories or any advice. Would appreciate if you could also say what specialty you were going for. Thanks.",
        "created_utc": 1675022472,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is outsourcing my private medical practice profitable?",
        "author": "MrMarkson",
        "url": "https://www.reddit.com/r/medicalschool/comments/10oguwp/is_outsourcing_my_private_medical_practice/",
        "text": "Hey, I am a medical student from Germany. Lately I thought about how to maximize profit when I work as a doctor in the US. Is it profitable to open a chain of private practices and outsourcing everything after making sure that all operations run smoothly? \n\nIs there maybe someone here who did this? I would love to hear about it :)",
        "created_utc": 1675022247,
        "upvote_ratio": 1.0
    },
    {
        "title": "Forward: Looking for Authors, Editors and Artists",
        "author": "CM_1996_",
        "url": "https://www.reddit.com/r/medicalschool/comments/10ofq49/forward_looking_for_authors_editors_and_artists/",
        "text": "[removed]",
        "created_utc": 1675019541,
        "upvote_ratio": 1.0
    },
    {
        "title": "What to wear to a second look where you are shadowing?",
        "author": "Potential-Storm-7171",
        "url": "https://www.reddit.com/r/medicalschool/comments/10ofci7/what_to_wear_to_a_second_look_where_you_are/",
        "text": "Going to a second look tomorrow for a family residency program and its basically just joining the inpatient team for rounds and then heading to the outpatient clinic to shadow. They said to dress “like you were going to see a patient” lol so either scrubs or business clothes with a white coat? But the problem is my white coat has my schools name on it so maybe i should just wear business clothes but that seems weird. And just scrubs seems too casual for a second look😭 \n\nlmao im probably overthinking but what do you guys recommend/ have you been to a second look thats set up like this?",
        "created_utc": 1675018655,
        "upvote_ratio": 1.0
    },
    {
        "title": "Looking for Authors, Editors and Artists",
        "author": "TAG_2022",
        "url": "https://www.reddit.com/r/medicalschool/comments/10of6ih/looking_for_authors_editors_and_artists/",
        "text": "[removed]",
        "created_utc": 1675018249,
        "upvote_ratio": 1.0
    },
    {
        "title": "Taking notes during a clerkship or rotation",
        "author": "DrFoufPizza",
        "url": "https://www.reddit.com/r/medicalschool/comments/10of1tx/taking_notes_during_a_clerkship_or_rotation/",
        "text": "Hi all. A small intro for context: I'm a 3rd year medical student in Italy and I'm starting my clerkships in a couple of weeks.\n\nMy question is: how do you think is the best way to take notes during a clerkship while also learning the practical part? I'm talking paper vs digital, what topics to write down, when to write, procedure description, etc... \n\nIf you had to suggest a layout clerkship notes, what would it be? How to divide each page?\n\nThanks!",
        "created_utc": 1675017934,
        "upvote_ratio": 1.0
    },
    {
        "title": "Anyone else with social anxiety try meds? Worried about side effects with SSRI and wanted to hear others experiences",
        "author": "tropicalness",
        "url": "https://www.reddit.com/r/medicalschool/comments/10oer0l/anyone_else_with_social_anxiety_try_meds_worried/",
        "text": "I have some social anxiety that has made medical school and relationships a little difficult. I started a low dose beta blocker for physical symptoms which has been helpful but the negative thought spirals and low self esteem are of course still there. I’ve been able to get through things just fine but I think that my quality of life could improve significantly if I’m able to work on the cognitive and low self esteem components of the social anxiety. I have tried CBT which has not been very helpful \n\nI’m going to talk to psychiatrist today about trying SSRI but I am concern about the side effects especially the sexual ones. I know it’s a pro versus cons thing but I have also read reports that the sexual dysfunction can persist even after getting off meds so that is scary. \n\nHas anybody else been in a similar situation? With social anxiety or meds in general? I appreciate any insights and advice.",
        "created_utc": 1675017208,
        "upvote_ratio": 1.0
    },
    {
        "title": "Frank-Starling's law... what is it about?",
        "author": "sistolicpressuree",
        "url": "https://www.reddit.com/r/medicalschool/comments/10oekp2/frankstarlings_law_what_is_it_about/",
        "text": "[removed]",
        "created_utc": 1675016787,
        "upvote_ratio": 1.0
    },
    {
        "title": "As an M4 just here for the memes:",
        "author": "emperorbubby",
        "url": "https://i.redd.it/0m9e2i7vw0fa1.jpg",
        "text": "",
        "created_utc": 1675016055,
        "upvote_ratio": 1.0
    },
    {
        "title": "Those of you with social anxiety - have meds helped? I want to try SSRI but worried about side effects",
        "author": "flyingflamingoz",
        "url": "https://www.reddit.com/r/medicalschool/comments/10oe6z2/those_of_you_with_social_anxiety_have_meds_helped/",
        "text": "[removed]",
        "created_utc": 1675015877,
        "upvote_ratio": 1.0
    },
    {
        "title": "Gauges as a doctor?",
        "author": "DoctorDiabeto",
        "url": "https://www.reddit.com/r/medicalschool/comments/10odom2/gauges_as_a_doctor/",
        "text": "So we’ve gradually started accepting tattoos… what about gauges? Like small small ones (like the fake ones even). I’m a guy and I’ve just never seen a male physician with this look. It’s something I’ve wanted to do for a long time but I also fear that it would make patients uncomfortable or cause attendings to view me differently.\n\nAs for specialties I’m thinking peds, psych, PMR maybe. I think for peds I’d take them out at work, but this is mainly a question for rotations. Thank you!",
        "created_utc": 1675014666,
        "upvote_ratio": 1.0
    },
    {
        "title": "IM for Primary Care",
        "author": "jcash111",
        "url": "https://www.reddit.com/r/medicalschool/comments/10odkfb/im_for_primary_care/",
        "text": "Hi, I'm an MS4 and I applied to IM this cycle; I was torn between FM/IM most of school. I chose IM because I wanted more subspecialty training and was interested in hospital medicine. Now I'm almost 100% I'm not pursuing fellowship, and I'm pretty sure I won't pursue hospital medicine. \n\nI got interviews at a few PC tracks, but they're far from home and geography matters a good bit to me. I think my scores were good enough to get some really nice FM programs, I'm probably going to match at low/mid tier academic or a community program. \n\n&amp;#x200B;\n\nIs anyone out there happy they chose IM for training in primary care?",
        "created_utc": 1675014378,
        "upvote_ratio": 1.0
    },
    {
        "title": "Successful Tutoring Experience",
        "author": "BobbertheFifth",
        "url": "https://www.reddit.com/r/medicalschool/comments/10od4z9/successful_tutoring_experience/",
        "text": "[removed]",
        "created_utc": 1675013360,
        "upvote_ratio": 1.0
    },
    {
        "title": "can ChatGPT take step 1 for me too",
        "author": "jeebilly",
        "url": "https://i.redd.it/8bvyy68662fa1.jpg",
        "text": "",
        "created_utc": 1675013182,
        "upvote_ratio": 1.0
    },
    {
        "title": "How many of you work during medical school?",
        "author": "PrudentBall6",
        "url": "https://www.reddit.com/r/medicalschool/comments/10ockhh/how_many_of_you_work_during_medical_school/",
        "text": "Wondering if I will be able to sustain working in med school. Undergrad I did better with a job and something to do, and was honestly lazier without a job. Curious to see how this transfers over………….\n\n[View Poll](https://www.reddit.com/poll/10ockhh)",
        "created_utc": 1675011992,
        "upvote_ratio": 1.0
    },
    {
        "title": "burnout advice?",
        "author": "Glittering-Comb8180",
        "url": "https://www.reddit.com/r/medicalschool/comments/10ocdfh/burnout_advice/",
        "text": "Feeling some burnout from unappreciative patients/people treating me like the devil incarnate. Doesn't really seem worth it to me anymore and I'm not sure if it ever did (family encouraged me to do medicine). People have said it gets better in residency and as an attending, but I don't believe it for a second.\n\nCould use some words of encouragement or advice. Or even just feel-good stories to help me keep going. Figure its a long shot but what the hell ¯\\\\\\_(ツ)\\_/¯\n\nContext: third year.",
        "created_utc": 1675011540,
        "upvote_ratio": 1.0
    },
    {
        "title": "**drops out of meds school **",
        "author": "albalineaalba",
        "url": "https://i.redd.it/lda8237qz1fa1.jpg",
        "text": "",
        "created_utc": 1675011015,
        "upvote_ratio": 1.0
    },
    {
        "title": "best laptops for med school?",
        "author": "Queasy_Pay_7325",
        "url": "https://www.reddit.com/r/medicalschool/comments/10obob4/best_laptops_for_med_school/",
        "text": "any other laptop suggestions besides a macbook?",
        "created_utc": 1675009764,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why doesnt common variable immunodeficiency present until adulthood",
        "author": "evedh613",
        "url": "https://www.reddit.com/r/medicalschool/comments/10obnyt/why_doesnt_common_variable_immunodeficiency/",
        "text": "I would think that a lack of plasma cells would be a big deal when younger too. Is it because they start getting infections again that most people haven't had since childhood?",
        "created_utc": 1675009737,
        "upvote_ratio": 1.0
    },
    {
        "title": "If you graduate ahead of your spouse, how likely is it that they end up at the same hospital for residency as you?",
        "author": "Outbuyingmilk",
        "url": "https://www.reddit.com/r/medicalschool/comments/10ob88s/if_you_graduate_ahead_of_your_spouse_how_likely/",
        "text": "Does it matter at all how much further behind they are, or if they're a DO and you're an MD?",
        "created_utc": 1675008616,
        "upvote_ratio": 1.0
    },
    {
        "title": "site rotations to residency",
        "author": "laurdawg_",
        "url": "https://www.reddit.com/r/medicalschool/comments/10ob0wj/site_rotations_to_residency/",
        "text": "heavily considering transferring to a school in my home state for my clinical years so that I can rotate at the sites i’d like to do residency at. At the very least, I want to do residency in my home state. is it worth transferring to increase my chances of doing residency in my home state?",
        "created_utc": 1675008091,
        "upvote_ratio": 1.0
    },
    {
        "title": "Advice on how to present patients",
        "author": "krustydidthedub",
        "url": "https://www.reddit.com/r/medicalschool/comments/10o9n11/advice_on_how_to_present_patients/",
        "text": "A few key points for presenting patients that have yielded me really excellent evaluations from my residents:\n- Say less. \n- Say less. \n- Say less. \n\nSeriously. Do not editorialize throughout your objective with “but only a little tachycardic, I think?” or “they kind of had a fever, actually I guess not technically?” Or “low BP overnight but I think that’s kinda normal for them?” Just always say the minimum amount of words you can. “Patient was afebrile and hemodynamically stable.” “Patient was tachycardic to 115 overnight, most recently 83.” \n\nDifferent attendings will have different suggestions for whether they want exact number or if you can just say HDS, stable vitals, etc. \n\nThen, when you get to your A/P, *that* is when you can make your judgments on vitals/labs/rads and what you think should be done about it. There is nothing the residents on the team hate more than an inefficient presentation where the objective/subjective part keeps getting dragged on by constant interjections and editorializing.",
        "created_utc": 1675004496,
        "upvote_ratio": 1.0
    },
    {
        "title": "Looking to buy notes.",
        "author": "Repulsive-Repeat-135",
        "url": "https://www.reddit.com/r/medicalschool/comments/10o8i86/looking_to_buy_notes/",
        "text": "I need notes for year 1 and 2. It must be comprehensive, organized and from all courses taken during those years. This is for research purposes only. Dm me if interested.",
        "created_utc": 1675001471,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can someone help? I don’t understand the joke.",
        "author": "I_want_to_die_14",
        "url": "https://i.redd.it/f0bgdann41fa1.jpg",
        "text": "",
        "created_utc": 1675000601,
        "upvote_ratio": 1.0
    },
    {
        "title": "Pizza was a form of gaslighting by hospital admins during the Delta and Omicron (December to January 2021) surges...while they call overworked hospital staff as heroes 🙄",
        "author": "Still_Forever1",
        "url": "https://i.redd.it/bwxz8060mzea1.png",
        "text": "",
        "created_utc": 1675000223,
        "upvote_ratio": 1.0
    },
    {
        "title": "Partially Matched",
        "author": "svetskimeister",
        "url": "https://www.reddit.com/r/medicalschool/comments/10o7u48/partially_matched/",
        "text": "Hi guys. I only have advanced program interviews (very small number). Let's say I match at one of the programs, what happens if I am not able to get a prelim though SOAP? Can I ask for a deferral and try to Match in prelim next year?\n\nI am a non-US IMG (visa required).",
        "created_utc": 1674999496,
        "upvote_ratio": 1.0
    },
    {
        "title": "Dyslectic with good reading skills, but difficulty comprehending complex words",
        "author": "brosle",
        "url": "https://www.reddit.com/r/medicalschool/comments/10o5f0l/dyslectic_with_good_reading_skills_but_difficulty/",
        "text": " \n\nHello, Everyone!\n\nWhen I was a child I was diagnosed with dyslexia, and it was deliberating enough for me to not being able to read at age 11.  \nSo I've worked on the skills, and it's been quite weird how well it's ended up.\n\nThing is I've always skipped out on the more difficult and complex words. I can learn them if I hear them a million times and read them a million times, but that isn't working out if I want to learn something on surfice level of some topic without having to be in the sphare for a million years.  \nAlso, if I'd want to study academia I would fall way behind on the learning schedual not because of the literature but because every time a complex word shows up I'd have to spend extensive time just to learn the ungodly word.\n\nDoes anyone who has studied medicine with a readingcomprehention disability have some kind of method to share for how to handle these words?\n\nKind regards,  \nBrosle",
        "created_utc": 1674990905,
        "upvote_ratio": 1.0
    },
    {
        "title": "Residency that is most resiliant to AI?",
        "author": "UspavaniLepotan",
        "url": "https://www.reddit.com/r/medicalschool/comments/10o4eek/residency_that_is_most_resiliant_to_ai/",
        "text": "Dear medical students and residents, how do you plan on preparing for the inevitable workforce shift thanks to AI? How do you cope with this?\n\nI have finished my med school and internship and currently I'm waiting to get my licence to practise medicine. The reason why I liked medicine as a job is the stability of the field, decent pay and being able to work with your mind. \n\nLike all the people here, I also figured out radiology is the best specialisation. Where I live it's not competitive, it pays well in private practise and work life balance is decent. Plus, you work in a comfy office without patient interaction. The perfect residency, for me at least. \n\nRecently, after discovering chatGPT and well [this](https://www.bhf.org.uk/what-we-do/news-from-the-bhf/news-archive/2022/march/superhuman-20-second-ai-heart-tool-begins-nhs-roll-out) article I am reconsidering it and I do not have much time to make a decision. I'm fully aware it won't replace rads yet, but in the near future it surely will or at least decimate the workforce. It will probably replace all white collar jobs that have no complicated physical component/procedures. Going into DR and then opting into IR seems like a best of both worlds, but other residencies love to steal procedures so it might not be a good option. \n\nOther options are going for Neuro which I kinda like but unfortunately they don't have many procedures or trying to force myself into GI or Cardio because they do have them. Unfortunately, internal medicine here is almost as competitive as ophto/derm. Also thinking about Anesthesia since it has some manual work and you have legal responsibility on your hands + it is the least competitive specialisation here because it pays poorly and has awful work/life balance. Mid level creep doesn't bother me because this doesn't happen here. NPs are barely competent to do their own job, let alone be a doctor. \n\nAre surgery and procedure heavy specialisations the only hope left? I'm extremely risk averse and neurotic and this whole AI thing is making me extremely ill and depressed. You spend your life honing your skills to be irreplacable or at least have a good job security only to realise you will be first on the chopping block. The question isn't if, it's when. We will become more efficient, but that just means less doctors not less work hours. Last night my anxiety got so bad, I started to vomit. The reddit tech bros cheering for it don't realise their own job is at risk as well. Their peers are making their own replacements.",
        "created_utc": 1674986869,
        "upvote_ratio": 1.0
    },
    {
        "title": "Diagnotes DM",
        "author": "blairwaldorf98",
        "url": "https://www.reddit.com/r/medicalschool/comments/10o42u1/diagnotes_dm/",
        "text": "The romance novelist in me wants to know: has anyone ever slid into your Diagnotes DM’s? Have you ever messaged someone else? Is there an official policy against this lol",
        "created_utc": 1674985591,
        "upvote_ratio": 1.0
    },
    {
        "title": "BnB step 2 + anking for obgyn",
        "author": "WholesomeLord",
        "url": "https://www.reddit.com/r/medicalschool/comments/10o3uhl/bnb_step_2_anking_for_obgyn/",
        "text": "Is this combination comprehensive enough for everything I should know as a doctor or should I supplement with a textbook? The question applies for general purposes not for exams only.",
        "created_utc": 1674984665,
        "upvote_ratio": 1.0
    },
    {
        "title": "why does inhibiting cytochrome C oxidase result in hypoxia?",
        "author": "Crafty-Note2560",
        "url": "https://www.reddit.com/r/medicalschool/comments/10o3hfh/why_does_inhibiting_cytochrome_c_oxidase_result/",
        "text": "learning about the renal system and was wondering how this happened",
        "created_utc": 1674983236,
        "upvote_ratio": 1.0
    },
    {
        "title": "Pfizer Director Freaks Out Journalist Confronts Him For Saying They Are ...",
        "author": "StuckLikeChuck202",
        "url": "https://youtube.com/watch?v=qC01j0IVqT0&amp;feature=share",
        "text": "",
        "created_utc": 1674977342,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can someone tell me wat is happening?",
        "author": "LYNX_431",
        "url": "https://www.reddit.com/r/medicalschool/comments/10o0vng/can_someone_tell_me_wat_is_happening/",
        "text": "[removed]",
        "created_utc": 1674973407,
        "upvote_ratio": 1.0
    },
    {
        "title": "To count it as a poster presentation?",
        "author": "needsomedreams",
        "url": "https://www.reddit.com/r/medicalschool/comments/10o0pui/to_count_it_as_a_poster_presentation/",
        "text": "My question is can I count this as a poster presentation on my cv? I am a co first author on a study that we submitted to a conference and it was accepted for a presentation. The conference is a military conference and I am not in the military, however my other co first author and a secondary author are. One of them will be presenting and I am not allowed to go present according to my school. Can I still list this as a poster presentation on my resume?",
        "created_utc": 1674972841,
        "upvote_ratio": 1.0
    },
    {
        "title": "How much free time do you actually have during M4?",
        "author": "Daplaya510",
        "url": "https://www.reddit.com/r/medicalschool/comments/10nz1x7/how_much_free_time_do_you_actually_have_during_m4/",
        "text": "No exaggeration, but what's a typical day like during M4 year and how much free time is there?",
        "created_utc": 1674967196,
        "upvote_ratio": 1.0
    },
    {
        "title": "I want to buy your notes.",
        "author": "MaintenanceKey6578",
        "url": "https://www.reddit.com/r/medicalschool/comments/10nxvf6/i_want_to_buy_your_notes/",
        "text": "[removed]",
        "created_utc": 1674963334,
        "upvote_ratio": 1.0
    },
    {
        "title": "Those of you with an autoimmune disorder, how does it work with immunosuppressant drugs and sick patients?",
        "author": "Rose_455",
        "url": "https://www.reddit.com/r/medicalschool/comments/10nxq5w/those_of_you_with_an_autoimmune_disorder_how_does/",
        "text": "Hello, \n\nA few months before starting medical school I was hit with a lot of autoimmune symptoms. Rheumatologist thinks I may have something but it’s not clear what right now. Has seriously derailed my life. I’ve already started medical school, because obviously was not planning for this to happen. But I’m worried about what it means for my future as a physician. \n\nIf I’m put on biologics, how does that work as far as being around patients goes? Will I have to discontinue medical school?",
        "created_utc": 1674962874,
        "upvote_ratio": 1.0
    },
    {
        "title": "Late 3rd LOR: Potential problems?",
        "author": "Prestigious-Hour-339",
        "url": "https://www.reddit.com/r/medicalschool/comments/10nxi4x/late_3rd_lor_potential_problems/",
        "text": "[removed]",
        "created_utc": 1674962180,
        "upvote_ratio": 1.0
    },
    {
        "title": "Impact of Late 3rd LOR on Residency Application",
        "author": "Prestigious-Hour-339",
        "url": "https://www.reddit.com/r/medicalschool/comments/10nxgoz/impact_of_late_3rd_lor_on_residency_application/",
        "text": "[removed]",
        "created_utc": 1674962060,
        "upvote_ratio": 1.0
    },
    {
        "title": "When did you start studying for subI’s?",
        "author": "NickCQ12",
        "url": "https://www.reddit.com/r/medicalschool/comments/10nx9bw/when_did_you_start_studying_for_subis/",
        "text": "My school has a pretty short turn around between 3rd year and starting away rotations/home subIs. When do people normally start studying/preparing for these? I’m interested in a surgical subspecialty that is barely touched on during core rotations and I only get a few weeks of OR experience during surgery rotations. \n\nAre you expected to already know what you’re doing day 1 or is continuous hard work and commitment to improving more important?",
        "created_utc": 1674961412,
        "upvote_ratio": 1.0
    },
    {
        "title": "How2romance in 3rd/4th year rotations. Halp",
        "author": "Particular-Funny9659",
        "url": "https://www.reddit.com/r/medicalschool/comments/10nx4p1/how2romance_in_3rd4th_year_rotations_halp/",
        "text": "[removed]",
        "created_utc": 1674961037,
        "upvote_ratio": 1.0
    },
    {
        "title": "Suture was once in glass “boilable” vials.",
        "author": "Mcgarnicle_",
        "url": "https://i.redd.it/eznbjupauxea1.jpg",
        "text": "",
        "created_utc": 1674960762,
        "upvote_ratio": 1.0
    },
    {
        "title": "Bandwagon Continues: Hopkins Withdraws from US News Ranking",
        "author": "grillmetoasty",
        "url": "https://i.redd.it/loi9owxtnxea1.jpg",
        "text": "",
        "created_utc": 1674958588,
        "upvote_ratio": 1.0
    },
    {
        "title": "Hopkins is out",
        "author": "TeekiTorch",
        "url": "https://i.redd.it/gje57r1ymxea1.jpg",
        "text": "",
        "created_utc": 1674958290,
        "upvote_ratio": 1.0
    },
    {
        "title": "JHU joins the club",
        "author": "Lord-Have_MRSA",
        "url": "https://i.redd.it/b3gscfedmxea1.png",
        "text": "",
        "created_utc": 1674958097,
        "upvote_ratio": 1.0
    },
    {
        "title": "The stomach just shouldn’t be like that…",
        "author": "KR1735",
        "url": "https://i.redd.it/rdaio4m2mxea1.jpg",
        "text": "",
        "created_utc": 1674957995,
        "upvote_ratio": 1.0
    },
    {
        "title": "Non traditional student situation",
        "author": "mattyice2731",
        "url": "https://www.reddit.com/r/medicalschool/comments/10nvyx5/non_traditional_student_situation/",
        "text": "Hello all, so I have an interesting situation. I’m a 24 year old male and will be graduating with a bachelors in IT Management from WGU this spring. I thought I was into IT for a while but realizing now that that’s not what I want but I’m basically finished with the degree so I thought it’d be dumb to switch it up at this point when the finish line is right there. However I’ve always been interested in medicine and med school potentially. I’ve been researching for a while and understand everything that needs to be done to be accepted. So I do know that I would need to do a postbacc and do very well and I’m prepared for that. However my question involves my past. When I was younger I was more dumb and naive and didn’t know what I wanted to do and ended dropping out of two different community colleges. Back then I just wasn’t focused on school and a career like I am now and I now have things focused and figured out. So my question is will I be screwed for any potential of getting into a med school because of those dropouts from college? I understand if so but I just want to know realistically what the chances are of being accepted. I also understand that it depends on other things like GPA and volunteering and shadowing hours and clinical experience etc. but I’m more just asking if that sole fact will screw me over potentially. Anyway thanks for reading this far and I appreciate all responses!",
        "created_utc": 1674957489,
        "upvote_ratio": 1.0
    },
    {
        "title": "Bad comments on eval on my core",
        "author": "bsm82",
        "url": "https://www.reddit.com/r/medicalschool/comments/10nvsss/bad_comments_on_eval_on_my_core/",
        "text": "\"The residents felt that bsm appeared to be disinterested and was not engaged. He did what was asked of him, but did not go above and beyond. Knowledge was not up to par at first, but after feedback it improved a bit.\"\n\nThis was the eval off my obgyn core rotation.\n\n&amp;#x200B;\n\nI'm a DO student applying to a specialty with a 60-70% match rate for DO's (anes/pmr/rads). \n\n&amp;#x200B;\n\nI honestly could have asked more questions, but my mentality was just to be professional, show up on time, do what i was told etc. and I really did not give two flyings fucks about OBGYN and i guess it showed lmao. I also didn't care to fake it, i guess that was a mistake. \n\n&amp;#x200B;\n\nI got 65th percentile (above average) on my shelf for ob. I initially got pimped on something easy and didn't know it, so I guess they assumed I was an idiot. The last week of my rotation I got pimped a dozen more times and got them right when the rest of the students had no clue. I feel like saying \"improved a bit\" is an understatement considering that situation but I guess that's just the game.\n\n&amp;#x200B;\n\nIf this gets on my MSPE am i screwed or what. what do y'all think. all my other evals are either average or above average.",
        "created_utc": 1674956954,
        "upvote_ratio": 1.0
    },
    {
        "title": "what do I need to know/have?",
        "author": "Goldrush89",
        "url": "https://www.reddit.com/r/medicalschool/comments/10nvru5/what_do_i_need_to_knowhave/",
        "text": "So, I’m probably going to medical school next year. I’m applying to a couple very prestigious medical schools and a graduate program at my Alma Mater. If I don’t get into medical school I’ll just do that 1 year masters and reapply, though I’m confident I’ll get into medical school.\n\nWhat are some material possessions that I might need/want coming into medical schools, or some key pieces of core knowledge or advice that would be helpful.",
        "created_utc": 1674956872,
        "upvote_ratio": 1.0
    },
    {
        "title": "Case report publication",
        "author": "Sleepyteatime28",
        "url": "https://www.reddit.com/r/medicalschool/comments/10nvmf9/case_report_publication/",
        "text": "So I did a case report for my research rotation. The school syllabus suggested submitting to the journal of osteopathic medicine but I don’t think it’s a good fit. Just wanted to see if anyone had any journal suggestions of where I can try to submit. Case was on immersion foot. I have 0 publications and need some help!",
        "created_utc": 1674956414,
        "upvote_ratio": 1.0
    },
    {
        "title": "Psych M4 applicants - away rotations?",
        "author": "purplemose10",
        "url": "https://www.reddit.com/r/medicalschool/comments/10nvh44/psych_m4_applicants_away_rotations/",
        "text": "Any psych applicants out there do away rotations / were advised to do them (or not to do them)?",
        "created_utc": 1674955950,
        "upvote_ratio": 1.0
    },
    {
        "title": "Reported by med students…for letting med students out early",
        "author": "AmexPlatty",
        "url": "https://www.reddit.com/r/medicalschool/comments/10nuo16/reported_by_med_studentsfor_letting_med_students/",
        "text": "[removed]",
        "created_utc": 1674953569,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is neurology competitive",
        "author": "blastpastermast",
        "url": "https://www.reddit.com/r/medicalschool/comments/10nuivd/is_neurology_competitive/",
        "text": "Hi 2nd year DO student interested in neurology. I’m currently at 50th percentile in terms of GPA/ class rank. Are there any specific extra curricular that I need to do to make myself more competitive? Has neurology traditionally been a competitive specialty? \nThanks",
        "created_utc": 1674953145,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is the worst Sketchy micro video?",
        "author": "Hyperostosis",
        "url": "https://www.reddit.com/r/medicalschool/comments/10nub7x/what_is_the_worst_sketchy_micro_video/",
        "text": "I'm studying for Step and the Plasmodium videos are giving me priapism. Disclaimer: I'm pretty dumb.\n\n**\"Vampire queen + iguana\" = Atovaquone-proguanil** The hell you mean man???\n\n**Chameleon eating a fly = chloroquine is oral** KEEP IT TO ONE LIZARD PER VIDEO PLEASE\n\n**Kid wearing a mask? Oh, that's \"falciparum\".** The fuck you talking girl!?!? \n\n**Microscopic buttons in alternating colors = specific patterns of various species fever cycles** \n\nCould you have chosen anything smaller? My ass got astigmatism.\n\n**Slightly yellow sunglasses = jaundice** Why did you deviate from the convention of making the dude yellow af?\n\nAnd you made one character TWO DRUGS!?!? ARE YOU OUT OF YOUR MIND!?!?\n\nGirl in brown shirt with mildly enlarged biceps = TOUGH QUEEN = TAFENOQUINE!? Oh, but she's the **prom queen** too so its PRIMAQUINE.\n\nIF SHE'S THE PROM QUEEN THEN WHY DOES THE CHLOROQUINE GIRL HAVE A CROWN ON HER HEAD?!? HUH??",
        "created_utc": 1674952532,
        "upvote_ratio": 1.0
    },
    {
        "title": "Thoughts on including collegiate athletics in residency applications?",
        "author": "canhazcheezburger",
        "url": "https://www.reddit.com/r/medicalschool/comments/10ntc11/thoughts_on_including_collegiate_athletics_in/",
        "text": "Don’t want to seem like a washed up athlete who can’t let go of the past, but it truly did shape my skills as a leader and teammate. Do residency programs even care? \n\nFor context, competed all 4 years in NCAA division 1, elected captain in fourth year. \n\nThanks for the input!",
        "created_utc": 1674949847,
        "upvote_ratio": 1.0
    },
    {
        "title": "Tau (dosage interval) for maintenance dose",
        "author": "siwel3",
        "url": "https://www.reddit.com/r/medicalschool/comments/10nsmxd/tau_dosage_interval_for_maintenance_dose/",
        "text": "[removed]",
        "created_utc": 1674947971,
        "upvote_ratio": 1.0
    },
    {
        "title": "Critical Care",
        "author": "raspberryreef",
        "url": "https://www.reddit.com/r/medicalschool/comments/10ns19z/critical_care/",
        "text": "What specialties would you include under the umbrella term “critical care”?",
        "created_utc": 1674946400,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to write a letter of intent to program second on my list",
        "author": "bot026",
        "url": "https://www.reddit.com/r/medicalschool/comments/10ns06b/how_to_write_a_letter_of_intent_to_program_second/",
        "text": "Should I explicitly say they're number two on my list or that I ranked them highly? Any input would be appreciated.",
        "created_utc": 1674946320,
        "upvote_ratio": 1.0
    },
    {
        "title": "We got 12 months of Sketchy Medical for $285",
        "author": "Economy_Carry5672",
        "url": "https://www.reddit.com/r/medicalschool/comments/10nre6m/we_got_12_months_of_sketchy_medical_for_285/",
        "text": "So, since Sketchy has become awfully expensive for average student here, I'm thinking of sharing with you guys my local med institution perks. We got a nice discount for 12-month subscription plan which deducts price from $400 to $285, which is even better price than 6-month subscription ($300). Even if you don't need the whole 12-month period, you can always give the account after 6 months to someone else.\n\nHit me up if you're interested.",
        "created_utc": 1674944710,
        "upvote_ratio": 1.0
    },
    {
        "title": "grasping at straws",
        "author": "Glittering-Comb8180",
        "url": "https://www.reddit.com/r/medicalschool/comments/10nr8is/grasping_at_straws/",
        "text": "[removed]",
        "created_utc": 1674944299,
        "upvote_ratio": 1.0
    },
    {
        "title": "Advice on how to honor every rotation",
        "author": "mamagina123",
        "url": "https://www.reddit.com/r/medicalschool/comments/10nr1b2/advice_on_how_to_honor_every_rotation/",
        "text": "Just got my last clerkship grade and got straight honors this year. Personally, I'm a high anxiety, naturally introverted person, but honestly I found a pretty formulaic way that helped me nail every rotation. Here's the spark notes in case anyone was looking for pointers to try out:\n\n&amp;#x200B;\n\n* **Personality mirroring**\n   * I literally **cannot stress this one enough**. Make your personality moldable to whatever the vibe of that team is. Is your senior super maternal and loves to coddle you and check in? Guess what, all of a sudden you have tons of questions and want to debrief that 'challenging patient interaction' from rounds. Is your senior terse and kind of hates you being there? Great, now you're the most silent, self sufficient med student who asks maybe one, very good question all day and leaves when they're told. Goes for pretty much anyone on the team. Figure out the type of person they want to be with (usually someone like them) and try your best to match it. I really cannot impress upon you that this is the best way to click with anyone on the wards. \n* Don't be annoying\n   * Sounds simple but Jesus Christ. Realize that being a med student is your only job, but you're very ancillary to the residents' jobs. Don't interrupt them while they're busy unless its urgent, wait for opportune times. **On surgery, the best time to approaching your resident with a logistics/otherwise question is during closing.** They have to be there with you and that's when they'll be most open to talking. \n* Nail your presentations and know your patients\n   * The **highest yield** way to impress your team. Literally the entire focus is on you. Here are my tips: 1) **WRITE OUT** exactly what you are going to say. I literally used to type out my presentations every morning with at minimum, bullet points for every point I wanted to make. This way you're not using filler words and you can sound confident. 2) at least once every 1-2 days, **look up just one thing in the literature you can throw in**. \"I was reading last night and saw X can be associated with X\". Don't overdo this, but once every couple days will absolutely impress your attending. \n   * Know your patients. My rule of thumb was there should never be a medication order in that you don't know what for. \n* **Ask upperclassmen** for where the best rotations are\n   * Honoring everything is like 15-20% luck. Ask your M3/4s where the easy graders are and where to avoid. There are absolutely sites that don't give out any honors, and sites where honors is automatic. This is a serious key. \n* Don't neglect the shelf studying\n   * Obviously, but it happens. Get through the **UWorld, and do your Anki 2 or more times** before the shelf. Use your lunch breaks, down time, etc. to get it done. It is such an arbitrary way to forfeit your grade. \n\n&amp;#x200B;\n\nI realize that was long, but hopefully, if you were interested, it was a little helpful! Best of luck to everyone!!",
        "created_utc": 1674943783,
        "upvote_ratio": 1.0
    },
    {
        "title": "thoughts on having a significant other in medschool/residency?",
        "author": "No_Anything1990",
        "url": "https://www.reddit.com/r/medicalschool/comments/10nqv0p/thoughts_on_having_a_significant_other_in/",
        "text": "I’m thinking about the pros and cons of a relationship with someone in medicine. \n\nAll my med friends have strictly stated they will not marry someone from the same field as them ( medicine) is this the right thought process? \n\nI strongly agree with this statement because of a list of very strong reasons, but I wanted to see what other people on here think.",
        "created_utc": 1674943321,
        "upvote_ratio": 1.0
    },
    {
        "title": "Anyone here want to buy my Sketchy Medical account?",
        "author": "Economy_Carry5672",
        "url": "https://www.reddit.com/r/medicalschool/comments/10nqdg5/anyone_here_want_to_buy_my_sketchy_medical_account/",
        "text": "So, I have 12-months of Sketchy left, bought it with a large discount that my University offers, and I would like to sell it for $285 since I don't use it much (regular price is $400 for 12 months). Hit me up in DM if you'd like to have it.",
        "created_utc": 1674942080,
        "upvote_ratio": 1.0
    },
    {
        "title": "MRW my dad tells me to rank my interviews based on which ones are in republican states",
        "author": "Osteo-Malaka-cia",
        "url": "https://imgur.io/gallery/sOIJDGo",
        "text": "",
        "created_utc": 1674941766,
        "upvote_ratio": 1.0
    },
    {
        "title": "If you already submitted your ERAS in September, How helpful is it doing Away Rotations in October or after in securing interviews?",
        "author": "stepneo1",
        "url": "https://www.reddit.com/r/medicalschool/comments/10nq1t2/if_you_already_submitted_your_eras_in_september/",
        "text": "From what I heard, Away Rotations are helpful **before** you submit your ERAS (especially at programs you're targeting) because you'll have recommendation letters from that program. \n\nAlso, the Away Rotation you completed in October or later won't be  listed on your  ERAS that you submitted in September, right?",
        "created_utc": 1674941230,
        "upvote_ratio": 1.0
    },
    {
        "title": "Anesthesia vs Interventional Cardiology",
        "author": "Equivalent_Spring_60",
        "url": "https://www.reddit.com/r/medicalschool/comments/10npdrp/anesthesia_vs_interventional_cardiology/",
        "text": "The question says it all. \n\nI have been pretty set on Anesthesia but I am on my IM rotation right now. I hate general internal medicine but I really like how physiology-heavy cardiology is, and I really like interventional cardiology.  I think they have one of the coolest jobs in all of medicine. I realized during neuro and surgery and now IM that something about the angio suite really gets me excited. BUT....for someone who needs procedures and to physically do things. **Is it even worth considering interventional cards at the risk of having to do something else in IM that's not procedural compared to Anesthesia where I could always do cardiac or critical care as a fellowship to be around really critical patients?**",
        "created_utc": 1674939533,
        "upvote_ratio": 1.0
    },
    {
        "title": "Comparing work hours between internal medicine program",
        "author": "jsmd1890",
        "url": "https://www.reddit.com/r/medicalschool/comments/10np0ba/comparing_work_hours_between_internal_medicine/",
        "text": "Hey all, I'm an M4 here finalizing match list for categorical internal medicine. I was wondering if anyone knows of good resources for comparing between programs:\n\n1. Duty hours\n2. 24/28 hr shift frequency\n3. Ability to attend morning report regularly\n\nThanks in advance!",
        "created_utc": 1674938578,
        "upvote_ratio": 1.0
    },
    {
        "title": "PA or PhD?",
        "author": "94mad19",
        "url": "https://i.redd.it/qtp4o5d7yvea1.jpg",
        "text": "",
        "created_utc": 1674937861,
        "upvote_ratio": 1.0
    },
    {
        "title": "Carcinoma vs Adenocarcinoma",
        "author": "NFTMFT",
        "url": "https://www.reddit.com/r/medicalschool/comments/10nok16/carcinoma_vs_adenocarcinoma/",
        "text": "[removed]",
        "created_utc": 1674937421,
        "upvote_ratio": 1.0
    },
    {
        "title": "Carcinoma vs Adenocarcinoma",
        "author": "NFTMFT",
        "url": "https://www.reddit.com/r/medicalschool/comments/10nog92/carcinoma_vs_adenocarcinoma/",
        "text": "[removed]",
        "created_utc": 1674937151,
        "upvote_ratio": 1.0
    },
    {
        "title": "Vent simulator app/page?",
        "author": "Kajanuseristaken",
        "url": "https://www.reddit.com/r/medicalschool/comments/10no5k7/vent_simulator_apppage/",
        "text": "What is by your opinion best app for learning configuration of mechanical ventilation.",
        "created_utc": 1674936379,
        "upvote_ratio": 1.0
    },
    {
        "title": "Urology Match Questions",
        "author": "jwoolste3",
        "url": "https://www.reddit.com/r/medicalschool/comments/10no2zt/urology_match_questions/",
        "text": "I couldn't find a straight answer to this online given my lack of understanding of certain terms on the AUA website. \n\nQuestion: When does my application formally go out to the programs I am applying to? I am trying to figure out the date by when I need Sub-I grades to be completed in order for them to be on my initial application. Thanks!",
        "created_utc": 1674936192,
        "upvote_ratio": 1.0
    },
    {
        "title": "20%of Apple iPhone 14 Pro Max 256GB Space Black",
        "author": "VishalNishad",
        "url": "https://www.reddit.com/r/medicalschool/comments/10nnybc/20of_apple_iphone_14_pro_max_256gb_space_black/",
        "text": "[removed]",
        "created_utc": 1674935872,
        "upvote_ratio": 1.0
    },
    {
        "title": "If one is trying to get into a specialty that requires a Transitional Year (eg, PM&amp;R, Radiology, etc.) but wasn't able to get in this March, would it be better for that person to secure a transitional Year residency and then re-apply in September?",
        "author": "stepneo1",
        "url": "https://www.reddit.com/r/medicalschool/comments/10nniou/if_one_is_trying_to_get_into_a_specialty_that/",
        "text": "At least by the time September comes in, the person has a few months of \"residency\" experience and maybe a letter of recommendation from the residency of workplace?",
        "created_utc": 1674934733,
        "upvote_ratio": 1.0
    },
    {
        "title": "Every time I see another USNWR Post",
        "author": "Impressive-Injury215",
        "url": "https://i.redd.it/8sn447vjnvea1.gif",
        "text": "",
        "created_utc": 1674934279,
        "upvote_ratio": 1.0
    },
    {
        "title": "Cancel culture has gone to far /s",
        "author": "NotRunningSucks",
        "url": "https://i.redd.it/z8791mp7nvea1.jpg",
        "text": "",
        "created_utc": 1674934165,
        "upvote_ratio": 1.0
    },
    {
        "title": "Cancel culture is going to far /s",
        "author": "NotRunningSucks",
        "url": "https://i.redd.it/qgdu2vsimvea1.jpg",
        "text": "",
        "created_utc": 1674933933,
        "upvote_ratio": 1.0
    },
    {
        "title": "kind of grasping at straws here",
        "author": "Glittering-Comb8180",
        "url": "https://www.reddit.com/r/medicalschool/comments/10nmdms/kind_of_grasping_at_straws_here/",
        "text": "[removed]",
        "created_utc": 1674931873,
        "upvote_ratio": 1.0
    },
    {
        "title": "VSLO tips and advice?",
        "author": "Studiousstudent6832",
        "url": "https://www.reddit.com/r/medicalschool/comments/10nm5om/vslo_tips_and_advice/",
        "text": "[removed]",
        "created_utc": 1674931291,
        "upvote_ratio": 1.0
    },
    {
        "title": "Anyone else’s school putting a heavy emphasis on convincing p/t Facebook scientist patients to take vaccines?",
        "author": "Shonuff_of_NYC",
        "url": "https://i.redd.it/vhmfn395cvea1.jpg",
        "text": "",
        "created_utc": 1674930443,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can anyone explain how the hell does airway obstruction cause an increased A-a gradient",
        "author": "Assinthegas",
        "url": "https://www.reddit.com/r/medicalschool/comments/10nlo41/can_anyone_explain_how_the_hell_does_airway/",
        "text": "I understand how the arterial PaO2 is going to decrease but there’s no ventilation in the obstructed lungs, wouldn’t alveolar PAO2 be 0, much lower than the resulting PaO2 and thus not really lead to an increased A-a gradient but a negative one since it’s PAO2-PaO2?",
        "created_utc": 1674930052,
        "upvote_ratio": 1.0
    },
    {
        "title": "Free online study resources recs",
        "author": "highonstardust",
        "url": "https://www.reddit.com/r/medicalschool/comments/10nle0d/free_online_study_resources_recs/",
        "text": "Hey guys, i'm a second year medical student ( i think that's equivalent to second year USMLE step 1) and i recently lost my MEGA folder where i used to find everything i needed, it was a collection of Kaplan, boards and beyond, osmosis, ninja nerd, and so much more.\n\nso if you guys have any recommendations of YouTube channels (i only know ninja nerd) or drive or Mega links drop them in the comments please.\n\n\n(i'm sorry if this isn't the right sub or i broke some rules i'm not very familiar with this sub)",
        "created_utc": 1674929344,
        "upvote_ratio": 1.0
    },
    {
        "title": "What exactly does Average number of peer-reviewed publications Mean?",
        "author": "cholla11",
        "url": "https://www.reddit.com/r/medicalschool/comments/10nlccg/what_exactly_does_average_number_of_peerreviewed/",
        "text": "This may be a simple question, but does this refer to individual manuscripts only, or could a poster, abstract, conference presentation and finally the manuscript all count as a separate peer-reviewed publication? Thanks for clarifying.",
        "created_utc": 1674929228,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is the craziest symptom you’ve heard of/seen during rotations?",
        "author": "Snarky14",
        "url": "https://www.reddit.com/r/medicalschool/comments/10nkrfh/what_is_the_craziest_symptom_youve_heard_ofseen/",
        "text": "Can literally be anything - could be the zebra-est presentation of a non zebra or just a plain zebra",
        "created_utc": 1674927765,
        "upvote_ratio": 1.0
    },
    {
        "title": "My bpd fellas, what specialty did u choose?",
        "author": "Unknown3Fortune1Rye",
        "url": "https://www.reddit.com/r/medicalschool/comments/10nkjwd/my_bpd_fellas_what_specialty_did_u_choose/",
        "text": "Hi guys\nFor those with BPD and are applying for residency or already residents. What speciality did u choose and why",
        "created_utc": 1674927220,
        "upvote_ratio": 1.0
    },
    {
        "title": "The only right answer for residency interviews",
        "author": "vanderstrom",
        "url": "https://i.redd.it/0q6z3neaquea1.jpg",
        "text": "",
        "created_utc": 1674923092,
        "upvote_ratio": 1.0
    },
    {
        "title": "Getting evaluation changed",
        "author": "throwawayg12234",
        "url": "https://www.reddit.com/r/medicalschool/comments/10nic42/getting_evaluation_changed/",
        "text": "[removed]",
        "created_utc": 1674921528,
        "upvote_ratio": 1.0
    },
    {
        "title": "Anyone here want to buy my Sketchy Medical account?",
        "author": "Economy_Carry5672",
        "url": "https://www.reddit.com/r/medicalschool/comments/10niahn/anyone_here_want_to_buy_my_sketchy_medical_account/",
        "text": "So, I have 12-months of Sketchy left, bought it with a large discount that my University offers, and I would like to sell it for $285 since I don't use it much (regular price is $400 for 12 months). Hit me up in DM if you'd like to have it.",
        "created_utc": 1674921403,
        "upvote_ratio": 1.0
    },
    {
        "title": "No Peds Sub I before ERAS, am I doomed?",
        "author": "burntflower12",
        "url": "https://www.reddit.com/r/medicalschool/comments/10nia1p/no_peds_sub_i_before_eras_am_i_doomed/",
        "text": "All the peds sub I spots at my school taken until the fall. Am I doomed? I have a few academic remediations, LOA Red flags and now I feel like I'm setting myself up for disaster..",
        "created_utc": 1674921368,
        "upvote_ratio": 1.0
    },
    {
        "title": "Med students/residents with significant others are so lucky.",
        "author": "burntflower12",
        "url": "https://www.reddit.com/r/medicalschool/comments/10nhsnu/med_studentsresidents_with_significant_others_are/",
        "text": "Sometimes I just want to come home and need a hug :(",
        "created_utc": 1674920096,
        "upvote_ratio": 1.0
    },
    {
        "title": "Nursing school vs med school",
        "author": "DeltaAgent752",
        "url": "https://www.reddit.com/r/medicalschool/comments/10nhs96/nursing_school_vs_med_school/",
        "text": "I’m not good at drawing but here’s a comic idea.\n\nmom say you have two options: you can get three candies now and three candies after dinner or no candies now, but five candies after dinner.\n\na: I want candies now!\nb: I’ll wait\n\n—- after dinner —\n\na:no fair! why does b gets five candies!\nmom: hmm yea seems unfair let’s give you five candies also\n\na is nursing. b is medicine. c is government",
        "created_utc": 1674920061,
        "upvote_ratio": 1.0
    },
    {
        "title": "Just another dental student in medical school 🤷🏽‍♂️",
        "author": "No_Grass_2651",
        "url": "https://i.redd.it/w07s1723guea1.jpg",
        "text": "",
        "created_utc": 1674919661,
        "upvote_ratio": 1.0
    },
    {
        "title": "I want problems always 👀",
        "author": "Virbactermodhost",
        "url": "https://www.reddit.com/r/medicalschool/comments/10nh31y/i_want_problems_always/",
        "text": "Some of those 7600+ nurses in FL went on to become NPs 😈",
        "created_utc": 1674918188,
        "upvote_ratio": 1.0
    },
    {
        "title": "Experience with dictation software",
        "author": "goldenantilope",
        "url": "https://www.reddit.com/r/medicalschool/comments/10ngoj7/experience_with_dictation_software/",
        "text": "[removed]",
        "created_utc": 1674917073,
        "upvote_ratio": 1.0
    },
    {
        "title": "Experience with dictation software",
        "author": "Sufficient-Neat7085",
        "url": "https://www.reddit.com/r/medicalschool/comments/10nghe5/experience_with_dictation_software/",
        "text": "[removed]",
        "created_utc": 1674916523,
        "upvote_ratio": 1.0
    },
    {
        "title": "Prior record and getting a DEA number",
        "author": "Melodic_Age_5141",
        "url": "https://www.reddit.com/r/medicalschool/comments/10ng0bm/prior_record_and_getting_a_dea_number/",
        "text": "If you're in medical school when do you apply for your DEA number? And if you were charged with a felony (stealing narcotics from your job when you were an RN) but it was expunged can't the DEA still see the charges? How does that work? Long story short, I'm getting divorced from someone who lied to get into medical school, lied to me when he got fired for stealing the narcotics, and I'm not sure if I should even try to get spousal support because I'm not sure if he will ever be able to even practice medicine in the US. And he wants to go into anesthesia lol. No I did NOT know about any of this until we separated and I found all the paperwork hidden in an accordion file in the back of a closet :/",
        "created_utc": 1674915179,
        "upvote_ratio": 1.0
    }
]