[
    {
        "title": "\"Everything\" vs \"Triangle of Sadness\"",
        "author": "davidjoho",
        "url": "https://www.reddit.com/r/movies/comments/11sv98j/everything_vs_triangle_of_sadness/",
        "text": "I finally figured out why I ultimately didn't like \"Triangle of Sadness\" but loved \"Everything Everywhere All at Once\", even though demographically that's backwards. (I'm old.)\n\n\"Triangle\" assumes a narrowing of possibilities and the dissolution of connections. \"Everywhere\" is about the explosion of possibilities and a context of infinite connections.\n\nI think and hope that this is a  generational change.\n\nThere are certainly things I liked about \"Triangle\" and (a very few) aspects of \"EEAAO\" that didn't work for me. But \"Triangle\" is orderly, rational, and extremely binary in its viewpoints, pitting two people or two ideas against each other. Tellingly, \"Triangle\"'s depiction of chaos is in terms of literal vomit.\n\nIn contrast, \"Everything\" obviously rejoices in the chaos of simultaneous, infinite, contradictory possibilities. (Where's the waggling sausage fingers emoji when we need it?!) That mirrors the switch from a world constrained by the homogeneity reinforced by our old reliance on centralized media and the othering made easy by physical distance.\n\nYou young reddit whippersnappers don't need a 72yo man to tell you any of this, but I nevertheless enjoyed -- and am heartened by -- the contrast with a \"progressive\" Oscar nominee like \"Triangle\"",
        "created_utc": 1678975831,
        "upvote_ratio": 1.0
    },
    {
        "title": "Bruce Campbell tells an unruly heckler to GTFO during a SXSW premiere event",
        "author": "wigglindicklin",
        "url": "https://twitter.com/samraimiupdates/status/1636230315646783490?s=21",
        "text": "",
        "created_utc": 1678975721,
        "upvote_ratio": 1.0
    },
    {
        "title": "Alcarras",
        "author": "Content_Ad_9438",
        "url": "https://youtube.com/watch?v=PW4MhdDfp4I&amp;feature=share",
        "text": "",
        "created_utc": 1678975084,
        "upvote_ratio": 1.0
    },
    {
        "title": "Ben Affleck refutes James Gunn’s claims of him directing a DC film: “I have nothing against James. Nice guy, he’s going to do a great job. But I’m not interested in that”",
        "author": "DamnThatsInsaneLol",
        "url": "https://www.hollywoodreporter.com/movies/movie-features/ben-affleck-air-production-company-grammys-memes-justice-league-1235353301/",
        "text": "",
        "created_utc": 1678974774,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is your favorite 2000s Brendan Fraser movie? (Bedazzled, Monkeybone, Mummy sequels, Looney Tunes Back in Action, etc.)",
        "author": "ggroover97",
        "url": "https://www.reddit.com/r/movies/comments/11suo58/what_is_your_favorite_2000s_brendan_fraser_movie/",
        "text": "After making a post for Brendan Fraser's 90s output, it felt natural to do the same with his 2000s work.  Which one is your favorite?\n\nYour choices:\n\n* [Bedazzled](https://www.youtube.com/watch?v=tfpLEU2YKzc&amp;ab_channel=MovieTrailerGraveyard) (2000): Hopeless dweeb Elliot Richards is granted seven wishes by the Devil to snare Allison, the girl of his dreams, in exchange for his soul.\n* [Monkeybone](https://www.youtube.com/watch?v=LsGy7tveEo4&amp;ab_channel=JoBloAnimatedVideos) (2001): In a coma, a cartoonist finds himself trapped within his own underground creation and must find a way to get back, while racing against his popular but treacherous character, Monkeybone.\n* [The Mummy Returns](https://www.youtube.com/watch?v=3yXjs7BUKYc&amp;ab_channel=RottenTomatoesClassicTrailers) (2001): The mummified body of Imhotep is shipped to a museum in London, where he once again wakes and begins his campaign of rage and terror.\n* [The Quiet American](https://www.youtube.com/watch?v=X-hUSR3ENdw&amp;ab_channel=LionsgatePlay) (2002): An old British reporter vies with a young U.S. doctor for the affections of a beautiful Vietnamese woman.\n* [Looney Tunes: Back in Action](https://www.youtube.com/watch?v=Wjvc6VYwe0I&amp;ab_channel=WarnerBros) (2003): The Looney Tunes search for a man's missing father and the mythical Blue Monkey diamond.\n* [Journey to the End of the Night](https://www.youtube.com/watch?v=qQVFaz_ddA4&amp;ab_channel=MillenniumMedia) (2006): The tale of a son and his father separately plotting to escape the desolation of their lives in the lurid underworld of Brazil's sex industry.\n* [Journey to the Center of the Earth](https://www.youtube.com/watch?v=iJkspWwwZLM&amp;ab_channel=Nicolikinz1) (2008): On a quest to find out what happened to his missing brother, a scientist, his nephew and their mountain guide discover a fantastic and dangerous lost world in the center of the earth.\n* [The Mummy: Tomb of the Dragon Emperor](https://www.youtube.com/watch?v=5-4qSE2Ch0Y&amp;ab_channel=RottenTomatoesClassicTrailers) (2008): In the Far East, Alex O'Connell, the son of famed mummy fighters Rick and Evy O'Connell, unearths the mummy of the first Emperor of Qin -- a shape-shifting entity cursed by a witch centuries ago.\n* [Inkheart](https://www.youtube.com/watch?v=6wKm5vU6SSU&amp;ab_channel=WarnerBros) (2008): A teenage girl discovers her father has an amazing talent to bring characters out of their books and must try to stop a freed villain from destroying them all, with the help of her father, her aunt, and a storybook's hero.",
        "created_utc": 1678974463,
        "upvote_ratio": 1.0
    },
    {
        "title": "EEOAO is Good but not that good",
        "author": "West-Drink-1530",
        "url": "https://www.reddit.com/r/movies/comments/11sulq8/eeoao_is_good_but_not_that_good/",
        "text": "I always wanted to post it here but I let it slide. After I saw that it won the best picture I had to i liked EEOAO it's good but I just couldn't live it because I reall didn't relate or feel for the characters nor did they have any great character moments. The characters are just so forgettable imo. I don't know why but they just didn't work for me. Hot take but personally think black widow had way better character moments and I actually could feel for them lol. But just my opinion.",
        "created_utc": 1678974310,
        "upvote_ratio": 1.0
    },
    {
        "title": "Joaquin Phoenix, Leonardo DiCaprio, Viggo Mortensen &amp; Regina Hall to Join Ensemble Cast of Paul Thomas Anderson's Next Film, Per ProductionWeekly",
        "author": "DamnThatsInsaneLol",
        "url": "https://oltnews.com/joaquin-phoenix-regina-hall-and-viggo-mortensen-would-be-jordan-ruimy",
        "text": "",
        "created_utc": 1678974214,
        "upvote_ratio": 1.0
    },
    {
        "title": "Sharon Stone in TOTAL RECALL was a amazing character. What do you think was her motivation?",
        "author": "Lili_Danube",
        "url": "https://www.reddit.com/r/movies/comments/11sujqi/sharon_stone_in_total_recall_was_a_amazing/",
        "text": "I always felt she hated Arnold Schwarzenegger's character because she had to have sex with him. She's pretty sadistic in the movie, always trying to slash  Schwarzenegger with a butcher knife or using her martial arts skill to no success. \n\nFunny that she could easily beat up Rachel Ticotin but Arnold had no problem taking her down. He didn't even break a sweat, the only time she does get to deliver solid hits is when he's already down. \n\nThen she has Michael Ironside as her real lover. I always thought Paul Verhoeven was referencing NOTORIOUS with these characters but Evil.",
        "created_utc": 1678974170,
        "upvote_ratio": 1.0
    },
    {
        "title": "Joaquin Phoenix, Leonardo DiCaprio, Viggo Mortensen &amp; Regina Hall In Talks to Join Ensemble Cast of Paul Thomas Anderson's Next Film, Per ProductionWeekly",
        "author": "DamnThatsInsaneLol",
        "url": "https://oltnews.com/joaquin-phoenix-regina-hall-and-viggo-mortensen-would-be-jordan-ruimy",
        "text": "",
        "created_utc": 1678974168,
        "upvote_ratio": 1.0
    },
    {
        "title": "Joaquin Phoenix, Leonardo DiCaprio, Viggo Mortensen &amp; Regina Hall In Talks to Join Ensemble Cast of Paul Thomas Anderson's Next Film, Per ProductionWeekly",
        "author": "DamnThatsInsaneLol",
        "url": "https://www.worldofreel.com/blog/2023/3/3fbgljiurdtywkbbpam09r9ipi99r1",
        "text": "",
        "created_utc": 1678974071,
        "upvote_ratio": 1.0
    },
    {
        "title": "BEACHES (1988): Tear-jerking melodrama featuring two unlikable female leads. How did it work?",
        "author": "Lili_Danube",
        "url": "https://www.reddit.com/r/movies/comments/11su4mt/beaches_1988_tearjerking_melodrama_featuring_two/",
        "text": "I watched BEACHES and my god, these two women were absolutely insufferable. Bette Midler's character is a complete egomaniac who expects everyone to coddle her up whereas Barbara Hershey's is passive-aggressive and bitter. They seem absolutely miserable except when they're together and even they fight. \n\nHalfway through the movie, I was struggling to be invested but as it went on, Midler's character is just so selfish, with how she dumps Spalding Gray's character, but the inclusion of the daughter actually made her character more likable and the contrived Terminal disease arc which came out of nowhere and the manipulative use of Wind Beneath My Wings. \n\nI can see why it was a big hit. Certainly a far cry from THE ROSE, in my opinion.",
        "created_utc": 1678973180,
        "upvote_ratio": 1.0
    },
    {
        "title": "Nuance Power PDF Advanced 4.3 Crack Key Full Version 2023",
        "author": "ahmadkanju",
        "url": "https://fullcrackedpc.com/nuance-power-pdf-advanced-crack/",
        "text": "",
        "created_utc": 1678973060,
        "upvote_ratio": 1.0
    },
    {
        "title": "What are some absolutely terrible martial arts films?",
        "author": "MyAuraIsViolet",
        "url": "https://www.reddit.com/r/movies/comments/11su0ht/what_are_some_absolutely_terrible_martial_arts/",
        "text": "[removed]",
        "created_utc": 1678972886,
        "upvote_ratio": 1.0
    },
    {
        "title": "Stop Making Sense | Official Promo | A24",
        "author": "aresef",
        "url": "https://youtu.be/mpGkipN30dc",
        "text": "",
        "created_utc": 1678972773,
        "upvote_ratio": 1.0
    },
    {
        "title": "From the two, what are you more inclined to? Theatre or Television? I'll go with Theatre.",
        "author": "AyanTypes",
        "url": "https://i.redd.it/fppr6pec75oa1.jpg",
        "text": "",
        "created_utc": 1678972531,
        "upvote_ratio": 0.99
    },
    {
        "title": "Stop Making Sense | Official Promo | A24",
        "author": "Kylestache",
        "url": "https://www.youtube.com/watch?v=mpGkipN30dc",
        "text": "",
        "created_utc": 1678972499,
        "upvote_ratio": 1.0
    },
    {
        "title": "PSA: Don't watch Grand Budapest Hotel if you're sensitive to animal cruelty",
        "author": "p00kel",
        "url": "https://www.reddit.com/r/movies/comments/11stplg/psa_dont_watch_grand_budapest_hotel_if_youre/",
        "text": "I can handle some pretty violent/disturbing stuff in horror movies when I'm expecting it, but last night we were in the mood for a comedy and I've always heard that Wes Anderson's stuff is good in a quirky/offbeat way, which is the kind of thing I like, but I hadn't seen any of them before. So we started watching Grand Budapest Hotel.\n\nI was enjoying it up until the scene where &gt;!someone throws a cat out the window and then you see the flattened, bloody cat on the street below!&lt; and THEN a couple scenes later you see the owner &gt;!visit the coat check where he's handed a bloody bag with his cat's dead body in it. !&lt;We had to turn the TV off at that point as I was crying so hard, and I'm definitely never going to watch the rest of the movie.\n\nNo judgment on people who enjoyed this movie, I know many people aren't sensitive like I am. But if animal death bothers you, make sure to check trigger warnings ([doesthedogdie.com](https://doesthedogdie.com) is great) before watching any Wes Anderson movie. Apparently he does this a lot. I didn't think to check because I don't expect that kind of thing in a comedy, yk? And for me the fact that it's a comedy makes it that much worse, because this sad, horrific thing is being played for laughs.\n\nAnyway, it was a pretty good movie otherwise, don't let me scare you away from it if the above scenes wouldn't be a problem for you. Just wanted to let people know, because I got blindsided.",
        "created_utc": 1678972157,
        "upvote_ratio": 1.0
    },
    {
        "title": "Most Popular Movies to Watch in Theaters This Week",
        "author": "assistantofmanager",
        "url": "https://wealthofgeeks.com/movies-out-now",
        "text": "",
        "created_utc": 1678971659,
        "upvote_ratio": 1.0
    },
    {
        "title": "Do you know of any movie or series character whose original idea was going to be different from what it ended up being?",
        "author": "lulzzang",
        "url": "https://www.reddit.com/r/movies/comments/11stash/do_you_know_of_any_movie_or_series_character/",
        "text": "[removed]",
        "created_utc": 1678971114,
        "upvote_ratio": 1.0
    },
    {
        "title": "Are you excited about John Wick 4? It’s very rare for me that a franchise can get me this excited after 3 movies. What’s your opinion?",
        "author": "bucskesz",
        "url": "https://i.redd.it/ksy1r3hx25oa1.jpg",
        "text": "",
        "created_utc": 1678971045,
        "upvote_ratio": 1.0
    },
    {
        "title": "Are you excited about John Wick 4?It’s very rare for me that a franchise can get me this excited after 3 movies. What’s your opinion?",
        "author": "bucskesz",
        "url": "https://i.redd.it/neg76onn25oa1.jpg",
        "text": "",
        "created_utc": 1678970953,
        "upvote_ratio": 1.0
    },
    {
        "title": "School of Rock (2003) is free on YouTube. Read between the lines, Theo.",
        "author": "AndyKaufmanSentMe",
        "url": "https://youtu.be/bZq0lFWDN0s",
        "text": "",
        "created_utc": 1678970685,
        "upvote_ratio": 1.0
    },
    {
        "title": "'A Love Letter to Tollywood': Producer Raj Kapoor Discusses Bringing 'Naatu Naatu' to the Oscars Stage | A.frame",
        "author": "aresef",
        "url": "https://aframe.oscars.org/news/post/oscar-producer-raj-kapoor-naatu-naatu-interview",
        "text": "",
        "created_utc": 1678970551,
        "upvote_ratio": 1.0
    },
    {
        "title": "Barry Keoghan reportedly joins Paul Mescal in ‘Gladiator 2’ as the main antagonist of the film.",
        "author": "jamesc90",
        "url": "https://www.giantfreakinrobot.com/ent/barry-keoghan-gladiator-2-geta.html",
        "text": "",
        "created_utc": 1678970502,
        "upvote_ratio": 1.0
    },
    {
        "title": "Which of the sex scenes in Love (2015) were in unsimulated?",
        "author": "Peon-Flux",
        "url": "https://www.reddit.com/r/movies/comments/11st0uc/which_of_the_sex_scenes_in_love_2015_were_in/",
        "text": "[removed]",
        "created_utc": 1678970415,
        "upvote_ratio": 1.0
    },
    {
        "title": "One of my favorites",
        "author": "SexieBellagirl",
        "url": "https://i.redd.it/pulr7h8p05oa1.jpg",
        "text": "",
        "created_utc": 1678970295,
        "upvote_ratio": 1.0
    },
    {
        "title": "Looking for recommendations for brilliantly written movies",
        "author": "EzraMusic98",
        "url": "https://www.reddit.com/r/movies/comments/11ssuko/looking_for_recommendations_for_brilliantly/",
        "text": "This year's movies that were released was more than decent, with the understated but life affirming Living, bleak comedy Banshees of Inisherin and the philosophical Everyhting Everywhere At Once, which you might have heard of during awards season.\n\nI'm reaching out to fans out there who could point out to me some more well written movies, which combine honest and realistic acting, wonderful writing and a plot which keeps one interested and doesn't make your mind wander about dinner or something else while watching.\n\nSome movies that I've gravitated to over the years have been The Treasure of the Sierra Madre, Ordinary People, The Godfather 1 and 2 and The Third Man.\n\nRecommendations appreciated!",
        "created_utc": 1678969983,
        "upvote_ratio": 1.0
    },
    {
        "title": "Movie podcast co hosts needed",
        "author": "gman13579",
        "url": "https://www.reddit.com/r/movies/comments/11ssqov/movie_podcast_co_hosts_needed/",
        "text": "[removed]",
        "created_utc": 1678969726,
        "upvote_ratio": 1.0
    },
    {
        "title": "“Big” franchises yet to watch",
        "author": "ravenreignxo",
        "url": "https://www.reddit.com/r/movies/comments/11ssn4l/big_franchises_yet_to_watch/",
        "text": "[removed]",
        "created_utc": 1678969465,
        "upvote_ratio": 1.0
    },
    {
        "title": "Obscure horror / thriller films 2020 onwards",
        "author": "ShiningEnigma",
        "url": "https://www.reddit.com/r/movies/comments/11sslgu/obscure_horror_thriller_films_2020_onwards/",
        "text": "I think I'm fairly up to date on the successful and well received horror films of the last 3 years but does anyone have any recommendations for more obscure releases?  I'm typically interested in dark, surreal and bizarre, rabbit hole style plots rather than straightforward slashers and supernatural horrors.",
        "created_utc": 1678969345,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can anyone Know about this movie??(very Hard)",
        "author": "MADMAX-18",
        "url": "https://www.reddit.com/r/movies/comments/11srw14/can_anyone_know_about_this_movievery_hard/",
        "text": "\nIm looking for this movie since I was a little kid\n\nI saw it on Disney channel and It was about Boy and a dog. And his dog somehow became A Human, but bad guys trying to capture his dog so Boy trying to rescue him\n\nIt was not a Shaggy dog, the main character was a young and handsome boy\n\nI saw it on Disney channel so mabey Disney channel original movie?\n\nAnyone know?\n\nImma hardcore movie fan and I see lots of Old 70s 80s 90s even 1910s movies but I can't find this childhood movie",
        "created_utc": 1678967570,
        "upvote_ratio": 1.0
    },
    {
        "title": "Hollywood's Attack on Henry Cavill Continues",
        "author": "karmagheden",
        "url": "https://youtu.be/9GboiTTG35c",
        "text": "",
        "created_utc": 1678966953,
        "upvote_ratio": 1.0
    },
    {
        "title": "Which movie is best out of: Interstellar, Gravity, The Martian &amp; Arrival",
        "author": "Weorking",
        "url": "https://www.reddit.com/r/movies/comments/11srf1e/which_movie_is_best_out_of_interstellar_gravity/",
        "text": "[removed]",
        "created_utc": 1678966258,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can Matt Reeves become an renowned director like Villeneuve or Nolan",
        "author": "Batman_Begins007",
        "url": "https://www.reddit.com/r/movies/comments/11srdbt/can_matt_reeves_become_an_renowned_director_like/",
        "text": "Though he's made a number of high-profile tentpole films already, it feels like Matt Reeves has been laboring away under the auteur radar for over a decade. The director of \"Cloverfield,\" \"Let Me In,\" \"Dawn of the Planet of the Apes,\" and \"War for the Planet of the Apes\" has gained a new level of attention for helming \"The Batman,\" but he's already built up an impressive filmography since he crossed back over from television into moviemaking in 2008. In a less superhero-obsessed world, it feels like Reeves' name would carry more clout by now, similar to his contemporary, Denis Villeneuve, another filmmaker who emerged as a distinctive new voice around the same time and has since come into his own as a science fiction director.\n\nRead More: https://www.slashfilm.com/787763/its-time-to-admit-matt-reeves-is-one-of-our-best-blockbuster-auteurs/",
        "created_utc": 1678966130,
        "upvote_ratio": 1.0
    },
    {
        "title": "did you like the recent batman?",
        "author": "varuunnkumarr",
        "url": "https://www.reddit.com/r/movies/comments/11srb3s/did_you_like_the_recent_batman/",
        "text": "[removed]",
        "created_utc": 1678965948,
        "upvote_ratio": 1.0
    },
    {
        "title": "MixPad 10.27 Crack Free Download With Registration Code 2023 -",
        "author": "ahmadkanju",
        "url": "https://fullcrackedpc.com/mixpad-crack/",
        "text": "",
        "created_utc": 1678965717,
        "upvote_ratio": 1.0
    },
    {
        "title": "Wow, incredible! 👏🏾 Our first episode „The Lazy Man“ on YouTube has already reached over 5,000 views in just 2 weeks! PS: We will be announcing the second episode this Sunday. Stay tuned!",
        "author": "Akwasi_Valentine",
        "url": "http://youtu.be/6QpIjpeD9p8",
        "text": "",
        "created_utc": 1678965588,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do you feel about this?",
        "author": "zlakhal",
        "url": "https://i.redd.it/2a8iwdntl4oa1.png",
        "text": "[removed]",
        "created_utc": 1678965295,
        "upvote_ratio": 1.0
    },
    {
        "title": "In praise of Jerry Wunderlich",
        "author": "TheLadyEve",
        "url": "https://www.reddit.com/r/movies/comments/11sr24d/in_praise_of_jerry_wunderlich/",
        "text": "Jerry Wunderlich was a set decorator and art director for a long time. In 1995, I was 15 and was flying into LaGuardia and I sat next to him. I had no idea who he was. He made polite conversation and I brought up that I loved film, John Huston, Orson Welles, Hitchcock, all that, and he said \"well have you ever seen the Exorcist?\" I said \"yes, of course, that's such a great movie!\" Then he told me he managed the set dec on that movie. So I was interested and I wanted to hear everything he had to say. I learned that, according to him, it wasn't just pea soup for the vomit scene, they added yogurt to it, the HVAC system failed during filming so people complained of feeling nauseated by the smell of the fake vomit, but overall he said it was one of the best projects he had done. \n\nAnd when we landed, he said \"It was so nice to meet you, and don't worry, you're young, you're sharp, and you can probably do anything you set out to do.\"\n\nSo Jerry Wunderlich gave me the support no one else ever did, which is random and odd, but thanks Mr. Wunderlich. Also, apparently he did set dec for Vanishing Point, too, which I didn't know until recently and I love that movie so much.",
        "created_utc": 1678965206,
        "upvote_ratio": 1.0
    },
    {
        "title": "HOLA, TE DEJO MI NUEVO TEMA DE BOOMBAP SERIO, DALE AMOR , Y SI TE GUSTA PUES LIKE, COMENTARIO... GRACIAS ❤🔥",
        "author": "taaaal96",
        "url": "https://youtu.be/-XLS9JjIgMI",
        "text": "",
        "created_utc": 1678965200,
        "upvote_ratio": 1.0
    },
    {
        "title": "Hands of Sheitan (2014) a movie that came off as porn first but definitely gave me a thrilling ride .",
        "author": "baadass9",
        "url": "https://www.reddit.com/r/movies/comments/11sr031/hands_of_sheitan_2014_a_movie_that_came_off_as/",
        "text": "I don't know how many know this film , got to watch this because of @extramile sub , this mostly comes off as porn but it definitely held my attention through out with the background music  .\n\n The idea that a man is affected by unknown entity which is called shaitan here and then the mother too gets  affected somehow crazily .\n\nHow the shaitan plays around with these two people's life which by metaphor humanity is portrayed through gruesome sex which is incest between mother son .\n\nIt's a horror movie at core , with some extremely wtf kind of moments through out .",
        "created_utc": 1678965035,
        "upvote_ratio": 1.0
    },
    {
        "title": "Imagine the Academy would add a Stuntman category and Tom Cruise would win",
        "author": "justavault",
        "url": "https://www.reddit.com/r/movies/comments/11sqx3m/imagine_the_academy_would_add_a_stuntman_category/",
        "text": "He's co-designing and designing some genuinely creative stunts and I wonder if that would be a fair win or if that would diminish the value of very lethal stunts. And then how would one evaluate the value of stunts? By sheer danger value? Or by creativity? By cinematographic impact? By story relevance? By character matching? \n\nI think a stuntman category is in need, but it must be clearly defined as not being related to simple potential danger of execution.",
        "created_utc": 1678964786,
        "upvote_ratio": 1.0
    },
    {
        "title": "Imagine the Academy would add a Stuntman category and Tom Cruise would win.",
        "author": "justavault",
        "url": "https://www.reddit.com/r/movies/comments/11sqtnq/imagine_the_academy_would_add_a_stuntman_category/",
        "text": "[removed]",
        "created_utc": 1678964504,
        "upvote_ratio": 1.0
    },
    {
        "title": "In praise of Jerry Wunderlich. And other professionals who handle set decoration, art direction, AD, etc.",
        "author": "TheLadyEve",
        "url": "https://www.reddit.com/r/movies/comments/11sqqks/in_praise_of_jerry_wunderlich_and_other/",
        "text": "Jerry Wunderlich was a set decorator and art director for a long time. In 1995, I was 15 and was flying into LaGuardia and I sat next to him. I had no idea who he was. He made polite conversation and I brought up that I loved film, John Huston, Orson Welles, Hitchcock, all that, and he said \"well have you ever seen the Exorcist?\" I said \"yes, of course, that's such a great movie!\" Then he told me he managed the set dec on that movie. So I was interested and I wanted to hear everything he had to say. I learned that, according to him, it wasn't just pea soup for the vomit scene, they added yogurt to it, the HVAC system failed during filming so people complained of feeling nauseated by the smell of the fake vomit, but overall he said it was one of the best projects he had done. \n\nAnd when we landed, he said \"It was so nice to meet you, and don't worry, you're young, you're sharp, and you can probably do anything you set out to do.\"\n\nSo Jerry Wunderlich gave me the support no one else ever did, which is random and odd, but thanks Mr. Wunderlich. Also, apparently he did set dec for Vanishing Point, too, which I didn't know until recently and I love that move so much.",
        "created_utc": 1678964257,
        "upvote_ratio": 1.0
    },
    {
        "title": "Hollywood Attacking Henry Cavill, Stealing His Projects as He Doesn't Fit Their Narrative, Says YouTuber Melonie Mac: \"They emasculate male characters any opportunity they get\"",
        "author": "karmagheden",
        "url": "https://fandomwire.com/hollywood-attacking-henry-cavill-stealing-his-projects-as-he-doesnt-fit-their-narrative-says-youtuber-melonie-mac-they-emasculate-male-characters-any-opportunity-they-get/",
        "text": "",
        "created_utc": 1678963483,
        "upvote_ratio": 1.0
    },
    {
        "title": "Empire Strikes Back originally screened two ending in theaters",
        "author": "fishstock",
        "url": "https://www.giantfreakinrobot.com/ent/empire-strikes-2-endings.html",
        "text": "",
        "created_utc": 1678963142,
        "upvote_ratio": 1.0
    },
    {
        "title": "Movie 2023 18+",
        "author": "No_Consequence3238",
        "url": "https://www.reddit.com/r/movies/comments/11sqdig/movie_2023_18/",
        "text": "[removed]",
        "created_utc": 1678963074,
        "upvote_ratio": 1.0
    },
    {
        "title": "Names of must watch French movies?",
        "author": "ninezar",
        "url": "https://www.reddit.com/r/movies/comments/11sqcih/names_of_must_watch_french_movies/",
        "text": "To say that I have watched many French movies would be an adamant untruth. However one movie that I'm clearly stuck with or rather that refuses to leave my mind is La Haine. To express why that is so, would be trying to constrict an elephant within a very limited and liminal space. Howber, I would really love to know about the French movies that you have watched/ that you think are must watches!",
        "created_utc": 1678962981,
        "upvote_ratio": 1.0
    },
    {
        "title": "Top 15 Family Adventure Movies List",
        "author": "romik666",
        "url": "https://cine-bites.com/top-15-best-family-adventure-movies/",
        "text": "",
        "created_utc": 1678962181,
        "upvote_ratio": 1.0
    },
    {
        "title": "شعر بالنهاية وانه يموت ولم يدري بنفسه الا هو ....",
        "author": "Vika-pandarosh",
        "url": "https://youtube.com/clip/UgkxdkSNX9Ecpi5Tst3x9T38uBP4eqdD_0XJ",
        "text": "",
        "created_utc": 1678961784,
        "upvote_ratio": 1.0
    },
    {
        "title": "Lets they make a movie \"The young Stan Lee\" and put Tom Holland to play him",
        "author": "dondurma_efendi",
        "url": "https://www.reddit.com/r/movies/comments/11spx2o/lets_they_make_a_movie_the_young_stan_lee_and_put/",
        "text": "[removed]",
        "created_utc": 1678961599,
        "upvote_ratio": 1.0
    },
    {
        "title": "Bullet Train : Lemon and Tangerine Spin-Off Prequel",
        "author": "FrequentTurnip4006",
        "url": "https://www.reddit.com/r/movies/comments/11spqcc/bullet_train_lemon_and_tangerine_spinoff_prequel/",
        "text": "[removed]",
        "created_utc": 1678960993,
        "upvote_ratio": 1.0
    },
    {
        "title": "why is Godzila 2014 so freaking bad?",
        "author": "NigaMachete",
        "url": "https://i.redd.it/9hzx8q5a84oa1.png",
        "text": "",
        "created_utc": 1678960739,
        "upvote_ratio": 1.0
    },
    {
        "title": "Which movies have your favorite external references?",
        "author": "Ebbemonster",
        "url": "https://www.reddit.com/r/movies/comments/11spln9/which_movies_have_your_favorite_external/",
        "text": "When watching a movie it is always pretty cool if you can tell your friends about all the cool references like: \"Did you know that the movie shown on the TV in Halloween is the original The Thing\", \"did you know that the rock-rolling-scene in Indiana Jones was actually a ripoff\" or \"you know that the game they played in Hackers was a prototype of Whipeout\"! So....\n\n&amp;#x200B;\n\n* Which movies do you think have the coolest references?\n* Which movies have the most references?\n* Which is your favorite references?\n\nFor me it has to be Hackers (1995). The amount of references is just insane! They refer to real hacker names, real hacker books, to movies and actual hacks. It is like one big reference encyclopedia for real hackers. My favorite reference is when they have to come up with \"hacker names\", and they mention a bunch of ridiculous hacker names, and then reject them for being too stupid. Those were names of REAL hackers!! Ha ha ha.....",
        "created_utc": 1678960563,
        "upvote_ratio": 1.0
    },
    {
        "title": "What Movie are you the most excited for in 2023?",
        "author": "Tobi18x",
        "url": "https://www.reddit.com/r/movies/comments/11spiyi/what_movie_are_you_the_most_excited_for_in_2023/",
        "text": "For me, it's gotta be Evil Dead Rise\n\nAlthough, I gotta say, I'm a bit scared that it'll not deliver on the high bar the four movies prior to this one have set.\nI absolutely love the Evil Dead franchise, the original trilogy is, in my opinion, the best Horror movie series, not one of them is bad, they got goovy humor, awesome low budget costumes, well written characters and a fun to watch story. The remake absolutely delivered on the scale of a shocking horror movie, I watched it when I was about 14, I had nightmares for days, but it's such an amazing movie. I sure hope Evil Dead Rise delivers on that, but I have my hopes high",
        "created_utc": 1678960285,
        "upvote_ratio": 1.0
    },
    {
        "title": "What do we think of this movie in this sub?",
        "author": "Buffvamporigfan",
        "url": "https://i.redd.it/opld9f2z44oa1.jpg",
        "text": "",
        "created_utc": 1678959627,
        "upvote_ratio": 1.0
    },
    {
        "title": "I watched The Rise of Skywalker and it was so bad it's almost good",
        "author": "Shamon_Yu",
        "url": "https://www.reddit.com/r/movies/comments/11sp5mc/i_watched_the_rise_of_skywalker_and_it_was_so_bad/",
        "text": "I knew it was poorly received even before I saw it. But dear Lord it was bad.\n\nThe plot was like poorly written fanfiction:\n\n\"Let's bring back Palpatine but let's not explain how.\"\n\n\"Let's make another shocking family tree reveal involving paternal relations, there's only been two so far in the franchise.\"\n\n\"Wouldn't it be cool if the outline of the dagger showed the correct location when viewed against a \\*randomly scattered pile of space junk\\*?\"\n\n\"There's already 'First Order'. Hey, what about 'Final Order' since this is the final movie?\"\n\n\"Let them believe some heroes die and then reveal they survived after all. Let's do something like this \\*twice\\*.\"\n\nThe dialogue and especially the one-liners were comically bad even by SW standards. And the pacing was awfully tight, as if they tried to fit a movie twice as long into 2.5 hours.",
        "created_utc": 1678958962,
        "upvote_ratio": 1.0
    },
    {
        "title": "Cinema, a Reflection of Life: A Closer Look",
        "author": "Tellmesomethin_",
        "url": "https://blogsbydeveshdate.blogspot.com/2023/02/cinema-reflection-of-life-closer-look.html",
        "text": "",
        "created_utc": 1678958744,
        "upvote_ratio": 1.0
    },
    {
        "title": "TV shows recommendations",
        "author": "alpha47865",
        "url": "https://www.reddit.com/r/movies/comments/11sp103/tv_shows_recommendations/",
        "text": "[removed]",
        "created_utc": 1678958504,
        "upvote_ratio": 1.0
    },
    {
        "title": "The Movie Critic",
        "author": "BuffaloBillaa",
        "url": "https://www.reddit.com/r/movies/comments/11sos9e/the_movie_critic/",
        "text": "\n\nJust saw the news that Tarantino is gearing up for his 10th and final movie which is to be named The Movie Critic. I was hoping that he should end with an out and out horror movie but another history laden drama also works.So my question is which movie critic is this going to be about and why it should be Roger Ebert ???",
        "created_utc": 1678957640,
        "upvote_ratio": 1.0
    },
    {
        "title": "The Movie Critic",
        "author": "BuffaloBillaa",
        "url": "https://www.reddit.com/r/movies/comments/11soq3h/the_movie_critic/",
        "text": "[removed]",
        "created_utc": 1678957436,
        "upvote_ratio": 1.0
    },
    {
        "title": "One &amp; Only!!!",
        "author": "Dr_Spark20",
        "url": "https://v.redd.it/p6acwpzfb2oa1",
        "text": "",
        "created_utc": 1678955669,
        "upvote_ratio": 1.0
    },
    {
        "title": "First official image from BOND 25",
        "author": "davogny",
        "url": "https://i.redd.it/tqtudwc1b2oa1.jpg",
        "text": "",
        "created_utc": 1678955494,
        "upvote_ratio": 1.0
    },
    {
        "title": "Bruce Campbell yells at man who heckled Evil Dead Rise premiere",
        "author": "MitTiger",
        "url": "https://twitter.com/OneTakeNews/status/1636237071592439809?s=20",
        "text": "",
        "created_utc": 1678954784,
        "upvote_ratio": 1.0
    },
    {
        "title": "The worst and best movies winning \"best picture\" in Academy Awards for you?",
        "author": "SavingsService2138",
        "url": "https://www.reddit.com/r/movies/comments/11snsrf/the_worst_and_best_movies_winning_best_picture_in/",
        "text": "Worst : \n\nGone With the Wind : Amazing cinematic achievement, story with heavy racist overtone\n\nThe Departed : not terrible but its diet coke Infernal Affairs + Leo is awful in it\n\nIts kinda nitpicking because you can't have a terrible best picture movie, it will have some qualities.\n\nBest : \n\nOn the Waterfront/ Amadeus : I'm blown away how good they are and how they still holds up today. Amazing performances, emotions, characters, story.",
        "created_utc": 1678953964,
        "upvote_ratio": 1.0
    },
    {
        "title": "Actors/actresses you would’ve loved to have seen in a movie they weren’t in?",
        "author": "NoArcher2536",
        "url": "https://www.reddit.com/r/movies/comments/11snsho/actorsactresses_you_wouldve_loved_to_have_seen_in/",
        "text": "[removed]",
        "created_utc": 1678953934,
        "upvote_ratio": 1.0
    },
    {
        "title": "Movies you would’ve loved to have seen another actor in?",
        "author": "NoArcher2536",
        "url": "https://www.reddit.com/r/movies/comments/11snrb1/movies_you_wouldve_loved_to_have_seen_another/",
        "text": "[removed]",
        "created_utc": 1678953806,
        "upvote_ratio": 1.0
    },
    {
        "title": "Ninjas are ridiculous 😂",
        "author": "Ebbemonster",
        "url": "https://youtu.be/WKLhVxqkUFk",
        "text": "When people say that superheroes are overpowered it is just because they haven't seen what ninjas are capable of. Ninjas would easily be able to beat most of the Avengers!",
        "created_utc": 1678953713,
        "upvote_ratio": 1.0
    },
    {
        "title": "Poker Face TV Series, Watch TV Shows Online",
        "author": "S-pOrtS",
        "url": "https://www.reddit.com/r/movies/comments/11sneo7/poker_face_tv_series_watch_tv_shows_online/",
        "text": "[removed]",
        "created_utc": 1678952490,
        "upvote_ratio": 1.0
    },
    {
        "title": "check now",
        "author": "Abbaspk12",
        "url": "https://youtube.com/shorts/MmtOuZL4wLM?feature=share",
        "text": "",
        "created_utc": 1678952364,
        "upvote_ratio": 1.0
    },
    {
        "title": "Joker 2 filming in downtown L.A.",
        "author": "timetoremodel",
        "url": "https://twitter.com/ladygagasourcex/status/1632214221592178693?s=10",
        "text": "",
        "created_utc": 1678951949,
        "upvote_ratio": 1.0
    },
    {
        "title": "What Oscar nominated films have high rewatchability?",
        "author": "Angelix",
        "url": "https://www.reddit.com/r/movies/comments/11sn80g/what_oscar_nominated_films_have_high/",
        "text": "Yesterday it was my 4th rewatch of Everything Eveywhere All at Once and I still enjoyed it immensely. In fact, I cried even harder with each subsequent rewatch. There are also a lot of new things you can notice after repeated watching. I find a lot of Oscar nominated films very hard to digest and it’s mentally taxing for me just to sit through it in a single sitting.",
        "created_utc": 1678951780,
        "upvote_ratio": 1.0
    },
    {
        "title": "#MatthewLillard #Scream6",
        "author": "Maleficent-Poem4387",
        "url": "https://www.reddit.com/r/movies/comments/11sn5x1/matthewlillard_scream6/",
        "text": " I don't know if this scream movie is going to be good or bad this is the first Scream movie that's not going to have Sidney Prescott in it  I guess sense Neve Campbell has decided not to come back hopefully she will come back for the next one it will be great to see Matthew come back and reprise his role as Stu Macher The real question is how are they going to bring back Stu we all thought he died in first Scream so where's he been what's he been up to This has always been my opinion Stu never died he ended up in a coma since his family has a lot of money they've been able to hide it this whole time also people have never been able to notice him because his face was burned really bad [https://youtu.be/itdb1lTfgoM](https://youtu.be/itdb1lTfgoM)",
        "created_utc": 1678951555,
        "upvote_ratio": 1.0
    },
    {
        "title": "Recommendations for Fantasy Quest Movies",
        "author": "vegimorphthemovieboy",
        "url": "https://www.reddit.com/r/movies/comments/11sn1d9/recommendations_for_fantasy_quest_movies/",
        "text": "As part of an upcoming project, I'm researching fantasy movies where the heroes go on a great quest of some sort. I've already seen certain ones like The Neverending Story, Willow, Quest for Camelot, and to an extent, The Princess Bride, and know of others like Krull and Ladyhawke that I've been meaning to check out. Does anyone have any recommendations? Thanks.",
        "created_utc": 1678951059,
        "upvote_ratio": 1.0
    },
    {
        "title": "Zack Snyder is Planning Something Really Big For His Justice League",
        "author": "DragXito",
        "url": "https://www.dmedia.tech/2023/03/zack-snyder-is-planning-something.html",
        "text": "",
        "created_utc": 1678950243,
        "upvote_ratio": 1.0
    },
    {
        "title": "What’s one of your favorite scenes that uses diegetic music to build tension or emotion?",
        "author": "dhriggs",
        "url": "https://www.reddit.com/r/movies/comments/11smopp/whats_one_of_your_favorite_scenes_that_uses/",
        "text": "I love the pool hall scene in Carlito’s Way that uses Ray Barretto’s El Watusi while he sets up the “trick shot”. Brilliantly executed by DePalma.\n\nAnother favorite has gotta be Earth Angel swelling in the final dance in Back to the Future. Though it does get a little assist from Silvestri right at the end.",
        "created_utc": 1678949762,
        "upvote_ratio": 1.0
    },
    {
        "title": "Bruce Campbell Tells ‘Evil Dead Rise’ Heckler to ‘Get the F— Out’ of Rowdy SXSW Premiere",
        "author": "DaikaijuSokogeki01",
        "url": "https://variety.com/2023/film/news/bruce-campbell-evil-dead-rise-heckler-sxsw-premiere-1235556111/",
        "text": "",
        "created_utc": 1678949252,
        "upvote_ratio": 1.0
    },
    {
        "title": "How gory is Scream 6?",
        "author": "Keyblad3master",
        "url": "https://www.reddit.com/r/movies/comments/11smbl6/how_gory_is_scream_6/",
        "text": "I hate scary movies but I watch them anyway. I can handle scary. I HATE GORY. I can handle impalement, stabbing, lots of blood, decapitation, sliced in half. I don’t like ripping of skin to reveal inside body parts. I don’t like stuff like final destination, human centipede, or saw. I’m sorry I’m just being honest.",
        "created_utc": 1678948414,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is it good to watch \"One Flew over the Cuckoo's nest\" in an airplane on a 12\"9 iPad Pro?",
        "author": "thePian0Star",
        "url": "https://www.reddit.com/r/movies/comments/11sm7w3/is_it_good_to_watch_one_flew_over_the_cuckoos/",
        "text": "Or should I watch The Pianist? I have always wanted to watch this movie, either Jack Nicholson, it looks great and I think now would be a fitting choice to watch it. However I want to ask if you think this would be a good viewing experience. Thank you kindly. \n\nIt would be great to finally experience this movie. \n\nThank you everybody!",
        "created_utc": 1678948051,
        "upvote_ratio": 1.0
    },
    {
        "title": "Twilightwomen",
        "author": "Financial_Battle_750",
        "url": "https://www.reddit.com/r/movies/comments/11sm3j6/twilightwomen/",
        "text": "[removed]",
        "created_utc": 1678947633,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is it good to watch \"One Flew Over the Cuckoo's Nest\" on an airplane on a 12\"9 iPad?",
        "author": "thePian0Star",
        "url": "https://www.reddit.com/r/movies/comments/11sm16x/is_it_good_to_watch_one_flew_over_the_cuckoos/",
        "text": "[removed]",
        "created_utc": 1678947419,
        "upvote_ratio": 1.0
    },
    {
        "title": "Inglorious Basterds and Band of Brothers",
        "author": "Man-of-the-sea-",
        "url": "https://www.reddit.com/r/movies/comments/11sm111/inglorious_basterds_and_band_of_brothers/",
        "text": "[removed]",
        "created_utc": 1678947403,
        "upvote_ratio": 1.0
    },
    {
        "title": "Question: What was that action movie I saw advertised a few weeks ago?",
        "author": "Yawn_Sven",
        "url": "https://www.reddit.com/r/movies/comments/11sm019/question_what_was_that_action_movie_i_saw/",
        "text": "[removed]",
        "created_utc": 1678947313,
        "upvote_ratio": 1.0
    },
    {
        "title": "Evil Dead Rise is looking good.",
        "author": "Practical_Ad_1849",
        "url": "https://i.redd.it/ydutofwr23oa1.jpg",
        "text": "",
        "created_utc": 1678946779,
        "upvote_ratio": 1.0
    },
    {
        "title": "everythin everywhere all at once free watch online or download",
        "author": "Mediocre-Midnight-79",
        "url": "https://www.reddit.com/r/movies/comments/11slpcr/everythin_everywhere_all_at_once_free_watch/",
        "text": "[removed]",
        "created_utc": 1678946298,
        "upvote_ratio": 1.0
    },
    {
        "title": "You’ll dance to anything.",
        "author": "newbytony",
        "url": "https://i.redd.it/nicn8kj903oa1.jpg",
        "text": "",
        "created_utc": 1678945935,
        "upvote_ratio": 1.0
    },
    {
        "title": "What’s your favorite Coen Brothers movie?",
        "author": "MRF1982",
        "url": "https://i.redd.it/lkcn8espy2oa1.jpg",
        "text": "",
        "created_utc": 1678945414,
        "upvote_ratio": 1.0
    },
    {
        "title": "[English SUB] Fast LaBa Garlic Recipe | How to Cook Chinese LaBa Garlic ...",
        "author": "Bodian-Life",
        "url": "https://youtube.com/watch?v=ifppWbH6Ut0&amp;feature=share",
        "text": "",
        "created_utc": 1678945411,
        "upvote_ratio": 1.0
    },
    {
        "title": "Need suggestions for apocalyptic/disaster movies (where the earth is about to end)",
        "author": "sp4rt4nmachine",
        "url": "https://www.reddit.com/r/movies/comments/11sld0l/need_suggestions_for_apocalypticdisaster_movies/",
        "text": "[removed]",
        "created_utc": 1678945101,
        "upvote_ratio": 1.0
    },
    {
        "title": "My changes to the Movie The Whale.",
        "author": "FitMeat7487",
        "url": "https://www.reddit.com/r/movies/comments/11slavp/my_changes_to_the_movie_the_whale/",
        "text": "1. The configuration of the apartment makes it impossible for Charlie to see shawows of people leaving  through his kitchen window \n\n2. Watching gay porn- totally unnecessary\n\nHere’s my change have an open white binder next to him on couch. Thomas arrives while Charlie’s  having a heart attack— says Oh my God because of his size and the situation. Charlie grabs an essay from binder and asks Thomas to read it)\n\n3. When Thomas runs to the pristine bedroom. As he’s spilling his story to Ellie, who’s recording him he looks around the room. The camera can follow as he sees some framed School pictures of Ellie on one side of the book shelf along with a bunch of white binders marked Ellie’s schoolwork.(now we have some context about the type of man Charlie was. And about who’s essay he kept reading.) On the other side he finds the framed picture of Charlie and Allen and finally the Bible.\n\n4. When Charlie calls Ellie just have her name show on his phone.\n\n5. Charlie’s shower — getting into that tub would have been very difficult for hm— standing like he was— impossible. So- the camera shows a draining tub, a wet and slightly swinging brush, a wet and slightly swinging ring he holds onto. A  used beach towel draped over the side then it moves up to Charlie shaving.\n\n6. A song should have been added to the credits. I’d pick Crystal sing by Lindsey BUCKINGHAM\n\nThe rest is fine and I wouldn’t change it.\n\n\nAs for the broken plate— we never see who breaks it and I don’t believe it matters.\n\nThe plates broken- it can no longer hold food.\nThe realization for Charlie may be— this is it- there’s only one more thing I can do- break through Ellie’s anger and have her remember she’s always been loved.\n\nI would make these changes because I was so lost in this movie that I had to rewatch it.\nWhat do you think?",
        "created_utc": 1678944891,
        "upvote_ratio": 1.0
    },
    {
        "title": "Stand and deliver",
        "author": "Embarrassed_Cap1099",
        "url": "https://www.reddit.com/r/movies/comments/11skrti/stand_and_deliver/",
        "text": "[removed]",
        "created_utc": 1678943083,
        "upvote_ratio": 1.0
    },
    {
        "title": "Good Will Hunting not for everyone",
        "author": "Morthosk",
        "url": "https://www.reddit.com/r/movies/comments/11skm4b/good_will_hunting_not_for_everyone/",
        "text": "I have watched Good Will Hunting two time within a year. The first time I felt like it was boring and poorly written. After marriage issues cropped up and I thought more about life I thought it was poignant and supremely well written. Open to both opinions and anything in between as long as the admission of where you are in life is included.",
        "created_utc": 1678942590,
        "upvote_ratio": 1.0
    },
    {
        "title": "Favorite drive in movie experience?",
        "author": "DirectionBasic3386",
        "url": "https://www.reddit.com/r/movies/comments/11ska65/favorite_drive_in_movie_experience/",
        "text": "Mine was Jurassic Park. The screen was in front of a bunch of trees, and when the T-Rex came out from behind the fence, it was one of the most engaging movie experiences I’ve ever had. I was sitting on the hood of my car. The wind was blowing. It was magical. Nothing will ever top it. We have one drive-in theater in my town and it might be going out of business soon. I will always love watching a movie at the drive-in on a warm\nSummer evening.",
        "created_utc": 1678941522,
        "upvote_ratio": 1.0
    },
    {
        "title": "Which version of the movie The count of Montecristo is better and it was better than the book?",
        "author": "Otherwise_Brilliant8",
        "url": "https://www.reddit.com/r/movies/comments/11sk8p4/which_version_of_the_movie_the_count_of/",
        "text": " Hello i am a fan of the book and for a homework i have to make a database so i decided do it about this topic so i need to collect data I have until april 18th and i have to collect data about whose version the people liked the most and if they think is better than the book and then make a database with at least 30 data entries",
        "created_utc": 1678941385,
        "upvote_ratio": 1.0
    },
    {
        "title": "Best drive-in, movie experience?",
        "author": "DirectionBasic3386",
        "url": "https://www.reddit.com/r/movies/comments/11sk7d4/best_drivein_movie_experience/",
        "text": "Mine was Jurassic Park. The screen was literally in front of a bunch of trees, and when the T-Rex came out from behind the fence, it was one of the most engaging movie experiences I’ve ever had. I was sitting on the hood of my car. The wind was blowing. It was magical. Nothing will ever top it. We have one drive-in theater in my town and it might be going out of business soon. I will always love watching a movie at the drive-in on a warm\nSummer evening",
        "created_utc": 1678941267,
        "upvote_ratio": 1.0
    },
    {
        "title": "Was anyone else irritated by this?",
        "author": "iLoveRobertEggers",
        "url": "https://www.reddit.com/r/movies/comments/11sk5ti/was_anyone_else_irritated_by_this/",
        "text": "The preamble to the animated category at the oscars was so tryhard and \"self aware\". The category itself makes no sense to me in the first place. I love animation but in 2017 they pitted *Loving Vincent,* a biographical experimental drama about van gough's depression, against *The Boss Baby.* How on earth is that a valid comparison? The whole industry just seems to look down their nose at animated films as a genre for some reason.",
        "created_utc": 1678941123,
        "upvote_ratio": 1.0
    },
    {
        "title": "Exclusive: Barry Keoghan Cast In Gladiator 2 As Main Villain",
        "author": "hailgreens",
        "url": "https://www.giantfreakinrobot.com/ent/barry-keoghan-gladiator-2-geta.html",
        "text": "",
        "created_utc": 1678940157,
        "upvote_ratio": 1.0
    },
    {
        "title": "Murda B Fight Video - Rapper Murda B Fight Video - Rapper Murda B Fight Video Viral",
        "author": "Mehrwan_malik",
        "url": "https://www.everylatestnews.com/2023/03/murda-b-fight-video-rapper-murda-b.html?m=1",
        "text": "",
        "created_utc": 1678938838,
        "upvote_ratio": 1.0
    },
    {
        "title": "What are some moderately tame movies (We're talking not action or even violent) with abrupt violent/dark parts?",
        "author": "SkeletorTwoFourK",
        "url": "https://www.reddit.com/r/movies/comments/11sjbsz/what_are_some_moderately_tame_movies_were_talking/",
        "text": "This is incredibly specific, but I mean stuff like Faith like Potatoes in 2005 where, spoilers, guy's kid falls off tractor, is run over by tractor, is all bloodied up from the accident and dies. This movie is PG.\n\nI'm not counting action movies at all but yes the rating can be absolutely anything, it just has to specifically be a sudden part that's unexpectedly dark or violent.\n\nI can't come up with any other examples than Faith Like Potatoes :/",
        "created_utc": 1678938603,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is it becoming more common for movies to use the same title as an older semi well known movie?",
        "author": "SubrbanPostmdrnism",
        "url": "https://www.reddit.com/r/movies/comments/11sjb6c/is_it_becoming_more_common_for_movies_to_use_the/",
        "text": "[removed]",
        "created_utc": 1678938549,
        "upvote_ratio": 1.0
    }
]