[
    {
        "title": "‘John Wick: Chapter 4’ Reactions Highlight the ‘Epic’ Runtime and ‘Stacked’ Supporting Cast, From Donnie Yen to Rina Sawayama",
        "author": "Sisiwakanamaru",
        "url": "https://variety.com/2023/film/news/john-wick-chapter-4-first-reactions-keanu-reeves-1235544987/",
        "text": "",
        "created_utc": 1678167222,
        "upvote_ratio": 1.0
    },
    {
        "title": "this face swap solution is amazing. you should have a try.",
        "author": "akool_technology",
        "url": "https://www.reddit.com/r/movies/comments/11kqemw/this_face_swap_solution_is_amazing_you_should/",
        "text": "[removed]",
        "created_utc": 1678167076,
        "upvote_ratio": 1.0
    },
    {
        "title": "Polling Indicates Star Trek Is On The Verge Of Passing Star Wars In Popularity",
        "author": "[deleted]",
        "url": "",
        "text": "[removed]",
        "created_utc": 1678167039,
        "upvote_ratio": 1.0
    },
    {
        "title": "Michael Jackson Biopic to Spend a Record $120 million in California under State Tax Credit Program",
        "author": "Omega3421",
        "url": "https://www.latimes.com/entertainment-arts/business/story/2023-03-06/michael-jackson-lionsgate-biopic-tops-spending-in-california-tax-credit-program-with-120-million-expenses",
        "text": "",
        "created_utc": 1678166715,
        "upvote_ratio": 0.99
    },
    {
        "title": "Excited for this! Hits theaters April 7th.",
        "author": "kmm_art_",
        "url": "https://i.redd.it/rjqcktb1nama1.jpg",
        "text": "",
        "created_utc": 1678166648,
        "upvote_ratio": 1.0
    },
    {
        "title": "I need help finding what this movie is. It’ll only allow me to add one photo with my post so this is all of the information I can provide.",
        "author": "rusty2119",
        "url": "https://i.redd.it/p2gqlymymama1.jpg",
        "text": "",
        "created_utc": 1678166620,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why the Big Lebowski is my Favorite Movie Ever Made/Of All Time.",
        "author": "darrylthedudeWayne",
        "url": "https://www.reddit.com/r/movies/comments/11kpzs5/why_the_big_lebowski_is_my_favorite_movie_ever/",
        "text": "So with it being March 6th, AKA, the day the Big Lebowski hit theaters, I wanted to talk about...well, the Big Lebowski, and why it is one of, if not my favorite movie of all time, and yes, I mean it. This My Favorite Movie of All Time, I Love, Everything about this movie/film, beyond the memes. Everything about this movie just works, in my opinion anyways. From the acting, to the writing and directing, to the music, to the comedy, to the Noir elements, to the pacing, to the tone, to the timeless feel, everything about this movie just works so well, in my opinion, however, I don't want to last too long talking about this masterpiece, because I am writing this at like 10 or 11 pm at night, not too mention, I feel like everyone has pretty much already spelled out why this movie so great. So I will just to the cliff notes version, as well as explain what the film means to me.\n\n&amp;#x200B;\n\nFor starters, let's with the pacing, it's wonderful, the pacing is so daman good, it's definitely a fast pace, but it knows when to slow down and let the scenes playout and let the comedy sink in, and also knows when to pick up the pace, the film is almost 2 hours, and yet, it never feels like it is, at all. Also, the music is so well done, there's no true instrumentals or a proper score or anything like that, instead they use pretty much entirely licensed music, but it works, the reason being, because each songs fits with the scene so freaking well, and each one actually serves a purpose to the scene and the setting of the whole movie itself. The characters, are also very well done, not only are they acted superbly by there respective actors, but also, they are all memorable as all hell, from the lovable Stone Protagonist, the Dude, to his crazy, Former Vietnam Soldier friend, Walter Sobchak, to the third wheel, Donnie, who even in death, was out of his element, to the over the top pedo, Jesus Quintana, to Dude's Lady Friend, Maude, even minor characters like Larry Sellers, and Bunny, and the Nihilist, and the Stranger, and the Butler played by the Late and Great, Philip Seymour Hoffman, all of them memorable in there own unique ways. So many great quotable lines of dialogue and memorable and funny moments, my personal favorites being the \"Handoff\" scene, the scene where they confront Larry Sellers, with the most hilarious pay-off I have ever seen, to the point I nearly broke a rib and gut laughing so hard, and the GutterBalls scene, even though I still wonder how Dude got ruffed and yet, ends up on the street somewhere, oh well, anything is possible in a movie like this. The film just also has this timeless look and feel too it as well.\n\n&amp;#x200B;\n\nThe film even knows how to handle it's dramatic moments, as the confrontation between the Trio and the Nihilist is played up for laughs, but Donnie ends up getting a heart attack at the end of the scuffle and it actually takes it seriously, allowing the drama and sadness of the scene and the stuff preceding it to sink in, even Walter's speech and Donnie flying into the Dude's face is still taken seriously, and it works. But what I think I love most in this movie, is the Story, and the character of the Dude. I'll start with the story, the story is a sort of 90's film Noir, it has all the typical tropes archetypes of that genre of film, right done to the film involving a kidnapping (or just a crime in general) that's not truly what it seems, and I think it does it extremely excellently, not only is it simply a great mystery, that actually had me encaged on what was going to happen and how it be solved, but also it subverts a lot of the tropes as well, mainly with the setting, and, The Dude, which leads me to my next favorite thing about this film, the character of the Dude, the Dude is a subversion of the typical Noir protagonist, instead of being a hard boiled detective, the dude is a lazy slacker stoner who just likes to smoke weed and go bowling, and just all around chilling, he only get himself wrapped up into this whole kidnapping plot, after his rug gets pissed on, but also confronts the Big Lebowski over it, in which the Big Lebowski contacts him sometime later about his \"Kidnapped\" wife. The Dude is basically a guide for the audience into this wacky and over the top version of Los Angeles, not too mention, he is simply a likeable protagonist, he actually cares about wanting to save the girl, and even when it's revealed that everything was a just a shame, he accepts it and moves on, because at the end of the day, life goes on, and I think that's actually a good message to teach. Not too mention, allows the film to have a nice bittersweet, yet weirdly feel good....well, feeling at the end, it also helps that he is sort of an everyman for Millennials and Gen Z's everywhere.\n\n&amp;#x200B;\n\nI would talk longer, but the point is, The Big Lebowski is my favorite movie of all time, it's story and callbacks to Film Noirs are on point and so well handled, the fact that you can find deeper hidden meanings the themes with the film beyond the surface (something I forgot to mention but mentioning now) also definitely helps, the characters, especially the Dude, are all memorable, the music is catchy and fits the scenes they are in extremely well, the laid back style and feel and the crazy, bonkers, and insane, yet still sophisticated tone, all fit the film ten fold, the comedy is on point, natural, and funny, the writing is clever, the directing feels distinct, as all the other Coen Brothers films, everything about this film is just awesome, and I absolutely love it, and while we may never get another film like this again, (which is also why Jesus Rolls shouldn't exist and I hope they never make Big Lebowski 2, unless they get the guy behind Top Gun Maverick to make it), maybe that's a good thing, as this film will stand on it's own forever and always. However, knowing this film has feel good vibes, I do think more films, especially in this cynical and doom and gloom day and age, and with how much doom and gloom cinema there is, I think we need more films with a laid back, positive, and feel good feeling and style like this one.",
        "created_utc": 1678165890,
        "upvote_ratio": 1.0
    },
    {
        "title": "16 guy need some recommendations",
        "author": "Hot-Shift1779",
        "url": "https://www.reddit.com/r/movies/comments/11kppuu/16_guy_need_some_recommendations/",
        "text": "I want any movie recommendations you got\nThey can be film bro type movies, or any type. Ive gotten into films a little bit, but I want to watch some that aren’t just “great movies” but ones that are actually really enjoyable. Any help I can get on this would be appreciated. I’ve tried watching foreign movies like parasite (great movie) but they just don’t do it for me. I liked the grand Budapest hotel because the pep, cinematography, and unusualness of it. \n\nSome of my favorites are memento, shutter island, inception, The grand Budapest hotel, whiplash, prisoners, fight club, night crawler, the green book, Donnie darko, good will hunting, \n\nI need some movies that are great and keep me entertained. Let me know what you got.",
        "created_utc": 1678165136,
        "upvote_ratio": 1.0
    },
    {
        "title": "Are there any villains whose names end in -ous, -us?",
        "author": "malamondchew",
        "url": "https://www.reddit.com/r/movies/comments/11kpo4s/are_there_any_villains_whose_names_end_in_ous_us/",
        "text": "[removed]",
        "created_utc": 1678165000,
        "upvote_ratio": 1.0
    },
    {
        "title": "‘The Woman King’ Approved for Release in Mainland China Cinemas",
        "author": "Sisiwakanamaru",
        "url": "https://variety.com/2023/film/news/the-woman-king-china-cinema-release-1235545196/",
        "text": "",
        "created_utc": 1678164777,
        "upvote_ratio": 1.0
    },
    {
        "title": "Are there villains whose names end in -ous, -us?",
        "author": "malamondchew",
        "url": "https://www.reddit.com/r/movies/comments/11kpjyc/are_there_villains_whose_names_end_in_ous_us/",
        "text": "[removed]",
        "created_utc": 1678164669,
        "upvote_ratio": 1.0
    },
    {
        "title": "Unwatchable Movies due to no sequel",
        "author": "MrMaybePayme",
        "url": "https://www.reddit.com/r/movies/comments/11kpjgn/unwatchable_movies_due_to_no_sequel/",
        "text": "[removed]",
        "created_utc": 1678164631,
        "upvote_ratio": 1.0
    },
    {
        "title": "What are examples of movies where if the acting had been better, the movie would be much more popular?",
        "author": "Hfcsmakesmefart",
        "url": "https://www.reddit.com/r/movies/comments/11kpgql/what_are_examples_of_movies_where_if_the_acting/",
        "text": "The one that comes foremost to my mind is “In Time”.  Incredible script!  Great cultural metaphor.  Timberlake was alright but his romantic lead and the chemistry between them was terrible.\n\nAnother that I liked but maybe falls in this category is “Butterfly Effect”. Just hard to take Ashton Kutcher seriously.",
        "created_utc": 1678164418,
        "upvote_ratio": 1.0
    },
    {
        "title": "Free Book Order Now",
        "author": "SV_singh2012",
        "url": "https://docs.google.com/forms/d/e/1FAIpQLSdbqOGpEVY1VLiSwpRrqe5vIkkBNMKKpZsUx-tM0TZn1GQl2Q/viewform?usp=pp_url",
        "text": "",
        "created_utc": 1678164358,
        "upvote_ratio": 1.0
    },
    {
        "title": "Tron: Legacy vs Speed Racer",
        "author": "Fwoggey",
        "url": "https://www.reddit.com/r/movies/comments/11kpfg6/tron_legacy_vs_speed_racer/",
        "text": "WARNING: Speed Racer appreciation post!\nHas anyone else seen BOTH of these movies or just me? I was showing my wife a couple movies from my childhood, them being Tron: Legacy and Speed Racer in that order, and I really don't remember Tron Legacy being that bad. I remembered Tron Legacy for its awesome visuals and kick-ass soundtrack and a decent plot. Yeah everything was as I remembered but the strength of the plot. I mean so bad haha. And I get that it was never supposed to be a deep movie but there's just so many questions and plot holes and \"why the hell are they acting this way?\" Situations. I pulled up the IMDb score and it's 6.7 which I think is fair because it still is really enjoyable. After I recommended Speed Racer for a watch being I remembered it being awesome for all the same reasons Tron Legacy was. And it was awesome! As good as I remembered and just because we just watched Tron Legacy I just couldn't help but compare the two throughout. Especially since the IMDB score for Speed Racer is 6.0. An even larger gap on Rotten Tomatoes! The Wachowskis actually got robbed on Speed Racer and I'll use Tron: Legacy as a comparison. \n\n**Setup**\nThe setup to Tron Legacy greets us with the protagonist (Sam) who is trying to be a Robin Hood type character. First off he's being followed by a police car because he's recklessly driving his motorbike. Then he breaks into his Father's old company and leaks computer software to the public for free. He then jumps off of the building with a parachute while being chased by police and a FREAKING HELICOPTER. Once they catch him they look like they hold him for a few hours and release him? What the hell did they have him in for? Apparently enough to warrant a helicopter and multiple squad cars but not enough to actually... Hold him? Anyways he heads back to his house which is actually just a gutted Mr Lube with couches and a bed where soon after he's greeted by an old friend of his father's in which he informs Sam that he got a page from his dad's old office at the arcade so Sam should go check it out. Which Sam does and discovers the world of Tron. Minus the insane and actually irrelevant opening that's the setup the only legwork for character motivations are the flashback scene with his father and his father's friend showing up with the pager.\n\nNow the Setup for Speed Racer has us following Speed (haha yes that's really his name) while he is preparing for a Race. Intermingling throughout are flashbacks to his brother's rise to fame and eventual death. It shows his close relationship with his brother, and how they would drive together on the track he is about to race on. How his brother left abruptly when Speed was still young causing a rift between the brother and his father. How his brother's actions after leaving were casting a negative lens on Speed's family. By the time Speed is on the track there are constant doubts by the media about whether Speed will live up to his Brother's rise to fame or follow him in infamy. Speed is outracing all of the competition which leaves Speed racing a holographic projection of his Brother's lap record. Speed is weaving back and forth with his Brother's \"ghost\" while cutting to scenes of him and his brother in his past showing his brother leaving in the night and his father telling his brother he never wants to see him again followed by his downfall and eventual death. Speed inches ahead of his brother clearly about to beat his Brother's lap record then, right before the finish line, eases up on the gas and lets his brother's lap record remain. No one explains why he's doing it in the moment, he just does it out of respect of brothers memory. A beautiful moment of show-dont-tell that could've been it's own short story it's. In 20 minutes Speed Racer already tells a more rich and nuanced story than Tron Legacy. And the best part is that was only just the freaking setup. The rest of the film is a rollercoaster of interesting characters and motivations with a climax that still gives me chills. \n\n**Conclusions**\nThere's just so much to talk about and this post would be waaaay too long so really... talking about each movies setup is enough because Tron doesn't get much better story wise and Speed Racer never really let's up with it's interesting story beats. There's obviously some very different tones and settings to both movies but look... if you took Tron as a benchmark for a 6.7 Movie, which I would agree with, then any movie that is beautiful in its own style, sounds great, and has similar plot strength and acting chops then why not rank it around the same? Well I think that Speed Racer is not only just as beautiful in its own setting and style, sounds just as great, but is way stronger in its plot and much better acted. There's some serious Wachowski hate because if you compare the strength of their stories then there's no way Speed Racer would get anything less than a 7.0 if Tron Legacy could get away with a 6.7.",
        "created_utc": 1678164319,
        "upvote_ratio": 1.0
    },
    {
        "title": "I’m looking for a slasher/thriller/horror film, early 80's",
        "author": "Bane666au",
        "url": "https://www.reddit.com/r/movies/comments/11kp4kv/im_looking_for_a_slasherthrillerhorror_film_early/",
        "text": "[removed]",
        "created_utc": 1678163462,
        "upvote_ratio": 1.0
    },
    {
        "title": "Honest thoughts on Amazon's Rings of Power ?",
        "author": "alpha47865",
        "url": "https://www.reddit.com/r/movies/comments/11kp1f6/honest_thoughts_on_amazons_rings_of_power/",
        "text": "[removed]",
        "created_utc": 1678163222,
        "upvote_ratio": 1.0
    },
    {
        "title": "Hola! si eres un fan de la película Pasific Ream este grupo es para ti!",
        "author": "The_curious_jester",
        "url": "https://www.reddit.com/r/movies/comments/11koviu/hola_si_eres_un_fan_de_la_película_pasific_ream/",
        "text": "[removed]",
        "created_utc": 1678162771,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does anyone else feel sad after watching romance movies from the 80s?",
        "author": "wallowthere",
        "url": "https://www.reddit.com/r/movies/comments/11korl2/does_anyone_else_feel_sad_after_watching_romance/",
        "text": "[removed]",
        "created_utc": 1678162466,
        "upvote_ratio": 1.0
    },
    {
        "title": "Avant-Garde or Pretentious Films?",
        "author": "WynnieFall",
        "url": "https://www.reddit.com/r/movies/comments/11koj8n/avantgarde_or_pretentious_films/",
        "text": "[removed]",
        "created_utc": 1678161828,
        "upvote_ratio": 1.0
    },
    {
        "title": "Movie/film recommendations",
        "author": "Hot-Shift1779",
        "url": "https://www.reddit.com/r/movies/comments/11koj6e/moviefilm_recommendations/",
        "text": "[removed]",
        "created_utc": 1678161823,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why wasn’t Wil Wheaton nominated for an Academy Award for his performance as Gordie Lachance in “Stand By Me” ?",
        "author": "waitingforthesun92",
        "url": "https://www.reddit.com/r/movies/comments/11koeph/why_wasnt_wil_wheaton_nominated_for_an_academy/",
        "text": "I just finished watching the film, and there’s one thing that stood out to me more than anything else. Wil Wheaton’s performance as Gordie Lachance. Why wasn’t he at least nominated for Best Supporting Actor?\n\nNot even that, I also found out that he wasn’t nominated for any awards at all for his performance. What a damn shame…",
        "created_utc": 1678161506,
        "upvote_ratio": 1.0
    },
    {
        "title": "Brendan Fraser talking about Oscar nomination and playing game where he guesses which co-star said the line.",
        "author": "ByClaytonDavis",
        "url": "https://youtu.be/3HoU6dugAu0",
        "text": "",
        "created_utc": 1678161449,
        "upvote_ratio": 1.0
    },
    {
        "title": "The Woman King",
        "author": "Far-Ad-8618",
        "url": "https://www.reddit.com/r/movies/comments/11kodyz/the_woman_king/",
        "text": "[removed]",
        "created_utc": 1678161447,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why wasn’t Wil Wheaton nominated for an Academy Award for his performance as Gordie Lachance in “Stand By Me” ?",
        "author": "waitingforthesun92",
        "url": "https://www.reddit.com/r/movies/comments/11kocum/why_wasnt_wil_wheaton_nominated_for_an_academy/",
        "text": "[removed]",
        "created_utc": 1678161356,
        "upvote_ratio": 1.0
    },
    {
        "title": "Trying to find a childhood movie i used to watch with my sister!!!",
        "author": "Arianughh",
        "url": "https://www.reddit.com/r/movies/comments/11ko5tp/trying_to_find_a_childhood_movie_i_used_to_watch/",
        "text": "[removed]",
        "created_utc": 1678160810,
        "upvote_ratio": 1.0
    },
    {
        "title": "Whatever happened to “The Boat That Rocked”?",
        "author": "Vexra",
        "url": "https://www.reddit.com/r/movies/comments/11ko210/whatever_happened_to_the_boat_that_rocked/",
        "text": "Me and the folks wanted to rewatch one of our favorite movies “The boat that Rocked” their era of music and I loved the humor. \n\nI couldn’t find our DVD copy so grabbed it off YouTube. Was mildly confused when I saw it was retitled “Pirate Radio” but I assumed it was a Harry Potter and the philosophers/sorcerers stone situation. \n\nWe settled in to watch it and were quite enjoying it until we started noticing bits missing. There may of been earlier parts but the first one big enough to make us sit up and take notice was when they cut out Simons Bucks night. \n\nAs the movie proceeded we noticed more and more baffling cuts little bits of scenes here and there some plot relevant some not.\nNothing that I could see being cut for obscenity or vulgarity(especially compared to some of the stuff still in the movie)\n\nThe music was still enjoyable so my folks still loved it but each snip and trim ate at me. \n\nI looked on iTunes and it’s the same there I can’t even find the soundtrack and I bought that shit on there years ago. \n\nWhat happened to the boat that rocked?",
        "created_utc": 1678160510,
        "upvote_ratio": 1.0
    },
    {
        "title": "Who are some of the best voices in the history of cinema? Here are my picks, a notable British leaning I must confess!",
        "author": "adamjames777",
        "url": "https://i.redd.it/e0lqzaso3ama1.jpg",
        "text": "",
        "created_utc": 1678160140,
        "upvote_ratio": 1.0
    },
    {
        "title": "Sisterhood of the traveling pants question",
        "author": "yourplantdad",
        "url": "https://www.reddit.com/r/movies/comments/11kntun/sisterhood_of_the_traveling_pants_question/",
        "text": "This has been bothering me anytime I watch the first movie. How old is Kostas Dounas supposed to be? It seems like in both the books and the movies the guys seem to be a lot older while the girls were 15, then 16 at the end of the movie. I couldn't find the exact age for the boys in the movie. My roommate and I were having a discussion about it because it seemed kind of weird when watching it as an adult vs when we were younger. Does anyone have any thoughts by chance?",
        "created_utc": 1678159882,
        "upvote_ratio": 1.0
    },
    {
        "title": "Sisterhood Of the traveling pants question",
        "author": "yourplantdad",
        "url": "https://www.reddit.com/r/movies/comments/11knp2d/sisterhood_of_the_traveling_pants_question/",
        "text": "[removed]",
        "created_utc": 1678159528,
        "upvote_ratio": 1.0
    },
    {
        "title": "Movies' New Adaptation Formula",
        "author": "Lopsided-Spare7446",
        "url": "https://www.reddit.com/r/movies/comments/11knjdr/movies_new_adaptation_formula/",
        "text": "[removed]",
        "created_utc": 1678159102,
        "upvote_ratio": 1.0
    },
    {
        "title": "I think the new movie ‘65’ did themselves a huge disservice by disclosing the fact that dinosaurs are the main antagonists.",
        "author": "mattyhegs826",
        "url": "https://www.reddit.com/r/movies/comments/11knhqc/i_think_the_new_movie_65_did_themselves_a_huge/",
        "text": "I feel it would have been an amazing twist to the viewer if it was revealed halfway through that Adam Driver’s ship went back in time. If they stripped the trailers and description of anything dinosaur related, people would have just assumed he was being attacked by some type of aliens. I definitely think it would have been a cool surprise. Do you agree?",
        "created_utc": 1678158981,
        "upvote_ratio": 1.0
    },
    {
        "title": "Movies' new adaptation formula",
        "author": "Lopsided-Spare7446",
        "url": "https://www.reddit.com/r/movies/comments/11knhdp/movies_new_adaptation_formula/",
        "text": "[removed]",
        "created_utc": 1678158953,
        "upvote_ratio": 1.0
    },
    {
        "title": "Box Office: Michael B. Jordan’s ‘Creed III’ Wins Title With Historic $58.6M Opening",
        "author": "JDLovesElliot",
        "url": "https://www.hollywoodreporter.com/movies/movie-news/creed-iii-box-office-opening-1235340591/",
        "text": "",
        "created_utc": 1678158602,
        "upvote_ratio": 1.0
    },
    {
        "title": "Studios' new adaptation formula.",
        "author": "Lopsided-Spare7446",
        "url": "https://www.reddit.com/r/movies/comments/11knabm/studios_new_adaptation_formula/",
        "text": "[removed]",
        "created_utc": 1678158419,
        "upvote_ratio": 1.0
    },
    {
        "title": "I’m bedridden for a few weeks, any recommendations?",
        "author": "skyg1398",
        "url": "https://www.reddit.com/r/movies/comments/11kn9ls/im_bedridden_for_a_few_weeks_any_recommendations/",
        "text": "[removed]",
        "created_utc": 1678158367,
        "upvote_ratio": 1.0
    },
    {
        "title": "Who are some of the great character actresses?",
        "author": "trumancatpote",
        "url": "https://www.reddit.com/r/movies/comments/11kn8rb/who_are_some_of_the_great_character_actresses/",
        "text": "[removed]",
        "created_utc": 1678158301,
        "upvote_ratio": 1.0
    },
    {
        "title": "I'm Thinking of Ending Things -- I didn't really get it",
        "author": "ApocalypseSpokesman",
        "url": "https://www.reddit.com/r/movies/comments/11kn7d1/im_thinking_of_ending_things_i_didnt_really_get_it/",
        "text": "While watching this movie, I was quick to catch on that it was about something.\n\nI noticed themes of aging, men/women stuff, despair, and reality being unstable.\n\nHowever, I wasn't able to assign an overarching meaning to the usage of those themes, and I had to look up what it meant afterward.\n\nThe result is that I was trying to figure it out rather than feeling whatever impact it was intended to have.\n\n&amp;#x200B;\n\nIt was okay. B-",
        "created_utc": 1678158192,
        "upvote_ratio": 1.0
    },
    {
        "title": "Been waiting 3 months for dungeons and dragons movie to come out!",
        "author": "Zachfutv",
        "url": "https://www.reddit.com/r/movies/comments/11kn4b7/been_waiting_3_months_for_dungeons_and_dragons/",
        "text": "[removed]",
        "created_utc": 1678157982,
        "upvote_ratio": 1.0
    },
    {
        "title": "‘Scream 7’ Greenlit And Will Film This Year",
        "author": "Paking15",
        "url": "https://www.screengeek.net/2023/03/06/scream-7-greenlit-filming-this-year/",
        "text": "",
        "created_utc": 1678157266,
        "upvote_ratio": 1.0
    },
    {
        "title": "The most Damaged B-17 you'll ever see Flying",
        "author": "ProtectionOk4801",
        "url": "https://www.youtube.com/watch?v=iYSNbwXGvjA&amp;ab_channel=FlakAlley",
        "text": "",
        "created_utc": 1678157149,
        "upvote_ratio": 1.0
    },
    {
        "title": "The most Damaged B-17 you'll ever see Flying",
        "author": "ProtectionOk4801",
        "url": "https://www.youtube.com/watch?v=MZWNE5V9yPM&amp;t=13s&amp;ab_channel=FlakAlley",
        "text": "",
        "created_utc": 1678157108,
        "upvote_ratio": 1.0
    },
    {
        "title": "What are some movies where every single character is a horrible person?",
        "author": "xe36x",
        "url": "https://www.reddit.com/r/movies/comments/11kmphc/what_are_some_movies_where_every_single_character/",
        "text": "Basically movies where every single major character is an irredeemable garbage person.\n\nThe kind of story where you root for everyone to lose, somehow.\n\nIt might actually be kinda cathartic to watch all the horrible people end up with karmically satisfying bad endings.\n\nOr maybe just something that raises the blood pressure, watching horrible people do horrible things and get away with it, reminding you that injustice lives.\n\nEither works, honestly. \n\nWhat are some top examples?",
        "created_utc": 1678156905,
        "upvote_ratio": 1.0
    },
    {
        "title": "What are some movies where every single character is a horrible person?",
        "author": "xe36x",
        "url": "https://www.reddit.com/r/movies/comments/11kmo1m/what_are_some_movies_where_every_single_character/",
        "text": "[removed]",
        "created_utc": 1678156809,
        "upvote_ratio": 1.0
    },
    {
        "title": "Nicolas Cage breaks silence on why Warner Bros. killed Tim Burton's 'Superman'",
        "author": "Aman_Chaman",
        "url": "https://meaww.com/got-cold-feet-nicolas-cage-finally-breaks-silence-on-why-warner-bros-killed-tim-burtons-superman",
        "text": "",
        "created_utc": 1678156508,
        "upvote_ratio": 1.0
    },
    {
        "title": "DO NOT WATCH CHILDREN OF THE CORN 2023.",
        "author": "xbigbadslime",
        "url": "https://www.reddit.com/r/movies/comments/11kmikz/do_not_watch_children_of_the_corn_2023/",
        "text": "[removed]",
        "created_utc": 1678156421,
        "upvote_ratio": 1.0
    },
    {
        "title": "Giancarlo Giannini Live Walk of Fame Ceremony",
        "author": "Plenty_Marzipan_4477",
        "url": "https://youtu.be/z2QKKM795-A",
        "text": "",
        "created_utc": 1678156028,
        "upvote_ratio": 1.0
    },
    {
        "title": "Movie suggestions for fast directing styles that pack in a lot of information?",
        "author": "Guntmunch",
        "url": "https://www.reddit.com/r/movies/comments/11klr2x/movie_suggestions_for_fast_directing_styles_that/",
        "text": "Right now I can only think of Fincher or Wes Anderson movies, but what are other styles that convey a lot of information and move the plot very fast in a short amounts of time? Whether it's a director that's very good at montages or sequences like that, or a certain movie, or just a particularly good example like \"this scene from xyz\"",
        "created_utc": 1678154538,
        "upvote_ratio": 1.0
    },
    {
        "title": "im looking for a movie",
        "author": "Piepieweenie",
        "url": "https://www.reddit.com/r/movies/comments/11klowl/im_looking_for_a_movie/",
        "text": "[removed]",
        "created_utc": 1678154396,
        "upvote_ratio": 1.0
    },
    {
        "title": "keanu’s reaction when i told him that he has the top AMA of all time.",
        "author": "lionsgate",
        "url": "https://imgur.com/a/4DQeqDQ",
        "text": "",
        "created_utc": 1678154351,
        "upvote_ratio": 1.0
    },
    {
        "title": "Marvel rant",
        "author": "mmollica",
        "url": "https://www.reddit.com/r/movies/comments/11klg3n/marvel_rant/",
        "text": "The direction they have gone with the films is super boring. I feel like I just don’t care about any of the movies anymore. Here’s what I wish they did instead.\nInstead of making endgame, they end phase3(?) after infinity war. Thanos won, half the population of the universe is gone. Now we get to go back to small scale stories about how the world is adapting to missing half is population. Out of the ashes of Ironman new, interesting characters can arise. Instead we get the same old boring movies we’ve had for the last decade. Nothing is interesting, everything is world ending, and I just don’t care about any of the characters. Knowing they actually killed off half their ip completely removes the plot armor these characters have and bring suspense to every new fight scene. With smaller scale stories you know that the heroes could fail cause again, no plot armor and the whole world isn’t going to disappear. \nJust my 2 cents, probly not a popular opinion but I would just love something new.",
        "created_utc": 1678153776,
        "upvote_ratio": 1.0
    },
    {
        "title": "CNN’s The Movies",
        "author": "DastardlyDustin526",
        "url": "https://www.reddit.com/r/movies/comments/11kl6en/cnns_the_movies/",
        "text": "[removed]",
        "created_utc": 1678153104,
        "upvote_ratio": 1.0
    },
    {
        "title": "Living cast members of major old movies?",
        "author": "relesabe",
        "url": "https://www.reddit.com/r/movies/comments/11kl1cu/living_cast_members_of_major_old_movies/",
        "text": "I am fascinated by this and there are occasional surprises. If we do not limit it to major films, since there are actors who are today over 100 and appeared as children, there are probably quite a few films as far back as the 1920s (but no further, I think) with a living cast member or two. Kind of amazing -- imagine living in 1923 and there was still someone around who had appeared in a play seen by, say, John Adams or Thomas Jefferson, a baby extra in some antique production. But because of fewer people living to over 100 and far worse record keeping, if there was such a person, I wonder if we know about it.\n\nIf we limit it to major films and credited cast members, two movies come to mind: Grapes of Wrath, one of the cast, Darryl Hickman (older brother of Dwayne from Dobie Gillis), is still alive. Kind of amazing for a film more than 80 years old. The other is Treasure of the Sierra Madre which has Robert Blake -- although uncredited, he is a well-known actor with a pivotal role.\n\nTreasure of the Sierra Madre (1948) actually had quite a few young people who could still be alive and maybe they are locally famous for having appeared in that film. I can, however, find nothing about this. Blake, almost 90, appeared in a film whose stars would be well over 100 -- Huston would be over 140. Bogart well over 120.\n\nSo I am just interested in a general discussion of this topic and if anyone has information about some film from that era with living cast.",
        "created_utc": 1678152766,
        "upvote_ratio": 1.0
    },
    {
        "title": "Are there any post-post-apocalyptic movies?",
        "author": "ottolouis",
        "url": "https://www.reddit.com/r/movies/comments/11kkvc8/are_there_any_postpostapocalyptic_movies/",
        "text": "I'm really enjoying The Last of Us, and although I love apocalyptic stories, I was wondering if there's ever been a movie that explored what it would be like if humanity tried to rebuild after an apocalyptic period. So the threat to humanity is behind the characters, but now they have to go through the challenges of recreating a cohesive and modern society. Does anything like this exist?",
        "created_utc": 1678152354,
        "upvote_ratio": 1.0
    },
    {
        "title": "Tim Robbins backs Woody Harrelson’s call to end Covid protocols on set",
        "author": "rejs7",
        "url": "https://www.theguardian.com/film/2023/mar/06/tim-robbins-woody-harrelsons-covid-protocols-on-set",
        "text": "",
        "created_utc": 1678152205,
        "upvote_ratio": 1.0
    },
    {
        "title": "🩸😎🩸",
        "author": "SirCollectALot",
        "url": "https://i.redd.it/8mfl3o7tf9ma1.jpg",
        "text": "",
        "created_utc": 1678152109,
        "upvote_ratio": 1.0
    },
    {
        "title": "Scarlett Johansson, Penélope Cruz, Michael Fassbender and Owen Wilson Circling New Nancy Meyers Movie Budgeted at $130M-Plus at Netflix",
        "author": "Sisiwakanamaru",
        "url": "https://www.hollywoodreporter.com/movies/movie-news/scarlett-johansson-penelope-cruz-nancy-meyers-netflix-movie-1235341897/",
        "text": "",
        "created_utc": 1678151947,
        "upvote_ratio": 1.0
    },
    {
        "title": "can someone find me a higher quality version of this frame (Fear and Loathing in Las Vegas)",
        "author": "Affectionate_Ad_9876",
        "url": "https://i.redd.it/jvfva47ie9ma1.jpg",
        "text": "",
        "created_utc": 1678151669,
        "upvote_ratio": 1.0
    },
    {
        "title": "One of the few surviving shots from the Soviet film Ivan the Terrible, Part 3.",
        "author": "Wrid1983",
        "url": "https://i.redd.it/52ohziott7ma1.jpg",
        "text": "",
        "created_utc": 1678150650,
        "upvote_ratio": 1.0
    },
    {
        "title": "Fall of Robespierre - Scene from 'La Révolution française' (1989) Starring Jean-François Balmer, Jane Seymour, François Cluzet, Andrzej Seweryn, and Klaus Maria Brandauer",
        "author": "Upperphonny",
        "url": "https://www.youtube.com/feed/history",
        "text": "",
        "created_utc": 1678150636,
        "upvote_ratio": 1.0
    },
    {
        "title": "movies in the genre of the tourist / uncharted gameseries??",
        "author": "rhythmicwanderer",
        "url": "https://www.reddit.com/r/movies/comments/11kk387/movies_in_the_genre_of_the_tourist_uncharted/",
        "text": "[removed]",
        "created_utc": 1678150426,
        "upvote_ratio": 1.0
    },
    {
        "title": "What movies surprise you at how recently that came out or just feel like they should be older?",
        "author": "PersistentVigilance",
        "url": "https://www.reddit.com/r/movies/comments/11kk2ld/what_movies_surprise_you_at_how_recently_that/",
        "text": "[removed]",
        "created_utc": 1678150382,
        "upvote_ratio": 1.0
    },
    {
        "title": "Nothing else in the fantasy genre really compares to LOTR/The Hobbit. GOT, all this other crap coming out is like a cheap knockoff.",
        "author": "Hessian-Ghost",
        "url": "https://www.reddit.com/r/movies/comments/11kjy5m/nothing_else_in_the_fantasy_genre_really_compares/",
        "text": "Nothing else in the fantasy genre really compares to LOTR/The Hobbit. GOT, all this other crap coming out is like a cheap knockoff.\n\nPeople can’t seem to shut up about Game of Thrones. It’s nothing new or original, and really pales in comparison to Tolkien’s universe and Jackson’s depiction.\n\n\n\n\nNothing else in the fantasy genre really compares to LOTR/The Hobbit. GOT, all this other crap coming out is like a cheap knockoff.\n\nPeople can’t seem to shut up about Game of Thrones. It’s nothing new or original, and really pales in comparison to Tolkien’s universe and Jackson’s depiction.",
        "created_utc": 1678150084,
        "upvote_ratio": 1.0
    },
    {
        "title": "What movies have a setting where the main characters are women, women are portrayed realistically, and it's all about those women?",
        "author": "No_Force_6017",
        "url": "https://www.reddit.com/r/movies/comments/11kjxhc/what_movies_have_a_setting_where_the_main/",
        "text": "[removed]",
        "created_utc": 1678150037,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can you think of a sequel that ignored the ending of the first film in the series?",
        "author": "RockingHaims",
        "url": "https://www.reddit.com/r/movies/comments/11kjwra/can_you_think_of_a_sequel_that_ignored_the_ending/",
        "text": "This is apparently what they're doing with the upcoming I Am Legend sequel, and I'm trying to think of other examples of this. \n\n&amp;#x200B;\n\nThe I Am Legend news – [https://www.slashfilm.com/1210413/how-i-am-legend-2-will-ignore-the-first-movies-ending/](https://www.slashfilm.com/1210413/how-i-am-legend-2-will-ignore-the-first-movies-ending/)",
        "created_utc": 1678149991,
        "upvote_ratio": 1.0
    },
    {
        "title": "Who do you think will win an oscar for an actor in a leading role and why?",
        "author": "rammtrait",
        "url": "https://www.reddit.com/r/movies/comments/11kjven/who_do_you_think_will_win_an_oscar_for_an_actor/",
        "text": "[removed]",
        "created_utc": 1678149902,
        "upvote_ratio": 1.0
    },
    {
        "title": "Nothing else in the fantasy genre really compares to LOTR/The Hobbit. GOT, all this other crap coming out is like a cheap knockoff.",
        "author": "Hessian-Ghost",
        "url": "https://www.reddit.com/r/movies/comments/11kjnit/nothing_else_in_the_fantasy_genre_really_compares/",
        "text": "[removed]",
        "created_utc": 1678149369,
        "upvote_ratio": 1.0
    },
    {
        "title": "Era of zkSync Mainnet. 03.06.2023",
        "author": "Critical_Object_8061",
        "url": "https://www.reddit.com/r/movies/comments/11kjet5/era_of_zksync_mainnet_03062023/",
        "text": "[removed]",
        "created_utc": 1678148783,
        "upvote_ratio": 1.0
    },
    {
        "title": "LAST SAMURAI didn't refer to Tom Cruise!? In the video, these guys recreated the fight scene but one of them mentions that Tom Cruise wasn’t the Last Samurai later in the film. Is that true and who were they referring to if not him.",
        "author": "Classic-Apricot1207",
        "url": "https://youtu.be/2EE9XY4tLwk",
        "text": "",
        "created_utc": 1678148603,
        "upvote_ratio": 1.0
    },
    {
        "title": "What movies have you rewatched multiple times in one day?",
        "author": "ThreeTrees1289",
        "url": "https://www.reddit.com/r/movies/comments/11kjbsk/what_movies_have_you_rewatched_multiple_times_in/",
        "text": "Is there any movie so good/captivating that you just had to rewatch it even on the same day. For me this usually happens with romance movies, I remember the first time I watched To all the boys I fucking loved it and I watched it 3 times the following day. And also recently happened to me with 10 things I hate about you, very charming movie. Anyway what are yours??",
        "created_utc": 1678148578,
        "upvote_ratio": 1.0
    },
    {
        "title": "Any movie recommendations?",
        "author": "terohultoskero",
        "url": "https://www.reddit.com/r/movies/comments/11kjaim/any_movie_recommendations/",
        "text": "Hello people, I’ve just seen Brokeback Mountain and I’m not here to make a film rating but I was just wondering if theres another film with similar/same aesthetic? I mean, I’ve never seen a film like this before with so much nature in it, I really like the nature of Wyoming and the horses, would be glad for anything:)",
        "created_utc": 1678148494,
        "upvote_ratio": 1.0
    },
    {
        "title": "Michael Jackson Biopic Gets $21 Million in California Tax Credits",
        "author": "nyamenehene1",
        "url": "https://townflex.com/michael-jackson-biopic-gets-21-million-in-california-tax-credits/",
        "text": "",
        "created_utc": 1678148223,
        "upvote_ratio": 1.0
    },
    {
        "title": "I’ve got a question about movie recommendations",
        "author": "terohultoskero",
        "url": "https://www.reddit.com/r/movies/comments/11kj2do/ive_got_a_question_about_movie_recommendations/",
        "text": "[removed]",
        "created_utc": 1678147969,
        "upvote_ratio": 1.0
    },
    {
        "title": "Im doing half off movie tickets 🎟️ you can order food too depending on the theater! Serious inquiries only",
        "author": "WeAllBall264",
        "url": "https://www.reddit.com/r/movies/comments/11kim1v/im_doing_half_off_movie_tickets_you_can_order/",
        "text": "[removed]",
        "created_utc": 1678146939,
        "upvote_ratio": 1.0
    },
    {
        "title": "Teenage Mutant Ninja Turtles: Mutant Mayhem Trailer out now",
        "author": "Charisma003",
        "url": "https://i.imgur.com/ojy1IfS.jpg",
        "text": "",
        "created_utc": 1678146559,
        "upvote_ratio": 1.0
    },
    {
        "title": "Some thoughts on I Origins?",
        "author": "Charisma003",
        "url": "https://i.imgur.com/Yx3H4Ib.jpg",
        "text": "[removed]",
        "created_utc": 1678146213,
        "upvote_ratio": 1.0
    },
    {
        "title": "What style are these Movie posters?",
        "author": "Just_Breezy_132",
        "url": "https://i.redd.it/gq2ntmrdx8ma1.jpg",
        "text": "",
        "created_utc": 1678145911,
        "upvote_ratio": 1.0
    },
    {
        "title": "Hello, Im looking for a movie about a boss that is strict and careless at first, but then turns out to be nice and friendly. Any tips?",
        "author": "Thaysan_X8R",
        "url": "https://www.reddit.com/r/movies/comments/11ki5lx/hello_im_looking_for_a_movie_about_a_boss_that_is/",
        "text": "[removed]",
        "created_utc": 1678145878,
        "upvote_ratio": 1.0
    },
    {
        "title": "John Wick: Chapter 1 - Code Giveaway!",
        "author": "GRINGQ_BANDITO",
        "url": "https://i.redd.it/esavteoxu8ma1.jpg",
        "text": "",
        "created_utc": 1678145087,
        "upvote_ratio": 1.0
    },
    {
        "title": "John Wick: Chapter 1 - Giveaway",
        "author": "GRINGQ_BANDITO",
        "url": "https://www.reddit.com/r/movies/comments/11khr2a/john_wick_chapter_1_giveaway/",
        "text": "[removed]",
        "created_utc": 1678144967,
        "upvote_ratio": 1.0
    },
    {
        "title": "Cocaine Bear Movie Review",
        "author": "Solid_Custard_4152",
        "url": "https://youtu.be/xVXrZNMSb_Q",
        "text": "",
        "created_utc": 1678144689,
        "upvote_ratio": 1.0
    },
    {
        "title": "JARIPEO EXTREMO",
        "author": "JARIPEO-Estremo10",
        "url": "https://youtu.be/0Qq_kshXk9A",
        "text": "",
        "created_utc": 1678144513,
        "upvote_ratio": 1.0
    },
    {
        "title": "Looking for Psych thrillers like Joker,Shutter island, Get out, Taxi driver( but not boring), Split, Fight club",
        "author": "Frequent_Brick6753",
        "url": "https://www.reddit.com/r/movies/comments/11khhgi/looking_for_psych_thrillers_like_jokershutter/",
        "text": "So basically the title but not boring. The Taxi Driver was boring to me. (The Joker is my fav movie all time)  \n\n\nGenerally the longer the better. I just want to be led down a rabbit hole or completely shocked by the plot twists etc. I like horror and mystery and crime.  \n\n\nAnyone have a list to watch?",
        "created_utc": 1678144373,
        "upvote_ratio": 1.0
    },
    {
        "title": "John Wick - Target Exclusives",
        "author": "GRINGQ_BANDITO",
        "url": "https://i.redd.it/j07bzl9gs8ma1.jpg",
        "text": "",
        "created_utc": 1678144252,
        "upvote_ratio": 1.0
    },
    {
        "title": "What would be the best or craziest movie if you fused 2 existing movie plots together?",
        "author": "NurplePain",
        "url": "https://www.reddit.com/r/movies/comments/11khfhg/what_would_be_the_best_or_craziest_movie_if_you/",
        "text": "Could be elements of any two movies of any genres. Something that could be Best Picture worthy, or just something that would be batshit crazy entertaining. \n\nExample: The Hangover + The Matrix. The Wolf Pack wakes up in a hungover stupor, knowing nothing of what happened the night before. As their adventure unfolds to discover what happened, they soon start piecing together not only the truth of what went down, but also the truth of the universe. The pill they took last night might not be the only one they took. They may have taken the Red one.",
        "created_utc": 1678144248,
        "upvote_ratio": 1.0
    },
    {
        "title": "In 1989 a man in Long Island purchased a unit for less than $100, discovering a white wheel-less sports car that turned out to be one of the eight vehicles produced for the James Bond movie ‘The Spy Who Loved Me’. Years later this car was sold at an auction to Elon Musk for $1 million.",
        "author": "[deleted]",
        "url": "",
        "text": "[removed]",
        "created_utc": 1678144047,
        "upvote_ratio": 1.0
    },
    {
        "title": "Whiplash ending explained",
        "author": "Weekly-Employer-2444",
        "url": "https://www.reddit.com/r/movies/comments/11kh9yj/whiplash_ending_explained/",
        "text": "I’ve heard the argument that Whiplash has a very unsatisfying depressing conclusion, they say that it isn’t a satisfying conclusion due to the fact that you never see if Neiman gets his ex back, you don’t hear the applause of the audience after the final song ends and anything else you can count as a loose end unanswered, but this is my take of the end goal whiplash was trying to achieve, the whole movie Neiman and his father are trying to grow a bond and no matter how much his father tries, Neiman is trying to fill the void of losing his mother, a topic that isn’t discussed on screen but is realized through context clues, something his father cannot gift to Neiman w any amount of popcorn and chocolate raisin movie hang outs with his son, what Neiman is craving is being great and Fletcher is the only person who can fill it since it seems like such an impossible task, to be a great like Buddy Rich. You’re able to see his father slowly realize this before the dinner scene when Neiman explains how much he wants to get in the Jazz band and his father simply replies with “his opinion means a lot to you” in a slightly jealous voice, realizing another man’s approval means more than Neiman’s own father, you can also see Neiman’s dad’s jealousy and acceptance of how much Fletcher’s approval means to Neiman in the final Caravan solo when the camera quickly shows Neiman’s fathers face of fear and amazement through the theater doors for about 10 seconds. The very last 5 seconds of the movie, we see Neiman and Fletcher make eye contact and for the first time in the whole movie, we see both Neiman and Fletcher’s eyes be filled w joy and a sense of hard work payed off. The simple and somewhat disappointing pay off and ending to Fletcher being the protagonist being transitioned into the satisfied mentor archetype, is the whole point of the movie since the first chair throw, hit me back with your take on the ending or if you think the movie was pointless",
        "created_utc": 1678143905,
        "upvote_ratio": 1.0
    },
    {
        "title": "Let's talk about trailers which reveal the entire plot chronologically. I loved all three minutes of the Ghosted (2023) trailer.",
        "author": "rdwd1",
        "url": "https://www.reddit.com/r/movies/comments/11kh9vd/lets_talk_about_trailers_which_reveal_the_entire/",
        "text": " \n\nI really don't know what to say. Ghosted (2023) looked like a decent movie if not for the solid plot reveal in the trailer itself. It's a straight up chronological plot reveal. It even shows the character arcs of main leads.\n\n Do directors really have a say in this? Why would they be ok with such trailers? It's embarrassing. I don't know if it's worth watching this movie when it releases.\n\nWhat do you guys think?",
        "created_utc": 1678143899,
        "upvote_ratio": 1.0
    },
    {
        "title": "Let's talk about trailers which reveal the entire plot chronologically. I loved all three minutes of the Ghosted (2023) trailer.",
        "author": "rdwd1",
        "url": "https://www.reddit.com/r/movies/comments/11kh49q/lets_talk_about_trailers_which_reveal_the_entire/",
        "text": "[removed]",
        "created_utc": 1678143564,
        "upvote_ratio": 1.0
    },
    {
        "title": "Pitch me your Angel Heart remake!",
        "author": "Material-Cut2522",
        "url": "https://www.reddit.com/r/movies/comments/11kh1w0/pitch_me_your_angel_heart_remake/",
        "text": "[removed]",
        "created_utc": 1678143414,
        "upvote_ratio": 1.0
    },
    {
        "title": "Let's talk about trailers which reveal the entire plot chronologically. I just watched the Ghosted (2023) and I loved all three minutes of it.",
        "author": "rdwd1",
        "url": "https://www.reddit.com/r/movies/comments/11kh1i7/lets_talk_about_trailers_which_reveal_the_entire/",
        "text": "[removed]",
        "created_utc": 1678143390,
        "upvote_ratio": 1.0
    },
    {
        "title": "looking for specific movie",
        "author": "wisewolfgirl",
        "url": "https://www.reddit.com/r/movies/comments/11kgzda/looking_for_specific_movie/",
        "text": "[removed]",
        "created_utc": 1678143257,
        "upvote_ratio": 1.0
    },
    {
        "title": "Almost Famous, for those who feel the same about rock music as the characters",
        "author": "ParfaitSignificant38",
        "url": "https://www.reddit.com/r/movies/comments/11kgvfw/almost_famous_for_those_who_feel_the_same_about/",
        "text": "Almost Famous is such a great movie that it's easy for people to like it who don't even listen to rock music. But for people like me, who listened to The Who and Led Zeppelin and Nirvana as a teenager and music became their soul, who realized there was a place somewhere you actually belonged, there were other people like you. I wanted to hear about this movie from the people who don't just like it but love it and love the music that it is a love letter to. How it made you feel when you saw it. I felt validated and understood when I saw that not only did other people know how amazing Led Zeppelin and The Who were, but what our favorite music MEANT to us. I was 16 when I saw this movie for the first time in 2004, I was a total sex drugs and rock and roll teenager who was rebellious and searching for meaning. Most girls my age were on sports teams and listened to popular crap music and brushed their teeth everyday while \"I wanted to be friends with the kids who smoked cigarettes and listened to rock and roll\" (Kurt Cobain). Drugs and music were how I found meaning in life and connection to others. So this movie was almost like watching my soul expressed in visual movie form. \"They don't know what it's like to love some band or a silly little piece of music so much, that it hurts.\" Just one of so many amazing quotes from this movie. I'd love to hear thoughts feelings and experiences from others about this masterpiece of a movie that understand that quote fully.",
        "created_utc": 1678143013,
        "upvote_ratio": 1.0
    },
    {
        "title": "Ghosted — Official Trailer | Apple TV+",
        "author": "BevarseeKudka",
        "url": "https://youtu.be/IAdCsNtEuBU",
        "text": "",
        "created_utc": 1678142755,
        "upvote_ratio": 1.0
    },
    {
        "title": "Elon Musk Documentary Coming From Oscar Winner Alex Gibney",
        "author": "flowerhoney10",
        "url": "https://variety.com/2023/film/news/elon-musk-documentary-alex-gibney-scientology-oscars-1235544410/",
        "text": "",
        "created_utc": 1678142644,
        "upvote_ratio": 1.0
    },
    {
        "title": "MEmu Android Emulator 8.1.2 Crack License Key (Latest-2023)",
        "author": "ahmadkanju",
        "url": "https://fullcrackedpc.com/memu-android-emulator-crack/",
        "text": "",
        "created_utc": 1678142575,
        "upvote_ratio": 1.0
    },
    {
        "title": "What are the best psychological horrors/thrillers?",
        "author": "Bobert789",
        "url": "https://www.reddit.com/r/movies/comments/11kgm9g/what_are_the_best_psychological_horrorsthrillers/",
        "text": "[removed]",
        "created_utc": 1678142438,
        "upvote_ratio": 1.0
    },
    {
        "title": "Avast Premium 23.2.6052 Crack License Key Download 2023",
        "author": "ahmadkanju",
        "url": "https://fullcrackedpc.com/avast-premium-crack/",
        "text": "",
        "created_utc": 1678142402,
        "upvote_ratio": 1.0
    },
    {
        "title": "Watching Rocky for the first time, it’s weird",
        "author": "MrThiccman-XL",
        "url": "https://www.reddit.com/r/movies/comments/11kgk5d/watching_rocky_for_the_first_time_its_weird/",
        "text": "[removed]",
        "created_utc": 1678142311,
        "upvote_ratio": 1.0
    }
]