[
    {
        "title": "New discord and desscusions",
        "author": "Filip_The_Fag",
        "url": "https://www.reddit.com/r/NeutralPolitics/comments/7dy4bp/new_discord_and_desscusions/",
        "text": "[removed]",
        "created_utc": 1511063134,
        "upvote_ratio": ""
    },
    {
        "title": "What are the pros to removing net neutrality?",
        "author": "joshteam",
        "url": "https://www.reddit.com/r/NeutralPolitics/comments/7dvvzv/what_are_the_pros_to_removing_net_neutrality/",
        "text": "[removed]",
        "created_utc": 1511040468,
        "upvote_ratio": ""
    },
    {
        "title": "Ajit Pai says that removing title 2 restrictions on ISPs will increase investment and create a more competitive market. Is this true? What other effects is this likely to have and what are the causes and motivations surrounding those effects?",
        "author": "Servious",
        "url": "https://www.reddit.com/r/NeutralPolitics/comments/7dtp9e/ajit_pai_says_that_removing_title_2_restrictions/",
        "text": "[removed]",
        "created_utc": 1511020423,
        "upvote_ratio": ""
    },
    {
        "title": "GOP Tax Bill and Tuition Waivers",
        "author": "ProfQuirrell",
        "url": "https://www.reddit.com/r/NeutralPolitics/comments/7do6tv/gop_tax_bill_and_tuition_waivers/",
        "text": "One thing that's been cropping up in the news quite a bit recently is the impact that the new GOP Tax Bill ([the one passed by the House](https://waysandmeansforms.house.gov/uploadedfiles/bill_text.pdf)) would have on tuition waivers. I've seen quite a bit of reporting (see [here](https://www.npr.org/2017/11/14/563879136/house-gop-tax-plan-would-hit-grad-students-with-massive-tax-hike) and [here](https://mobile.nytimes.com/2017/11/16/opinion/house-tax-bill-graduate-students.html?_r=0&amp;referer=https%3A%2F%2Fwww.google.com%2F), for instance) that the new tax plan turns tuition waivers into taxable income, drastically increasing the tax burden for graduate students based on money that they don't even get.\n\nI'm a graduate student myself (in a STEM field), so this topic is of some personal importance to me. However, I have yet to find a news article that details exactly how this is supposed to work. The NYT opinion piece quoted above references that the bill repeals Section 117(d)(5) of the tax code, but that's as specific as I've seen journalists get. It's rare (read: nonexistant) for such pieces to quote directly from the bill or the tax code and no attempt at real legal analysis is ever made.\n\nI call attention to this fact because there was some good discussion on /r/gradschool recently about this bill and there was one (heavily downvoted) user who was unsure that the tax bill would actually have this result. I found [this analysis](https://surlysubgroup.com/2017/11/06/gop-raises-taxes-on-graduate-students-or-does-it/) by a professor at Notre Dame Law School who goes into some detail as to how the bill and tax code interact and he seems similarly unsure. To quote:\n\n&gt; According to Dr. Wilke, the GOP tax bill now requires those tuition waivers to be included in income. After studying the bill and the current statute, this appeared to be true. So, I ran the numbers for a typical graduate student at my institution. You can read my in-depth calculation in the Twitter thread. But essentially, of the $23,000 stipend that a single Notre Dame student receives, he or she would need to pay approximately $13,350 in federal and state income tax, compared with about $2,500 under current law. That makes a graduate education effectively unaffordable.\n\n&gt; Perhaps I’m naïve, but I have trouble believing that the GOP really intends to take away such a large, important benefit from a huge number of students, whose work is critically important to the betterment of this country. Could the GOP have meant only to target the other provisions in section 117(d), which exclude undergraduate tuition waivers from taxation for employees of a university? Are there remaining provisions in the Code that could save the tuition waiver’s tax-free nature? Let’s take a closer look at the proposal.\n\nHe goes into some detail in his analysis, but ... it's complicated. I'm not sure I have understood him well enough to summarize accurately, and so I encourage you to simply read his article.\n\nDoes anyone here have any insight as to what exactly is going on with Section 1204(a)(3) and how exactly tuition waivers are handled under Section 117 of the [tax code](https://www.law.cornell.edu/uscode/text/26/117)? I have found mainstream journalism to be incredibly unhelpful in this regard.\n\nThank you for reading!",
        "created_utc": 1510954697,
        "upvote_ratio": ""
    },
    {
        "title": "how should accusations of sexual assault by sitting officeholders be handled? will there be any consequences?",
        "author": "thirdfounder",
        "url": "https://www.reddit.com/r/NeutralPolitics/comments/7dnryv/how_should_accusations_of_sexual_assault_by/",
        "text": "[removed]",
        "created_utc": 1510950873,
        "upvote_ratio": ""
    },
    {
        "title": "If 81% of Democrats and 73% of Republicans are in favor of net neutrality, and the gov isnt representing us in this matter, is there any way to trigger a vote on this issue?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/NeutralPolitics/comments/7dlwvc/if_81_of_democrats_and_73_of_republicans_are_in/",
        "text": "[removed]",
        "created_utc": 1510934443,
        "upvote_ratio": ""
    },
    {
        "title": "What are the real world effects of the Tax and Jobs bill Congress passed, if enacted into law?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/NeutralPolitics/comments/7dl97y/what_are_the_real_world_effects_of_the_tax_and/",
        "text": "[removed]",
        "created_utc": 1510928675,
        "upvote_ratio": ""
    },
    {
        "title": "Why don't outgoing presidents who want their VP to be the next president ever step down to give them an incumbent advantage?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/NeutralPolitics/comments/7dl205/why_dont_outgoing_presidents_who_want_their_vp_to/",
        "text": "[removed]",
        "created_utc": 1510926742,
        "upvote_ratio": ""
    },
    {
        "title": "Are there any previous cases where a top member in one of the three branches of federal government contributed to beginning an investigation for a controversy they were involved in?",
        "author": "ThreshingBee",
        "url": "https://www.reddit.com/r/NeutralPolitics/comments/7dkqzh/are_there_any_previous_cases_where_a_top_member/",
        "text": "This question is in response to Senator Franken joining in the call for an [ethics investigation](http://thehill.com/homenews/senate/360697-franken-releases-new-statement-calls-for-ethics-investigation-of-himself) concerning himself and sexual misconduct before joining office. I don't think I've ever heard of a member in top government doing something like that.",
        "created_utc": 1510923683,
        "upvote_ratio": ""
    },
    {
        "title": "How much money are Russian oligarchs unable to access because of the Magnitsky Act?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/NeutralPolitics/comments/7dirpi/how_much_money_are_russian_oligarchs_unable_to/",
        "text": "[removed]",
        "created_utc": 1510898056,
        "upvote_ratio": ""
    },
    {
        "title": "How should a politically neutral person respond to allegations of sexual misconduct against a politically active person?",
        "author": "CraptainHammer",
        "url": "https://www.reddit.com/r/NeutralPolitics/comments/7dif8e/how_should_a_politically_neutral_person_respond/",
        "text": "[removed]",
        "created_utc": 1510894051,
        "upvote_ratio": ""
    },
    {
        "title": "What is the merit in the removal of deductions for tuition waivers for graduate students? Are there enough graduate students for this to increase government revenue significantly?",
        "author": "DaPenguinThief",
        "url": "https://www.reddit.com/r/NeutralPolitics/comments/7diemy/what_is_the_merit_in_the_removal_of_deductions/",
        "text": "[removed]",
        "created_utc": 1510893876,
        "upvote_ratio": ""
    },
    {
        "title": "Is there any benefit for removing the tax waiver on tuition for graduate students?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/NeutralPolitics/comments/7dicw2/is_there_any_benefit_for_removing_the_tax_waiver/",
        "text": "[removed]",
        "created_utc": 1510893307,
        "upvote_ratio": ""
    },
    {
        "title": "Is Fascism inherently racist?",
        "author": "MakeWise",
        "url": "https://www.reddit.com/r/NeutralPolitics/comments/7di6g7/is_fascism_inherently_racist/",
        "text": "[removed]",
        "created_utc": 1510891287,
        "upvote_ratio": ""
    },
    {
        "title": "Are the microtransactions in Star Wars Battlefront II worse than previous AAA titles in the last few years?",
        "author": "m3dos",
        "url": "https://www.reddit.com/r/NeutralPolitics/comments/7dh8lo/are_the_microtransactions_in_star_wars/",
        "text": "[removed]",
        "created_utc": 1510881577,
        "upvote_ratio": ""
    },
    {
        "title": "In the countries that have introduced same-sex marriage, what have been the effects on education and society?",
        "author": "pixievampiress",
        "url": "https://www.reddit.com/r/NeutralPolitics/comments/7dgsgi/in_the_countries_that_have_introduced_samesex/",
        "text": "Margaret Court, the Australian former tennis pro and pastor made this comment in reference to the debate about Australia introducing same-sex marriage:\n\n&gt;Mrs Court, whose Victory Life Church was opened by Liberal luminary Sir Charles Court in 1997, said she did not believe Prime Minister Malcolm Turnbull or the media had properly examined the effects of same-sex marriage on education and society overseas.\n\n[Source](https://thewest.com.au/news/australia/same-sex-marriage-court-may-cut-ties-with-liberals-over-yes-vote-ng-b88660956z)",
        "created_utc": 1510877406,
        "upvote_ratio": ""
    },
    {
        "title": "How should we treat men who own up to sexual harassment?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/NeutralPolitics/comments/7dfxpm/how_should_we_treat_men_who_own_up_to_sexual/",
        "text": "[removed]",
        "created_utc": 1510870008,
        "upvote_ratio": ""
    },
    {
        "title": "Is organized trophy hunting good for a species?",
        "author": "hold_the_reins",
        "url": "https://www.reddit.com/r/NeutralPolitics/comments/7dftxw/is_organized_trophy_hunting_good_for_a_species/",
        "text": "[removed]",
        "created_utc": 1510868970,
        "upvote_ratio": ""
    },
    {
        "title": "What more can be done to take guns from domestic abusers and can we get a consensus to do it?",
        "author": "wjbc",
        "url": "https://www.reddit.com/r/NeutralPolitics/comments/7denvk/what_more_can_be_done_to_take_guns_from_domestic/",
        "text": "[removed]",
        "created_utc": 1510859401,
        "upvote_ratio": ""
    },
    {
        "title": "Does the reversal of the elephant trophy ban help or hinder conservation efforts long term?",
        "author": "Bananawamajama",
        "url": "https://www.reddit.com/r/NeutralPolitics/comments/7de8t4/does_the_reversal_of_the_elephant_trophy_ban_help/",
        "text": "[The Trump administration has ended a ban on elephant trophies from Zimbabwe.](https://www.cbsnews.com/news/trump-reverses-obama-era-ban-on-import-of-elephant-trophies-from-zimbabwe/)\n\nOn the one hand, [as hunters argue](http://www.cnn.com/2014/01/16/us/black-rhino-hunting-permit/index.html), sanctioned hunts can be auctioned off to raise substantial amounts of money for conservation efforts, and the ability to bring home trophies  can make this more appealing for wealthy hunters.\n\nOn the other hand, [poaching is still a significant threat to elephant populations](https://cites.org/eng/news/pr/2016_trends_in_African_elephant_poaching_released_–_CITES_MIKE_programme_03032017) and legalizing the import of trophies could expand the perceived market for poachers in America, giving them further motivation.\n\nGiven that both of these arguments are at least *feasible*, if not necessarily reality, what evidence is there as to what the net effect will be on elephant populations?\n\nEdit: Additionally, according to the US Fish and Wildlife Service, [trophy bans are based in part by the US determining that these countries were not adequately contributing to conservation efforts](https://www.fws.gov/international/permits/by-activity/sport-hunted-trophies-elephants.html). This could be due to corruption in the local government purposefully auctioning more hunting rights than is sustainable, or auctioning off elephants which still have the capacity to breed.",
        "created_utc": 1510855939,
        "upvote_ratio": ""
    },
    {
        "title": "Is there a comprehensive list of all the decisions (be it laws or reforms or whatever) that the President has made?",
        "author": "Presidentofsleep",
        "url": "https://www.reddit.com/r/NeutralPolitics/comments/7ddx99/is_there_a_comprehensive_list_of_all_the/",
        "text": "[removed]",
        "created_utc": 1510853212,
        "upvote_ratio": ""
    },
    {
        "title": "What is the merit in the removal of deductions for tuition waivers for graduate students? Is there enough graduate students for this to increase government revenue significantly?",
        "author": "DaPenguinThief",
        "url": "https://www.reddit.com/r/NeutralPolitics/comments/7dagjq/what_is_the_merit_in_the_removal_of_deductions/",
        "text": "[removed]",
        "created_utc": 1510812044,
        "upvote_ratio": ""
    },
    {
        "title": "Congressional Reps Speier and Comstock have come forward with allegations of harassment by members exposing themselves and grabbing others.",
        "author": "NosuchRedditor",
        "url": "https://www.reddit.com/r/NeutralPolitics/comments/7d8dzx/congressional_reps_speier_and_comstock_have_come/",
        "text": "[removed]",
        "created_utc": 1510790374,
        "upvote_ratio": ""
    },
    {
        "title": "Reps Speier and Comstock have come forward with [allegations](http://www.latimes.com/politics/essential/la-pol-ca-essential-politics-updates-rep-jackie-speier-shares-sexual-1509107499-htmlstory.html) of harassment by members exposing themselves; grabbing others. If proven, should they be expelled?",
        "author": "NosuchRedditor",
        "url": "https://www.reddit.com/r/NeutralPolitics/comments/7d7pwc/reps_speier_and_comstock_have_come_forward_with/",
        "text": "[removed]",
        "created_utc": 1510784200,
        "upvote_ratio": ""
    },
    {
        "title": "Cards Against Humanity purchased land between US/Mexico border, What are the ramifications of this?",
        "author": "TheElevatorIsWorthy",
        "url": "https://www.reddit.com/r/NeutralPolitics/comments/7d31rf/cards_against_humanity_purchased_land_between/",
        "text": "Cards against humanity sold 150,000 plots of land to people online stating:\n&gt; we’ve purchased a plot of vacant land on the border and retained a law firm specializing in eminent domain to make it as time-consuming and expensive as possible for the wall to get built.\n\n\nI am curious as to what the actual ramifications of this are. Will this impede the construction of the wall in any real way? Just curious if someone with knowledge on the subject could break this down. Thanks\n\n\n\n\n[Source](https://gizmodo.com/cards-against-humanity-sells-out-promotion-to-stop-dona-1820459891?IR=T)",
        "created_utc": 1510739029,
        "upvote_ratio": ""
    },
    {
        "title": "How sound is this analysis of violent crime and right-to-carry laws in the United States, and what sorts of policies might be gleaned from it (or critiques of it)?",
        "author": "raskolnik",
        "url": "https://www.reddit.com/r/NeutralPolitics/comments/7d1g0x/how_sound_is_this_analysis_of_violent_crime_and/",
        "text": "I was trying to find a source for something else recently, and I came across [this working paper](https://crimeresearch.org/wp-content/uploads/2017/07/Do_Handguns_Make_Us_Safer_John_edits_6_9_2017_stamped.pdf) from the National Research Council earlier this year.  I'll note that the link above is to a copy hosted by the Crime Prevention Research Center, a decidedly pro-gun organization run by John Lott (whose research has been called into question quite a bit over the years, e.g. [here](http://www.motherjones.com/politics/2015/07/john-lott-guns-crime-data/)).  The study is also posted [here](https://www.nber.org/papers/w23510) and discussed [here](https://news.stanford.edu/2017/06/21/violent-crime-increases-right-carry-states/), so it seems like the copy I first linked is accurate.\n\nIts authors attempt to evaluate what, if any, effect right-to-carry  (RTC) laws have on violent crime rates.  They find, based on their reading and analysis, that having these laws led to a 13-15% increase in \"violent\" crime over 10 years (with crime rates taken from FBI statistics), although oddly that there was not a statistically-significant increase in property crime or murder.\n\nI don't really have the stats background to evaluate the study in much detail.  This left me with a lot of questions about the methodology used, and a few things in particular:\n\n1. How accurate or reliable are their predictions about what crime rates would have been had those states not adopted RTC laws?  Does using existing data to model a counter-factual push their conclusions into unfalsifiability?\n\n1. They lump all states that have these laws (which is 41 of them) and them compare those as a bloc with the 9 states that don't, also as a single group.  Is this reliable without looking at variations among those states, particularly in terms of relative restrictions on obtaining a permit or actual issue rates?\n\n1.  Some states with RTC laws had the opposite result under their models, i.e. crime rates were below what was predicted.  For example, Utah's rate was 20.2% below what the authors estimated it would be without an RTC law (p. 92), Virginia's was 3.6% below (p. 93), Maine was 16.5% below (p. 73), etc.  (The state-by-state graphs start on p. 63.)  Should this have a greater impact on their ultimate findings than it did?\n\n1.  For murder rates, initially the authors note that there was not a statistically-significant rise related to RTC laws.  They say (p. 43) that they do find a statistically-significant increase with certain adjustments: specifically, they took what their model says the incarceration rate would be, compare that to what it actually was, and then use that to infer what the murder rate would have been without the RTC law based on a measure of how police and incarceration rates effect crime generally. How strong, ultimately, are these conclusions?\n\nAside from being politically charged, this is an area with what seems like precious little research.  This paper is quite recent (published in July 2017), and it seems to me that any discussion based on it has to start with whether its conclusions are valid to begin with.",
        "created_utc": 1510717983,
        "upvote_ratio": ""
    },
    {
        "title": "Was there any truth to the accusations of sexual misconduct by Donald Trump during the campaign?",
        "author": "iamveryniceipromise",
        "url": "https://www.reddit.com/r/NeutralPolitics/comments/7d10fi/was_there_any_truth_to_the_accusations_of_sexual/",
        "text": "[removed]",
        "created_utc": 1510713701,
        "upvote_ratio": ""
    },
    {
        "title": "Let's Just Be Honest Here",
        "author": "Kozad2",
        "url": "https://www.reddit.com/r/NeutralPolitics/comments/7d0fhd/lets_just_be_honest_here/",
        "text": "[removed]",
        "created_utc": 1510707948,
        "upvote_ratio": ""
    },
    {
        "title": "How does repealing the ACA Individual Mandate save $300 billion in the budget?",
        "author": "purplebooks",
        "url": "https://www.reddit.com/r/NeutralPolitics/comments/7cz321/how_does_repealing_the_aca_individual_mandate/",
        "text": "[removed]",
        "created_utc": 1510695930,
        "upvote_ratio": ""
    },
    {
        "title": "What effect would repealing the Individual Mandate have on the health insurance market?",
        "author": "Squevis",
        "url": "https://www.reddit.com/r/NeutralPolitics/comments/7cyy3q/what_effect_would_repealing_the_individual/",
        "text": "[removed]",
        "created_utc": 1510694813,
        "upvote_ratio": ""
    },
    {
        "title": "Are there any legitimate reasons / benefits for the current administration to push the use of coal, short-term or long-term?",
        "author": "CarbineGuy",
        "url": "https://www.reddit.com/r/NeutralPolitics/comments/7cwe1b/are_there_any_legitimate_reasons_benefits_for_the/",
        "text": "[removed]",
        "created_utc": 1510673983,
        "upvote_ratio": ""
    },
    {
        "title": "What prevents the Federal Government from \"seizing\" the Uranium One mines using its power of eminent domain?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/NeutralPolitics/comments/7cwbfr/what_prevents_the_federal_government_from_seizing/",
        "text": "[removed]",
        "created_utc": 1510673335,
        "upvote_ratio": ""
    },
    {
        "title": "What is the significance of Don Trump Jr and Wikileaks messages?",
        "author": "kulltsb",
        "url": "https://www.reddit.com/r/NeutralPolitics/comments/7cw9u8/what_is_the_significance_of_don_trump_jr_and/",
        "text": "[removed]",
        "created_utc": 1510672925,
        "upvote_ratio": ""
    },
    {
        "title": "What is the significance of Don Trump Jr and Wikileaks messages?",
        "author": "kulltsb",
        "url": "https://www.reddit.com/r/NeutralPolitics/comments/7cw6u9/what_is_the_significance_of_don_trump_jr_and/",
        "text": "[removed]",
        "created_utc": 1510672200,
        "upvote_ratio": ""
    },
    {
        "title": "Is Bill Clinton getting a free pass?",
        "author": "FeedMeCletus",
        "url": "https://www.reddit.com/r/NeutralPolitics/comments/7cw4qn/is_bill_clinton_getting_a_free_pass/",
        "text": "[removed]",
        "created_utc": 1510671672,
        "upvote_ratio": ""
    },
    {
        "title": "Why do tax cuts feature prominently in US tax reform?",
        "author": "8ltd",
        "url": "https://www.reddit.com/r/NeutralPolitics/comments/7cu3tg/why_do_tax_cuts_feature_prominently_in_us_tax/",
        "text": "[removed]",
        "created_utc": 1510645334,
        "upvote_ratio": ""
    },
    {
        "title": "All of foxnews.com is down",
        "author": "EnamoredToMeetYou",
        "url": "https://www.reddit.com/r/NeutralPolitics/comments/7ctav8/all_of_foxnewscom_is_down/",
        "text": "[removed]",
        "created_utc": 1510635293,
        "upvote_ratio": ""
    },
    {
        "title": "Why did Wikileaks want Trump elected? What was in it for them?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/NeutralPolitics/comments/7csvs2/why_did_wikileaks_want_trump_elected_what_was_in/",
        "text": "[removed]",
        "created_utc": 1510630769,
        "upvote_ratio": ""
    },
    {
        "title": "What are the implications of the EU blocs “historic” deal to integrate 23 armies to shake off its US dependence?",
        "author": "MakeTotalDestr0i",
        "url": "https://www.reddit.com/r/NeutralPolitics/comments/7cs9xa/what_are_the_implications_of_the_eu_blocs/",
        "text": "[removed]",
        "created_utc": 1510624689,
        "upvote_ratio": ""
    },
    {
        "title": "What are the implications of the EU blocs “historic” deal to integrate 23 armies to shake off its US dependence?",
        "author": "MakeTotalDestr0i",
        "url": "https://www.reddit.com/r/NeutralPolitics/comments/7cs31j/what_are_the_implications_of_the_eu_blocs/",
        "text": "[removed]",
        "created_utc": 1510622847,
        "upvote_ratio": ""
    },
    {
        "title": "What does Russia have to gain from interference with UK media and US elections?",
        "author": "charlie_boo",
        "url": "https://www.reddit.com/r/NeutralPolitics/comments/7cqpp7/what_does_russia_have_to_gain_from_interference/",
        "text": "[removed]",
        "created_utc": 1510610692,
        "upvote_ratio": ""
    },
    {
        "title": "Are there precedents for threatening to expel a Senate candidate?",
        "author": "dingoonline",
        "url": "https://www.reddit.com/r/NeutralPolitics/comments/7cqbbs/are_there_precedents_for_threatening_to_expel_a/",
        "text": "The National Republican Senatorial Committee's spokesperson has just posted  this statement on Roy Moore\n\n&gt; “I believe the individuals speaking out against Roy Moore spoke with courage and truth, proving he is unfit to serve in the United States Senate and he should not run for office. If he refuses to withdraw and wins, the Senate should vote to expel him, because he does not meet the ethical and moral requirements of the United States Senate.” \n\nhttps://www.nrsc.org/press-releases/nrsc-chairman-cory-gardner-statement-alabamas-special-senate-election-2017-11-13/\n\nMeanwhile, the Senate Majority Leader [McConnell has asked Moore to step down](https://www.washingtonpost.com/politics/mcconnell-calls-on-roy-moore-to-end-senate-campaign-following-accusations-of-sexual-misconduct/2017/11/13/1ca48d56-c890-11e7-aa96-54417592cf72_story.html) and a dozen other Senators have done the same. Is there any precedent where a Senate candidate or a Senator has been expelled or has been threatened with expulsion? ",
        "created_utc": 1510607402,
        "upvote_ratio": ""
    },
    {
        "title": "Are the needs for equality of wealth and environmentalism in conflict with each other?",
        "author": "Jemiller",
        "url": "https://www.reddit.com/r/NeutralPolitics/comments/7cq4px/are_the_needs_for_equality_of_wealth_and/",
        "text": "[removed]",
        "created_utc": 1510605958,
        "upvote_ratio": ""
    },
    {
        "title": "How should voters (or hollywood fans) interpret accusations of sexual misconduct?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/NeutralPolitics/comments/7cq4o8/how_should_voters_or_hollywood_fans_interpret/",
        "text": "[removed]",
        "created_utc": 1510605946,
        "upvote_ratio": ""
    },
    {
        "title": "[Request] History of Politics in the United States?",
        "author": "work_user",
        "url": "https://www.reddit.com/r/NeutralPolitics/comments/7coexy/request_history_of_politics_in_the_united_states/",
        "text": "[removed]",
        "created_utc": 1510592060,
        "upvote_ratio": ""
    },
    {
        "title": "Are the White Helmets in Syria 'good' resistance fighters or partial propaganda campaigners?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/NeutralPolitics/comments/7cnu8i/are_the_white_helmets_in_syria_good_resistance/",
        "text": "[removed]",
        "created_utc": 1510587326,
        "upvote_ratio": ""
    },
    {
        "title": "Trump tax proposal",
        "author": "AlphaWhiskeyOscar",
        "url": "https://www.reddit.com/r/NeutralPolitics/comments/7cnlc8/trump_tax_proposal/",
        "text": "[removed]",
        "created_utc": 1510585120,
        "upvote_ratio": ""
    },
    {
        "title": "Why didn't China move more towards its own version of the Nordic Model?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/NeutralPolitics/comments/7cmuje/why_didnt_china_move_more_towards_its_own_version/",
        "text": "[removed]",
        "created_utc": 1510577198,
        "upvote_ratio": ""
    },
    {
        "title": "Does a political party exist for me?",
        "author": "cherrycoke00",
        "url": "https://www.reddit.com/r/NeutralPolitics/comments/7cls1v/does_a_political_party_exist_for_me/",
        "text": "[removed]",
        "created_utc": 1510561327,
        "upvote_ratio": ""
    },
    {
        "title": "Discussion: should a new international language be created?",
        "author": "LordTrollsworth",
        "url": "https://www.reddit.com/r/NeutralPolitics/comments/7cled7/discussion_should_a_new_international_language_be/",
        "text": "[removed]",
        "created_utc": 1510555737,
        "upvote_ratio": ""
    },
    {
        "title": "Breakdown of Trump's first year in office",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/NeutralPolitics/comments/7cgata/breakdown_of_trumps_first_year_in_office/",
        "text": "[removed]",
        "created_utc": 1510503911,
        "upvote_ratio": ""
    },
    {
        "title": "Why isn't Donald Trump affected by allegations of sexual misconduct like other men?",
        "author": "reaact",
        "url": "https://www.reddit.com/r/NeutralPolitics/comments/7cej10/why_isnt_donald_trump_affected_by_allegations_of/",
        "text": "[removed]",
        "created_utc": 1510478673,
        "upvote_ratio": ""
    },
    {
        "title": "Why isn't Donald Trump effected by like many others",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/NeutralPolitics/comments/7ceh8j/why_isnt_donald_trump_effected_by_like_many_others/",
        "text": "[removed]",
        "created_utc": 1510477726,
        "upvote_ratio": ""
    },
    {
        "title": "What precedent is there for a POTUS to side with foreign officials over his own intelligence apparatus?",
        "author": "CQME",
        "url": "https://www.reddit.com/r/NeutralPolitics/comments/7cc3qf/what_precedent_is_there_for_a_potus_to_side_with/",
        "text": "&gt;  [***McCain slams Trump over siding with Putin on Russia meddling***](http://www.cnn.com/2017/11/11/politics/john-mccain-donald-trump-russia/index.html) - Sen. John McCain slammed President Donald Trump on Saturday for saying he believes Russian President Vladimir Putin over senior US intelligence officials when he says his country didn't interfere in the 2016 election.\n\n&gt; \"I mean, give me a break, they are political hacks,\" Trump said. \"So you look at it, I mean, you have Brennan, you have Clapper and you have Comey. Comey is proven now to be a liar and he is proven now to be a leaker. So you look at that and you have President Putin very strongly, vehemently says he had nothing to do with them.\"\n\n&gt; \"President Trump today stated that he believed Vladimir Putin is being sincere when he denies Russian interference in the 2016 presidential election and reiterated that he hopes to cooperate with Russia in Syria,\" McCain, a strong critic of the President, said in a statement. \"There's nothing 'America First' about taking the word of a KGB colonel over that of the American intelligence community. There's no 'principled realism' in cooperating with Russia to prop up the murderous Assad regime, which remains the greatest obstacle to a political solution that would bring an end to the bloodshed in Syria. Vladimir Putin does not have America's interests at heart. To believe otherwise is not only naive but also places our national security at risk.\"\n\nAre there other instances where US officials found their own government to be less reliable sources of information than foreign governments?\n\nTo be a bit clearer, I am aware that the US intelligence apparatus has varying treaties worldwide for intelligence sharing, and that we are big consumers of foreign intelligence.  My question deals with US officials  favoring pronouncements by foreign officials over the US intelligence community and such intelligence sharing agreements.",
        "created_utc": 1510445889,
        "upvote_ratio": ""
    },
    {
        "title": "What's stopping the Democrats from proposing legislation opposing the Republicans",
        "author": "ajdrausal",
        "url": "https://www.reddit.com/r/NeutralPolitics/comments/7cbxd3/whats_stopping_the_democrats_from_proposing/",
        "text": "[removed]",
        "created_utc": 1510444015,
        "upvote_ratio": ""
    },
    {
        "title": "The right to bear arms: back to basics.",
        "author": "Dracolique",
        "url": "https://www.reddit.com/r/NeutralPolitics/comments/7c8z36/the_right_to_bear_arms_back_to_basics/",
        "text": "[removed]",
        "created_utc": 1510414198,
        "upvote_ratio": ""
    },
    {
        "title": "Does the second amendment extend to the right to purchase ammunition? If no, can a ban on the sale of bullets for certain firearms be less open to constitutional challenges than a ban on the guns themselves? Would it be politically tenable to have alloy signatures for tracing rounds to the buyer?",
        "author": "honolublu",
        "url": "https://www.reddit.com/r/NeutralPolitics/comments/7c6lox/does_the_second_amendment_extend_to_the_right_to/",
        "text": "[removed]",
        "created_utc": 1510377066,
        "upvote_ratio": ""
    },
    {
        "title": "Devin Nunes attended a breakfast with Michael Flynn",
        "author": "quaderrordemonstand",
        "url": "https://www.reddit.com/r/NeutralPolitics/comments/7c5jnm/devin_nunes_attended_a_breakfast_with_michael/",
        "text": "[removed]",
        "created_utc": 1510363946,
        "upvote_ratio": ""
    },
    {
        "title": "Net neutrality threatened by reverse media",
        "author": "mertz3hack",
        "url": "https://www.reddit.com/r/NeutralPolitics/comments/7c58uc/net_neutrality_threatened_by_reverse_media/",
        "text": "[removed]",
        "created_utc": 1510360687,
        "upvote_ratio": ""
    },
    {
        "title": "How did the DNC go broke in the first place?",
        "author": "MagicHouseProduction",
        "url": "https://www.reddit.com/r/NeutralPolitics/comments/7c52f7/how_did_the_dnc_go_broke_in_the_first_place/",
        "text": "[removed]",
        "created_utc": 1510358889,
        "upvote_ratio": ""
    },
    {
        "title": "What are the merits of higher child tax credits for Utah and Florida?",
        "author": "ascenx",
        "url": "https://www.reddit.com/r/NeutralPolitics/comments/7c486w/what_are_the_merits_of_higher_child_tax_credits/",
        "text": "[Mike Lee (R-UT) and Marco Rubio (R-FL) criticized Senate Republican's tax bill for not including enough child tax credit](http://www.washingtonexaminer.com/marco-rubio-mike-lee-senates-proposed-1650-child-tax-credit-simply-not-enough/article/2640245).\n\nIn regards to this, my question is two-part:\n\n1. What are the merits of higher child tax credits for Utah and Florida?\n2. Do higher child tax credits benefit Utah and Florida more than other states? (Therefore, it's those two senators pushing for the change.)",
        "created_utc": 1510350243,
        "upvote_ratio": ""
    },
    {
        "title": "What is the best justification for prostitution remaining illegal?",
        "author": "maxjkmoseley",
        "url": "https://www.reddit.com/r/NeutralPolitics/comments/7c2x5a/what_is_the_best_justification_for_prostitution/",
        "text": "[removed]",
        "created_utc": 1510338243,
        "upvote_ratio": ""
    },
    {
        "title": "What policies should the United States take for Russian interference regarding the US election and/or US affairs",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/NeutralPolitics/comments/7c2he9/what_policies_should_the_united_states_take_for/",
        "text": "[removed]",
        "created_utc": 1510334329,
        "upvote_ratio": ""
    },
    {
        "title": "Can someone weigh in on the veracity of this post?",
        "author": "easyEggplant",
        "url": "https://www.reddit.com/r/NeutralPolitics/comments/7c0z3n/can_someone_weigh_in_on_the_veracity_of_this_post/",
        "text": "[removed]",
        "created_utc": 1510319307,
        "upvote_ratio": ""
    },
    {
        "title": "[Hypothetical] Are there any protections in place by the federal government in the event that they are ignored en masse?",
        "author": "echisholm",
        "url": "https://www.reddit.com/r/NeutralPolitics/comments/7c0ow4/hypothetical_are_there_any_protections_in_place/",
        "text": "[removed]",
        "created_utc": 1510315462,
        "upvote_ratio": ""
    },
    {
        "title": "I am torn politically.",
        "author": "first_order_general",
        "url": "https://www.reddit.com/r/NeutralPolitics/comments/7bzhcd/i_am_torn_politically/",
        "text": "[removed]",
        "created_utc": 1510296063,
        "upvote_ratio": ""
    },
    {
        "title": "Why are Mike Lee (R-UT) and Marco Rubio (R-FL) pushing for higher child tax credit?",
        "author": "ascenx",
        "url": "https://www.reddit.com/r/NeutralPolitics/comments/7bz60y/why_are_mike_lee_rut_and_marco_rubio_rfl_pushing/",
        "text": "[removed]",
        "created_utc": 1510291791,
        "upvote_ratio": ""
    },
    {
        "title": "Why are Mike Lee (R-UT) and Marco Rubio (R-FL) pushing for higher child tax credits?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/NeutralPolitics/comments/7bz486/why_are_mike_lee_rut_and_marco_rubio_rfl_pushing/",
        "text": "[removed]",
        "created_utc": 1510291169,
        "upvote_ratio": ""
    },
    {
        "title": "Is universal healthcare effective?",
        "author": "Lord_Imperator",
        "url": "https://www.reddit.com/r/NeutralPolitics/comments/7bxr6y/is_universal_healthcare_effective/",
        "text": "DEFINITIONS\nSocialized Healthcare: A system where the healthcare* of all citizens is paid for exclusively by the government.\n*Likely not including all medical services, as most legislation (such as Canada's https://www.canada.ca/en/health-canada/services/health-care-system/canada-health-care-system-medicare/canada-health-act-frequently-asked-questions.html#a5) that are usually considered universal (https://en.wikipedia.org/wiki/List_of_countries_with_universal_health_care).\nEffective: Is the value (quality of life improvements gained from the medical procedures made available) per expenditure (financial, bureaucratic, government power precedent, all kinds) greater than available alternatives (the current U.S. system, other foreign non-universal systems, proposals being made by the current U.S. congress, etc.).\nBackground articles:\nAffordable Healthcare Act (US) - https://www.gpo.gov/fdsys/pkg/PLAW-111publ148/pdf/PLAW-111publ148.pdf Reconciliation Act (US) - https://www.gpo.gov/fdsys/pkg/PLAW-111publ152/pdf/PLAW-111publ152.pdf Canada Health Act (CAN) - http://laws-lois.justice.gc.ca/eng/acts/C-6/page-1.html National Health Service (UK) https://en.wikipedia.org/wiki/National_Health_Service Healthcare in Denmark (DK) https://en.wikipedia.org/wiki/Healthcare_in_Denmark",
        "created_utc": 1510275507,
        "upvote_ratio": ""
    },
    {
        "title": "Funders for an Independent Political Consulting Project?",
        "author": "luigisp",
        "url": "https://www.reddit.com/r/NeutralPolitics/comments/7brbuk/funders_for_an_independent_political_consulting/",
        "text": "[removed]",
        "created_utc": 1510205210,
        "upvote_ratio": ""
    },
    {
        "title": "If not now... When...",
        "author": "justthetipofhumanity",
        "url": "https://www.reddit.com/r/NeutralPolitics/comments/7braio/if_not_now_when/",
        "text": "[removed]",
        "created_utc": 1510204712,
        "upvote_ratio": ""
    },
    {
        "title": "Who would win in a fight: Roger Stone or Roger Ebert?",
        "author": "PM_ME_A_FACT",
        "url": "https://www.reddit.com/r/NeutralPolitics/comments/7br65p/who_would_win_in_a_fight_roger_stone_or_roger/",
        "text": "[removed]",
        "created_utc": 1510203234,
        "upvote_ratio": ""
    },
    {
        "title": "I think Roger Stone is one of the greatest political minds of the last 40 years.",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/NeutralPolitics/comments/7br53x/i_think_roger_stone_is_one_of_the_greatest/",
        "text": "[removed]",
        "created_utc": 1510202847,
        "upvote_ratio": ""
    },
    {
        "title": "Why were there any unopposed republicans running anywhere?",
        "author": "10gags",
        "url": "https://www.reddit.com/r/NeutralPolitics/comments/7boic9/why_were_there_any_unopposed_republicans_running/",
        "text": "[removed]",
        "created_utc": 1510176078,
        "upvote_ratio": ""
    },
    {
        "title": "Is it true that the GOP plan will raise taxes on the middle class in the future?",
        "author": "cat_of_danzig",
        "url": "https://www.reddit.com/r/NeutralPolitics/comments/7bnioq/is_it_true_that_the_gop_plan_will_raise_taxes_on/",
        "text": "[removed]",
        "created_utc": 1510167718,
        "upvote_ratio": ""
    },
    {
        "title": "How does a 50-50 tie work in the Virginia House of Delegates?",
        "author": "huadpe",
        "url": "https://www.reddit.com/r/NeutralPolitics/comments/7bn94x/how_does_a_5050_tie_work_in_the_virginia_house_of/",
        "text": "So last night's elections in Virginia produced a [surprising Democratic wave](https://www.washingtonpost.com/powerpost/republicans-seek-new-path-after-failure-of-gillespies-trumpism-without-trump/2017/11/07/3afb9144-c3e7-11e7-aae0-cb18a8c29c65_story.html?hpid=hp_hp-top-table-high_fallout-1125pm-1%3Ahomepage%2Fstory&amp;utm_term=.b496f767538f) in the Virginia House of Delegates, where [as of this writing,](https://www.nytimes.com/elections/results/virginia-general-elections) at least 14 seats have changed from Republican to Democratic hands.  Currently 5 seats are still being reported as too close to call.  Of those, two Democrats hold a lead and three Republicans hold a lead.\n\nIf that shakes out with the current leads holding, and no other seats changing in a recount, that would result in an exact 50-50 tie in the House of Delegates.  (There are 100 seats)\n\nSince the body has an even number of members, are there any tiebreaker mechanisms?  It seems like the vote on the speakership will be important, and under the [current House of Delegates rules](https://publications.virginiageneralassembly.gov/download_publication/87) I can't seem to find any indication of how it would be handled when there's an exact tie.",
        "created_utc": 1510165521,
        "upvote_ratio": ""
    },
    {
        "title": "Will Hillary Clinton Run in 2020?",
        "author": "Aedum1",
        "url": "https://www.reddit.com/r/NeutralPolitics/comments/7bm0bu/will_hillary_clinton_run_in_2020/",
        "text": "[removed]",
        "created_utc": 1510154904,
        "upvote_ratio": ""
    },
    {
        "title": "NAFTA Negotiations - Modern United Front",
        "author": "CanadaUnited",
        "url": "https://www.reddit.com/r/NeutralPolitics/comments/7bitbm/nafta_negotiations_modern_united_front/",
        "text": "[removed]",
        "created_utc": 1510113424,
        "upvote_ratio": ""
    },
    {
        "title": "To what extent is China to blame for the Opioid Crisis?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/NeutralPolitics/comments/7bhyaz/to_what_extent_is_china_to_blame_for_the_opioid/",
        "text": "[removed]",
        "created_utc": 1510104663,
        "upvote_ratio": ""
    },
    {
        "title": "To what extent is China to blame for the Opioid Crisis?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/NeutralPolitics/comments/7bht3o/to_what_extent_is_china_to_blame_for_the_opioid/",
        "text": "[removed]",
        "created_utc": 1510103244,
        "upvote_ratio": ""
    },
    {
        "title": "What is the legality of obtaining opposition research from foreign governments?",
        "author": "Dark_Shit",
        "url": "https://www.reddit.com/r/NeutralPolitics/comments/7bh3pc/what_is_the_legality_of_obtaining_opposition/",
        "text": "We know that both campaigns received oppo research from Russian sources but used different methods to do so. \n\nThis [CNN article](http://www.cnn.com/2017/10/24/politics/fusion-gps-clinton-campaign/index.htmld) suggests that the Clinton campaign paid Fusion GPS to continue researching into Donald Trump's past. Fusion GPS then hired former British intelligence agent Christopher Steele to conduct the operation. Steele used personal connections inside Russia to write up the infamous pee pee tape dossier. According to [Vanity Fair](https://www.vanityfair.com/news/2017/03/how-the-explosive-russian-dossier-was-compiled-christopher-steele) some of these sources were Russian government officials including a senior Russian Foreign Ministry figure and a former top level intelligence officer still active in the Kremlin.\n\nOn the other side of the aisle, Trump Jr. was approached through email by publicist Rob Goldstone to set up a meeting with Russian lawyer Natalia Veselnitskaya. According to the [Washington Post](https://www.washingtonpost.com/politics/newly-disclosed-email-sheds-light-on-trump-jr-meeting-with-russian-lawyer/2017/10/09/2d0fecb0-a9e3-11e7-92d1-58c702d2d975_story.html?utm_term=.17e8cdc778c8) there's still a lot of unanswered questions about the specifics of this meeting and the story may go deeper than just oppo research. That Washington Post article discusses how both sides deny that any transfer of intelligence took place but their stories are different.\n\nIs the ethical and legal issue here that the Clinton team paid for the intel while the Trump team was trying to get it for free? I can see how this suggests a quid pro quo but if they didn't accept the intel is that still an issue? What if the intel never existed in the first place? If the Trump team used a middle man to meet with Russian sources would they be in better shape? ",
        "created_utc": 1510096389,
        "upvote_ratio": ""
    },
    {
        "title": "Off Year Election Night Megathread",
        "author": "huadpe",
        "url": "https://www.reddit.com/r/NeutralPolitics/comments/7bh17t/off_year_election_night_megathread/",
        "text": "So it is election day for most (all?) of the US today.  As is election tradition we shall be doing a megathread here.  \n\nThe marquee race of the night is the Virginia governor's race where [polls have shown a tight race with a small lead for Democrat Ralph Northham over Republican Ed Gillespie.](https://www.realclearpolitics.com/epolls/2017/governor/va/virginia_governor_gillespie_vs_northam-6197.html)\n\nAlso there is a gubernatorial race in New Jersey where [Democrat Phil Murphy has polled well ahead of Republican Kim Guadagno](https://www.realclearpolitics.com/epolls/2017/governor/nj/new_jersey_governor_guadagno_vs_murphy-6187.html)\n\nOutside those states, there is a very interesting DA's race [in Philadelphia](https://whyy.org/articles/philadelphians-prepare-select-new-district-attorney/) where the Democratic candidate is running on a very strongly anti-mass-incarceration platform.  There's also a referendum on holding a [New York Constitutional Convention](https://ballotpedia.org/New_York_Proposal_1,_Constitutional_Convention_Question_(2017\\)) and a referendum in Maine on [expanding Medicaid, which the legislature tried to do but which was vetoed by Gov. LePage.](https://www.npr.org/sections/health-shots/2017/11/07/562323124/maine-voters-will-decide-if-they-want-more-access-to-medicaid)\n\nIn Washington State there is [a State Senate race which would determine if Democrats get unified control of the State government.](https://www.npr.org/2017/11/06/561554801/millions-of-dollars-pour-into-washington-state-special-election)\n\nI'll keep a running tally going in various races, and also will be happy to add other races of interest people mention below.\n\n[The Washington Post](https://www.washingtonpost.com/news/powerpost/wp/2017/11/07/how-to-watch-election-night-2017-hour-by-hour/?hpid=hp_hp-top-table-low_hourbyhour-12p%3Ahomepage%2Fstory&amp;utm_term=.eab43621abff) also has a list of races to watch and poll closing times for them.\n\nAlso for the headline race of the night in Virginia, [here's a link to the New York Times' live results page.](https://www.nytimes.com/elections/results/virginia-governor-election-gillespie-northam)\n\n---\n\n**7:10 PM EST**  Polls closed in VA about 10 min ago, though no results yet.  [Exit poll says Northam by 5](http://fivethirtyeight.com/live-blog/2017-election-live-coverage-results/?lpup=19559644#livepress-update-19559644) for what that's worth.\n\n**7:24 PM EST** Something appears to be badly wrong with the NYT results page and it is displaying numbers which quite literally don't add up.  [Try the Washington Post's instead.](https://www.washingtonpost.com/2017-election-results/virginia/?hpid=hp_hp-top-table-high_va-results-button%3Ahomepage%2Fstory&amp;utm_term=.222d69bd0f2d)\n\n**7:30 PM EST** NYT seems to have sorted out their bug.\n\n**7:35 PM EST**  Lots of results coming in VA now.  Northam seems to be doing better than the rest of the Democratic ticket there, and is performing very strongly where he needs to.  Looks like Northam is going to win it, but the other races for Lt Gov and AG may be closer.\n\n**7:54 PM EST** NYT estimator has Northam at +8 median outcome and Gillespie well outside the cone of probability.  I expect we'll be seeing networks call it soon.  And if Northam does pull a +8 victory, he should be accompanied by the rest of his ticket, who seem to be getting 2 points or so less than him margin-wise.\n\n**8:02 PM EST**  Polls have closed in Maine, New Jersey, and Pennsylvania.  Looks like a Democratic rout in Virginia, with [huge swings in the House of Delegates as well.](http://fivethirtyeight.com/live-blog/2017-election-live-coverage-results/?lpup=19636144#livepress-update-19636144)  Networks called NJ for Murphy at polls close.\n\n**8:14 PM EST** Networks calling VA for Northam.  Looking downballot in VA, I am seeing about 15 House of Delegates seats where Democrats are leading Republican incumbents, though without checking anything other than lead at the moment.  Democrats would need to take 16 seats to take the House of Delegates.\n\n**8:16 PM EST**  One of those changes in the VA House of Delegates is [Danica Roem, who becomes the first transgender person elected to the VA state legislature.](http://fivethirtyeight.com/live-blog/2017-election-live-coverage-results/?lpup=13214256#livepress-update-13214256)\n\n**8:24 PM EST**  Looks like Democrats are leading to [take 18 seats in the House of Delegates,](http://fivethirtyeight.com/live-blog/2017-election-live-coverage-results/?lpup=20841643#livepress-update-20841643) though some of those are still quite close.\n\n**8:36 PM EST** It seems Democrats need 17 seats to take the House of Delegates because I am bad at math. Also Maine vote looks even right now, but heavily concentrated in rural areas reporting, so it might end up as a blowout yet.  Yes Mediciad expansion leading a bit.\n\n**8:44 PM EST** President Trump has made his first over-140-character tweet, [and it was criticism of Gillespie.](https://twitter.com/realDonaldTrump/status/928074747316928513)\n\n**8:49 PM EST**  Krasner [is winning](http://phillyelectionresults.com/) the Philly DA race handily so far.\n\n**9:05 PM EST** Polls are now closed in New York.   Forgot to mention there's a NYC mayoral race, but it's not expected to be close.\n\n**9:15 PM EST** With about 1/3 reporting, the Maine Medicaid referendum looks on track to be approved easily.\n\n**9:34 PM EST** Looks like the New York ConCon is going down in flames.  80/20 against right now.\n\n**10:13 PM EST** Maine Medicaid vote has been called for 'yes' by the Associated Press.  Utah 3rd congressional district (Jason Chaffetz' old seat) looks like a hold for Republicans.\n\n**10:53 PM EST** Looks like the VA House of Delegates is going to end up in recounts and be very close on control.  Anyone know what happens there if it's exactly 50 R 50 D when the dust settles?  Also only notable race still outstanding seems to be the WA state senate race, where polls close in 5 minutes.\n\n**11:01 PM EST** The new Republican congressman from Utah is Provo Mayor John Curtis, one of whose notable prior accomplishments is [replacing the godawful flag of Provo.](https://en.wikipedia.org/wiki/Flag_of_Provo,_Utah)  Seriously.  [Look at this flag.](https://en.wikipedia.org/wiki/Flag_of_Provo,_Utah#/media/File:Flag_of_Provo,_Utah_(1985-2015\\).svg)  (Yes, I am violating the image linking rules and the neutrality rules.  But my god that flag sucks.\n\n**11:16 PM EST**  Ok, Provo flag rant over.  Looks like [Democrats are winning in the first round of results in the Washington State Senate race to decide control of the chamber.](http://results.vote.wa.gov/results/current/Legislative-District-45-State-Senator.html)\n\n**11:36 PM EST** Gonna end the tick tock here I think.  Big night for Democrats overall, and it will probably take a few days to sort out who controls the VA House of Delegates.  If anyone wants to make a NP post about how that works in a 50/50 tie that might be a good idea wink wink nudge nudge.\n\nGoodnight all.",
        "created_utc": 1510095725,
        "upvote_ratio": ""
    },
    {
        "title": "Is the republican tax plan making attempting to undermine academia?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/NeutralPolitics/comments/7bgpgv/is_the_republican_tax_plan_making_attempting_to/",
        "text": "[removed]",
        "created_utc": 1510092693,
        "upvote_ratio": ""
    },
    {
        "title": "Neutrons - Do you think the purposed tax bill is going to pass?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/NeutralPolitics/comments/7bfvlp/neutrons_do_you_think_the_purposed_tax_bill_is/",
        "text": "[removed]",
        "created_utc": 1510085611,
        "upvote_ratio": ""
    },
    {
        "title": "Donna Brazille's book has several passages on Seth Rich's untimely demise expressing concern he may have been murdered. Rod Wheeler has sued Fox claiming that the murder narrative was contrived to take the focus off of the Russia investigation. Which story has more supporting facts?",
        "author": "NosuchRedditor",
        "url": "https://www.reddit.com/r/NeutralPolitics/comments/7bfkx3/donna_brazilles_book_has_several_passages_on_seth/",
        "text": "[removed]",
        "created_utc": 1510083065,
        "upvote_ratio": ""
    },
    {
        "title": "Survey",
        "author": "daw9030",
        "url": "https://www.reddit.com/r/NeutralPolitics/comments/7bfggv/survey/",
        "text": "[removed]",
        "created_utc": 1510082029,
        "upvote_ratio": ""
    },
    {
        "title": "How do the United States' current laws related to mental illness and firearms function in practice?",
        "author": "TheFlamingLemon",
        "url": "https://www.reddit.com/r/NeutralPolitics/comments/7bfb06/how_do_the_united_states_current_laws_related_to/",
        "text": "As per Wikipedia, [The Brady Handgun Violence Prevention Act](https://en.m.wikipedia.org/wiki/Brady_Handgun_Violence_Prevention_Act) prohibits anyone who \"has been adjudicated as a mental defective or committed to a mental institution\" from \"shipping or transporting any firearm in interstate or foreign commerce, or receiving any firearm which has been shipped or transported in interstate or foreign commerce, or possessing any firearm in or affecting commerce\"\n\nAlso, a [helpful NY Times article](https://www.nytimes.com/interactive/2016/01/06/us/how-people-with-mental-illness-are-able-to-obtain-guns.html) states that \" individuals cannot buy a gun if a court or other authority has deemed them a “mental defective” or committed them involuntarily to a mental hospital.\" \n\nMy questions are\n1: Who all is affected by this?\n2: What all are those affected by this legislation restricted from doing?\n\nUnder question 1, I'll add the following \nA: Is this a lifetime ban? \nB: Does it include those who were involuntarily committed before the bill was passed?\nC: Are minors treated differently, or would a person involuntarily committed as a minor be affected?\nD: Can fully rehabilitated individuals become unaffected through any process? \n\nAnd under question 2, I'll add\nA: Does this prevent affected individuals from buying guns in private sales? (That is, would they be punished for doing so?)\n\nThe alphabetized questions are mainly suggestions; they're not necessary to answer but they're things to consider in answering (and if you can answer them specifically, that's great too!)",
        "created_utc": 1510080784,
        "upvote_ratio": ""
    },
    {
        "title": "How do our current laws related to mental illness and firearms function in practice?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/NeutralPolitics/comments/7bf6s6/how_do_our_current_laws_related_to_mental_illness/",
        "text": "[removed]",
        "created_utc": 1510079781,
        "upvote_ratio": ""
    },
    {
        "title": "Donna Brazille's book has several passages on Seth Rich's untimely demise expressing concern he may have been murdered. Will this cause Rod Wheeler's lawsuit against Fox to collapse?",
        "author": "NosuchRedditor",
        "url": "https://www.reddit.com/r/NeutralPolitics/comments/7bf4il/donna_brazilles_book_has_several_passages_on_seth/",
        "text": "[removed]",
        "created_utc": 1510079229,
        "upvote_ratio": ""
    },
    {
        "title": "Are there any legal ramification to the media or social media for pushing an edited video to cast POTUS in a bad light?",
        "author": "NosuchRedditor",
        "url": "https://www.reddit.com/r/NeutralPolitics/comments/7b96d8/are_there_any_legal_ramification_to_the_media_or/",
        "text": "Various media and social media outlets have posted videos that appear to be edited to make President Trump appear to have disrespected Japanese tradition WRT feeding koi fish at a palace.\n\nWhat the edited video leaves out is Japanese PM Abe dumping the last of his fish food just prior to President Trump pouring out the last of his.\n\nWhat if any legal ramifications does this have for media and social media if in fact they did intentionally edit this video to cast the President in a negative way?  Should there be any legal ramifications for media that creates inaccurate information and reports it with the apparent intent to create a negative opinion under false circumstances?  http://www.dailywire.com/news/23206/koi-gate-cnn-deceptively-edits-japan-video-show-emily-zanotti?utm_source=facebook&amp;utm_medium=social&amp;utm_content=062316-news&amp;utm_campaign=benshapiro#\n\nhttps://www.mediaite.com/online/koi-gate-cnn-falls-for-misleading-trump-story-about-fish-feeding-buffoonery/",
        "created_utc": 1510011466,
        "upvote_ratio": ""
    },
    {
        "title": "Did the FEC ever address complaints filed, alleging that that Donald Trump's campaign solicited money from foreign nationals, including government officials?",
        "author": "DiceMaster",
        "url": "https://www.reddit.com/r/NeutralPolitics/comments/7b93m3/did_the_fec_ever_address_complaints_filed/",
        "text": "It has been reported by [The Hill](http://thehill.com/homenews/campaign/288031-trump-campaign-solicits-illegal-foreign-donations-despite-warnings), [The Independent](http://www.independent.co.uk/news/uk/politics/donald-trump-fundraising-email-mp-natalie-mcgarry-reply-warm-hope-his-repugnant-campaign-will-fail-a7108701.html), [Talking Points Memo](http://talkingpointsmemo.com/livewire/trump-fundraising-emails-foreign-members-parliament?utm_content=buffer0e04c&amp;utm_medium=social&amp;utm_source=twitter.com&amp;utm_campaign=buffer), and [the campaign finance reform advocacy group, Democracy 21](http://www.democracy21.org/inside-the-courts/press-releases-inside-the-courts/reform-group-file-complaint-against-donald-trump-for-soliciting-foreign-money-to-fund-his-campaign/) that the Donald Trump presidential campaign solicited money from foreign nationals, including government officials. From what I could find, members of parliament from at least Britain, Australia, Iceland, Denmark, and Finland have come forward with Trump campaign emails soliciting donations. At least two election watchdog groups, according to the Hill, brought complaints to the FEC about it. So my question, which I couldn't seem to find from a few targeted google and wikipedia searches, is this: did the FEC ever address this, and what was the outcome if they did?",
        "created_utc": 1510010719,
        "upvote_ratio": ""
    },
    {
        "title": "What are the pros/cons of CA/IL/NY et al running their own independent universal healthcare program?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/NeutralPolitics/comments/7b7n0v/what_are_the_proscons_of_cailny_et_al_running/",
        "text": "[removed]",
        "created_utc": 1509997892,
        "upvote_ratio": ""
    },
    {
        "title": "What would be the benefits and costs for a reestablishment of the Fairness Doctrine in the US?",
        "author": "TehSoupNazi",
        "url": "https://www.reddit.com/r/NeutralPolitics/comments/7b7akb/what_would_be_the_benefits_and_costs_for_a/",
        "text": "As there is an ongoing rhetoric about fake news I recently thought of the former Fairness Doctrine in the US and if it should be put back in place.\nhttps://www.vox.com/2017/11/6/16504454/misinformation-fake-news-media-trump\n\nThe Fairness Doctrine was a policy of the United States Federal Communications Commission (FCC), introduced in 1949, that required the holders of broadcast licenses both to present controversial issues of public importance and to do so in a manner that was—in the Commission's view—honest, equitable, and balanced. The FCC eliminated the policy in 1987 and removed the rule that implemented the policy from the Federal Register in August 2011.\n\nhttps://en.wikipedia.org/wiki/Fairness_Doctrine\n\nWhat would the benefits and costs be if the FCC / US were to establish this rule for media companies once again?  Would or could this possibly address the issues at hand?\n\nhttps://www.huffingtonpost.com/nancy-graham-holm/bring-back-the-fairness-d_1_b_4775492.html\nhttp://www.heritage.org/government-regulation/report/why-the-fairness-doctrine-anything-fair\n\n\n",
        "created_utc": 1509994896,
        "upvote_ratio": ""
    },
    {
        "title": "How does it affect the national conversation on politics when the media and social media publish edited video to cast POTUS in a negative light?",
        "author": "NosuchRedditor",
        "url": "https://www.reddit.com/r/NeutralPolitics/comments/7b6d3g/how_does_it_affect_the_national_conversation_on/",
        "text": "[removed]",
        "created_utc": 1509986930,
        "upvote_ratio": ""
    },
    {
        "title": "Is it legal to try to get hold of illegally obtained documents?",
        "author": "louisphilippe13",
        "url": "https://www.reddit.com/r/NeutralPolitics/comments/7b6blv/is_it_legal_to_try_to_get_hold_of_illegally/",
        "text": "In the [Papadopoulos affidavit](https://www.lawfareblog.com/document-george-papadopoulos-criminal-complaint-and-affidavit) Papadopoulos indicates he was interested in meeting the foreign contact because of the possibility of getting access to the Clinton emails:\n\n&gt; PAPADOPOULOS told the Agents that, in the early part of 2016, Foreign Contact 1 \"actually told me that the Russians had emails of Clinton. That guy told me.\" PAPADOPOULOS further stated that Foreign Contact I told him that the Russians \"have dirt on her\" meaning Clinton, and that \"they have thousands of emails.\"\n\nNow there has been no evidence so far that this was actually true, or that Papadopoulos went any further in trying to obtain the emails.\n\nBut let us say that Papadopoulos did actually try to obtain emails that the Russians had illegally hacked from the Democrats. Would this be illegal?\n\nRelated to this -- last March journalist David Clay Johnston claimed to [find a Trump tax return in his mailbox and then he went with public with it](https://www.politico.com/story/2017/03/david-cay-johnson-trump-tax-return-236084). What is the legality of this? Is it legal to publish someone else's tax return? Would it have been illegal if Johnston had solicited the document in someway (as opposed to just finding it in his mailbox without asking for it)?\n\nThe general form of my question is this. If document X is supposed to be private (an email, a tax return, etc), it is obviously illegal for person Y to obtain it. But at what point does it become legal for person Z to obtain it from Y? Or for person W to obtain it from Z who obtained it from Y? Is legal so long as Z has plausible deniability that they were not actually participating in the original illegal act of obtaining the private document?\n\n\n\n",
        "created_utc": 1509986581,
        "upvote_ratio": ""
    },
    {
        "title": "New York State Constitutional Convention.",
        "author": "bossk538",
        "url": "https://www.reddit.com/r/NeutralPolitics/comments/7b5ft0/new_york_state_constitutional_convention/",
        "text": "[removed]",
        "created_utc": 1509978411,
        "upvote_ratio": ""
    },
    {
        "title": "Can we back up a few steps? What happened during the American elections?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/NeutralPolitics/comments/7b579y/can_we_back_up_a_few_steps_what_happened_during/",
        "text": "[removed]",
        "created_utc": 1509975870,
        "upvote_ratio": ""
    },
    {
        "title": "How sound is the assertion that any particular act of violence is at its core a \"mental health issue\"?",
        "author": "DianneReams",
        "url": "https://www.reddit.com/r/NeutralPolitics/comments/7b4w0v/how_sound_is_the_assertion_that_any_particular/",
        "text": "\nFollowing the shooting in Las Vegas, the President [said of the shooter](http://www.independent.co.uk/news/world/americas/stephen-paddock-donald-trump-las-vegas-sick-demented-man-shooter-terrorist-latest-a7980686.html), \n&gt; \"He was a sick man, a demented man, a lot of problems, I guess. And we're looking into him very, very seriously, but we're dealing with a very, very sick individual.\"\n\nAnd yesterday, after the shooting in Texas, President Trump [commented](https://www.theguardian.com/us-news/2017/nov/06/this-isnt-a-guns-situation-says-trump-after-texas-church-shooting)\n&gt;“We have a lot of mental health problems in our country, as do other countries, but this isn’t a guns situation …  This is a mental health problem at the highest level.\"\n\nResearchers Wehring and Carpenter in [*The Journal of Psychoses and Related Disorders*](https://academic.oup.com/schizophreniabulletin/article/37/5/877/1911614) agree that \"In public perception, schizophrenia is often associated with violence,\" but I am unaware of any informed psychiatric position that attributes acts of mass violence such as shootings to observable pathology. Are there any? \n\nIs there a sound factual basis for the President to assert that mass shootings are \"mental health\" issues?",
        "created_utc": 1509972174,
        "upvote_ratio": ""
    },
    {
        "title": "What are the possible outcomes to the Mueller investigation to the Trump administration?",
        "author": "Divergent99",
        "url": "https://www.reddit.com/r/NeutralPolitics/comments/7b2j8k/what_are_the_possible_outcomes_to_the_mueller/",
        "text": "[removed]",
        "created_utc": 1509938563,
        "upvote_ratio": ""
    },
    {
        "title": "Texas Church Shooting",
        "author": "DrewTheHobo",
        "url": "https://www.reddit.com/r/NeutralPolitics/comments/7b2hnc/texas_church_shooting/",
        "text": "[removed]",
        "created_utc": 1509938058,
        "upvote_ratio": ""
    }
]