[
    {
        "title": "What are the main arguments of the #WalkAway movement?",
        "author": "noteral",
        "url": "https://www.reddit.com/r/NeutralPolitics/comments/8wee5m/what_are_the_main_arguments_of_the_walkaway/",
        "text": "[removed]",
        "created_utc": 1530826758,
        "upvote_ratio": ""
    },
    {
        "title": "Why do we not make it easier for immigrants to legally enter the country?",
        "author": "NomadicPolarBear",
        "url": "https://www.reddit.com/r/NeutralPolitics/comments/8waza1/why_do_we_not_make_it_easier_for_immigrants_to/",
        "text": "[removed]",
        "created_utc": 1530801833,
        "upvote_ratio": ""
    },
    {
        "title": "Unaccompanied immigrant minors having to represent themselves in immigration court.",
        "author": "irpwnz0rz",
        "url": "https://www.reddit.com/r/NeutralPolitics/comments/8wa9kg/unaccompanied_immigrant_minors_having_to/",
        "text": "Unaccompanied immigrant minors have to represent themselves in immigration court throughout the deportation proceedings, and it seems to have been happening for a while [Source](https://www.usatoday.com/story/news/nation/2018/06/27/immigrant-children-deportation-court/739205002/). They are not entitled to public defenders in civil and immigration court, bar some states, and a child that does not have legal representation is 4 times more likely to receive a removal order [Source](https://www.snopes.com/fact-check/children-immigration-court-deportation-attorney/)\n\n\n\nCould a young child effectively represent themself?\n\nWhat benefit would be derived from providing all minors legal representation throughout immigration proceedings, and what would the likely cost be?\n\nHow many children are likely incorrectly deported due to an incorrectly presented case?\n\nAre there any laws or protocols this policy could be breaking? The second source mentions a couple of lawsuits that have been rejected on jurisdictional grounds. Do these have any merit?",
        "created_utc": 1530795781,
        "upvote_ratio": ""
    },
    {
        "title": "Why aren't there court-like hearings in political discourse?",
        "author": "yuropperson",
        "url": "https://www.reddit.com/r/NeutralPolitics/comments/8w9xg9/why_arent_there_courtlike_hearings_in_political/",
        "text": "[removed]",
        "created_utc": 1530792525,
        "upvote_ratio": ""
    },
    {
        "title": "Grandfather clause in Assault Weapons Ban 2018",
        "author": "charliekaufman58",
        "url": "https://www.reddit.com/r/NeutralPolitics/comments/8w9cz3/grandfather_clause_in_assault_weapons_ban_2018/",
        "text": "https://www.congress.gov/bill/115th-congress/house-bill/5087/text\nThis is the text of the bill that aims to reestablish the ban that was in effect from 1994 to 2004.\nThere is also a grandfather clause in there, protecting weapons bought before the bill's signing.\nDoes this grandfather clause cease to exist once the original owner dies? Is it explicitly said in the text what happens then? Or is it unclear? I read the bill and couldn't find the answer.",
        "created_utc": 1530785980,
        "upvote_ratio": ""
    },
    {
        "title": "Denaturalization in the United States",
        "author": "KanyeImpressed",
        "url": "https://www.reddit.com/r/NeutralPolitics/comments/8w87j9/denaturalization_in_the_united_states/",
        "text": "**TLDR: How have we gotten from Justice Black's rejection of \"fleeting citizenship\" to the current set of laws being enforced by the USCIS?** \n\n[The USCIS has started a denaturalization task force](https://www.wnycstudios.org/story/uscis-starting-denaturalization-task-force/) with the intent of finding \"U.S. citizens they say should not have been naturalized, to revoke their citizenship, and then eventually deport them.\"\n\nAs I understand it, and please correct me if I'm wrong, but [*Trop v. Dulles,* 356 U.S. 86 (1958)](https://www.oyez.org/cases/1956/70), has yet to be overturned. Within the case, section 401(g) of the amended 1940 Nationality Act (which authorized the expatriation of Albert L. Trop after he was convicted for desertion during wartime) was found unconstitutional on 8th Amendment grounds, thus implying that a person can't have their citizenship revoked from them as punishment for a crime.\n\nEarlier in that year though [*Perez v. Brownell*, 356 US 44 (1958)](https://www.oyez.org/cases/1957/44) affirmed that Congress did have the right to revoke a native-born American of their citizenship, especially given the circumstances of the case (as Clemente Perez didn't abide by the Selective Service laws in place during WWII, and also spent much of his life in his ancestral home of Mexico, even voting in Mexican elections).\n\nHowever, 9 years later in [*Afroyim v. Rusk*, 387 U.S. 253 (1967)](https://www.oyez.org/cases/1966/456), which has yet to be overturned, the Court reversed *Perez* in a 6-4 opinion, where Justice Hugo Black, writing for the majority, said the following: \n\n&gt;All persons born or naturalized in the United States ... are citizens of the United States....\" There is no indication in these words of a fleeting citizenship, good at the moment it is acquired but subject to destruction by the Government at any time. Rather the Amendment can most reasonably be read as defining a citizenship which a citizen keeps unless he voluntarily relinquishes it. Once acquired, this Fourteenth Amendment citizenship was not to be shifted, canceled, or diluted at the will of the Federal Government, the States, or any other governmental unit.\n\nHOWEVER, despite all of this, the USCIS states on [their official website](https://www.uscis.gov/policymanual/HTML/PolicyManual-Volume12-PartL-Chapter2.html), that a person can be stripped of their citizenship if a person either \"Procures Naturalization Illegally\", during the naturalization process \"misrepresents or conceals some fact ... willfully\", \"becomes a member of, or affiliated with, the Communist party, other totalitarian party, or terrorist organization within five years of his or her naturalization\", or dissociates from the US Military for any reason \"other than Honorable Discharge before Five Years of Honorable Service after Naturalization\" (if that person had naturalized on the basis of honorable service to the US armed forces).\n\nThere are a few links on the website, but it's 2 AM and I won't lie, I'm really struggling to understand the disconnect between the law and these court cases. If anybody could please tell me what's going on here I'd really appreciate it. Were any of these court cases overturned? Was no case overturned fully, but was Justice Black's interpretation of the 14th Amendment severely diminished by another legal rule put forward by a future case? Are lower court judges refusing to uphold these cases?\n\nThanks for your time.",
        "created_utc": 1530771191,
        "upvote_ratio": ""
    },
    {
        "title": "Hi r/NeutralPolitics! I’m a 26 year old American female who wants to learn more.",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/NeutralPolitics/comments/8w5o9e/hi_rneutralpolitics_im_a_26_year_old_american/",
        "text": "[removed]",
        "created_utc": 1530744145,
        "upvote_ratio": ""
    },
    {
        "title": "Does our Constitution allow President Trump to use a new constitutional convention to transform America?",
        "author": "RomanNumeralVI",
        "url": "https://www.reddit.com/r/NeutralPolitics/comments/8w3hcm/does_our_constitution_allow_president_trump_to/",
        "text": "[removed]",
        "created_utc": 1530725941,
        "upvote_ratio": ""
    },
    {
        "title": "Are there any strictly neutral news media sites that are reliable?",
        "author": "rubychoco99",
        "url": "https://www.reddit.com/r/NeutralPolitics/comments/8w2xvs/are_there_any_strictly_neutral_news_media_sites/",
        "text": "[removed]",
        "created_utc": 1530721805,
        "upvote_ratio": ""
    },
    {
        "title": "How much control does China have over Hong Kong?",
        "author": "MrOaiki",
        "url": "https://www.reddit.com/r/NeutralPolitics/comments/8w0o2z/how_much_control_does_china_have_over_hong_kong/",
        "text": "On the [1 July 1997](https://en.m.wikipedia.org/wiki/Transfer_of_sovereignty_over_Hong_Kong?wprov=sfti1), China got Hong Kong back from British rule.\n\nChina has since spoken about [“one country, two systems”](https://en.m.wikipedia.org/wiki/One_country,_two_systems?wprov=sfti1). But [many say](https://www.theguardian.com/world/2017/mar/21/hong-kong-china-authoritarian-democracy-one-country-two-systems) that Beijing is slowly but surely tightening their powers over Hong Kong.\n\nIs it known how China’s secret police operate in Hong Kong? Is China’s long term goal known? Are there examples of China allowing unlimited criticism of the regime, only because the critic happens to be located in Hong Kong?",
        "created_utc": 1530700529,
        "upvote_ratio": ""
    },
    {
        "title": "Is it true or false that immigrants do jobs most Americans won't?",
        "author": "MotherHolle",
        "url": "https://www.reddit.com/r/NeutralPolitics/comments/8vx487/is_it_true_or_false_that_immigrants_do_jobs_most/",
        "text": "I read a [paper](https://cis.org/Are-There-Really-Jobs-Americans-Wont-Do) from 2013 today which argues that \"there really are no jobs that Americans won't do\":\n\n&gt;This analysis tests the often-made argument that immigrants do only jobs Americans don't want. If the argument is correct, there should be occupations comprised entirely or almost entirely of immigrants (legal and illegal). But Census Bureau data collected from 2009 to 2011, which allows for detailed analysis of all 472 separate occupations, shows that there were only a handful of majority-immigrant occupations. Thus, there really are no jobs that Americans won't do. Further, we estimated the share of occupations that are comprised of illegal immigrants, and found that there are no occupations in which the majority of workers are illegally in the country.\n\nI have often heard the contention that immigrants do jobs Americans won't, but some articles, such as the aforementioned one quoted in the previous paragraph, say that this is largely a myth, similar to how the notion that \"immigrants *take* our jobs\" is [said by some](http://www.seiu.org/cards/the-8-worst-myths-about-immigration) to be a myth.\n\nThe pieces linked below, however, seem to show that, perhaps, there is some truth to the idea that Americans won't do certain jobs (although, these articles are generally specific to California and Georgia):\n\n[California Crops Rot as Immigration Crackdown Creates Farmworker Shortage](http://fortune.com/2017/08/08/immigration-worker-shortage-rotting-crops/)\n\n[$13 Million in Crops Rotted in Calif. Because No One Wanted to Pick Them?](http://www.politifact.com/punditfact/statements/2017/jul/24/blog-posting/13-million-crops-rotted-calif-because-no-one-wante/)\n\n[California’s Farms Face Serious Labor Shortage](https://www.nbcnews.com/nightly-news/video/california-s-farms-face-serious-labor-shortage-1007177795804)\n\n[The Law Of Unintended Consequences: Georgia's Immigration Law Backfires](https://www.forbes.com/sites/realspin/2012/05/17/the-law-of-unintended-consequences-georgias-immigration-law-backfires/#2fc04b92492a)\n\n**Finally:**\n\nFollowing the above, there are roughly two perspectives on this issue. The first is that there is an idea that [immigration potentially costs Americans jobs](https://www.politico.com/magazine/story/2016/09/trump-clinton-immigration-economy-unemployment-jobs-214216), and what we have been seeing is [the response](https://www.nationalreview.com/news/trump-administration-cracks-down-on-parents-entering-country-illegally-with-their-children/).  The wild card in this argument, based on the available evidence, is whether Americans are willing to do these jobs at the wages paid or offered, or at all.\n\nBrad Goehring, a fourth-generation farmer, [tested](http://www.latimes.com/projects/la-fi-farms-immigration/) the hypothesis of whether a higher agricultural wage would get Americans to do these jobs. Even that, at least in his case, was not wholly sufficient to accomplish such:\n\n&gt;In the last five years, he has advertised in local newspapers and accepted more than a dozen unemployed applicants from the state’s job agency. Even when the average rate on his fields was $20 an hour, the U.S.-born workers lost interest, fast.  \n&gt;  \n&gt;“We’ve never had one come back after lunch,” he says.",
        "created_utc": 1530662509,
        "upvote_ratio": ""
    },
    {
        "title": "Is it true or false that immigrants do jobs most Americans won't?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/NeutralPolitics/comments/8vvfex/is_it_true_or_false_that_immigrants_do_jobs_most/",
        "text": "[removed]",
        "created_utc": 1530648795,
        "upvote_ratio": ""
    },
    {
        "title": "What's ICE's role with respect to Customs?",
        "author": "hrlngrv",
        "url": "https://www.reddit.com/r/NeutralPolitics/comments/8vvaaw/whats_ices_role_with_respect_to_customs/",
        "text": "[removed]",
        "created_utc": 1530647699,
        "upvote_ratio": ""
    },
    {
        "title": "What are the arguments for and against including a fundamental right to vote in the Constitution?",
        "author": "redblazingdragon",
        "url": "https://www.reddit.com/r/NeutralPolitics/comments/8vv6h4/what_are_the_arguments_for_and_against_including/",
        "text": "Currently, nothing of the sort exists.  United States citizens cannot be discriminated against on the basis of [race](https://constitutioncenter.org/interactive-constitution/amendments/amendment-xv), [sex](https://constitutioncenter.org/interactive-constitution/amendments/amendment-xix) and cannot be denied the vote by [eighteen](https://constitutioncenter.org/interactive-constitution/amendments/amendment-xxvi), but the Constitution does not explicitly outline the right as fundamental.  Due to this legal reality, 6.1 million Americans remain [disenfranchised](https://www.sentencingproject.org/publications/6-million-lost-voters-state-level-estimates-felony-disenfranchisement-2016/) and [photo ID](https://www.oyez.org/cases/2007/07-21) requirements for voting are not unconstitutional.  Most other [advanced democracies](http://archive.fairvote.org/media/rtv/kirshner.pdf) have this right explicitly laid out in their constitutions.       \n\nAn article opposing the [amendment](http://theweek.com/articles/442548/big-problem-righttovote-constitutional-amendment).  Basically, if the text of Fairvote’s proposed amendment doesn’t explicitly prohibit draconian voter ID laws or at least ensure automatic voter registration, then no one can be sure if the Supreme Court will still rule against voter ID laws, thus rendering this Amendment unnecessary.  ",
        "created_utc": 1530646878,
        "upvote_ratio": ""
    },
    {
        "title": "Is it reasonable to support term limits for Congress?",
        "author": "Boojy46",
        "url": "https://www.reddit.com/r/NeutralPolitics/comments/8vrxwm/is_it_reasonable_to_support_term_limits_for/",
        "text": "[removed]",
        "created_utc": 1530622307,
        "upvote_ratio": ""
    },
    {
        "title": "Is it reasonable to support term limits in Congress and are there any unanticipated consequences if the limits were enacted?",
        "author": "Boojy46",
        "url": "https://www.reddit.com/r/NeutralPolitics/comments/8vrog9/is_it_reasonable_to_support_term_limits_in/",
        "text": "[removed]",
        "created_utc": 1530619804,
        "upvote_ratio": ""
    },
    {
        "title": "Is the presence of SJWs on the left exaggerated by the right?",
        "author": "1_7_7_6",
        "url": "https://www.reddit.com/r/NeutralPolitics/comments/8vqw4k/is_the_presence_of_sjws_on_the_left_exaggerated/",
        "text": "[removed]",
        "created_utc": 1530610769,
        "upvote_ratio": ""
    },
    {
        "title": "What Are the Merits of cutting Sales Tax instead of Income Tax as growth initiative?",
        "author": "Trumpologist",
        "url": "https://www.reddit.com/r/NeutralPolitics/comments/8voyra/what_are_the_merits_of_cutting_sales_tax_instead/",
        "text": "The Tax foundation found that cutting sales tax only for a few days (this can range from 1 day to up to a week), like most states which have a sales tax holiday do, doesn't massively increase consumption spending, instead it just reshuffles it.\n\nhttps://files.taxfoundation.org/20170725133940/Tax-Foundation-SR236.pdf\n\nThe Fed found a similar result, during the tax holiday the consumption spending increase. But long term increase in Consumption aren't as clear\n\nhttps://www.federalreserve.gov/econres/notes/feds-notes/effect-of-sales-tax-holidays-on-consumer-spending-20170324.htm\n\n5 States currently have no sales tax. There isn't a strong ideological/political correlation. (Montana, Alaska tend to be republican states. Oregon, Delaware, tend to be democrat states. And New Hampshire is a perennial swing state)\n\nhttps://www.270towin.com/historical-presidential-elections/\n\nhttps://www.fool.com/taxes/2014/08/16/the-5-states-with-no-sales-tax.aspx\n\nWhat are the merits and cons of the government cutting sales tax instead of income tax year round to increase economic growth since consumption spending is the largest driver of GDP?\n\nhttps://seekingalpha.com/article/3961283-private-consumption-main-driver-americas-gdp-growth\n\nEx. one idea might be making sales tax deductible from federal income tax, this might motivate people to spend more of their income to in effect keep more of their income",
        "created_utc": 1530588495,
        "upvote_ratio": ""
    },
    {
        "title": "Is the addition of $1 trillion to the national debt in 14 months under Trump cause for concern, or par for the course?",
        "author": "MotherHolle",
        "url": "https://www.reddit.com/r/NeutralPolitics/comments/8vou5b/is_the_addition_of_1_trillion_to_the_national/",
        "text": "Today, I read an [article](https://www.washingtontimes.com/news/2018/mar/15/donald-trump-adds-1-trillion-national-debt-14-mont/) from March 15, 2018 which stated that:\n\n&gt;President Trump has now amassed his first $1 trillion in debt, crossing that ignominious mark late last week — and analysts said it’s just a taste of what’s to come after the tax-cuts and spending spree of recent months.\n\nTo put this into [some context](http://www.businessinsider.com/national-debt-deficit-added-under-president-barack-obama-2017-1), under President Obama, the national debt grew:\n\n&gt;...by about $9 trillion, or an increase of 86&amp;#37;.\n\n(Of course, that was in 8 or so years.)\n\nGiven those numbers, is the debt increasing roughly $1 trillion in 14 months under President Trump exceptional or a bad sign, or is it relatively normal in our modern economy? Keeping in mind, of course, that President Obama inherited an economy that was seemingly in [bad shape](https://www.nbcnews.com/storyline/president-obama-the-legacy/eight-years-later-economy-president-obama-s-legacy-n703616) and President Trump inherited one in [arguably healthier condition](https://www.statesmanjournal.com/story/opinion/columnists/ron-eachus/2017/02/21/obama-inherited-recession-trump-inherited-primed-pump/98201378/).\n\nAs a final aside, an [article](https://www.snopes.com/fact-check/national-debt-trump/) from last year stated that the national debt had fallen by $102 billion since Trump's inauguration; much has changed since then, but it's still interesting to me in light of the above.\n\n&gt;We have checked these numbers and set them in context, and found that the national debt did indeed fall by $102 billion between 20 January and the end of July 2017. This decline is also historically remarkable, in both absolute and percentage terms. This six-month fall in the national debt is also significant when measured against the size of the overall economy.\n\n(I'm looking for an economic/historical perspective for comparison, which I feel could be answered factually.)",
        "created_utc": 1530587235,
        "upvote_ratio": ""
    },
    {
        "title": "Has any part of the Steele dossier been conclusively disproven?",
        "author": "johnly81",
        "url": "https://www.reddit.com/r/NeutralPolitics/comments/8vohwu/has_any_part_of_the_steele_dossier_been/",
        "text": "[removed]",
        "created_utc": 1530584064,
        "upvote_ratio": ""
    },
    {
        "title": "What evidence is there for and against the idea that modern Latin American instability stems from CIA interference?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/NeutralPolitics/comments/8vloyl/what_evidence_is_there_for_and_against_the_idea/",
        "text": "[removed]",
        "created_utc": 1530561236,
        "upvote_ratio": ""
    },
    {
        "title": "Is Trump adding $1 trillion to the debt in 14 months cause for concern, or par for the course?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/NeutralPolitics/comments/8vkdf0/is_trump_adding_1_trillion_to_the_debt_in_14/",
        "text": "[removed]",
        "created_utc": 1530551631,
        "upvote_ratio": ""
    },
    {
        "title": "Has Israel committed war crimes in Gaza?",
        "author": "1cqZq54pZ32PJTb4",
        "url": "https://www.reddit.com/r/NeutralPolitics/comments/8vk5be/has_israel_committed_war_crimes_in_gaza/",
        "text": "[removed]",
        "created_utc": 1530550035,
        "upvote_ratio": ""
    },
    {
        "title": "What Are the Merits of cutting Sales Tax instead of Income Tax as growth initiative?",
        "author": "Trumpologist",
        "url": "https://www.reddit.com/r/NeutralPolitics/comments/8vfxrn/what_are_the_merits_of_cutting_sales_tax_instead/",
        "text": "[removed]",
        "created_utc": 1530506651,
        "upvote_ratio": ""
    },
    {
        "title": "The Obama Legacy Impact",
        "author": "mancala33",
        "url": "https://www.reddit.com/r/NeutralPolitics/comments/8vdix1/the_obama_legacy_impact/",
        "text": "[removed]",
        "created_utc": 1530483022,
        "upvote_ratio": ""
    },
    {
        "title": "How can flawed democracy, especially in developing countries, be avoided?",
        "author": "TheFallenHero",
        "url": "https://www.reddit.com/r/NeutralPolitics/comments/8vdicx/how_can_flawed_democracy_especially_in_developing/",
        "text": "[removed]",
        "created_utc": 1530482897,
        "upvote_ratio": ""
    },
    {
        "title": "Which, if any, political groups have aligned themselves with the Democratic party, but their ideologies have been denounced by the party's leadership?",
        "author": "mirroredfate",
        "url": "https://www.reddit.com/r/NeutralPolitics/comments/8vc38k/which_if_any_political_groups_have_aligned/",
        "text": "Nazi and fascist groups frequently [associate themselves](https://www.politico.com/story/2018/06/29/arthur-jones-nazi-illinois-republicans-686875) with the Republican party (at least significantly more often than the Democratic party). Despite some recent rhetoric, these groups' ideologies are decried by the mainstream Republican leadership [1](https://www.independent.co.uk/news/world/americas/us-politics/racist-republican-russell-walker-god-gop-white-supremacist-antisemitism-jewish-satan-north-carolina-a8421861.html) [2](https://www.theguardian.com/us-news/2017/aug/15/donald-trump-charlottesville-republicans-react-bigotry) [3](https://gop.com/platform/we-the-people/).\n\nWhat (if any) similar examples exists for the left, where political groups align themselves with the Democratic party but their ideologies are decried by party leadership?\n\nThis question is about the denunciation of the group's ideology, rather than it's actions; i.e., examples of denouncing violent action isn't the same as denouncing the underlying ideology.",
        "created_utc": 1530471012,
        "upvote_ratio": ""
    },
    {
        "title": "When Trump states \"Our laws are the dumbest in the world\", is he implying the Constitution?",
        "author": "Mythbusters117",
        "url": "https://www.reddit.com/r/NeutralPolitics/comments/8va0z2/when_trump_states_our_laws_are_the_dumbest_in_the/",
        "text": "[removed]",
        "created_utc": 1530453174,
        "upvote_ratio": ""
    },
    {
        "title": "I know this is a slightly controversial topic but what is the evidence that the holocaust numbers were inflated/the conditions made to seem worse vs proof of the 6 million dead and terrible conditions.",
        "author": "throwawaymydude123",
        "url": "https://www.reddit.com/r/NeutralPolitics/comments/8v78wp/i_know_this_is_a_slightly_controversial_topic_but/",
        "text": "[removed]",
        "created_utc": 1530416140,
        "upvote_ratio": ""
    },
    {
        "title": "Racism and fascism are two example of ideologies associated with the \"right\" that are decried from the mainstream \"right\". What are their equivalent ideologies on the \"left\"?",
        "author": "mirroredfate",
        "url": "https://www.reddit.com/r/NeutralPolitics/comments/8v74qo/racism_and_fascism_are_two_example_of_ideologies/",
        "text": "[removed]",
        "created_utc": 1530414859,
        "upvote_ratio": ""
    },
    {
        "title": "Are any Republicans accepting the precedent they set in waiting for after the election to confirm a SC judge?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/NeutralPolitics/comments/8v6udr/are_any_republicans_accepting_the_precedent_they/",
        "text": "[removed]",
        "created_utc": 1530411603,
        "upvote_ratio": ""
    },
    {
        "title": "What are the arguments for and against abolishing the Immigration and Customs and Enforcement agency (ICE)?",
        "author": "nosecohn",
        "url": "https://www.reddit.com/r/NeutralPolitics/comments/8v5u42/what_are_the_arguments_for_and_against_abolishing/",
        "text": "[Immigration and Customs Enforcement](https://en.wikipedia.org/wiki/U.S._Immigration_and_Customs_Enforcement) (ICE) is a U.S. law enforcement agency that was formed in 2002 by combining several border and revenue enforcement agencies under the newly established Department of Homeland Security. Its [mission](https://www.ice.gov/about) is to enforce federal laws governing border control, customs, trade and immigration to promote homeland security and public safety.\n\n\nRecently, some Democratic candidates have [laid out arguments](https://www.thenation.com/article/its-time-to-abolish-ice/) for abolishing the agency and a number of others have [gotten behind the idea.](http://www.chicagotribune.com/news/nationworld/politics/ct-democrats-ice-analysis-20180624-story,amp.html) Here's a [full explainer.](https://www.vox.com/policy-and-politics/2018/3/19/17116980/ice-abolish-immigration-arrest-deport)\n\nPresident Trump, on the other hand, has [strongly supported ICE and said there's \"zero chance\" of abolishing it.](http://thehill.com/homenews/administration/394950-trump-blasts-dem-push-to-abolish-ice-zero-chance)\n\nWhat are the strongest arguments for and against abolishing the agency? Assuming the US wants to maintain some means of enforcement for immigration and customs laws, what proposals have been put forth to take over the mission of ICE if it were to be abolished?\n",
        "created_utc": 1530401071,
        "upvote_ratio": ""
    },
    {
        "title": "Are globalism and nationalism truly opposing forces or can they be balanced?",
        "author": "RaptorSpade1296",
        "url": "https://www.reddit.com/r/NeutralPolitics/comments/8v5a4y/are_globalism_and_nationalism_truly_opposing/",
        "text": "People can travel [more] (https://www.nationalgeographic.com/environment/urban-expeditions/transportation/air-travel-fuel-emissions-environment/) and find opportunities in other parts of the world. Social media has allowed [issues] (https://www.bbc.com/news/world-us-canada-35948362) that would have been ignored in the past take center stage. Globalization has led to a few benefits including\n\n\n- Increased access to [products] (https://www.manyakoetse.com/from-big-mac-to-rice-burger-globalization-mcdonalds-in-japan/) from other cultures and nations\n\n\n- Increased immigration can solve problems with an [aging] (https://www.cnn.com/2017/08/01/asia/japan-migrants-immigration/index.html) population\n\n\nHowever there are some drawbacks which include\n\n\n- Has put many of the of the [welfare] (https://www.economist.com/the-economist-explains/2017/06/23/how-immigration-is-changing-the-swedish-welfare-state) states of developed nations at risk\n\n\n- Has hastened the [decline] (https://www.globalpolicy.org/component/content/article/162/27558.html) of indigenous cultures to a global consumerist behemoth\n\n\nGlobalization and its effects have become [contentious] (http://www.newsweek.com/2016/07/08/britain-brexit-wounds-european-nationalism-475101.html) talking points that have driven course of the last few [elections] ( https://www.bbc.com/news/world-europe-36130006) across the Europe. There is a new debate between globalism vs nationalism. Some see nationalism as essential to protecting a nation's core identity while others see globalization as the key to dealing with global issues like climate change. \n\n\n- https://www.wsj.com/articles/nationalism-vs-globalism-a-question-of-balance-1516632996\n\n\n\nWhat are the pros and cons of balancing globalization and national interests and what methods have proven effective at striking that balance?\n\n",
        "created_utc": 1530395825,
        "upvote_ratio": ""
    },
    {
        "title": "Is there a rational argument for abolishing ICE?",
        "author": "balloot",
        "url": "https://www.reddit.com/r/NeutralPolitics/comments/8v4hve/is_there_a_rational_argument_for_abolishing_ice/",
        "text": "[removed]",
        "created_utc": 1530388711,
        "upvote_ratio": ""
    },
    {
        "title": "How should globalization and national sovereignty/cultural identity be balanced?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/NeutralPolitics/comments/8v4huk/how_should_globalization_and_national/",
        "text": "[removed]",
        "created_utc": 1530388705,
        "upvote_ratio": ""
    },
    {
        "title": "Have previous tariffs had a positive or negative effect on the United State's economy?",
        "author": "geordilaforge",
        "url": "https://www.reddit.com/r/NeutralPolitics/comments/8v1isf/have_previous_tariffs_had_a_positive_or_negative/",
        "text": "[removed]",
        "created_utc": 1530361692,
        "upvote_ratio": ""
    },
    {
        "title": "Do US Federal and State Governments Turn a Profit?",
        "author": "the_dark_throne",
        "url": "https://www.reddit.com/r/NeutralPolitics/comments/8ux1nx/do_us_federal_and_state_governments_turn_a_profit/",
        "text": "Is there a way for us to track income vs. expenses for the federal and state governments?\n\nMy naive understanding is that when the government reduces its income but its expenses stay constant, deficits will occur unless the income is substantially bigger than the expenses. \n\nI \\[have found reports on federal tax income\\]([https://www.thebalance.com/current-u-s-federal-government-tax-revenue-3305762](https://www.thebalance.com/current-u-s-federal-government-tax-revenue-3305762)) and \\[some reports on federal expenses\\]([https://www.nationalpriorities.org/budget-basics/federal-budget-101/spending/](https://www.nationalpriorities.org/budget-basics/federal-budget-101/spending/)), but is there a report I can use to see the income and expenses of the federal and state governments to determine what the difference is? ",
        "created_utc": 1530309365,
        "upvote_ratio": ""
    },
    {
        "title": "Who do you think should be given asylum at the border? Should anyone escaping poor social or economic conditions be welcomed into the United States? Or only those fleeing war or direct religious or racial persecution, etc? Some other criteria?",
        "author": "MeatwadMakeTheMoney",
        "url": "https://www.reddit.com/r/NeutralPolitics/comments/8uwp2k/who_do_you_think_should_be_given_asylum_at_the/",
        "text": "[removed]",
        "created_utc": 1530306493,
        "upvote_ratio": ""
    },
    {
        "title": "If questions related to Donald Trump's finances came before the supreme court, would Justice Kennedy be legally compelled to recuse himself?",
        "author": "Echuck215",
        "url": "https://www.reddit.com/r/NeutralPolitics/comments/8uw2p2/if_questions_related_to_donald_trumps_finances/",
        "text": "[removed]",
        "created_utc": 1530301674,
        "upvote_ratio": ""
    },
    {
        "title": "Would Justice Kennedy have to recuse himself if questions of Donald Trump's finances came before the Supreme Court?",
        "author": "Echuck215",
        "url": "https://www.reddit.com/r/NeutralPolitics/comments/8uvzkx/would_justice_kennedy_have_to_recuse_himself_if/",
        "text": "[removed]",
        "created_utc": 1530301017,
        "upvote_ratio": ""
    },
    {
        "title": "How can undocumented immigrants be subject to criminal proceedings for crossing the border, which is a civil offense?",
        "author": "cptaixel",
        "url": "https://www.reddit.com/r/NeutralPolitics/comments/8uuamr/how_can_undocumented_immigrants_be_subject_to/",
        "text": "In several articles such as this one: [http://thehill.com/latino/394782-protests-against-trump-immigration-policy-expected-nationwide](http://thehill.com/latino/394782-protests-against-trump-immigration-policy-expected-nationwide)\n\nThere are several references to \"criminal prosecution\" for border crossing.  But illegal entry (or improper entry) into an US border carries a civil  penalty. The amount is at least $50 and not more than $250 or twice that  amount, if the person has been previously fined with a civil penalty  for the same violation. (See 8 U.S.C. Section 1325, I.N.A. Section 275.) ",
        "created_utc": 1530288318,
        "upvote_ratio": ""
    },
    {
        "title": "What are the arguments for and against the United States leaving the World Trade Organization?",
        "author": "crazyguzz1",
        "url": "https://www.reddit.com/r/NeutralPolitics/comments/8utqkf/what_are_the_arguments_for_and_against_the_united/",
        "text": "Today, [Axios published a report](https://www.axios.com/trump-threat-withdraw-wto-world-trade-organization-f6ca180e-47d6-42aa-a3a3-f3228e97d715.html) saying President Trump has repeatedly complained to his advisers about the World Trade Organization, and often spoke of withdrawing:\n\n&gt; “He’s [threatened to withdraw] 100 times. It would totally [screw] us as a country,” said a source who’s discussed the subject with Trump. The source added that Trump has frequently told advisers, \"We always get fucked by them [the WTO]. I don’t know why we’re in it. The WTO is designed by the rest of the world to screw the United States.\"\n\nI would note treasury chief Mnuchin [denies the reporting](https://www.theglobeandmail.com/business/international-business/us-business/article-trump-has-repeatedly-told-staff-he-wants-to-quit-the-wto-report/), but Axios points out out Trump made similar comments during an [NBC Meet the Press interview in 2016](https://www.nbcnews.com/meet-the-press/meet-press-july-24-2016-n615706?utm_source=newsletter&amp;utm_medium=email&amp;utm_campaign=newsletter_axiosam&amp;stream=top):\n\n&gt; \"Then we're going to renegotiate or we're going to pull out. These trade deals are a disaster, Chuck. World Trade Organization is a disaster.\"\n\nTrump cannot pull out of the WTO on his lonesome - it would require an act of congress. From Axios:\n\n&gt; ...the U.S. law implementing the WTO agreements states quite plainly that withdrawal from the WTO requires an act of Congress. \n\nStill, I believe the President floating a withdrawal from the WTO is sufficient to raise the question of the merits of such a move. What are the arguments for and against a US withdrawal form the World Trade Organization?",
        "created_utc": 1530283974,
        "upvote_ratio": ""
    },
    {
        "title": "What is the constitutional reasoning behind opposing gay marriage?",
        "author": "Aidans15",
        "url": "https://www.reddit.com/r/NeutralPolitics/comments/8uqgpd/what_is_the_constitutional_reasoning_behind/",
        "text": "[removed]",
        "created_utc": 1530248134,
        "upvote_ratio": ""
    },
    {
        "title": "Would Trump be able to unilaterally withdraw the US out of NATO without congressional approval?",
        "author": "Madmaxxin",
        "url": "https://www.reddit.com/r/NeutralPolitics/comments/8up9l4/would_trump_be_able_to_unilaterally_withdraw_the/",
        "text": "According to thehill, Trump told world leaders during the G7 meeting, that the alliance was too costly for the US and said it was as bad as NAFTA which he derides as the “worst deal of all time”.\n\nhttp://thehill.com/homenews/administration/394574-trump-told-g-7-leaders-that-nato-is-as-bad-as-nafta-report\n\nHere’s an argument arguing that he can: \nhttps://www.nbcnews.com/think/opinion/donald-trump-can-unilaterally-withdraw-treaties-because-congress-abdicated-responsibility-ncna870866\n\nSo, is this just another brash remark from Trump or does it present a new withdrawal threat?\n\nWould he be able to bypass congress, and withdraw the US unilaterally?",
        "created_utc": 1530236242,
        "upvote_ratio": ""
    },
    {
        "title": "Trump's election victory: Did the facts matter to the voters?",
        "author": "RomanNumeralVI",
        "url": "https://www.reddit.com/r/NeutralPolitics/comments/8up6os/trumps_election_victory_did_the_facts_matter_to/",
        "text": "[removed]",
        "created_utc": 1530235492,
        "upvote_ratio": ""
    },
    {
        "title": "Would South Dakota v. Wayfair, Inc. allow municipalities to tax online retailers as well?",
        "author": "Alt-001",
        "url": "https://www.reddit.com/r/NeutralPolitics/comments/8unhhh/would_south_dakota_v_wayfair_inc_allow/",
        "text": "I had assumed the answer to this question was no, and while I only skimmed the syllabus of the [Supreme Court's statement](https://www.supremecourt.gov/opinions/17pdf/17-494_j4el.pdf) it still seems to me that it only refers to states in the language used. \n\n[This article](https://blog.salesandorders.com/south-dakota-wayfair-ecommerce) seems to imply that municipalities could get in on this as well. As the article points out, while there are 'only' 45 states with sales tax, there are over 15,000 municipalities within the U.S.\n\nFor small ecommerce business owners operating in a national or even international market, it strikes me that a strong case could be made that complying with municipality tax codes would pose an undue burden. There are basically three outcomes that I could see depending on how all of this translates in legalese. Is this something that will now be an option for municipalities, is it clearly only a power granted to states, or has is created ambiguity on the matter leaving the question open?",
        "created_utc": 1530220631,
        "upvote_ratio": ""
    },
    {
        "title": "Is it actually as crazy as it seems?",
        "author": "ChelcJustIs",
        "url": "https://www.reddit.com/r/NeutralPolitics/comments/8umiuk/is_it_actually_as_crazy_as_it_seems/",
        "text": "[removed]",
        "created_utc": 1530213507,
        "upvote_ratio": ""
    },
    {
        "title": "Does the Marijuana Act's establishment of \"dedicated funding\" for \"minority-owned marijuana businesses\" violate the Civil Rights Act's statement that no one in the US shall \"on the ground of race...be subjected to discrimination under any program or activity receiving Federal financial assistance\"?",
        "author": "UltimateSausage",
        "url": "https://www.reddit.com/r/NeutralPolitics/comments/8ulzjr/does_the_marijuana_acts_establishment_of/",
        "text": "As I'm sure many of you are aware, Chuck Schumer has introduced the [Marijuana Freedom and Opportunity Act](https://www.democrats.senate.gov/imo/media/doc/Marijuana%20Freedom%20and%20Opportunity%20Act.pdf). If passed into law, the bill would decriminalize marijuana on the federal level, invest $250 million for research on driving under the influence of THC, invest $500 million for research into the effects of marijuana on the brain, incentivize state governments to set up programs to expunge marijuana convictions from people's records, and subsidize women and minority-owned marijuana businesses. The bill has been supported by Senators Bernie Sanders, Tim Kaine and Tammy Duckworth.\n\nThe part of the bill I would like to discuss is the section on subsidizing women and minority-owned marijuana businesses. According to [the US Senate's summary of the Marijuana Freedom and Opportunity Act](https://www.democrats.senate.gov/newsroom/press-releases/schumer-introduces-marijuana-freedom-and-opportunity-act_-new-legislation-would-decriminalize-marijuana-at-federal-level):\n\n&gt; The legislation would establish dedicated funding streams to be administered by the Small Business Administration (SBA) for women and minority-owned marijuana businesses that would be determinant on a reasonable estimate of the total amount of revenue generated by the marijuana industry\n\nSEC. 601 of the [Civil Rights Act of 1964](https://www.ourdocuments.gov/doc.php?flash=true&amp;doc=97&amp;page=transcript):\n\n&gt; SEC. 601. No person in the United States shall, on the ground of race, color, or national origin, be excluded from participation in, be denied the benefits of, or be subjected to discrimination under any program or activity receiving Federal financial assistance.\n\nSince the establishment of \"dedicated funding streams to be administered by the Small Business Administration (SBA) for women and minority-owned marijuana businesses\" is a \"program or activity receiving Federal financial assistance\", does the program violate SEC. 601 of the Civil Rights Act, which prohibits discrimination based on race in these federally funded programs?",
        "created_utc": 1530209604,
        "upvote_ratio": ""
    },
    {
        "title": "In Supreme Court Justice history, is Anthony Kennedy unique in having so consistently held the deciding swing vote on split bench decisions? What are considered to be the most liberal and conservative positions Kennedy has taken as a Supreme Court Justice?",
        "author": "crazyguzz1",
        "url": "https://www.reddit.com/r/NeutralPolitics/comments/8ulaiu/in_supreme_court_justice_history_is_anthony/",
        "text": "Justice Anthony Kennedy announced [his retirement](https://www.apnews.com/43de809e3c144a1f9048055386394263) on Wednesday.\n\n&gt; Kennedy’s departure will be a major change for the high court, where he has been the crucial swing vote for more than a decade.\n\nBeing the crucial swing vote, Kennedy was considered to hold a lot of power on split bench decisions. Is this unique in Supreme Court history? What are considered to be the most conservative and liberal positions Kennedy has taken during his tenure? ",
        "created_utc": 1530205205,
        "upvote_ratio": ""
    },
    {
        "title": "What are the ramifications of the Supreme Court in recent history and moving into the future?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/NeutralPolitics/comments/8ul78m/what_are_the_ramifications_of_the_supreme_court/",
        "text": "[removed]",
        "created_utc": 1530204616,
        "upvote_ratio": ""
    },
    {
        "title": "What are the ramifications of the Supreme Court in recent history and moving into the future?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/NeutralPolitics/comments/8ul3xl/what_are_the_ramifications_of_the_supreme_court/",
        "text": "[removed]",
        "created_utc": 1530204013,
        "upvote_ratio": ""
    },
    {
        "title": "What are current US trade laws and tariffs based on?",
        "author": "brooks19",
        "url": "https://www.reddit.com/r/NeutralPolitics/comments/8ukfxq/what_are_current_us_trade_laws_and_tariffs_based/",
        "text": "[removed]",
        "created_utc": 1530199624,
        "upvote_ratio": ""
    },
    {
        "title": "Can the current American Republic survive?",
        "author": "PoliticalNerd87",
        "url": "https://www.reddit.com/r/NeutralPolitics/comments/8uicuk/can_the_current_american_republic_survive/",
        "text": "[removed]",
        "created_utc": 1530184444,
        "upvote_ratio": ""
    },
    {
        "title": "[Discussion] want to give credit to the moderators for regulating a set of rules that (thanks to..)the users feel encouraged to follow. It makes every post sound as civil as the one before it, no matter what side debate favors in the end. That is unheard of.",
        "author": "encinitas2252",
        "url": "https://www.reddit.com/r/NeutralPolitics/comments/8ugttk/discussion_want_to_give_credit_to_the_moderators/",
        "text": "[removed]",
        "created_utc": 1530166660,
        "upvote_ratio": ""
    },
    {
        "title": "What's the history behind lifetime appointments for US judges?",
        "author": "Thomasina_ZEBR",
        "url": "https://www.reddit.com/r/NeutralPolitics/comments/8ugpik/whats_the_history_behind_lifetime_appointments/",
        "text": "[removed]",
        "created_utc": 1530165011,
        "upvote_ratio": ""
    },
    {
        "title": "Hello! I'd like a report on the latest happenings across the world and a bit of text explaining how concerned should I be about it.",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/NeutralPolitics/comments/8ugmdj/hello_id_like_a_report_on_the_latest_happenings/",
        "text": "[removed]",
        "created_utc": 1530163809,
        "upvote_ratio": ""
    },
    {
        "title": "Will there be a 2018 Red Wave and will Donald Trump be reelected because of what he calls \"fake news\"? Fact-free elections, pro and cons?",
        "author": "RomanNumeralVI",
        "url": "https://www.reddit.com/r/NeutralPolitics/comments/8ugkxs/will_there_be_a_2018_red_wave_and_will_donald/",
        "text": "[removed]",
        "created_utc": 1530163301,
        "upvote_ratio": ""
    },
    {
        "title": "Distinguishing Between Factual and Opinion Statements in the News: A new Pew Research Center survey - Why members of the public cannot recognize news as factual or not?",
        "author": "RomanNumeralVI",
        "url": "https://www.reddit.com/r/NeutralPolitics/comments/8ufewj/distinguishing_between_factual_and_opinion/",
        "text": "[removed]",
        "created_utc": 1530151136,
        "upvote_ratio": ""
    },
    {
        "title": "is there a subreddit equal in size that's the opposite of /r/The_Donald ?",
        "author": "VeggieLion",
        "url": "https://www.reddit.com/r/NeutralPolitics/comments/8ue9g0/is_there_a_subreddit_equal_in_size_thats_the/",
        "text": "[removed]",
        "created_utc": 1530140736,
        "upvote_ratio": ""
    },
    {
        "title": "What evidence supports and opposes the contention that the Trump Foundation has been self dealing?",
        "author": "NogodsaMan",
        "url": "https://www.reddit.com/r/NeutralPolitics/comments/8ue3iq/what_evidence_supports_and_opposes_the_contention/",
        "text": "Reading [this article](https://www.vanityfair.com/news/2018/06/trump-foundation-lawsuit) about the topic, I found it to be very biased and a bit too based around opinion for me to give it much credit. \n\nHow big of a deal are the accusations when Trump *claims* that the Trump Foundation [apparently has donated to charity more than what was donated to the foundation](https://twitter.com/realdonaldtrump/status/1007278788009480192?lang=en)\n\nDoes this mean that the self dealing was even specifically using donor money, despite it being illegal to use the foundation's name for uses that the allegations describe? That makes me wonder if that extra money was coming directly out of Trump's pocket, or Trump Foundation assets? ",
        "created_utc": 1530139327,
        "upvote_ratio": ""
    },
    {
        "title": "I know this isn’t within the rules BUT....",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/NeutralPolitics/comments/8udtts/i_know_this_isnt_within_the_rules_but/",
        "text": "[removed]",
        "created_utc": 1530137093,
        "upvote_ratio": ""
    },
    {
        "title": "Has anyone been able to verify Mike Huckabee's claim that the owner of the Red Hen \"followed [Sarah Sanders and her party] across the street... and organized a protest yelling and screaming at them...\"?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/NeutralPolitics/comments/8ud6g2/has_anyone_been_able_to_verify_mike_huckabees/",
        "text": "[removed]",
        "created_utc": 1530132165,
        "upvote_ratio": ""
    },
    {
        "title": "Ramifications of the Retirement of Justice Anthony Kennedy",
        "author": "ProfessorPaulKrugman",
        "url": "https://www.reddit.com/r/NeutralPolitics/comments/8ud2fy/ramifications_of_the_retirement_of_justice/",
        "text": "[removed]",
        "created_utc": 1530131344,
        "upvote_ratio": ""
    },
    {
        "title": "What Supreme Court cases not yet argued this term are you following?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/NeutralPolitics/comments/8ud2cd/what_supreme_court_cases_not_yet_argued_this_term/",
        "text": "[removed]",
        "created_utc": 1530131324,
        "upvote_ratio": ""
    },
    {
        "title": "Is the Trump Foundation self dealing as big of a deal as it’s being made out to be?",
        "author": "NogodsaMan",
        "url": "https://www.reddit.com/r/NeutralPolitics/comments/8ucusl/is_the_trump_foundation_self_dealing_as_big_of_a/",
        "text": "[removed]",
        "created_utc": 1530129772,
        "upvote_ratio": ""
    },
    {
        "title": "What precedent is there for a President levying punitive taxes on an individual company such as Harley Davidson?",
        "author": "unkz",
        "url": "https://www.reddit.com/r/NeutralPolitics/comments/8ubufd/what_precedent_is_there_for_a_president_levying/",
        "text": "According to Trump, Harley Davidson will be [taxed like never before](https://www.cnbc.com/2018/06/26/trump-says-harley-davidson-using-trade-tensions-as-an-excuse.html).  This isn't the first time Trump has threatened to tax a specific company, as he [threatened a 35% tax on Ford products made in Mexico](http://money.cnn.com/2016/09/15/news/economy/trump-tariff-ford-mexico/index.html) during the 2016 campaign.  Can or has a President ever punished a company with taxes because he was upset with their behaviour?\n\nOn what basis would this be legal?  What evidence is there that this is or is not a [bill of attainder](https://en.wikipedia.org/wiki/Bill_of_attainder)?  Or is that even a relevant question when targeting a foreign entity, which the overseas part of Harley Davidson could be considered?\n\nEdit: a possible parallel I thought of is the 63% income tax rate which was levied [only on John Rockefeller jr.](http://ideas.time.com/2012/09/18/the-rich-havent-always-hated-taxes/) .  ",
        "created_utc": 1530122527,
        "upvote_ratio": ""
    },
    {
        "title": "I'm looking for the facts about Canadian health Care.",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/NeutralPolitics/comments/8ua5ck/im_looking_for_the_facts_about_canadian_health/",
        "text": "[removed]",
        "created_utc": 1530110438,
        "upvote_ratio": ""
    },
    {
        "title": "Do more liberals believe in man made climate change than conservatives?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/NeutralPolitics/comments/8u7z82/do_more_liberals_believe_in_man_made_climate/",
        "text": "[removed]",
        "created_utc": 1530088809,
        "upvote_ratio": ""
    },
    {
        "title": "Who do you think will have control of the house and senate after the 2018 midterms?",
        "author": "teerexbc",
        "url": "https://www.reddit.com/r/NeutralPolitics/comments/8u6tz7/who_do_you_think_will_have_control_of_the_house/",
        "text": "[removed]",
        "created_utc": 1530075272,
        "upvote_ratio": ""
    },
    {
        "title": "Is the two party system democratic? What are the arguments for and against it?",
        "author": "redblazingdragon",
        "url": "https://www.reddit.com/r/NeutralPolitics/comments/8u69fw/is_the_two_party_system_democratic_what_are_the/",
        "text": "In stark contrast to the United States, [Denmark](https://www.theguardian.com/world/2015/jun/16/danish-election-guide-parties-candidates) utilizes an electoral system that is proportionally representative of its population, but due to other factors mentioned in the source, not one political party has ever attained a majority since 1903 without coalescing with another. However, the [United States](https://www.britannica.com/topic/two-party-system) has only two major parties that can realistically win elections and pass legislation afterward, generally speaking. Voting for a third party amounts to a [protest votes](https://www.pastemagazine.com/articles/2016/10/america-please-wake-up-your-third-party-protest-vo.html).\n\n",
        "created_utc": 1530069545,
        "upvote_ratio": ""
    },
    {
        "title": "How is the Paycheck Fairness Act actually a bad idea?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/NeutralPolitics/comments/8u4f4x/how_is_the_paycheck_fairness_act_actually_a_bad/",
        "text": "[removed]",
        "created_utc": 1530052808,
        "upvote_ratio": ""
    },
    {
        "title": "Was the Turkey Election Free and Fair?",
        "author": "Jswarez",
        "url": "https://www.reddit.com/r/NeutralPolitics/comments/8u1gr1/was_the_turkey_election_free_and_fair/",
        "text": "[removed]",
        "created_utc": 1530030883,
        "upvote_ratio": ""
    },
    {
        "title": "What are the most recent updates of the whole immigration reform?",
        "author": "angelajohnson4",
        "url": "https://www.reddit.com/r/NeutralPolitics/comments/8u15fe/what_are_the_most_recent_updates_of_the_whole/",
        "text": "[removed]",
        "created_utc": 1530028628,
        "upvote_ratio": ""
    },
    {
        "title": "What happens now with the \"Travel Ban\"?",
        "author": "AFlaccoSeagulls",
        "url": "https://www.reddit.com/r/NeutralPolitics/comments/8u152w/what_happens_now_with_the_travel_ban/",
        "text": "Today, [SCOTUS ruled 5-4 that the Trump has constitutional authority to implement his \"Travel Ban\"](https://www.supremecourt.gov/opinions/17pdf/17-965_h315.pdf).\n\nSo my questions are pretty simple: What happens now?\n\nIf we read the text of the [current \"Travel Ban\"](https://www.whitehouse.gov/presidential-actions/executive-order-protecting-nation-foreign-terrorist-entry-united-states-2/), which was issued in March of 2017, there are several key things I'd like to inquire about.\n\nThe first is the statement that such a travel ban will last only 90-days:\n\n&gt; Under these authorities, I determined that, for a brief period of 90 days, while existing screening and vetting procedures were under review, the entry into the United States of certain aliens from the seven identified countries — each afflicted by terrorism in a manner that compromised the ability of the United States to rely on normal decision-making procedures about travel to the United States — would be detrimental to the interests of the United States. Nonetheless, I permitted the Secretary of State and the Secretary of Homeland Security to grant case-by-case waivers when they determined that it was in the national interest to do so.\n\nDoes the 90-day period begin now, or how does that work? Also, is it enforced by law or is the 90-day window an arbitrary number that has no legal bearing?\n\nLastly, there are several mentions of stipulating factors for this proclamation, specifically surrounding our (The United States) \"review\" of several processes. Examples:\n\n&gt; Under these authorities, I determined that, for a brief period of 90 days, **while existing screening and vetting procedures were under review**, the entry into the United States of certain aliens from the seven identified countries — each afflicted by terrorism in a manner that compromised the ability of the United States to rely on normal decision-making procedures about travel to the United States — would be detrimental to the interests of the United States. Nonetheless, I permitted the Secretary of State and the Secretary of Homeland Security to grant case-by-case waivers when they determined that it was in the national interest to do so.\n\n&gt; Executive Order 13769 also suspended the USRAP for 120 days. Terrorist groups have sought to infiltrate several nations through refugee programs. Accordingly, I temporarily suspended the USRAP **pending a review of our procedures for screening and vetting refugees.** Nonetheless, I permitted the Secretary of State and the Secretary of Homeland Security to jointly grant case-by-case waivers when they determined that it was in the national interest to do so.\n\nSince these statements, to me, imply that this ban will continue as long as our processes are under review, is there anything that legally obligates the government to conduct an actual review of their processes *and finish it*, or could they theoretically conduct a review for four years?",
        "created_utc": 1530028558,
        "upvote_ratio": ""
    },
    {
        "title": "Is illegal immigration actually a problem?",
        "author": "blaine_freelance",
        "url": "https://www.reddit.com/r/NeutralPolitics/comments/8u06hx/is_illegal_immigration_actually_a_problem/",
        "text": "[removed]",
        "created_utc": 1530021179,
        "upvote_ratio": ""
    },
    {
        "title": "What are the legal requirements for a business to an individual a service?",
        "author": "JazzySpinalFusion",
        "url": "https://www.reddit.com/r/NeutralPolitics/comments/8u0299/what_are_the_legal_requirements_for_a_business_to/",
        "text": "[removed]",
        "created_utc": 1530020194,
        "upvote_ratio": ""
    },
    {
        "title": "Is the two-party system democratic? Does it violate the principle of political equality?",
        "author": "redblazingdragon",
        "url": "https://www.reddit.com/r/NeutralPolitics/comments/8ty62y/is_the_twoparty_system_democratic_does_it_violate/",
        "text": "[removed]",
        "created_utc": 1529998995,
        "upvote_ratio": ""
    },
    {
        "title": "What are the Long term effects of US/UK/Canada Imposed Tariffs?",
        "author": "fullblownhiv",
        "url": "https://www.reddit.com/r/NeutralPolitics/comments/8tu0rc/what_are_the_long_term_effects_of_usukcanada/",
        "text": "[removed]",
        "created_utc": 1529959677,
        "upvote_ratio": ""
    },
    {
        "title": "The Red Hen vs. Masterpiece Cakeshop",
        "author": "akamarcus",
        "url": "https://www.reddit.com/r/NeutralPolitics/comments/8ttyof/the_red_hen_vs_masterpiece_cakeshop/",
        "text": "[removed]",
        "created_utc": 1529959255,
        "upvote_ratio": ""
    },
    {
        "title": "Trumps Tariffs On Other Countries.",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/NeutralPolitics/comments/8ttxps/trumps_tariffs_on_other_countries/",
        "text": "[removed]",
        "created_utc": 1529959047,
        "upvote_ratio": ""
    },
    {
        "title": "Evidence for crowd wisdom",
        "author": "leabdullah",
        "url": "https://www.reddit.com/r/NeutralPolitics/comments/8ttqvm/evidence_for_crowd_wisdom/",
        "text": "[removed]",
        "created_utc": 1529957652,
        "upvote_ratio": ""
    },
    {
        "title": "What is the rational of the Supreme Court majority to say only one House district was racially motivated but other districts were not?",
        "author": "EagleOfMay",
        "url": "https://www.reddit.com/r/NeutralPolitics/comments/8tszmy/what_is_the_rational_of_the_supreme_court/",
        "text": "[removed]",
        "created_utc": 1529952037,
        "upvote_ratio": ""
    },
    {
        "title": "What are the positives and negatives of OMB Director Mick Mulvaney's Government Reorganization Plan?",
        "author": "jimmyw404",
        "url": "https://www.reddit.com/r/NeutralPolitics/comments/8tq5tv/what_are_the_positives_and_negatives_of_omb/",
        "text": "In March 2017, Trump instructed the Office of Management and Budget to build a comprehensive plan to reorganize the government:\n\nhttps://www.federalregister.gov/documents/2017/03/16/2017-05399/comprehensive-plan-for-reorganizing-the-executive-branch\n\nLast week, OMB Director Mulvaney released his plan in a cabinet meeting:\n\nhttps://www.youtube.com/watch?v=YRr-drtPhlA\ntranscript: https://www.whitehouse.gov/briefings-statements/remarks-president-trump-cabinet-meeting-9/\n\nAnd the following document:\n\nhttps://www.whitehouse.gov/wp-content/uploads/2018/06/Government-Reform-and-Reorg-Plan.pdf\n\nI don't know what, if any, of these steps can be done partially or fully through Executive Order, and what needs a bill passed by the US Congress.\n\nWhat are the pros/cons of the plan?",
        "created_utc": 1529930210,
        "upvote_ratio": ""
    },
    {
        "title": "Is the United States' two-party system an accurate reflection of the varying opinions on federal policies for the entire electorate?",
        "author": "redblazingdragon",
        "url": "https://www.reddit.com/r/NeutralPolitics/comments/8to56z/is_the_united_states_twoparty_system_an_accurate/",
        "text": "[removed]",
        "created_utc": 1529905929,
        "upvote_ratio": ""
    },
    {
        "title": "Is it feasible to improve living conditions in other countries so people don’t NEED to risk fleeing their country for another?",
        "author": "hawksfan82",
        "url": "https://www.reddit.com/r/NeutralPolitics/comments/8tnplv/is_it_feasible_to_improve_living_conditions_in/",
        "text": "[removed]",
        "created_utc": 1529900940,
        "upvote_ratio": ""
    },
    {
        "title": "So.. I wrote my political experience growing up, in hopes to try and identify bias.",
        "author": "mimic751",
        "url": "https://www.reddit.com/r/NeutralPolitics/comments/8tmnbi/so_i_wrote_my_political_experience_growing_up_in/",
        "text": "[removed]",
        "created_utc": 1529890322,
        "upvote_ratio": ""
    },
    {
        "title": "It Trump or some future president began to rather blatantly rig elections to stay in power, or attempt to make himself dictator, would other nations from around the world step in?",
        "author": "chimmeh007",
        "url": "https://www.reddit.com/r/NeutralPolitics/comments/8tmlao/it_trump_or_some_future_president_began_to_rather/",
        "text": "[removed]",
        "created_utc": 1529889758,
        "upvote_ratio": ""
    },
    {
        "title": "What happened to the children in the 2014 illegal immigrant flux?",
        "author": "0Lonny0",
        "url": "https://www.reddit.com/r/NeutralPolitics/comments/8te6wo/what_happened_to_the_children_in_the_2014_illegal/",
        "text": "[removed]",
        "created_utc": 1529800356,
        "upvote_ratio": ""
    },
    {
        "title": "Why Does a Nation of 320 Million Need Millions of More Immigrants?",
        "author": "Mumblix_Grumph",
        "url": "https://www.reddit.com/r/NeutralPolitics/comments/8tdf41/why_does_a_nation_of_320_million_need_millions_of/",
        "text": "[removed]",
        "created_utc": 1529792432,
        "upvote_ratio": ""
    },
    {
        "title": "Community looking for people interested in political debate. Open and productive discussion.",
        "author": "BozzyUnlimited",
        "url": "https://www.reddit.com/r/NeutralPolitics/comments/8td2gp/community_looking_for_people_interested_in/",
        "text": "[removed]",
        "created_utc": 1529789080,
        "upvote_ratio": ""
    },
    {
        "title": "Is the International Criminal Court a primary obstacle for the creation of a Palestinian state?",
        "author": "RomanNumeralVI",
        "url": "https://www.reddit.com/r/NeutralPolitics/comments/8tc1nj/is_the_international_criminal_court_a_primary/",
        "text": "[removed]",
        "created_utc": 1529779803,
        "upvote_ratio": ""
    },
    {
        "title": "Should there be restrictions/qualifications for the first amendment?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/NeutralPolitics/comments/8tb4vw/should_there_be_restrictionsqualifications_for/",
        "text": "[removed]",
        "created_utc": 1529771873,
        "upvote_ratio": ""
    },
    {
        "title": "Tim Arnold and Michael Cohen?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/NeutralPolitics/comments/8tayii/tim_arnold_and_michael_cohen/",
        "text": "[removed]",
        "created_utc": 1529770312,
        "upvote_ratio": ""
    },
    {
        "title": "NYT asks: \"Why Are Parents Bringing Their Children on Treacherous Treks to the U.S. Border?\"",
        "author": "paulbrook",
        "url": "https://www.reddit.com/r/NeutralPolitics/comments/8tamop/nyt_asks_why_are_parents_bringing_their_children/",
        "text": "[removed]",
        "created_utc": 1529767414,
        "upvote_ratio": ""
    },
    {
        "title": "Is Mueller’s investigation *fruit of the poisoned tree* and therefore incapable of meeting the prosecution’s requirement to be free from bias?",
        "author": "optiongeek",
        "url": "https://www.reddit.com/r/NeutralPolitics/comments/8taf6r/is_muellers_investigation_fruit_of_the_poisoned/",
        "text": "[removed]",
        "created_utc": 1529765489,
        "upvote_ratio": ""
    },
    {
        "title": "How many adults accompanying minors come without any kind of paperwork proving familial status?",
        "author": "Ihatepopcornceilings",
        "url": "https://www.reddit.com/r/NeutralPolitics/comments/8ta2cm/how_many_adults_accompanying_minors_come_without/",
        "text": "[removed]",
        "created_utc": 1529762004,
        "upvote_ratio": ""
    },
    {
        "title": "What’s everyone’s take on new H1B policy?",
        "author": "butifnot0701",
        "url": "https://www.reddit.com/r/NeutralPolitics/comments/8t9c38/whats_everyones_take_on_new_h1b_policy/",
        "text": "[removed]",
        "created_utc": 1529753277,
        "upvote_ratio": ""
    },
    {
        "title": "What are the Pros and Cons of ICE (Immigration and Customs Enforcement)?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/NeutralPolitics/comments/8t81ct/what_are_the_pros_and_cons_of_ice_immigration_and/",
        "text": "[removed]",
        "created_utc": 1529734298,
        "upvote_ratio": ""
    },
    {
        "title": "How does the claim of immigrants fleeing violence in El Salvador meet the criteria for refugee status?",
        "author": "Markdd8",
        "url": "https://www.reddit.com/r/NeutralPolitics/comments/8t5vb0/how_does_the_claim_of_immigrants_fleeing_violence/",
        "text": "[removed]",
        "created_utc": 1529710834,
        "upvote_ratio": ""
    },
    {
        "title": "What are the percieved benefits vs. disadvantages of the new tax in Dakota v. Wayfair? What are the expexted realistic implications of the decision on the average consumer?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/NeutralPolitics/comments/8t5mpe/what_are_the_percieved_benefits_vs_disadvantages/",
        "text": "[removed]",
        "created_utc": 1529708574,
        "upvote_ratio": ""
    }
]