[
    {
        "title": "egghead arc",
        "author": "browutt",
        "url": "https://www.reddit.com/r/OnePiece/comments/11ohh16/egghead_arc/",
        "text": "[removed]",
        "created_utc": 1678532824,
        "upvote_ratio": 1.0
    },
    {
        "title": "just drawn luffy kong gun on kaido hope you guy's like it",
        "author": "Imjlhipbr",
        "url": "https://i.redd.it/yd4ar2q3v4na1.png",
        "text": "",
        "created_utc": 1678532570,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is there a connection? [chapter 1067+]",
        "author": "iamtheone2295",
        "url": "https://www.reddit.com/gallery/11ogou9",
        "text": "",
        "created_utc": 1678529977,
        "upvote_ratio": 1.0
    },
    {
        "title": "Luffy vs Kaido",
        "author": "CrazyTalha24-",
        "url": "https://www.reddit.com/r/OnePiece/comments/11ogn8i/luffy_vs_kaido/",
        "text": "So I don't read the manga, all I know is that in the end Luffy beats Kaido by using Sun God Nika's form.\n\nI'm following the anime right now and my question is, how the hell is Luffy (in his base form) able to keep up with Kaido in his hybrid form?\n\nThis is the same Luffy who at the beginning of Wano got his ass kicked in Gear 4 by a drunk base form Kaido. Luffy could barely beat Katakuri.\n\nI know Luffy learned the advanced Armament Haki in prison, but surely Kaido also knows how to use the advanced versions of all 3 hakis? Kaido is a Yonko with decades of experience and an amazing devil fruit, how has Kaido not awakened his devil fruit powers? Why doesn't Kaido use more abilities than just his Dragon Breath and Thunder Bagua? How does Luffy mastering Advanced Armament Haki mean that he can fight Hybrid Kaido without using gears?\n\nAs much as I like One Piece, this seems straight bologne and seems like 'the power of friendship' and main character's plot armor is coming into play. Isn't it too soon for Luffy to go from barely beating a first commander to beating a Yonko?\n\nBut maybe I'm being naive. Please clarify.",
        "created_utc": 1678529811,
        "upvote_ratio": 1.0
    },
    {
        "title": "When have you cried in One Piece",
        "author": "Scorchfin2539",
        "url": "https://www.reddit.com/r/OnePiece/comments/11ogcdl/when_have_you_cried_in_one_piece/",
        "text": "I cried at hiriluk's death, raizo is safe, and episode 1015. Probably a few other times. I don't remember crying at I want to live but looking back that is way up there in emotional moments. What about you guys? What are the most emotional moments in this series?",
        "created_utc": 1678528789,
        "upvote_ratio": 1.0
    },
    {
        "title": "I think we misunderstood the love love fruit",
        "author": "Klewus",
        "url": "https://www.reddit.com/r/OnePiece/comments/11oga7b/i_think_we_misunderstood_the_love_love_fruit/",
        "text": "With we I mean at least myself. I originally assumed it was only about romantic or sexual love, but with the recent events, I think it is about love in generell. Like in love for Pizza, family and animals. Nothing sexual.",
        "created_utc": 1678528564,
        "upvote_ratio": 1.0
    },
    {
        "title": "We sure this isn't a Devil Fruit??",
        "author": "Holiday-Tap115",
        "url": "https://i.redd.it/tfhehp0bi4na1.jpg",
        "text": "",
        "created_utc": 1678528262,
        "upvote_ratio": 1.0
    },
    {
        "title": "Theory about who saved sanji and zeff",
        "author": "Pitrackbob",
        "url": "https://www.reddit.com/r/OnePiece/comments/11og115/theory_about_who_saved_sanji_and_zeff/",
        "text": "So if you look closely you can see that the ship that came to save sanji and zeff from that rock they were starving on kinda looks like the oro Jackson. it had the same type of red colour and the same cagelike structure in the front . the only difference is the sails aren't red also. could it be an earlier ship of roger ?",
        "created_utc": 1678527658,
        "upvote_ratio": 1.0
    },
    {
        "title": "One piece episode 967 lunarian crew mate of rodger?",
        "author": "Will-C-137",
        "url": "https://www.reddit.com/r/OnePiece/comments/11ofzyt/one_piece_episode_967_lunarian_crew_mate_of_rodger/",
        "text": "So rewatching the iden flashbacks i noticed there is a crew mate of rodgers in the first 3-4 mins sweeping up who now looks somewhat lunarian any thoughts?",
        "created_utc": 1678527553,
        "upvote_ratio": 1.0
    },
    {
        "title": "Chapter 1077 spoilers!",
        "author": "Xever_141",
        "url": "https://www.reddit.com/r/OnePiece/comments/11ofyn3/chapter_1077_spoilers/",
        "text": "Sanji seems like he's really going to enjoy kicking the crap out of S-Shark. That smile looks pretty sadistic. I wonder if this is because Sanji still considers what happened to Nami on Conomi *Islands to be Jinbe's fault. What do you guys think?*  \n\nhttps://preview.redd.it/nsuw5dlrw2na1.jpg?width=259&amp;format=pjpg&amp;auto=webp&amp;v=enabled&amp;s=689c3a9341eb86043bbc7ec79d78327bbd558b64",
        "created_utc": 1678527412,
        "upvote_ratio": 1.0
    },
    {
        "title": "finally caught up with the manga! what now?",
        "author": "passdablunt211",
        "url": "https://www.reddit.com/r/OnePiece/comments/11ofxh5/finally_caught_up_with_the_manga_what_now/",
        "text": "super excited to be caught up! i was wondering there is anything you guys recommend watching or reading while i wait for more chapters? i haven’t seen any of the movies and im not sure if there’s any expanded material",
        "created_utc": 1678527289,
        "upvote_ratio": 1.0
    },
    {
        "title": "IMU and Zoro",
        "author": "iamtheone2295",
        "url": "https://www.reddit.com/r/OnePiece/comments/11ofku3/imu_and_zoro/",
        "text": "How likely is it for Zoro to encounter IMU inside Pangaea castle if he tried to find the exit?",
        "created_utc": 1678526004,
        "upvote_ratio": 1.0
    },
    {
        "title": "Prime Kaido vs. Prime Garp",
        "author": "Rezoona",
        "url": "https://www.reddit.com/r/OnePiece/comments/11ofh8f/prime_kaido_vs_prime_garp/",
        "text": "Who is taking the W?",
        "created_utc": 1678525635,
        "upvote_ratio": 1.0
    },
    {
        "title": "Choose a developer to make your ideal One Piece game",
        "author": "Fortlulz",
        "url": "https://www.reddit.com/r/OnePiece/comments/11of69e/choose_a_developer_to_make_your_ideal_one_piece/",
        "text": "After watching One Piece Red, it got me thinking. Double Fine could make an insane One Piece game. Psychonauts 2 is such an insanely creative game and if you give them the idea of devil fruits I think they would absolutely be able to run with it and create the most bizarre things you could think of in the One Piece world. It obviously wouldn't be canon but I'm sure it would be lots of fun.",
        "created_utc": 1678524533,
        "upvote_ratio": 1.0
    },
    {
        "title": "Evil Shanks",
        "author": "Cinnamonguy20",
        "url": "https://www.reddit.com/r/OnePiece/comments/11of45j/evil_shanks/",
        "text": "Im not saying that Shanks is evil but I do believe his ultimate goals conflict with Luffy's in the end. I believe this will cause the necessary conflict to justify a fight. \n\nFrom everything that we have seen from him, there is no reason to believe he is a 100% morally good character. Why would he be allowed to meet with the goresei as a pirate? Strength can not be the justification for allowing him in Mariejoa\n\nAlso, why would shanks attack a marine ship for a supposedly useless devil fruit? He clearly knows something more to the fruit than everyone else. \n\nAnother question to ask is why would he ask Ben Beckman if its time to claim the One Piece right after Big Mom and Kaido's defeat? The only 2 major events are those 2 dying and Luffy awakening his fruit.\n\nA lot of people claim that he is a gatekeeper of the One Piece but why would a character built upon for over 25 years just be used to hold Luffys hand as he walks him into Laughtale? Oda as a writer or any writer could never justify a waste of time like that.",
        "created_utc": 1678524316,
        "upvote_ratio": 1.0
    },
    {
        "title": "Just started reading the Manga",
        "author": "ryguy1689",
        "url": "https://www.reddit.com/r/OnePiece/comments/11oeotu/just_started_reading_the_manga/",
        "text": "Having binge watched OP 2x already, I decided to take on the Manga. I was able to find the first 3 volumes (middle of Syrup village) but finding a local seller that has the others has proven to be difficult. \n\nDoes anyone have a recommendation for a site that is reliable, trustworthy and relatively quick to deliver (like 3-5 business days) \n\nI'm not a big fan of Amazon, so no I haven't looked there for personal reasons. \n\nThanks for the help cause I want to get back to reading.",
        "created_utc": 1678522813,
        "upvote_ratio": 1.0
    },
    {
        "title": "Just started watching OP",
        "author": "vinsoskij_",
        "url": "https://www.reddit.com/r/OnePiece/comments/11oemba/just_started_watching_op/",
        "text": "Hello, just started One Piece and i’m almost at ep100. I was wondering, are there any fillers worth watching? Cause I’m skipping all of them rn. Same question for the movies. Thank you!",
        "created_utc": 1678522563,
        "upvote_ratio": 1.0
    },
    {
        "title": "I made a one piece meat",
        "author": "ambiemashpotato",
        "url": "https://i.redd.it/j90a4wc904na1.jpg",
        "text": "",
        "created_utc": 1678522197,
        "upvote_ratio": 1.0
    },
    {
        "title": "Some things never change",
        "author": "RedditEnjoyer101",
        "url": "https://i.redd.it/vtl54mgoe2na1.png",
        "text": "",
        "created_utc": 1678520840,
        "upvote_ratio": 1.0
    },
    {
        "title": "This would've been cool...(pun intended)",
        "author": "Ok_Win_3538",
        "url": "https://i.redd.it/5eg5xuwvv3na1.jpg",
        "text": "Okay look hear me out. Let's do a hypothetical match up here. What if Queen used his ice oni virus on himself and he used that as a last ditch effort to try and defeat Sanji? Because YES I understand the POINT of the fight was Sanji overcoming the Germa and all that. Cool, I get that. However it does feel a little strange that Queen the PLAGUE didn't use any plague weapons on Sanji at all.\n\nNow one would and likely will argue\n\n\"Why would queen infect himself? that's stupid\"\n\nFirst of all queen is a cyborg and would likely have built in antibodies and such in order to ensure his viruses aren't used against him.\n\nSecond this would provide a challenge for Sanji because he would have to have so much heat active to ensure he himself doesn't turn into an ice Oni and he would need to use the heat of his kicks to nullify to frost coming off of Queen. We even could still get that final rush down of attacks Sanji does but this time it's more than a random power boost it's one Sanji has to think of and activate on the fly in the hopes it'll burn through not just the ice but Queens TOUGH Brachiosaurus skin which is also cyborg enhanced.\n\nI feel this would provide a more challenging fight since the ice oni virus gave the infected increased stamina and strength and a vitality boost so Queen would be tough to put down and keep down",
        "created_utc": 1678520721,
        "upvote_ratio": 1.0
    },
    {
        "title": "One piece feel very short to be honest.",
        "author": "nabeelmirzan",
        "url": "https://www.reddit.com/r/OnePiece/comments/11odu21/one_piece_feel_very_short_to_be_honest/",
        "text": "I'm of those man that said one piece is long but when I catch up. It feel short. It need to have few thousand episode. Do you all agree with me?",
        "created_utc": 1678519783,
        "upvote_ratio": 1.0
    },
    {
        "title": "I asked chatGPT to generate an imaginary ending for One Piece",
        "author": "bobskyrock",
        "url": "https://www.reddit.com/r/OnePiece/comments/11odr5v/i_asked_chatgpt_to_generate_an_imaginary_ending/",
        "text": "\\*\\*\\* No spoiler, just pure imagination and unreal stuff generated by AI \\*\\*\\*\n\nThis is what chatGPT said:\n\nFor the past few decades, the world's largest treasure, One Piece, has been sought after by people. Legend has it that this treasure is hidden on Laugh Tale Island, located at the end of the world, and can only be found by collecting the four red road poneglyphs.\n\nMonkey D. Luffy and his crew overcame many obstacles and finally found the last red road poneglyph, leading them to Laugh Tale Island. On the island, they discovered relics left behind by Roger's pirate crew, including Roger's notes detailing his experiences and findings while searching for One Piece.\n\nIn these notes, Roger left a final message: One Piece is not gold and silver treasures, nor is it about power and fame. It is about the truth of the world. This truth has been hidden by both the World Government and pirates, and only those who find One Piece will be able to learn of it.\n\nUpon learning this truth, Luffy decided to reveal it with his crew, bringing an end to the chaos and injustice in the world. Ultimately, Luffy and his crew successfully exposed the World Government's conspiracy and ushered in a new era of peace and justice.\n\nAs for the treasure on Laugh Tale Island, it was actually Roger's notes and the truth about the world. This truth could be related to the origin and history of the world or to major events involving the Pirate King and World Government. The value of this truth lies not only in its content but also in the fact that it will change the fate and future of the entire world.\n\n&amp;#x200B;\n\nAccording to Roger's notes and historical records, this so-called truth is related to the origin and history of the world. It reveals that a supernatural force caused the formation of the world a long time ago, and this force is known as the \"Will of D.\"\n\nThis \"Will of D\" originated from a mysterious civilization that possessed highly advanced technology and power, but was ultimately destroyed by a catastrophic disaster. The descendants of this civilization are called the \"D clan,\" who retained the wisdom and power of their ancestors, becoming an incredible existence.\n\nHowever, because the \"Will of D\" conflicts with the interests of the world government, the government has been secretly hunting down members of the \"D clan,\" and has been trying to obscure and manipulate the history and information related to the \"Will of D\" as much as possible in order to maintain their ruling position.\n\nThrough their search for One Piece and Roger's notes, Luffy and his crew finally revealed this truth. They eventually realized that only by changing the rule of the world government and revealing the truth of history could true peace and justice be achieved.\n\nThe revelation of this truth will greatly affect the fate and future of the entire world. It will challenge people's perception of themselves and the world, and may cause great chaos and turbulence, but it may also bring about real change and progress.\n\n&amp;#x200B;\n\nAny thoughts on this? What do you think about the logic of chatGPT?",
        "created_utc": 1678519483,
        "upvote_ratio": 1.0
    },
    {
        "title": "Black blades",
        "author": "Pieceofbeefcake",
        "url": "https://www.reddit.com/r/OnePiece/comments/11odmmh/black_blades/",
        "text": "[removed]",
        "created_utc": 1678519012,
        "upvote_ratio": 1.0
    },
    {
        "title": "How I would divide OP arcs into seasons and name each seasons",
        "author": "healol74",
        "url": "https://www.reddit.com/r/OnePiece/comments/11odkwc/how_i_would_divide_op_arcs_into_seasons_and_name/",
        "text": "**Season 1 – East Blue to Grand Line!**  \n\\- Arcs: (Romance Dawn -&gt; Orange Town -&gt; Syrup Village -&gt; Baratie -&gt; Arlong Park -&gt; Loguetown)  \n\\- Chapters: 1 - 100  \n\\- Episodes: 1 - 53\n\n&amp;#x200B;\n\n**Season 2 – Baroque Works**  \n\\- Arcs: (Reverse Mountain -&gt; Whiskey Peak -&gt; Little Garden -&gt; Drum Island -&gt; Arabasta)  \n\\- Chapters: 101 - 217  \n\\- Episodes: 61 - 130\n\n&amp;#x200B;\n\n**Season 3 – The Lost Ancient City of Gold**  \n\\- Arcs: (Jaya -&gt; Skypiea)  \n\\- Chapters: 218 - 302  \n\\- Episodes: 144 - 195\n\n&amp;#x200B;\n\n**Season 4 – Cipher Pol, The Secret Agents**  \n\\- Arcs: (Long Ring Long Land -&gt; Water 7 -&gt; Enies Lobby -&gt; Post-Enies Lobby)  \n\\- Chapters: 303 - 441  \n\\- Episodes: 207 - 325\n\n&amp;#x200B;\n\n**Season 5 – Celestial Dragons, The World Rulers**  \n\\- Arcs: (Thriller Bark -&gt; Sabaody Archipelago -&gt; Amazon Lily)  \n\\- Chapters: 442 - 524  \n\\- Episodes: 337 - 421\n\n&amp;#x200B;\n\n**Season 6 – Paramount War**  \n\\- Arcs: (Impel Down -&gt; Marineford -&gt; Post-War)  \n\\- Chapters: 525 - 597  \n\\- Episodes: 422 - 516\n\n&amp;#x200B;\n\n**Season 7 – Adventure in Fishmen Island!**  \n\\- Arcs: (Return to Sabaody -&gt; Fishmen Island)  \n\\- Chapters: 598 - 653  \n\\- Episodes: 517 - 574\n\n&amp;#x200B;\n\n**Season 8 – New Alliance in New World!**  \n\\- Arcs: (Punk Hazard -&gt; Dressrosa)  \n\\- Chapters: 654 - 801  \n\\- Episodes: 578 - 746\n\n&amp;#x200B;\n\n**Season 9 – Challenging the Great Emperors!**  \n\\- Arcs: (Zou -&gt; Whole Cake Island -&gt; Reverie -&gt; Wano)  \n\\- Chapters: 802 - 1057  \n\\- Episodes: 751 - ...\n\n&amp;#x200B;\n\n**Season 10 – Throne Wars**  \n\\- Arcs: (Egghead -&gt; ...)  \n\\- Chapters: 1058 - ...  \n\\- Episodes: N/A",
        "created_utc": 1678518840,
        "upvote_ratio": 1.0
    },
    {
        "title": "soul king brook ! 👑🎶💀[OC]",
        "author": "a-person-n",
        "url": "https://i.redd.it/f05vjnsg82na1.jpg",
        "text": "",
        "created_utc": 1678518775,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does momo get better or does he continue being a pussy?",
        "author": "aidanderson",
        "url": "https://www.reddit.com/r/OnePiece/comments/11odht6/does_momo_get_better_or_does_he_continue_being_a/",
        "text": "I'm anime only so my opinion is already tainted by godawful pacing but momo is constantly a bitch and he only stopped like one time when he decided to metaphorically grow up by asking for the age me up jutsu so he could give Luffy an Uber ride to the palace then he continues to be a bitch and refuse to breath fire or bite kaido. Like I'm tired of this guy being a bitch does he ever become like a tiny fraction of the man his father is or is this guy gonna be a bitch for the rest of the arc/story?",
        "created_utc": 1678518525,
        "upvote_ratio": 1.0
    },
    {
        "title": "The traitor in latest chapter is..",
        "author": "UntamedGingie",
        "url": "https://www.reddit.com/gallery/11odh8q",
        "text": "",
        "created_utc": 1678518469,
        "upvote_ratio": 1.0
    },
    {
        "title": "Rank Top 25 Female Characters in One Piece",
        "author": "Confident_Spell6022",
        "url": "https://i.redd.it/mw17mqhb72na1.png",
        "text": "",
        "created_utc": 1678518463,
        "upvote_ratio": 1.0
    },
    {
        "title": "The intruder at in latest chapter is…",
        "author": "UntamedGingie",
        "url": "https://www.reddit.com/gallery/11odfhy",
        "text": "",
        "created_utc": 1678518300,
        "upvote_ratio": 1.0
    },
    {
        "title": "can anyone tell me what is current urouge bounty?",
        "author": "The-ashura",
        "url": "https://www.reddit.com/r/OnePiece/comments/11odf26/can_anyone_tell_me_what_is_current_urouge_bounty/",
        "text": "In sabody he has 108million.\nJust curious",
        "created_utc": 1678518257,
        "upvote_ratio": 1.0
    },
    {
        "title": "One piece is trash asf Part 2",
        "author": "LargeAd8010",
        "url": "https://www.reddit.com/r/OnePiece/comments/11od7d5/one_piece_is_trash_asf_part_2/",
        "text": "1. Ace, what is his character he appeared in arabasta briefly, reunion with luffy and chilled with strawhats for a little bit before he showed off his flame flame fruit then he got washed by BB then captured had heart to heart with Garp, screamed LUFFYYY and GIGIII, got rescued, died because he was an idiot and we're supposed to care?? Idk how anybody cried because of his death he came and gone. Idc about the flashbacks in wano. It's too late now.\n\n2.one piece villians are hot ass and forgettable buggy had potential he started off as threating and potential rival and adversery for luffy but ended up a gag who survives based on luck like the  ussop of villains, Kuro who? Don Krieg, who? Moria Who? Foxy Who? Arlong was threatening and became a joke by luffy. Crocodile  got done sooooo dirty holy shit luffy shouldn't have beaten him but plot armor is stuck to luffy..reduced to a joke villain\n\n\n3. Enel should've melted luffy even if rubber is a conductor for electricity even so it has a limit and if Oda wasn't gonna makes luffy melt he shouldn't have made him use insane voltages of electricity like 100,000,000 and have luffy sustain no damage. CMON He shouldn't have melted a bit of him even slightly.\n\n4. Kuina died falling down some stairs, but after her death, we see zoro lifting heavy weights clearly weighing more than him and him holding a dumbell in his mouth. Inconsistencies there make that make sense? It's even more outrageous that she died falling down stairs after seeing the insane feats op characters pull off as children, especially during training montages\n\n5. Gear 4th is an asspull it came out of nowhere we didn't seem him train for it before it seemed pretty hard to do and what makes it worse is that luffy has whole movements for bounce and snakeman that seems pretty hard to control and the mechanics for like the maneuvers of calverin and king cobra he does with his arms is too insaneee to be improvised on the spot you're on some shit if you're telling that to me.\n\n6. BB is a very underwhelming villain he was introduced as this goofy, gruff but sinister opposite to luffy he what fought and captured ace, finished off whitebeard ig but he was already near death and bb handed him an L before he did lol he then became a warlord, yonko captured some devils fruits, killed the clear clear guy and when we seem again after 100's his fight with law gets offscreen??? WTF\n\n7. BB is hugely undeveloped. We should've seen him train his dark dark because it has complicated properties with the blackhole, gravity (and pocket dimensional attribute) to seemly master that fruit is pretty crazy and the earthquake fruit as well which he got only 2-3 years ago so we should've got some training from, we got no development from his crew and what they're like, how they interact with each other we can't even root for them if we even wanted to.\n\n8. Luffy's bounty should've been way highwr than what he started with and we should've saw the marines chase him with much more urgency especially since that joyboy nonsense and the gorosei saying they been after the gum gum fruit for 800 years..yeah? Oh, really now? I didn't see that happening? What about marineford? he shouldn't have survived being face to face with 3 admirals with how weak he was. We  should've seen it way back. Have axe hand Morgan bring it up it probably would've saved his job \"you're fired! Losing to a rookie, no name, pirate is unacceptable!\" \"But sir, that pirate had a devil fruit. It think it was the gum gum fruit(he could mention this to sengoku directly, a vice admirals, lieutenant anybody ans have them report it to the gorosei) .\" gum gum you say? Hmm, alr men capture strawhat immediately!\"  \"Sir, yessir!🫡\" It would established luffy threat level way better.\n\n9. Shanks a real dumbass for leaving the gum gum fruit in an open chest on the counter, the bandits came it and couldve taken it but didn't even try( dumb plot armor) he could've given it to makimo before then and since he's smashing or just she's really close to him she wouldn't let something that belongs to him out of sight and not hidden.\n\n10. Kaido and Big mom are ass one dimensional villians they're basically the same \"do as I say or I hurt you\"  and kaido's weak ass water down Bullet backstory won't save his weak ass bland no substance character I'm kaido and I get drunk, then depressed ahhh and i can't get hurt cause tough skin \" I'm Big mom I got a billion kids and I throw tantrums like a baby when I don't get wedding cake\" \"I'm apparently threatening even tho I look like a fat old lady\" the disrespect to kaido by gear 5th luffy was just horrible.\n\n11: Gear 5th is also an asspull why did he awaken just after he died why didn't the joyboy fruit awakened any of theb previous times luffy got his ass kicked and was near death he was at his limt with his fruit gear 4th snakeman before? Vs kaido the 3rd time was the first time luffy reached a limit. he conveniently awakened just when he died? Why didn't the law and kid die? ASSPULL \n\n12. The devil fruit system is all fucked and things are still not explained up how do you awaken the fruit? Reaching a limit and exhausting it? Having long time spent using the fruit ? Buggy and Hancock had their fruits longer than luffy and were hella creative, but still no awakening he'll anyone with a longer fruit than luffy having awakened they only awakened when the story demands.\n\n13. Law was last seen fighting doflamingo and struggling but went to going toe to toe with big mom with being immediately crushed in the span of a few months? Power inconsistency I call BS.\n\nLet me know what you think? You're free to come up with an argument if you can😂. These are pretty yikes..",
        "created_utc": 1678517520,
        "upvote_ratio": 1.0
    },
    {
        "title": "Asked Chat GPT for a One Piece Story",
        "author": "CrossbitReddit",
        "url": "https://www.reddit.com/r/OnePiece/comments/11od4gu/asked_chat_gpt_for_a_one_piece_story/",
        "text": "Once upon a time, in a world of pirates and treasure, there was a young man named Monkey D. Luffy who dreamed of becoming the Pirate King and finding the legendary treasure known as One Piece.\n\nLuffy set out on his journey with his loyal crew, the Straw Hat Pirates, who were as determined as he was to find the treasure. Along the way, they encountered many obstacles and enemies, but they never gave up on their quest.\n\nAs they journeyed through the Grand Line, they faced many powerful foes, including the infamous Shichibukai, warlords who were allied with the World Government. Luffy and his crew fought against them, including the likes of Crocodile, the first warlord they encountered, and Doflamingo, who had a personal vendetta against them.\n\nThey also clashed with the Marine Admirals, who were the strongest soldiers of the World Government. Luffy and his crew battled against the likes of Aokiji, Kizaru, and Akainu, but they managed to emerge victorious against all odds.\n\nTheir journey was also marked by emotional moments, including the death of their dear friend, the archaeologist Nico Robin, who was thought to be the only one who could decipher the ancient text known as the Poneglyphs, which held clues to the location of the One Piece treasure.\n\nDespite the obstacles and hardships, Luffy and his crew never lost sight of their goal, and they continued to forge ahead on their journey. Along the way, they made new friends and allies, including the revolutionary army, who were fighting against the World Government's oppression.\n\nFinally, after many battles and hardships, Luffy and his crew reached the end of the Grand Line and the location of the One Piece. There, they faced their ultimate challenge, the Pirate King himself, Gol D. Roger, who had hidden the treasure.\n\nAfter a fierce battle, Luffy emerged victorious, and he discovered the true meaning of the One Piece treasure: it was not a physical treasure, but rather the experiences, adventures, and friendships that he had gained on his journey. Luffy realized that the true treasure was the journey itself, and he resolved to continue sailing the seas with his crew, facing new challenges and making new memories along the way.",
        "created_utc": 1678517232,
        "upvote_ratio": 1.0
    },
    {
        "title": "Bought a One Piece DVD set with the first 23 Collections and am trying to figure out if it's counterfeit",
        "author": "lovetodo22",
        "url": "https://www.reddit.com/r/OnePiece/comments/11ocx50/bought_a_one_piece_dvd_set_with_the_first_23/",
        "text": "Bought the Collection 1-23 set off Walmart.com and it arrived today, but something feels slightly off. Can someone pop, say, the first disc of Collection 9 into their computer and let me know what your DVD drive says the size of the disc is?",
        "created_utc": 1678516497,
        "upvote_ratio": 1.0
    },
    {
        "title": "Smartest onepiece insta powerscalers",
        "author": "mister_r0yal",
        "url": "https://www.reddit.com/r/OnePiece/comments/11ocf5z/smartest_onepiece_insta_powerscalers/",
        "text": "I cant believe i actually saw this debate someone said a prime Kaido would easily beat roger white beard and garp in their primes with no difficulty because “he has better feats” they also said that king was probably stronger then dragon beause dragon has no feats or confirmed bounty",
        "created_utc": 1678514717,
        "upvote_ratio": 1.0
    },
    {
        "title": "The Butterfly Effect of Fate - by Patrick Rothfuss",
        "author": "_KvotheTheArcane__",
        "url": "https://www.reddit.com/r/OnePiece/comments/11ocd2m/the_butterfly_effect_of_fate_by_patrick_rothfuss/",
        "text": "There are stories whispered among the pirates, tales of a mysterious force that has the power to change the course of history. Some call it fate, others destiny, but whatever it may be, the power that lies behind it is something that has been sought after by pirates and marines alike for centuries.\n\nIn the world of One Piece, there are many mysteries yet to be uncovered, but perhaps the greatest of them all is the true nature of this force. Some believe it to be a supernatural power, while others think it is simply the result of chance. But what if the truth is something more complex, something that even the greatest minds in the world have yet to comprehend?\n\nMy theory is this: The power behind fate is not a singular force, but rather a series of events that are interconnected in ways that are beyond human understanding. It is the butterfly effect, the idea that a small action can have far-reaching consequences. It is the idea that everything is connected, and that each decision we make can have a ripple effect that alters the course of our lives and the lives of those around us.\n\nIn the world of One Piece, there are countless examples of these interconnected events. The death of Ace, for example, was the result of a series of decisions made by both the pirates and the marines, each of which had a ripple effect that led to his demise. Similarly, the discovery of the Poneglyphs was the result of a chance encounter between a group of pirates and a member of the Kozuki family, a moment that changed the course of history forever.\n\nBut what if these events were not random, but rather the result of a greater force at work? What if there was a master plan, a grand design that was guiding these events towards a specific outcome? And what if the only way to truly understand this force was to unravel the mysteries of the Void Century, to uncover the secrets that have been hidden away for centuries?\n\nIn the world of One Piece, there are those who seek power for the sake of power, and those who seek knowledge for the sake of knowledge. But what if the true power lay not in physical strength, but in the understanding of the forces that govern the world? What if the true power lay in the ability to see the connections that bind us all together, and to use that knowledge to shape the world in a way that benefits all of humanity?\n\nThese are the questions that haunt the minds of those who seek the truth in the world of One Piece. And perhaps one day, if we are lucky, we may uncover the answers that we so desperately seek. But until then, we must keep searching, keep asking questions, and keep pushing the boundaries of what we know to be true. For in the world of One Piece, anything is possible, and the only limit is the scope of our own imagination.\n\n&amp;#x200B;\n\n\\---\n\n&amp;#x200B;\n\n&gt;At last, I humbly apologize for the indulgence of writing in the style of Patrick Rothfuss. I understand that this may have caused some confusion and perhaps even irritation, and for that, I am truly sorry.",
        "created_utc": 1678514517,
        "upvote_ratio": 1.0
    },
    {
        "title": "Thriller Bark Spoilers: Early Haki Use?",
        "author": "fravi714",
        "url": "https://www.reddit.com/r/OnePiece/comments/11oc9fy/thriller_bark_spoilers_early_haki_use/",
        "text": "So I'm not sure if this has been discussed before, but I was reading the Thriller Bark arc and I noticed that there was a moment in Chapter 463 where Sanji was fighting Absalom, and was able to predict his actions. Could this be an early appearance of his Kenbunshoku Haki? During my first read it reminded me of mantra, and now I can kinda see how it would tie into his abilities post-timeskip.\n\nhttps://preview.redd.it/8itxiuqlu1na1.png?width=1520&amp;format=png&amp;auto=webp&amp;v=enabled&amp;s=6a1173741a1869ef89485b2391c93ab29826f41a",
        "created_utc": 1678514193,
        "upvote_ratio": 1.0
    },
    {
        "title": "season 14 help",
        "author": "Master-Ad-226",
        "url": "https://www.reddit.com/r/OnePiece/comments/11oc3vx/season_14_help/",
        "text": "I'm from Australia and I'm just finishing season 13! Does anyone know where I can find season 14 english dub? Inb4 Microsoft tv and movies cause it doesn't work for me. Willing to pay full price just need to know where TF to find it 🙏",
        "created_utc": 1678513658,
        "upvote_ratio": 1.0
    },
    {
        "title": "\"The One Piece is Real!\" - Queen Elizabeth",
        "author": "khyber_niner",
        "url": "https://www.reddit.com/r/OnePiece/comments/11oc3fk/the_one_piece_is_real_queen_elizabeth/",
        "text": "Did queen Elizabeth really say the one piece is real? Or what is it? I don't really know and am eager for it's answer..",
        "created_utc": 1678513615,
        "upvote_ratio": 1.0
    },
    {
        "title": "Some Fanart of the Strawhat and Hearts pirates ships",
        "author": "J-2B",
        "url": "https://www.reddit.com/gallery/11oc2em",
        "text": "Thousand Sunny, Going Merry, Polar Tang",
        "created_utc": 1678513521,
        "upvote_ratio": 1.0
    },
    {
        "title": "I just thought of something...",
        "author": "Puzzleheaded-Shop398",
        "url": "https://www.reddit.com/gallery/11oc1uu",
        "text": "Jaya island and long ring long island were once connected as 1 whole island and the one piece were once located at the jaya island's missing eye.\n\nOkay, so I've been seeing theories about long ring long island being a very mysterious island, that the one piece is right in the middle of it. There's also theories saying the missing eye of jaya island is the one that holds the one piece in the past. But what if i tell you that these two theories are connected and might possibly be true? It may seem impossible but oda wouldn't do an arc that is made only to annoy people, everything he does has purpose. \n\nBut let's say it is, is it really a hard reach to assume long ring island were once a part of jaya CONSIDERING these islands were close to each other? It may seem that the long ring long island is too small compared to the missing eye of the skull but its not, long ring long island is huge. Just look the the arc, the whole thing only happened on one spot of the whole island and its already huge. And there's 10 of them spots. The skypiea arc was even followed by the davy back fight arc.\n\nThough the only reason i can think of on why or how long ring long island got separated is that it happened during the void century. It cant be during the knock up stream where the upper part of jaya was launched up in the sky and became skypiea because jaya island was already missing an eye during the flashback of noland.\n\nWhat's the point of my post? My point is that these 2 most hated arcs may be much more valuable and have much more history than what is already shown in the series in the future.",
        "created_utc": 1678513472,
        "upvote_ratio": 1.0
    },
    {
        "title": "Are there any Uta MMD Models?",
        "author": "IFoxTrott29",
        "url": "https://www.reddit.com/r/OnePiece/comments/11obzs3/are_there_any_uta_mmd_models/",
        "text": "\\*Mikumikudance",
        "created_utc": 1678513272,
        "upvote_ratio": 1.0
    },
    {
        "title": "When will episode 929 get release?",
        "author": "Klutzy_Warthog_9451",
        "url": "https://www.reddit.com/r/OnePiece/comments/11obr9s/when_will_episode_929_get_release/",
        "text": "I’m still only at 784 but didn’t know if I had time to catch up",
        "created_utc": 1678512480,
        "upvote_ratio": 1.0
    },
    {
        "title": "It took me about 4 weeks to make this Bounce-Man. I hope you like it.",
        "author": "KT_Sketch",
        "url": "https://v.redd.it/x9vdrv4to1na1",
        "text": "",
        "created_utc": 1678512251,
        "upvote_ratio": 1.0
    },
    {
        "title": "Traffy did the Giga Chad trend 😍",
        "author": "Hawlker836",
        "url": "https://pin.it/1WfSZDH",
        "text": "",
        "created_utc": 1678511918,
        "upvote_ratio": 1.0
    },
    {
        "title": "Pirates, new faces that the people themselves are looking for",
        "author": "one_piece_art",
        "url": "https://www.reddit.com/gallery/11obdj7",
        "text": "",
        "created_utc": 1678511207,
        "upvote_ratio": 1.0
    },
    {
        "title": "So far my favorite face of Chopper",
        "author": "HatStatus7885",
        "url": "https://i.redd.it/xko3fxpa33na1.jpg",
        "text": "",
        "created_utc": 1678511106,
        "upvote_ratio": 1.0
    },
    {
        "title": "My fanart of Yamato :)",
        "author": "kelvvv",
        "url": "https://i.redd.it/42zqldtpi1na1.jpg",
        "text": "",
        "created_utc": 1678510209,
        "upvote_ratio": 1.0
    },
    {
        "title": "Whats a fight you’re anticipating that people aren’t talking about? Heres mine",
        "author": "GeneralJollyRancher",
        "url": "https://i.redd.it/ewxi3uv403na1.jpg",
        "text": "",
        "created_utc": 1678510043,
        "upvote_ratio": 1.0
    },
    {
        "title": "What if s-flamingo had the op-op fruit?",
        "author": "FlameSage09",
        "url": "https://www.reddit.com/r/OnePiece/comments/11ob08r/what_if_sflamingo_had_the_opop_fruit/",
        "text": "Law was at one point a warlord, I haven't seen any discussion of his seraphim",
        "created_utc": 1678510014,
        "upvote_ratio": 1.0
    },
    {
        "title": "Subtle character moment for Nami (Ch 1077 Spoilers)",
        "author": "lombrie",
        "url": "https://i.redd.it/gbdfe78yh1na1.png",
        "text": "",
        "created_utc": 1678509911,
        "upvote_ratio": 1.0
    },
    {
        "title": "One of the best moments in dressrosa",
        "author": "notwhoyouknow12",
        "url": "https://i.redd.it/3l3y4tmiy2na1.jpg",
        "text": "",
        "created_utc": 1678509499,
        "upvote_ratio": 1.0
    },
    {
        "title": "Kaido VS Luffy G5 (No help)",
        "author": "JohnnyFlicker",
        "url": "https://www.reddit.com/r/OnePiece/comments/11oas5h/kaido_vs_luffy_g5_no_help/",
        "text": "[removed]",
        "created_utc": 1678509286,
        "upvote_ratio": 1.0
    },
    {
        "title": "wassup with this nga fingers 😭😭",
        "author": "Aurtion",
        "url": "https://i.redd.it/52gkmluaw2na1.jpg",
        "text": "",
        "created_utc": 1678508754,
        "upvote_ratio": 1.0
    },
    {
        "title": "we must protect",
        "author": "According-Hand6764",
        "url": "https://i.redd.it/hz8xhnwje1na1.png",
        "text": "",
        "created_utc": 1678508710,
        "upvote_ratio": 1.0
    },
    {
        "title": "Soul King Brook!.",
        "author": "SadisticMagician6969",
        "url": "https://www.reddit.com/r/OnePiece/comments/11oaaox/soul_king_brook/",
        "text": "Just made it to episode 815, seeing Brook's Shout of the Soul move from episode 814. Made me like him even more!. I mean, I always thought he was badass. But damn guys and gals. Yohoho!.",
        "created_utc": 1678507726,
        "upvote_ratio": 1.0
    },
    {
        "title": "OP Fanart challenge! (these characters in my style;;)",
        "author": "roniiiqdr",
        "url": "https://i.redd.it/8n15hgexp2na1.jpg",
        "text": "",
        "created_utc": 1678506610,
        "upvote_ratio": 1.0
    },
    {
        "title": "is it just me.. or do you all wish you had a friend that watches one piece so you can talk about every psychological/emotional/exciting scene you’ve just watched?? 🙁 PLEASE NO SPOILERS IN THE COMMENTS THANK YOU!💗 not my art found it on pinterest with a caption of,“art work by ‘Adnan’”",
        "author": "llay_",
        "url": "https://i.redd.it/1vy30bzjp2na1.jpg",
        "text": "",
        "created_utc": 1678506485,
        "upvote_ratio": 1.0
    },
    {
        "title": "Episode 647 One Piece 1st watch through: Luffy vs Don Chinjao",
        "author": "flapjack300",
        "url": "https://www.reddit.com/r/OnePiece/comments/11o9dbc/episode_647_one_piece_1st_watch_through_luffy_vs/",
        "text": "What’s up crew mates it’s been awhile and I can’t believe I’m already at episode 647. We are in dressrosa right now and law is getting his ass beat, some toys are helping franky find the Smile factory? Sanji being mid again getting trapped by women And Luffy is fighting in a tournament for ace’s devil fruit. \n\nI just wanna ask some questions if you guys don’t mind. \n\n1) they explain how the fruits materialize again from a normal fruit when the person dies, is it the nearest fruit to the dead person or just any random fruit in the world?\n\n2) what can Luffy even do with ace’s fruit when/if he wins this tournament? I know they say you can only have one power but I mean, can’t he just eat it to keep the power away?\n\n3) around how many more episodes of one piece are gonna be released? Im like 400 episodes back I believe but I really wanna catch up with everyone else to experience the end",
        "created_utc": 1678504817,
        "upvote_ratio": 1.0
    },
    {
        "title": "was the 4 billion databook written by oda?",
        "author": "poodl3s388",
        "url": "https://www.reddit.com/r/OnePiece/comments/11o95rl/was_the_4_billion_databook_written_by_oda/",
        "text": "As in. It's undeniably canon and word of God?",
        "created_utc": 1678504183,
        "upvote_ratio": 1.0
    },
    {
        "title": "FINALLY!!!",
        "author": "Voldesh",
        "url": "https://www.reddit.com/r/OnePiece/comments/11o933a/finally/",
        "text": "After many many years and going back and having to rewatch half of it. I have FINALLY caught up with the one piece anime!",
        "created_utc": 1678503949,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why the Roger Pirates were too early",
        "author": "sogedking",
        "url": "https://www.reddit.com/r/OnePiece/comments/11o8lkz/why_the_roger_pirates_were_too_early/",
        "text": "\\- The reason Roger and them were too early was because Luffy's devil fruit wasn't around yet.\n\n\\- It was probably grown around the time the Navy was transported it and Shanks stole it.\n\n\\- Imu/ the WG wanted to make it lowkey with them taking it without the Navy knowing. So they had Shanks steal it, which explains why he was meeting with the Gorosei.\n\n\\- The WG hired Shanks to steal the fruit from the Navy so it didn't look suspicious.\n\n\\- The fruit had just been grown at the time the Navy was transporting it and nobody had it in the past, and that's why Roger said they were too early. Luffy's DF is the key to the One Piece.",
        "created_utc": 1678502490,
        "upvote_ratio": 1.0
    },
    {
        "title": "Lofi One Piece Card Game Pack Openings #14 - Romance Dawn Set",
        "author": "dega4ever",
        "url": "https://youtu.be/BFNA5uf1N3E",
        "text": "",
        "created_utc": 1678502453,
        "upvote_ratio": 1.0
    },
    {
        "title": "Alabasta Arc Character Tier List (first watch through)",
        "author": "Dynamix2442",
        "url": "https://i.redd.it/40c0b4jgv0na1.png",
        "text": "",
        "created_utc": 1678502284,
        "upvote_ratio": 1.0
    },
    {
        "title": "Create a new Devil Fruit from each category, Logia, Paramecia and Zoan.",
        "author": "Captain-Cryo",
        "url": "https://www.reddit.com/r/OnePiece/comments/11o8chn/create_a_new_devil_fruit_from_each_category_logia/",
        "text": "My personal ones would be:\n\nLogia: Cotton-Cotton No Mi. The user can turn into cotton and make massive amounts of cotton the user can use defensively by making attacks bounce away or offensively by slightly hardening the cotton to have good damage. Direct counter to string.\n\nParamecia: Bone-Bone No Mi. The user can make bones sprout from nearly anywhere in their sight, Similar to Robins fruit. They can use the bones as sharp weapons or defensive barriers.\n\nLogia: Keratin-Keratin No Mi: Model Pangolin. The user can transform into a pangolin or pangolin hybrid. Since having the powers of a pangolin the user has defensive, Sharp scales on their back. They can curl into balls and roll around like katakuris dough roller, Or us their sharp claws for offense. They will also get the pangolins sense of smell, Which will aid in tracking opponents.",
        "created_utc": 1678501731,
        "upvote_ratio": 1.0
    },
    {
        "title": "Had a go at making an MMV for this goated early Zoro moment :D",
        "author": "anime_on_demand",
        "url": "https://youtube.com/watch?v=afnFpDc99pM&amp;feature=share",
        "text": "",
        "created_utc": 1678501679,
        "upvote_ratio": 1.0
    },
    {
        "title": "I have done a Luffy fanart wallpaper, so i thought it would be nice to share it here. Hope u like it :3",
        "author": "KuinKaze_69",
        "url": "https://i.redd.it/nzdgivf3t0na1.png",
        "text": "",
        "created_utc": 1678501512,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do i watch episodes past ep. 325??",
        "author": "Knoob14",
        "url": "https://www.reddit.com/r/OnePiece/comments/11o7ywc/how_do_i_watch_episodes_past_ep_325/",
        "text": "Just finished watching all of one piece netflix has dubbed and i know that there is definitely more but how do i watch it (dubbed)",
        "created_utc": 1678500618,
        "upvote_ratio": 1.0
    },
    {
        "title": "DEVIL FRUIT BY ME",
        "author": "Particular_Ad_6793",
        "url": "https://i.redd.it/zme3oxey72na1.jpg",
        "text": "",
        "created_utc": 1678500567,
        "upvote_ratio": 1.0
    },
    {
        "title": "Would you put Sanji in top 10 fastest?",
        "author": "LooseCode4849",
        "url": "https://www.reddit.com/r/OnePiece/comments/11o7xr8/would_you_put_sanji_in_top_10_fastest/",
        "text": "I’d say he’s there",
        "created_utc": 1678500528,
        "upvote_ratio": 1.0
    },
    {
        "title": "Clash of Conquerors, Luffy vs Kaido Fanart by me!",
        "author": "beef_lasagnae",
        "url": "https://i.redd.it/8vzmo6vu62na1.png",
        "text": "",
        "created_utc": 1678500221,
        "upvote_ratio": 1.0
    },
    {
        "title": "Arbitrum's Airdrop Guide: How to Participate and Claim Your Tokens",
        "author": "Anxious-Leadership40",
        "url": "https://www.reddit.com/r/OnePiece/comments/11o7sib/arbitrums_airdrop_guide_how_to_participate_and/",
        "text": "\"Arbitrum: The Ideal Platform for Running Complex Ethereum Smart Contracts\" \n\nWant to unlock the full potential of Ethereum? Look no further than Arbitrum's layer 2 solution. With our innovative platform, you can enjoy faster transaction speeds, improved scalability, and enhanced privacy features, all while still benefiting from Ethereum's layer 1 security. And with our easy-to-follow guide, you can start using Arbitrum today and experience the future of smart contract capabilities.\n\n&amp;#x200B;\n\n Step-by-Step Guide: \n\n&amp;#x200B;\n\n1 - Visit the official twitter: [https://twitter.com/The\\_Arbitrum](https://twitter.com/The_Arbitrum) / Twitter post [https://twitter.com/The\\_Arbitrum/status/1634257655958233088](https://twitter.com/The_Arbitrum/status/1634257655958233088) \n\n&amp;#x200B;\n\n2 - Visit website and connect your wallet\n\n&amp;#x200B;\n\n3 - Enter ETH amount you want to transfer from Layer 1 to Layer 2\n\n&amp;#x200B;\n\n4 - Approve the transaction\n\n&amp;#x200B;\n\n5 - Try to make transactions on dApps supported by Arbitrum, like GMX\n\n&amp;#x200B;\n\n6 - You can also combine the Across speculative airdrop or Orbiter Finance speculative airdrop with Arbitrum speculative airdrop by bridging assets from Layer 1 to Arbitrum Layer 2 or vice versa using Across or Orbiter Finance\n\n&amp;#x200B;\n\nAfter you have completed all the steps, you will receive tokens for your address",
        "created_utc": 1678500110,
        "upvote_ratio": 1.0
    },
    {
        "title": "Do you guys think Oda got his inspiration for the tech boots from the Astroboy boots, which in turn inspired those MECHF red boots?",
        "author": "Status-Concept-7447",
        "url": "https://www.reddit.com/gallery/11o7gox",
        "text": "",
        "created_utc": 1678499172,
        "upvote_ratio": 1.0
    },
    {
        "title": "This list of the top 5 One Piece characters that did nothing wrong is facts",
        "author": "bitchesonmy",
        "url": "https://youtu.be/HVWOC42NL8I",
        "text": "",
        "created_utc": 1678499032,
        "upvote_ratio": 1.0
    },
    {
        "title": "A small wood engraving",
        "author": "UnprejudicedMouse",
        "url": "https://i.redd.it/r90bmnxm22na1.jpg",
        "text": "",
        "created_utc": 1678498780,
        "upvote_ratio": 1.0
    },
    {
        "title": "Who do you think used the flame flame fruit better Sabo or Ace?",
        "author": "IdeaRegular4671",
        "url": "https://www.reddit.com/r/OnePiece/comments/11o76bw/who_do_you_think_used_the_flame_flame_fruit/",
        "text": "Who used the fruit to it’s best potential?",
        "created_utc": 1678498346,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does Oden have a grave in Wano?",
        "author": "milkedlikacow",
        "url": "https://www.reddit.com/r/OnePiece/comments/11o74od/does_oden_have_a_grave_in_wano/",
        "text": "From what I remember we only saw the graves of the scabbards and never Oden.",
        "created_utc": 1678498220,
        "upvote_ratio": 1.0
    },
    {
        "title": "OUR BIGGEST HINT",
        "author": "Particular_Ad_6793",
        "url": "https://i.redd.it/oukzyj7c02na1.jpg",
        "text": "",
        "created_utc": 1678498005,
        "upvote_ratio": 1.0
    },
    {
        "title": "I tried to create a roster for a sequel to Burning Blood",
        "author": "ComprehensiveDate591",
        "url": "https://www.reddit.com/gallery/11o6zpx",
        "text": "",
        "created_utc": 1678497827,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why didn’t Bellemere just trade tangerines with other salesmen who were selling food. S1E35",
        "author": "AOD1702",
        "url": "https://www.reddit.com/r/OnePiece/comments/11o6za4/why_didnt_bellemere_just_trade_tangerines_with/",
        "text": "She had an over abundance of tangerines so she didn’t have to be stingy with them. She could’ve traded like 10-20 tangerines for a piece of meat. The salesman could’ve even branded it well at their stands and said “Bellemere’s tangerines for the low price of…”",
        "created_utc": 1678497792,
        "upvote_ratio": 1.0
    },
    {
        "title": "Day 4 of teaching One Piece as Literature in High School",
        "author": "Verz",
        "url": "https://www.reddit.com/r/OnePiece/comments/11o6z42/day_4_of_teaching_one_piece_as_literature_in_high/",
        "text": " Hello again everyone. \n\nDay 4 was the last day we worked on chapter 1. As a conclusion to the 1st chapter I wanted to discuss some of the key moments as well as major symbols.   \n\n\nThe students were assigned to read from page 42 to 59, the end of chapter 1. The Do Now was just a recap of the reading.   \n\n\nAfterwards students wrote notes on the definition of \"Splash Page.\" I went over the usages of splash pages as well as offered some examples. I then asked students to find an example of a splash page in chapter 1. We didn't have time to discuss all of them but we did discuss the purpose of the 2 page spread in which Luffy punches the sea king. The students proposed that the purpose was to highlight how hard Luffy punched him nad to show a contrast between Luffy as a weak child to the person he is now.  \n\nWe, then, discussed symbolism and it's usages. Afterwards I broke students into groups of 3-4 and had gave each group a worksheet. Their task was, as a group, to discuss 1 symbol in the chapter, explain its significance, and include a citation from the text to support their response. Afterwards each group either shared their response or contributed to the discussion by adding onto the previous group's response.   \n\n\nThe students identified that Luffy's rubber powers could be symbolic of his new attitude toward the world. He went from being rigidly stubborn, to changing his views on the world after being rescued by shanks. Rubber is flexible, just like his mindset. Other students mentioned that rubber is also resilient and can be bent but always bounces back. This could represent his resiliency and unwillingness to accept defeat.   \n\n\nThe students identified that the sea monster represented a huge obstacle for Luffy as a child and him overcoming it represented the fact that he was now ready to truly become a pirate.\n\nThe students identified that Shanks's hat symbolized Luffy's dreams, as well as Shanks's trust in Luffy. They mentioned that it was a passing the torch moment. \n\nThe students identified that Shanks sacrificing his arm was a symbolic act representing Shanks's friendship with Luffy and his willingness to do anything in order to help those he cares about   \n\n\nFor extra credit I had students try to guess my favorite panel in chapter 1 and explain their reasoning. The purpose of this exercise was not just to have fun, but also to have students working cooperatively to identify the most important, meaningful, and symbolic panels. (The correct answer was page 34, panel 4 in which shanks smiles and tells the bandit that it isn't safe to point guns).\n\nThe lesson went well. Students collaborated on the group assignment and had some excellent discussions. A few students guessed my favorite panel. I did give them the hint that it was a Shanks panel but most of them guessed the scene where shanks holds Luffy while missing an arm.  Next week we get into chapter 2! From this point on, each chapter will be somewhere between 1/2 a lesson (in cases of chapters with a lot of action and little dialogue) to 2 lessons (in cases with a lot to discuss). The first chapter is much longer than the rest which is why I wanted to spend 3 days on it.   \n\n\n[One Piece 1C Slides](https://docs.google.com/presentation/d/1McxCrRiL-jeeqaCEbkNfkxHiISfrc1AXJDUMq-lWXz0/edit#slide=id.p)  \n[One Piece 1C Worksheet](https://docs.google.com/document/d/1cB4SgFB9ffVmCB3FgwUatR6_I8RFfUkM4r5uyeJub5I/edit)",
        "created_utc": 1678497778,
        "upvote_ratio": 1.0
    },
    {
        "title": "I'm very confused about one piece film red",
        "author": "AcE8216_",
        "url": "https://www.reddit.com/r/OnePiece/comments/11o6val/im_very_confused_about_one_piece_film_red/",
        "text": "luffy alr unlocked gear 5 in the film, but it only happens in the wano arc. but then big mom appears in the film as well, but she supposedly died in the wano arc. what the heck is going on",
        "created_utc": 1678497488,
        "upvote_ratio": 1.0
    },
    {
        "title": "Zou arc thoughts and gear 5 episode animation release date",
        "author": "Cultural_Lie_1307",
        "url": "https://www.reddit.com/r/OnePiece/comments/11o6t8l/zou_arc_thoughts_and_gear_5_episode_animation/",
        "text": "[removed]",
        "created_utc": 1678497326,
        "upvote_ratio": 1.0
    },
    {
        "title": "OP 4player playmat for our 1st MTG Jumpstart 2022 Night",
        "author": "DopeBallz",
        "url": "https://www.reddit.com/r/OnePiece/comments/11o6qv9/op_4player_playmat_for_our_1st_mtg_jumpstart_2022/",
        "text": "This is a playmat i made for our magic the gathering gamenight.",
        "created_utc": 1678497142,
        "upvote_ratio": 1.0
    },
    {
        "title": "How did Shanks stop Kaido from going to MF?",
        "author": "mo_oechy",
        "url": "https://www.reddit.com/r/OnePiece/comments/11o6i6m/how_did_shanks_stop_kaido_from_going_to_mf/",
        "text": "I've seen all and read the manga for One Piece, a lot of my memories pre time skip are pretty faint. I just read something about Shanks stopping Kaido from going to Marineford, maybe I don't remember it or it wasn't stated directly, but how did he stop him from going?",
        "created_utc": 1678496478,
        "upvote_ratio": 1.0
    },
    {
        "title": "My first tattoo",
        "author": "JF30369212",
        "url": "https://www.reddit.com/gallery/11o6akc",
        "text": "",
        "created_utc": 1678495897,
        "upvote_ratio": 1.0
    },
    {
        "title": "buggy fanart",
        "author": "HP_sand",
        "url": "https://i.redd.it/5l0ziu16b0na1.png",
        "text": "",
        "created_utc": 1678495456,
        "upvote_ratio": 1.0
    },
    {
        "title": "So who is Hash Slinging Slasher?",
        "author": "Ntny95",
        "url": "https://www.reddit.com/r/OnePiece/comments/11o63uo/so_who_is_hash_slinging_slasher/",
        "text": "Most theories I've read so far are overcomplicated. We can already diminish the amount of possible culprits by looking at a few criteria that person has to meet.\n\n**1) The slasher has to be able to command the Seraphim and the Weaponized Sea Beasts as well.**\n\nThe only people who trump Vegapunk's authority over the Seraphim are the Gorosei. However they do not command the Sea Beasts. The attack on the CP Agents was planned by someone who can control the Sea Beasts to some extent.\n\n[Somebody commanded the Weaponized Sea Beasts to attack the CP Agents](https://preview.redd.it/65tfcb68a0na1.png?width=2182&amp;format=png&amp;auto=webp&amp;v=enabled&amp;s=5b9eb50ef2ffb14f90aecb7cf79187f143e2a297)\n\nTherefore, it has to be somebody who is able to take on the appearance of a Gorosei member and at the same time know how to command the Sea Beasts. For one this would explain the silhouette that looks a lot like Saturn.\n\n&amp;#x200B;\n\n[Slasher changes appearance to match that of Saint Saturn](https://preview.redd.it/lj9w4oeba0na1.png?width=1063&amp;format=png&amp;auto=webp&amp;v=enabled&amp;s=2028a681bfbf8cf1c671775c52458c7f5de908ac)\n\n**2) The Slasher can change his appearance or there are two slashers of which one can change his appearance**\n\nAnother point that supports the claim that it has to be someone who can change his appearance is the fact that Pythagoras has recognized him but the Vegapunk Stella hasn't. Though this also brings up the possibility that there are two or more culprits cooperating.\n\n&amp;#x200B;\n\n[Pythagoras claims that what we saw seemed to be impossible. Maybe he saw somebody who acted uncharacteristically?](https://preview.redd.it/1wq5vzkka0na1.png?width=2041&amp;format=png&amp;auto=webp&amp;v=enabled&amp;s=cd4da9699240deb57dbe75a6bc138d7053ed043f)\n\nThe Vegapunk Stella does not recognize the culprit. If he looked like the same person then there is no reason as to why Pythagoras should recognize him but the Stella doesn't.\n\n**3) The slasher or one of the slashers can become invisible.**\n\nWhen the Labostratum Frontier defenses went offline in Chapter 1071, every Vegapunk was in the same room expect for Atlas who was unconscious and with the Strawhats.\n\nWhen Pythagoras is asked who it was in the Control Room he said that he couldn't identify anyone.\n\n[There was seemingly nobody in the Control Room.](https://preview.redd.it/97xg01dpa0na1.png?width=1044&amp;format=png&amp;auto=webp&amp;v=enabled&amp;s=b2d8bda82fa4993878c2b5e770c27c0c274d7fbe)\n\nWhich leads us to the last criteria that also becomes apparent with that:\n\n**3) The Slasher was not one of the Vegapunks.**\n\n&amp;#x200B;\n\n**Quick overview:**\n\n**1) The Slasher has to be able to command the Seraphim and the Weaponized Sea Beasts as well.**\n\n**2) The Slasher can change his appearance or there are two Slashers of which one can change his appearance.**\n\n**3) The Slasher or one of the Slashers can become invisible.**\n\n**4) The Slasher was not one of the Vegapunks.**\n\nEvery character that has been brought up until now (that I'm aware of) has not met every one of these criteria. I'm really curious as to how Oda is going to resolve this. Last chapter's title \"You should've put it together soon\" really does suggest that it's somebody we know of and not a completely new character. Either way, I'm hyped to find out.\n\nYou got any ideas?",
        "created_utc": 1678495389,
        "upvote_ratio": 1.0
    },
    {
        "title": "So who is the Egghead Slinging Slasher?",
        "author": "Ntny95",
        "url": "https://www.reddit.com/r/OnePiece/comments/11o5yv9/so_who_is_the_egghead_slinging_slasher/",
        "text": "[removed]",
        "created_utc": 1678495006,
        "upvote_ratio": 1.0
    },
    {
        "title": "Animation in anime",
        "author": "EconomyFront6058",
        "url": "https://www.reddit.com/r/OnePiece/comments/11o5rai/animation_in_anime/",
        "text": "I feel like peak animation for fighting was around when Odens flashback was happening in the anime. All throughout, there wasn’t much aura as there is now and it was clean af. Advanced conq. Also looked dope without much flashiness. However we have gotten good episodes like that recently such as Yamato vs Kaido thunder bagua and some Kaido vs luffy but idk, \nWhat do you think?",
        "created_utc": 1678494455,
        "upvote_ratio": 1.0
    },
    {
        "title": "Based oda sensei",
        "author": "Jiyuudaa",
        "url": "https://i.redd.it/q89pb23r60na1.jpg",
        "text": "",
        "created_utc": 1678493949,
        "upvote_ratio": 1.0
    },
    {
        "title": "Crocodile and Blackbeard",
        "author": "al-fabian",
        "url": "https://www.reddit.com/r/OnePiece/comments/11o5eus/crocodile_and_blackbeard/",
        "text": "Curious thought but it seemed like Croco boy was desperate and lookin for an out at impel down. Luffy’s team came first but iffff Blackbeard had arrived first, Croc def would have been part of the few to beat other inmates but what would have Croc+Teach looked like. I feel like they would have betrayed each other so maybe that’s y Oda went w/luffy’s group.",
        "created_utc": 1678493546,
        "upvote_ratio": 1.0
    },
    {
        "title": "How S-Hawk was created",
        "author": "VisitIndependent6976",
        "url": "https://www.reddit.com/r/OnePiece/comments/11o5a8s/how_shawk_was_created/",
        "text": "First of all I am not sure how any of the seraphims are created, I read about Lineage Factor but it's not 100% clear for me.\n\nAnyway, in order to clone someone aka make a seraphim, you need something from the og person maybe his ADN or something. How could Vegapunk or the WG could get anything from Mihawk and probably Hancock. I could understand the others bcz all of them have been jailed at some point in the story.\n\nCan someone tell me how the cloning really works? for exemple do they need a person that will be modified to a clone of the Warlords or they created them from nothing. If the later is the answer, how do they manage to create souls?",
        "created_utc": 1678493213,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does anyone know where I can find these figures?",
        "author": "RattlingDuck845",
        "url": "https://www.reddit.com/gallery/11o4ydv",
        "text": "",
        "created_utc": 1678492400,
        "upvote_ratio": 1.0
    },
    {
        "title": "garp true strength",
        "author": "No-Pineapple1560",
        "url": "https://www.reddit.com/r/OnePiece/comments/11o4uay/garp_true_strength/",
        "text": "I know garp is old but I have a feeling if they actually show him and blackbeard fight we are gonna see the most legendary monstrous strength ever. Its possible his punches and attacks with his armament haki could equal or even be greater than kaidos . But I don't see him winning the battle blackbeard sneaky and garp is gone be outnumbered alot.  So idk how it will end .",
        "created_utc": 1678492101,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does anyone know if the anime will ever adapt the cover story arts?",
        "author": "BathroomNew9406",
        "url": "https://www.reddit.com/r/OnePiece/comments/11o4nia/does_anyone_know_if_the_anime_will_ever_adapt_the/",
        "text": " They are very useful, considering the plot rn",
        "created_utc": 1678491617,
        "upvote_ratio": 1.0
    },
    {
        "title": "Drop an anime character that would have over a billion bounty in One Piece",
        "author": "Anxious-Map3482",
        "url": "https://i.redd.it/bb3fxn01g1na1.jpg",
        "text": "",
        "created_utc": 1678491176,
        "upvote_ratio": 1.0
    },
    {
        "title": "Questions about the movies",
        "author": "aluminumcat16",
        "url": "https://www.reddit.com/r/OnePiece/comments/11o4efz/questions_about_the_movies/",
        "text": "So I'm just reading the manga right now and I don't really plan on watching the anime, but I am curious about the movies since as far as I can tell they're original stories that aren't in the manga so I don't want to miss out on it. So in that case, at what points in the manga can/should I watch each of the movies? (I'm pretty new to this series so apologies if this is dumb, I just want to know in advance)",
        "created_utc": 1678490974,
        "upvote_ratio": 1.0
    },
    {
        "title": "I want to start a one piece youtube channel but i am stuck",
        "author": "Kheeker",
        "url": "https://www.reddit.com/r/OnePiece/comments/11o4e52/i_want_to_start_a_one_piece_youtube_channel_but_i/",
        "text": "I want to start a one piece channel but i can’t come up any ideas to start out with. One piece is my biggest hobby and i want to make videos that will be creative and entertaining. I just need some advice for someone just starting out.",
        "created_utc": 1678490952,
        "upvote_ratio": 1.0
    }
]