[
    {
        "title": "One Piece anime re-watch",
        "author": "Sora_TheOne",
        "url": "https://www.reddit.com/r/OnePiece/comments/11fh712/one_piece_anime_rewatch/",
        "text": "One Piece re-watches are great. Always notice new things in older arcs because you know what to look for. And there’s always around 50 “new” episodes to watch!",
        "created_utc": 1677702901,
        "upvote_ratio": 1.0
    },
    {
        "title": "Average Karoo Enjoyer, by me",
        "author": "Forsaken_Duck1610",
        "url": "https://i.redd.it/jthw044q98la1.png",
        "text": "",
        "created_utc": 1677702111,
        "upvote_ratio": 1.0
    },
    {
        "title": "fanart Luffy drawing",
        "author": "SquirrelInevitable53",
        "url": "https://i.redd.it/70420u3498la1.jpg",
        "text": "",
        "created_utc": 1677701902,
        "upvote_ratio": 1.0
    },
    {
        "title": "My opinion about One Piece (and why it’s in its current state)",
        "author": "Lynx-Sufficient",
        "url": "https://www.reddit.com/r/OnePiece/comments/11fglz6/my_opinion_about_one_piece_and_why_its_in_its/",
        "text": "Disclaimer: THIS IS JUST MY OPINION, PLEASE DON’T COME AFTER ME FOR THIS. I JUST NEEDED AN OUTLET TO TALK ABOUT THIS. \n\n\nAs you probably already know, One Piece’s popularity has been declining, slowly and surely since the time skip. Not only are the amount of chapters intimidating to a new reader, causing them to not pick up the manga/anime, but OP has been losing many fans along the years as well. And this post will be discussing my opinion on why that is, and how this issue cannot be prevented, especially as OP is in its very last saga.\n\nThe issue itself:\nFrom the very beginning, Luffy has stated that he wanted 10 crew mates. And now that quota has likely been filled there won’t be any more new characters introduced to join the cast as a regular and aside from Jinbei and Law, there hasn’t been any long staying members that have been active for more than 1 arc, however you can make an argument for Carrot, but she isn’t a part of this issue. The reason why the earlier pre timeskip arcs were so emotional and gripping was because of the characters. Their previous trauma, how Luffy helps them overcome this. The characters provided the emotional drive for the arcs. Look at Arlong Park with Nami, the arguably best arc in East Blue, or Alabasta with Vivi. Not to mention Water 7 + Enies Lobby with Robin, Usopp and Franky, hell even Going Merry. Almost every saga had a moment, where the characters broke down and needed Luffy’s help.\n\nThese moments drove the story, they were the moments that readers wanted to see the most, not fights that drag on for months. As cool as the fights are, they are just the cherry on top of an amazing cake, but no one will care about the cherries if the cake isn’t up to standard. And that is what has been happening to One Piece since timeskip. When you think of the best chapters from pre timeskip sagas, the character moments are right up there with the defeat of the big bad, maybe even higher. Robin’s “I want to live”, when Ace dies, Zoro’s speech about respect. Above all else, these moments always revolved around a crew member. Usually, you’ve already spent many arcs with them, and you’ve grown attached, which only make these moments stronger. \n\nThe problem with post timeskip and why a lot of fans has dropped OP is because those moments disappeared. Crew members stopped joining. The inkwell had ran dry. I found it harder and harder to care about the side characters introduced. From start to end, I could not bring myself to care about Momonosuke, or Rebecca. These emotional drives become less meaningful. You can even see evidence of this from pre timeskip. Skypiea and Jaya is commonly regarded as the worst pre timeskip saga up there with Thriller Bark. And this is because there were no emotional plots in either arc, at least not one we cared about. \n\nWano: \nFor me, this issue became impossible to ignore in Wano. It seemed like Oda had just thrown away the emotional plot completely and instead focused solely on combat. There was no character whose emotional turmoil drove the plot. The arc offers no emotional character development of any of the main cast and often sidelined them for characters that seem one off (like did some of the characters really need to play a big role. I’m looking at you Inuarashi and Nekomamushi). These are characters that we’ve spent no time with, and yet are suddenly expected to care about. \nAnd then, there is the massive disappointment of a villain that is Kaido, imo possibly the worst main antagonist since the unfortunate Gecko Moria. He wasn’t a misunderstood character, he doesn’t have some grand scheme, he wasn’t set up pre Wano except as the “big scary guy Luffy will have to face eventually” unlike Doflamingo, he doesn’t have many interactions or personal connections with the main cast, and he doesn’t have much of a backstory. He’s just nothing. He’s a bland one dimensional character existing purely as a wall for Luffy to overcome. And while there isn’t inherently anything wrong with that, the main antagonist of a plot thread lasting for hundreds of chapters should have something more to them, even just a compelling reason to their actions in the plot. \nIt’s not as if Oda never wrote anything emotional post timeskip. Law’s backstory with Doffy was some of the best in manga. And while Sanji’s “betrayal” and rejoining wasn’t as heavily focused on as Robin or Usopp, it was still the highlight of WCI for me. Overall, WCI just has more compelling side characters and a better main conflict than Wano. \n\nWhat I’m hoping from Egghead or future arcs:\nTo be completely honest, I don’t think OP will ever again reach the emotional high points of Marineford or Enies Lobby, the setting simply isn’t there. All the main crew’s personal problems have been solved and there is not enough time for a new character to be introduced and have their conflict be resolved without it feeling rushed and forced. At this point, I’m just interested in how all remaining plot points are resolved cause holy shit there are a lot of them. And I’m hoping that the satisfaction will make up for the emotional moments. \n\nTL;DR:\nOda gave up on emotional character driven plot points and sacrificed it for the combat and meaningless side characters. \n\nFeel free to reply and let me know other’s thoughts, whether you agree, disagree, or think my opinion is absolute trash and that Oda is a god of masterful writing and can do no wrong.",
        "created_utc": 1677701867,
        "upvote_ratio": 1.0
    },
    {
        "title": "drawing variation form luffy",
        "author": "SquirrelInevitable53",
        "url": "https://i.redd.it/yxi5cco078la1.jpg",
        "text": "",
        "created_utc": 1677701197,
        "upvote_ratio": 1.0
    },
    {
        "title": "drawing gear 5 Luffy for the first time!!!!!!! please rate!!!",
        "author": "SquirrelInevitable53",
        "url": "https://i.redd.it/vsgf3n7p58la1.jpg",
        "text": "",
        "created_utc": 1677700754,
        "upvote_ratio": 1.0
    },
    {
        "title": "about sbs 105 relating to sanji.",
        "author": "Confusedboomer1",
        "url": "https://www.reddit.com/r/OnePiece/comments/11ffr0w/about_sbs_105_relating_to_sanji/",
        "text": "I was speaking to someone who reads the japanese manga and sbs and this is what they said.\n\nIn the Japanese text, it's not written that Sanji's resistance to fire is due to the \"power of science\". It's just stated that Sanji already had an extraordinary resistance to fire before the \"power of science\" began to manifest in his body.\n\nAnd it's not written \"but now it finally makes sense\". It's just written that Sanji's extraordinary resistance to fire was strange, but there's no confirmation that it's really due to Judge's genetic modification.\n\nHe goes on to say that the translator project their own thoughts and edited the text making it inaccurate.",
        "created_utc": 1677700741,
        "upvote_ratio": 1.0
    },
    {
        "title": "How would Wanokuni arc change if Ace was there (you can give a power up if you want)",
        "author": "The_Mexican_Poster",
        "url": "https://i.redd.it/ywdmdugi48la1.jpg",
        "text": "",
        "created_utc": 1677700358,
        "upvote_ratio": 1.0
    },
    {
        "title": "Im a bit confused (Wano spoilers)",
        "author": "Putrid_Candy_8799",
        "url": "https://www.reddit.com/r/OnePiece/comments/11ff7x9/im_a_bit_confused_wano_spoilers/",
        "text": "When Kin’emon talks about the past, at that him and mononosuke are from the past, we see kid versions of Cat viper and dogstorm, but that was 20 years ago, so how come the wiki says that they are both 40. Should’nt they both only be around 30?",
        "created_utc": 1677700120,
        "upvote_ratio": 1.0
    },
    {
        "title": "A Sanji I drew a while ago when I started WCI",
        "author": "Lalalula05",
        "url": "https://i.redd.it/qh87157e38la1.jpg",
        "text": "",
        "created_utc": 1677699978,
        "upvote_ratio": 1.0
    },
    {
        "title": "I asked Midjourney to imagine Furiko, Pinzoro, Arashi and Tera from Zoro's Family Tree.",
        "author": "Luse91",
        "url": "https://i.redd.it/kg7doxkwk6la1.png",
        "text": "",
        "created_utc": 1677699832,
        "upvote_ratio": 1.0
    },
    {
        "title": "Optimism $OP token is confirmed.",
        "author": "dktmah",
        "url": "https://www.reddit.com/r/OnePiece/comments/11fexx8/optimism_op_token_is_confirmed/",
        "text": "OP token. ($OP) Token $OP airdrop Guide visit official site: Start 02.28.23 https://twitter.com/CMOIBFE/status/1630578953940353027",
        "created_utc": 1677699799,
        "upvote_ratio": 1.0
    },
    {
        "title": "[One Piece AMV] Just a Man..",
        "author": "Dreamsnodebt",
        "url": "https://youtu.be/2YcAmUIjrpY",
        "text": "",
        "created_utc": 1677699067,
        "upvote_ratio": 1.0
    },
    {
        "title": "Do people really think Sanji &gt; Zoro?",
        "author": "YungLaddy1",
        "url": "https://www.reddit.com/r/OnePiece/comments/11fdape/do_people_really_think_sanji_zoro/",
        "text": "I've been reading One Piece for a while and I completed the anime aswell, but I've never been too heavily involved with the series' fandom until recently. Do people really think Sanji is a strong character than Zoro? Don't get me wrong, I love both characters, but I've been seeing people having all these crazy takes about Sanji and I just don't get it. Even the whole \"vice-captain\" argument seems played out because it's obviously Zoro. He was the first one (aside from Luffy) to join the crew, he's always fought the second strongest in arcs and always had the highest bounties, aside from the WCI debacle. Am I missing some type of inside joke? would love to know. Please don't start one of those petty arguments",
        "created_utc": 1677697932,
        "upvote_ratio": 1.0
    },
    {
        "title": "Decided to get my first tattoo and of who else than Luffy.",
        "author": "hooj1",
        "url": "https://i.redd.it/dcditj5td6la1.jpg",
        "text": "",
        "created_utc": 1677697315,
        "upvote_ratio": 1.0
    },
    {
        "title": "Fun fact : U love law because of his voice actor.",
        "author": "Viper200457",
        "url": "https://i.redd.it/8e6thyget7la1.jpg",
        "text": "",
        "created_utc": 1677696619,
        "upvote_ratio": 1.0
    },
    {
        "title": "What language are the characters speaking?",
        "author": "MrNesti",
        "url": "https://www.reddit.com/r/OnePiece/comments/11fc0yh/what_language_are_the_characters_speaking/",
        "text": "Many would say Japanese, but Sanji for example, is french, so he would obviously think french right? Yet his thoughts are translated to Japanese/the language your watching it in. So is probably almost every other word spoken, get me? And I was wondering, what language the characters are speaking, since the strawhats alone each come from a different country, and English wasnt really taught in schools outside of GB/USA until the later half of the 20th century",
        "created_utc": 1677696517,
        "upvote_ratio": 1.0
    },
    {
        "title": "I just caught up with the manga!!! Chapter 1076",
        "author": "Realistic-Bad-9727",
        "url": "https://www.reddit.com/r/OnePiece/comments/11fbzqz/i_just_caught_up_with_the_manga_chapter_1076/",
        "text": "Im now excited to read the next chapter, are we really seeing shanks in action? I just started liking kid and how he never flees from a fight but I don’t see him standing a chance a faints shanks \n\nPlus I’m worried about law, I’m pretty sure that Blackbeard is the main villain till this point so there is no chance of trafalgar to win this one (he is one of my favorite characters) but on the other hand I don’t see oda killing him at this point of the story \n\nWhat you guys think?",
        "created_utc": 1677696479,
        "upvote_ratio": 1.0
    },
    {
        "title": "something needs to be done about the pacing.",
        "author": "Tall_Confection4693",
        "url": "https://www.reddit.com/r/OnePiece/comments/11fbvha/something_needs_to_be_done_about_the_pacing/",
        "text": "[removed]",
        "created_utc": 1677696347,
        "upvote_ratio": 1.0
    },
    {
        "title": "Zoro Drawing",
        "author": "KayGaming1",
        "url": "https://i.redd.it/q9tyv1fp96la1.jpg",
        "text": "",
        "created_utc": 1677695916,
        "upvote_ratio": 1.0
    },
    {
        "title": "Who’s the better Boxer",
        "author": "BillyBobReddit124",
        "url": "https://www.reddit.com/r/OnePiece/comments/11fbj5x/whos_the_better_boxer/",
        "text": "&amp;#x200B;\n\nhttps://preview.redd.it/h080hi9r96la1.jpg?width=756&amp;format=pjpg&amp;auto=webp&amp;v=enabled&amp;s=c26924267d904c0b4efd069a0a69f89e467639a0\n\nhttps://preview.redd.it/8nisgk9r96la1.jpg?width=633&amp;format=pjpg&amp;auto=webp&amp;v=enabled&amp;s=703e7a022913d26fd06b8bf98377cba51f832a88",
        "created_utc": 1677695915,
        "upvote_ratio": 1.0
    },
    {
        "title": "Monster Trio mothers:",
        "author": "Shoddy-Ad-4585",
        "url": "https://i.redd.it/kzggw0oz86la1.jpg",
        "text": "",
        "created_utc": 1677695674,
        "upvote_ratio": 1.0
    },
    {
        "title": "Chalk Jinbe",
        "author": "oleapit",
        "url": "https://i.redd.it/kavvk8o3o7la1.jpg",
        "text": "",
        "created_utc": 1677694840,
        "upvote_ratio": 1.0
    },
    {
        "title": "Law ft. Bo Burnham lyrics",
        "author": "flashilydraws",
        "url": "https://v.redd.it/oyvvcdszn7la1",
        "text": "",
        "created_utc": 1677694820,
        "upvote_ratio": 1.0
    },
    {
        "title": "Episode List to watch",
        "author": "Broccoil",
        "url": "https://www.reddit.com/r/OnePiece/comments/11fase9/episode_list_to_watch/",
        "text": "hi keeping it short. \n\nI don't want to watch the entire show, is there a possibility someone has a list of episodes where interesting/ things of note happen? I don't want to waste my time with unimportant episodes so if someone could direct me to a list that would be great thanks",
        "created_utc": 1677694219,
        "upvote_ratio": 1.0
    },
    {
        "title": "Y’all are asking tha chop for the literal cure to cancer lmao",
        "author": "Spinach_Technical",
        "url": "https://i.redd.it/uk7d6e54m7la1.jpg",
        "text": "",
        "created_utc": 1677694166,
        "upvote_ratio": 1.0
    },
    {
        "title": "I drew &amp; printed bounty posters for me and my friends as a pirate crew!",
        "author": "FelipeKits",
        "url": "https://www.reddit.com/gallery/11farcl",
        "text": "",
        "created_utc": 1677694151,
        "upvote_ratio": 1.0
    },
    {
        "title": "Nico Robin cosplay by me",
        "author": "meloly_senpai",
        "url": "https://i.redd.it/8wbq0ur0m7la1.jpg",
        "text": "",
        "created_utc": 1677694139,
        "upvote_ratio": 1.0
    },
    {
        "title": "Oda casually dropping Zoro's entire bloodline in an SBS confirms to me that a Major story arc for Zoro was cut from Wano arc. What a shame",
        "author": "knyghtmare45",
        "url": "https://youtu.be/HN94jTRkW6Q",
        "text": "",
        "created_utc": 1677693611,
        "upvote_ratio": 1.0
    },
    {
        "title": "question on Manga luffy",
        "author": "Silly_Performance_76",
        "url": "https://www.reddit.com/r/OnePiece/comments/11fahyk/question_on_manga_luffy/",
        "text": "(SPOILER) does luffy in 5th gear have any restance to blades and sharp objects or is he still weak to that kind of stuff?",
        "created_utc": 1677693586,
        "upvote_ratio": 1.0
    },
    {
        "title": "Arlong vs Mr. 2 (Alabasta Level) at Arlong Park",
        "author": "Hijukonama",
        "url": "https://www.reddit.com/r/OnePiece/comments/11fahqw/arlong_vs_mr_2_alabasta_level_at_arlong_park/",
        "text": "Who would takes this between Arlong and Bon Clay at his Alabasta level if the fight takes place at Arlong Park ?",
        "created_utc": 1677693571,
        "upvote_ratio": 1.0
    },
    {
        "title": "An actual unpopular opinion. The anime has elevated the manga a hundredfold, auras and all.",
        "author": "shaqkage",
        "url": "https://www.reddit.com/r/OnePiece/comments/11fahbr/an_actual_unpopular_opinion_the_anime_has/",
        "text": "I'm expecting this to get downvoted and not get any attention, but it's better than a comment.\n\nEveryday I see more and more people complaining about the anime, with the \"shitty\" auras, DBZ sound effects, horrible pacing, etc. The only point I can *somewhat* see is the bad pacing, but even that is bearable for me. I honestly can't believe how you can watch these rooftop fights and say that it looks bad. People are saying that they couldn't even see anything with the auras? Are you blind? The auras really show how much of a beast these characters have become. Without them it would be hard to tell the difference between this Luffy and Dressrosa Luffy. The only thing that changed is the opponent, so him being ACTUALLY stronger is shown through the effects. You know, like every other shonen out there...\n\nAnother thing I hear is that people are mad that it looks/sounds like Dragon Ball. Ok, so y'all just don't like Dragon Ball is what I'm getting? The fact that my favorite series(One Piece) is resembling a show that I grew up with(DBZ) is phenomenal to me.\n\nAll in all, I hope that the anime keeps looking like this because without this level of animation the anime is nothing, and I'd just keep reading the manga without looking back.\n\nAnd if you don't like it, just don't watch it man, you complaining is not helping anybody. Many will hate me for this but criticism is not the answer to anything. The world would be a much better place without it.\n\n&gt;!damn it feels good to get that off my chest!&lt;",
        "created_utc": 1677693543,
        "upvote_ratio": 1.0
    },
    {
        "title": "Luffy vs lucci trailer #2 by, me",
        "author": "ClientIntrepid",
        "url": "https://youtu.be/xKmEt-K4Aks",
        "text": "",
        "created_utc": 1677693263,
        "upvote_ratio": 1.0
    },
    {
        "title": "Monster Trio mothers",
        "author": "Shoddy-Ad-4585",
        "url": "https://www.reddit.com/r/OnePiece/comments/11fabfs/monster_trio_mothers/",
        "text": "so with the new SBS it was revealed that Zoro's mother's name is Terra (meaning **earth**)\n\nAnd Sanji's mother's name is Sora (meaning **sky**)\n\nso that means that Luffy's mother's name could be  Akua/ Aqua or something that means **water**\n\nSo we have:\n\n* Sanji- Sora = SKY\n* Zoro- Terra = EARTH\n* Luffy-  Akua?  = WATER",
        "created_utc": 1677693156,
        "upvote_ratio": 1.0
    },
    {
        "title": "Shonen Jump WCF Luffy ☀",
        "author": "julienrey30",
        "url": "https://www.reddit.com/gallery/11fa96u",
        "text": "",
        "created_utc": 1677693006,
        "upvote_ratio": 1.0
    },
    {
        "title": "Maybe that's why Zoro became pirate hunter",
        "author": "Strange_017",
        "url": "https://www.reddit.com/r/OnePiece/comments/11fa5iy/maybe_thats_why_zoro_became_pirate_hunter/",
        "text": "[removed]",
        "created_utc": 1677692759,
        "upvote_ratio": 0.5
    },
    {
        "title": "Just realised the similarity in names.",
        "author": "Matetarif12",
        "url": "https://i.redd.it/e6d778a706la1.png",
        "text": "",
        "created_utc": 1677692734,
        "upvote_ratio": 1.0
    },
    {
        "title": "Fun Fact: Kazuya Nakai (Zoro's VA) voices one of the main characters in the new Octopath Traveler",
        "author": "SurgeonOffDeath",
        "url": "https://www.reddit.com/r/OnePiece/comments/11fa2gh/fun_fact_kazuya_nakai_zoros_va_voices_one_of_the/",
        "text": "He voices the merchant, Partitio. The game has very solid voice acting across the board, with some other notable anime voices including: \n\nRem from Re: Zero (Inori Minase) as the dancer, Agnea. \n\nHowling Gab/Sojiro from Persona 5 (Jōji Nakata) as the scholar, Osvald. \n\nCavendish/Akaza from Demon Slater (Akira Ishida) as the cleric, Temenos. \n\nReiju (Michiko Neya) as the apothecary, Castti\n\nAnd to top it off, the GOAT Takehito Koyasu voices an antagonist named Harvey. Koyasu voices many, many prominent anime roles including Dio, Zeke Jaeger, and our ice-man himself: Kuzan!",
        "created_utc": 1677692557,
        "upvote_ratio": 1.0
    },
    {
        "title": "The strongest characters in One Piece",
        "author": "Agreeable_Nerve_9039",
        "url": "https://www.reddit.com/r/OnePiece/comments/11f9qmm/the_strongest_characters_in_one_piece/",
        "text": "&amp;#x200B;\n\nhttps://preview.redd.it/6u5yx1vjx5la1.png?width=529&amp;format=png&amp;auto=webp&amp;v=enabled&amp;s=841a978b8251f7ed5c5c4116bbd596e5ccaa6b98",
        "created_utc": 1677691815,
        "upvote_ratio": 1.0
    },
    {
        "title": "SBS: What happens when Kaido eats pickled plums?",
        "author": "afiq_aiman",
        "url": "https://i.redd.it/ideyplk0f7la1.jpg",
        "text": "",
        "created_utc": 1677691779,
        "upvote_ratio": 1.0
    },
    {
        "title": "my chopper be amazing fam 🍄 ❤️",
        "author": "ClerkB0y",
        "url": "https://i.redd.it/arrjdoxsc7la1.jpg",
        "text": "",
        "created_utc": 1677691035,
        "upvote_ratio": 1.0
    },
    {
        "title": "Nico Robin Demonio Fleur",
        "author": "WillingPlenty9061",
        "url": "https://i.redd.it/gn4n055ec7la1.jpg",
        "text": "",
        "created_utc": 1677690900,
        "upvote_ratio": 0.99
    },
    {
        "title": "vegapunk seastone",
        "author": "vrotonema",
        "url": "https://www.reddit.com/r/OnePiece/comments/11f9abw/vegapunk_seastone/",
        "text": "how would seastone interact with vegapunk's df???",
        "created_utc": 1677690751,
        "upvote_ratio": 1.0
    },
    {
        "title": "am i the only one who thinks that Yamato identifying as Oden problematic",
        "author": "OkRefrigerator448",
        "url": "https://www.reddit.com/r/OnePiece/comments/11f95zs/am_i_the_only_one_who_thinks_that_yamato/",
        "text": "Don't worry is not about thier prounance , but isn't it weird that Yamato call themself Oden , i mean it isn't exactly funny as a joke and they didn't seem to learn to be themself instead of being someone else as a character progression so what do y'all think ?\n\nPesonally i hope when we see Yamato again it will be addressed",
        "created_utc": 1677690473,
        "upvote_ratio": 1.0
    },
    {
        "title": "What's your favorite devil fruit awakening idea?",
        "author": "Until_Morning",
        "url": "https://www.reddit.com/r/OnePiece/comments/11f9137/whats_your_favorite_devil_fruit_awakening_idea/",
        "text": "I have one for Bari Bari no Mi. My idea is that the barrier become autonomous. They instantly appear at the slightest sign of danger. This would be a perfect counter to Wapu Wapu no Mi.",
        "created_utc": 1677690156,
        "upvote_ratio": 1.0
    },
    {
        "title": "just finished 900th episode...",
        "author": "DwightScott69",
        "url": "https://www.reddit.com/r/OnePiece/comments/11f8xzo/just_finished_900th_episode/",
        "text": "What a journey it has been...     \n\nI have been postponing watching OP for the longest time thinking that who will watch 1000+ episodes. Finally gave up and have kinda binged 900 episodes in s very short time and didn't expect OP to become one of my fav series I have ever watched.  \n\nNow I am dreading watching it any further thinking that it will end and I will have to watch it on a weekly basis.   \n\nI dont want it to end ever.:'(",
        "created_utc": 1677689979,
        "upvote_ratio": 1.0
    },
    {
        "title": "One piece: Next Generations *all credit goes to norridzuan art on YouTube",
        "author": "guzeruguzeru",
        "url": "https://v.redd.it/mjsxkxb2q5la1",
        "text": "",
        "created_utc": 1677689341,
        "upvote_ratio": 1.0
    },
    {
        "title": "Happy birthday to Sanji!",
        "author": "UsefullyTrickyy",
        "url": "https://i.redd.it/td06s6b6o5la1.png",
        "text": "",
        "created_utc": 1677688700,
        "upvote_ratio": 1.0
    },
    {
        "title": "Wait I just realised what do people do when they want to hate on luffy?",
        "author": "AscendedHobo",
        "url": "https://www.reddit.com/r/OnePiece/comments/11f8e24/wait_i_just_realised_what_do_people_do_when_they/",
        "text": "[removed]",
        "created_utc": 1677688653,
        "upvote_ratio": 1.0
    },
    {
        "title": "im sorry for the bad drawing but I hope someone likes this picture of zoro I drew",
        "author": "miltankhater2009",
        "url": "https://i.redd.it/y5dwekoh57la1.jpg",
        "text": "",
        "created_utc": 1677688577,
        "upvote_ratio": 1.0
    },
    {
        "title": "Here me out",
        "author": "Patient_Entry_2110",
        "url": "https://imgur.com/a/qcWVJSe/",
        "text": "",
        "created_utc": 1677688276,
        "upvote_ratio": 1.0
    },
    {
        "title": "How The Dinosaurs Hunted In Ancient Times (Clip)",
        "author": "zappy487",
        "url": "https://youtu.be/rGOYi8BLstA",
        "text": "",
        "created_utc": 1677687654,
        "upvote_ratio": 1.0
    },
    {
        "title": "Hardest One Piece Quote of All Time",
        "author": "The_Wookster_",
        "url": "https://i.redd.it/4683f8t6i5la1.png",
        "text": "",
        "created_utc": 1677686950,
        "upvote_ratio": 1.0
    },
    {
        "title": "My Koala cosplay from this past Anime Weekend Atlanta",
        "author": "hibarihime",
        "url": "https://www.reddit.com/gallery/11f7gxn",
        "text": "",
        "created_utc": 1677686489,
        "upvote_ratio": 0.86
    },
    {
        "title": "The Great Wave Thousand Sunny",
        "author": "Dazzling-Distance710",
        "url": "https://i.redd.it/qpctn15zg5la1.png",
        "text": "",
        "created_utc": 1677686302,
        "upvote_ratio": 1.0
    },
    {
        "title": "My Zoro fanart! I'll post my Tumblr page link in the comments if you want to follow me! c:",
        "author": "Hexporpora",
        "url": "https://i.redd.it/o9swwuv1f5la1.jpg",
        "text": "",
        "created_utc": 1677685636,
        "upvote_ratio": 1.0
    },
    {
        "title": "One Piece Reloaded: Chapter 934 + 25i",
        "author": "The_Real_Katakuri",
        "url": "https://www.reddit.com/r/OnePiece/comments/11f703g/one_piece_reloaded_chapter_934_25i/",
        "text": "If you don't know where you are, this is a fanfic alternative story for the Wano arc. Look for more context at the [main post](https://www.reddit.com/r/OnePiece/comments/wowtew/fanfic_one_piece_reloaded_vol_i_the_dragon_the/?utm_source=share&amp;utm_medium=web2x&amp;context=3).\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\n**Short summary** (*Careful! Spoil yourself at your own convenience by removing the cover*.)\n\n&gt;!Chopper and Nagisa arrive at their destination. Chopper realizes how important that place is for him. Zoro wakes beside Hiyori and Toko and learns about them. At the capital, Fukurokuju has been trying to interrogate Robin when surprising news arrive.!&lt;\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\n# 第 934 + 25i 話  『Curable disease』\n\n    Day 06, 18:11 (RMT+7), Gyōza mountains, Kibi\n\nAfter trekking the whole day through the dense forest of Kibi, Chopper and [Nagisa](https://i.imgur.com/SUOiFCm.png) are getting near their destination. At first, Nagisa was very careful trying to find easy paths for the small and frail Chopper, but soon he realizes the strange deer-like creature can do more than it looked like at first sight.\n\n[尾田栄一郎](https://preview.redd.it/cqrwhfdkd5la1.png?width=591&amp;format=png&amp;auto=webp&amp;v=enabled&amp;s=4775f637fbafaa855a16a35c3eac00b06b47e416)\n\nNagisa isn't any less agile and has been leading the way through the steep terrain.\n\n**Nagisa**\n\n&gt;Chopper-san, it surprised me that you transformed your body this way. Do you practice「Seimei Kikan」? You didn't just change your muscle-fat distribution. You developed feature you didn't have before and lost others. Is this some secret technique? I never saw or heard of such a thing.\n\n**Chopper**\n\n&gt;No, It's not「Seimei Kikan」exactly. It's... hard to explain. I think in this country you refer to people like me as \"cursed\".\n\n**Nagisa**\n\n&gt;Oh, I see... I've been meaning to ask you. What kind of creature are you exactly? Brother [Rashin](https://i.imgur.com/mggjOqo.png) told me you aren't a yōkai, but that left me even more confused.\n\n**Chopper**\n\n&gt;I'm a reindeer, but thanks to \"the curse\", I became a man too. And that's why I can transform between reindeer and human. To stay midway between the two though... That might be something similar to your「Seimei Kikan」. It took me a lot of training to do it by myself.  \n&gt;  \n&gt;What about the way you're clearing the vegetation in our path? Is that「Rokushiki」? I met some people once who could do something similar with their feet, although more powerful.\n\n**Nagisa**\n\n&gt;Oh! So you know what「Rankyaku」is! Yes, what I'm doing is essencially that but not quite. As you said, Rankyaku is usually done with your feet because it requires a lot of strength to do it and legs are always stronger than arms. But it can be done with your arms too if you're strong or skilled enough.\n\n**Chopper** `to himself`\n\n&gt;(*That must be it! I remember Zoro doing it once with his bare hands rather than his katana!*)\n\n[尾田栄一郎](https://preview.redd.it/b3oan0jmd5la1.jpg?width=1465&amp;format=pjpg&amp;auto=webp&amp;v=enabled&amp;s=a65f5989204421807508ca81a4129a90c1d79a12)\n\n**Nagisa**\n\n&gt;However, Rankyaku is too powerful. If I used that, I'd be cutting off half the trees in front of us. That's no good, this is a sacred forest. We should only clear enough to walk the trail. Instead, I do the Rankyaku technique with my hands and very little strength. Normally this would result in a failure due to the lack of strength and a thin layer of air would be pushed in a harmless way. But, through「Ryūō」, I enhance that push so that the air to the sides of my palms can cut through leafs and small branches that are close. But as you can see, anything tougher, like a tree's trunk, isn't damaged.  \n&gt;  \n&gt;I call this the「Yawarakai Kazaha」(Soft Windblade).\n\n**Chopper**\n\n&gt;Whoaa... You really are knowledgeable, Nagisa-kun! Just like Rashin said.\n\n**Nagisa**\n\n&gt;Look! We're almost there.\n\n[Nele-Diel](https://preview.redd.it/lsi3kdfod5la1.jpg?width=977&amp;format=pjpg&amp;auto=webp&amp;v=enabled&amp;s=744ea557a5ca51175ec3acf1e590d52be1b0b1db)\n\n**Nagisa**\n\n&gt;This is the「Gate of the Heart」. Once we cross this passage through the mountain, we'll be at the「Heart of Gyōza」.\n\n**Chopper** `intrigued`\n\n&gt;The「Heart of Gyōza」?\n\n**Nagisa**\n\n&gt;It's because this valley is the source of the「[Seigen river](https://preview.redd.it/hmw5pu3esj1a1.jpg?width=1463&amp;format=pjpg&amp;auto=webp&amp;v=enabled&amp;s=0c4750abdc7a072ec065c7fc4b3f129727b7f48c)」that crosses all the mountains in the region like a net of arteries and for one other thing, but it's better seen than told. C'mon!\n\nThe two go inside. The passage is short enough so that, albeit faint, there's always light. And when they get to the other side...\n\n[Plaguebot](https://preview.redd.it/fi12kf3rd5la1.png?width=1280&amp;format=png&amp;auto=webp&amp;v=enabled&amp;s=b9a68fe203921216c8efcbaffe301d7fb9269641)\n\nChopper's senses overwhelm. The intense scent of the sakura flowers that can almost be tasted. The sight of all those trees he heard so much about but had never seen until recently at the monastery, but now they're everywhere. The breeze of the valley on his fur. Listening only to silence. Silence and his own heartbeat increasing of excitement. (**suggested music**: [Across the Stars](https://www.youtube.com/watch?v=SwE0UYtJogw&amp;t=151s))\n\n**Chopper**\n\n&gt;This... This is incredible. It's not just the scent of the flowers, the air is fresher here. My lungs feel so...\n\n**Nagisa**\n\n&gt;The air here is richer in oxygen and cleaner than in other places. The right amount so that each breath is more than twice as efficient than normal.\n\n**Chopper**\n\n&gt;And it has something else... I can't quite tell what is it, but it's relieving me from the fatigue of the trek really fast. Does this come from the sakura tree as well?\n\n**Nagisa**\n\n&gt;Indeed. Come Chopper-san. You'll see the whole valley from these cliffs over here.\n\nChopper follows the young man unable to speak until he sees the valley.\n\n[millrok](https://preview.redd.it/99wtb52td5la1.jpg?width=1280&amp;format=pjpg&amp;auto=webp&amp;v=enabled&amp;s=d7cdd0e2a41e693395ff50bbcff53ac46be93cbd)\n\nAstonished from the fairy tale landscape, after a minute or so, Chopper succeeds at speaking again.\n\n**Chopper**\n\n&gt;This place... it's so beautiful. It reminds me of... could it be?\n\n**Nagisa**\n\n&gt;I like to come here as often as possible. And our timing has been great. Sunset will start very soon. You'll like it.\n\nIn love with the valley and the sakura trees, Chopper starts studying them. After a while, Nagisa wakes him from his thoughts.\n\n**Nagisa**\n\n&gt;Chopper look! The sunset!!\n\nWhen Chopper takes his eyes away from small flower to see what Nagisa is talking about, his heart stops. Or more like time itself stops. At least for Chopper.\n\n[Fredrik Persson](https://preview.redd.it/dvhl60ivd5la1.jpg?width=1600&amp;format=pjpg&amp;auto=webp&amp;v=enabled&amp;s=205efdecf7d4f52dbe3971a8bb1b43d2a7485d68)\n\n**Dr. Hiruluk** `remembered by Chopper`\n\n&gt;*Listen Chopper, once upon a time, in a faraway country to the west, there was a thief with a very serious illness in his heart.*  \n&gt;  \n&gt;*He visited each and every doctor but all of them told him \"it's an incurable disease\". When he was told he was going to die, he got very angry and left. He went to a mountain where he saw a breathtaking sight.*  \n&gt;  \n&gt;*What do you think he saw?*\n\n[尾田栄一郎](https://preview.redd.it/0l79rxexd5la1.png?width=744&amp;format=png&amp;auto=webp&amp;v=enabled&amp;s=51fc8ff399e7b4afaf47b10a9a314dd0e913dff6)\n\n&gt;*When he came back and visited another doctor, he couldn't believe it. The doctor told him \"you're perfectly healthy\" He was cured!!*  \n&gt;  \n&gt;*It was a miracle! He was so moved by what he saw, that something in his body changed and the illness he was told it would kill him disappeared. Isn't it wonderful?*  \n&gt;  \n&gt;*That means there's no illness in this world that can't be cured! And this skull and crossbones will take care of them all!!*\n\n[尾田栄一郎](https://preview.redd.it/9owjxxczd5la1.png?width=373&amp;format=png&amp;auto=webp&amp;v=enabled&amp;s=e93a6a250b1e048fb39598f1372e0effa48ecff2)\n\n**Chopper** `to himself`\n\n&gt;(*He was right! He wasn't only kind. He was truly a doctor after all, Doctorine!!*)\n\n∺∺∺∺∺∺∺∺∺∺∺∺∺∺∺∺∺∺∺∺∺∺∺∺∺∺∺∺∺∺∺∺∺∺∺∺∺∺∺∺∺∺∺∺∺∺∺∺∺∺∺∺∺∺∺∺∺∺∺∺∺∺\n\n    Day 06, 22:21 (RMT+7), Yuki ni ōwa cemetery, Ringo\n\n[尾田栄一郎](https://preview.redd.it/jts4uup2e5la1.jpg?width=760&amp;format=pjpg&amp;auto=webp&amp;v=enabled&amp;s=aed16cd880786c3666bffd968aaa2e24672765b2)\n\n**Zoro** `waking up stressed`\n\n&gt;MY KATANA!!\n\n**Toko** `startled`\n\n&gt;Haaahaha!! That scared me!!! Hahahahaha!!\n\n**Hiyori**\n\n&gt;Please, don't make sudden moves and lie down. Otherwise you'll open your wound.  \n&gt;  \n&gt;Oh, and let me thank you once again for saving our lives. I don't know what would have been of us if you hadn't helped us.\n\n**Zoro**\n\n&gt;Don't mention it. Thank you too for treating my wound. Have I slept for too long?\n\n**Hiyori**\n\n&gt;About four hours give or take.\n\n**Zoro** `standing up and trying to leave`\n\n&gt;I see. Time for me to leave then.\n\n**Hiyori and Toko** `stopping Zoro at the same time`\n\n&gt;NO!! Don't leave!\n\n**Hiyori**\n\n&gt;Please don't go yet.\n\n**Zoro** `worried`\n\n&gt;I have to. I want to check on a friend. I'm afraid he might have been in danger the last time I was around.\n\n**Hiyori** `insisting`\n\n&gt;Please... It's late. Outside is completely dark and with the snow it's impossible to see the trails or know where you're going. Plus, you need to regain some strength. Stay with us. Dinner is almost ready.\n\n**Zoro** `reconsidering`\n\n&gt;Hmm... I guess you're right. That happened a couple of days ago. Whatever happened, it's unlikely that me going tonight or tomorrow morning will change anything.\n\n**Hiyori**\n\n&gt;By the way... I know I'm older now but... Don't you remember me?\n\n**Zoro** `surprised`\n\n&gt;❓❓\n\n[尾田栄一郎](https://preview.redd.it/5vggz0z4e5la1.jpg?width=760&amp;format=pjpg&amp;auto=webp&amp;v=enabled&amp;s=968808c5ea362f0f5fd6ed244efd3ae9b91abb94)\n\n**Hiyori**\n\n&gt;I'm Hiyori. Kōzuki Hiyori, from Kuri.\n\n**Zoro** `trying to remember`\n\n&gt;Hiyori? That name does ring a bell but... I can't quite tell...\n\n**Hiyori**\n\n&gt;Yes! Momonosuke's little sister! We met a couple of times when we were kids.  \n&gt;  \n&gt;I'm so so glad that you're alive. Everyone said you died long ago, En'ichirō-kun!\n\n**Zoro** `realizing`\n\n&gt;Momonosuke⁉ Hiyori⁉  \n&gt;  \n&gt;Wait... ¿¿En'ichirō?? O\\_o  \n&gt;  \n&gt;My name is Zoro, not En'ichirō...\n\nHiyori doesn't react externally to Zoro's statement but she panics inside. Her heart starts beating very fast and cold sweat starts running down her back.\n\n**Hiyori**\n\n&gt;(*He's not En'ichirō...? That can't be... I was sure he was Shimotsuki En'ichirō. Have I revealed my identity to some random samurai??? Stupid Hiyori! He saved your life and you immediately let your guard down. What am I going to do now?*)  \n&gt;  \n&gt;Ehm... You said your name is「Zoro」? Are you sure you're not En'ichirō? It's okay if you are. You don't need to conceal your true identity. I'm your friend. Remember me? Hi...  \n&gt;  \n&gt;(*No! No! Don't say it!! Maybe he didn't get it right the first time. Maybe there's still a chance to not blow my cover.*)\n\n**Zoro**\n\n&gt;Hiyori. I know. But I told you, I'm not that En'ichirō you speak about.\n\n**Hiyori** `to herself`\n\n&gt;(*Busted!*)  **(┬┬﹏┬┬)**\n\n**Zoro**\n\n&gt;And did you say, Momonosuke is your brother? This is great!! I've been looking for you!\n\n**Hiyori** `to herself`\n\n&gt;(*My life is over...*)\n\n**Zoro**\n\n&gt;Your brother is worried sick about you. Kin'emon and the others too.\n\n**Hiyori**\n\n&gt;(*Father, mother... I've tried so hard, but in the end...*)  \n&gt;  \n&gt;Wait!! What did you just say?? What do you know about my brother and Kin'emon? Who are you??\n\n**Zoro**\n\n&gt;I'm a friend of Kin'emon. We've come to your country to get rid of Kaidō and find you and your mother if possible.\n\n[尾田栄一郎](https://preview.redd.it/1pi4oy28e5la1.png?width=330&amp;format=png&amp;auto=webp&amp;v=enabled&amp;s=43cdb5cde865394630774474d9d3c9a6af0d0304)\n\n**Hiyori** `on the brink of an emotional breaking down`\n\n&gt;Is that... realy true?\n\n&amp;#x200B;\n\nZoro spends the next few minutes explaining everything to Hiyori: about who they are, their plan and their situation or at least the part Zoro knows about. In turn, Hiyori tells him about herself.\n\n**Hiyori**\n\n&gt;The day my father was killed, Kaidō came to our castle. He kidnapped me and left my mother and brother to die in the flames. I wanted to believe they had gone to the future. But eventually, I assumed they died back then.\n\n**Zoro**\n\n&gt;If Kaidō kidnapped you, how did you escape?\n\n**Hiyori**\n\n&gt;Right... You plan on killing Kaidō at his own place... I want to ask you something: At Onigashima there's a woman my age by the name of「Yamato」. She's very tall and has long white hair. She's Kaidō's daughter. Please, I beg of you, don't kill her.  \n&gt;  \n&gt;Since my family was gone, she's been the only friend I've had.\n\n**Toko** `interrupting`\n\n&gt;Hey! Hahaha, what about me? Haha\n\n**Hiyori** `smiling`\n\n&gt;Well, besides Toko.  \n&gt;  \n&gt;When I arrived at Onigashima, Kaidō didn't put me in a cell or anything like that. He just told me where could I eat, where could I sleep and what was expected of me: to work as a maid for the pirates. And he told his men that they could not kill me, not take me out of the island, not keep me anywhere against my will -ironic, isn't it?- and not do anything to me that would leave a mark. Otherwise they could boss me around and punish me as they felt like.  \n&gt;  \n&gt;It was a nightmare, but it would have been a thousand times worse if Yamato, probably out of pity, hadn't taken a liking to me very quickly.  \n&gt;  \n&gt;The Beasts pirates don't have a clear hierarchy. Whoever proves his strength, proves his authority. Yamato had beaten a few pleasures and waiters who had hit me before, but it was when a shinuchi broke the rules and wanted to take me by force and abuse me that Yamato appeared and split him in half with one of my father's katana she took from Kaidō that everybody learnt not to mess with me.  \n&gt;  \n&gt;Since then, Yamato kept me by her side and we developed a strong friendship. When we were eleven years old, she hid me in ship with her and took me to the mainland where she freed me.\n\n**Zoro**\n\n&gt;She killed a strong pirate with ease at such a young age? Sounds like a tough foe to face. We'll spare her, but only if possible.\n\n**Hiyori**\n\n&gt;I understand. But... If you're aren't Shimotsuki En'ichirō, why is [Onimaru](https://i.imgur.com/7MdgfxY.png) with you?\n\n**Zoro** `confused`\n\n&gt;Onimaru? Who's that?\n\n**Hiyori**\n\n&gt;The fox going with you. A fox that big who can transform into a bear is hard to forget. He was Shimotsuki Ushimaru's pet. Why does it follow you?\n\n**Zoro**\n\n&gt;It... doesn't follow me. It took my...\n\n**Toko** `interrupting`\n\n&gt;Yes, he does. He came here with you. He's standing guard outside.\n\n**Zoro** `surprised`\n\n&gt;WHAT??\n\n∺∺∺∺∺∺∺∺∺∺∺∺∺∺∺∺∺∺∺∺∺∺∺∺∺∺∺∺∺∺∺∺∺∺∺∺∺∺∺∺∺∺∺∺∺∺∺∺∺∺∺∺∺∺∺∺∺∺∺∺∺∺\n\n    Day 06, 22:52 (RMT+7), Nori castle, Flower capital\n\nAt the Oniwabanshu's interrogation chamber, Nico Robin is chained to the wall at her hands and feet, awake and very fatigued. In front of her, [Fukurokuju](https://i.imgur.com/A90o2ms.png) equally fatigued as well.\n\n**Fukurokuju**\n\n&gt;I know how ironic this is. I told you yesterday that we'd have a long chat so that I could have all the answers I wanted from you, and yet for a full day, the only one who's talked is me.  \n&gt;  \n&gt;You're tough and resourceful, I'll give you that, woman. But you're about to give in. For a whole day, I've tried to make you speak through all means possible. But whenever I've tried to approach you with a torturing tool, you have managed to defend yourself making all those arms appear. You also got to hit me twice and when I tried to suffocate you... It didn't work, somehow.  \n&gt;  \n&gt;On top of that, I can't leave this room or take my eyes from you because I know you'll manage to escape. It's been one hell of a day, but you ran out of luck when I put you underwater in the tub and you were unable to defend yourself anymore.  \n&gt;  \n&gt;That proved you're a cursed one. I can't interrogate you while you're underwater and I'm not going to fight with you everytime I want to submerge you again. But I ordered to bring some kairōseki shackles from one of our factories and when I have that, you're going to repay me for all this trouble...\n\nRobin notices how Fukurokujo says this last sentence with his gaze fix in Robin's slightly disrobed chest.\n\nTen minutes later, the doors open and a tall woman enters the room.\n\n[尾田栄一郎](https://preview.redd.it/11bglo8ce5la1.png?width=346&amp;format=png&amp;auto=webp&amp;v=enabled&amp;s=5407dbbcddeee105720982061d57a3297eeca480)\n\n    Oniwabanshu soldier\n    地獄弁天 (JIGOKU BENTEN)\n    Ninja rank: B\n\n**Jigoku Benten**\n\n&gt;Good mooorniiing, Fu-ku-ro-ku-ju-SAN. Tee hee hee...\n\n**Fukurokuju** `annoyed`\n\n&gt;Do you think I don't know it's not even midnight?? I'm not in the mood for your jokes, girl.  \n&gt;  \n&gt;Do you have what I asked for?\n\n**Jigoku Benten** `giving him the handcuffs`\n\n&gt;Indeed. Here they are.\n\n**Fukurokuju** `relieved`\n\n&gt;At last!「Shibari-jutsu: Kannuku」\n\nRobin sprouts an arm on reflex in front of her to hit Fukurokuju, but for her surprise the man doesn't come to her. Instead, a rope has sprung towards her carrying the kairōseki handcufss with it. Robin tries to hit the cuffs, but his additional arm vanishes as it makes contact with the kairōseki. The rope passes behind her chained arms attaching the handcuffs to her elbows and making both coming together in a painful way.\n\n&amp;#x200B;\n\n**Fukurokuju**\n\n&gt;Well... this is taken care of. I'll go now. I need to sleep. But don't think this is over, woman.\n\n**Jigoku Benten**\n\n&gt;Actually... The shogun is expecting you right now.\n\n**Fukurokuju**\n\n&gt;What?\n\n**Jigoku Benten**\n\n&gt;There's a big commotion going on right now. We received word that the「[Witching-hour boy](https://i.imgur.com/iLa7Q5B.png)」has been finally captured.\n\n#                                                                                                    つづく\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\nThank you for reading! Feel free to comment or ask whatever you want to share. All feedback is welcome!\n\n# [← Previous chapter](https://www.reddit.com/r/OnePiece/comments/1160gqo/one_piece_reloaded_chapter_933_24i/?utm_source=share&amp;utm_medium=web2x&amp;context=3)                 [Index](https://www.reddit.com/r/OnePiece/comments/wowtew/fanfic_one_piece_reloaded_vol_i_the_dragon_the/?utm_source=share&amp;utm_medium=web2x&amp;context=3)                           Next chapter →",
        "created_utc": 1677685379,
        "upvote_ratio": 0.5
    },
    {
        "title": "is it void month or something?",
        "author": "deskCrapper",
        "url": "https://www.reddit.com/r/OnePiece/comments/11f6wdt/is_it_void_month_or_something/",
        "text": "The crackpot theories are reaching a climax or something. It's almost void month level. Wtf is going on. What do you think?",
        "created_utc": 1677685130,
        "upvote_ratio": 0.5
    },
    {
        "title": "My fanart of Zoro C: I'll post my Tumblr page in the comments if you want to follow me!",
        "author": "[deleted]",
        "url": "",
        "text": "[deleted]",
        "created_utc": 1677684990,
        "upvote_ratio": 1.0
    },
    {
        "title": "Fun fact cabaji vs mohji lasted for about the same duration as Luffy bs Katakuri",
        "author": "Slimm_sadiee",
        "url": "https://www.reddit.com/gallery/11f6m8s",
        "text": "",
        "created_utc": 1677684476,
        "upvote_ratio": 1.0
    },
    {
        "title": "usopp and me :)",
        "author": "Interesting-Ad-889",
        "url": "https://www.reddit.com/r/OnePiece/comments/11f6k4l/usopp_and_me/",
        "text": "&amp;#x200B;\n\nhttps://preview.redd.it/xoo4s94bb5la1.png?width=2225&amp;format=png&amp;auto=webp&amp;v=enabled&amp;s=1c408039309e63073a3fd2085d1daeea65c2aa6e",
        "created_utc": 1677684337,
        "upvote_ratio": 0.8
    },
    {
        "title": "made the gomu gomu no mi in blender as my second project, and thought I might aswell share it.",
        "author": "Mean_Ad_8292",
        "url": "https://i.redd.it/r9v0mps7s6la1.png",
        "text": "",
        "created_utc": 1677684116,
        "upvote_ratio": 1.0
    },
    {
        "title": "The One Piece is...",
        "author": "ducktherionXIII",
        "url": "https://www.reddit.com/r/OnePiece/comments/11f68xm/the_one_piece_is/",
        "text": "...you.  You are the One Piece.  There will be a mirror on the last page of the last chapter.  The Straw Hats will be laughing, insanely, driven mad by the realization that their struggles, ambitions, dreams and all the suffering in their world exist solely for your entertainment.",
        "created_utc": 1677683604,
        "upvote_ratio": 0.71
    },
    {
        "title": "This is why Kid is one of my favorite characters. Even in their first meeting, he can still get under Luffy and Law's skin.",
        "author": "strictlybusiness18",
        "url": "https://www.reddit.com/gallery/11f67x9",
        "text": "",
        "created_utc": 1677683534,
        "upvote_ratio": 1.0
    },
    {
        "title": "Straw Hats Portraits",
        "author": "monjapistola",
        "url": "https://i.redd.it/57d0032g85la1.jpg",
        "text": "",
        "created_utc": 1677683410,
        "upvote_ratio": 1.0
    },
    {
        "title": "Laws Devil Fruit (theory/question)",
        "author": "Xericiau",
        "url": "https://www.reddit.com/r/OnePiece/comments/11f5q61/laws_devil_fruit_theoryquestion/",
        "text": "So since we know that with proper medical knowledge and understanding of the Ope Ope No Mi that it can make someone immortal, is it safe to say that there’s at least one character out there that’s immortal? If so, do you think we’ll ever meet them?",
        "created_utc": 1677682337,
        "upvote_ratio": 1.0
    },
    {
        "title": "doflamingo eyes…",
        "author": "_SinJex_",
        "url": "https://i.redd.it/mdo1qp3cm6la1.jpg",
        "text": "",
        "created_utc": 1677682135,
        "upvote_ratio": 1.0
    },
    {
        "title": "Anyone rewatch the series? How’s your experience been?",
        "author": "Southeasternengineer",
        "url": "https://www.reddit.com/r/OnePiece/comments/11f5lkz/anyone_rewatch_the_series_hows_your_experience/",
        "text": "Just finished Arlong Park, and goddamn I’m reminded why I’ve been keeping up with this series for so long. I’m excited to catch up with the anime since I caught up during the time skip and been a manga only since then.",
        "created_utc": 1677682022,
        "upvote_ratio": 1.0
    },
    {
        "title": "[OC] My fanart of Boa💕",
        "author": "Ckxarts",
        "url": "https://i.redd.it/gumfrzm7j6la1.jpg",
        "text": "",
        "created_utc": 1677681085,
        "upvote_ratio": 0.98
    },
    {
        "title": "Zoro’s family tree ?",
        "author": "[deleted]",
        "url": "",
        "text": "[deleted]",
        "created_utc": 1677681002,
        "upvote_ratio": 0.33
    },
    {
        "title": "D stands for 2 things, Dawn and Dusk.",
        "author": "WaveyJP",
        "url": "https://www.reddit.com/r/OnePiece/comments/11f4y0u/d_stands_for_2_things_dawn_and_dusk/",
        "text": "Ok I need to get this out. D STANDS FOR DAWN AND FOR DUSK. (imo)\n\n# Whitebeard\n\n1. It doesn't make sense that the D would stand for one thing. Take (D)ream for example (A good guess for what the D stands for). This would mean that the members of the D clan would inherit the will of Dream, which sounds nice. Blackbeard, Luffy, Dragon and more seem to be dreamers. We even have the \\~\"Dreams never end\" quote from Blackbeard in Mocktown. BUT combine this with Whitebeard's words from Marineford  \\~\"The man Roger is waiting for is definitely not you”. Surely, if the D stood for one thing, like Dream, any inheritor of the Will of Dream would be a suitable inheritor? And especially someone like Blackbeard. Realistically, the task Roger is waiting for someone to complete, is largely just overthrowing Imu and the Celestial Dragons. And Blackbeard is a perfect candidate for this. For the whole series, he's been a step ahead of Luffy and even Ace in the race to become Pirate King. HOWEVER, It makes complete sense that BB would not be the one roger was waiting for if we assume that the D stands for 2 things. Dawn, and Dusk. An inheritor of the Will of Dusk may be able to Overthrow Imu, but what darkness would the world go through after that? Only a Dawn Inheritor like Luffy or Dragon is suitable.\n\n&amp;#x200B;\n\nhttps://preview.redd.it/fbqamsvbx4la1.png?width=600&amp;format=png&amp;auto=webp&amp;v=enabled&amp;s=afbabd1394988b470a53272ec1a766b317b31474\n\n# Inherited Will\n\nWe all agree that Luffy inherited Roger's Will and that Roger probably inherited Joyboy's Will. But What about Blackbeard and Rox? If Roger had the same will as Rox, why was Rox Such an antagonistic figure to Roger? It seems like the Roger-Rox dynamic was completely different from the Roger-Garp dynamic. This fits when you realise, that Roger and Garp while enemies as Pirate and Marine, were also allies as Inheritors of the will of Dawn. And together they took down Rox, the inheritor of the will of Dusk. This pattern even exists in the modern OP world. When Luffy(Dawn) and Blackbeard(Dusk) inevitably meet, they’re going to clash, and one of them will probably die (Or maybe Luffy will only kill Blackbeard’s will). This is the complete opposite of how things went when Luffy(Dawn) and Law(Dawn) met. They have been like a Supernova/Worstgen power couple since before the time-skip. \n\n# Sabaody and Rayleigh\n\nAnother interesting point is what Rayleigh said to the SHs on Sabaody. He said that the SHs may come to their own conclusion that is different to that of the Roger pirates. While I admit, even if the D has 1 meaning there is *some* room for interpretation, I think Rayleigh hinting at the Dawn/Dusk dichotomy is a slightly better fitting explanation for this pretty mysterious comment.\n\n&amp;#x200B;\n\nhttps://preview.redd.it/xmjhvnjdx4la1.png?width=498&amp;format=png&amp;auto=webp&amp;v=enabled&amp;s=e8316ae9119c1a1a03dffe619d87f28db25b5f63\n\n# \n\n# Expiring world powers\n\nAnd now I want to get a bit more speculative. Luffy inheriting the Will of Dawn makes a lot of sense for reasons that are no surprise. Quickly:\n\n1. Luffy's fruit is the Human-Human fruit model: **SUN GOD** Nika. \n\n2 and 3. The Strawhats ship is called the “Sunny” and its face is literally a sun...\n\n4. Pedro…\n\n&amp;#x200B;\n\nhttps://preview.redd.it/nn4hi0egx4la1.png?width=471&amp;format=png&amp;auto=webp&amp;v=enabled&amp;s=54955c6026986b974a6a98833c73f88bf030b6f5\n\nIt also fits that Blackbeard would Inherit the will of dusk. As he has the literal DARKNESS fruit lol. Both fit well because the common theme between the 2 will is the end of the old and the start of something new. \n\nDawn: The dawn (Luffy) brings an end to a long period of darkness (The reign of the Celestial Dragons). \n\nDusk: The Dusk (Blackbeard) brings an end to the Day (The Day is the reign of the World Government). In business terms, the world government would be like a [Sunset Industry](https://en.wikipedia.org/wiki/Sunset_industry). \n\n# The will of Dusk’s origin?\n\nI'm done now but I have one more idea, one of the 2 ideas that triggered my current opinion. Luffy inherited Roger's will, and Roger Inherited Joyboy's will. Equally, Blackbeard inherited Rox's will, but whose will did Rox inherit? This pattern suggests another Will of Dusk inheritor/originator during JoyBoy's time. This COULD explain why the 20 kingdoms allied against the D clan. Maybe there were some dodgy people back then (Similar to Blackbeard today). We have to wait for the void century flashback for confirmation. \n\n# Finally\n\nI should add that while everything I wrote here is my own original idea, I'm not the only one who thought of this. Mochisensei has a really good theory video on the Dawn/Dusk topic but he comes at it from a largely different perspective. I would recommend watching it if you like my theory (Also it's in Japanese so you might have to use the youtube subtitle auto-translate option. Good luck with that lol). I found this video AFTER I had all of my ideas written down because I wanted to see if I was the first person to come up with it.\n\nOk that's all.  ty",
        "created_utc": 1677680369,
        "upvote_ratio": 1.0
    },
    {
        "title": "Luffy’s dream is obviously…",
        "author": "croco27star",
        "url": "https://www.reddit.com/r/OnePiece/comments/11f4lel/luffys_dream_is_obviously/",
        "text": "He wants to have a feast with the whole world. \n\nIt’s Luffy no need to overthink it",
        "created_utc": 1677679466,
        "upvote_ratio": 0.5
    },
    {
        "title": "First One Piece Tattoo!",
        "author": "Lilywonders",
        "url": "https://i.redd.it/ft7tgvv0e6la1.jpg",
        "text": "",
        "created_utc": 1677679339,
        "upvote_ratio": 0.99
    },
    {
        "title": "Ruthless Police Officer brutally assaults Mute Pigeon Lover, and Usopp brings the waterworks; Manga reader's first experience with the Anime - Water 7 Saga",
        "author": "HokageEzio",
        "url": "https://www.reddit.com/r/OnePiece/comments/11f4a6a/ruthless_police_officer_brutally_assaults_mute/",
        "text": "# Summary/TL;DR\n\nThe Water 7 Saga is without a doubt the greatest run of One Piece to date at this point of the story (if not the story as a whole).  The overarching theme of fighting the entire world to stick up for your friends no matter how broken down or dangerous they may be perceived as was apparent from beginning to end, and throughout all content created over this 2 to 3 year stretch by Toei.  The animation definitely shows its 17+ years of age (did you know this arc almost got the anime cancelled?), but there is a clear shift in the quality from the beginning of the saga to the end of the saga as they fully enter the HD era of One Piece.\n\nDespite starting with one of Oda's weakest arcs in the series, the throughline of Aokiji calling Robin a dangerous woman who shouldn't be trusted or fought for ties the entire saga together and leads to an epic conclusion.  Some of the pitfalls of Wano as an arc also gave me a greater appreciation for the similar structured raid on Enies Lobby.  My appreciation for this saga has grown post Wano seeing a proper beginning, middle and end to this long story arc in comparison to Wano which felt like Oda couldn't get out of there fast enough by the end.  And while recent developments in the manga lead to some reevaluation of its most iconic moments, it still holds up as Oda at his absolute best.\n\n&amp;#x200B;\n\nhttps://preview.redd.it/q2mndc24l2la1.jpg?width=1048&amp;format=pjpg&amp;auto=webp&amp;v=enabled&amp;s=0002216256de1a8af85813be596bbe9dbcb2f552\n\nAfter 7 months, I'm finally able to write another one of these.  Something about this section of the story (Skypiea into Long Ring Long Land, two arcs that I don't particularly enjoy) is just impossible for me to power through without taking a break.  Even knowing that Water 7/Enies Lobby are probably the best run in the story, I just had to hold back on watching knowing that this section of the story would take 50 hours.  But I finally finished, so time to jot down my thoughts on another saga of One Piece as told by the anime.\n\nFor reference; I've been caught up with the manga since Zou began but have never seen the anime.  And I intend on watching everything available on MyAnimeList to catch up with the main series and see everything the anime has to offer (filler, specials, movies, etc.; if it's on MyAnimeList I intend to watch it).  I've done two of these so far, which can be read here.\n\n* [East Blue and Alabasta Sagas](https://www.reddit.com/r/OnePiece/comments/v0evfs/first_impressions_watching_the_anime_for_the/)\n* [Skypiea Saga](https://www.reddit.com/r/OnePiece/comments/vvz3pp/gods_goats_and_the_legend_of_condoriano_manga/)\n\nNow that we're past that, on to the content.\n\n# Anime Arcs\n\n**Long Ring Long Land**\n\nhttps://preview.redd.it/6xk037ggl2la1.jpg?width=2047&amp;format=pjpg&amp;auto=webp&amp;v=enabled&amp;s=cc47407cf40497e7c56ce22b5b4449ff05bd67ad\n\nI'm going to talk about this arc as it was presented in the anime, but when I rate this it'll be as it happened in the manga and ignoring the filler for the sake of fairness.\n\nObviously this is probably the most notorious arc in the series just because as of now it just hasn't ever mattered.  Like I mentioned, between this arc and Skypiea (which I've never been much of a fan of), this is always by far the hardest section of the story for me to get through.  So it's not one that I really looked forward to going through again.  One of the worst arcs in the story; but it's definitely not *the* worst like I thought for a long time.  The stalling to avoid catching up to the manga was pretty obvious.  But it wasn't completely unbearable filler within the context of the arc.  I actually thought having Luffy rescue the old guy's horse first confident that he could save Chopper still felt fairly in character (moronic but with a good heart).  Hot take - the roller skating was more enjoyable than any event canon or filler in the arc besides boxing.  Luffy begging to be put in two rounds out of 5 and then revealing he has no clue how to skate was hilarious.  And having Usopp be super down on himself thinking he was going to let everybody down just to have that epic moment where Luffy learns to stand on his skates and inspires Usopp felt like something that would actually be in the series.  It's goofy, but so is the whole arc.  I thought it worked.  I felt like the rest of the bonus rounds kinda dragged until it got to the boxing and that's when you could feel the filler, but the skating was fun.\n\nWhile I thought that having that old man's grandson take him home with the rest of his village, I'm never much of a fan of shifting around canon content out of order with filler.  Bonus material is fine, but Aokiji is essentially entirely taken off the island and added to another one.  Thankfully the changes aren't that major; Aokiji basically does the exact same things just for a different group of people.  And this is the main saving grace of the arc.  With hindsight of the entire saga, I do like having Luffy fight over making sure he absolutely *will not* have his friends taken from him, and having Aokiji test that was great.\n\n**Ocean's Dream Arc**\n\nhttps://preview.redd.it/j4ilkqlxl2la1.jpg?width=1135&amp;format=pjpg&amp;auto=webp&amp;v=enabled&amp;s=4928a84f2eafeecadf2fe3e7e3924a5a857fd6a2\n\nI actually really enjoyed the premise of this arc all the way up until the reveal of the actual villain.  Apparently this arc is ripping the story from a really early 2000s One Piece video game, but I enjoyed the mystery of what was going on and having the crew (besides Robin) be set back to zero.  It felt like a very genuine take on how they would react to each other if they had no recollection of what they were dealing with.  It was like a less extreme version of Sugar's Devil Fruit, but I actually enjoyed it.  And then having all of the memories of the people who inspired the crew come out (Ace, Hirluk, Bellemere, etc.) all come out as visions just for Robin to have absolutely nobody, that stuck with me.  Again, to tie it back to canon, it's like what Black Maria did to Robin.  Only difference being that Robin had friends for a long time at that point.  And man, Zoro make a good villain.  **WAY** better than the fight he had with Luffy on Whisky Peak, it felt like he wanted to kill Luffy and Luffy was not backing down.\n\nI liked the arc, but man was it knocked down a few notches for me at the end with the villain reveal.  It was so lame and really hurt what was actually a pretty solid arc before that.  It had some elements that I think really work in canon.  And some of them even end up actually being used in canon, albeit probably unintentionally (like Black Maria making Brook and Robin see the people most important to them).\n\n**Foxy's Return Arc**\n\nhttps://preview.redd.it/rjqm1cqim2la1.jpg?width=1280&amp;format=pjpg&amp;auto=webp&amp;v=enabled&amp;s=a57addb62f78f77d3566a7ac6629425e28a0d2d2\n\nThe anime somehow almost made Foxy cool.  Watching him try to fight back for his crew after losing all of them in Long Ring Long Land (filler, obviously) I actually felt kinda bad for him and enjoyed seeing the Straw Hats jump in to help out.  If they just left it at that and had Luffy and Foxy part ways on amicable terms, I think this would have been a cool arc.  Unfortunately it goes back to being really dumb with Foxy betraying Luffy and going back to filler level antics.\n\nAokiji technically shows up in this arc but I'm not going to judge it that way out of fairness.\n\n**Water 7 Arc**\n\nhttps://preview.redd.it/d545fpevo2la1.jpg?width=1703&amp;format=pjpg&amp;auto=webp&amp;v=enabled&amp;s=0a8bffa567178130f8193aa9b9504ad75a457cb2\n\nI'm not going to say I forgot about Water 7, cause I definitely remembered the key points of the arc and the set up for Enies Lobby.  But what I did forget was how tense Water 7 was as its own individual arc.  Water 7 is completely capable of standing alone as an arc far more than I ever remembered or thought prior to watching it.\n\n* Usopp vs Luffy made me tear up.  So far that's only the second time, the other one being when Vivi and the crew said goodbye.  Something about seeing Nami and Chopper cry about how painful it was to see that was hard to watch.  And Sanji kicking the shit out of Luffy for almost saying he'd kick Usopp out.  I felt stressed out watching the argument far more than I anticipated.\n* I knew Franky and Usopp end up getting taken away by CP9, but I didn't remember how cold and heartless they treated the Merry before leaving.  Watching them just dump her in the sea pretty much just to be assholes was rough, and Usopp was in pain watching it.\n* Aqua Laguna itself, again, way more stressful than I remembered.  Obviously Luffy getting stuck between buildings is silly (and Zoro getting stuck in the chimney is sillier), but the way it was handled it actually felt like a very emotional moment.  And watching Nami jump from building to building in the cold rain to go ask Luffy dicking around because Robin was in trouble had me hooked.  That was the moment where it felt like she's come such a long way throughout the whole story.  For as silly as the circumstances were, there wasn't a lack of tension.\n\nAlso, Water 7 is *beautiful*.  This should be the automatic answer for place in One Piece you'd want to live, cause wow.  The flood sucks obviously, but the whole city looked amazing and fun to live in.  And the people aren't horrible like basically any other place the Straw Hats visit.  I think that comes across so much more in the anime than it did in the manga.\n\nObviously Water 7 and Enies Lobby together are what make this arguably (or in my opinion, the) best run in One Piece.  But my biggest takeaway from watching this is that Water 7 stands just fine all on its own.  I always had it up near the top, but my appreciation for it definitely grew watching it.\n\n**Straw Hat Theater/Recap**\n\nhttps://preview.redd.it/vz23zxtzo2la1.jpg?width=1280&amp;format=pjpg&amp;auto=webp&amp;v=enabled&amp;s=bda798730b4383525c0e59492d31c19485327de4\n\nIn the time it took me to watch this saga, apparently MyAnimeList deleted this as an entry.  Technically it's not its own thing because they're just short segments of 5 filler episodes, so I get it.  But I thought they were kinda funny.  The main thing I wanted to say for this section though... people really have some nostalgia glasses over the anime lol.  This section of the story is obviously so old that most people probably binged it, but seriously.  **5 straight recap episodes** talking about how the Straw Hats entered the crew.  I wanna live was followed by 5 straight recap episodes.  Imagine Luffy getting up to the rooftop in Wano and then getting one recap episode each for Luffy, Zoro, Law, Kidd, and Killer.  Because **that's what Enies Lobby did**.\n\nThis is by no means saying that there aren't legitimate criticisms of the pacing in the anime or anything of the sort.  I just found it funny in hindsight how many people complained about getting a couple Shanks episodes in a row last year of new information in the lead up to Film Red.  Meanwhile there was essentially a filler arc right after maybe the most emotional moment in the entire series to date with \"I Wanna Live\" followed by a month long filler arc.  Nostalgia is a hell of a drug, man.\n\n**Boss Luffy Historical Arc**\n\nhttps://preview.redd.it/4n64ad3ep2la1.jpg?width=1136&amp;format=pjpg&amp;auto=webp&amp;v=enabled&amp;s=38f896555d0454045cb666f29c09b095a80a92a0\n\nI kinda liked this arc, but you could definitely tell they were holiday specials.  It felt like watching Cartoon Network and getting back to back Christmas episodes of your favorite shows (Ed, Edd, n Eddy, Kids Next Door, all your other typical Friday night cartoons).  I liked it, but it definitely felt a little weird not watching it under that context.  Having the Christmas special end with Chopper being super busy because he's Santa's reindeer was super cute.  And the final episode where Foxy was involved ended with an awesome finish.\n\n&gt;Luffy: \"Don't worry, it'll come back.\"  \n&gt;  \n&gt;Foxy: \"What?\"  \n&gt;  \n&gt;Luffy: \"My right hand\" \\**Gomu Gomu no Pistol to the face\\**\n\nLike I said, little weird out of context.  But for a Christmas, New Year's, and April Fool's Day episode, I thought these were enjoyable.\n\n**Enies Lobby Arc**\n\nhttps://preview.redd.it/1uq9mscpp2la1.jpg?width=1280&amp;format=pjpg&amp;auto=webp&amp;v=enabled&amp;s=95ad73f01a7d9adadc12eff5ebf81b79ba0ec63e\n\nWhat is there to say about Enies Lobby that hasn't already been said?  Best arc in the series imo (spoiler for the list, I guess; at least for now).  Everybody put in work, just like they did in Water 7.  Everybody knows this is one of the best arcs in the series, I can't add anything here.  It still holds up as the best arc in the story.  Luffy vs Lucci, Usopp sniping from the Tower of Law, I Wanna Live, Sanji the Hunter, Merry's funeral.  There are too many moments to go through.\n\nOne new thing I discovered; I found a new favorite moment.  It's not any of those, it's the [Walk to Enies Lobby.](https://www.youtube.com/watch?v=dURpu5yBBts)  Obviously I've seen that panel of them standing on the rooftop hundreds of times at this point, one of the most iconic panels in the series.  But the way it was adapted with the music and all of the context of what happened, I think it's the best scene in the series to date out of the arcs I've watched.  And it highlights one of the other main things I want to acknowledge, the music is great.  Most music from the anime I haven't heard before, especially music from the middle of the story and beyond.  So I feel like I'm always in for a bit of a treat.  [I'm Here with You](https://www.youtube.com/watch?v=0NLxntAOrtk) is a new favorite.\n\nThe main thing that kept coming to mind for me while watching this (at least within the context of being a caught up manga reader) was how it was just a way better war and alliance than Wano.  And I guess maybe that's somewhat unfair to Wano when this is one of the best arcs in the series (if not the best), but that's just the thought that kept running through my head.  Because it really did feel like it was hitting similar story beats to me.  Like I found myself feeling more conflict over the alliance between Galley-La, the Franky Family, and the Straw Hats than how it felt in Wano.  Because there was more establishing these individual factions.  Obviously I'm not comparing Trafalgar Law to Zambai from the Franky Family, Zambai is so much cooler than Law.  But it felt like they all had their own reasons every step of the way with the Straw Hats wanting Robin, the Franky Family wanting Franky, and Galley La wanting revenge against CP9 for betraying them.  In Wano it felt like a lot more tagging along and being wherever is most fitting for Luffy's story to progress, like having Law and Kidd fight Big Mom even though Kidd swore revenge directly against Kaido for the Killer stuff.  I appreciate this arc more coming off of Wano where it felt like Oda just wanted out of there as fast as possible and skipped all the resolution.\n\nThe other current story thing that I feel like has to be addressed upon a rewatch is Saul being alive.  I've never claimed that it doesn't make sense ever since it was revealed, I think there were always reasons to think it can happen (and the theory was floating out there for years).  My thing has always been that I feel like it does take away a bit from the flashback knowing that moment was a lie.  I really do not agree with the notion that everybody else dying makes it fine for Saul to be alive cause Robin \"thought\" she lost everything.  Personally my mindset has been that she found the family that Saul wanted her to find and that's all she needed, she doesn't need to then show Saul that she found them.  I feel like it takes away from the 20 year struggle that she always had somebody out there this entire time who just couldn't get to her because of circumstances.  Technically it still isn't confirmed yet until we see that it's him, but I'm still not the biggest fan.  I enjoyed it a bit more when Aokiji was a good guy who had to make a bad decision than Aokiji being a good guy who lied about the bad decision, because I felt like it made him more complex.\n\nBut watching the whole thing over again, Aokiji pretty much introduced his moves saying that if you unthaw them carefully they'll be just fine.  I'm willing to accept that it's significantly less about Saul specifically and entirely the fact that Oda has wasted the fake out death so many times that I don't feel anything from it anymore.  And I'll feel the same way if Yorkie ends up being the dude Crocus was hanging out with on the cover story (which it probably is considering Crocus went looking for the Rumbar Pirates).\n\nIt's still a criticism of Oda's writing that its gotten to this point and that's just something that will have to stick with the story, but it isn't specifically a Saul issue or even a \"backstory character doesn't stay dead anymore\" issue.  Like I don't really have any issues with Sabo being a fake out death because I don't feel like it takes away from Luffy's story or Ace's story for him to not be dead (the how he wasn't more involved is iffy, but I like the build up of Sabo being alive).  Whereas with Saul or Kinemon for example, I feel like it *does* take away from the journey of certain characters to a degree whether it's Robin searching for a family having lost it all or Momo choosing to become an adult to be strong enough to stop Kaido's reign of terror thinking Kinemon died.  Personally I'm still hoping it's a fakeout fake out since it was never actually confirmed, but I've come to terms with it even if I'm not in love with it.\n\nAll that aside, this is still the best arc in the story so far.  But the animation definitely shows its age, and I don't find it surprising that this arc had the anime on the brink of being cancelled before moving timeslots.  There's definitely some rose tinted glasses towards this arc when it comes to the animation because the story was so good.\n\n**Post Enies Lobby Arc**\n\nhttps://preview.redd.it/jbuck2j8r2la1.jpg?width=1280&amp;format=pjpg&amp;auto=webp&amp;v=enabled&amp;s=86996cd428c0e26f808d309575db0e5bd9106172\n\nThe thing I really noticed in this arc is how far the animation has come.  One Piece is obviously an old anime that started before HD, and I feel like this arc really showed the difference.  When the saga began, the anime was still using the old 4:3 SD format (on streaming sites it's in 16:9, but the original release and the DVDs are still 4:3).  When Koby and Helmeppo show up and we get flashbacks to Shells Town/Alvida, you can see just how old the anime actually is when they're using the 4:3 format inside of the middle of the screen to remind you who these characters are.  I can see why they made a concerted effort going forward to reanimate those arcs into HD specials, because the gap in animation is night and day when you have them side by side.\n\nOnto the actual story.  This arc is just jam packed with lore.  I think it's very easy for One Piece fans to take for granted just how much information we actually learn in this arc and how special of a moment it is.  So much of what we get from this arc are things that you would consider basic One Piece knowledge nowadays.  Let's just think about it:\n\n* All of the Straw Hats having a bounty.\n* Garp, Luffy's grandfather, being a Marine hero.\n* Dragon, Luffy's father, being the leader of the Revolutionary Army taking on the World Government.\n* The entire Yonkou system debuted in this arc, with the 4 being named.\n* Shanks is one of those Yonkou and is actually one of the most powerful people on Earth.\n* The New World.  This arc is where we even learned the concept of the New World's existence.\n* Vegapunk is an extremely smart scientist that works for the World Government giving them world breaking technology.\n\nLike I said, you take for granted how much of this basic information is from this arc.  And all of that would be great on its own, but that's not the main thing I take away from watching this arc again.  The main thing I'll take away... they got me again.  The anime got me to cry again, this time full on tears streaming down my face/lip quivering crying.  I was so close to getting through it, man.  Usopp jumped down saying sorry, I was good.  Luffy reached his hand out, I was good.  As soon as Luffy and Nami started crying I couldn't hold it back.  \n\nI'm impressed by the anime.  The manga never made me cry, I still have 700 episodes and they've already gotten me 3 times despite fully knowing the story (Vivi goodbye, Usopp vs Luffy, and Usopp's apology).  It's still far down the road, but it just makes me way more curious how I'll be during Marineford.  Cause I really don't know.\n\n# Movies\n\n**One Piece: Baron Omatsuri &amp; The Secret Island**\n\n&amp;#x200B;\n\nhttps://preview.redd.it/u6f9ggpqr2la1.jpg?width=550&amp;format=pjpg&amp;auto=webp&amp;v=enabled&amp;s=a97c978468b601f4fa90221bda6d892b90a6970b\n\nI really liked this movie.  Similar to what I said about Long Ring Long Land, I think knowing the context of what was to come in Water 7 and Enies Lobby made this movie a whole lot stronger.  Luffy is fighting so hard to hold onto his friends in this one and it's just brutal.  And the villain is essentially doing the same thing, just in a very dark way.  Even the guy who helps Luffy is dealing with similar issues.  And seeing the crew argue with each other felt very natural (for the circumstances) knowing what was coming up with Usopp.  I think this movie fell right at the perfect time for the series, and it didn't feel out of place or like a movie written by somebody who doesn't understand the story.  Which you run the risk of with a lot of these non-canon action shonen movies.\n\nThis is really dark for a One Piece movie, but I loved the change of tone.  And even the art direction felt very unique for One Piece (at least up to this point in One Piece).  Easily the best movie so far.\n\n**One Piece: The Giant Mechanical Soldier of Karakuri Castle**\n\nhttps://preview.redd.it/jqkxjehxr2la1.jpg?width=1643&amp;format=pjpg&amp;auto=webp&amp;v=enabled&amp;s=debdb9ee354cdbaac1d2c1342f7e672254f38efc\n\nThe villain in this was so lame.  Honestly I struggled to stay up and engaged with this one, it just wasn't really interesting.  My main takeaway from watching the entire thing was that I finally managed to find Ground Zero for the ridiculous boobs in this series.  It all started in this movie.\n\nWhile I honestly couldn't tell you much about the plot, the finish to the movie was pretty cool.  And Luffy using Gear 2 for the first time (kind of) was pretty sick.  Obviously it's not canon, but I actually liked the context of \"oh hey that was weird, lemme try that again\" where in the manga Luffy just kinda came up with it off screen.  Saves it from being at the absolute bottom, but not by a lot.  \n\nAlso it did give us the definitive [Luffy vs Lucci soundtrack.](https://www.youtube.com/watch?v=GrtipI7dP2Y)  So it has that going for it.\n\n# Specials\n\n**One Piece Special: The Detective Memoirs of Chief Straw Hat Luffy**\n\n&amp;#x200B;\n\nhttps://preview.redd.it/c3xe37hds2la1.jpg?width=600&amp;format=pjpg&amp;auto=webp&amp;v=enabled&amp;s=e3c24c00a0b4a3dc0c9fb8c20ab20b16ccd897c9\n\nThis was the special that started it all with the Boss Luffy thing.  I actually didn't really like this one as much as the episodes, I guess maybe because it was a long special instead of a couple episodes broken up.  It felt kinda long and tedious, but I guess the cameos were nice.\n\n# Miscellaneous\n\n**Kyutai Panic Adventure Returns!**\n\n&amp;#x200B;\n\nhttps://preview.redd.it/1mdosszus2la1.png?width=248&amp;format=png&amp;auto=webp&amp;v=enabled&amp;s=9c88437cba984fbb0c7a701cdad4090528d7b95b\n\nWhere else can you see Luffy and Goku take on Enel?  Kinda fun, enjoyed it more than the other one.  Obviously this is nothing to do with the series, but cool side thing that was in Japan.\n\n**One Piece New Year Special: Special Report - Secret of the Straw Hat Pirates**\n\n&amp;#x200B;\n\nhttps://preview.redd.it/nrnqcm77t2la1.jpg?width=640&amp;format=pjpg&amp;auto=webp&amp;v=enabled&amp;s=d6ee93e86fd0afa63a42dbdeb3cd92171752aaa4\n\nAnother recap, this one I had to download online as a raw anime cause it wasn't subtitled anywhere.  I liked this recap more just because it was one long thing going over the Straw Hats and then you can move on.  As opposed to the other recap where it's 5 straight episodes.  This was a more traditional recap and having it when it occurred (I believe right before Aqua Laguna) was much more suitable than literally right after \"I wanna live.\"\n\n# Shorts\n\nNone.\n\n# OVAs\n\nNone.\n\n# One Piece Arc Rankings\n\n1. **Enies Lobby**\n2. **Water 7**\n3. **Post-Enies Lobby**\n4. **Alabasta**\n5. **Arlong Park**\n6. **Jaya**\n7. **Loguetown**\n8. **Baratie**\n9. **Drum Island**\n10. *G-8*\n11. **Shells Town (Captain Morgan)**\n12. **Romance Dawn (Chapter 1)**\n13. **Skypiea**\n14. **Syrup Village**\n15. **Orange Town**\n16. **Little Garden**\n17. **Rare Animal Island (Gaimon)**\n18. *Post-Alabasta*\n19. **Reverse Mountain**\n20. **Long Ring Long Land**\n21. *Foxy's Return*\n22. *Boss Luffy Historical Arc*\n23. *Ocean's Dream*\n24. **Goat Island (Alvida's Hideout)**\n25. **Whisky Peak**\n26. *Goat Island Paradise*\n27. *Warship Island*\n28. *Ruluka Island*\n\n# One Piece Villain Rankings\n\n1. **Rob Lucci**\n2. **Crocodile**\n3. **Arlong**\n4. **Enel**\n5. **Spandam**\n6. **Don Krieg**\n7. **Kuro**\n8. **Bellamy**\n9. *Jonathan (G-8)*\n10. **Smoker**\n11. **Buggy**\n12. *Omatsuri (Baron Omatsuri)*\n13. **Captain Morgan**\n14. **Wapol**\n15. **Mr. 3**\n16. *Gasparde (Dead End Adventure)*\n17. **Higuma**\n18. **Alvida**\n19. **Mr. 5**\n20. **Mr. 9 and Miss Wednesday**\n21. **Foxy**\n22. *Saga (Cursed Holy Sword)*\n23. *Noko (Ocean's Dream)*\n24. *Ganzack (Defeat the Pirate Ganzack)*\n25. *Eric (Warship Island)*\n26. *Captain Joke (Ocean's Navel)*\n27. *Kibagaeru (Foxy's Return)*\n28. *Minchey (Goat Island)*\n29. *Eldoraggo (One Piece: The Movie)*\n30. *Ratchet (Giant Mechanical Soldier of Karakuri Castle)*\n31. *Bear King (Clockwork Island Adventure)*\n32. *Count Battler (Island of Strange Animals)*\n33. *Wetton (Ruluka Island)*\n34. *Bayan (A Father's Huge, HUGE Dream)*\n35. *Governor (Last Great Performance)*\n\n# One Piece Movie Rankings\n\n1. Baron Omatsuri and the Secret Island (Movie 6)\n2. Dead End Adventure (Movie 4)\n3. One Piece: The Movie (Movie 1)\n4. The Cursed Holy Sword (Movie 5)\n5. The Giant Mechanical Soldier of Karakuri Castle (Movie 7)\n6. Clockwork Island Adventure (Movie 2)\n7. Chopper's Kingdom on the Island of Strange Animals (Movie 3)\n\n# Specials Rankings\n\n1. One Piece: Protect! The Last Great Performance\n2. Once Upon the Great Sea! A Father's Huge, HUGE Dream!\n3. One Piece Special: Adventure in the Ocean's Navel\n4. One Piece New Year Special: Special Report - Secret of the Straw Hat Pirates\n5. One Piece Special: The Detective Memoirs of Chief Straw Hat Luffy\n6. One Piece: Emergency Planning, A Perfect Strategy for the One Piece\n\n# OVA Rankings\n\n1. One Piece: Defeat the Pirate Ganzack!\n\n# Shorts Rankings\n\n1. Dream Soccer King\n2. Jango's Dance Carnival\n3. Take Aim! The Pirate Baseball King\n\n# Openings\n\n1. We Are! (1)\n2. Brand New World (6)\n3. Bon Voyage (4)\n4. Rainbow Star (7)\n5. Hikari e (3)\n6. Kokoro no Chizu (5)\n7. Believe (2)\n\n# Endings\n\n1. Shouchi no Suke (4 - crew spotlight)\n2. Tsuki no Taiyo (12 - family left behind)\n3. Free Will (9 - Robin wakes crew)\n4. Glory - Kimi ga Iru Kara (7 - Vivi's past)\n5. Eternal Pose (15 - Past arc snapshots)\n6. Dear Friends (16 - Merry memories/funeral)\n7. Asu wa Kuru Kara (17 - young Robin in flower field)\n8. Before Dawn (5 - foot crew race)\n9. Memories (1 - Sunset water)\n10. Fish (6 - Chopper's adventures)\n11. Dreamship (13 - group photo)\n12. Run! Run! Run! (2 - Young crew runs)\n13. Mirai Koukai (14 - different birds)\n14. Adventure World (18 - fan art)\n15. Faith (10 - colorful Straw Hats)\n16. Shining ray (8 - crew jumps off cliff)\n17. Watashi ga Iru Yo (3 - Going Merry life)\n18. A to Z (11 - Come back to your friends)\n\n# Watch Order (for those curious)\n\n**Water 7 Saga (49.8 hours)**\n\n* Kyutai Panic Adventure Returns!\n* Movie 6: One Piece: Baron Omatsuri &amp; The Secret Island\n* Long Ring Long Land Arc - Episode 207-219\n* Ocean's Dream Arc - 220-224\n* Foxy's Return Arc - 225-228\n* Movie 7: One Piece: The Giant Mechanical Soldier of Karakuri Castle\n* Water 7 Arc - 229-253\n* Special 4: One Piece Special: The Detective Memoirs of Chief Straw Hat Luffy\n* One Piece New Year Special: Special Report - Secret of the Straw Hat Pirates\n* Water 7 Arc - 254-263\n* Enies Lobby Arc- 264-278\n* Straw Hat Theater - Episode 279-283\n* Enies Lobby Arc - Episode 284-290\n* Boss Luffy Historical Arc - 291-292\n* Enies Lobby Arc - 293-302\n* Boss Luffy Historical Arc - 303\n* Enies Lobby Arc - 304-312\n* Post Enies Lobby Arc - 313-325\n\n# Next up: Thriller Bark\n\nhttps://preview.redd.it/y5l9mzspv2la1.jpg?width=736&amp;format=pjpg&amp;auto=webp&amp;v=enabled&amp;s=0079ec9ddf60f3a8ae9be8eb8cd4e7b97599a53a",
        "created_utc": 1677678675,
        "upvote_ratio": 0.8
    },
    {
        "title": "Why are people defending monsters?",
        "author": "Op_Yamcha",
        "url": "https://www.reddit.com/gallery/11f43g1",
        "text": "",
        "created_utc": 1677678174,
        "upvote_ratio": 0.65
    },
    {
        "title": "I was planning to get a cheaper figurine of Chopper but wife got me this instead!",
        "author": "kuraikage15",
        "url": "https://www.reddit.com/gallery/11f3hen",
        "text": "",
        "created_utc": 1677676465,
        "upvote_ratio": 0.94
    },
    {
        "title": "So my friend (she had never seen or read One Piece) just got me a box of random OP stuff for my birthday, probably the best gift I ever got",
        "author": "Yavee17",
        "url": "https://www.reddit.com/r/OnePiece/comments/11f3efm/so_my_friend_she_had_never_seen_or_read_one_piece/",
        "text": "&amp;#x200B;\n\nhttps://preview.redd.it/3lafkgu2n4la1.jpg?width=3024&amp;format=pjpg&amp;auto=webp&amp;v=enabled&amp;s=aa48420ec23451ac670d839a4fc48a2df4d096ec",
        "created_utc": 1677676235,
        "upvote_ratio": 0.75
    },
    {
        "title": "What ep is the best to start with?",
        "author": "Feeling_Tourist_7964",
        "url": "https://www.reddit.com/r/OnePiece/comments/11f3dft/what_ep_is_the_best_to_start_with/",
        "text": "Hey, I am reading the manga of One Piece and I am in Chapter #111. I know it's low. \n\nAnd I wanted to ask the best ep to start with the anime. I read the manga because I have heard a lot of how One Piece was bad at pacing, HAD bad animation, and they stretched. So I am here to ask, when does that stop. What ep of One Piece where it's animation is top notch, had great pacing, and basically toe to toe with modern anime. What ep best to start with for a modern anime fan?",
        "created_utc": 1677676158,
        "upvote_ratio": 1.0
    },
    {
        "title": "What if Cavendish could control Hakuba? What power would you put him at?",
        "author": "Proudnoob4393",
        "url": "https://i.redd.it/eapttgoy26la1.jpg",
        "text": "",
        "created_utc": 1677675618,
        "upvote_ratio": 0.66
    },
    {
        "title": "I made 2 pictures just to be sure. In terms of Framerate and Artquality, which is better?",
        "author": "megadude1427",
        "url": "https://www.reddit.com/gallery/11f31kc",
        "text": "",
        "created_utc": 1677675238,
        "upvote_ratio": 0.56
    },
    {
        "title": "One Piece Film Red?",
        "author": "TehHuntIsOm",
        "url": "https://www.reddit.com/r/OnePiece/comments/11f310u/one_piece_film_red/",
        "text": "Hey i was just wondering if anyone could provide information on an online release of the new film red?  \nI watched it in theaters and havent been able to watch it since and im really bummed about it, id love to watch it again.",
        "created_utc": 1677675193,
        "upvote_ratio": 0.6
    },
    {
        "title": "Who is the best leader for Grand party?",
        "author": "[deleted]",
        "url": "",
        "text": "[deleted]",
        "created_utc": 1677675072,
        "upvote_ratio": 1.0
    },
    {
        "title": "Had a dream that I saw the Live-Action One Piece series.",
        "author": "WoolooMVP10",
        "url": "https://www.reddit.com/r/OnePiece/comments/11f2xyg/had_a_dream_that_i_saw_the_liveaction_one_piece/",
        "text": "&gt;!It was a nightmare!&lt;",
        "created_utc": 1677674942,
        "upvote_ratio": 0.5
    },
    {
        "title": "just some backgrounds +gyro (:",
        "author": "Admirable-Flan-8474",
        "url": "https://www.reddit.com/gallery/11f2vsi",
        "text": "",
        "created_utc": 1677674764,
        "upvote_ratio": 1.0
    },
    {
        "title": "my apologies for beating a dead horse atp",
        "author": "Mymomgay1",
        "url": "https://www.reddit.com/r/OnePiece/comments/11f2g21/my_apologies_for_beating_a_dead_horse_atp/",
        "text": "But it has been a while since yamato decided to stay in wano for the time being. Do yall still believe she is joining the crew at some point in the future or have yall given up hope?",
        "created_utc": 1677673439,
        "upvote_ratio": 0.6
    },
    {
        "title": "Y'all I'm in dressrosa arc rn and i just noticed this kuma tee , does this mean something? or it's just random?",
        "author": "not_azrael_96",
        "url": "https://i.redd.it/v47rywarv5la1.jpg",
        "text": "",
        "created_utc": 1677673197,
        "upvote_ratio": 1.0
    },
    {
        "title": "The most favorite gift of my life!",
        "author": "ThenCommunication196",
        "url": "https://i.redd.it/v85t2gjmd4la1.png",
        "text": "",
        "created_utc": 1677673055,
        "upvote_ratio": 0.58
    },
    {
        "title": "Got my first One Piece Tattoo!",
        "author": "Gaiagaia146",
        "url": "https://i.redd.it/k2s0t93mu5la1.jpg",
        "text": "",
        "created_utc": 1677672812,
        "upvote_ratio": 0.91
    },
    {
        "title": "about a certain future episode",
        "author": "F1RECHARGE_official",
        "url": "https://www.reddit.com/r/OnePiece/comments/11f26r9/about_a_certain_future_episode/",
        "text": "&amp;#x200B;\n\n[DO NOT SCROLL!! SPOILERS BELOW!](https://preview.redd.it/72wkjugzb4la1.png?width=1920&amp;format=png&amp;auto=webp&amp;v=enabled&amp;s=c4b624534d5841f9dab3f9ca18e5bb095ce31fc9)\n\nAs I joined this subreddit a few months ago, I don't know how many times this topic has been addressed &amp; milked out but I wanted to talk about gear 5 scenes that would be seen animated more frequently after ch. 1044 gets animated.   \n\n\nI don't know what you guys expect from that episode but, the real thing is, Gear 5 isn't like any other regular shounen MC power-up. When it gets animated it should be **goofy, ridiculous &amp; lively** as fuck. It should feel more like watching Mickey Mouse move &amp; not Monkey D. Luffy. So whoever gets to work on that chapters &amp; those panels, better know what they're working on. *Skypeia skippers* &amp; *LONG-Piece audiences* should question those fight scenes &amp; animation *\"****why was this thing hyped?****\".* \n\n I don't know about aura &amp; all, but I can't think of any other way to give justice to toon Luffy fights. This is because I find Gear 5 Luffy to be not Luffy's power-up, but Oda sensei's power-up &amp; **freedom to draw anything**, the panel itself was/is an extension of the art style that is comparable from head to toe with \"He laughed\" Panel.  \nChapters, themes, and some parts of the plot are frequently centered around **Laughs &amp; smiles** &amp; Oda sensei's post-time skip art brings out this very colorfully. Among thousands of panels, gear 5 Luffy's fights gave true freedom not only to Luffy but to Oda sensei too. The panels are full of creativity &amp; life. And I **CANNOT** imagine any other media form other than animation to replicate the feel, compliment the art &amp; essence of the Gear 5 &amp;  justify the moment.   \n\n\nAs far as Hiyori's part goes, I wish Toei could somehow move that part either **before or after ch. 1044** ep. Such an important moment was buried below another peak moment. At first read, I too was so overflown by Gear5 &amp; I forgot about her moment, only to be reminded of this by a **chapter review** video of *Tekking101*.   \n\n\nAnd rest if you ask me for the music, **Vol. 103's PV** theme song \"[Drums of Liberation](https://youtu.be/fX9NK-_YqlI)\" Would be the most peaked choice, even if they go with some other original music, I will be happy to test(taste) it out.   \n\n*Edit: Among all these paragraphs, I forgot about most important thing, Mayumi Tanaka(Luffy's VA). I am not lying when I say that her(luffy's) laugh gives me goosebumps whenever it's playing in my brain. So yes, her voice would even peak-ify that panel &amp; immortalise One Piece as GOAT Piece*\n\n\nThanks for reading, I want to hear your thoughts on my thoughts as well as on the anime adaptation of ch. 1044",
        "created_utc": 1677672659,
        "upvote_ratio": 0.57
    },
    {
        "title": "The new SBS is an insult",
        "author": "NinaJova",
        "url": "https://www.reddit.com/r/OnePiece/comments/11f1vhi/the_new_sbs_is_an_insult/",
        "text": "You spend 4 years in Wano, you push random characters in it and give them unnecessary screentime (headliners, gifters, scabbards) but fail to give conclusions to all your previously set-up plot points. \n\nOn top of that you fail to give backstories to a character we have known for 20+ years in Zoro and the most hyped up antagonist in the story Kaido while wasting panels on people like the scabbards.\n\nHow anyone can defend this writing and Wano in general is seriously mind boggling to me.",
        "created_utc": 1677671743,
        "upvote_ratio": 0.3
    },
    {
        "title": "So, is Zorro technically the righful daimyo of Ringo?",
        "author": "mfj__",
        "url": "https://www.reddit.com/r/OnePiece/comments/11f11qc/so_is_zorro_technically_the_righful_daimyo_of/",
        "text": "As we all probably know by now, Oda has revealed that Zorro is in fact related to the Shimotsuki-clan. Moreover, he is a direct descendant of ushimaru, the last legitimate daimyo of Ringo who got killed by Kaido, as his grandmother was ushimarus older sister. \n\nThere are no known children or grandchildren of ushimaru, so zorro is the only known direct relative of the former daimyo of Ringo, which should technically make zorro the rightful daimyo of Ringo now, since ushimaru is no longer around. \n\nI know zorro wouldnt even care if he knew about that, but its still an interesting fun-fact.\n\nEdit: Zorro may not be a direct descendant of Ushimaru himself, since zorro is not directly coming from his bloodline. But lets say  daimyos in wano are chosen like the shogun, through inheritance by the children of the current daimyo, then Ushimarus predecessor was his father, who would also be zorros grand-grandfather, meaning that zorro is in fact a descendant of the royal blood-line, since his grandmother would be the daughter of the daimyo that reigned before ushimaru. Ringo is an abandoned region and there are no other known shimotsukis that descend from the royal bloodline. In fact, there arent even known shimotsukis at all in wano since yasuie died, so zorro would technically be the last shimotsuki who could be considered as the legitimate daimyo of ringo.",
        "created_utc": 1677668999,
        "upvote_ratio": 0.25
    },
    {
        "title": "What zoro do you prefer?",
        "author": "maulin23",
        "url": "https://www.reddit.com/r/OnePiece/comments/11f0u9d/what_zoro_do_you_prefer/",
        "text": "Pre timeskip: laughs and smiles more often, weaker but still op for pre timeskip.  \nor  \nCurrent: not a lot of smiles or laughs, able to deafeat king and scar kaido + has enma.",
        "created_utc": 1677668319,
        "upvote_ratio": 0.5
    },
    {
        "title": "Kuina's fate is actually more tragic in the 4KIDS Dub",
        "author": "Kirbo84",
        "url": "https://www.reddit.com/r/OnePiece/comments/11f0r0t/kuinas_fate_is_actually_more_tragic_in_the_4kids/",
        "text": "Rather than dying in a freak Down D. Stairs accident, she's crippled for life. That has to be a fate worse than death for an aspiring swordswoman. Rendered alive but unable to use a sword ever again. That's like a double Shanks.",
        "created_utc": 1677667980,
        "upvote_ratio": 0.75
    },
    {
        "title": "Orochi acted in self defence",
        "author": "Apprehensive_Bee9924",
        "url": "https://www.reddit.com/r/OnePiece/comments/11f0hif/orochi_acted_in_self_defence/",
        "text": "The latest SBS confirmed that Tama (one of the MVPs of the raid against Kaido) will face discrimination if her Kurozumi heritage is revealed. Oda has now essentially vindicated Orochi. \n\nThe people of wano have been and will continue to be hateful. Orochi was an enemy of wano before he even did anything wrong. He would have been killed if he wasn't able to hide his identity before he took power. \n\nInnocent kurozumis were hunted down in the past, why wouldn't they be persecuted further after 20 years of Kurozumi rule?\n\nTama will be powerful in the future and already has an ability that gives her control. For wano's sake, they better learn from the past and leave her alone. Or else the cycle of hate will continue anew.",
        "created_utc": 1677666985,
        "upvote_ratio": 0.32
    },
    {
        "title": "doubt from dressrosa",
        "author": "_rajivgeorge_",
        "url": "https://www.reddit.com/r/OnePiece/comments/11f0dja/doubt_from_dressrosa/",
        "text": "In which chapter does Leo from the tribe meet luffy in dressrosa!?",
        "created_utc": 1677666583,
        "upvote_ratio": 1.0
    },
    {
        "title": "what is up with oda and bed ridden dying moms lol",
        "author": "starprintedpajamas",
        "url": "https://www.reddit.com/r/OnePiece/comments/11f0d9e/what_is_up_with_oda_and_bed_ridden_dying_moms_lol/",
        "text": "how many is that so far i think this is the 5th?",
        "created_utc": 1677666553,
        "upvote_ratio": 0.2
    },
    {
        "title": "about Tama SBS reveal",
        "author": "Shoddy-Ad-4585",
        "url": "https://www.reddit.com/r/OnePiece/comments/11f0780/about_tama_sbs_reveal/",
        "text": " Her being **Kurozumi** and Hiyori's speech *\"not meaning harm to her\"* just doesn't work  \n\n\n* Oden was an **individual's** name and it was him who said he was born to boil. \n* Kurozumi is a **bloodline's** name, **a family name** that's already experienced discrimination for decades. \n\n No matter what intentions are, Hiyori's speech only means 1 thing- violence against **ALL** Kurozumi. Author wanting to make a \"pun\" doesn't not make it not bad writing. Author ignoring what a speech suggests for the character just to make a \"pun\" does not make him sound like a good writer.\n\nAnd Oda saying:  \n*\"if you look at Hiyori's story, you would understand that she's only meant Orochi\"*  doesn't work as an excuse, because nothing in Hiyori's story showed or even suggests that she only means Orochi. Hiyori barely even had a \"story\".",
        "created_utc": 1677665920,
        "upvote_ratio": 0.3
    },
    {
        "title": "Would people be upset if Luffy's mum was revealed in a SBS?",
        "author": "BuyerDefiant4725",
        "url": "https://www.reddit.com/r/OnePiece/comments/11ezrsk/would_people_be_upset_if_luffys_mum_was_revealed/",
        "text": "Wondering how people would react if this happened? I remember Oda saying once that the mum was not really that important- so I would not be surprised if the info was given in an SBS",
        "created_utc": 1677664342,
        "upvote_ratio": 0.4
    },
    {
        "title": "Mihawk will fight for Imu in the final battle",
        "author": "TasumiThierl",
        "url": "https://www.reddit.com/r/OnePiece/comments/11ezq9j/mihawk_will_fight_for_imu_in_the_final_battle/",
        "text": "To become the World's Strongest Swordsman, Zoro will defeat Mihawk at some point. You would think they could fight wherever and whenever. But we are now in the final Saga. Many things are going to happen that will keep the Strawhats busy. Zoro won't abandon his crew during those critical times. He won't fight an isolated battle for a mere title, while Luffy and the others fight to turn the world upside down.  When he bowed down to Mihawk and asked him for help, he made clear that the goals of his crew take precedent over his personal vanity.\n\nAfter Blackbeard, Akainu and Imu are defeated, there will be plenty of time. But putting Zoro's most exciting fight into the epilogue wouldn't match the relaxed tone of that part of the story.\n\nThis leaves Oda with no other option than to have the Mihawk fight included in one of the coming big battles. When Luffy fights Blackbeard, Zoro  will beat Shiryu. When Luffy battles Akainu, Zoro will fight an Admiral, probably Fujitora. Shiryu and Fujitora are swordsman. Not the strongest though. The strongest will be saved for last. Therefore Zoro will defeat Mihawk, when Luffy fights Imu.\n\nHawkeye got his nickname for his ringed eyes. Imu has them too. The only thing we could see from his silhouette. Imu and Mihawk might share such a characteristic feature because they are the final opponents of Luffy and Zoro.\n\nZoro's dream is still isolated, while most of the other Strawhat dreams are connected. Robin wants to read the Rio Poneglyph, which is on Laughtale. The island where the One Piece is hidden. Jinbe's dream of coexistence between Fish-Men and Humans likely requires getting rid of the World Government. The Strawhats will topple the Government, after they learn the True History. Zoro fighting Mihawk during the final battle, would incorporate him into this chain. He would have to beat Mihawk, to beat the Government, so that men and Fish-Men can live in peace together, among other things.\n\nA good fight needs tension. After Zoro became Mihawk's student, just meeting up and trying to kill each other would be weird. They must have bonded over the time skip. The viewer would assume that they are holding back. But if Hawkeye is made a serious obstacle to the Strawhats, Zoro would put his feelings aside and give all he can.",
        "created_utc": 1677664185,
        "upvote_ratio": 0.33
    }
]