[
    {
        "title": "Zoro graphic waterbottle with him training?",
        "author": "FunPresence8965",
        "url": "https://www.reddit.com/r/OnePiece/comments/11kbr88/zoro_graphic_waterbottle_with_him_training/",
        "text": "Seriously. Only ones I could find are just him doing regular poses. Seems like a huge missed opportunity",
        "created_utc": 1678132049,
        "upvote_ratio": 1.0
    },
    {
        "title": "Finally a political debate with actual contend! credits to Liam from Youtube #Dudeinaroom #Grandlinereview",
        "author": "ValuablePlastic5887",
        "url": "https://v.redd.it/yfb7twb8a6ma1",
        "text": "",
        "created_utc": 1678131931,
        "upvote_ratio": 1.0
    },
    {
        "title": "what should I watch op in ?",
        "author": "Confident-Ad6797",
        "url": "https://www.reddit.com/r/OnePiece/comments/11kbob7/what_should_i_watch_op_in/",
        "text": "I starter watch one piece last year but got a caught up in some stuff so stopped I got to ep 107 in sub but idk if I should watch in sub or dub so I'm reaching out to the pros should I watch sub or dub I'll read the comments and decide",
        "created_utc": 1678131875,
        "upvote_ratio": 1.0
    },
    {
        "title": "My brother made some One Piece characters for Miitopia a couple years ago, thought y'all would enjoy 'em.",
        "author": "AnonyMorshu",
        "url": "https://www.reddit.com/r/Miitopia/comments/11jjp9o/finally_getting_to_posting_a_dozen_one_piece_miis",
        "text": "",
        "created_utc": 1678131453,
        "upvote_ratio": 1.0
    },
    {
        "title": "8 plays of the crane machine at Round 1. I’ll take it",
        "author": "dsphilly",
        "url": "https://i.redd.it/albi6mz7q7ma1.jpg",
        "text": "",
        "created_utc": 1678131397,
        "upvote_ratio": 1.0
    },
    {
        "title": "Recommendation for reading the Manga?",
        "author": "ryan_12832",
        "url": "https://www.reddit.com/r/OnePiece/comments/11kb6oe/recommendation_for_reading_the_manga/",
        "text": "I don’t have access to money, so where is the best place to read the manga of One Piece. Thank you \n-Garfunkel",
        "created_utc": 1678130837,
        "upvote_ratio": 1.0
    },
    {
        "title": "Who will make a move next? 1076+",
        "author": "ABTRedits",
        "url": "https://www.reddit.com/r/OnePiece/comments/11kax2u/who_will_make_a_move_next_1076/",
        "text": "It seems that every yonko/major pirate crew has begun to make their move in recent chapters with Kidd finally coming into contact with Shanks on Elbaf. I believe the next crew to make their move will be cross-guild since Buggy is the only yonko that hasn't made his move yet (rather crocodile and mihawk I should say). I'm not sure what their move will be so if you have any ideas put em down below.",
        "created_utc": 1678130255,
        "upvote_ratio": 1.0
    },
    {
        "title": "Idea for a Plan for the One Piece (Live Action) Series",
        "author": "Tony_Pizza_Guy",
        "url": "https://www.reddit.com/r/OnePiece/comments/11kau4b/idea_for_a_plan_for_the_one_piece_live_action/",
        "text": "Hey! Just threw together a plan for which season(s) contain which story arcs/sagas for OP (Live Action version) - let me know whatcha think! Two things I should point out: 1st, like I'm sure +80% of are as well, I am not a fan of any of the live action adaptations of anime so far (that I've seen), and will be hesitant to try out the live action series, whenever it releases... this is just a plan, for a show that would hopefully be good. 2nd, I wouldn't say I'm a hardcore OP fan. Yes I am definitely a big fan, in that I've read the whole series once, and certain saga's twice (like all the sagas throw Alabasta Saga twice, for example). I'm just saying I wouldn't describe myself as someone who knows the series inside and out, every little detail, though I am a big fan. Also, before I begin, these idea's are with the thinking each episode is something like 30-60 minutes (let's say 40 on average). (Unrelated: I just wanna say I hope they have/do two things: have a big enough budget for the ridiculous amount of CGI, and that they just try to keep it veeery similar to the source material...) As you might assume, if you haven't read part one (pre-time skip, I think is volumes 1-60), I wouldn't look below:\n\n**OP - Live Action Season 1:**\n\n * E1:     Romance Dawn Arc (Episode 1)\n\n * E2-3:   Orange Town Arc (Episodes 2-3)\n\n * E3-5:   Syrup Village Arc (Episodes (end of) 3-5)\n\n * E6-9:   Baratie Arc\n\n * E10-14: Arlong Park Arc\n\n * E14-15: Loguetown Arc\n\n**Release schedule (unique for Netflix):** E1-3 Release a Monday, E4-6 Release the Friday After, E7-9 Release the Monday After, E10-15 Release the Friday After... Like, As In: May 1 is E1-3, May 5 is E4-6, May 8  is E7-9, and May 12 is E10-15.)\n\n**Episode Amounts:**\n\n * Season 2 could be the whole Alabasta Saga, w/ the Little Garden and Drum Island Arcs condensed (made shorter) - this season could be 17 (or 15) episodes.\n\n * Season 3 could be the Skypiea Saga *with* the Long Ring Long Land Arc at the end, condensed (used to introduce the Water 7 Saga) - this season could 10 (or 12) episodes.\n\n * Season 4 could be the whole Water 7 Saga - this season could be 15 episodes.\n\n * Season 5 could be Thriller Bark Arc and the Sabaody Arch. Arc - this season could be 10 (or 12) episodes.\n\n * Season 6 (Final Season) could be the remainder of Part One (Amazon Lily Arc, Impel Down Arc, Marineford Arc, &amp; Post-War Arc) - this season could be 15 (or 18) episodes... Making the whole show ~82 episodes.)\n\n\nRelease times could be: Season 1, May 2023... Season 2, July 2024...  Season 3, May 2025... Season 4, July 2026... Season 5, May 2027... Season 6, July 2028 (as an example... though I know studios, when not confident in a show, usually wait a little bit after the 1st season to decide if they'll make the 2nd season... I just hope that if people consider the show moderately good, that Netflix won't drop it if it doesn't immediately, quite reach their viewership quota.)\n\nLemme know whatcha think (and if you think anything's bad, please go easy haha)!",
        "created_utc": 1678130074,
        "upvote_ratio": 1.0
    },
    {
        "title": "I don't know what you think, but it looks pretty similar to me",
        "author": "Jake_Marshall_AA",
        "url": "https://i.redd.it/q5vzafjtj7ma1.jpg",
        "text": "",
        "created_utc": 1678129246,
        "upvote_ratio": 1.0
    },
    {
        "title": "D&amp;D Admiral Kizaru Statblock",
        "author": "saplea",
        "url": "https://www.reddit.com/r/OnePiece/comments/11ka6hv/dd_admiral_kizaru_statblock/",
        "text": "Hello everyone, me and my D&amp;D group decided to share some of the stat blocks that we have made in our campaign. Here is one for Admiral Kizaru, but in our camping which is set 20 years in the past in our own original world, he is just a vice admiral. Our crew's name is Fruit Punch Pirates and we just recently became Yonko in our storyline after 2 years of IRL D&amp;D sessions. Would you guys be interested to know more about our campaign, were thinking of streaming let us know. In the meantime enjoy the statblock. Here are the previous statblocks from our campaign which you might enjoy.\n\n[Zoro &amp; Sanji (Wano)](https://www.reddit.com/r/OnePiece/comments/114ejrn/dd_wano_zoro_and_sanji_statblocks/?utm_source=share&amp;utm_medium=web2x&amp;context=3)\n\n[Admiral Kuzan](https://www.reddit.com/r/OnePiece/comments/118o3k1/dd_aokijikuzan_statblock/?utm_source=share&amp;utm_medium=web2x&amp;context=3)",
        "created_utc": 1678128892,
        "upvote_ratio": 1.0
    },
    {
        "title": "Things to know before starting Wano?",
        "author": "Viorica25",
        "url": "https://www.reddit.com/r/OnePiece/comments/11ka4od/things_to_know_before_starting_wano/",
        "text": "Just reached episode 890, what are some things I should know before watching the Wano arc, considering that I have been spoiled about Gear 5 amongst many other things.",
        "created_utc": 1678128808,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does anybody else hate the girls hitting luffy?",
        "author": "Kyo1ji",
        "url": "https://www.reddit.com/r/OnePiece/comments/11ka3g3/does_anybody_else_hate_the_girls_hitting_luffy/",
        "text": "Im currently at episode 104 and im so pissed off when vivi started punching luffy, for a second i was happy when he punched vivi back but now she is punching her back to back,\nThis is also not only Vivi but almost every single girl in the anime is punching Luffy, it just pisses me off, why its pike this in every anime, why the MC just cant beat the shit out of them when it happens?",
        "created_utc": 1678128751,
        "upvote_ratio": 1.0
    },
    {
        "title": "D&amp;D Admiral Kizaru Statblock",
        "author": "Saplea01",
        "url": "https://www.reddit.com/r/OnePiece/comments/11ka0x8/dd_admiral_kizaru_statblock/",
        "text": "[removed]",
        "created_utc": 1678128640,
        "upvote_ratio": 1.0
    },
    {
        "title": "Rasssennngannn",
        "author": "Cafenn94",
        "url": "https://v.redd.it/5v0mogytg7ma1",
        "text": "",
        "created_utc": 1678128248,
        "upvote_ratio": 1.0
    },
    {
        "title": "Some time ago I stopped caring about the Strawhats.",
        "author": "WriterMindless7370",
        "url": "https://www.reddit.com/r/OnePiece/comments/11k8tfs/some_time_ago_i_stopped_caring_about_the_strawhats/",
        "text": "As the Title says some time ago I reached a point where I enjoyed the story (character wise) solely because of its villains, their stories and actions. \n\nThis point of view manifested on Marineford when Blackbeard arrived, fucked shit up and dipped.\nI was baffled back then and even though he got his ass beat he got what he wanted there. \nAfter that experience Luffy’s training arc was the nail in the coffin for me because of all the crying and emotional stuff going on.\n\nTo this day the most interesting chapters to me are when we either see what Blackbeard/some other villain is up to or when a new bad guy is introduced/explained.\nUntil a certain personal experience Zoro was the last Strawhat that got me hyped in some way.\n\nDon‘t get me wrong I really love One Piece but the reason of watching it has changed for me.\n\nNow ultimately I wanted to ask.. is anybody else feeling that way and if yes.. why?",
        "created_utc": 1678127054,
        "upvote_ratio": 1.0
    },
    {
        "title": "What would be the outcome if Luffy, at his current power level, in collaboration with the grand fleet, all his allies, the Revolutionary Army, and maybe Katakuri, opened a total war against the world government?",
        "author": "Technical-Ad660",
        "url": "https://www.reddit.com/r/OnePiece/comments/11k8q6o/what_would_be_the_outcome_if_luffy_at_his_current/",
        "text": "[removed]",
        "created_utc": 1678126947,
        "upvote_ratio": 1.0
    },
    {
        "title": "What If Oda NEVER actually reveals the One Piece...directly?",
        "author": "mambomak",
        "url": "https://www.reddit.com/r/OnePiece/comments/11k8czs/what_if_oda_never_actually_reveals_the_one/",
        "text": "This is speculation, but...\n\nI'm not sure exactly what type of author Oda is and whether I'm hyping him up too much in my head or not, but one idea recently occurred to me. \n\nOda seems to put A LOT of work into the sub-text of his story. A LOT. It's not just mindless sub-text meant to imply depth either. It tends to be interconnected and meaningful to both the situation and the evolution of the story and the understanding of it. In other words...the real value of the story is buried beneath it's superficial aspects. \n\nSo what if Oda does the same with One Piece. What if, by the end of the story, we are *told* what the One Piece is by the story. And people who immediately take what the story says to be true as absolute truth declare that is the One Piece...but Oda would actually *hide* the real One Piece in the sub text of the story. And it would only be those who dare to venture into those depths that actually come out with the *real* One Piece? The difference in time between the story revealing what the One Piece is and those individual and talented explorers of the depths who come to understand the *true* One Piece of the story might take years and it would be a masterstroke of Oda's- especially if both reveals were highly favored by fans, but the final one blew open heads and reignited a love for the story years after it ended.",
        "created_utc": 1678126534,
        "upvote_ratio": 1.0
    },
    {
        "title": "I just watched this online and now I'm crying at this part",
        "author": "Puzzleheaded_Ad9659",
        "url": "https://i.redd.it/mvdoih9ma7ma1.jpg",
        "text": "",
        "created_utc": 1678126148,
        "upvote_ratio": 1.0
    },
    {
        "title": "My Roronoa Zoro Pixel Art!",
        "author": "Alfonmaster7",
        "url": "https://i.redd.it/1tusk5nzp5ma1.png",
        "text": "",
        "created_utc": 1678125125,
        "upvote_ratio": 1.0
    },
    {
        "title": "SPOILERS Theory about the upcoming fight",
        "author": "mister_r0yal",
        "url": "https://www.reddit.com/r/OnePiece/comments/11k6w3f/spoilers_theory_about_the_upcoming_fight/",
        "text": "Shanks main nickname is “the killer of observation haki” so I’ve been thinking whats the main purposes of obv haki to dodge and predict attacks now let me ask does kidd seriously seem like he relies on that cause he always seemed like hed rather take a hit then dodge it so what if thats how he beats shanks while yes shanks may ‘kill’ his obv haki kidd might just…not care not to mention kidd is seriously just underestimated by everyone in this reddit",
        "created_utc": 1678124881,
        "upvote_ratio": 1.0
    },
    {
        "title": "My minimalistic Yamato fanart",
        "author": "ateliernyacoris",
        "url": "https://www.reddit.com/r/OnePiece/comments/11k6hpr/my_minimalistic_yamato_fanart/",
        "text": "Hello, fellow pirates! As my first post into this community, I'd like to showcase my new \\*tentative\\* artstyle. Would you be willing to see other female OP characters in the same fashion in the future? Please, tell me in the comment, your feedback inspires me and is very much appreciated!  ♡  \n\nhttps://preview.redd.it/jjwcimnwn5ma1.png?width=680&amp;format=png&amp;auto=webp&amp;v=enabled&amp;s=9ead75ca3fea73c3881bf233757abee17fda8af3\n\nMy insta: [https://www.instagram.com/p/CpdG7K7LDTz/](https://www.instagram.com/p/CpdG7K7LDTz/)",
        "created_utc": 1678124411,
        "upvote_ratio": 1.0
    },
    {
        "title": "Luffy with watercolor by me 🏴‍☠️❤️",
        "author": "myunili",
        "url": "https://i.redd.it/s7rnk9gj47ma1.jpg",
        "text": "",
        "created_utc": 1678124112,
        "upvote_ratio": 1.0
    },
    {
        "title": "Liberated my phone from its old wallpaper(manga spoilers)",
        "author": "gtedvgt",
        "url": "https://i.redd.it/mhm89mkx37ma1.jpg",
        "text": "",
        "created_utc": 1678123901,
        "upvote_ratio": 1.0
    },
    {
        "title": "Theory about a minor character purpose in the final saga",
        "author": "Honk4Silence",
        "url": "https://www.reddit.com/r/OnePiece/comments/11k5dpu/theory_about_a_minor_character_purpose_in_the/",
        "text": "Do to his inclusion in recent chapter it makes me think - Will Wapol fuse another two characters together? If so who will the characters be?\n\nTemporary Sanji/Zoro fusion? 😅",
        "created_utc": 1678123126,
        "upvote_ratio": 1.0
    },
    {
        "title": "ZkSync Token's is Live. 03.06.2023",
        "author": "InfiniteEgg3",
        "url": "https://www.reddit.com/r/OnePiece/comments/11k57b6/zksync_tokens_is_live_03062023/",
        "text": "ZkSync issues a token. Discover the latest token release by ZkSync. Explore their official website to learn about the innovative technology powering it. 03.06.2023 https://twitter.com/Ladislavdzl/status/1632753693840879617",
        "created_utc": 1678122931,
        "upvote_ratio": 1.0
    },
    {
        "title": "Was Just feeling sad, felt like sharing {One Piece Image - u/One_Piece_Archives}",
        "author": "Down-D-Stairs_Fan",
        "url": "https://i.redd.it/c0u6h7bpi5ma1.jpg",
        "text": "",
        "created_utc": 1678122695,
        "upvote_ratio": 1.0
    },
    {
        "title": "Yamato Cosplay",
        "author": "jennifertorresreyes",
        "url": "https://i.redd.it/iea8sb8507ma1.jpg",
        "text": "",
        "created_utc": 1678122635,
        "upvote_ratio": 1.0
    },
    {
        "title": "One Piece marching cadence by ChatGPT",
        "author": "TornIsLife",
        "url": "https://www.reddit.com/r/OnePiece/comments/11k4wbq/one_piece_marching_cadence_by_chatgpt/",
        "text": "(Leader)\n\nI don't know what you've been told, \n\nBut One Piece is worth its weight in gold!\n\n(Chorus) \n\nYo ho ho and a bottle of rum, \n\nWe'll find One Piece and make our run!\n\n(Leader) \n\nLuffy's the captain, and he's got the dream, \n\nTo find the One Piece, or so it seems!\n\n(Chorus) \n\nYo ho ho and a barrel of grog, \n\nWe'll follow Luffy through storm and fog!\n\n(Leader) \n\nZoro's the swordsman, he's got the skill, \n\nTo cut through anything, with a single thrill!\n\n(Chorus) \n\nYo ho ho and a tankard of ale, \n\nWe'll follow Zoro without fail!\n\n(Leader) \n\nNami's the navigator, she's got the maps, \n\nTo guide us through the Grand Line's traps!\n\n(Chorus) \n\nYo ho ho and a keg of beer, \n\nWe'll trust Nami, without fear!\n\n(Leader) \n\nSanji's the cook, he's got the flair, \n\nTo feed the crew, with style and care!\n\n(Chorus) \n\nYo ho ho and a jug of wine, \n\nWe'll eat Sanji's dishes, they're divine!\n\n(Leader) \n\nUsopp's the marksman, he's got the aim, \n\nTo shoot down enemies, without shame!\n\n(Chorus) \n\nYo ho ho and a flask of gin, \n\nWe'll back Usopp, he always wins!\n\n(Leader) \n\nChopper's the doctor, he's got the cure, \n\nTo heal our wounds, and make us endure!\n\n(Chorus) \n\nYo ho ho and a mug of mead, \n\nWe'll trust Chopper, in times of need!\n\n(Leader) \n\nRobin's the archaeologist, she's got the knowledge, \n\nTo uncover secrets, from every college!\n\n(Chorus) \n\nYo ho ho and a cup of tea, \n\nWe'll follow Robin, she's our key!\n\n(Leader) \n\nFranky's the shipwright, he's got the skill, \n\nTo build us a ship, that's strong and still!\n\n(Chorus) \n\nYo ho ho and a flagon of rum, \n\nWe'll sail Franky's ship, it's the one!\n\n(Leader) \n\nBrook's the musician, he's got the beat, \n\nTo make us dance, with his sweet treats!\n\n(Chorus) \n\nYo ho ho and a bottle of rum, \n\nWe'll follow Brook, he's loads of fun!\n\n(Leader) \n\nSo come on crew, let's set sail, \n\nTo find One Piece, without fail!\n\n(Chorus) \n\nYo ho ho and a barrel of ale, \n\nWe'll find One Piece, and tell the tale!",
        "created_utc": 1678122609,
        "upvote_ratio": 1.0
    },
    {
        "title": "Reason Shanks bet on Luffy,",
        "author": "AromaticMortgage1981",
        "url": "https://www.reddit.com/r/OnePiece/comments/11k4o1a/reason_shanks_bet_on_luffy/",
        "text": "[removed]",
        "created_utc": 1678122254,
        "upvote_ratio": 1.0
    },
    {
        "title": "Confirmed ussop is bouta die in the final arc",
        "author": "LXIX_Jake",
        "url": "https://i.redd.it/p3ontbtry6ma1.jpg",
        "text": "",
        "created_utc": 1678122166,
        "upvote_ratio": 1.0
    },
    {
        "title": "Drawing Suggestions",
        "author": "Human_Ad_7651",
        "url": "https://www.reddit.com/r/OnePiece/comments/11k4lpe/drawing_suggestions/",
        "text": "I have to do a drawing of anything in One Piece for an English project I'm doing and I need suggestions for something to draw. I don't care who or what it is as long as it's not something extremely difficult. My favorite character is Sanji also but it doesn't have to be him.",
        "created_utc": 1678122146,
        "upvote_ratio": 1.0
    },
    {
        "title": "Weird how Toei was hacked last year this time causing a two week break pretty much in the same time.",
        "author": "JettX61",
        "url": "https://www.reddit.com/r/OnePiece/comments/11k4cn7/weird_how_toei_was_hacked_last_year_this_time/",
        "text": "Every delay makes whats already so far away from the screen that much longer.",
        "created_utc": 1678121889,
        "upvote_ratio": 1.0
    },
    {
        "title": "Legitimate Funko?",
        "author": "BassistJess13",
        "url": "https://www.reddit.com/r/OnePiece/comments/11k47w1/legitimate_funko/",
        "text": "What do you guys know about itsonepiece.com and how legit their funko are? They state they are reproduction which I’m fine with, I just want to make sure they’re actual Funko and not fakes.  Looking to buy Luffy in his hat. Thanks!",
        "created_utc": 1678121748,
        "upvote_ratio": 1.0
    },
    {
        "title": "can someone literally spoil every arc past enies lobby",
        "author": "Aggravating-Fee-4080",
        "url": "https://www.reddit.com/r/OnePiece/comments/11k404d/can_someone_literally_spoil_every_arc_past_enies/",
        "text": "can someone just spoil every arc past enies lobby because i aint paying for a whole other streaming service just so i can watch past episode 325",
        "created_utc": 1678121288,
        "upvote_ratio": 1.0
    },
    {
        "title": "Would luffy sacrifice his dream for his crew?",
        "author": "0_yungRene_0",
        "url": "https://www.reddit.com/r/OnePiece/comments/11k3vux/would_luffy_sacrifice_his_dream_for_his_crew/",
        "text": "I was just wondering if luffy would give up his dream, whatever it truely is, to safe his crew? I dont think what will happen, but I just think he would! What are y'all thoughts on this?",
        "created_utc": 1678121014,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is there ever going to be a new member of the straw hats?",
        "author": "AcceptablePay4523",
        "url": "https://www.reddit.com/r/OnePiece/comments/11k3jhg/is_there_ever_going_to_be_a_new_member_of_the/",
        "text": "I thought it was supposed to be 10 members",
        "created_utc": 1678120255,
        "upvote_ratio": 1.0
    },
    {
        "title": "Museum scenario",
        "author": "Luffy-no-kaikozu",
        "url": "https://i.redd.it/lyl3ckzes6ma1.jpg",
        "text": "",
        "created_utc": 1678120027,
        "upvote_ratio": 1.0
    },
    {
        "title": "My coloring of the last page from chapter 1076",
        "author": "EustassQ",
        "url": "https://i.redd.it/z6fk8e3n95ma1.jpg",
        "text": "",
        "created_utc": 1678119607,
        "upvote_ratio": 1.0
    },
    {
        "title": "Anyone else kinda upset?",
        "author": "Zoros-left-eye-",
        "url": "https://www.reddit.com/r/OnePiece/comments/11k364o/anyone_else_kinda_upset/",
        "text": "Anyone kinda sad Luffys awakened powers just makes him Jake from adventure time? Lmfao coulda been more/better but our main man Luffy is rubber what coulda we expected",
        "created_utc": 1678119439,
        "upvote_ratio": 1.0
    },
    {
        "title": "Lucci &amp; Boa devil fruits revealed",
        "author": "Zockyboy",
        "url": "https://www.reddit.com/gallery/11k34th",
        "text": "",
        "created_utc": 1678119361,
        "upvote_ratio": 1.0
    },
    {
        "title": "I made Custom Handtufted Dr. Chopper Keyboard Rug....How is it??? 😁",
        "author": "ruggyland1",
        "url": "https://www.reddit.com/gallery/11k2nxy",
        "text": "",
        "created_utc": 1678118331,
        "upvote_ratio": 1.0
    },
    {
        "title": "In which anime episode does Shanks and Uta steal the devil fruit from the World Government?",
        "author": "Bonty1201",
        "url": "https://www.reddit.com/r/OnePiece/comments/11k2ncy/in_which_anime_episode_does_shanks_and_uta_steal/",
        "text": "I’m not talking about the story which Who’s Who tells Jimbei. I’m talking about the scene where Shanks opens the Devil Fruit box while Uta is asking him for the Devil Fruit.",
        "created_utc": 1678118292,
        "upvote_ratio": 1.0
    },
    {
        "title": "my theory as to why the new world is imposable to map(warning: I am not smart. I will probably get things very incorrect) (and i think spoilers as well since i talk a little about the origin of devil fruits)",
        "author": "notyour_worstfriend",
        "url": "https://www.reddit.com/r/OnePiece/comments/11k2ly6/my_theory_as_to_why_the_new_world_is_imposable_to/",
        "text": "**my theory is as fallows**: the reason why the new world is unmappable is cause it constantly shifts to peoples desires. same way that haki is used. same way devil fruits are made. the idea being that it would explain why laugh tale is so imposable to randomly find. cause in a sense right now it doesn't exist. it stopped existing when roger announced it since he was the only one to know where it is and he then died. cause the worlds haki/desires all clashed billions of people trying to figure out where it is with no clue where. some of those being the yonko. who are also clashed with there wants and whereabouts of where they think laugh tale will be. so in order to find laugh tale you need to unified people with the poneglyphs and from there. once everyone knows that's when it reveals itself.\n\nis it outlandish. yes 100% outlandish.\n\nis it plausible due to the effects desires have had through the series ie zoros asura, sanjis jambe (he can use it underwater), devil fruits in general and haki. also yes\n\nam i thinking way to hard about this. most likely but it sounds way to likely for me to not think about it\n\n**summery**: the islands move due to the masses of desires not knowing exactly where the islands are in the new world and grand line exclusively due to there anomalies effects. this making the use of the log poses necessary since they will lead you to desires some even being eternal log poses despite that that is not how magnetism works (also vivre cards. how do they work idk) and due to the hyperfiction on laugh tale throughout the entire planet billions of people speculating where it could be a million thinking it's here a million thinking it's there so on so forth with yonko also trying to figure that out butting heads. currently it doesn't exist till the road poneglyphs tell the world or a strong enough unified force gets it. ie whitebeards crew (we don't know when he found it).\n\nso what you'll think of my probably crack headed rambling XD",
        "created_utc": 1678118201,
        "upvote_ratio": 1.0
    },
    {
        "title": "Fishman have a sulong-like transformation that turns them into dragon people",
        "author": "Kenny_Brahms",
        "url": "https://www.reddit.com/r/OnePiece/comments/11k2j97/fishman_have_a_sulonglike_transformation_that/",
        "text": "Fishmen were the first non human race we were introduced to. At the time, they seemed extremely powerful. But as the series progressed, Oda introduced new races like the giants, minks, and lunarians, and now the fishmen don't seem as special as they once did.\n\nHowever, one of the straw hats, Jinbe, is a fishman. Hence, I think Oda might do something with fishmen going forward in order to make them much more powerful.\n\nIn the one piece world, dragons are considered a type of fish. This can be seen with Kaido's DF being a model of the fish fish fruit. But this can also be seen with Ryugu kingdom, the country that rules fishman island, having the japanese word for dragon in its name(ryu) as well as there being a metal dragon on Ryugu palace, reaffirming the dragon connection. This is obviously a homage to the myth about a fish turning into a dragon. But what if there is something more to this?\n\nI believe that if a fishman becomes strong enough, they can turn into a dragon person. This would essentially be the fishman version of a su long form, however I think it will be much more powerful. \n\nUltimately, I think Jinbe will awaken this power up going forward in the series. I think it is extremely rare and it will require Jinbe to become one of the strongest fishmen in history. Perhaps Sunbell, the fishman on the Roger pirates, also had this ability.",
        "created_utc": 1678118029,
        "upvote_ratio": 1.0
    },
    {
        "title": "Blackbeard, maybe the most piratey pirate in One Piece, what does everyone think he’s gonna get up to in the Final Saga?",
        "author": "ArtByChaz",
        "url": "https://i.redd.it/scvh21vxk6ma1.jpg",
        "text": "",
        "created_utc": 1678117513,
        "upvote_ratio": 1.0
    },
    {
        "title": "Sorry for the delay, decided to post in bulk this time, so here's Dofalmingo as Spidops and Jinbei as Quagsire.",
        "author": "Rowlett64",
        "url": "https://www.reddit.com/gallery/11k2aqu",
        "text": "",
        "created_utc": 1678117484,
        "upvote_ratio": 1.0
    },
    {
        "title": "Raw physical power",
        "author": "Express-Account-2131",
        "url": "https://www.reddit.com/r/OnePiece/comments/11k27xd/raw_physical_power/",
        "text": "Based on raw power, who's the strongest among the straw hats?\n\nI think it's b/w Franky jimbei Zoro and luffy\n\nBut Franky and jimbei makes more sense. Zoro is fair shout too",
        "created_utc": 1678117298,
        "upvote_ratio": 1.0
    },
    {
        "title": "How Shanks REALLY views Luffy *SPOILERS FOR CHAPTER 1044+*",
        "author": "PirateKing1342",
        "url": "https://www.reddit.com/r/OnePiece/comments/11k26oy/how_shanks_really_views_luffy_spoilers_for/",
        "text": "I was watching the anime last night, and they were going through flashbacks of a bunch of different key story elements, and they replayed Shanks saving Luffy from the sea king when he was a little kid. Now that we know that Luffy’s fruit isn’t actually the Gum Gum fruit, and is actually the Sun God Nika fruit, do you all think Shanks saved luffy because he cared for him? Or because he couldn’t let something as valuable as the Nika fruit get out of his sights? I’m sure no one knows the true answer, but just something interesting I was thinking about. Also sure this has probably been talked about before haha",
        "created_utc": 1678117221,
        "upvote_ratio": 1.0
    },
    {
        "title": "Coming from an anime only one piece viewer. Any good websites to read the manga and is it worth it?",
        "author": "messingaround2425",
        "url": "https://www.reddit.com/r/OnePiece/comments/11k24v4/coming_from_an_anime_only_one_piece_viewer_any/",
        "text": "Been debating reading the manga to be up to date with the story, but feels kinda boring sometimes to read",
        "created_utc": 1678117107,
        "upvote_ratio": 1.0
    },
    {
        "title": "Almost everyone post Wano has his hands full",
        "author": "West_Conclusion_1239",
        "url": "https://www.reddit.com/r/OnePiece/comments/11k1und/almost_everyone_post_wano_has_his_hands_full/",
        "text": "1. Akainu staying at New Marineford and being frustrated\n2. Sabo escaping and being hunted by the WG\n3. Dragon and the Revolutionary Army chilling at Momoiro Island \n4. Luffy and Bonney meeting Vegapunk at Egghead and fighting Lucci, Kaku, and Seraphims\n5. Ryokugyu fighting and capturing Weevil at Sphinx Island\n6. Kuma at the Red Port climbing the Red Line \n7. Crocodile Mihawk and Buggy forming the Cross Guild\n8. Garp gearing up to go to Hachinosu\n9. Hancock trying to defend Amazon Lily from Navy raids with the help of Rayleigh and Shakuyaku\n10. Kizaru and the Elder Saturn heading to Egghead with over 100 Marine ships \n11. Blackbeard fighting Law at Winner Island\n12. Shanks fighting Kidd near the coast of Elbaf\n13. Imu erasing islands",
        "created_utc": 1678116476,
        "upvote_ratio": 1.0
    },
    {
        "title": "The Admirals and what they represent.",
        "author": "ChibakuDTensei",
        "url": "https://www.reddit.com/r/OnePiece/comments/11k1o8u/the_admirals_and_what_they_represent/",
        "text": "I don't know if you guys notice this if you take a close look at the Admirals and what they represent. It's something I love about Oda's writing.\n\nAkainu/Sakazuki: if you look at Akainu's character, he is an Admiral with the powers of lava and a man with a cold heart.\n\nAokiji/Kuzan: an Admiral with the powers of ice but a man with a warm heart.\n\nFujitora/Issho: an Admiral who is incapable of sight but a man who is capable of seeing the truth in its purest form.\n\nKizaru/Borsalino: an Admiral with the powers of lightspeed but a man with a slow demeanor.\n\nIt's a bit ironic and I'm all for it.",
        "created_utc": 1678116071,
        "upvote_ratio": 1.0
    },
    {
        "title": "GENDERBEND LUFFY [IG@WEEVICOS]",
        "author": "kurigohancos",
        "url": "https://i.redd.it/vq3qi2ztc6ma1.jpg",
        "text": "",
        "created_utc": 1678114787,
        "upvote_ratio": 1.0
    },
    {
        "title": "Well this my home screen,how is it?",
        "author": "Luffy-no-kaikozu",
        "url": "https://i.redd.it/zvxymkmjb6ma1.jpg",
        "text": "",
        "created_utc": 1678114355,
        "upvote_ratio": 1.0
    },
    {
        "title": "If you could send a text or email to Oda and he reads it , what would you say or ask ?",
        "author": "ThinAdvertising5567",
        "url": "https://www.reddit.com/r/OnePiece/comments/11k0rrg/if_you_could_send_a_text_or_email_to_oda_and_he/",
        "text": "Mine would be : \nThere is a popular theory among one piece fans that crocodile is the real mom of luffy , could you please make it happen ?",
        "created_utc": 1678113950,
        "upvote_ratio": 1.0
    },
    {
        "title": "Quick Zoro vs King by me",
        "author": "SnooAdvice1632",
        "url": "https://i.redd.it/txdc07x9a6ma1.jpg",
        "text": "",
        "created_utc": 1678113927,
        "upvote_ratio": 1.0
    },
    {
        "title": "thank you (g)oda",
        "author": "Erugon",
        "url": "https://i.redd.it/o3778ke1a6ma1.jpg",
        "text": "",
        "created_utc": 1678113849,
        "upvote_ratio": 1.0
    },
    {
        "title": "Lyffy's mom ( image by yang on devianart)",
        "author": "ivanandleah",
        "url": "https://i.redd.it/mknol0pjr4ma1.jpg",
        "text": "",
        "created_utc": 1678113587,
        "upvote_ratio": 1.0
    },
    {
        "title": "Will Oda introduce a version of G8 base or skip it?",
        "author": "SnooDrawings681",
        "url": "https://www.reddit.com/r/OnePiece/comments/11k0m8h/will_oda_introduce_a_version_of_g8_base_or_skip_it/",
        "text": " \n\nSince G8 is a filler arc, do you think Oda will just never mention it, make his own version of the arc or make the characters canon by introducing them to the story? I bring this up since all these bases are getting involved in the story now.",
        "created_utc": 1678113567,
        "upvote_ratio": 1.0
    },
    {
        "title": "Will Oda introduce a version or G8",
        "author": "SnooDrawings681",
        "url": "https://www.reddit.com/r/OnePiece/comments/11k0lc7/will_oda_introduce_a_version_or_g8/",
        "text": "Since G8 is a filler arc, do you think Oda will just never mention it, make his own version of the arc or make the characters canon by introducing them to the story? I bring this up since all these bases are getting involved in the story now.",
        "created_utc": 1678113501,
        "upvote_ratio": 1.0
    },
    {
        "title": "One Piece Odyssey RX 6600(I3-10105)",
        "author": "jakethesnakeisback16",
        "url": "https://youtube.com/watch?v=0tlPrVWoatE&amp;feature=share",
        "text": "",
        "created_utc": 1678113296,
        "upvote_ratio": 1.0
    },
    {
        "title": "Told Chat GPT to come up with a devil fruit",
        "author": "arcticghost3050",
        "url": "https://www.reddit.com/r/OnePiece/comments/11k09ya/told_chat_gpt_to_come_up_with_a_devil_fruit/",
        "text": "Name: Yume Yume no Mi (Dream-Dream Fruit)\n\nDescription: The Yume Yume no Mi is a Paramecia-type devil fruit that grants the user the ability to enter and manipulate the dreams of others. The user can create and control dreamscapes, and can even manipulate the dreams of multiple people at once.\n\nStrengths: The Yume Yume no Mi has the potential to be a powerful tool in both combat and espionage. By entering the dreams of their targets, the user can gather information, plant false memories, or even cause their targets to suffer from nightmares or pleasant dreams.\n\nAdditionally, the user can manipulate the dreamscapes they create, making them appear as anything from a beautiful landscape to a scary nightmare.\n\nWeaknesses: The main weakness of the Yume Yume no Mi is that the user must be within close proximity of their targets to enter their dreams. Additionally, the user's powers can only affect those who are asleep, meaning they are ineffective against those who are awake.\n\nMoreover, the user may be vulnerable to attacks while entering or manipulating the dreams of others, as they become unaware of their surroundings and lose their sense of the real world.\n\nOverall, the Yume Yume no Mi may not be the most powerful devil fruit in terms of physical strength, but it has the potential to be a powerful tool in espionage and manipulation. Additionally, its humorous and lighthearted nature could provide for some interesting and comedic situations in the One Piece world.",
        "created_utc": 1678112681,
        "upvote_ratio": 1.0
    },
    {
        "title": "I drew Nobara from JJK in One Piece style",
        "author": "StrawHxt",
        "url": "https://i.redd.it/kibmv4cx46ma1.jpg",
        "text": "",
        "created_utc": 1678112132,
        "upvote_ratio": 1.0
    },
    {
        "title": "Lyffy's mom",
        "author": "ivanandleah",
        "url": "https://i.redd.it/zk5180y4n4ma1.jpg",
        "text": "",
        "created_utc": 1678112075,
        "upvote_ratio": 1.0
    },
    {
        "title": "what 1-minute clip would you use to convince a busy manga-reader to watch the anime?",
        "author": "Switch-Familiar",
        "url": "https://www.reddit.com/r/OnePiece/comments/11k00sf/what_1minute_clip_would_you_use_to_convince_a/",
        "text": "For me it would be Sogeking",
        "created_utc": 1678112015,
        "upvote_ratio": 1.0
    },
    {
        "title": "Usopp left his child on Syrup Village island like his father left him - Theory",
        "author": "scar_01",
        "url": "https://www.reddit.com/r/OnePiece/comments/11jzymw/usopp_left_his_child_on_syrup_village_island_like/",
        "text": " We know that Oda likes to draw parallels in this story. Parallels between Usopp and Yasopp: \n\n\\- both lived in Syrup Village   ✓\n\n\\- both were in love with a girl who lived there   ✓\n\n\\- both joined a pirate crew that later became a yonko crew   ✓\n\n&amp;#x200B;\n\nSo it's basically confirmed. **Usopp has a child that he abandoned**, just like he was **abandoned by Yasopp.**",
        "created_utc": 1678111854,
        "upvote_ratio": 1.0
    },
    {
        "title": "oh man i sure hope this side character is not important later on... Nico Robin/Miss All Sunday as (shiny) Florges",
        "author": "SimonBSFCS",
        "url": "https://i.redd.it/eigfm0m426ma1.png",
        "text": "",
        "created_utc": 1678111190,
        "upvote_ratio": 1.0
    },
    {
        "title": "saru saru no mi model ᛏᚱᛟᛚᛚᛋ(trolls) It's an Illusory Zoan Devil Fruit. Gives the user a strong strength, but with the condition that in transformation, do not transform in the sunlight, because you will turn to stone (one piece concept )",
        "author": "one_piece_art",
        "url": "https://i.redd.it/l6zr4wv016ma1.png",
        "text": "",
        "created_utc": 1678110819,
        "upvote_ratio": 1.0
    },
    {
        "title": "zou-lite with local Joyboy",
        "author": "shuvo91",
        "url": "https://i.redd.it/ixsmpz6n06ma1.jpg",
        "text": "",
        "created_utc": 1678110691,
        "upvote_ratio": 1.0
    },
    {
        "title": "zou-Lite with local JoyBoy",
        "author": "shuvo91",
        "url": "https://i.redd.it/0h0in7wb06ma1.jpg",
        "text": "",
        "created_utc": 1678110586,
        "upvote_ratio": 1.0
    },
    {
        "title": "Where to start reading the manga.",
        "author": "logan_sullivan2022",
        "url": "https://www.reddit.com/r/OnePiece/comments/11jze5p/where_to_start_reading_the_manga/",
        "text": "Does anyone know where the knewest episode of the anime (1053) leave off in the manga?",
        "created_utc": 1678110415,
        "upvote_ratio": 1.0
    },
    {
        "title": "Theory - The New World is rehashing the Paradise arcs",
        "author": "silverysatisfaction",
        "url": "https://www.reddit.com/r/OnePiece/comments/11jzayi/theory_the_new_world_is_rehashing_the_paradise/",
        "text": "Not sure if this has been talked about before but I've been diving into rewatching the anime via reaction channels and I noted something that I thought was really cool and haven't seen mentioned.  \nThis might get a bit long.\n\n&amp;#x200B;\n\nI think all the arcs of the New World have been rehashes of the previous arcs, touching on very similar themes, ideas, story beats and structures. Let's have a look at them!   \n\n\n**Post-Fishman Island vs Reverse Mountain**  \n\\- Obvious firstly is Laboon's family having the same damage to them as Laboon did, trying to get back to Laboon.  \n\\- Not so obvious is pull off-track from the get-go. Paradise had the crew's choice picked by the decision to see Mr 9 and Miss Wednesday to their home safely. New World had the choice picked by the decision to respond to a cry for help.\n\n**Whiskey Peak/Little Garden/Drum Island vs Punk Hazard**  \n\\- this is the only case of more than one arc mixed together, I think, but Punk Hazard was two parts of an island so this kind of works.  \n\\- giants - the kids  \n\\- illness - the kids  \n\\- collecting new allies ala vivi and karue vs law, momo and kinemon  \n\\- meeting enemies that are part of an organisation set up to be dealt with later - mr 3, ms all sunday vs buffalo, baby 5 - as well as ones dealt with during that arc - mr 5, ms valentine vs vergo and monet.  \n\\- island extremes (winter/fire, jungle/winter/cacti of doom).  \n\\- set up of a future villain (croc vs doffy) and the interaction there-of via phone by an ally (sanji vs law)  \n\\- dinosaurs vs dragon  \n\\- luffy having to stick to a plan (save nami vs capture ceasar)  \n\\- island destroyed before the arrival of the crew (akainu/aokiji fight vs blackbeard/drum island)  \n\\- witch in a snow place (heh, it's a stretch but hey, monet is literally snow vs kureha and both are presented as mother figures to children in their respective arcs, though one is fake)  \n\\- marines listening in  on conversations (smoker overhearing the distress call vs smoker overhearing the call between croc and sanji)  \n\\- marines in general. just cos\n\n**Alabasta vs Dressrosa**  \n\\- oh boy. vivi vs law - traumatised and facing their tormentors  \n\\- marines that aren't helping but are actually helping  \n\\- control over a country  \n\\- princess needing help in saving her loved ones  \n\\- princess putting her own self on the line and being determined to shoulder everything herself  \n\\- organisation of evil  \n\\- BROTHER!!!  \n\\- Fire brother!!!  \n\\- country people being led around like puppets  \n\\- manipulation on a mass scale by assholes  \n\\- defamation of king and soldiers  \n\\- marine clean-up after the fact  \n\\- rebel army (tontatta vs actual rebel army)  \n\\- good father figures (cobra vs kyros)  \n\n\n**Skypeia vs Zou**  \n\\- lore drops galore drops  \n\\- roger  \n\\- ponyglyph  \n\\- old history destroyed by assholes  \n\\- jack vs enel - users of unfair tactics - gas vs 'the game'  \n\\- the search for something/one - the bell vs raizo  \n\\- high up unique islands  \n\\- revelations about SO MANY THINGS  \n\\- JOY BOY  \n\\- restricted forest  \n\\- fall back down after a perilous journey up  \n\n\n**Water 7/Enies Lobby vs Whole Cake Island**  \n\\- where to begin. Saving a crewmate who decided to leave 'for the better'  \n\\- past trauma of children  \n\\- family - good vs bad - tom's workers/franky family vs capone family/some of big-moms' crew VS oh boy do we gotta point out the bad families here? Okay, for P - galley-la (a family unit with betrayers in the mix), CP0 (what a disfunction) vs big fucking mum's family, vinsmokes  \n\\- destruction on a massive scale by one's own forces (rip enies lobby vs big mom go gaga)  \n\\- bad leadership (spandam vs big mom)  \n\\- last minute save (merry vs jinbe)  \n\\- luffy fighting a foe at his own level that pushes him harder   \n\\- sacrifice plays (pedro vs robin vs galley la, sodom and gamorrah, etc)  \n\\- GIANT! lady, but still. and people in general.  \n\\- enemy backstory (big mom vs lucci)   \n\\- persistent annoyance (big mom/licky licky vs fucking spandam)  \n\\- abusive captors (judge and sons vs spandam)  \n\n\n**Thriller Bark vs Wano**  \n\\- now i know what you're thinking but no. no this does fit. I promise  \n\\- dessicated landscape  \n\\- broken souls  \n\\- multi-stage battle   \n\\- luffy major powerup (with form change!)  \n\\- after battle special host of destruction (Kuma vs greenboi)  \n\\- vivre card giving  \n\\- Oars jr connection via ace hat making  \n\\- zoro +1 sword  \n\\- samurai (I'm counting it)  \n\\- stealing everything from the people trapped inside  \n\\- being locked in (wano vs ship that eats ships)  \n\\- weather control (florian triangle vs kaido dragon weather control)  \n\\- starts with food on the ocean (finding the gifts to the gods, luffy destroying the food)  \n\\- sacrifices that stand with the crew (lola and her people in the sunlight, trusting luffy to beat moria vs samurai trusting luffy to beat kaido and putting it all on the line)  \n\\- pervy bath scene :/  \n\\- SANJI BEING A PERV :///  \n\\- brook vs the akazaya - having to wait all those years in order to get revenge, being patient but trapped   \n\\- freedom of many trapped souls  \n\\- interrupted celebration  \n\\- giant skull island vs giant skull oars  \n\\- theme set on a very specific genre - halloween vs edo japan and the 3 part acts  \n\\- weird beasts created by artificial means (beast pirates w/smiles, zombies w/hodgeback and moria)  \n\\- science is bad  \n\\- science is good  \n\\- chopper fight about medicine good vs bad  \n\\- robin power up (wings vs demon form)  \n\\- two big bosses (oars and moria vs kaido and big mom), one of which has memory issues that are resolved later  \n\n\n**SPOILER FOR CURRENT ARC**  \n\n\n**Saobody vs Egghead**  \n\\- do i really need to spell all of this out though? because it's VERY apparent. okay then  \n\\- a lot of new people who could be allies or enemies  \n\\- find the mermaid 2.0 - now with more mad scientist missing  \n\\- split into areas in search of mermaid  \n\\- kuma. just... kuma  \n\\- oh hi bonney  \n\\- outlandish and yet fucking cool setting  \n\\- it's like a theme park!  \n\\- marines say hello  \n\\- new pacificsta enemies   \n\\- fucking light admiral incoming  \n\n\n  \n Obviously there's a lot more mirrors for each arc that could be mentioned but these are all off the top of my head. If you have others, feel free to share!  \n\n\nI really like this idea that they're going around in a full circle of their journey through paradise. yes, there are parts that aren't exact match and there's a bit of blend here and there, but as a whole I think it's ingenious that the same story structure and ideas are being used in new and interesting ways that feel organic and original despite the many call-backs that we see.  \n\n\nwhat do you guys think?",
        "created_utc": 1678110183,
        "upvote_ratio": 1.0
    },
    {
        "title": "Some Fun Remarks on Nami",
        "author": "gamria",
        "url": "https://www.reddit.com/r/OnePiece/comments/11jz8vm/some_fun_remarks_on_nami/",
        "text": "As a One Piece fan for a long long time now, I'm in the mood to mull over certain amusements I have with Nami.\n\n1. So despite how much she despised pirates at the start of the series, I've always found it humourously ironic that she was and still is arguably the most pirate-like member of the crew. She loves money and treasure, she's a master thief, she prefers trickery and dirty play, and with 8 years of solo sailing prior to meeting Luffy she is among the crewmembers with the most seafaring experience.\n2. This lady merely wants to travel around the planet and create a complete world map on a leisure cruise. But no, she winds up facing off against criminal organisations, government assassins, candy-themed pirates, hairy bugs, zombies and ghosts, dinosaurs, ruffians who can turn into dinosaurs, etc. Her personal dream doesn't necessarily require her to be strong, and yet she has to confront all these outsized threats again and again; she has so much \"I didn't ask for this!\" energy that it's positively absurd.\n3. For all her (justified) frustrations with Luffy, the further into the voyage, the stronger the vibe that Luffy really is her pillar of support. Throughout the story, she has braved the harsh seas of the Grand Line, contended with difficult decisions and held fast against towering enemies that a comparably normal girl like her has no business getting involved with - because she has a Captain and a crew she can count on when the going gets tough. (This vibe came off strong in the Whole Cake Island arc)  \nWhether you want to be romantic or platonic about it, I find it fascinating that it's because Luffy liberated Nami that her potential gets actualised, from a mere burglar to a globe-trekking navigator; and with him, she can even sail to the ends of the world.\n\nThat's all I wanted to say, felt like pouring these thoughts out of my head.",
        "created_utc": 1678110033,
        "upvote_ratio": 1.0
    },
    {
        "title": "Happy Monday! Nico Robin from Zou ʕ•ᴥ•ʔ",
        "author": "Optimus9793",
        "url": "https://i.redd.it/8xri19wly5ma1.jpg",
        "text": "",
        "created_utc": 1678110002,
        "upvote_ratio": 1.0
    },
    {
        "title": "What if: Law has already performed eternal surgery on Luffy?",
        "author": "silentassassin20",
        "url": "https://www.reddit.com/r/OnePiece/comments/11jz6kj/what_if_law_has_already_performed_eternal_surgery/",
        "text": "Just think about it! Law operated on Luffy after Marineford. That is when he could have give Luffy eternal life.\n\nThat is the reason why his heart starts up again with Gear 5 against Kaido! \n\nThoughts?",
        "created_utc": 1678109867,
        "upvote_ratio": 1.0
    },
    {
        "title": "For Sale Big Mom. Size US 10. Nike Air Force 1.",
        "author": "batch_NFrame",
        "url": "https://www.reddit.com/r/OnePiece/comments/11jyz3j/for_sale_big_mom_size_us_10_nike_air_force_1/",
        "text": "&amp;#x200B;\n\nhttps://preview.redd.it/hohssfgze4ma1.jpg?width=1536&amp;format=pjpg&amp;auto=webp&amp;v=enabled&amp;s=d75b053edcc238f3f52887c83b8e54d037a14b1a\n\nhttps://preview.redd.it/msekchgze4ma1.jpg?width=2048&amp;format=pjpg&amp;auto=webp&amp;v=enabled&amp;s=9b47953c16bd0a1bcddf54d4dd7b04553bb11c1a\n\nhttps://preview.redd.it/timjhjgze4ma1.jpg?width=2048&amp;format=pjpg&amp;auto=webp&amp;v=enabled&amp;s=4b8042b17afae4a78360038c6f3a0c9c0ac9ddbf\n\nhttps://preview.redd.it/p8ydalgze4ma1.jpg?width=2048&amp;format=pjpg&amp;auto=webp&amp;v=enabled&amp;s=1c25d455fd40e81f2dcffb172c98390d881aaaaf",
        "created_utc": 1678109342,
        "upvote_ratio": 1.0
    },
    {
        "title": "So far I’m enjoying One Piece",
        "author": "HiiiBye11",
        "url": "https://www.reddit.com/r/OnePiece/comments/11jyxk0/so_far_im_enjoying_one_piece/",
        "text": "Right now I’m at the Jaya Arc which will lead to the Skypiea arc. I don’t understand how some people say that they only enjoyed One Piece after 200 eps or so. Or that it really only starts around there. I’m not even to the big stuff yet and it’s already my top 3 anime. The characters, the world building, the mysteries, especially the comedy, which I appreciate and enjoy the most, made this one of my absolute fav anime of all time. I enjoy every second of this, even the fillers. \n\nThe arabasta arc was a 10000/10 \nFelt a little similar to chimera ant arc, maybe it’s just me tho. \n\nI absolutely love Luffy. Not a only is he my fav character in one piece , but he’s also up there with my other fav characters from different animes. I find myself relating to him alot in some of his characteristics. \n\nThe bounty reveal always gets me excited. Seeing other reactions to them. I wonder what the average pirate thinks about Luffy now being 100m. \"What this guy? This has to be fake, look at him!\" 😂\n\nSo far this is my top 4: \n\nLuffy \n\nSanji - his character is awesome and the simping moments are just pure comedy ) \n\nZoro - Not much to say. I think you know why. I also love his loyalty towards Luffy. \n\nUsopp - I didn’t think I’d put him here. He grows to me overtime. I think he’s going to be an even more amazing character later on.",
        "created_utc": 1678109231,
        "upvote_ratio": 1.0
    },
    {
        "title": "For Sale Customized Nike Air Force 1 #Kaido",
        "author": "batch_NFrame",
        "url": "https://www.reddit.com/r/OnePiece/comments/11jyx69/for_sale_customized_nike_air_force_1_kaido/",
        "text": "&amp;#x200B;\n\nhttps://preview.redd.it/4a3f03ahe4ma1.jpg?width=4032&amp;format=pjpg&amp;auto=webp&amp;v=enabled&amp;s=99619b592b6b3224a85f6914f548531214241d85\n\nhttps://preview.redd.it/7bd2bu9he4ma1.jpg?width=4032&amp;format=pjpg&amp;auto=webp&amp;v=enabled&amp;s=35610f545eb3e2dae8c9b7e3f6cf7647026d32a3\n\nhttps://preview.redd.it/l8rtp3ahe4ma1.jpg?width=4032&amp;format=pjpg&amp;auto=webp&amp;v=enabled&amp;s=b571892557de1bf7f3692574b5e0c8f0c09c73a7\n\nhttps://preview.redd.it/eh4fp3ahe4ma1.jpg?width=4032&amp;format=pjpg&amp;auto=webp&amp;v=enabled&amp;s=0c17e24136aa72e0d813924105b4390455dcae90\n\nhttps://preview.redd.it/q4hpmv9he4ma1.jpg?width=4032&amp;format=pjpg&amp;auto=webp&amp;v=enabled&amp;s=44d0904f212385057d5de07e0dfae81a5a92e70c\n\nhttps://preview.redd.it/4cn560ahe4ma1.jpg?width=4032&amp;format=pjpg&amp;auto=webp&amp;v=enabled&amp;s=c211c6b366d85da4d4f79307533c9cb47a531c88\n\n*Processing img codhw3ahe4ma1...*\n\n*Processing img d72gw0ahe4ma1...*\n\nhttps://preview.redd.it/xp3bq6ahe4ma1.jpg?width=4032&amp;format=pjpg&amp;auto=webp&amp;v=enabled&amp;s=10c63031b25d23c0e93d0c55872f53233ba6dccc\n\nhttps://preview.redd.it/snjuz8ahe4ma1.jpg?width=4032&amp;format=pjpg&amp;auto=webp&amp;v=enabled&amp;s=51ac732ac16fa65ddd001f041d77565ec52edd79",
        "created_utc": 1678109205,
        "upvote_ratio": 1.0
    },
    {
        "title": "Red Roc Luffy Drawing by me🙂",
        "author": "SsjB_Gokahn",
        "url": "https://i.redd.it/kyctgxnjv5ma1.jpg",
        "text": "",
        "created_utc": 1678108972,
        "upvote_ratio": 1.0
    },
    {
        "title": "Golden Apples in the Ancient Kingdom",
        "author": "Xyaibai",
        "url": "https://www.reddit.com/r/OnePiece/comments/11jytbe/golden_apples_in_the_ancient_kingdom/",
        "text": "So I was rewatching the Alabasta arc.\n\nRemember the joke about the golden apples being sold in Alabasta for 1000 berries. The seller lied about it being found in an Ancient Kingdom. BUT what if there really were golden apples in the Ancient Kingdom and Oda had been shoving it in our face this whole time.",
        "created_utc": 1678108930,
        "upvote_ratio": 1.0
    },
    {
        "title": "Even Mario knows peak fiction when he sees one",
        "author": "garlicroastchicken22",
        "url": "https://i.redd.it/fz0otc05b4ma1.png",
        "text": "",
        "created_utc": 1678108107,
        "upvote_ratio": 1.0
    },
    {
        "title": "from bink sake translated lyrics",
        "author": "Jynub",
        "url": "https://i.redd.it/uepz2tgy84ma1.png",
        "text": "",
        "created_utc": 1678107336,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why Kidd seems so confident",
        "author": "WangDongChang",
        "url": "https://www.reddit.com/r/OnePiece/comments/11jxqyh/why_kidd_seems_so_confident/",
        "text": "Spoilers for anime-only.\n\nKaido himself mentioned that Kidd's technique was not bad but simply needed more mass. It sounds like Kaido is saying that with more metal, Kidd could have posed a threat.\n\nCurrently, Kidd is heading to the island of giants, and I'm wondering why Kidd seems confident that he will be able to challenge Shanks again. On an island of giants, wouldn't the weapons, construction tools, mines, chunks of Ore, etc all be much larger?\n\nIf Kidd simply needs more mass to be able to challenge a Yonko and use larger-scale techniques, then it seems like he's going to the right place to do that, and that he's aware of that fact.",
        "created_utc": 1678106229,
        "upvote_ratio": 1.0
    },
    {
        "title": "My one piece drawing",
        "author": "Jaded-Aerie-8730",
        "url": "https://i.redd.it/mf6d82k7k5ma1.jpg",
        "text": "",
        "created_utc": 1678105161,
        "upvote_ratio": 1.0
    },
    {
        "title": "A small little unimportant rant",
        "author": "GoldGolemGaming37",
        "url": "https://www.reddit.com/r/OnePiece/comments/11jx9yb/a_small_little_unimportant_rant/",
        "text": "So I have seen a lot of posts on social media (mainly tiktok) about people listing Doflamingo’s crimes, and while they’re correct, every single one always forgets Rubeck Island. They mention attempted genocide, but did people forget about the Island in the North Blue that Dofi used the cage on, and the only survivor of the whole Island was X Drake? Just a little thing I wanted to mention",
        "created_utc": 1678104969,
        "upvote_ratio": 1.0
    },
    {
        "title": "Did Luffy vs Doflamingo in the old art style. Did both versions of his outfit. What other scenes should I do?",
        "author": "One_Piece_Archives",
        "url": "https://www.reddit.com/gallery/11jwod3",
        "text": "",
        "created_utc": 1678103279,
        "upvote_ratio": 1.0
    },
    {
        "title": "What prevents people from going to Laughtale directly?",
        "author": "Taladris",
        "url": "https://www.reddit.com/r/OnePiece/comments/11jwj87/what_prevents_people_from_going_to_laughtale/",
        "text": "Laughtale is at the end of the Grand Line, and reaching it is terribly dangerous due to the crazy weather, strange islands, sea beasts, and powerful pirates that lie on the way. \n\nBut... what prevents people to go directly to Laughtale by sailing from the Reverse Mountain (in opposite direction to Whiskey Peak)? Or by flying? Or using any means to cross the Calm Belt from West Blue or North Blue? Why are Poneglyphs even needed?\n\nWas it **explicitly** said in-universe why it is not possible? Has someone ever tried? Of course, for Luffy, the adventures and the competition with other pirates are worth as much as the One Piece itself, but other pirates may only care about getting the big prize by any means. \n\nThis is probably part of the mystery of what Laughtale really is, but it has been bugging me for some time and I want to check whether I missed something.",
        "created_utc": 1678102852,
        "upvote_ratio": 1.0
    },
    {
        "title": "When will film red come out on Netflix?",
        "author": "ConorZ734",
        "url": "https://www.reddit.com/r/OnePiece/comments/11jwhai/when_will_film_red_come_out_on_netflix/",
        "text": "I’m sorry if this has been asked before, but I can’t find a date for Film red to come out on Netflix. Has it been said before or are we just waiting for a date?",
        "created_utc": 1678102691,
        "upvote_ratio": 1.0
    },
    {
        "title": "Magellans resume looking pretty good \"Defeated 3 of the current 4 Emperors\"",
        "author": "Negative_Ad8513",
        "url": "https://i.redd.it/l2asmq8zs3ma1.jpg",
        "text": "",
        "created_utc": 1678101966,
        "upvote_ratio": 1.0
    },
    {
        "title": "Will kong ever be relevant",
        "author": "Realistic_Singer246",
        "url": "https://www.reddit.com/r/OnePiece/comments/11jw177/will_kong_ever_be_relevant/",
        "text": "[removed]",
        "created_utc": 1678101335,
        "upvote_ratio": 1.0
    },
    {
        "title": "Manga Crocodile's potential power",
        "author": "West_Conclusion_1239",
        "url": "https://www.reddit.com/r/OnePiece/comments/11jvuu4/manga_crocodiles_potential_power/",
        "text": "To the people downplaying Crocodile only because he was defeated so early in the Pre-Timeskip by a Luffy without Haki and even without Gears, i'm telling you Oda couldn't care less about any of this.\n\nHe's not driven by the minutiae of dumb powerscaling, but by the narrative, by what makes sense in the story right now.\n\nAt that point of the story Crocodile had to fall down, because Luffy had to begin to be perceived as another threat in the Grand Line by the World Government; because it had to be the beginning of the dismantling of the system of the Warlords, Aokiji feeling indebted to Luffy for suppressing Crocodile in place of the Navy, and thus another reason to spare him at Long Ring Long Island, and so many other reasons.\n\nThat all said, the Crocodile of today is a completely different beast, Oda could portray as someone who can clash with fighters like Aokiji, Kizaru, Fujitora, Ryokugyu and be perceived as a threat not to be fucked with by these people, maybe even Emperors (If Kid and Law can clash with Emperors now, why Crocodile couldn't?)\n\nOda clearly puts him as an equal to Mihawk, he architects with him the foundation of the Cross Guild, and opposes with it the World Government.\n\nDon't underestimate him, i wouldn't be surprised if he learned or mastered Observation Haki and Armament Haki, he may even have Conqueror's Haki now.\n\nCan you imagine if he can use sand coated with Armament Haki??\n\nOr if he awakened the Sand Fruit?\nWe still don't know what a Logia Awakening is like, and how it differentiates itself from the Paramecia awakening, but it could affect the environment, eroding and drying everything surrounding him or creating tsunami of sand.\n\nThe potential is limitless, he could be now an Emperor level threat like Mihawk, Kidd, and Law.\n\nThoughts?",
        "created_utc": 1678100802,
        "upvote_ratio": 1.0
    },
    {
        "title": "What if Luffy is from the Void Century",
        "author": "Powerful-Routine-292",
        "url": "https://www.reddit.com/r/OnePiece/comments/11jvltb/what_if_luffy_is_from_the_void_century/",
        "text": "So I have been thinking about how everyone that has knowledge of void century(whatever the little they know of) says that joyboy/king will come and when Roger leaving Fish man island sea-kings speak about how they are happy that the kings are going to come together and after Roger left laugh tale he says he’s too early in the sense they know when the Joy-boy is going to appear not exact date n time but they have knowledge of the time period that joy boy(not the one in void century but Luffy) is going to emerge \n\n\nSo I came to a conclusion that Luffy is Son of Joy boy and he’s been sent into future of 800yrs ahead, Toki might have sent him 800 yrs into future by mistake not knowing exactly how to use her powers and she’s been travelling into future for the time he opens borders of Wano but she stops at Odens time that’s the reason she asks oden to take her to wano thinking she can nurture luffy into becoming a king but she realises she’s early and Luffy is nowhere to be found and also she says she’s from wano but when she sent kin and momo to future they were spawned in Wano itself but she wasn’t in wano when she came from void century so she didn’t know how to use her powers properly at the time she sent Luffy into future and the people in Void century prepared poneglyphs in order to guide him and tell him the true history so he can overtake the world government maybe thats the reason why the world government doesn’t want anyone to find out the true history",
        "created_utc": 1678100049,
        "upvote_ratio": 1.0
    },
    {
        "title": "Blur's Token's Released. 03.05.2023",
        "author": "Skviz",
        "url": "https://www.reddit.com/r/OnePiece/comments/11jvj1a/blurs_tokens_released_03052023/",
        "text": "Blur released season 3. Unlock the secrets behind Blur's season 3 and the cutting-edge technology driving its success. Head to their official website for an exclusive look at the innovative advancements. 03.05.2023 https://twitter.com/charmainedelima/status/1632518712770084864",
        "created_utc": 1678099798,
        "upvote_ratio": 1.0
    },
    {
        "title": "Question about aokiji",
        "author": "mazipa221",
        "url": "https://www.reddit.com/r/OnePiece/comments/11jvg0o/question_about_aokiji/",
        "text": "I just finished EP 227 and I have a question, when Aokiji came to look for Robin and Luffy he said that he was not there to arrest them, can he even do that? Is he not under an obligation to arrest people who are wanted by the WG/marines? \n\nI know that he ended up taking robin but that was not his intention when he went there\n\nAlso how did he even find them on this random island, it was not where the Davey back games were held so its not like they fought there",
        "created_utc": 1678099524,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why doesn’t anybody really talk about pre-time skip",
        "author": "ImMikkiThe_Gurl",
        "url": "https://www.reddit.com/r/OnePiece/comments/11jvckf/why_doesnt_anybody_really_talk_about_pretime_skip/",
        "text": "I’m up to the end of enies lobby and after following some one piece stuff on different media especially memes, nobody seems to really talk about pre time skip. Does one piece just get tremendously better after the war and that’s why nobody talks about it? Idk lemme know what you think",
        "created_utc": 1678099212,
        "upvote_ratio": 1.0
    },
    {
        "title": "Luffy and Shanks Relationship 1076+",
        "author": "Akshatsfuel",
        "url": "https://www.reddit.com/r/OnePiece/comments/11jvbhw/luffy_and_shanks_relationship_1076/",
        "text": "Luffy and Shanks's relationship has been in question since 1076. Most people think that their relationship is not special. But I think that is not true. When Uta was with Shanks crew I think Shanks saw Luffy's similarities to Roger and heard their shared dream. When he learned that Luffy is a part of the D. clan he knew he was Roger's heir and Joy Boy. He left the Gomu-Gomu no mi or actually Hito-Hito no mi Model Nika where Luffy could eat it. He also gave up his arm to make Luffy more attached to him. He also gave him the Straw Hat which we will find is significant due to the giant Straw Hat in Mary Geoise\n\nPlease Give ideas to improve this Theory",
        "created_utc": 1678099119,
        "upvote_ratio": 1.0
    },
    {
        "title": "Who would win in this multiverse shattering battle?",
        "author": "Bruhlytical",
        "url": "https://www.reddit.com/r/OnePiece/comments/11jv5g5/who_would_win_in_this_multiverse_shattering_battle/",
        "text": "&amp;#x200B;\n\n[Captain Buggy D. Clown](https://preview.redd.it/gpvi896ai3ma1.png?width=402&amp;format=png&amp;auto=webp&amp;v=enabled&amp;s=e2ac434294060bb850d38d6b9ffde3a1761b47a9)\n\nVS\n\n&amp;#x200B;\n\n[God D. Usopp](https://preview.redd.it/w8oq1k9wi3ma1.png?width=304&amp;format=png&amp;auto=webp&amp;v=enabled&amp;s=6012d79e23f5b6a1e9f77ebd4f45c634d667a0f3)\n\nVS\n\n[Nokia D. Phone](https://preview.redd.it/lckw2sb2j3ma1.png?width=3500&amp;format=png&amp;auto=webp&amp;v=enabled&amp;s=19210e85c889bfe3f7c748c2709d41241022c97b)",
        "created_utc": 1678098595,
        "upvote_ratio": 1.0
    },
    {
        "title": "Shanks Crew is weak? (Theory)",
        "author": "Kinsir",
        "url": "https://www.reddit.com/r/OnePiece/comments/11jus0a/shanks_crew_is_weak_theory/",
        "text": "Fact is, we have never seen the Red Hair Pirates in action, besides a few moves from Shanks.\nSo what if, they are all not as fairly strong as everybody thinks?\nAnd they are just protected, by their big names and Shanks.\n\nJust imagine how funny (and disappointing) it could be, if only Shanks carries the whole crew, and the rest is like \"King\" from One Punch man.\nEverybody fears them, like Kizaru back at Marineford.\n\nIs it possible?\nGuess not, but it could be hell of funny and wholesome to see Shanks protecting them, cause he never could ditch his friends even though they are not as steong as he is.",
        "created_utc": 1678097377,
        "upvote_ratio": 1.0
    },
    {
        "title": "Please tell me One Piece manga gets good.",
        "author": "4typical",
        "url": "https://www.reddit.com/r/OnePiece/comments/11juncg/please_tell_me_one_piece_manga_gets_good/",
        "text": "I am at middle of Alabasta saga when Luffy is at that Island where the 2 giants are fighting. So far I have found rhe story okay-ish. Some parts were good most were not. The pacing feels very slow and the plot twists are predictable and unsurprising so far. \n\nAlso the forced comedy during serious moments and fights just ruins the mood. Someone please tell me that One piece gets good later or is it like this only throughout the entire series?",
        "created_utc": 1678096965,
        "upvote_ratio": 1.0
    },
    {
        "title": "which is best trio in the battle",
        "author": "Luffy-no-kaikozu",
        "url": "https://i.redd.it/oztcvdzqu4ma1.jpg",
        "text": "",
        "created_utc": 1678096604,
        "upvote_ratio": 1.0
    }
]