[
    {
        "title": "S-Croc Devil Fruit Theory",
        "author": "jamtsai",
        "url": "https://www.reddit.com/r/OnePiece/comments/11h2dyb/scroc_devil_fruit_theory/",
        "text": "Most people think S-Croc won't have the suna suna no mi powers (sand-sand fruit) because Vegapunk was unable to replicate logia powers. They believe (s)he will get a paramecia power like the Ishi Ishi no Mi (stone-stone fruit). Actually, S-Croc will have sand powers like the original Crocodile, it's just that Vegapunk will create a Hito Hito Fruit, Model: Seraphim Crocodile and then feed it to sand, like how Smiley was created by feeding the Sala-Sala Fruit, Model: Axolotl to poison gas. As such, S-Croc will have powers similar to a sand logia. This theory opens up the possibility of Hito Hito Fruits modelled after specific people, for which I believe there was a Hito Hito Fruit, Model: Rocks D. Xebec that was eaten by Blackbeard and hence why there are multiple personalities inside him.",
        "created_utc": 1677854377,
        "upvote_ratio": 1.0
    },
    {
        "title": "[GER] verkaufe dieses displate in größe L bei interesse bitte melden!",
        "author": "Broxcode",
        "url": "https://i.redd.it/fzorzsv4ukla1.jpg",
        "text": "",
        "created_utc": 1677854254,
        "upvote_ratio": 1.0
    },
    {
        "title": "My luffy drawing!",
        "author": "ProtectionWise4226",
        "url": "https://i.redd.it/91v1b3txtkla1.jpg",
        "text": "",
        "created_utc": 1677854190,
        "upvote_ratio": 1.0
    },
    {
        "title": "Finally the new DUB is out 917-928",
        "author": "chrisnick17",
        "url": "https://i.redd.it/qztn84ixtkla1.jpg",
        "text": "",
        "created_utc": 1677854184,
        "upvote_ratio": 1.0
    },
    {
        "title": "One Piece Volume Purchase",
        "author": "ndstab",
        "url": "https://www.reddit.com/r/OnePiece/comments/11h29nj/one_piece_volume_purchase/",
        "text": "I was planning to get a physical One Piece volume. So which one should I get?  \nLooking for one with many great moments, art and other iconic stuff.  \nI was personally thinking of something like Vol. 1 or Vol. 100.\n\n  \nThank you for your recommendations.",
        "created_utc": 1677854060,
        "upvote_ratio": 1.0
    },
    {
        "title": "My Luffy drawing!",
        "author": "ProtectionWise4226",
        "url": "https://i.redd.it/seit1xz0tkla1.jpg",
        "text": "",
        "created_utc": 1677853885,
        "upvote_ratio": 1.0
    },
    {
        "title": "A Tale of two Fillers: The Silver Mine Arc &amp; Heart of Gold",
        "author": "MaximumSpidercide",
        "url": "https://www.reddit.com/r/OnePiece/comments/11h1zho/a_tale_of_two_fillers_the_silver_mine_arc_heart/",
        "text": "I've been catching up on One Piece and over the last couple of days finally watched the Silver Mine Arc and the Heart of Gold special, both which are tie-ins to One piece Film Gold (which i haven't seen yet).\n\nI should qualify that I have low expectations walking into any OP filler as 90% of it is mediocre-bad, with the G8 being an exception not just amongst OP but frankly most anime in general.\n\nEven so, the Silver Mine arc was *really* bad. Like, it honestly made me wonder if it was the worst filler the series has ever generated. The bad guy not only had a generic design, not only a DF that is a lame and derivative version of DF abilities we have already seen, but even his *name* was generic. Bill? Seriously!? This is not even getting into how his plan was literally just convincing people to collect bounties for him and then enslave anyone who didn't fall in line. Worst of all the character arc belonged to a supporting character to a supporting charcter, namely Bartolomeo's childhood friend who was bland as can be herself. It didn't help that the anime by this point had run Bartolomeo's hero worship of Luffy into the ground.\n\nSilver Mine made me look back at the Z Ambition filler arc and the Little East Blue arc pre-time skip and I came to the conclusion it is *impossible* to write decent filler arcs that are tie-ins with the movies. The nature of the movies means there will be a Big Bad Luffy has to fight and most probably they will have subordinates for Zoro, Sanji and *maybe* the other crewmembers too. Meaning whatever villain pops up in the filler tie-ins has to, *by design*, be less of a big deal than any of those charcters or else it defeats the purpose of doing a filler arc to promote the movie in the first place. This wouldnt necesarilly be a problem if the nature of the anime also didn't mean that the filler arc has to introduce and dispose of the filler villain and their scheme succintly and inevitably have Luffy be the focus and one who takes the bad guy down since he is the main character. As lame as Bill and his cronies were they might've been worth a damn if the protagonists of the Silver Mine arc were like Usopp and Bartolomeo, instead of Luffy who is obviously WAY too powerful for this glorified Akainu knock off.\n\nWith Silver Mine having left a bad taste in my mouth I then hesitantly stepped into Heart of Gold, groaning at the movie length run time it had. This special restored my faith in One Piece filler.\n\nWhilst not as good as the G8 arc, this special proved that filler and movie tie-ins CAN be good. The villains were colourful and had versatile enough abilities that were causing problems for the Strawhats, even Luffy. The special was a clever way to tell its own self-contained story that also tied in with the movie and set it up MUCH better than the Silver Mine arc did. We got dramatic moments rooted in Luffy's character and the theme of friendship at the heart of the series. The one off charcacters of Olga and her father had a surprising amount of charm and personality to them. The weaker Strawhats got a lot of shine where their unique skills could be used effectively and the a treasure hunt inside a giant fish was pure One Piece fantasy. \n\nAll of which makes the general low quality of the Silver Mine arc and filler arcs in general more puzzling. Why make a special when you could have simply partitioned the story an made THIS the filler arc? instead?",
        "created_utc": 1677853318,
        "upvote_ratio": 1.0
    },
    {
        "title": "Made a Phone Wallpaper of the Yonko",
        "author": "bisschenmikzn",
        "url": "https://i.redd.it/f2er12rarkla1.jpg",
        "text": "",
        "created_utc": 1677853306,
        "upvote_ratio": 1.0
    },
    {
        "title": "YonkoWallpaper",
        "author": "bisschenmikzn",
        "url": "https://i.redd.it/zyy118qvqkla1.jpg",
        "text": "",
        "created_utc": 1677853167,
        "upvote_ratio": 1.0
    },
    {
        "title": "One Piece Creator Asked AI To Write A New Manga Chapter",
        "author": "tryingmydarnest",
        "url": "https://kotaku.com/one-piece-eiichiro-oda-chatgpt-ai-chopper-manga-1850172765",
        "text": "",
        "created_utc": 1677852760,
        "upvote_ratio": 1.0
    },
    {
        "title": "can a logia user dodge armament haki",
        "author": "FirmNeighborhood9694",
        "url": "https://www.reddit.com/r/OnePiece/comments/11h1pgb/can_a_logia_user_dodge_armament_haki/",
        "text": "Like when whitebeard hit aokiji was he using armament haki?",
        "created_utc": 1677852591,
        "upvote_ratio": 1.0
    },
    {
        "title": "Nothing happened",
        "author": "Inside-Ad-5764",
        "url": "https://www.reddit.com/gallery/11h1b4y",
        "text": "",
        "created_utc": 1677851559,
        "upvote_ratio": 1.0
    },
    {
        "title": "This is thing is being made for a game and its one piece related does it resemble anything you guys have seen in the show if so what?",
        "author": "SaddandNeedHelp",
        "url": "https://i.redd.it/5e3mchqb4jla1.png",
        "text": "",
        "created_utc": 1677851550,
        "upvote_ratio": 1.0
    },
    {
        "title": "Theory: Bugy has the last road",
        "author": "Bramantino_King",
        "url": "https://www.reddit.com/r/OnePiece/comments/11h14fy/theory_bugy_has_the_last_road/",
        "text": "Follow me and don't just say, Shanks has it and it's in Elbaf, for once just follow these threads of thoughts.\n\nFirst of all, Shanks will have Kid's roads, meaning Wano and WCI, Teach will have Law's ones, Zou and Wano, Luffy has three, Zou, WCI and Wano.\n\nWhy I say Bugy has the last road.\n\nMy guess, and really I am just guessing, is that the last road is captain John's treasure.\n\nFirst of all the facts, John is a Rocks, he died between the Rocks pirates defeat and Hogback joining Moria's crew, meaning, regarding the time frame, John might have died after Roger's passing, meaning he could very well die even after the road was stolen from Fishman Island.\n\nWe know that Fishman Island was attacked by pirates at a certain moment.\n\nThen we also know that John's crew assassinated John because he didn't want to split the treasure, but how can a treasure be splitted if that treasure is an unreadable red rock? It is possible that John's crew believed that John stole Fishman Island's royal treasure and he didn't want to split it with them, while for John it could very well be that for him the road was the real treasure he pursued.\n\nRemember that John was a Rocks so it is possible he knows about some things regarding the void century, something we can't say about his crew.\n\nLuffy, retrieving John's map, and giving it to Buggy in fact gave to him one of the most important maps in the world, while submitting a road he could have found by himself, to Buggy.\n\nBuggy in possession of the last road also combines many things that work perfectly together, he is an emperor, he has to join sooner or later this last race for the one piece and the final war, he becomes one of the most important people in the world, if not the most important as he is the only one to have the last key for laugh tale, and he will be chased by everyone for it while, ofc, he wants none of it, apart from the treasure.",
        "created_utc": 1677851054,
        "upvote_ratio": 1.0
    },
    {
        "title": "Yamato fanart! Would be awesome if you check my twitter, i have more One piece draws :)",
        "author": "SoyElFrankosxD",
        "url": "https://i.redd.it/uv4sy84s1jla1.jpg",
        "text": "",
        "created_utc": 1677850858,
        "upvote_ratio": 1.0
    },
    {
        "title": "Sanji Awakens Germa Powers😲😲#onepiece #sanji #anime",
        "author": "Numerous_Ideal_5850",
        "url": "https://youtube.com/shorts/pcLvWi6R9lM?feature=share",
        "text": "",
        "created_utc": 1677850789,
        "upvote_ratio": 1.0
    },
    {
        "title": "[OC] My fanart of Robin",
        "author": "Ckxarts",
        "url": "https://i.redd.it/c2tzjwp5hkla1.jpg",
        "text": "",
        "created_utc": 1677849894,
        "upvote_ratio": 1.0
    },
    {
        "title": "Dragon and the Revolutionary Army right now (MANGA SPOILERS)",
        "author": "West_Conclusion_1239",
        "url": "https://www.reddit.com/r/OnePiece/comments/11h0n78/dragon_and_the_revolutionary_army_right_now_manga/",
        "text": "Dragon and the Revolutionary Army has various options and scenarios:\n\nA. Staying in the Kamabakka Queendom at Momoiro Island, doing nothing and chilling until the final Arc.\n\nB. Heading to Egghead, in the New World, to help Vegapunk and saving him from Saturn and Kizaru, since Vegapunk/Shaka told him he feels he's going to die.\nBut the journey is probably too long though, they wouldn't make it in time since Momoiro Island Is in Paradise, the first half of the Grand Line.\n\nC. Forging an alliance with the Cross Guild, and helping them hunting top tier marines \n\nD. Go to the Red Port or even Mariejois itself to rescue Kuma, if they find where he is.\n\nE. Heading to Hachinosu, Blackbeard's main base, since they catch word that Pudding got kidnapped, so they snatch her away from the Blackbeard Pirates.\nThey still need someone to read the Poneglyphs, and Robin is with the Strawhats now.\nAnd Dragon and the army meets Garp there.\n\nF. Heading to Elbaf, they accidentally interfere with the  battle between Shanks and Kidd, and get inside the island to learn more about the books of Ohara and to meet the Man with the Burn Scar, who is highly speculated at this point to be Saul.\nWe may even see Shanks and Dragon meeting.\n\nWhich scenario do you think will happen?\n\nDo you have any other ideas and scenarios outside the ones i listed??\n\nWrite it down below.",
        "created_utc": 1677849700,
        "upvote_ratio": 1.0
    },
    {
        "title": "THE KING OF EMERGENCY FOOD",
        "author": "GLIZZYGOBLER6942069",
        "url": "https://i.redd.it/7lj14nuiyila1.png",
        "text": "",
        "created_utc": 1677849579,
        "upvote_ratio": 1.0
    },
    {
        "title": "What exotic things celestial dragons eat",
        "author": "valonianfool",
        "url": "https://www.reddit.com/r/OnePiece/comments/11h0fte/what_exotic_things_celestial_dragons_eat/",
        "text": "[https://tvtropes.org/pmwiki/pmwiki.php/Main/ExoticEntree](https://tvtropes.org/pmwiki/pmwiki.php/Main/ExoticEntree) the \"Exotic entree\" trope is when evil people eat endangered or cute animals, or prepare dishes that require lots of suffering.\n\nWhat kind of exotic meats do you think the celestial dragons eat as a display of their wealth and power?",
        "created_utc": 1677849137,
        "upvote_ratio": 1.0
    },
    {
        "title": "One Piece arc tier list. Also if ur gonna question Skypiea’s placement just so y’all arc skippers know it is one of the most important arcs in the series and it is heavily underrated",
        "author": "Jootkingdom",
        "url": "https://i.redd.it/am0mmd8pekla1.jpg",
        "text": "",
        "created_utc": 1677849062,
        "upvote_ratio": 1.0
    },
    {
        "title": "One Piece: Chapter 1076 - Theories and Discussion",
        "author": "AutoModerator",
        "url": "https://www.reddit.com/r/OnePiece/comments/11h06qg/one_piece_chapter_1076_theories_and_discussion/",
        "text": "**Chapter 1076**\n\nPost all your theories and discussions for the current chapter in this thread.  We also have poll related to a question/event of the recent chapter!\n\nDoes Kid stand a chance?\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n[http://discord.gg/onepiece](http://discord.gg/onepiece) to discuss One Piece instantly with fellow nakama!\n\n[View Poll](https://www.reddit.com/poll/11h06qg)",
        "created_utc": 1677848448,
        "upvote_ratio": 1.0
    },
    {
        "title": "Presidents talking about One Piece",
        "author": "willys_zuppa",
        "url": "https://v.redd.it/tdu1vqya8kla1",
        "text": "",
        "created_utc": 1677846927,
        "upvote_ratio": 1.0
    },
    {
        "title": "What if Shanks...",
        "author": "Suspicious_Airline89",
        "url": "https://www.reddit.com/r/OnePiece/comments/11gzeb7/what_if_shanks/",
        "text": "And his crew/ fleet is full of devil fruits.\n\n\nWe know for sure that Shanks is not a df user and his crew probably doesn't have a df either. I can assume they prefer it that way or have a selection procedure of some sort.\n\n\nAlmost all the members in Shanks's crew have weapons \n\nShanks having gryffindor (his sword)\nBenn Beckman having his sawed off type gun\nLucky Roo having a pistol or so\nAnd Lastly Yassop being a sniper is bound to carry his weapon.\n\n\nAnyways, my theory suggests that just like that guy in Enies Lobby who kidnapped Robin, had the sword eat a zoan devil fruit that made it an Elephant; Shanks and his top crew has weapons with dfs as well.\n\n\nThis might be the reason Shanks is able to use haki to a greater extent by coordinating with his sword, Yassop being so accurate and (doesn't make much sense) Lucky Roo being superfast.\n\n\nOda shared the SBS showing If Zoro were to get a df, he'd get Kaido's and one of his swords might eat it. So it is definitely possible to see such thing happen in future (not talking about Zoro).\n\nAnyways it's a out of the line theory and would need a convincing premise, and the possibility of this happening are low as well.\n\nThank you for reading so far and sorry for wasting your time",
        "created_utc": 1677846147,
        "upvote_ratio": 1.0
    },
    {
        "title": "Luffy’s Dream",
        "author": "Upbeat_Cantaloupe932",
        "url": "https://www.reddit.com/r/OnePiece/comments/11gyzg7/luffys_dream/",
        "text": "Luffys dream, and also Rogers dream, are to have everyone in the world wear a strawhat. \n\nThink about it, it’s his ultimate treasure. And it’s the only one of its kind; a one piece.\n\nAnyways is break week over yet?",
        "created_utc": 1677844921,
        "upvote_ratio": 1.0
    },
    {
        "title": "Who do you think? I hope these buddies",
        "author": "Sam_owner",
        "url": "https://i.redd.it/ucekh8iiwjla1.png",
        "text": "",
        "created_utc": 1677842948,
        "upvote_ratio": 1.0
    },
    {
        "title": "roronoa pinzoro🤔",
        "author": "eorehY",
        "url": "https://i.redd.it/qt00cifwvjla1.png",
        "text": "",
        "created_utc": 1677842744,
        "upvote_ratio": 1.0
    },
    {
        "title": "Question about previous ruler of Zou",
        "author": "Hendari",
        "url": "https://www.reddit.com/r/OnePiece/comments/11gyaqx/question_about_previous_ruler_of_zou/",
        "text": "I remember seeing a character who was the previous ruler of zou, a sheep I believe. I've gone back through the manga but can't seem to find the scene. Does anyone know if we have any info about this character or am I just miss remembering.",
        "created_utc": 1677842734,
        "upvote_ratio": 1.0
    },
    {
        "title": "This Kuzan card is so cool!",
        "author": "GregJenningz",
        "url": "https://i.redd.it/l3pgf3ibujla1.jpg",
        "text": "",
        "created_utc": 1677842209,
        "upvote_ratio": 1.0
    },
    {
        "title": "Enough with the Break bs",
        "author": "JackOfSons",
        "url": "https://www.reddit.com/r/OnePiece/comments/11gxd18/enough_with_the_break_bs/",
        "text": "Yes its break weak. why can't people just speak their mind. its like a scape goat for people who aren't interested enough to have an opinion so they just say leave the classic toxic comment \"oh its break weak\" this is worse than the Sanji x Zoro Shenanigan's",
        "created_utc": 1677839353,
        "upvote_ratio": 1.0
    },
    {
        "title": "Shimotsuki name for Zoro is just like D clan for Luffy",
        "author": "Heydude1001",
        "url": "https://www.reddit.com/r/OnePiece/comments/11gxcpc/shimotsuki_name_for_zoro_is_just_like_d_clan_for/",
        "text": "Plenty of time others character mention that Luffy look alot like Gol D Roger while they both isnt related at all. Their relation is just that they might have the same ancester and inherited the will of D clan. Same goes with Shimotsuki, I think Oda intend to make it a mysteries like D clan but People ask him alot so he gave a overview idea of Shimotsuki. He intend to not reveal to zoro because is not relevant to his story. if you compare to how hyogoro say about Zoro and character like Reyleigh,Kureha, Ganfall, Crocus say about Ludfy. ,they all have the same qoute mention their Similarity.\n\nI assume we might see Zoro parent in the future but mostly in flashback as a an easter egg (timeline wise ,rock flashback or eastblue flashback might include them in the background character) , dont expect them to be a huge shot. Roronoa isnt a famous name. Or when Wano time to open border come, we will get to see more of Wano lore.Just like Fishman island where people still dont want to give Luffy blood or Wano people still in revenge cycle, These island story isnt finish anytime soon.\n\n( i actually interest more on how Denjiro might be Shimotsuki. Also their is plenty of time story got reveal in Sbs first. for example, Kozaburo escape from Wano is mention in sbs before appear in Wano, Law and Kid form their crew is in Sbs, 12 Great Weapon reveal,Shank crew dynamic etc. )",
        "created_utc": 1677839321,
        "upvote_ratio": 1.0
    },
    {
        "title": "Open Source Projekt for a OP Game",
        "author": "Ric997",
        "url": "https://www.reddit.com/r/OnePiece/comments/11gx5s8/open_source_projekt_for_a_op_game/",
        "text": "[removed]",
        "created_utc": 1677838576,
        "upvote_ratio": 1.0
    },
    {
        "title": "Portgas D Ace by me",
        "author": "_pink_vaporeon",
        "url": "https://i.redd.it/ppvsn476ijla1.jpg",
        "text": "",
        "created_utc": 1677838124,
        "upvote_ratio": 1.0
    },
    {
        "title": "Celestial Dragons and Dragon",
        "author": "West_Conclusion_1239",
        "url": "https://www.reddit.com/r/OnePiece/comments/11gwyc1/celestial_dragons_and_dragon/",
        "text": "Has anyone any theory about why the World Nobles call themselves \"Dragons\"??\n\nAnd why Garp would call his alleged son Dragon if he hates them so much.\n\nOr why Dragon himself wouldn't change his name to be known with another one??\n\nI don't know, i feel like there must be some big lore which will be revealed regarding this in the future.\n\nThoughts??",
        "created_utc": 1677837787,
        "upvote_ratio": 1.0
    },
    {
        "title": "Yeah Dressrosa = Alabasta",
        "author": "Brilliant_Knee_7542",
        "url": "https://i.redd.it/h6vqam1igjla1.jpg",
        "text": "",
        "created_utc": 1677837563,
        "upvote_ratio": 1.0
    },
    {
        "title": "who hold the copyright for the show ?",
        "author": "agent-818",
        "url": "https://www.reddit.com/r/OnePiece/comments/11gwusg/who_hold_the_copyright_for_the_show/",
        "text": "I want to report copyright violation to the onepiece rights holder, and how to contact them if  possible",
        "created_utc": 1677837436,
        "upvote_ratio": 1.0
    },
    {
        "title": "Okay so do you guys believe the theory that Akainu &amp; Fujitora are brothers?",
        "author": "Jootkingdom",
        "url": "https://www.reddit.com/r/OnePiece/comments/11gwuj7/okay_so_do_you_guys_believe_the_theory_that/",
        "text": "[removed]",
        "created_utc": 1677837404,
        "upvote_ratio": 1.0
    },
    {
        "title": "Never underestimate Akainu",
        "author": "mfj__",
        "url": "https://www.reddit.com/r/OnePiece/comments/11gwj0n/never_underestimate_akainu/",
        "text": "Because he always has an Ace up his sleeve.",
        "created_utc": 1677836080,
        "upvote_ratio": 1.0
    },
    {
        "title": "Davey Back",
        "author": "SKFury_1771",
        "url": "https://www.reddit.com/r/OnePiece/comments/11gwh7u/davey_back/",
        "text": "So I’m rewatching One Piece for the first time in years and I remembered hating the Davey Back Fight arc, but one scene made it enjoyable in the dubbed. When Nami steals the refs cards and whistle. The way Robin delivers her line calling Nami a “naughty girl” as Nami smirks saying old habits die hard. It just makes everything about it seem dirty and I loved it.",
        "created_utc": 1677835878,
        "upvote_ratio": 1.0
    },
    {
        "title": "What do you think?",
        "author": "burii_",
        "url": "https://i.redd.it/32gfrepx6jla1.jpg",
        "text": "",
        "created_utc": 1677834345,
        "upvote_ratio": 1.0
    },
    {
        "title": "Parody of Luffy, Floofy! $10 sketch commission of Floofy from Alex Ahad, the lead character designer for Skullgirls!",
        "author": "Pineapple_Fernando",
        "url": "https://www.reddit.com/r/OnePiece/comments/11gw00a/parody_of_luffy_floofy_10_sketch_commission_of/",
        "text": "I really want to show people a $10 sketch commission I was able to pay for by Alex Ahad, the lead character designer for Skullgirls!\n\n[@o\\_\\_\\_8](https://mobile.twitter.com/o___8)\n\nThis was back at Anime Expo 2022. He was a really cool guy! Not only is she’s a parody/homage in Craig of the Creek to Luffy from One Piece, named Floofy, but also to Nadia and Future Boy Conan!\n\n[I picked Floofy for the $10 sketch commission because she reminded me so much of a Skullgirls character!](https://preview.redd.it/tan2xwv1ohla1.jpg?width=594&amp;format=pjpg&amp;auto=webp&amp;v=enabled&amp;s=a8c07f23810eb34600e8c84ef07b7ec7c92c914a)",
        "created_utc": 1677834018,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is Advanced conquerors haki able to one shot someone without it?",
        "author": "Aggressive_Log6774",
        "url": "https://www.reddit.com/r/OnePiece/comments/11gvly9/is_advanced_conquerors_haki_able_to_one_shot/",
        "text": "I was curious about this because I know if someone has conquers haki while the other doesn’t that person is able to be hit with it. If luffy were to use acoc on an attack and hit someone without coc at all, would it just knock them out immediately?",
        "created_utc": 1677832493,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why are anime deviations considered “not-canon?”",
        "author": "Pakomojo",
        "url": "https://www.reddit.com/r/OnePiece/comments/11gvkfv/why_are_anime_deviations_considered_notcanon/",
        "text": "So I’ve been watching One Piece, and some arcs I wanted to gain some deeper insight on, but looking up discussions showed that some people were writing it off as “who cares, it’s filler, not canon.”\n\nAnd looking further into it, I saw that it was common consensus to not view anything specifically included in the manga as “canon” to the anime.\n\nI’m a bit confused as to why.\n\nLike, some of the “non-canon” stuff like the G-8 arc is thought by most to be really good, so why is it being written off?\n\nDoes the fanbase just want a “perfect” adaptation from manga to anime? Were there disagreements between the manga and anime creators? What’s the context behind this?\n\nIs it just a cultural thing? Like, I’m USED to adaptations taking certain creative liberties in the story to make it more unique.\n(I don’t see any fans of the Walking Dead tv-series calling episodes with Daryl in it “not canon” even though Daryl isn’t in the comics, to give an example.)\nI would assume the manga and anime to be their own “separate canons” where anime-only arcs are canon to the official anime.\n(It’s not like the anime is “fanfiction” I would assume.)",
        "created_utc": 1677832322,
        "upvote_ratio": 1.0
    },
    {
        "title": "my yamato cosplay… or should i say oden",
        "author": "nicorobinsgf",
        "url": "https://i.redd.it/sz0hqf3xyila1.jpg",
        "text": "",
        "created_utc": 1677831649,
        "upvote_ratio": 1.0
    },
    {
        "title": "NEW One Piece Bounty Rush manga panel",
        "author": "emilyyzzz",
        "url": "https://i.redd.it/mrsl3bq0xila1.jpg",
        "text": "",
        "created_utc": 1677831011,
        "upvote_ratio": 1.0
    },
    {
        "title": "No. Basic observation haki does not make invisibility useless.",
        "author": "Kenny_Brahms",
        "url": "https://www.reddit.com/r/OnePiece/comments/11gv7a4/no_basic_observation_haki_does_not_make/",
        "text": "In regards to Shiryu's powers, I feel like a lot of people just don't understand how basic observation haki works. People think it automatically negates any form of invisibility, and that therefore either Shiryu's powers are useless or the clear clear fruit must have some power other than invisibility.\n\nWhile I do think its possible that the clear clear fruit has other powers, invisibility is portrayed to be its main power. Shiryu didn't just get this ability by accident, he chose it. So obviously invisibility must be a strong ability.\n\nBut how? What about observation haki?\n\nObservation haki's most basic ability is the ability to sense emotions. Observation haki users use this ability to sense an enemy's intentions and predict their moves. When majority of characters are using observation haki, this is the ability they are using.\n\nAll that it takes to bypass this version of observation haki is for one to simply act without intent. Luffy demonstrated this back in skypiea when he bypassed Enel's observation haki by dodging his attacks on pure instinct and then attacking him in an indirect manner(using punches that bounced off the walls). In doing this, Enel was no longer able to sense Luffy's intentions, leaving him vulnerable to Luffy's attacks.\n\nWhat this means is that for the vast majority of observation haki users, users who can only sense emotions and intentions, Shiryu can easily bypass their haki by attacking without intent. \n\nThere is one form of observation that might be able to bypass invisibility, however. That is the ability to see auras. But we have absolutely zero reason to think this is a standard observation power or that anybody can use it. In fact, only 3 characters have shown the ability to see auras so far.\n\n* Luffy, who can see the future\n* Fujitora, an admiral and master of observation haki\n* Usopp, a sniper with a very specialized use of observation\n\nTwo out of these three characters have outright mastered observation haki. The third, usopp, isn't your average fighter. He is a sniper and his skills are specifically geared towards sniping. What's more is that Usopp hasn't even mastered this power, with him using it one time unconsciously.\n\nSo yeah, most observation haki users cannot see auras, they merely sense emotions. If they could see auras, then Hancock's powers would be useless and she wouldn't have taken out an entire marine fleet, two of teach's commanders, and have even teach afraid of her DF abilities. All it would take to negate her powers would be for one to simply close their eyes and rely on observation. Unfortunately, most people cannot do this, which is why they either get turned to stone or have to stab themselves in Momonga's case.\n\nThe only people who can see auras are observation masters, like Luffy and Fujitora, or snipers who are uniquely fit for this power, like Usopp. If you do not fall into this category, you can still get fucked by invisibility.",
        "created_utc": 1677830950,
        "upvote_ratio": 1.0
    },
    {
        "title": "the great ✌🏻",
        "author": "prettymadison01",
        "url": "https://i.imgur.com/Yh4tzDO.jpg",
        "text": "",
        "created_utc": 1677829755,
        "upvote_ratio": 1.0
    },
    {
        "title": "sanji bday spread in OP hobonichi",
        "author": "jeygglypuff",
        "url": "https://i.redd.it/kjq7rdsjsila1.jpg",
        "text": "",
        "created_utc": 1677829507,
        "upvote_ratio": 1.0
    },
    {
        "title": "Franky's Real Parents",
        "author": "ryguy1689",
        "url": "https://www.reddit.com/r/OnePiece/comments/11guobh/frankys_real_parents/",
        "text": "While I cannot confirm who his mother is, there is strong evidence to suggest that Willy Wonka is really Franky's father. \n\nOr at least the inspiration for Cutty Flam aka Franky. \n\nFirst, we have Willy Wonka's knack for inventing new things, a biological trait that can be passed down from father to son.\n\nSecond, we have Willy Wonka's machines running on the power of carbonation from soda. Franky's machines all run off of cola. It could be that his father passed on a few inventive secrets prior to being murdered by pirates. That Franky uses cola could just be a personal preference, or he discovered that cola has more carbonation than most sodas and is thus the most effective fuel source for him and the Sunny, it's various machines. \n\nThird, they both have a penchant for making up silly rhymes/song lyrics. This could be a learned trait that Franky picked up from his dad and is just a way to remember him by. \n\nFourth, they are both hard boiled, but generally easy going men. During the movie, Willy Wonka doesn't seemed to be disturbed by things that would disturb a normal person (such as a child being reduced down to 1/20th his normal size but still functioning normally). While Franky does feel for those less fortunate for him, not a lot seems to phase him. And Willy Wonka has shown that he can be moved by honest/sincere actions, just like Franky. \n\nFranky was so moved by the Straw Hat's commitment to rescuing Robin that he decided to help them out, even to the point of risking his life and building them a ship, prior to eventually joining the crew.\n\nLastly, Willy Wonka retired young with Charlie taking over the factory. In addition, he did travel to a place that wasn't on any map but could confirm to the group that such a place existed. It is possible that this was actually a form of interdimensional travel. And having returned to this earth once was determined to live a life of adventure where he met his wife in the OP universe and had his son, Cutty Flam prior to meeting a horrible end, leaving his son an orphan. \n\nIt is also possible that a vengeful Oompa Loopa decided to follow Willy into the OP universe and killed him prior to becoming Giamon.",
        "created_utc": 1677828981,
        "upvote_ratio": 1.0
    },
    {
        "title": "A discussion about shanks, a vibe check (chapter 1076)",
        "author": "Forsaken_Wafer_",
        "url": "https://www.reddit.com/r/OnePiece/comments/11gukax/a_discussion_about_shanks_a_vibe_check_chapter/",
        "text": " Am I the only one getting Bad Vibes from Shanks in the latest chapter?\n\nThe main reason I’m suspicious is the way Shanks is introduced, “in a bar at a little port along the coast” next to a hot headed little boy trying to recruit himself and a charmed young female bartender. It's literally a parody of Luffy and Makino. \n\nIs he a grifter? Does he just go around all over the world and pull the same ploy, to get promising young kids to become pirates? To what end?\n\nWhat is Oda trying to tell us with this chapter? That Shanks is super cool? Yeah we all already thought that, so this isn’t anything new, unless he’s implying something else here.\n\nAfter he walks out of the bar he’s greeted by a crowd of what must be his allies/fleet members flocking to and fawning over him. Shanks is like Luffy in that he draws people to him, but here it’s giving cult, it feels obsessive and fanatical, not just grateful/friendly. The only one who would react to Luffy the same way Shanks’ crowd did would be Bartolomeo, and he’s a very special case.\n\nWhat do we really know about Shanks? We’ve never seen him fight, we’ve never seen him going for poneglyphs or other keys to the One Piece. We’ve only ever seen him lounging and drinking on various islands, with Yasopp the deadbeat dad, who’s character we also know nothing about except that he abandoned his wife and child for Shanks.\n\nThe worst part is the parallels between this confrontation of Kid and Shanks, and the one between Law and Blackbeard, down to both emperors demanding the worst generation member’s road poneglyph rubbings with an overwhelming commanding force behind them.\n\nWhat happened to Bartolomeo? Is the next time we hear about him going to be that he or his crew is dead after his confrontation with Shanks?\n\nIs Shanks in league with Blackbeard and all the ‘Shanks is evil’ theories are right? That would suck considering the parallel again; that we know Law and Kid both have the Wano road poneglyph but Kid also at least has the Whole Cake one and Law has the Zhou one, and if Blackbeard and Shanks were in cahoots they would then have the same three Road Poneglyphs the Straw Hats have, putting them on equal footing… if not further along.",
        "created_utc": 1677828582,
        "upvote_ratio": 1.0
    },
    {
        "title": "In your opinion which one piece character is the most talented outside of talent in combat???",
        "author": "Youg_dumb_broke",
        "url": "https://i.redd.it/ta8zvgmapila1.jpg",
        "text": "",
        "created_utc": 1677828412,
        "upvote_ratio": 1.0
    },
    {
        "title": "Luffy Skull made by me :-)",
        "author": "Xbrain17",
        "url": "https://www.reddit.com/gallery/11gu8e3",
        "text": "",
        "created_utc": 1677827372,
        "upvote_ratio": 1.0
    },
    {
        "title": "What do you guys think?",
        "author": "Medical_Tea_9561",
        "url": "https://i.redd.it/goybhbqdjila1.jpg",
        "text": "",
        "created_utc": 1677826425,
        "upvote_ratio": 1.0
    },
    {
        "title": "I just realized that Zoro and Sanji are the right and left eyes of Luffy.",
        "author": "InTuneX",
        "url": "https://www.reddit.com/r/OnePiece/comments/11gtxgk/i_just_realized_that_zoro_and_sanji_are_the_right/",
        "text": "[removed]",
        "created_utc": 1677826326,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is that a scar on Kizaru's chest?",
        "author": "hhunkk",
        "url": "https://www.reddit.com/r/OnePiece/comments/11gtwq5/is_that_a_scar_on_kizarus_chest/",
        "text": "I can't find any info on this, Am i tripping or Kizaru has **huge scar** in his thorax?\n\nhttps://preview.redd.it/in8sq0l31hla1.png?width=1066&amp;format=png&amp;auto=webp&amp;v=enabled&amp;s=86b8283c8873fce9af64cae2b3e3ff408a1a1c8a",
        "created_utc": 1677826253,
        "upvote_ratio": 1.0
    },
    {
        "title": "future King of the pirates",
        "author": "GaylordTurner",
        "url": "https://v.redd.it/71u2cc6tzgla1",
        "text": "",
        "created_utc": 1677825760,
        "upvote_ratio": 1.0
    },
    {
        "title": "Safe to infer that zoro and kuina are cousins?",
        "author": "noanswerbestanswer",
        "url": "https://www.reddit.com/r/OnePiece/comments/11gtm2d/safe_to_infer_that_zoro_and_kuina_are_cousins/",
        "text": "Is it?",
        "created_utc": 1677825221,
        "upvote_ratio": 1.0
    },
    {
        "title": "Theory on Shanks’ abilities",
        "author": "Cheap-Bed-424",
        "url": "https://www.reddit.com/r/OnePiece/comments/11gtlmc/theory_on_shanks_abilities/",
        "text": "Given the Elbaf arc is likely approaching and Shanks seems to be a big player, I was wondering what all of your thoughts are on the types of abilities he has. \n\nBecause Shanks is known for his haki, I believe that he will have haki abilities not yet seen in the story. Specifically, I think he will have a very advanced form of future sight.\n\nThis would fit well with his actions throughout the story. As someone who been planning and pulling strings for characters throughout the story, his ability to see events play out in the future is very possible. \n\nShanks’ warning to Whitebeard, arrival at Marineford, meeting with the Gorosei involving a warning, and prophecy that Luffy would become a great pirate all hint at the fact that Shanks knows things nobody else does. \n\nWhat if this has just been highly advanced futuresight the entire time? Curious about all of your thoughts, and other abilities you think he has.",
        "created_utc": 1677825181,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can anyone explain to me why Chopper looks like a ferret?",
        "author": "PoyStudios-6270",
        "url": "https://i.redd.it/ezyyulwnfila1.jpg",
        "text": "",
        "created_utc": 1677825174,
        "upvote_ratio": 1.0
    },
    {
        "title": "You know what's funny?",
        "author": "Extension_Breath1407",
        "url": "https://www.reddit.com/r/OnePiece/comments/11gt781/you_know_whats_funny/",
        "text": "I am sure in the last Arc with Wano a lot of people were complaining about how none of the people they were voting to become a Straw Hat did not actually become one. Yamato stays on Wano to go exploring like Oden because of course she must be Oden at all times. Carrot stays back too in order to be the leader of the Mink Tribe.\n\nSo I guess Oda heard our complaints and decided to make up for it.\n\nBY LITERALLY HAVING EVERYONE THE STRAW HATS MEET ON EGGHEAD WANT TO JOIN THE CREW!\n\nFirst, it was Dr. Vegapunk who needs them to take him to safety before the World Government assassinates him. \n\nNow Dr. Vegapunk says they also need to take 6 of his satellites too. (At least Sanji would be happy with two of them being sexy ladies)\n\nAnd now Stussy would be with them as well.\n\nHuh? Don't you think that is a bit ironic. Oda is telling us readers, you want someone to be a STRAW HAT SO BADLY? FINE, EVERYONE IS A STRAW HAT NOW!!",
        "created_utc": 1677823861,
        "upvote_ratio": 1.0
    },
    {
        "title": "How did he survive this? Chapter 93 spoilers",
        "author": "politeCanadaPlatypus",
        "url": "https://i.imgur.com/qy1HDJM.jpg",
        "text": "",
        "created_utc": 1677823813,
        "upvote_ratio": 1.0
    },
    {
        "title": "The Goat Have Posted another masterpiece",
        "author": "killerfgaming",
        "url": "https://youtu.be/Fi56EjhiTNo",
        "text": "",
        "created_utc": 1677823696,
        "upvote_ratio": 1.0
    },
    {
        "title": "The end of the story (no spoilers)",
        "author": "Kian3935",
        "url": "https://www.reddit.com/r/OnePiece/comments/11gsv8k/the_end_of_the_story_no_spoilers/",
        "text": "So as the story comes to a close, I wanted to ask a very simple question. When we reach the final chapters does anybody here have a \"soundtrack\" of sorts. If it's very clear Luffy is going to find the One Piece I promised myself I'd listen to We Are as I read it or if it was the final chapter I would listen to \"Memories\" (One Piece's 1st Ending song).   \nI'm just interested if anybody has put any further thought into what they would listen to lol.",
        "created_utc": 1677822815,
        "upvote_ratio": 1.0
    },
    {
        "title": "A Collage Of All The Emperors",
        "author": "adnaphsaka",
        "url": "https://i.redd.it/w6vj1m1xpgla1.png",
        "text": "",
        "created_utc": 1677822445,
        "upvote_ratio": 1.0
    },
    {
        "title": "Barto was in Mock Town???",
        "author": "EachERow",
        "url": "https://i.redd.it/t7cs26pa7ila1.jpg",
        "text": "",
        "created_utc": 1677822359,
        "upvote_ratio": 1.0
    },
    {
        "title": "Monkey D. Luffy :) fan art done by me",
        "author": "SxDayz",
        "url": "https://i.redd.it/5anmrkt97ila1.jpg",
        "text": "",
        "created_utc": 1677822351,
        "upvote_ratio": 1.0
    },
    {
        "title": "GOKU SURE IS INTIMIDATING 😏..",
        "author": "SHADOW_--_",
        "url": "https://i.redd.it/okpm502x6ila1.png",
        "text": "",
        "created_utc": 1677822245,
        "upvote_ratio": 1.0
    },
    {
        "title": "So I finished episode 914, which is luffy fights kaido for the first time, and it was AMAZING. but I got a few questions",
        "author": "manlikezero1",
        "url": "https://www.reddit.com/r/OnePiece/comments/11gsn8d/so_i_finished_episode_914_which_is_luffy_fights/",
        "text": "so I know that wano is the longest arc in the entire series, meaning that it's gonna take awhile for luffy to beat kaido right? but the thing is, as of where I'm at, luffy Is DESTROYING kaido. like he knocked him out in one hit, and then when we woke up he beat his ass some more. as of where im at, kaido hit luffy ONCE and it didn't even hurt him. so what exactly is taking luffy so long to beat him once and for all? thats just something im curious about\n\nmy second question is what exactly is all that red energy stuff that always comes out of luffy when he was fighting kaido? I originally thought it was conquerors haki, but it clearly isnt, cuz he isn't  staring and knocking anyone out and it isnt observer haki either, so what is it then? and also what exactly is the purple stuff that comes out of kaido. im asking because  I've been reading the manga ever since thriller bark, and I just got back into the anime at the beginning of wano \n\nthere's been lotta changes to the animation and shit, so I just wanna understand what all that weird  energy stuff is",
        "created_utc": 1677822102,
        "upvote_ratio": 1.0
    },
    {
        "title": "My contribution to the Sanji Birthday fan art! Art by me.",
        "author": "Cakeisbetterthansex",
        "url": "https://i.redd.it/vp7u3oun5ila1.jpg",
        "text": "",
        "created_utc": 1677821823,
        "upvote_ratio": 1.0
    },
    {
        "title": "All the Zoro fans crying a river because he didn't get cool parents.",
        "author": "Takasugi_Shinsuke007",
        "url": "https://www.reddit.com/r/OnePiece/comments/11gs8o3/all_the_zoro_fans_crying_a_river_because_he_didnt/",
        "text": "If anything this makes zoro seem even more badass.",
        "created_utc": 1677820836,
        "upvote_ratio": 1.0
    },
    {
        "title": "2 Redheads having a great time. Shanks and Miss Fortune",
        "author": "thekillermuffin8",
        "url": "https://i.redd.it/v5crsm8jigla1.jpg",
        "text": "",
        "created_utc": 1677820775,
        "upvote_ratio": 1.0
    },
    {
        "title": "One Piece Canon Bounties as of Chapter 1076",
        "author": "Ill-Ad3844",
        "url": "https://www.reddit.com/r/OnePiece/comments/11gs6rh/one_piece_canon_bounties_as_of_chapter_1076/",
        "text": "001.   5,564,800,000 = Gol D. Roger \n002.   5,046,000,000 = Edward Newgate \n003.   4,611,100,000 = Kaidou\n004.   4,388,000,000 = Charlotte Linlin \n005.   4,048,900,000 = Shanks \n006.   3,996,000,000 = Marshall D. Teach \n007.   3,590,000,000 = Dracule Mihawk \n008.   3,189,000,000 = Buggy \n009.   3,000,000,000 = Monkey D. Luffy, Trafalgar D. Water Law &amp; Eustass Kid \n010.   1,965,000,000 = Crocodile\n011.   1,659,000,000 = Boa Hancock \n012.   1,390,000,000 = King\n013.   1,374,000,000 = Marco\n014.   1,320,000,000 = Queen\n015.   1,111,000,000 = Roronoa Zoro \n016.   1,100,000,000 = Jinbe\n017.   1,057,000,000 = Charlotte Katakuri \n018.   1,032,000,000 = Sanji \n019.   1,000,000,000 = Jack\n020.      932,000,000 = Charlotte Smoothie \n021.      930,000,000 = Nico Robin \n022.      860,000,000 = Charlotte Cracker \n023.      700,000,000 = Charlotte Perospero \n024.      602,000,000 = Sabo \n025.      600,000,000 = Charlotte Snack \n026.      550,000,000 = Portgas D. Ace &amp; Little Oars Jr. \n027.      546,000,000 = Who's Who \n028.      542,000,000 = Chinjao\n029.      510,000,000 = Izou\n030.      500,000,000 = Usopp\n031.      480,000,000 = Edward Weevil &amp; Black Maria \n032.      472,000,000 = Sasaki \n033.      457,000,000 = Belo Betty \n034.      429,000,000 = Tamago \n035.      400,000,000 = Ulti &amp; Karasu\n036.      394,000,000 = Franky\n037.      383,000,000 = Brook \n038.      382,000,000 = Pedro \n039.      366,000,000 = Nami \n040.      350,000,000 = Scratchmen Apoo &amp; Capone Bege \n041.      340,000,000 = Donquixote Doflamingo \n042.      330,000,000 = Cavendish &amp; Pekoms \n043.      320,000,000 = Basil Hawkins, Jewelry Bonney &amp; Gecko Moria \n044.      316,000,000 = Lindbergh \n045.      300,000,000 = Charlotte Oven, Charlotte Daifuku &amp; Caesar Clown \n046.      296,000,000 = Bartholomew Kuma \n047.      293,000,000 = Morley \n048.      290,000,000 = Page One\n049.      230,000,000 = Fisher Tiger\n050.      222,000,000 = X Drake \n051.      210,000,000 = Sai, Squard &amp; Caribou \n052.      200,000,000 = Killer &amp; Bartolomeo \n053.      195,000,000 = Bellamy \n054.      190,000,000 = Coribou \n055.      148,000,000 = Orlumbus \n056.      120,000,000 = Charlotte Mont-D'Or\n057.      108,000,000 = Urogue \n058.      105,500,000 = Bobbin \n059.    +100,000,000 = Emporio Ivankov &amp; Inazuma \n060.      100,000,000 = Dorry &amp; Brogy (They share the same poster but have individual bounties) \n061.         99,000,000 = Pica, Diamante &amp; Trebol\n062.         95,000,000 = Vito\n063.         94,000,000 = Rockstar \n064.         92,000,000 = Albion \n065.         90,000,000 = Gotti \n066.         88,000,000 = Lip Doughty \n067.         80,060,000 = Chadros Higeleyges \n068.         79,000,000 = Nico Olvia \n069.         75,000,000 = Daz Bonez &amp; Raccoon\n070.         73,000,000 = Gyro\n071.       +72,000,000 = Doc Q\n072.         67,000,000 = Suleiman &amp; Gambia \n073.       +64,000,000 = Van Augur \n074.         61,000,000 = Lao G\n075.         60,000,000 = Devil Dias \n076.         58,000,000 = Senor Pink \n077.         57,000,000 = Kelly Funk \n078.         55,000,000 = ? (Pirate that tried to join the Fake Straw Hat Crew but got shot by Demaro Black) \n079.         52,000,000 = Peachbeard \n080.         50,000,000 = ? (Pirate that got captured by Smoker after the Enies Lobby Arc)\n081.       +42,200,000 = Laffite\n082.         42,000,000 = Roshio &amp; ? (Criminal that Galdino took down during his introduction) \n083.         40,000,000 = Boa Sandersonia &amp; Boa Marigold \n084.         38,000,000 = Sarquiss \n085.         36,000,000 = Bobby Funk, Shoujou &amp; Mikazuki \n086.         35,000,000 = Zala \n087.         32,000,000 = Bentham\n088.         31,000,000 = Gladius \n089.         29,000,000 = Marianne \n090.         26,000,000 = Demaro Black\n091.         25,000,000 = Mont Blanc Cricket \n092.         24,000,000 = Galdino, Foxy &amp; Charlotte Lola \n093.         23,000,000 = Masira \n094.       +20,000,000 = Jesus Burgess \n095.         20,000,000 = Yeti Cool Brothers (Rock &amp; Scotch): They have individual bounties; Arlong \n096.         17,000,000 = Krieg &amp; Lacuba \n097.         16,000,000 = Kuro\n098.         15,000,000 = Dellinger \n099.         14,300,000 = Bluejam \n100.         14,000,000 = Drophy\n101.         12,000,000 = Gin\n102.         11,000,000 = Machvise \n103.         10,000,000 = Gem &amp; Wellington \n104.           9,000,000 = Kuroobi &amp; Jango \n105.           8,000,000 = Hatchan &amp; Higuma \n106.           7,800,000 = Curly Dadan \n107.           7,500,000 = Mikita \n108.           7,000,000 = Nyaban Brothers (Sham &amp; Buchi): They share the same bounty \n109.           5,500,000 = Chew\n110.           5,000,000 = Alvida \n111.           3,400,000 = Porchemy \n112.           3,200,000 = Babe \n113.                   1,000 = Tony Tony Chopper \n114.                      500 = Bepo\n\n+ means At Least, most of these are Pre-Timeskip bounties\n\nIndividuals with unknown amount:\n01. Monkey D. Dragon \n02. Rocks D. Xebec \n03. Silvers Rayleigh \n04. Kozuki Oden \n05. Shiki\n06. Benn Beckman \n07. Lucky Roux\n08. Yasopp \n09. Jozu\n10. Vista\n11. Shiryu \n12. Avalon Pizzaro\n13. Catarina Devon \n14. San Juan Wolf \n15. Vasco Shot\n16. Zeff\n17. Koala\n18. Aladine \n19. Charlotte Amande \n20. Crocus\n21. Yorki",
        "created_utc": 1677820675,
        "upvote_ratio": 1.0
    },
    {
        "title": "Just got a Switch yesterday and started working on a One Piece themed island in Animal Crossing, Totto Land, my living room so far, suggestions are welcome![WIP]",
        "author": "m1kesanders",
        "url": "https://i.redd.it/htqr8dl12ila1.jpg",
        "text": "",
        "created_utc": 1677820593,
        "upvote_ratio": 1.0
    },
    {
        "title": "Where does Pudding’s third eye come from?",
        "author": "paperman990",
        "url": "https://www.reddit.com/r/OnePiece/comments/11gs1xa/where_does_puddings_third_eye_come_from/",
        "text": "And how does it relate to the ponicliffs?",
        "created_utc": 1677820255,
        "upvote_ratio": 1.0
    },
    {
        "title": "End of series finisher for USOPP?",
        "author": "SunDonDraws",
        "url": "https://www.reddit.com/r/OnePiece/comments/11grxoy/end_of_series_finisher_for_usopp/",
        "text": "What if USOPP snipes ImU with rubber band of DOOM! His ammo. Luffy.",
        "created_utc": 1677819903,
        "upvote_ratio": 1.0
    },
    {
        "title": "My friend had these delivered to his work a week back or so and I just can’t figure out what they might be, he brought me home some trash ones",
        "author": "Forward-Particular-6",
        "url": "https://www.reddit.com/gallery/11grxey",
        "text": "",
        "created_utc": 1677819881,
        "upvote_ratio": 1.0
    },
    {
        "title": "the next addition to the grand fleet.",
        "author": "bodg123",
        "url": "https://www.reddit.com/r/OnePiece/comments/11grw4u/the_next_addition_to_the_grand_fleet/",
        "text": "Given everything going on in the story, I think moria will join the grand fleet.\n\nThe last we saw him, blackbeard was offering him a position in crew. However we know he went there furious under the presumption that bb had killed absalom for his devil fruit. He was then relieved temporarily while he believed him to still be alive.\n\nAfter his fight with kaido, he became emotionally scarred in way. He no longer relied on crew members and instead started using zombies. He cares very much for his few members and they care about him. Perona was last seen leaving mihawk in search of him. She was also zoros ally during the time skip, so we know them to be on good terms.\n\nWith all this in mind, it doesn't make sense to accept someone who killed a dear friend as a captain. Although denying the invitation would likely put him in a tough position. So I think moria is able to just shadows as a means of escape. Wherever his shadow goes, he can go. This is probably how he escaped from doflamingo. Something doffy commented on that he was aware the kage kage fruit had that kind of ability.\n\nThe only reason he would have to join the fleet is revenge on blackbeard. Luffy just defeated morias old enemy.\n\nAlso I strongly believe pre ts moria could have killed luffy if he wanted to. His final comment before accepting defeat and releasing the rest of the shadows was like go see the new world for yourself in the context of being able to protect his nakama. I think his having oars and captain John will have some kind of bigger tie in to the overall story.",
        "created_utc": 1677819770,
        "upvote_ratio": 1.0
    },
    {
        "title": "An Appreciation To this Community",
        "author": "Vistaaaaa",
        "url": "https://www.reddit.com/r/OnePiece/comments/11grqhk/an_appreciation_to_this_community/",
        "text": "This is not an OP related but I wanna share that this subreddit gave me joy and energy during my review for my licensure examination . Last night, I became a full fledged Mechanical Engineer and I just want to express my gratitude to all the theories, discussion, and memes being shared here.",
        "created_utc": 1677819318,
        "upvote_ratio": 1.0
    },
    {
        "title": "What-if: The One Piece is a tangible treasure, but Captain John's treasure isn't?",
        "author": "ZuraQasm",
        "url": "https://www.reddit.com/r/OnePiece/comments/11grmwi/whatif_the_one_piece_is_a_tangible_treasure_but/",
        "text": "We all know by now from Oda's SBS assurances that the One Piece is not some intangible treasure like a lesson or friendship or a realization, a la 'dragon warrior scroll' from Kungfu Panda.\n\nBut that doesn't mean other treasures are given that protection...the One Piece is safe from the possibility of being a disappointing empty treasure, but that guarantee has never been given for any other treasure hunt.\n\nWe know that Buggy has been searching for Captain John's treasure for a while now. Buggy is a character who notably wants only gold and jewels.\n\nWhat if the treasure that Buggy is searching for, is not a physical treasure? Or if it is, may be it's something he considers even worse?\n\nHow would it be if it turns out that Buggy himself *is* the treasure he has been seeking all along? What if, Buggy was a 'treasure chest baby' like Shanks and Uta?\n\nThat would make Buggy the very treasure Captain John hid before he died. Just thought I'd share this notion.",
        "created_utc": 1677819014,
        "upvote_ratio": 1.0
    },
    {
        "title": "Onepiece [ zoro ]",
        "author": "42_Bunny",
        "url": "https://v.redd.it/yfupm0qhthla1",
        "text": "",
        "created_utc": 1677817753,
        "upvote_ratio": 1.0
    },
    {
        "title": "TBH more should have been done with Kurozumi Tama",
        "author": "teh_meme_god",
        "url": "https://www.reddit.com/r/OnePiece/comments/11gr2tj/tbh_more_should_have_been_done_with_kurozumi_tama/",
        "text": "Could’ve been a cool way to flesh out the arc to show how everyone in Wano suffered equally under Orochi even if they were Kurozumi but nooooo we couldn’t have thay",
        "created_utc": 1677817346,
        "upvote_ratio": 1.0
    },
    {
        "title": "kid vs Red Hair",
        "author": "kichiDsimp",
        "url": "https://www.reddit.com/r/OnePiece/comments/11gr05q/kid_vs_red_hair/",
        "text": "Will we get to see Shanks in battle for the first time ? Will kid be able to give a fight to the Haki Monster ?",
        "created_utc": 1677817136,
        "upvote_ratio": 1.0
    },
    {
        "title": "Zorro's EYE",
        "author": "makdaVyakti",
        "url": "https://www.reddit.com/r/OnePiece/comments/11gqrrq/zorros_eye/",
        "text": "Does anyone have any theories regarding Zorro's eye. What happened there? As far as I know, no one from strawhats asked zorro about losing an eye. Did I miss it? And it was in the manga?",
        "created_utc": 1677816439,
        "upvote_ratio": 1.0
    },
    {
        "title": "question about g-bases",
        "author": "Enough_Blueberry1855",
        "url": "https://www.reddit.com/r/OnePiece/comments/11gqoky/question_about_gbases/",
        "text": "Hello\n\nI have a question about G-bases, i can't find anything about it online\nThe anime-only arc \"G-8 arc\" was aired right after skypiea, am i right?\nHowever, as far as i remember, we never heard about these, in canon content, before the end of Marineford arc, when Smoker wanted to join G-5, am i right?\nAm I missing something? As in, were these G-bases mentionned before? Maybe only in the manga?\nOr is it something Oda canonised? I heard it wouldn't be the first time Oda would canonise an idea from a filler arc.\n\nCan someone explain me please?\nThanks :)",
        "created_utc": 1677816178,
        "upvote_ratio": 1.0
    },
    {
        "title": "Strawhat two beast fight",
        "author": "demonkabaap",
        "url": "https://v.redd.it/wcoumjdj6gla1",
        "text": "",
        "created_utc": 1677815893,
        "upvote_ratio": 1.0
    },
    {
        "title": "Oda is probably going to wank Shanks even harder than ever.",
        "author": "poodl3s388",
        "url": "https://www.reddit.com/r/OnePiece/comments/11gqblp/oda_is_probably_going_to_wank_shanks_even_harder/",
        "text": "Let's be real here. Film Red made 240 million usd. The highest grossing movie for OP. And the 4th highest grossing anime movie.\n\nIt's unlikely to have cost any more than the demon slayer movie by a wide margin. The demon slayer movie cost 15m usd to make.\n\nMy point is Shanks is among the most profitable non-strawhats.\n\nIf you think Oda made Shanks look godlike before(but are an insecure admiral or Mihawk fan).\n\nIt's only going to get worse.",
        "created_utc": 1677815167,
        "upvote_ratio": 1.0
    },
    {
        "title": "Do you think magellan would be admiral level with haki?",
        "author": "joesphl188",
        "url": "https://www.reddit.com/r/OnePiece/comments/11gq3k9/do_you_think_magellan_would_be_admiral_level_with/",
        "text": "Would he need basic armament plus observation or advanced? Or even all 3 types of haki?",
        "created_utc": 1677814521,
        "upvote_ratio": 1.0
    },
    {
        "title": "A problem with Zoro's lineage after the latest SBS",
        "author": "VenomBGR",
        "url": "https://www.reddit.com/r/OnePiece/comments/11gq08w/a_problem_with_zoros_lineage_after_the_latest_sbs/",
        "text": "OK, i might be looking too much into this, and Oda-sensei might have not put too much thought on his reply, or simply genetics work differently in the One Piece universe but according to my limited knowledge of biology, there seems to be a problem regarding Zoro's lineage. I will try to explain and someone more knowledgeable on the matter can confirm if i am right or correct me if i am wrong.  \n\n\nAccording to the latest SBS, this is Zoro's lineage and his apparent link to Ryuma, as hinted by Oda at the end of his statement:   \n\n\nhttps://preview.redd.it/b4fjd413vfla1.png?width=756&amp;format=png&amp;auto=webp&amp;v=enabled&amp;s=9ebf6160ed61640dc99f509d8aac9b2363426416\n\nAnd here is the problem. If genetics in one piece work as in our world (and if i remember my genetics correctly), Zoro, in this situation would technically not inherit any of the original genetic information from Ryuma.  \n\n\nLet us start by reviewing what happens with Ryuma's chromosomes in his descendants.  \nI have marked chromosomes that have been directly inherited by Ryuma with blue, for easier following.  \n\n\nhttps://preview.redd.it/ogzlogi4ufla1.png?width=1500&amp;format=png&amp;auto=webp&amp;v=enabled&amp;s=2e6caa4f6c86e077ca66224f22f3e2c4c12322e3\n\nHis sons would inherit his Y chromosome and their mother's X chromosome (or a mixture of both her chromosomes), while his daughter would inherit his X chromosome and one of their mother's X chromosome (or a mixture of her 2 X chromosomes).   \nGoing further, we will review the descendants from the male line and the female line separately for easier understanding.  \n\n\nFirst is the male line:  \n\n\nhttps://preview.redd.it/m9245fo3xfla1.png?width=1500&amp;format=png&amp;auto=webp&amp;v=enabled&amp;s=a51a06570fe4e1c01b3a54bae6f3fe0ddc97c936\n\nAs you can see, any female descendant of Ryuma's sons, would not inherit Ryuma's X chromosome, as they would get an X from their father (inherited in turn by his mother - Ryuma's wife) and another X from their mother.  \n\n\nAs for the male descendants - they would inherit Ryuma's Y chromosome and pass it to their male descendants, if the line Father - Son remains unbroken.   \n\n\nThis means if Ryuma's line has been passed from father to son, Zoro's grandmother - Shimotsuki Furiko, would technically not carry any of the original genetic information passed from Ryuma.  \n\n\nNow let's review the female line. Technically, here there would be a possibility of simply nature choosing to either not use Ryuma's X chromosome or mix it with another X, introduced by people marring into the family, but for the sake of argument, we are going to assume that nature, when given the choice, has always preserved the X chromosome inherited from Ryuma by his mother, so we get this:  \n\n\nhttps://preview.redd.it/z1sa7br8yfla1.png?width=3000&amp;format=png&amp;auto=webp&amp;v=enabled&amp;s=7cc7ad960a671649a14fa747f374fdedb12ea2bd\n\nAs you can see in this example, which is the best case scenario, the X chromosome of Ryuma is either passed from a mother to a son or daughter or from a father to a daughter. Any time when there is a consecutive male descendant - he does not carry the original X or Y chromosomes of Ryuma.  \n\n\nSo, getting back to the SBS, Zoro's ancestry, considering that it was passed from Ryuma to a daughter and then the line remained unbroken, would look like this:\n\n&amp;#x200B;\n\nhttps://preview.redd.it/gxn7tlsezfla1.png?width=756&amp;format=png&amp;auto=webp&amp;v=enabled&amp;s=22c370fc24b76c3c5cafdf5c4aed4cd97044cfc1\n\nMeaning, the only way that Zoro could actually carry some of the original genetic information from Ryuma is if either his mother Terra or his grandfather Pinzoro were also descendants of Ryuma (perhaps from an earlier exodus of Wano).  \n\n\nOf course i might be getting my genetics wrong, or Oda might have not thought about this or simply genetics work differently in One Piece.  \n\n\nWhat do you guys think?",
        "created_utc": 1677814263,
        "upvote_ratio": 1.0
    },
    {
        "title": "which non canon fruit are you eating",
        "author": "Nearby-Swan-7994",
        "url": "https://www.reddit.com/r/OnePiece/comments/11gpxj1/which_non_canon_fruit_are_you_eating/",
        "text": "The chain chain fruit or gold gold fruit",
        "created_utc": 1677814051,
        "upvote_ratio": 1.0
    },
    {
        "title": "Top100 women from popularity poll, what are your predictions for the next Top 10 poll?",
        "author": "cherry202020th",
        "url": "https://i.redd.it/dk6rtctrehla1.jpg",
        "text": "",
        "created_utc": 1677812767,
        "upvote_ratio": 1.0
    },
    {
        "title": "Let the Man cook",
        "author": "These-Plankton",
        "url": "https://www.reddit.com/r/OnePiece/comments/11gpgq1/let_the_man_cook/",
        "text": "So lately i saw \"One Piece Fans\" cry &amp; shit talking just because their own expectations aren't fulfilled. They now trash talking everything (like the New SBS/ Shanks vs Kid/ Wano Ending) but aren't even aware about this explosive potential slumbering within it. I find it kinda interessting how People claim to know everything about Zoros Family is revealed if we only got Names &amp; the relationship between each other, and how Zoro's Parents die (this will become important later). We learned in One Piece Parents are important in giving \"birth given strength\". I think Oda  just laid the Ground  to Hit us if we dont expect it. Same about the missing Banquet. I don't think he skipped it just to promote Film Red and go along. I am certain at the Banquet were a lot of Things happening, which will become extremly important later on. He saved it all for the right moment to be exposed. So just chill &amp; let Oda Cook, he knows how he wants to write his Story.",
        "created_utc": 1677812753,
        "upvote_ratio": 1.0
    },
    {
        "title": "Luffy x speed week challenge",
        "author": "Mrg2899",
        "url": "https://i.redd.it/6d3ark0mehla1.jpg",
        "text": "",
        "created_utc": 1677812713,
        "upvote_ratio": 1.0
    },
    {
        "title": "Do you think kizaru or akainu could be pirate king level if they have advanced coc?",
        "author": "joesphl188",
        "url": "https://www.reddit.com/r/OnePiece/comments/11gpdc5/do_you_think_kizaru_or_akainu_could_be_pirate/",
        "text": "[removed]",
        "created_utc": 1677812492,
        "upvote_ratio": 1.0
    },
    {
        "title": "I was quite please with the poster, My mom will love it",
        "author": "ParsleyMam",
        "url": "https://i.redd.it/cvq2vyzrvfla1.jpg",
        "text": "",
        "created_utc": 1677812398,
        "upvote_ratio": 1.0
    },
    {
        "title": "Elbaf and Norse Mythology Theory",
        "author": "Rickyszn034",
        "url": "https://www.reddit.com/r/OnePiece/comments/11gpaq4/elbaf_and_norse_mythology_theory/",
        "text": "So we know elbaf has this nordic and viking culture, and oda has taken inspiration from a large number of norse mythos for this arc and the characters surrounding it\n\nTyr and Shanks:\n\n\\- both have red hair, both one armed swordsman, both lost their arm to a beast, both act as a peacekeeper and a god of war who ceases conflicts\n\nhttps://preview.redd.it/gu9eylcbsfla1.jpg?width=1080&amp;format=pjpg&amp;auto=webp&amp;v=enabled&amp;s=10d5a2e553f180ba13bf2d859895dfada24c69e3\n\nLoki and Loki\n\n\\- The name makes it obvious that he has some inspiration from the norse Loki, since we know the Loki in one piece was rejected by lola, a woman who literally wanted to marry everyone she met, she tried it with all the strawhats and absalom, meaning ugly men(absalom), weak men(usopp), none of these are of the table for her. Meaning Loki has qaulities so horrible that she didn't wanna marry him, and these qualities aren't related to appearance or strength. The loki in norse mythos is known for being a trickster so maybe Loki has some qualities such as this. Or he is just evil af.\n\nhttps://preview.redd.it/trmtrrqsvfla1.png?width=320&amp;format=png&amp;auto=webp&amp;v=enabled&amp;s=53d456c532e86a170eca80e2df4e93ee0db33e27\n\nWe know in elbaf Bravery and strength are the most respected qualities, and we have usopp weak and cowardly who wants to prove himself as a brave warrior of the sea and prove himself in elbaf\n\nFenrir and Blackbeard(Xebec)\n\n\\- Both possess the same powers, Earthquakes and darkness, Fenrir is said to bring a world of darkness and earthquakes at ragnarok. Both known to be evil and bringers of chaos. As a will of D BB is the enemy of the gods and fenrirs release is the signal of the fall of the gods.  Fenrir is known to do battle with Tyr and take his arm, but instead of an arm BB will likely take Shanks life.\n\nhttps://preview.redd.it/oel7gjghsfla1.jpg?width=1058&amp;format=pjpg&amp;auto=webp&amp;v=enabled&amp;s=a3fcb37c680738b3f6871e3043b448b2457ab85a\n\nSkoll and Hati( 2 other skull heads on BB flag)\n\n\\-These 2 wolves who were suns of fenrir were said to chase the sun and moon and ragnarok to devour them. BB has the power of the yami yami no mi which is the power to destroy all forms of astronomical matter, most prominently Suns and planets. The gorosei who are named after planets, luffy the sun god nika, and the dawn references. Black holes are the phenomena that do this and that is blackbeards strongest attack.\n\nhttps://preview.redd.it/njaazbpztfla1.jpg?width=971&amp;format=pjpg&amp;auto=webp&amp;v=enabled&amp;s=e2267e92053032600fe0cd224bb410abde794cd3\n\nThor and ????\n\n\\- The Thor of Elbaf is probably the elbaf version of ryuma/oden. A ***giant who was the strongest and bravest of all the giants, just as thor is in norse mythos***. Very likely wielded a hammer of incredible power, likely gonna be named Mjolnir. The ***quota to wield this hammer is very likely bravery.*** You need to be extremely brave to wield this weapon. Usopp will very likely attain this weapon in elbaf, i can see this hammer being incredibly busted and will make up for usopps weak body.\n\nThis could have been a giant with legendary hammer and a lightning logia. Which when you visualise sounds ridiculousy busted, a giant with a lightning logia\n\nJomungaunder and ???\n\nThe world serpent known for fighting thor at the battle of ragnarok, dorry and broggy actually made a reference to this in little garden where they said their hakoku can't destroy the serpent soaked in red which i think is a reference to the red line, Their might be a sea devil in the red line trapped. Jomungaunder desired to kill the aesir deities\n\nhttps://preview.redd.it/v5fohooyufla1.jpg?width=1062&amp;format=pjpg&amp;auto=webp&amp;v=enabled&amp;s=bff379529e2e99e9724121542aea37cf27cc1107\n\nOdin and ???- The odin of elbaf will likely be a character who rules or ruled elbaf, and gave up one of their eyes to attain knowledge or to save someones life. We know Oda has big plans to draw a one eyed pirate soon in this final saga",
        "created_utc": 1677812314,
        "upvote_ratio": 1.0
    },
    {
        "title": "Do you think the panda man character will have any significance for finding the one piece or will he just stay a background where’s Waldo kind of character",
        "author": "prevail333",
        "url": "https://www.reddit.com/r/OnePiece/comments/11gpapg/do_you_think_the_panda_man_character_will_have/",
        "text": "Sorry if this is a stupid question only got into one piece last year",
        "created_utc": 1677812312,
        "upvote_ratio": 1.0
    },
    {
        "title": "So what y’all thoughts about this sbs",
        "author": "gear5uk",
        "url": "https://youtu.be/jk3Xats_10s",
        "text": "",
        "created_utc": 1677812082,
        "upvote_ratio": 1.0
    },
    {
        "title": "finallyyyyy I got it!!!!!",
        "author": "Soft_wind_8013",
        "url": "https://i.redd.it/oiqzcjrobhla1.jpg",
        "text": "",
        "created_utc": 1677811729,
        "upvote_ratio": 1.0
    }
]