[
    {
        "title": "anyone know what this pic is from ?",
        "author": "pasthegasss",
        "url": "https://i.redd.it/uy4w3hdlr4ma1.jpg",
        "text": "",
        "created_utc": 1678095537,
        "upvote_ratio": 1.0
    },
    {
        "title": "10 years following one piece and I still don't understand what luffy meant when he said \"them”",
        "author": "Opbrcdls",
        "url": "https://i.redd.it/x585n2d2q4ma1.jpg",
        "text": "",
        "created_utc": 1678095023,
        "upvote_ratio": 1.0
    },
    {
        "title": "Do Logia abilities consume stamina?",
        "author": "SwordoCharacter",
        "url": "https://www.reddit.com/r/OnePiece/comments/11jtq0z/do_logia_abilities_consume_stamina/",
        "text": "[removed]",
        "created_utc": 1678093791,
        "upvote_ratio": 1.0
    },
    {
        "title": "Who has the best laugh?",
        "author": "Hdhs1",
        "url": "https://i.redd.it/hfvm0zc243ma1.png",
        "text": "",
        "created_utc": 1678093602,
        "upvote_ratio": 1.0
    },
    {
        "title": "Who is your favorite logia user, and logia fruit?",
        "author": "Hdhs1",
        "url": "https://i.redd.it/3roy85h843ma1.png",
        "text": "",
        "created_utc": 1678093601,
        "upvote_ratio": 1.0
    },
    {
        "title": "the beginning of one of the most underrated arcs (imo top arc)",
        "author": "Opbrcdls",
        "url": "https://i.redd.it/saewqn1gi4ma1.jpg",
        "text": "",
        "created_utc": 1678092461,
        "upvote_ratio": 1.0
    },
    {
        "title": "Letter 2: Trafalgar D Water Law",
        "author": "ryguy1689",
        "url": "https://www.reddit.com/r/OnePiece/comments/11jsj86/letter_2_trafalgar_d_water_law/",
        "text": "I tried a couple of times writing a letter, like my last one, but nothing seemed right. I've always imagined that Trafalgar was a poetic type, so I wrote poetry this time. \n\nLet me Know what you think. Thanks\n\n**The Brilliant Dawn** *By Trafalgar D Water-Law*\n\nScreams of the dead drive me insane\n\nShambles, how do I cope with the pain,\n\nWhen all I feel is hate\n\nMeeting Dolfy must've been fate\n\n&amp;#x200B;\n\nI Thought I had to destroy\n\nThe world that tortured this boy\n\nCora tried to drive me away\n\nWith hope I'd find a better way\n\n&amp;#x200B;\n\nDetermined to follow this path\n\nI risked Dolfy's wrath\n\nBut Cora took it in stride\n\nShattered my illusions and pride\n\n&amp;#x200B;\n\nCora, he taught me to laugh\n\nMy life, his epitaph\n\nRoom, my world shattered again\n\nIn Silence, I lost my only friend\n\n&amp;#x200B;\n\nWarlord, seeking revenge\n\nStraw-hat, a scalpel with an edge\n\nI'll use him in my attack\n\nDriving the blade into Dolfy's back!\n\n&amp;#x200B;\n\nAlliance, one more fight to win\n\nKaido, Yonko with a nasty smile\n\nBig Mom, situation is dire\n\nAgainst odds, Luffy's Smile Inspires\n\n&amp;#x200B;\n\nA shadow of the Pirate King\n\nRyuo, the light that Luffy brings\n\nRed Hawk, The Will of D never quits\n\nKaido, the one tanking the hits\n\n&amp;#x200B;\n\nLong Night foretold by prophecy\n\nThe Dawn that Wano can finally see\n\nDragon slayed, the titian felled\n\nThe Brilliant Dawn Unparalleled.\n\n&amp;#x200B;\n\nThats it, I know I glossed over a bit of stuff like PH and most of Dressrosa, but the poem was getting long so I cut out what I could. I hope you guys enjoyed it. \n\nAnd Let me know if you want more poems. \n\n&amp;#x200B;\n\nDear Moderators I wasn't sure how to flair this. Literature is art, and since Oda didn't actually write what I've credited to Trafalgar, I figured that this would be fanart on account of this. \n\nIf mistagged please let me know.",
        "created_utc": 1678089797,
        "upvote_ratio": 1.0
    },
    {
        "title": "one imposter amoung us",
        "author": "black_cop_48",
        "url": "https://i.redd.it/dg07346ia4ma1.png",
        "text": "",
        "created_utc": 1678089792,
        "upvote_ratio": 1.0
    },
    {
        "title": "Melt Melt fruit",
        "author": "bruhanimate123",
        "url": "https://i.redd.it/d94ca9m2a4ma1.png",
        "text": "",
        "created_utc": 1678089645,
        "upvote_ratio": 1.0
    },
    {
        "title": "I won this at a draw on Gameathlon and I love it.",
        "author": "Distinct_Alps_8918",
        "url": "https://i.redd.it/ir7ncgml84ma1.jpg",
        "text": "",
        "created_utc": 1678089150,
        "upvote_ratio": 1.0
    },
    {
        "title": "Yamato's Oden personality-disorder is disrespectful to Oden...",
        "author": "TheMiloBurrows",
        "url": "https://www.reddit.com/r/OnePiece/comments/11js8m4/yamatos_oden_personalitydisorder_is_disrespectful/",
        "text": "Basically the title. I'm currently on episode 1010 and so far Yamato has slightly intrigued but mostly annoyed me. Her insistence that she's \"Oden,\" especially to Momonosuke's face was completely ridiculous and even though I'm sure she's been abused for years and has a great motive for wanting to be \"like\" Oden, it still doesn't excuse her pretending to \"be\" someone else. I've otherwise been really enjoying the Wano arc, and there've been some awesome moments in just the last few episodes. I knew that she'd show up, but had no clue she'd be pretending to \"be\" Odin, just that she'd be sympathetic to the Kozuki cause. This whole calling her 'young master,' and 'he,' and everyone humoring her Oden obsession for some reason makes no sense and makes her more annoying than interesting. If she really reveres Oden and wants to make his dream a reality, what part of that mandates HER being him?! Especially now that she knows that the Akazaya Nine and Momo are alive, she should realize that they do and will NOT see her as the master they served. None of them like Kin'emon would never go so far as to claim to even be Oden's successor, but going up to a boy (who basically just lost both his parents a few months ago in his view) and saying, \"hey, I'm totally a girl but believe me, I'm your Dad, I'm totally your Father.\" Would be both confusing and (probably) cause him renewed grief, like ripping open an old wound *cough* Kaido *cough*\n\nThis has been one of the sole things sucking the enjoyment out of this arc for my Dad and me. I wish she would recognize that she's her own person. This goes beyond something like cosplay and has entered mental illness territory... does she get any better going forward?",
        "created_utc": 1678088818,
        "upvote_ratio": 1.0
    },
    {
        "title": "Scar on eye",
        "author": "Plastic_Tap_8224",
        "url": "https://i.redd.it/i3ligcyj74ma1.jpg",
        "text": "",
        "created_utc": 1678088796,
        "upvote_ratio": 1.0
    },
    {
        "title": "Thunder vs Flame",
        "author": "bruhanimate123",
        "url": "https://v.redd.it/v8a5qprln2ma1",
        "text": "",
        "created_utc": 1678088009,
        "upvote_ratio": 1.0
    },
    {
        "title": "One Piece: Chapter 1077 - Predictions",
        "author": "AutoModerator",
        "url": "https://www.reddit.com/r/OnePiece/comments/11jrd83/one_piece_chapter_1077_predictions/",
        "text": "**Chapter 1077** is just around the corner and it's the perfect time to leave your thoughts and comments on the upcoming chapter.\n\n**This thread isn't a place to talk about hints or reaction given by leakers before the spoiler are out. People will start getting banned for sharing those here.**\n\n\\*\\*\\*\\*\\*\\*\\*\n\nJoin us at [https://discord.gg/onepiece](https://discord.gg/onepiece) to discuss One Piece instantly with fellow nakama!",
        "created_utc": 1678086040,
        "upvote_ratio": 1.0
    },
    {
        "title": "Character appearances by chapter",
        "author": "Hike16",
        "url": "https://www.reddit.com/r/OnePiece/comments/11jr9c8/character_appearances_by_chapter/",
        "text": "Hey guys, I wanna share with you the partial result of my summer vacation (southern hemisphere) project. Once I got me thinking \"how many named characters there are in One Piece?\", and then I set out to find this out. Actually, it turned out that I created something more refined. I don't know if something like this already exists but nevertheless I had fun doing it. I made a huge character x chapter table sheet to check everytime every character appears in every chapter.\n\nThe first difficulty is to define what exactly counts as an appearance, since as you know, there are many instances of that: cover stories, flashbacks, reference-image, silhouette, etc. The second issue was that as the number of columns kept getting bigger and bigger it got impracticable to keep filling the cells just as I read the chapters, so I eventually sumonned wiki's aid. So, in the current state of affairs, I am not distinguishing any of those forms of appearances.\n\nRegarding the second line of the sheet, it is an rough attempt to single out characters I deem as of \"Low\" relevance, such as background characters named in  databooks and the likes. As of right now, this is entirely subjective and not completely cohetent, but perhaps it can be made objective and precise in the future. Summing up, the number in A3 is the total number of named character entries so far, below it it's the number of \"low relevance\" characters, and in A5 the difference between then, hence, the amount of \"high relevance\" characters.\n\nWith no further ado, here is the link to the sheet. I'll leave it open for comments in case anyone wants to help me correct the many many flaws it certainly has.\n\nhttps://docs.google.com/spreadsheets/d/1hty9pt3WYOR_vpgiuqC4XRlA3ZBVtHqd4xrkDYKJQws/edit?usp=drivesdk",
        "created_utc": 1678085704,
        "upvote_ratio": 1.0
    },
    {
        "title": "is this really chapter 1077 ... i got really hyped reading this.",
        "author": "buckets1011",
        "url": "https://www.reddit.com/r/OnePiece/comments/11jqjcc/is_this_really_chapter_1077_i_got_really_hyped/",
        "text": "[https://mangalike.org/manga/one-piece/1077/](https://mangalike.org/manga/one-piece/1077/)",
        "created_utc": 1678083464,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does anime pacing after dressrosa gets better",
        "author": "Itchy_Meat_5140",
        "url": "https://www.reddit.com/r/OnePiece/comments/11jqgrv/does_anime_pacing_after_dressrosa_gets_better/",
        "text": "[removed]",
        "created_utc": 1678083246,
        "upvote_ratio": 1.0
    },
    {
        "title": "This person who asked and the person who called . Both shifted the era",
        "author": "Felwinter99",
        "url": "https://www.reddit.com/gallery/11jqb2r",
        "text": "",
        "created_utc": 1678082753,
        "upvote_ratio": 1.0
    },
    {
        "title": "Choose five of those characters to return and how it would happen?",
        "author": "Shot_Common_860",
        "url": "https://i.redd.it/im0cnp79n3ma1.png",
        "text": "",
        "created_utc": 1678081972,
        "upvote_ratio": 1.0
    },
    {
        "title": "Which one of those characters, would you choose to return? And how?",
        "author": "Shot_Common_860",
        "url": "https://i.redd.it/mvqdlmk2m3ma1.png",
        "text": "",
        "created_utc": 1678081573,
        "upvote_ratio": 1.0
    },
    {
        "title": "who would win in a fight Luffy D Monkey or Thor(Norse Mythology)",
        "author": "Tobynenopian123",
        "url": "https://www.reddit.com/gallery/11jpw9c",
        "text": "",
        "created_utc": 1678081535,
        "upvote_ratio": 1.0
    },
    {
        "title": "I found zoro’s devil fruit",
        "author": "Potential_Western_19",
        "url": "https://i.redd.it/2v5oybhhc3ma1.jpg",
        "text": "",
        "created_utc": 1678078348,
        "upvote_ratio": 1.0
    },
    {
        "title": "Random assumptions/thoughts I had before watching one piece",
        "author": "RodrickHeffley_Real",
        "url": "https://www.reddit.com/r/OnePiece/comments/11joqq8/random_assumptionsthoughts_i_had_before_watching/",
        "text": "This is just a list of assumptions I had before watching one piece (im at the end of pre timeskip)\n\nI thought whitebeard and blackbeard were brothers and were both villains\n\nI thought doflamingo was the main villain of the series and then later I thought it was akainu \n\nI thought crocodile was gonna appear way way way later into the story and not the first 100 episodes\n\nI thought usopp got beat up by luffy, zoro, sanji, and chopper during the scene of them walking to franky house\n\nI thought arlong park was gonna be about arlong kidnapping nami and luffy was gonna save her\n\nI thought robins I want to live scene was her begging for her life to a random villain\n\nI thought aokiji and akainu were gonna fight in marineford for some reason\n\nI thought the sabaody arc was just gonna be the straw hats meeting rayleigh and law and then teaming up with them against a random villain\n\nI thought buggy was just gonna be a villain who gets defeated once and never returns\n\nI thought the strawhats would get the thousand sunny after the timeskip\n\nI thought shanks was just gonna be one of luffys friends at his home village and not one of the strongest character in the series",
        "created_utc": 1678078114,
        "upvote_ratio": 1.0
    },
    {
        "title": "You're Not Ready For This - Captain Kidd 's Next Level is OP",
        "author": "three-day-trip",
        "url": "https://www.reddit.com/r/OnePiece/comments/11jomk8/youre_not_ready_for_this_captain_kidd_s_next/",
        "text": "As we all know, Kid is about to face a losing battle against Shanks on Elbaf.....well that's what Oda wants us to think at least. \n\nEveryone usually levels up after a life threatening battle. So we should see some major improvements after facing off with two Emperors of the Sea.\n\nThere is much more to Kid's devil fruit ability that he hasn't shown yet. Like let's say creating a magnetic field that disrupts brain waves aka electromagnetic waves.\n\nStudies have shown that magnetism can **change the flow of blood in the brain, and turn off neuron groups**. Some under the influence of high magnetic fields have caused people to have violent seizures, and even lose consciousness, slip into comas, and die. **Electricity is everywhere, even in the human body**. Our cells are specialized to conduct electrical currents. Electricity is required for the nervous system to send signals throughout the body and to the brain, making it possible for us to move, think and feel. If Captain Kid has figured out how to disrupt those signals were gonna be in for a BIG SHOW.\n\nIt would be an extremely overpowered ability that not even Shanks could shake off easily. Being able to mess with someones heart or brain would cripple anyone immediately. I can understand better now why Oda would nerf Kid by taking one of his arms and giving him a slow evolution process. Being able to create magnetic fields to kill your enemy is just too much too soon.\n\nThe fact is this whole idea had me thinking this is may be why the Red Hair Pirates took his arm to begin with. What if he needed both hands to use this ability but as soon as he showed signs of this awakened power, Ben Beckman or another took his arm to stop him. If that's true then maybe after his battle on Onigashima and after he's had time to heal and regain his strength he's figured out how to use this ability to its fullest. \n\nJust imagine now if Kid can fuse his devil fruit with Haki like Luffy. All I can see now is some major Electromagnetic Haki clashes with Shanks Wifi Haki. Wouldn't that make this fight worth while now?\n\nEither way things won't go the way people expect. Ch 1077 is going to be really special. Get Ready.\n\n[CHAPTER 1076](https://preview.redd.it/n74t14egs1ma1.png?width=1050&amp;format=png&amp;auto=webp&amp;v=enabled&amp;s=316cbd1dfeeef4b1ac178deadce638ff5c470b01)",
        "created_utc": 1678077790,
        "upvote_ratio": 1.0
    },
    {
        "title": "thousand sunny mini ship plastic kit",
        "author": "SavageRudy",
        "url": "https://www.reddit.com/gallery/11jols9",
        "text": "",
        "created_utc": 1678077729,
        "upvote_ratio": 1.0
    },
    {
        "title": "Question about the anime",
        "author": "Im-a-gamer6920",
        "url": "https://www.reddit.com/r/OnePiece/comments/11jojf0/question_about_the_anime/",
        "text": "Is there an episode of Water 7 like there’s an episode of Skypiea and East Blue?",
        "created_utc": 1678077536,
        "upvote_ratio": 1.0
    },
    {
        "title": "A question regarding Ennies Lobby [SPOILERS]",
        "author": "The_R3venant",
        "url": "https://www.reddit.com/r/OnePiece/comments/11joiye/a_question_regarding_ennies_lobby_spoilers/",
        "text": "On the final chapters, it's shown that Luffy cannot move after beating Lucci (to the level that even Robin had to use her hand abilities to carry Luffy to the Merry). However, moments after, he suddenly gets up beyond all his wounds.\n\nI don't mind if Chopper checked Luffy for his injuries, but the thing is that he stood up by himself, like if he managed to regen his own body. How's that possible? Lol",
        "created_utc": 1678077501,
        "upvote_ratio": 1.0
    },
    {
        "title": "Where can I read one piece colored manga",
        "author": "Sizers_",
        "url": "https://www.reddit.com/r/OnePiece/comments/11joc8p/where_can_i_read_one_piece_colored_manga/",
        "text": "I am trying to read chapter 1030 of one piece but where?",
        "created_utc": 1678076980,
        "upvote_ratio": 1.0
    },
    {
        "title": "The Davy Back Fight",
        "author": "Healthy-Ad756",
        "url": "https://www.reddit.com/r/OnePiece/comments/11jo5ze/the_davy_back_fight/",
        "text": "[removed]",
        "created_utc": 1678076481,
        "upvote_ratio": 1.0
    },
    {
        "title": "what islyality....",
        "author": "eimranhassan02",
        "url": "https://www.reddit.com/r/OnePiece/comments/11jo371/what_islyality/",
        "text": "I see generally people said Zoro is the most loyal, sanji is the most loyal.I don't wtf is this people trying to prove.what is the last steps of loyality?I thik try to give their life for the qrew is the last step and all the straw hat qrew do that seaveral time.I know they all are not  equally intelligent and strong but they try at their own upper limit.So stop saying this  f****** shit",
        "created_utc": 1678076268,
        "upvote_ratio": 1.0
    },
    {
        "title": "why was this scene from opening 6 cut/ changed in some versions? look at chopper, sanji and the girls",
        "author": "bugsitter",
        "url": "https://v.redd.it/asjo6vc063ma1",
        "text": "",
        "created_utc": 1678076190,
        "upvote_ratio": 1.0
    },
    {
        "title": "why is this scene cut out of opening #6 sometimes/simplified? look at chopper, sanji and the girls",
        "author": "bugsitter",
        "url": "https://v.redd.it/xx39wem253ma1",
        "text": "",
        "created_utc": 1678075876,
        "upvote_ratio": 1.0
    },
    {
        "title": "If luffy turn evil now will the strawhats be able to stop luffy in his nika form?",
        "author": "fireasy",
        "url": "https://www.reddit.com/r/OnePiece/comments/11jnsbw/if_luffy_turn_evil_now_will_the_strawhats_be_able/",
        "text": "Luffy has transcend to a yonko level so if luffy ended up being evil. How can the strawhats stop him in gear 5? \n\n\nProvided that the devil fruit nika take over his body and started being evil and stay forever in that form until he gets taken down. \n\n\nWill the strawhats stand a chance? 🤔",
        "created_utc": 1678075395,
        "upvote_ratio": 1.0
    },
    {
        "title": "luffy's powers inspiration",
        "author": "heavenkingforever",
        "url": "https://www.reddit.com/r/OnePiece/comments/11jnrt9/luffys_powers_inspiration/",
        "text": "we all know gear 5 is quite inspired from loony toons but i was watching the mask movie and its power concept was so similar to gear 5 that i couldnt unsee it. especially the 2nd movie named son of the mask in which baby utilizes his power quite alot like how luffy does that it was mind boggling on how much useful this power can get if luffy uses it.\n\nhttps://i.redd.it/wlctgsozl1ma1.gif",
        "created_utc": 1678075353,
        "upvote_ratio": 1.0
    },
    {
        "title": "Oda's astigmatism",
        "author": "McpZ",
        "url": "https://www.reddit.com/r/OnePiece/comments/11jnnyz/odas_astigmatism/",
        "text": "Oda's stated that his vision is horrible, I know we are at peak one piece hype every new chapter of the manga, but I really wouldn't bother if he would take care of his vision, do a surgery, first",
        "created_utc": 1678075070,
        "upvote_ratio": 1.0
    },
    {
        "title": "luffy gear 5 inspiration",
        "author": "heavenkingforever",
        "url": "https://www.reddit.com/r/OnePiece/comments/11jnnsv/luffy_gear_5_inspiration/",
        "text": "[removed]",
        "created_utc": 1678075056,
        "upvote_ratio": 1.0
    },
    {
        "title": "A Future Roger",
        "author": "Kingsnor",
        "url": "https://www.reddit.com/r/OnePiece/comments/11jnmj7/a_future_roger/",
        "text": "Since cloning is now a thing in One Piece, do you think it’s possible that the World Government might clone Roger. They would have his body from the execution so it would be no different then the Warlords or Impale Down pirates. Not saying Oda will do this, to be honest I hope he doesn’t. But like to hear others opinion.",
        "created_utc": 1678074952,
        "upvote_ratio": 1.0
    },
    {
        "title": "I got so many compliments on this.",
        "author": "Opeqwdxdf",
        "url": "https://i.redd.it/5ltwfflek1ma1.png",
        "text": "",
        "created_utc": 1678074847,
        "upvote_ratio": 1.0
    },
    {
        "title": "Has someone made a dressrosa edit to make it more like a movie instead of watching flashbacks after flashbacks?",
        "author": "BsajoshuA123456789",
        "url": "https://www.reddit.com/r/OnePiece/comments/11jngqw/has_someone_made_a_dressrosa_edit_to_make_it_more/",
        "text": "Or should I do it myself",
        "created_utc": 1678074496,
        "upvote_ratio": 1.0
    },
    {
        "title": "One Piece on Ice announced on IG",
        "author": "MidoriTea",
        "url": "https://i.redd.it/abbgigc4z2ma1.jpg",
        "text": "",
        "created_utc": 1678073854,
        "upvote_ratio": 1.0
    },
    {
        "title": "What's the deal with Garp's dog hat?",
        "author": "hopeless-joe",
        "url": "https://www.reddit.com/r/OnePiece/comments/11jmw1u/whats_the_deal_with_garps_dog_hat/",
        "text": "First of all, I know the reason for why Oda decided to make Garp wear a dog hat, to keep the real character a surprise from us the readers/viewers, but was there any explanation as to why Garp himself decided to wear a dog hat. It's not like he was ever secretive about his identity before, at least not from what we've seen anyway.\n\nAlso, how come he never wears the dog hat again since the end of Enies Lobby?",
        "created_utc": 1678072884,
        "upvote_ratio": 1.0
    },
    {
        "title": "New character leak!! [SPOILERS]",
        "author": "Button-Formal",
        "url": "https://i.redd.it/1ygmgf9xv2ma1.jpg",
        "text": "",
        "created_utc": 1678072779,
        "upvote_ratio": 1.0
    },
    {
        "title": "Do you feel one piece manga is being rushed nowadays?",
        "author": "TigerIll3617",
        "url": "https://www.reddit.com/r/OnePiece/comments/11jmsq7/do_you_feel_one_piece_manga_is_being_rushed/",
        "text": "I’m I the only one who thinks the recent chapters are incredibly rushed compared to what it’s used to be ?",
        "created_utc": 1678072636,
        "upvote_ratio": 1.0
    },
    {
        "title": "Chapter 1077 Spoilers",
        "author": "12shin12",
        "url": "https://www.reddit.com/r/OnePiece/comments/11jmljq/chapter_1077_spoilers/",
        "text": "**Confirmed by Redon and Arlong Park Forums**\n\n- Luffy and Lucci banter, Lucci threatens him\n- Seraphim are back up and launch a massive attack\n- Luffy and Zoro barely block it, Zoro: \"ugh, they are stronger than I thought\"\n- Kaku and Lucci reluctantly offer to hold off the Seraphim while Luffy and Zoro search for Dr. Vegapunk\n- cut to the Marine ships. Random Marine: \"Admiral Kizaru, we are reaching Egghead island!\" \n- cut to Vegapunk in prison: \"What?! You are behind this? What is the meaning of this?\" - Mysterious figure (silhouette): \"you will find out soon enough!\"",
        "created_utc": 1678072096,
        "upvote_ratio": 1.0
    },
    {
        "title": "Do smile devil fruit user dies and a new fruit developed from smiles?",
        "author": "fireasy",
        "url": "https://www.reddit.com/r/OnePiece/comments/11jmkj7/do_smile_devil_fruit_user_dies_and_a_new_fruit/",
        "text": "There shouldn’t be two devil fruit user with the same ability but momo and kaido is the same due to vegapunk works. So the question is now will there be a similar devil fruit born after they are both deceased? The worst part is the failed smile devil fruit if reborn and some random person eat it?! 🤭",
        "created_utc": 1678072018,
        "upvote_ratio": 1.0
    },
    {
        "title": "My Theory is that Shanks will get his arm back by eating a devil fruit.",
        "author": "comrad7",
        "url": "https://www.reddit.com/r/OnePiece/comments/11jm6a8/my_theory_is_that_shanks_will_get_his_arm_back_by/",
        "text": "I think that shanks will get his arm back by killing Robin, taking her devil fruit, and using it to get his other arm back.",
        "created_utc": 1678070956,
        "upvote_ratio": 1.0
    },
    {
        "title": "Fishman vs Rasengan",
        "author": "Cafenn94",
        "url": "https://v.redd.it/2q6nnvy8q2ma1",
        "text": "",
        "created_utc": 1678070877,
        "upvote_ratio": 1.0
    },
    {
        "title": "What y’all think ?",
        "author": "AdFuzzy9154",
        "url": "https://v.redd.it/1jfsreucn2ma1",
        "text": "",
        "created_utc": 1678069906,
        "upvote_ratio": 1.0
    },
    {
        "title": "Sean Smoke, aka, SHEnix",
        "author": "SunDonDraws",
        "url": "https://i.redd.it/a9v22wlj51ma1.jpg",
        "text": "",
        "created_utc": 1678069845,
        "upvote_ratio": 1.0
    },
    {
        "title": "Theory on Zoro",
        "author": "HandPsychological997",
        "url": "https://www.reddit.com/r/OnePiece/comments/11jlrcr/theory_on_zoro/",
        "text": "So I have a theory on Zoro, ynow swordsman of the strawhats. Devil fruits were created by the devil presumably, but we never was able to see anything about the devil. What if the devil is residing in Zoro’s eye? There’s so many implications of this. The purple aura usually symbolizes so sister things, Emma, his katana in mythology was the ruler of hell, his signature power up was of “king of hell” where in mythology the devil resides in. Could the devil be in zoros eye? (Just a theory I thought of so don’t start yammering if there’s another theory similar to mines I didn’t know about)",
        "created_utc": 1678069821,
        "upvote_ratio": 1.0
    },
    {
        "title": "(Not mine) Theory on the One Piece being Bink's Sake - what's your opinion on it?",
        "author": "Dem_beatz123",
        "url": "https://www.reddit.com/r/OnePiece/comments/11jlkc3/not_mine_theory_on_the_one_piece_being_binks_sake/",
        "text": "This isn't my theory, but I really hope it ends up being true because its so compelling and tearful. \n\nI did research on the mega theory about the One Piece which I don't remember the name of. It states that the One Piece itself, is actually Bink's Sake, and I believe it's multi layered symbolism. \n\nThe more I think about it, the more it makes sense.\n\nJoyboy's legacy left a memorial to pirate freedom - a song, and a cup of Sake. Every time we see Sake in the story, it's crucial. Partying and laughter, celebration, community and friendship, loyalty, etc. Sake is what symbolises pirate's freedom.\n\nAce, Sabo and Luffy used Sake to form their bond as brothers. So many notable characters in both times of joy, celebration and happiness, and sadness, pain and dispair sing the song. It has so much importance in the series that I believe, has yet to unveil itself fully. \n\nBink's Sake is something more though. It's a song about freedom, laughter, joy, being with your friends, and embarking on a journey. It's stated in the series that the song brings Joy to dire situations. \n\nWhere there is sadness and dispair, Bink's Sake will be delivered to reignite the Joy, spirit and laughter in people. It's just beautiful. \n\nMusic brings people together in One Piece, whether it's around a fire in the woods, on the deck of a ship, or on the dance floor of a hall and banquet. \n\nMusic and Sake/wine/beer (doesn't matter what drink) bring people together in our world too. Whether you're going to a festival or dance club with friends to have fun, a concert, or sharing memories and moments with your friends with some quiet drinks and music at home. Where you can let go of any issues, dispair, or conflict, and cheers to a drink with friends, enemies or rivals. \n\nThe most important bits of evidence however is Bink's Sake itself, the song. Roger and his crew sung it on the way to laugh tale, and throughout their journey. They were laughing, drinking, having fun and partying all the way to laugh tale, quite literally, being a laugh... Tale itself. Brook and his crew also sang in when starting their journey in the grand line. It even rang joy to Laboom, the whale. Brook once again sang it with the Straw Hats at the Banquet while playing ont he piano and crying with happiness that Joy has once again entered his life. \n\nOf course the Roger pirates laughed when they saw laughtale and the one piece. Bink's Sake is a symbol of what they have been singing and drinking this whole time. The one piece isn't necessarily laughter and joy, but it symbolises and brings those things. \n\nIf you actually read the lyrics, there is heavy symbolism of freedom, spirit, awaiting the morning sun, and laughter. I want to highlight some important things in the song. The waiting for the morning sun specifically is important. The sun brings joy, happiness and hope, hence why Joyboy is also known to be \"sun god Nika\". Although times are sad, difficult and painful, the song is a way to say \"just hang on there a little longer, and make do with the friends you have around you, for the sun will rise again, and your dispair will be replaced with joy\". \n\nBrook is actually important to what the One Piece represents. There is a line at the end (excuse the translation as it's from The wiki and inaccurate) saying \"doesn't matter who you are, someday you'll be bones.\"\n\nIt sounds depressing at first, until you realise Brook who perfectly represents this line is so joyful and always laughing with his yohohoho. \n\nIn One piece, Sake is about loyalty as well. Is it a coincidence that (presumably) Roger died, Yonko and their allies share a cup of Sake to form a bond of loyalty and friendship?? Its tradition in One Piece, and Luffy did this too. But when Luffy did it, his terms were, rather than his fleet serving under him, they'd stand with him side by side and help each other. The reincarnation of Joyboy himself said that... \n\nBink's Sake is not just a song, or drink. Bink's Sake symbolises freedom, joy, laughter, and endurance in times of happiness and dispair. Bink's reminds us of our friends, journey and passed loved ones which we continue to commemorate. It's about having fun, embarking on a journey, and following your individual and collective dreams together. Its even a way of letting by gones be by gones, and making peace with your passed enemies, who will become your friends. Its Joyboy's style, its Luffy's style, and its absolutely Oda's style. \n\nWhat do you guys think about this theory? The moment I heard it, I was sold, and it's only making more and more sense as I think about it more.",
        "created_utc": 1678069298,
        "upvote_ratio": 1.0
    },
    {
        "title": "I’ll do it with my dawn will! Please comment if you catch the reference. How weird would it be if D. stood for Dawn and was a pun on this sentence which happens to be a phrase from another Shonen series?",
        "author": "OnionLegend",
        "url": "https://www.reddit.com/r/OnePiece/comments/11jlj9i/ill_do_it_with_my_dawn_will_please_comment_if_you/",
        "text": "Dying Will, Dawn Will. They do sound like a pun.\n\nReborn was published from 2004 to 2012, while One Piece started earlier in 1997.\n\nIn Reborn, they have Sun flames, sky flames, storm flames.\n\nTsuna is the sky, Ryohei is the sun, and Gokudera is the storm. Ryohei is passionate and Gokudera is calm. Sanji has both characteristics but he’s more passionate than Zoro emotionally. Gokudera is the right hand man of the boss. The difference is Luffy is the sun and Zoro uses storm attacks but there’s not really a 1 to 1 analogy so I won’t force it. Tsuna and the Vongola are mafiosos that aren’t really mafia while Luffy and the Straw Hats are pirates that aren’t really like pirates. Both series have the main character wearing cool ass capes/cloaks when they are being badass.\n\nCould Reborn have some of the same inspirations to the writing as One Piece?\n\nD. standing for Dying would be really weird but if Dawn is a pun for Dying it would make sense.",
        "created_utc": 1678069226,
        "upvote_ratio": 1.0
    },
    {
        "title": "Lucci vs Juan (Leopard vs Jaguar devil fruit) [OC]",
        "author": "Repulsive_Risk_1242",
        "url": "https://i.redd.it/ddjrr4r321ma1.png",
        "text": "",
        "created_utc": 1678068714,
        "upvote_ratio": 1.0
    },
    {
        "title": "Chat GPT is lying to us",
        "author": "TheRussianGuy112",
        "url": "https://i.redd.it/5gv1c5ki11ma1.png",
        "text": "",
        "created_utc": 1678068513,
        "upvote_ratio": 1.0
    },
    {
        "title": "Nico Robin Beast Pirate Cosplay",
        "author": "jennifertorresreyes",
        "url": "https://www.reddit.com/gallery/11jkn0u",
        "text": "",
        "created_utc": 1678066882,
        "upvote_ratio": 1.0
    },
    {
        "title": "Some pictures of my Law cosplay at Seattle’s Comic-Con",
        "author": "Qwertyboi2",
        "url": "https://www.reddit.com/gallery/11jkkz7",
        "text": "",
        "created_utc": 1678066733,
        "upvote_ratio": 1.0
    },
    {
        "title": "Serious inquiries only.",
        "author": "Responsible-Cream527",
        "url": "https://www.reddit.com/r/OnePiece/comments/11jkjg1/serious_inquiries_only/",
        "text": "Could gear 5 Luffy defeat sage mode naruto (pain arc)?",
        "created_utc": 1678066618,
        "upvote_ratio": 1.0
    },
    {
        "title": "OG in his Generation!",
        "author": "foundchariot",
        "url": "https://i.imgur.com/PQxsaNE.jpg",
        "text": "",
        "created_utc": 1678066554,
        "upvote_ratio": 1.0
    },
    {
        "title": "When is one piece red coming to crunchyroll?",
        "author": "YeahOkayBud_",
        "url": "https://www.reddit.com/r/OnePiece/comments/11jkaqo/when_is_one_piece_red_coming_to_crunchyroll/",
        "text": "hi guys just want to know if anyone knows when one piece red will come to crunchy roll or any streaming service soon? i really want to watch the film",
        "created_utc": 1678065990,
        "upvote_ratio": 1.0
    },
    {
        "title": "I've read theories about Luffy's mom being Crocodile or Jimbei. Who's next? Who else could be?",
        "author": "neutront",
        "url": "https://i.redd.it/njzmjiokt0ma1.jpg",
        "text": "",
        "created_utc": 1678065958,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does anyone know what ost this is? this is from episode 900",
        "author": "South_Mycologist_955",
        "url": "https://v.redd.it/a9geufjbt0ma1",
        "text": "",
        "created_utc": 1678065690,
        "upvote_ratio": 1.0
    },
    {
        "title": "Spoilers for dressrosa arc",
        "author": "No-Tree6027",
        "url": "https://www.reddit.com/r/OnePiece/comments/11jk2mh/spoilers_for_dressrosa_arc/",
        "text": "\n\n\nHow was luffy over weight but the giants were not for the battle royal",
        "created_utc": 1678065389,
        "upvote_ratio": 1.0
    },
    {
        "title": "Anime skipper Extension (Works on one piece) (date 03/5/2023)",
        "author": "Born_Resolution_4346",
        "url": "https://www.reddit.com/r/OnePiece/comments/11jk01m/anime_skipper_extension_works_on_one_piece_date/",
        "text": "I found a anime skipper that works on one piece and others. it skips  Into , recap, outro, preview. you can customize to what you want to skip.\n\nIts really nice not having to skip into and recap. it just goes strait to the start of the Ep\n\n called Anime Skip Player\n\n [https://chrome.google.com/webstore/detail/anime-skip-player/mgmdkjcljneegjfajchedjpdhbadklcf/related?hl=en-US](https://chrome.google.com/webstore/detail/anime-skip-player/mgmdkjcljneegjfajchedjpdhbadklcf/related?hl=en-US)",
        "created_utc": 1678065196,
        "upvote_ratio": 1.0
    },
    {
        "title": "Asking ChatGPT how One Piece end",
        "author": "Xyaibai",
        "url": "https://i.redd.it/1sa2x44ir0ma1.png",
        "text": "",
        "created_utc": 1678065116,
        "upvote_ratio": 1.0
    },
    {
        "title": "Where new episode ends in manga?",
        "author": "pekuses",
        "url": "https://www.reddit.com/r/OnePiece/comments/11jjsll/where_new_episode_ends_in_manga/",
        "text": "Hello, had enough of slow pacing!",
        "created_utc": 1678064653,
        "upvote_ratio": 1.0
    },
    {
        "title": "Zoro's Asura Form and The Creation of Devil Fruits",
        "author": "TheLastAlbanian",
        "url": "https://www.reddit.com/r/OnePiece/comments/11jjmfw/zoros_asura_form_and_the_creation_of_devil_fruits/",
        "text": "Alright so this might be a bit crackpot but its a kinda interesting idea I had, btw manga spoilers in case you clicked on this by accident or out of curiosity. \n\nSo in the manga Vegapunk explains a theory he has about how devil fruits came into existence, talking about how it was people wills, dreams, imagination, etc. that brought forth devil fruits into reality. This idea was always a little hard for me to fully grasp how it'd work, now obviously there is likely more to devil fruits then this but Zoro's Asura form might be a hint to how this works.\n\nZoro's Asura form has never been fully explained, the closest we got is that he uses conqueror's haki while using it which really ain't much. However, Zoro's Asura form could be a real time example of a devil fruit being willed into existence, like in the distant future of one piece, long after Zoro dies from old age or something, there could be a \"Mythical Zoan Hito Hito no Mi: Model Asura\"",
        "created_utc": 1678064224,
        "upvote_ratio": 1.0
    },
    {
        "title": "What would crocodile have done in this situation?",
        "author": "crixxuz",
        "url": "https://i.redd.it/uex88r63o0ma1.jpg",
        "text": "",
        "created_utc": 1678063981,
        "upvote_ratio": 1.0
    },
    {
        "title": "Oda asked ChatGPT to write a One Piece chapter. Did it inspire recent manga chapters?",
        "author": "Neyubin",
        "url": "https://www.oneesports.gg/anime/one-piece-creator-chatgpt-manga/",
        "text": "The article mentions that the AI wrote a plot with similarities to Among Us. Could this be the inspiration for the current events in the lab? If so, will more of that AI story be used?",
        "created_utc": 1678063490,
        "upvote_ratio": 1.0
    },
    {
        "title": "My Kaido art, stay tuned for more!!",
        "author": "Dorterman",
        "url": "https://i.redd.it/mxpvx3oh32ma1.png",
        "text": "",
        "created_utc": 1678063216,
        "upvote_ratio": 1.0
    },
    {
        "title": "Nami’s father confirmed ( maybe )",
        "author": "MrBushido56",
        "url": "https://www.reddit.com/r/OnePiece/comments/11jj6oy/namis_father_confirmed_maybe/",
        "text": "I know people don’t like the “ this character is actually the child of another character “ trope but to that I say,   Your probably don’t want to read this then as I can argue Morgan is the father of nami.\n\nnow who is nami father.  It’s not someone we know a lot about or seen a lot about……well in his human for but I think nami father is Spencer from the roger pirates.\n\n&amp;#x200B;\n\nhttps://preview.redd.it/9spjkfaevzla1.jpg?width=736&amp;format=pjpg&amp;auto=webp&amp;v=enabled&amp;s=7ecbb21e8df234cb80bc81b2c8dcb9c64909229b\n\nhttps://preview.redd.it/60jozfaevzla1.jpg?width=180&amp;format=pjpg&amp;auto=webp&amp;v=enabled&amp;s=3f4852003ebb667ede8aa836f549001d75e6c717\n\nwell despite the fact he looks like a male nami.\n\n&amp;#x200B;\n\nhttps://preview.redd.it/8wxd00hil0ma1.jpg?width=1920&amp;format=pjpg&amp;auto=webp&amp;v=enabled&amp;s=36314ce9ed51af91eaac47183960d2e1637d072f\n\nthere is another connection, A Spencer is a a navigational tool used on ships.\n\nthere is another connection, A Spencer is a a navigational  gaff rigged sail hoisted in place of a larger mainsail when winds are very high. The trysail provides enough thrust to maintain control of the ship, e.g. to avoid ship damage, and to keep the bow to the wind. It is hoisted abaft (i.e., directly behind) the mainmast (taking the place of the much larger mainsail) or, on a brig, abaft the foremast. A trysail is analogous to a storm jib.”\n\nThere is also another funny parallel.  Spencer is also a word for someone whose job it is to hand out money and provisions it evolved into the word dispenser.  Nami is usually the one who hands out allowances to the crew.\n\nSo Spencer is nami father who cares? Well I say it is important as Spencer has been in our face for quite some time Spencer no longer goes by his name or face and now is better known as….Big News Morgans.\n\n \n\nhttps://preview.redd.it/giy40cxnzzla1.png?width=445&amp;format=png&amp;auto=webp&amp;v=enabled&amp;s=d1a4ceffb1d48254c8d6e949a1a5a6cd7e9d4797\n\nthis is all hinted at in chapter 46.\n\n&amp;#x200B;\n\nhttps://preview.redd.it/la5u726tzzla1.png?width=1620&amp;format=png&amp;auto=webp&amp;v=enabled&amp;s=d5ed9c2d38288a4a87df91ee2326beab762f2db7\n\nin the picture nami is bonding with a albatross/seagull and there is a few things.\n\nFirst off it’s dressed up as a marine which could be a reference to bell-mère nami adoptive mother. ( her name is French for step mother and also mere in Norse means sea )\n\nhowever next to nami is a straw hat on a postal box. This is a reference to Spencer who according to this theory is a roger pirate ( straw hat ) who now commands birds to go around delivering news papers ( postal box )\n\nnow Morgan is also a French name which originated in the Celtic times.\n\nIn Gaelic ( language of Ireland) and france the name Morgan means “ born of the sea ” \n\nnow Morgan is a very stingy character. He’s always chasing a big story and writing it however he wants truth or lie as long as it makes him money, reminds me of nami.\n\n \n\nhttps://preview.redd.it/ikv4h86f50ma1.jpg?width=640&amp;format=pjpg&amp;auto=webp&amp;v=enabled&amp;s=f080e317fe44802f93a627fbf032204736e78b80\n\nhowever nami and morgan are not so greedy when it comes to what is really important.\n\nIn sabaody nami was willing to part with all her money to save camie no question only to be instantly out bid by a celestial dragon before eve making an offer.\n\nas for Morgan he is greedy and a liar  but he has his pride as a journalist like when he refused a check in order to publish a story and apparently the bribe was big.\n\n&amp;#x200B;\n\nhttps://preview.redd.it/jhk9vm5l60ma1.png?width=1620&amp;format=png&amp;auto=webp&amp;v=enabled&amp;s=89b9c83495e7099f3787ffc00be60a277ad4450c\n\nnami and Morgans are also a lot stronger than they look while probably not the strongest person there is he did knock out a cp agent.\n\n&amp;#x200B;\n\nhttps://preview.redd.it/2275cr3z60ma1.jpg?width=1125&amp;format=pjpg&amp;auto=webp&amp;v=enabled&amp;s=826c62574fdb69ee132285b2d4a178d63f797400\n\nhttps://preview.redd.it/yr8swr3z60ma1.jpg?width=1280&amp;format=pjpg&amp;auto=webp&amp;v=enabled&amp;s=de6b17ccc7e44664a012387b6647b3a1402ace66\n\nmorgans also seems to be well loved by his workers showing that he must be a good boss to work for and treats his staff with respect while demanding hard work.\n\nNow Morgans is always in his hybrid form which is odd as we never see anyone do that except for chopper who really just does it for merchandise. So I think the reason Morgans is always in hybrid form is oda way of telling us that his human form is important and there is a reason he can’t reveal it.\n\nmorgan is also a albatross user and albatrosses and seagulls are sea birds and also navigational birds.  Sailors lost at sea would use the seagul or albatross as a sign they are near land and would follow them until they brought them back to land.\n\n  \nanother interesting detail is that nami is connected to the news paper. Besides the last bounty update when it was robin who read the paper, ( probably because nami would mention Koby and robin for some reason tends not to share important information unless asked ) nami is always the one who reads out the news \n\nhttps://preview.redd.it/7tj7vfeck0ma1.jpg?width=1024&amp;format=pjpg&amp;auto=webp&amp;v=enabled&amp;s=60edcd7dad2d865306920cc40c5c7d947e56a5d6\n\nhttps://preview.redd.it/orv9kfeck0ma1.jpg?width=2048&amp;format=pjpg&amp;auto=webp&amp;v=enabled&amp;s=a387a58221b36f4140e449c89d489071180d95c4\n\nhttps://preview.redd.it/93fj0geck0ma1.png?width=1366&amp;format=png&amp;auto=webp&amp;v=enabled&amp;s=bcf4f503890b34bf3544f0505f4e3b4f3d9c5c8e\n\nAnd in chapter 96 we see her arguing with a albatross and threatening it for the outrages price it was asking for the news paper which was 100 berri which if in yen would be 0.69 cent in euro or 0.74 cent in dollar,  demonstrating how much of a SCROOGE! nami was.\n\n&amp;#x200B;\n\nhttps://preview.redd.it/ozf18cfwk0ma1.png?width=1620&amp;format=png&amp;auto=webp&amp;v=enabled&amp;s=91d99bc9f689750a3eae4499798d872023da2769\n\n&amp;#x200B;\n\nnow I believe morgans has been helping Luffy in his own way for some time. Maybe not helping him but using luffy as a means of passing on a message to the world because something that is odd is that luffy bounty has the D in it.\n\n&amp;#x200B;\n\nhttps://preview.redd.it/unwudj7v80ma1.jpg?width=2480&amp;format=pjpg&amp;auto=webp&amp;v=enabled&amp;s=6b2c13e193d31d9db4453fccb4cca99e7e8f9561\n\nthis is odd as we are told that rogers bounty poster was gold roger not gol D roger.\n\nNow as for as I am aware we never seen blackbeards Poster in tact which might mean luffy is the only one with the D in his poster as we know laws poster Misses it and I believe Kid is a D,  shanks and kaido might also be D clan but their posters are just shanks and kaido no family name.\n\nPerhaps someone who works with the news published this to correct what happened to roger who didn’t really like being called Gold roger.\n\nMorgans seems to take a special interest in the supernova believing they have the potential to become pirate king\n\n&amp;#x200B;\n\nhttps://preview.redd.it/tstt0a5ac0ma1.jpg?width=480&amp;format=pjpg&amp;auto=webp&amp;v=enabled&amp;s=e038ea495f0056e021861d5a9d6644d78b5744aa\n\nhe is making sure the world sees them but also makes sure the world sees luffy in particular.  Now he did recently publish a story that make it look like luffy kidnapped vegapunk so thats not very helpful but I never said he was trying to make luffy look good but also he did say this will make the wg happy so perhaps he is trying to get back in their good graces after beating up a agent and publishing a story that made them look bad.\n\nbut to prove his also not all bad for some reason he agreed to help vivi and is hiding her on his ship. \n\n \n\nhttps://preview.redd.it/x9uhgcb9d0ma1.png?width=1620&amp;format=png&amp;auto=webp&amp;v=enabled&amp;s=872d6c48d51c6ea19b5529c264bc827b3f8387f8\n\nhttps://preview.redd.it/nueotdb9d0ma1.png?width=1620&amp;format=png&amp;auto=webp&amp;v=enabled&amp;s=a1b3364d677c5bef48f785c037109988f29947a7\n\nso Morgan is a former roger pirate and father to nami.\n\nNow is he just a bad father not trying to reach out to his daughter well maybe he is an absentee father that does seem to be the default setting however keep in mind Morgan should believe nami is dead. the island Oykot where she is from was attacked about 20 years ago and nami was taken by bell-mére and probably renamed since now would she know nami real name.  So there really isn’t any reason to even suspect nami is his daughter and yes as a journalist he could probably investigate but what would be his motivation to think she is his daughter after all these years just cause she is what ? Orange haired  ?\n\nwe to this day do not know nami real name.\n\nNow I mentioned Morgan is Celtic/ french for born of the sea right well this is important.\n\nIn the recent sbs which is what led me to chapter 49 which got me suspicious of nami being Morgan daughter which was a theory i nearly gave up on.\n\nnow in the recent sbs it was revealed zoro mother name is Terra which means earth in several languages.\n\n&amp;#x200B;\n\nhttps://preview.redd.it/tnakrh36h0ma1.jpg?width=1400&amp;format=pjpg&amp;auto=webp&amp;v=enabled&amp;s=f05eac2d77ade02c439c9fcee2a2f9b218ee2e0c\n\nthis is relevant because sanji mother is named sora which means sky.\n\nnami means wavein Japanese and Morgan means born of the sea   \nso nami name would be Morgans nami unless her real name is morgans umi.\n\numi means sea in Japanese.\n\nnow this is interesting.\n\nluffy is the sun god. Maybe his mother name is solar.\n\nzoro is the son of earth\n\nsanji is the son of the sky \n\nnami is the daughter of the sea.\n\nthe missing piece is ussop. We don’t know his full name,  it’s believed he’s a Mont Blanc but we don’t know his actual name as if he was a Mont blanc he would have said something about it so it’s probably a name his family doesn’t go by anyway.\n\nanyway I believe ussop following this theme is the moon to the group.  After all the moon reflects the light from the sun and that can be said of ussop who often shines thanks to luffy.\n\nIn chapter 96 the same chapter we see nami reading the newspaper and threatening the albatross luffy gets his first bounty and can see ussop in the background.\n\n&amp;#x200B;\n\nhttps://preview.redd.it/l546gzlcj0ma1.png?width=1620&amp;format=png&amp;auto=webp&amp;v=enabled&amp;s=94a32a949577954f9849584e40f2cbfd33eace03\n\nso again that’s luffy =sun\n\nzoro = earth\n\nsanji = sky\n\nnami = the sea \n\nussop = the moon.\n\nthe east blue 5.\n\nluffy and his true 4 commanders ( sorry jinbei )  \n\n&amp;#x200B;\n\nhttps://preview.redd.it/5momhefcl0ma1.jpg?width=1200&amp;format=pjpg&amp;auto=webp&amp;v=enabled&amp;s=e2f0aa76e886acaac1cf5ee675c79fae8a812227",
        "created_utc": 1678063077,
        "upvote_ratio": 1.0
    },
    {
        "title": "The advantages Enel has if he returns for the final saga",
        "author": "NewBrightness",
        "url": "https://i.redd.it/kka00viq22ma1.jpg",
        "text": "",
        "created_utc": 1678062963,
        "upvote_ratio": 1.0
    },
    {
        "title": "Who is a character you are convinced people only like as a meme?",
        "author": "C-C93",
        "url": "https://i.redd.it/cuz1oyfz12ma1.jpg",
        "text": "",
        "created_utc": 1678062710,
        "upvote_ratio": 1.0
    },
    {
        "title": "Do you remember these Legendary moments? :P",
        "author": "Roguec",
        "url": "https://www.youtube.com/watch?v=BtfLSNmzaPg&amp;ab_channel=Animeverse",
        "text": "",
        "created_utc": 1678061889,
        "upvote_ratio": 1.0
    },
    {
        "title": "Has anyone actually asked Oda in the SBS, what Luffy’s moms name is rather than asking who she is straight up?",
        "author": "Pingolette",
        "url": "https://www.reddit.com/r/OnePiece/comments/11jiol5/has_anyone_actually_asked_oda_in_the_sbs_what/",
        "text": "From what i’ve seen if she really is such an instrumental part of the story of it would make sense that Imu or someone high up in the world either gov. or revolutionary could actually be his mother. If not why not tell us her actual name just like Zoro’s mom and dad were introduced to us in the sbs.",
        "created_utc": 1678061789,
        "upvote_ratio": 1.0
    },
    {
        "title": "about to start! how much filler is in op and should i skip?",
        "author": "donaldgloversintern",
        "url": "https://www.reddit.com/r/OnePiece/comments/11jikme/about_to_start_how_much_filler_is_in_op_and/",
        "text": "i know shows with great filler, so im just gonna go off what yall say lmao",
        "created_utc": 1678061509,
        "upvote_ratio": 1.0
    },
    {
        "title": "Origin of Luffy’s fruit.",
        "author": "Consistent_Opinion_5",
        "url": "https://www.reddit.com/r/OnePiece/comments/11jiip5/origin_of_luffys_fruit/",
        "text": "It is speculated that devil fruits were created in honor of the will and desires of people in the One Piece world. But that was a long time ago, because as far as we know this is no longer possible. I think this was still possible during Joyboy’s era (~900 years ago). Joyboy’s wish was to be a rubber man, but a rubber-fruit was not brought in to existence. Not enough people had the desire to be made out of rubber. So Joyboy created this completely made-up character named Nika, a rubber man. He made enough people believe that Nika was the sun god, and so the desire to become Nika was growing. Eventually the Hito-Hito no mi model: Nika was born. Joyboy ended up eating this fruit and became a rubber man. The end :)",
        "created_utc": 1678061377,
        "upvote_ratio": 1.0
    },
    {
        "title": "Kuma's introduction into the story might have given us the reveal of his backstory without us ever knowing it. (Chapter 1076+)",
        "author": "HokageEzio",
        "url": "https://www.reddit.com/r/OnePiece/comments/11jihiu/kumas_introduction_into_the_story_might_have/",
        "text": "Here's a fun tie of two characters who may be more involved in each other's pasts than we thought.  Maybe its been brought up before since the chapter came out, but I haven't seen it.\n\nWith the confirmed reveal that Kuma was a slave, the thing that comes to mind for me is how he was actually introduced into the story and how long Oda actually planned the outline of his backstory.  Kuma is introduced at the same time as Doflamingo, directly tying a Celestial Dragon and a slave of the Celestials together.\n\n&amp;#x200B;\n\nhttps://preview.redd.it/7dbsa3o670ma1.png?width=1280&amp;format=png&amp;auto=webp&amp;v=enabled&amp;s=7919b1dba232a74ed8116d0436eb91626d1315ed\n\nThis connection between the two of them with hindsight sticks out as very noteworthy.  But it also begs the question; how did Kuma go from being beaten by fellow slaves to return home to becoming King of an entire nation in Sorbet Kingdom.  That's a pretty incredible rise to power.\n\n&amp;#x200B;\n\nhttps://preview.redd.it/darixlifa0ma1.png?width=784&amp;format=png&amp;auto=webp&amp;v=enabled&amp;s=4379d894e8ad67e767bfac4971c7543648d1ae73\n\nWhat if Kuma and Doffy have closer ties than we thought?  What if Kuma was actually a slave of the Donquixote family?  And the reason Kuma was no longer a slave is because Homing freed all of his slaves when he left the Holy Land.  Kuma would have been 14 at this point and Doflamingo would have been 8.  \n\n&amp;#x200B;\n\nhttps://preview.redd.it/aaaut524b0ma1.png?width=1066&amp;format=png&amp;auto=webp&amp;v=enabled&amp;s=54d138a75636ac38ec8ed596a03b5a5efa7215f7\n\nSo again, how did Kuma become King of a nation from life as a slave?  Well what if he didn't join a nation.  What if he created one?\n\nOda has given us a drawing of Kuma (and all the Shichibukai) as children.  Kuma is in tattered clothes carrying wood and a book that says Ninokin.\n\n&amp;#x200B;\n\nhttps://preview.redd.it/gxf8h5cgc0ma1.png?width=318&amp;format=png&amp;auto=webp&amp;v=enabled&amp;s=57ff5e104d12f6fc71f97303f644093c8305620c\n\nNinokin in all likelihood refers to [Ninomiya Sontoku, or Ninomiya Kinjiro.](https://en.wikipedia.org/wiki/Ninomiya_Sontoku)  Stop me if this sounds like it might mean something with context to One Piece and Kuma.\n\n&gt;Ninomiya Sontoku was born to a poor peasant family with a name of Kinjiro in Kayama (栢山), Ashigarakami-gun, Sagami province. His father died when he was 14 and his mother died two years later. He was then placed in his uncle's household.  \n&gt;  \n&gt;While working on his uncle's land, Sontoku studied on his own. He later obtained abandoned land on his own and transformed it into agricultural land, eventually restoring his household on his own at the age of 20. He achieved considerable wealth as a landlord while in his 20s. He was then recruited to run a small feudal district which was facing considerable financial difficulty. He achieved this by reviving the local economy, particularly through agricultural development. The daimyō, hearing of his achievement, eventually recruited Sontoku to run Odawara Domain then Sagami Province.  \n&gt;  \n&gt; It is said that during his administration a famine struck Odawara. Sontoku proposed opening up the public granaries to feed the starving populace. He was opposed by his fellow bureaucrats who reminded him that permission had to be granted by the shōgun for commoners to have access to the rice stores. In that case, Sontoku replied, no one, including the bureaucrats, could eat the public rice before getting the shōgun's approval. They quickly changed their minds and decided that, since it was an emergency, the people should be fed immediately. He was eventually entrusted with one of the shogunate's estates, which was a great honor for someone of his low origin. \n\nSo put it all together and tie it back to One Piece.\n\n* Kuma was a Donquixote slave that was released at 14 when Homing left the Holy Land\n* He built up Sorbet Kingdom, named after the ingredients which would be the agricultural land Kuma founded\n* Maybe Kuma refused to pay the Heavenly Tribute, needing that money to support the land through a famine\n* The World Government turned that refusal into an explanation for why the country was in a famine, pinning the entire thing on Kuma\n\nAnd just to tie it all back to Doflamingo, how did Doflamingo become a Warlord?  By attacking Heavenly Tribute ships 10 years ago.\n\n&amp;#x200B;\n\nhttps://preview.redd.it/xnn29hjef0ma1.png?width=1066&amp;format=png&amp;auto=webp&amp;v=enabled&amp;s=306ddc2d979d757b570a2830d2903169794bc41a\n\nI could be missing on some details here, but I really think there's some substance to this and how Kuma could have gone from being a slave to being a King.  Let me know what you think.",
        "created_utc": 1678061293,
        "upvote_ratio": 1.0
    },
    {
        "title": "My Fan Cast of One Piece",
        "author": "SilentWolfKills",
        "url": "https://www.reddit.com/gallery/11jib32",
        "text": "",
        "created_utc": 1678060857,
        "upvote_ratio": 1.0
    },
    {
        "title": "Katakuri❤️",
        "author": "Creepy-Sun5515",
        "url": "https://www.reddit.com/gallery/11jia8o",
        "text": "",
        "created_utc": 1678060804,
        "upvote_ratio": 1.0
    },
    {
        "title": "Yamato’s mom is…",
        "author": "GeneralJollyRancher",
        "url": "https://www.reddit.com/r/OnePiece/comments/11jhxs8/yamatos_mom_is/",
        "text": "Kurozomi Higurashi. She has a similar hair color scheme to Yamato and was presumely out of Wano with Kaido/Rox pirates for years. As to why Kaido would smash her, she had the clone clone fruit so she could’ve just turned into someone attractive before Kaido hit fr",
        "created_utc": 1678059919,
        "upvote_ratio": 1.0
    },
    {
        "title": "Rating one piece arcs that I've see (I'm half way through dressrosa)",
        "author": "Unevenplate7",
        "url": "https://i.redd.it/bhp170u4s1ma1.png",
        "text": "",
        "created_utc": 1678059401,
        "upvote_ratio": 1.0
    },
    {
        "title": "Turns out I’m luffys mom",
        "author": "Salty_Cook_1907",
        "url": "https://i.redd.it/3f62m0k5r1ma1.jpg",
        "text": "",
        "created_utc": 1678059068,
        "upvote_ratio": 1.0
    },
    {
        "title": "Nico Robin's demon form doesn't make sense?!!",
        "author": "JohnnyKax",
        "url": "https://www.reddit.com/r/OnePiece/comments/11jhcm9/nico_robins_demon_form_doesnt_make_sense/",
        "text": "So given that she ate the Hana Hana no mi (Flower-Flower fruit), I thought her fruit gave her the ability to blossom parts of her body elsewhere as we've seen before with her arms, legs etc. \n\nBut now she can produce horns and wings?!!!\n\nI imagine she does this by using multiple arms to produce the wings as we've seen before and she could've done this with the horns too. But does this mean she can now create anything she likes just by merging multiple arms together?",
        "created_utc": 1678058481,
        "upvote_ratio": 1.0
    },
    {
        "title": "Stussy under the beautiful night sky (by achmunzav)",
        "author": "electricmastro",
        "url": "https://www.instagram.com/achmunzav/",
        "text": "",
        "created_utc": 1678056513,
        "upvote_ratio": 1.0
    },
    {
        "title": "Question !",
        "author": "Affectionate-Ad5242",
        "url": "https://www.reddit.com/r/OnePiece/comments/11jgbzx/question/",
        "text": "Just finished ep 1053 is there any new episodes after that ? Luffy hasn’t even defeated Kaido yet",
        "created_utc": 1678056112,
        "upvote_ratio": 1.0
    },
    {
        "title": "Walk with me on this theory im having about Zoro and the path he is on currently but it was set in motion on TB.#zoro #theory #pain #luffy #kuma #ryumaa #oda #onepiece #idea #thrillerbark",
        "author": "Vaderface90s",
        "url": "https://www.tiktok.com/t/ZTRWPh5Sy/",
        "text": "",
        "created_utc": 1678055626,
        "upvote_ratio": 1.0
    },
    {
        "title": "(Manga Spoilers) Robocop",
        "author": "ecass305",
        "url": "https://www.reddit.com/r/OnePiece/comments/11jg4ft/manga_spoilers_robocop/",
        "text": "&amp;#x200B;\n\nhttps://preview.redd.it/f78xmqxoozla1.png?width=540&amp;format=png&amp;auto=webp&amp;v=enabled&amp;s=2463a5d8b827026c94c792fbcb1b245408d9c65a\n\nVegapunk confirmed that someone leaked his Poneglyph research which led to him being targeted for assassination. It is the reason for the visits from Cipher Pol, they were investigating him. I thought it was the opposite that the disappearance Cipher Pol agents to draw suspicion against Vegapunk.\n\nhttps://preview.redd.it/xtjo0bpqozla1.png?width=486&amp;format=png&amp;auto=webp&amp;v=enabled&amp;s=d5deb82557c7db2460d8b968e30b2212075694a1\n\nI believe the person behind this is PX-1, presumably the first clone of Kuma that Vegapunk created. One reason to go after Vegapunk would be for a grudge. And the people he experimented most likely would have one against him. Kuma sent him to unknown location and his status is unknown.\n\nhttps://preview.redd.it/3frqupqtozla1.png?width=451&amp;format=png&amp;auto=webp&amp;v=enabled&amp;s=97ffd0130b4bc07c9d2e137cc9ea17cdc481fa20\n\nThe first successful clone Vegapunk created, Stussy, made a appearance. It would be interesting juxtaposition since one clone he gave free will and other he took away. \n\nhttps://preview.redd.it/le9u8zbvozla1.png?width=285&amp;format=png&amp;auto=webp&amp;v=enabled&amp;s=466c4516335cbc426a8bd96e556c3423c6830f03\n\nKuma has the reputation of being a vicious pirate. This brutal side of him hasn't been seen and all of his loved ones vouch for him as kind, good person. But with Bonney she specifically said he wasn't an evil king nothing of him as a pirate.\n\nhttps://preview.redd.it/t6yo3n3xozla1.png?width=221&amp;format=png&amp;auto=webp&amp;v=enabled&amp;s=66ccbc51285b67a5871c5d37dd9b700ee25fac0f\n\nWith Kuma's traumatic childhood it's not hard to see how he could of become vicious as an adult. I think maybe we will see this brutal side through one of his clones, PX-1.\n\nhttps://preview.redd.it/da3vbykyozla1.png?width=507&amp;format=png&amp;auto=webp&amp;v=enabled&amp;s=d72f39ff20337c9ddc411b798e98ed51751fc6ca\n\nPythagoras speculated that bloodline elements record an individual's experiences. Which makes be believe that it is possible that Kuma's clones have his memories.\n\nhttps://preview.redd.it/bx05xlf0pzla1.png?width=540&amp;format=png&amp;auto=webp&amp;v=enabled&amp;s=802ec7cb505402fd6f059b5b6193cda5c16d8e2d\n\nAtlas revealed that she can alter her appearance and body however she wants. She states that is the future is like.\n\nhttps://preview.redd.it/r964f6y5uzla1.png?width=521&amp;format=png&amp;auto=webp&amp;v=enabled&amp;s=9e1861419dfbc080ac8a5ac8a1c1f7cce0992d23\n\nIt seems like that is the case for NPCS we see on Egghead. Some of them look like cyborgs.\n\nhttps://preview.redd.it/p3tsdzbouzla1.png?width=270&amp;format=png&amp;auto=webp&amp;v=enabled&amp;s=a6636bf885b289fda6710de2c9667449af93d9a4\n\nI think PX-1 altered his appearance and is the police guard that Luffy and co. ran into. This guard is only seen once and hasn't shown up even though Egghead was attacked.\n\nhttps://preview.redd.it/o7qngla3pzla1.png?width=271&amp;format=png&amp;auto=webp&amp;v=enabled&amp;s=c2466dc33f4dc56ba4593a80c838fd28e29e2b01\n\nStella got a glimpse of the perpetration and he doesn't look like a Pacifista. But Oda's silhouettes aren't always accurate.\n\nhttps://preview.redd.it/d5gi40qbszla1.png?width=402&amp;format=png&amp;auto=webp&amp;v=enabled&amp;s=25949eadf461ed56214165d3d1516705f7960236\n\nThis isn't a hot take but Kuma always reminded me of the Tin Man.\n\nhttps://preview.redd.it/ppd2x8scszla1.png?width=540&amp;format=png&amp;auto=webp&amp;v=enabled&amp;s=62e51ab9f58260800e64853e7de56c2af15a1b67\n\nIt was mentioned that one mythical place is the Emerald City which is from the Wizard of Oz. Maybe Kuma sent PX-1 to Emerald City and he found his humanity.",
        "created_utc": 1678055612,
        "upvote_ratio": 1.0
    },
    {
        "title": "The supernovas",
        "author": "Nymaaa",
        "url": "https://i.redd.it/35lu5wzig1ma1.jpg",
        "text": "",
        "created_utc": 1678055495,
        "upvote_ratio": 1.0
    },
    {
        "title": "I wish dials made a comeback",
        "author": "YaBoiWheelz",
        "url": "https://www.reddit.com/r/OnePiece/comments/11jg0k5/i_wish_dials_made_a_comeback/",
        "text": "They probably wouldn’t be that useful in the new world but they were such a cool wordbuilding tool. Plus I feel like Ussop could still have plenty of uses for it, maybe even using jet dials to fly around and whatnot.",
        "created_utc": 1678055363,
        "upvote_ratio": 1.0
    },
    {
        "title": "Who dethroned the Germa 66 after they conquered the North Blue 300 years ago?",
        "author": "Southeasternengineer",
        "url": "https://www.reddit.com/r/OnePiece/comments/11jfzbf/who_dethroned_the_germa_66_after_they_conquered/",
        "text": "66 days after they established the Germa Empire someone took them down mentioned in chapter 871 page 10. \n\nI can’t find any mention of who actually defeated them. \n\nAt first I thought it could be the WG, but then I questioned why they would be recognized as a “member state of the world government” mentioned in chapter 839 page 2/3 (fun fact Judge mentions that he suspects the WG will revoke their right to attend the Reverie and then in chapter 904 dragon confirms Germa gets booted out of the WG, Goda at it again jfc).\n\nIt may not be important in the grand scheme of things or it couldn’t be one of those details that Oda is intentionally hiding just to bring it back up down the road.",
        "created_utc": 1678055274,
        "upvote_ratio": 1.0
    },
    {
        "title": "Better ship",
        "author": "Ok_Belt6570",
        "url": "https://www.reddit.com/r/OnePiece/comments/11jftak/better_ship/",
        "text": "Robin x Zoro or Franky and Robin",
        "created_utc": 1678054874,
        "upvote_ratio": 1.0
    },
    {
        "title": "Manga Peeps- When did you start reading weekly and what whacky theories do you remember?",
        "author": "TheAntiConCreeper",
        "url": "https://www.reddit.com/r/OnePiece/comments/11jfqnf/manga_peeps_when_did_you_start_reading_weekly_and/",
        "text": "For me I jumped on at the end of Dressrosa/start of Zou. \n\nI remember Zou being considered the best arc until Revere. Lots of theories came from that arc.",
        "created_utc": 1678054699,
        "upvote_ratio": 1.0
    },
    {
        "title": "own fanart 😈✨️",
        "author": "Deruu_20",
        "url": "https://i.redd.it/q6twi3msd1ma1.png",
        "text": "",
        "created_utc": 1678054588,
        "upvote_ratio": 1.0
    },
    {
        "title": "Hello guys , my name is Gio and i am a digital artist 🎨 I wanted to show you One Piece related custom portrait of my friend 🎴 What do you guys think about it ?!",
        "author": "r-gqobalia",
        "url": "https://i.redd.it/fionqmkduzla1.jpg",
        "text": "",
        "created_utc": 1678053986,
        "upvote_ratio": 1.0
    },
    {
        "title": "I legit wanna change my middle name to D",
        "author": "Immediate-Opposite88",
        "url": "https://www.reddit.com/r/OnePiece/comments/11jfesw/i_legit_wanna_change_my_middle_name_to_d/",
        "text": "So my dad gave me 2 names and my mom gave me 2 so i got 2 first names and 1 middle and 1 last. And my dads names which is a first name and middle name, are horrible and want to change it someday. So i wanna remove one of the first names and change my middle name to D. But like is that too stupid?",
        "created_utc": 1678053925,
        "upvote_ratio": 1.0
    },
    {
        "title": "Presidents discussing OP arcs",
        "author": "mittwoch_macher",
        "url": "https://www.reddit.com/r/OnePiece/comments/11jf8ha/presidents_discussing_op_arcs/",
        "text": "Hey people, found this video of AI voice clones of Biden, Trump, and Obama discussing OP arcs. Can't stop laughing 😂\n\n[https://www.youtube.com/watch?v=QPsH0ksx4jk](https://www.youtube.com/watch?v=QPsH0ksx4jk)",
        "created_utc": 1678053538,
        "upvote_ratio": 1.0
    },
    {
        "title": "I'm so tired of Queen.",
        "author": "StriderSkeith",
        "url": "https://www.reddit.com/r/OnePiece/comments/11jf0rk/im_so_tired_of_queen/",
        "text": "I just recently caught up to the last bunch of One Piece episodes but I'm so burnt out on this character specifically. Like holy shit man I get that he's supposed to be tough and sturdy being so big and having mechanical parts but I'm so tired of this character getting knocked down over and over without a single scratch on him like this is just ridiculous and we also spend so much time with him, I just wanna know, am I the only one who feels this way?",
        "created_utc": 1678053039,
        "upvote_ratio": 1.0
    },
    {
        "title": "garp vs blackbeard",
        "author": "No-Pineapple1560",
        "url": "https://www.reddit.com/r/OnePiece/comments/11jet4b/garp_vs_blackbeard/",
        "text": "I know garp is old and past his prime...but unlike rayleigh I feel he's in more shape for the fact he's still been somewhat active this whole time...plus he's literally a perfect counter go blackbeard he doesn't have a devil fruit...but I do feel like blackbeard will try some cheap tricks or with his crew being there garp will be severely outnumbered...and if blackbeard causes garp death I feel like will see a unhinged blood thirsty luffy well that's what I hope but prolly won't happen since luffy doesn't kill",
        "created_utc": 1678052561,
        "upvote_ratio": 1.0
    },
    {
        "title": "A Scientific Way of Finding Luffy’s Mum",
        "author": "TheMaskedDeuce",
        "url": "https://www.reddit.com/gallery/11jerle",
        "text": "",
        "created_utc": 1678052462,
        "upvote_ratio": 1.0
    }
]