[
    {
        "title": "STOP MAKING IT WEIRD WITH S-snake!",
        "author": "piece3",
        "url": "https://www.reddit.com/r/OnePiece/comments/11or30b/stop_making_it_weird_with_ssnake/",
        "text": "[removed]",
        "created_utc": 1678558950,
        "upvote_ratio": 1.0
    },
    {
        "title": "Settling an argument. Who do you think the main antagonist of One Piece will be?",
        "author": "Putrid_Slice_6367",
        "url": "https://www.reddit.com/r/OnePiece/comments/11or0t0/settling_an_argument_who_do_you_think_the_main/",
        "text": "Please only pick 1 person. If you think there's multiple main antagonist, say which one you think will be fought last.",
        "created_utc": 1678558808,
        "upvote_ratio": 1.0
    },
    {
        "title": "Who do you realistically think would be the final hurdle to Luffy that he will overcome on his own, according to Oda's writing Style.",
        "author": "sanscipher435",
        "url": "https://i.imgur.com/MypSXDs.jpg",
        "text": "",
        "created_utc": 1678558786,
        "upvote_ratio": 1.0
    },
    {
        "title": "Family Piece",
        "author": "Orm-Bot",
        "url": "https://i.redd.it/c4l8t33u07na1.jpg",
        "text": "",
        "created_utc": 1678558706,
        "upvote_ratio": 1.0
    },
    {
        "title": "chain chain fruit",
        "author": "This_Bumblebee7301",
        "url": "https://www.reddit.com/r/OnePiece/comments/11oqy14/chain_chain_fruit/",
        "text": "this is a fruit kinda like gum gum fruit but with chains i made this for a oc with 2 devil fruits",
        "created_utc": 1678558614,
        "upvote_ratio": 1.0
    },
    {
        "title": "Buggy's true strength",
        "author": "Kariusol",
        "url": "https://www.reddit.com/r/OnePiece/comments/11oqutl/buggys_true_strength/",
        "text": "Honestly with all the developments in one piece and taking a closer at buggy, I feel that buggy is quite strong. With his op luck, decent devil fruit ( bara bara no mi) I feel in actual combat, buggy would be able to beat at least marine captains and at best rear admirals such as smoker. With him collabing with Mihawk and crocodile, it's quite amazing he's seen as   without injuries and not dead knowing knowing both of them. Haki swords seem to have no affect on buggy as Mihawk's sword is a black sword and constantly clad in Haki, which had no effect on buggy during marineford. His combat prowess is still unknown due to our lack of information of the type of haki he possesses. But based on what information we have, I believe he should be quite decently strong.  What do you guys think?? Also Buggy Bomb big boom",
        "created_utc": 1678558407,
        "upvote_ratio": 1.0
    },
    {
        "title": "Tell me who u think the traitor is nd i'll judge your theory",
        "author": "IDK_Anymore_o7",
        "url": "https://www.reddit.com/r/OnePiece/comments/11oqsm1/tell_me_who_u_think_the_traitor_is_nd_ill_judge/",
        "text": "Put your thoughts down in the comments",
        "created_utc": 1678558252,
        "upvote_ratio": 1.0
    },
    {
        "title": "if one piece was made in india 🔥",
        "author": "SINOFPRIDE11",
        "url": "https://v.redd.it/sxjy90ngh5na1",
        "text": "",
        "created_utc": 1678558088,
        "upvote_ratio": 1.0
    },
    {
        "title": "What's the deal with Caribou?",
        "author": "Luffytheeternalking",
        "url": "https://www.reddit.com/r/OnePiece/comments/11oqpm3/whats_the_deal_with_caribou/",
        "text": "I was rereading the manga and in Chapter 652 in Fishman Island Arc, caribou says that if he divulges the Shirahoshi-Poseidon thing along with the treasure he stole from the Royal treasury, he'll probably gain points with you-know-who. \n\n He got to Egghead island with strawhats and was told to get lost. He's missing from the scene and from Fishman island, we saw he's upto no good whenever he's off screen. \n\nSo any guessess about who's this you-know-who? Is he someone relevant to the current arc probably? Or was it already revealed and I missed it?",
        "created_utc": 1678558053,
        "upvote_ratio": 1.0
    },
    {
        "title": "Boa Hancock’s devil fruit",
        "author": "Dieingfish",
        "url": "https://www.reddit.com/r/OnePiece/comments/11oqn8y/boa_hancocks_devil_fruit/",
        "text": "The Mero Mero no Mi Is without question, a very strong devil fruit. What are the theories or predictions of the fruits power when awakened?",
        "created_utc": 1678557887,
        "upvote_ratio": 1.0
    },
    {
        "title": "Are episodes 54-60 important",
        "author": "Asleep_Today581",
        "url": "https://www.reddit.com/r/OnePiece/comments/11oqia1/are_episodes_5460_important/",
        "text": "Are those episodes important i know that they are filler but they look like are important can somebody tell me please?",
        "created_utc": 1678557566,
        "upvote_ratio": 1.0
    },
    {
        "title": "Just wanted to share my one piece shelf😤",
        "author": "Unable-Employee8292",
        "url": "https://i.redd.it/ys4nhe5fx6na1.jpg",
        "text": "",
        "created_utc": 1678557559,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why does one peice sound design suck",
        "author": "darklimeade",
        "url": "https://www.reddit.com/r/OnePiece/comments/11oqegr/why_does_one_peice_sound_design_suck/",
        "text": "Why is it that all fight scenes that look extremely intense or engaging are riddled with what seems like stock sounds and low quality noises. For example zoro vs killer was an extremely graphic and compelling display of animation. But the sound design almost never matches the energy the animation creates. It’s always underwhelming squish sounds -_-",
        "created_utc": 1678557307,
        "upvote_ratio": 1.0
    },
    {
        "title": "I’m currently working on a realistic Doflamingo portrait! It’s really coming together in my opinion!",
        "author": "FranlyG",
        "url": "https://i.redd.it/fsw14il3w6na1.jpg",
        "text": "",
        "created_utc": 1678557114,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is there any creator that has created more Waifus than Oda?",
        "author": "Daxivarga",
        "url": "https://www.reddit.com/r/OnePiece/comments/11oqbej/is_there_any_creator_that_has_created_more_waifus/",
        "text": "Can't think of anyone else with more waifus under their belt",
        "created_utc": 1678557085,
        "upvote_ratio": 1.0
    },
    {
        "title": "I’m working on a realistic Doflamingo currently! Really happy how it’s coming together!",
        "author": "FranlyG",
        "url": "https://i.redd.it/teikp7cav6na1.jpg",
        "text": "",
        "created_utc": 1678556840,
        "upvote_ratio": 1.0
    },
    {
        "title": "Day 2 of my girlfriend making crochet plushies - Zoro",
        "author": "pharmaslaveb",
        "url": "https://i.redd.it/zgqi2hi6v6na1.jpg",
        "text": "",
        "created_utc": 1678556818,
        "upvote_ratio": 1.0
    },
    {
        "title": "I created Chopper in Soulcalibur VI",
        "author": "illahstrait",
        "url": "https://i.redd.it/tt7h1ymsu6na1.png",
        "text": "",
        "created_utc": 1678556694,
        "upvote_ratio": 1.0
    },
    {
        "title": "If shanks dies, who do you think he'd die to?",
        "author": "3sperr",
        "url": "https://www.reddit.com/r/OnePiece/comments/11oq5au/if_shanks_dies_who_do_you_think_hed_die_to/",
        "text": "Blackbeard isnt strong enough yet. But I feel like shanks is gonna die later on in the series",
        "created_utc": 1678556663,
        "upvote_ratio": 1.0
    },
    {
        "title": "I was surprised from Luffy",
        "author": "NightFury-_-_-_-",
        "url": "https://v.redd.it/443rqzdbc5na1",
        "text": "",
        "created_utc": 1678556468,
        "upvote_ratio": 1.0
    },
    {
        "title": "Buggy-bomb",
        "author": "DracoBorne",
        "url": "https://www.reddit.com/r/OnePiece/comments/11oq0ih/buggybomb/",
        "text": "Is the buggy bomb more powerful than the cannonball that Crocodile had to blow up the palace?",
        "created_utc": 1678556326,
        "upvote_ratio": 1.0
    },
    {
        "title": "My Manga Collection",
        "author": "walkthedragon",
        "url": "https://i.imgur.com/BrVDd7z.jpg",
        "text": "",
        "created_utc": 1678556047,
        "upvote_ratio": 1.0
    },
    {
        "title": "Who is this? Chapter 910, page 4",
        "author": "Early-Solid-4724",
        "url": "https://www.reddit.com/gallery/11opudr",
        "text": "",
        "created_utc": 1678555905,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does anyone know how i can get a one piece batch download. maybe a in a zip file",
        "author": "Katebejay",
        "url": "https://www.reddit.com/r/OnePiece/comments/11opm0w/does_anyone_know_how_i_can_get_a_one_piece_batch/",
        "text": "trying to find a way to get a bunch of one-piece episodes at once. I've tried some sites like anime kaizo and animephae but I want small-sized ones in 480 at 50mb to 90mb each like gogoanime any help on this",
        "created_utc": 1678555315,
        "upvote_ratio": 1.0
    },
    {
        "title": "My drawing of Roronoa Zoro, part of my worst generation series of drawings. Which drawing is your favorite so far? ( instagram: @hz19art )",
        "author": "hz19art",
        "url": "https://www.reddit.com/gallery/11opksy",
        "text": "",
        "created_utc": 1678555229,
        "upvote_ratio": 1.0
    },
    {
        "title": "[OC] Nico Robin x Janet Jackson",
        "author": "OranceJuice",
        "url": "https://imgur.com/a/H7E50Bi",
        "text": "IDK if this is too lewd for this subreddit, it doesn't seem to really fit the other one..",
        "created_utc": 1678555091,
        "upvote_ratio": 1.0
    },
    {
        "title": "For all non-japanese OP fans, one of the best japanese theorists (ドロピザ) just released their first video with english subtitles",
        "author": "_TheStonerSloth_",
        "url": "https://youtu.be/vl0SmS6V1Pc",
        "text": "",
        "created_utc": 1678555004,
        "upvote_ratio": 1.0
    },
    {
        "title": "it's a good theory",
        "author": "Correct-Witness8009",
        "url": "https://i.redd.it/39sxzmblp6na1.jpg",
        "text": "",
        "created_utc": 1678554926,
        "upvote_ratio": 1.0
    },
    {
        "title": "the traitor is...",
        "author": "Kuzan119",
        "url": "https://www.reddit.com/r/OnePiece/comments/11opg5s/the_traitor_is/",
        "text": "Kid doflamingo seraphim",
        "created_utc": 1678554908,
        "upvote_ratio": 1.0
    },
    {
        "title": "For all non-japanese OP fans, one of the best japanese theorists just released their first video with english subtitles",
        "author": "_TheStonerSloth_",
        "url": "https://youtu.be/vl0SmS6V1Pc",
        "text": "",
        "created_utc": 1678554854,
        "upvote_ratio": 1.0
    },
    {
        "title": "So that's where all the TCG packs went",
        "author": "KappaholicsAnonymous",
        "url": "https://www.reddit.com/gallery/11opdb2",
        "text": "",
        "created_utc": 1678554705,
        "upvote_ratio": 1.0
    },
    {
        "title": "Those Redesign of Zoro and Perona Looks Really Cool!",
        "author": "heiky11",
        "url": "https://i.redd.it/noarhvgj55na1.jpg",
        "text": "",
        "created_utc": 1678554075,
        "upvote_ratio": 1.0
    },
    {
        "title": "What game to play",
        "author": "drarzy",
        "url": "https://www.reddit.com/r/OnePiece/comments/11op38o/what_game_to_play/",
        "text": "I’ve been watching one piece and really want to play one of the video games. I’m currently on the tail end of the dressrosa arc and don’t want the games to spoil it for me, so what game would be best to play? Hopefully someone here can help me. Thanks!",
        "created_utc": 1678554035,
        "upvote_ratio": 1.0
    },
    {
        "title": "Law joins the guild",
        "author": "MrBushido56",
        "url": "https://www.reddit.com/r/OnePiece/comments/11op18q/law_joins_the_guild/",
        "text": "This is a part 2 of my what happens to law theory in my first theory I spoke about how I think law will fight black beard and how katakuri will interfere in the fight which leaves Blackbeard leaving empty handed.\n\nanother way this will go is by having fujitora interfere.\n\nback in dressrosa after apologising on before of the wg akainu punished fujitora by banning him from entering any marine base without bringing in the heads of law and luffy \n\n&amp;#x200B;\n\nhttps://preview.redd.it/4wllqt3yo4na1.png?width=1620&amp;format=png&amp;auto=webp&amp;v=enabled&amp;s=e1ae8dedc1d0504aba5072820b4b686e3deebc20\n\nwell now luffy is a emperor of the sea and law despite having the same bounty is not and he lacks a grand fleet. akainu also displayed annoyance not being able to head over to winner island to deal with black beard and law himself.\n\n&amp;#x200B;\n\nhttps://preview.redd.it/2cid3r89p4na1.png?width=1620&amp;format=png&amp;auto=webp&amp;v=enabled&amp;s=c5a7dffd19ee5898a09764b035bb4183f9bc0386\n\nNow we know the location of all the emperors besides fujitora, akainu is stuck in marinford,  green bull is brining weevil to impel down and Kizaru is on his way to egghead but fujitora whereabouts is unknown. We could see him with the remaining seraphim ( Moria, doffy and crocodile ) along with smoker who was missing on g14 where tashigi is, head to winner island to deal with bb and law when they can.  Bb seeing an admiral will cut his loses and flee back to beehive law however will be forced to fight fujitora but will be defeated after being weakened by BB and just not being able to match an admiral.\n\nso law and his crew will be sent to impel down and this could be interesting as law will be placed in a cell opposite dofflamingo which could open up to some interesting conversations.\n\nI do believe there will be a second impel down break out so let’s look at the options.   \n1. Bon clay.\n\nWe know Bon clay survived the last 2 years and has returned to level 5.5 and has been gathering his own group of people just like Iva did \n\nhttps://preview.redd.it/6r78xp1tr4na1.jpg?width=540&amp;format=pjpg&amp;auto=webp&amp;v=enabled&amp;s=d81e310908522ea660f2bff9d481fe89e28d15a6\n\nNow Bon reading the news about wano could see law being captured and believing he and law are friends will decide to break law and his crew out bringing them to level 5.5,  law will convince him to help him have another breakout however unlike luffy who was charging around law will come up with a plan. They break out and what happens then I don’t know.\n\n2.  He joins the cross guild.  Like I said I do believe there will be a break out and I can see the cross guild being part of it.  \n\nIn the recent cover we see judge and Caesar realising vegapunk is their enemy not each other \n\nhttps://preview.redd.it/ibno7cenx4na1.png?width=1100&amp;format=png&amp;auto=webp&amp;v=enabled&amp;s=696d39ca013d3e78965eeb06ad85dcb1d29c5ffc\n\nnow this was probably some time ago which means they will be attacking egghead island themselves however if they don’t we should ask why not ?  What are they planning ? Well recently as well another former mads member appeared and that was miss bakkin who revealed her son was captured by and taken to impel down she demanded Marco help save him since he owes her one and if he doubts weevil is WB son they can ask vegapunk. The problem is last time Marco left his island it was attacked so I can’t see Marco leaving again even if he owes weevil.\n\n&amp;#x200B;\n\nhttps://preview.redd.it/7o9390xyy4na1.png?width=1620&amp;format=png&amp;auto=webp&amp;v=enabled&amp;s=d0533911861e188759e45f218ea4a6ee451a2bbb\n\nI believe if Marco won’t help her she will seek aid from someone else and come across judge and Caesar and will convince them to break out weevil which they both will refuse however something of note is they may change their minds when they hear that it was greenbull who arrested weevil and that’s when they reveal that greenbull is also the one who arrested king and queen from wano.\n\n&amp;#x200B;\n\nhttps://preview.redd.it/6as808hp05na1.png?width=1620&amp;format=png&amp;auto=webp&amp;v=enabled&amp;s=1df7278f74d60808a360967bd8c56fa72cc1a32a\n\nhttps://preview.redd.it/hu2wo6hp05na1.png?width=1620&amp;format=png&amp;auto=webp&amp;v=enabled&amp;s=a80748be9579c56902cc3d347cbebcda64309247\n\nNow perhaps they agree to break queen out believing they can convince him to join them on their revenge in vegapunk though I suspect judge will be hesitant and more drawn to king who is a lunarian. This is where he reveals he stole samples of kings lineage factor to create his children and knows vegapunk will do the same so breaking king out to keep him out of the wg hands while getting their hands on his dna themselves so judge can create more super soldiers could be worth the risk.   \nbut they know the near impossible task of invading impel down,  it used to be impossible but somehow luffy was able to do it.  Asking luffy for help is out of the question.  Judge will not seek the help of his failure of a son sanji and Caesar will not go back to luffy after how he was treated.  However that is when they realise luffy didn’t do it on his own buggy was able to lead a riot and break out.\n\nThey get the idea to form an alliance with the cross guild to break into impel down.  Buggy will dismiss them saying why the hell would he go back to impel down to save some brat he even doubts is WB son or save something called a lunarian but crocodile will chime in saying this could be an advantage for them while the marines are distracted securing a super solider army created by mads would be worth it but also they could break out doffy who holds tons of information on the underworld and the celestial dragons and getting him on their team will be an advantage and if they can get weevil indebted to them all the better.  Mihawk doesn’t care either way but may be promoted when he hears news of fujitora taking law to impel down and eager to have a proper fight may be eager to test out how powerful Fuji is as a fellow swordsman.\n\nnow in this arc there are many ways this can go.  They come across law in his cell and law thinking back to what luffy said about buggy.    \n\n\nhttps://preview.redd.it/tnu3tz7135na1.png?width=1620&amp;format=png&amp;auto=webp&amp;v=enabled&amp;s=b7f6f5e836851e5bda2d3a873e0116ea0d170c0d\n\nlaw only cares about discovering the history of the D clan and has no interest in being pirate king or treasure and after being beaten and nearly losing his crew will admit he needs more power and influence and like crocodile joins the guild using buggy as a scapegoat.  the problem is doffy.\n\nso a few ideas. \n\n1.  law agrees to work with doffy for the time until they accomplish his goals\n2. law rejects doffy and leaves not joining the cross guild \n3. law fights doffy and the winner joins the guild and the loser stays ( similar to what black beard did.\n4. law convinces them to not take doffy.\n\n&amp;#x200B;\n\nthere is one way this can happen.  on bb ship it’s revealed pudding was captured \n\nhttps://preview.redd.it/67dnu2i145na1.png?width=1620&amp;format=png&amp;auto=webp&amp;v=enabled&amp;s=f818622ca8ed420cbd1c1d0e8d09fa47ff2d7401\n\nnow if laws crew attacked bb ship and broke her out she could also be captured by fujitora and brought to impel down as she is the daughter of big mom.\n\nthis can either mean katakuri ends up getting involved with cross guild himself putting his difference with vinsmokes and law aside to save his sister and plus having the alliance of a yonko could be beneficial in protecting wci after all these loses or katakuri just becomes another obstacle for them.\n\nhowever if they can convince pudding to take doffy memories they can use all his memories against the wg and have inside information on the dark market allowing law to join and leave doffy behind while they don’t need him.\n\nI don’t know if this will happen but this would make things more interesting.",
        "created_utc": 1678553905,
        "upvote_ratio": 1.0
    },
    {
        "title": "Nami by me",
        "author": "McIce3",
        "url": "https://i.redd.it/rsgi4ksc45na1.jpg",
        "text": "",
        "created_utc": 1678553771,
        "upvote_ratio": 1.0
    },
    {
        "title": "11 Supernova ranked by strength (1077+)",
        "author": "giovannibregu",
        "url": "https://i.redd.it/4pzmermy35na1.png",
        "text": "",
        "created_utc": 1678553560,
        "upvote_ratio": 1.0
    },
    {
        "title": "I tried to create a roster for a sequel to Burning Blood",
        "author": "ComprehensiveDate591",
        "url": "https://www.reddit.com/gallery/11oojbq",
        "text": "",
        "created_utc": 1678552625,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why doesn't Luffy use his powers when he needs to?",
        "author": "Goldy_2",
        "url": "https://www.reddit.com/r/OnePiece/comments/11ooe0j/why_doesnt_luffy_use_his_powers_when_he_needs_to/",
        "text": "There are some cases where Luffy has to hurry to some place far away, but he doesn't use rocket or runs that fat like when he's being chased.",
        "created_utc": 1678552248,
        "upvote_ratio": 1.0
    },
    {
        "title": "Possible meaning to the sun/moon pattern on baby Shanks?",
        "author": "freshlobsta",
        "url": "https://i.redd.it/fmrel9rgh6na1.jpg",
        "text": "",
        "created_utc": 1678552192,
        "upvote_ratio": 1.0
    },
    {
        "title": "Mihawk vs Shanks fanart (who do yall think would win btw? )",
        "author": "Viotish",
        "url": "https://i.redd.it/wrdnkco6h6na1.jpg",
        "text": "",
        "created_utc": 1678552099,
        "upvote_ratio": 1.0
    },
    {
        "title": "One pieces costume",
        "author": "Regular_Cow_718",
        "url": "https://www.reddit.com/gallery/11oo61r",
        "text": "My sister helped with the makeup\n\nWhat do you think?",
        "created_utc": 1678551686,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to watch film red",
        "author": "_manbarepig",
        "url": "https://www.reddit.com/r/OnePiece/comments/11onza5/how_to_watch_film_red/",
        "text": "I want to watch film red with my little brother since he never got to see it but Idk where to watch it",
        "created_utc": 1678551204,
        "upvote_ratio": 1.0
    },
    {
        "title": "To be honest I’m not sure if this one is finished yet but I like it so far, let me know what you all think!",
        "author": "facepalmmaster",
        "url": "https://i.redd.it/kfgvia2rd6na1.jpg",
        "text": "",
        "created_utc": 1678550943,
        "upvote_ratio": 1.0
    },
    {
        "title": "My attempt to draw robin",
        "author": "chalkin98",
        "url": "https://i.redd.it/3c77rn5lv4na1.png",
        "text": "",
        "created_utc": 1678550752,
        "upvote_ratio": 1.0
    },
    {
        "title": "\"Only I can call my dream stupid\" (Roronoa in poster colour)",
        "author": "temujin0313",
        "url": "https://i.redd.it/igy34u24d6na1.jpg",
        "text": "",
        "created_utc": 1678550730,
        "upvote_ratio": 1.0
    },
    {
        "title": "Happy 54th birthday to Okamura Akemi who voices Nami!",
        "author": "Shanibestwaifu",
        "url": "https://i.redd.it/f8mbe6r3v4na1.jpg",
        "text": "",
        "created_utc": 1678550605,
        "upvote_ratio": 1.0
    },
    {
        "title": "sanji cameo in Moongirl and Devil Dinosaur... I Think",
        "author": "brownbear256",
        "url": "https://i.redd.it/0b41nwiiu4na1.png",
        "text": "",
        "created_utc": 1678550517,
        "upvote_ratio": 1.0
    },
    {
        "title": "Saitama meets god Usopps",
        "author": "JellyIce1",
        "url": "https://www.youtube.com/watch?v=B6slvuiSSPs",
        "text": "",
        "created_utc": 1678550442,
        "upvote_ratio": 1.0
    },
    {
        "title": "Happy 54th birthday to Akemi Okamura who voices as Nami!",
        "author": "UsefullyTrickyy",
        "url": "https://i.redd.it/fjh5blpnu4na1.png",
        "text": "",
        "created_utc": 1678550419,
        "upvote_ratio": 1.0
    },
    {
        "title": "Whos going to be the major villain now?",
        "author": "3sperr",
        "url": "https://www.reddit.com/r/OnePiece/comments/11onczj/whos_going_to_be_the_major_villain_now/",
        "text": "I think imu is still too far out of reach for the pirates. I dont think blackbeard is strong enough to be the next big bad major villain yet. Hes strong, but he wasnt like kaido or earlier in the series where the villain was too strong for luffy to fight. Luffy is a bit too op right now. We havent seen him lose even once after wano. He just low diffs everyone, but thats a problem. Whos going to be the big bad villain now, whos gonna make you be like \"how is luffy expected to beat this\"",
        "created_utc": 1678549665,
        "upvote_ratio": 1.0
    },
    {
        "title": "One Piece, Toth and the Emerald Tablets",
        "author": "Shroom47",
        "url": "https://www.reddit.com/r/OnePiece/comments/11onc2g/one_piece_toth_and_the_emerald_tablets/",
        "text": "so I'm watching a video about Toth, the emerald tablets, and the philosophers stone.  \nbut as the guy is explaining all this, i felt like he was just retelling the one piece story, with different terms.  \nstart at 11:36 , you only need to watch 2 minutes or so.  \n[https://www.youtube.com/watch?v=\\_0n1Q0CV-3A](https://www.youtube.com/watch?v=_0n1Q0CV-3A)\n\nemerald tablets = poneglyphs  \ntoth = joyboy  \nthe one thing = the one piece?  \nancient civilizations = void century  \nalchemy = devil fruits  \nfirestone = devil fruits? the will of d.? (\"its being supressed\")  \ndr dorian publishes translation as a book = the one piece manga itself?\n\nam i crazy??",
        "created_utc": 1678549600,
        "upvote_ratio": 1.0
    },
    {
        "title": "Just a little fact I learned",
        "author": "Mollianeta",
        "url": "https://www.reddit.com/r/OnePiece/comments/11on92c/just_a_little_fact_i_learned/",
        "text": "When Luffy first unveiled Red Roc, I was a little perplexed. It looked like Red Hawk but much bigger, so why did he call it Red Roc? \n\nTurns out a Roc is a giant legendary bird! It’s literally like a massive mythical hawk I guess. Super cool!",
        "created_utc": 1678549392,
        "upvote_ratio": 1.0
    },
    {
        "title": "Moshi moshi…",
        "author": "No_Sympathy1184",
        "url": "https://youtu.be/yIiLxdFhJGc",
        "text": "",
        "created_utc": 1678549269,
        "upvote_ratio": 1.0
    },
    {
        "title": "Kaido &amp; Big Mom Alliance Vs Marineford, who would win?",
        "author": "YakPersonal9246",
        "url": "https://www.reddit.com/r/OnePiece/comments/11on1mt/kaido_big_mom_alliance_vs_marineford_who_would_win/",
        "text": "Title. If instead Whitebeard crew was Kaido and Big Mom Alliance, with all their crews and armies against the full Marine at Marineford, who you think would win?",
        "created_utc": 1678548858,
        "upvote_ratio": 1.0
    },
    {
        "title": "Had a little fun and did a OP x DB crossover!",
        "author": "7SoldTheWorld",
        "url": "https://i.redd.it/diy4x9db66na1.jpg",
        "text": "",
        "created_utc": 1678548452,
        "upvote_ratio": 1.0
    },
    {
        "title": "Who do you think is the empress from one Generation ago? [Chapter 1059]",
        "author": "Febs17",
        "url": "https://www.reddit.com/r/OnePiece/comments/11ompih/who_do_you_think_is_the_empress_from_one/",
        "text": "I was rereading a little and stumbled about the Information that Shakuyaku was the empress of Amazon Lily from two generations ago. So I was wondering why we dont know the former empress. \nIn the Amazon Lily arc Gloriosa said that the empresses of one and two generations died due to the \"lovesickness\" but we see that thats not true because Shakuyaku is still alive. She even said that she had this sickness but by leaving the island she got healed. And it was mentioned that Gloriosa only could stay on the island because the former empress allowed her to stay. \nAt first I thought it could be Luffys mother but she will not be important according to Oda. She has to be in her mid 40s to mid 50s, I think. \nWhat do you think who it is?",
        "created_utc": 1678547969,
        "upvote_ratio": 1.0
    },
    {
        "title": "It’s my birthday wooo",
        "author": "Onhots_YT",
        "url": "https://i.redd.it/493xyg7536na1.jpg",
        "text": "",
        "created_utc": 1678547377,
        "upvote_ratio": 1.0
    },
    {
        "title": "how come Oden doesnt have bastard children",
        "author": "Little_Ad_6903",
        "url": "https://www.reddit.com/r/OnePiece/comments/11omgwi/how_come_oden_doesnt_have_bastard_children/",
        "text": "I mean the man clearly got busy alot",
        "created_utc": 1678547344,
        "upvote_ratio": 1.0
    },
    {
        "title": "Big Mom Pirates vs Beast Pirates vs Whitebeard Pirates",
        "author": "Far_Butterscotch_963",
        "url": "https://www.reddit.com/r/OnePiece/comments/11om8se/big_mom_pirates_vs_beast_pirates_vs_whitebeard/",
        "text": "Who would win?",
        "created_utc": 1678546787,
        "upvote_ratio": 1.0
    },
    {
        "title": "As a newcomer to one piece I’ve decided to rank every arc I’ve watched so far, what do y’all think of my ranking! (I’m currently half way through the white beard war saga)",
        "author": "strawhatstrongman",
        "url": "https://www.reddit.com/gallery/11om2n7",
        "text": "",
        "created_utc": 1678546334,
        "upvote_ratio": 1.0
    },
    {
        "title": "1077 top 30",
        "author": "PrincipleSame7997",
        "url": "https://i.redd.it/1mfgakjbz5na1.png",
        "text": "",
        "created_utc": 1678546091,
        "upvote_ratio": 1.0
    },
    {
        "title": "Luffy x Momo Drawing || Subscribe to my channel: tobi bijutsu",
        "author": "Hux_Creates",
        "url": "https://v.redd.it/u6idyyjhd4na1",
        "text": "",
        "created_utc": 1678544747,
        "upvote_ratio": 1.0
    },
    {
        "title": "Havent laughed that hard in a minute. 3 Presidents One Piece Podcast",
        "author": "Frosty-Many-2420",
        "url": "https://www.youtube.com/watch?v=iLJjkzGsOfs",
        "text": "",
        "created_utc": 1678544404,
        "upvote_ratio": 1.0
    },
    {
        "title": "What would a straw hats games night look like?",
        "author": "Ancient-Sir-5691",
        "url": "https://www.reddit.com/r/OnePiece/comments/11olbaq/what_would_a_straw_hats_games_night_look_like/",
        "text": "I'm curious, would you watch a slice of life series based around the ongoing on the sunny. I always wonder what they do for fun on the ship when their not trying to find the one piece.   \n\n\nSo a question, do the straw hats do games night?",
        "created_utc": 1678544312,
        "upvote_ratio": 1.0
    },
    {
        "title": "My sister started drawing again after a long time",
        "author": "Adidos26",
        "url": "https://i.redd.it/eyvyooyqr5na1.jpg",
        "text": "",
        "created_utc": 1678543546,
        "upvote_ratio": 1.0
    },
    {
        "title": "If Eren was in one piece",
        "author": "Infamous_Language_92",
        "url": "https://i.redd.it/ojtb4scdr5na1.png",
        "text": "",
        "created_utc": 1678543419,
        "upvote_ratio": 1.0
    },
    {
        "title": "what sanji's bounty post will look like, I saw it in my dreams 😂🥲",
        "author": "dulaxwalter",
        "url": "https://i.redd.it/cvw42n9gq5na1.png",
        "text": "",
        "created_utc": 1678543110,
        "upvote_ratio": 1.0
    },
    {
        "title": "what sanji's new bounty will look like, I saw it in my dreams 😂🥲",
        "author": "dulaxwalter",
        "url": "https://i.redd.it/k96uqlxtp5na1.png",
        "text": "",
        "created_utc": 1678542900,
        "upvote_ratio": 1.0
    },
    {
        "title": "This was on one of the SBS pages There is an abbreviation and a clear hint in my opinion It is an abbreviation of the following words SBS = Sabo beats Sakazuki ⏳️⌛️",
        "author": "ROCKSGARI",
        "url": "https://i.redd.it/e218cn4lp5na1.jpg",
        "text": "",
        "created_utc": 1678542817,
        "upvote_ratio": 1.0
    },
    {
        "title": "I had a dream that I read the last chapter of One Piece",
        "author": "Neftroshi",
        "url": "https://www.reddit.com/r/OnePiece/comments/11okoa7/i_had_a_dream_that_i_read_the_last_chapter_of_one/",
        "text": "Luffy and crew depart from Egghead island through some weird mix of coup de burst and vegapunk's odd technology. They blast really far far away. They landed on an odd lake. There are people at the lake. There are marines and lake goers. But there's also a guy with a weird half ship half truck looking machine on the lake.\n\n\nThe guy with the half ship somehow launches the sunny off the lake onto land and the crew falls off the ship as he does this. The crew is now on land looking for the ship in the direction it seemed to have flown.\n\n\nAs they head that direction they arrive at an odd looking house. A house that is seemingly difficult to get into. They have a feeling that the Sunny is somehow in there. Eventually through some weird effort they are all in. And everything is pitch black.\n\n\nNext scene the whole crew is sitting on the floor in a straight line next to each other. Luffy is wearing a white shirt instead of a red one. The focus is on him.\nHe is not smiling. He has a blank thousand yard stare. Something is off about Luffy. There is a voice being heard (I don't remember what it said). One by one the whole crew is getting handcuffed. But somebody realizes something.\n\nSomebody realizes that Luffy's shirt is not actually white, but it is painted white. The crew is sure that's why his emotions are different. Nonetheless they were not able to get to him to remove the paint only a tiny smidge of it. \n\nEverybody is arrested and nobody is smiling. The Sunny is not found. Luffy does not resist. He just proceeds and goes with the Marines. There is a slight change to his face to one with a little emotion. A small smile as he looks back and he says \"thank you for the adventure, and goodbye.\"\n\nEnd\n\nThere is an extra page explaining why the sudden last chapter. Apparently Eichiro Oda has passed away. And this is what the editors rushed out in order to end the series and say goodbye to and for Eichiro Oda.\n\nI just woke up from this dream and I am glad that it was only a dream. I did not like thinking that One Piece would have a bleakish ending. It's five in the morning here on a Saturday, so I'm going to try going back to bed. Just felt like sharing this before I forget. Good night.",
        "created_utc": 1678542604,
        "upvote_ratio": 1.0
    },
    {
        "title": "very soon ⏳️⏳️",
        "author": "ROCKSGARI",
        "url": "https://i.redd.it/rhnfneduo5na1.jpg",
        "text": "",
        "created_utc": 1678542571,
        "upvote_ratio": 1.0
    },
    {
        "title": "vinsmoke sanji",
        "author": "dulaxwalter",
        "url": "https://www.reddit.com/gallery/11oklwj",
        "text": "",
        "created_utc": 1678542413,
        "upvote_ratio": 1.0
    },
    {
        "title": "I animate some artworks from One Piece TCG",
        "author": "SrThomsen",
        "url": "https://www.reddit.com/r/OnePiece/comments/11okl0r/i_animate_some_artworks_from_one_piece_tcg/",
        "text": "&amp;#x200B;\n\n*Processing video 032glw1m64na1...*\n\n*Processing video 2nmqm2wm64na1...*",
        "created_utc": 1678542341,
        "upvote_ratio": 1.0
    },
    {
        "title": "There was so much unnecessary running in dressrosa, and I want to know exactly how much time was wasted",
        "author": "mrgetyabandzup",
        "url": "https://www.reddit.com/r/OnePiece/comments/11okijl/there_was_so_much_unnecessary_running_in/",
        "text": "[removed]",
        "created_utc": 1678542149,
        "upvote_ratio": 1.0
    },
    {
        "title": "I gave these One Piece shoes for Christmas to my boyfriend. Am I a good girlfriend?🥺",
        "author": "Doa_nia",
        "url": "https://i.redd.it/0wooyvrpl5na1.png",
        "text": "",
        "created_utc": 1678541518,
        "upvote_ratio": 1.0
    },
    {
        "title": "A most heartbreaking possibility *Manga Spoiler *",
        "author": "Mowensworld",
        "url": "https://www.reddit.com/r/OnePiece/comments/11okac2/a_most_heartbreaking_possibility_manga_spoiler/",
        "text": "There is going to be an Ace seraphim and he'll possibly have the mera mera powers.",
        "created_utc": 1678541515,
        "upvote_ratio": 1.0
    },
    {
        "title": "US Presidents Get Heated Debatting One Piece! Has some Spoilers!",
        "author": "m_agus",
        "url": "https://youtu.be/iLJjkzGsOfs",
        "text": "",
        "created_utc": 1678541283,
        "upvote_ratio": 1.0
    },
    {
        "title": "Seraphim Candidates",
        "author": "Mowensworld",
        "url": "https://www.reddit.com/r/OnePiece/comments/11ok6ac/seraphim_candidates/",
        "text": "[removed]",
        "created_utc": 1678541202,
        "upvote_ratio": 1.0
    },
    {
        "title": "Gigachad Robin",
        "author": "Brilliant_Knee_7542",
        "url": "https://www.reddit.com/r/OnePiece/comments/11ok62t/gigachad_robin/",
        "text": "https://in.pinterest.com/pin/675117800411335660/",
        "created_utc": 1678541185,
        "upvote_ratio": 1.0
    },
    {
        "title": "Imu’s Gender",
        "author": "GoldGolemGaming37",
        "url": "https://www.reddit.com/r/OnePiece/comments/11ok4jz/imus_gender/",
        "text": "(Before I start, I’d like to mention I am not caught up, I’m at chapter 1061, and this post is not in reference to what happened, so please don’t spoil)\n\nSo I’ve always thought Imu as a male, I’ve only read the manga since Amazon Lily so I don’t know what they did for Imu’s voice acting but I’m pretty sure he’s a guy. Yet in every theory I’ve seen that includes Imu, they use she/her and refer to Imu as a woman. So is Imu canonically a women? I mean, he’s the King of the World, but even Big Mom said she’d be Pirate King, not Queen. So I don’t really know.",
        "created_utc": 1678541074,
        "upvote_ratio": 1.0
    },
    {
        "title": "I Ranked Every Arc",
        "author": "God954",
        "url": "https://www.reddit.com/gallery/11ok3es",
        "text": "",
        "created_utc": 1678540985,
        "upvote_ratio": 1.0
    },
    {
        "title": "Non cannon devil fruits for Nami and Usopp.",
        "author": "ChiefWarlock7",
        "url": "https://www.reddit.com/r/OnePiece/comments/11ojzir/non_cannon_devil_fruits_for_nami_and_usopp/",
        "text": "I was thinking if Straw Hats gets non cannon devil fruits then what would they be. I don’t think Zoro, Sanji, Jinbe or Franky need devil fruits but Nami and Usopp certainly does.\n\nWith addition of Zues, Nami has attack power but unfortunately she has no defensive abilities. For Nami, the Phase-Phase fruit would be suitable. It works on several level. Any time she is attacked, she could let the attack phase through her without any harm to her. She also like to steal from others and this would allow her to go anywhere like going through the walls of a bank and steal as much money she wants.\n \nUssop uses plants based attacks, so the devil fruit most useful for him would be Grow-Grow fruit that grants the user the ability to accelerate the growth rate of plants and control them to his desire. It could have a lot of applications like using his powers to make plants grow, in order to attack or capture the enemies or to defend himself from their attacks.",
        "created_utc": 1678540679,
        "upvote_ratio": 1.0
    },
    {
        "title": "Traitor - Major hints in Chapter 1075",
        "author": "uchicha15",
        "url": "https://www.reddit.com/r/OnePiece/comments/11ojsna/traitor_major_hints_in_chapter_1075/",
        "text": "In chapter 1075 we find many hints pointing to the identity of the traitor. \n\nIn that chapter Pythagoras seems to have seen the traitor and comments on it by saying, \"It doesn't make any sense though! I'm finding it impossibe to grasp!! But my eyes can't be mistaken..!! Could we have make a mistake in the design stage?!\"\n\nI think that last sentence is a major hint with regard to the traitor. It's someone or something that Vegapunk designed.\n\nSo that rules out Imu, Kizaru, Caribou and Neptune for sure.\n\nIn the same chapter towards the end Shaka makes the following remarks: \"What...?!! If they're not obeying me, that would mean that Vegapunk gave them their orders!!\" In another translation it says \"... then they must already be acting on a command issued by a Vegapunk\".\n\nThis strongly hints to the traitor either being one of the Vegapunks which I stronly doubt due to insufficient evidence, or someone who has somehow managed to access the same rights in the system as Vegapunk. Could it be a Seraphim who has managed to do that? Maybe, maybe not. \n\nOh and in chapter 1076 there is another hint. The traitor has also leaked information about the research of poneglyphs to the government. So it's someone working closely with the government.\n\nWhat do you think? Can you come up with more ideas through these hints?",
        "created_utc": 1678540122,
        "upvote_ratio": 1.0
    },
    {
        "title": "I feel proud to have bought it.",
        "author": "Enouillingne",
        "url": "https://i.redd.it/hk0g4jx3x3na1.jpg",
        "text": "",
        "created_utc": 1678539260,
        "upvote_ratio": 1.0
    },
    {
        "title": "Don‘t worry guys I am back 👻",
        "author": "h0tcake033",
        "url": "https://i.imgur.com/Vz5tynn.jpg",
        "text": "",
        "created_utc": 1678538141,
        "upvote_ratio": 1.0
    },
    {
        "title": "https://www.reddit.com/r/cursedmemes/comments/11nilv5/2_piece/?utm_source=share&amp;utm_medium=android_app&amp;utm_name=androidcss&amp;utm_term=1&amp;utm_content=share_button",
        "author": "Theb0redbrit",
        "url": "https://www.reddit.com/r/OnePiece/comments/11oj2cr/httpswwwredditcomrcursedmemescomments11nilv52/",
        "text": "https://www.reddit.com/r/cursedmemes/comments/11nilv5/2_piece/?utm_source=share&amp;utm_medium=android_app&amp;utm_name=androidcss&amp;utm_term=1&amp;utm_content=share_button",
        "created_utc": 1678537918,
        "upvote_ratio": 1.0
    },
    {
        "title": "One Piece Odyssey spoilers?",
        "author": "dsyt_",
        "url": "https://www.reddit.com/r/OnePiece/comments/11oiwfc/one_piece_odyssey_spoilers/",
        "text": "What arcs are covered in one piece odyssey? I’m at the fish-man island arc but I don’t think they use any story that far on.",
        "created_utc": 1678537425,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is the Uta Uta no mi canon in the main series?",
        "author": "Academic-Astronaut59",
        "url": "https://www.reddit.com/r/OnePiece/comments/11oiq2l/is_the_uta_uta_no_mi_canon_in_the_main_series/",
        "text": "Yesterday I finally watched RED and I was wondering since Uta is canon as a character in the main timeline, is her DF canon too? I couldn't find anything about her DF being non-canon so I must assume that it exists in the main series, but since every main movie character has a non-canon DF I thought that this was the case. The only other canon character in movies was Shiki and since he is canon that made his DF canon too, so that applies to Uta as well?\nDo you think she will return to the main series and make an appearance with her power or not? or do you think she won't return at all since her character isn't important to the plot?",
        "created_utc": 1678536885,
        "upvote_ratio": 1.0
    },
    {
        "title": "I believe i discovered how Luffy (and other shonen characters) instantly slim down after overeating",
        "author": "Shileka",
        "url": "https://www.reddit.com/r/OnePiece/comments/11oidmn/i_believe_i_discovered_how_luffy_and_other_shonen/",
        "text": "I'll admit i didn't figure it out myself but read the explanation in a novel.\n\nThey use their muscles to compress the content of their stomach, which is also why so many shonen characters can take blows to the gut without even flinching, every time they overeat they're actually doing hardcore training of their abdominal muscles.",
        "created_utc": 1678535842,
        "upvote_ratio": 1.0
    },
    {
        "title": "What are your top 5 Sanji moments?",
        "author": "Armyhead3000",
        "url": "https://www.reddit.com/r/OnePiece/comments/11oicwx/what_are_your_top_5_sanji_moments/",
        "text": "Mine are:\n\n1. Sanji defeating Queen\n\n2. “Thanks for the light.”\n\n3. Sanji’s fight vs Mr. 2/ Bon Clay\n\n4. Sanji defeating Jabara \n\n5. Sanji saving Tashigi from Vergo",
        "created_utc": 1678535776,
        "upvote_ratio": 1.0
    },
    {
        "title": "One Piece is just.......PHENOMENAL.",
        "author": "MiserableJudgment419",
        "url": "https://www.reddit.com/r/OnePiece/comments/11oiabb/one_piece_is_justphenomenal/",
        "text": "I got into One Piece In March 2022, and it was one of the best decisions of my life. The series is just a perfect blend of comedy, adventure, world building and emotional moments. \n\nI think the most unexpected thing about One Piece was that I thought this was only a lighthearted comedy adventure series, but it's so much deep with its themes of racism, slavery, neverending wars etc. The world is almost torn apart between the war of marines and pirates. Specially the Marineford arc, where Coby was crying and telling everyone to stop. \n\nThere were so many epic moments in the series that I cannot stop once I start. Luffy felt much more refreshing than the average shonen protagonist, and all the other Straw Hats shone in their own rights. My personal favourite Straw Hats are Jimbe and Usopp.\n\nThe pacing of the anime was downright HORRENDOUS. Even though the story itself was really good, Toei just went and f**ked up the entire pacing of the series. I understand that some arcs need to be done slowly, and some fast paced, but all post-timeskip arcs felt horribly dragged on. \n\nEven though the animation felt really inconsistent throughout the series, it definitely improved in Wano arc. The series has a lot of pros and cons, and I love it. Currently at Episode 922, so I couldn't resist writing a personal review here on r/OnePiece. Can't wait to catch up to the series!",
        "created_utc": 1678535541,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is there ppl that still believe the theory that Sanji has Lunarian DNA?",
        "author": "Jootkingdom",
        "url": "https://www.reddit.com/r/OnePiece/comments/11oi7ti/is_there_ppl_that_still_believe_the_theory_that/",
        "text": "Proof/evidence as to why ppl think this theory is believable \n\n1.Sanji can catch his leg on fire and ppl say well Luffy has done it as well does that mean he has Lunarian dna as well? Well Luffy used Haki to make Red Roc\n\n\n2.Sanji’s ancestors crossed the Grand Line where Lunarians stayed at \n\n3.When Sanji was fighting against Queen King could be seen looking at Sanji fire longs in the distance making it seem like he’s wondering if Sanji is Lunarian \n\n4.Sanji’s mom is a Lunarian but I don’t think this is the case I’m sure Sanji’s dad took Lunarian genes",
        "created_utc": 1678535316,
        "upvote_ratio": 1.0
    },
    {
        "title": "where to watch film red?",
        "author": "zeus408",
        "url": "https://www.reddit.com/r/OnePiece/comments/11oi454/where_to_watch_film_red/",
        "text": "[removed]",
        "created_utc": 1678534980,
        "upvote_ratio": 1.0
    },
    {
        "title": "Rank Top 25 Female Chars in One Piece",
        "author": "Confident_Spell6022",
        "url": "https://i.redd.it/tht4kopkj3na1.png",
        "text": "",
        "created_utc": 1678534626,
        "upvote_ratio": 1.0
    },
    {
        "title": "You should have put it together sooner",
        "author": "Hot-Beach2567",
        "url": "https://www.reddit.com/r/OnePiece/comments/11ohyiw/you_should_have_put_it_together_sooner/",
        "text": "I feel like the title is not only referencing to the in chapter line of luffy lucci and kaku but also Oda telling the audience that we should have been able to figure out who the traitor is sooner. \n\nSo given that I have still no idea who the damn traitor is supposed to be. Stussy?",
        "created_utc": 1678534457,
        "upvote_ratio": 1.0
    },
    {
        "title": "Blackbeard will kill dragon not shanks.",
        "author": "nabeelmirzan",
        "url": "https://www.reddit.com/r/OnePiece/comments/11ohy2q/blackbeard_will_kill_dragon_not_shanks/",
        "text": "[removed]",
        "created_utc": 1678534417,
        "upvote_ratio": 1.0
    },
    {
        "title": "So this last week I've been preparing this mashup after noticing how both of these songs had pretty much the same rhythm.",
        "author": "Lumpy-Manager8580",
        "url": "https://v.redd.it/o2v3vehzc3na1",
        "text": "",
        "created_utc": 1678534227,
        "upvote_ratio": 1.0
    },
    {
        "title": "Who is Joyboy Really? &amp; Tree of Ohara",
        "author": "GodBodyAyv",
        "url": "https://www.reddit.com/r/OnePiece/comments/11ohvwq/who_is_joyboy_really_tree_of_ohara/",
        "text": "I’m not fully caught up but I’m on chapter 1059. So far I’ve been trying to wrap my head around who joyboy really is and I’m sure this discussion was already brought up numerous times already. If it’s obvious please don’t butcher me in the comments but I don’t think Luffy is Joyboy. I say this in a way whereas in a real life comparison from academia.\n\nfor example: Christ is God, Jesus is God in Human manifestation. ( “Us” in his spitting image). Now where I’m kinda getting at is Joyboy is really a Human(?), Nika is God.\n\nIdk what the one piece is but I do have a theory nonetheless, but I’m seeing that people are saying that it’s not based on his devil fruit/Nika but really shirahoshi? Maybe I need to continue reading or missed some connections from past chapters? I just feel like the CONTEXT about when they “specifically speak” on NIKA is the phenomenon that’s hard for most of the pirate world to accept/believe but when speaking on joyboy it’s like he was doing tangible pirate things that luffy has done but that doesn’t make him joyboy. I think it is a slight complex thing where Luffy and joy boy are both the embodiment of Nika. It just feels like they perform the acts of what Nika was portrayed as. Then again I don’t know if joy boy is really a human person but when he’s talked about it’s giving context as if he was a human, we know luffy is here so the only mystery is Nika I guess. Lastly does luffy DF come from the tree of ohara possibly ?",
        "created_utc": 1678534226,
        "upvote_ratio": 1.0
    }
]