[
    {
        "title": "law figure, newest addition to the collection",
        "author": "Nivaere",
        "url": "https://i.redd.it/wla80ojdqpna1.jpg",
        "text": "",
        "created_utc": 1678785221,
        "upvote_ratio": 1.0
    },
    {
        "title": "Where can I get subtitles for One Piece Film Red?",
        "author": "i_see_dead_pe0ple",
        "url": "https://www.reddit.com/r/OnePiece/comments/11r1ar0/where_can_i_get_subtitles_for_one_piece_film_red/",
        "text": "The question.",
        "created_utc": 1678784922,
        "upvote_ratio": 1.0
    },
    {
        "title": "Gorosei egghead",
        "author": "StonksEU",
        "url": "https://www.reddit.com/r/OnePiece/comments/11r18i1/gorosei_egghead/",
        "text": "[removed]",
        "created_utc": 1678784685,
        "upvote_ratio": 1.0
    },
    {
        "title": "Would anyone be able to help me what an episode of this picture is?",
        "author": "Classic-Ad-8443",
        "url": "https://i.redd.it/v8o1tus47ona1.jpg",
        "text": "",
        "created_utc": 1678784668,
        "upvote_ratio": 1.0
    },
    {
        "title": "what episode is this scene at",
        "author": "HuffleMuffle1424",
        "url": "https://www.reddit.com/gallery/11r0xh8",
        "text": "",
        "created_utc": 1678783501,
        "upvote_ratio": 1.0
    },
    {
        "title": "Old designs of the straw hat crew",
        "author": "Noka_Poopypants",
        "url": "https://www.reddit.com/r/OnePiece/comments/11r0u60/old_designs_of_the_straw_hat_crew/",
        "text": "Does anyone have any idea what the things written there mean? i'm assuming its just names, but even if it is, what does it say?\n\nhttps://preview.redd.it/xavt289o2ona1.png?width=680&amp;format=png&amp;auto=webp&amp;v=enabled&amp;s=3ca160920e31ee142e290f898146b0ded4eb3dff",
        "created_utc": 1678783148,
        "upvote_ratio": 1.0
    },
    {
        "title": "My drawing of Luffy vs. Kaido (Reposted because I accidentally put in spoilers in the title of the last post)",
        "author": "FreehandPenArtist23",
        "url": "https://i.redd.it/a2mousw9hpna1.jpg",
        "text": "",
        "created_utc": 1678782162,
        "upvote_ratio": 1.0
    },
    {
        "title": "??????????",
        "author": "raysneko",
        "url": "https://www.reddit.com/r/OnePiece/comments/11r0km9/_/",
        "text": "If Big Mom is dead then how can Zeus still be alive??",
        "created_utc": 1678782148,
        "upvote_ratio": 1.0
    },
    {
        "title": "Trafalgar Law cosplay by me (ft Choppi!)",
        "author": "the_pikarmy",
        "url": "https://www.instagram.com/p/CpvSDXmNmgD/?igshid=YmMyMTA2M2Y=",
        "text": "",
        "created_utc": 1678781569,
        "upvote_ratio": 1.0
    },
    {
        "title": "Sexy 70's Disco Nami by L3Moon-Studios on DeviantArt",
        "author": "Cultural_Map2596",
        "url": "https://www.deviantart.com/l3moon-studios/art/Nami-Onepiece-952989236",
        "text": "",
        "created_utc": 1678781499,
        "upvote_ratio": 1.0
    },
    {
        "title": "Scratchmen Apoo",
        "author": "TgsTokem",
        "url": "https://i.redd.it/9d3cwzvwcpna1.jpg",
        "text": "His intro is so hard and then he is just gone. I might be missing something cus I just finished the big mom arc but I feel like they could have done a lot more with this character and they have had a few hundred episodes to do it with.",
        "created_utc": 1678780693,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does sanjis siblings have healing factors?",
        "author": "POLLENBURNER3WHAAA",
        "url": "https://www.reddit.com/r/OnePiece/comments/11qzzpc/does_sanjis_siblings_have_healing_factors/",
        "text": "I swear yonji had to get his face fixed after being kicked by sanji. If this is correct. Why didn’t/doesn’t this happen to sanji? He was completely crippled by queen by his body milder back together fine but yonji gets kicked once in the face and he needs to be fixed. Seems odd to me Perhaps I’ll reread wholecake",
        "created_utc": 1678779968,
        "upvote_ratio": 1.0
    },
    {
        "title": "What One Piece films are worth watching?",
        "author": "Lyveii",
        "url": "https://www.reddit.com/r/OnePiece/comments/11qzwht/what_one_piece_films_are_worth_watching/",
        "text": "First time watcher here (if anyone actually has watched up the the latest ep twice lmao) and I’m on ep93. \n\nI’ve looked at this website of the order I should watch One Piece and the movies, but I’m not really interested in watching all of however many there are nowadays. (Despite watching a 1000 ep series)\n\nI was wondering if there are some that I shouldn’t skip and absolutely must watch, because they are that mind-blowingly good. Thanks.",
        "created_utc": 1678779622,
        "upvote_ratio": 1.0
    },
    {
        "title": "My drawing of Luffy (5th Gear) vs. Kaido (Hybrid Form)",
        "author": "FreehandPenArtist23",
        "url": "https://i.redd.it/n2nwg0pa9pna1.jpg",
        "text": "",
        "created_utc": 1678779477,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why One Piece anime not start a filler arc?",
        "author": "dezsopista",
        "url": "https://www.reddit.com/r/OnePiece/comments/11qyvpm/why_one_piece_anime_not_start_a_filler_arc/",
        "text": "Long story short: I hate watch anime weakly, so I usually wait a half or a year to watch OP. In the good old days when I had 50-60 episodes, it was awesome, but now, watching them was painful. The tempo just terrible. Same scenes and lines repeated again again, sometimes I felt one episode covered only one manga page. I think since Arabasta arc started I never get bored watching OP. Since now. It was already bad enough in the Dressrose arc but since then its worse and worse. If they continue this, they will totally ruin the anime and the finale will be unwatchable...\n\nI understand, they can't go to hiatus because of the employees. But why dont start a filler arc? If you ask me, the best would be if they just go back to Punk Hazard, and rework since then, weekly, without fillers. A One Piece Kai (if you dont know it, google dragon ball kai). It would be awesome rewatch OP from them without these annoying, timewasting scenes and filler monologues. I know it will never happen because sounds too logical and good, but someting have to be done because now watching the anime is not fun.",
        "created_utc": 1678775907,
        "upvote_ratio": 1.0
    },
    {
        "title": "Who has beaten up? \\\\\\",
        "author": "Sam_owner",
        "url": "https://www.reddit.com/r/OnePiece/comments/11qyvka/who_has_beaten_up/",
        "text": "It seems every marines (no care for level) wet himself when Shanks makes his (CoC) look.. Ok that CoC would implicitly fear people, but I don't think Kizaru or Akainu would get back on Luffy's CoC. I start thinking Shanks ha beaten up someone very big in past, not so far from Luffy's story to begin.\nWho could he be? Garp literally hates him for several reason, but Sengoku and Gorosei respect him.. Or just fear him too?\nI cannot think a victory against Garp or Sengoku would be enough to gain this level of fear.\nIf not a fight.. What else? Does he deleted an island?",
        "created_utc": 1678775893,
        "upvote_ratio": 1.0
    },
    {
        "title": "Give me your thoughts in the “enlightening” of a human being if he/she ate the hinto hinto no mi",
        "author": "Comfortable_doggies",
        "url": "https://www.reddit.com/r/OnePiece/comments/11qyrc0/give_me_your_thoughts_in_the_enlightening_of_a/",
        "text": ".",
        "created_utc": 1678775481,
        "upvote_ratio": 1.0
    },
    {
        "title": "Captain John's Treasure: The Hidden Knowledge That Could Change the World of One Piece",
        "author": "Xsploi",
        "url": "https://www.reddit.com/r/OnePiece/comments/11qyfv1/captain_johns_treasure_the_hidden_knowledge_that/",
        "text": "Captain John's Treasure is a legendary treasure that has been mentioned in the One Piece series, but little is known about its true nature or location. However, based on clues and hints from the series, a compelling theory can be proposed about what the treasure might be.\n\nOne theory is that Captain John's Treasure is actually a collection of knowledge and information, rather than a physical treasure. According to this theory, Captain John was a renowned scholar and adventurer who spent his life gathering knowledge about the world, including its history, geography, and secrets. He compiled this knowledge into a vast collection of books and maps, which he hid away in a secret location (Most likely in a cave) before his death.\n\nThe theory suggests that whoever finds Captain John's Treasure would have access to this vast store of knowledge, which could potentially change the course of history and the way people view the world. It is also possible that the treasure contains information about the Void Century, a mysterious period of time in the One Piece universe that has been alluded to but not fully explained.\n\nAnother possibility is that Captain John's Treasure is a physical treasure, but one that is hidden in a unique and challenging way. For example, the treasure could be located on an island that is only accessible once every few years, or it could be guarded by a powerful and deadly creature that only the bravest and most skilled pirates could defeat.\n\nOverall, the true nature of Captain John's Treasure remains a mystery in the One Piece series, and any theory about its location or contents is purely speculative. However, the idea of a treasure that contains knowledge and information, rather than just gold and jewels, adds another layer of intrigue to the already rich world of One Piece.",
        "created_utc": 1678774370,
        "upvote_ratio": 1.0
    },
    {
        "title": "Blood Snake Unleashed: Unraveling the Mystery of One Piece's Mysterious Creature",
        "author": "Xsploi",
        "url": "https://www.reddit.com/r/OnePiece/comments/11qyavx/blood_snake_unleashed_unraveling_the_mystery_of/",
        "text": "During the little garden arc, Brogy mentioned a blood snake and how it was the one creature he couldn’t pierce, based on this I will create a puzzling theory. The Blood Snake in One Piece is a mysterious creature that has not been fully explained in the series. However, there are some clues and theories that can be used to speculate on what it might be. One possibility is that the Blood Snake is a mythical creature, similar to the many other creatures that have been introduced in the One Piece world. \n\nAnother theory is that the Blood Snake is a type of Zoan Devil Fruit. Devil Fruits are a type of fruit that grant special powers to those who eat them, and Zoan-type fruits specifically allow the user to transform into an animal or a hybrid form. If the Blood Snake is a Zoan-type fruit, it would grant the user the ability to transform into a giant blood-red snake, which would explain its appearance and name.\n\nIt is also possible that the Blood Snake is a unique creature that has not been fully explored in the One Piece series. The world of One Piece is full of strange and powerful creatures, and the Blood Snake could be a new addition to this diverse ecosystem.\n\nOne theory suggests that the Blood Snake is the red line, because of this Joy boy might have set out trying to destroy it, or because of it separating the world. Currently the red line is just ring that surrounds the world, but it could be the blood serpent who has not awakened yet.\n\nOverall, the true nature of the Blood Snake remains a mystery in the One Piece series, and speculation about its origins and abilities is all conjecture at this point. However, the mystery surrounding the Blood Snake adds another layer of intrigue to the already complex and fascinating world of One Piece.",
        "created_utc": 1678773907,
        "upvote_ratio": 1.0
    },
    {
        "title": "Moons of Illusion or Divine Prophecy? Unraveling the Enigma of the Six Moons in the Ohara Library",
        "author": "Xsploi",
        "url": "https://www.reddit.com/r/OnePiece/comments/11qxwtc/moons_of_illusion_or_divine_prophecy_unraveling/",
        "text": "There are several possible explanations for why 6 moons were seen in the Ohara library, and while none of them can be confirmed without more information, here are a 2 compelling theories that I have put into thought:\n\n1. Optical Illusion: It is possible that the people who reported seeing 6 moons were actually experiencing an optical illusion. For example, a reflection of a real moon in a nearby window or mirror could have made it appear as if there were multiple moons. Alternatively, atmospheric conditions could have caused a mirage-like effect that made it seem as though there were multiple moons in the sky.\n\n2. Supernatural Phenomenon: Some people may speculate that the appearance of 6 moons is the result of a supernatural phenomenon. For example, it could be a sign of a prophecy or a message from a deity. However, without more information, it is impossible to determine whether this is a plausible explanation.\n\nOverall, while the appearance of 6 moons in the Ohara library is an intriguing phenomenon, it is difficult to determine the cause without more information. Each of these theories has its strengths and weaknesses, and more investigation would be needed to determine which is the most likely explanation.",
        "created_utc": 1678772585,
        "upvote_ratio": 1.0
    },
    {
        "title": "Anyone speak and read Japanese? Need help writing an SBS question.",
        "author": "TheLoneLogan",
        "url": "https://www.reddit.com/r/OnePiece/comments/11qxv1u/anyone_speak_and_read_japanese_need_help_writing/",
        "text": "Just thought of a funny/joke SBS question I'd actually try to send in.  I'd be amazed if it actually got answered.  My main thing is Japanese is not my first language (although I'm trying to learn) and I want to know if my rough translation and penmanship I did is readable.  If anyone here can read Japanese I could send a DM of what I wrote down.",
        "created_utc": 1678772414,
        "upvote_ratio": 1.0
    },
    {
        "title": "fananimation Big mom vs law kid 8 bit superspeed",
        "author": "eorehY",
        "url": "https://v.redd.it/rtt3cbyy5nna1",
        "text": "",
        "created_utc": 1678772372,
        "upvote_ratio": 1.0
    },
    {
        "title": "if the OG admirals = Kaido or close. wouldn't marineford have lasted like 10 minutes at most?",
        "author": "poodl3s388",
        "url": "https://www.reddit.com/r/OnePiece/comments/11qxrzv/if_the_og_admirals_kaido_or_close_wouldnt/",
        "text": "We literally see that the pacifistas entered the war 90 minutes into marineford.\n\nWhitebeard, despite Mihawk noticing how ill Whitebeard was did not take a single hit until a sneak  from Squard.\n\nIf the admirals were anywhere near Kaido's level. Wouldn't Whitebeard be fucked up by 90 minutes?",
        "created_utc": 1678772130,
        "upvote_ratio": 1.0
    },
    {
        "title": "Future members of Cross Guild",
        "author": "Extromeda7654",
        "url": "https://www.reddit.com/r/OnePiece/comments/11qxjbc/future_members_of_cross_guild/",
        "text": "[removed]",
        "created_utc": 1678771307,
        "upvote_ratio": 1.0
    },
    {
        "title": "i found this poster in a japanese store tried buying but got rejected, if anyone could help me find an hd version. would be highly appreciated.",
        "author": "dio_rno",
        "url": "https://i.redd.it/l0gunj2bkona1.jpg",
        "text": "",
        "created_utc": 1678771102,
        "upvote_ratio": 1.0
    },
    {
        "title": "How long until the dub 928-? comes out?",
        "author": "Extreme_Shop_3820",
        "url": "https://www.reddit.com/r/OnePiece/comments/11qxh0y/how_long_until_the_dub_928_comes_out/",
        "text": " So How long till the next new batch 928-? seems like we waited a month longer then what we did in the past for digital releases... Again they need an official spokesperson to communicate with the [r/OnePiece](https://www.reddit.com/r/OnePiece/) community to keep us updated. Its not a hard thing for them to do.",
        "created_utc": 1678771086,
        "upvote_ratio": 1.0
    },
    {
        "title": "Luffy gear 5",
        "author": "Lifesucks__69",
        "url": "https://youtube.com/shorts/sqt2OyidbdM?feature=share",
        "text": "",
        "created_utc": 1678770744,
        "upvote_ratio": 1.0
    },
    {
        "title": "Blackbeard's Split Personality: A One Piece Theory on the Possibility of Two People Sharing One Body",
        "author": "Xsploi",
        "url": "https://www.reddit.com/r/OnePiece/comments/11qx579/blackbeards_split_personality_a_one_piece_theory/",
        "text": "In the One Piece series, Blackbeard is a formidable pirate and one of the most notorious villains in the story. While his gender has been confirmed as male in the series, there is an interesting theory that suggests that Blackbeard may actually be a \"they\" rather than a \"he.\"\n\nThe theory is based on Blackbeard's unique ability to wield two Devil Fruits at once, something that was previously thought to be impossible due to the overwhelming strain it would put on the user's body. The theory suggests that Blackbeard is actually two people sharing one body, each with their own Devil Fruit power.\n\nThis theory is supported by the fact that Blackbeard is often depicted as having two distinct personalities. On one hand, he is a ruthless and cunning pirate who will stop at nothing to achieve his goals. On the other hand, he is a jovial and lighthearted person who enjoys drinking and making jokes.\n\nThe theory also draws parallels between Blackbeard and the real-life pirate Black Bart Roberts, who was rumored to have had a crew of twins who would switch places to confuse their enemies.\n\nIf Blackbeard is indeed a \"they,\" it would explain how he is able to wield two Devil Fruits at once and provide a unique twist to his character. It would also add an interesting dynamic to the story, as the two personalities within Blackbeard could potentially clash with each other and lead to internal conflict.\n\nWhile this theory is purely speculative, it is an interesting idea to consider and adds another layer of intrigue to the already mysterious character of Blackbeard in the One Piece series.",
        "created_utc": 1678770030,
        "upvote_ratio": 1.0
    },
    {
        "title": "Shanks vs Roger (Conquerer Haki)",
        "author": "Proud-Mycologist9955",
        "url": "https://www.reddit.com/r/OnePiece/comments/11qwwzn/shanks_vs_roger_conquerer_haki/",
        "text": "As shown in previous chapter and in the red movie, shanks knocked out vice admiral and scared the crap outta greenbull. do yall think shanks already surpass roger in Conquerer haki?",
        "created_utc": 1678769315,
        "upvote_ratio": 1.0
    },
    {
        "title": "The Hidden Past of Crocodile: A One Piece Theory on his Secret Connection to the Revolutionary Army",
        "author": "Xsploi",
        "url": "https://www.reddit.com/r/OnePiece/comments/11qwtxq/the_hidden_past_of_crocodile_a_one_piece_theory/",
        "text": "\nCrocodile, one of the main antagonists in the One Piece series, is a character shrouded in mystery. While some aspects of his past have been revealed, such as his former position as a Shichibukai and his failed attempt to take over the kingdom of Alabasta, there is still much about him that remains unknown. My theory about Crocodile's secret is that he is a former member of the Revolutionary Army.\nThe Revolutionary Army is a secret organization in the One Piece world that is dedicated to overthrowing the World Government and creating a more just society. The members of the Revolutionary Army are some of the most powerful and influential figures in the world, and they operate in secret, using their skills and resources to further their cause.\nMy theory is that Crocodile was once a member of the Revolutionary Army, but he left the organization under mysterious circumstances. Perhaps he disagreed with the methods of the Revolutionary Army, or he had a falling out with its leaders. Whatever the reason, Crocodile left the organization and began to pursue his own goals, eventually becoming a powerful pirate and eventually a Shichibukai.\nThe reason Crocodile's past as a\nRevolutionary Army member is a secret is that it would undermine his reputation as a ruthless pirate and undermine the World Government's narrative that the Revolutionary Army is a group of dangerous terrorists. If it were revealed that one of the most notorious pirates in the world was once a member of the Revolutionary Army, it could shift public opinion in favor of the organization and undermine the World Government's authority.\nThis theory would add a new dimension to Crocodile's character and provide a compelling backstory for his actions in the series. It would also tie him more closely to the larger political conflicts in the One Piece world, making him a more complex and nuanced character.",
        "created_utc": 1678769049,
        "upvote_ratio": 1.0
    },
    {
        "title": "Who names the pirate crews? (Other than oda)",
        "author": "POLLENBURNER3WHAAA",
        "url": "https://www.reddit.com/r/OnePiece/comments/11qwsq6/who_names_the_pirate_crews_other_than_oda/",
        "text": "Is it the world government? Or the captains? I don’t remember an instance of luffy actually naming his crew. The only time I remember actually was asl(ace sabo luffy) \n\nAlso I think the names of the crews have been rather lacklustre like oda just cant be bothered coming up with cool names the most unique name I can think of is the animal kingdom pirates and it’s not even that cool.",
        "created_utc": 1678768937,
        "upvote_ratio": 1.0
    },
    {
        "title": "5 Months in",
        "author": "NandoElLocoTron",
        "url": "https://www.reddit.com/r/OnePiece/comments/11qwrm0/5_months_in/",
        "text": "Started this amazing show Oct 10 of last yr so I’m about 5 months and some change in and Luffys fighting Kiado for the first time(ep 915) and damn the shit is going so hard. I know it gets much better but I’ve been having a blast these few months just binging when I ain’t working or with fam. Also inspired me to start wearing a straw hat at my jiu jitsu comps. Can’t wait to catch up with some of y’all!",
        "created_utc": 1678768836,
        "upvote_ratio": 1.0
    },
    {
        "title": "Found a Luffy on the inside cover of volume 14 of the early 2000s manhwa, Ares. Future pirate king already inspiring artists decades ago.",
        "author": "NicoRobin007",
        "url": "https://i.redd.it/s3075rg6vmna1.png",
        "text": "",
        "created_utc": 1678768627,
        "upvote_ratio": 1.0
    },
    {
        "title": "Could the one piece be a powerful weapon? My theory",
        "author": "Xsploi",
        "url": "https://www.reddit.com/r/OnePiece/comments/11qwfv9/could_the_one_piece_be_a_powerful_weapon_my_theory/",
        "text": "In my theory, the One Piece is actually a code that, when deciphered, will reveal the location of a powerful weapon capable of destroying the Red Line, a massive mountain range that divides the world in two. The weapon was created by the ancient civilization that once ruled the world and was intended to reunite the two halves of the world into one.\nThe code to unlock the location of the weapon was divided into several parts and hidden in various locations throughout the world. Only the Pirate King, Gol D. Roger, was able to gather all the pieces of the code and unlock the location of the weapon. However, instead of using it to reunite the world, Roger decided to keep it hidden, believing that the world was not yet ready for such power.\nAfter Roger's death, the code was scattered once again, and it is up to the next Pirate King to gather all the pieces and unlock the weapon's location.\nMonkey D. Luffy and his crew have set out on a quest to find the One Piece and unlock the weapon, but they are not the only ones searching for it. The World Government and other powerful factions are also seeking the weapon, each with their own agenda for how to use it.\nWhen Luffy and his crew finally unlock the weapon's location, they will be faced with a difficult choice. They must decide whether to use it to reunite the world or destroy it. The weapon's power is so great that it could potentially cause massive destruction if used improperly.\nLuffy and his crew will have to weigh the risks and benefits of using the weapon and make a decision that will shape the future of the world.",
        "created_utc": 1678767809,
        "upvote_ratio": 1.0
    },
    {
        "title": "What If Luffy was Roger’s son and not Ace?",
        "author": "No-Consideration8169",
        "url": "https://www.reddit.com/r/OnePiece/comments/11qwbxd/what_if_luffy_was_rogers_son_and_not_ace/",
        "text": "What if…?",
        "created_utc": 1678767466,
        "upvote_ratio": 1.0
    },
    {
        "title": "Edited this image for u/jotakujo2 I think the original is the only one without text.",
        "author": "One_Piece_Archives",
        "url": "https://i.redd.it/zdi9pc6y7ona1.png",
        "text": "",
        "created_utc": 1678766918,
        "upvote_ratio": 1.0
    },
    {
        "title": "What arc do you like to rewatch the most?",
        "author": "Liolia",
        "url": "https://www.reddit.com/r/OnePiece/comments/11qvw4x/what_arc_do_you_like_to_rewatch_the_most/",
        "text": "For me I enjoy rewatching sabaody to the return to sabaody the most. I've rewatched one piece several times but those are the arcs I'd just rewatch by themselves at times.",
        "created_utc": 1678766150,
        "upvote_ratio": 1.0
    },
    {
        "title": "TRX stakers can earn additional benefits with JustLend's program",
        "author": "mole_party",
        "url": "https://www.reddit.com/r/OnePiece/comments/11qvujq/trx_stakers_can_earn_additional_benefits_with/",
        "text": "JustLend's latest giveaway is open to all TRON stakers who have staked 100 USDT or more - could you be a lucky winner? https://twitter.com/JustLendDEFI/status/1635440416899186688",
        "created_utc": 1678766021,
        "upvote_ratio": 1.0
    },
    {
        "title": "Post-timeskip Baratie made in Minecraft",
        "author": "Josiesie",
        "url": "https://www.reddit.com/gallery/11qvtz6",
        "text": "",
        "created_utc": 1678765976,
        "upvote_ratio": 1.0
    },
    {
        "title": "Sengoku Ancestry?",
        "author": "BeardedChamp1",
        "url": "https://www.reddit.com/r/OnePiece/comments/11qvp9f/sengoku_ancestry/",
        "text": "Rewatching the Dub, and the first time Sengoku is shown, he’s introduced as “Saint Sengoku”. I know this could be a reference to his DF, but could this mean he’s related to the CD’s, with “Saint” being his surname?",
        "created_utc": 1678765579,
        "upvote_ratio": 1.0
    },
    {
        "title": "what if Nolan gray and the great warrior of shandora is a reference to Rodger and JoyBoy?",
        "author": "Electronic-Week-2478",
        "url": "https://www.reddit.com/r/OnePiece/comments/11qvmqa/what_if_nolan_gray_and_the_great_warrior_of/",
        "text": "Because they both laugh ALOT just like joy boy and Rodger\nOne has red hair and the other has a fucking donut on his head. \nMaybe joy boy had red hair and Rodger is symbolized through nolans wacky hair because Rodger is just a charismatic and funny guy. Im prolly wrong but let me know what you think",
        "created_utc": 1678765372,
        "upvote_ratio": 1.0
    },
    {
        "title": "current One Piece figure collection!",
        "author": "joshuanimations",
        "url": "https://i.redd.it/zykfdkal2ona1.jpg",
        "text": "",
        "created_utc": 1678765113,
        "upvote_ratio": 1.0
    },
    {
        "title": "current One Piece figure collection!",
        "author": "joshuanimations",
        "url": "https://i.redd.it/pkvybskb2ona1.jpg",
        "text": "",
        "created_utc": 1678765023,
        "upvote_ratio": 1.0
    },
    {
        "title": "should it be illegal to watch an anime out of order",
        "author": "azurezeltec_yt11",
        "url": "https://www.reddit.com/r/OnePiece/comments/11qvgss/should_it_be_illegal_to_watch_an_anime_out_of/",
        "text": "Like should we make a law that you have to start at the very first episode so that Boruto kids can shut the frick up about Naruto being called Boruto's dad",
        "created_utc": 1678764891,
        "upvote_ratio": 1.0
    },
    {
        "title": "The Mysterious Silhouette (1078)",
        "author": "iaminlovewithmycard",
        "url": "https://i.redd.it/r3qfwoex0ona1.jpg",
        "text": "",
        "created_utc": 1678764556,
        "upvote_ratio": 1.0
    },
    {
        "title": "SPOILERS - They can override their commands through will power/natural instinct.",
        "author": "Sad-Measurement-9359",
        "url": "https://www.reddit.com/r/OnePiece/comments/11qvbsx/spoilers_they_can_override_their_commands_through/",
        "text": " So I was thinking in the beginning of Egg Head we see that that shark monster which attack from below the water can ignore the commands given to them cause they can't control their natural instinct.\n\nAnd we know that Seraphims are different from other pactifista/robots in a way that they have emotions and natural thinking. So I am pretty sure a seraphim with strong enough will power can override their commands given to them.\n\nAnother part of this story is that seraphims have emotions which basically makes them slaves and we have warrior of liberation there so maybe Luffy can somehow help the seraphims in overcoming their commands given to them.",
        "created_utc": 1678764505,
        "upvote_ratio": 1.0
    },
    {
        "title": "The Black Beard Theory",
        "author": "lionelhayes",
        "url": "https://www.reddit.com/gallery/11qvb4o",
        "text": "",
        "created_utc": 1678764450,
        "upvote_ratio": 1.0
    },
    {
        "title": "What the “Strawhat Pirates” name will be when Luffy returns The Hat",
        "author": "Comfortable_doggies",
        "url": "https://i.redd.it/w0nn3bq2cmna1.jpg",
        "text": "",
        "created_utc": 1678762118,
        "upvote_ratio": 1.0
    },
    {
        "title": "One piece film: red",
        "author": "RioTbubbafette",
        "url": "https://www.reddit.com/r/OnePiece/comments/11qu8wo/one_piece_film_red/",
        "text": "Sooo I keep seeing clips of film red on tiktok and other platforms and I've seen a bunch of random sites while researching saying it's on random streaming platforms, then when I look I'm unable to find it, so I figured mayby someone here can help me clear this up, Is it out anywhere available for streaming??? Or will I have to wait till the June 14th dvd release date, any help would be much appreciated I'm just sick of seeing false information :/",
        "created_utc": 1678761469,
        "upvote_ratio": 1.0
    },
    {
        "title": "My version of \"We Are\" :)",
        "author": "Temporal72",
        "url": "https://www.youtube.com/watch?v=LyODR2XoU4I&amp;ab_channel=Temporal72",
        "text": "",
        "created_utc": 1678760903,
        "upvote_ratio": 1.0
    },
    {
        "title": "Luffy didn’t work he was blessed all this time",
        "author": "Many_Line9136",
        "url": "https://www.reddit.com/r/OnePiece/comments/11qtzat/luffy_didnt_work_he_was_blessed_all_this_time/",
        "text": "As you heard by the tittle:",
        "created_utc": 1678760755,
        "upvote_ratio": 1.0
    },
    {
        "title": "Want to start watching Wano arc but don't have the patience to rewatch.",
        "author": "Cadfourne",
        "url": "https://www.reddit.com/r/OnePiece/comments/11qtl16/want_to_start_watching_wano_arc_but_dont_have_the/",
        "text": "Hey so basically the title.\n\nI watched One Piece over the pandemic and I don't think I'll ever have a scenario where I can rewatch a series so fast ever again. That type of free time is gone. But I do really wanna start watching Wano casually and slowly. If I were to do that with rewatching, they might find the one piece before I catch up...\n\nSo my question is, what is the best way of relearning things about One Piece? Not looking for like One Pace (still too long), more like maybe summary content or some sort of series that recaps the one One Piece story. I'm fine with having to watch a lot of content, maybe just not 891 episodes worth...\n\nThanks in advance.",
        "created_utc": 1678759718,
        "upvote_ratio": 1.0
    },
    {
        "title": "Trying to understand how spoilers are released",
        "author": "breezy_Jello",
        "url": "https://www.reddit.com/r/OnePiece/comments/11qtjl3/trying_to_understand_how_spoilers_are_released/",
        "text": "Hello Community! This is a long overdue question but can someone explain how One Piece chapter information is released earlier than the Manga Panels?  Does Japan get the chapters every Monday and people translate them into English for \"Spoilers.\" How does it work?",
        "created_utc": 1678759612,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is everyone’s favorite songs that aren’t theme songs?",
        "author": "Gamerdog9000",
        "url": "https://www.reddit.com/r/OnePiece/comments/11qt46k/what_is_everyones_favorite_songs_that_arent_theme/",
        "text": "My favorites are Overtaken, Shinkenshoubu, and Sanji kazaashi kore ga East Blu",
        "created_utc": 1678758528,
        "upvote_ratio": 1.0
    },
    {
        "title": "Guys hear me out....",
        "author": "The-Dark-Surgeon",
        "url": "https://i.redd.it/30gilndxinna1.jpg",
        "text": "I know its farfetched....",
        "created_utc": 1678758505,
        "upvote_ratio": 1.0
    },
    {
        "title": "An interesting thought popped up...",
        "author": "texeltexel2009",
        "url": "https://www.reddit.com/r/OnePiece/comments/11qt2qj/an_interesting_thought_popped_up/",
        "text": "**TL;DR:** Luffy is literally Joyboy. The crew pulls a \"back to the future\" to the void century during which they carry out their works and help set up the One Piece world as we know it. Then proceed to be frozen inside Pangaea Castle to \"travel back to the future\" where they'll be thawed and finish of their individual and collective journeys again in the \"present\" timeline, and it'll all culminate with the accomplishment of Luffy's real Dream; to throw the biggest party of the World with all his friends and share drinks of the same sake.\n\nJust wanted to post it here to see whether this same thought crossed someone else's mind too.\n\nSo, after seeing the giant dormant mecha warrior on Egghead island, and Vegapunk explaining it ran on some energy source which he hasn't figured out yet, I saw some people suggest that Franky's cola power could be that which Vegapunk has been searching for. It sounds plausible.\n\nAfter reading those comments/suggestions from other commenters, the thought of a cola fueled giant mecha warrior felt like something Franky would create. That lead me to the next thought: What if he WAS the one who created it? It implies time travel; backwards.\n\nBasically, based on that thought, my hypothesis for what the Ancient Kingdom, the One Piece, everybody's dreams coming true, FATE, Inherited Will, etc, might be, is the following:Luffy's crew, together with their allies (Vivi, Momo, some minks, Kaido's daughter,...) at some later point in the story travel back in time, and during their time spent in the past, the void century, they carry out many big works which set up for events to unfold in a particular way and produce \"themselves\" of 800 years later.\n\nToki, the Sea Kings (neptunians), Gol D. Roger, Oden, Shanks (in a way) ... they all were WAY too specific with the timeframes and when to expect for events to unfold; like when the next Poseidon would be born and how many years later meet up with the other king(s) (luffy? momo?). One way of knowing specific timeframes would be if somebody went back and told the people as much.\n\nKaido knew Joyboy would appear in Wano. He knew because King told him. King knew probably because of tales passed down from generation to generation, so they had a rough estimate/idea of when Joyboy would appear, but in any case they knew EXACTLY where he'd appear; in Wano. Like many others affected by the cruel world, Kaido too was eager for Joyboy to appear and free even him from the chains of Fate which has been torturing him for all his life. If anybody could do it then it had to be this Joyboy (aka Luffy). That's also why I think Kaido was very lenient with the newer generation of kids coming after his head. He knew Joyboy could be one of them. Hence also why he was so dissapointed when he won for the second time agains Luffy, when he baseball batted him off Onigashima and into the sea, he said to himself \"You couldn't be Joyboy either\", which in this context would make sense.\n\nZunesha reacted as much: \"It's Joyboy! I can hear him! He's back!\". Based on this hypothesis, Joyboy is not a title of someone inheriting the fruit and will. It's literally Luffy. Luffy is back and Zunesha recognised him, for in the past she might have only seen him in his Gear Fifth / Nika Gode mode, instead of his normal form, which would explain why she didn't recognise him the first time on Zou.\n\nRegarding the poneglyphs; during the void century Robin teaches Momo the secret language and together they work on creating the poneglyphs with the True history they came to learn, plus the road ones, and scatter them around the world as they knew what was about to come in the future. Plus, they made one more poneglyph; the apology letter from Luffy (Joyboy) to Shirahoshi (Poseidon), since he promised her he would be there to protect her, but for whatever reason that we yet have to find out, he couldn't quite fulfill yet.\n\nNow, to tie all this together with Madam Shyarly's prophecy, the destruction of Fishman Island and liberation of the rest of the world, which implies the crew would have to \"come back from the past\" and finish the work they made themselves destined to; I think the crew is frozen and being kept inside  Pangaea Castle at Mary Geoise.\n\nIt's not just the giant straw hat that's hidden in the castle; It's the WHOLE CREW! Frozen in the basement probably thanks to one of Franky's inventions. That's the secret Doffy was talking about! It's the crew and the whole crew's Dream accomplished. It's the crew that will be thawed, awaken once again to properly finish each of their individual and collective journeys, and fulfill their promises to all the friends they made along the way, finally ending the cycle of Darkness that has been engulfing and oppressing the entire world.\n\nI don't think Doffy knows the full info about the crew being frozen and hidden in the castle, but perhaps he knows that Joyboy is being kept in the castle. He probably knows that unveilling the secret about the Sun God Warrior of Liberation being kept frozen and hidden in the castle, if made known to the world, would attack the very foundations of the World Government, revealing that they came into power through deceit and oppression.\n\nNika's silhouette, the one we saw in Sky Island, the one Who-Is-Who mentioned, the one we saw at the Onigashima rooftop when Luffy awakened; that's Luffy partying. The one frame Goda mentioned was his favorite panel from the whole manga because that's what's it is all about, that's what Luffy's Dream is all about.\n\nLuffy partied with all his friends until now, he will party once he goes back to the Void Century, and finally, in the future, Luffy's real DREAM: Throw the biggest party of them all, past present and future, dead and alive, all the races, Together, as equals, as One, during the Dawn, when everything connects for a time (like in the movie Your Name (crazy good movie!))\n\nTo finish: there are lots of details and ideas I've chosen to omit; like Brook being the actual composer of Bink's Sake, Usopp creating the island of snipers and thus starting that myth, Chopper creating the cures for all diseases, Nami creating maps of the whole world, Zoro starting the \"Sunacchi\" battle cry and strongest swordsman title/tradition, Franky creating all the \"technology of the future\", Robin actually \"creating the poneglyphs' language\", Momo creating the poneglyphs with his family's stonemasonry, Sanji getting to cook all the food with fish from the All Blue,... in short, them creating the Ancient Kingdom and probably even starting their bloodlines,....\n\n... I think it's an interesting hypothesis and would love to hear your comments and arguments, whether pro or against.",
        "created_utc": 1678758428,
        "upvote_ratio": 1.0
    },
    {
        "title": "The World’s First All-In-One Artificial Intelligence Autoresponder That Source You Hot Buyers Leads And Blast Them Via Email, SMS, WhatsApp, And Facebook…",
        "author": "SkyNice6764",
        "url": "https://warriorplus.com/o2/a/knz7gg/0",
        "text": "",
        "created_utc": 1678758334,
        "upvote_ratio": 1.0
    },
    {
        "title": "[Manga Spoilers] A potential revival coming up?",
        "author": "Andy_Reas",
        "url": "https://www.reddit.com/r/OnePiece/comments/11qsn74/manga_spoilers_a_potential_revival_coming_up/",
        "text": "I don't know if this has been mentioned before, but it seems like Egghead currently contains all the tools needed to \"revive\" Kuma, even if his original mind and body are truly gone in his current robotic body. \n\nKuma's memories are floating around in a consumable bubble, a cloned and modified version of his body is running around on Egghead in the form of S-Bear and Bonney has the power to age people (although maybe not permanently).\n\nSo, could S-Bear consume Kuma's memories before of after getting aged by Bonney, and then he is basically back?",
        "created_utc": 1678757347,
        "upvote_ratio": 1.0
    },
    {
        "title": "Fun Im-sama theory (1045+ spoiler)",
        "author": "ForsenBruh",
        "url": "https://www.reddit.com/r/OnePiece/comments/11qsejq/fun_imsama_theory_1045_spoiler/",
        "text": "Imu is tiny -&gt; Luffy uses looney tunes power -&gt; Final fight will be a Tom &amp; Jerry like fight with Luffy being tom &amp; Imu jerry",
        "created_utc": 1678756732,
        "upvote_ratio": 1.0
    },
    {
        "title": "One Piece still has the best examples of racism I've seen in an anime and it only took one arc",
        "author": "DickWriter69",
        "url": "https://www.reddit.com/r/OnePiece/comments/11qsbdu/one_piece_still_has_the_best_examples_of_racism/",
        "text": "The whole conflict between Fishmans and Humans is a lot more nuanced and complex then we're led to believe at first\n\nWe have Fishmen like Otome that wants to peacefully end discrimination against her kind, then we have Fisher Tiger that takes action to free all slaves and kill Celestial Dragons, then we have Arlong who was inspired by Fisher Tiger, but he corrupted what Fisher Tiger stood for (freedom) by trying to flip the switch and making HUMANS the slaves, which continues the cycle of hatred.\n\nAll three of these characters have their goals and ideologies challenged in a compelling way. Otohime's attempts to get the Fishmen to sign petitions didn't work and she was met with Fishmen that actually discriminate against humans. Telling her that it's an overly optimistic idea and that the Celestial Dragons are hellbent on keeping their kind as slaves\n\nThen you have Fisher Tiger who eventually succumbs to being a slave and having to see what it's like from a first-person perspective. This completely changes him as a person as he breaks down in tears to his fellow comrades to announce what he had become\n\n\nThen there's Arlong who directed all his hatred towards humans. Jinbei however called out Arlong on this and they constantly get into fights over this debacle. This is a great portrayal of how noble ideology and concepts can be corrupted and turned into extremist ideals (Communism was once proposed as a way to give everyone equal opportunity, yet in actuality it was used to enslave all of the working class)\n\nThe best part about this is that none of the three factions are shown to be cartoonishly racist or hiveminded. They all have extremists within their groups, and also just normal people who believe in their goal. Humans arguably have a right to fear Fishmen when there's Fishmen like Arlong going around and spreading hate and enslaving Humans himself. Fishmen have all the reason to dislike certain Humans for spreading hate and enslaving Fishmen\n\n\nIf you compare this to other series in the medium that tried to portray discrimination, none of them come close to One Piece imo\n\nAoT and Naruto are close examples\n\n&gt;!Eldians are hated because something they did a long time ago and they can transform into monsters. We're shown the rest of the world is cartoonishly racist and hiveminded. The only people that don't hate Eldians are Eldians, and anytime a non-eldian is being nice to an eldian it's because they're trying to manipulate them. This is not as multifaceted and complex as the discrimination themes in One Piece as it does not throughly depict how realistic discrimination works. There will always be people within groups that don't hold the same level of hatreds that the extremists do. Making everyone an extremists undervalues how Humans have free will to think for themselves and create their own opinions about the world!&lt;\n\n\n&gt;!The Uchiha clan is feared because they trained to be killers and their eyes are scary. They were excommunicated and pushed away to outer rim of the village and slowly lost their place in the villages politics. This caused them to try and start a revolution and overthrow the leaf, as they felt wronged since they had helped build the village. This is not as complex as One Piece, therefore it's worse.!&lt;",
        "created_utc": 1678756515,
        "upvote_ratio": 1.0
    },
    {
        "title": "Skipping Arcs",
        "author": "Entagami",
        "url": "https://www.reddit.com/r/OnePiece/comments/11qs1jw/skipping_arcs/",
        "text": "Before you all throw a fit, I’ve already read the manga and am fully caught up. I watched up to Skypeia before starting the manga since pacing wasn’t all there. After being caught up for around a year and a half. I’m starting to watch again. I’m almost done with Water 7 and starting Ernie’s Lobby (after skipping Skypeia) and what I want to know is if there is anything that’s worth watching in Thriller Bark since the manga wasn’t too admirable for that arc. Thanks in advance.",
        "created_utc": 1678755855,
        "upvote_ratio": 1.0
    },
    {
        "title": "Gear Second! (@z3r0_3r0)",
        "author": "Z3R0_3R0",
        "url": "https://i.redd.it/0wfz6dxn4nna1.png",
        "text": "",
        "created_utc": 1678753719,
        "upvote_ratio": 1.0
    },
    {
        "title": "I just finished this episode and made this meme.",
        "author": "brolybuster26",
        "url": "https://i.redd.it/m0krmexw0nna1.jpg",
        "text": "",
        "created_utc": 1678752445,
        "upvote_ratio": 1.0
    },
    {
        "title": "What do you think about Ohara, The One Piece Youtuber?",
        "author": "Empty_Advice7902",
        "url": "https://www.reddit.com/r/OnePiece/comments/11qqepa/what_do_you_think_about_ohara_the_one_piece/",
        "text": "what do you guys think about Ohara the Fox? One Piece Youtuber. I see a lot of pros and cons about him as a creator. he has an unusual entrance to the anime YouTube world. but this also covers the complicated discourse on spoilers and clickbait and more. is clickbait okay as long as the video is \"Good\" or do you feel lied to when YouTubers clickbate? My analysis below\n\nvideo essay with visuals: [https://youtu.be/NxZz9BIH9Gs](https://youtu.be/NxZz9BIH9Gs)\n\nWord Essay: ( Minus photos because I don't own so there not aloud here but in video version)  \nThrough Excting video ideas, unique editing style and Mastery underanding of the youtube algrthim, its almost like Manu is algric to not going viral. if you type in one piece theory on  Youtube and search  by the most viewed videos. 13 out of 15 of the videos are ohara's and 1 of the 2 thats not, is a reaction to Oharas super theory. but like we learned from Full Metal Alchamist equivalent exchange is real. when your rise to One Piecian Stardorm was as fast and bright as oharas there is always a chance you burn out, and your fall from grace\\\\ could happen just as quick. when you give everything you got to every youtube video it takes something from you. that thing can be Great or it can be Troubling. Ohara has coulavated a die hard fan base for the extrdenarya annount of effort he puts into each and every video. but like we learned in our grandlinereview video more views equals more proebeloms. with all those new eyeballs has gained more haters and people crtiquing his recent choices.  \n(ohara is getting crazier and crazier) (what happen to ohara? he WAS one of my favorite youtuber?)  and also a plethra of spoiler and clickbate accusiaons. but is it justfied. we will discet all this and more.   \n i was  actually saving this video for later but you have ask for it on both of my last 2 videos so here it is!  This is How Manu went from a guy who didnt even watch anime til college to being the most infuletial One Piece tuber on the plateform and the Darkside of that kinda sucess.  \nManu's love for Anime has an unothdox Orgin when comapried to the Avaerage weeb.   \nGrowing up he didnt really spend much time watching it. it wasnt until late highscool, eraly university that he even gave it a real chance. its not like he hated it and He had occuanailly seen epsoides of Popular series like Pokemon , Naruto or one piece but this was very sprectacally. The main reason was because his mom had a strict no tv during the day policy. she felt it wasnt very classy. Manu is from Germany and this may just be a german custome so if there are any germans wathing let us know in this is comments. he also stated  that anime had kinda of a negtive reputaion in his scool but regarless if he wanted to or not. he was only being able to watch tv when he visted his grabdmothers house. This made it impossiblle to watch any show constaltly because when he did catch an epsoside he had no idea whart was going on. Keep in mind all this was happeniong before neflix redinfied binge culture. back in the day you had to watch shows weekly so if you missed an epsode or 2 there was no watch to rewatch it. you just had to imaine what happen or hope you caught a rerun or masrthan at some point. This is why if you ever watch an anime from the late 90s early 2000s theres like a 5 min ep recap from previous epsides. this caused him to never really take any show to seriously.  \nbut when manu was 17 he left for university to study marketing. by this time streaming serveice had started becominmg popular and he could binge as much conent as he wanted. and he did. manu admited he would often watch shows constaly even passivly while he was studing. he considered himself a master multitasker. now he still  didnt jump into anime right away but actually fell in love with long form sitcoms. shows like Scrubs and how i met your mother took up most of his free time and not so free time. this type of shows always had 100 plus epsoides and because of this he had mastered the art of beinging. and i do consider binging a skill. iv denitly started a series the same time as someone else and had to wait weeks for them to finish before we could talk about it. there levels to this weeb shit. bi=ut because of this manu evedually ran of of stuff to watch. so one day he scolling throuigh his streasming service like seen, seen, hated it, seen it and he came across naruto. he noticed it had alot of epsoisdes and was like \"everything esle i liked had alot of eposides so ill give it a go. he loved it so he looked fore more long form anime and watched bleach and one piece back to back. i find this super intresting because my anime fans do the opsite. they only watch 1 or 2 season animes and actaivly avoid the super serious because its to much of a commited. to this i have friends that refrsue to watch one piece because that 1000 plus ep thing terffies them. but this is something i a gree when ohara on. i loved long form sitcome and anime. besides the 2 he mentioned one of the only reasions i watched big bang theory was because i heard it was long. and condidering iv watchhed and read one piece more than once i can deffint get the attarction. but after he finsihed the big 3 he was hooked he watched anime after anime.  \n this lead to him looking up and fining more intersting things about the japnnese culture. he found lots of werid things\n\nbut also wonderful things as well and edcually fell in love with that too. ramen, samauri, onsens, the whole asectic just because apealing! feeling the need to share this love with other people he also started Youtube around this time. he foucused primaly On One Piece charcter breakdowns and chapter reviews. but this still wasnt enough.   \nhe decided to decdied himself to learning japnnese and not half asses either he used old text books, online reesorses and even ttried to find japnese freiends to talk to. around this type he laso started liking japsse food around his city but he imahined how that same ramen would taste in those small grammed restunts and bars you so in side streets in tokyo you see in movies and anime . the more anime and manga he read he wondered.  what about the amazing landscapes in annime he keeps seeing. the  mountains, temples, fetsltes even the the city itself. does it really look like the shows he loves. if he was there could he have his own anime adveture? i think you know where this is going in 2020 manu moved 6000 miles from germany to japan to see for himself.he even visted famous anime landmarks like the restaunt from your name.   \nManu's initial attempt at youtube was One Piece chapter reviews and  discussion videos over gifs. manly focsing on Arc and charter breakdowns. you could already tell he was kinda of a natual. he spoke verly clearly and gave pretty cool and unique prespectives. i think this is where it helped that he got into anime later on because he was still so excited about everything. alot long time weebs became jaded and spend more time focusing on the negeives of a show  or anime troupes in general. Manu's passion for what he is talking about is one of the things that i think carry his videos to this day they are just a fun watch. His usopp breakdown video is one of my favorites from this time pyrmid. i love usopp and it really felt like he got whjat i felt other people missed at the time usopp wasnt really that well revived. his channels was exploding during this time but nothing comapred to what was to come from the next chapter of his channel Theoires. the whole one piece meta was shifting at this time and ohara was on the fore front of this. although he was nedw on the scene he videos quickly become some of the best quialty out. this wasnt by accidnet he kneew as a new youtuber that comapation was insnae and if he wanted to make he had to stand out. he had gotten reelaly into film and photography and by studyig photphry channels he learn that honestly even tho the anime comminty on youtube was big. it had pretty low prudtion value. 100k plus channels where still talking over just photos and gifs. so he added a almost cenmatic style to his video. This extra effort and comnbation with his theory videos where pushing him to the forfrom of the niche and the that video happen. The best One Piece theory'll youll ever see.   \nby this time in ohara's career he was fluent in japnnses. which had an expected effort on his channel. he was able to surf a side of the internet most ensglish speaking fans couldnt. he could look for topics and theories on the jappnase side of the intenet. combing both of these worlds where letting him bring a even more uniq quialty to his videos. and on July 28th 2021 he dropped his super theory. a 22 minute comabation of everything he learn up into that point. great produion, a exciting topic, unique facts that you could only discover if you could read japnnese and under canji and a collberation with a mysterious jappnese youtuber. this collmagated into a perfet storm that broke one piece tube for atealst a week. every video from ever anime tuber i followed was either reacting to or talking about this video. this video was so popular that other giant channels like grandlinereview so his views where cut in half that week because ohara had littery stolen all the eyeballs that week. very piraty ohara. the video was jus perfect. it was intesrting because alot of people never ereliaze just how many secrets of one piece oda hid in plain site in the canji and numbers he implited into the story because known of us read jappase. also the constant cuts, and new information that all was giciven piece by piece made every one watch to the very end because we wanted to see the pay off. even though it was 22 minutes. at the time this was very long for a one piece video. most people made videos around 8 minutes and no im not forgtting about tekking. i know he could talk about anything for an hour and we would love it. im talking about us mear mortals. and manus video felt lmore like a epsoide of a new anime more than a youtube video. which is ironic because thats about how long an anime epsoide is with out comicrals. this is where manus style complety channed one piece youtube.  people relized if a videos good enough people will watch it no matter how long it is. 30 plus minute videos started popping up emidently after this video. there litterly a 3 hour video out right now talking about one piece. thats as long as The Batman Movie with ribertPatterson. i also feel like manu video added a very mindblowing quailty to theory videos. before they was just fun sepcaltions but now you tuber try to blwon your mind every time they make a theory. This lead to reactions to one piece theoired becoming a thing. reactions videos in genseral have been around for years but i never seen people reacting to one picee youtubers before this. by the way feel free to react to any of my videos. i wont ever strike your channel and actually thing it would be cool to see. but the biggest way Oharas videos chanhed everything was the way One Piece youtubers title there videos. for a few months ever single theory video was title things like. the best pirate king theory youll ever see, the best blackbeard theory youll ever see and so on. this would create one of my least favoite trends on anime youtube. \"make the title so vague that no one knows what the videoa bout titles like  \" This Wild theory will blow your mind\" \" you wont belive what oda said\" \" no one expted this\" its like it invinted a new kinda of clickbatw  \nand for good reason the titles are just vague enough where both die hard one piece fans will both click the video and the video was good enough 3both would watch it. Oharas Theory Video currenly sits at 4.1 million views making it the most one piece video ever made by a youtuber. he dropped a part two to this supper theory called The best One Piece theory youll ever weatch but better and it would do veery well also and sits a 2.2 million which is also insane but this is where i started worrying about manu. but half the videos that do this arent doing anything as unque as ohras orginal video and even some of oharas fans are starting to hate it. At time of me making this video oharas new video is titled&gt; Oda just revield Shanks True Power. reading one would think oh cool. maybe i missed something in the chapter and the sercrets to shanks power is hidden there i mean oda is sneaky or maybe theres a sbs that came out i missed. but no Ohara was just playing lose with the meaning of the word power. i mean the title worked. its almost at 426 thousand views. making it the most viewed chapter review of 1076 but was it worth it. the top comment says. \"i really liked the part where he explaied shanks power\" basically callling him out for the clickbate. ohara even hearted it. he also hearted the commnet defeneding anoligicaly the play on word he was doing but i think that missses the bigger pointt. the orginal commnetrs knows what he was doing but just finds it annnoting and so did 1000 other people. . another cpmmter said \" That's why I no longer watch his contents. I just check from time to time if he has interesting takes. But in cases like these where he claims that Oda revealed Shanks powers where nothing was even suggested in the chapter, I know that it would be a waste of time to watch him.\"   \ni only point this out because these type of titles have gone full cicle and became lamost anti clickbate.   \nlets take a lot of the \"what happen to ohara he was one of my favorite manga youtubers ever\" thread from erlier a perosn reply that stuck out to me was one that read. i recently unsubcribed. 'im not a fan of his titles or thumnails latley. he went on to say that he sometimes comes off a despreste. ' i point this out to say that its great to wont your videos to do well but views can fell when thats the most important thing to you and theo dont like it. i found a lip while reaching this video where manu talked about how a recent video he dropped did like 600k in a week which is good for him. but now he is worried his next one wont do that good. i think thats dangoures. you cant keep chaing that ehohic high of very video being your most watched. when my last video broke every record for my channel i was simtansly very excited nut also very nervvous. i gained almost as many new subs as total subs i had a month before. my 1st thought was i have to get another video out as fast as possible i cant let thjem down. but i went to my local coffee shop to come down. yes i am greatful butif i wanna show it i have to take time with my bext video and put it out right. youtube is a very pariasolocal realship and the momment people start feeling like there just a number is the mommnet they stop caring about what you do. yes your videos might still do well because they are reaching the caucal auddince but a casual viewer want stay around for ever. take tekking for explae people trust him so no matter wwhta he talks about people ride for him because he erad that. when people feel like your titles are lies or stretching what clickbate bate is to the absusle limit. this will add up and you lose the people that helped you grow in the first place. you may not notice they the ones thatd leveling but i belive they are and should be heard because without them youtubers would be able to do what they ;ove for a living.   \nmanu knows about these rctitucs he dropped  very lengthy reddit post explaining histhoughts on spoilers and clickbate. it was very well thought out and kinda sweet. you can tell he really loves what he does. it what makes his video special but the thread basically followed the same logic as GrandLineReviews. \"if people hate my clickbate and spoilers so bad why are they clicking them\" its quit litterly getting blinded by sucuess. its  \n the youtuber equvenly to a underground artisty blowing up off a unique sound, siging to aa amjor label and putting out a generic radio single. most of those artist dont last.  i think he still makes wonderful video. i just hope he doenst let the stress ruin the fun job he eranmed for himself. manu just keep making fun videos. you are so good at it. you sellexiting better lamost any youtuber i seen. leen ito that and just  title them just a little less vague and clickbaty  and keep your core audince trust.thats the only way to make a life long career out of youtube. because there many many channels blow up on youtube at the core of almost every one of there downs was when the auaince lost faith in them. rememer rice gum. his channel has 10 million susbscribers but is now a dead channels because his audine felt like he forgot where he came from. \n\nAnd Thanks to the big 3 and that effect. Manu was completed hooked and very quickly spiraled down the outaku rabbit whole. He binged Anime after anime and began exploring the japansse culture even more. He did find a lot of things he felt where weird but mostly thought it was wonderful. He fell in love with the ramen, samurais and onsens. Which made him appriate the anime astetic even more.leading him to attempt to learn jappases. Not half assed either he used old text books and online resorse to eveually became fluent which is no easy task. japnasse is one of the hardest langue to learn. He even has a video explaining his journey of learning the langue which I would reccomned. Its such a fun and cool watch and makes you realize he probably could made a career on YouTube doing any niche. He is a good story crafter. In case you haven’t noticed he kinda has a obsessive nature becoming complete ingulphed in anything he does. a perfectionist of sort. This will be one of the main things that is both helping and hurting him in present day. All his interests where feeding off each other leading Manu to create his YouTube channel Ohara on September 24th 2018.\n\nAnd before I we get into the best part of the video. I just wanna say Thank you so much for the reaction to my tekking 101 video. i thought my like goal of 178 was to ambiobous of me. but you guys obliterated it. showing that the pirate diaries fleet is the strongest up and coming crew on the youtube seas. had a grown man crying like shiroshi. The like Goal for this video will be 201 but only like it if you enjoyed this video or learned something. let me know in the comments who I should do next and why\n\nManu made his channel so he could share his intrest with the world. Because one piece was he favorite series at the time and he had a lot of opinions on it. It became the primary focus of his channel. which explains why it was named after the island of ohara. a island in one piece and Home to our favorite argeiolgist. His initial videos focused on One Piece Chapter reviews, charter breakdowns, and various Ansysis videos. these deep dives built he a solid fan base rather quickly compared other successful anitubers. This is likely to do with his focus on production from very early on. Ohara stated that when he first discovered anime youtube.He noticed that even the popular creators had very low production value when you compare them to big creators In other niches.\n\nSo he knew that putting in some extra flair would help him stand out. he was right that. he also had some unique prospectives, and all around excitement for the seris would bled through the video allowing him to gain a diehard fanbase rather quickly. 2 of my favorite video by are from this Time period is his “Orgin of the accident kingdom video and his Usopp deep dive but im just a sucker for lore.\n\nOff this content he reached 100 thousand subscribers in around 2 years. But this is nothing to compared to the growth he would soon see. He was also more interested in the Japanese culture than ever. Every time he would get ramen he would think” I wonder what this what it would taste in one of those crammed ramen shops in Tokyo. you know the ones in them steaming side streets you see in anime and movies. When ever he would watch anime or read manga he would be in aw of the festalives, mountains and Cities.\n\nI think you you know where this is going. In 2020 Manu left his home country and flew 6000 miles to Japan to have his own anime adventure. he was also was getting a lot better at getting the most out of every video and understanding how YouTube works. His titles where becoming less literal like “Why buggy knows about the one piece” which is a video about why he thinks buggy knows about the one piece. To titles like he currently uses like ” Oda just revealed Shanks true power in the new world” which on face value would be about a hidden strength or power shanks had that you might have missed but instead is about how we got to see more of shanks allies in a recent chapter. the sneaky title worked. The video broke 400,000 rather quickly and may be the most views chapter review of the week but it did come with its drawbacks. Vague or clickbaity titles are nothing knew to the anime community. So you may be wondering why im bringing this up in this video. That’s because I belive that ohara is the person who made it common place because he showed it works. troughout the last few years Manu has given us a master class in the pro and cons on mastering Youtubisms.\n\nLets dive into the trechious Waters of Clickbate. The right and the wrong ways it is used\n\nThe best example of this working dropped July 28th 2021. when Ohara dropped his legendary video ‘The Best one piece theory you’ll ever watch, I guess” this video currently sits a 4.1 million views. making it the most viewed one piece video ever made by a Youtuber and it deserves it. The video was fun, creative and unique. Ohara had dumped every skills he had accired up til then into this video. One Piece Ansyis, Goldy production, and Camera switches mixed with B roll that always keep your attention. All of this made the video feel more like an anime episode then a YouTube video. He decision to learn Japanese also came background to help.\n\nIt allowed him to research a whole new world of one piece Anlsyises and theories. Through this he learned how import Canji and noumeolgies was to one piece. Through his research he would discover Japanese one piece theriest. YUDE-Ro and they would collbrate on on the infomeneton Super theory\n\nIts hard to put into words how much this broke one piece tube for a week. Every video on every channel was either the creator reacting to, arguing against or reviewing this video. Even Grandlinereview admitted that okras video got so many impressions it cut his normal views in half that week.\n\nThis brings us to one of the many ways he influenced the niche. he accidnetly created a new meta. Super theories. Ohara video was 22 minutes long which was unheard of at the time. I mean Unless you are tekking but im talking about for us mere humans. But after manus video people started dropping 30 minute plus videos where the creator is trying to “blow your mind” like ohara did with his video. There is even a 3 hour one piece theory out right now. That’s as long was the batman movie. Im not saying that’s a bad things but sometimes it does feel like everyone is taking there videos super serious these days and that can make them less fun. Basically Manu made people realize that one one piece videos can reach way more people then they ever thought the one piece niche could. What some call the casual audience. a part of the videos explosion was the vague title. It wasn’t spsfic enough to alienate casual viewers. a more spefic title with key words about the void centry or imu may have cut the views in half. This completey changed how people started titling there videos. Every One Piece creator started naming there videos things like “the best blank theory you’ll ever see”\n\nThis wild theory will blow your mind” “This theory Makes to much since” including me on at least one video. Unless until recently it was my best performing.\n\nBut the reason I dont belive Ohara original video was clickbate was because he over delivered. Weather you believed it was the best theory ever or not. You knew he tried his absute best and you left the video thinking i believe he believes this is the best theory video ever. it felt genuine. it felt like he was excited to blow you mind. But it was almost like it worked to well for him and other creators.\n\nAnd they started taking titles to far.\n\nManu, Glr and others who had figured how to min max YouTube.\n\nbecoming addicted to the ehphic high that comes with breaking your previous most watched video. A forever moving goal post. I know this because when Manu even mentioned that he had a video do extra well lately. I think it was a Zoro video and it hit around 600 thousand views in a week and he is worried his next one won’t do as well. Although that’s a understable feeling, I do find it troubling. If every video is your best or very video blows our mind then nothing does. So if your titles are thumbnails are so overly focused on getting every last view from every video that your even okay with tricking your loyal sucbribers to reach that sweet causal viewer it can be disheartening as a fan. It makes them feel like they are just a number to you. Ohara is so entering to watch that I dont think getting 10 percent more views is worth pissing off your o.g. audience. By dialing the title back just a little he would be eliminating the only thing I see people critiquing him for. The controversy to befit doesn’t seem worth it to me.\n\nLets take look at that shanks power video we previous menetion. The very top comment is a sacsrstic anologment that he didn’t delivery on the title. “ I really liked the part where he explain shanks true power.” Ohara hearted it and a another commenters reply. explaining that its a play on words of the word power. But the thing is I assume the original commuter already knew that but just felt he crossed the line into type 2 clickbate. The kind that is deliberately misleading. i think ohara was trys to do is type 1. Be hyperbolic but honest about the video but what I think most big YouTubers dont relize tho is its not up to you to decide which is which. Its up to your adduice. 1000 people liked that comment that’s 1000 people that agreed it was bad clickbate. That’s 1000 people that may not click the next video because they dont trust you. Basically creating Anti Clickbate. They see you post a cool title and think nay he is probably lying.\n\nLike Regan a commuter that said\n\n‘This is why I never I no longer click his conent” a thousand may seem small because his video get so many views but that is likely 1000 of his original subscribers. To me its better to have 300 loyal supporters then 100,000 fair weather fans because those 300 will be with you through the ups and downs as long as you do right by them.\n\nLets take a look at the previous mention reddit threads. the redditer showed a side by side comparison to Ohara old videos and new ones asking what happen? Receiving 617 up votes. The most thumbs up reply stating that they recently unscribbed from his channel. The primary reason of not being a fan of his new style of titles and thumbnails.\n\nthough I enjoy both ohara and others who practice hard core youtubism I dont agree with why they clickbate or use spoilers. I think they are getting lost in the numbers and letting it justify quesnable behavior. I know because when you read ohars reddit post on spoilers and watch Liams video on clickbate they both use their views and other youTube ansytis to justify there YouTube practices. Ill leave ohares response to the accusations in the description and\n\nI think you should read the thread for your self because I think its a good read and you can tell how much he really loves YouTube and one piece. But I think he just needs to belive in himself more. He claims the reason he doesn’t think he can’t afford not to fix these things is that people like tekking had a head start and dont need to clickbate or use spoilers because they have loyal fanbase that would watch them no matter what. but to me ohara loyal fanbase was what got him to the point where his super theory could take off. Even today most of his most watched videos are videos where he title are pretty straight forward. He’lI find the perfect mix. I think he is moving in the right direction with his new content being a mix of his old and new style. I love his new videos like all 82 backstories in one piece explained. It feeds his go audience and I think that’s import for a long career on the platform. If people think you sold out weather its YouTube, music or acting. They will stop supporting you. But I think he’s got this. but let me know what you think you think about ohara! [https://youtu.be/NxZz9BIH9Gs](https://youtu.be/NxZz9BIH9Gs)\n\n**0 CommentsShareSave**",
        "created_utc": 1678751857,
        "upvote_ratio": 1.0
    },
    {
        "title": "what do you think about Ohara, Youtube Clickbaiters and Spoilers?",
        "author": "Empty_Advice7902",
        "url": "https://www.reddit.com/r/OnePiece/comments/11qqczm/what_do_you_think_about_ohara_youtube/",
        "text": "what do you guys think about Ohara the Fox? One Piece Youtuber. I see a lot of pros and cons about him as a creator. he has an unusual entrance to the anime YouTube world. but this also covers the complicated discourse on spoilers and clickbait and more. is clickbait okay as long as the video is \"Good\" or do you feel lied to when YouTubers clickbate? My analysis below\n\nvideo essay with visuals: [https://youtu.be/NxZz9BIH9Gs](https://youtu.be/NxZz9BIH9Gs)\n\nWord Essay: ( Minus photos because I don't own so there not aloud here but in video version)   \nThrough Excting video ideas, unique editing style and Mastery underanding of the youtube algrthim, its almost like Manu is algric to not going viral. if you type in one piece theory on  Youtube and search  by the most viewed videos. 13 out of 15 of the videos are ohara's and 1 of the 2 thats not, is a reaction to Oharas super theory. but like we learned from Full Metal Alchamist equivalent exchange is real. when your rise to One Piecian Stardorm was as fast and bright as oharas there is always a chance you burn out, and your fall from grace\\\\ could happen just as quick. when you give everything you got to every youtube video it takes something from you. that thing can be Great or it can be Troubling. Ohara has coulavated a die hard fan base for the extrdenarya annount of effort he puts into each and every video. but like we learned in our grandlinereview video more views equals more proebeloms. with all those new eyeballs has gained more haters and people crtiquing his recent choices.  \n(ohara is getting crazier and crazier) (what happen to ohara? he WAS one of my favorite youtuber?)  and also a plethra of spoiler and clickbate accusiaons. but is it justfied. we will discet all this and more.   \n i was  actually saving this video for later but you have ask for it on both of my last 2 videos so here it is!  This is How Manu went from a guy who didnt even watch anime til college to being the most infuletial One Piece tuber on the plateform and the Darkside of that kinda sucess.  \nManu's love for Anime has an unothdox Orgin when comapried to the Avaerage weeb.   \nGrowing up he didnt really spend much time watching it. it wasnt until late highscool, eraly university that he even gave it a real chance. its not like he hated it and He had occuanailly seen epsoides of Popular series like Pokemon , Naruto or one piece but this was very sprectacally. The main reason was because his mom had a strict no tv during the day policy. she felt it wasnt very classy. Manu is from Germany and this may just be a german custome so if there are any germans wathing let us know in this is comments. he also stated  that anime had kinda of a negtive reputaion in his scool but regarless if he wanted to or not. he was only being able to watch tv when he visted his grabdmothers house. This made it impossiblle to watch any show constaltly because when he did catch an epsoside he had no idea whart was going on. Keep in mind all this was happeniong before neflix redinfied binge culture. back in the day you had to watch shows weekly so if you missed an epsode or 2 there was no watch to rewatch it. you just had to imaine what happen or hope you caught a rerun or masrthan at some point. This is why if you ever watch an anime from the late 90s early 2000s theres like a 5 min ep recap from previous epsides. this caused him to never really take any show to seriously.  \nbut when manu was 17 he left for university to study marketing. by this time streaming serveice had started becominmg popular and he could binge as much conent as he wanted. and he did. manu admited he would often watch shows constaly even passivly while he was studing. he considered himself a master multitasker. now he still  didnt jump into anime right away but actually fell in love with long form sitcoms. shows like Scrubs and how i met your mother took up most of his free time and not so free time. this type of shows always had 100 plus epsoides and because of this he had mastered the art of beinging. and i do consider binging a skill. iv denitly started a series the same time as someone else and had to wait weeks for them to finish before we could talk about it. there levels to this weeb shit. bi=ut because of this manu evedually ran of of stuff to watch. so one day he scolling throuigh his streasming service like seen, seen, hated it, seen it and he came across naruto. he noticed it had alot of epsoisdes and was like \"everything esle i liked had alot of eposides so ill give it a go. he loved it so he looked fore more long form anime and watched bleach and one piece back to back. i find this super intresting because my anime fans do the opsite. they only watch 1 or 2 season animes and actaivly avoid the super serious because its to much of a commited. to this i have friends that refrsue to watch one piece because that 1000 plus ep thing terffies them. but this is something i a gree when ohara on. i loved long form sitcome and anime. besides the 2 he mentioned one of the only reasions i watched big bang theory was because i heard it was long. and condidering iv watchhed and read one piece more than once i can deffint get the attarction. but after he finsihed the big 3 he was hooked he watched anime after anime.  \n this lead to him looking up and fining more intersting things about the japnnese culture. he found lots of werid things  \n   \nbut also wonderful things as well and edcually fell in love with that too. ramen, samauri, onsens, the whole asectic just because apealing! feeling the need to share this love with other people he also started Youtube around this time. he foucused primaly On One Piece charcter breakdowns and chapter reviews. but this still wasnt enough.   \nhe decided to decdied himself to learning japnnese and not half asses either he used old text books, online reesorses and even ttried to find japnese freiends to talk to. around this type he laso started liking japsse food around his city but he imahined how that same ramen would taste in those small grammed restunts and bars you so in side streets in tokyo you see in movies and anime . the more anime and manga he read he wondered.  what about the amazing landscapes in annime he keeps seeing. the  mountains, temples, fetsltes even the the city itself. does it really look like the shows he loves. if he was there could he have his own anime adveture? i think you know where this is going in 2020 manu moved 6000 miles from germany to japan to see for himself.he even visted famous anime landmarks like the restaunt from your name.   \nManu's initial attempt at youtube was One Piece chapter reviews and  discussion videos over gifs. manly focsing on Arc and charter breakdowns. you could already tell he was kinda of a natual. he spoke verly clearly and gave pretty cool and unique prespectives. i think this is where it helped that he got into anime later on because he was still so excited about everything. alot long time weebs became jaded and spend more time focusing on the negeives of a show  or anime troupes in general. Manu's passion for what he is talking about is one of the things that i think carry his videos to this day they are just a fun watch. His usopp breakdown video is one of my favorites from this time pyrmid. i love usopp and it really felt like he got whjat i felt other people missed at the time usopp wasnt really that well revived. his channels was exploding during this time but nothing comapred to what was to come from the next chapter of his channel Theoires. the whole one piece meta was shifting at this time and ohara was on the fore front of this. although he was nedw on the scene he videos quickly become some of the best quialty out. this wasnt by accidnet he kneew as a new youtuber that comapation was insnae and if he wanted to make he had to stand out. he had gotten reelaly into film and photography and by studyig photphry channels he learn that honestly even tho the anime comminty on youtube was big. it had pretty low prudtion value. 100k plus channels where still talking over just photos and gifs. so he added a almost cenmatic style to his video. This extra effort and comnbation with his theory videos where pushing him to the forfrom of the niche and the that video happen. The best One Piece theory'll youll ever see.   \nby this time in ohara's career he was fluent in japnnses. which had an expected effort on his channel. he was able to surf a side of the internet most ensglish speaking fans couldnt. he could look for topics and theories on the jappnase side of the intenet. combing both of these worlds where letting him bring a even more uniq quialty to his videos. and on July 28th 2021 he dropped his super theory. a 22 minute comabation of everything he learn up into that point. great produion, a exciting topic, unique facts that you could only discover if you could read japnnese and under canji and a collberation with a mysterious jappnese youtuber. this collmagated into a perfet storm that broke one piece tube for atealst a week. every video from ever anime tuber i followed was either reacting to or talking about this video. this video was so popular that other giant channels like grandlinereview so his views where cut in half that week because ohara had littery stolen all the eyeballs that week. very piraty ohara. the video was jus perfect. it was intesrting because alot of people never ereliaze just how many secrets of one piece oda hid in plain site in the canji and numbers he implited into the story because known of us read jappase. also the constant cuts, and new information that all was giciven piece by piece made every one watch to the very end because we wanted to see the pay off. even though it was 22 minutes. at the time this was very long for a one piece video. most people made videos around 8 minutes and no im not forgtting about tekking. i know he could talk about anything for an hour and we would love it. im talking about us mear mortals. and manus video felt lmore like a epsoide of a new anime more than a youtube video. which is ironic because thats about how long an anime epsoide is with out comicrals. this is where manus style complety channed one piece youtube.  people relized if a videos good enough people will watch it no matter how long it is. 30 plus minute videos started popping up emidently after this video. there litterly a 3 hour video out right now talking about one piece. thats as long as The Batman Movie with ribertPatterson. i also feel like manu video added a very mindblowing quailty to theory videos. before they was just fun sepcaltions but now you tuber try to blwon your mind every time they make a theory. This lead to reactions to one piece theoired becoming a thing. reactions videos in genseral have been around for years but i never seen people reacting to one picee youtubers before this. by the way feel free to react to any of my videos. i wont ever strike your channel and actually thing it would be cool to see. but the biggest way Oharas videos chanhed everything was the way One Piece youtubers title there videos. for a few months ever single theory video was title things like. the best pirate king theory youll ever see, the best blackbeard theory youll ever see and so on. this would create one of my least favoite trends on anime youtube. \"make the title so vague that no one knows what the videoa bout titles like  \" This Wild theory will blow your mind\" \" you wont belive what oda said\" \" no one expted this\" its like it invinted a new kinda of clickbatw  \nand for good reason the titles are just vague enough where both die hard one piece fans will both click the video and the video was good enough 3both would watch it. Oharas Theory Video currenly sits at 4.1 million views making it the most one piece video ever made by a youtuber. he dropped a part two to this supper theory called The best One Piece theory youll ever weatch but better and it would do veery well also and sits a 2.2 million which is also insane but this is where i started worrying about manu. but half the videos that do this arent doing anything as unque as ohras orginal video and even some of oharas fans are starting to hate it. At time of me making this video oharas new video is titled&gt; Oda just revield Shanks True Power. reading one would think oh cool. maybe i missed something in the chapter and the sercrets to shanks power is hidden there i mean oda is sneaky or maybe theres a sbs that came out i missed. but no Ohara was just playing lose with the meaning of the word power. i mean the title worked. its almost at 426 thousand views. making it the most viewed chapter review of 1076 but was it worth it. the top comment says. \"i really liked the part where he explaied shanks power\" basically callling him out for the clickbate. ohara even hearted it. he also hearted the commnet defeneding anoligicaly the play on word he was doing but i think that missses the bigger pointt. the orginal commnetrs knows what he was doing but just finds it annnoting and so did 1000 other people. . another cpmmter said \" That's why I no longer watch his contents. I just check from time to time if he has interesting takes. But in cases like these where he claims that Oda revealed Shanks powers where nothing was even suggested in the chapter, I know that it would be a waste of time to watch him.\"   \ni only point this out because these type of titles have gone full cicle and became lamost anti clickbate.   \nlets take a lot of the \"what happen to ohara he was one of my favorite manga youtubers ever\" thread from erlier a perosn reply that stuck out to me was one that read. i recently unsubcribed. 'im not a fan of his titles or thumnails latley. he went on to say that he sometimes comes off a despreste. ' i point this out to say that its great to wont your videos to do well but views can fell when thats the most important thing to you and theo dont like it. i found a lip while reaching this video where manu talked about how a recent video he dropped did like 600k in a week which is good for him. but now he is worried his next one wont do that good. i think thats dangoures. you cant keep chaing that ehohic high of very video being your most watched. when my last video broke every record for my channel i was simtansly very excited nut also very nervvous. i gained almost as many new subs as total subs i had a month before. my 1st thought was i have to get another video out as fast as possible i cant let thjem down. but i went to my local coffee shop to come down. yes i am greatful butif i wanna show it i have to take time with my bext video and put it out right. youtube is a very pariasolocal realship and the momment people start feeling like there just a number is the mommnet they stop caring about what you do. yes your videos might still do well because they are reaching the caucal auddince but a casual viewer want stay around for ever. take tekking for explae people trust him so no matter wwhta he talks about people ride for him because he erad that. when people feel like your titles are lies or stretching what clickbate bate is to the absusle limit. this will add up and you lose the people that helped you grow in the first place. you may not notice they the ones thatd leveling but i belive they are and should be heard because without them youtubers would be able to do what they ;ove for a living.   \nmanu knows about these rctitucs he dropped  very lengthy reddit post explaining histhoughts on spoilers and clickbate. it was very well thought out and kinda sweet. you can tell he really loves what he does. it what makes his video special but the thread basically followed the same logic as GrandLineReviews. \"if people hate my clickbate and spoilers so bad why are they clicking them\" its quit litterly getting blinded by sucuess. its  \n the youtuber equvenly to a underground artisty blowing up off a unique sound, siging to aa amjor label and putting out a generic radio single. most of those artist dont last.  i think he still makes wonderful video. i just hope he doenst let the stress ruin the fun job he eranmed for himself. manu just keep making fun videos. you are so good at it. you sellexiting better lamost any youtuber i seen. leen ito that and just  title them just a little less vague and clickbaty  and keep your core audince trust.thats the only way to make a life long career out of youtube. because there many many channels blow up on youtube at the core of almost every one of there downs was when the auaince lost faith in them. rememer rice gum. his channel has 10 million susbscribers but is now a dead channels because his audine felt like he forgot where he came from. \n\n&amp;#x200B;\n\n&amp;#x200B;\n\nAnd Thanks to the big 3 and that effect. Manu was completed hooked and very quickly spiraled down the outaku rabbit whole. He binged Anime after anime and began exploring the japansse culture even more. He did find a lot of things he felt where weird but mostly thought it was wonderful. He fell in love with the ramen, samurais and onsens. Which made him appriate the anime astetic even more.leading him to attempt to learn jappases. Not half assed either he used old text books and online resorse to eveually became fluent which is no easy task. japnasse is one of the hardest langue to learn. He even has a video explaining his journey of learning the langue which I would reccomned. Its such a fun and cool watch and makes you realize he probably could made a career on YouTube doing any niche. He is a good story crafter. In case you haven’t noticed he kinda has a obsessive nature becoming complete ingulphed in anything he does. a perfectionist of sort. This will be one of the main things that is both helping and hurting him in present day. All his interests where feeding off each other leading Manu to create his YouTube channel Ohara on September 24th 2018.\n\nAnd before I we get into the best part of the video. I just wanna say Thank you so much for the reaction to my tekking 101 video. i thought my like goal of 178 was to ambiobous of me. but you guys obliterated it. showing that the pirate diaries fleet is the strongest up and coming crew on the youtube seas. had a grown man crying like shiroshi. The like Goal for this video will be 201 but only like it if you enjoyed this video or learned something. let me know in the comments who I should do next and why\n\nManu made his channel so he could share his intrest with the world. Because one piece was he favorite series at the time and he had a lot of opinions on it. It became the primary focus of his channel. which explains why it was named after the island of ohara. a island in one piece and Home to our favorite argeiolgist. His initial videos focused on One Piece Chapter reviews, charter breakdowns, and various Ansysis videos. these deep dives built he a solid fan base rather quickly compared other successful anitubers. This is likely to do with his focus on production from very early on. Ohara stated that when he first discovered anime youtube.He noticed that even the popular creators had very low production value when you compare them to big creators In other niches.\n\nSo he knew that putting in some extra flair would help him stand out. he was right that. he also had some unique prospectives, and all around excitement for the seris would bled through the video allowing him to gain a diehard fanbase rather quickly. 2 of my favorite video by are from this Time period is his “Orgin of the accident kingdom video and his Usopp deep dive but im just a sucker for lore.\n\nOff this content he reached 100 thousand subscribers in around 2 years. But this is nothing to compared to the growth he would soon see. He was also more interested in the Japanese culture than ever. Every time he would get ramen he would think” I wonder what this what it would taste in one of those crammed ramen shops in Tokyo. you know the ones in them steaming side streets you see in anime and movies. When ever he would watch anime or read manga he would be in aw of the festalives, mountains and Cities.\n\nI think you you know where this is going. In 2020 Manu left his home country and flew 6000 miles to Japan to have his own anime adventure. he was also was getting a lot better at getting the most out of every video and understanding how YouTube works. His titles where becoming less literal like “Why buggy knows about the one piece” which is a video about why he thinks buggy knows about the one piece. To titles like he currently uses like ” Oda just revealed Shanks true power in the new world” which on face value would be about a hidden strength or power shanks had that you might have missed but instead is about how we got to see more of shanks allies in a recent chapter. the sneaky title worked. The video broke 400,000 rather quickly and may be the most views chapter review of the week but it did come with its drawbacks. Vague or clickbaity titles are nothing knew to the anime community. So you may be wondering why im bringing this up in this video. That’s because I belive that ohara is the person who made it common place because he showed it works. troughout the last few years Manu has given us a master class in the pro and cons on mastering Youtubisms. \n\nLets dive into the trechious Waters of Clickbate. The right and the wrong ways it is used\n\nThe best example of this working dropped July 28th 2021. when Ohara dropped his legendary video ‘The Best one piece theory you’ll ever watch, I guess” this video currently sits a 4.1 million views. making it the most viewed one piece video ever made by a Youtuber and it deserves it. The video was fun, creative and unique. Ohara had dumped every skills he had accired up til then into this video. One Piece Ansyis, Goldy production, and Camera switches mixed with B roll that always keep your attention. All of this made the video feel more like an anime episode then a YouTube video. He decision to learn Japanese also came background to help. \n\nIt allowed him to research a whole new world of one piece Anlsyises and theories. Through this he learned how import Canji and noumeolgies was to one piece. Through his research he would discover Japanese one piece theriest. YUDE-Ro and they would collbrate on on the infomeneton Super theory\n\nIts hard to put into words how much this broke one piece tube for a week. Every video on every channel was either the creator reacting to, arguing against or reviewing this video. Even Grandlinereview admitted that okras video got so many impressions it cut his normal views in half that week.\n\nThis brings us to one of the many ways he influenced the niche. he accidnetly created a new meta. Super theories. Ohara video was 22 minutes long which was unheard of at the time. I mean Unless you are tekking but im talking about for us mere humans. But after manus video people started dropping 30 minute plus videos where the creator is trying to “blow your mind” like ohara did with his video. There is even a 3 hour one piece theory out right now. That’s as long was the batman movie. Im not saying that’s a bad things but sometimes it does feel like everyone is taking there videos super serious these days and that can make them less fun. Basically Manu made people realize that one one piece videos can reach way more people then they ever thought the one piece niche could. What some call the casual audience. a part of the videos explosion was the vague title. It wasn’t spsfic enough to alienate casual viewers. a more spefic title with key words about the void centry or imu may have cut the views in half. This completey changed how people started titling there videos. Every One Piece creator started naming there videos things like “the best blank theory you’ll ever see” \n\nThis wild theory will blow your mind” “This theory Makes to much since” including me on at least one video. Unless until recently it was my best performing.\n\nBut the reason I dont belive Ohara original video was clickbate was because he over delivered. Weather you believed it was the best theory ever or not. You knew he tried his absute best and you left the video thinking i believe he believes this is the best theory video ever. it felt genuine. it felt like he was excited to blow you mind. But it was almost like it worked to well for him and other creators.\n\nAnd they started taking titles to far. \n\nManu, Glr and others who had figured how to min max YouTube.\n\nbecoming addicted to the ehphic high that comes with breaking your previous most watched video. A forever moving goal post. I know this because when Manu even mentioned that he had a video do extra well lately. I think it was a Zoro video and it hit around 600 thousand views in a week and he is worried his next one won’t do as well. Although that’s a understable feeling, I do find it troubling. If every video is your best or very video blows our mind then nothing does. So if your titles are thumbnails are so overly focused on getting every last view from every video that your even okay with tricking your loyal sucbribers to reach that sweet causal viewer it can be disheartening as a fan. It makes them feel like they are just a number to you. Ohara is so entering to watch that I dont think getting 10 percent more views is worth pissing off your o.g. audience. By dialing the title back just a little he would be eliminating the only thing I see people critiquing him for. The controversy to befit doesn’t seem worth it to me.\n\nLets take look at that shanks power video we previous menetion. The very top comment is a sacsrstic anologment that he didn’t delivery on the title. “ I really liked the part where he explain shanks true power.” Ohara hearted it and a another commenters reply. explaining that its a play on words of the word power. But the thing is I assume the original commuter already knew that but just felt he crossed the line into type 2 clickbate. The kind that is deliberately misleading. i think ohara was trys to do is type 1. Be hyperbolic but honest about the video but what I think most big YouTubers dont relize tho is its not up to you to decide which is which. Its up to your adduice. 1000 people liked that comment that’s 1000 people that agreed it was bad clickbate. That’s 1000 people that may not click the next video because they dont trust you. Basically creating Anti Clickbate. They see you post a cool title and think nay he is probably lying.\n\nLike Regan a commuter that said \n\n‘This is why I never I no longer click his conent” a thousand may seem small because his video get so many views but that is likely 1000 of his original subscribers. To me its better to have 300 loyal supporters then 100,000 fair weather fans because those 300 will be with you through the ups and downs as long as you do right by them.\n\nLets take a look at the previous mention reddit threads. the redditer showed a side by side comparison to Ohara old videos and new ones asking what happen? Receiving 617 up votes. The most thumbs up reply stating that they recently unscribbed from his channel. The primary reason of not being a fan of his new style of titles and thumbnails. \n\nthough I enjoy both ohara and others who practice hard core youtubism I dont agree with why they clickbate or use spoilers. I think they are getting lost in the numbers and letting it justify quesnable behavior. I know because when you read ohars reddit post on spoilers and watch Liams video on clickbate they both use their views and other youTube ansytis to justify there YouTube practices. Ill leave ohares response to the accusations in the description and\n\nI think you should read the thread for your self because I think its a good read and you can tell how much he really loves YouTube and one piece. But I think he just needs to belive in himself more. He claims the reason he doesn’t think he can’t afford not to fix these things is that people like tekking had a head start and dont need to clickbate or use spoilers because they have loyal fanbase that would watch them no matter what. but to me ohara loyal fanbase was what got him to the point where his super theory could take off. Even today most of his most watched videos are videos where he title are pretty straight forward. He’lI find the perfect mix. I think he is moving in the right direction with his new content being a mix of his old and new style. I love his new videos like all 82 backstories in one piece explained. It feeds his go audience and I think that’s import for a long career on the platform. If people think you sold out weather its YouTube, music or acting. They will stop supporting you. But I think he’s got this. but let me know what you think you think about ohara! [https://youtu.be/NxZz9BIH9Gs](https://youtu.be/NxZz9BIH9Gs)",
        "created_utc": 1678751739,
        "upvote_ratio": 1.0
    },
    {
        "title": "From the Korean Fried Chicken Place by my Apartment",
        "author": "foggywho",
        "url": "https://www.reddit.com/gallery/11qqcbc",
        "text": "",
        "created_utc": 1678751699,
        "upvote_ratio": 1.0
    },
    {
        "title": "Finally caught up - continue with show or transition to manga?",
        "author": "Tay__Keith",
        "url": "https://www.reddit.com/r/OnePiece/comments/11qqc9g/finally_caught_up_continue_with_show_or/",
        "text": "*No Spoilers past episode 1052/Chapter 1027*\n\nStarted my journey with One Piece last May and have been absolutely enamoured by the show; in big part by fan contributions with projects like One Pace, I was able to watch the show with minimal pacing issues - definitely spoiling me with a more polished watching of the show. \n\nHowever, as many of you know, One Pace has only edited Act 1 of Wano, and now having watched the anime up to its current airing, the pacing issues are becoming brutally apparent. \n\nI have actually never read a manga, and even shows like AOT, I’ve stayed a faithful anime watcher simply because of the anime’s ability to make the show larger with life, combining stellar animation and music. One Piece, similarly, has been in a really exciting place with the anime, with Luffy’s third fight against Kaido and Sanji/Zoro respectively facing off against the Queen and King. \n\nBringing me to my final questions:\n\n1) considering how little may be left of Wano, should I stick with the anime or simply make the transition to the manga regardless?\n\n2) having never read mangas asides from jujutsu zero in print, is there a medium folks would advise and, if digital, a website to view/purchase the manga?",
        "created_utc": 1678751695,
        "upvote_ratio": 1.0
    },
    {
        "title": "No morals sanji w raid suit vs katakuri",
        "author": "3sperr",
        "url": "https://www.reddit.com/r/OnePiece/comments/11qq296/no_morals_sanji_w_raid_suit_vs_katakuri/",
        "text": "Who wins? Would sanji be able to be like luffy and improve his observation haki to the point where he can fight against kata's future vision?",
        "created_utc": 1678751043,
        "upvote_ratio": 1.0
    },
    {
        "title": "If you ever feel like giving up remember",
        "author": "jumptooconclusions",
        "url": "https://www.reddit.com/r/OnePiece/comments/11qpz49/if_you_ever_feel_like_giving_up_remember/",
        "text": "https://preview.redd.it/fevixjay9lna1.jpg?width=699&amp;format=pjpg&amp;auto=webp&amp;v=enabled&amp;s=b938e59fae02bd3b12e45003fce638db7760dc28\n\nThis is probably going to sound cringe and come off cheesy but if one person reading this is impacted by this then good enough. Some people might say that it's a cartoon and it's not that deep but this single line right here saved my life and gave me renewed mindset going forward. After failing college over and over again pushing 30, I had felt embarrassed, I was... I am a good for nothing loser who's own family stopped asking me when I'm going to graduate college because they already knew the answer. My peers had already graduated a while back, some were even pursuing their PHD at that point. Truthfully it's my own fault, overly ambitious trying to rush by overloading classes with a sense of urgency, like the tiger hunting 2 prey and catching none, I would have been better off had I just taken 2-3 class and put my focus on them.  I had a reached a point where I hit academic suspension after failing Linear Alg for the 3rd time and I  was about ready to end it honestly. \n\nBut I remember when this chapter came out in the fall of 2021 as classes were starting again and I had no way to explain to my family who kept supporting me as their first college graduate in the family, that I wouldn't be able to take classes that semester because I was on academic suspension again. This specific line right here hit me, I'm not ashamed to say I cried for the first time in a long time. How stupid was I, even thinking about taking my life, I would have hurt all the people that cared about me. And more importantly: **As long as I lived, I had an infinite amount of chances.** If I took my life, it would have ended, and the pain I carried wouldn't have disappeared, it would have been handed off to the people I left behind. \n\n**I'm happy to say that this spring I am finally graduating with my Bachelors in Electrical Engineering. Oda might not have realized the impact that single line had on one no good idiot, hell none of you reading this might not even realize the impact that you had on someone, but It quite literally meant the world to me so Thank you Oda.**\n\n**TLDR: If you ever feel like giving up remember, as long as you live, there will be infinite chances. So just keep on living and getting back up like our captain Luffy**",
        "created_utc": 1678750835,
        "upvote_ratio": 1.0
    },
    {
        "title": "Nami's butt shot by Maxdoro (cant link post two images)",
        "author": "BathroomNew9406",
        "url": "https://www.instagram.com/p/CpsjmtUrLbb/",
        "text": "",
        "created_utc": 1678750620,
        "upvote_ratio": 1.0
    },
    {
        "title": "Theory: Peak Conqerors Haki Users (Shanks, Roger) can manipulate fate. (Post Wano Spoilers)",
        "author": "EmptyCreditCard",
        "url": "https://www.reddit.com/r/OnePiece/comments/11qpsxv/theory_peak_conqerors_haki_users_shanks_roger_can/",
        "text": "I saw a theory a few days ago on here about Shanks potentially having a Fate Manipulation devil fruit. I think he was on the right track, but I think this ability is actually linked to Haki.\n\nI believe there is a grand fate that exists I'm the One Piece world that everyone and everything follows it, Future Sight is the ability to see glimpses of this grand fate. Madame Sharly like has the ability to see far into the future of this fate hence why see saw the destruction of Fish Man Island. Mihawk is known as the Clairvoyant One and in Volume 4 Billion Yassop was confirmed to be able to constantly see the future. I think Peak Future Sight is the ability to see all of this Fate. \n\nNow for Conqerors Haki, I think Peak Conqerors Haki gives you the ability to change this grand Fate hence why Shanks is known as the Killer of Future Sight, because he can change this Fate at will, seeing it would be useless against him. I think this ability in combat would be similar to Vanessa's ability from Black Clover, if you aren't familiar, it essentially allows her to influence causation and \"undo\" and things she didn't want to [happen.](https://imgur.com/a/Al1dCJK)\n\n#Examples of it being used:\n\n1. Shanks may have used it when he saved Luffy from the Lord of the Coast, he was nowhere nearby and just appeared instantly. This could just be high speed movement, but my later examples lead me to believe [otherwise.](https://imgur.com/a/xw5amJu)\n\n2. Shanks used this again at Marineford where he appears out of nowhere again to save Koby, but this time Shanks says [\"For better or worse, those few seconds if courage will profoundly influencethe fate of this world!\"](https://imgur.com/a/HEGSyLQ) this could also be a hint that Koby may have this same fate Manipulation ability (and in extension Conqerors Haki) and changed fate to one where Marineford ends with a lot less bloodshed.\n\n3. Shanks may have used this ability again in Wano. Aramaki was about to skewer Momo when he just suddenly stops. People think he just got scared shirtless, but I think Shanks used this Fate Manipulation ability again and prevented him from [dying.](https://imgur.com/a/aegllPF)\n\n4. In Chapter 0, Roger is surrounded by a fleet of Shiki's ships then out of nowhere a massive storm comes and destroys half of the [fleet](https://imgur.com/a/fmm7SgI)\nI believe Roger used this same fate ability here as well.\n\nSo I think that future sight is actually fate sight and Conqerors Haki Users have the ability to change this Fate.\n\nTl:Dr: Shanks OP",
        "created_utc": 1678750436,
        "upvote_ratio": 1.0
    },
    {
        "title": "Theory: Weevil will be…",
        "author": "AvuncularPederast",
        "url": "https://www.reddit.com/r/OnePiece/comments/11qpo34/theory_weevil_will_be/",
        "text": "Rescued by a combination of Cross-Guild and Marco. The government is occupied right now between garp vs BB, GreenBull fleeing Wano, Kizaru on his way to Egghead, Fujitora possibly hunting down Law, and it’s unlikely Weevil sits in Impel Down for the rest of his life. Cross-Guild likes hiring ex-Warlords, Weevil is a great candidate. Either they rescue him before Impel Down, or they do an Impel Down jailbreak again and release+recruit Mingo while they’re at it.",
        "created_utc": 1678750125,
        "upvote_ratio": 1.0
    },
    {
        "title": "Robin Cute Manga Outfit by K164 : OnePiece",
        "author": "BathroomNew9406",
        "url": "https://www.pixiv.net/en/artworks/105152658",
        "text": "",
        "created_utc": 1678749641,
        "upvote_ratio": 1.0
    },
    {
        "title": "Finished my Going Merry piece today! She's a beauty!",
        "author": "godlyanii",
        "url": "https://i.redd.it/shbi7tiurmna1.jpg",
        "text": "",
        "created_utc": 1678749394,
        "upvote_ratio": 1.0
    },
    {
        "title": "Finished up my Going Merry piece today! She's a beauty.",
        "author": "godlyanii",
        "url": "https://www.reddit.com/gallery/11qpaaw",
        "text": "",
        "created_utc": 1678749249,
        "upvote_ratio": 1.0
    },
    {
        "title": "Who made the bigger blunder not realizing immediately?",
        "author": "Flying_Turtle_Bob",
        "url": "https://www.reddit.com/r/OnePiece/comments/11qp9q1/who_made_the_bigger_blunder_not_realizing/",
        "text": "[Zoro](https://i.imgur.com/ztvzzsN.jpeg)\n\n[Vivi](https://i.imgur.com/Vlzcp4M.jpeg)",
        "created_utc": 1678749212,
        "upvote_ratio": 1.0
    },
    {
        "title": "Sanjis stupidness",
        "author": "ShidoItszuka",
        "url": "https://www.reddit.com/r/OnePiece/comments/11qp86c/sanjis_stupidness/",
        "text": "Does anyone else think sanji is the embarresment of the crew, like this dude caught by a female got beaten up just cause he said he'll never hit a women, like comon dude u know u have to stop with that promise when someone is crossing the line.\nGot beaten up by some random ass spiderwomen and he could easily escape as u guys could see he freed himself once with diable jambe i don't know why he didn't do it again?",
        "created_utc": 1678749106,
        "upvote_ratio": 1.0
    },
    {
        "title": "Absolams powers.",
        "author": "SeniorPinksBonnet",
        "url": "https://www.reddit.com/r/OnePiece/comments/11qp5bt/absolams_powers/",
        "text": "Can anyone explain to me how absolam pushes people away in thriller bark. Like does his fruit give him invisible shock waves or something?",
        "created_utc": 1678748921,
        "upvote_ratio": 1.0
    },
    {
        "title": "Not sure if this considered fanart but it’s definitely a sketch i made during math class 😼",
        "author": "One-Piece-Warlords",
        "url": "https://i.redd.it/899k9sjxpmna1.jpg",
        "text": "",
        "created_utc": 1678748749,
        "upvote_ratio": 1.0
    },
    {
        "title": "Who made the bigger blunder not realizing immediately?",
        "author": "Flying_Turtle_Bob",
        "url": "https://www.reddit.com/gallery/11qp2l1",
        "text": "",
        "created_utc": 1678748749,
        "upvote_ratio": 1.0
    },
    {
        "title": "Should I skip Skypiea? I’m on Episode 169 and it just feels sooooo boring and slow.",
        "author": "ToughHot308",
        "url": "https://www.reddit.com/r/OnePiece/comments/11qovv8/should_i_skip_skypiea_im_on_episode_169_and_it/",
        "text": "This arc just feels alot more different than the others. I feel the Jaya arc was even better than this. The pacing just feels so slow, and everything is dragged out.",
        "created_utc": 1678748348,
        "upvote_ratio": 1.0
    },
    {
        "title": "Got some sweet posters for my birthday! Here's my dad pointing to whom he thinks is named One Piece",
        "author": "noremacrose",
        "url": "https://i.redd.it/pyxxmkkgomna1.jpg",
        "text": "",
        "created_utc": 1678748257,
        "upvote_ratio": 1.0
    },
    {
        "title": "Zoan devil fruits question",
        "author": "Sentowar",
        "url": "https://www.reddit.com/r/OnePiece/comments/11qorox/zoan_devil_fruits_question/",
        "text": "It is considered that zoan devil fruits give it's user more strength, stamina, recovery rate etc. But where it was stated that all those benefits are granted *passively,* outside of transformations?? \n\nYeah, zoans are the best for boosting physical strength, but it is true due to transformations. And never stated otherwise. For example, in W7 at Iceberg house Lucci showed rokushiki technics and then he used more destructive moves in hybrid form. Also in Enies Lobby after Kaku ate his DF he wasn't shown any stronger outside of transformations. \n\nFurthermore, almost all durability \"feats\" were in hybrid/full/awakened form. For example, in Wano every time Ulti was taking damage she was in ner hybrid form, but the final attack by Nami/Zeus she recieved in \"base\" form and passed out.  \n\nFaster recovery rate was mentioned in Impel Down by Croc, and he was talking about awakened zoans.\n\nI stambled on this thought when some people were talking about Luffy's feats are not that impressive since he is confirmed zoan now and I really curious where all this talking came from.",
        "created_utc": 1678748086,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is it the same footsteps? 🤔",
        "author": "breaker004",
        "url": "https://i.redd.it/jlztuk1onmna1.jpg",
        "text": "",
        "created_utc": 1678747988,
        "upvote_ratio": 1.0
    },
    {
        "title": "I’m dying for one piece",
        "author": "Latter_Vast_9939",
        "url": "https://www.reddit.com/r/OnePiece/comments/11qoh7x/im_dying_for_one_piece/",
        "text": "any good suggestions on filler or movies? I’ve seen everything at least 100 times",
        "created_utc": 1678747436,
        "upvote_ratio": 1.0
    },
    {
        "title": "Luffy &amp; Shanks reunion, I'd love one of these but Oda loves to defy expectations. How do you think it will play out?",
        "author": "kickadoodle",
        "url": "https://i.redd.it/0b51upef3lna1.png",
        "text": "",
        "created_utc": 1678747166,
        "upvote_ratio": 1.0
    },
    {
        "title": "Imu will beat Luffy with it's own weapons. He's the strongest toon in town 👀",
        "author": "Lartnestpasdemain",
        "url": "https://i.redd.it/vnbk54urjmna1.jpg",
        "text": "",
        "created_utc": 1678746682,
        "upvote_ratio": 1.0
    },
    {
        "title": "Doflamingo One piece or JoJo?",
        "author": "binksfamily",
        "url": "https://i.redd.it/lo32l7uljmna1.jpg",
        "text": "",
        "created_utc": 1678746626,
        "upvote_ratio": 1.0
    },
    {
        "title": "Luffy &amp; Shanks reunion, I'd love one of these but Oda loves to defy expectations. How do you think it will play out?",
        "author": "kickadoodle",
        "url": "https://i.redd.it/w72s4pvyzkna1.png",
        "text": "",
        "created_utc": 1678746440,
        "upvote_ratio": 1.0
    },
    {
        "title": "Posing like a mermaid but is Nico Robin and I can't swim. Life. /GloryLamothe",
        "author": "GloryLamothe",
        "url": "https://i.redd.it/o95akirezkna1.jpg",
        "text": "",
        "created_utc": 1678745870,
        "upvote_ratio": 1.0
    },
    {
        "title": "Robin Cute Manga Outfit by K164",
        "author": "BathroomNew9406",
        "url": "https://www.pixiv.net/en/artworks/105152658",
        "text": "",
        "created_utc": 1678745611,
        "upvote_ratio": 1.0
    },
    {
        "title": "Two works I did recently, which one you like the most?",
        "author": "Pezzodinerd",
        "url": "https://www.reddit.com/gallery/11qnk96",
        "text": "",
        "created_utc": 1678745438,
        "upvote_ratio": 1.0
    },
    {
        "title": "Two works I did recently, which one you like the most?",
        "author": "Pezzodinerd",
        "url": "https://www.reddit.com/gallery/11qnk3e",
        "text": "",
        "created_utc": 1678745427,
        "upvote_ratio": 1.0
    },
    {
        "title": "Two works I did recently, which one you like the most?",
        "author": "Pezzodinerd",
        "url": "https://www.reddit.com/gallery/11qnjzy",
        "text": "",
        "created_utc": 1678745423,
        "upvote_ratio": 1.0
    },
    {
        "title": "Chapter 236 Luffy vs Usopp",
        "author": "Ok-Minimum4607",
        "url": "https://www.reddit.com/r/OnePiece/comments/11qn920/chapter_236_luffy_vs_usopp/",
        "text": "Extremely satisfying as Luffy smashes Usopp with one punch. The fight should have been over much earlier. If Usopp fought the same way all the time, he wouldn't be the useless piece of work he is in the rest of the story. Usopp shouldn't have gone back to the crew, the same way they should have abandoned Sanji.",
        "created_utc": 1678744776,
        "upvote_ratio": 1.0
    }
]