[
    {
        "title": "One Piece: Pirate Warriors 4 Zoro 😎. Subscribe and enjoying daily OnePiece Shorts.",
        "author": "Dr_gamerr",
        "url": "https://youtube.com/shorts/xUh7XkBCQ2A?feature=share",
        "text": "",
        "created_utc": 1678243384,
        "upvote_ratio": 1.0
    },
    {
        "title": "Some sketches I’ve done of ryuma and FRANKY!",
        "author": "AccurateHistory1817",
        "url": "https://www.reddit.com/gallery/11ljhnp",
        "text": "",
        "created_utc": 1678242379,
        "upvote_ratio": 1.0
    },
    {
        "title": "One Piece Havaianas in Brazil",
        "author": "Tajaran",
        "url": "https://i.redd.it/42kz4n0wugma1.jpg",
        "text": "",
        "created_utc": 1678241941,
        "upvote_ratio": 1.0
    },
    {
        "title": "what was more sad sabaody or marineford",
        "author": "mrprodigy67",
        "url": "https://www.reddit.com/r/OnePiece/comments/11lj4ib/what_was_more_sad_sabaody_or_marineford/",
        "text": "Now me personally I think it's sabaody but what do you think",
        "created_utc": 1678241443,
        "upvote_ratio": 1.0
    },
    {
        "title": "Blackbeard and his crew have the potential to be much worse than Imu ever could be.",
        "author": "Kusokuso69",
        "url": "https://www.reddit.com/r/OnePiece/comments/11liy5o/blackbeard_and_his_crew_have_the_potential_to_be/",
        "text": "Imu does not seem to be the type that is a combatant given how their sword skills arent very good as seen when they cut up some paper. And their power seems to be from some link to a sky weapon rather than personal power.\n\nIf Imu truly was strong, they wouldnt be afraid to go outside and face the world. Imu likely has had the Op Op fruit immortal surgery performed. And they still, after almost a millenium, are not a complete ruler of the world.\n\nIf Blackbeard somehow got the immortal surgery and the sky weapon, he would be able to plunge the world into deeper darkness. Since he actually has personal power, he will be able to actually go out into the world. And since his fruit and network allow him to hunt devil fruits easier than the WG, he can make his guys immortal as well.\n\nSo the basic thing is that Blackbeard and his crew can become Imu and the celestial dragons if they were out and about in the world instead of lounging around in Marie Geoise. \n\nThey would be a bunch of sorcerer kings going around and terrorizing the world.",
        "created_utc": 1678240979,
        "upvote_ratio": 1.0
    },
    {
        "title": "What if Strawhat is a character from Sport Manga",
        "author": "Yellowkanoha",
        "url": "https://www.reddit.com/r/OnePiece/comments/11lix91/what_if_strawhat_is_a_character_from_sport_manga/",
        "text": "What if Strawhat is a character from Sport Manga or what sport suitable for each of them\n\n&amp;#x200B;\n\n1. Luffy - Boxer (Hajime no ippo)\n2. Roronoa zoro - Baseball (Diamond no Ace)\n3. Nami - Tennis (Prince of tennis\n4. Usopp - Basketball (Slamdunk)\n5. Sanji - Football (Blue lock)\n6. Chopper - Mascot\n7. Franky - American Football (Eyeshield 21)\n8. Nico Robin - Volleyball (Haikyu!!)\n9. Jinbei - Driver/Racer (Initial D)",
        "created_utc": 1678240912,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does anyone know where this is from? I think it's from Ennies Lobby but I'm not sure. From now on, thank you very much",
        "author": "Marshmaio",
        "url": "https://i.redd.it/68pryuelqgma1.jpg",
        "text": "",
        "created_utc": 1678240485,
        "upvote_ratio": 1.0
    },
    {
        "title": "I noticed this while rewatching one piece, oda is definitely a king of foreshadowing. let me know some other references to gear 5 in the community.",
        "author": "TheArtShack-22",
        "url": "https://i.redd.it/hhiy06s6qgma1.jpg",
        "text": "",
        "created_utc": 1678240348,
        "upvote_ratio": 1.0
    },
    {
        "title": "Vegapunk traitor theory",
        "author": "seedyProfessor",
        "url": "https://www.reddit.com/r/OnePiece/comments/11linti/vegapunk_traitor_theory/",
        "text": "[removed]",
        "created_utc": 1678240268,
        "upvote_ratio": 1.0
    },
    {
        "title": "The US Presidents Debate One Piece",
        "author": "PopcornHobby",
        "url": "https://youtu.be/QPsH0ksx4jk",
        "text": "",
        "created_utc": 1678240259,
        "upvote_ratio": 1.0
    },
    {
        "title": "New devil fruits",
        "author": "GroundbreakingNote35",
        "url": "https://www.reddit.com/gallery/11lijkl",
        "text": "",
        "created_utc": 1678239960,
        "upvote_ratio": 1.0
    },
    {
        "title": "Always One piece 🔥❤️",
        "author": "00Girlx",
        "url": "https://i.imgur.com/xlew4Q1.jpg",
        "text": "",
        "created_utc": 1678239619,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is one piece to you",
        "author": "Puzzled-End-9163",
        "url": "https://www.reddit.com/r/OnePiece/comments/11li78q/what_is_one_piece_to_you/",
        "text": "For me I view it not just as a show I view it as a form of art",
        "created_utc": 1678239066,
        "upvote_ratio": 1.0
    },
    {
        "title": "3d color poster I made",
        "author": "UnprejudicedMouse",
        "url": "https://www.reddit.com/gallery/11li52i",
        "text": "",
        "created_utc": 1678238916,
        "upvote_ratio": 1.0
    },
    {
        "title": "could shanks be the president or whatever of elbaf",
        "author": "Personal-Maximum-138",
        "url": "https://www.reddit.com/r/OnePiece/comments/11lhvy2/could_shanks_be_the_president_or_whatever_of_elbaf/",
        "text": "the people there seem to respect him a lot and he seeems to visit at least semi frequently aaaand it could explain why the gorosei gave him a pass during the reverie (where all the other world leaders were at the time)",
        "created_utc": 1678238257,
        "upvote_ratio": 1.0
    },
    {
        "title": "A possible reference hidden in the names of the Straw Hats’ ships",
        "author": "ShotOfBruschotti420",
        "url": "https://www.reddit.com/r/OnePiece/comments/11lhoyk/a_possible_reference_hidden_in_the_names_of_the/",
        "text": "Both of the Straw Hat ships seem to be subconscious references to Joy Boy.\n\nGoing MERRY = joy\nThousand SUNNY = sun god\n\nSorry if that’s already been established here or something, I just keep thinking about it and wanted to share just in case lol",
        "created_utc": 1678237754,
        "upvote_ratio": 1.0
    },
    {
        "title": "Straw hats vs Blackbeard pirates",
        "author": "Accomplished-Map-651",
        "url": "https://www.reddit.com/r/OnePiece/comments/11lhkql/straw_hats_vs_blackbeard_pirates/",
        "text": "How do you think that the fights between the straw hats and Blackbeard pirates would go\n\nI personally would like to see them have twisted versions of their fighting style( for example Burgess throws everything at jinbei but the water)",
        "created_utc": 1678237457,
        "upvote_ratio": 1.0
    },
    {
        "title": "I think I know who is the 10th Titanic Captain of BlackBeard Pirates",
        "author": "Enough_Blueberry1855",
        "url": "https://www.reddit.com/r/OnePiece/comments/11lhivd/i_think_i_know_who_is_the_10th_titanic_captain_of/",
        "text": "This is only a theory\n\nMaybe that the 9th ship and the 10th ship are always together\n\nThe 9th ship is commanded by Doc Q\n\nThe 10th ship would be commanded by the one who is always with Doc Q, his best friend\n\nAnd that person would be: Stronger\n\nWe recently learned that Stronger ate the Horse-Horse fruit : Model Pegasus\n\nWhen an animal eats a zoan devil fruit, they keep their original species traits and get the zoan species trait, like Chopper having both human and deer traits, or Pierre having both bird and horse traits.\n\nBut now, Stronger just is Pegasus, which is literally a horse with wings.\n\nWhat if Stronger never was a horse, not even when we first saw him at Jaya?  \nWhat if Stronger was a human all this time?\n\nAt the present moment, we only know that Stronger ate the Pegasus fruit, we don't know yet what is his original species.\n\nSo, my theory, is that he is the 10th Titanic Captain\n\nWhat do you guys think?",
        "created_utc": 1678237324,
        "upvote_ratio": 1.0
    },
    {
        "title": "Pluton will be made... just not by Franky",
        "author": "maybe-a-bad-take",
        "url": "https://www.reddit.com/r/OnePiece/comments/11lhinc/pluton_will_be_made_just_not_by_franky/",
        "text": "So I know a popular theory is that Franky memorized the pluton plans before he destroyed them. This theory in my experience breaks into two separate lines of thinking. Either Franky will build a pluton for the final arc or the thousand sunny is a pluton or modified pluton. \n\nI don't like this theory for a couple of reasons that I will get into here. \n\nFirst, this theory feels like low hanging fruit and oda always gives us what we want in a way we don't expect. It's too easy to see coming. \n\nSecond this really doesn't do anything for Franky as a character. Franky makes new ships from his new designs he doesn't follow someone's plans he makes the plans always has. Making an old plan doesn't fit here. Also when the new pluton is made it has to be  destroyed in the final arc. Think about the two cases here: case 1 it is allied with the straw hats. For naritive tension and so that the straw hats including the sunny stay the heros it will be destroyed by there enemies maybe even original pluton. Or case 2 it is against the straw hats then it makes a lot of sense for Franky to destroy it using the sunny making him the best ship builder ever.\n\nThird building a ship takes time. Oda can be fast and loose with time requirements at points however he does take these things into consideration. Heck the conclusion to one of the best arcs was \"we need more time to train\". If Franky can build this ship in a week or a whatever why hasn't he done it already? Why not build it to fight kiado or to infletrate whole cake island? It would feel super hollow at the end of the story for Franky to pull an ancient weapon out of his back pocket.\n\nFinally it ruins his bet on the straw hats. In envies lobby when Franky burns the plans he bets not only that the straw hats will save Robin but that they will stop pluton if it falls into the wrong hands. Also if Franky memorized the blueprints, the world government could extract it from him eventually. This was an all in all on the table moment for him. If he still has the plans he really didn't bet anything. \n\n\nSo if not Franky then who? Well there is really only one other candidate, Icepops! \n\nWhy Iceberg? Let's explore his resume to see.\n\nHe had the plans for years before handing them off to Franky. He easily could have memorized the plans in this time. He also has the skill and resources to build the plans. \n\nMoreover we know that the plans are insane. Franky questions if it is possible to build it when iceberg hands him the plans at first. We leave water seven with iceberg trying to do the seemingly impossible of turning an island into a fully functional ship. My bet is that this is pluton that he is trying to build he will have had years to work on it at this point solving the time issue. \n\nThe water seven arc is about family and choices. Franky is abandoned as a child which is tragic. He then finds Tom who chooses to take him in. Franky, Tom and iceberg all make ships together which Tom teaches the two kids to be proud of and to love and own no matter what just like how Tom loves them no matter what. At the end of the flash back Franky disown his ships which send Tom as he has to own and love his ships and the choice to build them even if it didn't work out in the end. Luffy on the other hand has to make tough choices of what to do about Robin betraying them, what to do about the going merry and usopp leaving the crew. All these choices are hard because they are all family so how much does family count  and for robin and the going merry are they family? Robin has to choose what she wants in life and has to choose who to trust herself or her family. Franky makes a huge choice to burn the plans fight the government and become a pirate. Iceberg at the start of the arc refuses to make choices. He is under attack for the plans and chooses to do nothing. He eventually passes the responsibility of making a choice to Franky. His island is sinking and he sits and watches it happen. At the end of the arc iceberg Finally starts to act he makes a choice to try to save the island even though he is not sure it's possible. If this is pluton the he has made a choice to bet it all on the straw hats like Franky. He is actively choosing the future that the straw hats are building rather then being a passive player allowing others to choose the future. \n\n\nThis also builds helps finalize frankys arc. Let look at what happens if iceberg builds pluton. Ice Pluton comes and is allied with the straw hats for the final arc. Either it gets stolen and the straw hats have to destroy it or it gets destroyed and the straw hats have to beat whatever super weapon brought it down. Either way having Franky use the sunny to destroy either pluton or the pluton killing weapon would prove he is the best ship builder ever. \n\nThank you for coming to my Ted talk. \n\n\nTldr: iceberg builds pluton",
        "created_utc": 1678237309,
        "upvote_ratio": 1.0
    },
    {
        "title": "One Piece laughs outside of One Piece",
        "author": "Overloadid",
        "url": "https://www.reddit.com/r/OnePiece/comments/11lhihj/one_piece_laughs_outside_of_one_piece/",
        "text": "I was wondering if there are laughs in other franchises that fit the One Piece laugh formula, like Popeye's laugh bring Ya Ka Ka Ka Ka.",
        "created_utc": 1678237300,
        "upvote_ratio": 1.0
    },
    {
        "title": "I need answer for this",
        "author": "Suntechn",
        "url": "https://www.reddit.com/r/OnePiece/comments/11lhauk/i_need_answer_for_this/",
        "text": "I just saw episode 511 it was huge magnet that can suck at Begge's ship, I curious and i really need answer for this one, what actually is it?",
        "created_utc": 1678236766,
        "upvote_ratio": 1.0
    },
    {
        "title": "Kaido's new opponent: Azure dragon vs Gold dragon [OC]",
        "author": "Repulsive_Risk_1242",
        "url": "https://i.redd.it/synic7i2wema1.png",
        "text": "",
        "created_utc": 1678236117,
        "upvote_ratio": 1.0
    },
    {
        "title": "Thousand Sunny soul",
        "author": "jistaro",
        "url": "https://www.reddit.com/r/OnePiece/comments/11lgysp/thousand_sunny_soul/",
        "text": "In the movie red the Thousand sunny's soul was turned into an alive puppy just like bepo and blueno.\nIs it one more thing that proves that the thousand sunny is alive and has a soul?",
        "created_utc": 1678235899,
        "upvote_ratio": 1.0
    },
    {
        "title": "Thousand sunny",
        "author": "jistaro",
        "url": "https://i.redd.it/roa48gqybgma1.png",
        "text": "",
        "created_utc": 1678235569,
        "upvote_ratio": 1.0
    },
    {
        "title": "Random theory",
        "author": "Tasty_Yesterday5437",
        "url": "https://www.reddit.com/r/OnePiece/comments/11lgqhq/random_theory/",
        "text": "I dont know if people already have discussed this, but i got this theory from recently reading the manga. What if either Luffy (or Shanks if he gets the hat) will pass on the hat to a new promising youngling and Luffy renames his crew to the new sun pirates? It wouldnt make sense to be the strawhats anymore and Jimbei and sun god nika and the whole fishman island/ joyboys promise kinda would make sense. The sun pirate logo has also been apart of the series from the very start.",
        "created_utc": 1678235319,
        "upvote_ratio": 1.0
    },
    {
        "title": "Jewelry bonney eating jajaja",
        "author": "Franichwan",
        "url": "https://www.instagram.com/reel/CpBd3TsNO7z/?igshid=YmMyMTA2M2Y=",
        "text": "",
        "created_utc": 1678235054,
        "upvote_ratio": 1.0
    },
    {
        "title": "Usopp is useless, but it's not his fault",
        "author": "Exotic-Current2507",
        "url": "https://www.reddit.com/r/OnePiece/comments/11lgilc/usopp_is_useless_but_its_not_his_fault/",
        "text": "Usopp is a sniper, his strategy should be to look for a good spot to hide and be able to support the crew, by gathering information about the enemies location and movement, shooting some minions and so on. Yet he keeps facing everyone face-to-face like he's a fighter of some sort, which he isn't, for the sake of that funny scene \"Hey look! Usopp is histerically running from the enemy again! Hahahaha!\".\n\nIn Wano, he could've just stayed at somewhere shooting at the enemies and it would've been great, but no, let's make him tag with Nami and be useless once again for no reason. It's frustrating.",
        "created_utc": 1678234783,
        "upvote_ratio": 1.0
    },
    {
        "title": "What was everybody’s first reaction when reading (or watching) this scene?",
        "author": "tostitosrolls",
        "url": "https://i.redd.it/9kumse169gma1.jpg",
        "text": "",
        "created_utc": 1678234622,
        "upvote_ratio": 1.0
    },
    {
        "title": "Officially revealed in the background of chapter 1077 you can see sniper kings official bounty as of egghead I just took a ss of it and coloured it and yeah here’s his official bounty",
        "author": "Kayla__69",
        "url": "https://i.redd.it/75s2v9dh8gma1.jpg",
        "text": "",
        "created_utc": 1678234391,
        "upvote_ratio": 1.0
    },
    {
        "title": "Teaming up with Lucci &amp; Kaku…why?",
        "author": "Saphsin",
        "url": "https://www.reddit.com/r/OnePiece/comments/11lg4qn/teaming_up_with_lucci_kakuwhy/",
        "text": "Don’t free them from their cuffs and just leave them to die.\n\nMaybe it’s the Straw Hats’ nature to not just distinguish between good and evil guys based on their background and past actions (even if the Straw Hats are good people who stand up to people doing bad things right in the moment) Although Luffy and Zorro clearly dislike the two, they don’t seem to see them as people who are just better off death.",
        "created_utc": 1678233845,
        "upvote_ratio": 1.0
    },
    {
        "title": "Spoilers for chapter 706/ episode 639",
        "author": "No-Tree6027",
        "url": "https://www.reddit.com/r/OnePiece/comments/11lfz79/spoilers_for_chapter_706_episode_639/",
        "text": "Who did Jean the bandit send to impel down? The one the random pirate was referring to as his “partner”?",
        "created_utc": 1678233505,
        "upvote_ratio": 1.0
    },
    {
        "title": "Lost my phone yesterday, so I made myself a Zoro background!",
        "author": "GladJackfruit723",
        "url": "https://i.redd.it/s4m3wc1j5gma1.jpg",
        "text": "",
        "created_utc": 1678233399,
        "upvote_ratio": 1.0
    },
    {
        "title": "Re-reading One Piece is Great",
        "author": "Williamsethroberts",
        "url": "https://www.reddit.com/r/OnePiece/comments/11lfsgd/rereading_one_piece_is_great/",
        "text": "For all my people caught up in the manga, go look at the jolly Roger symbol on the space pirate's hat in the Eneru cover stories in chapters 442 and 445.... Look familiar? The space suits themselves also look similar to some outfits we have seen recently...",
        "created_utc": 1678233048,
        "upvote_ratio": 1.0
    },
    {
        "title": "Anyone else think it's disrespectful how Zoro's family got explained in an SBS?",
        "author": "NikolasKage3",
        "url": "https://www.reddit.com/r/OnePiece/comments/11lfgtp/anyone_else_think_its_disrespectful_how_zoros/",
        "text": "As a disclaimer, I think the info is very cool and and some of it even shocking, such as the fact Zoro is related to Kuina and Tashigi.\n\nHowever, I find it disrespectful how all this info got revealed in an SBS, essentially a Q&amp;A section.\n\nZoro is the second main male character, the First Mate of the Straw Hats and the first member to join, and yet his story and lore are in my eyes treated by Oda as second-rate trivia.\n\nOther than the fact Oda did barely anything to improve and expand Zoro's character in Wano, an arc perfect for him to do that and a land Zoro has massive connections to, readers have to suck that info out of Oda in a Q&amp;A.\n\nWhile all the other Straw Hats, and even several side characters got proper arcs/multiple episodes to explain their characters and pasts, in very nice ways, especially Sanji and Luffy, Zoro got not even an entire episode in the begining, some tid-bits in Wano and several plot-points dropped (avenging Yasuie?, visiting Ryuma's grave?, Grim Reaper?). And now, he now even got the info about his family and ancestors, who are frankly very important to Wano and Zoro, since he comes from a family of legendary swordspeople and leaders of Wano, and Kuina being his relative, but it got revealed outside of the story...\n\nI don't know how to feel about this, honestly... I'm incredibly polarized, by being happy that we now know all of that info, but also being disappointed how Oda seems to care little about Zoro, at least him outside of fighting, which for the most part hasn't been that great in Time Skip (beacuse of enemies much weaker than him), excluding Wano.",
        "created_utc": 1678232280,
        "upvote_ratio": 1.0
    },
    {
        "title": "One Piece Film: Red",
        "author": "vidhu_byju",
        "url": "https://www.reddit.com/r/OnePiece/comments/11lf5x3/one_piece_film_red/",
        "text": "Anyone know where to watch film red in hd online. The websites I tried only have the cam version? If anyone knows a website please let me know.",
        "created_utc": 1678231562,
        "upvote_ratio": 1.0
    },
    {
        "title": "Sanji had a head start",
        "author": "Reasonable_Farm_5203",
        "url": "https://www.reddit.com/r/OnePiece/comments/11leypj/sanji_had_a_head_start/",
        "text": "[https://www.youtube.com/watch?v=TGT-VCJyWOg](https://www.youtube.com/watch?v=TGT-VCJyWOg)",
        "created_utc": 1678231104,
        "upvote_ratio": 1.0
    },
    {
        "title": "Pluton resurrected?",
        "author": "deeswarty",
        "url": "https://www.reddit.com/r/OnePiece/comments/11leoxn/pluton_resurrected/",
        "text": "I'm rewatching rn.. just saw in episode 118 when Crocodile mentions Pluton the visual they use looks eerily similar to how Lulusia was destroyed more recntly..",
        "created_utc": 1678230499,
        "upvote_ratio": 1.0
    },
    {
        "title": "today I decided to draw corazon(sorry if it's flipped on it side)",
        "author": "miss_random_lady",
        "url": "https://i.redd.it/nsm66kolwfma1.jpg",
        "text": "",
        "created_utc": 1678230400,
        "upvote_ratio": 1.0
    },
    {
        "title": "Captain and his first mate!",
        "author": "NotCinnanoe",
        "url": "https://v.redd.it/3vz2pi3jdema1",
        "text": "",
        "created_utc": 1678229877,
        "upvote_ratio": 1.0
    },
    {
        "title": "Yamato + Dalle",
        "author": "scaadbaby",
        "url": "https://i.redd.it/abxk727hcema1.png",
        "text": "",
        "created_utc": 1678229538,
        "upvote_ratio": 1.0
    },
    {
        "title": "[AI generated ending] i hope that the ending is nothing like that, imagine some of the crew dies for a message.",
        "author": "Notorious2169",
        "url": "https://www.reddit.com/gallery/11ldxho",
        "text": "",
        "created_utc": 1678228832,
        "upvote_ratio": 1.0
    },
    {
        "title": "Robin’s ultimate form theory! Super Centaur!! How would this form scale to the monster trio?",
        "author": "Affectionate_Dog_693",
        "url": "https://i.redd.it/nyqedncorfma1.jpg",
        "text": "",
        "created_utc": 1678228742,
        "upvote_ratio": 1.0
    },
    {
        "title": "Do Garp, Dragon and Luffy have ADHD?",
        "author": "Mason-Marine",
        "url": "https://i.redd.it/pvdoxqeuqfma1.jpg",
        "text": "",
        "created_utc": 1678228461,
        "upvote_ratio": 1.0
    },
    {
        "title": "Ordered Chopper figures and they all came broken except for one. Decided to make the best of it.",
        "author": "maitredestroy",
        "url": "https://i.redd.it/lh6y90kgofma1.jpg",
        "text": "",
        "created_utc": 1678227659,
        "upvote_ratio": 1.0
    },
    {
        "title": "Where is Pandaman?",
        "author": "dams77",
        "url": "https://www.reddit.com/r/OnePiece/comments/11lddi3/where_is_pandaman/",
        "text": "Hello fellow op fan.\nI remember back in the days, people will always spot pandaman in the chapters.\nBut i don’t see those post anymore, did oda just give up on him? If yes when was the last time he appended on a chapter?",
        "created_utc": 1678227617,
        "upvote_ratio": 1.0
    },
    {
        "title": "Beelzeboss by Tenacious D - 4:08",
        "author": "bisson_burger13",
        "url": "https://www.reddit.com/r/OnePiece/comments/11ldced/beelzeboss_by_tenacious_d_408/",
        "text": "This is how imagine the backstory for the Will of D will go down.\n\nhttps://preview.redd.it/wxv6r5wj6ema1.jpg?width=640&amp;format=pjpg&amp;auto=webp&amp;v=enabled&amp;s=4b88af08a90da59ceab0763a3db713c367521a26",
        "created_utc": 1678227548,
        "upvote_ratio": 1.0
    },
    {
        "title": "Beelzeboss by Tenacious D - 4:08",
        "author": "bisson_burger13",
        "url": "https://www.reddit.com/r/OnePiece/comments/11ld7xn/beelzeboss_by_tenacious_d_408/",
        "text": "These lyrics are how I imagine the backstory for the will of D will go down.",
        "created_utc": 1678227277,
        "upvote_ratio": 1.0
    },
    {
        "title": "One Piece Theory",
        "author": "One-Lobster-9955",
        "url": "https://www.reddit.com/r/OnePiece/comments/11ld16z/one_piece_theory/",
        "text": "I rarely make theories when I watch something because I usually suck at connecting dots and stuff, but I'm rewatching Enies Lobby rn and I noticed something when I saw Robin's past.There was this old archeologist in Ohara that revealed what they discovered after reading the poigne griffe: he talked about a really powerful population that had been defeated by someone(he suspects the government) in the 100 years void but somehow managed to leave proof of their existence through these stones. What if this population is somehow connected to the people that have the famous D. in their names?! Maybe they were their predecessors, or something like that?",
        "created_utc": 1678226870,
        "upvote_ratio": 1.0
    },
    {
        "title": "You'll have seen this theory here.",
        "author": "keeneisthegoat",
        "url": "https://www.reddit.com/r/OnePiece/comments/11lch0y/youll_have_seen_this_theory_here/",
        "text": "Actually every admirals are gonna lose against yonko/Yonko crews. All.\n\nHere's why :\n\nChapter 957 : \n\n - Fujitora vs Blackbeard. \n\nBlackbeard bounty is 2 247 600 000 berries. \nHe wants something he doesn't want to leave to the navy. \n\nChapter 1059 : \n\nHis bounty is 3 996 000 000 berries. More than 1,7 billion higher than his previous bounty. \n\nWHY? \n\nBecause he wasn't referring to the mero mero no mi. He crossed the calm belt, got what he wanted, and earned a huge bounty increase. \n\nBut Fujitora was also on calm belt. My bet is that Blackbeard defeated Fujitora and that Aokiji is FINALLY a member of his crew (his clothes changed, maybe that's an hint). \n\nSo Blackbeard vs Fujitora : Winner : Blackbeard. \n\n\n- Kizaru and Saturn VS Strawhats and cp0. \n\nMaybe the cp0 will turn against Saturn which would be interesting. As for Kizaru, he'll face Luffy and naturally lose. \n\n\n- Ryokugyu vs Mihawk. \n\nRyokugyu currently has Weevil prisoner on his ship. He has to cross calm belt to get to Impel down. \n\nTwo scenarios :\n\nThe first is that Mihawk attacks him while Ryokugyu and his crew are searching for food (or something else) \n\nThe other one is Impel Down 2.0 : Marco makes an alliance with the Cross guild and they go to Impel down. Obviously, an admiral will be here with Magellan, but that's not a problem. \n\nHints : Ryokugyu looks like he has a black blade with him, it may bode well. \n\n\n- Shanks vs Akainu : \n\nAkainu loses his temper. He has literally just learned that Law and Teach are fighting at Winner Island, that the mugis are at egghead, and that the cross guild is hunting the marines. When he'll learn that Kid and Shanks are clashing, he'll decide to leave his office. \n\n\nConclusion :\n\nNot all admirals will die. I think Fujitora is alive, Kizaru will also make it, and Ryokugyu will definitely lose his life. But it'll mark a big split between the world government and the navy. \n\nThat said, is it serious ? \n\nNot totally. Imu is actually ruling the world and she's probably not a weak person. The gorosei and Kong are also powerful fighters (probably). \nThey have extremely powerful technological weapons. \n\nAnd finally : the Seraphim. \nThe purpose of the seraphim is to protect God's throne (here we are talking about the \"empty\" throne). \n\nThey're already Yonko commander level and they're just children. Which means that at their prime, they'll certainly possess extremely high levels. \nThey're most likely 8 or 9. Maybe 10.\n\n So don't worry for the world government, even if they lose 4 admirals, they'll always be able to control the world. The only difference is that Imu will have to come to light.",
        "created_utc": 1678225648,
        "upvote_ratio": 1.0
    },
    {
        "title": "Just got to the timeskip and had a question:",
        "author": "Jarf_17",
        "url": "https://www.reddit.com/r/OnePiece/comments/11lbtxg/just_got_to_the_timeskip_and_had_a_question/",
        "text": "DISCLAIMER: I know next to nothing about the Japanese language and am just watching the subtitled version on Crunchyroll. Any reference to Japanese words will be written in English as best I can because I don't know how to write any of this in Japanese.\n\nSo I just finished the Summit War and noticed a bit of a discrepancy in the subtitles versus what I am hearing as someone who does not speak Japanese. Whenever Luffy is referred to as \"Straw Hat\" they always say something along the lines of \"Mugiwara\" (I don't know how to spell things in Japanese). Whenever Bon Clay talks to Luffy, he calls him \"Mugi-chan\", which the subtitles translate as \"Straw-chan\". Seems to check out to me, a non-Japanese speaker. However, whenever Ivan is talking to Luffy, he calls him \"Mugiwara-boy\", which get subtitled as \"Straw-boy\". Once again, I know almost nothing about Japanese as a language, but wouldn't it be more like \"Straw Hat-boy\"? I understand that direct translations rarely are perfect, and translating anything involves a bit of interpretation, but that seems a little inconsistent to me. Anyone able to enlighten me?\n\nI absolutely love the show nonetheless and will continue watching through to the end.",
        "created_utc": 1678224219,
        "upvote_ratio": 1.0
    },
    {
        "title": "The Future of One Piece: Cross Guild / Pirate God Buggy",
        "author": "Harmonious-",
        "url": "https://www.reddit.com/r/OnePiece/comments/11lbhwj/the_future_of_one_piece_cross_guild_pirate_god/",
        "text": "[removed]",
        "created_utc": 1678223481,
        "upvote_ratio": 1.0
    },
    {
        "title": "Will Brook make it back to Laboon or will it only be his tone dial?",
        "author": "FrostySoul3",
        "url": "https://www.reddit.com/r/OnePiece/comments/11lbdx6/will_brook_make_it_back_to_laboon_or_will_it_only/",
        "text": "I think Brook won’t make it back, but maybe Usopp makes it back and plays the dial for him.",
        "created_utc": 1678223239,
        "upvote_ratio": 1.0
    },
    {
        "title": "i drew Doflamingo. i hate this guy but he's my favorite",
        "author": "DoubleJumpCancel",
        "url": "https://i.redd.it/ka6pzh74rdma1.png",
        "text": "",
        "created_utc": 1678223020,
        "upvote_ratio": 1.0
    },
    {
        "title": "[Rough Draft Photoshop] Bob's Burgers One Piece Cosplay",
        "author": "ThaHomieDizz310",
        "url": "https://i.redd.it/t6brtymcsdma1.jpg",
        "text": "",
        "created_utc": 1678222798,
        "upvote_ratio": 1.0
    },
    {
        "title": "traitor (spoiler 1076)",
        "author": "karanPUNNI",
        "url": "https://www.reddit.com/r/OnePiece/comments/11lavbt/traitor_spoiler_1076/",
        "text": "I have a theory which might explain who is the traitor among the Stella's in egghead\nEveryone is blaming Shaka or Lilith or every other punk for kidnapping the REAL vegapunk and turning the seraphim against the crew and Stella's\nAs no kne could override the command given to them, it would mean one of the satellites is a traitor, or someone above in the hierarchy had issued the order. This seems the only logical theory till yet.\nHowever, I believe none of the vegapunks are thr traitors, nor the gorosei has issued to order\nIt was CATARINA DEVON, who had somewhat snuck into the island, and impersonated the real vegapunk while Bonney had turned him into a child. We all know blackbeard is making strides everywhere, sending his generals to various places( for eg kidnapping pudding). Catarina was sent b here to kidnap VP for his own use (which I don't know what are his intentions). Using her devil fruit, which has the same Function as BonClay's fruit, she turned into VP and gave the Seraphim the order\n\nThis is all a hunch, and I might be wrong, but this seems like the most plausible idea. \n\nTLDR; Catarina Devon is the traitor, who impersonated VP and ordered the seraphim to fight",
        "created_utc": 1678222134,
        "upvote_ratio": 1.0
    },
    {
        "title": "traitor(egghead)[spoiler]",
        "author": "karanPUNNI",
        "url": "https://www.reddit.com/r/OnePiece/comments/11latkk/traitoreggheadspoiler/",
        "text": "[removed]",
        "created_utc": 1678222025,
        "upvote_ratio": 1.0
    },
    {
        "title": "Starting vs Current",
        "author": "HarrisNGH",
        "url": "https://www.reddit.com/r/OnePiece/comments/11laquo/starting_vs_current/",
        "text": "Starting One Piece:\n“Man this is so long, how am I ever gonna catch up?”\n\n1000+ episodes deep:\n“I hope they aren’t close to the end yet!”",
        "created_utc": 1678221858,
        "upvote_ratio": 1.0
    },
    {
        "title": "Shiryu vs Zoro",
        "author": "BillyBobReddit124",
        "url": "https://www.reddit.com/r/OnePiece/comments/11laic3/shiryu_vs_zoro/",
        "text": "who takes the dub?",
        "created_utc": 1678221332,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why don't Chopper make rumble ball for other Zoans?",
        "author": "PhantomBrowser111",
        "url": "https://www.reddit.com/r/OnePiece/comments/11lahz1/why_dont_chopper_make_rumble_ball_for_other_zoans/",
        "text": "I'm especially interested in what will happen if Luffy ate one of those things",
        "created_utc": 1678221311,
        "upvote_ratio": 1.0
    },
    {
        "title": "I Made 3 Sword Style Real | Fight Like Roronoa Zoro (One Piece)",
        "author": "Modern_Ninja232",
        "url": "https://youtu.be/zbcTvpMjlQs",
        "text": "",
        "created_utc": 1678221080,
        "upvote_ratio": 1.0
    },
    {
        "title": "Random minor theory",
        "author": "Chiefosa",
        "url": "https://www.reddit.com/r/OnePiece/comments/11l9twv/random_minor_theory/",
        "text": "If indeed Kid pirates get in a Davy back fight with Shanks I believe that Kid will get Rockstar to join his crew….. prefect fit",
        "created_utc": 1678219805,
        "upvote_ratio": 1.0
    },
    {
        "title": "how to get back into it?",
        "author": "GOLD-KILLER-24_7",
        "url": "https://www.reddit.com/r/OnePiece/comments/11l9onu/how_to_get_back_into_it/",
        "text": "How should I get back into watching One Piece? I only watched the first 60 episodes and then quit for 9 months and I'm now looking to get back into it.\n\nShould I just watch it again from the beginning (I think I remember most of the main plot points) or should I just continue from where I left off?",
        "created_utc": 1678219490,
        "upvote_ratio": 1.0
    },
    {
        "title": "The OnePiece , The OnePiece Is Real !!!!",
        "author": "PirateMonkeyDLuffy",
        "url": "https://i.redd.it/4qqivl4dyema1.jpg",
        "text": "",
        "created_utc": 1678218883,
        "upvote_ratio": 1.0
    },
    {
        "title": "The Moment Fujitora Earned Everyone’s Respect🥲🔥 #shorts #onepiece #strawhats #fujitora",
        "author": "CtrlAltVenus",
        "url": "https://youtube.com/shorts/eMRmRwvYiZg?feature=share",
        "text": "",
        "created_utc": 1678218599,
        "upvote_ratio": 1.0
    },
    {
        "title": "What episode do you guys think this will be animated?",
        "author": "JustAGuy6369",
        "url": "https://www.reddit.com/r/OnePiece/comments/11l8uq0/what_episode_do_you_guys_think_this_will_be/",
        "text": "What episode do you guys think gear 5 will be animated? I saw this discussion about a year ago and want to know if you guys think it may still be within the 1060-1070 range",
        "created_utc": 1678217664,
        "upvote_ratio": 1.0
    },
    {
        "title": "The End ….",
        "author": "jay999897",
        "url": "https://www.reddit.com/r/OnePiece/comments/11l8ssd/the_end/",
        "text": "Are y’all really ready for the anime to one day say “The End” instead of “to be continued”!!?? That day is gonna be legendary",
        "created_utc": 1678217547,
        "upvote_ratio": 1.0
    },
    {
        "title": "What episode do you guys think gear 5 will be animated?",
        "author": "JustAGuy6369",
        "url": "https://www.reddit.com/r/OnePiece/comments/11l8sff/what_episode_do_you_guys_think_gear_5_will_be/",
        "text": "[removed]",
        "created_utc": 1678217524,
        "upvote_ratio": 1.0
    },
    {
        "title": "our pudding and reiju cosplays &lt;3",
        "author": "ahegaobabie",
        "url": "https://i.redd.it/s8fhnivhtema1.jpg",
        "text": "",
        "created_utc": 1678217246,
        "upvote_ratio": 1.0
    },
    {
        "title": "I made a One Piece Shitpost",
        "author": "Oka_RiverLotus",
        "url": "https://youtube.com/shorts/YqSVbOP8bYg?feature=share",
        "text": "",
        "created_utc": 1678217149,
        "upvote_ratio": 1.0
    },
    {
        "title": "what else ?",
        "author": "Jnrhal",
        "url": "https://www.reddit.com/r/OnePiece/comments/11l8ahy/what_else/",
        "text": "My One Piece family, what other manga are you guys reading ?\n\nCare to share a few that you read in-between One Piece?\n\nAlso, have any of you read \"Solo Leveling\" or \"The mage returns after 4000 years.\" ?? I have plenty but these two are the top of my list of suggestions. \n\nhttps://chapmanganato.com/manga-dr980474\n\nhttps://chapmanganato.com/manga-hu985229\n\nLemme see what y'all got to offer, or in the least check out those 2 and let me know what you think. 👍🏾",
        "created_utc": 1678216403,
        "upvote_ratio": 1.0
    },
    {
        "title": "Just wanted to say i think imu sama looks like angry munci",
        "author": "tymisr",
        "url": "https://i.redd.it/ju5l3qdw8dma1.jpg",
        "text": "",
        "created_utc": 1678216296,
        "upvote_ratio": 1.0
    },
    {
        "title": "I made this Luffy Wanted Poster Handtufted Rug!!! Hope you guys like it...",
        "author": "ruggyland1",
        "url": "https://www.reddit.com/gallery/11l882w",
        "text": "",
        "created_utc": 1678216248,
        "upvote_ratio": 1.0
    },
    {
        "title": "For the blox fruit players",
        "author": "Sweet_Register_172",
        "url": "https://www.reddit.com/r/OnePiece/comments/11l807t/for_the_blox_fruit_players/",
        "text": "Hello, my username is ufujfgros, I have 23.5M bounty, I have a crew that I created today (THE ENDLESS PIRATES) currently we only have 6 members and have a crew bounty of 43M, add me on Roblox if you want to join the crew",
        "created_utc": 1678215770,
        "upvote_ratio": 1.0
    },
    {
        "title": "little quick theory about redline",
        "author": "marcomateus222",
        "url": "https://www.reddit.com/r/OnePiece/comments/11l7pqg/little_quick_theory_about_redline/",
        "text": "most of people have the headcanon that redline will go down/destroyed by tha final\n\ni just visualized a quick scenario and im gonna share it with yall\n\nall people evacuated from earth, watching the redline destruction from space, with only luffy on earth / final enemy\n\nsince the ocean levels might go above islands for a bit after crash\n\nthis brings 2 main points that i think r worth \n\n1st luffy being a giant see-able from space\n\n2nd how all people / close 2 redline people would b all brought 2 space?\n\n&amp;#x200B;\n\n\\*if not space, sky",
        "created_utc": 1678215125,
        "upvote_ratio": 1.0
    },
    {
        "title": "I found these poor guys asking around for directions",
        "author": "PublicInformation649",
        "url": "https://www.reddit.com/gallery/11l7nb1",
        "text": "",
        "created_utc": 1678214973,
        "upvote_ratio": 1.0
    },
    {
        "title": "US Presidents Debate Zoro vs Sanji (PEAK FICTION!)",
        "author": "GusGangViking18",
        "url": "https://youtu.be/s9QgC_wXfBk",
        "text": "",
        "created_utc": 1678214751,
        "upvote_ratio": 1.0
    },
    {
        "title": "Error Or Foreshadowing?",
        "author": "Even-Ad5824",
        "url": "https://www.reddit.com/gallery/11l7hxb",
        "text": "",
        "created_utc": 1678214633,
        "upvote_ratio": 1.0
    },
    {
        "title": "US Presidents Debate Zoro vs Sanji",
        "author": "Dont_pm_pls",
        "url": "https://www.youtube.com/watch?v=s9QgC_wXfBk",
        "text": "",
        "created_utc": 1678213956,
        "upvote_ratio": 1.0
    },
    {
        "title": "Did anyone else gag while watching this scene?",
        "author": "Timtom_n1chols",
        "url": "https://i.redd.it/tbc05lnnjema1.jpg",
        "text": "",
        "created_utc": 1678213936,
        "upvote_ratio": 1.0
    },
    {
        "title": "what is this purple lightning that comes off of basically everyones sword ep 1006",
        "author": "AdministrativeCut527",
        "url": "https://www.reddit.com/r/OnePiece/comments/11l75jw/what_is_this_purple_lightning_that_comes_off_of/",
        "text": "is it toei just trying to create aura but kaido and zoro xdrake yamato be emitting this purple lightning or am i dumb",
        "created_utc": 1678213866,
        "upvote_ratio": 1.0
    },
    {
        "title": "Devil fruit theory",
        "author": "GlutanonAlex",
        "url": "https://www.reddit.com/r/OnePiece/comments/11l6yu6/devil_fruit_theory/",
        "text": "Based on current arc in manga, I think it is also possible to have another Gum Gum fruit made by Vegapunk because he is already capable of creating mythical zoan fruit like Kaido’s one. It would be an interesting pairing.",
        "created_utc": 1678213461,
        "upvote_ratio": 1.0
    },
    {
        "title": "How black blades are forged",
        "author": "shadow96x",
        "url": "https://www.reddit.com/r/OnePiece/comments/11l6y02/how_black_blades_are_forged/",
        "text": "We are inclined to believe that black blades are the result of infusing your weapon with Haki alot of times because haki is often displayed as black and even infusing the weapon with haki turns the weapon black, but i don't think thats it, or alteast not just that, first because there are alot of top tiers that uses swords, for example Whitebeard used the same blade for many decades, he was incredible strong and he had both conquerors and armament, yet his blade never turned black, same is true for other top tiers such as Roger or Shanks , all these guys uses swords and none of them have a black one, and even if you wanna be picky and say they are not exactly swordsmen then i give you Oden, a swordsman who used the same 2 swords for his entire life, also super strong, also had conquerors and yet his blades never turned to the dark side of the force.\n\n&amp;#x200B;\n\nSo, if its not just haki then what ? i believe that for a blade to turn black it has to kill, but when i say 'kill' i don't mean kill a person but another sword, and not any sword; a renowned sword, first because they are rare, a honored swordsman would avoid destroying them even if it belongs to a enemy, second because they are more resistant, for example when Mihawk broke Zoro's swords Kuina's blade didn't break, so even on the hands of a weak user( Zoro back then ) a renowned blade is still hard to break, and lastly because these swords can somehow hold haki, we saw Kaido feeling Oden's haki in Enma, while i'm not saying the swords are alive like a person they do have something special to it, if they seem to be \"alive\" then they can be \"killed\", perhaps Mihawk got his black blade that way, perhaps in one his many duels around the world he destroyed a meito in combat, afterall he seems to have no problem in ruining blades as he broke Zoro's blades with no chill, that would also explain why other top tiers don't have black blades, both because they weren't dueling other people all the time and because maybe they didn't had enough experience with blades to able to break a meito in combat, perhaps you gotta be a legend like Mihawk to even be able to break one.\n\n&amp;#x200B;\n\nTLDR: Black swords are forged when they destroy( \"kill\" ) a meito in combat which is a insanely hard feat and hence why we don't see many black swords around, just infusing your sword with haki will not turn it black otherwise we would see more of them since most top tiers uses swords to fight.",
        "created_utc": 1678213411,
        "upvote_ratio": 1.0
    },
    {
        "title": "What kind of power system is best for the op world",
        "author": "aravind_s_",
        "url": "https://www.reddit.com/r/OnePiece/comments/11l6bxy/what_kind_of_power_system_is_best_for_the_op_world/",
        "text": "For example Zoro can cut 1000 eggs and sanji can break a 1000 eggs. Usinge the example we can assign them both value 1000",
        "created_utc": 1678212060,
        "upvote_ratio": 1.0
    },
    {
        "title": "Portgaz D Rouge Gomu Gomu user newgame+",
        "author": "Igglybuffzmyfav",
        "url": "https://www.reddit.com/r/OnePiece/comments/11l68or/portgaz_d_rouge_gomu_gomu_user_newgame/",
        "text": "Alright I just had a thought, Portgaz D. Rouge might have had the gomu gomu no mi/Nika fruit because she kept a baby in her for 20 fucking months, butso she might have stretched to keep ace, but thats a well known theory I think but hear me out, the reason Roger laughed at laugh tale and was to early, is because whatever the One piece is requires the Nika fruit, who was currently owned by his wife back home! This would be pretty funny so he might have laughed and would also make him too early because Rouge is the current user so she would need to die for him to get a chance at the fruit.\nIf there are there any holes in this theory let me know",
        "created_utc": 1678211866,
        "upvote_ratio": 1.0
    },
    {
        "title": "Here’s my drawing of Perona!",
        "author": "Spopling",
        "url": "https://i.redd.it/i326fzlvcema1.jpg",
        "text": "",
        "created_utc": 1678211657,
        "upvote_ratio": 1.0
    },
    {
        "title": "One Piece Film Red Ending",
        "author": "thaihoa91",
        "url": "https://v.redd.it/lluz86t9tcma1",
        "text": "",
        "created_utc": 1678211006,
        "upvote_ratio": 1.0
    },
    {
        "title": "Sea stone usage",
        "author": "space________cowboy",
        "url": "https://www.reddit.com/r/OnePiece/comments/11l5up0/sea_stone_usage/",
        "text": "With the recent chapters regarding Lucci and stussy a couple questions about sea stone and it’s effectiveness have come to mind. \n\n1. How fast after applying sea stone will a DF user loose all his strength? \n\n2. Can coating yourself in haki prevent sea stone from directly touching your skin? Or would sea stone bypass armament coating?\n\nIf sea stone takes out relative top tiers like Lucci so quickly, why are more people not using it? \n\nAnd before anyone says “because it’s rare/hard to make”, realize that the bottom of marine ships are covered in sea stone, so contributing a small amount to top fighters, like stussy has with her lipstick, would be a huge power boost in order to take out relatively strong DF users.",
        "created_utc": 1678210992,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why is the animation so inconsistent in Water 7",
        "author": "mazipa221",
        "url": "https://www.reddit.com/r/OnePiece/comments/11l5swl/why_is_the_animation_so_inconsistent_in_water_7/",
        "text": "I am in EP 239, the last 3 episodes have been really good animation wise, but now it looks super simple and really scuffed, it straights up looks like it has been drawn with a pencil on a piece of paper\n\nWhy is it so inconsistent?",
        "created_utc": 1678210876,
        "upvote_ratio": 1.0
    },
    {
        "title": "Which of these attacks could take down Zunesha, or has the best chance?",
        "author": "Yeeerrrrrrrrrr",
        "url": "https://i.redd.it/divfr8dsqcma1.png",
        "text": "",
        "created_utc": 1678210217,
        "upvote_ratio": 1.0
    },
    {
        "title": "Law vs. BlackBeard",
        "author": "Little-Ad5127",
        "url": "https://www.reddit.com/r/OnePiece/comments/11l5hdz/law_vs_blackbeard/",
        "text": "I think as a plot twist, Law is actually going to win against BlackBeard. It seems like it would make sense. Why would Oda make Law get attacked by BB crew? I don’t know man, seems pretty weird. Lmk what y’all think about this.",
        "created_utc": 1678210142,
        "upvote_ratio": 1.0
    },
    {
        "title": "What circumstances or order by Luffy would make each of the other straw hats leave.",
        "author": "Chaoswarriorx4",
        "url": "https://www.reddit.com/r/OnePiece/comments/11l5c9n/what_circumstances_or_order_by_luffy_would_make/",
        "text": "So we already got Usopp who left after Luffy chose to abandon the Merry, something that was dear to Usopp because it was a gift from his love interest. Now what about the others, but also something realistic that Luffy might or someone else might do. Luffy would never order someone to abandon their dream so that wouldn’t count.",
        "created_utc": 1678209804,
        "upvote_ratio": 1.0
    },
    {
        "title": "quick question",
        "author": "browutt",
        "url": "https://www.reddit.com/r/OnePiece/comments/11l5bpu/quick_question/",
        "text": "do you guys think there is imu r34 lying around the internet somewhere.",
        "created_utc": 1678209768,
        "upvote_ratio": 1.0
    },
    {
        "title": "One Piece Film RED is now (or tmmrw?) available on Japanese Amazon Prime video",
        "author": "veraif",
        "url": "https://www.reddit.com/r/OnePiece/comments/11l58d2/one_piece_film_red_is_now_or_tmmrw_available_on/",
        "text": "&amp;#x200B;\n\nhttps://preview.redd.it/c9kfkocvocma1.png?width=602&amp;format=png&amp;auto=webp&amp;v=enabled&amp;s=568a78a75db103185fd04115efe45da9aebad0c2\n\nhttps://preview.redd.it/2o3j7kxvocma1.png?width=1920&amp;format=png&amp;auto=webp&amp;v=enabled&amp;s=2cac4b0ff6dd745b438a376963498bd679d8abef",
        "created_utc": 1678209554,
        "upvote_ratio": 1.0
    },
    {
        "title": "Art piece I did of Zoro",
        "author": "bigPPboyscout69",
        "url": "https://i.redd.it/m8985izh6ema1.jpg",
        "text": "",
        "created_utc": 1678209518,
        "upvote_ratio": 1.0
    },
    {
        "title": "Where to pick up the manga after episode 1053",
        "author": "logan_sullivan2022",
        "url": "https://www.reddit.com/r/OnePiece/comments/11l4uap/where_to_pick_up_the_manga_after_episode_1053/",
        "text": "I wanted to pick up the manga while one piece is on a break what chapter of the manga would be for episode 1054. Thanks so much for the help!",
        "created_utc": 1678208669,
        "upvote_ratio": 1.0
    },
    {
        "title": "My Luffy mural in my room",
        "author": "TheRealDrawnFoggy",
        "url": "https://i.redd.it/rx3wr5b83ema1.jpg",
        "text": "",
        "created_utc": 1678208416,
        "upvote_ratio": 1.0
    },
    {
        "title": "Zoro, the greatest swordsman, at Kuina's grave (FULL version)",
        "author": "MemeDuka1",
        "url": "https://v.redd.it/2ehdhehmkcma1",
        "text": "",
        "created_utc": 1678208363,
        "upvote_ratio": 1.0
    },
    {
        "title": "My figuarts zero collection so far.",
        "author": "Ambitious_Alfalfa298",
        "url": "https://www.reddit.com/gallery/11l4nak",
        "text": "",
        "created_utc": 1678208257,
        "upvote_ratio": 1.0
    }
]