[
    {
        "title": "How good this be if Blackbeard does this.. (Manga Spoilers)",
        "author": "to_the_andromeda",
        "url": "https://www.reddit.com/r/OnePiece/comments/11m07je/how_good_this_be_if_blackbeard_does_this_manga/",
        "text": "Caribou goes to Blackbeard and tells that he knows the location of Pluton and Posiedon. But requests him to make the captain of 10th ship. \nSo Blackbeard kills his 10th captain and makes him the captain.",
        "created_utc": 1678291603,
        "upvote_ratio": 1.0
    },
    {
        "title": "I'm making icons of every One Piece character. I was completing the East Blue but I'm going to bounce around for the next few haha. Just added a few more. I've just finished Ucy and Luffy as my 100th one! 🤯😊",
        "author": "Old-Biscotti647",
        "url": "https://i.redd.it/ac3gev0zwkma1.jpg",
        "text": "",
        "created_utc": 1678291056,
        "upvote_ratio": 1.0
    },
    {
        "title": "Up to date list of movies/specials that Funimation has dubbed?",
        "author": "TheSchadow",
        "url": "https://www.reddit.com/r/OnePiece/comments/11lzm9w/up_to_date_list_of_moviesspecials_that_funimation/",
        "text": "Been absolutely loving One Piece so far (wish I had watched it so much sooner) and want to enjoy every ounce of it I can.  \n\nThe last post I could find from a few years ago had a list of the specials/movies that are dubbed.  Is this still up to date?\n\n* SP8:3D2Y\n* SP9:Episode of Sabo\n* SP10: Episode of Nebulandia\n* SP11: One Piece: Heart of Gold\n* SP12: One Piece: Episode of East Blue\n* SP13: Episode of Skypiea\n\nFor Movies\n\n* 8: The Desert Princess and the Pirates: Adventures in Alabasta\n* 10: One Piece Film: Strong World\n* 12: One Piece Film:Z\n* 13: One Piece Film: Gold\n* 14: One Piece: Stampede\n\nAnd I assume 15 (Red) will release on blu ray sometime in the next few months as well.  Obviously it's a while before I reach the point of watching any of these but, I'd like to start picking up any of them if I see them on sale.\n\nOn a side note, I did see in the FAQ a nice list of when to watch the movies, but nothing for the specials.  Is there a similar guide for when to watch those out there?\n\nThank you so much.",
        "created_utc": 1678290251,
        "upvote_ratio": 1.0
    },
    {
        "title": "One Piece in a nutshell",
        "author": "skullbrothegoat",
        "url": "https://v.redd.it/x1ifrc5aukma1",
        "text": "",
        "created_utc": 1678290161,
        "upvote_ratio": 1.0
    },
    {
        "title": "What if the ending of one piece did not reveal the \"one piece\"?",
        "author": "Apprehensive_Boot355",
        "url": "https://www.reddit.com/r/OnePiece/comments/11lze9f/what_if_the_ending_of_one_piece_did_not_reveal/",
        "text": "Dude I'll be sailing right away",
        "created_utc": 1678289717,
        "upvote_ratio": 1.0
    },
    {
        "title": "THEORY ON NAMI",
        "author": "Liolia",
        "url": "https://www.reddit.com/r/OnePiece/comments/11lz7aj/theory_on_nami/",
        "text": "Ok so I was watching this 5 hour analysis on One Piece and it got me thinking about the base characters and Oda's original plan for the story and how that ties from the beginning to now. It obviously would still be integrated just differently and there is something I've noticed.\n\nEach of the base crew have a connection with one of the four emperors of the sea. Oda originally was going to go straight into the emperors story before he decided on the warlords. \n\nUsopp - Connected to red hair shanks through his dad.\n\nSanji - Connected to big mom through the marriage arrangement of his family. \n\nZoro - Connected to Kaido's arc through his families immigration from Wano. \n\nNami - ??? \n\nRight now the only one we don't know is Nami, but this means she will definetly either have some sort of connection to black beard or white beard. The question is in what way? We have absolutely no idea where Nami came from, she was a random baby that her sister found, in a battle of the marines. I think most of the marines died in that battle, meaning it was probably a powerful crew. \n\nSo it will either relate to Nami's origins like who her parents where and how she got to that town, possibly through the pirates who were fighting like they could of had a baby with them. Getting an explanation for her affinity with weather, we know one other person who has an affinity with weather though we all assumed they had a devil fruit and that is dragon (whether or not he does have a devil fruit I am unsure if it was confirmed or not so sorry if it was.)  \n\nOr it will relate in some way to what black beard will do to Nami, and this will relate to her origins in some way, and get her connected to whatever it is he is doing. Black beard's actions right now are mysterious, he is collecting devil fruits, particular ones, but we don't know his goal yet you know aside from the obvious. \n\nSo what do you think Nami's connection will be to blackbeard/white beard will be? and why? what are your theories?",
        "created_utc": 1678289258,
        "upvote_ratio": 1.0
    },
    {
        "title": "Franky's theme goes hard on baby driver",
        "author": "Bumba69er",
        "url": "https://www.reddit.com/r/OnePiece/comments/11lz2dy/frankys_theme_goes_hard_on_baby_driver/",
        "text": "[removed]",
        "created_utc": 1678288925,
        "upvote_ratio": 1.0
    },
    {
        "title": "Blackbeard is the most famous pirate of all time.",
        "author": "poodl3s388",
        "url": "https://www.reddit.com/r/OnePiece/comments/11lyx0s/blackbeard_is_the_most_famous_pirate_of_all_time/",
        "text": "His OP counterpart is clearly meant to be a final fight figure for Luffy.\n\nBut some people earnestly think a soldier who serves Charlos is going to be the final fight over the in manga representation of the actual goat pirate.",
        "created_utc": 1678288576,
        "upvote_ratio": 1.0
    },
    {
        "title": "Day 1 of recreating Enies Lobby",
        "author": "Rockstar0125",
        "url": "https://i.redd.it/l7glzf42pkma1.jpg",
        "text": "",
        "created_utc": 1678288397,
        "upvote_ratio": 1.0
    },
    {
        "title": "Happy birthday to Shanks!",
        "author": "UsefullyTrickyy",
        "url": "https://i.redd.it/cbtu9lxq6jma1.png",
        "text": "",
        "created_utc": 1678288178,
        "upvote_ratio": 1.0
    },
    {
        "title": "Goro is invincible",
        "author": "6dlt9",
        "url": "https://www.reddit.com/r/OnePiece/comments/11ly6o5/goro_is_invincible/",
        "text": "During the skypeia arc, for the first and last time in the show, Robin called Enel's fruit, the Goro Goro no mi, one of the few invincible fruit. I don't believe she meant that because it was a logia because we were introduced to Crocodile earlier and she didn't call it invincible. I believe Enel genuinely have the strongest logia fruit by far which is why she called it invincible. From what we've seen, you can travel through metals, you can tp anywhere, you can discharge huge amount of volts (up to 200M), you can restart your own heart, you can mold metal, you can nuke entire island kind of like Imu, you can even boost your observation haki to ridiculous degree, etc. It wouldn't be crazy to call it invincible. \n\nPlus I highly doubt Enel had it awakened. Unfortunately, The Goro's only counter was Luffy (plot armor) and one of the most interesting fruit and character in the show was wasted just like that. \n\nWhat do y'all think? Is the goro worthy of being called invincible? Is it the strongest logia?",
        "created_utc": 1678286823,
        "upvote_ratio": 1.0
    },
    {
        "title": "*spoiler water 7 arc* Is it me or does tony robbins look like blueno",
        "author": "VexxedEU",
        "url": "https://www.reddit.com/gallery/11ly63d",
        "text": "",
        "created_utc": 1678286784,
        "upvote_ratio": 1.0
    },
    {
        "title": "Will sanji be akainu opponent?",
        "author": "ProfessionSharp8299",
        "url": "https://www.reddit.com/r/OnePiece/comments/11lxsiw/will_sanji_be_akainu_opponent/",
        "text": "Sanji already had resistance to heat  but now after the his latent power of science  sanji might show resistance to the level of  akainu's magma , he can be his natural enemy",
        "created_utc": 1678285784,
        "upvote_ratio": 1.0
    },
    {
        "title": "Gol D.Roger Genderbend - by me",
        "author": "ricardomango",
        "url": "https://www.reddit.com/gallery/11lxjar",
        "text": "",
        "created_utc": 1678285077,
        "upvote_ratio": 1.0
    },
    {
        "title": "Looking for a good quality version on Film Red subbed online",
        "author": "FoolishYoungling",
        "url": "https://www.reddit.com/r/OnePiece/comments/11lx8zf/looking_for_a_good_quality_version_on_film_red/",
        "text": "I know 9anime and animepahe both have it up and subbed correctly now but the quality just seems scrathy. Is there another website with it up in better quality or am I crazy and the quality is already ok.",
        "created_utc": 1678284333,
        "upvote_ratio": 1.0
    },
    {
        "title": "Realistic Devil Fruits #15: Suke Suke no Mi. Clear-Clear Fruit",
        "author": "Hurrystorm",
        "url": "https://i.redd.it/dqje6ol9vima1.png",
        "text": "",
        "created_utc": 1678284275,
        "upvote_ratio": 1.0
    },
    {
        "title": "G4 Luffy fanart",
        "author": "emperoroftheeast",
        "url": "https://i.redd.it/97d7vkt7bkma1.jpg",
        "text": "",
        "created_utc": 1678283742,
        "upvote_ratio": 1.0
    },
    {
        "title": "Just get this T-shirt. What do you guys think?",
        "author": "Kitty__Bloom",
        "url": "https://www.reddit.com/gallery/11lx0dm",
        "text": "",
        "created_utc": 1678283722,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is there a better edited anime?",
        "author": "Mysterious-Ad2075",
        "url": "https://www.reddit.com/r/OnePiece/comments/11lx01z/is_there_a_better_edited_anime/",
        "text": "Did anyone create a better edited anime, without all the stare fights and stretched out moments? And maybe even compiled what's left into 20 minute episodes??\n\n&amp;#x200B;\n\nI really miss watching the anime but I can't stand what's become of it, it feels like wasting 20 minutes for a 7 minute real content",
        "created_utc": 1678283697,
        "upvote_ratio": 1.0
    },
    {
        "title": "which is your favourite opening in one piece",
        "author": "Luffy-no-kaikozu",
        "url": "https://i.redd.it/shaeeqjl9kma1.jpg",
        "text": "",
        "created_utc": 1678283196,
        "upvote_ratio": 1.0
    },
    {
        "title": "How can Raizo call Kin'emon with a den den mushi?",
        "author": "guidolur__",
        "url": "https://www.reddit.com/r/OnePiece/comments/11lwpj8/how_can_raizo_call_kinemon_with_a_den_den_mushi/",
        "text": "[removed]",
        "created_utc": 1678282890,
        "upvote_ratio": 1.0
    },
    {
        "title": "Who has the best laugh in One Piece?",
        "author": "Hdhs1",
        "url": "https://i.redd.it/r1e6vmxipima1.png",
        "text": "",
        "created_utc": 1678282349,
        "upvote_ratio": 1.0
    },
    {
        "title": "Achievement unlocked 🎖",
        "author": "AssociationOk2246",
        "url": "https://i.redd.it/c8xtoxmm5kma1.jpg",
        "text": "",
        "created_utc": 1678281861,
        "upvote_ratio": 1.0
    },
    {
        "title": "My friend decided to start making AMVs and this is his first attempt at making one. This one is from the Luffy vs Doflamingo fight. Thoughts?",
        "author": "meanpotato_2",
        "url": "https://v.redd.it/qfxph8crzhma1",
        "text": "",
        "created_utc": 1678281755,
        "upvote_ratio": 1.0
    },
    {
        "title": "One Piece Figures",
        "author": "Acuztic",
        "url": "https://www.reddit.com/r/OnePiece/comments/11lvyqw/one_piece_figures/",
        "text": "Hi,\n\ni got question where in Europe can I buy nice quality one piece figures in a decent prices, online ofcourse (yes I know tht AliExpress and Amazon have cheap figures but I'm looking for an alternative).",
        "created_utc": 1678280900,
        "upvote_ratio": 1.0
    },
    {
        "title": "noland's death may have been caused by a curse?this is because...",
        "author": "kari998",
        "url": "https://www.reddit.com/r/OnePiece/comments/11lvw8c/nolands_death_may_have_been_caused_by_a_cursethis/",
        "text": "I was rereading some old chapters,and I went back to when zoro in rogue town buys the swords from ipponmatsu (chapter 97),and from there zoro gets possession of the sandai kitetsu and we come to find out about the curse of the sword\n\nhttps://preview.redd.it/ygsnk24ihima1.jpg?width=672&amp;format=pjpg&amp;auto=webp&amp;v=enabled&amp;s=591040dc095ce9f778a78ed919f62192289ef33e\n\nI had never dwelt on this detail, but the monster that appears during the curse narrative, doesn't it remind you in some respects of the serpent worshipped at shandora?though it may remind you of a sea king I find that it has a certain affinity with nola,the serpent of shandora\n\n&amp;#x200B;\n\nhttps://preview.redd.it/1qn1y02xhima1.jpg?width=1000&amp;format=pjpg&amp;auto=webp&amp;v=enabled&amp;s=b860f7127a2183eed1a261accfa987acf11f50a5\n\nand that brought me back to noland,we don't know anything about his sword,it doesn't look like anything special,but aesthetically as colors it is very similar to the sandai kitetsu,and it is very similar to the sword shown during the ipponmatsu story\n\n&amp;#x200B;\n\nhttps://preview.redd.it/5mfpjfusiima1.jpg?width=708&amp;format=pjpg&amp;auto=webp&amp;v=enabled&amp;s=5e0fc5dc3ad61ddcdcd8e974422a4a92e22c7511\n\nas said we don't know anything about noland's sword,and it seems quite ordinary,but if not?\n\nzoro proved that a big fortune can overcome the curse of the sword,but as we know,noland wasn't exactly \"lucky\"\n\nwe all know the events of noland and kalgara\n\nnow i don't think that the bad luck of a single cursed sword,can be so great as to send islands into the sky and doom a population in this way,but if it really was a kitetsu,as far as noland's story is concerned,it would justify noland's \"tragic\" death,labeled by all as a liar,forced to die as a liar,never being able to see his best friend again,after saving all the people of shandora",
        "created_utc": 1678280710,
        "upvote_ratio": 1.0
    },
    {
        "title": "Where can I watch One Piece Red on a streaming service? I can’t find it anywhere despite google saying it should be on multiple platforms which I’ve all checked. Is it not available in US yet, despite google saying it is…?",
        "author": "karmicrelease",
        "url": "https://www.reddit.com/r/OnePiece/comments/11lvr4x/where_can_i_watch_one_piece_red_on_a_streaming/",
        "text": "I’ve tried google to find a place I can pay for or stream One Piece Film Red ever since it was supposedly released in US in Fall of 2022. Obviously I could just google a “free-online” site to pirate it, but I:\n1. Want to support the film \n2. Want to be able to watch it on my TV without mirroring (super laggy for me)",
        "created_utc": 1678280358,
        "upvote_ratio": 1.0
    },
    {
        "title": "one piece possible end(theory)",
        "author": "MediatedFlame70",
        "url": "https://www.reddit.com/r/OnePiece/comments/11lvemv/one_piece_possible_endtheory/",
        "text": "What if? One piece ends just like how Roger died. \n\n\nJust like Gol D Roger, after finding the one piece. Luffy and his friends will go around the grand line once again. But this time each of the straw hats will get down in their home town potentially leaving the crew. Finally the whole crew will be disbanded and then Luffy will turn himself in and he will be executed just like Gol D Roger. One piece ends with the start of a new pirate era, started by luffy. Just like Roger",
        "created_utc": 1678279378,
        "upvote_ratio": 1.0
    },
    {
        "title": "One piece coloring chapter 1076.",
        "author": "corasaan",
        "url": "https://i.redd.it/7ubjdq94eima1.png",
        "text": "",
        "created_utc": 1678278531,
        "upvote_ratio": 1.0
    },
    {
        "title": "anyone know where this is from",
        "author": "OwOBanda",
        "url": "https://i.redd.it/evujm688kjma1.jpg",
        "text": "",
        "created_utc": 1678274663,
        "upvote_ratio": 1.0
    },
    {
        "title": "ah ah ah ah... OP characters as Pokémon: Sir Crocodile as Krookodile",
        "author": "SimonBSFCS",
        "url": "https://i.redd.it/0fbzb8khjjma1.png",
        "text": "",
        "created_utc": 1678274418,
        "upvote_ratio": 1.0
    },
    {
        "title": "Happy International women's Day 🌹. Beauty + Strength =",
        "author": "Full_Hitter",
        "url": "https://i.redd.it/d6ci6s5fjjma1.jpg",
        "text": "",
        "created_utc": 1678274393,
        "upvote_ratio": 1.0
    },
    {
        "title": "Zoro and killer they are not captain but their are in worst generation.",
        "author": "The-One-Yo",
        "url": "https://www.reddit.com/r/OnePiece/comments/11ltnt3/zoro_and_killer_they_are_not_captain_but_their/",
        "text": "Zoro is second best in straw hat  and also killer is also vice captain of Kidd pirates  but they are in worst generation.",
        "created_utc": 1678274025,
        "upvote_ratio": 1.0
    },
    {
        "title": "Alive Brook",
        "author": "OwlbearArmchair",
        "url": "https://www.reddit.com/r/OnePiece/comments/11lt4r2/alive_brook/",
        "text": "Idk maybe it's something about how emotive they made him as a skeleton, or maybe it's just seeing him with lips and skin and shit, but alive brook has just always made me laugh a little bit. Anyone else?",
        "created_utc": 1678272268,
        "upvote_ratio": 1.0
    },
    {
        "title": "Crocodile devil fruit",
        "author": "maddyy1234",
        "url": "https://www.reddit.com/r/OnePiece/comments/11lt05q/crocodile_devil_fruit/",
        "text": "Do you think crocodile has awakened his devil fruit when he used ground death on the palace in alabasta arc",
        "created_utc": 1678271822,
        "upvote_ratio": 1.0
    },
    {
        "title": "My Version of Shanks vs Kaido",
        "author": "AcceptableClock9963",
        "url": "https://i.redd.it/p60nwasnrhma1.png",
        "text": "",
        "created_utc": 1678270998,
        "upvote_ratio": 1.0
    },
    {
        "title": "Theory about “The will of D.”",
        "author": "RevolutionaryFold851",
        "url": "https://www.reddit.com/r/OnePiece/comments/11lsmo7/theory_about_the_will_of_d/",
        "text": "I’ll make it quick…\n\nThe will of D. Is the will of dreams. \nVega Punk said devil fruits are the manifestation of people’s dreams. \n\nIs the will of D. actually the will of the people of the ancient kingdom?\n\nJust had this thought after waking up randomly at 2am. \n\nAlright going back to sleep.\n\nNight Nakuma!",
        "created_utc": 1678270519,
        "upvote_ratio": 1.0
    },
    {
        "title": "HAKI new theory???",
        "author": "Feldmarschall31",
        "url": "https://www.reddit.com/r/OnePiece/comments/11ls9hq/haki_new_theory/",
        "text": "Am I missing someting or why is nobody talking about this? \n\nI am talking about Luffy using Red Roc for the first time (Anime 1015). I dont have to tell you how important this moment is, not only for the arc, but for the whole story (first time Haki/Ruyo on Kaido, Luffy puts Wano on his shoulders, Yamato realizes Luffy and Roger have the same dream, etc.). \n\nRight after punching Kaido with Red Roc everything around them froze for no obvious reason. And we have the frozen strawhat, which is frozen for no obvious reason. Could there be a connection? What are your thoughts?",
        "created_utc": 1678269269,
        "upvote_ratio": 1.0
    },
    {
        "title": "One Piece Film: Red is on KissAnime",
        "author": "MilkyWayII",
        "url": "https://www.reddit.com/r/OnePiece/comments/11ls75g/one_piece_film_red_is_on_kissanime/",
        "text": "[removed]",
        "created_utc": 1678269031,
        "upvote_ratio": 1.0
    },
    {
        "title": "New Font for Character-Introduction",
        "author": "unhappypersonYT",
        "url": "https://www.reddit.com/gallery/11lry0n",
        "text": "",
        "created_utc": 1678268117,
        "upvote_ratio": 1.0
    },
    {
        "title": "What if SH vs BB",
        "author": "DesertPoncho",
        "url": "https://www.reddit.com/r/OnePiece/comments/11lrxvz/what_if_sh_vs_bb/",
        "text": "How would you feel about nothing being said about zoros observation because he develops it vs van augur like total disadvantage and he wins by developing it in the fight and obv the rest would have similar gains too this is assuming this fight develops them for the WG final",
        "created_utc": 1678268106,
        "upvote_ratio": 1.0
    },
    {
        "title": "Vegapunk modifed Lafitte's DNA",
        "author": "TasumiThierl",
        "url": "https://www.reddit.com/r/OnePiece/comments/11lrof3/vegapunk_modifed_lafittes_dna/",
        "text": "Many people have speculated that Blackbeard is a failed experiment of Vegapunk. He has read the Book of Devilfruits. Not many have. Sanji has, he had access to it because his father was in MADS. My own view is that Vegapunk modified Teach'es DNA, which allowed the eating of multiple Devilfruits. Lafitte is around the same age as Blackbeard. He could have been the first to join. Perhaps they knew each other from a Vegapunk lab. \n\nLafitte has unexplained wings. They don't look like those of skyislanders. They also might not be from a Devilfruit. Atleast that is what was that in SBS or Vivecard. If they are not a race feature and not from a Devilfruit (maybe), they could be a product of DNA manipulation. I believe Lafitte is the future opponent of Sanji, so it would be fitting if he was modified by Vegapunk, similar to how Sanji was by Judge ([my video on that match up](https://www.youtube.com/watch?v=vhmmCJrl-7M)). \n\nI am telling you all of this because I believe Lafitte is in Egghead right now. He is the one that imprisoned Vegapunk and Cipherpol Agents, and attacked Pythagoras. If he already had a connection to Vegapunk, that would make it more plausible. It has to be an outsider because it can't be one of the Punks nor someone working for the WG. It isn't a satellite because they synchronize their knowledge constantly. It can't be a government agent, because the shadowy figure ordered the Seraphim to attack CP0. The person who walked up to Pythagoras made a sound when walking as if he was wearing tap shoes. Lafitte wears tap shoes. \n\nLafitte was a sheriff in the past. Now he is imprisoning people again. He is skilled in sneaking up on people. Infiltrating Maryjoa is probably harder than infiltrating Egghead. He has hypnosis, which he could have used on the Vegapunks. Pythagoras forgot who attacked him. He must have seen him. He turned when the guy was standing behind him. \n\nAt the beginning of Egghead, I considered that it could mirror Whisky Peak (see this [video for details)](https://www.youtube.com/watch?v=NXiQ2jlojag). Whisky Peak ends with Robin appearing on the Merry, offering the Strawhats an Eternal Pose. Lafitte is the navigator of the Blackbeard Pirates. He could appear on the Sunny and offer them an Eternal Pose to Pirate Island, that would be a trap or challenge of course.",
        "created_utc": 1678267161,
        "upvote_ratio": 1.0
    },
    {
        "title": "Lets have our revenge on the monster Trio.",
        "author": "Wildfire-Man",
        "url": "https://i.redd.it/o9wqjmv9xima1.jpg",
        "text": "",
        "created_utc": 1678266947,
        "upvote_ratio": 1.0
    },
    {
        "title": "Kinda specific, but how would Bonney's de-aging work against someone like Law?",
        "author": "silenthesia",
        "url": "https://www.reddit.com/r/OnePiece/comments/11lrl6c/kinda_specific_but_how_would_bonneys_deaging_work/",
        "text": "What I mean is that, if she were to de-age him down to the years he had Amber Lead Disease, would he have those white spots or not?\n\nWe did see that Jinbe retained the scar over his eye when de-aged, so does that mean his de-aged form would be based on his current appearance? Or would it return him to how he truly looked back then? \n\nI guess another example would be someone who was suffering from malnutrition as a child. Would Bonney de-aging them show their \"ideal self if they weren't starved\" or the scrawny malnutrition one?\n\nI hope this question made sense.",
        "created_utc": 1678266836,
        "upvote_ratio": 1.0
    },
    {
        "title": "The navy won't exist anymore.",
        "author": "keeneisthegoat",
        "url": "https://www.reddit.com/r/OnePiece/comments/11lrhug/the_navy_wont_exist_anymore/",
        "text": "I'll say it as many times as I have to. The navy will lose its 4 admirals.\n\nAnd it's not tomorrow, in three years or I don't know... It's NOW.\n\nKizaru Will lose to Luffy. \nFujitora has probably already lost to Teach. \nRyokugyu is going to fight Mihawk. \nWhen Akainu hears that Kid is confronting Shanks, he'll eventually explode and go there. \n\nOda said he would try to finish One Piece in three years. Even if we know that it's not going to happen.\nHowever, he wants to go fast. And we already know it ALL FOR YEARS : there is a split between the government and the navy. \n\nThe navy is used to enforce the order of the world, and now there is none. The government will have to get out of its ivory tower and start fighting, preparing for a new war. \n\nAnd they have the seraphim. \n\nThese robots are already as powerful as yonko commanders. Once grown up : it'll be even worse. \n\nThere's like ten seraphim. They'll surpass navy admirals, whether you like it or not. \n\n\nDownvote me as much as you want, but the navy : IT'S OVER. IT'S. FINISH. \n\nThe only navy that will exist will be the one after the Great War. The one where Koby will become an admiral, in a peaceful world.",
        "created_utc": 1678266507,
        "upvote_ratio": 1.0
    },
    {
        "title": "Aokiji/Kuzan",
        "author": "onepiecewanted1221",
        "url": "https://i.redd.it/a4c5cdvj9hma1.png",
        "text": "",
        "created_utc": 1678264924,
        "upvote_ratio": 1.0
    },
    {
        "title": "Luffy Edit",
        "author": "Monk_eyK",
        "url": "https://v.redd.it/02wu8gz76hma1",
        "text": "",
        "created_utc": 1678263739,
        "upvote_ratio": 1.0
    },
    {
        "title": "Need help with one piece video",
        "author": "Jason_Nuland",
        "url": "https://www.reddit.com/r/OnePiece/comments/11lqhva/need_help_with_one_piece_video/",
        "text": "[removed]",
        "created_utc": 1678263081,
        "upvote_ratio": 1.0
    },
    {
        "title": "Would you like for these older generation One Piece games to get a re release or remaster for modern consoles?",
        "author": "IdeaRegular4671",
        "url": "https://www.reddit.com/gallery/11lqg5l",
        "text": "",
        "created_utc": 1678262921,
        "upvote_ratio": 1.0
    },
    {
        "title": "my silly SpongeBob × OnePiece I drew last year it was fun at the time",
        "author": "h9hhhh",
        "url": "https://www.reddit.com/gallery/11lqc62",
        "text": "",
        "created_utc": 1678262548,
        "upvote_ratio": 1.0
    },
    {
        "title": "A ship eating a fruit",
        "author": "jayyy00",
        "url": "https://www.reddit.com/r/OnePiece/comments/11lpzsa/a_ship_eating_a_fruit/",
        "text": "We know that objects can be fed devil fruits to give them powers (Spandam’s elephant sword, etc). What would happen if a ship eats a devil fruit? Will it be able to sail?",
        "created_utc": 1678261394,
        "upvote_ratio": 1.0
    },
    {
        "title": "Luffy the goat",
        "author": "Wetbags420",
        "url": "https://i.redd.it/nw350hu3fima1.jpg",
        "text": "",
        "created_utc": 1678260833,
        "upvote_ratio": 1.0
    },
    {
        "title": "Roronoa Zoro painting",
        "author": "Demonof69",
        "url": "https://i.redd.it/vzbbs5ikbima1.png",
        "text": "",
        "created_utc": 1678259648,
        "upvote_ratio": 1.0
    },
    {
        "title": "Some things never change",
        "author": "RedditEnjoyer101",
        "url": "https://i.redd.it/yb0ap5ttqgma1.png",
        "text": "",
        "created_utc": 1678258568,
        "upvote_ratio": 0.99
    },
    {
        "title": "can i skip the “naval fortress” and “foxy pirate crew” arcs?",
        "author": "Mission-Activity5599",
        "url": "https://www.reddit.com/r/OnePiece/comments/11lp232/can_i_skip_the_naval_fortress_and_foxy_pirate/",
        "text": "just finished skypiea wich was already a tough watch full of filler and i dont wanna sit throught 12 hours of more filler would it affect my understanding of the show if i skip these and go straight to water seven?",
        "created_utc": 1678258289,
        "upvote_ratio": 1.0
    },
    {
        "title": "Roger just laughed manga panel drew because I was bored not the great but",
        "author": "Psychological_Sign39",
        "url": "https://i.redd.it/rhtfbo3c7ima1.jpg",
        "text": "",
        "created_utc": 1678258223,
        "upvote_ratio": 1.0
    },
    {
        "title": "What did Zoro see and will he tell anyone what he saw?",
        "author": "Clear_Object",
        "url": "https://i.redd.it/1axyu6676ima1.jpg",
        "text": "",
        "created_utc": 1678257841,
        "upvote_ratio": 1.0
    },
    {
        "title": "Enies Lobby anime lineup",
        "author": "Lucci11",
        "url": "https://www.reddit.com/gallery/11logbg",
        "text": "",
        "created_utc": 1678256355,
        "upvote_ratio": 1.0
    },
    {
        "title": "Episode 619 ending makes no sense…",
        "author": "Djgibsonparker",
        "url": "https://www.reddit.com/r/OnePiece/comments/11lobf7/episode_619_ending_makes_no_sense/",
        "text": "At the end of 619 Monet is about to press the button to blow up Punk Hazard, right as she is about to press it, it zooms out on the island getting engulfed in a massive explosion. The next episode is then called something like “Punk Hazard Explodes!” But then it is revealed that Monet actually dies before pressing the button. So…. No explosion??? Why did it show Punk Hazard exploding in the previous episode and then the next just ignores that fact?? I’m so confused on this. \n\nAny thoughts?",
        "created_utc": 1678255924,
        "upvote_ratio": 1.0
    },
    {
        "title": "I want to buy them, what do you think?",
        "author": "3afif",
        "url": "https://i.redd.it/zfn97yboggma1.png",
        "text": "",
        "created_utc": 1678255362,
        "upvote_ratio": 1.0
    },
    {
        "title": "One Piece AMV He is our Captain HD . Do you guys remember this amv? even though the sub doesnt match but it is one of the first amv which gave me goosebumps!!",
        "author": "tay-draws",
        "url": "https://youtu.be/BIPnMYFz-2U",
        "text": "",
        "created_utc": 1678255258,
        "upvote_ratio": 1.0
    },
    {
        "title": "Just finished my One Piece arcs tier list",
        "author": "Cardboard60",
        "url": "https://i.redd.it/qm07y7hvegma1.png",
        "text": "",
        "created_utc": 1678254619,
        "upvote_ratio": 1.0
    },
    {
        "title": "thoughts? i think the amount of effort Luffy had to put in his fruit is really really underrated. He could have easily been one of the Strongest Haki users if he didn't waste 10 yrs mastering his DF. (Coby learned it at a younger age than Luffy)",
        "author": "Zealousideal_Tie9643",
        "url": "https://i.redd.it/eaemzqr5whma1.jpg",
        "text": "",
        "created_utc": 1678254508,
        "upvote_ratio": 1.0
    },
    {
        "title": "(OC) sanji by me , whats your thoughts about it ?",
        "author": "vKAHD",
        "url": "https://i.redd.it/hr778nbovhma1.jpg",
        "text": "",
        "created_utc": 1678254302,
        "upvote_ratio": 1.0
    },
    {
        "title": "Big mom and Kaido pluton theory",
        "author": "HellaDankChippyChips",
        "url": "https://www.reddit.com/r/OnePiece/comments/11lnqoz/big_mom_and_kaido_pluton_theory/",
        "text": "SPOILERS IF YOU HAVEN’T READ WANO \nimma  be real kaido was tanking so much damage from not just Luffy but from the scabbards zoro, Yamato, killer, while also holding up the island. Oda said people would not be satisfied if kaido gets taken out with a punch so what if he wasn’t actually taken out and is plotting his comeback?  Kaido got sent into lava but he is basically a dragon, would it be far fetched to theorize he is able to find a lava tube or even burrow out somewhere near old wano and discover pluton? I’m basically just thinking kaido and big mom somehow discovers pluton since they are already underneath wano, and for this finale saga they have a rematch OR maybe kaido joins in this grand war which he wanted to have anyways. I feel kaido and big mom seem too big for them to just disappear from the story, and pluton being under wano seems sus since big mom and kaido are also under wano",
        "created_utc": 1678254181,
        "upvote_ratio": 1.0
    },
    {
        "title": "Book Don Quixote by Miguel de Cervantes",
        "author": "VeilleurNuite",
        "url": "https://www.reddit.com/r/OnePiece/comments/11lnq7i/book_don_quixote_by_miguel_de_cervantes/",
        "text": "Hello dear other One Piece readers,\nI know some of you have read the book Don Quixote de la Mancha  y Miguel de Cervantes. Im currently in the middle of reading it and am loving it.\n\nWarning if you havent finished the anime or manga you might find spoilers below. Im manga reader myself. So you are warned for possible spoilers.\n\nIm flabbergasted how many persona comeby in this book.\nFor  starters ofcourse señor Don Quixote and his clan. The hairdresser and the priest. A man who lost his child. His brother. The priest who throws all his precious books out of the window. And how he read about all the ancient history and the Moor person called Eggplant who taught him his own family history.\nThe last one is an inspiration for Vegapunks island.\nSancho Panza who pleads his lpyalty to him. Sou ds like Bellamy. But also Sanjo who becomes convinced that he os the knight and that Luffy is the captain. Luffy has clearly a similar sense of adventure. And the multiple Sancho that show up makes me think of Sanji having numbered siblings.\nNow ive arrived at Marcella the girl whose beauty blinds all man but she throws away all their attention. This is sooo Nami like.\nMeanwhile shes was modtly chased by a man grisóstomo who was a researcher but all he wanted was her and became blinded. Reminds me a lot of Brook😂\nThe windmills were also hilarious af. And the longrong island comes to mind. And now i cant get excited enough about Elbaf. But also do remember how BigMom was delusional on Elbaf and ate her friends.\nHonestly i think this book is an immense inspiration to Oda.\nI would love to post more references from the book along as i read it. And i would love to discuss them here if possible 😁",
        "created_utc": 1678254139,
        "upvote_ratio": 1.0
    },
    {
        "title": "Kizaru vs Brook made by me 🙏",
        "author": "Francis_Star",
        "url": "https://www.reddit.com/gallery/11lnim1",
        "text": "",
        "created_utc": 1678253470,
        "upvote_ratio": 1.0
    },
    {
        "title": "Brook vs Kizaru in egghead island 🙏",
        "author": "Francis_Star",
        "url": "https://www.reddit.com/gallery/11lnho5",
        "text": "",
        "created_utc": 1678253400,
        "upvote_ratio": 1.0
    },
    {
        "title": "Isn't it interesting that we'd prefer to watch other characters than the Mc's own crew because nothing interesting is happening around them?",
        "author": "PhotographCivil1151",
        "url": "https://www.reddit.com/r/OnePiece/comments/11lnd47/isnt_it_interesting_that_wed_prefer_to_watch/",
        "text": "We'd all rather watch Law vs Blackbeard.\n\nOr Kidd vs Shanks.\n\nOr Garp's current situation.\n\nOr Kizaru's.\n\nOr any other part of the story than the current egghead where we are dealing with downgraded yonko and his crew to drag things out; uninteresting Vegapunk plot line no one cares about anymore, and even more annoying traitor and mysterious silhouette bullshit.\n\nThis arc had so much potential but it turns out be absolutely dog shit. It would be so much better if the full fight happening between Kidd/Bb and Kidd/Shanks were covered. But we all know they're gonna be offscreened while we read dragged out run piece or something.",
        "created_utc": 1678253002,
        "upvote_ratio": 1.0
    },
    {
        "title": "As requested \"TF2 Pirates\"",
        "author": "5m0k3W33d3v3ryday",
        "url": "https://i.redd.it/847jai6w9gma1.jpg",
        "text": "",
        "created_utc": 1678252931,
        "upvote_ratio": 1.0
    },
    {
        "title": "Vegapunk and Memories Theory",
        "author": "Motor_Sock459",
        "url": "https://www.reddit.com/r/OnePiece/comments/11lna4u/vegapunk_and_memories_theory/",
        "text": "Vegapunk is using Devil Fruits to learn about the void history. \n\nDevil fruits are born again into the world after the previous user dies. \n\nWhat if Vegapunk is looking into the memories of the devil fruit to see the world through the previous users view. Similar to how he is able to look into the memories of Kuma. \n\nThus allowing him to view the memories of people in the void century?",
        "created_utc": 1678252757,
        "upvote_ratio": 1.0
    },
    {
        "title": "Aokiji losing to Akainu was the best case scenario for everyone",
        "author": "Impossible_Lie9663",
        "url": "https://www.reddit.com/r/OnePiece/comments/11ln71g/aokiji_losing_to_akainu_was_the_best_case/",
        "text": "I think about this often cause i feel like things honestly would be WAYYY worse for every pirate if Aokiji lost. Like sure Aokiji would be way more lenient into what he considers a evil pirate cause he knows how to read ppl like that instead of just judging off the fact they’re pirates unlike Akainu, but Akainu literally put himself in an oppressed position. He can’t act as hard on pirates anymore like he used to because he’s almost always doing paperwork so it’s almost better that he became a fleet admiral. If he would’ve lost i feel like he would become way more unhinged than before and try to enact his form of “justice” on all pirates small or large and his first target would be Luffy, and let’s be honest if akainu was on Luffy’s ass at the begging of the time skip the manga would be done 😭. What do you think would have changed if Aokiji won",
        "created_utc": 1678252503,
        "upvote_ratio": 1.0
    },
    {
        "title": "Top 5 Strongest Women in One Piece #women #onepiece #devil #strong #wil...",
        "author": "GoalRemarkable5284",
        "url": "https://youtube.com/watch?v=ThNPLrZz7kU&amp;feature=share",
        "text": "",
        "created_utc": 1678252276,
        "upvote_ratio": 1.0
    },
    {
        "title": "I need to figure this out",
        "author": "Rrhsram9292",
        "url": "https://www.reddit.com/r/OnePiece/comments/11lmxut/i_need_to_figure_this_out/",
        "text": "It's driving me nuts but the new batch of dubbed one piece dropped and I reached Shimotsuki Yasuie, and it sounds like Jerry Jewell, who does Caesar Clown. There's no credit to this yet, but I need answers.",
        "created_utc": 1678251747,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does anyone know where i can download the wano arc entirely?",
        "author": "Noka_Poopypants",
        "url": "https://www.reddit.com/r/OnePiece/comments/11lmukk/does_anyone_know_where_i_can_download_the_wano/",
        "text": "Torrents are fine too. and i know it hasnt come out yet completely but i just want how much ever has aired already. specifically act 1 and 2 but three would be nice too",
        "created_utc": 1678251514,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why aren't they using Advance Form of Haki (Spoilers Ch 1076+)",
        "author": "Grahak5656",
        "url": "https://www.reddit.com/r/OnePiece/comments/11lmpp4/why_arent_they_using_advance_form_of_haki/",
        "text": "In recent fights neither Luffy nor Zoro are using advance form of haki. Luffy is using the advance observation haki but like in his fight with Lucci he chose to go in gear 5th instead of using the advance forms and now in the fight with seraphim he chose to go in gear 4th whereas he can fight with them in his base form, even zoro is not using his advance conquer haki. Does this mean that using advance form of armament and conqueror is more taxing then using any gear or they just not see thier opponent worth using it. What can be other reasons??",
        "created_utc": 1678251113,
        "upvote_ratio": 1.0
    },
    {
        "title": "Zoro vs Kid/Law (Post Wano)",
        "author": "Few_Traffic6659",
        "url": "https://i.redd.it/ciuopo86mhma1.jpg",
        "text": "",
        "created_utc": 1678251103,
        "upvote_ratio": 1.0
    },
    {
        "title": "Wano Arc Dub Cast - New Announcements (Orochi, Oden, Queen, King, Hyogoro, etc...)!",
        "author": "KitKat1721",
        "url": "https://www.reddit.com/r/OnePiece/comments/11lmdho/wano_arc_dub_cast_new_announcements_orochi_oden/",
        "text": "Since we're a few voyages into Wano, we've got a bunch of new notable roles appearing in the dub for the first time - so I figured I'd make a post highlighting those I could find all in one place! Still missing a few (Ashura Doji, Tonoyasu, etc...) and a couple of these characters have technically appeared earlier (i.e. Oden for one line way back in Zou). But for the most part these are relatively recent announcements:\n\n**Orochi**: Keith Silverstein (*Hisoka - HxH, Johan Liebert - Monster, Zhongli - Genshin Impact*)\n\n**Oden**: Robbie Daymond (*Goro Akechi - Persona 5, Jesse Cosay - Infinity Train, Spider-Man - various cartoon and game iterations*)\n\n**Komurasaki**: Molly Searcy (*Jeanne - The Case Study of Vanitas, Akame - Akame ga Kill*)\n\n**Queen**: Major Attaway (*various anime roles but most notable nowadays for his NYC stage career in roles like the Genie in Broadway's Aladdin, Audrey II in Little Shop of Horrors, etc...*)\n\n**King**: Gabe Kunda (*Rock Lock - MHA, Fisher Tiger - One Piece, Newcastle - Apex Legends, pretty much every Disney+ ad and film campaign you've heard lol*)\n\n**Hyogoro**: Doug Jackson (*Ketil - Vinland Saga, Iwami - Noragami, various on-camera roles in movies/tv shows like JFK, Friday Night Lights, etc...*)\n\n**Kyoshiro**: Chris Wehkamp (*Aizawa - MHA, Bebin - Ranking of Kings, Ruijerd - Mushoku Tensei, Nyanko-sensei - Natsume's Book of Friends*)",
        "created_utc": 1678250141,
        "upvote_ratio": 1.0
    },
    {
        "title": "I love Akainu",
        "author": "Brilliant_Link6791",
        "url": "https://www.reddit.com/r/OnePiece/comments/11lm6i9/i_love_akainu/",
        "text": "Out of all the villains and antagonists we have seen Akainu was the most persistent and threatening. Kaido also looks threatening due to his immense strength but he didn't do much to the alliance as Akainu did to Whitebeard pirates. I mean even Kinemon survived Kaido and I thought there would be more deaths or injuries since now they are fightig a yonko duo but nothing happened. Izo and Asura did die but not by Kaido's hands. \n\n&amp;#x200B;\n\nHe was the only character who made me worried about the whitebeard alliance. Destroying the ships, manipulating squard, melting the ice , killing ace, melting whitebeard's insides , was persistent to kill Luffy and gave Jimbe and Luffy permanent scars. He is the only antagonist in the entire series who mentally and physically scarred Luffy. Imo he is the most brutal character in One Piece and I love him because of that.\n\n&amp;#x200B;\n\nThat is why I am excited to see more from Akainu in the future and hopefully he doesn't get looney tuned or gets a glow down in terms of brutality.",
        "created_utc": 1678249605,
        "upvote_ratio": 0.99
    },
    {
        "title": "Nico Robin as Sun God Nika",
        "author": "Greedy_Field_8240",
        "url": "https://i.redd.it/q85gsqnihhma1.jpg",
        "text": "",
        "created_utc": 1678249538,
        "upvote_ratio": 1.0
    },
    {
        "title": "Do you think kizaru was holding back in all of his fights",
        "author": "joesphl188",
        "url": "https://www.reddit.com/r/OnePiece/comments/11lm4xq/do_you_think_kizaru_was_holding_back_in_all_of/",
        "text": "[removed]",
        "created_utc": 1678249482,
        "upvote_ratio": 1.0
    },
    {
        "title": "back at it again and drew Rayleigh",
        "author": "Ok-Raisin8064",
        "url": "https://i.redd.it/y2k5u1e9hhma1.jpg",
        "text": "",
        "created_utc": 1678249458,
        "upvote_ratio": 1.0
    },
    {
        "title": "does most of the modern fanbase know about the 4kidz rap opening?",
        "author": "poodl3s388",
        "url": "https://www.reddit.com/r/OnePiece/comments/11lm041/does_most_of_the_modern_fanbase_know_about_the/",
        "text": "YOHOHO he took a bite of gum gum.",
        "created_utc": 1678249104,
        "upvote_ratio": 1.0
    },
    {
        "title": "Did someone ever ask oda about that marine base anime filler?",
        "author": "Viscoct",
        "url": "https://www.reddit.com/r/OnePiece/comments/11llpcf/did_someone_ever_ask_oda_about_that_marine_base/",
        "text": "talking about the pre timeskip one that was actually surprisingly entertaining. I just wonder if oda has seen it and what he'd think about it. maybe he'd even declare it as canon or something lol",
        "created_utc": 1678248256,
        "upvote_ratio": 1.0
    },
    {
        "title": "U.S. Presidents Rank One Piece Arcs",
        "author": "number8inline",
        "url": "https://www.youtube.com/watch?v=QPsH0ksx4jk",
        "text": "",
        "created_utc": 1678247791,
        "upvote_ratio": 1.0
    },
    {
        "title": "Zoro 😎is so cool",
        "author": "Dr_gamerr",
        "url": "https://youtube.com/shorts/xUh7XkBCQ2A?feature=share",
        "text": "",
        "created_utc": 1678247247,
        "upvote_ratio": 1.0
    },
    {
        "title": "Ussop-Yassop",
        "author": "Impossible-Moose-912",
        "url": "https://www.reddit.com/r/OnePiece/comments/11llbt1/ussopyassop/",
        "text": "Is there any episode in which Ussop got to know that Yassop is with Red Hair Pirates(Shank's Crew)?\nIf yes which episode was that or arc maybe?",
        "created_utc": 1678247231,
        "upvote_ratio": 1.0
    },
    {
        "title": "I've never watched an anime. AMA about One Piece and I'll answer like I know.",
        "author": "ARandqmPerson",
        "url": "https://www.reddit.com/r/OnePiece/comments/11ll77l/ive_never_watched_an_anime_ama_about_one_piece/",
        "text": "What kind of a name is \"One Piece\" anyway??",
        "created_utc": 1678246877,
        "upvote_ratio": 1.0
    },
    {
        "title": "Should I watch Film Red now even though I haven’t caught up with the anime?",
        "author": "myrrh69",
        "url": "https://www.reddit.com/r/OnePiece/comments/11ll705/should_i_watch_film_red_now_even_though_i_havent/",
        "text": "For context, I’m completely caught up with the manga and have know the general plot of the movie since its Japanese release, thanks to my overwhelming curiosity. I’m just wondering if I should wait until I’ve caught up with the anime (on thriller bark rn) or even until chapter 1052 gets animated to watch the movie. Thanks in advance.",
        "created_utc": 1678246861,
        "upvote_ratio": 1.0
    },
    {
        "title": "An Ace DVD",
        "author": "After_Ad_878",
        "url": "https://i.redd.it/5qh9cq3c9hma1.jpg",
        "text": "",
        "created_utc": 1678246788,
        "upvote_ratio": 1.0
    },
    {
        "title": "Probably a dumb question but when does the new one piece dub come to funimation?",
        "author": "inactivesky1738",
        "url": "https://www.reddit.com/r/OnePiece/comments/11lkn7t/probably_a_dumb_question_but_when_does_the_new/",
        "text": "Started watching as a joke and now addicted and need my fix lol.",
        "created_utc": 1678245372,
        "upvote_ratio": 1.0
    },
    {
        "title": "Bon Clay with no makeup",
        "author": "Just-League-468",
        "url": "https://i.redd.it/lobl2qfhmfma1.png",
        "text": "",
        "created_utc": 1678245063,
        "upvote_ratio": 1.0
    },
    {
        "title": "What if onepiece Luffy in SteamPunk as an 80s dark fantasy film",
        "author": "Americancheung",
        "url": "https://youtube.com/watch?v=USBlPq_YRVA&amp;si=EnSIkaIECMiOmarE",
        "text": "",
        "created_utc": 1678244947,
        "upvote_ratio": 1.0
    },
    {
        "title": "Oda's foreshadowing is insane, I noticed this in the zou arc while rewatching the anime. mention some other references you know.",
        "author": "TheArtShack-22",
        "url": "https://i.redd.it/ed4mqd853hma1.jpg",
        "text": "",
        "created_utc": 1678244713,
        "upvote_ratio": 1.0
    },
    {
        "title": "Timestamps of song of onepiece red film",
        "author": "animekachoda",
        "url": "https://www.reddit.com/r/OnePiece/comments/11lkcvd/timestamps_of_song_of_onepiece_red_film/",
        "text": "can someone give me the time stamps of all songs in the movie , one piece RED! \n\nthanks",
        "created_utc": 1678244610,
        "upvote_ratio": 1.0
    },
    {
        "title": "Was so excited getting this mammoth boy.",
        "author": "evosti15",
        "url": "https://i.redd.it/gph48sen1hma1.jpg",
        "text": "",
        "created_utc": 1678244202,
        "upvote_ratio": 1.0
    },
    {
        "title": "Best Devil fruit for garp",
        "author": "Nemoflinch",
        "url": "https://www.reddit.com/r/OnePiece/comments/11ljw78/best_devil_fruit_for_garp/",
        "text": "Guys give your suggestion what do you think would be the best devil fruit for garp.\n\nI think more more fruit.\n\nFruits can be cannon and non cannon as well.\n\nOpen to your imagination.",
        "created_utc": 1678243431,
        "upvote_ratio": 1.0
    }
]