[
    {
        "title": "I saw the rake when i was 10",
        "author": "Used-Negotiation-991",
        "url": "https://www.reddit.com/r/Paranormal/comments/10i3vix/i_saw_the_rake_when_i_was_10/",
        "text": "[removed]",
        "created_utc": 1674340922,
        "upvote_ratio": 1.0
    },
    {
        "title": "Graveyard camping",
        "author": "Percy_Engine_06",
        "url": "https://www.reddit.com/r/Paranormal/comments/10i3eo9/graveyard_camping/",
        "text": "So a few years ago, me and my dad went on a small camping trip, we left on Saturday, and arrived at a small parking spot, grabbed our backpacks, and we were off, we hiked for a good hour and eventually came to a clearing between the trees and a dry creek, we hung our hammocks, ate dinner, and watched a movie and went to bed. We left for home the next morning. Nearly a year later, my dad said that not to far from where we were camping there was a cemetery, I think he said it was just under 100 yards from us, not paranormal but disturbing and creepy.",
        "created_utc": 1674339680,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to Safely Comunicate",
        "author": "Superb_Vegetable_781",
        "url": "https://www.reddit.com/r/Paranormal/comments/10i3dlz/how_to_safely_comunicate/",
        "text": "I’ve had my fair share of paranormal encounters and experiences, but recently I’ve really been wanting to try to communicate and dive deeper in all this. I’ve done so in the past, but while it did provide some undeniable proof that the afterlife was real, I think that I might have also opened myself up back then to something that wasn’t so great and I fear I’ll do it again.\n\nIf anyone is wondering, I have never gotten direct answers to my questions immediately expect for last night when I was told that the spirit watching over me was my grandmother then my lights flicked on and off. The way I’ve communicated before was mainly sensing. I can feel things, I get chills and it’s just a thing that I thin me where I know something/someone is there. Then, I usually leave the room and when I come back, things are moved around. I’ve heard knocks and footsteps before, and sometimes think I maybe hear a voice but it’s never clear. I don’t have the access to stuff such as crystals or sage and all of that yet, nor any fancy equipment. I have my faith, my grandma, and my prayers that protect me. \n\nI have a friend who gets visions sometimes, blacks out for a second and doesn’t remember what happened but remembers that she saw something like her water bottle spill then her water bottle will spill moments later. One time she told me she had one of me bringing to cake to school and before I even knew about it, had had brought left over cake to school. She’s had experiences with lights turning off as well.\n\nThe two of us want to explore this more, try to investigate to some extent. The most important thing is that we’re safe about it though. So, I want to know if anyone has any tips",
        "created_utc": 1674339607,
        "upvote_ratio": 1.0
    },
    {
        "title": "Strange dreams that lately have felt too coincidental….",
        "author": "WilsonFiskInTheHizzy",
        "url": "https://www.reddit.com/r/Paranormal/comments/10i35n2/strange_dreams_that_lately_have_felt_too/",
        "text": "So I have been having strange dreams of/and/or relating to the afterlife (Dante’s purgatorium, hell, the fright demons) and they have been feeling oddly specific and concentrated on certain themes, those being fear and torment. I asked my doctors about these dreams and they actually mentioned other patients who have simular dreams that feel almost never ending. My theories on this is that people have premonitions of their afterlife before the fact, and can see their death fate in their unconscious dreams. This feels all but confirmed to me, please comment if you have had strange dreams of hell demons and satan destroying everything you hold deer. I am hopeful to see people relate to my theory and expecting replies of pitchforks and fire",
        "created_utc": 1674339022,
        "upvote_ratio": 1.0
    },
    {
        "title": "I'm starting to believe since working in a museum's collections department",
        "author": "WSFender",
        "url": "https://www.reddit.com/r/Paranormal/comments/10i33op/im_starting_to_believe_since_working_in_a_museums/",
        "text": "Howdy board, as with many I've always been into the paranormal but never really believed in any of it. I've sought out ways of experiencing paranmoral things, but anytime I've had something I have had a way of dismissing it and could chalk it up to just a weird occurence.\n\nAbout a year ago though I switched roles in the museum I work at. I've been here for five years and some weird things have happened--but again you can rule out most to weird coincidences. But when I moved into the collections department (we're the people who take care of the objects and artficats in the museum's possession and on loans) things got weird. Really weird, really fast. Everyone talks about museums being haunted and its understandable, we house and care for lots of really old--sometimes creepy--objects and many of them have storied pasts; our collection is roughly 200,000 pieces and we have some doosies.  \n\nTo make it short, I have been seeing shadows, hearing my name, and having lights turn on and off when I'm alone. Our storage is split into three areas--the upstairs mezanine is home to our toy and puppet collections, downstairs has three connected areas split in two rooms, textiles by itself, and American materials and ethnographic/world objects in the main area, and the third area is in a separate part of the museum, split into two, and houses larger objects and natural sciences.\n\nThe most convincing evidence I have experienced for the existince of paranormal activity happened about a month ago and its really stuck with me. To set the scene I was in our textiles room (lower level storage, in a room off of the main area with the world objects) returning some clothing we had shown on a tour. To briefly explain the storage setup, you come down the stairs and can go left into the world objects, or right and take a turn into the American materials. However, the stairs are the only thing separating the areas so the stairwell is more like a doughnut hole than anything. Turning left into world objects and immediately taking another left will let you walk perpindicular to the aisles of world objects and brings you to the right side of American materials. On that right wall--looking out into American materials, is the door into textiles. Its normal practice like with most places to only have lights on in an area you're working. So, I had lights on at the base of the stairwell, the very front of world objects, and that illuminated enought of my path into the textiles room. Up until now I had had lights turn off, doors slam, heard my name and had objects move--basic things but stuff i could ignore, look past, or explain away. I went down the stairs into this area and was immediately overcome with panic and anxiety. The room was cold and their was just a bad energy. I turned around, sat in my office for a couple minutes thinking I was just having a panic attack and cooling off, and decided to just ignore it. I went back down, hit the lights, beelined it into the textiles room and started putting things back in place. I felt like I was being watched the entire time I walked through the lower level but didn't think about it and figured I was just paranoid but I couldn't shake this gut feeling of paranoia. \n\nThen I left the room, and thats when it got bad. I opened the door and I can see all the way across American materials. The last shelving unit on the far wall from me is where we keep items from a famously deceased child (the family donated all of their belongings after their passing). There weren't any lights on in that area but I could see someone. It looked like a fully grown man, probably around 6 feet tall, and the shape was hulking. But they were darker than dark. They were darker than the shadows of the room. I'm telling you guys, with my oath on whatever you want that I could see this person that was darker than an unlit wall and it sprinted--I mean absolutely ran as fast as I've ever seen anyone run into the closest wall. Not at me, not to scare me, but sprinted to it's right which was only about 10 feet away from it into a cement wall. This all took place in about five seconds, and I just ignored it. I just quick walked out of the storage, flipped the lights and hauled it up the stairs. I got about halfway up the stairs when the hairs on the back of my next stood straight up and I heard someone say my name and the door knob at the base of the stairs started to turn. I didn't even stop to listen. \n\nI'm sure theres a way of explaining it--again I very much could've been having a panic attack but the anxiety went away just about as soon as I walked back up stairs the first time. Since then, things have gotten stranger with objects moving in front of me and other people in the department or doors closing in front of us. Like I said, things have happened since I've been here and there are plenty of stories of before I was in the department or at the museum, but this thing a month ago was just different. I'm only writing this now because last night I had a dream where a ghost or something was holding my mouth closed and pushing on my back and when I woke up it was happening too. I feel like things are just getting weirder and weirder with me and I've been looking into shadow people or other sorts of weird appiritions. \n\nI doubt this gets much traction, but if anyone wants to chip in on ideas as to what this might be or how to explain it I'd love to hear any and all thoughts. \n\nWishing my best to all of you.",
        "created_utc": 1674338882,
        "upvote_ratio": 0.99
    },
    {
        "title": "I met a Ghost I didn't even know it and I can't tell anyone about it",
        "author": "onetwothreeaway567",
        "url": "https://www.reddit.com/r/Paranormal/comments/10i2tds/i_met_a_ghost_i_didnt_even_know_it_and_i_cant/",
        "text": "FYI Long\n\nSo around 11 years ago I was a telecoms enginner.\n\nSo, the normal day went to afew residential houses, either fitted or fixed phone lines. Everything was no different from any other day, but then I downloaded my next job, and I got a 20-line installation. Now, this is not the norm for the role I had as I these tasks usually went to other teams. \n\nSo, no issues. I thought it would be nice to be somewhere for longer than an hour or two, then hear there and everywhere. \n\nSo I called the contact its a contact centre who tells me that either the caretaker or manager of the building is aware and will explain what is required. So I arrived, and it's a really old building built in the 1920s I later found out. \n\nSo I make my way in tester and tool bag as is the norm. So after speaking with a receptionist, I discovered that the building was at one point a nursing home, and after being derelict for a few years, it's now being used as offices for various businesses.\n\nSo as promised two managers arrive tell me that they think what I am looking for is in the cellar as there is a lot of cables down there and that's all they know, so I asked if the caretaker is about as they usually know these types of thing. I was told that he wasn't as he was ill but due back in the next day. \n\nSo I follow this man and woman to a number padlocked door they open it up, tell me code and on the other side of the door is a stairwell that just leads down to the cellar. So as we get down there, the light is poor, like really poor. I've no chance of working like this. I mean, there were lights, yes, but you're talking to pendant lights that weren't great.\n\nSo understanding this, the woman tells me that they have hanging lights, so no issues. I go back to the van, grab an extension , and head back towards the cellar. So as I'm passing the receptionist, she just asked, \"Are you going to be in the cellar on your own?\" So I just replied \"Yeah sometimes you have too, but of what I'm looking for isn't there I won't be for long\" she laughed but told me \"rather you than me nobody likes going down there even for storage space.\" \n\nNow I'll be honest I just thought people don't like stairs to a dark place. No worries, but not something I'm unfamiliar with, so it's just needs done. \n\nSo after a quick look around with the make manger we find a socket I sort the lights and yep there is the DP I'm looking for but it's an old solder block no good for broadband so I let him know that this is going to take abit longer and this is even before knowing were these 20-lines need to go. \n\nSo he just agrees and shows me where the office fitters have left all the cables for the clients, which to my relief if in the cupboard behind the receptionist. So all set knowing what I know I crack on. \n\nSo I'm testing all the lines and it's going well I've more than half going to the cabinet and afew shy, but I know the area and know from there I can get them through as it's got 2 200pair cables that run though it. \n\nSo at this point its around 4 o'clock I don't have the blocks I need on the van so tag up the cables and turn of all the lights on my way out before closing and locking the door on the way out. \n\nI sign out and tell the girl at the desk. I'll see her tomorrow and leave. On my way home, I called my manager to tell them the script and that I may need a hand for half a day or more as I'm not even sure anything has been done in the exchange. \n\nThe next day 8am I get a call from one of the other lads who tells me he is with me all day, and that's all he knows. So we sort out a role each I'll push the pairs from the box to the cab you do the cab and exchange is needed and then its just a case of fitting the box and running a large internal cable from the box to behind the receptionist. \n\nI make my way into the building once again, open the door with the code, and to my suprise, all the lights are on. Now I'm 100% sure I turned them off, so I'm guessing one of the managers may have come to check if I was still there and left them on my mistake. \n\n I go down and do what I need to do leave to push through the cables outside, call my mate, and he's getting the money by one, so it's going well. I finish up and head back to fit the block. \n\nSo I grab the blocks, drill all the bits etc etc. setup mark for pilot holes and just hear \"what are you doing?\" After nearly jumping out of my skin, I turn and see this man with grey overalls on. So I say I'm just doing what's been asked. Are you the caretaker. He replies that he is and says that nobody has been down here for years and surprised that I'm there. \n\nSo I just cracked on done the drilling, etc, and then as soon as I'd stopped with the drill and it was quieter, this guy just started chatting away. What football team do you support? Do you mind if I watch what you're doing. I told him no worries and just tried to be as polite as I could. He then told me that his name was Gordon and he had been working there for over 30 years.\n\nAbit confused recalling what the receptionist had said I told him I was under the impression that this place has been empty for few years and looking at the cabling it's not been updated for at least 15/20 years. He just said that things are always happening here. \n\nAfter about an hour of back and forth while I'm working I hear a hello from the top of the stairwell, expecting Gordon to answer I didn't, then it came again so I turned around Gordon has gone now I'm thinking I've been waffling for 10mins and he's not even here. \n\nI pop up, and it's one of the managers asking if I'm expecting somebody, another engineer. So I apologise explain the phone signal isn't very good down there so he probably hasn't been able to get hold of me. \n\nAll cleared, he comes down. we chat for 5, and he tells me he will start at the receptionist end and work to me while I finish. \n\nA quick toilet break, and I go back down. I'm in the final stages now. I'm just putting phone numbers to pairs as for when my mate gets there, we can connect the test and go. \n\nAs I'm doing this, I hear \"sorry about that.\" Again, out of nowhere, it's Gordon. So I just acknowledge it. Call him clever and make a joke that if they can't find you, they can't ask you to do anything. I continue for 5 minutes, and I've done all I can, so I tell him I'm just heading up to assist me, mate, and will be done soon and out of the way. Gordon then told me he liked the company, and it's been nice to talk. \n\nI felt saddened at this point thinking he was maybe treated poorly by people I'm the building, so I just said, of course, mate costs nothing to be nice and have a chat. \n\nSo I go up the stairs, leaving Gordon down there and help get the cable through a void and into the cellar. 10/20m of trying to fish it through, and we got it, we go down, Gordon is not around, and we finish. \n\nMy mate tells me it's time for food he will go the chippy ans meet me back at the yard as I tell him I just need afew signatures and to make sure the lights go back so I can get my extention lead. \n\nSo I get what I need from the manager signatures and show him where the link is behind the reception. Inform him that I need to get my extension lead, so are the lights ok there for now, or does he want to move them as we go as there's good light. He states that they might aswell stay for now and he will get another lead in case anybody else needs to go down there. \n\nI head down and start unplugging the lights, and Gordon appears again telling me he didn't realise the lights were mine as he wouldn't have touched them. \n\nStraight away, I thought ahh so that's why they were on this morning, but then it dawned the door.\" It was locked? I asked him if he had come down yesterday evening, and he said \"yes of course, I'm always here it's where I'm needed.\"\n\nConfused and wanting to disappear, I said, \"No worries, nice to meet you.\" I placed my hand and put to shake, and he just raised his hand and said, \"Hope to see you soon. \n\nSo I left signed out, thought nothing of it. \n\nThen a week goes by, and I get a call from our control, asking if I can return to this address as one of the lines isn't working and it's high level. \n\nSo I say yep no worries, I get there say hello again to the receptionist. I asked if I could just check behind her first before having to go into the cellar. With some joy, it is there it's just not a bit properly. As I'm sorting an older guy, he asks me if I was the one who was here last week I day yes. He apologized and stated that he was the caretaker and had to take more days off than planned. \n\nI just told him \"oh don't worry about it. I'm sure Gordon will tell you where everything is.\"\n\nAs soon as I said this, he just looked me dead in the eyes and said, \"What did you just say?\" So I said,\"Gordon he told me he is the caretaker here? \" This guy went white and just asked me if we could talk outside, so I followed. \n\nHe simply asked me if I believed in ghosts. Then told me that before this was what it is today it was a nursing home and the old caretaker was a man called Gordon. He knew this as when the building was taken over he found an old desk with to do lists, letters and requests for a Gordon and there was a sign on the door where this desk was that door lead to the cellar. \n\nI immediately rubbished this and started laughing thinking him and his mate were pulling my leg.\n\nHe then asked me if he was wearing overalls, which I replied he was.\n\nHe just looked me dead in the eye and said listen mate, im not lying. Gordon passed away years ago supposedly on the job. I just thought you should know as it's not something that's considered funny, telling me he has been mocked as he has also seen Gordon, but people just have never believed him. \n\nI never said a thing to anybody beyond that until one night fishing with a friend and just like he said he thought I was taking the piss. I know what I saw I know what I heard. \n\nI don't tell this to anybody as its not worth the ridicule. Hence why I'm using a throwaway account. Ghosts or spirits are real.",
        "created_utc": 1674338166,
        "upvote_ratio": 1.0
    },
    {
        "title": "I used to feel and experience things but not anymore. My experience.",
        "author": "Energydance3422",
        "url": "https://www.reddit.com/r/Paranormal/comments/10i221t/i_used_to_feel_and_experience_things_but_not/",
        "text": "[removed]",
        "created_utc": 1674336187,
        "upvote_ratio": 1.0
    },
    {
        "title": "Little girl that died from leukemia",
        "author": "jerry111165",
        "url": "https://www.reddit.com/r/Paranormal/comments/10i1wl5/little_girl_that_died_from_leukemia/",
        "text": "[removed]",
        "created_utc": 1674335790,
        "upvote_ratio": 1.0
    },
    {
        "title": "I’ve been getting cuts bruises and scratches all over me idk what to do…help",
        "author": "inkpinsnneedles",
        "url": "https://www.reddit.com/r/Paranormal/comments/10i1gx1/ive_been_getting_cuts_bruises_and_scratches_all/",
        "text": "Growing up I always had creepy things happen to me but it stopped for a bit but recently it’s started again I also used to feel like there was someone or something I guess watching me and for the past couple weeks since moving into this new studio it’s really creepy when I’m alone and I feel a presence and now I have cuts, bruises, and scraps. What do I do I’ve been told darkness follows me and I laughed it off because I love all things creepy but idk man",
        "created_utc": 1674334687,
        "upvote_ratio": 1.0
    },
    {
        "title": "Bothell Haunted House - Seems like a significant amount of documented evidence. What do you think?",
        "author": "GelloniaDejectaria",
        "url": "https://www.reddit.com/r/Paranormal/comments/10i0fft/bothell_haunted_house_seems_like_a_significant/",
        "text": "[removed]",
        "created_utc": 1674332057,
        "upvote_ratio": 1.0
    },
    {
        "title": "a weird experience",
        "author": "nightingalegod",
        "url": "https://www.reddit.com/r/Paranormal/comments/10i08np/a_weird_experience/",
        "text": "hey guys i’m from Turkiye and i have a weird story want to share with you.some nights i’m waking up a strange times.. like 3 am or 4 am.and if i sleep with mirror in my room,i will have nightmares.anyway this story about my experience.there’s an empty field behind my house and my house is on the 13th floor so i can see around very well.some nights when i woke up like 3 or 4 am,i wanna breathe so i usually go to window. but last night i noticed something strange in that field. I saw someone sitting there alone at that time of night. it's usually very cold at that time. my sleep was messed up too so i decided to watch that weird guy. he was acting so weird, he was spinning around and acting like a crazy person. i was worried about him but i kept watching. After turning around and looking at the air for about 40-50 minutes, he started to move away slowly. but he was walking with his arms bent so low that they touched the ground. on his way, he suddenly stopped and looked at my building. he tried to find me with his eyes as if he felt he was being watched. but there was definitely something strange in his face. because I was so scared, I closed my window and lay on my bed. after staying in my bed for about 3 minutes, I again succumbed to my curiosity and opened the window. and I saw him come a little closer to our building. I was about to go crazy with fear :D after seeing his face more clearly, I started to feel sleepy. I felt like I was going to faint at that moment. do you guys think this was a figment of my imagination? or have any of you experienced anything like this before? and if i ever see him again,i will try to record a video for you guys.",
        "created_utc": 1674331579,
        "upvote_ratio": 1.0
    },
    {
        "title": "Attacked by alien starfish in dream.",
        "author": "RedHawk451",
        "url": "https://www.reddit.com/r/Paranormal/comments/10hzx0t/attacked_by_alien_starfish_in_dream/",
        "text": "Hey parabros and paragals.\n\nI was asleep two nights ago and had a long sequence of dreams. I don't quite remember the beginning or the middle of it but I sure do remember the end.\n\nI was walking around with some family members members we saw this weird looking kobold thing. Kind of like a little man goblin. It was pushing a wheelbarrow and had a dog's head at the front that was still animated and alike. I was staring at the scene and then some small amoeba like four pronged starfish alien thing jumped at me out of the forest and landed on my neck.\n\nI woke up immediately and there was a genuine pain in my neck. Like a weird kink or a pulled tendon or something. \n\nThe dream demons hate me guys.",
        "created_utc": 1674330770,
        "upvote_ratio": 1.0
    },
    {
        "title": "Object disturbed in locked bedroom while spouse and I were sleeping.",
        "author": "justtheonetat",
        "url": "https://www.reddit.com/r/Paranormal/comments/10hznqc/object_disturbed_in_locked_bedroom_while_spouse/",
        "text": "Hi folks, first post here but I'm pretty weirded out so hopefully I'm in the right place.\n\ntl;dr - an object was disturbed while my wife and I were asleep in a locked room, we don't know how and it's messing with me especially.\n\nBackstory is long but takes a lot to explain the whole situation and rule out some fairly obvious potential causes.\n\nMy daughter gave my wife a granular wax candle kit for Christmas. You pour the granules in any appropriate container, put one of the supplied wicks down in the granules and you have a candle. Optionally add essential oil as scent and it just soaks into the granules. It was a very thoughtful gift, my wife loves it and I have grown to like it too, because of how it looks after the wick has melted the granules as it burns and creates a well like any candle does, but having the rest of it still be those loose granules I think is neat. Then when the wick is completely burned, you can lift the solidified wax out and either crush it to put back in the mix or get rid of it so you'll have only the tiny granules next time.  We set it up in a thick-walled fairly large but short square glass on a shelf near our bedroom door.\n\nMy wife goes to bed before me most nights and likes the candle lit. I blow it out when I come to bed, very gently because I want to retain that look of the deep well in the granules as long as the wick will last and I'm so careful to keep that look that I take pains to not disturb the granules next time I light it.\n\nWe have a cat that is not allowed in the bedroom at night, or ever if we can help it.  Her litter box is in the basement, so we leave the door from down there to our main floor living space propped open.  The basement has an exterior door and some windows so someone could break in and would have no other locks between them and our main space, so I also put a doorknob bar in place against our bedroom door when I go to bed.  Then at least someone would have to expend a fair amount of effort and make some noise to get in, rather than just jimmying one of those useless indoor \"locks.\"\n\nAll this happened as normal last night. I gently blew out the candle, disturbing nothing except the flame, locked the doorknob, put the bar in place and went to bed.\n\nThis morning I found the candle completely stirred around, the solidified wax partially crushed, granules piled up in random spots and in the corners of the glass, like somebody just played around in it for a minute.  None of the granules spilled and the candle itself not moved.\n\nMy wife admitted getting up to get a drink and take an Advil, but that is a common occurrence, she would have no reason to disturb the candle, she says she did not and she relocked/rebarred the door.  I do not remember getting up during the night and I usually do not.\n\nWe discussed sleepwalking but neither of us have done it in decades (that we know of).  We have seen no evidence of other animals -- nothing else disturbed, nothing chewed up, no droppings.  No noise sufficient to wake us.\n\nI'm pretty messed up by the fact that it's the only thing I can find being disturbed, and how much I enjoyed the look of the candle makes it feel like it was somehow personal, or at least a thing I would take more notice of.  So obviously a camera is going up and we'll see what I get.  Neither of us like the idea of a camera in the bedroom but I'm not going to cloud connect it and I intend to find out early in the movie if I'm living in The Conjuring.\n\nI know it's possible my wife is messing with and gaslighting me, but I really don't have any reason to think that's it.  We get along great, we're happy, life is fairly stress-free considering, there's really no reason for that to be happening.  In any case if that's it, the camera will stop it unless/until they can find another thing to mess with that's not being monitored.  Then I'll monitor that thing, and so on.\n\nSo let's just say that wasn't it.  What the heck then?",
        "created_utc": 1674330114,
        "upvote_ratio": 1.0
    },
    {
        "title": "I could’ve sworn I saw something last night.",
        "author": "Responsible-Sun2319",
        "url": "https://www.reddit.com/r/Paranormal/comments/10hz5l0/i_couldve_sworn_i_saw_something_last_night/",
        "text": "So last night around 10:00 I was a making myself a sandwich because I had skipped dinner that night. It was so quick, I will admit it could’ve been my imagination, but the first thing that came to my mind was “it’s a person”. I had seen a flash of something in the entryway to the kitchen, which was to my right. Later that night, when I was in bed and trying to fall asleep, I feel something scratching my leg. I was able to say “in the name of father, son, and Holy Spirit, go away” and it stopped. Definitely creeped me out.",
        "created_utc": 1674328831,
        "upvote_ratio": 1.0
    },
    {
        "title": "What books do you read?",
        "author": "Odinson725",
        "url": "https://www.reddit.com/r/Paranormal/comments/10hymnk/what_books_do_you_read/",
        "text": "I'm looking into the paranormal more after recent events, and I want to find some books to read more about it. Something more real, documenting the events and findings or things speculating the life's of the individuals before and leading up to their deaths. Anything would be helpful.",
        "created_utc": 1674327524,
        "upvote_ratio": 1.0
    },
    {
        "title": "New Paranormal PC",
        "author": "BipolarLiving",
        "url": "https://www.reddit.com/r/Paranormal/comments/10hyjrj/new_paranormal_pc/",
        "text": "I’m starting a paranormal pc and looking for true stills from your past or present. Please message me if you’d like to share them and if you’d like to stay anonymous",
        "created_utc": 1674327313,
        "upvote_ratio": 1.0
    },
    {
        "title": "Malfunctioning scale?",
        "author": "Chriller1122",
        "url": "https://www.reddit.com/r/Paranormal/comments/10hxcew/malfunctioning_scale/",
        "text": "Greetings fellow paranormal enthusiasts,\n\nI have been experiencing some strange occurrences with my scale lately and I can't help but wonder if there could be a paranormal explanation. Every time I step on the scale, it seems to be off by a few pounds. At first, I thought it could be a malfunctioning scale or a fluctuation in my weight, but the more I think about it, the more I am convinced that something more sinister is at play.\n\nCould it be possible that a ghost or spirit is messing with my scale as a way to mess with my mind and make me doubt myself? I've been struggling with my weight for quite some time now and it's possible that the paranormal entities are aware of this and are using it against me.\n\nI know some may think that I am in denial about my weight and that this is just an excuse, but I assure you that is not the case. I am open to all possibilities and I am willing to consider the possibility of paranormal involvement.\n\nHas anyone else experienced something similar? or have any advice or theories about this? I would love to hear your thoughts.\n\nThank you.\"",
        "created_utc": 1674324291,
        "upvote_ratio": 1.0
    },
    {
        "title": "Something is crying in my house at night",
        "author": "CarelessEvent8675",
        "url": "https://www.reddit.com/r/Paranormal/comments/10hwngm/something_is_crying_in_my_house_at_night/",
        "text": "Okay, a little background. I live with my husband and 5 children in a ranch style house. We've been at this place for 5 years now, and our kids range in age from 13 down to 1 year. \n\nFor the past 3 or 4 months, there's been something in my house that cries at night. It's not my kids or my cats. It's something else.\n\nThese disturbances typically happen between 10pm-2am. Usually what happens is my husband and I are in our living room at night, watching TV and unwinding from the day. All of the children are asleep because they have a 9pm bedtime. Suddenly we will hear the sound of a child crying, and I mean LOUDLY crying, not just whimpers but big sobbing cries. One of us will immediately jump up to go check the kids, as all of my children have had night terrors and typical childhood nightmares at some point. But none of them are ever awake. They're all fully asleep, completely peaceful. This will repeat a few more times until we go to bed. \n\nIt doesn't happen every single night, maybe only once or twice a week, but it's very disturbing when it does. My 13 year old has also heard the phantom crying, as she was up late with my husband and I one night on the weekend. \n\nAlso, my children do not have TVs in their rooms and their tablets/switches are always off, so it's not a sound coming from anything like that. They're not crying in their sleep either.  They are always peaceful and undisturbed, not even moving around when me or my husband goes to check on them. We don't have a baby monitor, so there's no chance of interference coming from one. I do have 2 Siamese cats who make noises that sound exactly like human voices, but they are always in the living room with us at night or sleeping in front of the heater in our kitchen, and I have been able to confirm it's not them.\n\nAs well as the crying at night, we often hear the sound of doors opening and closing, most often the door to my daughters' bedroom. It makes a specific sound because the door sticks a little and you have to put some force into opening or closing it. We always go check on the children after we hear this, and all of them are always asleep. \n\nThese things are not just heard by me, but my husband too, so I know I'm not going crazy. The only thing even remotely like this that has ever happened to me was when my current 5 year old was around 2 (about 3 years ago and in the same house), and we both heard the sudden and extremely loud sound of what I can only describe as something or someone pretending to cry like a baby. I know that sounds weird, but it's the only way I can describe it. Imagine a grown adult, almost mockingly, pretending to cry like a newborn - that's what it sounded like. It was so loud and frightening that my daughter instantly started screaming in fear and I packed us into the car and left the house toot sweet. We spent the rest of the day at my sister's and I refused to be alone in the house without my husband for the next couple of days. \n\nSo, what could this be? A demon? A ghost? I don't really believe in the idea of dead people just hanging around your house for eternity. A mimic? What could this thing want and how do I get rid of it?",
        "created_utc": 1674322573,
        "upvote_ratio": 1.0
    },
    {
        "title": "looking for recommendation to have a session with someone who talks to the dead",
        "author": "MarMar9292",
        "url": "https://www.reddit.com/r/Paranormal/comments/10hweus/looking_for_recommendation_to_have_a_session_with/",
        "text": "[removed]",
        "created_utc": 1674321961,
        "upvote_ratio": 1.0
    },
    {
        "title": "Baddddd attack last night?",
        "author": "ClairVouyage",
        "url": "https://www.reddit.com/r/Paranormal/comments/10hwaet/baddddd_attack_last_night/",
        "text": "I usually am equipped to deal with sleep paralysis or astral projection episodes in a calm and composed manner. I also rarely see the entity’s face when in a sleep paralysis state. They most reveal themselves when I’m lucid or astral. \n\nBut last night, I had the most interesting encounter of my life. And Incubus came to visit me. And it was strange bc I was sleeping on my tummy. I have honestly never gotten sleep paralysis when sleeping on my tummy. And even while on my tummy, for some reason, I could see it’s entire face and bodies. \n\nIt had this weird, malicious smile as it climbed on top of me. Like it knew me. Or had a personal vendetta against me. It crawled up to me on all fours, even though it was long and built more so like a human. Very scaly skin. Sharp teeth, with some missing. And some rather tiny bones or thorns sticking out of its body. \n\nIt climbed on top of my, and instantly took a bite into the side of my chest/breast. And it started sucking. The sensation was so strong, I felt like I was dying. I genuinely felt myself slipping away. Nothing in the dream state has ever felt as life threatening as this encounter.\n\nUsually I can call upon the spirit realm for help and I am instantly released from the episode. When I say instant, I mean instant. But this time, I called, and nothing changed. It kept sucking aggressively and consistently. I felt myself passing out, and with the last breath I had, I called upon the arch angels. Within a few seconds, I was magically awakened. But too startled to go to sleep.\n\nHowever, I wasn’t fully awake yet. I saw those transparent spirals that looked like I was coming down from an acid trip. I fought to stay awake for a couple of minutes before falling asleep again.\n\nWhat the actual fuck? And with all the tears and experience I have witch sleep paralysis, why now? Before I fell asleep last night, I saw a video that said “new levels, new devils.” I wonder if this applies here",
        "created_utc": 1674321636,
        "upvote_ratio": 1.0
    },
    {
        "title": "Object thrown across room",
        "author": "Freshandflybaby",
        "url": "https://www.reddit.com/r/Paranormal/comments/10hw20b/object_thrown_across_room/",
        "text": "Hi everyone! Here to share a recent experience and see what you guys think. I have been going through a lot of stress in my life, probably the most stress that I’ve ever experienced. Recently moved to a new apartment. One night I went to bed very angry. I awoke around 3am to see a crystal palm stone hurled across the room and hit the wall very forcefully. Like so forceful it woke my upstairs neighbors. Either something caused it or I did it and was not aware. I’m not a sleep walker, don’t have any memory of picking up the palm stone, or any memory/sensation of throwing it. It’s kept in a bowl on my nightstand with a lot of other items. I would have had to dig for it. For me to throw it that hard, I would have had to swing my arm back. I’ve tried to do a reenactment with me throwing the stone but could not replicate the force with which it was thrown. I just woke up to see it flying across the room. Wondering what the heck was that?",
        "created_utc": 1674321029,
        "upvote_ratio": 1.0
    },
    {
        "title": "Extra playing cards",
        "author": "Queen5252",
        "url": "https://www.reddit.com/r/Paranormal/comments/10hvjp9/extra_playing_cards/",
        "text": "My siblings and I play cards often, we know so many games. Its something we would teach all our friends so we could have more competition. Anyway, we are a family of 5 kids. Most of us knew how to play hard games like spades and golf. Anyway, my siblings and I, would sit in the living room playing for so long. One night my little brother asks me to play, so I sit down and deal the cards. We have many decks of cards in our home. Some are even laid out on the counter just ready to be played with. Anyhow, my brother and I are focused on the game. All of a sudden I feel cards being flicked on me and it’s hitting me one at a time. Each one feeling like it’s intentional… So I automatically get annoyed and yell at my baby sister to stop flicking cards at me. She wasn’t anywhere near the cards. As I turned my head, the cards are flicking themselves one at a time, towards me. My little brother and I were just shocked, the cards were not anywhere near a window. My sister was far from it, the cards kept flicking off the counter one at time. I never thought I’d experience something like that.",
        "created_utc": 1674319737,
        "upvote_ratio": 1.0
    },
    {
        "title": "Has anyone ever had experiences in the allagash area in Maine?",
        "author": "Guilty_Astronomer_45",
        "url": "https://www.reddit.com/r/Paranormal/comments/10husnp/has_anyone_ever_had_experiences_in_the_allagash/",
        "text": "[removed]",
        "created_utc": 1674317778,
        "upvote_ratio": 1.0
    },
    {
        "title": "I Don’t Believe",
        "author": "PsychedelicMelic",
        "url": "https://www.reddit.com/r/Paranormal/comments/10huack/i_dont_believe/",
        "text": "Okay so I think I should start off with by no means am I trying to trample anyone’s beliefs, but I honestly have not seen any sufficient proof that ghost exists nor do I thing god or demons exist. Growing up my family raised me to be Christian but from a young age didn’t believe in it but would follow along so I didn’t upset my family and become the black sheep. Well I became the black sheep anyways but that’s besides the point, I just feel like this paranormal stuff is just a big hoax but I have been actively seeking for proof but have yet to find any. I just thought I should ask everyone’s input on the subject and possibly even share your story on your\nAha moment that made you believe. Thank you for reading and I hope you have a wonderful day!!",
        "created_utc": 1674316464,
        "upvote_ratio": 1.0
    },
    {
        "title": "Premonitory dream about mother passing away",
        "author": "Weary_Stuff9767",
        "url": "https://www.reddit.com/r/Paranormal/comments/10ht59p/premonitory_dream_about_mother_passing_away/",
        "text": "This morning I had a vivid nightmare in which my relatives phoned me at work to tell me my mother had died. Bizarrely, this sequence was followed by another one in which my mother phoned me from hospital to tell me that she was very ill. The dream was so intense it woke me up in the middle of the night and couldn't go back to sleep. \n\nNow my brother has phoned me to tell me my mother just tested positive for COVID. She is an elderly woman in her 70s with underlying conditions, and she's been vaccinated and got all the boosters available. Even though I've never had premonitory dreams before I'm terrified this might have been one and that my mother is going to die.",
        "created_utc": 1674313303,
        "upvote_ratio": 1.0
    },
    {
        "title": "Crow knocking on my window",
        "author": "FaZe_Abortions",
        "url": "https://www.reddit.com/r/Paranormal/comments/10hrnzu/crow_knocking_on_my_window/",
        "text": "Hi i know it probably is nothing but it was so weird that i had to ask, i was having a really bad nightmare and then i got waken up by a crow knocking on my window repeateadly i literally sleep next to a big window so it was knocking right next to me, as soon as i woke up he flew away, i felt super weird after , Its really early but i dont think im going back to bed 😵‍💫",
        "created_utc": 1674308972,
        "upvote_ratio": 1.0
    },
    {
        "title": "Clicking of a light/power outlet switch heard in a room with nobody in it and the door closed",
        "author": "ArmA3_Coyote",
        "url": "https://www.reddit.com/r/Paranormal/comments/10hquu7/clicking_of_a_lightpower_outlet_switch_heard_in_a/",
        "text": "About 9 days ago I was staying over at my friend's house (there was 3 of us in total) and at around 3pm AEDT we all heard about 7-10 distinct clicks that sounded like a switch being flipped with about 4 second intervals between each flip. \nThe sounds came from a room with the door closed and nobody in there (2 of us checked everywhere) and the sounds stopped as soon as we opened the door and stepped inside. We were in the room directly opposite to it.\n \nIt's a relatively new house and there was nothing that we saw that might have been causing the sounds. \nI've got no clue as to whether there's a reasonable (natural) explanation to this or if it could be something supernatural as I've never had anything similar happen before that I can remember. We'd really appreciate some help on figuring out what it might have been.\n\nPS. We live in Australia and were the night before discussing general supernatural stuff (kinda deeply tbh)",
        "created_utc": 1674306475,
        "upvote_ratio": 1.0
    },
    {
        "title": "Unexplained occurances",
        "author": "vixen_vicious",
        "url": "https://www.reddit.com/r/Paranormal/comments/10hovho/unexplained_occurances/",
        "text": "Hello,\n\nEvery now and again I hear running footsteps in my house. I do have a cat and a toddler, but every time this happens the cat is with me and the toddler is in bed.\nTonight I felt a cold spot while I was rocking my kid. It was at head level and when I out my hand up it felt tingly.\nThoughts? Is the spirit escalating? I didn't feel any bad feelings or good for that matter.",
        "created_utc": 1674299178,
        "upvote_ratio": 1.0
    },
    {
        "title": "Ouija boards. Enjoy.",
        "author": "Staxu9900",
        "url": "https://www.reddit.com/r/Paranormal/comments/10hoprr/ouija_boards_enjoy/",
        "text": "Why people use this boards? \nThey must be desperate or teenagers fooling around.\n\nIs there even a way of inviting only good spirits, using boards? Or it’s basically a gate that anyone can use and anything will go through? \n\nFrom what I see here, it’s like giving toddler a hand grenade to play with, only matter of time for things to go South.",
        "created_utc": 1674298601,
        "upvote_ratio": 1.0
    },
    {
        "title": "Pranks gone wrong",
        "author": "Queen5252",
        "url": "https://www.reddit.com/r/Paranormal/comments/10hni84/pranks_gone_wrong/",
        "text": "When my big brother passed away, one of my good friends came to spend the night. Keeping us company as the funerals in our culture take about 10 full days. So my little sister, friend and I came up with a plan to pull pranks on my cousins and 2 brothers. It’s about 1am, everyone is in bed and my sister and friend are ready to pull pranks on the boys. We grab all the lotion and our phones to use as a light. First victim, my baby brother, we couldn’t stop laughing the whole entire way there. Anyway, we failed the mission turned around and went back to the room. We gave each other a pep talk and resumed back towards the room my little brother was in. We are creeping into the room &amp; I used the phone to flash towards the bed and no one was there. My sister and friend both were a little confused because we just saw him the first time we tried. As I turn the phone to flash around the room… there were pants. As if someone was standing… I didn’t point the light upward. All I saw were the jeans my big brother that had passed away would wear all the time. Black Jabos with the blue straps…. My sister and friend both screamed and ran into my room. I on the other hand had to pee so I ran straight into the bathroom. I had to catch my breath as it scared the air out of my lungs. My little sister and friend both banged on the bathroom door and as I let them in. I asked if they saw what I saw…. Both answered…. “You mean Benny’s jeans” we collectively saw my brothers pants standing straight up as if he was there. I asked my little brother if he was pulling a prank on me the next day… he said after we woke him up the first time he left to sleep with my parents.  So the room was empty. My little sister and friend both have a feeling that my big brother was just trying to make his presence known. Idk… but a story I’ll never forget to this day.",
        "created_utc": 1674293825,
        "upvote_ratio": 1.0
    },
    {
        "title": "Not sure but would like to know",
        "author": "moisturizedmelon",
        "url": "https://www.reddit.com/r/Paranormal/comments/10hmo4w/not_sure_but_would_like_to_know/",
        "text": "[removed]",
        "created_utc": 1674290327,
        "upvote_ratio": 1.0
    },
    {
        "title": "Whispering in the woods?",
        "author": "SimilarRock6037",
        "url": "https://www.reddit.com/r/Paranormal/comments/10hl19i/whispering_in_the_woods/",
        "text": "We camped in the area of Cane Creek Kentucky, near Laurel Lake.\n\nMe and my friend camped down on his property in literal BFE. No service, no noise, no anything but you and the woods. We set up our tent under an overhang, and I was tasked with gathering firewood. It was about. 5pm or so, while collecting I get an odd feeling, and start hearing whispers. They weren’t saying anything, it was just murmurings, couldn’t make anything out. At that point I get a creepy odd feeling and move closer to our camp to collect firewood. Not straying anymore after that lol\n\nNight progresses and nothing out of the ordinary happens, until we climb into our bags. I heard foot steps in the leaves and more murmurs, I was getting genuinely freaked out but I know the best thing to do is ignore it, and sleep. I did. And the following morning me and my friend found ourselves awake at 5am. He asked me if I heard whispering at night, I told him I heard it twice. We were both equally as baffled.\n\nClarification: We were not the first people to camp in this area. His uncle and his friends attempted to camp there but couldn’t make it through the night. My dad is a hunter and he refuses to go down there to hunt anymore, as well as another friend I have, his dad says that the air down there is “rich in death.” We have also found arrowheads on the property. \n\nWhat it means, no idea. Any idea’s here? This is the first time i’ve ever encountered anything like this in my camping adventures.",
        "created_utc": 1674283781,
        "upvote_ratio": 1.0
    },
    {
        "title": "Ghost descriptions",
        "author": "Billy_bilo_",
        "url": "https://www.reddit.com/r/Paranormal/comments/10hkugt/ghost_descriptions/",
        "text": "[removed]",
        "created_utc": 1674283035,
        "upvote_ratio": 1.0
    },
    {
        "title": "Anybody out there who has experienced another dimension? Please share your story",
        "author": "Billy_bilo_",
        "url": "https://www.reddit.com/r/Paranormal/comments/10hktm4/anybody_out_there_who_has_experienced_another/",
        "text": "Has anyone here experienced, either in a dream or in waking life, a dimension other than the third? Even if it was just a glimpse. I would love to read your story.",
        "created_utc": 1674282937,
        "upvote_ratio": 1.0
    },
    {
        "title": "Suddenly doppelgängers everywhere… why?",
        "author": "magical_bunny",
        "url": "https://www.reddit.com/r/Paranormal/comments/10hkcno/suddenly_doppelgängers_everywhere_why/",
        "text": "I keep on seeing doppelgängers.\n\nAt first, this was exremely odd, but now it keeps happening. \n\nSo I used to work with a couple, I'll call them Jade and Ken.\n\nJade and Ken both moved to work in another department many hours away. \n\nSo one day I am in a waiting room and there is a woman sitting there. It's Jade but it's not Jade. She looks exactly like her, with one exception - she has a tattoo on her arm and Jade had no tattoos. \n\nEverything about her is Jade down to her hair, her expressions, her freckles, her clothing style (Jade had a very particular style). Even her voice was exactly like Jade's. She even gave me a glance as if she knew me, but looked away when I tried to catch her eye. \n\nThis in itself blew my mind - this wasn't just a similar looking person, this was a replica that made me think Jade may have had an identical twin who'd been adopted out. \n\nThat theory was blown away when in walks a guy who looks almost exactly like Ken. Now, with him I could tell he wasn't Ken, he looked like he was 85% Ken if that makes sense, whereas with the Jade lookalike it was the tattoo that tipped me off that it wasn't her. \n\nI contacted Jade to ask if she'd been around, she said no (she was still living many hours away) and had a laugh about the idea that there could be a replica Jade and Ken out there. And no they weren’t lying - their social feed showed they’d be far away. \n\nBut it didn't stop there. \n\nNext I saw a guy who was the spitting image of a guy I buy my coffee from. It's a special type of coffee and he's a really sweet and thoughtful guy who loves to chat when we see each other. I saw the guy who I believed was the coffee guy, he looked exactly like him. \n\nWhen I saw him I said \"hey Adam!\" but he completely ignored me, almost as if he wasn't there, almost as if he wasn't part of the surrounds. \n\nThis happened once again recently with yet another guy I know, it wasn't him despite looking exactly the same.\n\nWhere this gets weird all over again is there is a guy that me and my friend Brad (who has since moved back overseas to his home country) used to call \"MC man\". It was an in-joke as he used to serve us at McDonald's when we'd go in and for some funny reason my friend took a liking to him and so affectionately gave him this nickname. \n\nNow, I ended up eventually following MC Man on Instagram when he came up as a suggestion, not to be stalkerish but because it was interesting just following him given we knew him at the shop. He eventually moved away from town.\n\nA few months ago, I matched with a guy on Tinder, the spitting image of MC Man. I even showed my friend Brad his photo, and Brad said that's MC Man. Well I started chatting to this guy and he's never even been to my town, never worked for McDonald's. I now can't find MC Man's instagram account. Sure, they may look alike and maybe MC Man got rid of his account or renamed it or something, but in context, it just seems really weird. \n\nNow, this is where it gets weird all over again. Remember Brad from the last story? \n\nYesterday I saw him as I was driving my car, on the side of the road. He is overseas, but this looked exactly like him, even his legs, same glasses, same blue T-shirt he used to love to wear. Right down to his stance and facial expression. \n\nBy the time I drove back to look again, no one was there. \n\nAnother funny thing that just happened yesterday was a historical photo popped up on Instagram of a guy who is 100% the spitting image of my older brother. \n\nIt's weird I am seeing doppelgangers now after having seen one and only one several years ago. At that time, it was myself I saw in a crowded shop. Later that evening I was lucky to avoid a serious multi-car crash on a highway by just being a car or two behind it. \n\nAll these people popping up who look exactly like people I know have only started happening in the past two months. \n\nI really have no idea what's up with that.",
        "created_utc": 1674281261,
        "upvote_ratio": 1.0
    },
    {
        "title": "May have a ghost cat? What does it mean?",
        "author": "Wetdogg88",
        "url": "https://www.reddit.com/r/Paranormal/comments/10hjycs/may_have_a_ghost_cat_what_does_it_mean/",
        "text": "Me and my bf were getting ready for bed  for the night, and when I walked in I close the door behind me every night to keep my two cats out for the night. I made sure they were both laying in the living room and I close the door. When my bf and I were just about to fall asleep I feel something jump onto the bed by my feet and then jump off again. I looked at my bf and said “there are no cats in here.” And he shined his phone towards the closet since my hyper kitty loves to explore in there and when he shined it we could see her jump off a box and back onto the floor. So he got up to crack the door open for her so she could get out but when he did that he noticed both of our cats were in the living room.  What does this mean? I’ve never had an encounter with an animal spirit before and just wonder why it looked like one of our cats. If anyone’s experienced this before I’d love to hear.",
        "created_utc": 1674279889,
        "upvote_ratio": 1.0
    },
    {
        "title": "something is haunting me after I asked it to show itself",
        "author": "Still_Ad_7226",
        "url": "https://www.reddit.com/r/Paranormal/comments/10hii7a/something_is_haunting_me_after_i_asked_it_to_show/",
        "text": "am I experiencing a spirit\n\nI've experienced a few things that I believe r ghosts and I'm just realized that it only happened where I'm living rn\n\n1. Something was behind me\n Lemme explain the layout of my house.\nU have the living area and then a doorway to the bedrooms.\nI was walking to go to the living area when I I felt something staring at me (like literally staring holes into my head) but yk I thought it was my brother, them i dropped something and bent down to pick it up and if I can remember correctly I moved out the way bc I thought my brother was trying to squeeze past me (I felt something touch me) then I looked behind me and no one was there.\n\n2. She knew my name \n I was in the lounge on the couch, my mom was folding washing in the kitchen, my dad and sister were working at the dining table, and my two brothers were in their rooms. I heard a female whisper my name \"hannah\" right by my ear, then i turned to ask my mom what she needed, she said she didn't call me and then I told her what I heard, then my dad, sister and mother all said they heard the same thing whisper my name. (My brothers were in the room like I mentioned so we wouldn't hear them whisper and it was a female voice.)\n\n(The next story's r the ones after I asked the spirit to show itself)\n\n3. The man at the door\nMy brother was playing on his pc (with headphones so we couldn't hear and he couldn't hear anything) then we heard a man by the front door say something In audible. We thought someone was coming to talk to us but hesitated bc we were scared. My cats were looking at the door all scared and then ran away quickly. Thing is when we went to look no one was their. The upstairs door was closed so we would've heard them close or open it, and we would've heard them go downstairs, also they would've called us a second time if they needed something.\n\n4. It's touching me\nThis one isn't rlly a set experience but I keep on feeling something touching my right shoulder, and It can't be my hair bc it doesn't go to my shoulder. (This only started happening after we heard the male voice) and I wouldn't have questioned it if it happened once or twice but it's happened atleast more than five times.\n\nAnyway I just think this is strange and the two last ones only started happening after I asked any spirits to reveal themselves if they would like. I made a post before and ppl agree that the voices were probably a ghost but I just want to write this all down since I only realized it now but this has never happened before.\n\nI Want to know if anyone agrees that there is a spirit in my house.",
        "created_utc": 1674274944,
        "upvote_ratio": 1.0
    },
    {
        "title": "Weird window shadow/light",
        "author": "BallHaver69420",
        "url": "https://www.reddit.com/r/Paranormal/comments/10hig5u/weird_window_shadowlight/",
        "text": "So i saw light through the window but it was flashing purple and blue which was weird because it was morning and there were no purple or blue lights around me. I was wathcing something on my phone and after turning on the camera it jammed. at first the camera had the blurry not yet focused look then itwas stuck on one frane.",
        "created_utc": 1674274748,
        "upvote_ratio": 1.0
    },
    {
        "title": "I think my dead brother is trying to communicate with me.",
        "author": "tdarn_96",
        "url": "https://www.reddit.com/r/Paranormal/comments/10hh7zs/i_think_my_dead_brother_is_trying_to_communicate/",
        "text": "So as the title says, I think my brother has been trying to communicate. He passed away in the fall of 2021 and it was a pretty complicated time. \n\nA lot of hard feelings. Growing up we were never close. 7 year age gap with him being older, a shitty toxic home life with parents who had no idea how to help their child who was bipolar and it unfortunately wasn’t diagnosed until too late. \n\nAfter he passed I was able to talk with one of his closest friends and she really brought a lot of things to light for me.\n\nWithout getting too into it she was able to tell me that he always wanted to be close with me he just didn’t know how and feeling like an outsider in the family made him just not want to be close to anyone. \n\nAnyways back to the topic at hand, over the last few months where I keep his urn and Highschool Jersey, my husband has heard a very loud male scream at random times and it absolutely terrifies him. \n\nWell it happened again tonight and after my husband went to bed I took it as an opportunity to have a chat with my brother. \n\nSay things I’ve always wanted to say. Had a good cry. Idk if it’s really him trying to communicate or not but it felt good to talk to him and let it all out. I told him if he was trying to talk to me then I’d make it a point to do this more often and let him know what’s going on in life. I have absolutely no idea what happens after death but I hope he’s at peace finally after such a hard life.",
        "created_utc": 1674270750,
        "upvote_ratio": 1.0
    },
    {
        "title": "A Void Filled With Stars",
        "author": "humanefly",
        "url": "https://www.reddit.com/r/Paranormal/comments/10hgwox/a_void_filled_with_stars/",
        "text": "[removed]",
        "created_utc": 1674269773,
        "upvote_ratio": 1.0
    },
    {
        "title": "real or fake?, I belive that is real",
        "author": "BoxEastern",
        "url": "https://www.reddit.com/r/Paranormal/comments/10hgs8n/real_or_fake_i_belive_that_is_real/",
        "text": "[removed]",
        "created_utc": 1674269366,
        "upvote_ratio": 1.0
    },
    {
        "title": "I had a strange story",
        "author": "mynameissmileyface",
        "url": "https://www.reddit.com/r/Paranormal/comments/10hgpxt/i_had_a_strange_story/",
        "text": "I will start from saying that I’m not a religious person but i believe in ghosts etc. because i seen some weird things in my life, and heard stories from my family. \n\nThat story happened in December 2022. I live in rented apartment with my fiance, the building was built in 2003 so it’s not the old communism building vibe(finally, I am from Poland and always lived in older apartments). \n\nI was chilling on my chair playing some racing games, my fiance was in work that time, then i heard knocking on the door, about 10 knocks, it had to be real, not in game, nothing else in apartment, the main entrance door. I wasn’t waiting for anybody, it was about 22/10pm, so i went to the door but seen nothing from the viewfinder. Normally i would just go back to my business but this time, still don’t know why, I opened the door, and now all the $hit started. Staircase have a shape that i will see if anyone is here, it’s a 4 level building and You can hear anything from any part of the staircase. No other sound like steps or closing other door, and the smell… normally You can smell the stone with cleaning products, all neighbours is maximum 50yrs old but I’m sure to this day that on this day it smelled like an old person(You know this smell) and it was so strong like someone is nearby me, i felt weird and hide back to apartment, closing the locks asap. I wasn’t scared, as i said i had some other stories but i had really weird feeling.\n\nTo this story i can add that sometimes in night when i go to work at 3am, in elevator You can hear sound like someone is running down the stairs, only at night. Sometimes when i go down to garage to my car, it have problems with starting, it ignites, but with struggle, again only when I’m alone and not always(it’s 27yrs old corolla, but in perfect shape and even starting it outside in -10 it never have problem) my fiance didn’t notice any of this, but in past she had some other stories in her old apartment. \n\nThat’s time for question, anyone had similiar story? What could it be?",
        "created_utc": 1674269163,
        "upvote_ratio": 1.0
    },
    {
        "title": "Premonitory Dreams are Real",
        "author": "Ok-Assumption7644",
        "url": "https://www.reddit.com/r/Paranormal/comments/10hgn5s/premonitory_dreams_are_real/",
        "text": "Premonitory Dream\n\nHello group. Asking the administrators for permission, I would like to show you some posts about an incident that occurred recently and is public knowledge.\n\nFirst I'll tell you what it's about, then if you give me permission I'll show you or look at it on my account.\n\nPremonitory Dream warns of a missile hitting a building in the Ukraine in a city on the banks of a river. A young teenager with a slightly older boy led the dream.\n\nI wrote it down and published it on my social networks to have a certain date.\n\n2 days later, the incident occurs. The first news I found spoke of a building destroyed by a missile in the Ukrainian city of Dnipro, which is located on the banks of a large river which gives its name to this metropolis.\n\nIt said a 15-year-old girl was killed in the incident along with 9 other people and 60 were missing.\n\nThe young woman in the dream was the first to be named.\n\nTwo days in advance, they reported the incident. Or, they died and were contacted again from the afterlife by anchoring 2 days in the present past through a dream.\n\nAll posted on Twitter on January 12. This happened on January 14.\n\nIt is evidence that there is life after death.\n\nAnd it is not an isolated case. I show these contacts very often.\n\nThoughts on it? Questions?",
        "created_utc": 1674268917,
        "upvote_ratio": 1.0
    },
    {
        "title": "update* oujia helpful demon",
        "author": "sleekapple25",
        "url": "https://www.reddit.com/r/Paranormal/comments/10hfoe0/update_oujia_helpful_demon/",
        "text": "Aw  i had a video but not allowed\n Maybe ill post it somewhere else but for this sub...\n\nBasically situation is i started getting suspicious the spirit/ guardian angel amelia  i was talking might be a liar, and therefore might be a harmful spirit or drmon.\n\nProblem is she was overall very helpful, pisitive, influence who even warned me about protecting myself against harmful spirits.  \n\nWe had a little chat,  ill summarise here\n\nMe: hey why you lie?\nHer: that wasnt me \nMe: oh yeah that wasnt you?\nHer: no ( planchette got stuck on no, very firm but movable,  i took that to mean a strong denial)\nMe: who was it\nHer: i have no idea, best guess is someone was pretending to be me\nMe: yeah but now we're back to square one, either thiis the truth or your lying. See my problem? If i summon you and you always show up, then one time, i catch you in a lie  and you say that wasnt me .  Well why wasnt it you if i summoned you? \nHer: you forgot to protect yourself. I warned you to be careful about harmful spirits ( i get the impression she was telling me i rushed into a session, honestly cant remember but i always start by finding my peace and casting a circle of protection so i dunno)\nMe: how are we going to get to the bottom of this. In the interest of protecting myself.\nHer: simple. Trust your intuition. \nMe: trust my gut basically is what your saying? \nHer: look inside your heart\n\nMe: (turns to camera) see the problem? That sounds like something a spirit guide would say? That sounds jedi.  I think for a moment... honestly you only seem helpful, been nothing but positive influence,  intertwined in the divine synchonicity of my life , never felt scared or threatened,\nHer: what sbout the other night?\nMe: hmmmmm..... i cant say anything felt off\nHer: did it feel right?\nMe ....\nHer: you say it didnt feel off, but you didnt say it felt right either\n\nMe: thinking she makes a good point  and interrupted by dog decide to close the session  \n\nAs im closing up,   I casually glance at my crystal ball and have a vision, wasnt trying just happened....\n\nA skelton is drifting in water, gulls can be heard, in the distance a lighthouse appears, the skeleton becomes human in the guiding light and swims towards it. A peaceful christmas village awaits with bustling happy people sounds \n\n\nSo yeah thats the update so far, maybe look for the video in another sub in near future",
        "created_utc": 1674265970,
        "upvote_ratio": 1.0
    },
    {
        "title": "Something happened to my dad while he was sleeping last night",
        "author": "mgsv5312",
        "url": "https://www.reddit.com/r/Paranormal/comments/10hehix/something_happened_to_my_dad_while_he_was/",
        "text": "My dad informs me over dinner tonight that while he was sleeping last night his hand was over the bed hanging off and he felt something hit his hand and when whatever hit his hand during the same moments he heard something hit the floor to which he turned on his light and saw that nothing was on his floor now my dad does not believe in the paranormal but what do you think could have happened",
        "created_utc": 1674262457,
        "upvote_ratio": 1.0
    },
    {
        "title": "Strange Creature (?) in Abandoned Cemetery",
        "author": "Clapback_tampon_666",
        "url": "https://www.reddit.com/r/Paranormal/comments/10hedn0/strange_creature_in_abandoned_cemetery/",
        "text": "Hey Reddit, I’ve always been one for scary stories but last night (technically this morning) I had one of the scariest experiences of my life. Im not sold that it’s paranormal, I would just like some extra options.  \nSo as a little background and explanation, my girlfriend and I had our first date at an abandoned cemetery, and since then we’ve been exploring forgotten resting sites around us. Usually this goes the way you expect, nerves get to us and before you know it we’re giggling about ghosts in a pitch black cemetery, but this time was different. I think I’d be more open to chalking this up to nerves if we hadn’t spent the last while exploring and walking through admittedly much scarier places. \nAround 1am my girlfriend and I decided we were bored, she wanted gas station nachos and I wanted a slushie and since we were already going to be out we decided fuck it and looked into cemeteries nearby. My girlfriend finally settled on an old catholic burial ground where her family has a few plots. It was only 15 minutes away and seemed like a great idea. \nTo get to the cemetery we had to take the expressway to an old state route that went through the woods. We were joking around and talking about how you shouldn’t look in the woods, along with just general amazement at the natural beauty as we passed waterfalls and these really beautiful rock formations. \nEventually we got to the gates, a small turnoff on the right side of the road (which we missed the first time). This is where the weird stuff happens. \nSo turning into the cemetery and passing through the gates my girlfriend and I immediately felt sick, she described it as feeling like she was poisoned. The cemetery is small as hell with one road that stretches from the front gates down about 300 feet before hitting a small loop. We drove down and around the loop, questioning if we should stay and try to find her family’s graves or if we should just go. I’m stupid and curious so I told her she can stay in the car and I’ll go find the graves. She reluctantly agreed and sat in the car, scanning our surroundings. \nI’ll try to make a [diagram](https://ibb.co/S5QK3cM) of what the [area we were in](https://ibb.co/KXVPY70) looked like, but imagine a small cemetery with maybe 25 feet of graves either direction (we were at the end of the rows of graves). To the left about 30 feet is the gate and road home and to the right about 15-20 feet is pitch black woods. I get out of the car and walk a few feet before almost stepping on my girlfriend’s great grandfather’s headstone, with this discovery I walked back to the car to tell her I found the graves, and that I was going to look for her sister’s grave. She agreed and continued watching me from the car as I walked to the left for a little bit, scanning the ground for the headstone. I was wearing a pair of boots, and the ground was damp so I could kind of hear my footsteps, if that makes any sense. I’d put my foot down and not even a second after I’d hear this clicking/tapping sound, almost like hitting your fingernail off something metal, but also no where close to that. I walked back to the car when I realized the grave wouldn’t be in that area, just to update her and told her to leave the car unlocked. \nI felt this intense compulsion to walk deeper into the cemetery, towards the woods. As I was walking away from the car I kept seeing this shadowy cat-like figure. Like it literally just looked like a house cat in the middle of the cemetery. I love cats, and so on top of the weird compulsion to get closer to the woods.\nI also figured I could make a feline friend out of it. I got maybe 20 feet away from the car before the clicking noise would get both faster and closer. I decided to shine my flashlight towards the woods on my left, just in case it was a wild animal, but instead all I saw was\npure darkness in the middle of my flashlight beam. I backed up two paces slowly before the black mass “moved.” It moved like someone put its joints together wrong. I bolted, running faster than my girlfriend ever thought I could run. She took off before I had even closed my door, while I cried in fear trying and failing to get my seatbelt on. My stomach felt like it was\nstuck to the inside of my skin. \nOn the way home my girlfriend told me her side of the story, how she was scanning the landscape from left to right, and every time she had to look into the woods she felt like there was going to be something there. \nWe’ve been trying to rationalize it, maybe it was just a wild animal but I’m a pretty experienced hiker and know our local wildlife well- that thing didn’t look like any animal I’ve ever seen or heard. Maybe it was just my brain playing tricks, trying to find something that isn’t there, but my girlfriend thinking there’s something in the woods is kind of making me reconsider. The thing with the cat is weird as well, I know feral cats are tanks but how one could survive the Pennsylvania winter in the middle of the woods (where it could be easy prey) only to end up in a cemetery with next to no resources (I.e shelter, water, noticeable food) is strange. I’m incredibly curious about what it could have been.",
        "created_utc": 1674262154,
        "upvote_ratio": 1.0
    },
    {
        "title": "(From experience) why do most ghost girls most of the time wear white vintage dresses",
        "author": "Alternative_Eye_2799",
        "url": "https://www.reddit.com/r/Paranormal/comments/10hd7m3/from_experience_why_do_most_ghost_girls_most_of/",
        "text": "I finally experienced my first “ghost” encounter I have two cameras set up in the front and backyard in the morning I checked on them and it was a girl or woman Transparent… I seen the houses across the street through her and she looked blurry in a way and white vintage dress and long hair\n\nAnd for the male “ghosts” they always have some vintage attire why is this common like in movies, tv shows, cartoons, “real ghost encounters” etc why do they all have the same vintage attire on?",
        "created_utc": 1674258973,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can anyone explain this?",
        "author": "mounezuma",
        "url": "https://www.reddit.com/r/Paranormal/comments/10hbmb1/can_anyone_explain_this/",
        "text": "Me,(M15) and my 4 friends, (also 15M, I'll name them H, M, E and L  for this story) were up a hill near the village we live in. We had recently stumbled upon a forest while up the hill several weeks before this story and discovered a bunch of weird stuff in there. Apart from some creepy noises and a run-down shack with some animal skulls in (not the best sign), everything seemed kind of normal. H, M and E had already entered the forest before me and L, and decided it would be a good idea to hide in a ditch at 1 in the morning to try to and scare us by playing creepy music on the internet and waving a flashlight around, but it kind of backed fired as H and M ran out of the trees towards us.  They said that they had seen \"a tall man in the bushes crying while we were hiding\". Basically, me and L didn't believe them, so we thought to go and investigate. After walking for a while, we heard a kind of  \"scraping metal\" sound in the undergrowth. We were already on edge, so seeing a silhouette of a  huge \"thing?\" running over the path in front of us, screaming (at about 2 in the morning)  sent us bolting out the forest, and to this day we haven't returned. However, we are going back tomorrow with a bit more preparation. We will keep you updated",
        "created_utc": 1674255498,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can anyone explain this?",
        "author": "mounezuma",
        "url": "https://www.reddit.com/r/Paranormal/comments/10hbjik/can_anyone_explain_this/",
        "text": "[removed]",
        "created_utc": 1674255332,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can anyone explain this?",
        "author": "mounezuma",
        "url": "https://www.reddit.com/r/Paranormal/comments/10hbhaq/can_anyone_explain_this/",
        "text": "[removed]",
        "created_utc": 1674255201,
        "upvote_ratio": 1.0
    },
    {
        "title": "Possibly being watched over",
        "author": "Ordinary_Ad754",
        "url": "https://www.reddit.com/r/Paranormal/comments/10hbbsf/possibly_being_watched_over/",
        "text": "Does anybody ever get the feeling that they are being watched over by a family member or friend who has passed? \nMy house is by no means haunted and we never get any paranormal activity. But everyone in the household often gets the feeling that my Nan (mums mother) likes to come for a visit every now and then.",
        "created_utc": 1674254886,
        "upvote_ratio": 1.0
    },
    {
        "title": "I think i used to live in a haunted house",
        "author": "Mischievousdagger",
        "url": "https://www.reddit.com/r/Paranormal/comments/10h7vov/i_think_i_used_to_live_in_a_haunted_house/",
        "text": "Growing up, I always had to move from one place to another. There was this apartment in particular that terrified me. \n\nI was about 7 or 8 when weird stuff started happening. Basically, things would go missing, thing getting moved, hearing footsteps in the hallways. Once my dad heard someone small running. He thought it was my sister and called her but no one answered. When he came to check on me and my sister, he found us both fast asleep. (We always shared a room). One time my mum baked a cake at night, I don't know why she decided to bake it at night but she did. At night we heard muffled chewing sounds. It wasn't my parents as they had gone to sleep hours before that. Their room was in front of mine and I would've seen them coming out. The next day, we found half of the cake gone.\n\nAnother time my dad bought a GPS. He was very happy with it and put it on the table. The next day it was gone. Me and my sister didn't touch it because my dad was very strict and we used to be scared of what would happen if we touched it. My mum was home all day but she's a busy woman and couldn't care less about a GPS. It was gone for a week. Then one day my dad called my mum asking her where she found the GPS. It was right where he left it.\n\nThis freaks me out the most. I had a saint (a paper with a saint on it. We call it a saint here) No matter how many times I got rid of the saint, it always comes back. I ripped it apart so many times, I shredded it and it always returns to my desk. I no longer live in that house but every time I walk by it, I get this feeling of dread. \n\nI'm sorry that its very long",
        "created_utc": 1674248104,
        "upvote_ratio": 1.0
    },
    {
        "title": "The ticking every night",
        "author": "CupcakeIntelligent28",
        "url": "https://www.reddit.com/r/Paranormal/comments/10h7p0i/the_ticking_every_night/",
        "text": "A few nights a ago I startes hearing a ricking noise as if someone/a jinn was ticking his nail on my closet.\nEvery night since that night,the ticking starts when everyone goes to sleep.\nYou might say that its just random or its my neighbors but the wierd thing is each time I look in the direction the sound is coming from and when I pray(specially ayatul kursi),the ticking stops\nWhat should i do? To make him go away for ever",
        "created_utc": 1674247620,
        "upvote_ratio": 1.0
    },
    {
        "title": "An entity maybe a demon paralyzed me then lifted off my blankets and howled",
        "author": "phoenixinthemist",
        "url": "https://www.reddit.com/r/Paranormal/comments/10h7o2w/an_entity_maybe_a_demon_paralyzed_me_then_lifted/",
        "text": "I awoke at 3:15 AM this morning to a feeling of pure terror. I had not had a nightmare. I simply felt terrified. I started to have intrusive thoughts, blasphemies against God, that kind of thing. I fought them off as hard as I could, rebuking them in Jesus' name, and all this time I could not keep myself still, I was tossing and turning. Those went away, and I settled down again, but was still very scared and could not seem to get the feeling to go away. There was no rational reason for it and it began to bother me. I laid there for about 30 minutes thinking about whether I would be able to get up and go to my Cafe job because of how sick with fear I felt, and I began to think of how ridiculous it would be to say \"I can't come in because I'm having an anxiety attack.\" and I just couldn't come up with anything. And then all of the sudden I felt a shift in the atmosphere of my bedroom. Although I could not see anything change, it felt like a dark constricting cloud started forming all around me, especially above me where I was laying on my left side. I started to get pissed because felt like there was an intrusive presence, like a demon, so I whispered loudly, \"Get the hell away from me you evil spirit from hell!\" \n\nThen, suddenly, I felt my entire body become paralyzed, in a wave. From my head down to my feet, I felt this wave of pressure tighten all around me and vibrate slightly and I was unable to move. And I kid you not, my blankets started to peel back from my body by themselves! I was really shocked but I was still able to speak so I did the only thing I could and I said \"Jesus Son of God!\" and I tried to say it again but I only got as far as the G in God and I felt the paralysis grip my mouth and freeze my tongue in place! I was like freaking out by this point because I didn't know what was going to happen next. But all of the sudden I heard this absolutely blood chilling howl come from around my stomach and groin area, that sounded like metallic and distorted as if there were two or three voices in one but really dissonant, and then there was this woosh of \"wind\" but it wasn't wind, and suddenly everything was quiet and I became unparalyzed and sat up in the dark.\n\nI've been thinking about it all day. Do you guys think it was a demon? An alien? Some foul creature? I don't know what made it go away but I feel like Jesus, from calling out to Him and saying His name that this thing somehow was either expelled from me or destroyed which is why it howled like that.\n\nThoughts?",
        "created_utc": 1674247549,
        "upvote_ratio": 1.0
    },
    {
        "title": "I heard my own voice on a spiritbox",
        "author": "shavasana365",
        "url": "https://www.reddit.com/r/Paranormal/comments/10h6iig/i_heard_my_own_voice_on_a_spiritbox/",
        "text": "Hi new here and don't post much on here. Today as I was getting ready I decided to try this spiritbox app. I know not to take these apps or anything for real, but I was bored as I was flat ironing my hair and thought screw it I'm going to play around with this. Well I started up the app and random voices started coming through....some in English some in other languages. In the middle of the \"session\" my own voicecame through and said \"your going to die\". I was shocked at hearing this...like these apps on phones are just for fun right? The app is necrophonics....I let it run longer and never heard my voice again. My question is has this happened to anyone else? Does the app record your voice?",
        "created_utc": 1674244601,
        "upvote_ratio": 1.0
    },
    {
        "title": "oujia: why would s demon help me?",
        "author": "sleekapple25",
        "url": "https://www.reddit.com/r/Paranormal/comments/10h6h6b/oujia_why_would_s_demon_help_me/",
        "text": "After using a oujia board for some time truly believing i was speaking with my ancestor/spirit guide/guardian angel,   I caught it in a lie, it got defensive. I suspect it to really be a demon.  The problem is, it has been very helpful to me. Sometimes I need help interpreting my crystal ball visions and i could always ask it and it would give me the aha answers.  This spirit/entity hasn't done anything malicious (just lied) and my house has not become haunted. I take precautions and sage/cleanse/salt cast circle of protection.   Why does it help me?",
        "created_utc": 1674244509,
        "upvote_ratio": 1.0
    },
    {
        "title": "Essential oils and the paranormal",
        "author": "CourtCreepy6785",
        "url": "https://www.reddit.com/r/Paranormal/comments/10h5yl2/essential_oils_and_the_paranormal/",
        "text": "TL;DR.  I applied essential oils as a sleep aid and had a terrible reaction including a vivid “demonic” nightmare and extreme anxiety. I’m curious about how the oils might have triggered it.  \n\nThe backstory: Several years ago, I needed help sleeping. I found a recipe online for blending essential oils as a sleep aid. The only oil I recall in the mix was Vervain. I applied a little of the mix behind my neck and shoulders and went to bed.  \n\nThe dream that night:  I was an unseen observer in a spacious, opulent living room. Seated in the living room was large family—maybe 8 or 10 people. They were parents, siblings and grandparents. All were very good looking and very well-dressed. They were seated in silence.  \n\nI became aware that each person in the room hated all the others with a deep, “inhuman” hatred. And each person was actively plotting the murder of all the others. \n\nI was instantly horror-struck with their terrible hatred and treachery. At that moment, a huge black figure arose from the back of the room. It unfolded black wings, rose to the ceiling, began glide silently over this family and in my direction. I woke up in a state of terror.  \n\nThe aftermath: The oil I had applied the night before smelled cloying and awful and I raced to the shower to wash it off. I couldn’t shake my anxiety. I went outside and walked around for 2 hours.  I was feeling so terrible, I thought I was having a nervous breakdown. I decided that, if I wasn’t better by afternoon, I was going to the emergency room at a local psych hospital and asking for help. \n\nBut, I did recover.  I washed all my sheets and pajamas and dumped the rest of the oil mixture down the toilet.  \n\nDisclaimer: I’m not mentally ill. I rarely have nightmares. I’m an open-minded skeptic about the supernatural, but this dream was FREAKY like nothing I have ever experienced before or since.  \n\nSo, for people who believe in spiritual entities: can the use of essential oils trigger supernatural encounters? People once believed that witches applied magical ointments in order to fly on broomsticks. Perhaps they were really “flying” someplace but not literally? And, vervain has a sort of witchy reputation...  \n\nI’ve never heard anybody advise caution when using essential oils, have you?",
        "created_utc": 1674243207,
        "upvote_ratio": 1.0
    },
    {
        "title": "Have you ever had an encounter with a ghost or other supernatural being?",
        "author": "tahadigital",
        "url": "https://www.reddit.com/r/Paranormal/comments/10h5wqz/have_you_ever_had_an_encounter_with_a_ghost_or/",
        "text": "[removed]",
        "created_utc": 1674243087,
        "upvote_ratio": 1.0
    },
    {
        "title": "RS haunted church",
        "author": "cloocherhoochie",
        "url": "https://www.reddit.com/r/Paranormal/comments/10h5ch1/rs_haunted_church/",
        "text": "I think this took place in 2020 when everyone got laid off due to Covid, so my friends and I decided to stay together as I didn’t have any family where I was living and staying cooped up alone for 2 months didn’t seem like a great idea (mental health y’all, ADHD and anxiety are not a good mix in solitude). We had already previously worked together so I just quarantined at their house with them. \n\nAfter the two weeks and everything being closed, we got really bored and decided to explore the bush where we knew we wouldn’t see people. We ended up going to a lot of really cool abandoned towns, fire houses, etc. My friends live on a reservation so they had access to a lot of the land that not just anyone could rock up on to, and one day we decided to go to this church that was abandoned located right off the highway on the edge of the reserve. \n\nI had seen this place whilst driving along the highway multiple times and always wondered what the back story was as it was a very dilapidated building and now after knowing what I know after the event, I don’t know why they didn’t tear it down. So we pulled into the parking lot, which was basically just a dirt lot that lead further into the rez and parked. Initially I took a mental note of how much creepier it looked up close, just dark and foreboding. My friends husband didn’t seem bothered at all so I thought it might just be nerves to finally be able to check it out.\n\nWhen we first entered there was a two door entrance, so you enter the first door from the outside and you come into this little square room with a ladder going up to the attic, and then there is a second door leading into the church itself. No amount of money could have gotten me up into that attic, it was pitch black and rickety and the vibe just was not there. We closed the outside door and as soon as we entered the second door, the room fell stale and lifeless. The air was very stale and still, it almost felt like we had stepped into a sensory deprivation room, it just felt off. \n\nWe walked passed the pews towards where the podium was located on this small little stage that overlooked the room, there was a rickety staircase that lead up to the second floor of pews, I went up and checked it out but nothing out of the ordinary was to be found. It was pretty cool nonetheless. We continued towards this small back room behind the stage and this is where shit gets freaky. So there is 5 of us in this church. My friend, her husband and her two kids as well as myself. We were a few steps away from this room entrance when this sickly cold feeling washed over me, it was so intense and sudden I verbally said “it just got really cold in here” and right when I finished that last word, the second entrance door into the church itself that we had left open slammed shut so loud. We all went silent and just looked at each other and my friend actually questioned if we were meant to be in here.\n\nThis is where the history lesson comes in that I did not know previous to entering the building. This was at some point a residential school, and it’s realistically not very far from where all those bodies of indigenous children were found buried in British Columbia. I had no idea it was a residential school at any point, I’m not sure I would have entered had I known previously and I will never go back due to what happened later that night. So my friends husband gave us a historical rundown of the place and we decided to leave shortly after and again, the vibe just wasn’t there.\n\nThat night I ended up going back home to my own house. I felt kind of off and fell asleep quicker than normal. Middle of the night, I think it was roughly 2am and I sat up in bed out of a dead ass sleep. I opened my eyes and suddenly I let out this breath as if I was underwater for awhile, it was a long winded breath and I have never done this before, it’s almost as if I was throwing up air. In the brief seconds after exhaling all that crossed my mind was the church and an entity. It’s hard to explain because I don’t even know what happened, but my thoughts were cued into the church and an entity. A literal second after this, I dropped down on my back and was asleep until I woke up the next morning. I remembered the nights events vividly as if I hadn’t been sleeping the whole time but I was. \n\nI think that church had a very dark history and going in unprotected and ignorant to its past made me very vulnerable to whatever entities were stuck inside and one latched on to me. I’ve had many many paranormal experiences in my life and I am sensitive to whatever is on the other side but this was the first and only event something like this happened, sometimes I feel like there is a force watching over me and that’s what ejected this entity out/away from me. I’ve had many moments in my life where I was very close to death and miraculously I didn’t get hurt and I really believe someone is watching over me and has my back because the way this thing got expelled out of me felt so surreal and even now I struggle to explain it clearly enough.\n\nI never went back and never plan to, even when other friends mention they want to check it out, I want no part of it. I do have video footage of when the door slammed in the church, the faces of my friends will have to be edited out, so if anyone is interested in seeing that, I will gladly find a way to blur them and send the link over. The video clearly shows none of us are near the entrance door when it slams shut directly after I mention how cold it’s gotten.\n\nTl;dr: Friends and I go to abandoned church not knowing the dark history beforehand. Door slams shut, entity follows me home and somehow gets expelled out of my body in the middle of the night.",
        "created_utc": 1674241724,
        "upvote_ratio": 1.0
    },
    {
        "title": "Ghost ID please",
        "author": "meatheadbran",
        "url": "https://www.reddit.com/r/Paranormal/comments/10h53b8/ghost_id_please/",
        "text": "Has anybody seen or read about an apparition with a white dress with blue flower accents near the bottom opening of the dress with a white sun gate and white parasol",
        "created_utc": 1674241143,
        "upvote_ratio": 1.0
    },
    {
        "title": "I saw the girl I dream of when I was 5",
        "author": "EleveeNotFound",
        "url": "https://www.reddit.com/r/Paranormal/comments/10h4gsf/i_saw_the_girl_i_dream_of_when_i_was_5/",
        "text": "When I was around 5 or 6 years old I dreamed about being in a white office with no people, except one girl with brown curly hair, headphones with star stickers and green pants. I don’t remember the dream at all, but it was kinda weird.\n\nWeeks later, one day, a community of my town which I belonged with my parents, decided to go with all the community to a private hostal at the mountain for some days. \n\nThe first day, minutes later when we arrived I wanted to go to the swimming pool that belonged to the hostal. I walked some minutes and when I arrived I couldn’t find the pool. Suddenly, I heard a voice of a young girl. “What are you looking for?” I turned to see who was talking and saw the same girl that I dreamed weeks before. Same hair, same face, same clothes, same headphones, even the voice was the same. I  knew EVERYONE in that community, and I never saw this girl. \n\nI said to the girl that I was looking for the pool and she said that I wouldn’t find the pool because to enter the pool I had to enter by another side. Then I just walk to return to the hostal. \n\nThat was the first time that I saw that girl and the last one. Never saw her again and I still thinking about that.",
        "created_utc": 1674239653,
        "upvote_ratio": 1.0
    },
    {
        "title": "Mimic tries to lure parents",
        "author": "whatcanisaytoday",
        "url": "https://www.reddit.com/r/Paranormal/comments/10h2w2n/mimic_tries_to_lure_parents/",
        "text": "Sorry this is a long one:\n\nTLDR: someone or something mimicked mine and my brother’s voice, sounding panicked and scared. \n\n\nAbout 10 or so years ago, when I was a teen and still living with my parents, a very strange, creepy thing happened. In this particular house we had all sorts of strange going’s on. Too much to include now, but I found this particular incident really unsettling. \n\nIt was very late at night, maybe early morning hours, very dark outside. The whole house was asleep (I have four siblings). My brother’s room was across the hall from my parents room and my sister’s and I slept in the basement. \n\nMy parents awoke suddenly to the sound of my youngest brother’s voice (5 years old at the time) screaming out to my dad. Just yelling “DAD! DAD! DAD!” Over and over again in a loud, terrified voice. My dad jumps out of bed and rushes to my brother’s room. It takes him all of 3 seconds to get to my brothers room to see what could have my brother yelling out like that. \n\nWhen he opened the door, the yelling suddenly stopped. He saw both my little brothers fast asleep. He gently whispered to the brother who’s voice he had heard, and tapped him to see if he was having a bad dream. But got no response. \n\nMy dad thought that was kind of weird, but just chalked it up to some kind of nightmare/dream response. He walked back to his room. No sooner did he get back in bed (literally the moment he sat down on the mattress), they then heard MY voice this time screaming out to my mum, “MUM! MUM! MUM! MUM!” \nThey said I sounded terrified, just like how my brother sounded, and like I needed help, and that it was exactly my voice, just like it was exactly my brother’s voice. \n\nBut this time the sound was coming from outside their open bedroom window, where the back yard and the back alley is. \nMy mum and dad looked at each other perplexed. My mum jumped out of bed this time and decided to come check on me in the basement, even though the voice was coming from outside. She makes her way down - and I remember this part - she woke me up in my room and asked me if I was calling out to her. I was groggy and tired and thought she was being weird and of course said no. I fell right back to sleep. \n\nAs she’s making her way back up the stairs she hears my voice again, the same terrified voice, screaming out to her, but from the front of the house this time. She stood by the big front window in the living room and looked out onto the street. There was no one out there, not even a car driving by, it was totally still. The screaming suddenly stopped. \n\nAt that point she knew it was something sinister. She went back to bed and her and my dad talked for a bit and prayed and then went to sleep. They didn’t hear the voices again that night. \n\nThe next day she told us what happened and obviously we were quite terrified. She said it was uncanny the likeness to mine and my brother’s voices. \nI even did an impression of what the voice could have sounded like and my mum said yes. It was the exact same tone, sound.. everything.\n\nSo any theories as to why this happens? Why these mimic beings take an interest in people? My gut says it’s just to mess with us and scare us, but I’m curious what others think. \n\nTLDR: Parents hear mimic of my voice screaming, while I slept.",
        "created_utc": 1674235953,
        "upvote_ratio": 1.0
    },
    {
        "title": "What happened to me last night",
        "author": "23anna23",
        "url": "https://www.reddit.com/r/Paranormal/comments/10h20j8/what_happened_to_me_last_night/",
        "text": "I got up to go to the toilet in the middle of the night and walked past my mums bedroom. The door was ajar, and when I looked into the room there was a woman stood by the door looking at me. I couldn’t see clearly what she was wearing or facial features but I’ve had a couple of experiences of seeing a woman in that bedroom and I felt it was the same presence. Last night she had a white glow all around her body and when I looked at her she shut the door. I thought it might have been my mum however I asked this morning and she said it wasn’t her. Can anyone explain or know what this presence is and why she keeps coming to me?",
        "created_utc": 1674233955,
        "upvote_ratio": 1.0
    },
    {
        "title": "there is something wrong",
        "author": "Axinel2011",
        "url": "https://www.reddit.com/r/Paranormal/comments/10h1q8z/there_is_something_wrong/",
        "text": "[removed]",
        "created_utc": 1674233267,
        "upvote_ratio": 1.0
    },
    {
        "title": "The ghost girl…",
        "author": "Adorable_Round6096",
        "url": "https://www.reddit.com/r/Paranormal/comments/10h018l/the_ghost_girl/",
        "text": "So when I was 2 my mum was putting her makeup on and heard whispers she said “very funny rob.” (The name of my dad) but he was on the other side of the flat then the next day I went upstairs to play for 2 hours and my mum said “what did you do?” Which I responded with “I was playing with a girl she has yellow hair and a pink costume (saying costume I probably meant dress) and sometimes her dad comes to pick her up he wears a yellow raincoat and welly’s.” My mum and I to this day think it was a ghost, This story is very real stay safe.",
        "created_utc": 1674229183,
        "upvote_ratio": 1.0
    },
    {
        "title": "GUYS, COULD THIS BE TRUE?",
        "author": "KintijaDee",
        "url": "https://www.reddit.com/r/Paranormal/comments/10gyvgj/guys_could_this_be_true/",
        "text": "[removed]",
        "created_utc": 1674226312,
        "upvote_ratio": 1.0
    },
    {
        "title": "am I experiencing a spirit",
        "author": "Still_Ad_7226",
        "url": "https://www.reddit.com/r/Paranormal/comments/10gys0d/am_i_experiencing_a_spirit/",
        "text": "I've experienced a few things that I believe r ghosts and I'm just realized that it only happened where I'm living rn\n\n1. Something was behind me\n Lemme explain the layout of my house.\nU have the living area and then a doorway to the bedrooms.\nI was walking to go to the living area when I I felt something staring at me (like literally staring holes into my head) but yk I thought it was my brother, them i dropped something and bent down to pick it up and if I can remember correctly I moved out the way bc I thought my brother was trying to squeeze past me (I felt something touch me) then I looked behind me and no one was there.\n\n2. She knew my name \n I was in the lounge on the couch, my mom was folding washing in the kitchen, my dad and sister were working at the dining table, and my two brothers were in their rooms. I heard a female whisper my name \"hannah\" right by my ear, then i turned to ask my mom what she needed, she said she didn't call me and then I told her what I heard, then my dad, sister and mother all said they heard the same thing whisper my name. (My brothers were in the room like I mentioned so we wouldn't hear them whisper and it was a female voice.)\n\n3. The man at the door\nMy brother was playing on his pc (with headphones so we couldn't hear and he couldn't hear anything) then we heard a man by the front door say something In audible. We thought someone was coming to talk to us but hesitated bc we were scared. My cats were looking at the door all scared and then ran away quickly. Thing is when we went to look no one was their. The upstairs door was closed so we would've heard them close or open it, and we would've heard them go downstairs, also they would've called us a second time if they needed something.\n\n4. It's touching me\nThis one isn't rlly a set experience but I keep on feeling something touching my right shoulder, and It can't be my hair bc it doesn't go to my shoulder. (This only started happening after we heard the male voice) and I wouldn't have questioned it if it happened once or twice but it's happened atleast more than five times.\n\nAnyway I just think this is strange and the two last ones only started happening after I asked any spirits to reveal themselves if they would like. I made a post before and ppl agree that the voices were probably a ghost but I just want to write this all down since I only realized it now but this has never happened before.",
        "created_utc": 1674226074,
        "upvote_ratio": 1.0
    },
    {
        "title": "light in my closet turned on when i KNOW it was off",
        "author": "addybear222",
        "url": "https://www.reddit.com/r/Paranormal/comments/10gx7kd/light_in_my_closet_turned_on_when_i_know_it_was/",
        "text": "one, i apologize if this is the wrong subreddit! it was the best i could find to share my experience. two, i'm sorry it's so long. i guess i've always been somewhat of a storyteller.\n\n\nthis happened to me about 3 hours ago, i've just now worked up the courage to turn my room light off and take my eyes off the closet. now i'm refusing to look over there and i still have my tv on so it's not completely dark and scary in here.\n\n\nsometime around 2-3 am i decided it was time to go to sleep, so i grab my cat and make my way up to my room. i set him and my bed, walk over to my walk in closet, and turn the light off (i don't know if this is important but for some reason out of all the lights in my house, this one is one of the pull chain fixture ones). i look over and see that my cat's food and water bowls are empty, so i grab those and go downstairs to refill them.\n\n\nat this point everyone else in my house has gone to bed and the main floor is empty, so i know that no one has gone upstairs, specifically into my room. the only people up there are my parents and they are both fast asleep. i make my way back upstairs, walk into my room, and i immediately notice that the closet light is ON. i didn't think anything of it for a moment until i placed my cat's bowls down and then go \"why the f is this light on?\".\n\n\nso i ofc proceed to turn the light off and i stand there for a minute wondering if maybe i thought i turned it off but actually didn't. but no, i know for a fact that i turned it off! i remember looking right outside of my closet at my cat's bowl stand and it being dark in that area because *the closet light was off.* at this point i start to freak out a little bit and go over to my bed. i'm panicking, like i always do, and that's leading me to feeling terrified. \n\n\nso what do i do? google it. what do i come across? the freaking glitch in the matrix subreddit. like that's gonna help me feel any less afraid. but like the smart woman i am, i go on to read dozens of stories and freak myself out even more.\n\n\ni decide for some reason that if there is a spirit in my bedroom, that i should try to reason with it. i said something like \"if there is someone here, i don't mind you being here. unless you're the one making all my clothes disappear. then that's rude of you. otherwise, we're cool. just give me some sort of sign so i don't have to freak out again.\" nice but straightforward, right?\n\n\nthen i proceed to text my best friend knowing damn well that if he is even awake at this hour he's not gonna respond well to me just absolutely freaking out. he tries to reason with me saying it was probably just bug (my cat) because cats love string but...anytime i leave the room and bug is in there with the door shut, he waits by the door for me. and i would never underestimate how high a cat can jump, but there's no way he reached the string AND was able to pull it hard enough to turn the light on.\n\n\nso for the past two, three hours i have sat on my bed freaking out over something i don't even know, reading freaky stories that are only fueling my fear, and looking across the room at my closet every two minutes to make sure that nothing is in there. everyone else in the house is sleeping so i can't even ask any of them to do anything.\n\n\ni know that a simple answer would be faulty wiring or some other electrical problem but i have never had issues with the light, or any light in my house, until now. that might not count for much but to me it says a lot. another answer would be that i didn't actually turn the light off, or that i didn't turn it off fully. but i know, for an actual fact, that i turned that light off. like i will swear up and down that i turned that light off. and with the fixture i have in my closet, the ones with the strings that you pull, the light is either on or off. there is no in between.\n\n\nif you have any other input or explanations, i would love to hear it. right now all i can think is maybe it's some playful ghost that's trying to have fun, and must be succeeding because i'm definitely scared outta my mind.\n\n\nthe only thing giving me solace is the fact that my cat isn't freaking out. i've always figured our cats good indicators of when something is wrong. so that bug isn't having any sort of reaction, that's making me feel a little better. i'm now gonna attempt to go to sleep and hope nothing else happens.",
        "created_utc": 1674221979,
        "upvote_ratio": 1.0
    },
    {
        "title": "I saw something in the woods of the Black Hills SD",
        "author": "Kinsu1",
        "url": "https://www.reddit.com/r/Paranormal/comments/10gv9ol/i_saw_something_in_the_woods_of_the_black_hills_sd/",
        "text": "Hi everyone first time posting and on mobile so sorry if the formatting is subpar.\n\nI recently joined r/Paranormal. After reading some of your experiences, I wanted to share my own to see if I could get your opinions on what me and my family saw in the Black Hills of South Dakota. \n\nAbout 5 years ago when I was 17 I visited some of my family who lived in SD and worked there for the summer. After about a month my brother, sister, and her husband decided to do what Americans do best and go shoot guns in the woods. I had to work a evening shift so it was decided we’d go after, around 10pm. Once my shift ended we went to their house to pack up the truck with some snacks, guns, and ammo.\n\nThe drive took around 45 minutes and it took us up a dirt road surrounded by trees and tall grass. Eventually it opened up into a clearing that was pretty open and flat. The nearest tree line was about 100ft away. It was pretty dark but the clearing was lit up by the trucks headlights. I kinda felt uneasy, but I chalked that up to just being in the woods at night. For the first 20 minutes nothing really happened, we were just setting up plastic bottles and those plastic gallon buckets you’d get water out of at an office. There was a feeling of being watched that we all felt. The area suddenly reeked of spoiled eggs. Those of you who have shot guns know they can smell but, even since going the military no amount of guns/explosions have smelt this bad. We looked around to see if we could see the source and what I saw I can still vividly remember to this day. What I saw was a thin humanoid figure crouching down looking at us. Even while crouching down it was still about 6ft in height. When I say this figure was thin, I mean skin and bones barley do it justice. The even weirder thing about this was we all saw the figure in different spots in the tree line, but we all described the same features. Tall, thin, had long dark hair. We quickly packed up what we could and left. The feeling of dreading felt that day will forever haunt me. Since then my brother mentioned the area might have been in native territory, but I don’t know how if that’s true.\n\nEvery once a awhile I think back on that day and I look up different stories and encounters people have in woods, but nothing quite resembles what I saw that day.",
        "created_utc": 1674216269,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to make someone forget you? How to take their memories of you away like it never happened?",
        "author": "Sensitive_Location20",
        "url": "https://www.reddit.com/r/Paranormal/comments/10gt3pg/how_to_make_someone_forget_you_how_to_take_their/",
        "text": "[removed]",
        "created_utc": 1674208848,
        "upvote_ratio": 1.0
    },
    {
        "title": "Skinwalker in back yard?",
        "author": "silkthechakra",
        "url": "https://www.reddit.com/r/Paranormal/comments/10gspt9/skinwalker_in_back_yard/",
        "text": "I bought this house a little over a year ago.   Overall it’s pretty dull in regards to activity ( which I’m happy about), however, I have my own personal little issues.  It’s either mental illness or maybe some kind of mind trick.. or whatever— basically sometimes I see things in my minds eye when I’m not asleep.  I’m laying down with eyes closed but I know I’m awake and I will see faces or things.  Sometimes they look back and I fucking hate that, especially when they look creepy or try to jump at me.\n\nAnyway, one night I saw an image of a very tall woman.  Like taller than a house and dying skeletal skinny.. decaying flesh falling from some places where there was exposed bones.  Field is a source of many weird dreams for me by the way.  Anyway this woman seemed to just quietly pace the field behind the house. \n\nThere is a horse back there and he goes in his barn at night and there are cows in the distance.  I have neighbors but nobody that would be out in the field late at night.  ( they are all very ancient) Tonight is a night one of many instances where I heard a woman’s voice coming from the back yard and then maybe weird cow noises?  Idk it’s weird and creeped me out but I was too scared to close the dog door so hopefully it doesn’t come in 😅😭. My dog keeps peeing in the house lately too and it’s weird bc she only usually pulls that bs if it’s raining.  I’m wondering if she’s afraid to go out.  The nights I have heard the woman’s voice she’s barking she def heard it too.  Seems to be happening more lately.  \n\nAnyway, am I tripping or could it be paranormal?",
        "created_utc": 1674207383,
        "upvote_ratio": 1.0
    },
    {
        "title": "Weird incident with laptop and phone",
        "author": "Waste-Atmosphere6200",
        "url": "https://www.reddit.com/r/Paranormal/comments/10gqtn1/weird_incident_with_laptop_and_phone/",
        "text": "So this one time I was at my workplace (I work in various locations all over U.K. usually very old grand homes with history), I was sat in the staff lounge on a chair reading a book when my colleague came in asking for help. It was late evening and we were the only two members of staff in the building. She had an issue with her laptop saying it isn’t working, my colleague is in her late 50’s and wasn’t very tech savvy so I figured it would be a simple fix.\n\nEverything on her screen was frozen in a unresponsive glitch but I sorted it out in a couple minutes and on my left side I had a desk and I plugged in her laptop to charge whilst it rebooted. On that same desk I had a wireless iPhone charger which my colleague took interest in and asked if she could charge her phone as she had never used a wireless charger before I said no problem and she placed her phone there.\n\nOn my right side was another chair which she sat in and we were just having a general conversation when suddenly we heard what seemed like the charger being loudly yanked out the laptop port and drop to the floor. We both looked over my shoulder to the left where the desk was the charger did come out. We didn’t think much of it assumed maybe I had put it in at an awkward tangled angle and it moved. We finished our conversation and she sat up thanking me for my help when she looked confused down at her lap. Her phone was right there and we were both completely baffled as she had placed her phone on the wireless charger on the same desk where the laptop was! This freaked us both out as neither one of us had touched the phone or left our seats whilst talking..",
        "created_utc": 1674200277,
        "upvote_ratio": 1.0
    },
    {
        "title": "Somethings in my house",
        "author": "Rest_well_Spike",
        "url": "https://www.reddit.com/r/Paranormal/comments/10gqop9/somethings_in_my_house/",
        "text": "Im from Austria but i live in Norway and i think my house is haunted and i dont know what to do i can sometimes see these glowing orange eyes in or outside my house and yesterday some figure was looking thru the window in my room and i live on the second floor i heard someone say (Du skal dø) it means \\*you will die\\* in Norwegian and im scared this is serious can anyone tell me what i can do ive called a priest but it didnt help it feels like it made it worse it threw a chair at me today and it hit me i am writing this from the hospital because the chair broke two of my rib bones what do i do?",
        "created_utc": 1674199783,
        "upvote_ratio": 1.0
    },
    {
        "title": "Parents claim they heard talking coming from my room at a time I was already asleep",
        "author": "OkIllustrator528",
        "url": "https://www.reddit.com/r/Paranormal/comments/10gn00u/parents_claim_they_heard_talking_coming_from_my/",
        "text": "My parents told me that apparently they heard loud talking coming from my room at 1 am yesterday night… even though I was already asleep by 11. I assured them I was asleep by then but they said my lights were also on… which freaked me out since I always turn them off before going to bed. I don’t sleeptalk and most definitely don’t sleepwalk… \nI know it’s most likely just the both of them trippin but this is really scaring me.",
        "created_utc": 1674187876,
        "upvote_ratio": 1.0
    },
    {
        "title": "voice calling my name",
        "author": "outdoorman97",
        "url": "https://www.reddit.com/r/Paranormal/comments/10glxjc/voice_calling_my_name/",
        "text": "[removed]",
        "created_utc": 1674184754,
        "upvote_ratio": 1.0
    },
    {
        "title": "Contacts through Dreams. 100% Real",
        "author": "Ok-Assumption7644",
        "url": "https://www.reddit.com/r/Paranormal/comments/10gkrm4/contacts_through_dreams_100_real/",
        "text": "[removed]",
        "created_utc": 1674181506,
        "upvote_ratio": 1.0
    },
    {
        "title": "Contacts through Dreams. 100% Real",
        "author": "Ok-Assumption7644",
        "url": "https://www.reddit.com/r/Paranormal/comments/10gkpf1/contacts_through_dreams_100_real/",
        "text": "[removed]",
        "created_utc": 1674181335,
        "upvote_ratio": 1.0
    },
    {
        "title": "Contacts through Dreams. 100% Real",
        "author": "Ok-Assumption7644",
        "url": "https://www.reddit.com/r/Paranormal/comments/10gkmnv/contacts_through_dreams_100_real/",
        "text": "[removed]",
        "created_utc": 1674181133,
        "upvote_ratio": 1.0
    },
    {
        "title": "Unexplained figure",
        "author": "dude_in_the_corne",
        "url": "https://www.reddit.com/r/Paranormal/comments/10gk0yl/unexplained_figure/",
        "text": "[removed]",
        "created_utc": 1674179513,
        "upvote_ratio": 1.0
    },
    {
        "title": "Unexplained video in my urban exploring video",
        "author": "dude_in_the_corne",
        "url": "https://www.reddit.com/r/Paranormal/comments/10gjwe3/unexplained_video_in_my_urban_exploring_video/",
        "text": "[removed]",
        "created_utc": 1674179167,
        "upvote_ratio": 1.0
    },
    {
        "title": "I think I might be able to sense ghosts.",
        "author": "Umbra_Sanguis",
        "url": "https://www.reddit.com/r/Paranormal/comments/10gjqwk/i_think_i_might_be_able_to_sense_ghosts/",
        "text": "So I know how these posts look and sound. I’ve rolled many an eye and hit the back button a few sentences into a wall of text. I am aptly aware of the due skepticism and disbelief. That being said…\n\nYou’re just gonna have to hear me out on this one. It’s not all that flashy or fantastical sounding, it’s not daytime tv drama either. I’m just recently putting this all together myself also.\n\nHauntings aren’t necessarily new to me, my house growing up had a ghost that liked to mimic me and play tricks. Young boy had died on the property years before we arrived there. We assumed it was him. When I grew up the game wasn’t as interesting to him anymore I guess and he mostly went dormant.\n\nI’ve always gotten odd and dreadful feelings as well as a strange mix of emotions when I walk into certain rooms or hallways in various places in life. I’ll feel something or someone watching me, that immediately turns into this feeling of it knows I’m aware of it’s presence and it’s awareness of me. Followed by whatever it is moving closer. Now I’ve noticed, if I stop and kind of keep my attention on it, I can discern where it is in the room, it’s gender and generally old or young.\n\nThe thing is, I’ve only for sure seen a ghost with my eyes once. I never (well almost I guess) see them. I just feel them. No trance nonsense no magic ritual or Ouiji board. I just feel them in a way that I can articulate some of the information I’m well feeling. \n\nLet’s use my current situation as an example and after that there is one more thing I want to get into. At one time, me, my brother, mother, her boyfriend all lived in this house. This is not the house I grew up in, just for clarification. In the den/basement I always felt watched, always got those feelings again. It would come right at me. Got to the point I just stayed out of there and never mentioned it. I knew it was an old woman. \n\nSo I finally mentioned it to my mother. All I asked if the basement made her uncomfortable. She says, “you mean the old woman? Your brother saw her too.”. I never mentioned to her it was a woman, in fact her boyfriend and herself have seen the ghost multiple times. But I have never seen it, I just sense it. Now I haven’t acted on any of this or tried to communicate.\n\nHere’s why, I think there is more to this whole thing. Sometimes when someone is feeling a wave of strong emotions, I will feel what they feel. Even if I’m seemingly indifferent about the cause of those emotions or even completely disconnected from it. I have a tendency to be overcome by what someone else is experiencing.\n\nIve done a really good job of hiding this stuff from others and probably myself, because I don’t really know what it all means. When I was younger I didn’t have room for that in my worldview. I’m older now, I’ve done away with all the noise. I have room for it now\n\nWhat do I do?",
        "created_utc": 1674178743,
        "upvote_ratio": 1.0
    },
    {
        "title": "Sign from a lost loved one or coincidence",
        "author": "idontcare_7",
        "url": "https://www.reddit.com/r/Paranormal/comments/10ghxxj/sign_from_a_lost_loved_one_or_coincidence/",
        "text": "Not sure what community to post in but I thought here would be a good start. A little back story, I (23f) lost my father Allen when I was a child. He passed away on 01/12/05. A big thing we always would do together is play the Xbox. My earliest memories are with him teaching me to play Halo. \n\nI still play video games and own an Xbox. Well today I go to login to my Xbox account and am notified somebody that wasn’t me has signed onto my Xbox account. The freaky part, they signed into it at 3:03am on 01/12/23 (the anniversary of my dads passing) from a location called Allentown (my fathers name). Now I’m not a very spiritual person but this all seems a little too coincidental to me. So what do you guys think. Is this all just a crazy coincidence or maybe a sign?",
        "created_utc": 1674173960,
        "upvote_ratio": 1.0
    },
    {
        "title": "Woman screaming in my face that she'll see my in hell",
        "author": "RioBlue93",
        "url": "https://www.reddit.com/r/Paranormal/comments/10gfs9k/woman_screaming_in_my_face_that_shell_see_my_in/",
        "text": "Spent the night at a poor farm restored to a hotel. I slept with my then boyfriend (now husband) and came to (in the middle of the night) and saw a woman dressed in rags standing above me, spitting with rage that I was an adulteress and that she would \"see me in Hell\" where I would \"burn for my sins\". She was obviously inferring that I was sleeping with a man, unmarried, and that this was a sin. She was somehow also a sinner and also damned to hell. The hatred she had was incredibly terrifying and I've never felt the degree of existential dread in my life like that night. I actually threw up from fear and sobbed.\n\nReally hard to explain that story to people.",
        "created_utc": 1674168414,
        "upvote_ratio": 1.0
    },
    {
        "title": "The flashlight analogy",
        "author": "Mythica_0",
        "url": "https://www.reddit.com/r/Paranormal/comments/10gf953/the_flashlight_analogy/",
        "text": "My parents use this analogy, and I was wondering if anyone else heard it? \n\nSo, the spirit realm/where ghosts reside is like a dark tunnel, and everyone has a flashlight. \n\nSome peoples flashlights are broken, they can’t see anything in the tunnel at all\n\nSome peoples flashlights flicker, letting them sometimes see things that they usually attribute to a trick of the light \n\nSome people have dull flashlights, they can see, but not very well. \n\nOthers (I am included in this group) have really bright flashlights.\n\nMy parents used this analogy to explain why I have experienced so many ghosts encounters in my relatively short life, where as some can go their whole lives without one. \n\nHas anyone else heard this analogy, or just me?",
        "created_utc": 1674167179,
        "upvote_ratio": 1.0
    },
    {
        "title": "3 scratches on my neck",
        "author": "External-Temporary-8",
        "url": "https://www.reddit.com/r/Paranormal/comments/10gf8gh/3_scratches_on_my_neck/",
        "text": "A few years ago I was chilling in my room watching a video when out of the blue my neck started to burn. I went to go check the mirror and had 3 scratches on my neck that were all equally long and evenly spaced out. Everyone I talked to after asked me where I got them and I didn’t have an answer. I have been having some religious discussions lately and this memory has been bugging me. Do you think it’s possible for me to have scratched myself?",
        "created_utc": 1674167132,
        "upvote_ratio": 1.0
    },
    {
        "title": "Solution to \"strange noises\" in British Columbia",
        "author": "TrueMacedonian",
        "url": "https://www.reddit.com/r/Paranormal/comments/10ge8n0/solution_to_strange_noises_in_british_columbia/",
        "text": "[removed]",
        "created_utc": 1674164637,
        "upvote_ratio": 1.0
    },
    {
        "title": "The cemetery and the thing",
        "author": "Gabriel23_tee",
        "url": "https://www.reddit.com/r/Paranormal/comments/10gcge7/the_cemetery_and_the_thing/",
        "text": "This thing happened to me this night,so I was with my best friend walking and we decided to go to her grandma cemetery to  light a candle for her,we were walking down the street with the cemetery ready to enter and she tells me that she saw something before we entered the cemetery, I told her that she was just freaking out, as we were walking towards the grave I heard something and I've decided to look....(I want to mention it was 9:30pm) my friend had taken a few steps forward and I was horrified, near a grave was a black figure with a very white face and I froze, my friend noticed that I stopped and that I was frozen and she kept calling me, I was too frozen to speak or move or anything else, after a few moments I tell her that we have to leave quickly.... she asks me what's wrong and all I could tell her was that we have to get out a few seconds later  I told her what I saw, she told me to leave because she had seen the same That thing was watching us both leave the cemetery and we started to run  I'm not the type to believe in the supernatural at all, but what I saw and what was there left me speechless",
        "created_utc": 1674160522,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is something chasing us?",
        "author": "Lance_biggerstaff__",
        "url": "https://www.reddit.com/r/Paranormal/comments/10gagm3/is_something_chasing_us/",
        "text": "It's kind of a long story, so please bear with me.\n\nMy (29F) partner (31M) and I have been dating on and off for almost 10 years. During the first 5 years, I would go to his house and spend most weekends with him. There would be mornings when I would wake up when random scratches that I couldn't have done (places on my back that I couldn't reach). I brushed it off, thinking that it came from my partner and I sleeping wildly. After getting a particularly nasty scratch, I joked that he may have a ghost around. He got pretty quiet and admitted that he believes he had an encounter with a female apparition when he was a child. That alarmed me slightly and I became more aware of happenings around the home like items going missing after we had JUST set them down or things disappearing for months then randomly showing up in places we know for a fact that we did not leave them.\n\nFast forward to a year later when I got pregnant. I got to work 2 hours early one morning, and nobody was around. I used the opportunity to get some rest since I had been having bad morning sickness, and I was extremely tired. The library at my job was deserted, dark, and quiet, which was perfect for a nap. I used my work blankets and a throw pillow and found a cozy spot to lay down and doze off. I fell asleep on my back, and that's when it got weird. It almost felt like a dream, but I couldn't be sure: I started hearing footsteps and the voices of my co-workers. Thinking that I was late waking up, i tried to get up, but my entire body wouldn't move, only my head. When I turned my head to look at the ceiling, there was this skeleton looking thing floating above me and staring at me. I immediately panicked and turned my head to the side and closed my eyes.\n\nWhen I finally woke up, the skeleton thing from the dream was gone, but the terrified feeling wasn't. Moving into my third trimester, everything was going smoothly until I went to bed one night at my house. I fell asleep laying on my back again, but this time, the dream was different and felt entirely real than the last time: I opened my eyes from my bed, and I couldn't move again. This time, there was a hooded figure in a black cloak staring at me from my doorway. It didn't have a face, never spoke, didn't move, just stood there staring. I tried to get up to close the door, but my entire body wouldn't work. I even tried to scream or call my dad for help, but nothing came out except a dry croak and gasps for breath. I can't remember what made the dream stop, but something did, and I woke up again feeling incredibly frightened.\n\nI was afraid something was after my baby, so I refused to sleep on my back (still refuse to do so), and I would never leave the door open again. After giving birth, only one incident occurred where my baby was too afraid to go into my partner's kitchen to get her ball despite the fact that the light was on. She just kept staring at the direction of the back door and taking small steps away from the kitchen entrance. As a religious person, I believe that spirits exist and can often attach themselves to us in uncommon ways. I'm afraid of what we have encountered. Even though nothing malicious has happened, i dont believe whatever is following us is friendly.\n\nThoughts?",
        "created_utc": 1674155842,
        "upvote_ratio": 1.0
    },
    {
        "title": "Nutella on the table",
        "author": "Ordinary_Ad754",
        "url": "https://www.reddit.com/r/Paranormal/comments/10gachx/nutella_on_the_table/",
        "text": "Ok I (m30) was staying with my girlfriend (f31) in a new house she has just started renting. We woke up one morning and I rolled to her to ask her what she wanted for breakfast, she replied “pancakes with Nutella” naturally a good choice.\nSo I chucked some clothes on and off I went to Asda to get pancake mix and the biggest jar of Nutella I could find. Once my quest was completed and I got back to her house I placed the bags on the kitchen table. We got the pancake mix , some other bits I bought and the Nutella out the bags and placed it on the table. \nMy girlfriend picked up the jar of Nutella and grinned at me because I got the biggest one I could find and commented “really?” To which we both laughed. \nShe placed the Nutella back on the table and got a frying pan out placed it on the stove and we started making some soft yet crispy pancakes, and man did they smell amazing!\nI turned to the table to grab the Nutella and it was gone. I thought maybe she had put it in a cupboard so opened the cupboards up…no Nutella. My girlfriend asked me what I was doing so I asked her “hey where’s the Nutella?” \nShe said “right there on the table” as she turned to look her self. The look of confusion on her face as she realised it was gone. We searched everywhere put couldn’t find this jar of Nutella anywhere! \nEventually we gave up and ate our pancakes with a sprinkle of sugar instead. I told my girlfriend to go relax and I’ll do the dishes. Once I’d finished up I turned around and there it was. The jar of Nutella standing there proudly on the table.",
        "created_utc": 1674155570,
        "upvote_ratio": 1.0
    },
    {
        "title": "Witch doctor aunty",
        "author": "Queen5252",
        "url": "https://www.reddit.com/r/Paranormal/comments/10g9m5u/witch_doctor_aunty/",
        "text": "I dislike that they call her that, so I call her a healer. She uses plants to heal the people that are possessed. Most of the time she is your ordinary aunty, but in that small island, people turn to her when  they have a family member that’s unable to control themselves. I’ve never seen her perform her magic but I’ve heard stories from my dad, mom, and grandma about the work she does. \nOne of the stories they told me was a young woman was brought in because her family said she was touched by a ghost. It’s believed that if a ghost touches you, you get possessed. Ghosts are a normal thing in that little island. Everyone knows they are around. Anyway, the family had to hold her down otherwise she would run to the woods. She wasn’t herself… it took about 5 men to hold a young woman down. My aunt had to tell the father of the woman… to go to a specific tree and pluck the leaves. So as the man exits the house and heads towards the tree, the tree magically changes into a mango tree. My father said that the spirit that is inside the young woman would try to make things seem as if it weren’t there. So you could imagine how hard it was, anyway, the man was told of the tricks these spirits can do… and so he plucked the leaves to help the witch doctor. She mixes leaves and rubs it on the woman and slowly the lady calms herself down and sleeps. Exhausted from the possession. Anyway, I truly believe my aunt is amazing. The word witch doctor paints her as a person who doesn’t help and is casting spells. She plays bingo and has a bunch of beautiful grandbabies who she spends her time with. Her name means light…. She is thee healer of that land and I’m so grateful I got to meet her.",
        "created_utc": 1674153881,
        "upvote_ratio": 1.0
    },
    {
        "title": "Woke up to my Santa Muerte Candle upside down?",
        "author": "Alternative-Ride8407",
        "url": "https://www.reddit.com/r/Paranormal/comments/10g6sc8/woke_up_to_my_santa_muerte_candle_upside_down/",
        "text": "[removed]",
        "created_utc": 1674147471,
        "upvote_ratio": 1.0
    },
    {
        "title": "Paranormal experience with Siri?",
        "author": "darkkitty1991",
        "url": "https://www.reddit.com/r/Paranormal/comments/10g5kx3/paranormal_experience_with_siri/",
        "text": "Hi all, a little weird one that happened to me a few days ago that only just has clicked for me.\n\nWhen my hands are full I’ll often text my husband I’m coming home via Siri on my watch which I’ve done 100s of times. Well this time it came up ‘text mum’ …. My partner’s name is no where near ‘mum’ in sound. (She passed 2017)\n\nI shrugged it off at the time but it has just hit me she died in January so I looked up the date (I don’t keep it saved as it’s not something I want to be reminded about) and the day that text mum happened was the day she died……… \nIm so taken a back now especially since it’s never happened before.",
        "created_utc": 1674144634,
        "upvote_ratio": 1.0
    },
    {
        "title": "Warded away some kinda spirits with Magic: the Gathering cards?",
        "author": "NofriendoLand",
        "url": "https://www.reddit.com/r/Paranormal/comments/10g5hl8/warded_away_some_kinda_spirits_with_magic_the/",
        "text": "[removed]",
        "created_utc": 1674144429,
        "upvote_ratio": 1.0
    },
    {
        "title": "The Old farmhouse",
        "author": "spiritsnthedark",
        "url": "https://www.reddit.com/r/Paranormal/comments/10g4v5f/the_old_farmhouse/",
        "text": "So yesterday I was on my way back home with truck parts that I had picked up and did what I do a lot of times, I opened up my map on my Iphone and started checking the countryside roads for any cemeteries I wasn't aware of, I go to them and walk through and record audio and video for my own record.\n\nI located one on a narrow side road and went to the area, when I got there I discovered that it was on private property and would be a 10 minute walk through the field to get to it. Not wanting to upset the property owner or get in trouble for trespassing, I went to a house that was next door back a long gravel lane.\n\nAs I got closer to the house it was obvious that it was not being lived in, it is a huge two story farmhouse that in it's day was quite beautiful I'm sure. I decided though to go ahead and knock on the door, I have seen people live in worse conditions and wanted to at least make the effort to knock on the door. Not gonna lie though, this place was unkempt and had a pretty creepy appearance, tattered curtains on all the windows, a few windows had been broken, etc.\n\nI opened the screen door and knocked on the door, it swung open when I knocked, exposing that the house appeared to have been quickly moved out of some years ago, full of furniture, clothing laying on the floor, kitchen was visible down the hall from the front door and could see the table was still there. I decided to step into the threshold of the doorway and started recording with my Iphone, I yelled out \"hello\" several times, knowing that there was no one living there.\n\nWithin about 45 seconds of stepping in, I was hit full on the front of my body with an air so cold that it was like stepping outside in the winter night with just shorts on, it was very cold air. Now the outside temperature was about 60 degrees and had been warm for several days, the house was not cold when I stepped in. But this cold air that hit me started to slowly move up my lower legs. Now as this took place, my lower left leg just above the ankle began to feel as if I was being ate up by fire ants, but there were no ants.\n\nI asked out loud \"If your doing that to me, please stop because it hurts\" and after asking several times and explaining that I was not there to do anything to the house or property within it, the burning stopped, but that very cold air remained. I made my intentions very clear and never moved further into the house, I asked the usual questions and panned to my left and to my right, capturing each room off to my sides and the staircase that was directly in front of me. Just as I stated that I was going to leave and would maybe come back someday, I observed with the naked eye a misty apparition cross in front of me from right to left, it was also captured on my Iphone.\n\nI was by myself, I was not smoking, there was no fog or mist outside to somehow come into the house and move through the rooms, the house sits about 900 feet from the roadway and the door does not face the road, so it was not a reflection from a car and there are no other houses close by. The feeling that accompanied this dark and ominous and definitely did not feel friendly or welcoming, I have been to many cemeteries and other places over the years and have never witnessed anything like this. I am somewhat skeptical and always try to debunk anything that I get, this one has me speechless, will definitely be locating the owner and attempt to get permission for an investigation.\n\no",
        "created_utc": 1674142968,
        "upvote_ratio": 1.0
    },
    {
        "title": "Something spooky??",
        "author": "tggrboo1",
        "url": "https://www.reddit.com/r/Paranormal/comments/10g3862/something_spooky/",
        "text": "Sometimes I wake from a dead sleep feeling like a frozen hand touched my shoulder. I will wake with a start, cover myself in 3-5 blankets and shiver for the next half hour or so. Any ideas??",
        "created_utc": 1674138929,
        "upvote_ratio": 1.0
    },
    {
        "title": "Attack during sleep paralysis",
        "author": "Zufrak",
        "url": "https://www.reddit.com/r/Paranormal/comments/10g2447/attack_during_sleep_paralysis/",
        "text": "Hi guys!, so basically since i had my first astral projection, weird things started to happen when im in sleep paralysis, the creepiest things that happened to me was, i opened my eyes (i was paralyse) and i heard a demonic voice speaking a weird language that i didn’t understand a thing, and my bed sheet got above me and it choke me while talking that weird language, i started praying to god and it got away, once i got up i was so fucking scared, i just lay down to relaxe, and again, my bed sheet got over me and started choking while talking his weird language and i started praying again, it happen 9 times that morning, 9 freaking times.\nAnd I also wanted to share that after that experience, like a couple of month after, i woke up paralyse and i’ve seen dark figures around me, i asked for god’s help and i’ve seen a bright light, the brightest light i have ever seen and it the dark figures got away. Ever since i never had and attack",
        "created_utc": 1674136040,
        "upvote_ratio": 1.0
    },
    {
        "title": "either going thru a manic \"episode\" or being psychotic. But either way SO believes in some paranorma",
        "author": "jakedeighan",
        "url": "https://www.reddit.com/r/Paranormal/comments/10g1o2k/either_going_thru_a_manic_episode_or_being/",
        "text": "l stuff that is taekn way to seriously.\n\nPeople scaring themselves (done it)\n\nBut its not real, right? I'm NOT psoessed. I don't think. BUt I DO FEEL like a different person n now it feels like I have to keep a secret. SUCKS. don';t understnd m,e =( .   I know.\n\nBut also feels like she trynma get me to go back on meds I don't want. BC of GHOSTS???? NOOOO, thx. \n\ni appreciate someone listening to my thoughts now. And I'm using my inspiration bettter except when I get those emotions ihave to gert out. Not trynig to do nything illegal. Someitmmes accidents happen tho.\n\nPlerase help offer some perspectibve. I honestly cnt type cuz my fingers get crossed up and twitchy. SORRY =(\n\ni am sober this morning if that mens anything. I always just smoke tho. WEED onlyy. Please",
        "created_utc": 1674134809,
        "upvote_ratio": 1.0
    },
    {
        "title": "I was Her Guide to the Afterlife.",
        "author": "CrazyTechWizard96",
        "url": "https://www.reddit.com/r/Paranormal/comments/10fylzi/i_was_her_guide_to_the_afterlife/",
        "text": "This story isn't a creepy one but, a sad one and was even a bit disturbing for me...  \nOkay, it was more or less fucked up and all of that getting served on a plate on Christmas?  \nYea, guess a part of Christmas died for Me on that day too.  \n...\n\nThis one is written different and probably has a bunch of errors in it, You'll see towards the end when I'm just crying again.  \n...  \nAlright let Me being with some back story of the night before,  \nwhere some voice even told Me over and over.  \n**'It's going to be the Nightmare before Christmas.'**  \nWich made even more sense since My beloved Dog, who wasn't to well for most of the year but slowly recovered had a really bad day, being sick to her stomach and all and...  \nI knew from before that even started around afternoon that something was around, and it's going to get really bad today.  \nTowards the evening, she got sick to her stomach, and pretty much towards midnight she was a mess.  \nI've prayed to have it get better soon for her, something told Me, it'll be her last day.  \nIt was a long struggle, but than she fell asleep and was able to rest, breathing heavy still and I comforted her a lot.  \nTo be honest, I won't go into a lot of the details what was going on since it wasn't pleasant at all to witness and it makes Me already tear up typing this down.  \nI went to bed a bit later, crying and prayed that she'll just wake up tomorrow and be fine, till that day before.  \nYet, when I was asleep, I had a very strange and very lucid dream, pretty much one of those lucid to astral dreams.  \nI'm not sure how I should start, since there was something else going on, wich I should probably start with as first.  \nSo,  \nas I was asleep, My Mother was still up and worried about our dog, and checked on her, than taking a smoke break, and praying that, if She can't get better, make it that she can sleep and leave this world and go to a better place.  \nWhen she came back, around 2:45 am, she noticed that, she was gone.  \n*And now I am crying again as I continue typing...*  \nShe passed away on the 24th of December 2022 at 2:45 am, wich My Mother wrote down on a letter for Me and placed it on the living room table.  \n...  \nAnd now We are coming to the Paranormal Part of things, where it got Heartbreaking for Me, yet I thank the one who let Me carry out this duty.  \n...  \nIn the dream, I just came back into the livingroom, seeing her laying on her Bed, looking at Me and I smiled and said \"Come on girl, get up.\"  \nShe gave Me a confused look, since, she wasn't able to for a few months without help.  \nso I've said again \"Come on Lassie, You can walk again.\" I clapped with my hands and smiled.  \nShe than tried and slowly managed to stand up, looking at Me wit a smile, She than walked around, a bit clumsy at the start, so I told her to clam down and watch her movement.  \nIt was just an beautiful sight to see her walk again, she than got out into the hallway and almost slipped a bit, so I said 'Oh, please be careful, it takes a bit to get used to it again.'  \nA moment later, as she turned around,  \nShe just...  \nLooked at Me with a smile, yet She changed.  \nHer fur got a lot more of an metallic silver color in it, and she looked like when she was around 4 or 5 again, yet... Older.  \nIn an more or less, older in a Spiritual way, like...  \nShe was an very old soul.  \nI just stood there for a moment, than turned around and walked to the door, and opened it, letting her walk out into the garden.  \nShe started to run around and loved it, she was so happy.  \nYet I noticed something was off, it wasn't day, but ... Night?  \nI looked further and didn't recognized My garden anymore, it was...  \nDifferent, yet familiar.  \nI looked around and further over and later found out, I knew this Garden Well, it was the one of My Grand Parents.  \nAfter a bit I told her to walk over and...  \n...  \nIt kinda stopped there and I woke up, as she walked over.  \nBoth of My Grand Parents, who living in that House passed away, My Grandma back in 2008, the year My Dog was born, yet with 5 months in between.  \nMy Mom always told Me for years that She always saw My Grandparents and all who passed so far, where at there House, on the Porch, drinking tea, coffee and just having a nice day togher.  \nClassic Family Reunuin.  \nThe Dog before Lassie was also there.  \nJust a place for everyone to come back together.  \n...  \nWell, back to the sad truth.  \nSo, I woke up and I enjoyed this 'Dream', until...  \nI've spotted that box on the porch with that Blanket over it.  \nMy hear sank in that moment.  \nI only could reply with '... Oh no...'.  \nI walked into the Livingroom, and started to read the note, wich hit Me like freight train.  \n...  \nI wish it was just a dream, but...  \nI was her guide over into the after Life, and I thank the One who let Me escort her over to a better place.  \nIt was a big Honer.  \n...  \nI think, this is pretty much all to this one, finishing this rather sad piece sobbing and with tears running down My cheeks.  \nAt least I was able to say goodbye to her and I know that she's safe and over at a good place, with everyone else who has passed on so far...  \n...  \n'Gone but not forgotten, till the Day We'll Meet again'",
        "created_utc": 1674124916,
        "upvote_ratio": 1.0
    },
    {
        "title": "A night at a Hospital",
        "author": "Hilltop501",
        "url": "https://www.reddit.com/r/Paranormal/comments/10fylh3/a_night_at_a_hospital/",
        "text": "This is from around January 2016. \nMy late Grandfather (passed in 2019) was admitted to the usual hospital for low sodium and diabetes.\nSince my grandma and other family members has a few health issues, I being the young kid do the night as an attendant\n\nMy grandfather needed a change of bottle of sodium drip probably about every 2.5 hours, so basically I couldn't sleep and that was okay since I was an engineering student at that time and had habit of pulling all night study sessions.\n\nIt's about 4 am in the morning, after calling the nurse to change the bottle. I decide to go down for a walk. We were on the 3rd floor but I avoid the elevator as I don't like those big ass ones used in hospitals.\n\nI go to the ground floor, smoke a cig and then decide to go back, but while climbing up the stairs, once I reached the first floor, I felt a sudden overwhelming feel of dread and my legs felt like they had no strength in them, I felt like something was holding me from behind. No I didn't feel like there was any hands or anything. Just a force. I was so tired in 10 secs that all I wanted to do was sit down right there.\n\nAnd then when I made to the 2nd floor, I saw the big OT room, and I realised there must be something with me right now. I never had an experience in that hospital so I didn't think about it. But suddenly it hit me as to how many people must have died in the building. I pushed myself and as soon as I reached the room, the feeling was gone. Just in a second.\n\nI never saw anything, but I swear to god, the feeling of dread all of a sudden was absolutely mental. Almost like a fight or flight response.\nDoes anyone else have an experience like that?",
        "created_utc": 1674124856,
        "upvote_ratio": 1.0
    },
    {
        "title": "Creepy smiling guy is back...(update)",
        "author": "Fluffy_Communication",
        "url": "https://www.reddit.com/r/Paranormal/comments/10fxyi2/creepy_smiling_guy_is_backupdate/",
        "text": "It's been around a year since the last encounter and this one is the worst so far. \nMy dream led me to a room under construction. I had just lost the person I was with and was looking about to find them.\nThat \"off\" feel came about again but I ignored it. \"You should wake up\" but I ignored my brain and told it that its only a dream.\nSomeone ran about in the shadows and I ignored more pleads from my brain. Then out of the darkness it ran up to me. Just like every encounter it had taken on another form but now its running at me.\nIt got so close that all I could see was its smiling face.\nThen I did something I haven't ever done before, I shouted \"NO\" and pushed it away. Just before it vanished I swear I saw a look of confusion. I, some how, also pushed myself  through layers of dream/consciousness, something along these lines, untill I felt safe. Once I felt safe I told myself to wake up. I looked around the room, realised I clearly wasn't awake but felt so safe that I decided to stay asleep.\n\nIt took a lot the next night to fall asleep butI managed. Even just thinking about his face gives me the creeps.",
        "created_utc": 1674122417,
        "upvote_ratio": 1.0
    }
]