[
    {
        "title": "Maybe haunted house or paranoia from scary movies",
        "author": "PlaneGanache4071",
        "url": "https://www.reddit.com/r/Paranormal/comments/102tn6u/maybe_haunted_house_or_paranoia_from_scary_movies/",
        "text": "So didn’t know where else to bring my case so I’m bringing it to the community. I recently moved into a house leaving behind my apartment I’ve always gotten off vibes from the place. Upon moving in at the end of Summer I noticed that we kept having a fly or 2 randomly come out of our old school thong and groove ceiling. Now where in the dead of winter and every few weeks a fly will pop out. That was my first suspicion we live next to the hospital we’ve had 3 mentally Ill people come to our house. We have a ring camera so we can always see them and hear them. The thing that sticks out is that they all say the same thing “Someone had told them that they should come to our house” the weird part is our porch lights never on and we live in the suburbs of a main road in a large city so they have to pass 50 houses before getting to mine. Now the last oddity is the last 2 months me and my wife having been constantly fighting and I’ve been having the craziest nightmares that will always have me waking up at 3 or around 3 am. So what’s the community got to say give me your best thoughts.",
        "created_utc": 1672805831,
        "upvote_ratio": 1.0
    },
    {
        "title": "The face of a ghost revealed in a picture?",
        "author": "catlover12390",
        "url": "https://www.reddit.com/r/Paranormal/comments/102tbax/the_face_of_a_ghost_revealed_in_a_picture/",
        "text": "[removed]",
        "created_utc": 1672804875,
        "upvote_ratio": 1.0
    },
    {
        "title": "Hand signs summoned demons?",
        "author": "ArmadilloDirect2979",
        "url": "https://www.reddit.com/r/Paranormal/comments/102sqy7/hand_signs_summoned_demons/",
        "text": "So, I started doing hand gestures triangle shaped and triple 6 hand sign aka ''OK Sign\", for a week or 2 now to give me ''power'', supposedly its illuminati but I use it to help boost senses and chakra. I've been seeing 666 all day now at least 5 times, starting today and signs like dead roses and flocks of crows. Even while writing this, it's like something doesn't want me to post it. Did I summon something I shouldn't have? Was I accidentally practicing witchcraft? I worship Jesus btw.",
        "created_utc": 1672803236,
        "upvote_ratio": 1.0
    },
    {
        "title": "Abortion ghost?..",
        "author": "Evening_Storage_6424",
        "url": "https://www.reddit.com/r/Paranormal/comments/102sl0d/abortion_ghost/",
        "text": "I’ve posted on this subreddit a few times using my old username. Until I lost my phone and subsequently the password that had been saved into my iPhone, for however many years. I’ve had a lot of strange experiences and after having a near death experience, I often ask others of their experiences (you should try it) and learning that there really is some weird/unexplainable phenomena in the world.\n\nIf I can find them I will link my other posts here. If I remember correctly, one is from when my mother died in 2019 and she told me all the strange things she was hearing and seeing on her death bed. She promised to prove to me that there was an afterlife if there was one…she did. Another was when I was pregnant with my son living with family. But anyways..\n\nWhen I was around 22 years old (30 now) I was working at my first really good banking job. I had a large group of friends and was dating a guy who really had it all going for him (amazing credit, life goals, good family). I ended up pregnant and immediately, didn’t want it. I told him I didn’t want a family and that I was too young. That I had an entire life ahead of me to have kids. He was heartbroken but I decided to have an abortion and he being the self-proclaimed “feminist” he was, supported me regardless.\n\nNow I want to say before I go on that this is my story and everyone’s is different. I believe women have the absolute right to make what decision they want with their body’s. Having an abortion is often traumatic and not a decision people want to have to make. But I was dead set on this and didn’t want a child. I was partying and irresponsible and just dumb and young.\n\nAfterwords though, I fell into a deep depression and me and my bfs relationship fell apart. I stopped going to work and felt like a monster and a failure. I relapsed and one by one lost my friends..it was a low point in my life.\n\nIn the following years I managed to finally get clean again and met my sons (the one I have now) father. Eventually I became pregnant and decided I wanted to have him. I was in love with his father and in love with the human I was creating. Also in a much better place financially and mentally to have a child.\n\nTwo weeks before I was due, I was laying in bed and had what I’m assuming was a lucid dream? I opened my eyes to see a woman I didn’t recognize holding a blue cloth bundle. I would close My eyes and wake up to her closer than she had been before, or in a different part of the room. She had no expression and was motioning for me to look at the bundle. I looked and couldn’t see anything other than the outline of a baby boy. My first thought was “is that my son I am carrying?” But almost immediately I felt this overwhelming sensation that it wasn’t him. That it was my other son, the son I didn’t end up having and that she was showing me he was ok. That I didn’t need to worry.\n   \nI’ve always been nervous to tell people about this because for one, it could’ve been my hormones making me lucid dream. Two I didn’t want to get into an abortion debate because I will always stand with pro choice and I never once thought I would’ve done it differently. Interestingly enough, years later I found out my bf I had the abortion with was accused of rape and sexual misconduct. So I like to think there’s a reason for things happening the way they do. Two weeks later my (now 5 years old) son was born and I was absolutely, hopelessly in love the moment I heard his first breathe.",
        "created_utc": 1672802769,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is Clinton Rd as haunted as they say?",
        "author": "Malatino",
        "url": "https://www.reddit.com/r/Paranormal/comments/102rz2z/is_clinton_rd_as_haunted_as_they_say/",
        "text": "Is this road really the hype to go out and drive on? Heard it’s one of the most haunted roads in America but I would love to know from others that have driven it before a drive all the way out there.",
        "created_utc": 1672801076,
        "upvote_ratio": 1.0
    },
    {
        "title": "Something paced around my van for many minutes in the Baja Desert",
        "author": "azrathud",
        "url": "https://www.reddit.com/r/Paranormal/comments/102rdr3/something_paced_around_my_van_for_many_minutes_in/",
        "text": "[removed]",
        "created_utc": 1672799436,
        "upvote_ratio": 1.0
    },
    {
        "title": "Motion light sensor keeps turning on when no one is around",
        "author": "Charming-Business848",
        "url": "https://www.reddit.com/r/Paranormal/comments/102qizh/motion_light_sensor_keeps_turning_on_when_no_one/",
        "text": "I live in.a strange building but to make it simple, my room is across from the kitchen. The kitchen is actually outside the building tho. There's a small backyard you have to cross to go to the kitchen. The kitchen has no walls, it's all made of glass/windows so I can see through.\n\nIn the kitchen there's a motion light sensor which pisses me off because it turns off pretty quickly and unless you walk directly by it or make a very loud noise it won't turn on.\n\nWell the light has been turning on by itself for the last couple of hours. It did it yesterday too. It's night. There's no one there and no noise.\n\nI'm thinking to leave a message for the ghost and tell them to stop doing it because the light is keeping me up lol",
        "created_utc": 1672797119,
        "upvote_ratio": 1.0
    },
    {
        "title": "Would an entity seen in a dream be real?",
        "author": "VaLightningThief",
        "url": "https://www.reddit.com/r/Paranormal/comments/102pqr9/would_an_entity_seen_in_a_dream_be_real/",
        "text": "(here's what I put the first time that got removed for some reason)\nAre entities like shadow people, ghosts, spirits and what not in dreams actual entities that are there and your mind is trying to warn you of them, or is it possible to simply have a dream about an entity but it just be a dream\n\nI ask because I saw a shadow person in a dream, and have also seen them while awake. Wanted to know if I was dreaming one up or if one was physically in my dream",
        "created_utc": 1672795035,
        "upvote_ratio": 1.0
    },
    {
        "title": "My sleep app recorded a ghost?",
        "author": "meggerz04",
        "url": "https://www.reddit.com/r/Paranormal/comments/102pin9/my_sleep_app_recorded_a_ghost/",
        "text": "[removed]",
        "created_utc": 1672794445,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does anyone know what could be happening in my house?",
        "author": "Crime-Goat",
        "url": "https://www.reddit.com/r/Paranormal/comments/102oi01/does_anyone_know_what_could_be_happening_in_my/",
        "text": "I have lived in a very old house for about 6 years and in these 6 years I have seen many things lurking around. \n\nFor context, I live in a city and we are surrounded by neighbors, but my house was built around 100 years ago, long before there was a city around it and was originally surrounded by farm land. There has been a lot of questions surrounding exactly when the house was built, the elderly woman we bought it from said it was built in 1908–exactly 100 years before I was born. But we recently had it appraised and were told it was likely built in 1926, this was backed up when we found news papers from the mid 1920’s lining the 100 year old windows while putting in new windows. \n\nMoving on to the paranormal part, ever since we first moved in (I was 8) I had been seeing things around the house. From people out of the corner of my eye, to my name being called while home alone, to full face-to-face meetings with people who were never there, I had too many experiences to count. I was always a child with an active imagination but as I got older I began to realize it might not have been my imagination. I’m only going to brief 2 events but if anyone wants to hear more or for me to go into more detail I will.\n\n#1. one night (I was 9 or 10) I was standing in my upstairs bathroom with the door open to the hallway braiding my hair. I saw 2 gray figures walk past the open door and to my parents office, which was right next to the bathroom. Both my parents have light gray hoodies so I assumed it was them and wanted to say something them (I now forgot what), but something stopped me. The two figures disappeared and I realized I never heard the door open. I then heard my parents talking in the kitchen and I realized they were both downstairs. I immediately ran downstairs but didn’t tell them what had  happened. These 2 figures showed up multiple more times but none of them were as dramatic as the first time. \n\n#2. When I was 11 or 12 every night at sunset I would be laying in my bed doing whatever, reading, playing games, ect, but I would see an old lady, standing at the edge of my bed just watching me. I was never threatened or scared by her, she was just there. This went on for a few months and I thought nothing of it, which was weird because I am usually easily freaked out by very small things. I told my mom about it and she told me about how her grandmother would visit her after she passed, and she thought it might have been her looking after her great granddaughter. I thought it was sweet and went on with my life. This soon stopped and everything went back to normal. About a year later my mom found an old photo of one of the previous owners and showed me. It was the same woman I had been seeing nearly daily the year before. \n\nIf anyone wants to hear more about the experiences or house I will gladly tell you what you want to know, it’s a weird old house. Hidden rooms, sounds, sightings, sleep paralysis and strange perfumes are all things that have happened and I’ll gladly tell you all about it if you’d like.",
        "created_utc": 1672791844,
        "upvote_ratio": 1.0
    },
    {
        "title": "A paranormal visitor",
        "author": "Dads_high",
        "url": "https://www.reddit.com/r/Paranormal/comments/102npxl/a_paranormal_visitor/",
        "text": "My grandfather passed away unexpectedly about 10 years ago. He died alone in his home, as my grandmother was out of town. Just two days before he passed, I was visiting the town he lived in and where I grew up. Instead of seeing him as he requested, I decided to party with friends all weekend. I learned of his death the day I got back home. \n\nWe were close and his death really crushed me. I held tremendous guilt for my selfish actions. About a month later I was forced to move back home and live with my newly widowed grandmother. The first night back I played basketball with some old friends, and joked that my grandpa’s ghost was going to pay me a visit, considering how I left him alone and was now sleeping about 8 feet from the spot he had recently died. \n \nIt was a harmless joke, one I never expected to come to fruition. \n\nWell that same night, my first night back in my grandfathers old home, I slept in the guest room. I was up late watching adult swim, specifically the re runs of king of the hill that would come on around 2am. \n\nMy grandfather had bad breathing issues. For years before his death you could tell what room he was in due to his raspy, struggled breathes. It resembled a very low growl, a sound I can never forget.\n\nAs I laid in bed that first night in his old home, watching king of the hill, I began to hear that same growl in the background. I shook it off, laughing to myself that it sounded just like my grandpa’s struggled breathes. My grandparents mobile home faces a highway, and lots of people and cars would rush past at all hours of the night. So at first I did not think anything of it, just a coincidence. \n\nBut the growls, the struggled breathes, they grew louder and louder as I lay still in my bed facing the TV. Suddenly I couldn’t hear the tv anymore, but I still faced it and could clearly see Bobby hill on the screen. I glanced at the cable box below the tv, it read 2:03am. \n\nThe growls continued, and eventually I could hear them right beside my bedside. I tried to move, but I couldn’t. My body felt like it was being pushed into the bed by a strong force. I couldn’t move any of my limbs, it felt similar to how sleep paralysis is described. But I could move my eyes, just a bit. And that’s when I saw it. \n\nStanding in front of me, I saw my grandfather’s legs, dressed in his trademark pajamas pants. I was unable to move my head, so I could see only the bottom of his torso and legs, all dressed in his usual Chicago bears sweatshirt and pajama bottoms. Then I felt a pat on my side, I believe he was petting me the way you would a loved one, in a comforting way. \n\nI tried with all my strength to scream, but I could only let out a whisper, “grandpa, grandpa, grandpa”, was all I managed, in a very weak whisper. I fought to sit up, but my body was paralyzed in the bed, still unable to look up and meet his gaze. \n\nMy grandfather stopped patting me, and that’s when I could barely move my head, maybe just an inch, and I saw his full body and face. Tears ran down my face as I tried to move or scream, but nothing, I was effectively paralyzed. \n\nHe looked at me, slowly opening his mouth as if to speak. But no words came out, only a loud and terribly frightening entanglement of indecipherable noises. It sounded like when you fast forward through a show in a foreign language with the volume on full blast. It was so loud, and the scariest most unnerving thing I have ever heard in my life. \n\nSuddenly he stopped “talking” and closed his mouth. We made eye contact, and then nothing. He was gone. I shot out of my bed like a rocket. It felt a bit foggy as I looked around my room to find no one there. I glanced at the television, still on and playing king of the hill, Bobby still on screen. The clock on the cable box read 2:05am. \n\nI ran to my grandmothers bed yelling, “I saw grandpa! I saw grandpa!” And slept with her that night. I lived there in that home for years after, and never saw him again. Although strange occurrences did happen once in a while, nothing of that caliber. \n\nThe scariest part of the whole encounter was when he tried to speak. I know my grandfather was a good man that loved me, but the closest thing I can describe it to is the sound you hear in movies when demons try to speak in Latin or something. I believe he was trying to contact me from wherever he was, but the “connection” was weak and couldn’t get proper words out. \n\nWhat do you guys think?",
        "created_utc": 1672789924,
        "upvote_ratio": 1.0
    },
    {
        "title": "Do you have any info on Asian dragonfly spirits?",
        "author": "Warr_Ainjal-6228",
        "url": "https://www.reddit.com/r/Paranormal/comments/102np1s/do_you_have_any_info_on_asian_dragonfly_spirits/",
        "text": "I am looking for any information on Asian dragonfly spirits. Form a personal source and a personal freighting experience.  They like to spiritually bond with Asian girls. But I have no name or written source for any of this. So if you can help it would be much appreciated.",
        "created_utc": 1672789862,
        "upvote_ratio": 1.0
    },
    {
        "title": "Are entities in dreams always real?",
        "author": "VaLightningThief",
        "url": "https://www.reddit.com/r/Paranormal/comments/102mpce/are_entities_in_dreams_always_real/",
        "text": "Are entities like shadow people, ghosts, spirits and what not in dreams actual entities that are there and your mind is trying to warn you of them, or is it possible to simply have a dream about an entity but it just be a dream",
        "created_utc": 1672787453,
        "upvote_ratio": 1.0
    },
    {
        "title": "I never believed in ghosts until this. True story",
        "author": "Dads_high",
        "url": "https://www.reddit.com/r/Paranormal/comments/102mlqi/i_never_believed_in_ghosts_until_this_true_story/",
        "text": "My grandfather passed away unexpectedly about 10 years ago. He died alone in his home, as my grandmother was out of town. Just two days before he passed, I was visiting the town he lived in and where I grew up. Instead of seeing him as he requested, I decided to party with friends all weekend. I learned of his death the day I got back home. \n\nWe were close and his death really crushed me. I held tremendous guilt for my selfish actions. About a month later I was forced to move back home and live with my newly widowed grandmother. The first night back I played basketball with some old friends, and joked that my grandpa’s ghost was going to pay me a visit, considering how I left him alone and was now sleeping about 8 feet from the spot he had recently died. \n \nIt was a harmless joke, one I never expected to come to fruition. \n\nWell that same night, my first night back in my grandfathers old home, I slept in the guest room. I was up late watching adult swim, specifically the re runs of king of the hill that would come on around 2am. \n\nMy grandfather had bad breathing issues. For years before his death you could tell what room he was in due to his raspy, struggled breathes. It resembled a very low growl, a sound I can never forget.\n\nAs I laid in bed that first night in his old home, watching king of the hill, I began to hear that same growl in the background. I shook it off, laughing to myself that it sounded just like my grandpa’s struggled breathes. My grandparents mobile home faces a highway, and lots of people and cars would rush past at all hours of the night. So at first I did not think anything of it, just a coincidence. \n\nBut the growls, the struggled breathes, they grew louder and louder as I lay still in my bed facing the TV. Suddenly I couldn’t hear the tv anymore, but I still faced it and could clearly see Bobby hill on the screen. I glanced at the cable box below the tv, it read 2:03am. \n\nThe growls continued, and eventually I could hear them right beside my bedside. I tried to move, but I couldn’t. My body felt like it was being pushed into the bed by a strong force. I couldn’t move any of my limbs, it felt similar to how sleep paralysis is described. But I could move my eyes, just a bit. And that’s when I saw it. \n\nStanding in front of me, I saw my grandfather’s legs, dressed in his trademark pajama pants. I was unable to move my head, so I could see only the bottom of his torso and legs, all dressed in his usual Chicago bears sweatshirt and pajama bottoms. Then I felt a pat on my side, I believe he was petting me the way you would a loved one, in a comforting way. \n\nI tried with all my strength to scream, but I could only let out a whisper, “grandpa, grandpa, grandpa”, was all I managed, in a very weak hush. I fought to sit up, but my body was paralyzed in the bed, still unable to look up and meet his gaze. \n\nMy grandfather stopped patting me, and that’s when I could barely move my head, maybe just an inch, and I saw his full body and face. Tears ran down my face as I tried to move or scream, but nothing, I was effectively paralyzed. \n\nHe looked at me, slowly opening his mouth as if to speak. But no words came out, only a loud and terribly frightening entanglement of indecipherable noises. It sounded like when you fast forward through a show in a foreign language with the volume on full blast. It was so loud, and the scariest most unnerving thing I have ever heard in my life. \n\nSuddenly he stopped “talking” and closed his mouth. We made eye contact, and then nothing. He was gone. I shot out of my bed like a rocket. It felt a bit foggy as I looked around my room to find no one there. I glanced at the television, still on and playing king of the hill, Bobby still on screen. The clock on the cable box read 2:05am. \n\nI ran to my grandmothers bed yelling, “I saw grandpa! I saw grandpa!” And slept with her that night. I lived there in that home for years after, and never saw him again. Although strange occurrences did happen once in a while, nothing of that caliber. \n\nThe scariest part of the whole encounter was when he tried to speak. I know my grandfather was a good man that loved me, but the closest thing I can describe it to is the sound you hear in movies when demons try to speak in Latin or something. I believe he was trying to contact me from wherever he was, but the “connection” was weak and couldn’t get proper words out. \n\nWhat do you guys think?",
        "created_utc": 1672787217,
        "upvote_ratio": 1.0
    },
    {
        "title": "Sleep paralysis?",
        "author": "needhelpwithsleepTA",
        "url": "https://www.reddit.com/r/Paranormal/comments/102melu/sleep_paralysis/",
        "text": "[removed]",
        "created_utc": 1672786771,
        "upvote_ratio": 1.0
    },
    {
        "title": "I went out to take photos around my neighborhood a couple months ago, turned out to be very spooky",
        "author": "E-NsJunkDrawer",
        "url": "https://www.reddit.com/r/Paranormal/comments/102lltb/i_went_out_to_take_photos_around_my_neighborhood/",
        "text": "[removed]",
        "created_utc": 1672784905,
        "upvote_ratio": 1.0
    },
    {
        "title": "Paranormal experience",
        "author": "Weekly_North",
        "url": "https://www.reddit.com/r/Paranormal/comments/102l94v/paranormal_experience/",
        "text": "My family used to take a yearly trip to Newport RI as my parents loved the history there we usually stayed in hotels but one year we tried renting a house in the middle of town instead. Every night around 230am like clockwork my sister &amp; I would wake up to what sounded like someone coming up the stairs and down the hall toward our rooms (our rooms were connected by a closet) followed by a loud piano song we thought we were just being paranoid until my mom yelled at us for running up and down the stairs and hall at 3am… as we stayed longer other little things started happening cupboards opening and closing on their own books &amp; boxes being slightly moved around it was definitely an experience and 10/10 would love the opportunity to stay there again",
        "created_utc": 1672784098,
        "upvote_ratio": 1.0
    },
    {
        "title": "Multiple Goatman?",
        "author": "josh_0620",
        "url": "https://www.reddit.com/r/Paranormal/comments/102kzun/multiple_goatman/",
        "text": "[removed]",
        "created_utc": 1672783517,
        "upvote_ratio": 1.0
    },
    {
        "title": "people having nightmares when they sleep in my house?",
        "author": "Smollangrypupper",
        "url": "https://www.reddit.com/r/Paranormal/comments/102kyk6/people_having_nightmares_when_they_sleep_in_my/",
        "text": "anyone know what this could be or how to get rid lf it? I've always had a history of having awful night terrors on and off but for years my partner has been telling me that he also has terrors/paralysis every time he sleeps over. i feel pain in the dreams but typically just chalk it up to ptsd terrors. ive lived in a very active house before that was negative so this doesnt concern me very much. the only thing thats maybe odd is that i remember an entity thatd follow me in my nightmares as a kid. it stopped at some point and i worry somehow, it might have found me but isn't pulling its typical old visual tricks I've been ignoring this for a while now but last nights dream was a little but concerning solely because there were reapers marking me for death as \"it was my time to go\" and i was \"supposed to be taken back by god a long time ago\" apparently my dog is scheduled to go soon with me but not my partner . should i be concerned about this?",
        "created_utc": 1672783440,
        "upvote_ratio": 1.0
    },
    {
        "title": "and Update to my past post",
        "author": "FalloutForever_98",
        "url": "https://www.reddit.com/r/Paranormal/comments/102k9d1/and_update_to_my_past_post/",
        "text": "It's surely getting stronger now. \n\nThere are currently two entities that I have seen.\n\nA shy little girl \n\nAnd a tall black figure that seems to be more curious than mean. As it doesn't seem to attack or even bring fear when I see him like the girl does. It's more of a neutral feeling.\n\nHowever the girl has been getting stronger and has started messing with lights. \n\nMe and my family when seeing such just assumed that the lights were dying and changed them but even when we did shortly after (like the next day) they started to flicker again. \n\nShe's also gotten physical, but in a strange intimate way. I've experienced sleep paralysis once and felt a pressure on me and looked up and she was on top of me.\n\nSo now I'm wondering if it's a succubus... But this is the first time this has happened so I don't know what she is.\n\nI don't know the tall black figures intentions but he doesn't seem to be menacing so...",
        "created_utc": 1672781874,
        "upvote_ratio": 1.0
    },
    {
        "title": "I've seen a white hole/breach during a storm as a child",
        "author": "Aspissim",
        "url": "https://www.reddit.com/r/Paranormal/comments/102iu06/ive_seen_a_white_holebreach_during_a_storm_as_a/",
        "text": " \n\nIt's probably the most bizarre thing I ever assisted in my life.\n\nI was in 5th grade (10 yo), we were in class upstairs and there was a huge storm outside, everybody had chill when a lightning striked.\n\nLightnings were getting closer and closer, I was fascinated by it especially because I was sit near to the window. Then a lot of lightnings started to strike at the same time and a big one was really close to us.\n\nThis big lightning was really really strange, it enlightens us for a whole second (which is pretty long for a lightning) and I could have seen some sort of white hole, almost like a breach in space, I seen it for a whole second too.\n\nI asked my school friend who was sit next to me \"Have you seen this ? The white hole ?\" and he was affirmative.\n\nMy younger self liked to imagine it was some of a dimensional breach for some creatures to come in our world lol, every time since I heard someone talking about a paranormal event, I'm like \"maybe the responsible of this event come from that breach\", ofc I don't believe it but it's a fun theory.",
        "created_utc": 1672778597,
        "upvote_ratio": 1.0
    },
    {
        "title": "Tell me your stories for Youtoob",
        "author": "JadedStranger722",
        "url": "https://www.reddit.com/r/Paranormal/comments/102gv80/tell_me_your_stories_for_youtoob/",
        "text": "[removed]",
        "created_utc": 1672773887,
        "upvote_ratio": 1.0
    },
    {
        "title": "New TV Series Seeking Haunted Homes or Locations Around Phoenix",
        "author": "HauntedHomeHunt",
        "url": "https://www.reddit.com/r/Paranormal/comments/102gt4x/new_tv_series_seeking_haunted_homes_or_locations/",
        "text": "Hi everybody!\n\n  \nWe are currently looking for homes and/or locations around the Phoenix area to feature on the first season of a new series that will be broadcast on a major streaming service. If you or anyone you know knows of a place that is currently brimming with paranormal activity, whether it's a home or a local establishment, please send me a message. I'd love to chat with you! \n\n&amp;#x200B;\n\nI can provide more information based on whether or the story is a good fit for our platform.\n\n&amp;#x200B;\n\nThanks and I look forward to hearing from you!",
        "created_utc": 1672773742,
        "upvote_ratio": 1.0
    },
    {
        "title": "Bachelor's Grove",
        "author": "laurenliza",
        "url": "https://www.reddit.com/r/Paranormal/comments/102g80v/bachelors_grove/",
        "text": "I visited the cemetery with a couple of friends in the spring of 2017. We arrived there around 6:30 pm, parked at the small lot across the road from the cemetery and made our way over. I was in a photography class at the time and brought a school-issued camera with me to take pictures. \n\nWalking into the cemetery felt sort of overwhelming- like we had walked into a lively party where everyone suddenly went quiet and stared at us, even though we were the only ones there. I took some pictures in the cemetery and after a while we decided to walk deeper into the woods- this would turn out to be a mistake. \n\nAs the three of us walked along the creek, I couldn't shake the sense of unease that was settling in, despite it still being pretty light out and, due it being early spring, the leaves hadn't yet grown back so we could see pretty far in every direction. Something that still creeps me out about this place is the lack of sound; I listened for the chirps and scurries of wild animals but the only sound in the woods was our footsteps in the leaves and the creek. My camera, fully charged, died a few times and when I turned it back on it still had full battery. We came across multiple round clearings in the woods; there are rumors of dark magic and rituals taking place here, so at the time I attributed it that. There was a picnic bench in one of the clearings and I took a picture of my friends on my cellphone, standing on the bench part. They were smiling when I took the photo, but when I looked at it their faces were distorted, my female friend appeared sad/scared while my male friend appeared angry, but they were perfectly fine. A few minutes after taking that picture my phone mysteriously went missing and we searched all over the area (we were still right by the picnic bench so we figured it couldn't be far) until the sun started to go down and we realized we needed to get the hell out of there. We ditched the phone and my female friend managed to lead us out. As we were leaving I saw a completely back shadow figure with a brimmed hat, walking parallel to us maybe 10 feet into the woods. He was walking through dense woods and made no sound. I have no idea why i didn't react to this in the moment, but when I asked my male friend about this later he said he saw it too. \n\nWhen we got back to my house, some unfortunate events went down with my family that were mostly likely inevitable but I think the energy I brought back certainly could have contributed. When I brought the camera to my room the energy seemed to shift and I saw several figures and anomalies as I scrolled through the photos. I deleted them all right then. Everything felt more normal after that, though the energy in my living room where the family thing happened was off until we moved out. Even my completely skeptical mother admitted that the lighting looked wrong/things felt off in that room after this. I'm still interested in haunted places and the paranormal, but this experience made me more wary of these things.",
        "created_utc": 1672772376,
        "upvote_ratio": 1.0
    },
    {
        "title": "Sleep Paralysis Experience",
        "author": "BoBuck25",
        "url": "https://www.reddit.com/r/Paranormal/comments/102g5n3/sleep_paralysis_experience/",
        "text": "This happened about a year ago. I’m on mobile so I apologize for the formatting of this. To make a long story short I had been experiencing a lot of sleep paralysis during this time from increased stress around the pandemic, it had happened a few times before in my life but wasn’t nearly as frequently as it had been happening. When I sleep I position myself almost like you would imagine a vampire with my hands folded on my chest and my legs crossed at the ankles. So I wake up and immediately know I’m in a sleep paralysis state. But this time I can feel something on my left foot which is crossed over my right. It feels like a push or a pull, pulling my left foot to the left. In my head I was trying to rationalize it, even not sure if it’s just a sensation or if my foot is actually moving. Next thing I know my entire leg gets pulled off of my right and falls off of the bed.",
        "created_utc": 1672772215,
        "upvote_ratio": 1.0
    },
    {
        "title": "Something ripped an animal to shreds",
        "author": "kalzorah",
        "url": "https://www.reddit.com/r/Paranormal/comments/102evi6/something_ripped_an_animal_to_shreds/",
        "text": "Hello, my name’s Kal. This is my first time posting here, so I’m a bit nervous. Also, excuse any spelling or grammatical errors, this is all being typed out on my phone.\n\n**TW: Mentions of an animal being torn apart (I don’t describe it, just the aftermath), and mentions of blood.**\n\nI’m not really sure if this would be considered a paranormal story per se, but nothing else really makes sense. Let me explain, my family would go camping every chance we got. The place we’d always go had no natural predators, at least, nothing bigger than a fox. My dad specifically chose this spot so us kids—me and my two siblings—could frolic through the woods without having to worry.\n\nThis particular trip was during the May long weekend. There was still a considerable amount of snow, so my dad brought our ATV’s and some sleds for us. It was the day after we had arrived, and my dad wanted to go on a little trip down the road we came up. I asked if I could come, and he said sure. We both hopped on his quad and set out on our little trip.\n\nI forgot to mention earlier that we had deer around the area. Nothing crazy, but the odd one would wander through our campsite. You could tell they had no natural predators, since they didn’t run away when there was a human around. My siblings and I would always manage to get pretty close to one, before my parents yelled at us to stay away, that is. \n\nAnyway, my dad and I were a few miles from the campsite when we rounded a corner, and came across one me of the most gruesome sights I have ever seen in my life. On the side of the road were the pieces of a deer, at least, I think it was one. There was blood absolutely everywhere, worst still, there was steam coming from the remains, which meant this was a recent kill.\n\nMy dad is usually a pretty calm guy, not much can rattle him. But I could tell that this freaked him the hell out. He was in the process of turning us around when this… I don’t know, screech came from the forest. It was so loud, we both flinched. I remember searching the forest for the source, but my dad was in the process of hauling ass down the way we came.\n\nIt could’ve been a trick of the light, or because I was freaked out and maybe I was seeing things. But, I could’ve sworn I saw something running alongside us, but only for a second or two. I know I sound absolutely crazy, but the thing looked like a large dog before it vanished into the trees. My dad raced back to camp and we were all packed up and headed to a different location by the end of the day.\n\nWe never did go back to that campsite after this encounter. I did ask my dad about it a couple years ago, he just said it was because the new campsite was better than the old—better trails and whatnot. I think he’s full of crap, I think whatever we encountered that day scared the hell out of him, and I think that whatever I saw, he did too. But I, for one, am thankful we never went back. I’m not sure if I would be able to sleep at night after what I saw. It still haunts me till this day.",
        "created_utc": 1672769255,
        "upvote_ratio": 1.0
    },
    {
        "title": "Saw a spirit in my backyard and called her cute.",
        "author": "drxcius",
        "url": "https://www.reddit.com/r/Paranormal/comments/102epml/saw_a_spirit_in_my_backyard_and_called_her_cute/",
        "text": "I was playing with my dog Henry until he ran over to our backyard because of a squirrel I went after him but while I was running out of the corner of my eye I saw some type of transparent ghost walking towards the forest next to our house I could tell it was a girl so I went ahead and yelled \"HEY YOUR CUTE\" and she didn't seem to react to what I said. I said that because I was curious.",
        "created_utc": 1672768876,
        "upvote_ratio": 1.0
    },
    {
        "title": "Haunting's of Olympia",
        "author": "Blackwolf3569",
        "url": "https://www.reddit.com/r/Paranormal/comments/102eby9/hauntings_of_olympia/",
        "text": "Hauntings of Olympia\n\n Thank You for your patience Part 4 of my haunting stories has finally arrived and i'm excited to share with you all this encounter some of my future parts will be of spooky locations i've been to or going to be in the new year   \n\n\nPart IIII: Before we could move into our new place in Rochester, my grandfather kicked out my mom and I. We were forced to move back to Olympia, into a duplex that I've been currently living in for a little over ten years now. When we first moved in, my family and I didn't think much about our surroundings or notice anything weird at the time so we started bringing what boxes we had left in our new rooms, but things started to change in the weeks to come. One day after school, my family and I came home to the odor of tobacco from an old pipe lingering in the air. (none of us smoke out of a pipe) Just then, we heard the sound of a grown man's cough, as if to clear his throat. My mom was convinced it was evil and bought some sage to clear it out. Roughly a few months after the tobacco man incident, while I was staying at a friend's place across town, (told to me by my mom and elder sister) my sister was alone in my house when she heard my kitchen cabinets slamming shut and opening.\n\n\n Confused as to what's going on, she came back inside to see my mom's dvd cabinet handles jiggling and kitchen cabinets and drawers opening with so much force that it could shake the house. Scared, she ran outside and stayed outside until me and mom got home. After a thorough inspection of the house and more sage, we came to the conclusion that we might not be alone. That night I slept out on the living room couch facing the kitchen back towards the sliding glass door. My fear was focused on the back door, for the thought of someone peeking thru and watching me. With my gaze locked on the kitchen to get my mind off of the back door, with my own eyes, I could see the cabinet door open very slowly as if it wanted me to see what it was doing. I brushed it off and went to sleep, tucked into the deepest part of the couch and covered my face. When finally all was quiet, I could hear what sounded like someone walking to me with heavy boots to the couch and whispered in a raspy timid voice “are you still awake?” It was not a voice I could recognize off the top of my head. As I kept quiet and still, hoping that whatever it was would go away, just then I felt a cold icey hand touch my arm. Jolted by the touch, I launched my head off the pillow and for the rest of the night I stayed up until the sun arose in the morning.\n\n\n About six months later, I left to Shelton to do some work for a family friend, which he paid me in trips to Walmart, Gamestop or in this case Goodwill where I found a old military foot locker that I just had to take home with me. When I brought it home, things went south fast. I was seeing shadow figures and objects would disappear and move as well as voices/whispers. It got so bad that i started having thoughts of hurting myself. After a final sage blessing, my thoughts disappeared, but the shadows haven't. Every now and then I see them peeking out at me or trying to talk to me in my dreams. Sometimes I tune them out and tell them to go, other times they sit there watching me waiting for me to sleep. I've invested in a SB7 Spirit box (a radio that sweeps through white noise for spirits to speak) and a Ouija Board posted up in my room as a decoration the Oricle is hidden away from the board and has never been used in this house nor ever will be out of fear of stirring up the previous spirits. \n\n\nWhen we heard of my grandfather's passing it was a dagger in my family's heart. Some of us never got to hear his stories. The energy sparked up a new wave of paranormal encounters for us. I used to smell his cologne walking through the hallway and see his shadow figure. As for my mom, she heard his voice and came to her in a dream almost as if to say sorry for everything he did wrong and to say he loves her. Sometimes, even through the whispers and the sound of footsteps at night, I can still sleep but it's hard when you can hear your name being called from right behind your head or in the darkest part of the house. I got my dog, a lab pit mix named Bella, in March of 2020 during COVID. Couldn't be socialized due to lockdowns but she protects me and her family like her life depends on it. But she's been seeing the spirits in the house since she was a puppy. She will randomly growl and stare at corners. By the time I get my camera, it's too late and whatever she tracked is gone.",
        "created_utc": 1672768013,
        "upvote_ratio": 1.0
    },
    {
        "title": "How Many Paranormal Encounters Have You Had?",
        "author": "N0body_In_P4rticular",
        "url": "https://www.reddit.com/r/Paranormal/comments/102eba7/how_many_paranormal_encounters_have_you_had/",
        "text": "Without counting or thinking too hard, I've had more than ten paranormal encounters.  \n\nI've seen more than one demon manifested in physical form, I've seen ghosts that I've photographed as a photo journalist and documentary photographer, I've had dealings with OUIJA that I won't really discuss with anyone because they resulted in death and I've witnessed various other phenomenon.  The one thing I haven't encountered is a physical face-to-face UFO up close and personal.\n\nHow many paranormal encounters have you had?",
        "created_utc": 1672767970,
        "upvote_ratio": 1.0
    },
    {
        "title": "How Many Paranormal Encounters Have You Had?",
        "author": "N0body_In_P4rticular",
        "url": "https://www.reddit.com/r/Paranormal/comments/102e5qb/how_many_paranormal_encounters_have_you_had/",
        "text": "[removed]",
        "created_utc": 1672767612,
        "upvote_ratio": 1.0
    },
    {
        "title": "part 3 of my childhood home! The story of my brother and the arrow!",
        "author": "Next_Winter7767",
        "url": "https://www.reddit.com/r/Paranormal/comments/102e3ak/part_3_of_my_childhood_home_the_story_of_my/",
        "text": "We lived in this house until I was 20, my brother was four years older then me. So this would be probably his sophomore year in high school. He came home late after some party drunk. The black figure w/red eyes literally visited us almost nightly. And I heard my brother yell, \"leave me alone Sam\" like 5 times. (Our rooms were at the very end of the new addition so we shared a wall) then I heard him fumbling around and then THUNK. That was also the night he came in my room and slept in my floor, he was pretty proud of himself until he had to explain the arrow to mom and apparently it pissed \"sam\" off bc he visited my brother alot more after that. Just stands in between the bed and they bdrm door, and you hear ur name repeatedly thru the CD player. All you could do really is say the Lord's Prayer or read Psalms (we all slept with a Bible under our pillows) and cover your head with a blanket bc we weren't gonna go by it or thru it to get out of the room. Sorry it's taking me so long to add additional stories but I want to fact check and gain my family's stories. And b4 anyone asks idk where we got the name Sam from we just decided to name it.",
        "created_utc": 1672767446,
        "upvote_ratio": 1.0
    },
    {
        "title": "Son saw weird figures after his grandma died",
        "author": "plm011",
        "url": "https://www.reddit.com/r/Paranormal/comments/102dpge/son_saw_weird_figures_after_his_grandma_died/",
        "text": "In July 2019 my sons grandma died, he was quite close to her and at the time lived with her with his mum. A day or two after she died, he had a dream where he was outside the house and his grandma appeared at the door, said something then went back inside, then a black figure with red eyes appeared at the door looking at him.\n\nFor 1.5-2 years after, my son who was 6 at the time, saw these exact figures in real life, standing behind trees, tops of stairs, even at school, he was adamant that he wasn’t making this up, and I believe he was seeing these things. My son is nearly 10 now and hasn’t seen them for a while now. \n\nA spirit of death? What do you think?\n\nHe did draw them for me but unfortunately I have lost it, they were tall, black, red eyes.",
        "created_utc": 1672766522,
        "upvote_ratio": 1.0
    },
    {
        "title": "My \"ghost flame\" story",
        "author": "utopiandiorama",
        "url": "https://www.reddit.com/r/Paranormal/comments/102dmgl/my_ghost_flame_story/",
        "text": "Hey everyone! Long time lurker, first time poster. I thought I'd share something that I witnessed when I was a teenager.\n\nMy family moved from Kansas to Tennessee in 2000. I made some friends at my new high school and we were all hanging out on Halloween. Someone told us about a local legend called the \"ghost flame\". A few of my new friends wanted to check it out and they invited me to go with them. I was skeptical but I went out of curiosity. \n\nThe legend goes like this: there's a haunted cemetery way out in the boondocks. If you park on the side of the gravel road at the entrance and turn off your headlights, you can see a ghost flame hovering over a grave. It sounded like someone was trying to pull a prank on me. \n\nOne of the guys borrowed his dad's car and we all drove out there. We parked at the entrance and cut off the headlights. We waited about 5 minutes and someone shouted \"Oh my god! Look!\" There it was, a tall flame hovering above a grave, just in front of the headstone. The driver of the car turned the headlights on and the flame instantly disappeared. He turned them off and it slowly came back.\n\nI couldn't believe what I was seeing, but the skeptic in me didn't want to be the butt of some practical joke, so I walked up to the cemetery to check it out. As I approached this flame, I could see that it was actually hovering about 6\" off the ground and it was a pretty tall flame, not short like a candle, more like a torch flame. As I got closer it began to dim until it went out just as I walked up to the grave. I thought surely someone set a torch of some kind on the ground. Nothing. I would have seen or heard someone running off into the woods. The graves were all too small to hide behind. The grave was a large granite slab so nothing could be buried in the ground. I could not come up with a logical explanation.\n\nThe other kids in the group were just as dumbfounded as I was. We weren't really terrified, we were more in awe and disbelief than anything. I've never seen anything so bizarre in my life. \n\nThat was so long ago, I was new to the area and I didn't know where I was so I don't remember where the cemetery was, but I think I have located it using Google earth and I have thought about going back one day with a video camera. \n\nSkeptical thoughts and similar encounters are welcome. If anyone here lives in Robertson County, TN and you've heard of this legend please DM me!",
        "created_utc": 1672766332,
        "upvote_ratio": 1.0
    },
    {
        "title": "Orb/Light/Shape",
        "author": "MavisSam",
        "url": "https://www.reddit.com/r/Paranormal/comments/102bm7g/orblightshape/",
        "text": "[removed]",
        "created_utc": 1672761488,
        "upvote_ratio": 1.0
    },
    {
        "title": "let me know what you think/suggestion",
        "author": "bevsnbags",
        "url": "https://www.reddit.com/r/Paranormal/comments/102bfwv/let_me_know_what_you_thinksuggestion/",
        "text": "[removed]",
        "created_utc": 1672761039,
        "upvote_ratio": 1.0
    },
    {
        "title": "Dead grandma calls delivery room",
        "author": "oslwaldohngman",
        "url": "https://www.reddit.com/r/Paranormal/comments/102beo9/dead_grandma_calls_delivery_room/",
        "text": "In 2018 my grandma died in May. 1 week prior to my daughter being born. I can’t remember if my daughter had been delivered yet but a nurse comes into the delivery room with a hospital phone and says my grandma just called. I put the phone to my ear and said hello but nobody answered. I then called my living grandma on my cell phone and asked if she called the hospital to talk to me. She said no. Has anyone had something like this happen? It confuses me and terrifies me to this day.",
        "created_utc": 1672760954,
        "upvote_ratio": 1.0
    },
    {
        "title": "Am I seeing things right?",
        "author": "Baum_Hund",
        "url": "https://www.reddit.com/r/Paranormal/comments/102b1la/am_i_seeing_things_right/",
        "text": "[removed]",
        "created_utc": 1672760024,
        "upvote_ratio": 1.0
    },
    {
        "title": "part 2 of my childhood in a haunted home",
        "author": "Next_Winter7767",
        "url": "https://www.reddit.com/r/Paranormal/comments/102au82/part_2_of_my_childhood_in_a_haunted_home/",
        "text": "So I've been talking to my mom and brother alot to gather more insight and mom told me something I have never heard. When I was 4 or 5 I used to sleep walk and she told me nothing creeped her out more. I would talk to someone in complete gibberish and went the same route every single time. And it always ended with her and my dad having to restrain me so I wouldn't leave the house. She said I would try to go outside to this old long barn ( triple the length of our house about a quarter mile behind our home, we always called it the chicken house). I was always so terrified of that barn I wouldn't even go into in during the day much less at night. So that was kinda terrifying. And apparently the one and only friend I ever had that actually lasted thru the night during a sleepover she actually came back (she would be the only one ever) we would carry on conversations in our sleep that nobody understood and we have no memory of them. Still gathering info from my family to verify and apparently learn more, so be patient!",
        "created_utc": 1672759493,
        "upvote_ratio": 1.0
    },
    {
        "title": "Paranormal story",
        "author": "Humble-Campaign-1015",
        "url": "https://www.reddit.com/r/Paranormal/comments/1029zrd/paranormal_story/",
        "text": "So one day I was having trouble falling asleep and I overheard a conversation about something that freaked him out when he was younger. So my father and his cousin were going to their uncle's house. They walk up the stairs to the front porch and knock on the door. Their uncle then opens the door and they start talking. The next thing they know a basketball comes bouncing down the hallway to the porch and continues to bounce up and down. The uncle seems totally calm like nothing is wrong and gestures to the invisible figure and tells it to go to the backyard and play with the ball, and no joke, the ball bounces back down the hallway and to the back of the house. My father and his cousin were taken aback by what they had witnessed and decided to go back home. While they were walking away, they looked toward the back of the house and saw the ball, still being dribbled and then being shot into the basketball hoop. So that's the story of something that happened to my father. NGL that ghost was Ballin though.",
        "created_utc": 1672757270,
        "upvote_ratio": 1.0
    },
    {
        "title": "Stuff has been weird, now the Cat is acting weird.",
        "author": "horsehockey64",
        "url": "https://www.reddit.com/r/Paranormal/comments/10298i6/stuff_has_been_weird_now_the_cat_is_acting_weird/",
        "text": "[removed]",
        "created_utc": 1672755186,
        "upvote_ratio": 1.0
    },
    {
        "title": "Unexplained encounters",
        "author": "wotawy",
        "url": "https://www.reddit.com/r/Paranormal/comments/1027xct/unexplained_encounters/",
        "text": "\n\nQuestion: How do we call this certain encounter?\n\nContext: \n\nI can see a glimpse of what's gonna happen in the future but it's random and involuntary.\n\n1st encounter:\n\nI was outside a certain store. Then I saw a lady walk inside the store and 2 minutes later, I saw the same lady enter the same store. (The store has only one entrance and exit. I didn't see her go outside the store and I saw her walk till the back part of the store)\n\n2nd encounter:\n\nI saw a taxi and a motorcycle pass by and few minutes  later, like one or two, I saw the same vehicles pass by again. (It's kinda impossible for them to make U-turn within those few minutes knowing it's a subdivision and why would they follow each other again.)\n\n\n3rd encounter:\n\nI saw a man riding a motorcycle with his gf pass by in front of me then few minutes later I saw the same motorcycle and people pass by again. (It was in a highway and I didn't see them make a U-turn)\n\n\nIdk if it's considered as a doppelganger experience since it also involves vehicles.",
        "created_utc": 1672751664,
        "upvote_ratio": 1.0
    },
    {
        "title": "I heard a exhale the day after my uncle died",
        "author": "TreeTime23",
        "url": "https://www.reddit.com/r/Paranormal/comments/1025062/i_heard_a_exhale_the_day_after_my_uncle_died/",
        "text": "So this was about 5 years ago, and it happened twice. The morning my uncle passed away, I heard the exhale before I was told he died. I had woken up at 7 am to get ready for school and I was just laying in bed trying to wake up and I heard it in my left ear. It was faint but I know what I heard. My mom then walked into my room and sat by my bed and told me he had passed away. The next day I was sleeping and I heard the exhale in my right ear so loud that it woke me up. I have no other explanation for this, my room is dead silent all the time.",
        "created_utc": 1672742993,
        "upvote_ratio": 1.0
    },
    {
        "title": "Do you have an anecdote that nobody believes?",
        "author": "2turo",
        "url": "https://www.reddit.com/r/Paranormal/comments/10241js/do_you_have_an_anecdote_that_nobody_believes/",
        "text": "[removed]",
        "created_utc": 1672739861,
        "upvote_ratio": 1.0
    },
    {
        "title": "Creepy abandoned house experience",
        "author": "Alternative_Bend_327",
        "url": "https://www.reddit.com/r/Paranormal/comments/1023o7r/creepy_abandoned_house_experience/",
        "text": "Second ever post and my only other paranormal experience (posted other one already).\n\nThis goes back several decades when I was a young boy.  I grew up in a small countryside town of a couple thousand people.  Back in those days there were several abandoned properties scattered on the edges of town.  I have not seen homes completely abandoned like that anywhere since those childhood times.\n\nAnyway, there was a large Victorian-style abandoned home on the outskirts, a short bike ride from my home.  I was about 9 years old.  I figure other kids had checked the place out sometimes since it had a full-on horror movie look, but I had never been inside yet.  A bunch of friends (about 6-7) decided to search it one day for something to do.  Everyone was trying to scare each other in a goofy way, but nobody was really scared.\n\nIt was well secured and boarded up, but we removed the boards from a basement window.  Glass was long gone but we took precautions on ledge with a blanket (entry was planned in advance). We all jumped down into the basement.  It was pitch black (oddly so dark, we thought, as it was daytime).  However we were prepared, each armed with a flashlight.  Everyone kind of fanned out to search all the basement rooms.  There were many as the home was huge.  \n\nI was alone in an empty room within earshot of the others…when my flashlight died. I had changed the batteries before we left.  Even though my friends were in adjacent rooms/halls with flashlights, I saw nothing - complete, perfect darkness.  I felt kind of sick.  I remained still, not moving or touching anything.  Then I started screaming for my friends.  It seemed to take them a bit to track my voice and find me (but it likely just felt that way).  We all decided to get out of the basement into the light of main level (my friends had found the stairs).\n\nWe went upstairs into the well-lit living room.  The house lived up to expectations.  Giant fireplace, huge regal stairs winding up to the second level, etc.  People we’re about to fan out again when a couple friends insisted on going straight upstairs immediately.  I felt kind of sick again.  As they started to climb the stairs, I looked down as I was going to grab the handrail.  \n\nI was shocked.  Both my hands were covered - COVERED - in blood! At first I wasn’t sure it was blood, just dirt or something.  But I licked my knuckle - it was definitely blood.  \n\nWhen, how, did this happen?  As I said, I had touched NOTHING!  Even entering the building, I had hopped through and not used my hands.  The weirder part was the blood was completely dry.  It was so dry it was flakey. Even if I cut them, how could it dry so fast? As I looked over both sides of both hands for any nicks or cuts - and finding none - I called my friends back.  \n\nEveryone was pretty sceptical and assumed I picked up something sharp.  However they must have been creeped out because I said I wanted to leave and they ALL left with me.\n\nSorry, no big scary ending.  That‘s it.  Never went back.  Have no backstory on the house.  It was demolished within a year to make way for new development.  Please feel free to add a better, made-up ending.\n\n(My Ouija board story was scarier with a better climax ending.  However I have told both stories as they happened without exaggeration.)",
        "created_utc": 1672738522,
        "upvote_ratio": 1.0
    },
    {
        "title": "Doppel ganger parent?",
        "author": "itchy_teethio",
        "url": "https://www.reddit.com/r/Paranormal/comments/10231a7/doppel_ganger_parent/",
        "text": "This is pretty short but when I was 5 or 6 I was laying down in my bed with my eyes open, school was in a couple hours when all of a sudden my mum comes into my room and leaves instantly. I was pretty spooked by this so I decided to watch my dvds until my mum came through to wake me up to just to see me watching megamind. I asked her why she went into my room earlier but she denied ever doing so. I got really scared and kept insisting she went into my room but she kept denying it so I crumbled and just agreed even though I saw her do it.",
        "created_utc": 1672736268,
        "upvote_ratio": 1.0
    },
    {
        "title": "Something’s different in my parents’ house",
        "author": "purplishisa",
        "url": "https://www.reddit.com/r/Paranormal/comments/1022dzp/somethings_different_in_my_parents_house/",
        "text": "There’s so much to unpack here that I’m not even sure if I will make myself clear but let me try.\n\nMy parents have lived in this same house for over 30 years, I lived here from ages 6 to 17, when I moved to another city for college. After that I graduated and started working there. I would come visit but just a couple times throughout the year.\n\nNow, about 10 years ago I had a near death experience. I almost drowned at the beach and I had sensory memories coming back right when I was about to drown. I could feel the memories as if I was inside them. The one I still remember very vividly is the warmth and smell of my mom’s lips when she kissed me on the nose when I was little.  She used to kiss me like that whenever we were cuddling, or when she left me/picked me up at school, etc.\nI also remembered the touch of my father’s warm hands whenever he touched my feet to wake me up. Or how my closest friends and I always hug each other so tight and for so long and it feels amazing… i felt all that and more.\n\nBut I also felt something changed in me, I started to feel “vibes” in people, I cut people off my life because I started to feel they were not honest, or good people, which turned out to be very accurate. \nIn a party I attended, I met some of my SIL’s relatives and one uncle in particular gave me a weird vibe, I couldn’t explain it, but something about him didn’t sit right with me. I only mentioned it to my mom but as I was trying to figure it out I told her, he gives me SA vibes, he does something to his children, I’m sure.\nCouple months later, my SIL told my mom that this uncle had had problems with the whole family and the siblings decided to take the kids away from him but didn’t press any charges. He had been molesting his own children since his wife left him.\nI also started feeling energies in places I had been before and places I had never been to, but I felt had something weird I couldn’t always explain.\n\nNow, a couple of months ago I moved back to my parents’ house because I bought a piece of land and I’m having my house built. But ever since I came back I keep seeing these shadows at night, passing by, peeking out the door, sometimes from the corner of my eye I get to see them… I had never seen them until now. They seemed curious about me since I have caught them watching me. I have also heard some noises but just tapping on the wall or my desk or the door… nothing else so far.",
        "created_utc": 1672733962,
        "upvote_ratio": 1.0
    },
    {
        "title": "Opinions on online psychic readings?",
        "author": "rook-and-rat",
        "url": "https://www.reddit.com/r/Paranormal/comments/1020gyo/opinions_on_online_psychic_readings/",
        "text": "[removed]",
        "created_utc": 1672727417,
        "upvote_ratio": 1.0
    },
    {
        "title": "voices outside my window",
        "author": "xXalexL07Xx",
        "url": "https://www.reddit.com/r/Paranormal/comments/101znki/voices_outside_my_window/",
        "text": "just tonight i’ve been hearing a little kid saying the same two “hello?” then “hellooooo” for about 30 mins, there’s no kid, nobody is outside, it is a veryyy distinct hello sound not something that could be mistaken for something else. there are cats in my complex that meow and hiss every so often but this sounds like a little girl saying the same two hellos every two minutes, any thoughts? (didn’t know where else to post)",
        "created_utc": 1672724815,
        "upvote_ratio": 1.0
    },
    {
        "title": "I’m concerned for my sister",
        "author": "TurkeyCapper",
        "url": "https://www.reddit.com/r/Paranormal/comments/101zdju/im_concerned_for_my_sister/",
        "text": "I just joined this subreddit bc I’m asking for advice on how to handle this situation. For a while now my sister has claimed her house was haunted hearing unexplained bangs that come from nowhere, faucets turning on by themselves, objects moving or falling, pets staring at nothing, the list goes on. I don’t really buy into the paranormal and I just kind of laughed it off.\n\nRecently tho, it’s begun to escalate. It started with sleep paralysis and her hearing voices. I could write that off as I too suffer from sleep paralysis and it’s a natural albeit creepy phenomenon. But then she started seeing full body apparitions that are see through, and the TV turning on while she is asleep. I don’t know if she’s going crazy or if there’s actually something paranormal going on but either way I’m worried about her safety. Part of me wants to go try and provoke it to prove there’s nothing there but she insist I don’t. Any advice on what I should do?\n\nShe did some research and yes a man did die in the house, likely from a OD, but sadly that’s not uncommon in her area.",
        "created_utc": 1672723949,
        "upvote_ratio": 1.0
    },
    {
        "title": "How can I tell if a doll is haunted ?",
        "author": "Glitcheye-chan",
        "url": "https://www.reddit.com/r/Paranormal/comments/101z6sy/how_can_i_tell_if_a_doll_is_haunted/",
        "text": "Hi I was wondering if anyone would happen to know how to tell if a doll is haunted .\n\n(Sorry for Grammer and punctuation in advance \n) \n\nFor a little back ground info I'm a 18 yr old female and I live eith my 80 yr old Grate grandmother, As you can probably tell from the title my Grate Grate grandmother (let's call her Nana for short) collect porcelain or glass dolls whatever you want to call them,  she picks them up at thrift stores everytike she goes just about the only thing she buys. As a result of this  she them linded up in old wicker laundry baskets and random places around the house .  One being the size of of a atheist 7 year old child she goes by the name Anastasia the rest don't really have names,Nana normally calls the others doll or some random name that she comes up with it changes every time....\n\nWell anyways since she's been collecting theses dolls iv be getting feelings of dred and sadness especially around the one called Anastasia  the feelings have gotten worse since my Nana had dropped her and broke her foot and hand while moving her to the dining room about 3 months ago . Since then when I leave my room at night and go past the living or dining room the feeling gas gotten worse , I asked my Nana if she had felt it and she said in good old fashion elderly talk I'm just imagined it and I need to pray to God she said the same thing when I told her I saw white hands follow me to the bathroom one-night (thats happend twice . What finally made me decide to post this is my cat was looking at my window and doing a low  growl while somthing was pecking at my window . Iv tried sage and salt but it only made stuff worse . \n\n\nSo if anyone can help me with this I would appreciate it . I love the supernatural and I have some more incounters from other family members I'll post later \n\nAnd I'll add a picture of the dolls in thr morning since it's night we're I live and I do wanna leave my room.   \n\n(Again sorry for Grammer I'm not very good at it )",
        "created_utc": 1672723380,
        "upvote_ratio": 1.0
    },
    {
        "title": "One of two encounters that have always bothered me",
        "author": "fluffiepigeon",
        "url": "https://www.reddit.com/r/Paranormal/comments/101xhzy/one_of_two_encounters_that_have_always_bothered_me/",
        "text": "Okay, so basically I was raised very strict Christian and have never really believed in ghosts, but I do believe in demonic entities or SOMETHING that is definitely evil. Now that I’m older, I’m still on the fence about believing in ghosts (as in things that are spirits of dead people roaming about that have no ill intent.) Even with this belief I still loved a good horror movie, and admitted that a lot of other peoples encounters were hard to explain if the paranormal entity in question seemed harmless. Remember this part, it’s important to the next story.\n\nWhen I was in high school I was best friends with a girl who was a little bit weird, and the definition of a pick me girl lol. We’ll call her Amanda. I would stay at Amanda’s house basically every weekend, and after we graduated I was there pretty much 24/7. Never once did I feel weird in her house.\n\nOne day, Amanda calls me basically in tears insisting someone has broken into her house, that she hears footsteps and banging and I told her I’d come over and check it out because I lived literally two minutes down the road. I show up, and the doors are all locked. I (being an idiot) jokingly start kicking in doors, yelling out, calling for any serial killers to come out. It made her laugh and feel better, and tbh it kind of made me feel better, too.\n\nWeeks pass, we forget about the situation and go on with our lives. Suddenly Amanda is telling me how her dad finally fixed the upstairs bathroom shower where her bedroom is, and that every time she uses that shower she feels like she’s being watched and the lights flicker and it creeps her out. I play it off as her just being spooked or trying to creep me out. Then one time her mom is talking to me and tells me she got spooked because the door to that bathroom got stuck and felt like someone was holding it shut. Again, I play it off as something that can be scientifically explained. Their house was split level, and her parents basically had the downstairs, and their kids had the upper level. There were two rooms that suddenly started bothering me, and it was the upper living room and laundry room downstairs. Every time I’d go upstairs I’d see a black figure in the corner of my eye, and every time I’d go to the laundry room it was eerily dark even with lights on, and freezing cold even in the middle of summer. It was weird. I just avoided those areas. I had read something about how sound vibrations can cause people to think they see something that’s not there (or something along those lines, point is it made me feel better), and the laundry room I figured was just because it had concrete flooring.\n\nOne night, I had come over after work and Amanda went downstairs to take a shower and I laid down on her bed with her door open and my back turned and I got this AWFUL feeling of being watched. And you know how sometimes you can almost “hear” when someone is sneaking up on you? Well I had that feeling. I immediately sat up and looked at the doorway, convinced it was her brother screwing with me or the dog had come upstairs, but there was nothing there. I couldn’t shake that feeling though. It felt like someone was literally walking in through the doorway and staring holes into me, and at any second something scary was going to happen. I sat there for probably 2 minutes just staring, debating if I should book it, pray, or scream lol. It felt like forever, but I hear Amanda coming out of the bathroom and immediately the feeling fades.\n\nI tell Amanda about this and when she hears it she kinda brushes it off and says that it’s her grandpas ghost and likes to mess with people in the house. I remind her of all the horrible things that had been happening lately and she tells me that her mom had bought sage and was going to sage the house to get rid of it, but had a dream where her dad came to her and said it was him just playing and decided she wouldn’t sage it. I’m creeped out at this point but decide it’s too late for me to drive home and just decide to sleep in bed with her.\n\nThat night I have awful nightmares. Like being chased in the dark, weird voices saying stuff I don’t understand, something wanting to kill me type nightmare. I wake up, tell myself I am just freaking out. From that day on, I kept getting them and they’d get worse. It wouldn’t be every night but it was often. One night I was sleeping at my boyfriends house and had a sleep paralysis type nightmare where something opened his bedroom door and crawled in on the ceiling (picture alien but with a human head, and long talons). I woke up halfway through unable to move and kept trying to call out for my boyfriend but instead fell back asleep and the dream picked up right where it left off at. I text Amanda’s mom, and she reaffirms there is nothing evil in her house, it’s her dad and he was just playing pranks on all of them.\n\nA few more weeks pass and I stop going to Amanda’s house, because 1) demons and 2) Amanda starts acting shady, she’s doing things that I don’t like, such as sleeping over at my exes house, sending me snapchats of them together, constantly talking of him, and just being a jerk. She also somehow figures out my new boyfriends Twitch account and is constantly watching him stream, trying to get him to talk to her, asking for his Snapchat, number, insta, etc. and at that point I lose my shit on her and cut all ties from her. “Coincidentally” the nightmares stop.\n\nSomeone please tell me I wasn’t just having some kind of psychotic snap? It was at a bad point in my life but the fact her family knew about it and thought it was a dead relative makes my skin crawl.",
        "created_utc": 1672718418,
        "upvote_ratio": 1.0
    },
    {
        "title": "2 knocks about a year ago.",
        "author": "Melodic-Highway3333",
        "url": "https://www.reddit.com/r/Paranormal/comments/101x4cj/2_knocks_about_a_year_ago/",
        "text": "So for context, I am spiritual. My entire family think I’m a nutcase but I genuinely believe in energy. Not so much “ghosts” but just energy around you. I believe you can attract and release bad and good etc. \n\nAnyway, my friends are also like this. We are all very close, very open with each other and have experienced ‘paranormal’ things in the past. Not so much together but on our own. \n\nSo we all met for the very first time on this day (we all work remotely for the same person) and the hotel room was number 22. This was my friends angel number. Most probably don’t believe in angel numbers and I believe them slightly but we didn’t think anything of this. When my friend (who’s number is 22) was in the bathroom, me and the other friend was just chatting in the bedroom. \n\nWe were the room at the end of the corridor in this hotel. It was a very long corridor, I’d say like 20 second walk at least like it was insane how far down it was 😂. Whilst we were chatting about where we were going to go and eat, we heard 2 very loud knocks on the door. I’m genuinely getting goose bumps as I write this because I feel sick. \n\nI was right by the door so I opened it thinking it was room service or a member of staff but it was fucking nobody. There was no one in the corridor either. The girl in the bathroom didn’t hear. It was just us 2. \n\nWhat does it mean? Before anyone tells me it was a neighbour, there wasn’t one.",
        "created_utc": 1672717337,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is even the point of this sub?",
        "author": "PrincessAlicex",
        "url": "https://www.reddit.com/r/Paranormal/comments/101wp10/what_is_even_the_point_of_this_sub/",
        "text": "The sub is supposed to be about \"true, first-hand paranormal experiences\" yet its **full of** **trolls,** who literally gaslight and spill hate on the OPs .\n\nThe **one time** I consulted this sub in need of actual advice, I got ridiculed and gaslighted by almost everyone except one user, despite my experience being nothing but the truth, and me needing **actual advice**. A day ago I saw a post about a guy who needed genuine help with another paranormal experience, and the same thing happened. **Everyone** was saying he had mental problems. Even my comment offering to help him got downvoted.\n\nSo I'm asking, what's the point of this sub if most of its users make fun of OPs, that are **genuinely** in need of advice on paranormal topics ??? It doesn't feel like a place named r/Paranormal, its just a place where trolls gather to ruin the mood of people who genuinely need advice. \n\nIs there a subreddit about paranormal experiences where those exact paranormal experiences **get taken seriously** ???",
        "created_utc": 1672716139,
        "upvote_ratio": 1.0
    },
    {
        "title": "how can I find a haunted object?",
        "author": "Federal-Fix-2235",
        "url": "https://www.reddit.com/r/Paranormal/comments/101wp07/how_can_i_find_a_haunted_object/",
        "text": "[removed]",
        "created_utc": 1672716138,
        "upvote_ratio": 1.0
    },
    {
        "title": "Help identify entity",
        "author": "iDarkin",
        "url": "https://www.reddit.com/r/Paranormal/comments/101wow4/help_identify_entity/",
        "text": "So when I was about 10 I had a nightmare that has stuck with me as realer than real life. In this dream I was in my house, it was as if reality itself was being shaken, and then I saw it, a giant floating purple and green head, with a gaze that you can feel through a wall.\n\nThis is the only entity I've ever taken seriously because I can't shake this absolutely uncanny feeling to the dream. So does anyone have any idea if there's any entities akin to this in history or am I just a pro at having fever dreams?",
        "created_utc": 1672716129,
        "upvote_ratio": 1.0
    },
    {
        "title": "An Uneasy Sigh and Whisper",
        "author": "acacia66",
        "url": "https://www.reddit.com/r/Paranormal/comments/101wc8g/an_uneasy_sigh_and_whisper/",
        "text": "Hello paranormal community! My boyfriend and I had an unnerving experience last night that I was hoping to get some insight on. It was around 1am and we were laying down to go to bed when we hear this long drawn out deep sigh that ended with a whisper that was either a word that had 3 syllables or 3 single syllable words. The sigh sounded wheezy and it crackled as if it was an older man who smoked a lot. I asked my boyfriend if that was him and he looked at me with his eyes a little worried and said no. As soon as he said no, my face got really hot and red and I felt like I was going to see an old man's face above my boyfriend. My bf said it was probably our dog and we both kinda dropped it but I felt as if something else was going to happen. After asking him again this morning, he said he knew it wasn't the dog but he didn't want our attention on it. Neither of us can remember what was said but we confirmed we both heard only 3 syllables. We've both had paranormal experiences in the past and I'm confident it wasn't my bf playing a joke on me. Does this sound like anything in particular to anyone? Any help would be greatly appreciated!",
        "created_utc": 1672715159,
        "upvote_ratio": 1.0
    },
    {
        "title": "weird coin incident? (and another really weird thing on the same day)",
        "author": "OmegaXZ",
        "url": "https://www.reddit.com/r/Paranormal/comments/101vppv/weird_coin_incident_and_another_really_weird/",
        "text": "[removed]",
        "created_utc": 1672713417,
        "upvote_ratio": 1.0
    },
    {
        "title": "I was pushed across my bed.",
        "author": "dhbxz",
        "url": "https://www.reddit.com/r/Paranormal/comments/101uoh0/i_was_pushed_across_my_bed/",
        "text": "A week ago,  I was asleep in the middle of my double bed on my right side with my cat cuddled with me. Suddenly I was pushed across the bed. My cat screamed and ran out of the room. My shirt moved up my back. I was shoved hard by a hand. I screamed. No one was there. The next day my hip was sore and bruised. I am scared to sleep in my room. I live with a relative as a caretaker, and they are disabled; it wasn't them. I can't figure out what happened.  I'm confused and scared. I am in my room typing this, wondering what is happening. My mind can't figure it out; it is beyond my comprehension. Someone tell me what to do. For the time being, I have a soft light on while I sleep. My native Alaskan friend said to cleanse with sage, salt, and holy water. But I don't know anything about that. I have also seen the black hat shadow person. I screamed a blood-curdling scream and shouted what do you want? Please leave me alone! It floated across my room and disappeared. It hasn't happened again, and that was a year ago.",
        "created_utc": 1672710636,
        "upvote_ratio": 1.0
    },
    {
        "title": "I'm making a, \"Monster's Guide\" of sorts",
        "author": "Ace22Spades",
        "url": "https://www.reddit.com/r/Paranormal/comments/101uddz/im_making_a_monsters_guide_of_sorts/",
        "text": "It's completely fictional. Idk where else to talk about it but it makes me so happy I just want to share. I have a notebook where I roughly sketch out creatures. Creatures that have already been discussed like dragons and such but others that are purely my creation. I adore it. Idk what I'm looking for out of this post, any commentary and suggestions are welcome. I'm just so happy about this new project",
        "created_utc": 1672709829,
        "upvote_ratio": 1.0
    },
    {
        "title": "Was Praying In My Sleep",
        "author": "ShowaTown",
        "url": "https://www.reddit.com/r/Paranormal/comments/101u7y6/was_praying_in_my_sleep/",
        "text": "One night I went to bed and I was at a low point in life and I prayed myself to sleep cause I was in agony and in the middle of the night I woke up to myself praying in a different language. I only speak English. When I realized I was doing it and fully woke up (this process happened in a second at most) It stopped. In that instant I knew my spirit was pleading to God, and that theres a part of us that never sleeps but always is awake.",
        "created_utc": 1672709431,
        "upvote_ratio": 1.0
    },
    {
        "title": "2nd post about this I need help",
        "author": "nwnwnwnwnwn",
        "url": "https://www.reddit.com/r/Paranormal/comments/101tk9j/2nd_post_about_this_i_need_help/",
        "text": "I know there’s something here my nan passed away a few days before Christmas there was a knock at the door that same night we opened it nobody was there .. \n\nLook at my other post please I need to know how to start my research, this is an old farm house",
        "created_utc": 1672707724,
        "upvote_ratio": 1.0
    },
    {
        "title": "I hear voices calling my name at night.",
        "author": "Black_Rose423",
        "url": "https://www.reddit.com/r/Paranormal/comments/101tdpg/i_hear_voices_calling_my_name_at_night/",
        "text": "Eve since I was little I've had some pretty weird and terrifying paranormal experiences. I would see and talk to things when I was a child and as I got older I didn't really see as much but heard things. The one thing that has been constant though is hearing my name being called. \n\nIt's always at night either when I'm alone or in bed. It differs between the voice of a young boy or girl or a man or a women. I don't know if it's just me or what but it's been happening  a lot here lately. I'll go to bed and almost as soon as I lay my head down I get this sense either something just walked into the room or somethings watching me and then I hear my name being called. \n\nSometimes I'll hear the voices and THEN  get the feeling somethings watching me. I've seen other people saying they're having the same problem. I was always told if you heard something calling your name to ignore it but sometimes it's hard when im freaking out and trying to go to sleep.",
        "created_utc": 1672707262,
        "upvote_ratio": 1.0
    },
    {
        "title": "I pulled in cemetery flowers, did not expect what happened next",
        "author": "moopski8",
        "url": "https://www.reddit.com/r/Paranormal/comments/101szm8/i_pulled_in_cemetery_flowers_did_not_expect_what/",
        "text": "I forgot I had this experience for a long time but was reminded by it recently. I remember I was about 9 years old and it was my first time going to a funeral. I sort of wondered off from where the group was and went to someone’s gravestone and remember seeing the picture of a person and flowers with small peace offerings. I didn’t know it was disrespectful to take flowers from a person’s gravestone and it wasn’t explained to me either. So I reached down to grab a daisy that had grown over this person’s grave and I pulled on the stem of this flower, I found that there was some sort of resistance in doing so. I pulled even stronger and to my surprise that daisy slipped out of my hands and went into the dirt, as if someone had been pulling on them from underneath. I was so confused by this that I put my hand over where this daisy had just been moments ago. Needless to say it left an impression on me so I never was disrespectful at a cemetery ever again.",
        "created_utc": 1672706230,
        "upvote_ratio": 1.0
    },
    {
        "title": "Somethings In my house",
        "author": "nwnwnwnwnwn",
        "url": "https://www.reddit.com/r/Paranormal/comments/101sjn5/somethings_in_my_house/",
        "text": "This is a true story \n\nI moved in my grandmothers house because she was ill the house is an old farm house surrounded by feild , her family had owned this house since the 1900s many people have passed here.\n\nI often see shadows out the corner of my eye and noises when home alone or at night the doors open in there own and my things move and pictures are often blurry I have found some things here before that give me weird vibes most of the time I write it off but lately I can’t I’m going to research the house and it’s history but somethings not right.\n\nSince she passed away there’s been knocks on doors late at night etc to the pont the dog barks and we answer the door I’m not sure what to think. \n\nThe dog avoids certain areas of the house or begins crying at nothing. \n\nI need help on what to do does anyone know?",
        "created_utc": 1672705122,
        "upvote_ratio": 1.0
    },
    {
        "title": "Extractor hood playing classical music",
        "author": "stine_dk",
        "url": "https://www.reddit.com/r/Paranormal/comments/101si59/extractor_hood_playing_classical_music/",
        "text": "When I was about 12 years old (28 now) we had family dinner with some friends at our home. Suddenly I hear faint classic violin music (only instrumental) and I ask for us to be quiet and see if everyone can hear this. We are quiet for some time and everyone hears it.\n\nDinner completely stops and we want to figure out where the music comes from. We go to the kitchen and without a doubt, the music comes from the extractor hood which was turned off and even closer it sounds like it’s in it. Nothing to hear outside the house.\n\nI didn’t notice when it ended because eventually we continued to dine and talk about how crazy this is. It never happened again. I think about it often because it was just so strange and I am happy we were a handful of people to witness it. Did anyone experience anything similar?",
        "created_utc": 1672705016,
        "upvote_ratio": 1.0
    },
    {
        "title": "Who here does ITC spirit boxes?",
        "author": "Flickedbic",
        "url": "https://www.reddit.com/r/Paranormal/comments/101shbr/who_here_does_itc_spirit_boxes/",
        "text": "[removed]",
        "created_utc": 1672704961,
        "upvote_ratio": 1.0
    },
    {
        "title": "The glass fell out a display cabinet and it didn’t break",
        "author": "Cacti_System",
        "url": "https://www.reddit.com/r/Paranormal/comments/101oq3f/the_glass_fell_out_a_display_cabinet_and_it_didnt/",
        "text": "This happened a couple years ago. I grew up in this house (built after WW2 in Germany) and ever since I was a child the floor I live on has been strange. \n\nIt is an older house, I am aware and I know that older houses do make certain noises. But this was not only a noise, it was visible to me, my best friend and my mother. \n\nSo this happened one evening. It was late, around 9 pm. My mom was upstairs in her bedroom (2nd floor) and me and my friend were up and talking in my room (1st floor), our dog was downstairs (ground floor). My father was on vacation in a different state. \n\nSo we sat and talked, while my dog slept and my mother watched TV. Then the loudest crash happened. My friend and I were startled. We looked at each other than the door to the hallway. My mother was loudly asking what had happened and if we were okay. We answered that we were okay, but did not know what had caused this sound. My mother came down and we started looking around. Checked the ground floor and basement. Dog was sleep, all doors and windows intact and closed. My mother did know that nothing had happened on her floor, since it’s pretty much just one room. That left the 1st floor. \n\nObviously nothing had happened in my room, so it could have been in the bathroom or office. Checked the bathroom, maybe a bottle or something fell over. Would probably not be as loud, but who knows. Nothing. Everything was in place. So we all went to the office and turned on the light, which took a second to become bright enough to see. And there it was. The glass from the display cabinet. How did it not break? How did it get out of the cabinet? \n\nSo for you to understand: \nMy father has four display cabinets mounted to the wall in the office. (He keeps trains in there) So there are two rows of cabinets, two cabinets in each row and each cabinet has two sliding glass doors. Underneath the cabinets was a wall mounted shelf (wooden) and underneath the shelf stood a side table (also wooden). The glass doors were secured by slots in the wood and originally were pushed into those form the side. \n\nThis glass door was now laying on the wooden floor in one piece. It definitely must have hit the shelf and table. So even if the wood from the cabinets moved (which wood sometimes does) it should have broken. Seeing this was horrifying. We all were frozen. We called my father (woke him up) and told him. He didn’t believe any of us. So we let the glass lay there until he got back. Needless to say my best friend and I didn’t get much sleep that night.",
        "created_utc": 1672695946,
        "upvote_ratio": 1.0
    },
    {
        "title": "Owl or large winged creature swooping car",
        "author": "RoogDoog",
        "url": "https://www.reddit.com/r/Paranormal/comments/101ono6/owl_or_large_winged_creature_swooping_car/",
        "text": "Around 10-15 years ago me and a friend were driving down river road when some winged creature swooped the hood of my car surrounding and blocking both the windshield and wrapping around to the passenger and driver side windows and then disappeared.\n\n(I can provide more information about the location if someone has a similar experience). \n\nAs we're driving I'm telling her this story about this sleep paralysis demon I saw in a dream. It looks like a winged demon made of molten stone with red eyes, trapped behind a stone prison that it escapes and chases me.\n\n It's dark out, maybe 9-10pm, and as I'm telling this story as we drive under a large willow tree and something drops out of the sky (or tree) and swoops the hood of my car filling my entire windshield, wrapping around to my side windows with wings. My friend screams and I stop the car. I remember it now as an owl with feathery wings but part of me remembers red eyes, black fleshy wings and a human face, but I'm not sure if that's just because of what images were all ready running around in my head when it happened as I was telling the story.\n\nThere are owls where we were so I was wondering if maybe that's something owls do, swoop headlights or something, but there are no owls that would be large enough to explain what I saw, just barn owls and I've seen them before. I thought I'd ask around if anyone else had ever experienced something like this as it's always bothered me and my friend is sick of me asking her what she remembers, she just says it was weird and she was too scared and closed her eyes. \n\nHas anyone else had an owl or large bird swoop their car hood? Is there a cryptid matching this description or something that swoops cars? Anything would help. I'm willing to provide more information if it helps. Thanks.",
        "created_utc": 1672695789,
        "upvote_ratio": 1.0
    },
    {
        "title": "Closet Lights motion activated",
        "author": "HauntedTree7686",
        "url": "https://www.reddit.com/r/Paranormal/comments/101o571/closet_lights_motion_activated/",
        "text": "Anyone had issues with Motion Activated closet lights? There’s no switch to them and I’ve read that their sensors are pretty sensitive but it always seems like they click on in the middle of the night….. is it just my imagination or is something like the heat pump or WiFi causing this? It’s also in multiple rooms not just one specific closet",
        "created_utc": 1672694603,
        "upvote_ratio": 1.0
    },
    {
        "title": "someone brought a ouija board into my new home, and now weird things keep happening.",
        "author": "Pissed_Misanthopist",
        "url": "https://www.reddit.com/r/Paranormal/comments/101nkiu/someone_brought_a_ouija_board_into_my_new_home/",
        "text": "[removed]",
        "created_utc": 1672693273,
        "upvote_ratio": 1.0
    },
    {
        "title": "Sharing some of my childhood stories of the severely haunted house I grew up in.",
        "author": "Next_Winter7767",
        "url": "https://www.reddit.com/r/Paranormal/comments/101ltcl/sharing_some_of_my_childhood_stories_of_the/",
        "text": "I really don't know where to really start, so I decided the beginning is always good lol. My childhood home was built over the old homestead of my great grandparents, and we eventually added onto the home w/ a L shaped addition and that's when things started. Our 2 dogs refused to go into the addition (which happened to be mine and my 2 siblings bdrms) they would bite you hair would stand up on their backs if you even tried to carry them back there. A black figure red eyes would be seen repeatedly, my older brother put a arrow thru the wall trying to shoot the figure. Our cd players were thrown away bc of the deep voice that would talk to you thru it at night BY NAME. My brother would wake me and tell me half asleep the \"red eye thing\" wouldn't let him sleep so he slept in my floor. My entire childhood my dad would sleep on the couch until everyone was home bc he swears something would sit down on the bed and then lay down beside him. The dryer would turn on repeatedly even if u unplugged it. Cooking in the kitchen you would get bruises on the top of ur feet like s/o was stepping on them. This is just a generic run thru of some of our experiences in the home, if anyone would like more in depth posts just lemme know! Sorry I'm shit at telling our story but will def try to do better, not gonna lie just thinking some of the experiences makes me realize exactly how crazy it was to actually live it even tho it seemed \"normal\" to us back then.",
        "created_utc": 1672689168,
        "upvote_ratio": 1.0
    },
    {
        "title": "Ghosts are people, some are missing and some are grandma.",
        "author": "Friendly-Condition24",
        "url": "https://www.reddit.com/r/Paranormal/comments/101jvfw/ghosts_are_people_some_are_missing_and_some_are/",
        "text": "So on new years, I decided to finally try out a ghost app which I knew worked. So I did and eventually I spoke to someone named Reece, that's about all I know about him because I turned it off because all I could hear was \"moan\" \"moan\" \"fuck my ass\" \"moan\". And I heard a reoccurring \"shart\" and some other stupid things like that. After I ate because my dad told me to get the winning lotto numbers, I did. I turned it on pen and paper ready and after failed attemps, I gave up because I heard \"I'm trapped here\" so I listen more and I believe it was Beryl Collins(I felt something touch my shoulder when I wrote about her). A missing woman in Australia who has been missing since march 2022 from what I heard, they are stuck in in/on the roof near a truck. I was told to follow them so they could show me but FUCK that. (I live in a workshop office so there is no particular car I have in mind and I don't want to go around this giant ass place looking for where a corpse is) they said they're stuck in the shed(workshop) and  they're trapped so I tried getting information but no. Eventually I did hear the name Beryl then I saw the person on the missing persons website. Eventually while talking to her it was clear some other ghosts chimed in, and then I heard \"rec og nise\" so I said \"am I suppose to recognise you\" \"yes\" \"nana\" I was shocked. She kept calling me my nickname, not the one she used with me but the one everyone else uses. (It's pretty much just silliness now) She told me where she was standing and someone said something about it being my birthday and telling me to jump. \"Do I have to jump because it's my birthday\" \"yes\" \"it's not my birthday my birthdays in ________ it's new years\" at some point the ghosts were reading things on my book, at first it was names that I was writing down to find out who's trapped here using the missing persons app, none of the names were beryl but one of them was the name of the guy that owns this place. They didn't say no to that name. I asked about it for 10 minutes. They never said no. Wtf did the owner do? Then I think they were reading pizza ingredients from the top of the book because they started listing food like chicken \"are you guys listing foods you like\" \"yes\" someone said something about fish \"do you like fish\" \"no\" then I heard something about prisoner(I realised while writing this the person stuck in the shed was maybe the prisoner) and all through the conversations the person was still asking for help \"I cant help you, you're a ghost, I can't do amything\" and stuff like that to try explain. Someone commented on the office calling it a mess and that it smells. Thanks. I heard the name eddie and Nana kept repeating my name, I guess trying to get my attention. I know that it was Nana because I asked who was saying my name and someone else said it was grandma. I asked how many people were in the room and was told 8. It was 10pm when my Nana started telling me to go to sleep \"go to sleep\" \"I don't want to\" \"you should\" and another ghost chimed in saying \"dont\" and I would still doubt it was Nana if this didn't happen: Nana kept yelling at me to sleep and I stopped responding and sometimes I tried to explain I couldn't if I wanted to because dad was watching TV and I can't sleep with TV. She called me stubborn and said \"bullshit\"(this sold it) eventually I listened at 10:40? I said bye and went to bed but was up until 4/5am. All night I felt Nana's glare at me as I laid there on my phone and at 3am I thought I'd turn it back on and I was thinking Nana would yell at me to go to sleep some more so it was VERY unsettling when I heard my name slowly being said, then I heard \"get him out of here\" it's less scary thinking about it because it was likely a pissed of Nana and an unwelcome person. There's not much else except the dog kept laying her head on me (not normal she never does that) and staring at one spot occasionally looking at me. This is why I could feel Nana's glare because the dog was staring at the wall that has I tiny space between it and the bed, therefore she was staring at Nana in my mind. When she stared at a different spot and the dog kept getting up to look out the glass door but I think she just had to pee because dad let her out and she stopped after coming in.\n\nIMPORTANT:\nI have no idea on what to do about the missing persons situation and I thought about making a report but why would the police care about a ghost talk, please help me I don't know what to do, that poor person is desperate for help so I really want to but don't know how.",
        "created_utc": 1672684526,
        "upvote_ratio": 1.0
    },
    {
        "title": "What was that thing?",
        "author": "looper-oregan",
        "url": "https://www.reddit.com/r/Paranormal/comments/101jqx1/what_was_that_thing/",
        "text": "in 2018 I was a scout in a city in Brazil (specifically in Santa Catarina), I was hiking with my group when we stopped in the woods to rest a little. me and a friend of mine went hunting for some things, pets or anything interesting together with a girl. we were walking until i saw a spur very far away from where we were, it was a tall and kinda strange thing. I was fascinated by creepypasta back then, so I suspected it was slenderman. i ran along with my friend and the girl. before that something similar happened when I was little. my mother told me that she had seen a tall being beside me. To this day, I don't know if these cases are connected. Does anyone know what these things were? I don't think that's a slenderman.",
        "created_utc": 1672684225,
        "upvote_ratio": 1.0
    },
    {
        "title": "Dead people and grey eyes",
        "author": "DaleksPlanet",
        "url": "https://www.reddit.com/r/Paranormal/comments/101jn2c/dead_people_and_grey_eyes/",
        "text": "So, it's first time I'm posting here but reading some stories reminded me dreams and encounters I had. \n\nFirst, i have an uncle who died in 2018, he became alcoholic because his son died in 2007, he was a nice man who truly loved my cousin. After he died i had a few dreams with him, in all those dreams he looks like a zombie, cynical smile and grey lost eyes with dilated pupils, in real life he had brown eyes and almost always depressed.. anyways, in my dreams he's always staring at me but I feel like he has no soul, it's an empty body.\n\nWhat's it's interesting it's the i saw 2 people with these same empty grey eyes and dilated pupils in real life after he died and they looked at me exactly how my uncle. \n\n1 was a lady, we're walking in opposite directions and I noticed her eyes when we're very close, she looked angry. \n\n2 was a high school boy, he was standing in front of the school surrounded by other students but he was alone. He looked at me like he was sad but curious. \n\nWhat do you think of this? I haven't had any dreams with my uncle for a while now and besides those people, i never saw someone with those dead eyes.",
        "created_utc": 1672683963,
        "upvote_ratio": 1.0
    },
    {
        "title": "Mi Esposa y mi cuñada ven al fantasma de un conocido",
        "author": "luizmeza",
        "url": "https://www.reddit.com/r/Paranormal/comments/101iiyf/mi_esposa_y_mi_cuñada_ven_al_fantasma_de_un/",
        "text": "Hola es mi primera publicación, este es el caso:\n\nHace unos meses falleció un amigo de la familia de mis suegros, y tiempo después mi esposa y mi cuñada lo han visto en las noches en la casa y curiosamente nos despertamos casi todos los días entre 3 y 4 que es cuando suelen verlo o sentir su presencia.\n\nA mí no me a tocado verlo o sentirlo, pero si me he llegado a despertar en horas que mi cuñada o mi esposa lo han visto.\n\nParece que está enojado con la familia de mi esposa por alguna razón, habrá algo que se pueda hacer para ya no se aparezca y las dejé en paz? A mí no me ha hecho nada, pero a ellas hay noches en que nos las deja dormir.\n\nAgradecería cualquier recomendación, muchas gracias y saludos",
        "created_utc": 1672681336,
        "upvote_ratio": 1.0
    },
    {
        "title": "my face wash just called me dad",
        "author": "Accomplished_Pie4671",
        "url": "https://www.reddit.com/r/Paranormal/comments/101iahq/my_face_wash_just_called_me_dad/",
        "text": "i was drying my body after showering and my face wash said “dad” in kind of a squeaky deepish voice. i’m either tripping hard or my face wash thinks i’m the father",
        "created_utc": 1672680763,
        "upvote_ratio": 1.0
    },
    {
        "title": "My guardian angel",
        "author": "Mustard-cutt-r",
        "url": "https://www.reddit.com/r/Paranormal/comments/101hqxa/my_guardian_angel/",
        "text": "When I was about 16yo, I was driving home from my job on the highway. It was about 3:30pm and I was sooo tired from not enough sleep. At that time I didn’t wear a seatbelt because it felt too restrictive and the barebones manual vehicle didn’t have a beeping safety belt signal. Nor airbags. \n\nAs I’m driving, voice in my ear/head, clear as day, said “Put on your seatbelt.” So I did. \n\nAs I’m driving down the highway, I see some traffic ahead, but I got distracted by a car entering the highway and veering across the lanes. Because of my distraction and sleepiness, I drove straight into the stopped car ahead of me at 40mph. The impact caused my body (and everything in the car) to fly right out of my seat. My belt engaged about 3-5 inches after lift, saving my life. The impact caused me whiplash and my knee hit the underside of the driving panel. The car I was driving was smash Med in the front. \n\nI ended up at the hospital, but I was fine and so was the other driver.\n\nThat was one of the many times my guardian angel intervened to save my life down here.",
        "created_utc": 1672679470,
        "upvote_ratio": 1.0
    },
    {
        "title": "A former friends ghost",
        "author": "Able_Macaroon2347",
        "url": "https://www.reddit.com/r/Paranormal/comments/101h50u/a_former_friends_ghost/",
        "text": "I use to work at a big box retail store so I’ve had a few work friends that worked there. One day my mother and I went to the store and saw one of my work friends seeming confused and out of sorts so we stopped to talk to her. One of the questions was what was going on with an rv that was outside. She seemed to know things that she previously had no knowledge of we didn’t think anything of it besides people giving us weird looks as they passed by. Well at one point in our conversation her daughter Jenny came walking into Walmart looking upset and crying. When we saw her we asked what happened of which her mom said she had to go and walked off very quickly. Well her daughter walked into the back room so we sat and waited for her to come out to ask if she was ok. Jenny ended up telling us that she was coming in to talk with her mom’s employer to tell them that her mom passed away earlier that day from an aneurysm. We asked if it was some type of joke because we were just talking to her before she had to go because Jenny walked into the store, of which Jenny told us we weren’t talking to her mom we were talking to a shelf. Well it was safe to say my mother and I went home confused and kept an eye on the obituary part of the newspaper and we intact did see that my friend did pass away. (Sorry about spelling and grammar errors.)",
        "created_utc": 1672677973,
        "upvote_ratio": 1.0
    },
    {
        "title": "Ghostly little girl",
        "author": "Ken1l",
        "url": "https://www.reddit.com/r/Paranormal/comments/101goug/ghostly_little_girl/",
        "text": "[removed]",
        "created_utc": 1672676870,
        "upvote_ratio": 1.0
    },
    {
        "title": "My first major paranormal experience in forever",
        "author": "Sinfulwastaken",
        "url": "https://www.reddit.com/r/Paranormal/comments/101ffmm/my_first_major_paranormal_experience_in_forever/",
        "text": "I work at belk on the dock. Today i had the standard 7-2. I was scheduled alone today and had to do house keeping before the store opened. I was walking down to the back to go to the dock and grab some cleaning supplies when i heard a few hangers rattle and i turned my head and saw what looked to be a person behind a tree rack. Bobbing around like someone was looking for something. I just figured it was a fulfillment or merchandiser working so i ignored it and grabbed my cleaning supplies and cleaned the mens bathroom. When i went to the womens first i always get their tampon boxes. I started at the first stall to the right and right as i grabbed the bag i heard the back stall toilet flush. I froze for a second and then ran out. I peeked my head back in and yelled “Hello?!” With no response. I gathered myself and turned my phone camera on and walked in. Peeked under the stalls with the camera. No feet. No people. I was alone. I walked to the office to talk to my boss when i saw my hr and a fullfilment worker just walking in… and my boss was in the office.. there was no one in the store walking around or in the bathroom. Later after i started having this weird pressure feeling on my head so i took some meds but it didnt help. Ended up walking out and smoking a cigarette and chilling for a second and it went away. I have chills just thinking about this right now.",
        "created_utc": 1672673676,
        "upvote_ratio": 1.0
    },
    {
        "title": "witchcraft and the paranormal",
        "author": "kartersos",
        "url": "https://www.reddit.com/r/Paranormal/comments/101eze1/witchcraft_and_the_paranormal/",
        "text": "what’s the general consensus on witchcraft in this server? \n\na lot of the times i see people asking on how to communicate with spirits, why not ask a professional? not to mention some of the signs i’ve seen posted look more like a deity or a kind spirit more than anything evil. \n\ni use tarot to connect to spirits all the time and do cleansing rituals. before this, living in haunted house was pretty common to me. i moved around a lot and now 3 homes since i’ve started and not a single uninvited paranormal occurrence. \n\njust looking for opinions!",
        "created_utc": 1672672539,
        "upvote_ratio": 1.0
    },
    {
        "title": "Asking the date and time in dreams",
        "author": "Rosiepr",
        "url": "https://www.reddit.com/r/Paranormal/comments/101exdv/asking_the_date_and_time_in_dreams/",
        "text": "I've been seeing a lot of Tik Toks about people doing this.  I'm a terrible dreamer. I only remember 10 seconds of the dream if I wake up and then it's gone. I can't control my dreams at all but I find it fascinating that people who have vivid dreams and can control their dreams have done this and the people in their dreams get very angry over it.  I'm just curious if others have tried this and what happened.",
        "created_utc": 1672672402,
        "upvote_ratio": 1.0
    },
    {
        "title": "Need this to be explained by skeptics",
        "author": "silver_andblack",
        "url": "https://www.reddit.com/r/Paranormal/comments/101erik/need_this_to_be_explained_by_skeptics/",
        "text": "So I wouldn't say I'm a believer nor would I say I'm a skeptic either. I'd say there's plenty of things science has yet to prove/disprove, and whether or not there are 'other beings' beyond what we can see are real. \n\nAnd I've had plenty of weird experience happen along the way that I can easily explain rationally. Half asleep and felt hands caressing my face? Oh probably some form of sleep paralysis. Creepy feeling like something has been watching me? It's a common feeling that anyone would feel if they've been alone a lot. Figure at the foot of the bed? Again, sleep paralysis or maybe something my mind just conjured from lack of sleep. But, I can't seem to find a rational explanation for this particular experience that happened years ago at my parents' place. \n\nSo just for context, my parents live in a pretty big house (lots of empty rooms) and I've always felt a little off whenever I visit, but I've usually ignored the feeling (again, the uneasiness was probably due to the fact that the house is large and has a lot of empty spaces). As a teenager and young adult before I moved out, I usually conduct my studying/work in the guest dining room - a little more private and quiet than my own room (parents' room right next to mine and their TV would often be loud). It has a large wooden dining table - the sort with heavy glass on top, and can fit around 10 people around it. \n\nSo this happened a few years in the middle of the night. I was in this dining room. The air-conditioning was on, I had a jug of water next to me. My laptop was on. My partner called me and I left the room to speak with him. I switched off the air-conditioning. But when I returned not longer than 30 minutes later, sat on my chair and rested my elbows on the glass of the table to get back to work. But then the glass starts sliding. And before I knew it a gush of water splashed on top of my lap. I jolted and removed my things to see that the entire table was filled with water in between the glass and table. I looked at my jug of water - there's still the same level of water there. Needless to say, I was freaked out (more worried about my laptop and anything electronic related there). I removed my things and went to get my parents. \n\nIt took all three of us to remove the heavy glass and took some time to remove all the water. My parents, for some reason, thought I had somehow placed the water there, and were upset it happened (because of course the table was expensive). \n\nIt wasn't until later in the day that this event came back to me and goosebumps appeared all over my arms thinking about it. How. On. Earth. Did. That. Much. Water. Get. There?!? So I tried my hardest to find an explanation, and here's some that I came up with: \n\nA. Condensation. Perhaps switching off the air-conditioning helped create the right environment to cause enough condensation that water overflowed underneath. But not only is this implausible but never has this ever happened before or after the incident. \nB. I had a psychotic breakdown which led to me splashing water there with the jug of water I had. But again, the water was still in the jug and I was (am) a pretty physically weak person so there's no way I'd have removed the glass to be able to splash water onto it. Keep in mind, the water was all over the table, not in one corner. \nC. My parents did it when I was away. But like, why??? \nD. The water was already there and built up over time from condensation. But then I'd notice it before. I was in the dining room for hours before this incident. No way I wouldn't have noticed this. \n\nNo matter how I try to rationalise this incident with myself, I couldn't find an explanation. Everyone I've told this to has said this is probably something paranormal. I've had other experiences in my parents' home but again, all I could explain except for this. \n\nAll the years later, I've never had the same experience happen again. And I use that dining room to this day. Since everyone I've spoken to has said this is paranormal, would like to hear your thoughts, but especially the skeptics who might be able to give a rational explanation to this. Thanks in advance!",
        "created_utc": 1672671974,
        "upvote_ratio": 1.0
    },
    {
        "title": "I see things when I wake up in the middle of the night - Blue Orb",
        "author": "velvetvixen7",
        "url": "https://www.reddit.com/r/Paranormal/comments/101e7bw/i_see_things_when_i_wake_up_in_the_middle_of_the/",
        "text": "I’ve had a couple weird for instances where a man was in my room (no bad/scary energy related), I started my “spiritual awakening” last March but as of late I been seeing somethings. Last night I woke up and a floating kinda fuzzy looking blue orb was floating towards me over my bed, it was as soon as I woke up and I got scared so I hopped out of bed but it was gone. I’m not sure what this means but hopefully something good??",
        "created_utc": 1672670527,
        "upvote_ratio": 1.0
    },
    {
        "title": "Astral Projection Music",
        "author": "mmsdiscard",
        "url": "https://www.reddit.com/r/Paranormal/comments/101cn3s/astral_projection_music/",
        "text": "Does anyone know about astral plane music?\nWhen I was a teenager I was experimenting with astral traveling. It didn’t go well, I experienced something pull me backwards through my bedroom window, through a bush, and down the street. I remember some of the neighborhood houses around me sounding alive with music. Discordant haunting inhuman music. Horns that were more akin to an elephant stampede. A whole orchestra of stringed instruments playing a strange and threatening melody.\n\nI’m not quite sure I even successfully separated or if it was just a very highly detailed dream. After this it freaked me out so much that I never tried again.",
        "created_utc": 1672666149,
        "upvote_ratio": 1.0
    },
    {
        "title": "Will one culture's exorcism techniques work for another?",
        "author": "Snipsnapboi",
        "url": "https://www.reddit.com/r/Paranormal/comments/101bi0t/will_one_cultures_exorcism_techniques_work_for/",
        "text": "This has plagued me for quite some time now. Since every religion and region believes they're the one and only right one, so what happens when an Indian exorcist tries to exorcise let's say a Christian ghost or something similar?\n\nDoes that work? Assuming we believe ghosts are real.",
        "created_utc": 1672662638,
        "upvote_ratio": 1.0
    },
    {
        "title": "Dark shadow figure with white eyes",
        "author": "soyazu",
        "url": "https://www.reddit.com/r/Paranormal/comments/101b1ax/dark_shadow_figure_with_white_eyes/",
        "text": "This never happened before. I like to stay up late, usually until 3 am. (Idk if this has to do something with the figure but just minutes before the figure appeared I heard high pitched whistles that sounded like a wind but weren’t, they were much higher and there was no wind outside). I turned off the flashlight on my phone and tried to fall asleep. I couldn’t so I opened my eyes wanting to start scrolling on my phone again and the I’ve seen it. It was a dark shadow figure, taller then a human with white dots that were meant to be eyes. I immediately took my phone and turned on the flashlight. It disappeared. After a half an hour I decided to try to go to sleep again. I slept for a few minutes and then when I opened my eyes again I’ve seen the figure. It was closer to me than before and it was moving towards me. This time I didn’t reach for a flashlight but closed my eyes instead. I’ve felt like the figure is getting closer. I could feel the darkness approaching my eyes. Without opening my eyes I reached for a phone and tried to turn on the flashlight and after a few attempts I was successful. With the flashlight the figure disappeared. I saw it disappear! I don’t know what it was but I am scared. And it was definitely not a sleep paralysis. Can anyone pls help?",
        "created_utc": 1672661136,
        "upvote_ratio": 1.0
    },
    {
        "title": "Shadow people in Real life experience because You Experience them",
        "author": "surmit9ak",
        "url": "https://www.reddit.com/r/Paranormal/comments/101a5ce/shadow_people_in_real_life_experience_because_you/",
        "text": "[removed]",
        "created_utc": 1672657917,
        "upvote_ratio": 1.0
    },
    {
        "title": "I remember this one time in 2016, I was in my bed and I saw a lady",
        "author": "frankieromustpoop",
        "url": "https://www.reddit.com/r/Paranormal/comments/1018jot/i_remember_this_one_time_in_2016_i_was_in_my_bed/",
        "text": "I was sitting on my bed, my bedroom is towards the bathroom, my Chapan was using it (Chapan = great grandmother), and it was late, I was sitting there, the light was on and everything, all of a sudden when I’m waiting for my Chapan to come out of the bathroom, I saw a tall woman, she had messy bushy brown hair and olive skin, and was wearing a white gown, she was walking towards the kitchen and I flinched when I saw her, I heard footsteps and everything. It was only me and my Chapan in the house, my grandparents were at the casino and my uncle was out for the night, I asked my Chapan to come check around the house for that lady I saw, we didn’t see anything, later on went to bed. A weird experience I had",
        "created_utc": 1672651984,
        "upvote_ratio": 1.0
    },
    {
        "title": "Visit from my deceased grandma?",
        "author": "Zestyclose-Praline88",
        "url": "https://www.reddit.com/r/Paranormal/comments/1018bwd/visit_from_my_deceased_grandma/",
        "text": "First time poster (but long-time reader!), I don’t have a scary paranormal story for you, but I had a very emotional dream last night, and guess I am just trying to find meaning in it.\n\nMy grandma passed away in 2009, she was an incredible human, so kind, loving, simply a good person. I still miss her tremendously and think of her all the time.\n\nLast night I had a dream where I was back in her town, standing in front of her house/the gate in front of her house. I could see through the big windows that the house was empty and I started crying as i realized she was no longer there. Suddenly, a bluebird sat on the gate in front of me and jumped closer to me, flew around me and made contact with me, and I stopped crying. It was unbelievable blue. It sat on my hand and looked me in the eyes. That’s when i woke up.\n\nI am not a bird expert, and have never looked into birds and their meanings, but when i googled the meaning of bluebirds, i found that they are angels in disguise.\n\nWhat are your thoughts? Completely random dream or might there be more to it?",
        "created_utc": 1672651171,
        "upvote_ratio": 1.0
    },
    {
        "title": "sleep paralysis or something more serious?",
        "author": "Kevin80970",
        "url": "https://www.reddit.com/r/Paranormal/comments/1016y1v/sleep_paralysis_or_something_more_serious/",
        "text": "This has been happening to me often but yesterday was the scariest it happened \n\nit's called sleep paralysis, when you are just starting to fall asleep you suddenly feel like something is attacking you physically while you're sleeping but you cannot move or scream for help, you are aware of everything that's happening \nAnd from my experience the best eay to get out of it is to focus on trying to move even a finger will break the paralysis and you will regain control over your body and woken up in the middle of the night in total shock of what just happened \n\nBut yesterday it happened, the worst time it has happened to me\n\nI literally saw 3 shadowy figures when it was happening and i remember that exact moment and the amount of fear i was in knowing what was happening but can't do anything about it\n\nI did eventually wake up after a few seconds but was in absolute shock, i can still remember the figures till now and I'm genuinely scared of sleeping now 😂😶\n\nNot sure why this is happening as never in my life have i previously encountered such instances\n\nVery very strange nevertheless and i can almost guarantee you those figures where real\n\nHonestly one of the scariest moments of my life.",
        "created_utc": 1672645969,
        "upvote_ratio": 1.0
    },
    {
        "title": "Who’s there????",
        "author": "oscarjair12",
        "url": "https://www.reddit.com/r/Paranormal/comments/1016asa/whos_there/",
        "text": "Hello everyone. I will share a few short stories of things that happened in my childhood home. Three of the things were in the same bedroom, where the previous owner is said to have passed of old age, natural causes as far as I know.\n\nWhen I was about 6 or so, in the early 90s, I shared a room with my younger brother who would have been 4 at this time. For a clearer picture, we had a detachable bunk bed. During this time, they were detached and one bed was at one wall of the room with the other across it. There was a space of about 5 feet in between. There was a window right by the foot of my bed that was covered by light curtains that let dim moonlight in, just enough to be able to see object silhouettes. One night, well into the night when everyone had long gone to bed, I awoke to hear my brother whimpering. I thought to myself, “let’s get up to see what’s wrong with my brother.” Just as my muscles were contracting as I made the move to get up, I looked ahead and saw a figure sit up at the foot of the bed, as if they were on my bed. I could see the silhouette of a man with short hair. He whispered, “who is it?” I laid there completely frozen in fear, breathing as silently and slowly as I could to not alert this figure of my presence. I remember being soaked in sweat and not blinking until the sun came up. For some reason I felt ashamed to tell my parents about this. By this time I was already obsessed with horror movies so I thought that they would blame this on the movies and prohibit me to watch them. I eventually told them and my mom said I needed to pray.\n\nThe next situation took place in the same room. My mom asked me as a teenager if I remember telling her about the man with no legs. She said that maybe a year before the other incident, I had told her that I’d seen an old man with long white hair sitting on my bed. The man was missing his legs from the knee down. She said I told her that the man spoke to me, but I don’t recall what he said. At this time, we had an uncle and his family living with us. His daughter was about 5 or 6 at the time and they were using my old bedroom where the other incidents had taken place. My mom was a little spooked by what she told me next. She said that my aunt (my 5 year old cousin’s mom) told her that my cousin saw an old man with long hair and no legs sitting on the bed. She also mentioned that the man spoke to her but I don’t remember what they said the man said. This freaked me out a bit. I haven’t spoken to my family about this for years but I want to bring it back up to get more details. \n\nOne last incident. When I was in my early teens, we still had the bunk bed I mentioned in the first story but this time it was put together, one on top of the other. I slept on the top one and one evening, I went to my room  and climbed up to my bed to lay down and chill. I was probably laying for about 20 minutes but I was fully alert as it was early evening and the whole household was up in different areas of the house. During this time I was hearing the sheets of the bottom bed move around. I was also hearing the old mattress springs squeaking. I just assumed my brother had decided to join me in my chilling activity by laying down. Eventually my mom calls from the kitchen that dinner is ready so I jump out of my top bed and was gonna say something to my brother, probably challenging him to a race to the kitchen, when I notice that his empty. I was terrified. Who the hell had been tossing and turning in his bed while I was laying on the top one? I asked him non-threateningly or suspiciously if he’d been in the room and he said no, as he sat on the couch watching tv. I’ll never know what that was. I am an atheist and do not  believe in supernatural entities but it’s really eerie some of what’s happened in that room, especially the old man with no legs coincidence between my cousin and I. I just chalk it up to a young and hyperactive imagination at the time. That helps me not lose sleep. What do you all think?",
        "created_utc": 1672643690,
        "upvote_ratio": 1.0
    },
    {
        "title": "Need some help with some experiences.",
        "author": "Zoobotmon",
        "url": "https://www.reddit.com/r/Paranormal/comments/1014qbm/need_some_help_with_some_experiences/",
        "text": "[removed]",
        "created_utc": 1672638430,
        "upvote_ratio": 1.0
    },
    {
        "title": "I can see non human entites AMA",
        "author": "Ok_Reception_8415",
        "url": "https://www.reddit.com/r/Paranormal/comments/1014pzo/i_can_see_non_human_entites_ama/",
        "text": "[removed]",
        "created_utc": 1672638396,
        "upvote_ratio": 1.0
    },
    {
        "title": "Rolling on the Roof",
        "author": "Pristine_Fee_13",
        "url": "https://www.reddit.com/r/Paranormal/comments/1013dp4/rolling_on_the_roof/",
        "text": "This has happened on three separate occasions, to myself and my fiancée.\n\nSomething heavy, like my weight - 130lbs - rolls into the roof and then proceeds to run down the length of the house. Sounds like bipedal for sure and I swear it sounds like a fat toddler rolling down the roof. It’s flat, we have cameras, and no one/nothing has been sighted. \n\nWhat in the world? Southwest area.",
        "created_utc": 1672634137,
        "upvote_ratio": 1.0
    }
]