[
    {
        "title": "Unexplainable activity caught on home CCTV cameras",
        "author": "chirluna",
        "url": "https://www.reddit.com/r/Paranormal/comments/9k5v92/unexplainable_activity_caught_on_home_cctv_cameras/",
        "text": "[removed]",
        "created_utc": 1538308985,
        "upvote_ratio": ""
    },
    {
        "title": "My older brother told me where to find my missing tv remote last night, he has been deceased since 2011.",
        "author": "HERMANNATOR85",
        "url": "https://www.reddit.com/r/Paranormal/comments/9k5ug5/my_older_brother_told_me_where_to_find_my_missing/",
        "text": "Last week my wife and I attended a wedding and had to have a sitter watch the kids overnight. When we returned home, everything was fine except that the remote for the living room had gone missing. Usually when this happens it is stuck in no man’s land under the couch but I could not find it anywhere. I actually gave up and ordered 2 more remotes off of eBay. Problem solved right? \n\nSo last night right before I got up to go to bed, my son came out of his room and asked if he could sleep with his mom so I told him yes, and got the couch ready to sleep on. While I was asleep, I had the first dream of my deceased brother since he passed in 2011. In the dream he was holding my remote in his hand and saying he was sorry for making me spend money(he knows I don’t like to waste on things I didn’t need) and that he would “put the remote back where it usually is. The first thing I did when I woke up this morning was to check the spot that he told me in the dream and it was there. I had checked that spot at least once a day since it went missing. \n\nThanks Jeff, I’ll return those new remotes as soon as they arrive.\n\nEdit: Guys, when I told my wife about the dream and showed her the remote she started crying. Between her and I, that spot in the couch was checked and rechecked at least 20 times. I also told my sister about it and she was ecstatic because he would mess with both of us when we were kids by hiding things in really tough spots until he was sure that we had looked everywhere and then put it in an obvious spot when we weren’t around. This is like classic Jeff.",
        "created_utc": 1538308735,
        "upvote_ratio": ""
    },
    {
        "title": "The riddle of the Swiss watch in the tomb of an emperor from 400 years ago",
        "author": "BrokeMush",
        "url": "https://dailymagazine.top/the-riddle-of-the-swiss-watch-in-the-tomb-of-an-emperor-from-400-years-ago/",
        "text": "",
        "created_utc": 1538308169,
        "upvote_ratio": ""
    },
    {
        "title": "What is that? (No air movement in room, and just those two moving, the rest of the lamp is not moving at all)",
        "author": "bldwnsbtch",
        "url": "https://v.redd.it/uzm3tk304dp11",
        "text": "",
        "created_utc": 1538307497,
        "upvote_ratio": ""
    },
    {
        "title": "My grandpa kept scaring my sister",
        "author": "RJDeep",
        "url": "https://www.reddit.com/r/Paranormal/comments/9k4png/my_grandpa_kept_scaring_my_sister/",
        "text": "A little information, my grandpa had killed himself in 1995 (a year before my sister was born, 3 before me). The only other people who know about this are my mom and grandma. Mom is passed, grandma has dementia, so I can't really ask anything about this. But apparently my mom told my sister about this years ago, and she told me the other day.\n\nMy family tends to attract paranormal type of stuff. My mom had crazy dreams that came true, so do I. But my older sister see's dead people, and apparently has been her whole life. She explained to me when she sees them, its like remembering something.\n\nAs a baby, she was told that she would look around with worry, cry and scream. This supposedly happened so often, my mom brought it up to my grandma, and my grandma had said that my grandpa always wanted grandkids. My mom, even though I guess she wanted to keep my grandpas spirit around, one day got tired of it and just yelled \"Al, you can stay but please STOP scaring Paige!\" After that, the sudden bouts of crying and screaming and looking frantically around stopped.\n\nNow, we don't have any pictures of my grandpa, and the paranormal stuff has calmed down a crap ton since childhood. I doubt my sister would recognize him if she saw the picture again, but I thought this was spooky enough to share here. I do have stories about heavy activity happening to me as a child, and I always assumed it was my grandpa (mom said to leave my sister alone, but I didn't exist yet). Though it was kind of evil, I have doubts it was him. Let me know if you all would like to hear about that, but I just needed to share this for now.",
        "created_utc": 1538295722,
        "upvote_ratio": ""
    },
    {
        "title": "A curse or a gift?",
        "author": "rubyredstarfish",
        "url": "https://www.reddit.com/r/Paranormal/comments/9k4bkn/a_curse_or_a_gift/",
        "text": "I've always been sensitive. Some of My earliest memories are supernatural one's. Bit my most recent was last year around this time. \n \nMy little brothers best friend committed suicide almost exactly 1 year ago. I sat with his crying mother, feeling her pain like it were my own, but was also so angry at him. He abandoned my baby bro, his kids, a woman that was truly in love with him. But the sadness out weighed the anger.\n\n After the autopsy and his cremation, I suddenly awoke and sat straight up. I could feel someone. My dogs weren't freaking out so I knew no-one had entered the house from downstairs. \n\nI was looking around in the darkness trying to get focus. My eyes made their way to the bedroom door, which I keep open for the cat. There was a spot that was darker than the rest of the darkness in the room. I was trying to figure out if my Jim Morrison poster was messing with me but then it started to move closer to the bed. It was like if smoke could take the shape of a sphere. It slowly rolled toward me with it's smoke like extensions rolling off of the air as it moved. It came to within inches from my face. I was terrified but somehow knew it wouldn't hurt me. Then it retreated and went away. \n\nThe next night the same thing happened except, the room got cold and I felt an overwhelming turmoil. I could see myself wanting to die. I reached up to touch it. The pain was so intense that I burst into tears. There were times in my life that I felt this low and I wanted to die. So to feel that again, after what happened, knowing that agony wasn't mine, made me physically ill. \n\nMy cat fled the room. I knew it was him. It was my brother's best friend. I had seen that pain in his eyes many times. \nI had to run to the bathroom. I was very nauseous and crying so hard I don't know how my SO didn't wake up. Then it dawned on me. He just needed someone to understand. That person was me because I have been, my entire life, \"sensitive\" and I understand his pain. I've personally been there.\n\nSometimes they come as lights, sometimes darkness, sometimes as what their physical being looked like. Sometimes I can hear them and sometimes it's just a feeling. I was always so scared when I was younger that I did my best to block it out. I looked at it like a curse and because of this, over the years, I feel it less and less. Somehow I miss it. It was so much a part of my being that I feel like I'm losing a piece of my identity, but have no idea how to get it back or what I'd do with it if I did. I just feel like what I thought was a curse was actually a gift and maybe I could've done something good with it. ",
        "created_utc": 1538290365,
        "upvote_ratio": ""
    },
    {
        "title": "Weird sensation",
        "author": "Wolf_davis111",
        "url": "https://www.reddit.com/r/Paranormal/comments/9k47w0/weird_sensation/",
        "text": "Hello, i have a weird short experience to tell. I don't really know if it was paranormal or just my mind playing tricks on me from all the emotional breakdowns I had after becoming homeless in high school and being rejected by my first love.\nI was crashing at a friends house and laying on her second bed in her room, i felt a weird sensation, it felt like my whole body was submerged under water and as soon as that happened i moved and shook the feeling. I've no clue what this is and always wondered. I'm open to a lot of things and that means to question everything though in my opinion. I can only say the experiences I've had are my own. Has anyone felt anything like this. Maybe it's something medical where my brain screws with my senses. But this only happened that one time",
        "created_utc": 1538289013,
        "upvote_ratio": ""
    },
    {
        "title": "The Victorian Lady",
        "author": "mreowbox",
        "url": "https://www.reddit.com/r/Paranormal/comments/9k3yxj/the_victorian_lady/",
        "text": "I have many encounters and not all are pleasant. However, most are on the ok side and nothing bad has happened to me other than being scared or the obvious shaken up by the encounter. This one inpetucular comes from when I was at my grandparents house in the south United States near the capital of that city. \n\nThis was about 14 or 15 years ago and the events leading up to the event is fuzzy but the image still sits perfectly in my mind.\n\nMy grandparents went out to tend to the garden and the small one acre farm with my parents. My brother was still asleep by this time seeing at it was 10am on the weekend. We were visiting my grandparents for the traditional holiday season and this should be Thanksgiving. This house was very old and I'm not particularly sure which year but we're looking at early 1900s with additions and remodels. I would like to disclose here that my grandparents were lovers since before pearl harbor and Grandpa promised my grandma when he returns he will marry her. He did survive and only him and a few from his unit did. So it's a sweet love story...\n\nAnyway, back to the story. This house has 3 bedrooms and a add on that's a craft room for grandma with a bed in there so technically it's 4 bedroom house and 2 baths on 2 acres of land.\n\nThe add on always bothered me.. I never liked going in there. The A/C didn't go into there but there was fans and a heater for the temperature. My grandparents tend to keep the door closed to that room unless family was visiting or grandma was in there sewing or crafting as she does. I never knew why I didn't like that room but I would avoid it like the plague.\n\nBut I had to go into that room cause grandma was working on something and left it in there. She asked me to go look at it and tell her what I thought. I adore my grandma so I did what she asked. She is about to get lunch started and my aunt and uncle with their daughters will be there by the time lunch is ready. I walk over to the sewing machine which sits infront of two windows. These windows face into the house and only one small window faces the back yard and a door outside. \n\nI sat down there and felt a strong urge to look up. I see this Victorian lady walking and I could see through her yet she was all there down to her shoes in the most beautiful dress. She started from the room I was in and walked across the house slowly to the other 2 bedrooms. She glanced back at me and had this follow me beckon.\n\nThis scared the crap out of me. I had no idea what just happened.. but I followed. Looking everywhere for this woman yet she was gone. My grandma when confronted about this woman just got uncomfortable looking and said not to worry about her.\n\nGrandpa would pretend I was talking about the game or anything else. No one else in my family saw her and only I did. Since that event until my grandparents passed away a few years later I have seen her multiple times. Always walking around that additional room and always seem somber. \n\nSince that encounter, which was my first, I have had so many encounters with the paranormal and I'm not even sure why. My other grandma whom still alive swears up and down I'm just like her great great grandma who was a witch....\n\nI just wanted to share and get thoughts. :) Thanks for letting me share this one experience",
        "created_utc": 1538286303,
        "upvote_ratio": ""
    },
    {
        "title": "The Ghost Stories &amp; Haunting Of The Sturdivant Hall In Selma, Alabama United States Of America",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/Paranormal/comments/9k3pzf/the_ghost_stories_haunting_of_the_sturdivant_hall/",
        "text": "Built in 1856 in the Greek Revival style, this beautiful antebellum mansion was bought in 1864 by John McGee Parkman.  In the years after the Civil War, Parkman was arrested and imprisoned for cotton speculation.  While in prison, Parkman attempted to escape but was shot and killed in the process.  When his wife was forced to sell their house a few years after his death, his ghost began to appear regularly throughout the house and grounds, where it is still seen to this day.  People often report hearing windows and doors being opened and shut when no one else is in this real haunted house, as well as doors that close behind people and lock on their own.  The apparitions of two little girls are also frequently seen, though their identities remain unknown.",
        "created_utc": 1538283983,
        "upvote_ratio": ""
    },
    {
        "title": "I believe my girlfriend is being affected by some kind of negative energies. This is my first reddit post. You people have tons of experiences so please help me eith the best you can. You help is appreciated.",
        "author": "Siddhant_19",
        "url": "https://www.reddit.com/r/Paranormal/comments/9k3a71/i_believe_my_girlfriend_is_being_affected_by_some/",
        "text": "I've been in relationship with my gf since 10-11  months. It's a long distance relationship and we've met once few weeks ago. We share a beautiful relationship. She often used to tell me that I healed her and I am the reason she is not  depressed anymore. Gettinght into the topic and describing things as briefly as I can.\n\nHer mother had cancer since August 2017. Her mother died 3 months back in July. Everything was very smooth until past few months. It started from February end I guess. Like there have been a little fights for some reasons which seemed pretty normal to me since I believe it's only normal to have small fights if we're in a relationship and that even tightens the bond, although it affected her a bit. But since last few days her behavior has changed drastically. I feel like she is not being herself. Something is controlling her. Maybe negative thoughts/energies/emotions. \n\nLike we were having a small argument over text and then we came to an understanding and it was almost settled but then something instantly triggered her and she started to rage again and it was like she was so much in rage she just kept on writing things that would hurt and would not even pay attention to what I wrote. Even yesterday, I told her I had two cigarette puffs in the morning and it was all good then. (None among us has like a major dislike for cigarettes that we cannot tolerate it. It's just that we believe it's not so good for health and so it's fine if you have it ocassionally). Then all of a sudden, she started that topic in night and started arguing. I promised her not to touch cigarettes for the next 6 months and we eventually settled the matter. But then again something triggered her so much that now she started raging again and started to talk about taking revenge by smoking cigarettes everyday herself. Like there is something that triggers her as soon as she is about to get calm. I talked to her yesterday and she said she agrees to it. She said that there is something that hits her weak spots like death of her mother, the physical distance between me and dreams about her mother (She's a very strong woman). She also added that she instantly feels this intense anger within herself and that nothing anyone does could calm her down at that moment. \n\nEven earlier she told me many such incidents in her house like once she talked to her dad about something negative being in the house and her father agreed to it but the very next day her father completely denied it and didn't wanna talk about it. Another incident which strongly made me believe this was when she somehow after so many efforts convinced her dad to call priests but then when they were about to visit us they couldn't due to some reason or the other. The priests said that they were being stopped by many ways. Like there was a group of buffaloes which blocked the way during the night time and that was strange. And they saud there were \"some\" more reasons which they never told us. They visited her house the next day (it almost felt like something was like buying time for itself) and then when they started sprinkling holy water in the whole house but there was a hall upstairs in her house and they couldn't visit there and sprinkle holy water there for some reason like the lights went off and the hall is quite dark upstairs and so her 'DAD' asked them not to visit upstairs. \n\nThere are lot many such incidents. Please if anyone has a proper knowledge abiut these things, please help!",
        "created_utc": 1538280246,
        "upvote_ratio": ""
    },
    {
        "title": "Why did this show up when I was just trying to take a picture of bad captioning :c",
        "author": "lostmuhpasswordAGAIN",
        "url": "https://imgur.com/gallery/2TiwWvN",
        "text": "",
        "created_utc": 1538279662,
        "upvote_ratio": ""
    },
    {
        "title": "Shaking hotel bed",
        "author": "AsianTigerMilf",
        "url": "https://www.reddit.com/r/Paranormal/comments/9k350i/shaking_hotel_bed/",
        "text": "Ok guys wtf. I’m in a hotel currently and the bed my daughter is on keeps shaking. It isn’t a vibrating bed. I’m on my husband’s currently and it isn’t shaking. Only her’s does. It feels like something could be underneath. I currently can’t get my husband to wake the fuck up and look. I thought I was going crazy but it obvious is kinda waking her up too. So what the fuck. I don’t want to look on my own. It’s shaking like someone trying to wake you up. I’m posting it in paranormal because I’ve had this happen to my family when we were younger.\n\nMy family rented a house and the bed would shake. My sister ran out of the room because when she was right about to fall asleep it would shake. So my brother slept in there, same thing. My mom and I (I don’t remember. I only remember crawling underneath for my dad later on) she and I left the room. My dad said we were all full of shit. So he slept in there and he had to leave. I crawled underneath the next day to check if there was any thing doing it and it was still unexplainable. That was the closest my family and I have ever been. We all slept in the living room together. \n\nSo this is happening with my daughters bed. What the fuck. Can anyone explain. This????? I thought maybe it was someone downstairs but it’s really moving like something is underneath. I am NOT CHECKING. Omg. ",
        "created_utc": 1538278805,
        "upvote_ratio": ""
    },
    {
        "title": "Skeptics, what evidence would you need in order for you to believe in the paranormal?",
        "author": "keepingthingseevee",
        "url": "https://www.reddit.com/r/Paranormal/comments/9k3339/skeptics_what_evidence_would_you_need_in_order/",
        "text": "[removed]",
        "created_utc": 1538278254,
        "upvote_ratio": ""
    },
    {
        "title": "i was followed by a dead girl",
        "author": "makellamarie",
        "url": "https://www.reddit.com/r/Paranormal/comments/9k2rjj/i_was_followed_by_a_dead_girl/",
        "text": "[removed]",
        "created_utc": 1538275060,
        "upvote_ratio": ""
    },
    {
        "title": "Found today while walking my dog.",
        "author": "ulsanforyou",
        "url": "https://www.reddit.com/r/Paranormal/comments/9k2oej/found_today_while_walking_my_dog/",
        "text": "[removed]",
        "created_utc": 1538274224,
        "upvote_ratio": ""
    },
    {
        "title": "Found today while walking my dog at a state park.",
        "author": "ulsanforyou",
        "url": "https://i.redd.it/8ig7uoyjbap11.jpg",
        "text": "",
        "created_utc": 1538273623,
        "upvote_ratio": ""
    },
    {
        "title": "most haunted doll // subscribe to my channel!",
        "author": "makellamarie",
        "url": "https://www.youtube.com/watch?v=O_3YN6Lcq-k",
        "text": "",
        "created_utc": 1538273321,
        "upvote_ratio": ""
    },
    {
        "title": "First experience",
        "author": "BamBeau",
        "url": "https://www.reddit.com/r/Paranormal/comments/9k2aj3/first_experience/",
        "text": "This was writing on my iPhone so I apologize for possible spelling errors and basically nonexistent writing skills. The latter isn’t my phones fault. \n\nFor starters I’m not sure if I truly believe in the paranormal but I had one experience a few years back that I can’t really explain and it still haunts me. \n\nWhen I was younger my aunt and cousin would go urban exploring, she also ran a website about the most haunted places in my state. I went with her to a couple of those places but never saw anything but graffiti and trash so when she said she wanted to go to an abandoned asylum. I wasn’t really thrilled but decided to go. How cliche is that? Going into an abandoned asylum to see ghosts. Anyway, It looked like the hospital in the walking dead but darker and in worse condition. once we’re inside i instantly felt uncomfortable like I was being watched. Something told me I should just turn around and leave but I brushed it off and thought I was just being dramatic. We made our way into one of the dormitories and my aunt starts asking questions like can you show yourself, or let yourself be known. That’s when I hear what sounds like a woman crying. I didn’t learn until later on that my cousin also heard it. My aunt didn’t so I didn’t say anything I just looked at her like “what the fuck” she then told us she wanted to head to the basement which I instantly thought was a horrible idea but like the dumb kid I was I decided to follow her. We reached the stairwell and as we opened the door we heard a loud horrible growling sound. Like if a bear and a fucking tiger had an angry child. My cousin and I decided this was probably a sign that we definitely shouldn’t go down there and begged my aunt to turn around and go somewhere else preferably somewhere not so dark. She agreed after more convincing. We were walking for a bit when my aunt realized she left her cellphone in the car so she told us to stay where we were as she went out to grab it from the car. It was a very lit area not far from the entrance so we agreed. My cousin and i were talking about the growling noise when we suddenly heard “run” in my aunts voice. We both looked at each other horrified and booked it out of the building as fast as we could. We crawled through one of the windows to each outside faster when my aunt came running to us. She asked what was wrong and that she was only gone maybe a minute. My cousin asked why she told us to run and my aunt said she didn’t she was still looking for her phone. We decided to leave right after that and honestly thank fuck we did. \n\nIt’s been at least 8 since this has happened and out of everything I heard that day what still scares me is the fact that something in my aunts voice told us to run. I’m not sure what we were supposed to run from but I’m glad we didn’t stay in there long enough to find out. \n\n\nEdit: if anyone wants the name of the place this is about leave a comment. Unfortunately the buildings were destroyed but there’s a website about the things others have experienced and it’s history all of which are quite interesting. If only I knew about it before I decided to go. ",
        "created_utc": 1538270551,
        "upvote_ratio": ""
    },
    {
        "title": "My mother?",
        "author": "Eskew42",
        "url": "https://www.reddit.com/r/Paranormal/comments/9k1udx/my_mother/",
        "text": "Tagged as Advice, can simply be a question. Basically, we'd like some opinions.\n\nBackground: My wife and I got pregnant with our first child back in July/August of 2014. My family were all, expectedly, highly excited. He was to be the first grandchild. My mother was probably most excited. She wasn't in good shape, but she was excited about the baby coming. And then, in December, she passed away, never having got to meet her grandson.\n\nHe was born in March, and he's now 3. We made sure to teach him who she was. He comes with me to visit her, and he knows who she is in pictures. Calls her Oba. And it makes me happy.\n\nSituation: We were affected by Hurricane Florence this past month. We lost power a few hours before the storm and were without for a week. During that time, he was playing... What I thought was pretend by himself. Until he told my grandma (Oba's mother) that he was talking to Oba. Great, color me freaked out. I've seen enough horror flicks, and I'm avid enough that I know he's probably not lying.\n\nHe's never really mentioned Oba much since he's been able to talk. And now, over the past couple of weeks, he talks about her frequently. Then, tonight (not even 15 minutes ago), we get our son out of the shower, and he has a small cut on his ribs, right side, maybe an inch and a half below his nipple. My wife asks him what happened and he said \"Oba did it. Hit my knee, made it hurt\" He isn't very great at explaining things, but he usually doesn't lie. \n\nNow I'm thoroughly concerned. That doesn't sound like her. I'm sure that it's just a small knick he got somehow, but he was adamant that Oba did it. So, I've gotta ask what you all think. ",
        "created_utc": 1538266400,
        "upvote_ratio": ""
    },
    {
        "title": "P-SB7 spirit box possibly broken",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/Paranormal/comments/9k1sn6/psb7_spirit_box_possibly_broken/",
        "text": "[deleted]",
        "created_utc": 1538265978,
        "upvote_ratio": ""
    },
    {
        "title": "My True Ghostly Experience! (x-post from r/ghosts)",
        "author": "xQueenAryaStark",
        "url": "https://www.reddit.com/r/Paranormal/comments/9k1o1s/my_true_ghostly_experience_xpost_from_rghosts/",
        "text": "[removed]",
        "created_utc": 1538264770,
        "upvote_ratio": ""
    },
    {
        "title": "Scare me",
        "author": "ckxsp",
        "url": "https://www.reddit.com/r/Paranormal/comments/9k1ncl/scare_me/",
        "text": "[removed]",
        "created_utc": 1538264598,
        "upvote_ratio": ""
    },
    {
        "title": "Old website that layers old maps on top of google maps??",
        "author": "TheLastNatives",
        "url": "https://www.reddit.com/r/Paranormal/comments/9k1h9j/old_website_that_layers_old_maps_on_top_of_google/",
        "text": "[removed]",
        "created_utc": 1538263017,
        "upvote_ratio": ""
    },
    {
        "title": "Ghost or Aging Mirror ? You decide. Picture was taken in 2017 when my friend and her husband celebrated their anniversary at the Historic Whitney Mansion in Detroit, Michigan (Mansion was featured in 2016 Ghost Hunter TV show for being haunted). I think it is the face of Mr. Whitney himself.",
        "author": "Maureenlouwers",
        "url": "https://i.redd.it/17zxjt0lf9p11.jpg",
        "text": "",
        "created_utc": 1538262811,
        "upvote_ratio": ""
    },
    {
        "title": "Even ghosts need cuddles",
        "author": "Shootingstargirl120",
        "url": "https://www.reddit.com/r/Paranormal/comments/9k1fk2/even_ghosts_need_cuddles/",
        "text": "So I've posted recently about a house that I lived in that was pretty haunted during one summer with my mom. I didn’t go into detail there because it wasn’t directly connected to that story aside from the ‘place’. I will go into more detail here sense this experience happened inside the house and was directly connected to that place rather then my ghost hunting adventures. \n\nThe house itself had a really weird vibe to it. I know most people describe that haunted places feel heavy or even a little scary but this place was like the direct opposite. It was overly comfortable to the point that thinking about it now makes me feel uneasy. By all rights I shouldn’t have felt comfortable with everything. Another odd thing about the atmosphere is it was like a time vault in a way. We would spend what felt like a few hours awake only to walk outside and realize a absurd amount of hours had passed. Sometimes even days. \n\nThe house was a 2 bedroom home. one room was the master bedroom where my mom slept, that was the one room I did feel comfortable in, the second room was a “kids” room that my best friend and I would sleep in. Inside where 2 bunk beds and a huge closet. Ive always had a thing about closet doors needing to be closed so imagine my horror when the closet door in that room would NEVER stay shut. It would get absolutely ridicules. We would pile everything from clothes to even shoving the dresser against the door and every time with out fail when ever we came home or walked back into the room the stuff would be pushed side and the closet door would be wide open. \n\nWhile being in the bath room everyone would feel a sense of being watched (creeper ghost). The master bedroom we would constantly spot a shadowy figure either standing at the foot of the bed or standing in the corner. \n\nThe most frightening experience inside the house was one day in what I assume was bright daylight. (Weird time vault) I always slept and laid on the bottom bunk in my bedroom. But on this day I had felt like laying in the top bunk for my typical teenage angst session. I had borrowed a iPod from a friend so I decided to lay in the top bunk, listen to rock music, and think. I was laying there for a few minutes when I felt someone lay beside me. I felt a hand settle on my hip and a head press into my neck. My eyes flow open. I looked down at my hip and noticing nothing there I started to panic. \n\nI rolled over so I could get off the bed. The feeling was the weirdest thing I've ever felt. I had rolled where the person behind me would have had to been laying and felt a force go threw me. It was laying inside my body. I had never felt so violated in my life. At that point I was beyond done I wanted nothing to do with being in that room so I bolt down the ladder to the bunk bed and ran full speed to the living room where my mom was. \n\nAll in all it wasn’t anything bad but super creepy. I hadn’t felt anything negative from the force. The panic I felt had come from realizing that something unseen had been holding me. Not the presence. However knowing that I never slept/laid on that top bunk again. \n",
        "created_utc": 1538262588,
        "upvote_ratio": ""
    },
    {
        "title": "My paranormal experience. Possible deviant",
        "author": "blubberfeet",
        "url": "https://www.reddit.com/r/Paranormal/comments/9k19a0/my_paranormal_experience_possible_deviant/",
        "text": "Thanks to everyone who talked on my wholesome paranormal post. So many stories to read and learn from. Thanks everyone. Now i wanna talk about my paranormal experience. A few years ago we moved away from my dad after a massige issue happend (abuse and stuff). We rented a nice house but one of the rooms closets had weird Egyptian papers glued in it. I dont know where they came from or what they were but they had gold on them. I did not want that room at all. I chose the larger room as i had friends at the time (im friendless now :( eeh). However since we moved in ive been having experience after experience. Shadow people, voices from nowhere, hearing foot steps here and there, and was even attacked. Before the attack i was in my room alone reading a book the seige of castleaxx. My room had a remote control for the lights and ceiling fan on my beside table. Suddenly the lights died and i saw beside me a hand slowly crawling off the bed. I waited a full 5 mimuites before i turn on the light. No one believed me. Then one night a few weeks later i was dreaming. I was lying under a tree and this maid in a pure blue outfit came to be only for me to suddenly wake and see her on my ceiling bubbling into a black mass of bubbles with what seemed like a meat cleaver. I had never felt a fear like that before. I was reaching for my lightswitch when something grabbed me and yanked me off the bed. It was a cold and sharp hand. Suddenoy i felt like something licked my neck. It was cold like death dead cold. Suddenly i found the switch and turned it on. They vanished. Didnt sleep for three days. The last thing that happened was before i moved back to my home city of orillia one of my friends asked me while we were in my room was \"did someone say something\". Since then ive been still plauged by nightmares but nothing major yet. Did anyone else have an experience like that ever? ",
        "created_utc": 1538261047,
        "upvote_ratio": ""
    },
    {
        "title": "\"Be quiet or go to sleep\"",
        "author": "ToxicKhaosTC",
        "url": "https://www.reddit.com/r/Paranormal/comments/9k191e/be_quiet_or_go_to_sleep/",
        "text": "Hey there everyone! In a previous post I eluded to some other odd encounters I've had growing up, and with some time passing since my last post I figured I'd share another. I'll most likely be posting the other encounters later on however they are much more brief than this encounter or the previous one. Most of these stories will take place in the span between myself being 14-18 (I'm now 24). This one is a long read but most of it is backstory (so jump to the third paragraph if you just want the encounter). I'm really curious to hear your thoughts!\n\n&amp;#x200B;\n\nMost of these experiences take place in one house, the second house I lived in with my mom. My parents split up early on, and my mother wasn't able to afford the house we (My sister, my mother and myself) were currently living in. So we had to move. We found a nice house just behind the back field of the highschool I would be going to, and the one my sister would be attending once she got to grade 8. I don't remember much but the house was in pretty bad shape when we got it, but my grandparents offered to help pay for it and fix it up. I don't remember anything about past owners or anything like that but I always got weird vibes when I was alone in it.\n\n&amp;#x200B;\n\nSorry for the long intro but if you're still reading, this is where the encounter begins. Fast-forward a few years, we had settled in our new home nicely and I had spent a year and a half at the new school. Everything was going as good as it could for a teenager who was dealing with moving and going to a new school. Nothing out of the ordinary. Until one night (as cliche as that sounds) when I was playing video games with my friends. I did good in school and my mom knew I always got my work done on time so she had no problem with me playing, unless I got too loud. Even though my room was at the back of the house, and you had to go through a crescent shaped hallway to get to her room, her bedroom had a bathroom. This \"connected\" our rooms, my TV was on the shower wall of the bathroom and her bed was lined up so if she was facing the bathroom she could see straight to the shower.\n\n&amp;#x200B;\n\nWell we were playing Call of Duty that night, and getting a little rowdy. We played over Xbox live so I wore a headset, which meant I didn't hear how loud I got when I got excited. So, almost every night I played, my mom would come to my door, knock, open it, and tell me to be more quiet or go to sleep.  So sure enough, I got a kill-streak, got a little too loud, and my mom came to my door and did her routine. However this particular night I was on fire, which led to me getting quite loud multiple times after the first visit from my mom. After the 5th time my mom threatened to turn the internet off if she heard me again. I felt bad and said sorry,  and I'd be go to sleep soon. So I told my friends I'd be whispering for the next couple games. After a few more games my friends got off so I decided to watch some YouTube till i got tired. I hadn't been talking for awhile now and the last time I got up to use the bathroom I noticed my sister had gone to sleep. It was sometime around 1:30 am, and it had been well over an hour since my friends got off at this point, when I heard a knock at my door. I realized my TV was quite loud, and even if my sister was asleep, my mom probably heard it. So without thinking too much I just said \"Sorry I'm turning it down\". No response, and no more knocks. I just figured it was my mom and continued watching. About ten minutes later, another knock. However before I even have a chance to check my TV's volume there is a second knock. I say I'm sorry, and turn my volume down even more. At this point my TV is barely audible, but its quiet enough in the house I can hear it.\n\n&amp;#x200B;\n\n5 minutes later, a bang on my door. This one is much louder, and much more aggressive than previous, and I thought my mom had really gotten angry. There was a second bang, and then my door knob began to jostle. My mom cared for handicap people as her profession so we had child locks on all our doors, just in case they somehow got upstairs and wandered into the hallway. However every once and awhile my mom would have a hard time getting past the lock, so since I was already in trouble I jumped up to get the door for her. I opened the door to, no one. Nothing was there, just an empty hallway, however we had a nightlight and see I could see if anyone had started to walk back down. My sister's door was shut, and my mom's door was also shut. Realizing this, I was overwhelmed by fear and frantically returned to my room and shut the door. My first instinct was to check my if my window was open because sometimes a breeze was strong enough to move my door even if it was closed. But my window was closed shut with the wooden bar still in place. I didn't know what to do at this point but I didn't want to wake my mom up so I waited till morning to tell her.\n\n&amp;#x200B;\n\nShortly after the whole experience (around 2 am-ish) I was able to fall asleep. The next day I asked my mom when she fell asleep, she said around midnight, shortly after the last time she came to tell me to be quiet. I then told her about my night, and she told me it was probably the wind. I told her my window was closed but she said a draft might have come in from the kitchen or something. I was insistent it wasn't just air so she asked my sister if she had been teasing me, but she said no, she went to bed shortly after 1:30 (she has insomnia so late nights weren't shocking to us) and she had heard the knocking too, and like me assumed it was my mom. At this point my mom brushed it off and changed the subject, which i always thought was strange since she had a thing for creepy/paranormal stuff, and she believes in spirits. I'd also like to clarify a few things, first that there is no way my mom had pranked me, someone with kidney stones, a broken foot that was almost healed and being a little overweight, there was no way she could have moved that quickly and silently to her bedroom, especially since the knob was still moving when I grabbed it.  Secondly, I know I wasn't drifting off and imagining it since I sat on the edge of my bed, so I couldn't drift without falling off. I've also never had problems with auditory hallucinations in past when I'm tired and I still don't today. This type of encounter was a one time thing however, and never happened again on the many other nights I kept my mom up gaming. So again, sorry for the extremely long post but I hope you made it all the way through. This is an experience that has stuck with me over the years and most people I tell it to don't give me any insight, has anyone here had a similar experience?  Thanks for you're time and I hope you guys enjoy the stories I'll be sharing soon.\n\n&amp;#x200B;\n\nSorry, no tl;dr as there was just too much to detail for it to make sense.\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n&amp;#x200B;",
        "created_utc": 1538260989,
        "upvote_ratio": ""
    },
    {
        "title": "I was scared of what might be behind that door, but what's more terrifying is what might be in here with me.",
        "author": "ChaseAlice",
        "url": "https://www.reddit.com/r/Paranormal/comments/9k18yu/i_was_scared_of_what_might_be_behind_that_door/",
        "text": "My cat likes to come into my room, but she always knocks over my plants and trinkets, so I always make sure the door is closed. I also keep my door locked when I'm inside my room (old habit from a childhood of being terrorized by my older brother lol). The way the lock mechanism works, the door can only be locked from the inside of the room. If the person on the inside of the room turns the doorknob, the door will unlock automatically. There's no way to turn the knob without the door unlocking.\n\nAbout an hour ago, I left my room to go upstairs and get some dinner. I opened the door, which unlocked it, and then I shut it behind me. After I had eaten, I came back downstairs and headed straight into my bathroom. I was trying to brush through another section of one of my long-neglected doll's hair that I recently dug up with the intention of restoring. I didn't care about them as a child, I always preferred to be outside collected bugs than to pay any attention to a doll. And they creeped me out. So I had put them in a closet and forgotten about them for probably ten years now. Anyways, once I conquered the matted section of synthetic hair, I left the bathroom with the doll under my arm, so I could set her down next to the other doll, who's hair I'd spent much more time on thus far. I reached for the door knob and tried to turn it. It was locked. I tried turning it a couple more times. Definitely locked. I instantly felt a sense of seriousness fall on me. I was afraid that when I opened the door, I might find an intruder in my room. How else could the door be locked? I pulled my phone out of my pocket to record a video, just in case, but then remembered it had just died. After a deep breath, I found a Bobby pin, bent it, and poked it through the little circular hole in the knob. It clicked and I hesitated before opening the door. But there was nothing there. So I just locked the door behind me, set the doll down, looked under the bed, and then crawled under the covers. Now that I'm laying here, I can't help but think - I was scared of what might be behind that door, but what's more terrifying is what might be in here with me.",
        "created_utc": 1538260975,
        "upvote_ratio": ""
    },
    {
        "title": "Looked out the window and saw this staring at me",
        "author": "dollabiuz",
        "url": "https://www.reddit.com/r/Paranormal/comments/9k146w/looked_out_the_window_and_saw_this_staring_at_me/",
        "text": "Hello everyone, \n\nToday I was sitting on my desk getting some work done, before I decided to look out the window. Once I do so, I come across this weird figure that looks like some type of alien looking at me [https://imgur.com/a/fyZuX1i](https://imgur.com/a/fyZuX1i) I felt uneasy, because I've looked out this same window for years and never saw this. I didn't freak out that much because I considered the possibility of sunlight + shadows + leaves creating this weird figure. Anyways, wanted to share this with you to see what you guys think.",
        "created_utc": 1538259814,
        "upvote_ratio": ""
    },
    {
        "title": "Random boot in the left corner of the picture ( nobody was there )",
        "author": "mamabird1988",
        "url": "https://i.redd.it/pqqiazbe39p11.jpg",
        "text": "",
        "created_utc": 1538258727,
        "upvote_ratio": ""
    },
    {
        "title": "I Looked Out the Window and Saw This Staring At Me",
        "author": "[deleted]",
        "url": "https://i.redd.it/5s3ays4qz8p11.jpg",
        "text": "[deleted]",
        "created_utc": 1538257475,
        "upvote_ratio": ""
    },
    {
        "title": "Anyone have Any paranormal/ unexplained things happen to them during their time in war?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/Paranormal/comments/9k0sp1/anyone_have_any_paranormal_unexplained_things/",
        "text": "[removed]",
        "created_utc": 1538257197,
        "upvote_ratio": ""
    },
    {
        "title": "I’m not sure if anyone else has noticed this on paranormal recreation shows that occasionally there are inconsistencies with the stories on the air to the story that you read about the haunting online?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/Paranormal/comments/9k0aw5/im_not_sure_if_anyone_else_has_noticed_this_on/",
        "text": "I noticed some inconsistencies with endings of paranormal witness and a haunting when they did the Sally House haunting. If I remember correctly. Paranormal witness said it was a Harpey demon of some sort and a haunting stated it was the ghost of a woman and a young girl haunting the home. \n\nHas anyone been featured on the show but when the episode aired noticed inconsistencies with the story they told and the version the network aired? ",
        "created_utc": 1538253305,
        "upvote_ratio": ""
    },
    {
        "title": "5 Children Who Remember Past Lives",
        "author": "RolandMT32",
        "url": "https://www.reddit.com/r/Paranormal/comments/9jzsr6/5_children_who_remember_past_lives/",
        "text": "[removed]",
        "created_utc": 1538249292,
        "upvote_ratio": ""
    },
    {
        "title": "Translating spirit boxes?",
        "author": "LuigiInTheSky",
        "url": "https://www.reddit.com/r/Paranormal/comments/9jznc3/translating_spirit_boxes/",
        "text": "[removed]",
        "created_utc": 1538248086,
        "upvote_ratio": ""
    },
    {
        "title": "Has anyone ever experienced a goodbye dream with a recent departed loved one.",
        "author": "elboogie7",
        "url": "https://www.reddit.com/r/Paranormal/comments/9jzm8t/has_anyone_ever_experienced_a_goodbye_dream_with/",
        "text": "*Personal Experience  \nSo, this actually happened like 20 yrs ago.  \nBoth my grandparents passed away within a few years and shortly after passing I had a dream with each of them, which was incredibly vivid.  \nI'm skeptical of things of this nature, but these dreams were incredibly vivid, which is beyond rare for me.  \nWe sat, and hugged and just stayed with each other for a bit.  \n\n  \nAnyone else have a like experience and believe it could be more than self-induced?\n",
        "created_utc": 1538247855,
        "upvote_ratio": ""
    },
    {
        "title": "5 Children Who Remember Past Lives",
        "author": "[deleted]",
        "url": "https://youtu.be/XHUb-YcDUwo",
        "text": "[deleted]",
        "created_utc": 1538247804,
        "upvote_ratio": ""
    },
    {
        "title": "What should I think of this?",
        "author": "B_e_a_n_a_s",
        "url": "https://www.reddit.com/r/Paranormal/comments/9jzknq/what_should_i_think_of_this/",
        "text": "So I've never told anyone this before. In fact other than today I've never even thought to. My grandmother died when I was about five. Since I was so young I didn't understand and I was mostly confused, so when I started having dreams about her I never thought twice. Years passed and i forgot all about the dream. My grandfather died after having a stroke that we weren't aware of at the time and his last few days were filled with agony as he lost the last bit of himself he had left. About months ago this really started to mess with me and I had the dream again. It started out with my grandmother and I walking along the beach that is right next to my grandparents house. My happiest memories (although I can only remember a few now) have been up there with them on that beach. She held my hand as we walked along the never ending coast and gazed out at the sunset. Eventually we came to a spot where the rocks to our left suddenly seemed to reach the clouds and my life up to that point played out on the screen that appeared embedded on the rocky cliff. I told her all about everything that has happened to me. She never spoke a word. She just listened to me and smiled. That's where I woke up. I balled my eyes out as the dreams I had before when I was young came back to me. What am I supposed to make of this? I haven't been able to stop thinking about this since.",
        "created_utc": 1538247539,
        "upvote_ratio": ""
    },
    {
        "title": "Haunted house I lived in for 3 years.",
        "author": "VV935",
        "url": "https://www.reddit.com/r/Paranormal/comments/9jzbx0/haunted_house_i_lived_in_for_3_years/",
        "text": "Hey all, just found this sub and wanted to share my story.  About 10 years ago I lived in a pretty active house for 3 years.  I was 17-19 at the time.   It started small but escalated slowly.  \n\nOn the day we moved in (my mom, sister, and I)  the neighbors greeted us, a nice older couple.  In conversation they mentioned that the past 3 families had moved out after 1 year, but I didn't think anything of it.  As we unpacked, I went into the attic to put away storage boxes, and found that the attic was already full of boxes, full of random things.  Clothes, toys, an old Atari system, all kinds of stuff.  We thought it was weird but made room for our things and left it all there.\n\nThe house had a creepy feeling from the start.  The being watched feeling, and sometimes the feeling that you were somewhere you shouldn't be, especially in the hallway.  We had 2 cats, and they would be laying down, and then look up and seem to watch something cross the room, and sometimes follow it into the next room.  Nothing there. No bugs, nothing.\n\nFast forward 6 months, and we started hearing footsteps in the attic.  Heavy boot-sounding steps from one end of the house to the other.  Then we would hear boxes sliding across the plywood attic floor as well.  This got to be an almost daily occurance.  We knew it wasn't squirrels making those sounds.\n\nA while later my girlfriend at the time moved in with us, and she witnessed what we had, and more started happening.  We would stay up late watching TV, and not every night, but some nights the TV would turn to channel 5 on it's own.  Always between 3:00-3:05 am.  The cable box would still display whatever channel I was watching, and the remote would stop working.  I would have to unplug the cable box to get it to reset.\n\nOn the back door were long blinds that would clack against the door with the slightest movement.  On 2 occasions my girlfriend and I watched one bottom corner of the blinds silently be pulled away from the door about a foot, and slowly let back down.\n\nOne day I was going into the garage, I opened the door from the kitchen and the big trash can we kept just to the left of the door immediately slid about 2 feet to block my way into the garage.  That was the first time I had felt genuinely scared of what/who was there.\n\nA while after that, it got intense for me specifically.  On 8 occasions I was slapped in the face moments after I layed down in bed.  It wasn't the falling feeling you get as you fall asleep, I was completely awake and aware.  There was an audible smack, and my head was forced into my pillow.  My face would be cold and all pins and needles, and every hair on my body stood up.  Every time.  Most times I would see a dense black figure in my bedroom doorway afterwards, and those were the only times I saw apparitions in that house.\n\nA little while after the slapping started, my grandparents came to visit.  My grandpa is very sensitive to spirits so I was interested to see what he felt.  Within minutes of coming into the house, my grandpa looked left to right, shook off a chill and said \"Whoa, you guys live in this joint?!\".  So that pretty much confirmed it for us, that we weren't crazy.  We told him about a little bit of the activity, but not everything, because it would have turned into a week long rant from my grandpa lol.  Anyway, the next day, I woke up and he was already awake.  He immediately lead me to the hall closet, where we all have always had the feeling that we were somewhere we shouldn't be.  He said he got up last night to use the bathroom and when he passed the closet, he was stopped and felt he needed to open it.  He said he saw a small dark wooden door with a silver metallic handle.  As soon as he reached for the handle, it disappeared all he saw was drywall. He then opened the closet door and pointed out to me that there was about a 5'x5' completely walled of space behind the closet, and the faint outline of a small door that had been drywalled shut.  Basically a small inaccessible room.  We tried to look up history on the house but couldn't find anything.\n\nShortly after I ended up moving out.  I've had a few other experiences since, but nothing like that house.  That house was proof beyond proof for me.  It got unnerving towards the end, but it hooked me into the paranormal.",
        "created_utc": 1538245727,
        "upvote_ratio": ""
    },
    {
        "title": "Veronica kept him company.",
        "author": "paranormalresearch1",
        "url": "https://www.reddit.com/r/Paranormal/comments/9jz6sz/veronica_kept_him_company/",
        "text": "In 2001 my youngest son was hit by a car. He was only 4 years old. It was very bad. He stopped breathing, his heart stopped and he was revived 3 times. The Neurologist told my wife and I that the injuries were severe and most likely he would not survive the night. We were devastated. He was in a coma naturally and also they added meds to make sure he stayed that way to keep his brain pressure down. He survived the night. About a week later he woke up. After they took out the breathing tube he could talk. He kept asking where Veronica was. I asked the nurses if one of them or one of their coworkers was named Veronica. They said no one worked there with that name. I asked him what she looked like. He said she was an old woman who talked funny. I asked if she was dressed like the nurses and he replied no she always wore the same clothes, a blue dress with yellow flowers. I asked what she said to him. He told me she would come stand by his bed, hold his hand, and tell him she loved him and everything would be ok. A few hours later my in-laws showed up. I told my father in-law about what my son was saying. He turned white. He said he knew who it was. It was his mother Veronica. She was from Slovakia and had a heavy accent. And she was buried in a blue dress with yellow flowers.   \n\n\nOur son is named Joseph Michael, we found out after he was born from my father in-laws older sister that they had an older brother named Joseph Michael who died in Slovakia at around 4 years old. My father in-law was the only one born in the U.S.   \n\n\nIf I would not have experienced it I would not believe it. But my son's great-grandmother reached out from across the grave to comfort her son's namesake. I also believed she helped to make sure we would not relive the tragedy she went through. Pure love is the most powerful force in the universe. It can break time and space boundaries.   \n\n\nJoseph is doing fine. He has issues from the brain injury but he is an intelligent 21 year old now. He still lives with us. Ever since he came home from the hospital all those years ago we have had many experiences with things paranormal happening too us. I wonder if since he died and was revived he is closer to that side and attracts ghosts. But those events I will write about later.",
        "created_utc": 1538244684,
        "upvote_ratio": ""
    },
    {
        "title": "Do you think my grandpa visited me?",
        "author": "wteverosie",
        "url": "https://www.reddit.com/r/Paranormal/comments/9jz40c/do_you_think_my_grandpa_visited_me/",
        "text": "So my grandpa and I were very close, but I didnt get a chance to see him before he passed because he didnt want me to see him in a state where he was hurting. So this past weekend was his birthday. I broke down crying once I remembered and I'm not quite a religious person, but he was and so I took it upon myself to try to talk to God or whoever is up there to send a message to my grandpa. I was crying uncontrollably for a good 5 minutes before all of a sudden I stopped and for some reason I felt more calm and relaxed which was strange because it happened all of a sudden like somebody snapped their fingers. I didn't really feel a presence, but for some reason I immediately thought of my grandpa. Do think it could've been him paying me a visit?",
        "created_utc": 1538244116,
        "upvote_ratio": ""
    },
    {
        "title": "what’s in the closet? me &amp; my friend we’re taking selfies and we noticed this in the closet. we took about 5 pictures in the same spot but this was the only picture that had this weird looking thing in it.",
        "author": "[deleted]",
        "url": "https://i.redd.it/bw51bnnrs7p11.jpg",
        "text": "[deleted]",
        "created_utc": 1538243029,
        "upvote_ratio": ""
    },
    {
        "title": "Eddie Redmayne Doppelgänger",
        "author": "josh-n5",
        "url": "https://www.reddit.com/r/Paranormal/comments/9jywf5/eddie_redmayne_doppelgänger/",
        "text": "[removed]",
        "created_utc": 1538242503,
        "upvote_ratio": ""
    },
    {
        "title": "Having breakfast at the Banta Inn, at the outskirts of Tracy, CA. One of the most haunted in California.",
        "author": "cooldrummer1208",
        "url": "https://i.redd.it/2oukggwxk7p11.jpg",
        "text": "",
        "created_utc": 1538240410,
        "upvote_ratio": ""
    },
    {
        "title": "The Shadow man outside in the rain",
        "author": "Shootingstargirl120",
        "url": "https://www.reddit.com/r/Paranormal/comments/9jyf96/the_shadow_man_outside_in_the_rain/",
        "text": "So a couple of years back I was staying with my mom in this fairly haunted place. It wasn’t to bad but definitely some weird shit happened while we where there. We would go ghost hunting a lot during that summer, have some interesting stuff happen but nothing stood out quite as much as this experience. \n\nA little back story: my mom, good guy friend, and I had gone ghost hunting in a old abandoned house. The whole place was set up pretty weird and we got some interesting things on recording, my mom got scratch marks on her back. Now this whole experience is a story for a different time what’s important to note is that while there we had found a old tin filled with photographs, a real silver spoon, and a victorian style brooch. I had commented about how much I loved the brooch to my mom but following ghost hunting common sense left the brooch in the tin where we had found it. Fast forward a few hours later where now home I'm going to shower and in my pocket is that damn brooch. \nWe had tried everything to get rid of it but it would always appear back in the house in the most random places. The activity in the house increased tenfold. Eventually my mom buried the brooch outside and placed protective crystals around the outside of the house. We didn’t see it again. \n\nNow it was a super dry summer, not uncommon for south Texas, so when my best friend Nala and I heard a loud thunderstorm started outside in the middle of the night we got super excited. Sense we where home alone that night we quickly threw on our shoes and bolted outside dancing and laughing in the heavy rain. It was a lot of fun till suddenly I felt pure fear start pumping threw my veins. My attention immediately snapped to where the brooch was buried at the same time a flash of lightning lit up the whole yard. I mean it looked like daylight outside for those few seconds. \nStanding there I saw a thick black shadow man with what looked like a top hat.\n\nIts so hard to explain the exact feeling but I knew I had to get inside that very moment. I immediately started running for the front door. I vaguely heard Nala running very close on my heals. We where struggling to get the door open. For some reason it just would not budge. Eventually we both managed to push the door open slam it shut and lock it. We turned to each other and at the same time spoke\n\n“Did you see that!?”\n“Did you hear that!?” \n\nBoth confused and a little terrified we explained what we had both meant. I told Nala about how I saw the shadow man. She had not seen him instead she had heard at the same time I saw the man a loud inhuman growl right next to her ear. Keep in mind I hadn't heard anything and the thunder for the lightning strike had sounded while we where running back to the house. This was not my worst experience but definitely in the top 3. I will never forget that raw fear I felt nor can I ever fully explain it. It was like my life was in danger. \n",
        "created_utc": 1538239258,
        "upvote_ratio": ""
    },
    {
        "title": "Cat comes back in dream",
        "author": "TrapSeppuku",
        "url": "https://www.reddit.com/r/Paranormal/comments/9jxy7h/cat_comes_back_in_dream/",
        "text": "So last night I saw what I think  to be my cat appear then I have this dream that he just came back from the window. We play snuggle and enjoy ourselves together until he starts falling apart later so he goes to the window again looking outside waiting for it to open. We open up the window and he goes outside I wave my hand out and he puts up a paw slightly before walking off and disappearing. My conclusion for him falling apart a bit was that he was staying too long or trying to keep his original form for too long.\n\nI dont know I just found this to be really pleasant and I am now crying a bit. Oh and I also remembered just now I also doodled out a cat last night.",
        "created_utc": 1538236150,
        "upvote_ratio": ""
    },
    {
        "title": "Strange deck of cards",
        "author": "chillxxplr",
        "url": "https://www.reddit.com/r/Paranormal/comments/9jxrap/strange_deck_of_cards/",
        "text": "Hello.\nWhile digging through some old stuff I found this smelly deck of cards which is split in 2 and a part of them is looking really bad and feels oily at touch and the other half is pretty normal, just a little yellow on the sides. When I touched the deck and started looking at it I have had a huge headache and I am not even joking. They feel strange and it s some sort of energy attached to them. I guess they were used in fortune telling or something else. There are also only a few cards used like 7, 10, J, Q, K, so please if you know anything related to this type of things give me some advice. What should I do with them?\nSorry for bad english. ",
        "created_utc": 1538234851,
        "upvote_ratio": ""
    },
    {
        "title": "After my grandfather died in 1976, he apparently stayed back a while to make sure my mom and grandma were doing ok.",
        "author": "GazeUponOlympus",
        "url": "https://www.reddit.com/r/Paranormal/comments/9jwxwr/after_my_grandfather_died_in_1976_he_apparently/",
        "text": "Never posted on here before, but my mom told me about this for the first time recently and I wanted to share.\n\nMy grandfather was diagnosed with a tumor in late 75 or early 76. He passed away about six months later, and his death was pretty hard on my mom and grandmother. They both reacted in different ways, but my grandmother became very depressed, he was her first love, been married for 26 years at that point. Mom was 15, grandma was 46, devoutly Catholic, and has always been. She denies anything ever happened if you ask her today.\n\nThis all took place in one location, my grandma's house in Buenos Aires, Argentina. From as far as I understand, nothing is connected to the land, it was just marsh or something before being converted to urban housing in the 50s. The only people living in the house were my grandmother and mother.\n\nMy mom says that the experiences started about a week after the funeral, for her at least. She would hear heavy footsteps in the hallways walking past her room back and forth late at night. This went on for some time, every night, maybe a week or so. She says they sounded like her dad pacing outside, but she didn’t tell anyone. \n\nThen on one night, she was in bed, trying to fall asleep, when the footsteps started up again. Except this time time, they walked to her door and stopped. Then the door, an old school heavy wooden door, unlatched and opened up. And then the footsteps walked over to the side of her bed and stopped. She says she was too scared to look up and just fell asleep with the sheets over her head.\n\nWhen she woke up, she says she was rattled but that she realized that it was her dad, and that he had just checked up on her, like he used to. The footsteps stopped after that. She’s says afterwards that it was like my grandfather telling her that everything was alright, like one last goodbye. \n\nAfter that experience, my mom finally brought it up to my grandmother. Her response is what makes this anecdote for me. After telling her about the footsteps and the door unlatching, my grandmother simply replied, and I’m paraphrasing, \"That’s possible, he’s been tucking himself into bed with me every night since he left.\" Mom asked to clarify and grandma said that she could literally feel/hear him walking to his side of the bed, and see the sheets move around as if he was getting in. Exactly like he was still there, just invisible. I like to think that he felt how sad she was and decided to spend a few more nights with her before moving on.\n\nNothing else happened to my mom, and my grandmother never mentioned anything about this to anyone, as far as I know. Don’t know for how much longer he visited her for. \n\nI understand this is probably just due to the stress and sadness of losing someone so close, but what they saw/heard seems a more vivid and believable than similar stories I’ve heard. Probably my own bias. Anyways, that’s it, not a whole lot, but I just wanted to share this little family ghost story. \n\n[UPDATE] Showed my mom the post this weekend and she said I messed up her side of the story a bit. When the footsteps got to her bed, she clearly heard her dad's voice telling her that everything was alright and that he also called her by his pet name for her. Just a few more details.",
        "created_utc": 1538229440,
        "upvote_ratio": ""
    },
    {
        "title": "Solar lights at the cemetery",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/Paranormal/comments/9jvxt9/solar_lights_at_the_cemetery/",
        "text": "[deleted]",
        "created_utc": 1538221356,
        "upvote_ratio": ""
    },
    {
        "title": "Ok guys, listen to this.",
        "author": "LegionaryDurian",
        "url": "https://www.reddit.com/r/Paranormal/comments/9jvws1/ok_guys_listen_to_this/",
        "text": "It may sound like I'm crazy religious. That's okay. I just want people to hear this. It was possibly 7:25 AM or earlier. I had woken up to me kind of half dreaming about finding a ghost with the face recognition my phone's camera has. Just then, a wave of pure chilled air and a feeling of semi-numbness and being short of breath. These feelings all started to go away as I thought about God, and how great and beautiful he is. I don't know what it was, but if prayer was needed, it can't possibly be good.",
        "created_utc": 1538221075,
        "upvote_ratio": ""
    },
    {
        "title": "I see “death” when a family member dies.",
        "author": "Avangelynn23",
        "url": "https://www.reddit.com/r/Paranormal/comments/9jvgyw/i_see_death_when_a_family_member_dies/",
        "text": "It all started when I was a little girl. I saw a black mist and it formed into the shape of a wolf/dog let’s call it a wolf. It has two red eyes with a red aura about it. I wasn’t scared, I had a calm feeling come over me. Days later my grandmas sister passed. I was too young to make the connection.\n\nFast forward to the day I actually died and came back. I was in the hospital for over a week stabilizing from a stroke. I was 21 years old. When I came home I woke up feeling an energy bursting inside my body. I opened my eyes and looked around my room and I saw the wolf sitting on my dresser looking at me for a good long moment before it jumped across my room and into a black tunnel, the tunnel closed behind it. I wonder if it was checking on me.\n\nIn 2016 I was awakened and I saw it above me in an orb form, a black misty orb with a red aura. I tried to shoo it away because I was annoyed to see it again. I got an image of my grandma. Days later she passed.\n\n2018, I saw it again in its wolf form in my dream this time. Two days later my 16 year old cat was ready to pass away. He was suffering that day. I took him to the vet and held him as they put him to sleep.\n\nI get the sense that this might be a family guardian but it appears to me in a wolf form because it’s one of my favorite animals. I think it’s telling me so I can spend time with that family member before they pass. I always get the image of the person who will pass before the wolf leaves. I assume that family guardians appear in all types that connect to that person who is seeing it.\n\nI wish I could tell my dad about it. Telling my mom is out of the question, but I just want someone to believe me when I tell them to be careful when I see it.",
        "created_utc": 1538216573,
        "upvote_ratio": ""
    },
    {
        "title": "Weird angel-shaped thing in an old photo I took in my old house",
        "author": "ZathBF",
        "url": "https://www.reddit.com/r/Paranormal/comments/9jvgac/weird_angelshaped_thing_in_an_old_photo_i_took_in/",
        "text": "So for some background context, was looking through my old phone’s camera roll and spotted a odd angel shaped thing in one of my pictures. I took this picture in 2014 when I was in the process of moving out. Honestly i am kinda creeped out by it, it kind of looks like to have a pair of eyes upon closer inspection. Anyone has any clue what this may be?\n\n\nhttps://imgur.com/a/JuV2Mv8\n\n\nEDIT: For a more zoomed out version\n\nhttps://imgur.com/a/xhCOA2D (took it as a panorama)",
        "created_utc": 1538216328,
        "upvote_ratio": ""
    },
    {
        "title": "Weird angel shape in picture",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/Paranormal/comments/9jveqr/weird_angel_shape_in_picture/",
        "text": "[removed]",
        "created_utc": 1538215725,
        "upvote_ratio": ""
    },
    {
        "title": "This has been happening for the last week or so",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/Paranormal/comments/9jvef5/this_has_been_happening_for_the_last_week_or_so/",
        "text": "[deleted]",
        "created_utc": 1538215619,
        "upvote_ratio": ""
    },
    {
        "title": "Strange thing caught on camera",
        "author": "[deleted]",
        "url": "https://www.dailymotion.com/video/x6uemgy",
        "text": "[deleted]",
        "created_utc": 1538215617,
        "upvote_ratio": ""
    },
    {
        "title": "The riddle of the Swiss watch in the tomb of an emperor from 400 years ago",
        "author": "LoudFlatworm",
        "url": "https://dailymagazine.top/the-riddle-of-the-swiss-watch-in-the-tomb-of-an-emperor-from-400-years-ago/",
        "text": "",
        "created_utc": 1538215364,
        "upvote_ratio": ""
    },
    {
        "title": "Real ghost caught on camera",
        "author": "sanjay882",
        "url": "https://youtu.be/yfbfFwMXZ94",
        "text": "",
        "created_utc": 1538211615,
        "upvote_ratio": ""
    },
    {
        "title": "My passed cousin came to visit me a last time..",
        "author": "Romsisco",
        "url": "https://www.reddit.com/r/Paranormal/comments/9juvtx/my_passed_cousin_came_to_visit_me_a_last_time/",
        "text": "So, my cousin 42 years old who i really loved, passed away this april 2018. He died cause of a heartattack in the middle of the night. His father found him dead in his chair in his room. \n\nAll we know is that my cousin woke up in the night, out of his bed cause he didnt feel good and he felt that his nose was bleeding. He stood up to grab a tissue and wipe the blood off and then he got a heart attack and died :- (\n\nThen in the early morning around 4 a.m. my aunt called me and told me that he passed away... i couldnt realize that my cousin wasnt alive anymore...how and why.. i asked myself..\n\nSo at his funeral i was one of few persons who cried very hard and couldnt stop. I miss him til today and i will always have him in my heart. \n\nTo get to the point, after about 10 days or more, i went to sleep at home, i slept in the living room on the couch, my pc and tv are in the living room aswell. \nSo, i started to have a dream about my cousin. He was sitting right next to me and i was like...\"wow is that really you? How long are you gonna stay?\" And he replied \"god sent me here but i dont know when he's gonna take me away again\" i was sooo happy to see him and i said \"okay, come with me into the other room, i wanna tell everyone that you are here with me\" so he came with me from the living room into another room in my appartment where my dad and other family members were and before i could tell everyone that our cousin came to visit, a very loud and huge wind came and he disapeard. So i turned back to see where he was and he was gone...(god must have taken him at that point, or maybe he was only allowed to visit me or only wanted to visit me, dont know exactly..)\n\nThen i woke up cause it felt good to see my cousin again even if it was a dream, but the thing that made me know that he visited me is that my pc turned on itself after i woke up... it never turned on again after this night and never turned on before this night..\n\nI told this to my mom and she said, after a person dies, it takes 40 days for their soul to move on. Within those 40 days the soul of this person wanders around and visits the people that were important in their life...\n\nI know that my cousin is in good hands right now but even though i miss him very much and i will never forget him :- (",
        "created_utc": 1538208454,
        "upvote_ratio": ""
    },
    {
        "title": "Demon house documentary",
        "author": "forksonly",
        "url": "https://www.reddit.com/r/Paranormal/comments/9juuwh/demon_house_documentary/",
        "text": "Hello guys I recently watched the demon house movie by the guy from ghost adventures.\nIn the beginning of the movie zak talks about watch at your own risk this story is curse.\nWas wondering if there is any evidence to back this up????.",
        "created_utc": 1538208110,
        "upvote_ratio": ""
    },
    {
        "title": "The old doll boxes",
        "author": "Ennerey",
        "url": "https://www.reddit.com/r/Paranormal/comments/9juueq/the_old_doll_boxes/",
        "text": "So when I was in college, I lived in a house with a ton of people. My college had a weird housing arrangement where instead of dorms, you applied to live in a house with people who shared your interests. My house was all theater kids, and wasn't technically owned by the school. They rented it from a guy in the town the school was in. We'd always wondered what was in the attic, and eventually one guy moved in who knew how to pick locks. He got the door open, and we saw what was probably an old bathroom. Toilet with piping sitting in a room. We also saw a ladder to the true attic. Climbing up, we saw what must have been 100+ German doll boxes. All empty. We left it all alone, as we were a bit creeped the fuck out by the whole thing. Except, we didn't re-lock the door. A week later, the guy who picked the lock starts talking about how he got sleep paralysis and felt that something was coming to drag him into the attic. Next day, his roommate. We were starting to get kinda weirded out by this, especially because they were next to me and my roommate, as well as four others, at the top floor of the house. Every night, someone new on our floor was stuck while something was coming for them. I got hit last before we realized we'd never locked the door. I was settling in for bed, with my girlfriend next to me. Suddenly I couldn't move. Something was coming down the hall. I tried to say anything but my voice wouldn't work. My girlfriend was laying on me and didn't wake up. My roommate was still snoring in his bed. The door opened and what felt like an absence of being came in. It was nothing, to a degree that wherever it was, there was absolutely nothing. I could feel actual pain as something touched my leg. At this point mentally I was freaking out. I'm sure my heart was going a mile a minute. I felt a tug. Like it was trying to pull me out of bed. I tried my best to move or do something but my body wouldn't respond. I felt it let go of me, and go back down the hall. Heard the attic door open and close. In the morning, we tried the door and found it unlocked. The guy who opened it locked it again. We found out the next week thanks to a call from the house owner's wife that he was dead. Heart attack in his bed. We never opened that attic again and I hope still that nobody who lived in there after us did either.",
        "created_utc": 1538207916,
        "upvote_ratio": ""
    },
    {
        "title": "Demon house documentary",
        "author": "forksonly",
        "url": "https://www.reddit.com/r/Paranormal/comments/9juq60/demon_house_documentary/",
        "text": "[removed]",
        "created_utc": 1538206276,
        "upvote_ratio": ""
    },
    {
        "title": "Google Home mini",
        "author": "milly7810",
        "url": "https://www.reddit.com/r/Paranormal/comments/9jukh1/google_home_mini/",
        "text": "Has anyone ever had this happen? About a month ago I was home alone, (besides my dog) as I was walking from the living room to go out on the back porch I hear a woman’s voice say “ BOO!” Really loud! It literally sounded like someone was in my hallway. It startled me and I froze and spun around ( wondering who or what the hell said that) as I turned around the voice says sarcastically “ Gotcha!” I then realized it was my google home mini! I don’t know if this is something that is normal or not? I try to say “ boo” to her so maybe she will say it again but she will just say I don’t understand try again later? Has anyone with google home ever experienced this?",
        "created_utc": 1538204305,
        "upvote_ratio": ""
    },
    {
        "title": "Pact with the devil.",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/Paranormal/comments/9ju0uq/pact_with_the_devil/",
        "text": "[deleted]",
        "created_utc": 1538197652,
        "upvote_ratio": ""
    },
    {
        "title": "Old journals from my family that date back to the 1800s",
        "author": "Darkemperor101",
        "url": "https://www.reddit.com/r/Paranormal/comments/9jtxk3/old_journals_from_my_family_that_date_back_to_the/",
        "text": "In this journal i found in a hidden room i never knew existed in my house contained a dipiction of a person, the text right next to it said that Vampires and werewolves used to roam freely till a shaman put a curse on them to limit their power. Im not sure what to do with this information.",
        "created_utc": 1538196624,
        "upvote_ratio": ""
    },
    {
        "title": "My friend needs help.",
        "author": "Miki_Titan",
        "url": "https://www.reddit.com/r/Paranormal/comments/9jtw4h/my_friend_needs_help/",
        "text": "Recently my friend has been acting... off and it all started when he found a Spirit Ring in his pocket which he doesn't know where it came from because it wasn't in his pocket ten minutes before but ever since then he's been acting really strange, he's started hurting himself and he doesn't seem like he's him, he's like an entirely different person and I feel like it has something to do with the ring and a really bad spirit but I don't know what to do about it and we're all worried he's going to kill himself if we don't do something about it so if anyone knows anything about this sort of stuff help would be great.\nEDIT: I would also like to add that he has been changing his personality very rapidly i.e He'd be super happy one minute then hurting himself the next or the other way around\nUPDATE: We got him to take off the ring today and he threw it into the sewers, as soon as he did that the tension in the air faded, he seems to be better but it's too early to tell",
        "created_utc": 1538196181,
        "upvote_ratio": ""
    },
    {
        "title": "Ghost face on old birthday video?!",
        "author": "Joelbotics",
        "url": "https://www.reddit.com/r/Paranormal/comments/9jtoet/ghost_face_on_old_birthday_video/",
        "text": "I wanted to share this clip which was recorded from a vhs of my 6th birthday party. My immediate family and I would watch it periodically because it's one of the few videos with most of us together. One time we watched it and somebody noticed something peculiar in the background on the kitchen wall.\n\nI'm a highly skeptical person by nature, so the paranormal doesn't ever really appeal to me. But I'll be damned if that doesn't look like some skeletal demon face looking down on my family like it's mother\\*\\*\\*\\*\\*\\*\\* insidious up in here.\n\nWhat do you guys think?\n\n&amp;#x200B;\n\n\\*sound for added creepiness \n\nhttps://reddit.com/link/9jtoet/video/931idfwdq3p11/player",
        "created_utc": 1538193872,
        "upvote_ratio": ""
    },
    {
        "title": "Funny paranormal podcast",
        "author": "Rabbid1997",
        "url": "https://www.reddit.com/r/Paranormal/comments/9jstou/funny_paranormal_podcast/",
        "text": "[removed]",
        "created_utc": 1538185628,
        "upvote_ratio": ""
    },
    {
        "title": "A little boy with black eyes was watching me in the shower",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/Paranormal/comments/9jspyn/a_little_boy_with_black_eyes_was_watching_me_in/",
        "text": "[deleted]",
        "created_utc": 1538184654,
        "upvote_ratio": ""
    },
    {
        "title": "my friend got possessed",
        "author": "makellamarie",
        "url": "https://www.reddit.com/r/Paranormal/comments/9jspiw/my_friend_got_possessed/",
        "text": "when I was in high school my friend moved into a farm house. that house had a barn and a basement that stairs that lead to nowhere. the previous owner killed himself in the barn because the “resident told me to” (according to his letter) when moving into this house my friend would never step into the barn. not once would she even walk towards it. we thought it would be fun to have a séance because we were young and stupid. we had the candles and everything. I was sitting next to Katie, the one who lived there, and all of a sudden when asking if whoever was there could show themselves. Katie then squeezed my hand so hard. the candle light wavered and she turned her head so slow to meet my eyes. what she said I will never forget. “let’s go to the barn. someone there wants to talk to us.” I let go her hand and stood up. my other friends there turned on the lights and she  blinked at us. “what happened?” to this day she can’t remember that night. a week after our seance. her dad was found in the barn. he shot himself and in his letter he said “i’m sorry. i had to listen.” as if something told him to do it. this is a true story. it could have been coincidences back to back. but it will always scare me shitless ",
        "created_utc": 1538184538,
        "upvote_ratio": ""
    },
    {
        "title": "My son saw a ghost - advice",
        "author": "RdexaMdexa",
        "url": "https://www.reddit.com/r/Paranormal/comments/9jslg4/my_son_saw_a_ghost_advice/",
        "text": "My son is 2.5 years old and is VERY intelligent and articulate. He speaks full sentences and had meaningful conversations. Tonight, as we were lying in my room while I was putting his baby brother to sleep, he suddenly sat up and pointed to the other side of the room. He asked, \"Is that me, Mama?\" I asked, \"Where? You're right here\". He said, \"Where I'm pointing. It's a ghost. I see a shadow. It's a ghost.\" He now won't go back into my room because he says, \"I'll see the ghost again.\" He's also gotten up a few times over the past few months SCREAMING and unable to tell me what's wrong. I feel like it's connected, considering when he usually gets up, he'll tell me, \"I need more milk\" or \"new diaper\", etc. What do I do?",
        "created_utc": 1538183501,
        "upvote_ratio": ""
    },
    {
        "title": "On patrol",
        "author": "RiveaJ",
        "url": "https://www.reddit.com/r/Paranormal/comments/9jsl6g/on_patrol/",
        "text": "When I was a child I used to stay with my grandmother a lot and stay in my mother's old bedroom.\n\nI woke up one night seeing a spirit that looked like it was hanging in the corner of my room. I remember being scared but didn't feel threatened.\n\nMy grandmother's side of the family are firm believers of this sort thing and the question of what happens after life was something I had spoken about with my mother and grandmother before. The next day I told my grandmother what had happened.\n\nMy grandmother called my mother to tell her what I saw. My mum informed my grandmother that she had saw a similar thing when she was still living at home, which was well before I was born, and she had called the spirit Fred.\n\nMy grandmother mentioned it to her next door neighbor who had lived there a lot longer than my grandmother. Her neighbor informed her that retirement home behind their house had once been an old waterworks and there had been a warden who had sadly committed suicide there by hanging.\n\nThey lived on the sort of street where everyone knew everyone and it was brought up among a few of the other neighbours who also mentioned they had seen a similar thing.\n\nIt seemed like Fred was on patrol around the street and had been checking in on everyone!\n\nWhen talking about it now, my grandmother mentions that when my grandad was about to come home drunk and cause trouble she would always see a dark shadow at the top of the stairs, or see shadows move under the doors. She's convinced that it could've been Fred looking over her, protecting the houses he would've been responsible for while he was still among the living.\n\nHas anyone else had an experience that's shared by neighbours in this way?\n\n",
        "created_utc": 1538183425,
        "upvote_ratio": ""
    },
    {
        "title": "Does anyone use the Ouija Board outside?",
        "author": "FreeStuffGuru",
        "url": "https://www.reddit.com/r/Paranormal/comments/9js56i/does_anyone_use_the_ouija_board_outside/",
        "text": "Seems I always hear about people using it inside. Anyone have a good experience with one? My friend mentioned earlier they've had one in their closet for ages and I asked to borrow it. I've never touched one before. For some reason, I feel like I need to use it outside. I have no idea why. But I've never heard of that before, and I'm not sure why.",
        "created_utc": 1538179414,
        "upvote_ratio": ""
    },
    {
        "title": "Disturbing investigation, Helltown",
        "author": "JoeyMossBBG",
        "url": "https://youtu.be/UCUicJFW6Xg",
        "text": "",
        "created_utc": 1538178075,
        "upvote_ratio": ""
    },
    {
        "title": "A strange light that follows me. (Possible UFO??)",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/Paranormal/comments/9jrzl2/a_strange_light_that_follows_me_possible_ufo/",
        "text": "[removed]",
        "created_utc": 1538178025,
        "upvote_ratio": ""
    },
    {
        "title": "Looking for a ghost video, have you seen it ??",
        "author": "iloveroisinmurphy",
        "url": "https://www.reddit.com/r/Paranormal/comments/9jryou/looking_for_a_ghost_video_have_you_seen_it/",
        "text": "[removed]",
        "created_utc": 1538177810,
        "upvote_ratio": ""
    },
    {
        "title": "My dad says hi from heaven",
        "author": "mama_mo",
        "url": "https://www.reddit.com/r/Paranormal/comments/9jrumx/my_dad_says_hi_from_heaven/",
        "text": "My dad and I had a wonderful relationship. We were friends. Buddies, really. I could talk to him about anything and he gave the BEST advice.  I was 32 when he died in 2015 and I miss him terribly and think of him often. Growing up we would always talk about his grandma who he called Little Mama (he was practically raised by her since my grandma was only 16 when she had him in 1941. She died before I was born.). She was also supposedly psychic - as in she knew if someone was coming over unannounced and would have a full dinner waiting on the table for them when they arrived and she could reportedly see dead people (this has been confirmed by many family members). One of my favorite stories that my dad used to tell is immediately after she died she visited him before she moved on. He was driving through the Cajon Pass in Southern California and she appeared in his truck right next to him to tell him she loved him. Once he was able to get to an exit he pulled over and called home and confirmed that Little Mama had passed just a few minutes earlier. It was something that I always thought was special.  \n\n\nFast forward to 2015. My dad had been sick for several years with heart disease and recently had a series of strokes. I had spoken on the phone with him just a few hours earlier and I remember he had this indescribable cough that actually made my stomach clench when I heard it. After telling him I loved him, I hung up the phone and told my husband I thought he was going to die very soon. That evening I was giving my 15-month-old a bath and all of the sudden I had images of my dad flash before my eyes like lighting bolts one after another. Boom, boom, boom, boom. I felt him. I saw him in my head. The images were so clear and bright. And, at that moment I said a little prayer to God asking him if this is my dad's death, please, please make it quick and painless. I then finished up my son's bath and got him ready for bed.   \n\n\nAbout 20 minutes after that strange experience I received the call that my dad had indeed passed away right about the time that I was receiving that message.  Needless to say, I was distraught. I realized that it really was my dad coming to say goodbye to me and that he was at peace. My mom was hysterical on the phone and I immediately began telling her that it was okay. That HE was okay. He visited me already and let me know that everything was going to be fine. He wasn't suffering any longer and that gave me peace. Later that night I was standing in our bedroom trying to pack a travel bag (I live in Northern California while my parents lived in Southern California, so I had to book a flight for the next morning) and I felt him hug me. My dad was huge. His hands were like bear paws. He filled a doorway whenever he walked into a room. I can only describe the feeling as I felt him wrap his arms around me and squeeze as if he were telling me that everything was going to be okay. I remember looking up at my husband at that moment and telling him that my dad was hugging me. It felt so real, but no one was there. I'll never forget that feeling. And, I'll never forget knowing my dad died before receiving that call.   \n\n\nSince then he has visited me several times. Twice he's flipped my radio from FM to AM while I was driving. Both times were during pretty big events in my life. The first time was the day I found out we were having twins about 9 months after he died. I was on my way from the doctor's office after receiving the news and I had the radio on, but wasn't really paying attention to it since I had just received the most shocking news of my life. I froze when it flipped since I had had both hands on the wheel and it was an older vehicle that didn't have controls on the wheel itself, rather you have to push the button below the volume button on the console. When it happened I just said out loud, \"hi dad! Can you believe this?\" The second time it happened a few months later when I was driving and heavily contemplating us putting an offer down on our current home (we had to sell our first house for a larger one to accommodate our now 3 children and my mother). When it flipped from FM to AM I knew that it was my dad encouraging us to buy our current home. I said, \"thanks, dad!\" \n\n&amp;#x200B;\n\nHe's also made his presence known in other ways. After he died, we immediately moved my elderly mom in with us and left their home vacant for a few months. We had a bit of a shady caretaker live on the property in a motor home to watch over everything, but he was good to my dad before he died, so we asked him to stay. In the meantime, my cousin happened to drop by to make sure the house was secure and he found the caretaker selling drugs to some neighborhood tweekers that my dad hated. The caretaker KNEW my dad hated these guys. My cousin confronted him about it while standing in the side yard driveway (this is important because the when my dad bought the house he built an entire retaining wall of boulders and rocks spanning nearly half an acre that had been there for 20+ years. To this day I have NEVER, EVER seen a rock fall from that wall) They were yelling at each other when a rock that couldn't have weighed less than 50lbs or so literally popped out from the retaining wall, flew about 6 feet in the air and landed at their feet. They both froze and looked at each other and my cousin said, \"I guarantee you that was Uncle Bob telling you to knock it off!\" I talked to both of them separately after this incident and they both had the same story. It makes me laugh to this day. ",
        "created_utc": 1538176804,
        "upvote_ratio": ""
    },
    {
        "title": "Is my cobain car air freshener making me delusional ?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/Paranormal/comments/9jrnor/is_my_cobain_car_air_freshener_making_me/",
        "text": "[deleted]",
        "created_utc": 1538175211,
        "upvote_ratio": ""
    },
    {
        "title": "Chair Moved Across The Room",
        "author": "cellardoor434",
        "url": "https://www.reddit.com/r/Paranormal/comments/9jrhdb/chair_moved_across_the_room/",
        "text": "In my early 20s I was having a religious crisis. I didn't believe in the god my parents had raised me to believe in, so one day I was praying really hard about my disbelief and said \"if you're real, move this chair across the room.\" My husband came home from work a few hours later, sits in the rolling chair and says \"hey, you should push me across the room in this chair!\" I hadn't said a word to him about what I prayed, and unless he had installed secret cameras he would have had no idea. He had never asked me to push him across the room before, and never did again. I just smiled and pushed him across the room, then told him what I had prayed about. He didn't seem to think it was strange, but I still wonder what the heck made him want me to push him across the room in that chair, since even after that I'm not so convinced the Christian god exists. Maybe some other entity, or maybe some kind of telepathy lingering in the air and he picked up on my thoughts? I don't know.",
        "created_utc": 1538173764,
        "upvote_ratio": ""
    },
    {
        "title": "I love paranormal shows like a haunting. On occasion I’ll notice inconsistencies with the episode and the case if available online. Has anyone’s story been featured? Did they leave anything out that you think they shouldn’t have.",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/Paranormal/comments/9jrcmk/i_love_paranormal_shows_like_a_haunting_on/",
        "text": "[removed]",
        "created_utc": 1538172719,
        "upvote_ratio": ""
    },
    {
        "title": "I love paranormal recreation shows like “A Haunting” occasionally I’ll notice inconsistencies from the episodes to the actual case if their story is available online. Has anyone’s story been featured on one of these shows? Did they leave anything out in the episodes that you think shouldn’t have?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/Paranormal/comments/9jr71y/i_love_paranormal_recreation_shows_like_a/",
        "text": "[removed]",
        "created_utc": 1538171516,
        "upvote_ratio": ""
    },
    {
        "title": "Haunted Hungarian Souvenir",
        "author": "K_rose315",
        "url": "https://www.reddit.com/r/Paranormal/comments/9jqxbf/haunted_hungarian_souvenir/",
        "text": "My dad travels around the world and brings back a lot of cool souvenirs from the countries he visits. One of my favorites is a hand-carved and painted wooden figurine from Hungary. It’s supposed to resemble a Hungarian dancer, with detailed floral designs on its red dress and a red and white headpiece on top of its head to match. I have it on top of my dresser near my bed and for the longest time nothing happened. But starting from late last year I noticed the figurine starting to move. It didn’t move when I was in the room but let’s say I placed it straight forward facing the wall. Then hours later when I return to my room it would have moved forward a few inches and either turned to the left or to the right. I didn’t really know what to think at the time so every time I noticed that the figurine had moved, I just straightened it out again back into its place. I don’t know why it turns left on some days and right on others, my bed is to the left, so sometimes I wake up to it facing me. If it is paranormal it doesn’t have a lot of energy since it can only move so far. Most I’ve seen it move forward was probably 4 inches. I don’t know where exactly in Hungary my dad bought this, maybe he bought it when it was haunted or maybe something happened to it when it came here to America. It’s actually cool to come home and see what the figurine did during the day. It’s strange how any object can be vulnerable to a haunting. ",
        "created_utc": 1538169484,
        "upvote_ratio": ""
    },
    {
        "title": "Does anyone have any answers for seeing a quick black flash before their eyes? In multiple locations?",
        "author": "Nerdork86",
        "url": "https://www.reddit.com/r/Paranormal/comments/9jqs4l/does_anyone_have_any_answers_for_seeing_a_quick/",
        "text": "This is only happened twice and both recently (and no, it's not me blinking). \n\n1st occasion was last week at work, in day light (bright sunny day here) but it was indoors in our warehouse.\n2nd occasion was just about an hour ago in my home, in the kitchen but night time. \n\nIt just looks like something zoomed by my eyes, extremely, extremely quickly, blocking out my entire field of vision but so quickly it doesn't register straight away. I never felt anything. No wind, no movement, no static, no pressure changes, no atmosphere to these incidents. \n\nHas this happened to anyone? I don't want to say it's shadow people because that hasn't happened in our house in almost over 15 years and those were the only major events in this house, plus I don't know the history of my work place but a number of odd things have happened there to myself and my colleagues.\n\nJust looking for answers.",
        "created_utc": 1538168435,
        "upvote_ratio": ""
    },
    {
        "title": "My friend and I spoke to a ghost",
        "author": "Dongjuanfooey",
        "url": "https://www.reddit.com/r/Paranormal/comments/9jqmy3/my_friend_and_i_spoke_to_a_ghost/",
        "text": "I was 13 and I was sleeping at my friends house down the block. It was night time and My friends brother had spent most the night at an abandoned psychiatric center in a neighboring town. He told us about some stuff that supposedly happened to him and his friends. He told us they couldn’t leave the way they entered so him and his friends ran to the other side of the building and as they passed each room the light inside would turn on. We didn’t believe him at first but I think something followed him home\n\nWe were playing video games as the night wore on and we were being bothered by a light next to my friends futon that was flickering. It was around 10 pm. One of us said something to the effect of “stop doing that” to the light as a joke. But the light did stop flickering. It stayed on and it hadn’t since we switched  the light on. This caught our attention. Then we told it to start flickering again. Which it did. This is nothing crazy but it definitely caught our attention. The light seemed to be listening to us, but that seemed like we were over analyzing it. But eventually we started asking it to turn on and off in specific patterns, which it started to do. stay off 5 seconds blink 3 times stay on for 5 seconds blink 7 times and stay off for 8 seconds. Stuff like that. We would usually begin and end the patterns with staying on or off for a certain amount of time. Then it would go back to basically being on and flickering. But then we would state a pattern and it would stop flickering then either stay on or off for however many seconds we said, and then light up and turn off in even steady intervals to show our patterns, then go back to flickering. It wasn’t natural. It was like someone was turning it on and off with a switch, but it wasn’t connected to a switch on the wall. It was like a novelty beer glass with a light in it.  Not a regular lamp like you’re picturing. It’s on/off switch was one of those wheel things along the cable of the plug. There was no way to turn it on and off remotely. And it did these patterns PERFECTLY. Me and my friend continued to tell this light to perform patterns by lighting up and turning off. We did this for HOURS. I cannot emphasize enough that it did not mess up once. It was never just “close enough.” If we told it to “stay on” It would stop flickering and stay on and work properly until we told it to do something else. or it would stay totally off if we told it to. It would stay on or off for any amount of time we asked, even minutes at a time. like we could tell it to turn off and come back on at a certain time, or vice versa. It would do exactly what we said as soon as we said it. It was just impossible to be that accurate by chance. It was perfect, every time, for hours. These patterns got more and more complicated and long as we continued to do this and not once did it not perform the EXACT pattern we dictated. But one particular thing I remember is me telling it to blink 300 times. And then it started rapid fire blinking super fast. Way faster than it had the whole night prior. And as I was watching it blink at super speed, I said “stop.” And the millisecond that that word came out of my mouth it stopped. Wasn’t complicated but it was unique. we didn’t ask it to blink that many times in a row before and when we did it just took off. Then stopped immediately after I said “stop.” It was definitely listening to us.\n\nEventually we knew somebody was responding to what we were saying. We thought maybe that his brother had found a way to mess with us through the light. But we couldn’t figure out how. The same outlet that the light was plugged into had an alarm clock plugged in as well, which was acting totally normal. So we knew he wasn’t messing with the circuit breaker or anything like that because you can’t control that one single plug in an outlet from his circuit breaker. His neighbor was also a cop so we wondered if maybe his son had found some sort of equipment that we didn’t know about and was somehow using it to control the light remotely, while listening to us. Even though the TV and AC were on and we were speaking pretty softy. so it would be hard to hear us clearly through the extra noise if someone was using some sort of device.  But we were Just basically running through everything though. So in order to rule this stuff out we decided to ask the light questions. Questions it could answer via lighting up and turning off basically. And questions we knew his brother or his neighbor, or anybody really didn’t  know the answers to. I have a huge family so I had distant members his family didn’t know, and a lot of questions to ask. This was essentially “I’m thinking of a number,”  and it would steadily light up and turn off the number of times in my head then go back to flickering. I asked it questions I knew no one in his family or his neighbors knew, and my friend asked questions about people I’ve never heard of and I’m sure my family hadn’t, in case someone from my house was outside my friends house to mess with us, and answering my questions. \n\nAn example of how I would ask a question is this. I would say “stay off for 10 seconds then tell me how many kids my Aunt Joan has then stay off for 20 seconds” and it would go from being on and flickering and then turn off for ten seconds, then if my aunt Joan has 6 kids it would turn on and off 6 times, then it would stay off for 20 seconds. Just like I said.  I would then say something like “stay off for 8 seconds and tell me how many letters are in the name of her oldest child then stay off for 3 seconds.” It would answer. Then go back to flickering. I would say “stay on(stop flickering and stay lit is what we meant when we said “stay on”) until 12:48 or whatever time and then turn off for ten seconds and tell me how many of her kids are boys then stay off for 20 seconds.” And the light would stop flickering and stay lit and we would watch that alarm clock that was next to this light until it turned that time(usually just a couple minutes) and the second the clock turned 12:48 the light would turn off for exactly ten seconds, and blink the right number, then stay off for 20 seconds, then go back to flickering. “How many letters are in her youngest child’s name? her second oldests name?” etc. \n\nAnd I would ask it a million questions just like that. Of course you could guess the answer to some of those questions by just throwing out numbers. But I went through my whole extended family that I could remember like this. That’s a lot. It turned on and off corresponding to the number in my head each and every single time I asked it a question.  my friend said the answers to his questions were correct too. It couldn’t have been his brother or anyone messing with the lights.  They didn’t know any of my cousins or anything like that.  Realistically no one would have been able to hear us anyway.  Spy equipment or not lol.  We were purposely being very quiet and had the TV pretty loud and the AC was on. The only person it could have been was my friend next to me. But we were holding hands the whole night, most of the times all four hands were involved lol, so he wasn’t controlling anything without my knowledge and I knew he didn’t know the name of my uncle that died as an infant and various other questions I asked it.\n\nEventually we saw no other way. There was actually a spirit or something in that room next to us, and we were openly communicating with it. We never held a seance or anything like that. It just showed up. \n\nWe were slowly getting very scared, I remember we were holding hands so tightly. But once we decided this has to be something else, we asked it questions about itself. Again, questions it could answer numerically or yes or no( it was pattern A for yes, pattern B for no kind of thing). What I remember is getting that this was indeed a human that had died, it was a he, he was African American, and was aged 13 when he died and that he had been a patient at the abandoned psychiatric center near my town before it had shut down, the one my friends brother had just visited(maybe it came home with his brother?). But who knows if that’s true?  If it can communicate it can lie. Maybe it was an Alien. Seemed like it could read minds or it actually just had knowledge about our families. It said God and the Devil are real. I don’t remember everything we asked it. Just random things like asking if it was the same ghost that visited any of my siblings cause they had some weird stories. It said No.  we asked if he knew who had haunted them. Said yes. We asked if it would come back. Said No. we asked if it wanted to hurt us and it said yes. It also said it was going to kill us when we asked, and when we asked if it was going to kill us that night, it said yes. It did not however\n\nI remember being terrified but also remember laughing a few times. Like me and my friend were holding hands, and had our other hands on top of our held hands, so it was like we were holding all four hands in a big ball. We just couldn’t hold hands hard enough lol. Towards the end though we were asking it questions about kind of goofy ways it might kill us. Like were there syringes with something deadly in our shoes or was it gonna poison our milk in our cereal. It said it was gonna kill us that night after all. So I remember laughing at some of those.  It said yes to every way of killing us lol. Eventually around 6 am I remember just going and unplugging the light. We didn’t want to before that, because scared as we were, this was the craziest thing ever and we weren’t sure if unplugging it would make it just stop, but a little while after getting into the whole killing us thing we decided to unplug it. It was early in the morning by that time anyway. Apparently the spirit realm still requires electricity though, so nothing continued after it was unplugged. We went and had breakfast with his father who was visibly confused but not very concerned with what we were saying when we shared our experience. That was just that. Nobody believed us and life went on\n",
        "created_utc": 1538167357,
        "upvote_ratio": ""
    },
    {
        "title": "I got a wrong number call from the future?",
        "author": "Brunsui",
        "url": "https://www.reddit.com/r/Paranormal/comments/9jqgk2/i_got_a_wrong_number_call_from_the_future/",
        "text": "I got a wrong number call around one week after me and my friend encountered a demon or poltergeist of some sort. It was around 2:00 PM when I was taking a nap on the hammock on our front porch when my phone, which was on the table beside me, started to ring very loudly and woke me up. I picked it up and there was just silence for awhile. It was an unknown number so I thought it was that life insurance agency or whatever that always calls me instead of my father because they got the numbers mixed up, but this time it was only silence on the other end.\n\nI said, „Hello?” and strangely, after five minutes of me refusing to hang up, I heard a small voice on the other line saying hello in German. I speak Swiss German as I was born in Zurich, but this was actual German from Germany. For those who don't know, Swiss German and German are like British English and American English, we pronounce things very differently but still manage to understand each other to some extent.\n\nWhat I heard on the other line, however, was broken German saying something about how a little girl named Matilda should return to Croatia with her father because of the nuclear bombs in Germany, and that was the only thing I could hear besides all the static in the background.\n\nAfter the static they just hung up. It could have been a prank call but it just felt strange. My phone was starting to act up afterward, which is quite strange as it is brand new and barely used. ",
        "created_utc": 1538166028,
        "upvote_ratio": ""
    },
    {
        "title": "Dreams of my dead stepdad.",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/Paranormal/comments/9jqg3z/dreams_of_my_dead_stepdad/",
        "text": "[removed]",
        "created_utc": 1538165934,
        "upvote_ratio": ""
    },
    {
        "title": "I left my house in a panic at 3:30 am last night",
        "author": "asidoe",
        "url": "https://www.reddit.com/r/Paranormal/comments/9jq215/i_left_my_house_in_a_panic_at_330_am_last_night/",
        "text": "I’ve known my House was haunted and I posted abt it a couple times in this subreddit. Nothing paranormal happened for a while until last night.\nI was trying to sleep at like 2? and there was this tapping around my room. It was so weird. Just sounded like someone tapping in different parts of my room.\nI got so annoyed with it, it wouldn’t go away and it was just so out of the ordinary I assumed it was the ghost and I was like stop!\nAnd it stopped! So I was able to fall into a light sleep for a bit but then I woke up to tapping on my night stand. it was like taptaptaptaptaptap like someone fucking knocking on it impatiently trying to wake me up. Fun fact: it was exactly at 3 am.\nI thought it was my dog scratching so I looked at her and this bitch was in a deep sleep. I was kinda freaked out bc the knocking was right next to my fucking head.\nSo I asked if why won’t you let me sleep?\nI sound like a damn crazy person but there was seriously something in my room last night bro.\nWhen I asked it I felt a presence on the left in the top corner of my room.\nThen I heard creaking and at first I thought it was the house creaking but it was a constant creak in the same spot in that corner of my fucking room\nIt just kept going for at least over a minute til I said “ok do you want to talk??”\nSo I turned on ghost radar and this bitch was going OFF!\nBack to back words I don’t remember what it said bc it was going off so much. \nBut then my chest got really tight and I felt really panicky like I had to get the fuck out of the house so I did. I started feeling disoriented and like I wasn’t myself.\nMy friends were up and i was texting them and they were like holy shut come over!\nSo I grabbed my purse and my keys and I booked it to my car. \nI was literally shaking on the verge of tears in my fucking car and all the way down to her house. \nI don’t ever get super spooked like that bc I find this stuff interesting but.... I don’t know what happened. Maybe the spirit wanted me out. And he was successful lol.",
        "created_utc": 1538163225,
        "upvote_ratio": ""
    },
    {
        "title": "I think I had sleep paralysis this morning?",
        "author": "Aloofhermitcrab",
        "url": "https://www.reddit.com/r/Paranormal/comments/9jpz9u/i_think_i_had_sleep_paralysis_this_morning/",
        "text": "I took a nap this morning, and I ALWAYS sleep with an eye mask and ear plugs in, my current pair is super old so I hear alot of sounds clearly.\n\nI remember waking up because I heard someone walking in my house. Its very old and creaky so I can tell the difference between animal and human steps. I couldn’t move at all and felt really scared. I kept thinking about how I had to get my eye mask off but I couldn’t move my arms. \n\nI heard them walk into the kitchen, play with the cats and dogs food, and I FELT them come up next to the bed. The next thing I felt was hands on my arms. My arms felt like they were being shocked and I tried to scream but I couldn’t. Whatever was touching me screamed, though. Very loudly, too. FINALLY I was able to take the eye mask off but nothing was there. \n\nWas this sleep paralysis? ",
        "created_utc": 1538162730,
        "upvote_ratio": ""
    },
    {
        "title": "Has anyone had any non violent or not scary haunting? Almost to wholesome hauntings?",
        "author": "blubberfeet",
        "url": "https://www.reddit.com/r/Paranormal/comments/9jpy7w/has_anyone_had_any_non_violent_or_not_scary/",
        "text": "The reason i ask is because i remember something that would happen everytime i was sad and alone as a kid. When i cried i always heard a morning dove close to the house or even beside the window i was crying at. However when i looked there was nothing but the sound. It actually really helped me. Recently ive heard that sound again after i had a emotional breakdown anout a week ago. I heard the dove again and again no dove anywhere. This could be the case of a wholesome bird being helpful to smol me but i truly dont know. Has anyone had a similar wholesome experience in a haunting? ",
        "created_utc": 1538162538,
        "upvote_ratio": ""
    },
    {
        "title": "do you know what’s going on?",
        "author": "GatoDiablo_",
        "url": "https://www.reddit.com/r/Paranormal/comments/9jpsuv/do_you_know_whats_going_on/",
        "text": "[removed]",
        "created_utc": 1538161526,
        "upvote_ratio": ""
    },
    {
        "title": "My friend that passed away came to my mom",
        "author": "brittcausing",
        "url": "https://www.reddit.com/r/Paranormal/comments/9jpsg9/my_friend_that_passed_away_came_to_my_mom/",
        "text": "This is my first time actually posting so please excuse how I format this! My moms story is not as spooky or paranormal as others so I don’t know if this is the right sub to post this in but enjoy!\n\nA little background: my mom has experienced many activities since she was a little girl. She tells me she has sixth sense and I truly believe her lol my friend Saeed has passed away in 2015 due to lipoma. I told my mom about when he passed away but I never told her that he had cancer or even showed her picture of him. We never talked about him after that and It’s been years. \n\n\nFast forward to yesterday, It was around 6-7pm. It was my sister, my mom and I in the bathroom (my parents bathroom is huge)  I was dying my moms hair while my sister was doing her homework. We were all in the bathroom because we barely see my mom so we try to spend as much time with her as possible. So we were all talking and deciding what should we eat for dinner and I started to picked up some pieces of her hair so I can start dying it. But then she suddenly started feeling dizzy, she was putting her hands on top of her head. She was groaning on how much it hurts. I was panicking because she looked like was in pain and I thought it was from me tying her hair up too tight or the dye. So I’m just going to go by Me and my mom as Mom lmao \n\nMe: Are you okay? Is it because of the dye? \n\nMom: wait, what was your friends name again? \n\nMe: what friend? The friends I was hanging out with today? \n\nMom: no, the one that passed away cus of cancer \n\nMe: Saeed..? \n\nMom: yes yes, he had a big lump on the side of his neck right? \n\n(She was correct, the last moments that I saw Saeed, he had a big lump on his right side of his neck) \n\nMe: wait why? what’s going on?\n\nMom: he just came to me and asked if I could pray for him. \n\nMe: what? \n\nMom: He’s African American right? He came to me asking if I could pray for him.\n\nMy mom told me and my sister to stop what we were doing and we started to pray for his soul. I started crying. I felt something in the room and it was crazy that this really happened. It was out of nowhere and  he was one of the most genuine people I ever met. Every night now I pray for Saeed and I truly hope he’s okay. \n\nI could share many stories of what my mom tells me and I experienced things with her first hand that I could also share! ",
        "created_utc": 1538161448,
        "upvote_ratio": ""
    },
    {
        "title": "Do these pictures show forest creatures?(link)",
        "author": "LittleTipsyGypsy",
        "url": "https://www.reddit.com/r/Paranormal/comments/9jpr0l/do_these_pictures_show_forest_creatureslink/",
        "text": "I will make these fairly short, anyways I have this cottage and everything around it is forest and there is a creek in front of it. My friend and I were taking a walk there today and followed the creek, there was this tree. http://imgur.com/apBtEtA I have not photoshopped or altered anything and these are not shadows that look weird, it's the same thing from every angle, like legit fucking faces from any angle or side you want. I'm a skeptic but this really creeped me out. There is also another tree with faces not far from there but it was muddy so I couldnt come close enough. Thoughts?",
        "created_utc": 1538161185,
        "upvote_ratio": ""
    },
    {
        "title": "Fish-hating Poltergeist?",
        "author": "fbipandagirl",
        "url": "https://www.reddit.com/r/Paranormal/comments/9jplmt/fishhating_poltergeist/",
        "text": "So, ok, this is gonna be a little long, but I’ll do my best to keep it in paragraphs and readable. I’m also on mobile so I’ll try and do my best with grammar/errors. \n\nA little backstory; I live 4 hours away from where I go to college. Last semester I had bought a betta fish and for that entire semester, I had to bring him with me everytime I went home for a weekend (which was about every 3 weeks) because I didn’t trust my roommates at the time to feed him. I always brought him back in the cup I bought him in and had a 1.5 gallon tank that I used on the weekends I was home (I normally keep him in a 10 gallon, but that’s not easily transportable for 2 nights). \n\nAnyway.\n\nI came home this past May for summer break. It was nothing new, I brought all of my stuff as well as my fish back. Once I got home, since I would need time to set up my 10 fish tank in my room upstairs, for the sake of convenience, I set my betta up in his 1.5 gallon tank in my parents bathroom on the main floor, so I could easily get to him to feed/clean his tank while spending the majority of the day unpacking things downstairs. \n\nNow, my house has had its share of paranormal activity with spirits mostly making noises. Nothing too wild, and when my mother told them to leave, they did. Some more would come for a little while and when things got too disruptive, we would do the same thing again, asking them to leave and they would. The spirits that were in our home were never evil or caused really anything, they would sometimes just get too loud.\n\nThat’s not the story part. That had been happening on and off for the last few years, well before I got my fish and started bringing him home. The spirits/ghosts never bothered the fish or moved anything. \n\nWell...\n\nAfter I had put my fish in my parents bathroom on the day I moved back home, I shut the door because we have a 6 year old cat that still gets into things like she’s a kitten. I left the bathroom for a while to go unpack some things, and when I came back in to check on my betta, his fish food container was knocked over and fish food was all over the floor and the counter. I’m gonna do my best to describe it because I don’t have any pictures (I once did but deleted them after the event happened and I showed my parents).\n\nI feed my betta little food pellets. They are super tiny and hard so if they drop out of the container, they bounce all over the place. I’ve found some behind my dresser before. The lid to this food is one of those that is 2 pieces and to open it, you have to press your palm down on the lid and turn it like a medicine bottle, then the top circle spins and reveals a hole into the rest of the bottle. It doesn’t pop off. \n\nWhen I walked into the bathroom, the food was in a neat-ish pile on the floor as if someone had stooped down lower to the ground and poured them out. The lids were completely off of the bottle and sitting on the counter and the bottle was laying down on the counter. There wasn’t much food on the counter, the majority of it was in the pile on the floor. The reason it being all spilled on the floor was strange because of many reasons. \n\nA) I had shut the bathroom door and made 100% sure that my cat wasn’t in there when I left. She was inspecting my luggage in the kitchen the entire time I was unpacking. B) Even if I had left the bottle opened and accidentally knocked it over when I left, I would’ve heard it. And it would have bounced everywhere, almost in a waterfall pattern all over the counter and the floor, not in one spot as if someone had poured it. C) If B had happened the lids would not have come apart. There was no tab on them to pop them off, and you have to use force and something sharp to be able to get under the seam to pop them off since it’s a twist top (I tried to take them off once and almost wasn’t able to Bc I barely have fingernails). I’ve also dropped the container many times and it has never spilled once. \n\nSo something had obviously gone into the bathroom, picked up the bottle, popped off the lids effortfully, poured food onto the bathroom floor into a pile, left the lids off, and laid the bottle on its side on the bathroom counter. I asked my brother and he didn’t do it, as he was helping me unpack and no one else was home at the time. We chalked it up to maybe the cat but we knew that wasn’t true. \n\nFast forward a week or so, I’m at my boyfriends house pet-sitting for him and his family. He has a guinea pig and his brother has a betta, both in the living room. They use an old armoire-looking cabinet without doors in their living room for their stereo and the fish tank while the guinea pig cage is on the floor in front of the cabinet. I had been going over there multiple times a day for a week and would always sit on the floor in front of the piggies cage because I could watch both pets and play with the piggie. Their betta ate flaked fish food that was just in a regular twist-off top, no holes in it or anything so that way you can just twist it off and reach in to grab a pinch of food. \n\nWell on one of the last nights I was there for the pets dinner, I was sitting on the floor like normal. I had already fed both animals but was wanting to play with the piggie just a bit more. After about an hour or so, I got up to leave and go to the bathroom which is down a little hallway near their living room. Well within earshot of the room (you can hear the little piggie squealing from outside if he’s loud enough). So I would’ve heard if anything happened, seeing as the entire family was on vacation.\n\nAnyway.\n\nI come back from the bathroom, didn’t take me 5 minutes, and when I walk into the living room, I freeze. There’s a pile of their flaked fish food on the floor EXACTLY where I had been sitting. The bottle itself was closed and on its place in the armoire. The guinea pig was also hiding under a shelf in his cage, looking frightened and spooked by something, when he had been playing and eating just a few minutes before. I slowly walk over to the cabinet. I open up the fish food bottle to see it and it’s not level like I left it. It’s contents are pushed nearly all the way up to the top and on one side, as if you had raked out some food with your fingers and didn’t pat it back down. \n\nI was officially freaked out. There was no way I could’ve dropped some food while feeding the fish without noticing it, and if I did, it wouldn’t have been in a huge pile on the floor where I had been sitting, it would’ve been on the cabinet and in the Guinean pig cage which is directly beneath it. And I only feed the betta a tiny pinch, and this pile was easily as big as my palm.\n\nI got out of there as soon as I could (after making sure the piggie was ok) and felt a presence in the house while doing so. I told whatever it was to follow me back to my house Bc it did NOT belong at my boyfriends house since they were innocent people and did not deserve that. It came back with me and my mother and I asked the spirits to leave and never come back and I believe she did some prayer/cleansing in part of our house and we both prayed over my boyfriends house (me in person when I was there and her from our house). \n\nSo yeah...it’s resolved now, and it doesn’t sound like much, but it totally freaked me out at the time. Especially it following me to my boyfriends house. Well, we think it followed my mom when she came to visit the guinea pig the day before, but still. \n\nThoughts??\n\nTl;Dr...a ghost/spirit/poltergeist poured out my fish food at my house and also followed me to my boyfriends house where it did the same thing with their fish food. ",
        "created_utc": 1538160107,
        "upvote_ratio": ""
    },
    {
        "title": "Selling a haunted house",
        "author": "blueblue1228",
        "url": "https://www.reddit.com/r/Paranormal/comments/9jpfbq/selling_a_haunted_house/",
        "text": "[removed]",
        "created_utc": 1538158853,
        "upvote_ratio": ""
    },
    {
        "title": "Paranormal Hotspots",
        "author": "MrBoo843",
        "url": "https://www.reddit.com/r/Paranormal/comments/9jpaya/paranormal_hotspots/",
        "text": "I've been reading about Bridgewater, MA and the \"Bridgewater Triangle\" and found it very interesting. Do you know any other such places where lots of weird and paranormal events are supposed to have happened in one area? ",
        "created_utc": 1538158004,
        "upvote_ratio": ""
    },
    {
        "title": "A ghost in my room? What do you think guys? I didn’t feel any negativity so it could be a good spirit but I was surprised. Pay attention to the paper after I say “Hi, ghost, I think”",
        "author": "thelanabananana",
        "url": "https://v.redd.it/64zcg50kp0p11",
        "text": "",
        "created_utc": 1538157251,
        "upvote_ratio": ""
    },
    {
        "title": "Other dimensions?",
        "author": "hedyv",
        "url": "https://www.reddit.com/r/Paranormal/comments/9jp02e/other_dimensions/",
        "text": "So I've seen and heard things since I was a child. I think some people are more attuned to this. I've pondered the idea that when we die our 'souls' pass on to another, as yet identified, dimension. And some times these dimensions touch and we, and they, can interact. Any ideas?",
        "created_utc": 1538155881,
        "upvote_ratio": ""
    },
    {
        "title": "Daddy Uh Oh",
        "author": "Rarefindofthemind",
        "url": "https://www.reddit.com/r/Paranormal/comments/9jopxu/daddy_uh_oh/",
        "text": "Hello, long time lurker but first time posting a story. It's a \"someone I knew saw\" kind of post, but that someone was my ex husband and his story has never wavered a bit. This is what he has told me repeatedly over the years.\n\nSo in 2004 I was working as a building manager/superintendent. I had just had my son, and so to make things easier my husband took paternity leave so we could both care for our son and the buildings together (important to the story.) \n\nOne of the buildings was built in 1922, so it was quite old. So old, in fact that the original foundation was built on sand (we live close to a lake/beach) and you could go down to the boiler room and see where joists were sitting in sand supporting the building. \n\nFor extra cash the management company would pay us to paint apartments before new tenants moved in. It was me who actually did the majority of the painting jobs, however my hubby went to the old building to paint an apartment on this one particular occasion, as I was still healing from the birth. \n\nSo he's working away, late afternoon, in an empty apartment with just his supplies and a radio playing music. He's close to finishing painting the living room. He hears a voice that carries above the music, high pitched like a little girl, doesn't think much of it as the windows are open, he's focused on his work, etc...until the 3rd or fourth time he hears it. He told me that it sounded repetitive that's why it eventually caught his attention. He opens the apartment door and checks the building hallways to see if there's any kids screwing around out there. Nothing. Goes back to living room and starts getting ready to move his things into the bedroom to paint when he hears the muddled voice/sound again. The radio was lowered and he hears the repetitive voice again this time clear as day \"Daddy, uh oh.\" In a girl child's voice. And it sounds like it's coming from the bedroom. \n\nHe told me when he related this story that he was confused at first not by the voice, but by the fact he at first thought it said \"Danny, uh oh\" as Danny is his nickname. \n\nAccording to him he was spooked by this point but also unwilling to believe it was anything that unusual. \n\nUntil he moved his paint supplies into the bedroom to begin work in there. Starts painting, turns on radio, and about 20 mins in, he hears it again, just above radio pitch... \"Daddy, uh oh.\" But now it's coming from the living room (according to his perception.) At this point he's just wanting to finish up and go home. \n\nHe turns the radio on again and this times leaves it on low, just for some background noise. And he hears it again. But this time, it's not in the living room, but closer to the bedroom. And it says again \"Daddy uh oh\" but it's urgent and choked, like someone distressed. The entire pitch and tone of the girls voice had CHANGED. \n\nHe left the paint trays and brushes full of paint and bailed. \n\nWhen he came home that night he was acting a little odd, but it didn't occur to me as strange, until we lay down in bed that night. Now I want to emphasize that my ex was a beer swilling, football loving, skeptic, see it to believe it type, toxic masculinity dude bro. But the lights were out as we lay there, and I could just tell by his breathing that he was laying awake, not talking,  and something wasn't right. I finally roll over and say \"are you okay?\" And I realize he's got the covers pulled up to his chin like a scared child. He starts getting upset and tell me the story that I've just related to you. He's literally shaking as he tells me what happened. He never set foot in that apartment again. I had to go and collect the supplies and we told the company he threw his back out and they hired someone else to finish the job.",
        "created_utc": 1538153996,
        "upvote_ratio": ""
    },
    {
        "title": "Great grandmother saw death",
        "author": "ignup215",
        "url": "https://www.reddit.com/r/Paranormal/comments/9jokwe/great_grandmother_saw_death/",
        "text": "It's a bit slow at work today so I'll share a story.  \n\n\nMy great grandmother swore till the day she died that she saw 'death'.\n\nOne night while she was pregnant she had a dream that she woke up and saw a man in old victorian type clothes with a top hat standing in the doorway to her room.  She would say the most noticable thing about him was that he seemed to glow a blue light.  She said he walked into the room and sat in the rocking chair next to the bed all while looking at her.  She woke up in a panic and looked at the rocking chair, it was still rocking.  \n\nShe said she knew from that moment that it was death and she would lose her baby.  A couple days later she did.\n\n&amp;#x200B;\n\nI always found this to be interesting on its own, but a couple years ago my grandma( my great grandmother's daughter) was reading a book on local hauntings and such and found a story that exactly describes the same blue glowing man, and a death following after.  There was also an ametuer sketch in the book that looks exactly hoe my great grandmother described 'death' ( I'll try to find the book/image)    ",
        "created_utc": 1538153038,
        "upvote_ratio": ""
    },
    {
        "title": "Is what I just experienced paranormal?",
        "author": "ChillWii",
        "url": "https://www.reddit.com/r/Paranormal/comments/9jofu4/is_what_i_just_experienced_paranormal/",
        "text": "I was just sleeping about 10 minutes ago when I kept slipping between awake and sleeping and somehow I could see even when my eye lids were closed and I also felt a presence of something I also seen a shadow in the corner of my eye as I was walking up and kept hearing fighting and arguing in my sleep and gunshots and explosions  kind of like airplanes and bombs going off but I didnt wake I was sort of like in a sleep paralysis except I could hear things in my sleep also the last time I slipped into the last one I seen the shadow in the corner of my eye and my back felt really warm almost to the point of hot and my room is cold usually so... that's weird being theres no blanket on my back also as I tried sleeping on my partner I started to see the shadow and then it didnt move but I felt as though it spoke to me during sleep paralysis without me opening my mouth or it opening its mouth creepy gave me chills I cant sleep now gonna drink some coffee... 🙁🙁🙁🙁\nAlso it said it was going to take me should I do something about this?",
        "created_utc": 1538152050,
        "upvote_ratio": ""
    },
    {
        "title": "someone thinks im a witch?",
        "author": "[deleted]",
        "url": "https://www.reddit.com/r/Paranormal/comments/9jodb5/someone_thinks_im_a_witch/",
        "text": "[removed]",
        "created_utc": 1538151549,
        "upvote_ratio": ""
    }
]