[
    {
        "title": "what do you make out of dreams where you see deceased loved ones?",
        "author": "NectarineMaximum9738",
        "url": "https://www.reddit.com/r/Paranormal/comments/zs3nva/what_do_you_make_out_of_dreams_where_you_see/",
        "text": "if deceased people appear in your dreams, what meaning do you give it? i feel it depends on a person and your relationship with them. what interesting dream encounters you had?",
        "created_utc": 1671662098,
        "upvote_ratio": 1.0
    },
    {
        "title": "Demon or Entity Most Associated with Cicadas or Insects?",
        "author": "CatsEatShadows",
        "url": "https://www.reddit.com/r/Paranormal/comments/zs34wx/demon_or_entity_most_associated_with_cicadas_or/",
        "text": "I'm doing some research for a script I'm reviewing-- it deals with possession, of a sort.\n\nCicadas are a major part of the theme, but the demonic entity isn't described in much detail.  \n\nI know Bealzebub is \"lord of the flies\" but wondered if there were any others more closely associated with Cicadas.\n\nI have the lesser and greater keys of Solomon but haven't found what I'm looking for yet.\n\nThank you for any help!",
        "created_utc": 1671661217,
        "upvote_ratio": 1.0
    },
    {
        "title": "The ghost girl?",
        "author": "Potential-Neat-7296",
        "url": "https://www.reddit.com/r/Paranormal/comments/zs2tm6/the_ghost_girl/",
        "text": "The ghost girl? \n\nThis happened in my previous house, I was 10 years old, I was a week away from moving to another country, so a friend celebrated her birthday by inviting me to a sleepover at midnight, everyone fell asleep except me, I stayed watching the movie \"The Last Exorcism\". \"When I woke up a friend to turn off the television, I settled in bed and looked at the balcony\nI could see a child, I closed my eyes and opened them again\nThere was nothing anymore so I fell asleep, later around 3am I wanted to go to the bathroom so I picked up a friend and they all got up to go together, when we were leaving the room we saw the kitchen light Turned on to my friend, the owner of the house was strange since she didn't know who was there, we all approached and there was no one but she left it on, we went to the bathroom, everything was normal, but I felt a strange feeling.\nThe next day I went back to my house and I lay face down on the bed and I turned around quickly because I couldn't breathe, a car passed and I saw a silhouette of a person next to the door I was scared and I quickly left my room , I went with my grandmother until I heard my mom call me so I go to her and ask her \"what's up mom?\" To which she replies that she had not called me, I was surprised and I told a friend and she looked for what it meant and dealt with something about when they call you that call is left up in the air so I am not very confused.\nAtt: I have another story than this if it marked me a lot",
        "created_utc": 1671660675,
        "upvote_ratio": 1.0
    },
    {
        "title": "Get A free $750 Cash App Card! See if you qualify below!",
        "author": "SSloug_8882",
        "url": "https://www.reddit.com/r/Paranormal/comments/zs2sgh/get_a_free_750_cash_app_card_see_if_you_qualify/",
        "text": "[removed]",
        "created_utc": 1671660621,
        "upvote_ratio": 1.0
    },
    {
        "title": "Get A free $750 Cash App Card! See if you qualify below!",
        "author": "Certified0808_1499",
        "url": "https://www.reddit.com/r/Paranormal/comments/zs2q8n/get_a_free_750_cash_app_card_see_if_you_qualify/",
        "text": "[removed]",
        "created_utc": 1671660533,
        "upvote_ratio": 1.0
    },
    {
        "title": "Get A free $750 Cash App Card! See if you qualify below!",
        "author": "josekont_9812",
        "url": "https://www.reddit.com/r/Paranormal/comments/zs2p03/get_a_free_750_cash_app_card_see_if_you_qualify/",
        "text": "[removed]",
        "created_utc": 1671660491,
        "upvote_ratio": 1.0
    },
    {
        "title": "Get A free $750 Cash App Card! See if you qualify below!",
        "author": "spl1zz_3639",
        "url": "https://www.reddit.com/r/Paranormal/comments/zs2o86/get_a_free_750_cash_app_card_see_if_you_qualify/",
        "text": "[removed]",
        "created_utc": 1671660465,
        "upvote_ratio": 1.0
    },
    {
        "title": "Get A free $750 Cash App Card! See if you qualify below!",
        "author": "MrDropQ_9560",
        "url": "https://www.reddit.com/r/Paranormal/comments/zs2msf/get_a_free_750_cash_app_card_see_if_you_qualify/",
        "text": "[removed]",
        "created_utc": 1671660421,
        "upvote_ratio": 1.0
    },
    {
        "title": "Get A free $750 Cash App Card! See if you qualify below!",
        "author": "1dw9yu7uaflk8s7_4203",
        "url": "https://www.reddit.com/r/Paranormal/comments/zs2m9t/get_a_free_750_cash_app_card_see_if_you_qualify/",
        "text": "[removed]",
        "created_utc": 1671660404,
        "upvote_ratio": 1.0
    },
    {
        "title": "Get A free $750 Cash App Card! See if you qualify below!",
        "author": "PawaseSangram_1862",
        "url": "https://www.reddit.com/r/Paranormal/comments/zs2kcs/get_a_free_750_cash_app_card_see_if_you_qualify/",
        "text": "[removed]",
        "created_utc": 1671660344,
        "upvote_ratio": 1.0
    },
    {
        "title": "Get A free $750 Cash App Card! See if you qualify below!",
        "author": "allbizzness_8445",
        "url": "https://www.reddit.com/r/Paranormal/comments/zs2jma/get_a_free_750_cash_app_card_see_if_you_qualify/",
        "text": "[removed]",
        "created_utc": 1671660321,
        "upvote_ratio": 1.0
    },
    {
        "title": "weird synth \"music\" in the middle of the night",
        "author": "yellow_parsley",
        "url": "https://www.reddit.com/r/Paranormal/comments/zs2b5n/weird_synth_music_in_the_middle_of_the_night/",
        "text": "For context, I live in townhouse surrounded by other townhouses from all 4 sides, all townhouses are almost exactly the same, none of us have backyards, just a garage and a tiny front yard.\n\nI'll go straight to the point, basically what happened is I woke up today at about 1 am, because I was hearing some very faint synth \"music\". I'm not sure if I even can call it a music, it was sorta melodic but not exactly music. At first I thought it was just part of my dream and I woke up cause I had to pee. After I woke up I stayed in a bed for couple minutes and the sounds didn't go away, so I thought maybe neighbors are playing music, but first of all music had to be super loud for me to hear with closed windows and I couldn't pinpoint where it was coming from exactly, like it was coming from all the way around, from the wall, floor, middle of the room. I thought maybe I'm just half asleep and imagining it so I went to the washroom that's just around the corner from my room.\n\nWhen I exited the room I realized that the sounds are still there, in the hallway, and it sounds exactly the same, so it can't be just neighbors playing music since hallway has no windows and it would sound more faint than in my room, but judging by how faint it was to begin with, I shouldn't have heard it in the hallway. But it sounded exactly the same, like it was coming from all the ways around me. And the same thing in the bathroom that has no windows. I came back to my room and thought that maybe I'm going crazy, but then my mom came in to my room and asked if I hear the music.\n\nI can't explhow hauppy this made me because I'm not crazy! So she thought it might be the wind, but it sounded way too artificial, like straight up synth and way to melodic. It didn't repeat the melody, at least I don't think it did. My mom also said it makes her think of souls flying away. We talked for couple minutes and then she went to bed. \n\nThe sounds kept me awake for another hour, however I was way to sleepy and tired to even look aty phone. I would fall asleep and then the sounds would wake me up again. Sometimes it's just one note and nothing for couple minutes, sometimes it's multiple notes one after the other, but never together.\n\nIn the morning it was gone. I asked my mom if she remembers it, she said yes. We didn't have time to discuss it because I was late to work so I'm not sure what she thinks of it.\n\nI talked to my boyfriend and explained everything, he said it just sounds very scary and he has no idea what it could be.\n\nThinking about it makes me feel crazy, like it's so simple yet I have absolutely no idea what it could be\n\nTldr; I woke up on the middle of the night because of some weird synth sounding \"music\", that sounded exactly the same from 3 different rooms, like it was coming out from all the way around, my mom heard it too",
        "created_utc": 1671659887,
        "upvote_ratio": 1.0
    },
    {
        "title": "Get A free $750 Cash App Card! See if you qualify below!",
        "author": "StabiloBossk_8264",
        "url": "https://www.reddit.com/r/Paranormal/comments/zs25ny/get_a_free_750_cash_app_card_see_if_you_qualify/",
        "text": "[removed]",
        "created_utc": 1671659570,
        "upvote_ratio": 1.0
    },
    {
        "title": "Get A free $750 Cash App Card! See if you qualify below!",
        "author": "Tommy_Schrock_4403",
        "url": "https://www.reddit.com/r/Paranormal/comments/zs23ou/get_a_free_750_cash_app_card_see_if_you_qualify/",
        "text": "[removed]",
        "created_utc": 1671659486,
        "upvote_ratio": 1.0
    },
    {
        "title": "My husband got a 1960-1970 record player piece of furniture for $200 that’s worth $1500+",
        "author": "pruelkt",
        "url": "https://www.reddit.com/r/Paranormal/comments/zs1v6g/my_husband_got_a_19601970_record_player_piece_of/",
        "text": "[removed]",
        "created_utc": 1671658988,
        "upvote_ratio": 1.0
    },
    {
        "title": "Went to the toilet and 16 minutes passed by unexplicably",
        "author": "Throwaway2198ab",
        "url": "https://www.reddit.com/r/Paranormal/comments/zs0meh/went_to_the_toilet_and_16_minutes_passed_by/",
        "text": "So on Monday at 11.47am i was sitting in my structural mechanics class at college. I was looking at a photo on my phone that i took of the whiteboard before it got erased. This was a pretty complicated question and normally would take about 4 minutes to complete each question but when i finished the question and went to delete the picture from my phone (to save my gallery from being cluttered) i noticed it was still 11.47am. Thought this was really weird but i passed it off as maybe a glitch on my phone. Anyway i decided, as my class finished in 13 minutes, that i'd quickly go to the toilet to save it eating up my lunchtime. I walk down the hall and into the toilet, take a piss, wash my hands and walk back to the class. Mustn't have been more than 3 minutes but when i get back i notice everyone is packed away and about to leave. I check the time and it is 12.03am. No way i was 16 minutes. Wondering if anyone else has had any similiar experiences as ive had quite a few supernatural experiences but never anything like this where ive jumped time.\n\nTl;dr\nWent for a piss and 16 mins had gone by when i had only been gone for around 3 or 4.",
        "created_utc": 1671656213,
        "upvote_ratio": 1.0
    },
    {
        "title": "My grandpa was in the audience",
        "author": "FadedSirens",
        "url": "https://www.reddit.com/r/Paranormal/comments/zs0jda/my_grandpa_was_in_the_audience/",
        "text": "When I was younger, I used to perform in community theatre plays and musicals a lot. I went on to get a degree in Acting and am now working as a professional stage actor, but I got my start in little community theatres in my hometown.\n\nOne of the last shows that I was in before moving away for college was \"Monty Python's Spamalot\" - it's essentially the movie \"Monty Python and the Holy Grail\" turned into a stage musical. I loved being in this show, it was hilarious and audiences loved us every night.\n\nOn the closing night of the show, we were performing one of the big dance numbers in the second act. This number involved several members of the cast (myself included) running down from the stage and into the aisles in the audience to do a little bit of fun audience interaction. When I got to my mark in the aisle, I locked eyes with a man just a few rows away from where I was, maybe 2 or 3 seats in from the aisle. The auditorium was dark and I never would've expected this in my wildest dreams, so it took me a few moments to even register - this man was my grandfather who had passed away 4 years prior to this. No, it wasn't someone who looked like him. Unless he had a secret identical twin, this was my grandfather, and there are no two ways around it. He made eye contact back at me, gave me a thumbs up, and I stumbled back to the stage as I forgot my choreography due to what I just saw.\n\nI made a mental note of where he was sitting and looked back at that seat during the next scene of the show. Sure enough, by then, he was no longer there. The seat was empty. I checked multiple more times throughout the rest of the show wondering if the seat was just empty due to someone getting up to use the restroom, but no. It remained empty. I even went so far as to ask the box office manager after the performance, who confirmed that nobody had purchased that seat for that performance.\n\n&amp;#x200B;\n\nTLDR; my late grandfather came to watch me perform in a musical.",
        "created_utc": 1671656013,
        "upvote_ratio": 1.0
    },
    {
        "title": "To those of you that assist in \"clearing\" Paranormal Entities from Houses.",
        "author": "ThrowAw2009",
        "url": "https://www.reddit.com/r/Paranormal/comments/zry9lw/to_those_of_you_that_assist_in_clearing/",
        "text": "[removed]",
        "created_utc": 1671650907,
        "upvote_ratio": 1.0
    },
    {
        "title": "Rolls Royce is Airdropping 500 Free NFTs for first 500 People To Claim It.",
        "author": "NutJackerEth_9738",
        "url": "https://www.reddit.com/r/Paranormal/comments/zrx0ww/rolls_royce_is_airdropping_500_free_nfts_for/",
        "text": "[removed]",
        "created_utc": 1671648069,
        "upvote_ratio": 1.0
    },
    {
        "title": "My little brothers imaginary friend",
        "author": "mon_ster97",
        "url": "https://www.reddit.com/r/Paranormal/comments/zrw6xm/my_little_brothers_imaginary_friend/",
        "text": "I 25F have always remembered these experiences from my childhood as the most confusing/scary times growing up. My brother is 3 years younger than me and this all started happening when he was around 4 or 5. We can call my brother “B”. B as a child had health problems and needed a lot of different surgeries he was in and out of the hospital often. The way my mom will re-tell this is that this all started with my brother having horrendous night terrors, so bad that he would sit upright in bed with a blood curdling scream, thrashing his arms and legs. When B would wake up he would have no recollection of his dream, but as time went on B started to talk to someone at night and his toy fire trucks would start to light up with the siren going off. My mom would wake up in the morning and the clocks would all be set to 2:15am. In our house we had storage under the stairs, it was a walk in room also it was an unfinished basement. The storage room was right next to B and I’s playroom, B would always say that “John” and his mom lived in that storage room and he would go knock on the door and say “hi Johns mom can John come and play with me and sister?” I never thought anything of it being a child and my parents telling me B had an imaginary friend. B would want us to set us an extra plate for John at the dinner table, buckle him into the car etc, and would freak out completely if my parents didn’t. We had weird things going on in the house, my baby dolls would go off non stop to the point my took the batteries out and shoved them in the bottom of the toy box and one in specific still went off even without the batteries. We also had this motion sensor big bird plushie that constantly went off when nobody was in the room and the toy would be turned off. This went on for at least a year. My mom has said the breaking point was my brother crying in the kitchen saying him and John got in a fight with B saying “I told John we can’t be friends anymore because I have bones and he doesn’t”. That same night I woke up to a woman calling my name and standing at the side of my bed, when I rolled over and opened my eyes she immediately asked me “where’s John?” I didn’t reply, she seemed to get upset and asked again “where’s John?” I again didn’t reply and was so scared, I rolled over and closed my eyes.. when I rolled back over she was gone. So I booked it into my parents room, my mom let me sleep in their bed for the night. The next night I remember my mom talking to a priest and another strange man. My mom has since told me the priest was to bless the house and the other man was a medium to help John and his mom cross over. The medium was able to tell my mom that John and his mom passed away in a house fire and attached to B the last time he had surgery. After the blessing and encounter with the medium John and his mom were never encountered again. I hope they found their way to the light.",
        "created_utc": 1671646464,
        "upvote_ratio": 1.0
    },
    {
        "title": "Rolls Royce is Airdropping 500 Free NFTs for first 500 People To Claim It.",
        "author": "oceanquigley_6344",
        "url": "https://www.reddit.com/r/Paranormal/comments/zrv1lf/rolls_royce_is_airdropping_500_free_nfts_for/",
        "text": "[removed]",
        "created_utc": 1671643731,
        "upvote_ratio": 1.0
    },
    {
        "title": "Rolls Royce is Airdropping 500 Free NFTs for first 500 People To Claim It.",
        "author": "Cherry19703838_6855",
        "url": "https://www.reddit.com/r/Paranormal/comments/zruz34/rolls_royce_is_airdropping_500_free_nfts_for/",
        "text": "[removed]",
        "created_utc": 1671643630,
        "upvote_ratio": 1.0
    },
    {
        "title": "Rolls Royce is Airdropping 500 Free NFTs for first 500 People To Claim It.",
        "author": "cryptic425_4523",
        "url": "https://www.reddit.com/r/Paranormal/comments/zrus6m/rolls_royce_is_airdropping_500_free_nfts_for/",
        "text": "[removed]",
        "created_utc": 1671643371,
        "upvote_ratio": 1.0
    },
    {
        "title": "I'm looking for information about a Parapsychology program in the 1980's",
        "author": "Ok_Spend_1073",
        "url": "https://www.reddit.com/r/Paranormal/comments/zrt4cd/im_looking_for_information_about_a_parapsychology/",
        "text": "I'm in my fifties now but back in the mid-1980's I was fresh out of high school and entirely on my own. No family was around to help me plan or pay for my continuing education. My passion then was parapsychology, long before Ghostbusters came out. I read every book I could find in the libraries, cover to cover, on the subject of ghosts, hauntings, spiritual possessions, etc. It was no passing fancy, it was a calling.  \n\nI found a school that offered a full program in parapsychology. Can't remember the name of it. I believe it was in New York City, perhaps a different town in New York. New York is all I remember of it. \n\nCan anyone help me find that school? Do you remember it? Does it still exist? What became of it?  \n\nI'm ready to go back to my original love. I want to dive back into the science of the Dark Fringes of our reality, not as a witch or practitioner but as a fringe dweller.",
        "created_utc": 1671640032,
        "upvote_ratio": 1.0
    },
    {
        "title": "Ferrari's new NFT collection is Live. 800 NFTs for the first 800 people.",
        "author": "krasimirtonev3_2818",
        "url": "https://www.reddit.com/r/Paranormal/comments/zrt0wc/ferraris_new_nft_collection_is_live_800_nfts_for/",
        "text": "[removed]",
        "created_utc": 1671639894,
        "upvote_ratio": 1.0
    },
    {
        "title": "Ferrari's new NFT collection is Live. 800 NFTs for the first 800 people.",
        "author": "sanxee4_5027",
        "url": "https://www.reddit.com/r/Paranormal/comments/zrsr93/ferraris_new_nft_collection_is_live_800_nfts_for/",
        "text": "[removed]",
        "created_utc": 1671639493,
        "upvote_ratio": 1.0
    },
    {
        "title": "Ferrari's new NFT collection is Live. 800 NFTs for the first 800 people.",
        "author": "mattchu_caleb_4343",
        "url": "https://www.reddit.com/r/Paranormal/comments/zrshhr/ferraris_new_nft_collection_is_live_800_nfts_for/",
        "text": "[removed]",
        "created_utc": 1671639094,
        "upvote_ratio": 1.0
    },
    {
        "title": "My Dad Swears He Saw Small Hairy Humanoid Figures as a Child. Any Idea What They Could Be?",
        "author": "SpiceNoodles__",
        "url": "https://www.reddit.com/r/Paranormal/comments/zrrwsj/my_dad_swears_he_saw_small_hairy_humanoid_figures/",
        "text": "So basically, my dad always tells me about these “little hairy people” he saw as a kid. According to him, he was in the backyard of his childhood house one day and he saw this line of small hairy people walking in his backyard. He describes them to be similar to Ewoks from Star Wars. He says that they walked in a single file like and then “went into a hole in the ground” and disappeared.\n\nI’d like to add that there was a forest beyond their backyard as well. If that helps.\n\nMy grandma and grandpa both back him up on this. As soon as he saw these hairy people, he ran into the house crying to them about it. When they went back outside, nothing was there.  \n\nHe’s in his 40’s now and to this day, he swears that they were real. \n\nAny ideas to what they could be? Childhood imagination or some kind of creature?",
        "created_utc": 1671638280,
        "upvote_ratio": 1.0
    },
    {
        "title": "New partner getting scratched",
        "author": "thatonechick6234",
        "url": "https://www.reddit.com/r/Paranormal/comments/zrr2r4/new_partner_getting_scratched/",
        "text": "Hello all,so my new partner recently moved in with me and ever since she has moved in she has been getting scratched by something. Me and our other partner that lived here before she moved in have never experienced anything. I keep my space and energy clean and cleared as much as I can but she has done darker witchcraft in the past with summoning certain things and has felt that she has something attached to her but these attacks started when she moved in.I noticed them on her while laying in bed and now last night she had  ones on her upper leg that litterally just manifested while we were sitting in bed talking.The other two of us have never experienced anything only our new partner.So I'm just trying to figure our what to do? I have cleansed the space multiple times since she has moved in and they will stop for a little bit and then start again.  I also have a picture of the scratches if anyone wants be to shown them",
        "created_utc": 1671637111,
        "upvote_ratio": 1.0
    },
    {
        "title": "Ferrari's new NFT collection is Live. 800 NFTs for the first 800 people.",
        "author": "gundamwing4132_3990",
        "url": "https://www.reddit.com/r/Paranormal/comments/zrqicx/ferraris_new_nft_collection_is_live_800_nfts_for/",
        "text": "[removed]",
        "created_utc": 1671636341,
        "upvote_ratio": 1.0
    },
    {
        "title": "Ferrari's new NFT collection is Live. 800 NFTs for the first 800 people.",
        "author": "TazicoGfx_704",
        "url": "https://www.reddit.com/r/Paranormal/comments/zrpu5n/ferraris_new_nft_collection_is_live_800_nfts_for/",
        "text": "[removed]",
        "created_utc": 1671635450,
        "upvote_ratio": 1.0
    },
    {
        "title": "Ferrari's new NFT collection is Live. 800 NFTs for the first 800 people.",
        "author": "Pavel_Horvath_7920",
        "url": "https://www.reddit.com/r/Paranormal/comments/zroyaj/ferraris_new_nft_collection_is_live_800_nfts_for/",
        "text": "[removed]",
        "created_utc": 1671634197,
        "upvote_ratio": 1.0
    },
    {
        "title": "Ferrari's new NFT collection is Live. 800 NFTs for the first 800 people.",
        "author": "Shmomo9_5361",
        "url": "https://www.reddit.com/r/Paranormal/comments/zromtj/ferraris_new_nft_collection_is_live_800_nfts_for/",
        "text": "[removed]",
        "created_utc": 1671633692,
        "upvote_ratio": 1.0
    },
    {
        "title": "Ferrari's new NFT collection is Live. 800 NFTs for the first 800 people.",
        "author": "BundlrNetwork_3658",
        "url": "https://www.reddit.com/r/Paranormal/comments/zrogvx/ferraris_new_nft_collection_is_live_800_nfts_for/",
        "text": "[removed]",
        "created_utc": 1671633466,
        "upvote_ratio": 1.0
    },
    {
        "title": "Ferrari's new NFT collection is Live. 800 NFTs for the first 800 people.",
        "author": "gkauljr21_2059",
        "url": "https://www.reddit.com/r/Paranormal/comments/zrobu0/ferraris_new_nft_collection_is_live_800_nfts_for/",
        "text": "[removed]",
        "created_utc": 1671633329,
        "upvote_ratio": 1.0
    },
    {
        "title": "Ferrari's new NFT collection is Live. 800 NFTs for the first 800 people.",
        "author": "0xgenerative_1075",
        "url": "https://www.reddit.com/r/Paranormal/comments/zrncv5/ferraris_new_nft_collection_is_live_800_nfts_for/",
        "text": "[removed]",
        "created_utc": 1671631514,
        "upvote_ratio": 1.0
    },
    {
        "title": "Ferrari's new NFT collection is Live. 800 NFTs for the first 800 people.",
        "author": "MariLLVilla_1133",
        "url": "https://www.reddit.com/r/Paranormal/comments/zrl62w/ferraris_new_nft_collection_is_live_800_nfts_for/",
        "text": "[removed]",
        "created_utc": 1671627976,
        "upvote_ratio": 1.0
    },
    {
        "title": "Ferrari's new NFT collection is Live. 800 NFTs for the first 800 people.",
        "author": "AkshayDevaprasa_6914",
        "url": "https://www.reddit.com/r/Paranormal/comments/zrl018/ferraris_new_nft_collection_is_live_800_nfts_for/",
        "text": "[removed]",
        "created_utc": 1671627711,
        "upvote_ratio": 1.0
    },
    {
        "title": "Ferrari's new NFT collection is Live. 800 NFTs for the first 800 people.",
        "author": "AlexLonz1_4098",
        "url": "https://www.reddit.com/r/Paranormal/comments/zrku1a/ferraris_new_nft_collection_is_live_800_nfts_for/",
        "text": "[removed]",
        "created_utc": 1671627459,
        "upvote_ratio": 1.0
    },
    {
        "title": "Ferrari's new NFT collection is Live. 800 NFTs for the first 800 people.",
        "author": "ILIASHKU_4579",
        "url": "https://www.reddit.com/r/Paranormal/comments/zrkc0f/ferraris_new_nft_collection_is_live_800_nfts_for/",
        "text": "[removed]",
        "created_utc": 1671626606,
        "upvote_ratio": 1.0
    },
    {
        "title": "SCARY Videos I Found on Internet",
        "author": "iamscarydave",
        "url": "https://www.reddit.com/r/Paranormal/comments/zrjtpn/scary_videos_i_found_on_internet/",
        "text": "[removed]",
        "created_utc": 1671625767,
        "upvote_ratio": 1.0
    },
    {
        "title": "SCARY Videos I Found on Internet",
        "author": "iamscarydave",
        "url": "https://www.reddit.com/r/Paranormal/comments/zrj2mi/scary_videos_i_found_on_internet/",
        "text": "[removed]",
        "created_utc": 1671624511,
        "upvote_ratio": 1.0
    },
    {
        "title": "Ferrari's new NFT collection is Live. 800 NFTs for the first 800 people.",
        "author": "OrangePillArk_6076",
        "url": "https://www.reddit.com/r/Paranormal/comments/zriug7/ferraris_new_nft_collection_is_live_800_nfts_for/",
        "text": "[removed]",
        "created_utc": 1671624180,
        "upvote_ratio": 1.0
    },
    {
        "title": "A short visit from my dead dad's cologne",
        "author": "horrescoblue",
        "url": "https://www.reddit.com/r/Paranormal/comments/zriufk/a_short_visit_from_my_dead_dads_cologne/",
        "text": "I just love telling this story so i hope someone else will enjoy it! It's short :)\n\nMy dad died when i was 10 years old and one thing about him was that he always used a super strong cologne, aftershave and deodorant all from the same brand and he always smelled of it like crazy. Like head to toe and all of his clothes and things, that was just 100% HIS smell. It's a bit of a more expensive brand so it's not that classic Axe bodyspray masculine smell, it's very distinct.\n\nAnyway, skip forward to after his death. We moved into a new place and lived there, i was maybe 14ish by then. Completly average normal day, i walk into my bedroom and i just walked through a huge cloud of my dad's perfume. Like someone sprayed it in the air and i walked through that, super strong smell. Walking back and forth i couldn't really catch it again and it didn't linger.\n\nAt that point i didn't have any stuff from my dad and didn't have a bottle of his perfume for memory sake or something (now i do) so that just came out of nowhere and was pretty random. It also wasn't an anniversary or anything special that would trigger maybe a random smell memory (which i never had before or since anyway). \n\nI don't believe in ghosts but that's one of those random moments i can't explain and will never forget :)",
        "created_utc": 1671624179,
        "upvote_ratio": 1.0
    },
    {
        "title": "Ferrari's new NFT collection is Live. 800 NFTs for the first 800 people.",
        "author": "ArturWrobel74_6868",
        "url": "https://www.reddit.com/r/Paranormal/comments/zrip7w/ferraris_new_nft_collection_is_live_800_nfts_for/",
        "text": "[removed]",
        "created_utc": 1671623983,
        "upvote_ratio": 1.0
    },
    {
        "title": "Ferrari's new NFT collection is Live. 800 NFTs for the first 800 people.",
        "author": "gomez_davin_7793",
        "url": "https://www.reddit.com/r/Paranormal/comments/zrikgr/ferraris_new_nft_collection_is_live_800_nfts_for/",
        "text": "[removed]",
        "created_utc": 1671623790,
        "upvote_ratio": 1.0
    },
    {
        "title": "Ferrari's new NFT collection is Live. 800 NFTs for the first 800 people.",
        "author": "beoffnbeyond_6438",
        "url": "https://www.reddit.com/r/Paranormal/comments/zrifux/ferraris_new_nft_collection_is_live_800_nfts_for/",
        "text": "[removed]",
        "created_utc": 1671623594,
        "upvote_ratio": 1.0
    },
    {
        "title": "Ferrari's new NFT collection is Live. 800 NFTs for the first 800 people.",
        "author": "Luan_msLima_9117",
        "url": "https://www.reddit.com/r/Paranormal/comments/zrhu6i/ferraris_new_nft_collection_is_live_800_nfts_for/",
        "text": "[removed]",
        "created_utc": 1671622710,
        "upvote_ratio": 1.0
    },
    {
        "title": "Ferrari's new NFT collection is Live. 800 NFTs for the first 800 people.",
        "author": "VictoriaFutures_8383",
        "url": "https://www.reddit.com/r/Paranormal/comments/zrhq0c/ferraris_new_nft_collection_is_live_800_nfts_for/",
        "text": "[removed]",
        "created_utc": 1671622543,
        "upvote_ratio": 1.0
    },
    {
        "title": "Close Friend Encounters Gargoyle-like Creature",
        "author": "KisEverywhere",
        "url": "https://www.reddit.com/r/Paranormal/comments/zrge4s/close_friend_encounters_gargoylelike_creature/",
        "text": "This is a story of a close friend of mine that I wanted to post about because I was curious if anyone else who lived in the area may have had a similar experience. For reference, both me and my friend were living in Kissimmee, Florida at the time of his encounter. Also some background info, we lived in a large community in a suburban area so I always thought the encounter was a bit strange. Though there was a swampy forest in the area, so maybe not so strange at the same time. I never felt like it was a lie or attention seeking as my friend was always the layed back goofy type, he was into conspiracy theories and the such but when he told me this story he always told it like he was bothered. Also when I brought it up recently on a call, he non-verbally refused to talk about it and just told me he pretty much didn't like thinking about it. So that cements my belief in his story and the fact that he wasn't lying.\n\nOn to the encounter itself, it was a brief one. It was late at night and his was sitting in his garage with the garage door open just looking out into the street relaxing. The community we lived in was gated and always peaceful, so I could imagine he never felt anxious or bothered, neither did I when I went out late. But after a little while he noticed what seemed to be a gargoyle-like creature sitting on the roof of the house across from his. The only description he had other than it looking like a gargoyle was that it had glowing orange eyes. But he sat there in shock and fear for a couple of seconds and noped right out of there into his room, I probably would have done the same. He never saw it after that as far as I know and I never saw it myself only living about 4-5 houses down from him.\n\nAnyways if anyone else had an experience similar to this who may live in Florida, I would love to hear about it just so we might know if this was a one of a kind thing or something a little more widespread. Have a blessed day to whoever may read this!",
        "created_utc": 1671617992,
        "upvote_ratio": 1.0
    },
    {
        "title": "Demon scream in my record",
        "author": "Mathleray",
        "url": "https://www.reddit.com/r/Paranormal/comments/zrg3tk/demon_scream_in_my_record/",
        "text": "[removed]",
        "created_utc": 1671616926,
        "upvote_ratio": 1.0
    },
    {
        "title": "The man in the attic",
        "author": "BarneyBurgers12",
        "url": "https://www.reddit.com/r/Paranormal/comments/zrch22/the_man_in_the_attic/",
        "text": "When I was 12 I was sleeping at my cousins on my dad side. My dad reconnected with his sister and It was my first time meeting any of them, and my cousins were all close to my age. \n\nIt was my first sleepover there and I was sleeping in the guest room which was really the attic. They had a corner of the attic with a mattress lamp and tv and the rest of the room was holiday decorations and storage. It was about midnight and I thought I heard someone coming up the attic stairs. I  expected it to be one of my cousins but the door never opened. I thought that was weird but ignored it and fell asleep. Around 2 am I woke up to the tv fully static and some battery powered Santa  decoration saying “ho ho ho” on repeat. I thought my cousins were pulling a prank on me, I turned the lamp on and got up and looked around. I didn’t see anyone I shut the Santa off and changed the tv channel and got back into bed. About 20 minutes went by the tv went static again and the Santa went off and I opened my eyes to see a black silhouette man looking down at me. It had gold circular eyes and that’s all I could see. It wasn’t sleep paralysis, I could move. I rolled over so fast away from it and it rolled the other way copying me. I was staring forgetting to blink out of fear then when I finally did it was gone. I was up till the sun came up and all night there was scratching in the opposite side of the room off and on. The next morning my aunt told me I needed to stop running around up there all night and that they could hear it. I told her I wasn’t and what I seen and she laughed at me.",
        "created_utc": 1671603943,
        "upvote_ratio": 1.0
    },
    {
        "title": "I am constantly being scratched in 3’s. Can a medium help me resolve this?",
        "author": "hoosiercrisis",
        "url": "https://www.reddit.com/r/Paranormal/comments/zrc2t7/i_am_constantly_being_scratched_in_3s_can_a/",
        "text": "Hello, I live in a place that I’m sure is haunted. It was built atop a cemetery, after all. Anyways, I keep getting scratches in patterns of threes. We’ve also had some other issues like cabinets opening/closing on their own and my son says he hears “voices that aren’t there”. I always feel uncomfortable, like I’m being watched. The scratches often disappear without a trace within a day. I don’t know what to make of this. I’ve told it to leave me alone, but that obviously didn’t do shit. My son isn’t being scratched. Also, we don’t own any pets",
        "created_utc": 1671602689,
        "upvote_ratio": 1.0
    },
    {
        "title": "My paranormal experiences in one of my many childhood homes...",
        "author": "AutisticCow123",
        "url": "https://www.reddit.com/r/Paranormal/comments/zrbcmp/my_paranormal_experiences_in_one_of_my_many/",
        "text": "When i was roughly ages 6-10 we lived in a mobile home on the lake. The first Paranormal experience i ever had there was with our motion censored hall light. It was a pet free household, I was the only child &amp; my parents room was on the other side of the trailer. This light would flicker on and off &amp; then in the morning time it wouldn't cut off, we would press the button that could override the censor and cut it off, but it wouldn't work. I was watching TV while it was storming when my mother &amp; i heard a  loud boom, my mother got up to look out the window &amp; once she got to the window our power cut out , so i looked toward the TV and i saw what looked like a red \"devilish\" mask on a red body sitting next to me so i quickly turned to look next to me and all i saw was my mom still looking out the window (It should be noted it was mid day &amp; still bright while it was raining.) .The last experience I've had regarding this house was the other night i had a dream that i was in my bathtub in the old trailer &amp; my head was repeatedly pushed in and out of the water while the bathtub was stretching. Ironically enough i woke up drenched in sweat, at 3:33 A.M.",
        "created_utc": 1671600322,
        "upvote_ratio": 1.0
    },
    {
        "title": "How can i tell if my house is being haunted or im just hallucinating?",
        "author": "Curious-Difficulty-9",
        "url": "https://www.reddit.com/r/Paranormal/comments/zrb8pr/how_can_i_tell_if_my_house_is_being_haunted_or_im/",
        "text": "For more context: im 16 and have been recognized with pyschosis and im in therapy for hallucinations and delusions. I see shadow figures every now and then, and i basically always feel like im being watched. I had an obsession with ghosts when i was in 4th/5th grade and would talk to them on ouija boards. The ghosts i talked to on my ouija board though often encouraged my delusions which makes me think that i may have been moving the planchette on my own without realizing it (if that makes any sense. Idk i was in elementary school) does anyone here know how to tell if my house is haunted or if it's just symptoms of my pyschosis?",
        "created_utc": 1671599986,
        "upvote_ratio": 1.0
    },
    {
        "title": "Im having dreams and i need help",
        "author": "Previous_Mention2105",
        "url": "https://www.reddit.com/r/Paranormal/comments/zr9fv4/im_having_dreams_and_i_need_help/",
        "text": "Hi this is fairly odd for me but i need help. I keep having dreams about my grandmother and grandfather. my grandmother passed away when i was about 8 or 9 and my grandfather passed away before i was even born.\n\nI keep having these dreams and their both telling me the same thing. To break up with my boyfriend.\n\nShould i listen or not i dont know anymore im just confused and freaked out over the whole situation?\n\nAlso im sorry for my bad grammar",
        "created_utc": 1671594574,
        "upvote_ratio": 1.0
    },
    {
        "title": "Ghost or just a dream?",
        "author": "Mythica_0",
        "url": "https://www.reddit.com/r/Paranormal/comments/zr8b46/ghost_or_just_a_dream/",
        "text": "Sorry for the long backround but it’s necessary, I’ll get to the point eventually I promise 😅. I’ve been told that the subconscious brain can not make up faces. (Conscious brain can, if only by mashing up other peoples faces, but subconscious can’t.) which means, in dreams, if there are faces you remember the next morning and recognize, it’s likely someone you have seen irl, and if it’s faceless , it’s dream things. However, what if it’s a face you remember clearly that you *dont * recognize. \n\n\nThis is where my story comes in. This past summer I had a dream that *I believe* featured a ghost. It was an older high school student at a school I’ve never seen before, not even in my other dreams.(that’s a whole other story) he was a tall boy, pale skin with lots of freckles and scars littering his back and chest (I believe if it is a ghost he may have died from domestic abuse, sadly) he had blond hair that swooped up and light/vibrant green eyes.\n\n  some of the details of the dream are iffy, but I’ll do my best. I believe the kids name was Mike . Mike was in a locker room, wearing shorts but no shirt,(which is how I saw the freckles and scars)  getting changed for some event or something out side of school. After putting on a blue shirt that had a breast pocket(this isn’t important , but I thought I’d include all the details I remember . )  he attempted to convince me or some other kid (it was in first person, which my dreams normally aren’t, so it’s strange) to skip school to go to some outside of school thing and said something to the like of “it’s an event! We shouldn’t get in trouble for that , right?” I, or whoever I was in the body of, agreed hesitantly. We left and hopped over a school fence . We did go to this event but I don’t remember what/where it was. I think this ghost might have had effects irl to, like certain things going missing without a trace. One time, my parents  had just bought a pack of icecream cones and two disappeared right out the box. My mom suspected me and my brother , but even though neither of us are snitches, we both agreed we didn’t take any . So I think this ghost is mischievous, but not evil. \n\nWhen I told my family about the dream, and my suspicions that it was a ghost, they told me that it was likely *just a dream* . \n\nSo what do you think? Ghost contact? Or ordinary dream? Please do not comment your view if you don’t believe in ghosts. I hope not to see any “it was obviously just a dream because ghosts aren’t real” however, if you do believe in ghosts and still genuinely think it’s a dream, your view is welcome. Thank you",
        "created_utc": 1671591304,
        "upvote_ratio": 1.0
    },
    {
        "title": "Childhood experience",
        "author": "IAinsley",
        "url": "https://www.reddit.com/r/Paranormal/comments/zr8b1f/childhood_experience/",
        "text": "When I was a kid, between ages 2/4, we lived in an A frame home (our first home) in Stuartsdraft Va. We had stairs inside and tall ceilings. At the top of the stairs was my bedroom and my brothers bedroom. At the bottom of the stairs, directly was the front door, and it had skinny windows on each side of it with curtains in front. And I remember it being night time and looking out the window, pulling the curtain aside and seeing a huge box shaped figure with multiple heads .. and one head in particular was shaking at me.. and the figure itself was moving quickly in a dancing jig motion towards me. And that is all I remember and I don’t know why I cannot stop thinking about this 20 plus years later…",
        "created_utc": 1671591297,
        "upvote_ratio": 1.0
    },
    {
        "title": "My grandparents house",
        "author": "DadtoDog",
        "url": "https://www.reddit.com/r/Paranormal/comments/zr7xmh/my_grandparents_house/",
        "text": "When I was probably 9 or 10 I went to my grandparents house for Christmas break to stay with my brother. My grandparents lived on a big chunk of land that was actually built in the 1890s and my grandparents had bought the house together when they married young at 19. This was the first time we were allowed in the upstairs as they had finally made it safe again, (there was a problem with the flooring and mold) My brother and I had slept in the upstairs bedroom that was my mothers when she was a kid. There was a big window in that room that showed the back fields of the property and the woods that was also on their property. The first night my brother woke me up saying he heard tapping on the window. It was impossible because we were upstairs. A few nights later I woke up to it, I went to look out the window and I swore I could see a man laying on his back in the field. I ran and got my grandpa and he checked but found nothing.  The nights after we slept with a lamp on we were so afraid. Nothing happened for a few nights. it was two nights before we were suppose to leave and my brother and I saw a shadow go across the wall. We hid under the blankets and heard this exact saying “Tell me visitor, cause thy I am here.” In the coldest whisper. Then the blankets got yanked. We screamed so loud and woke up my grandparents. They didn’t believe us but we made them call our mom and made her drive out here first thing in the morning. My mom claims to have no idea about this thing we told her about and says it must’ve been a bad dream. To this day I can hear that voice in my head clearly, still no idea what that saying means. My grandfather passed away 10 years ago and my grandmother lives there still but now with my aunt. My aunt has told us she does whatever she can to keep from having to go upstairs.",
        "created_utc": 1671590224,
        "upvote_ratio": 1.0
    },
    {
        "title": "Mi niña es Medium, habla, ve siente y convive con espíritus a diario.",
        "author": "RarodeRaro",
        "url": "https://www.reddit.com/r/Paranormal/comments/zr7dyn/mi_niña_es_medium_habla_ve_siente_y_convive_con/",
        "text": "Hola, mi hija de 10 años tiene el poder de hablar con los muertos, lo hace desde que tiene 3 años, pero lo confirmamos desde hace 1 año y medio aproximadamente, es un legado que viene desde mi abuela materna, lo tuvo mi madre, yo y ahora ella, puede verlos, escucharlos, conversar con ellos, sentirlos y todo, cada día en nuestras vidas es una locura. Sólo lo saben personas muy cercanas a nosotros, y no lucramos ni vivimos de mi ésto. Pregúntame lo que sea.",
        "created_utc": 1671588705,
        "upvote_ratio": 1.0
    },
    {
        "title": "Ferrari's new NFT collection is Live. 800 NFTs for the first 800 people.",
        "author": "aledangiii_3472",
        "url": "https://www.reddit.com/r/Paranormal/comments/zr5a87/ferraris_new_nft_collection_is_live_800_nfts_for/",
        "text": "[removed]",
        "created_utc": 1671583433,
        "upvote_ratio": 1.0
    },
    {
        "title": "Ferrari's new NFT collection is Live. 800 NFTs for the first 800 people.",
        "author": "JonathanWes2705_190",
        "url": "https://www.reddit.com/r/Paranormal/comments/zr57mb/ferraris_new_nft_collection_is_live_800_nfts_for/",
        "text": "[removed]",
        "created_utc": 1671583292,
        "upvote_ratio": 1.0
    },
    {
        "title": "What extent do you believe in paranormal?",
        "author": "AmanitaMuscaria_4869",
        "url": "https://www.reddit.com/r/Paranormal/comments/zr54p9/what_extent_do_you_believe_in_paranormal/",
        "text": "I mean you believe everything you've read and heard or partly or some believe some not? You believe in every possibility or have any rule to choose what to believe or not? And can I ask why you believe in another world?",
        "created_utc": 1671583145,
        "upvote_ratio": 1.0
    },
    {
        "title": "Ferrari's new NFT collection is Live. 800 NFTs for the first 800 people.",
        "author": "PatrickCooke_6593",
        "url": "https://www.reddit.com/r/Paranormal/comments/zr526u/ferraris_new_nft_collection_is_live_800_nfts_for/",
        "text": "[removed]",
        "created_utc": 1671583009,
        "upvote_ratio": 1.0
    },
    {
        "title": "Ferrari's new NFT collection is Live. 800 NFTs for the first 800 people.",
        "author": "joshgudwin_9808",
        "url": "https://www.reddit.com/r/Paranormal/comments/zr4w5e/ferraris_new_nft_collection_is_live_800_nfts_for/",
        "text": "[removed]",
        "created_utc": 1671582717,
        "upvote_ratio": 1.0
    },
    {
        "title": "Ferrari's new NFT collection is Live. 800 NFTs for the first 800 people.",
        "author": "nootcity_8181",
        "url": "https://www.reddit.com/r/Paranormal/comments/zr4nno/ferraris_new_nft_collection_is_live_800_nfts_for/",
        "text": "[removed]",
        "created_utc": 1671582249,
        "upvote_ratio": 1.0
    },
    {
        "title": "Ferrari's new NFT collection is Live. 800 NFTs for the first 800 people.",
        "author": "ygtayvaz34_9431",
        "url": "https://www.reddit.com/r/Paranormal/comments/zr4h2z/ferraris_new_nft_collection_is_live_800_nfts_for/",
        "text": "[removed]",
        "created_utc": 1671581935,
        "upvote_ratio": 1.0
    },
    {
        "title": "Mi hija de 10 años es medium",
        "author": "RarodeRaro",
        "url": "https://www.reddit.com/r/Paranormal/comments/zqzj5e/mi_hija_de_10_años_es_medium/",
        "text": "Hola, mi hija de 10 años tiene el poder de hablar con los muertos, es un legado que viene desde mi abuela materna, lo tuvo mi madre, yo y ahora ella, puede verlos, escucharlos, conversar con ellos, sentirlos y todo, cada día en nuestras vidas es una locura. Sólo lo saben personas muy cercanas a nosotros, y no lucramos ni vivimos de mi ésto. Pregúntame lo que sea.",
        "created_utc": 1671570026,
        "upvote_ratio": 1.0
    },
    {
        "title": "Looking for a solution",
        "author": "lyanx123",
        "url": "https://www.reddit.com/r/Paranormal/comments/zqzhth/looking_for_a_solution/",
        "text": "I live on 65 acres in a rural location. There are no neighbors close or anything outside that could be the cause of this that I’m aware of. My house is old, historic, and well documented as legitimately haunted. That’s background context for the issue. The problem is we cannot use any type of digital clock radio in our house. They will start making these series of beeps and/or buzzing sounds during the night. I have recorded them to see how long it goes on and it is always about 2.5 hours (around midnight to 3 am). The sounds aren’t super loud but they’re persistent enough to wake us up. I have even taken the clock radios to friends homes to test them, put my iPhone next to them to see if it some kind of interference, unplugged and then replugged them while it is going on, and I cannot find an explanation. I’m fine with just not having this type of clock around but it irritates my husband as he likes the convenience. Has anyone ever had a similar experience and found a non-paranormal explanation or should I just chalk it up to another one of our houses paranormal traits?",
        "created_utc": 1671569957,
        "upvote_ratio": 1.0
    },
    {
        "title": "My cat fought an evil spirit",
        "author": "CoffeeAndCats2000",
        "url": "https://www.reddit.com/r/Paranormal/comments/zqx3n4/my_cat_fought_an_evil_spirit/",
        "text": "Story time about my cat Zoi (I posted this on TikTok but my husband said to post here) Zoi is Greek for Life. \n\n\nWhen I was 7 or 8 months pregnant with my second child I was Sleeping alone because at that stage everything is uncomfortable.  So my husband was in the spare room. \n\nI woke up to an evil creature/ demon / spirit whatever you call them humping my leg and making a Weird noise, grunts and laughing. I literally felt my body being pressed into the bed. I opened my eyes and make eye contact with the creepy thing but I could not move. Complete sleep paralysis. \n\nI’m panicking, reciting the lords payer in my head. Trying to rationalise what is happening and then Zoi burst into my room. A small angry calico cat. \n\nShe attacked the thing attached to me and chased it LOUDLY all over my room and under my bed. At this point I physically could move but was too freaked out to even look under my bed where I could hear hissing and angry cat screams and feel bumping. I literally just pulled the covers closer to me and held my breath. \n\nThen I saw a dark shape leave my room followed by a super angry cat who then walked all puffy back into my room and slept on my baby bump for the rest of the night. \n\nI would have thought I was dreaming except in the morning there was cat hair all under my bed. \n\nI still don’t know how Zoi got into my room because I sleep w the door shut sue to having individual ac units per room.",
        "created_utc": 1671564172,
        "upvote_ratio": 1.0
    },
    {
        "title": "What do I do if my house is haunted by a ghost or demon?",
        "author": "Bipolar_bear17",
        "url": "https://www.reddit.com/r/Paranormal/comments/zqtymb/what_do_i_do_if_my_house_is_haunted_by_a_ghost_or/",
        "text": "[removed]",
        "created_utc": 1671556671,
        "upvote_ratio": 1.0
    },
    {
        "title": "Negitive Energy Removal?",
        "author": "Sergeant_ruski",
        "url": "https://www.reddit.com/r/Paranormal/comments/zqsyx8/negitive_energy_removal/",
        "text": "Just looking for some help. Ive had some negitive energy in my house for quite some time, its starting to effect my toddler, it mainly stays in her room or at least that area of the house, she wont sleep for more then 10 minutes in her room. Ive seen a small shadow in her room on the baby monitor (about the size of a cat) any ideas?",
        "created_utc": 1671554253,
        "upvote_ratio": 1.0
    },
    {
        "title": "When my daughter was 4, she reminded me of our past life together.",
        "author": "AlexandrevZevastyanX",
        "url": "https://www.reddit.com/r/Paranormal/comments/zqs877/when_my_daughter_was_4_she_reminded_me_of_our/",
        "text": "I’ve heard countless stories of this happening in one way or another with other children and wanted to see if it’s happened to anyone here.\n\nWhen my daughter was around 4, she began to talk about “the last time”. She’d say things like “yeah, but that’s what happened last time, not now. When I was older than you, not when you were my mom...” when talking about things she remembered.\n\nOne day, we were sitting on my bed, having a random conversation before bedtime. She said something like, “But I was your grandma then. I died before you were born, so I wanted to meet you. When your sister died, I had to wait until you had a daughter.”\n\nI was a twin, but my twin was stillborn. My sister never took a breath. My daughter had no idea. There’s no way she could have known that at 4 years old.\n\nJust putting it out there. There are countless studies of children remembering things from past lives. My kid did, for sure.",
        "created_utc": 1671552408,
        "upvote_ratio": 1.0
    },
    {
        "title": "Mom Dreamed About Her Dead Dad Warning Us About Unlocked and Open Door",
        "author": "CorgiExpensive1322",
        "url": "https://www.reddit.com/r/Paranormal/comments/zqrdil/mom_dreamed_about_her_dead_dad_warning_us_about/",
        "text": "Hi all, first post on this sub. Obligatory posting from phone, apology for formatting, spelling/grammar mistakes. \n\nI read a story from another sub that reminded me of my own that happened when I was about 12-14. It's nothing too exciting but it was something I've thought about on and off over the years considering my mom is not the kind of person who lends credence to ghost stories and the paranormal in general. I'm not sure whether I believe in ghosts myself but my beliefs tend to change all the time. Lmk what you think! \n\nMy mom and I used to house sit for one of the families she cleaned house for and my mom was always good about making sure doors and windows were locked before we went to bed. \n\nSo one night we started our bedtime routine, she checked doors and windows, all was fine. \n\nI woke up the next morning, went downstairs, and my mom looked visibly shaken and I asked what was wrong. \n\nShe told me that she dreamed about her dead father the night before (he was dead about 20 years at this point) and that she rarely ever dreamed about him and if/when she did, she didn't remember the dreams for long upon waking up, as is the case for a lot of people.\n\nApparently he came to her in her dream, at this house we were house sitting. He opened one of the back doors of the house in this dream. \n\nMy mom woke up with a startle, and it was pretty early in the morning. She thought it was strange that he would visit us at this house, considering he lived and died in a whole other country. Something in her told her to get up, go downstairs, and check the doors and windows. \n\nThe same back door her dad opened in her dream was slightly ajar. She was *spooked* and I had never seen her get spooked like that nor have I ever heard her talk about the paranormal before that. She is also not the type of person to play pranks of any kind. It seriously sent shivers down my spine. \n\nWe don't know if the door being slightly open was an intruder coming in and her father was attempting to warn us, or if it was him himself trying to make his presence known. There weren't any signs of an attempted break-in, however. \n\nEither way, I remember that the both of us were creeped out especially because my mom has been forever vigilant in making sure doors and windows were locked wherever we lived or slept.",
        "created_utc": 1671550277,
        "upvote_ratio": 1.0
    },
    {
        "title": "Baby keys on the basement floor",
        "author": "ApprehensiveSpare925",
        "url": "https://www.reddit.com/r/Paranormal/comments/zqr424/baby_keys_on_the_basement_floor/",
        "text": "I have posted before about my attachment that has followed me for about 40 years (I am 53). It all started when I was around 13. It started with footsteps that were heard by my step dad, mom and sister (we where all sitting in the living room when this happened). It has done numerous things over the years; turned on blender, turned on lights, turned on water faucet, lots of footsteps, moved things etc. There are witnesses to some of these events. \n\nIt has quieted down though over the years. About a year ago there was a flurry of activity over a few weeks (several witnessed by my wife and one by my mom who was visiting). There hadn’t been anything I noticed until last night. \n\nQuick back story. Earlier this year I did a through organization of the house. We have 2 kids, 9 and 7. We went thru all of their toys and asked them if they wanted to save or donate an item. All of the toys they wanted to keep (to give to their kids someday) I put in plastic Ziplock totes and put those totes on the top shelf in the basement. \n\nWent downstairs last night and a set of baby keys was laying in the basement floor. What I mean by baby keys are plastic keys you give to a baby for them to chew on or play with. They are different bright colors, about 6 to 8 of them on a ring. I specifically remember my daughter telling me she wanted to keep them. I remember putting them in one of the totes. \n\nNow the totes are on the top shelf. My kids are little and not physically capable of taking down let alone put the tote back up (all the totes are in the shelf). Also note they will not go downstairs by themselves because they are afraid of ghosts. Also note I took Christmas decorations up from the basement a few weeks ago (and put the plastic totes back). There were no keys on the floor. Also note my wife has not messed with any of the stuff in the basement (she leaves it to me to bring up/down the decorations). \n\nSo there they were on the basement floor. When I saw them I said out loud “Well, let’s unusual.” They are still there, hadn’t put them back yet. \n\nNot earth shattering but still interesting/unusual. I wonder what is next since it let me know it’s here?",
        "created_utc": 1671549618,
        "upvote_ratio": 1.0
    },
    {
        "title": "Wierd experience during camping trip.",
        "author": "Apprehensive_Hunt165",
        "url": "https://www.reddit.com/r/Paranormal/comments/zqr06g/wierd_experience_during_camping_trip/",
        "text": "One day i was going on a camping trip with friends, the day went on regularly, forecast said sunny day and cold night, this was around the end of autumn and beggining of winter, we were just doing regular camping things, light a fire, roast some hotdogs, tell stories etc... Time comes to go into the little hut weve built by hand through the years, and the campfire was basically completely extinguished by that point.\n\nWe go in and go into our sleeping bags ready to tell stories till we go to sleep, unfortunately the hike to the campsite is very rough and i lost one of my under layers of clothing, so i was colder than usual, and couldnt fall asleep as easily, so all my friends went to sleep succesfully and i was just waiting to do so aswell, until a singing light that made the campsite bright as day went up, i didnt look at it directly as i was laying down, but i saw the very bright light through the windows of the hut we made, it was very sudden, and was coming from the since extinguished fire, i got up to take a look at it and it looked like there was a person next to the campfire, so i woke my friends up to confirm i wasnt just being delirious due to hunger and sleeplesness, and they confirmed what they saw was what i saw, but before long the singing light and almost day-like lighting around us was gone, i know that sometimes fires relight after a bit but this was no regular fire, this was magnesium type singing flame but on a massive scale.\n\nTo make it worse, the cold-ish yet dry night forecast suddenly turned into a horrid hailstorm with hail as big as half a human fist, thankfully we built the hut to withstand such conditions, but it was still horrifying. This next part i do not know if its factual or just my delirium, as my friends went back to sleep, but during the hailstorm, that mind you was so agressive it muted nearly any other sound with its bumps on the roof and its white noise, i could hear footsteps on the wet leaves right outside the hut, under the extended part of the roof, this however could have been an animal or a delirious halucination of mine.\n\nWe have not spoken about this ever again from that day, i talked about it to my father but he just played it off as just a fire relighting and me being scared. This happened more than a year ago.\n\nI am to this day very perplexed and traumatised of this experience, and i really want any kind of explanation for it, preferably non paranormal, but any kind of information will help me.",
        "created_utc": 1671549346,
        "upvote_ratio": 1.0
    },
    {
        "title": "I think im seeing into the future? bit weird lol",
        "author": "WherxDoIGo",
        "url": "https://www.reddit.com/r/Paranormal/comments/zqqz2o/i_think_im_seeing_into_the_future_bit_weird_lol/",
        "text": "Okay so I know this sounds crazy and didnt see something that exciting ahahaha. For a while now (the past couple years) ive been getting bad deja vu. Every couple days I'll be hit with it but I know that can be explained scientifically and is probably just my brain playing tricks on me. \n\nHowever, last week I had like a weird deja vu dream thing (?) and I actually remembered what I \"saw\" in the future so I wrote it down not thinking anything of it. It wasnt anything exciting, it was literally that I saw my food shopping I do online was going to have certain items substituted for others. Shows how exciting my life is that thats what I dream about ahahaha. Anyways, I remembered it so I wrote down the food items and what they were substituted for in a little notebook. it was all super random but a couple days ago when my food shop arrived *everything* was  how I \"saw\" it was going to be. all the same items were substituted, the same ones cancelled, everything was the same. I told you what I saw wasnt exciting ahaha. I want to think it was just a coincidence but the stuff I saw was so random it would have to be a pretty big coincidence. \n\nProblem is I also saw another thing in this \"dream deja vu thing\" which would be something years and years from now which wasnt very nice. now normally this wouldnt bother me because its just a dream, but since this first thing actually happened im worried this other thing is going to happen too. \n\ndoes anyone know what this is? Ive never had anything remotely close to this happen before",
        "created_utc": 1671549270,
        "upvote_ratio": 1.0
    },
    {
        "title": "Possession or just the unexplained?",
        "author": "NarstarTheDry",
        "url": "https://www.reddit.com/r/Paranormal/comments/zqqtio/possession_or_just_the_unexplained/",
        "text": "\nWhen I was about 12, I was in boarding school. The school term ended and I came home for the school holiday’s to my childhood home that my mom had only recently moved back into, after having had tenants for some time. There were still unpacked boxes piled high in the dining room and furniture that was out of place. Happily, my old friend, Emma, who had been in a different school was invited over, as I had not seen her in a long time. That evening, out of boredom or whatever you might call it, my mother, Emma and I decided to play a game called glassy-glassy. Glassy-glassy is basically the poor man’s Ouija board. All it takes it a drinking glass turned upside down, and scraps of paper on either side of a small glass table with the words “yes” and “no” on either side. As we three out our fingertips to the bottom of the overturned glass, it eventually started moving very slowly with the questions we asked. Very stupid questions, “are you a ghost?” and such. As the night wore on the glass moved quicker and quicker under our fingertips, and I even accused my mom of ‘pushing’ the glass and making a fool of me. My mother laughed it off and said it was just our subconscious moving the glass. The longer we played, the more efficiently the glass moved, to the point where it was so quick, it almost moved and lost traction of our fingertips. I started to believe, but unlike my mother, I didn’t believe it was subconscious, but rather some otherworldly spirit. I regretted this belief much more as I will tell the events that unfolded long after this ‘silly’ little game. Eventually my mom and my friend got tired and bored, but I wanted to be extra sure about the glass’s movement, so I played for a little while all by myself, eyes wide with the fact that the glass was for sure moving of it own volition. It creeped me out some.\n\nEventually we all went to bed. My mom to her own room, and my friend and I shared my bedroom. I gave up my single bed to my friend, while I cosied myself in a makeshift ‘bed’ on the carpet. I fell asleep soon enough, but had a very turbulent restless sleep.\n\nI started to dream about being in the same lounge at night, with the furniture stacked all over. In my dream I decided I want to make my way to the bedroom. I could feel myself bumping up my shins against ‘furniture’ in my dream. I reached the passage door that led to my bedroom, but it was closed. I reached out for the handle of the door but could only feel the smoothness of the ‘door’. It felt so realistic, I started panicking as to why I could not open the door. I started beating at this door in my dream, trying over and over to grab the handle, to no avail. Moments later, I heard my mother calling me “OP, OP!” and I woke up, still beating the wall with open hands, while standing on top of the single bed my friend was still sound asleep in. My mom standing at my door perplexed. \n\nI had no idea how I managed to walk up onto the bed in my asleep state, but it was extremely scary. The following day, I tried my best to explain to my mom about the dream but she waved me off.\n\nNow, if you think this horror ends here, no no, I endured a further 6 months or so of paranormal nocturnal happenings, but never again sleepwalking. I had to return to boarding school and no sooner I was back, virtually every night I would suddenly awaken to ‘apparitions’ next to or above my bed. By apparitions I would jolt awake only to see an “imaginary” sandal or some object flying across me over my bed. Soundless, transparent apparitions which I knew were not real but were there for my eyes to see nonetheless. Once or twice I would suddenly awake at night to see a dorm mate standing next to my bed, I would even call out their name, only for this apparition to dissolve and fade away in front of my eyes. I even sat up to check if my dorm mate was in her bed, and there she was sound asleep. \n\nI was just terrified of sleeping every night. Every night would at best, bring a creepy waking experience or at worst, some sort of apparition and sheer terror. I could not tell my dorm mates or my teachers, as I was sure they would not believe me or see it as a cry for attention. I just endured this for months on end, and tried to pray, sleep in certain positions or whatever might improve the situation. A part of me wondered if I was going mentally ill but another part knew that all this started ever since I played that glassy glassy. I tried to convince myself it was in my mind, although I knew I was just lying to myself.\n\n\nAnother school holiday at the end of year rolls around and I’m back home with mom, but the fear hasn’t left me although the encounters started happening much less. On this particular holiday, my mom’s friend Mandy, is staying the night. My mom and her are sitting in my mom’s room, watching movies and chatting away. I did whatever I did as a kid, playing, watching TV but eventually decided I’m going to go to sleep. My room was a bit untidy, the windows were closed, and I had a stack of heavy books on the dresser next to my bed, topped off with some paper/cardboard. \n\nI switched off the light, and settled down to sleep and was just on the point of the deep sleep, when I heard some ‘scratching’ noises of the papers/card laying on the dresser right next to my bed. I opened my eyes and saw another apparition, that same translucent type that somehow showed up no matter the dark – it’s hands were fidgeting with the paper/card and as I looked and it it seemed to look at me. This form was the form of my mom’s friend Mandy, same height, same hair and green eyes that I could see in the dark. For the second or two it just stared at me while touching the paper. What terrified me most is that this time it wasn’t just me seeing thing, I was hearing it touch something. Before I could even spring up to turn on the light, I heard a crashing of the books from the dresser onto the floor.\n\nI bounded out of the bed in one leap and put the light on. Terrified, I surveilled what had happened behind me. The huge heavy books, that had been neatly piled on the dresser, were strewn across the floor. So far spread out that it would have not landed so far, had they collapsed naturally. I was so creeped out, and the book that had been on top, was an old book called “The great controversy between Christ and Satan”  - gosh, just for added spooky and dramatic effect. \n\nStill I knew this ‘possession’ of me was real, and I had unleashed something awful that night of glassy glassy, but the conscious logical part of my mind told me to go ask Mandy if she had been in my room. I knocked and asked Mandy and my Mom, they were both relaxing on the bed watching a movie in their room, and they said no, and looked at me as though I was crazy.\n\nFortunately that incident was the last of them, as this problem left me. It really terrified me as a kid, and although I told mom about the things that happened and that it started with glassy-glassy, she definitely didn’t take me serious. I have told very few people in my adult life, as I imagine they would think I am crazy or a liar. It’s 100% the truth and very real.\n\n ",
        "created_utc": 1671548870,
        "upvote_ratio": 1.0
    },
    {
        "title": "Having a dream about an old high school friend, later to wake up and learn his mother is in ICU.",
        "author": "bltm93",
        "url": "https://www.reddit.com/r/Paranormal/comments/zqqite/having_a_dream_about_an_old_high_school_friend/",
        "text": "Hey everyone, didn’t really know where else to post this. I’m not sure if this is just a coincidence or not but when it comes to the paranormal nothing truly ever makes much sense to me. I have an old friend of mine who I went to high school with years ago, we would drive around after school, go places to eat and me and another buddy would hangout at his place on school nights playing Call Of Duty till late at night. \n\nAnyways, I haven’t spoke to this man since 2013, I graduated in 2012 and he did in 2013 so just putting into perspective of how long it has been. I had a very vivid dream last-night with him and his now ex girlfriend in it (they have not dated since like 2011-2012), but he looked different, he was much older and had very long hair. \n\nThe ex girlfriend essentially looked the same from how I had last seen her in person. Nothing really strange happened, the three of us were just hanging out downtown somewhere walking down a sidewalk past some shops and then I woke up. \n\nThat was it. Didn’t really think anything of it until I got a text message from my buddy (the same one I mentioned who also hung out with us playing COD at his place), and had stated that his mother is in ICU with pneumonia and isn’t doing very well. Anyone know what to think of this?",
        "created_utc": 1671548097,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do spirits charge their energy?",
        "author": "emopurpleblob",
        "url": "https://www.reddit.com/r/Paranormal/comments/zqqew0/how_do_spirits_charge_their_energy/",
        "text": "I’m quite new to this and would like to start using equipment(spirit box and dowsing rods) to talk to spirits. However, I have sooo many crystals. I actually thought this was a good thing, cause they’d protect me from negative entities. \n\nHowever, I started hearing from other paranormal investigators that spirits use crystals and limestone to charge their energy, but I can’t seem to find anything on that online.\n\nDoes anyone know if this is true? Should I leave my crystals at home when I go investigate? Or does it actually just help to communicate with them?",
        "created_utc": 1671547801,
        "upvote_ratio": 1.0
    },
    {
        "title": "Weird experience at parents home about 15 years ago.",
        "author": "ItsToLate77",
        "url": "https://www.reddit.com/r/Paranormal/comments/zqpc6y/weird_experience_at_parents_home_about_15_years/",
        "text": "Ok,so after reading some of the experiences on here I’d figure I’d add mine(not as intense as some of yours)but still weirded/freaked me out.It happened at my childhood home about maybe 15-20 years ago.I was up really late(around 2:30-3am ish.Just finished playing video games and was just watching tv winding down before bed.Flipping through the channels I came across the religious station.It was showing one of those mega churches and the choir was signing some up best song about about Jesus.Well me being me decided it would be a good idea to record it for my voicemail greeting on cellphone,to mess with my friends who called.So I turn the volume up on tv so phone would pick up recording,get everything ready and start to record song.After about a minute or 2 I stop recording and go to listen to what was recorded.Replay recording,pit phone up to ear and listen,was nothing but silence for about 15 seconds or so until this deep,messed up distorted voice(only way to describe it is like someone trying to talk real low and from their throat) says”We are coming by to change you”So I saved it as recording and kept listening to it,freaked me out so much I ended up sleeping downstairs in living room that.Next day I play it for everyone and they all got freaked out too.To this day I have no idea what it was.",
        "created_utc": 1671544961,
        "upvote_ratio": 1.0
    },
    {
        "title": "Sleep paralysis or shadow people?",
        "author": "No-Highway-4833",
        "url": "https://www.reddit.com/r/Paranormal/comments/zqp0j3/sleep_paralysis_or_shadow_people/",
        "text": "This year I’ve experienced two events that I initially thought were sleep paralysis/night terrors, but now suspect may have been shadow people after doing some reading. Both times my name was spoken beforehand. My boyfriend recently had a similar unsettling experience as well. How can you tell the difference?\n\nThe first time I encountered them was in a hotel room on a work trip. While sleeping I was woken to the audible sound of someone whispering my name directly in my ear. I opened my eyes and saw a black shadow figure (a man) standing near the end of the bed by the wall. Next to him was a white shadow figure who gave me the impression of being a woman. I tried to say “who are you?” but could not speak or move my body. The figures started walking as if to approach me, but I got the sense that the white shadow was trying to block the black shadow. I suddenly regained my voice and yelled “who are you?” in an effort to appear strong and scare them away. The figures dissipated. I played it off as a bad dream mixed with mistaking the figures for reflections of objects in the mirror they stood by. I was really shaken and genuinely afraid, though, and it took me a while to fall back asleep. \n\nThe second encounter was last week. I was having nightmares all night, but then was again woken to the distinct, audible sound of someone whispering my name in my ear. I opened my eyes and saw a child-sized black shadow figure right next to my bed staring at me. He seemed to have a faint white outline to his silhouette. Again, I was frightened by this and pulled the covers over my head like a little kid. He was gone when I looked again. \n\nAm I having night terrors or is there something more to this? My boyfriend once saw a shadow figure at the end of his bed when he was a child. Then a few months ago, he woke me up in the middle of the night yelling at something and leaning over me looking at the wall. I asked him what was wrong and he said he was dreaming that a group of freaky shadow figures were crawling on the wall towards me and he was trying to protect me by covering me. The dream (or shadow figures?) ended as soon as he yelled at them. \n\nI understand people believe these shadow figures feed off of negative emotions. This has been a rough year for me, to say the least. So I’m trying to determine if these are just stress-induced nightmares, or entities feeding off my energy?",
        "created_utc": 1671544175,
        "upvote_ratio": 1.0
    },
    {
        "title": "The ghost at the farm",
        "author": "Jydltdtd",
        "url": "https://www.reddit.com/r/Paranormal/comments/zqnosy/the_ghost_at_the_farm/",
        "text": "I can feel and interact with ghosts, but this is the first time i actually interacted with it.\nnext to my friends farm, a man had died. a very friendly man.\n\ni would walk back with my friend who we call jim. i would look at the farm and would see a ghost at the window. as i looked in his eye, he would tell me he found that disrespectful.\ni would say im sorry. and he would say its okay. i went inside my friends house, we call her Anne. Anne was good friends with the deceased man. me and jim told the story and she would go outside. the ghost saw her and became happy. a good friend saw him after years. Anne would say the mans name was Cor, and Cor said that was true. Cor was really happy. Side note, Cors barn was being destroyed because it was unstable. Cor made that barn himself. He said thats why he came back to see his barn one last time. me, Jim and Anne took Anne's dog for a walk. and then anne got emotional and told stories about Cor. i asked Anne if she wanted to ask a question to Cor, but she was too sad to think about a question, and we went back.\nfun fact, dogs can notice ghost, and the dog looked at the direction of cor, his tail wiggling. as if he knew who it was.",
        "created_utc": 1671540768,
        "upvote_ratio": 1.0
    },
    {
        "title": "My harmless spirit roomate",
        "author": "Jydltdtd",
        "url": "https://www.reddit.com/r/Paranormal/comments/zqn9lw/my_harmless_spirit_roomate/",
        "text": "Note: to understand the story better, someone hanged himself in my barn\n\ni am sensitive to paranormal creatures. if its close i can feel it. interact with it. and i have a strange roommate\n\nmy first encounter with him was in my dream. i have heard ghosts can appear in your dreams. and funny enough we were playing paintball. after that i would see him frequently in my house. i decided to call him silly jon because he is funny and harmless.\ni told him he could stay but he had to be silent. only i and my sibling know about him.\nto get back to the guy who hanged himself, my mother told me he was very friendly and helped my father build the house. after i heard the story i knew she was talking about silly jon. he appeared more frequently after the story. his appearance is white, and relatively short/average height. i never saw he had a face. should i be worried or can he stay? because he listens to what i tell him",
        "created_utc": 1671539591,
        "upvote_ratio": 1.0
    },
    {
        "title": "Anyone have these paranormal articles?",
        "author": "Financial_Map1946",
        "url": "https://www.reddit.com/r/Paranormal/comments/zqm6y1/anyone_have_these_paranormal_articles/",
        "text": "[removed]",
        "created_utc": 1671536293,
        "upvote_ratio": 1.0
    },
    {
        "title": "My First Paranormal Investigation (As a Youtuber)",
        "author": "Shamanbears",
        "url": "https://www.reddit.com/r/Paranormal/comments/zqkknh/my_first_paranormal_investigation_as_a_youtuber/",
        "text": "[removed]",
        "created_utc": 1671530456,
        "upvote_ratio": 1.0
    },
    {
        "title": "Christmas tree lights keep turning on",
        "author": "Elegant_Ad_6632",
        "url": "https://www.reddit.com/r/Paranormal/comments/zqj18h/christmas_tree_lights_keep_turning_on/",
        "text": "Okay this is getting creepy now. For the last few days I've been coming downstairs and the Christmas tree lights have been on and my mum has said that she explicitly turns them off at night. Obviously we are in a cost of living crisis right now, and we don't want to cause a fire, so we turn anything electrical or lights off downstairs when we go upstairs. I didn't really believe her until today at 8am I went downstairs and what do you know itbhhe Christmas lights are on. Now, I've never really believed in ghosts but this makes me rethink everything \nThoughts?",
        "created_utc": 1671525027,
        "upvote_ratio": 1.0
    },
    {
        "title": "A ghost killed my unborn baby?",
        "author": "Throwaway_crazy0909",
        "url": "https://www.reddit.com/r/Paranormal/comments/zqfle3/a_ghost_killed_my_unborn_baby/",
        "text": "I consider myself a reasonable person. I don’t really believe in the paranormal and never seek it out. I was 11 weeks pregnant, gained weight, had awful morning sickness, I went in for my scan at 6 weeks and everything looked great. I had a realistic dream less than a week ago that the gas stove in my kitchen was lighting itself and trying to set the house on fire, I called my husband over to show him that the dials that turn on the gas were moving by themselves. In the dream I panicked and said “I rebuke you in the name of Jesus” and right that second, the ghost went inside me and killed my baby. I grew up religious so that must be why I said that in the dream? It was a vivid and disturbing dream. The next day I couldn’t shake it so I told my husband and he said, “oh wow I was watching Bailey Sarian and she said you are supposed to leave ghost alone and not provoke it.” Him making light of it made me feel better and I didn’t think about it anymore. I had my 11 week appointment on Friday and my baby is dead. Silently and without any signs died within 24 hrs of my appointment. I know miscarriages are common. And mentally I’m doing well considering….I didn’t even remember the dream until last night,  I can’t shake how creepy and awful that dream was and it turned out true. This is a throw away account, I just had to share because it sounds crazy and impossible.",
        "created_utc": 1671514150,
        "upvote_ratio": 1.0
    },
    {
        "title": "I think My Dad has been Cursed...",
        "author": "Aura_Masta420",
        "url": "https://www.reddit.com/r/Paranormal/comments/zqfh4k/i_think_my_dad_has_been_cursed/",
        "text": "Now hear me out. My dad always told me stories about him being in Hawaii. It sounded like fun. Anyways, he got some black sand from a beach. His mom, (My grandma, who has died back in 1970s or 80s. I forgot.) wanted to have some black sand from the Hawaiian Beaches as a keepsake. \n\n&amp;#x200B;\n\nA few years later, my dad gets spinal meningitis, which was fatal. My dad was lucky enough to pull through since they didn't have any treatment for Spinal Meningitis (or if there was a treatment for Meningitis, then my dad's family back then was too poor to afford it) Then my dad's mom died from a car accident, which at first is normal, because car accidents are common. Later on in the years, his Urinary Tract Infection has gotten worse and worse. It got worser when he drinks water. \n\n&amp;#x200B;\n\nThen his first wife dies, he told me that every night he would see her apparition on SC-145 (South Carolina State Road 145)\n\n&amp;#x200B;\n\nThen his second wife divorced him, and then his third wife (which is my mom) died from colon cancer back in 2013.\n\n&amp;#x200B;\n\nLately, me and him have been hearing strange and odd noises at night, especially at 3 in the morning. \n\n&amp;#x200B;\n\nSometimes I would wake up at 3 AM because I felt a huge jump up onto my bed. I am a heavy sleeper and having something wake me up in deep sleep is not normal.\n\n&amp;#x200B;\n\nAt times, lately, even in broad daylight, I would see a SHADOW of someone at the entrance to my house, but no one is there.\n\n&amp;#x200B;\n\nSometimes, even with sufficient lighting, I can see dark, shadowy figures out of my peripheral vision (corner of my eye) but when I go to turn and look, nothing's there.\n\n&amp;#x200B;\n\nAll of this bad luck that my dad has experienced is making him confused and psycho. All he wanted was some black sand and give it to his mom for a keepsake.\n\n&amp;#x200B;\n\nI've heard online that taking black sand can curse you, but I don't know. After what my dad told me about Black Sand and curses, I think he IS cursed. \n\n&amp;#x200B;\n\nSometimes my dad's ears would buzz/ring, and then he would say: \"Go Away, I don't wanna hear it\" the ringing and buzzing mysteriously stops. I don't know if this is pure coincidence or a spirit trying to contact him, but I want to know. Is my dad cursed from taking Black Sand from Hawaii?",
        "created_utc": 1671513825,
        "upvote_ratio": 1.0
    },
    {
        "title": "what even is this",
        "author": "Jehutysrunner",
        "url": "https://www.reddit.com/r/Paranormal/comments/zqf885/what_even_is_this/",
        "text": "Hi. I was curious if anyone has had a similar experience with some murky brown green entity's? The first time this happened is when coming home with some friends and it was getting dark, so as soon as I opened the front door I reached over to turn the living room lights on. As soon as I did they blew like when a bulb finally gives out. With that last flash I clearly saw a tallish brown figure run from the living room and into the kitchen. Between the kitchen and living room is a wall similar to one you find in a studio apartment dividing the bedroom and living room. Something told me to try the lights again and they worked like nothing even happened. I went and checked the garage and laundry to find no one. I also tried to check the backyard but the gate was still locked. You need a key to open it. Life went on and that same year at my friend's house we were talking about spooky things and I swear to you some two foot murky thing came and smacked me on the leg and just disappeared. I was spooked but went on like nothing happened. The only reason I thought about this again is because a few days ago I came home and the lights in the living room and kitchen were on. When I put my car and gear and turned off the headlights the lights were off. I thought my sister in law was home as she was having a rough few days, I took it to be her going to her room. About twenty minutes later she was dropped off by her friend. I immediately went to check my room to see if any of my stuff was stolen, but it was all still there. I had to sit and think after because the dogs are big and only love the family. Other than that they bark and cause a ruckus over anything. That's when I started to remember what had happened in my teens and it being well over 14 years when that first incident happened. To me it has no explanation. I tried to think maybe the dogs turned the lights off by hitting the switch by pawing at the door, but that would not explain the kitchen light and the living room lights turning off at the same time. Unless this was the life of pets and they be hiding the party they were having. Lol.",
        "created_utc": 1671513081,
        "upvote_ratio": 1.0
    },
    {
        "title": "noises over the baby monitor?",
        "author": "SqueakyMarshmellow",
        "url": "https://www.reddit.com/r/Paranormal/comments/zqf70v/noises_over_the_baby_monitor/",
        "text": "I swear to goodness, every night, after my son (2.5 yrs) is asleep, I can hear movement in his room, and it sounds like someone is holding the monitor and messing with it. Sometimes I hear what sounds like whispering, but I've never been able to make out any words. It doesn't sound like my sons voice though. He's also recently started pointing to the corner (which is actually where I get a creepy feeling from, even before he started this) and saying \"eric\" which is his half sister's father's name.. my thought is that something is appearing as Eric, to make him trust it? Thoughts?",
        "created_utc": 1671512991,
        "upvote_ratio": 1.0
    },
    {
        "title": "Trying to figure out what this could possibly be.",
        "author": "EggplantProper2564",
        "url": "https://www.reddit.com/r/Paranormal/comments/zqf2y4/trying_to_figure_out_what_this_could_possibly_be/",
        "text": " When I was young, each house I lived in, (four houses), I saw a greyish creature, that had incredibly long, curved and pointed shoulder blades. It walked on all fours and only appeared in a glimpse. Every time I saw it was through a window, but it ran past it fast. It always ran towards a tree line. This was in Illinois, since leaving the state I haven't seen it since. The longest look I got was ten seconds. I never saw the face. Does anyone know of something like this?",
        "created_utc": 1671512673,
        "upvote_ratio": 1.0
    },
    {
        "title": "Looking for Answers (Ghost Girl)",
        "author": "Neither_Yellow_",
        "url": "https://www.reddit.com/r/Paranormal/comments/zqdggm/looking_for_answers_ghost_girl/",
        "text": "Hello everyone!  \nthis is my first Post here in Paranormal, its about a \"Girl\" i have seen many Years ago.   \nTill today it wont be forgotten since it felt extremly real. So im not looking for the logical answers here actually since i am well aware it could have been a sleeping paralysis,  hallucination  and so on.\n\nI came here today to read all other Opinions and maybe Experiences.  \nSo i hope that will be respected.  \n\n\nWhen i was a Teenager about 16 Years old i slept as like usual in my Room and woke up in the middle of the Night. I dont remember the Reason anymore sadly but i feel it was this typical \"beeing watched\" feeling.  \n\n\nI slowly opened my Eyes, almost like i was in somekind of a Trance or not supposed to wake up (Sleeping Paralysis i know) , anyways - what i saw there shocked me back then.\n\nAbove me was ...floating or flying a Girl and she was beeing \" transparent \", as in most common Movies i would say. She did wear some kind of a Dress but i cant remember if it looked like from old Age. Strangely enough, i remember she was blonde.\n\nI couldnt move from fear and she just observed me silently. After a while and i would estimate it must have been some Minutes , my fear got even worse and in a Way that i actually managed to scream.\n\nWhile i screamed and looked at her, i saw her face slowly changing from confusion to something like fear which i still wonder till today why she would be feared(?)  \n\n\nSo far my only conclusion is that she noticed i could see her and i wasnt supposed to so thats why she got scared maybe. After me screaming, i ran out of the Room and she was gone and never re-apeared, atleast not that im aware of. \n\nSince it was so realistic , i still think about it today here and there. I waged all options and settled with a Daydream but as you know...there is a Side in me that whispers \"what if...\" which is why im writing this. Coriousity i suppose.  \n\n\nWell i hope its not too boring to answer since i would like to figure it finally out and i know it sounds so cliche and all. Im looking forward to your Answers, Questions and suggestions! Thanks in advance and have fine Holidays!",
        "created_utc": 1671508146,
        "upvote_ratio": 1.0
    },
    {
        "title": "Lady of the house",
        "author": "billnyeseyes",
        "url": "https://www.reddit.com/r/Paranormal/comments/zqdbrv/lady_of_the_house/",
        "text": "I want to give a back story before getting into the juicy stuff, so this may be a little long, I’m sorry. \n\nSo the house I live in was built sometime in the 40’s and it sits on 5 acres of land. \nI live in a very small town, smaller then small, I call it a micro town. It’s hardly even a town, there’s not much here, and it’s pretty rural, but nestled between two other cities. \n\nOnly about a quarter of our land is cleared, the rest is dense woods. We don’t go back in there often because of ticks.\nHowever, my boyfriend has been throughout the whole property, and he came across what used to be another house deep in the woods. \nIt looks as though it burned down, all that’s left is some bricks (which match the bricks of our fireplace/front porch) and the cement blocks the house once sat on (which match the cement blocks our house sits on) \n\nOur house is all wood, except for vinyl siding which was probably put on in the last 30 years or so. \nI’m assuming the old house burned down and the originally family rebuilt the current one we live in now. \nAll 5 acres have remained as one property over the years, so the original family owned every bit we own now. There is no record to my knowledge of the house we found in the woods, so there is no telling how old it is. \n\nThe town was established in the 1830’s. Something odd to note is that there are no cemetery’s here. I do know that it was common to have a family plot on your property, and most homes here sit on at least a few acres. Honestly I believe there could be a couple of people buried here, but we haven’t found any headstones. But also, if they were marked with flat headstones, they could be possibly grown over/covered. \n\n\nSo here’s where the paranormal aspect comes into play: \nA few months ago I was getting ready for work. I was in the bathroom with the door open. The bathroom is at the very back of the house. \nI suddenly heard a woman talking, as I stepped out into the hall it stopped. I walked around and made sure the tv wasn’t on, computer was not on, and it wasn’t my phone which was right next to me. \n\nI brushed it off and carried on. I told my boyfriends dad about it, and he mentioned seeing a shadow figure in the living room/dining room area, which is where the woman’s voice came from. \n\nA few days ago while I was at work, my boyfriend was here alone in the office at the back of the house by the bathroom. \nHe was messing with a knife or something, and all of a sudden he here’s a woman laughing and it sounded like it came from the front of the house. \nHe’s a skeptic and has never had a paranormal experience, but he texted me right away. I reminded him of when I heard her talking. \n\nTwo nights ago we were sitting on our bed with the door open, right across from the kitchen. We had the the lights off aside from the lamp in our room. He looked at me and said he just saw a figure walk across the kitchen toward the dining room.\n\nI’ve never seen a figure myself. We aren’t scared, whatever is here seems friendly. \nI wish I knew more about the history of the property.",
        "created_utc": 1671507802,
        "upvote_ratio": 1.0
    },
    {
        "title": "Confusing experience from childhood",
        "author": "Alarocky1991",
        "url": "https://www.reddit.com/r/Paranormal/comments/zqd4ds/confusing_experience_from_childhood/",
        "text": "My girlfriend the other day asked me if I have ever had a paranormal experience, and I gave it a quick thought. Started to say no, when an old memory came flooding in. \n\nI was about 10 and my family went to visit my stepdad’s side of the family in a VERY small town in Minnesota. The trip was fine until my mom left a couple days early. I didn’t mind, I’m very close with my stepdad and was having a good time with all the cousins. The house was short on beds so me and my stepdad shared a bed in the basement. \n\nI woke up extremely uncomfortable, the best way I could describe it is the feeling of being crushed by hard plastic, like the kind they used for N64 products. The feeling even had the same ‘creaking’ to it. I was young and scared, abnormally scared and could move but painfully. I woke up my stepdad and he thought I was just having a bad dream, but it didn’t really subside until I got him to take me upstairs. I slept on the floor upstairs after that and haven’t ever been able to come up with an explanation for what happened. I’m in my 30’s now and it still makes me nervous to think about. Any thoughts?",
        "created_utc": 1671507249,
        "upvote_ratio": 1.0
    },
    {
        "title": "6 ft tall bipedal rat",
        "author": "iretrate",
        "url": "https://www.reddit.com/r/Paranormal/comments/zqcv5z/6_ft_tall_bipedal_rat/",
        "text": "I just made a post in r/helpmefind, but I’m curious if any of you have ever seen a 5-6ft tall bipedal rat? It felt real when I was a kid, but now I’m thinking it could have been stuffed? I remember leather jacket and sunglasses. \n\nSomeone else posted about seeing weird creatures outdoors and indoors, and I commented with what I remember happening to me as a kid. Now I can’t shake the thought of not knowing what it was, and it’s driving me crazy.",
        "created_utc": 1671506567,
        "upvote_ratio": 1.0
    },
    {
        "title": "Chased by shadow person",
        "author": "iamvee333",
        "url": "https://www.reddit.com/r/Paranormal/comments/zqbyuv/chased_by_shadow_person/",
        "text": "    I wanted to start this off by saying this happened many years ago and i’ve had very many more run ins with these “beings” than i care to admit but I slowly came to be less afraid. This first experience I had was in around 2007 or 2008 I was around 8/9 at the time and my family and I were on vacation in Del Ray Florida at the vacation home the company my dad works for owns. This day was like any other while we were on vacation, go out to the beach, go to dinner and relax at the house etc. The bedroom I was staying in had a bunk bed and a double bed just horizontally across from it being the child I was I picked the top bunk to sleep in, that night I fell asleep as I would any other night except I would be woken up by something or rather someone unexpected. I woke up out of a dead sleep to the sound of the closet door being opened I was too tired to think anything of it until I sat up and turned around to see what it was and then I saw it, a very dark hooded shadow figure that stood anywhere from 6’6 to 7ft. I instinctively jumped out of bed completely missing the ladder to the top bunk and landing on the double bed, then running to the other side of the home to where my parents were sleeping. when I was running i’d look back over my shoulder and it was following shortly behind me reaching out toward me. at that time I felt a very malicious energy from it like it wanted something from me.\n      I still have so many questions if anyone has any ideas on what it wanted, what it was, where it came from, and why it was there please let me know. also I still have many more stories after this incident, I feel like maybe something started following me that night. anyway thank you for reading I have told very few people about this but it’s still so raw my head.",
        "created_utc": 1671504191,
        "upvote_ratio": 1.0
    },
    {
        "title": "Anyone else notice a change the last 6 months or so?",
        "author": "AlexT9191",
        "url": "https://www.reddit.com/r/Paranormal/comments/zqbu9b/anyone_else_notice_a_change_the_last_6_months_or/",
        "text": "I really do apologize for the vague sounding title, but didn't know how else to put it. Has anyone else noticed a change in things you feel link you to the paranormal? In my case, it's mostly dreams. I get strange dreams and always have, some of which feel paranormal in some way, be it projection, prophetic dreams, going into others dreams, or sometimes just layered nightmares in which it feels like something is fighting to hold me there. \n\nThings I learned to do and ways I learned to sleep to avoid these dreams no longer work, atleast not as well. This started about 6 months ago with no clear trigger that I can see. I had one of those layered nightmare dreams tonight, but it seemed much more like something was trying to pass some message to me, though it didn't feel like that thing was nice. Among other messages I got before I manged to pull myself from my sleep was something like \"there's a surprise waiting for you,\" \"help me!\" and a verse from a Stone Sour song called Do Me A Favor\" was repeating in my head as I woke. There was also some kind of message being written that I can't really remember, I think it finished writing it but I can't remember what it said.\n\nI know dreams can be nonsensical Insanity and be natural dreams, but this felt more like dreams I've had that I identify as being paranormal. Like I said, I sleep certain ways to keep these types of dreams from happening and it's always worked until the last few months. Tonight, I was sleeping in a way that normally blocks my dreams, but it didn't work tonight like other nights recently.\n\nHas anyone else had something change for them in the last 6 months or so similar in any way to what I'm experiencing?",
        "created_utc": 1671503848,
        "upvote_ratio": 1.0
    }
]