[
    {
        "title": "I think I drowned",
        "author": "wisdompuff",
        "url": "https://www.reddit.com/r/Paranormal/comments/10jw8qz/i_think_i_drowned/",
        "text": "My family and I were on vacation in a hotel by the ocean. I was young, about 5yo. One afternoon we were at the Hotel pool alone, my parents and brother were teasing me and wouldn't allow me into the hot tub, saying that I was too young. I became very angry and stormed off wandering around the pool.\n\nMy next memory is sitting cross legged at the bottom of the pool.  I was stuck somehow and for some reason I couldnt or wouldn't move. I was just sitting and looking around, I distinctly remember seeing the pool walls and I could see the water fluttering above me. A strange sensation overcame me, I felt warm and colourful if that makes any sense. \n\nI saw the water above me break and an arm suddenly wrapping around me, I remember feeling the abrasive hair on the arm as it was across my body and neck.\n\nMy next memory is standing beside the pool. I was perfectly fine but in shock about what happened.  There was no one else around the pool, including who rescued me.\n\nI ran over to the hot tub and told my parents everything that happened, they just brushed it off.\n\nIt was very confusing, surreal and vivid, but I remember seeing the man who rescued me.  He was tall, much taller than my father, he was very pale, practically white, with freckles and orangey red hair and a long face, he was also wearing a bathing suit. I remember seeing him standing beside the pool with his hand raised. I also remember him telling me to stay away from water but I don't remember him speaking to me directly.\n\nTo say the least, this has had a lasting impact on my life. I have had many other paranormal experiences ( some I shared here). I am devout and thankful for my second chance. \n\nAt times, I wonder if I died that day, or atleast, a part of me. Maybe there are other people that feel the same?",
        "created_utc": 1674531724,
        "upvote_ratio": 1.0
    },
    {
        "title": "Hiking at night (anyone else has hiking stories?)",
        "author": "uruythiel",
        "url": "https://www.reddit.com/r/Paranormal/comments/10jw4lg/hiking_at_night_anyone_else_has_hiking_stories/",
        "text": "I used to do alone mountain hiking a lot, with camping under the sky, I went to the place very well known to me that I visited many times before, historically it has some very ancient ruins. But today, it’s mainly just a very beautiful trail. Hiked the mountain alone although met some people during it, made a bonfire for night, and went to sleep on the ground in the sleeping bag. I kept getting woken up by foxes or raccoon dogs, more than one, making sounds very close to me, curious about bonfire (or sausages). On 4:00 or shortly before, I just gave up on resting, cause they sounded like annoying whining babies, packed my things and decided to start going down during nighttime, it was autumn and sun still wasn’t going up in next 3 hours. I was totally chill and humming and I knew the place perfectly. After half an hour, I heard two girls chattering quietly and giggling, like you know, “talk about boys”, and saw a little fire light like from a lantern or lighter for a few seconds from quite a distance, but it made me absolutely sure that they’re legit people. I got super excited about company and I could hear that they were also going down, so it would make me feel way better to spend the next 2 hours with other girls. I started walking faster and kept hearing some random words of their conversation, but they weren’t getting closer (the sound), it was like that for around 10 minutes, but then it just stopped and went quiet, I literally started to run down the trail at some point to catch up with them, and said “hello?” few times so they don’t think I’m dangerous and can hear that I’m a girl too, but the place was dead silent, I just stopped in place at some point to hear the footsteps or rocks moving and there was just absolutely nothing. The trail didn’t separated in next few kilometres and it was impossible to go offroad at this hour due to big rocks and steep ground, so there was just no way that these hikers would take a stop I missed, or a turn. It hit me how naive I am, and like, what did just happened? I got scared, turned off all my lights and took the most quiet and fastest walk of my life. This is the creepiest experience I got, mostly due to the fact that I had no doubt for so long.",
        "created_utc": 1674531358,
        "upvote_ratio": 1.0
    },
    {
        "title": "When I was little, I’d see spiders and small black bugs crawling all over my ceiling and walls",
        "author": "PastyMilller",
        "url": "https://www.reddit.com/r/Paranormal/comments/10jvges/when_i_was_little_id_see_spiders_and_small_black/",
        "text": "I’m not sure if this is a silly question. I read a bit about it, and there is some research to suggest really young children experience visual hallucinations. \n\nI’m 30 now and still remember these “episodes” so vividly. Just pure terror. I remember I’d freeze and just watch them crawl everywhere (sometimes on me). My mom says she could never manage to convince me that what I saw wasn’t real. \n\nI don’t know. What do you think? Overactive childhood imagination? Or something else? I know our brains are incredible and powerful (especially children’s), but the memory of these episodes to this day makes me fearful and nervous.",
        "created_utc": 1674529269,
        "upvote_ratio": 1.0
    },
    {
        "title": "Ghost spotted near bridge in a car",
        "author": "axelreturns",
        "url": "https://www.reddit.com/r/Paranormal/comments/10jtpyu/ghost_spotted_near_bridge_in_a_car/",
        "text": "So these pictures are from my wife from about 4 years ago. We started talking to each other about 3 years ago. As you can see the figures are on the left and show a face of what appears to me to be a man. The back story is somewhere in up state New York where my wife has some family that lives there. In the two photos I will be sharing there is a bridge. There has been accounts of death’s surrounding the bridge. My guess is the spirt or entity grabbed onto their vehicle as they passed by. I have always been a believer of something after death. Possibly this will change some peoples minds who are nonbelievers.",
        "created_utc": 1674524085,
        "upvote_ratio": 1.0
    },
    {
        "title": "Multiverse blip?",
        "author": "Repulsive-Mud-355",
        "url": "https://www.reddit.com/r/Paranormal/comments/10jtiko/multiverse_blip/",
        "text": "I believe I found a glitch. .  Or perhaps a multiverse transfer? Mandela theory at least. . At work there's this piece of equipment near where I work. It had two holes in it. I know because I used to play with them as a sort of fidget spinner kind of thing. They no longer exist. The holes are gone. Same equipment. Just no holes",
        "created_utc": 1674523482,
        "upvote_ratio": 1.0
    },
    {
        "title": "Weird occurrences in my old house",
        "author": "sameeoo",
        "url": "https://www.reddit.com/r/Paranormal/comments/10jswzm/weird_occurrences_in_my_old_house/",
        "text": "My home is from 1928 and as far as I know only 2 people have passed inside the house. I hear someone calling my name a lot from the other room and here recently I've been feeling something touching the back of my head and playing with my hair it seems like.. I'm starting to get a little worried",
        "created_utc": 1674521794,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is there a way to see him for more than a moment?",
        "author": "Apprehensive-Top4052",
        "url": "https://www.reddit.com/r/Paranormal/comments/10jsmv3/is_there_a_way_to_see_him_for_more_than_a_moment/",
        "text": "I never thought I’d believe in ghosts or anything. My mom always said ghosts were just someone desperate for something. Which, may be why I saw him at all. \n\nThe love of my life passed away a little over two months ago, now. He battled cancer. Lost, I guess, but it never seemed that way because he was strong in all of it. I would write endless paragraphs about him, but weirdly this isn’t about him anymore. \n\nThis past week has been really weird I guess. I was in our bathroom in front of the sink brushing my teeth and for just a short moment I saw him in the reflection standing beside me. Not as he was in the end, sick, but as he was when he was healthy. It barely lasted and before I could even register what it was, it was gone. \n\nI know it sounds like utter bullshit but if I’m being honest it didn’t scare me. It felt like a kick to the gut, a reminder of what was gone, but not frightening. \n\nOver the past few days there’s been a few other occurrences. One, I was sleeping, and I heard a voice in my head telling me to call my mom. I’m 23, I don’t do it often, but the voice eventually woke me up and I ended up calling her out of nowhere. She was in a state of panic because her brother (my uncle) was in a drunk driving accident, which killed him, and she had JUST received the news when I called. Fucking chilling that I woke up to that. It’s probably coincidental timing and nothing more, but that doesn’t stop it from being fucking weird. I did what I could to help her, but I’m just a husk of grief myself. \n\nTwo days ago I went to therapy (because I’m grieving my ex-fiancé, but I’m not crazy or anything). On my way home from the appointment I was driving in my car and the radio connected to something, I’m not sure what, and started playing one of his favourite songs. I don’t have it on my phone, there was no reason for it to play, but it did. I pulled over to cry. \n\nI miss him so fucking much. And I know it’s crazy to say but these little moments I feel touched by him are the greatest in my life now. Is there a way to make them more frequent? Or, even better, a way to see him and communicate with him? \n\nI know asking to communicate with the dead can be dangerous or whatever but I have nothing to lose. Barely any family, no friends, all I lived for is gone. But if there’s a way to see him or talk to him again I want to know. I want my baby boy back to me. \n\nIf you know anything that would help, please share. If not, please don’t make fun of me. I know I seem crazy latching onto the tiniest signs. But if you lost the only thing you lived for, you’d find yourself doing the exact same.",
        "created_utc": 1674520984,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can a non-catholic conduct an exorcism - A cross cultural perspective",
        "author": "Key-Responsibility8",
        "url": "https://www.reddit.com/r/Paranormal/comments/10jsk6f/can_a_noncatholic_conduct_an_exorcism_a_cross/",
        "text": "Exorcisms have always confused me. \n\nAcross the globe, many cultures believe in possession by outside forces.  A catholic exorcism is not the only ritual focused on riding a person of a malevolent presence. \n\nHowever, based off the media, exorcisms are always focused on the catholic faith. The demons are negatively affected by holy symbols, water blessed by ordained ministers  burn them and they can't speak the words of the Bible.\n\nBUTTT... what if a non-catholic is possessed by a demon? Can the rituals rooted in Indigenous shamanism expel a demon?  \n\nAnd what about cultures where possession isn't rooted in evil beings occupying a soul\nsoul. I am not the most educated in this faith, so feel free to educate me on this topic ( I am always open to learn new things), but Voodoo spirituality where possession is seen as a positive  way of communing with ancestors  divine spirits?\n\nPlease share your beliefs possession and spirituality . I am interesed in a cross cultural perspective.",
        "created_utc": 1674520770,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is it a sign? Am I a clairvoyant?",
        "author": "Officer_dude",
        "url": "https://www.reddit.com/r/Paranormal/comments/10jrzhr/is_it_a_sign_am_i_a_clairvoyant/",
        "text": "Hello everyone, kind of long, but I figured I would get some other opinions. So to start from the top… I will let everyone know that I am a true crime buff (it will make since in a few minutes). I keep having dreams of finding a body in a specific place that I have never been to, and that I can remember, it doesn’t line up at all with any of that. It’s like a record playing on repeat, and it’s the same over and over and over. And very detailed as well, like finding the gloves and weapon used wrapped up in a ditch line not far from the body. And it’s not all the time I have the dream, it comes and goes. Also, at night when I’m about to go to sleep, and the house is quiet, I swear I hear someone talking. It sounds like a female, and it’s very very faint. I can’t understand what it’s saying, but it seems to be normal conversation, and not like yelling or anything crazy like that. I am looking for guidance of am I having a “vision”? If so, how do I channel it and try to figure out what I can do to help? Or, am I crazy and have an overactive brain? To add to this, I will gladly provide any and all details in the comments below if anyone is wanting to hear it. And I also take constructive criticism very well. And this last disclaimer. No I’m not (that) crazy. I don’t have schizophrenia or delusions at all. No I don’t live in a place where I just hear my neighbors talking either. Thanks for any and all thoughts.",
        "created_utc": 1674519149,
        "upvote_ratio": 1.0
    },
    {
        "title": "My dog detected a ghost (can’t post the video)",
        "author": "epicFailure16",
        "url": "https://www.reddit.com/r/Paranormal/comments/10jrcrr/my_dog_detected_a_ghost_cant_post_the_video/",
        "text": "Hello, I moved into my dad’s house. He has one dog, name buster, but. One night, last night he woke up, looked around followed this shadow around the room and started whimpering, he ran to me. What did he see (MESSAGE ME FOR THE VIDEO!!!)",
        "created_utc": 1674517465,
        "upvote_ratio": 1.0
    },
    {
        "title": "Happy to help anyone.",
        "author": "NaturesDarkness",
        "url": "https://www.reddit.com/r/Paranormal/comments/10jqqld/happy_to_help_anyone/",
        "text": "If anyone is dealing with paranormal experiences that are truly effecting their lives and are finding it difficult to deal with or are just afraid. I am here to help in anyway i can. \nI’ve dealt with a significant amount of these things in my life and understand how truly difficult and destructive they can be. If anyone out there needs advice or guidance on how to get rid of these things i encourage you to let me know. I am happy to share my personal experiences and I will give to you everything I had learned on living with and overcoming these things.",
        "created_utc": 1674515902,
        "upvote_ratio": 1.0
    },
    {
        "title": "why aren't birds flying?",
        "author": "Wise_Hunt_9050",
        "url": "https://www.reddit.com/r/Paranormal/comments/10jq708/why_arent_birds_flying/",
        "text": "[removed]",
        "created_utc": 1674514556,
        "upvote_ratio": 1.0
    },
    {
        "title": "Entities On The Stairs",
        "author": "shortedgyasain",
        "url": "https://www.reddit.com/r/Paranormal/comments/10jpfbc/entities_on_the_stairs/",
        "text": "Recently, whenever I'm in the kitchen, I've noticed this entity on the stairs that leads down to the basement. I'll be washing dishes, baking or cleaning and out of the corner of my eye, I'll see this thing at the top of the stairs. We have a baby gate at the door so the dog doesn't go down, and it'll crouch and poke its fingers through and wiggle them around. \n\nSometimes, It'll run up and down at full speed, or walk really slowly. It's got this pale oval face and has a black cloak, and it even stands on the stairs and looks down at you if you're downstairs grabbing something. I got chased by it the other day when I was bringing a pan from upstairs, and my brothers refused to go downstairs alone. My grandma will hear it when she's sitting in the kitchen, and the dog is scared of going by the stairs. \n\nIt isn't the first time seeing this, back in 2021 we've seen it but haven't seen it much in 2022 so we thought it went away when we cleansed the house and got it blessed. We try not to let it bother us, but it's terrifying sometimes when you see it's fingers wagging at you, or when you hear it run up the stairs and round the corner  so it's right at the kitchen doorway.",
        "created_utc": 1674512620,
        "upvote_ratio": 1.0
    },
    {
        "title": "Demonic possession",
        "author": "NaturesDarkness",
        "url": "https://www.reddit.com/r/Paranormal/comments/10jpc7v/demonic_possession/",
        "text": "Does anyone remember the name of the man who was possessed and the footage of his face morphing during an exorcism? I believe this was an Ed and Lorraine Warren case.",
        "created_utc": 1674512406,
        "upvote_ratio": 1.0
    },
    {
        "title": "I have spirit/entity haunting me in my sleep at night",
        "author": "Revolutionary-Ad8242",
        "url": "https://www.reddit.com/r/Paranormal/comments/10jol7m/i_have_spiritentity_haunting_me_in_my_sleep_at/",
        "text": "Lately while staying over at my boyfriend’s house, I’ve been experiencing scary nightmares where a male entity visits me. I fall into a trance where I cant move or talk. I’ve had sleep paralysis many times before &amp; I know it’s common to see scary figures. But this thing I keep seeing feels different. His room is in the back connected to the garage, away from the other rooms, so it gets creepy &amp; quiet at night. \n\nDream #1: I was sleeping alone in his room while he was working early. I was laying on my side facing the door &amp; saw the door slowly opening. I thought it was just his mom checking on me, but as the figure came closer it was a male with no face. He came to where I was laying and slightly bent forward to look closer at me. I couldn’t move &amp; started to panic but I woke up before anything else happened. \n\nDream #2: Last night as we tuned off the tv and got ready for bed, I jokingly said to my bf: “that man is back again, he’s standing in the corner” to scare him. We fell asleep but later I woke up bc I heard something moving in the garage. Then I heard a deep but quiet male voice call out my name, repeatedly. I got scared bc I could feel it coming closer to our door &amp; I tried to wake up my bf but I couldn’t move or talk. The voice was getting closer, and I saw a door open wide. I was so scared I woke up screaming.\n\nMy bf also had a paranormal experience in his room last month. He was asleep &amp; heard a loud knock in his room. He thought he was dreaming until his brother woke him up &amp; told him “did you hear a knock?!”. They checked the cameras but there was no one. \n\nIs there anything I can do for this entity/spirit to leave me alone?\n\nTLDR: I have a male entity that keeps haunting me in my sleep at night. Only happens when I stay at my bf’s house.",
        "created_utc": 1674510615,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is it normal to hear a knocking at your door late at night?",
        "author": "ArtistConscious622",
        "url": "https://www.reddit.com/r/Paranormal/comments/10jofzo/is_it_normal_to_hear_a_knocking_at_your_door_late/",
        "text": "Okay, so I (14F) was just sat in my living room a couple of weeks ago, and suddenly I heard a knock on my door. I opened it, but nobody was there. I heard some footsteps but there waa nothing else, so I went back to watch TV. About 5 minutes later, I heard another knock, but this time it came from the back door. We hear knocking on the doors and windows in my house occasionally, but it's always at night. I could hear some faint speaking during the most recent event, but I didn't see anyone? If anyone has any sort of answer, it'd be greatly appreciated.\n :)",
        "created_utc": 1674510251,
        "upvote_ratio": 1.0
    },
    {
        "title": "Post removed stating reasons that made absolutely no sense",
        "author": "Roadkill_Vegan",
        "url": "https://www.reddit.com/r/Paranormal/comments/10jnuqq/post_removed_stating_reasons_that_made_absolutely/",
        "text": "I posted that I personally had a nightmare at the exact same time as my dog and my husband, and it was taken down because it wasn’t a “personal” experience, and it wasn’t paranormal. Um… it was literally a personal experience, and how is it less paranormal than security cam footage of literally nothing?",
        "created_utc": 1674508803,
        "upvote_ratio": 1.0
    },
    {
        "title": "Did you ever dropped a spoon and then it was nowhere to be found?",
        "author": "Icy_Tomatillo2699",
        "url": "https://www.reddit.com/r/Paranormal/comments/10jmg1n/did_you_ever_dropped_a_spoon_and_then_it_was/",
        "text": "Recently, I dropped a spoon but when I looked down to grab it, it was like it just vanished into the air. I looked for a solid ten minutes but there was no trace of it. A similar thing happened to one of my friends. Do you have any idea why?",
        "created_utc": 1674505426,
        "upvote_ratio": 1.0
    },
    {
        "title": "Heard voices at 4 am.",
        "author": "Natural_Signature_55",
        "url": "https://www.reddit.com/r/Paranormal/comments/10jmdyl/heard_voices_at_4_am/",
        "text": "I am not really that active on reddit ,but something happened that compelled me to write this . So I came back home ,for my holidays and was just brushing up on  an assignment that I had( I live alone and just came back home for my Christmas holidays ) . I got bored and decided that I'd rather watch a movie and call it a day . The movie was so good that I lost track of time and before I knew it , it was already 4am. I decided that I'd complete the rest of my assignment tomorrow , and went upstairs to fetch my phone when suddenly I heard a voice of an old man ,nothing downright terrifying but nonetheless, this voice was coming from my parents room and kept on saying a single line \" I won't hurt u girl . Do u wanna play?\"\n \n\nI rushed to the room and opened the door , only to find my sister staring at the wall in a half groggy/half conscious state , I quickly put her back to sleep but still couldn't figure out where the voice came from, and how none of my parents heard it , but I did ?\n\nAlso I'm sorry if my English is broken, it isn't my first language .",
        "created_utc": 1674505285,
        "upvote_ratio": 1.0
    },
    {
        "title": "the screems in my head",
        "author": "CupcakeIntelligent28",
        "url": "https://www.reddit.com/r/Paranormal/comments/10jlmde/the_screems_in_my_head/",
        "text": "I know this might not be the best place to ask but why are there people screeming in my head each time I try to concentrate.  \nits not like someone screeming at me,its like a whole ton of people screeming as if they all are being tortured to death and what do i do",
        "created_utc": 1674503434,
        "upvote_ratio": 1.0
    },
    {
        "title": "Snuggled by a ghost",
        "author": "agnessman",
        "url": "https://www.reddit.com/r/Paranormal/comments/10jl69a/snuggled_by_a_ghost/",
        "text": "I woke from a crazy dream the other night at around 3:00am.  I don’t really remember the dream, but I was thinking to myself “wtf, that was nuts,” and rolled over on my left side to go back to sleep.\n\nAs soon as I moved I vividly felt a body press up against me from behind - spooning me.  It felt very real.  Warm, sooth skin against mine.  Arms wrapped around me hugging my chest.\n\nI was surprised, but not afraid at all.  It felt very loving, comforting.  No sexual vibe.  It seemed feminine.  Tbh I enjoyed the experience as I’ve been really lonely lately, and I just laid there for quite a while knowing there was no physical human in my bed.\n\nEventually I had to get up to go to the bathroom, and confirmed there was no one there.  Kinda hoped it would return when I got back in bed, but it didn’t.\n\nI woke the next day with no recollection of my dreams, but crystal clear memory of this experience.  Been feeling a little off since then:  more irritable, depressive.  I do go through waves of depression normally, so could just be coincidental.",
        "created_utc": 1674502342,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is going on",
        "author": "Advanced-Tomatillo91",
        "url": "https://www.reddit.com/r/Paranormal/comments/10jkymk/what_is_going_on/",
        "text": "So for about 2 years I've had these \"entities\" attached to Me. I've moved several times and they always follow. They almost feel like ghost kittens? I feel them when I lay in bed walking all over my body. Sometimes they squeeze my feet a lot. Sometimes they mess with privates. It's so crazy. It's usually harmless but a few times I've been scared how strong they can be. I recently heard they could be \"imps\" or magical creatures. IDK. But I believe in everything now! I can never see them only feel them. Anyone have any thoughts??",
        "created_utc": 1674501818,
        "upvote_ratio": 1.0
    },
    {
        "title": "Has anyone had experiences of seeing a dark shadow blob?",
        "author": "Elle_b3nnett",
        "url": "https://www.reddit.com/r/Paranormal/comments/10jjjub/has_anyone_had_experiences_of_seeing_a_dark/",
        "text": "Came to this sub reddit, if anyone knows what it could've been. But here goes. \n\nNo it's not an orb, but I mean a blob is the best way I could describe what I saw. It was darker than anything. First time I saw one I saw two of them, looked like it was manifesting from the floor getting bigger etc. I would've been more scared to know what it had manifested into. This would happen when I would wake up, seeing the dark blobs from the floor.",
        "created_utc": 1674498428,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does something follow me?",
        "author": "Apple_aDay",
        "url": "https://www.reddit.com/r/Paranormal/comments/10jjdkp/does_something_follow_me/",
        "text": "I have quite a bit of paranormal experiences, so I’ll start by saying I’m generally good about “debunking” events. If I can find any explanation, I’ll take it. As a child in my childhood home, there would be clinks and clanks from the kitchen in the early hours of the morning, the sound of swishing water from the bathtub next door with asleep everyone in bed, and the occasional footsteps in the hallway. My younger brother passed away in a car accident a year or two before I went to college, and I had a few instances of being poked in the back, and strange dreams, but I believe this was my brother letting me know he was okay. But the events of my childhood home didn’t bother me, as it wasn’t a daily (or nightly) thing. I had smaller, less noticeable experiences in college (I fell asleep on the couch one night in a house I was renting and woke up to the feeling of someone watching me, again fell asleep on the couch another night and felt someone sit down at my feet so surely I sat up and said “what’s up?” Before realizing no one was there, ect.) But I brushed it all off, as each experience could have been a figment of my imagination. \n\nI soon graduated college and fell in love. My now-husband, Brandon, had a house all of his own and I moved in with him after a year of dating. It was a simple two-bedroom, one-bath brick house, and he had a cat named Chase who absolutely hated me for a while. I immediately felt off being there. While I’m very logical when it comes to paranormal events, I also very sensitive and can feel when things are…off. The first major event took place maybe a month after I moved in. I’d hear the occasional movement in the empty laundry room or the guest room, but never solidified it as paranormal. One night, as we are both in bed watching a movie, the sound of our couch being flipped across the room sent Brandon straight to the bedroom closet where he grabbed a bat and told me to have my phone ready in case I needed to call 911. He opens the bedroom door and I listen intently, scared we had an intruder. What felt like forever later, Brandon comes in white as a sheet, lays the bat in the corner of the room, and silently gets into bed. I ask, “what happened? What fell? What moved?” He quickly replied “nothing. There’s nothing moved.” I pestered him about it for a few minutes, but I could tell he was as freaked out as I was and dropped it. \n\nFast forward a month or two and I was working on grading papers watching Game of Thrones as he cooked dinner. Next to the TV, the hallway closet slides open from fully shut to halfway open. I checked the closet. Nothing. I also want to mention that the closet wasn’t new, it was hard to open when you TRIED to open it. \n\nBy this point, I’m terrified. I have heard noises, seen stuff out the corner of my eyes, and felt so sick in that house, especially when alone. The cat was constantly watching something, I heard whispering while in the shower, you name it. One day I visit some friends that lived two hours away. I head back home to find the house dark, Brandon was not home. I call him, and he was an hour away playing cards with some friends. It’s nearly midnight, and something told me to not go in that house. I felt sick thinking about going in alone and I was not having it. I’m sitting in the driveway in my car, waiting on Brandon when in park, on a flat surface, my glovebox pops open. Now mind you, I’m a terrible driver. I’ve hit sidewalks, potholes, massive rocks, and it has NEVER came open. This was five years ago, I still have the car, and it has yet to do this again. I tell Brandon this and he, frustrated at this point, proceeds to tell me that he had lived in his house for a year and a half before me and has never had any issues, and that he thinks something is attached to me. \n\nI have a ton of other instances in my new house, but this is getting quite long so I’ll leave it here. Is it possible I just happen upon these creepy places, or does something follow?",
        "created_utc": 1674498015,
        "upvote_ratio": 1.0
    },
    {
        "title": "WHAT DO YOU HEAR? (19:54) Back Road Main Suspect Jim Brenner Used- Dylan...",
        "author": "floorride",
        "url": "https://www.reddit.com/r/Paranormal/comments/10jidhn/what_do_you_hear_1954_back_road_main_suspect_jim/",
        "text": "[removed]",
        "created_utc": 1674495670,
        "upvote_ratio": 1.0
    },
    {
        "title": "Please Help My Husband!",
        "author": "Shel-Dorado",
        "url": "https://www.reddit.com/r/Paranormal/comments/10jhwcy/please_help_my_husband/",
        "text": "Hello! I’ll preface this by saying I’m new to the subreddit, so if this isn’t true best place for my question, just let me know!\n\nIt’s kind of a weird situation, so bear with me! We moved into our new house about two and a half years ago. It’s a beautiful house in a nice subdivision with really warm and positive energy. I never felt uncomfortable there. \n\nLast year, I got some bad news about my pregnancy, and I felt a hand squeeze my shoulder. It was so solid that I thought my husband was behind me, but I was alone in a closed room. More recently, when I was crying over my grandpa getting sick, I felt the bed shift as if someone sat on it. It was enough of a shift to wake my newborn up, who was sleeping in the comforter in front of me. Those are the only two experiences I’ve had, and they felt positive, so I didn’t worry about them.\n\nMy husband has the opposite problem. Ever since the baby was born three months ago, he’s been having experiences incredibly frequently. Whenever he’s alone (we’re asleep, or at my mom’s) he hears footsteps on the floor above or below him. Doors also keep opening and closing. When he was alone in the house last week, he closed the door to the bedroom to keep the cat out. He woke up to it wide open. Two nights ago, he slept in the bedroom across the hall from our toddler, and left the door open in case that toddler wanted to get in bed with him. He woke up to it closed. \n\nI’ve tried to explain to him that our kid could have closed the door in his sleep, or the dog could have somehow opened it when we were gone, but he’s incredibly spooked. He’d now rather sleep on the couch than in a room with a door, and even then, he’s not sleeping well. So I tried changing tack, and reminded him that whatever is here is probably harmless, or even a positive force. He didn’t like that at all.\n\nMy husband grew up in a house with footsteps, moving chairs, and even a full body apparition in his kitchen (I was on the phone with him when he saw it - totally wild). It didn’t seem to bother him much, but he is SO stressed about this. Not sure if it’s getting older, or having kids, or what, but it’s really affecting him. And honestly, his fear is starting to rub off on me. I was never scared in my house before, but now I catch myself flinching at every noise, and watching my kids like a hawk. I was just curious if you had any idea what I could say or do to help him? Thanks in advance!",
        "created_utc": 1674494562,
        "upvote_ratio": 1.0
    },
    {
        "title": "I heard a voice",
        "author": "hotmomfinder",
        "url": "https://www.reddit.com/r/Paranormal/comments/10jhmhf/i_heard_a_voice/",
        "text": "To preface this, the women in my family have a history of hearing voices, seeing things, and just overall seem to have a stronger connection to the paranormal than the average person. \nPersonally, I'd never experienced any of this until a couple of days ago. It was a Saturday, and my family had been busy attending some distant relative's funeral. Because of this, I had the house to myself for a few hours. I was sitting on my couch and watching some TV, when I heard a voice, right next to my ear.\nIt didn't sound like a person- it was deep and sounded distorted and rough. It didn't say much, just something along the lines of, \"Everything is going to be okay, don't worry.\"\nStartled, I rewound the TV, thinking that maybe it had been part of the movie I was watching. This wasn't the case, though. I checked my phone next, but the volume was completely off, and it was locked.\nPersonally, I'm a bit of a skeptic towards the paranormal, so I think there's probably another explanation, but I just thought the whole thing was cool.",
        "created_utc": 1674493908,
        "upvote_ratio": 1.0
    },
    {
        "title": "Simultaneously nightmares",
        "author": "Roadkill_Vegan",
        "url": "https://www.reddit.com/r/Paranormal/comments/10jgzbg/simultaneously_nightmares/",
        "text": "There’s been several instances of what could be considered bad energy in the house my family moved to when I was in middle school. Now my husband and I live there, and sleep in the same room I used to sleep in. Last night, my husband, my dog and I all had a bad dream at the same time. Kinda creepy.",
        "created_utc": 1674492377,
        "upvote_ratio": 1.0
    },
    {
        "title": "How long do ghosts \"live\"",
        "author": "larrazon",
        "url": "https://www.reddit.com/r/Paranormal/comments/10jg9kh/how_long_do_ghosts_live/",
        "text": "I know this may soubd dumb. But here me out.\n\nWe all know about ghosts.\n\nI used to live in a house that was haunted with a little girl that lived around 1900s. But why we never hear about a ghost from 1500, 1000 o or something like that.\n\nDo they die die?",
        "created_utc": 1674490586,
        "upvote_ratio": 1.0
    },
    {
        "title": "Two spirits in my house, idk what to do",
        "author": "keeriooo",
        "url": "https://www.reddit.com/r/Paranormal/comments/10jfjma/two_spirits_in_my_house_idk_what_to_do/",
        "text": "[removed]",
        "created_utc": 1674488807,
        "upvote_ratio": 1.0
    },
    {
        "title": "3AM Pipe Smoke &amp; Other Misadventures",
        "author": "Chasso474",
        "url": "https://www.reddit.com/r/Paranormal/comments/10jf7hr/3am_pipe_smoke_other_misadventures/",
        "text": "Afternoon all. I've been wanting to share some odd happenings that I have experienced for a while, and this sub seemed like the perfect place to do it.\n\nAround a year ago or so, I was in the toilet going about my business at around 3 to 3:30 in the morning when a weird smell filled the room. It smelt like old wood, smoke, and had a kind of sweet tinge to it, if that makes sense.  It lasted about 20 seconds or so and then went away. The next morning, I told my mum about my experience. She had been telling me stories of how she had smelled phantom pipe smoke from time to time for years, and I wondered if what I smelt was pipe smoke too. After describing the odour that I had caught a whiff of to her, she confirmed my suspicions. \n\nNow for the interesting bit. My mum thinks that the pipe smoke might belong my great grandpa, as he always used to smoke from a pipe. Sadly, I never got to meet him as he passed away decades before I was born. There could be an rational explanation to this. Perhaps the previous owner of my house smoked a pipe as well, and left some residue from the smoke in the walls or something. When I had my experience however, I had been living in this house for around 9 years, and had never smelt anything like it before. \n\nA few months after this first encounter, it actually happened again. I was in the bathroom at an ungodly hour and caught a whiff of smoke again, although this time it was only for a split second. I haven't smelt it since however, but my mum continues to smell it quite often. Her last experience was only a couple of weeks ago.\n\nNow, I'm aware that this might not be the most exciting story on this sub, but this event has really stuck with me and is the only proper paranormal experience I've had. Thanks for reading this ramble, have a good one.",
        "created_utc": 1674487946,
        "upvote_ratio": 1.0
    },
    {
        "title": "Experience I've had at 7 and then again at 20",
        "author": "Sreggy00",
        "url": "https://www.reddit.com/r/Paranormal/comments/10jf0oa/experience_ive_had_at_7_and_then_again_at_20/",
        "text": "I'm now 36, I am married I live in another state. we've been together for 10 years and have had a dog for 9 of those 10 years. When this last experience happened to me I was around 19-20 years old and living in my parents house. It was our 2nd house we lived in as a family and was only a few years after we moved in did I experience this. I am not religious or someone who believes in afterlife but also I acknowledge phenomenon that we can't explain and energy that surrounds us. \n\nThe first time I remember experiencing anything strange or paranormal I was about 7 years old. At the time I had really bad asthma so we thought it actually turned out to be mold and or abestos  in the school I was at. I was on a bunch of medications as I stopped breathing a few times from my condition. Since leaving that school I was never diagnosed with asthma or on any medication whatsoever. \n\nOur first house was my parents first house they purchased and I was born in. They bought it from a couple who was going through a divorce. It was one level and my bedroom was diagonally across from my parents room. All of a sudden one night after my mom would put me to bed she would leave my door slightly open so I was able to see in the hall and my parents bedroom, I would be laying in bed looking into their room and within moments the pitch black room would start changing to all different colors rapidly and then would settle and from it the figure or outline of a man in all black I couldn't see facial features or clothes I just knew it was a man and all black would form from these colors and slowly start walking towards the threshold of my room.\n\n The first time this happened I freaked out and was screaming for my parents, they would come and nothing would be there. This went on for about a year. The most I ever watched was one time I didn't look away as the figure actually stepped into my room, but then got so scared I would go under the covers and face my wall, I slept like that for a year until my mom took me to some woman I don't know if she was a medium or psychologist and she had me draw the figure on a piece of paper in jail and put in a shoebox in my room and keep it there. Shortly after being out of that school and doing that all of these things stopped happening to me and I ended up being in that room and house another 7 years until we moved. \n\nNever had another experience after that I never even really thought about that year again my whole life growing up until I was about 19 again. We had just recently moved to another home once again bought from a couple who had divorced. This house always had a cold weird feeling to it. \n\nSo one night I was out with friends just getting food, we weren't drinking or anything of that nature just a low key night. I remember I came home around 10pm and went upstsirs to my bedroom. \nMy room was on the 2nd floor and in the middle of the floor my siblings rooms were on either side of mine and the Master bathroom and bedroom at the end of the hall. \nI remember I came home played some video games for a bit and then shut the lights off and laid down to go to sleep. It was a tiny room and my bed was parallel to the door. \nI remember I fell asleep fast and hard, I don't remember the time or why even but eventually I wake up facing the door slowly my eyes are adjusting to the darkness and I see a figure standing in front of my closed door I rub my eyes some more and see a tall black figure in what I can only describe as generic striped prison clothes is standing there I instantly shot up in bed and go to scream and all in that split second the figure rushed towards me puts it hand around my throat and chokes me. I can't scream or make a sound and then instantly I wake up. And I'm laying in bed facing the door and the room is completely empty. \nAt this point I'm kinda shook up I go down the hall to the bathroom to splash water on my face and I notice a handprint around my throat that doesn't match to mine. I don't know what to believe or think at this point, it was strange because I was shaken up but not enough that it kept me up or all night. I didn't know what just happened or how to explain it but I told myself it was just a bad dream and went back to my room and went to sleep. I never told anyone thisbevenr in particular before and nothing like that has ever happened to me since then. I've moved a bunch of times in my life, I collect antiques and vintage items, I love horror films and anything paranormal or ghost hunting related and still I don't practice any spiritual or religious beliefs. \n\nI've been lurking on this sub for years and others about ghosts and paranormal, reading other people's stories, and learning more and more about the paranormal it's something that has always interested me. I don't consider myself someone who spooks easily. I've felt that at this point in my life I would like to share these experiences on here and hear what people have to say or their opinions on what all of that could of been. To this day I personally have never come to a conclusion on what that all was I always chalked up what happened to me when I was 7 was a combination of the medicines I was taking and the mold/abestos I was inhaling while in that school, and then the event later in life I ruled out as sleep paralysis.\n\nAny feedback, opinions and insight is much appreciated and I apologize for the lengthy read.",
        "created_utc": 1674487467,
        "upvote_ratio": 1.0
    },
    {
        "title": "Been having weird experiences at work recently…",
        "author": "caseyc1223",
        "url": "https://www.reddit.com/r/Paranormal/comments/10jd1oe/been_having_weird_experiences_at_work_recently/",
        "text": "TLDR; Odd things have been happening at my work that lead me to believe it may be something paranormal… I’m looking for any input as to what you guys may think about the situation.\n\nI’m gonna preface this post by saying I am a believer in the paranormal and have had paranormal experiences just a few times before in my life. Some weird things have been happening at work recently and I’m not sure what to think of it, if it’s paranormal or not. I guess this is where my post comes in.\n\nI am a female in my 20s and a full time overnight worker at a hotel in my hometown. I’ve been working this position for about 4 months now and have experienced some odd, sometimes unexplainable things happening in the wee hours of the morning. I’m the only employee in the hotel working during my shift and have grown used to keeping my eyes and ears peeled as I’m basically security for the place (along with front desk) and want to make sure my guests are safe.\n\nNow, I truly can’t tell if I’m convincing myself these experiences are paranormal or if they really are paranormal. I’ll list the experiences here:\n\n- The drawer at the back desk where I sit and watch the security cameras will open on its own every 5 minutes or so. I assumed it was because the drawer was loose and needed to be tightened. When I asked maintenance if they noticed it happening during the day and could fix it, him and my manager said they’ve never seen it do that. Not convinced this is paranormal but it definitely is odd.\n\n- Our TVs in the lobby are kept at no louder than 25/30 volume during the day and are muted at night. One night the TV unmuted itself and was set at 60 volume, startling me as it was loud and abrupt. Happened once and never again. I don’t think my coworkers would raise the volume to 60 before muting it as there’s no reason to. Convinced myself it was just a technological error, but it still left me uneasy.\n\n- I once looked down the hall into the kitchen and for a split second thought I saw a man standing there in the kitchen doorway. Did a double take and when I looked back he was gone. Convinced myself I mistook the shelf and boxes for legs and a torso but again, it left me uneasy. \n\n- I was preparing breakfast in the kitchen one morning and heard a loud crash in the lobby, as if the large tin chafing dish in the breakfast area had toppled over onto the ground. I rushed out of the kitchen to investigate what had happened, only to see that everything was in its place, nothing had fallen and I saw no one in sight. Couldn’t really come up with a convincing reason for why this happened, still puzzles me.\n\n- This morning at 1am, I returned to the back desk after using the restroom and heard a noise in the back hallway coming from the housekeeping/laundry room. I slowly approached and turned on the light to see that one of the large dryers had started itself (2 hours after I started my shift) with the dryer door open. Has never happened since I started working here, and after confirming with my manager it has never happened before. Again, could be explained by a technological error, but it was just SO ODD.\n\nOther things have happened that I can’t remember off the top of my head. I can’t tell if my belief in the paranormal combined with me being completely alone (and sometimes scared) at work has created the idea of these instances being paranormal. What do you guys think?",
        "created_utc": 1674482173,
        "upvote_ratio": 1.0
    },
    {
        "title": "Woman that I saw in my grandparents hallway.",
        "author": "Hayley_1472",
        "url": "https://www.reddit.com/r/Paranormal/comments/10jaskv/woman_that_i_saw_in_my_grandparents_hallway/",
        "text": "Hi my name is Hayley I’m 29 years old and this story takes place at my grandparents house when I was about 11 years old. My grandparents lived in a old Victorian home in Massachusetts that was built in the 1700s. I stayed with them on the weekends growing up and there was lots of activity in the house from voices to noises to shadows and occasionally apparitions. This particular night it was about 3am when I woke up thirsty and got up to get something to drink. I stepped out into the hallway and there she was. A woman about 5 feet 3 inches wearing a white dress she was pale with long black hair and blue eyes. She must have realized I saw her because she smiled and waved at me then disappeared. I still don’t know who she was but I thought I’d post this here and see what you guys think.",
        "created_utc": 1674475142,
        "upvote_ratio": 1.0
    },
    {
        "title": "the ghost that tried to strangle my friend",
        "author": "paranormah",
        "url": "https://www.reddit.com/r/Paranormal/comments/10j9kxe/the_ghost_that_tried_to_strangle_my_friend/",
        "text": "Back in 2018, I had just turned 20 and wanted to splurge for my birthday. So I invited a few friends to paintball, including my old friend Reign, her boyfriend Jackie, my boyfriend, who I'll call Fred, and my best friend, Evie. We all met at a nearby mall and crammed into Reign's car; she had offered to drive us all. \n\nI don't know if this was connected, but my boyfriend said something weird. We were on the highway when he turned to Reign and said, \"Hey, can you slow down? I have a bad feeling that something bad is going to happen.\" Which was strange to ask, but Reign obliged and slowed down to the speed limit (she was going ten over, which is permitted where I live). We made it to the paintballing place without any issues and proceeded to have a great time -- Fred even shot me in the spine, which hurt up until the next day.\n\nEventually, it was nearing the end of the day, and we were all tired. So we all agreed it was time to go, but Reign suggested we all book a motel room and spent the night together. But Fred and Jackie said no; they were both tired and wanted to go home, which left us girls to hang out instead. So we found a pretty run-down motel for cheap and spent a few hours watching horror movies. Halfway through the second movie, we started to feel like there was a presence in the room with us, but we chalked it up to the horror movies.\n\nNow, a fun fact about Evie, she has an attachment. A shadow figure has been haunting her family for *years* \\-- it started with her mom and weirdly got passed down to her. That night, when feeling the presence, both Evie nor I didn't think it was her ghost friend; like I previously said, we just thought it was our nerves from the horror movies. After we had finished the final film, we all decided it was best to go to bed. The presence we were feeling was getting a little too much for us -- the air felt heavy, and whatever was in the room with us felt angry. We assumed sleeping would help eliminate the feeling of being watched and the overall nasty gut feeling we got. \n\nEvie and I shared a bed while Reign took up the other. I usually have a hard time falling asleep in a new environment, but at that moment, I was having a more challenging time than usual. The odd time I did manage to dose off, I'd have these strange dreams of swirling shadows -- no actual shape to them, just whirlpools of darkness. On the other hand, Reign seemed like she had a fantastic dream; she was moaning and making *a lot* of noise overall. Well, that mindset changed when she shot up and *gasped* for air. I sprung up myself and asked her what was wrong. That's when she started telling me about her dream.\n\nIn her dream, she was being pursued by a shadow figure. She recalled how terrified she felt, hence the moaning, and no matter how fast she ran, the thing would catch up to her. Eventually, it knocked her to the ground, like it was fed up with the chase, and wrapped its fingers around her throat. She couldn't breathe and started thrashing around, trying to break free from its grasp. But nothing worked; Reign could feel herself dying. She thought that was the end, but luckily, she woke up before she died. As she was telling me this, I turned on the light and. Evie had woken up and was listening to her retell her nightmare.\n\nDuring her recollection, I noticed red marks forming on her neck, same as her wrists, arms, and legs; just about any visible patch of skin had some form of mark on it. I pointed it out to her once she finished her story and asked if she usually woke up with bruises and marks on her. Reign looked somewhat startled and said no. The three of us decided it was probably time for us to leave, and we hastily packed our bags and piled into Reign's car. We started to feel better once we were far from the motel. Evie and I began to tell her about the shadow figure that haunted Evie, and I told her it had once threatened my life in a dream but never physically attacked us. Reign nervously laughed it off, and I took it as a cue to drop the subject.\n\nReign and I don't talk anymore -- I moved across the country, and we fell out of touch, but I'll never forget the look of fear as she recalled her dream to us. The shadow figure still haunts Reign, but it has never tried to strangle someone in a dream, at least not that we know of.",
        "created_utc": 1674470520,
        "upvote_ratio": 1.0
    },
    {
        "title": "Another video made today.",
        "author": "sanctified420",
        "url": "https://www.reddit.com/r/Paranormal/comments/10j9dws/another_video_made_today/",
        "text": "[removed]",
        "created_utc": 1674469694,
        "upvote_ratio": 1.0
    },
    {
        "title": "Just saw a shadow outside my window.",
        "author": "Kakep0p",
        "url": "https://www.reddit.com/r/Paranormal/comments/10j8hox/just_saw_a_shadow_outside_my_window/",
        "text": "I’m laying in bed. It’s past 4am. I’m just on my phone. In the corner of my eye, outside my window, I see a shadow, almost completely oval, rush by. Smoothly. A few seconds later I see it rush back. I didn’t see it again but I’m scared. I didn’t get a feeling of dread but I’m terrified. It’s rainy outside and I’ve never seen anything like this. Also call it stupid but I have high anxiety and hypochondria, so I feel it’s trying to tell me something?? I’m afraid to look out the window, but now I’m also scared to sleep. I live in an apartment complex but I don’t think it was a person as no person can move that smooth or fast..",
        "created_utc": 1674466082,
        "upvote_ratio": 1.0
    },
    {
        "title": "almost died on my 21st birthday",
        "author": "poopy-stickypants916",
        "url": "https://www.reddit.com/r/Paranormal/comments/10j866w/almost_died_on_my_21st_birthday/",
        "text": "On my 21st birthday i was one of the last of my group of friends to turn 21. We started out at hard rock cafe and had shots,mixed drinks, amd beers. We then went to another bar, and another. Most of the night i dont even think i bought 1 drink just friends passing me shots,mixed drinks,beers.\n\nThis was the most drunk i've ever gotten. I dont remember how I got home but I remember dreaming. Then i remember feeling like I couldnt breathe and I couldnt move. I was sleeping on my back. In my dream I could hear a voice telling me to wake up.\n\nThe voice sounded far away and got louder and closer. When the voice got closer I noticed it was my moms voice who started calling out my name telling me to wake up.\n\nFinally I woke up and still I couldnt breathe. I tried to breathe but I still couldnt. I sat up leaned forward and threw up all over myself. My whole throat was filled and I couldnt even cough it out it just poured straight out.\n\nIf it wasnt for my mom entering my dream i think I would have died. My mom was living in a different city and not with me when this happened",
        "created_utc": 1674464760,
        "upvote_ratio": 1.0
    },
    {
        "title": "More vivid dreams involving paranormal entities",
        "author": "kab1218",
        "url": "https://www.reddit.com/r/Paranormal/comments/10j7bn8/more_vivid_dreams_involving_paranormal_entities/",
        "text": "For the past 5-10 years I’ve had dreams involving “ghosts” or some sort of paranormal entity. Typically the dreams revolve around mocking a ghost or entity and then it harasses me either “haunting” or taunting me in the dream, or possessing something and bothering me. The past few days the dreams have increased in number and how vivid they are. \n\nUnsure if this involves this sub, but anyone have any ideas why?",
        "created_utc": 1674461124,
        "upvote_ratio": 1.0
    },
    {
        "title": "Watch this video. This happened today. I need serious help.",
        "author": "sanctified420",
        "url": "https://www.reddit.com/r/Paranormal/comments/10j74e9/watch_this_video_this_happened_today_i_need/",
        "text": "[removed]",
        "created_utc": 1674460321,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do I know if an entity wants to hurt me?",
        "author": "FlatBet5565",
        "url": "https://www.reddit.com/r/Paranormal/comments/10j6sng/how_do_i_know_if_an_entity_wants_to_hurt_me/",
        "text": "It happens to me that there is usually something or someone who is dedicated to giving me slight scares every day, from throwing or moving things, to shouting or talking to me with the voice of my friends or family.\nSometimes I dream that it is a tall, dark entity and sometimes that it is a well-dressed person who usually does not come closer to me once I am in my room, But many times in those dreams he hurts me slightly, he grabs my arm or takes my head or neck but when trying to get me out of my room awake with some mark of the damage that I have done in the dream, I do not know what he wants with me but sometimes I am afraid to think because it never happens to my room",
        "created_utc": 1674458984,
        "upvote_ratio": 1.0
    },
    {
        "title": "People with paranormal powers",
        "author": "FlatBet5565",
        "url": "https://www.reddit.com/r/Paranormal/comments/10j6q6h/people_with_paranormal_powers/",
        "text": "I have had the doubt of when someone like a sorcerer capable of shapeshifting or possessing bodies, what do they feel? Does it cause them pain or is it just the blink of an eye?",
        "created_utc": 1674458688,
        "upvote_ratio": 1.0
    },
    {
        "title": "Doppelganger sighting",
        "author": "Independent_Ad_5976",
        "url": "https://www.reddit.com/r/Paranormal/comments/10j6ml4/doppelganger_sighting/",
        "text": "This isn’t my experience but my sister’s. This is something that my sister told me and my mom one day at the same time. This caught me off guard since my sister’s face was in shock and surprise at seeing me in different room with our mom. She said she could see me in our mother’s room she went into the room saw me look at her not saying anything then crawl under our mom’s bed. She then left the room and saw me sitting on the couch watching tv. That’s when she told us. I knew what it could possibly be but didn’t say anything. I knew she wasn’t lying since the tone of her voice and expressions on her face weren’t she could fake.",
        "created_utc": 1674458280,
        "upvote_ratio": 1.0
    },
    {
        "title": "I need help asap.",
        "author": "sanctified420",
        "url": "https://www.reddit.com/r/Paranormal/comments/10j6223/i_need_help_asap/",
        "text": "So yesterday I apparently had a dream  where I seen weird stuff happening at my house so I videotaped it and took pictures. Yeah it's the creepiest shit there's a lot. \n\nToday we watched a few people \"crossover\" they like vaporized into iddy bits and flew silently up. \n\nI have ALL of this recorded. \n\nAlso now in every flat surface of my house that's reflective you can 100% see walking dead people. \n\nI am not fucking kidding and I need help. I have videos of entire apparitions. All kinds of ghost pics. There's ghosts in every room. It's like Insideous up in here. I am not joking. \n\nPlease help 780-860-5269\nName is Joshua Singh. I'm a registered social worker. Doing prayer in the meantime. Im pretty sure I have the best ghost footage out there.",
        "created_utc": 1674456071,
        "upvote_ratio": 1.0
    },
    {
        "title": "A light on my wall",
        "author": "remington-98",
        "url": "https://www.reddit.com/r/Paranormal/comments/10j5dk3/a_light_on_my_wall/",
        "text": "[removed]",
        "created_utc": 1674453610,
        "upvote_ratio": 1.0
    },
    {
        "title": "Blue Campsite Ghost",
        "author": "AkiliAmethystArt",
        "url": "https://www.reddit.com/r/Paranormal/comments/10j4yvb/blue_campsite_ghost/",
        "text": "Not one of the most scary stories, but I want to share this experience.\n\nIn the late '90's I went to an overnight girls' summer camp for a couple weeks every year. It's a beautiful chunk of forest in Maine. This campground is structured like this; there are two roads that go up either side of a hill. Along the roads are paths that lead to clusters of cabins which each house up to 4 girls. Each cabin cluster had a set of 3 porta-potties, since the flush toilets were too far to walk to at night. There is a stone house foundation next to the cluster of cabins that is furthest in the woods (from now on referred to as DW). I've heard a few spooky stories from DW, but never experienced any specifically there myself. My story is from when I stayed in the cluster of cabins next to the furthest one (from now on referred to as BP). BP is situated where all the cabins are a ways into the woods, and porta-potties are between the cabins and the road that continues to DW. In fact, the potties are just at the edge of the road that continues to DW. \n\nOne evening, my group of campers had come home from a bus field trip. It was later than we usually went to bed, and it was very dark. The most important rule at camp is the buddy rule. You never go ANYWERE without at least one other camper. Councilors were the only ones allowed to travel without buddies. After getting ready for bed, my cabin went together to the porta potties. We were still energized from the trip and were very giggly. I glanced up to make sure we weren't straying, and saw a person on the road walking toward DW, seemingly illuminated by a blue lantern flashlight. From my vantage point, the person was no longer visible once they walked \"behind\" the potties. I looked back to my friends and said something like \"We're probably freaking out whoever is on the road if they can hear us!\" And immediately my friends asked \"What person?\" I answered \"There's a councilor going over to DW! They're behind the porta-potties!\" They didn't see anyone, and as we approached the potties, neither did I. The road was pitch dark in both directions, and so was the surrounding woods. There wasn't even a dark silhouette like if their lantern had died and they continued walking anyway. There was nowhere they could have gone. They just vanished.\n\nI don't remember what the person looked to be wearing. All I remember is the blue light, and short, straight, almost shoulder-length light hair. Looking straight ahead as they walked toward DW (and the house foundation)\n\nThe campground used to be the site of some farmland probably a hundred years ago. I know this because the campground is crisscrossed by low crumbling stone walls. And the farmhouse foundation in DW. (I fell in it once, but that is another silly story.) I later learned the legend surrounding the foundation: It was home to a small farming family. Either one child, or a boy and girl, depending on who tells the story. One day, when the father was away for market, the house burned with the other family members inside. He came home far too late. And some say that the skeletons found inside were holding each other; a mother trying to protect her child/ren for the last time.  \nMy theory is that if I did indeed see a ghost, it may have been the ghost of one of the family members. And an echo type ghost, repeating actions took in the past.\n\nI could relay the other paranormal legends I remember from that campground if anyone is interested.",
        "created_utc": 1674452153,
        "upvote_ratio": 1.0
    },
    {
        "title": "Object fell after talking with my sister about Mediums and whether spirits exist or not.",
        "author": "StrikingPercentage67",
        "url": "https://www.reddit.com/r/Paranormal/comments/10j4ips/object_fell_after_talking_with_my_sister_about/",
        "text": "I'll make it short and simple, just wanted to post this cause it kinda freaked me out. My sister is making something in the kitchen, I walk in and she asks me, \"do you think that mediums are real?\" to which I replied \"I don't know, maybe some are real and others are scams\", eventually we were discussing whether spirits are real or not and I was having doubts in my head but still saying they may or may not be, when a huge heavy copper water jug falls off the top of my fridge with no notice and makes a huge clang, nothing has fell in this house for ages and the copper vessel was not on the edge but on the fridge far enough that it would take someone to push it to make it fall over like that. It happened in the middle of our discussion. Weird. Definitely was weird to me when it happened, we both just talked about it laughing and in shock for a few minutes. lol",
        "created_utc": 1674450577,
        "upvote_ratio": 1.0
    },
    {
        "title": "Redditors who have/used a Ouija board, what is it like?",
        "author": "thehappycouchpotato",
        "url": "https://www.reddit.com/r/Paranormal/comments/10j2pox/redditors_who_haveused_a_ouija_board_what_is_it/",
        "text": "[removed]",
        "created_utc": 1674444837,
        "upvote_ratio": 1.0
    },
    {
        "title": "saw this weird light and when I took a photo this thing showed up. Anybody know what this is?",
        "author": "PeanutPatel",
        "url": "https://www.reddit.com/r/Paranormal/comments/10j2n2o/saw_this_weird_light_and_when_i_took_a_photo_this/",
        "text": "[removed]",
        "created_utc": 1674444621,
        "upvote_ratio": 1.0
    },
    {
        "title": "What does this mean?",
        "author": "Boring-Speaker-4625",
        "url": "https://www.reddit.com/r/Paranormal/comments/10j2evt/what_does_this_mean/",
        "text": "[removed]",
        "created_utc": 1674443907,
        "upvote_ratio": 1.0
    },
    {
        "title": "Am I being touched?",
        "author": "bunnybaby7",
        "url": "https://www.reddit.com/r/Paranormal/comments/10j22l8/am_i_being_touched/",
        "text": "Wondering if this is paranormal or medical but I feel a hand on my back but only in my house. I can sometimes feel the pressure change, which is when it starts or stops but it's been happening for the past couple days and it's an odd feeling. The last person to live on my room left due to a bad force in the room but I've been in here for a long time. Also my pentagram necklace flips around when I'm in my house",
        "created_utc": 1674442854,
        "upvote_ratio": 1.0
    },
    {
        "title": "Please give me advice on how to get rid of a spirit in my house.",
        "author": "ptw0003",
        "url": "https://www.reddit.com/r/Paranormal/comments/10j1wwd/please_give_me_advice_on_how_to_get_rid_of_a/",
        "text": "About two years ago I posted a story on another subreddit telling my story of how my girlfriend and I were attacked by a ghost. She was grabbed, I was scratched, and my dog was acting extremely odd (she’s normally energetic and cuddly but instead she was timid, scared, and would not move from a spot in my room no matter what I did and whenever I moved her there was an extremely violent hiss when I picked her up). I resorted to leaving gospel music on my radio 24/7 and praying for protection and eventually everything calmed down for a while. Recently the activity has started again and it’s worse, the air in my room is heavy and I’m anxious every time I’m in my house. I’ve seen black masses and shadows circling the room, my dog is acting strange again, my girlfriend has been scratched, and I’ve seen a full body apparition of a woman with what I can only describe as an inhuman smile with deep black eyes I will never forget. I’ve reached out to my pastor, who I haven’t heard from in weeks and I’m scared to go home and stay there. I don’t want to let whatever this is push me out of my home, but I don’t want to be there either. Is there anyone who can give me some type of advice? I have to go back to my house tomorrow and I don’t want to go back unprepared. I want to do something about it, I just don’t know what I could do.",
        "created_utc": 1674442374,
        "upvote_ratio": 1.0
    },
    {
        "title": "Military academy haunting?",
        "author": "Emptybrainnothonk",
        "url": "https://www.reddit.com/r/Paranormal/comments/10j1f53/military_academy_haunting/",
        "text": "Just joined this subreddit for answers. So recently I started going to a military academy. The name of the school is riverside military, and it’s located in Georgia. I’m on a small team of students tasked with patrolling the barracks called cadet patrol, and I saw something weird today. Every Sunday we have chapel, and the whole corps, including tax officers and company commanders goes to chapel for service. We were tasked with finding people who tried to skip. Around 7:10 - 7:15 at in the evening, we had three guys checking out a room in old alpha (old alpha has not been in use by anyone since like 2 years ago or so?) and I stood outside. I looked to my right and I saw someone in full class B uniform walking into the company commanders room, he was tall, I couldn’t see his skin color or face, and he was wearing the jacket too. I raced down to the co’s door, and checked everything and everywhere there, and nobody in the room. Does anyone have any information about this or anyone that was a riverside cadet in the past? The company is old alpha next to band company. Our chief tac is checking cameras so I don’t have all the information yet.",
        "created_utc": 1674440862,
        "upvote_ratio": 1.0
    },
    {
        "title": "Summer of 2020, eastern WV",
        "author": "Sufficient_Phone_216",
        "url": "https://www.reddit.com/r/Paranormal/comments/10j191m/summer_of_2020_eastern_wv/",
        "text": "I believe I posted this story here close to when it took place, but coming back now I can't seem to find it. Recently I've been thinking back on it often so I decided to reach out again in case anyone had a similar experience, or any input on possible explanations. I'll try to keep the story brief while still including relevant details. I still vividly remember these events.\n\nKeep in mind also, I was raised Christian. I came to a conclusion religion wasn't for me, and decided anything supernatural must not exist as a consequence. This was the thing that changed my mind.\n\nMy friend and I were driving back to his house in Eastern WV. We both grew up in the area and had spent years driving up and down these roads. It was around 11:30 at night, we had just finished a gym session and fast food run. The night was warm and dark; we had the windows down, music up, driving fast on back roads. Not many other drivers were out, and we didn't see any cars throughout this event.\n\nComing around a corner, our headlights swept over an old woman out getting her mail (odd, being near midnight). Naturally, she turned to look at us as we passed. As soon as her eyes fell on us I froze in my seat. I was overcome with a sense of dread. I'd never been much afraid of anything, but in this moment I froze in fear.\n\nI had a clear impression that something out in the woods had seen us and we drew its attention. Whatever it was felt big, powerful, and old. Not like a ghost, the best word I can think of is \"demon\". There was a strong feeling that this thing desired us in some way; that it wanted to \"take\" us, or \"have\" us, and that this would be a very bad thing.\n\nIn the same moment, without either of us saying a word- my friend slowed the car way down, turned off the music, rolled the windows up, and straddled the double yellow line. We continued in silence for probably 3-4 minutes, going a mile or two until we turned off the road. This whole time all my hair was on end, my body shook, I felt some being stare (it felt) into my soul and try to reach for it.\n\nWe turned off the road, the feeling of danger gradually faded, and minutes later we parked in his driveway. We sat in silence for a minute, then I asked if he \"felt that\". He said \"yes, I was so scared\". We talked about what we felt, we both had the same impressions. I then got into my car, sped the whole way home, repeated the entire experience alone, and made it back safe.\n\nTwo weeks later, I was headed to his house, this time around 3pm. Bright summer day. Passing through the same area, it happened again. Identical feeling.\n\nI drove that road every time I went to see him- before that incident, in between the two incidents, and many times since then. I've never had any other experiences. I can't write it off as some hormonal fluke, as we both felt the same fear without speaking about it.\n\nHas anyone experienced something similar? Does anyone have any idea what it could be? My best word for what I felt is \"demon,\" but I have no clue if that's accurate. All comments are welcome. Also, apologies the story is a bit long. Too late now.",
        "created_utc": 1674440335,
        "upvote_ratio": 1.0
    },
    {
        "title": "Do you believe ghosts are human?",
        "author": "GladCantaloupe1497",
        "url": "https://www.reddit.com/r/Paranormal/comments/10j0wa6/do_you_believe_ghosts_are_human/",
        "text": "I’ve seen some debate on the topic in various places over the years, so I wanna ask you guys, do you believe that ghosts/spirits themselves are humans who have died or of some other species entirely?",
        "created_utc": 1674439292,
        "upvote_ratio": 1.0
    },
    {
        "title": "Spirits attempted to warn me about a suicide that would take place.",
        "author": "dontlookback_04",
        "url": "https://www.reddit.com/r/Paranormal/comments/10j0rr6/spirits_attempted_to_warn_me_about_a_suicide_that/",
        "text": "**TW SUICIDE**\n\n*this post will be all over the place but please bare with me*\n\nI moved into an apartment 7 months ago after living with my foster parents for 17 years. (For context it was 2 days before my graduation) (for more context: I’m still with CFS and I live in a supervised building for girls and I’m enrolled in a program to live on my own without staff and a roommate, but I still have supports like grocery money given to me and my rent is paid.)\n\nsome background: \nRules of living with my parents\n\n-not allowed to be on my phone unless I ask.  \n\n-not allowed to keep phone at night. \n\n-internet goes off at 8 (expect on weekends where it would go off at 9). \n\n-only certain days I am allowed to be on my phone and certain times. \nExample: \nSunday’s, Monday’s and Wednesday’s are 6-7:30 PM. \n\nFriday’s and Saturday’s are 6-8:30 PM (sometimes 9 if my dad was being nice) \n\n-even if it was my phone that I bought with MY money, I’m still not allowed to keep it with me during the day and night, it goes in my parents room until it’s a day where I can be on it. \n\n-not allowed to bring phone to school. \n\n\nSo, after I moved out i texted my boyfriend all the time to make up for the lost time. \n\nOne night a few days after my 18th birthday I was told I was getting a roommate, and I had already been living in the building without a roommate for a few weeks. The whole time I had the suite to myself I had an eerie feeling of being watched all the time. \n\n(My-then-roommate went by they/them pronouns so I’ll be referring to them as that) \n\nI was at my boyfriends house when I got the news, so i wasn’t there when they initially moved in. However they went to their grandmas house for evening and I was in my room sending my boyfriend audio messages on Snapchat. \nMe being me I was talking about weird shit lmao. He sent one back and he said “what the fuck was the noise at the beginning?”\n\nHe knows that I sometimes scare easily so I thought he was playing, but I played back the audio messages and at the beginning, a few seconds before I start talking you can hear a growl and then a deep sigh. Keep in mind I was talking as the sigh was happening and the growl kept going while I was talking. \n\nI flipped out and ran out of my room. \nI got him to screen record the message and I have it saved still. \nI texted my roommate to the point where they actually responded really fast (they would either leave me on read or to eat just wouldn’t open it). \n\nI told them what happened and sent them the recording. \n\nWhen they got back I was given sage by another girl in the building and we smudged my room. After we smudged we were sitting in the living room and in my peripheral vision I could see a light flickering. I turned my head and my fucking lights in my room were flickering. \nI got my phone out and started recording. I was asking it to “please” stop. It kept going. As soon as I said “I said stop it” it stopped flickering. \n\nOther shit would happen within the following months. \n\nWeeks later we both challenged it and out of nowhere my roommate gets violently sick. \n\n\nWhat we didn’t know what was going to happen later on that month was a staff member was going to commit suicide.\n\nThe girls who knew her were devastated, and there was a darkness throughout the whole building. \n\nMy auntie’s mom (adopted mom) came to the apartment and she smudged, and again the lights started flickering. She said that it was the spirits letting us know that this was going to happen. I honestly thought it was over. All the scary shit.\n\nHowever, there was some thing that changed my roommate.\n\nOne night I was in my room watching tv before bed and all of a sudden they start screaming and pounding on my door. I opened the door and they looked absolutely terrified. I asked them what happened and they said that they saw someone in the bathroom and they thought it was me because it was the same height as me. \nBut when they went back into their room, and then to go look into the bathroom again, it was gone. \nThey said they heard creaking in the bathroom. After they saw that figure they knew it wasn’t me because they said “why the fuck would she hide in the bathroom? She wouldn’t fucking do that because she’s chickenshit.”\n\n\nJust crazy shit like that happens.",
        "created_utc": 1674438932,
        "upvote_ratio": 1.0
    },
    {
        "title": "Three Taps on the Foot",
        "author": "CrazyCox88",
        "url": "https://www.reddit.com/r/Paranormal/comments/10izxel/three_taps_on_the_foot/",
        "text": "Last night at 1:30 AM CST I'm dreaming of getting ready for a concert. Someone taps the top of my right foot. I look down (still in the dream) nothing is there. I realize it's a dream and someone is waking me up. Another tap and then I'm awake in my bed.  A third tap,  I'm fully awake with my eyes open. There was no one in the room. \nI have small children but they were all sound asleep. To be courteous,  I said out loud \"I'm listening\" no response of course. \nStayed awake for 10 minutes to make certain the house wasn't on fire then fell asleep.  \nI do not particularly believe in ghosts but this was very real. \nSomeone posted this exact scenario in this forum 6 years ago and others have been tapped on the shoulder. \nDoes anyone have solid theories about the significance?",
        "created_utc": 1674436405,
        "upvote_ratio": 1.0
    },
    {
        "title": "Has there been any cases where Ghosts/Spirits have caused physical h arm?",
        "author": "StrangerThanWeThink",
        "url": "https://www.reddit.com/r/Paranormal/comments/10iznla/has_there_been_any_cases_where_ghostsspirits_have/",
        "text": "Has there been any cases where ghost/spirit entities have caused damages to the human b ody. \n\nSo far, I've heard stories about objects being misplaced by Something. Objects levitating without a cause.",
        "created_utc": 1674435622,
        "upvote_ratio": 1.0
    },
    {
        "title": "Heard voices while playing Hide n Seek with friends.",
        "author": "Timely_Week_9619",
        "url": "https://www.reddit.com/r/Paranormal/comments/10iyqgs/heard_voices_while_playing_hide_n_seek_with/",
        "text": "So, I just finished doing a play. Yesterday was closing night. Me and my theater friends got there early so we could hang out. One of us had a good idea to play Hide n Seek in the entire school for fun. So, before this happened, we had already played one round of it and nothing weird happened. For the second round the first player that got out whom I will call D was the person seeking. The other kids and I decided to run to the west area of the school where there are around four hallways that are fairly large. There are two bathrooms in the first hallway (boys and girls) so we split up and went into either bathroom. I went into the girls bathroom with which I will call C, E, and K. We stayed there for a little bit before deciding to run into the other hallway and run into another bathroom. Which we didn't stay for long because the lock on the stalls were weird. Then, we ran into another hallway but we got the creeps from it before we kept running. It felt weird and the lighting was something you would see out of a horror movie. We didn't know where to go until I suggested we look for a classroom that was maybe left unlocked. The second door we tried we got in. E went under a counter and K, C and I just stood up against it. After a about ten mins of us just standing there and trying our best to be quiet we heard running, crying, screaming, really creepy and weird humming that sounded like the voices of the other kids. But, then, we heard D's voice say 'Hello? Is anyone there? Hellooo?\" But with the screaming, running and talking it sounded like the other kids got caught. So, C wanted to go look out the door and check but we stopped them. Something didn't feel right so she stayed. After around 5-8 minutes all the noises left. And the weird thing is K said that they felt a chill run down their spine and be and E were shaking. So after a few other minutes we all decided to get out of hiding and go back to the theater room. In this groupchat all the kids were talking while hiding when we heard the noises. Also, while D was looking in the gym they heard whispering and banging, nobody was with them or hid in the gym. The school also used to be another school in the 1950s - 1970s so I don't know who or what it was. I just came on here to see if anyone knew what it could be or anything else I should know. My guess is just some old ghosts messing with us but I'm not sure. Thank you for reading!",
        "created_utc": 1674433000,
        "upvote_ratio": 1.0
    },
    {
        "title": "Very strong, intense energy radiating of a particular woman on the bus??",
        "author": "hsjansbsjs",
        "url": "https://www.reddit.com/r/Paranormal/comments/10iy3tz/very_strong_intense_energy_radiating_of_a/",
        "text": "[removed]",
        "created_utc": 1674431293,
        "upvote_ratio": 1.0
    },
    {
        "title": "Strange thing happened this morning",
        "author": "amapickle",
        "url": "https://www.reddit.com/r/Paranormal/comments/10iwl4d/strange_thing_happened_this_morning/",
        "text": "Hello everyone, I wanted to share this strange thing that happened to me and my boyfriend. \nSo we have been living in our apartment for about a year now, and we love it. Ever since I first saw the place I could feel a very positive energy in the house, and things just happen to work out for us, ever since we moved here.\nMy boyfriend works from home and he was supposed to start work at 9 this morning. We went to bed a bit too late last night, and he wouldn’t get much sleep, but either way he set his alarm and went to sleep. In the middle of the night he woke up from a nightmare ( this is very strange for him, he never has nightmares or dreams at all), he didn’t tell me what it was about and went back to sleep. Next thing I know I wake up and look at the clock and it’s 11:00. My boyfriend’s alarm didn’t go off, which is odd because I saw him put it on, but when we looked at his phone the alarm was turned off. Then he told me about the nightmare he had: he saw himself in his office working, when he started having connection issues, and then he turned around and saw a face staring at him from the door, he went to open the door and saw a man standing in our living room unplugging our wifi router.\n\nI thought this was very strange to have a coincidence like that, and when we later opened his phone again - the alarms turned themselves back on!\n\nDoes anyone know what that could be? Is there a ghost in our house? Was it trying to let him know his alarm malfunctioned? Or did it mess with it on purpose?\n\nP.s. sorry for so much text",
        "created_utc": 1674427383,
        "upvote_ratio": 1.0
    },
    {
        "title": "Last night..something used my friends voice to speak",
        "author": "JennC137",
        "url": "https://www.reddit.com/r/Paranormal/comments/10iwkp0/last_nightsomething_used_my_friends_voice_to_speak/",
        "text": "So last night my friend and I were enjoying our Saturday and staying up late. We had a few tequila shots throughout the night but neither of us were intoxicated at this point and were eating some food before bed. It was around 3:00am and we were getting ready for bed. I have a dog named Layla and wanted to take her outside to go potty before we headed off to sleep. We went outside and she did her business. When we came back inside my friend was sitting at the table eating chips and I was getting water in the kitchen. I said how ready for bed I am. I was watching friend literally putting chips into her mouth when we both heard HER voice say “right Layla!?” Both of our eyes widened and we looked at each other. She asked me if I heard that and I said yes and asked her if she said that and she said no. She couldn’t have before I saw her mouth open and she was eating. None of our pets acted scared or nervous and we didn’t feel a sinking feeling in our stomached but it was freaky. \n\nHas anyone experienced anything like this or know what this might possibly be???",
        "created_utc": 1674427354,
        "upvote_ratio": 1.0
    },
    {
        "title": "Pourquoi je suis comme ça ?",
        "author": "lilou21jsct",
        "url": "https://www.reddit.com/r/Paranormal/comments/10iuber/pourquoi_je_suis_comme_ça/",
        "text": "Depuis toute petite je me sent bizarre, en ce moment quand je me regarde dans le miroir je me dis \"qui est tu ?\" . Je n'arrive pas à me reconnaître cette sensation étrange. Mon père et ma mère se sont séparé quand j'avais 2 ans. Ils ont pris chacun une voix différentes mon père et parti du côté séduction et ma mère boulot. Quand mon père à enfin trouvé une femme il était heureux. Mais cette femme de toute évidence m'aimer : elle passé sont temps à me faire des remarques par exemple \"il reste toujours 3 feuille de papier toilette sur le rouleau de papier toilette m'a fille qui est parfaite ne les utiliserai pas elle est parfaite alors c'est toi, tu est sale\" . Tous un ta de chose comme ça qui sort du ridicule mais pour une resont qui m'échappe elle m'aimer pas elle disait que j'étais bizarre. Quelques années plus j'arrivais en 6 ème mon n'étais plus avec elle, une voix dans ma tête voulais pas arrêter de me parler je me disais que c'était mon imagination qui ne voulait pas s'arrêter mais non elle me menacer de me tué si je lui obéisser pas je la croyais pas jusqu'au jour ou cette voie me dit tu va souffrir. C'était en plein cours d'allemand et la mon ventre se mit à me faire mal a en mourir. Alors j'ai décidé de lui obéir et tous aller bien . Un jour en me réveiller je me regardait dans la glass et j'ai prononcé c'est mots là \" qui est tu\" en me fixant et sans resont je me suis mit à sourire. Depuis se jour cette voie n'ai plus jamais revenu mais quand je me regarde dans le miroir je ne sais pas qui est se reflèt mais se qui est sûr c'est que c'est pas le miens. Et depuis peut mes parents ne cessent de me dire que je suis bizarre et que j'ai changé. Je ne sais pas quoi en penser aidez moi",
        "created_utc": 1674421745,
        "upvote_ratio": 1.0
    },
    {
        "title": "Savannah, GA trees?",
        "author": "shroomride88",
        "url": "https://www.reddit.com/r/Paranormal/comments/10its59/savannah_ga_trees/",
        "text": "[removed]",
        "created_utc": 1674420446,
        "upvote_ratio": 1.0
    },
    {
        "title": "Demoniczna Zjawa W Moim DOMU - 5 Paranormalnych Nagrań!",
        "author": "MichalLesisz38",
        "url": "https://www.reddit.com/r/Paranormal/comments/10its0m/demoniczna_zjawa_w_moim_domu_5_paranormalnych/",
        "text": "[removed]",
        "created_utc": 1674420437,
        "upvote_ratio": 1.0
    },
    {
        "title": "Mine Ghost or not?",
        "author": "myfingersmells12421",
        "url": "https://www.reddit.com/r/Paranormal/comments/10iszpw/mine_ghost_or_not/",
        "text": "[removed]",
        "created_utc": 1674418479,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can I make my own Ouija board?",
        "author": "FlyBabyDragon",
        "url": "https://www.reddit.com/r/Paranormal/comments/10isvl7/can_i_make_my_own_ouija_board/",
        "text": "If I make my own Ouija board will it work? Is there anything special I need to do to make it or can it just be like a piece of work with the alphabet and stuff drawn on it? Basically how would I go about making one and would it work?",
        "created_utc": 1674418188,
        "upvote_ratio": 1.0
    },
    {
        "title": "GOOD EVP DEVICE? Olympus DM-670?",
        "author": "caiti_nb",
        "url": "https://www.reddit.com/r/Paranormal/comments/10irhar/good_evp_device_olympus_dm670/",
        "text": "Hey everyone.\n\nI'm new to investigating and I'm looking to get more into it :)\n\nI was wondering if the **Olympus DM-670** is any good for catching EVP's?! Does anybody use this device and caught any compelling evidence with it?\n\n&amp;#x200B;\n\nAny other advice would be appreciated :)\n\nThanks!\n\nCaiti x",
        "created_utc": 1674414706,
        "upvote_ratio": 1.0
    },
    {
        "title": "Communication with the deads through dreams?",
        "author": "hamsterfangirl",
        "url": "https://www.reddit.com/r/Paranormal/comments/10iplgb/communication_with_the_deads_through_dreams/",
        "text": "Hi! As the title says, I've been communicating with my dead fiance through my lucid dreams for more than a year now, anyone know if it's even possible or if it's either my own imagination playing with me?\nCan ghosts visits us through dreams?\nOr does anyone know a community on Reddit about that? I'd love to hear stories and such.\nThanks!",
        "created_utc": 1674410051,
        "upvote_ratio": 1.0
    },
    {
        "title": "On the Beach - Lady in Black",
        "author": "Citation12",
        "url": "https://www.reddit.com/r/Paranormal/comments/10ipdo3/on_the_beach_lady_in_black/",
        "text": "One summer  I was taking a much needed vacation on Montauk Point, the eastern most tip of Long Island, NY.  My first day dawned a  glorious summer; warm ocean breeze, shimmering skies and dancing white caps completed the idyllic scene. Not too many folks around that long stretch of white sand on the edge of town and I was longing for a dip in the Atlantic after a grinding winter of work. \n\nThe waves were much higher and stronger than anticipated; immediately, large breakers knocked me over, forcing me to the sandy bottom. Over and over again, walls of green and white water forced me down.. my bikini top is stripped to my waist...time slowed...I remember at one point looking up from the bottom to a massive roof of green water towering above my head; Then I started to take on seawater  and it crossed my mind that this is going to be it--I was drowning.  But just when I was beginning to surrender, it became clear I was being pushed into shore... bit by excrutiating bit, wave after wave...\n\nStill floundering in the shallows, terra firme almost within reach if I can make it,  I very clearly saw  a beautiful, slender, red-headed woman wearing a black one-piece bathing suit flanked by two identical red-head infants playing at the waters edge...\"Help Lifeguard!\"  I tried to shout...the woman looked  directly at me, smiling in an unconcerned and inscrutable manner. She gave no indication of hearing me. She speaks not a word....but shortly, a  lifeguard appeared asking if I need help... But the crisis is past, the ocean has given me up today...utterly exhausted and shaken, I  manage to crawl the last few inches to safety under my own steam...\n\nI want to thank the woman in black, but she is nowhere to be seen. Sight lines for miles around, but there are no red-headed women on the beach. There are no cherub-like infants around.  I have the distinct impression that she  is some sort of a guardian angel. I'm always going to believe that and I'll never forget her.",
        "created_utc": 1674409501,
        "upvote_ratio": 1.0
    },
    {
        "title": "something is sexually assaulting me in my sleep",
        "author": "Jayekubs",
        "url": "https://www.reddit.com/r/Paranormal/comments/10ipd4d/something_is_sexually_assaulting_me_in_my_sleep/",
        "text": "[removed]",
        "created_utc": 1674409465,
        "upvote_ratio": 1.0
    },
    {
        "title": "Someone/something haunting everyone at my home except for me?",
        "author": "Gro0by",
        "url": "https://www.reddit.com/r/Paranormal/comments/10ip9v3/someonesomething_haunting_everyone_at_my_home/",
        "text": "Yo, so i've been renting a flat for about 2 years now. Previous owner passed away, possibbly in that flat too. The landlord is a sister of that woman, and while disgussing details she was specific only about one thing - her sisters antique furniture piece, i wasnt supposed to move it, and needed to be very carefull with it, so i did, nothing crazy. At the beginning i saw some flashing bulbs, some furniture was opening by itself, or there were keys to the furniture getting lost by themselves, but that's just it, it stopped for me after about a week, but since then, my girlfriends hears, and experiences some weird things, same as my friends, noone is willing to sleep in the \"antique room\" and claims it feels weird there and as there was someone or something there. My friends that visit me or my girlfriend are seeing objects moving by itself in the kitchen for example and hearing things, but its always when im not there i cant seem to experience it anymore. If something happens IT happens to someone else when i cant see/hear it. Is that thing or person or whatever it could be like protecting me, or what are the other possibilities?",
        "created_utc": 1674409231,
        "upvote_ratio": 1.0
    },
    {
        "title": "midnight man ritual",
        "author": "Still_Ad_7226",
        "url": "https://www.reddit.com/r/Paranormal/comments/10iohs5/midnight_man_ritual/",
        "text": "Hello I used to be and still love watching ppl play games lime the midnight man, dry bones ritual. Ik that they r dangerous, and ofc the videos on yt could be fake but I want to know of any of u have done games like that and I want to know ur experience",
        "created_utc": 1674407282,
        "upvote_ratio": 1.0
    },
    {
        "title": "Sharing my story of a haunted dorm",
        "author": "Lil_Saturday",
        "url": "https://www.reddit.com/r/Paranormal/comments/10io3fw/sharing_my_story_of_a_haunted_dorm/",
        "text": "Just wanted to share my experience with the internet! This is a LONG one. TL;DR: I had ghostly experiences in an old dorm.\n\nWhen I was a third year in college I was one of the RAs in this house on campus. My school is on an island off the coast of Maine and most of the buildings, except the “new” dorms, are converted New England mansions and cottages, some built in the 1800s. The house I was in is a converted mansion complete with a servant’s quarters and nursery. \n\nI was the senior RA so I got the old master bedroom which was at the far end of the house next to a fire escape. Prior to classes starting, the RAs go through a training week (it was actually 2 weeks) and everyone stays in this house since it’s the biggest and then move to their respective houses at the end of training. The other RAs all stayed in the servant’s quarters (more fun I guess) so other than feeling a little lonely on my side of the house, I was content to unpack throughout the week on my own.\n\nThings started about 3 days into training, when I started finding colorful craft feathers inside my stuff. As in, I’d open a sealed box and there would be a craft feather there, or I’d take out a pair of pants from a drawer and underneath I’d find a feather. They were always tucked away except one that was in the middle of my floor. It was odd but I chalked it up to mice in the house and disregarded it.\n\nThen one night early on I was awakened to footsteps in the hall. My immediate thought was that something was wrong and another RA was coming to get me. There was no other reason someone would be down here at this time. I took note of the time: 2:00am on the dot. I could hear the footsteps come up to the door and then nothing. I was a little spooked but I figured I’d ask about it in the morning.\n\nNext morning, none of the RAs admitted to walking down my hall at that hour, so I let it go. Until, that night it happened again. The footsteps woke me up and again it was 2am on the dot. Then it happened the following night. I started to get freaked out until someone suggested it could be a nightwatchman.\n\nBecause this school is a total hippie college, we didn’t have proper security on campus but we did have two old Mainers who did nightly rounds. They would walk through the dorms’ public spaces and check that alarms were working, nobody needed anything, etc. Great guys, knew them by name and they were always friendly. Of course! It had to be them — the timed footsteps, the fact that my room was beside the fire escape — they probably went down those stairs and I just couldn’t hear them.\n\nI decided I would meet the nightwatchman at 2am so I could put this behind me. I set my alarm for 1:55am and propped by door open, turned on all my lights, sat on my bed and waited for the nightwatchman to come my way.\n\nAt 2am I hear footsteps approaching. They are getting close until it sounds like they are right at my door but there’s no one there. I get up and I go to my door and look down the hallway — nobody is there. Because I’m petrified and need a rational explanation, I call out “Is anybody there?”\n\nImmediately everything that I had on my door — my name tag, RA papers, the little door signs on my doorknob— everything falls off all at once. Terrified I slam and lock my door and kept the lights on all night.\n\nIn the morning I tell my fellow RAs and they are all laughing at me, thinking I have an overactive imagination. I suspected maybe they were pranking me, but then things escalated.\n\nFast forward to orientation week. My house is all freshmen so I know their schedules, which is pretty much in mandatory orientation sessions in the lecture hall. I decided I needed a nap before lunch and went to my room and slept from 12 to 12:30. I would catch the end of lunch before they stopped serving at 1pm. I am completely alone in the house.\n\nI wake up with my alarm at 12:30 and head out to lunch. I decide to cross all the way through the servant’s quarters because their fire escape/external door dumps out to the main path. To get to the servant’s quarters I have to pass though the other “main” rooms and then there is this sort of threshold that has a large bathroom between the house sections. As I pass by, the door handle is turning back and forth, like someone is stuck inside.\n\nDespite my weird experiences, my first thought is that someone is legitimately stuck in the bathroom — it happened to a few RAs during training, the door is warped and doesn’t fit in the frame perfectly. I knock on the door and say “Hey this door sticks, let me help you” but they ignore me and keep turning the knob and rattling the door. I knock and repeat my offer to help, but they continue. Then the door flies open and then slams in my face. Then it opens again and slams in my face. Then it opens slowly and stays open.\n\nBecause I’m dumb or just duty-bound, I feel like I need to check and make sure I don’t have a resident stuck in there or something. I step inside the bathroom — there is no one in there.\n\nI run out of the house and to the dining hall and find my co-RA who lives in the servant’s quarters of the house and tell her what happened. She just tells me there’s a logical explanation, the window was probably open and caused a pressure difference. I am so scared and I tell her no way that is what happened.\n\nThat night, to the amusement of my residents, I walk through the house and say out loud “if there is a spirit here I don’t want you to feel like you can’t live here but we have to coexist peacefully. I am terrified of you and I don’t want to be. We can both live here, just please don’t show yourself to me at night and please let me sleep when I go to sleep.” I felt like I needed to make boundaries but I also didn’t think I could ask it to leave.\n\nThings smoothed over. Sometimes I would get the feeling that something was in my room when I’d be studying, like a friend sitting down on my bed or something. When I was ready for bed I’d announce it and it would feel like the presence would leave, but it could totally just be my brain making things up.\n\nFast forward to Halloween. I’ve come down with pneumonia and am very, very sick. I spent a day in the hospital and then was sent back to campus with meds. A couple days pass. My Co-RA comes to check on me one night and asks me how I am doing. I tell her I’m getting there but my room is a disaster — clothes and papers everywhere. I start to get up saying I’d feel better if I could just put the papers in one pile and the clothes in another. She tells me she’ll help me do this tomorrow, but now I should sleep.\n\nI fall asleep, but am awakened by noises in my room. I also had a mouse problem, so I was careful never to leave food in my room. I realize maybe I forgot to bring a mug or something downstairs, so I turn on my headlamp to look for the source of the noise and deal with the plate or whatever. As I’m shining my headlamp I see one of my sweaters slide across the floor. Then a folder in the opposite direction, then more clothes and papers … everything was sorting itself just like I wanted.\n\nI was terrified so I say out loud “I’m so grateful that you are trying to help me but I am so sick and need to sleep, please stop!” And then everything stopped. I fell asleep. In the morning my co-RA tells me I must have been feverish and did it myself. I guess it’s possible, but I know what I saw, and I no longer had a fever at this point.\n\nThe following year, I asked the head of Buildings and Grounds, who was here since the college opened, whether anyone died in that house. He told me before this was a college, the owners of the house had a three year old boy who died on the premises. I’d love to believe it was his spirit just looking for a friend. I hope he’s moved on now, but I have a sort of fondness for those spooky experiences.\n\nNothing has happened to me since, so I really think there was something about that place. It’s been 11 years since I’ve lived there.",
        "created_utc": 1674406282,
        "upvote_ratio": 1.0
    },
    {
        "title": "Previous homeowner made a visit the night she passed away?",
        "author": "Kales2233",
        "url": "https://www.reddit.com/r/Paranormal/comments/10ilszg/previous_homeowner_made_a_visit_the_night_she/",
        "text": "So, my wife and I bought a house in May of 2020. The house was built in the 80s and only had one previous owner before us. She was an older woman who kept the house in PRISTINE condition. We’re talking 80s appliance manuals still tucked away neatly in a drawer. The neighborhood kids would help her transport wood into the basement as there are a couple of wood burning stoves in the house. She would invite the neighborhood over for poker nights and always had aged bourbon on deck. From what I’ve gathered, she was very loved in our neighborhood and was very proud of her house. Also - fun fact - her daughter was apparently a medium and would offer readings from the house. She was older and injured herself so she had to move into assisted living. \n\nFast forward and we’ve been in the house for 2 years. We had done lots of remodeling and hadn’t had any strange occurrences at this point. It was the middle of the night and my dog who sleeps in the bed with us jumps up and starts barking and growling at the middle of our dark room. She had NEVER done this and hasn’t done it since. She was acting so strange that it got to the point where we actually walked through the entire house to make sure nobody had broken in and no animal had somehow gotten inside. Found nothing. \n\nAfter a while we finally got her calmed down and went back to sleep. 2 days later, we’re on a walk in the neighborhood and a neighbor who kept in close touch with the previous owner (she would visit her and send her pictures of our house with Christmas lights up, etc) informed us that she had passed away the night that our dog had her freak out. I’m convinced dogs are more sensitive than us and the old owner might have come to see what we have done with the house. But it’s also easy to look at that as a coincidence. \n\nSINCE that night though, lights have turned on and off by themselves, this one door is always opening and closing itself, another door has slammed shut twice and this giant piece of furniture somehow moved on its own. My wife and I were preparing to host a get together with old friends and we turned a room in the basement into essentially a party game room (pong table, giant jenga, etc). It’s an unfinished room with a cement floor so we were thinking clean up would be easy if needed. We have this giant old recliner that is just a HEAVY biotch. It takes both of us to move it. We had placed the recliner out of the way in the corner. A couple hours later, we are cleaning upstairs - my wife and I and the dog are the only ones at the house - when my wife runs downstairs to grab some paper towel. She comes upstairs, looking confused and asked if I had gained some muscle and moved the recliner on my own somehow. I hadn’t. But the recliner had somehow been moved to the head of the pong table. The amount of nope I experienced in that moment. There’s no explanation for how the recliner had moved. \n\nOverall, we haven’t necessarily felt threatened and nothing has really escalated, so we’re just kind of noticing and letting it go. But I thought it was kind of worth sharing.",
        "created_utc": 1674400319,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why are entities and spirits in this plane? Are they here forever?",
        "author": "cnoelle94",
        "url": "https://www.reddit.com/r/Paranormal/comments/10ikpuh/why_are_entities_and_spirits_in_this_plane_are/",
        "text": "Do they have a choice? What are they doing here. Why don't they go to the other side? Also, are all of us spirits forever when we die? That kind of sucks bc I was hoping when we die, we'd fall over and there'd be nothing. Eternal sleep, peace, no effort, no pain, however you wanna call it.",
        "created_utc": 1674397249,
        "upvote_ratio": 1.0
    },
    {
        "title": "I had Automatic Writing and got Two weird info",
        "author": "Snoo80641",
        "url": "https://www.reddit.com/r/Paranormal/comments/10ikn35/i_had_automatic_writing_and_got_two_weird_info/",
        "text": "some years ago I started automatic writing in my computer. After some time of tryng I got two weird info: \n\nFirst, \"Mao Tse tung was sent by americans to China\". Then I researched and found somewhere that Mao Tse tung was a spy of USA in China government. (Never read about this topic in my life) \n\nSecond, \"Don't go to France, it will be invaded\" this was before of all  ISIS attacks. \n\nHave you ever tried? \n\nAnyway, I saw a video a girl who suggested not doing this as spirits can make fun of you and make you addict to contact them in order to control you. Just sharing",
        "created_utc": 1674397026,
        "upvote_ratio": 1.0
    },
    {
        "title": "Sounds like an animal wants to get into our spare bedroom at night",
        "author": "skipbreather",
        "url": "https://www.reddit.com/r/Paranormal/comments/10ikms1/sounds_like_an_animal_wants_to_get_into_our_spare/",
        "text": "While sleeping in our guest room (new build 2019). I once thought I heard an animal scratching at the bedroom door.  Thought it must’ve been outside.   \n\nIt happened again but more intense.  I was sleeping and suddenly awoke….  Then while trying to sleep, I  heard an animal at the door trying to get in.  I was listening more intently then it felt like the animal ran past me on the bed.  Then seconds later my hair started standing up on my neck.   I left immediately and now sleep with ear plugs.  \n\nAny thoughts?",
        "created_utc": 1674396999,
        "upvote_ratio": 1.0
    },
    {
        "title": "Doppelganger Encounter",
        "author": "ShipWorking6023",
        "url": "https://www.reddit.com/r/Paranormal/comments/10ikg64/doppelganger_encounter/",
        "text": "I was in 11yrs old and in 6th grade when this happened. So in my school we used to water some plants around our building every afternoon before going home, we had to get those 1 litre containers, we had to go to the garden in the grade 5 building to the water pump. We have to individually go back and forth 3-5 times before having tasks done.\n\nAs me and my classmates were lined up, I told my friend I’ll get more containers just so I can finish up faster.\n\nI went back to our building and as I was picking containers, I saw my friend come also. We were the only ones there so I asked her if she wanted to get containers too, but she was just silent. She just continued to walk up the stairs and into our classroom. I tried to follow her up but stopped in the middle of the stairs since I remembered I have to do some watering.\n\nWhen I came backto the garden I was surprised to see my friend, the same one I just saw in our building, so I said “Hey you got here really fast!”. Her face had this confused look, she replied to me that she never went out of the line. I told her what happened but she just laughed. I didn’t really press the topic anymore since I don’t like being pushy.\n\nTo this day, I’m still wondering what could’ve happened to me if I followed that doppelgänger into our classroom.",
        "created_utc": 1674396461,
        "upvote_ratio": 1.0
    },
    {
        "title": "Did I see a ghost or was I mistaken?",
        "author": "Silent-Durian2077",
        "url": "https://www.reddit.com/r/Paranormal/comments/10ik095/did_i_see_a_ghost_or_was_i_mistaken/",
        "text": "I am not the type of person who can see/sense any ghosts at all, except maybe for 1 occassion. \n\nThat night was one of the lowest points of my life. I was exhausted mentally and physically after finishing my thesis, felt so alone and lowkey depressed. \n\nI woke up around 11 PM, no one was home. I fell asleep after doing my laundry in the afternoon due to fatigue, so I had to air dry the said laundry in front of my house now (where I usually dry it). Yes, I now it is so stupid to go outside midnight to dry some laundry, but I didn't have my life together at that time. I didn't think much either, because I never had any weird experience until that point no matter how careless I was.\n\nSo I really went outside with my laundry. Nothing weird at first, but I have to mention that there's a river right beside my house. I took a glance while hanging my clothes and realized how dark and quiet it was (well, duh). Still, I was quite sure I wouldn't see anything.\n\nBut lo and behold, after hanging clothing, when I went back to my house I instantly noticed something. I was turning my body around, closing the door slowly and I saw this long silver hair crazily flying in the air as if a hair drier blew it in the balcony of my neighbor's house across mine. Needless to say, I was shocked. There was nothing I could do except silently cussing. I couldn't see the face nor the body clearly, but it was enough to keep me awake for the rest of the night. \n\nThe next day, I went around to ask several of my other neighbors if there was an old man with silver hair living there. My neighbors told me that only a young man living in that house. I speculated if I saw a mop placed in balcony (a bit far fetched because it doesn't explain why it was flying when there was no wind let alone strong one), but apparently the man never mops his house either. My neighbors tried to think positively and told me that I was probably dreaming.\n\nHowever, I knew I woke up that night and dried my clothes. It couldn't be a dream. I am not the type to sleep-walk either or anything. I never experience hallucination, so I knew it happened. I am near-sighted tho, and with glasses I still can't see clearly from afar sometimes.\n\nI have already long moved out from the house since then, got married and worked faraway from my hometown. My mental health state already got so much better. I am back to my normal self who can't sense any apparition whatsoever. To add another background story: I was grieving after my mom's death for years, but now I have moved on.\n\nMy husband thinks I did see a ghost that night but I am curious, is it possible due to unprecedented stress in my life I got hallucination (?) For the first time? But if I truly saw ghost, why would they appear before me that night?\n\nWhat do you think?",
        "created_utc": 1674395154,
        "upvote_ratio": 1.0
    },
    {
        "title": "My office chair was rotating on it’s own.",
        "author": "FunzReddit7208",
        "url": "https://www.reddit.com/r/Paranormal/comments/10ijhha/my_office_chair_was_rotating_on_its_own/",
        "text": "I haven’t read any posts here but the titles seem to be fake, however this is not fake, I could swear on my family this is real. So, yesterday around 11pm when I was about to go to sleep, I noticed my chair was rotating. Sure it does keep rotating when I bump into it, but that lasts for 10 seconds max. This time it was spinning for around A MINUTE. I have no idea how that happened but a thing that is strange, when I whispered to myself: „If you’re a demon then stop rotating the chair!”. It stopped. Not slowly. It was SUDDEN like something was in it’s way, but there wasn’t anything, since during the minute that it was spinning, it made ATLEAST 2 full spins. And there wasn’t any wind, since both my window and door were closed.\n\nAs I was about to post this, I swear I heard someone whispering: „Don’t post this, you’re going to regret it”. Should I not have posted this? Please help, I feel like I’m going crazy",
        "created_utc": 1674393493,
        "upvote_ratio": 1.0
    },
    {
        "title": "What does three knocks mean?",
        "author": "Y2kbestie",
        "url": "https://www.reddit.com/r/Paranormal/comments/10iiqqk/what_does_three_knocks_mean/",
        "text": "[removed]",
        "created_utc": 1674391020,
        "upvote_ratio": 1.0
    },
    {
        "title": "The Demon In The Attic",
        "author": "CDProjektIvory",
        "url": "https://www.reddit.com/r/Paranormal/comments/10igmu0/the_demon_in_the_attic/",
        "text": "This is one of the longest posts I've had to write so sorry if it's a little janky :) This was something that happened to me years ago and I'm still curious about what it could have been\n\nYears ago, when I was around 13, I was in a relationship with a girl whom I visited pretty frequently. Almost every day after school if I could. Due to me visiting her so often, I got to know her, her family as well as her home a lot more. They were very kind people, but just a little off. At the time I wasn't a very religious person, however my girlfriend and her family were Satanists. When I first heard that, I thought it was a joke, but soon I realized that they were being serious. I wasn't too surprised or bothered by it. She later told me that her house was haunted, and me being the biggest skeptic kinda just brushed it off and showed interest so we could keep talking. \n\nAfter a while, I start noticing things in the house that were unsettling, but I was quick to dismiss. I figured anything had a logical explanation behind it, so why try and claim it was something paranormal. It started at first with small tapping sounds. To be honest at this time, I thought it was just the house settling or creaking due to wind. We live in Florida so it wasn't too hard to believe that some weather could have caused the house to make noises. That's what I believed since it was the most logical explanation... that was until we heard scratching coming from inside her closet. We thought it was her cat, especially since we would constantly bring her into the room and she liked to explore. We also thought maybe she snuck in and we closed the door on her and it took her until just that exact moment to try and attempt to get out.\n\nObviously we got up and opened the closet door just to find... nothing. This was really peculiar, but I shrugged it off and figured that maybe it was a mouse or rat in the walls. She pointed out though that there was scratch marks all over the closet. They weren't high up, if anything they were about at level with a common cat or small dog, but like I said... the cat wasn't in the closet. They weren't even in the room. Needless to say I was weirded out. I wasn't scared, but I was clearly believing that something was not right. I don't know exactly what was wrong, but I was feeling off after this.\n\nWeeks go by and even months go by. Some minor things keep happening. Mostly just the scratching which has pretty much torn up the paint in the closet entirely at this point, but also other things like the cat acting strangely and a weird sense of unease when you're in certain areas of the house. Particularly the restroom, the garage and the master bedroom. I just assume that it all has a rational explanation, of course. I wasn't sure of what it was, but I was stubborn and dumb. One day though, something was especially... creepy. So creepy to me in fact that I had actually started questioning whether or not there is such things as gods, demons, ghosts, etc. Something that will stick with me forever.\n\nOne day, my girlfriend had invited me over. So I asked my mom and she dropped me off. I noticed there weren't any cars in her driveway, it wasn't really weird since her family did work often or were usually out shopping. My girlfriend opens the door after I knock and she let's me in. First thing we did was head to her room to watch Third Rock From the Sun. While we're sitting there, we make some small talk, we go to the kitchen and grab some food, then we go back to her room to keep watching TV. At some point though, hours later we end up shutting off the TV and just start talking. Out of nowhere though, we hear her older sister yell her name from right outside her door. We assumed that they were finally home from wherever they went, and we went out there to check up on them. Weirdly enough, we didn't see her. Like we checked everywhere around the house and we didn't see her at all. We even yelled back, but got no response. We chalked it up to us maybe hearing something and just assuming it had coincidentally sounded like her sister yelling her name. Like I said, stubborn and dumb. We head back to the bedroom and sit down, but this time we leave her bedroom door open just in case her sister really did call for her and attempts to call again. After a few moments we hear her sister call for her name again. However... this time it didn't sound like it came from behind the door. It sounded as if the entire house had just called her name. Not only was it so loud and clear, but it also didn't change its tone and pitch and sounded like it was just a repeated audio from the last time she had called for her. Once again we quickly bolt up, and search around the house as fast as possible.\n\nWe thought it was her sister just trying to play some kind of prank on us. Once again we didn't see her. We couldn't even trace where the sound came from and we even checked in all the areas where someone could easily hide. Being dumb, we once again just said that it was probably nothing to worry about. About an hour or so goes by and we hear her dad's truck start to pull up to the house. We check out the window to watch them, then the rear passenger door opens... it's her sister. We were baffled to say the least and wondered when and how she had left so quickly. We met them at the door and asked her what it was that she kept calling for. She looked at us with confusion and concern. What she and her dad told us... makes me anxious to this day. She was gone since 6 in the morning doing some shopping. We immediately tried calling her bluff, but her dad doubled down and seemed to get a little annoyed by this and told us that they were indeed out shopping all day. Right after he told us this, we told her sister that we heard something sounded exactly like her voice calling for willow and when we tried finding whatever it was that kept calling her we would come up with nothing. \n\nSomething must have really alerted and worried her sister because after we told her this she immediately went pale and looked sick. She told me that she would like to speak to my girlfriend in private real quick and brought her to the back porch. I went back to my girlfriends room and just sat on her bed waiting for her to come back. After about 5 or 10 minutes she came back and looked a little concerned while also downplaying what had just happened. I asked her if everything was alright. She told me the following, \"Yeah, she asked if we had went into her room. I told her I did and she got mad. She told me though that if we ever hear her voice while she's not home, then do NOT go into her room. Right above her bed is an attic, and she told me how one time while she was sleeping, she had woken up in the middle of the night and saw that the attic right above her bed was cracked open. She told me she saw her own face staring back at her from inside the attic\"\n\nThis is a true story, and something that has stuck with me for years. I'm 24 now, and though it has been a little over 10 years later, I feel as though it has just happened yesterday.\n\nIf anybody or anyone knows exactly what that was that we had potentially come across I would love to know. They had moved out of that house years ago, and I was heavily debating on visiting the home, but I don't wanna be that weird guy who knocks on a strangers door to ask about ghosts and demons. Once again though, I would greatly appreciate and love to learn about what that might have been. It's the only reason why I actually believe there might be either an afterlife or at the very least I think there is monsters or demons in the world",
        "created_utc": 1674383247,
        "upvote_ratio": 1.0
    },
    {
        "title": "I think me and my friend are cursed.",
        "author": "Emotional_Campaign60",
        "url": "https://www.reddit.com/r/Paranormal/comments/10igiw6/i_think_me_and_my_friend_are_cursed/",
        "text": "(My side)Me and my friend were playing gloomy Sunday at\n2:30am as a joke to scare each other but then bad things started to happen after we both parted ways I started hearing loud bangs on the walls around my neighborhood then my phone turned off and wouldn't turn back on until ten minutes later and I started hearing chains banging, then my phone turned back on then off again but wouldn't turn back on this time but I could still hear a phone call coming from my phone but not from it too like a faint call so I got spooked and started looking around me and I saw a black figure staring at me but when I turned away and looked back it was a full black dog staring at me walking in the same direction and my phone turned on but it was 3:02 am and now I think we are cursed can someone please explain (his side)i didn't see any cars passing by and all the lights were red where cars pass and I feel so empty inside and hopeless, like if some spirit followed us and something \nPlease if anyone knows about any of this or what happened please tell me cause idk what's going on.",
        "created_utc": 1674382812,
        "upvote_ratio": 1.0
    },
    {
        "title": "I think me and my friend are cursed",
        "author": "SpaceMonkey3601",
        "url": "https://www.reddit.com/r/Paranormal/comments/10igary/i_think_me_and_my_friend_are_cursed/",
        "text": "Me and my friend were playing gloomy Sunday at 2:30am as a joke to scare each other but then bad things started to happen after we both parted ways and I started hearing loud bangs on the walls around my neighborhood then my phone turned off and wouldn’t turn back on until ten minutes later and I started hearing chains banging then my phone turned back on then off again but wouldn’t turn back on this time but I could still hear a phone call coming from my phone but not from it too like a ghost call so I got spooked and started looking around me and I saw a black figure staring at me but when I turned away and looked back it was a full black dog staring at me walking in the same direction and my phone turned on but it was 3:02 am and now I think we are cursed can someone please explain. We didn’t see cars passing by and all the fucking light we’re red we’re cars pass and shit. I feel so empty inside and hopeless, like if some spirit followed us and shit. Please if anyone know about any of what happened please tell me cause idk what’s going on.",
        "created_utc": 1674381955,
        "upvote_ratio": 1.0
    },
    {
        "title": "I think I’m cursed",
        "author": "Emotional_Campaign60",
        "url": "https://www.reddit.com/r/Paranormal/comments/10iga0p/i_think_im_cursed/",
        "text": "Me and my friend were playing gloomy Sunday at 2:30am as a joke to scare each other but then bad things started to happen after we both parted ways and I started hearing loud bangs on the walls around my neighborhood then my phone turned off and wouldn’t turn back on until ten minutes later and I started hearing chains banging then my phone turned back on then off again but wouldn’t turn back on this time but I could still hear a phone call coming from my phone but not from it too like a ghost call so I got spooked and started looking around me and I saw a black figure staring at me but when I turned away and looked back it was a full black dog staring at me walking in the same direction and my phone turned on but it was 3:02 am and now I think we are cursed can someone please explain.",
        "created_utc": 1674381882,
        "upvote_ratio": 1.0
    },
    {
        "title": "Dark figure watching",
        "author": "Independent_Ad_5976",
        "url": "https://www.reddit.com/r/Paranormal/comments/10iflbt/dark_figure_watching/",
        "text": "This happened when I was in elementary or junior high. My family and I were visiting my grandfather we were getting ready to leave. It was night time I had opened the door and as I walk outside I saw a dark figure that kneeling on top of a small power station looking at me or my general direction. Now this figure was pitch black no light hit this thing and I know that because there was parking lot that all lights on right next to my grandfather home. Not a single piece of light touch this figure everything around it was lit up. As I looked at it for a few seconds I felt nothing but I was shocked and afraid. I looked back inside to see if anyone else saw this but no one did they were talking to each other. As I turned around it was gone.",
        "created_utc": 1674379047,
        "upvote_ratio": 1.0
    },
    {
        "title": "Need an expert to weigh in/ provide info on this encounter",
        "author": "AggravatingCancel200",
        "url": "https://www.reddit.com/r/Paranormal/comments/10iff9u/need_an_expert_to_weigh_in_provide_info_on_this/",
        "text": "I want to start by saying that I have had supernatural experiences before, but never anything like what happened a couple of nights ago. As a child I lived in a home where I would see strange figures in the corner of my vision, things would disappear and turn up in weird places, and I’d sometimes hear tuba music through my pillow between midnight and 4 a.m. nothing too scary though, the ghosts never bothered me and I’ve even managed some level of skepticism as to whether or not these experiences were the result of my imaginative, growing adolescent brain. I would really like if someone more informed on the topic could tell me what the hell happened two nights ago or if it correlates to any specific type of entity that I should be worried about or if I am just a loon. \n\nMy fiancé stays with his grandparents during the workweek due to his job being closer to them than our home. Sometimes I stay with him, sometimes I stay home. This week I decided I wanted to be with him. He’s told me before that his room at their house is haunted, although I brushed him off bc I’d been there plenty of times with no encounters. \n\nIt started after I came in from an insomnia walk. It was after midnight. The room seemed darker, albeit the lights were off. There’s a window with no curtain in the room, usually some moonlight will come through. It was just unusually dark. Fun fact, I’m scared of the dark, always have been. Fine. Get undressed, take my shoes off, climb into bed next to sleeping partner. \n\nOut of nowhere (and this has never happened for just no reason) the most overwhelming sense of dread takes over my body. I hear a slight tapping above our heads (this could be a mouse) and my water bottle crinkling beside the bed even though nobody’s fucking with it. My jaw feels wired shut, like one of those dreams, except I’m wide awake. I try to just shake it off, but every time I close my eyes I just see a vivid, glowing pair of eyes behind my eyelids, every time. \nBy this point, I’m not trying to deny that I’m experiencing SOMETHING (even mild psychosis), I’m just trying to think positively because this ghost doesn’t seem all that friendly and from what I do know, bad spirits feed on fear and negativity. \nEven though the room is dark, I can make out humanoid silhouettes looming over our bed where no shadow should feasibly be cast. \nThe icing on the cake was what felt like a small bug or worm crawling into my ear, wrapping itself around my brain, and crawling back out. I felt it. It was physically uncomfortable. I noticed my partner breathing weird amongst all of the other things going on and shook him awake. All at once the room seemed to physically get lighter, I could move my jaw again, and things seemed to go back to normal- I had turned on the lamp and it wasn’t getting turned off. \n\nThe eyes I was seeing were masculine, everyone I’ve talked to in his family have claimed to have encounters with a much friendlier and more harmless feminine spirit, so this is entirely out of left field. The next day, the front door to his grandparents house slammed open while I was heading outside not once, but twice. Since then, I’ve saged the room just to be safe. My future MIL, who claims to be spiritually in tune, says that it doesn’t feel like anything is in the room anymore, if there ever was, but I’m not so sure given that the door slamming happened after the saging. \nThis is all very real, and if anything else happens, I will be sure to update this post eventually. \nPlease, I’m scared to sleep with the lamp off now. \n\ntldr: I may have had an encounter with a malevolent spirit and I want to know what it was and how to deal.",
        "created_utc": 1674378365,
        "upvote_ratio": 1.0
    },
    {
        "title": "Paranormal Locations in Texas?",
        "author": "DefiantPlant2219",
        "url": "https://www.reddit.com/r/Paranormal/comments/10ifdgz/paranormal_locations_in_texas/",
        "text": "My boyfriend &amp; I just moved to Texas. We do a lot of ghost hunting/ scouting out haunted areas. We prefer places that are more obscure. \nWould love to hear any and all suggestions for places to scope out or just to hear your experiences. Thanks. :)",
        "created_utc": 1674378158,
        "upvote_ratio": 1.0
    },
    {
        "title": "I think I'm just little nuts .",
        "author": "Substantial_Bother25",
        "url": "https://www.reddit.com/r/Paranormal/comments/10id407/i_think_im_just_little_nuts/",
        "text": "[removed]",
        "created_utc": 1674369281,
        "upvote_ratio": 1.0
    },
    {
        "title": "his mom doing his morning prayer",
        "author": "CupcakeIntelligent28",
        "url": "https://www.reddit.com/r/Paranormal/comments/10ibhtm/his_mom_doing_his_morning_prayer/",
        "text": "so Im a muslim but this story isnt mine,its my dads,he was at our villa alone,he heared walking behind him and so he looked back and saw his mom in a white chador going to pray be rememered he was alone and he went too look but found no one",
        "created_utc": 1674363523,
        "upvote_ratio": 1.0
    },
    {
        "title": "how do i tell if i have a haunted doll",
        "author": "External-Gain-3459",
        "url": "https://www.reddit.com/r/Paranormal/comments/10ibext/how_do_i_tell_if_i_have_a_haunted_doll/",
        "text": "i went to an abandoned house and found a little clown doll, then i took it home with me. i’m not scared of it , it doesn’t give me bad energy but it definitely is off. i think it moved by itself and one of my bracelets was placed next to it and i definitely didn’t put it there.",
        "created_utc": 1674363242,
        "upvote_ratio": 1.0
    },
    {
        "title": "Ft ringtone outside of my house?",
        "author": "Outside-Driver-2481",
        "url": "https://www.reddit.com/r/Paranormal/comments/10ianii/ft_ringtone_outside_of_my_house/",
        "text": "[removed]",
        "created_utc": 1674360681,
        "upvote_ratio": 1.0
    },
    {
        "title": "I think I've got a ghost",
        "author": "RebeccaS24",
        "url": "https://www.reddit.com/r/Paranormal/comments/10i8ziw/i_think_ive_got_a_ghost/",
        "text": "   Okay so I know this is gonna sound so stereotypical, but it's all 100% true and my cousins and brother can confirm it.\n   I guess there's no other way to start than from the beginning. When I was roughly 6 years old I had the first memory of a ghost. I was sitting at my great aunt's kitchen table. She lived in an older trailer in the rural parts of Florida (I'd rather not go into detail for safety reasons), surrounded by trees and a set of traintracks. Anyways, I was sitting at the table and I don't remember what I was exactly doing but I do remember looking through the doorway that led to their den and seeing a silhouette that looked like my dad's shadow. I was younger and didn't think much of it, but then, about 15 minutes later, my dad walked through the front door still in his work clothes.\n   Another occurance was when I was 11 and I was laying in bed watching a movie and something grabbed my foot and tried to pull me out of bed. My younger brother and I shared a room at the time, he was awake and witnessed the whole thing.\n   The scariest was when I was 12 and the ghost started pulling knifes out of the knife block and started throwing them. There's more but it's too much to list. Any advice?",
        "created_utc": 1674355388,
        "upvote_ratio": 1.0
    },
    {
        "title": "Should I purchase an ouijia board?",
        "author": "biko_69",
        "url": "https://www.reddit.com/r/Paranormal/comments/10i7vz8/should_i_purchase_an_ouijia_board/",
        "text": "Hey guys, I was thinking about purchasing an Ouijia board. I find it odd how simple it is to purchase one, especially at a toy store. I made a homemade one when I was in elementary school with my friend. We did it and nothing seemed odd until I heard my dryer door slam. Out of panic me and my friend decided to burn the board and try to forget what happened. This was about 7 years ago. I wanna try it out again but this time with an actual board. Do I believe in it. Idk. Should I try it again. Idk.\nWhat is your guys opinion",
        "created_utc": 1674352110,
        "upvote_ratio": 1.0
    },
    {
        "title": "The Ongoing Mystery at 30 East Drive Once known as the Black Monk of Pontefract's House!",
        "author": "AftonCoger",
        "url": "https://www.reddit.com/r/Paranormal/comments/10i53cw/the_ongoing_mystery_at_30_east_drive_once_known/",
        "text": "[removed]",
        "created_utc": 1674344173,
        "upvote_ratio": 1.0
    },
    {
        "title": "The Ongoing Mystery at 30 East Drive Once known as the Black Monk of Pontefract's House!",
        "author": "AftonCoger",
        "url": "https://www.reddit.com/r/Paranormal/comments/10i51i1/the_ongoing_mystery_at_30_east_drive_once_known/",
        "text": "[removed]",
        "created_utc": 1674344028,
        "upvote_ratio": 1.0
    }
]