[
    {
        "title": "I think I just saw a genuine ghost.",
        "author": "morganthecatholic",
        "url": "https://www.reddit.com/r/Paranormal/comments/10b94di/i_think_i_just_saw_a_genuine_ghost/",
        "text": "I think I genuinely just saw a spirit on my street.\nA little background: only a few hours ago my and my family members were discussing hauntings and the fact that we all genuinely believe in spirits and some had encountered them, call them liars if you like but they were took it very seriously and were sure of it. Either way, as it turns out my town has a large history of hauntings dating back to the 1700s, everything from devil deals to haunted castles to death appearing on the town bridge to people from town claiming to have been led home at night by my ten year dead grandfather. The most famous haunting in my town would be Charnvelle Castle. More distressing is the fact the estate I live in is 100 years old and was built over an actual graveyard.\n\nEither way I went to bed tonight and I was having a smoke when I happened to look out the window as I heard a woman talking outside. She was dressed in white and had a floral umbrella, I didn't think much of it until I went to take a drag from my cigarette for less than two seconds, I looked back and she vanished. Like she was legitimately in the centre of the street, she wouldn't have been able to disappear from my view in such a short space of time. I kind of imagined this ghost stuff as 50/50 and I wasn't sure on it but this has genuinely astounded me. The most interesting thing is that it doesn't even make me afraid just really curious to learn more.",
        "created_utc": 1673652784,
        "upvote_ratio": 1.0
    },
    {
        "title": "is this paranormal?",
        "author": "sleuthryin",
        "url": "https://www.reddit.com/r/Paranormal/comments/10b8eoa/is_this_paranormal/",
        "text": "Hey, Im just curious if there's a demonic presence at my home..will the people living there change in behavior?\n\nI'm visiting my parents' home back from campus.. They shifted to this flat a year ago..\nIn the past 2 months I have experienced some things such as a plastic mug falling down on its own , a calender with god picture falling down in the middle of the night, clothes falling of from a flat table..I ignored these at the beginning but last week I woke up from sleep screaming which i faintly remember..And also my brother mentioned when they shifted to this house he found a bible under the bed in which I'm sleeping now. I mean, it seems unusual to leave a Bible behind that, too, under the bed.\nAlso, I have to mention that my mom's mental health was affected after moving here. She hesitates to go out.. She makes screaming noises in the middle of the night ( she did that again 10 minutes back, which made me look up this thing). Also, sometimes she gets scared when i call her.\nFor the past 1 month, I can't sleep until 5 am.",
        "created_utc": 1673650955,
        "upvote_ratio": 1.0
    },
    {
        "title": "All my life, since I was a kid, I've had recurring dreams that changed every time I moved house",
        "author": "deodorant_whore",
        "url": "https://www.reddit.com/r/Paranormal/comments/10b87va/all_my_life_since_i_was_a_kid_ive_had_recurring/",
        "text": "I don't know exactly if it is something paranormal but this is the best place I've found to talk about it. It did happened and because I'm describing a lot of things, it is a long read.\n\nEver since I was a kid I had this strange thing about me. I'm able to have recurring dreams. I can have dreams like any other person, the ones that happen one time and you can barely remember, the weird, fun or nightmares ones. Everything just as the next person. I do, however, have recurring dreams, some of them were good, some of them were bad.\n\n I would ask my parents and friends if they had them and they would find odd but nothing much from it. When I was a teen, my mom and dad separated for a year, they also travelled a lot for work and so I'd say that I spent most of my life moving around. Maybe two years or so on a house and into the next one. Here's the thing, every time we moved, my recurring dreams would happen but the dream that would happen over and over again would change and I've never really found any explanation for it.\n\nHouse number 1, Dream number 1: \n\nI'm actually not sure if this was the first recurring dream I had but it was definitely the first one that I noticed. I must have been no more than 9 or 10. This house was built like a country house. Big house centered in the middle of a field, except this house was in a big city.   \nIn this house my recurring dream was me waking up in the night, because the garden lights were up, I would guess around 9pm as we turned them off before bed. I would unlock the front door on my own, walk up to the garden and stand next to a bench we had middle way to the gates of the house. There, a weird orange light would appear from the top of a mango tree we had, it would come next to me and take my memories away, I could see them being taken like a projection and I would notice it was only the good ones. This orange light looked like a veil of some kind. Once it was done, every time and I meant it, every time I had this dream. I would try to get these memories back by running towards them but I would fell because of the bench in front of me. I would get up and chase it but the orange light was fast and would always go into the roof of our house and I don't remember anything else after it.  \nWhenever I told my mom this dream she would say it was God taking my dreams to turn them into reality to calm down, I would never believe her because why would I run to get them back? I never said I didn't believe her thought.\n\nHouse number 2, Dream number 2:\n\nA few years after, maybe when I was 12, we move into another house. This house was only a couple of blocks away from my uncle's house. In this house, I would have a recurring dream that my father asked me to go retrieve something from my uncle and I would be on his street when our front door neighbor would grab my arm when I was one house away from my uncle, I would try to get away from him but he was a lot stronger than me and he was holding my arm with both hands. He would get me inside the house next to my uncle's and I would feel like I would be trapped there for a long time.   \nMy mom never like this house and I never liked this neighbor.\n\nHouse number 3, Dream number 3:\n\nI think I was around 13 now. My mom and dad separated, I lived in 3 houses in a year, all 3 of them had their own recurring dreams.   \nThis house was a good house, we had to move in with my grandpa and everything there was good. The school was nice, the neighbors, it was next to a park and it everything was going well.  \nOn this house, my recurring dream involved the past, before I we arrived at that house. I would explore it like I was a ghost, there were a couple of people at the dinner room eating while a old man would read the paper with strong black framed glasses, a skinny woman was in the kitchen cooking on a large pot, I would get the sense that she knew I was there but I didn't knew anyone who were inside that house. The best part was the backyard, this house had basset hound that I would play with and a caged green parrot. If I had to describe it, it felt like the 70s. \n\nIn the same year, we moved to house number 4, Dream number 4:\n\nThis house had a green front and was a two stores house, my grandpa moved in to fit us all better as my mom was still going through her separation. The dream I had was me and my mom were fighting and I would get out of her room where we all sleep in (which wasn't true in real life as this house I had my own room). The whole dream happened in the second store. I would tell my mom that I would sleep outside since we were fighting and I would sleep on the ground, next to the window as the street lamppost would clear the spot I was in. I remember being cold but I would sleep well, my mom would wake me up and convince me to sleep at the sofa from that living room.   \nSince we didn't lived long in that house, this wasn't as recurring as the other ones but I'm sure it was a recurring one.\n\nThe last house we moved in during the same year, House number 5, dream number 5:\n\nThis house was close to the two stores one so I wouldn't have to move schools 3 times in year, it was a small place just enough for us. I think we spent maybe 5 months or so there, here I would dream about a garden with a woman with long curly hair, her hair was black and long. This garden had a lot of sunlight, a lot of plants and it was a nice place to be in, this was the first recurring dream that happened in a place I have never been before or after. It had a lot of those common orange butterflies and she was always smiling. I would never really see her face enough as her hair was in the way a lot but I also didn't know her. \n\nAfter this my parents got back together and we have only had two more places.\n\nHouse number 6, dream number 6:\n\nThis one happened as I was an adult and sometimes it was a lucid dream.  \nIt always started and ended the same way but it would sometimes last longer. It started with me and my mom inside a car, I was driving fast a bit apprehensive saying that we had to get there to our family fast. It was a zigzag road up a hill, on my right side, it was the ocean, sometimes I could see it like a drone. I could see it was a large hill, 8 stores high or so. At the bottom it was a boat dock, with a street that had white fences. When we arrived at the top, we would leave the car in a hurry and get inside a restaurant.\n\nThe layout of this restaurant was odd, it was like we got in through the back, probably where food was delivered. It was a large restaurant in a rectangle shape. For my pov, the left side were where the costumers ate, it had an industrial interior design and this place never felt like it was my country, maybe France, Italy or Greece. The place was packed and seemed like you would have to have reservations to eat there. The odd thing was they had this big tv screens, which usually aren't there in fancy restaurants. To my right, it was the kitchen, also packed, everyone cooking. One waiter, sometimes a waiter and a chef would stop us and say we shouldn't be there. My mom and I would be a little manic and try to tell them what happened when every tv would hit a breaking news announcement and tell everyone to evacuate. Some people would start to get out, leaving behind everything and some people would go stay and try to understand what the news were saying.\n\nFrom the opposite end to where me and my mom came in, it was the official entrance, they were leading towards marble stairs, they were probably 5 meters large and had two silver handrails. There was still a slope, so the hill we came in hadn't ended yet. A large amount of water would come down poring from it, all the way to the restaurant like an ocean of water, 2,5 feet tall, instantly becoming hard to walk, some people would fall and almost be taken away down the hill but people would stop that from happening. I would usually wake around here. \n\nThis was the only dream I would have be lucid. The last time I dreamed of this, it was a lucid dream. I remember \"becoming conscious\" during the part where we arrived at the restaurant. The one that stood out the most was when the waiter and chef came to stop us and I would tell my mom \"Go up the stairs, I'll go right behind\" and this was the first time in the dream that we got separated. I knew that the news would go off pretty soon and right after the water so I was in a bit of a rush but I was also aware of it being a dream so I wasn't worried. I go inside the kitchen and there's a wall of wine bottles, I pick to of them, have one under my arm and one I'm holding. I go to the front of the restaurant and my mom is middle way through the stairs, we had never gotten past that point before. She's waiting for me, I'm holding the handrail and have reached her when the news break in and I think \"Here comes the water\" so I start to walk faster and my mom goes faster too so we are going at the same speed. The water appears and it's a lot less than usual, I think in my dream that this is odd. We keep going and for the first time I can see the top of the hill, I can see it's a city, I can see it's a street that looked to be downtown, tons of stores all looking expensive. There's people running to their cars and dark clouds all over the place. As I'm about to leave the stairs I see a big wave, big enough for me to know that we won't make to the street, that we will fall down the stairs and back into the restaurant, and I think \"There it is\". As I'm hit I got awaken by it.\n\nWe moved out of house number 6 last April, I haven't had any recurring dreams since. \n\nThis is already long enough but here's the answers to a couple of possible questions, I'm also open to answer anything you have for me:\n\n* I'm 100% sure they're dreams. Some of them that were in the existence of the houses I was at never happened in real life. I'm 100% sure they're neither repressed memories or repressed trauma. \n* I'm also sure they're a recurring, they can happen both very often and very apart like months or so but when they do, I know I had them before, it isn't a deja vu, it's a certain because I tell my parents everytime they happen. I've been having them since I were a kid so they are aware of them and can confirm that they happened multiple times. \n* I have never dreamed the same reccuring dream once I moved house. For some reason, the recurrance aspect comes back but never the same dream like they're bound to the house. \n* Is it possible that I had recurring dreams in hotels or someone's place if I stayed there? I mean, yeah but I haven't really spend a lot of time in someone's else place for me to have them or be aware that I'm having them. \n* Do I like having these? Yeah, even when they're nightmar-ish, I wake up knowning it's a dream and there's nothing much I can do about but it's cool to wake up being like \"Oh, crazy, happened again lol\"\n* Why are you posting on paranormal? Because I don't think it's normal and while people do have recurring dreams, I have never heard of anyone having them the same way as I do.\n* Is this fake? No, they're real. I can't explain why really but it is real.",
        "created_utc": 1673650505,
        "upvote_ratio": 1.0
    },
    {
        "title": "HAUNTED HOUSE EXPERIENCE, HOME BUILT ON INDIAN BURIAL GROUND. Demonic or Poltergeist?",
        "author": "Designer-Stable6209",
        "url": "https://www.reddit.com/r/Paranormal/comments/10b6ip5/haunted_house_experience_home_built_on_indian/",
        "text": "Apologies for the length of this! I don’t think I could do this story justice with brevity. Also apologies for any mistakes/typos I make, I’m a terrible proofreader. \n\nFrom the age of 14-19, now (f/25) I lived in a haunted house. It all accumulated one night to a terrifying event. But before I get to that.. Here is some context, the house was built in the 1970’s by owner’s of a local funeral home. This most likely has nothing to do with the haunting, as many people work in the death industry but it is a spooky fact. The house and the surrounding community was built on a Native American/Seminole burial ground. Unlike the majority of Florida, this community was characterized by sloping hills. These mounds were evidence of the Seminole burial ground beneath. I can attach links to articles verifying this, if anyone is interested. It is also a wooden stilt home, built essentially on top of a canal system, leading to the river, and eventually the Atlantic Ocean. Part of the home's structure actually had pilings that went into the water. I mention this since I’ve heard both water and wood can contribute to keeping spirits in. \n\nWhen we first moved in, the signs of hauntings were less tangible. But there was always a weird eerie feeling in the house, a feeling of darkness and being watched. I remember being terrified of going to grab a glass of water in the night, always feeling a presence around me. And it felt like this presence wanted to cause harm. I also remember in the early days, a large fear of the closet in my bedroom. Something about it felt dark. I would often run into my parents room to sleep with them out of fear, at an age that definitely could be considered too old for that lol. \n\nThings really took a turn for the worse after my parents remodeled the home about 2 years into living there. Although they painted the wood white, and put in a bright and modern kitchen - the energy in the house became much darker. This is where the clear signs of the haunting began. My dad traveled often for work, and the events seemed to be more prevalent when it was just my mom and me there alone. There were many times, when you were home alone and would hear loud stomping footsteps upstairs. We had 3 large slider doors upstairs that led to a large balcony, we always made sure to lock each of them before going to bed. We would always ensure that they were locked, and communicate about this - especially if my dad was traveling as we were two ladies alone and wanted to make sure we were safe. On a few occasions we woke up to find that each of the slider doors had been opened to the exact same distance. Eeek! There were also events where people staying in the home would have the exact same, bloody and scary nightmares. Also our two large dogs would bark incessantly and growl at nothing. \n\nTo me, the scariest recurring event was the doorbell rings. We had a new doorbell system installed when remodeling (the doorbell did not previously work). Our doorbell played a fun little modern tune when it rang, think “do dee de lee do dee”. It came with this preset sound, and it was not something we could customize. On occasion, it would ring, but not with the sound it normally rang with. It would sound out a loud vintage sounding, “DING-DONG”. And each time this would happen, no one would be at the door. This event often happened later in the evening, when we were settled in watching television or I was doing homework. Or it would happen in the middle of the night at 3am. Consistently it happened at exactly 3am. I would say this event occurred maybe twice a month, always the same “DING-DONG” would reverberate through the house, and no one would be at the front door. \n\nFast forward, a few years later, with all of this activity still active and increasing. I was away at college, living in a dorm, and only returning to this home on long weekends, holidays and school breaks. I LOVED dorm life, and was shocked how different and safe I felt, being away from this house. While living in a haunted house, you really begin to normalize being afraid, and it feels like a huge weight being lifted when you’re out of that setting.\n\nOn the night in question, I returned to the house, it was a long weekend in the fall. Everything felt generally normal, and I went to bed after visiting with my parents - until I was jolted awake at 3am by the familiar “DING-DONG” sound. Except this time, after maybe 30 seconds, it rang again, “DING-DONG”, another 30 seconds went by and then a third “DING-DONG” sounded through the house. It had never done this more than once in a row.\n\nThis was not something that could easily be ignored, I walked out of my room confused and scared. Both my parents did the same thing, and we met up sleepily and spooked in the living room. There was this tangible feeling in the air of some sort of presence, a sort of static feeling surrounding us. As it was late at night and all the lights had been turned off. We stood in the living room as we saw a lamp near us turn on. As suddenly as it turned on, it turned off and the lighting fixture above turned on, then off. Then the lighting fixture next to that one did the same. The lights moved in a circle around us, speeding up as they went. This continued for maybe a full minute, then for a brief moment every light in the room turned on, a bright flash. Then there was a loud banging sound and every light turned off. Stillness. It was over. \n\nI went to my parents room after this event and cried myself to sleep in terror. \n\nI left the next morning to go back to campus, with no intention of ever returning. Whatever was in that home felt dark, and angry. Within the next few months my parents sold the home.\n\nWhat do you guys make of this? A typical poltergeist, or something dark? I’m curious to hear!  Thank you for sticking it out until the end. ",
        "created_utc": 1673646326,
        "upvote_ratio": 1.0
    },
    {
        "title": "This happened to me today.",
        "author": "Lando562",
        "url": "https://www.reddit.com/r/Paranormal/comments/10b5ijs/this_happened_to_me_today/",
        "text": "I didnt feel unsafe maybe because I just dont have much emotions nowadays but this morning i was woken up randomly. As soon as I woke up I felt pressure being relieved from my feet as if someone was sitting on there but I didnt feel anything on my feet rather the area where my feet were lifted up and I believe I may have had a pillow on them so I dismissed this. I went to the bathroom and coming back I got my puppy (9 weeks) and let him up to sleep with me in my arms because he always wants to but I sometimes dont let him but did because of that weird thing that happened. He fell asleep in my arms first and then I fell asleep a few moments later he woke me up he was trying to get my attention to wake me up feels like and was scratching my face which hes never done when hes slept there. Again I tried falling asleep the same way and wrote it up as nothing and waited for him to fall asleep again after readjusting him and then falling asleep myself a little after. Little after closing my eyes the second time he wakes me up again trying to get my attention and this time I figured something weird was going on but didnt connect everything until the fourth time. I tried going asleep a fourth time this time it was a little over 5 am and I had let him down so he could roam around. I dont really remember the fourth time what woke me up clearly but it was definitely on purpose just like the other times and it may have been knocking or some shaking but as soon as it happened as I closed my eyes yet again I instantly got up and left the room because I knew whatever it was did not want me sleeping. However I felt nothing malicious and have felt similar situations before but I figured this was extremely weird and not coincidental. I had prayed before any of the events asking for god and his angels, my ancestors and my dad to watch over me from any evil trying to get at me and I had never done that specifically. I had also just remounted a tv in that room that night on the wall and had heard before its possible for black mirrors aka tv screens to be portals which made me even more paranoid especially this happening on friday the 13th. \n\nDoes anyone know what possibly this could be? Good or bad? Is friday the 13th a day where spirits have more energy? Could I have been getting warnings for something bad possibly going to happen?",
        "created_utc": 1673643900,
        "upvote_ratio": 1.0
    },
    {
        "title": "My experience with shadow people.",
        "author": "NaturesDarkness",
        "url": "https://www.reddit.com/r/Paranormal/comments/10b50d4/my_experience_with_shadow_people/",
        "text": "I am new to Reddit and this is the first time I’ve ever shared this experience openly. This all started about 9 years ago. I was in high school when I was exploring and questioning spirituality, religion and all things in between. I was raised in a religious but split household and wasn’t sure what to believe at this point and I had began having some supernatural experiences that I didn’t understand, small things like doors moving by themselves or something moving across the table. I was freaked out a bit but more curious then anything so I started doing some research into demons, ghosts, the occult you name it I was reading about it. Over the next 6 months of these happenings things got progressively worse to a point that I didn’t believe possible. I had begun feeling sick and depressed like there was a storm cloud over my head and it started effecting my schooling, social life and seemingly every corner of my life was changing at horrifying rate. I was willing to do whatever it took to prove that this was all in my head between going to churches, talking with friends and in hindsight I made some substantial mistakes as well in my efforts to understand what was happening including a ritual of sorts that only made these things more real. I was in my bedroom when I first saw one. Like many other nights during this time I was up all night and a bit sleep deprived when I noticed a dark presence that sent chills down my spine. I had tunnel vision as my eyes connected with what I can only describe as a sickness cloaked in the deepest darkness I have ever seen. It took every ounce of my being to snap back to reality enough to let my flight instinct take control so that I could escape. I fell into a panic trying to comprehend what I had just seen. At this point I had ran to the shop in the backyard where I would go to escape day to day life and spend time with my friends as a hangout spot. I was experiencing a level of fear that I had never known before. I called my cousin to come pick me up and he spend the rest of the night trying to calm me down and help me relax. It was morning when I was finally returned home. I spend the day smoking cigarettes in the shop and racking my mind on the night before. To my unfortunate surprise this was only the beginning of a series of encounters with these things. I plan on sharing more of these encounters but for now I’m going to leave it at this. Please if anyone else has had an experience like this one let me know, Thanks.",
        "created_utc": 1673642695,
        "upvote_ratio": 1.0
    },
    {
        "title": "Astral projecting and Sleep paralysis plz help I'm so scared",
        "author": "Picklemuffin00",
        "url": "https://www.reddit.com/r/Paranormal/comments/10b4p99/astral_projecting_and_sleep_paralysis_plz_help_im/",
        "text": "[removed]",
        "created_utc": 1673641937,
        "upvote_ratio": 1.0
    },
    {
        "title": "Something takes over but what",
        "author": "little_regresser",
        "url": "https://www.reddit.com/r/Paranormal/comments/10b4n65/something_takes_over_but_what/",
        "text": "At times it feels like something is screaming and trying to break free from inside me. At other times I black out and don't remember what I've done or said during the blackout. My daughter says that my voice changes to a voice that's way deeper and doesn't sound like me at all and she says that around me everything gets dark and it feels like all the happiness is sucked out of the room I'm in when it happens. I don't remember when it happens. She says that whatever it is that takes over is scary but she doesn't think it would ever hurt her. What could this be that happens to me when I black out?",
        "created_utc": 1673641804,
        "upvote_ratio": 1.0
    },
    {
        "title": "My first encounter with a ghost/spirit last night... Quick post.",
        "author": "glane7",
        "url": "https://www.reddit.com/r/Paranormal/comments/10b3ldr/my_first_encounter_with_a_ghostspirit_last_night/",
        "text": "I'm walking home from work and as soon as I see my house i notice something. As soon as I can see my house I notice the driveway light is on. Strange I think and not even seconds later the light turns off. My driveway light is only activated by a light switch inside the house. I walk in and I immediately get this sense that I am not alone. Like someone was with me but I couldn't see them. I never have been one to believe in the paranormal but now I can't ignore it anymore. Also someone did die in my driveway...",
        "created_utc": 1673639233,
        "upvote_ratio": 1.0
    },
    {
        "title": "Should This lucid dream be considered paranormal",
        "author": "ryuuunoken",
        "url": "https://www.reddit.com/r/Paranormal/comments/10b1pu1/should_this_lucid_dream_be_considered_paranormal/",
        "text": "\nI’ve had long history of nightmares and lucid dreams and recent one was terrible… I’m on my bed as if I woke up too early and notice my sheet stretching upward to ceiling as if a poltergeist was standing between me and the sheets, first I don’t notice this but after while I feel my chest heavy as there’s heavy object on my chest and I can’t breathe, I turn to my right and take off sheets and see a tall humanoid figure with goat head wearing white suit it looks at me and I can’t move nor breathe, it starts getting closer to me and it had long pointed fingers and when I try to move away it stab me through my ear with it’s pointed finger, I jumped right out of bed trying to catch a breath and find myself drenched in my own sweat, it was few nights ago and it’s freaking cold when I stay, this I second worst after the drowning dream….",
        "created_utc": 1673634668,
        "upvote_ratio": 1.0
    },
    {
        "title": "Things moving abnormal",
        "author": "yungkael",
        "url": "https://www.reddit.com/r/Paranormal/comments/10b0us0/things_moving_abnormal/",
        "text": "[removed]",
        "created_utc": 1673632581,
        "upvote_ratio": 1.0
    },
    {
        "title": "The weirdest thing ever!",
        "author": "Foreign-Office-64",
        "url": "https://www.reddit.com/r/Paranormal/comments/10az5mn/the_weirdest_thing_ever/",
        "text": "This is a hard one to explain but I'm gonna try do my best!\nJust so you know, I'm someone who has had my fair share of paranormal in my life. I've seen many things that many would never believe. I've experienced fear in many ways. I've seen acts of greatness and things I myself find impossible. But here we are!\n\nSo, I'm going to tell you a story about something that happened to me only two days ago. Before that tho, a bit of back story to get you a bit in the scene.\n\nI have seven little brothers and two little sisters. My family is pretty big all round. Along the way, you meet people who are family to you even without blood. Years ago, I met someone I consider as a cousin to me due to the relationship his mum and my uncle had. To his day, he is a great friend. So he is always family to me. Now he is a grown man with full custody of his son. This isn't his only child, but he dedicates all his time to his son. From the moment I met his boy, I have adored him. In a way, he reminds me of my own son. See, his boy has autism, just like mine. His boy is also hard for people to understand a lot at his young age, just like mine was when he was younger. He has an energetic vibe and is very curious. Since my son's mother and I have split, I haven't been able to see my son much so seeing my friend's son was always a bit of a cheer up for me for a bit. It just reminds me of better times with my boy. The main thing I'm pointing out here tho is how his son was around people. Full of energy and curiosity. Hard for anybody to understand. His own father could only make out about half of what he could say on a good day. He has been like this the whole time I have known him. Just a young four year old autistic boy. \n\nSo two days ago, my brother and my friend decided to come wake me up and drag me out. They wanted to go to the river for a swim, so the plan was to go down to the river and cool off a bit. We would take some drinks, (alcoholic obviously) and some snacks and drinks for the young fella, and my friend, my brother and I would smoke some weed and go for a swim. I personally didn't feel like swimming tho, so when we got there, I decided to just sit on the river bank. My friend, my brother and my friend's son all went for a swim. I sat here just sipping my drink, yet I kept a close eye on my friends boy. He was young but wasn't afraid of the water one bit, which kept me on edge due to past experiences I've had with my own son. I kept reminding my friend to watch him. That it was too far out for him. That the current will pull him away. I was also a bit concerned because I had also seen evidence of bull sharks in this same fresh water river, so I was a bit of a worry wart. After a while tho, I became to calm down a bit because things were going ok. My brother and friend were throwing rocks and carrying on. The boy was staying close to the shore where I was hoping he would stay. I sat there for about an hour and a half before I was convinced by my brother and friend to get in the water. So I take off my shirt and walk on it. I realise the water doesn't get deeper where the current flows so I felt like a fool thinking it was too deep for the young fella, however, the current was stronger so I still suggested he stay close to the edge. I even made sure her had snacks ready and asked if he needed a drink before I went to walk out toward my brother and friend. I was about to step away when I heard the young fella next to me say something. Now, as I said before, he is very hard to understand, however, I clear as day heard him say these words. \"I can remember my past life you know?\"\nThis cought my attention right away. I'd never heard his say a sentence before so clearly. I turned and I said to him \"For real?\" And he looked at me and said, \"Yep!\" \nNow this is where it gets hard because for some reason right after our conversation, the memory started to get blurry. Things became hard to remember and hard to explain. But I will try anyways.\nSo, after he said yep to me, I was so intrigued that I sad down in the shallows near him. The point was to ask questions and see if I could learn anything interesting. I asked him pretty much straight away, \"So you're gonna forget all this when you get older?\" He responded with \"Uhuh!\"\nI then said \"So that's why you can't talk properly then I guess. So nobody can hear what you have to say?\"\nHe responds with \"yep! That's right!\"\nI felt bad for him instantly with this response, knowing all his knowledge and wisdom would just fade away over time. So I asked him how much of his past life he could remember, however, he shrugged the conversation away like he had no interest in it at all. It's hard to remember a lost of what was said exactly because, I dunno. It's hard to explain. It's like something doesn't want me to remember. But I will say this tho! I could clearly understand everything he was saying, even in his little boy autistic voice. It was infact a very intellectual conversation. I asked questions and he responded with full answers. As we sat her talking, he kept asking me to move bit by bit up the stream with him. \"Come over here and lay with me!\" \"Follow me!\" Or \"Come!\" Were the things he mainly said. But after a bit, he turns to me and says \"Come up here and let's go God Mode!\" \nThis was a weird moment for me. A part of me felt like I knew what he was talking bout when he said 'God Mode', but a still wasn't quite sure what he was saying, so I asked him \"What do you mean by God Mode?\"\nHe reacted with this noise of disapproval, kinda insinuating that I was being an idiot. He then says to me \"You know because you do it all the time! You just haven't realised it yet.\"\nAn inkling part of me seemed to understand what he was talking about then. Because of my own mental health issues, I live inside my head. My mind goes to places where I'm untouchable. I believe this is what he meant by God Mode. So he insists again \"Come on! Let's go do God Mode!\"\nSo I agreed with him. I moved along a bit closer to him, we both layed back in the water and I started to drift off into my mind. As I did tho, I could hear his start to swim away. I opened my eyes and called him out on it, to which he responded with \"No No! You go God mode! It'll be okay!\"\nEven tho, as we spoke, I could feel the presence of someone who was much older and much wiser than I was, I couldn't help but still see a little boy infront of me. So I would remain vigilant and keep on him about staying close to the shore. So instead of trying to swim away, he decided to come sit next to me again and talk some more. \nWe talked for a while and he says to me \"I want to take you to the door.\" \nWhen he said that, I had this vision of a dark steel door with a green glowing light shining through the gaps around the door. I said to him \"The Door?\"\nHe says to me after that \"Yeah! I want to take you to it and help guide you through.\"\nHe then says \"Come and I'll show you!\"\nThis kinda weirded me out a bit. It almost seemed a bit scary to me. I told him \" I'm not sure about that one.\" \nHe sighs with disapproval at me. The then said \"Come on! You're the one I chose to show!\"\nI then asked him \"well, why me?\"\nHe then respondes to me with something that really made me stop in my tracks. \"Because you're my Dad.\"\nI then said to him \"I am not your dad tho!\" I then pointed to his father and said that he is his dad.\nHe just looked away and said \"Yeah!\"\nI wasn't sure what to think about that part. Maybe is was saying that I was his dad in a past life or something? I really wasn't sure. I just didn't bring it up again after that. \n\"He looked at me and he said \"you're close but you're not quite there yet.\"\nI stood there dumbfounded for a bit after he did that. Like, I'm close but not quite there. \nHe then moved closer to me and climbed over the top of me as he played in the water. Even tho he's talking to me like someone who is much older and wiser, hr still played like he was a little kid.\nHe then said to me \"Why don't you love yourself?\"\nI looked at him confused, as if to say 'how could he know I feel this about myself?'\n(He then says to me \"You should!\"\nI sat there and thought about those words before we continued out conversation.\nWe, at this point, had moved back closer to where we started the conversation. I asked him if he needed a drink. He said \"Yeah! Just two bits!\" So I went and got the orange juice and brought it to him. I lifted the bottle to his lips and after he took his econd mouthful, I pulled it away, put the lid on and placed the bottle back up in the shade.\nI went back into the water and he said \"We should go down there and meet that person!\"\nI looked down stream to where he was pointing. It was across the stream toward a place where there was nobody. I asked him \"To meet who?\"\nHe said \"Just down there. We should go down there!\"\nI queried him again and then after that, he changed the direction he was pointing toward a couple a bit down stream who were fishing. I knew he wasn't pointing at them originally, but I played along with it. \nAfter a bit longer, I asked him about this 'door' that he mentioned earlier. Instead of talking about it tho, he said to me \"You should come unter the water with me!\"\nI asked him why and he said \"So you can meet my friends.\"\nI asked \"your friends are under the water?\"\nHe said \"Uhuh! I can hear them when I put my head under the water.\"\nHe insisted that I try, but I didn't try. I just watched him sinking his head under the water and coming up withing a couple seconds every time. \nHe then said to me \"You should come meet my friends! They will look after you.\"\nI looked at him still hesitant and said \"What if I don't want to meet your friends?\"\nThe then sighed loudly with disapproval again while rolling his eyes back. The then said to me in the next breath, \"You're all gonna die you know?\"\nThis startled me a bit, but I responded straight away with, \"Yeah! everybody does in the end.\"\nHe goes \"Yep!\" But a part of me could tell that that's not what he meant. It's like, he knows what's coming or something. \nI then told him that I'm going to tell his dad all about what we have been talking about. He said \"No! Don't do it!\"\nI asked him \"Why not? This is incredible and he should know.\"\nI then called out to his dad. I told him that I needed to talk to him about what his son and I had been discussing. I said to him \"You are not going to believe a word of what I have to say!\" \nHe called out \"What is it?\"\nI said to him \"He can remember his past life.\"\nAs I said these things, his son started to play in the water and gets bit of distance from me, so I called him out Infront of his dad. \"You're gonna play dumb and pretend this didn't happen aren't you?\"\nHe responded with \"Yep!\"\nHis dad went to ask me about it but I told him we would take about it a bit later. \nAfter a bit, he's come back and we are talking again. I asked him why he doesn't talk to his dad about it. He looked down and shrugged his shoulders, like he was unsure about his dad knowing anything. \nI told him \"You should! You should let everybody know. Wouldn't it be something if you could share two life stories?\"\nHe then says to me \"Two? You mean three!\"\nAs soon as he said it, I called to his dad \"He can remember two past lives. Not just one.\"\nAgain, he reacts as if to say he doesn't want me saying these things to his dad.\nI asked him \"Why are you talking to me tho instead of your dad or somebody?\"\nHe then said to me \"Its because I want you to be my bro. I need a bro so you be my bro!\"\nI immediately felt for him when he said this. I mean just imagine being able to remember your past two lives. You're trapped in the body of a small child. Everybody overlooks you. Nobody takes you seriously. Nobody listens. You're always told what to do and where to can go. He must feel trapped. He must get lonely and bored. \nI said to him that I'll happily be his bro. We then fist bumped. \nNot long after, his dad and my brother both come back over to near the shore. This is where I tried to explain to his dad what we were just asking about, but as I was trying to do so, my memories started to fade right away. I told him that it's going fuzzy so fast. I realised that it's not meant to be a story that's easily told as I tried to first tell it. It's one of those things we aren't meant to know. \nAfter yelling him what I could recollect at that point, he tried to take his son over to the middle of the river and ask him about it. He asked if his son wanted to all to him. But he didn't want to open up. He just played along in he water like the son he always knew. \nAfter this, I've noticed the young fella is going under the water again. Only he's coming up with a mouthful of water and he's choking on it. I've pointed this out to his dad. His dad said \"yeah! He does stuff like that all the time.\"\nAfter a bit longer, my brother and his dad climb out of the river, I'm starting with the young fella still talking to him. Still in the most intellectual conversation I've ever been involved in all my life. \nHis dad calls out that it's time to go. I look at the young fella and say, \"You ready to go bud?\"\nHe goes, \"Not yet! It's not safe!\"\nAs he just finished saying this, I saw his dad out of the corner of my eye stumble backwards up the hill.\nEven those the ground was hard to walk on and was on a steep angle, I could tell what the boy was thinking. His dad might just be a bit too drunk or atoned to drive us home safely. So when his dad called out to hop out again, I said to him \"No!\" I told him that his son isn't ready to leave yet. \nHe said, \"Ofcoarse he doesn't!\" As he laughed but I insinuated that it was serious. So, hearing what I had been telling him about the conversation so far, he and my brother decided to stay around a bit longer. They jumped back in the river and went back to throwing more rocks. \nI then asked the young fella \"You can tell something bad is gonna happen can't you?\"\nHe just nodded as he stared down into the water. \nWe talked more. At this point we had been talking for atleast 2 hours. I had been asking about how hard it must be being being a child with his mind. \nHe said that I have no idea he said these words exactly \"I want to get high so badly!\"\nI kinda giggled but I also felt so bad for him. Seeing his dad and his dad's mates smoking bongs together. Yet he is only a little kid so there's no way that's happening. Sorry Buddy!\nHe then went back to dunking his head under the water. He would come up with a mouthful of water every time nearly. It is almost like he is deliberately trying to drown himself. I try to stop him and I asked him why he keeps doing that. \nHe then said to me, \"I don't wanna be here anymore!\"\nThese words are heartbreaking for me to hear. A little kid who has given up on life? That sucks. So I asked him why. \nHe said to me \"it's because of you guy!\"\nI kinda got what he meant by that. I asked him, is it because we are boring?\nHe said \"Yeah! And I don't want to be here anymore!\"\nHe then said to me \"I wanna go be with my friends!\"\nI asked \"your friends you can hear under the water?\"\nHe said \"Yeah! I can hear them calling me when I'm under the water. I want to go be with them. It's a peaceful way to go.\"\nThese words were not only freaky to me, but also very heart felt. It made me realise that I know how he feels. I have felt for a while now that I don want to be here anymore. I feel I'm ready to move onto the next big thing. I feel there's nothing left here in life for me. \nAs for him, a wise wise soul who is trapped in a four year old body, he is someone who knows what is gonna happen next. He somehow has seen here out future lies I believe. He doesn't see the point is staying here until the end. I also felt that's what he meant when he said to me earlier that I'm not quite there yet. Like I feel ready to move on, but I'm lettng my earthly ties hold me to this place. \nAll I could do tho, even tho I felt how he has, I try to convince him that he can't just do that. People love him. He has to be strong for those around him. He sighed again tho, as if to say that I've got it all wrong.\nI told his father about this conversation aswell immediately right Infront of him. \nAfter talking. Little bit more, all the sudden, I hear an unknown voice from right behind me. I turned to see a man sitting on a horse right near all of our stuff. It was startling, as if he just appeared out of no where. \nHe was calling out my my friend and my brother, yelling at them because of hem throwing rocks at the bottom of the bridge, trying to know the flood debris down. Between my brother and this guy, things started to get a little heated so I had to call to my brother to just drop it. My brother and friend climbed out for the river again and started to take to this guy. He started talking about weed and other tuff with my brother and mate. He even offered them a cone to which the agreed. I sked the young fella if he was ready to hop out yet. He said to me \"No!\" He then looked at the guy on the horse and said \"He's the Devil!\"\nWhen he said this, I just said \"Ok?\" And I left it at that. \nAfter a little while longer, his dad starts to push for us to go again. Again the young fella wasn't interested in leaving, but after a while, I insisted to him, \"You know your dad is the one who is saying it's time to go, and one thing we are always taught is to respect our father. Right?\"\nHe reluctantly agreed. We then jumped out of the water. It didn't take long before he, his dad and my brother were disappearing up the hill toward the car. Meanwhile, the guy on the horse was taking to me. He offered me a cone, and I accepted. It was pretty good weed. My tolerance is really high so I didn't mind it. He then talked about the rubbish people leave laying around down there, and after I moved a couple things for him and I gathered upa. Heap of rubbish, including some that belonged to us, I tried to all toward the car. This man just kept talking to kw tho. He asked about darts, which I played as said he should come check out because he used to play. I wasn't trying to be rude but I had to go. They were waiting for me. \nI then got to the hill and I forgot my way up the path to get to the car. Then I realised I didn't have my keys or smokes. I went back over to look for them just after the guy rode past me on the horse. He was talking tlikw he as talking to k still, but he rode past without looking at me and when I responded to him, he just seemed to ignore me and keep riding. \nI searched for my keys and couldn't find them, so I worked m way up the hill to the car with all excess rubbish I had picked up. Luckily they had grabbed my keys and smokes wen they had left. \nBy this time tho, the young boy was int he car, strapped in, not saying a word. Infact, he was silent all the way home. \nThe next day, which was yesterday, I got in contact with his father to discuss what was being said a bit more. I told him everything I could remember of it, other than the fact that his son told me that I was his dad. I didn't want to mention that part yet. I mean, especially to his father. So I left that little bit out. But when I called, he was actually more intrigued than he seemed the day before. I don't know if he took me seriously or not when I told him, but he was definitely taking me more seriously now that we were talking over the phone. \nHe told me that that morning when he woke up to his son, his son was telling him three different stories. He told me that he cannot remember a single bit of any of these stories. It's like it's all fuzzy and blurred out. What he can remember tho is how something that was said in these stories spin him out. How he thought right to what I was telling him the day before. He started to realise about his son remembering his past life. But fe some reason, it's likw the memories over he conversation were being washed away or something. \nIt's exactly how I felt. When I first went to tell my friend about what his son and I were taking about, immediately I could feel the memories going fuzzy. It's almost like, something doesn't allow us to remember. \nMy friend and I also went on to discuss the things we had already discussed the day before. About God Mode, The Door, how we were all gonna die, how he doesn't want to be here anymore. My friend went on to tell me how his son has always loved the water but he has always swollowed it and has had troubles in it. It kinda ties in with what I was saying about how he's deliberately trying to drown himself. \nI then went on to say to my friend that I'd like to try talk to him again. He said to me that maybe it needs to be one on one for him to want to open up. \nI said to him that I want I know about the door tho. I told him that I'm going to ask his son if he will lead me to it and show it to me. If he will help guide me thu as he had already offered me. I am going to tell him that I'm ready.\nHis father and I are supposed to meet up in a couple of days from now.\nI have so many questions and thoughts. I don't know he will even remember the conversation we had, let alone if I'll even be able to understand him again. I'm hoping that he does tho. I'm hoping that he can show me where my next step should be. He said I'm close but not quite there. He knows I'm ready to move on. I just haven't gotten to the level of wisdom he has yet. Perhaps this is all just something to hats gonna make me look or sound crazy for the rest of my life, but I admire this kid. He has tougher me things about stuff that most people alive could never understand. Yet at the same time, he's left me wondering. He's left me curious. So when I go see him, I'm gonna ask about going through the door. If he agrees, I wonder where he might take me. I wonder where this door could possibly lead to.",
        "created_utc": 1673628412,
        "upvote_ratio": 1.0
    },
    {
        "title": "Buy Verified Paxful Account",
        "author": "rf287576",
        "url": "https://www.reddit.com/r/Paranormal/comments/10ay86e/buy_verified_paxful_account/",
        "text": "[removed]",
        "created_utc": 1673626106,
        "upvote_ratio": 1.0
    },
    {
        "title": "Experiences at my former work (long)",
        "author": "Grackle246",
        "url": "https://www.reddit.com/r/Paranormal/comments/10ay3fm/experiences_at_my_former_work_long/",
        "text": "[removed]",
        "created_utc": 1673625780,
        "upvote_ratio": 1.0
    },
    {
        "title": "Wierd lights and sounds",
        "author": "Fun-Cheesecake-3941",
        "url": "https://www.reddit.com/r/Paranormal/comments/10axfsz/wierd_lights_and_sounds/",
        "text": "I don't know a huge amount about ghost lights, I was hoping someone could explain it a bit better to me. \n\nYesterday afternoon my partner was asleep, I got home from work early and was pottering around doing washing up etc, when I heard a very strange noise, the best way I can describe it is like a dog clearing it throat, a big dog, like a gutteral kind of choke, idk it's hard to explain, but it sounded huge and right behind me. We have a kitten but I've never heard anything like that come from it. Needless to say there was nothing behind me.\n\nThen last night, roughly 5.30 am, the light came up the stairs. It was like someone walking up with a phone light on, But as the light came around the door of my bedroom there was no source of the light, no torch, no orb, nothing. But I can clearly see the reflection from the light on objects in my room. It looked just like someone shining a phone torch to light Thier way in the darkness, a little bit like when a car headlights shine through a curtain and it travels around the room. but there was nothing there at all, no cars, my partner and daughter still fast asleep. The light came all the way around the room to my side of the bed before going dark. \n(Were pretty sure there's something/someone in our house, 1860's, built on an old brickyard, and we have an Anderson shelter in the garden. Rather the house is very connected to its age if that makes any sense?)\n\nFinally today I'm stood at work (roughly 5 miles from my house) everyone else was in a completely different part of the building. And I hear the same noise as yesterday, the same deep rasping.  I had chalked it up to being our cat, maybe where he was in the kitchen aplified the sound of the cough? But to then hear the exact same noise, miles away from my house has fully freaked me. \n\nWe did used to own a very large dog (American staff/mastiff x) he was put down before my daughter was born, but his collar hangs at the top of the stairs and the area around it is always cold. Could that be connected?\n\nAnyone got any ideas?",
        "created_utc": 1673624150,
        "upvote_ratio": 1.0
    },
    {
        "title": "I have a theory that djinns , demons and skinwalkers are the same entities",
        "author": "SicMundusCreatus_",
        "url": "https://www.reddit.com/r/Paranormal/comments/10ax48q/i_have_a_theory_that_djinns_demons_and/",
        "text": "To those, who have never heard about them, it might feel a bit uneasy to hear that there is an entirely different species living among us acing us in matters pertaining to physical strength. I am talking about “Djinns”, pronounced as ‘J-ins’. A creation much attributed to exist in Islamic folklore even though they have existed way before the advent of Islam.\n\nWhere are they now?\n\nDjinns have long been here since before humanity even set foot on this world — you gotta shake off the whole “theory of evolution” to absorb this. Living in clans and colonies, they used to roam the continents salvaging the resources of Earth. Until humans arrived. According to Islamic religious texts, djinns were concealed from humans and instructed to live in mountains, valleys and all the places of wilderness. They were made to leave all other places for humans for they were decreed to dwell on Earth from hence forth. According to some sources, human eyes have a membrane that prevents us from seeing them at will.\nDjinns still live among us concealed from our vision. On the contrary, they can choose to reveal themselves to us at will ( not fair right? ).\n\nWhat do they look like?\n\nAccording to Islamic religious texts, humans were created from clay whereas the entire species of djinns were created from ‘smokeless fire’. They are formless creatures since fire cannot be molded into a definite form but they can assume any shape and form. While we humans take pride in our intellectual abilities, the unique abilities of djinns include their strength. Djinns are mighty strong and have great heights. Their facial features vary in various races — yes, djinns have different races among them too! One common physical feature is that most of them have hooves instead of regular feet and horns on the top of their heads.\n\nDo djinns possess supernatural powers?\n\nApart from enormous strength, djinns also have supernatural powers. Of which one is of course shapeshifting. They can transform themselves into any shape or form. Based on accounts of Muslim scholars of Baghdad and Cairo from 11th century, djinns mostly assume forms of snakes, lizards, dogs or other canines. Some djinns have abilities to control weather over a small area , summoning storms and lightening. They are said to have the ability of moving extremely fast, covering hundreds of miles in seconds!\nThe most disturbing fact is that djinns can possess human bodies — yup, folks you gotta watch out for yourself.\n\nAre Djinns immortal?\n\nSeems like even after all those perks, djinns do have weaknesses. The greatest of them being death itself. Djinns have been known to live hundreds of years (now vampires have a foe in town!). But they can be killed, they can die in fights and they can die of old age.\n\nHow do they live?\n\nJust as humans, Djinns have learned that by living together they can sustain themselves. Much like a normal human city or colony, djinns have their own cities and colonies in mountains, jungles and valleys. Nowadays, they are also often found dwelling in abandoned human homes. The fact that a house becomes “haunted” after being left uninhabited for sometime is because of the nomadic djinns who have taken over.\nDjinns have religions like humans, they have races as humans and they speak different languages just as we humans do. So you might encounter an immigrant Muslim djinn from Syria in the United States talking to an American djinn who is a Christian or a Jew — amazing right? Much like human interactions, djinns also interact and communicate with djinns of other regions. Exchanging goods and information. They even travel to each other’s places.\n\nWhat do they eat?\n\nAccording to scriptures, djinns eat charcoal or burnt wood. They also have tamed animals — which are definitely not your average cows, goats, camels etc. The djinn animals have been known to eat filth and animal droppings.\n\nModern paranormal activities and djinn\n\nNow that we have a background about djinns, you might as well try to fit this creation in modern definitions of cryptids, demons, ghosts etc. According to my theories and research, I believe djinns and the entity “demons” . Djinns also resemble the entities described in several Native American folklores such as the ol’ famous “Skinwalker”. Skinwalkers have always been seen as an overly large sized canine which we know is the form assumed by djinns. Most of other American legends such as the Mothman or the Wendigo might as well be djinns.\n\nBUT WHY AMERICA? North America was the last continent to be discovered on Earth. Before European settlers, North America was just plain wilderness with only a few native americans living there as compared to the vastness of the continent itself. Much of the space was ‘untouched’ by human hands which makes perfect sense as to why majority of this species would choose to inhabit the Americas.\n\nAs our numbers are increasing day to day, we have been provoking them by taking their territories, hence we find examples of curses over certain pieces of land in native american folklore which exist to this day. These places have all kinds of strange and paranormal phenomenon occuring there to ward off humans.",
        "created_utc": 1673623333,
        "upvote_ratio": 1.0
    },
    {
        "title": "I sometimes see paranormal entitys and poltergeists in my dreams",
        "author": "The_Big_Guff",
        "url": "https://www.reddit.com/r/Paranormal/comments/10awu9a/i_sometimes_see_paranormal_entitys_and/",
        "text": "Iv had this issue since last year and I always tell myself it's only a dream.\n\nThese dreams usually have 1 or more family member in it (not a deceased one) and feelings of dread, anxiety and fear are always present.\n\nI wake up feeling anxious and scared but not a single drop of sweat. I dunno if this is normal or not but I wanted to hear other people's opinions and story's. Also these \"dreams\" happen around once a week.",
        "created_utc": 1673622613,
        "upvote_ratio": 1.0
    },
    {
        "title": "All you need to know about Djinns/Jinns",
        "author": "Fun-Mall3477",
        "url": "https://www.reddit.com/r/Paranormal/comments/10awrm7/all_you_need_to_know_about_djinnsjinns/",
        "text": "So after three years of extensive research on paranormal phenomena around the world including cryptids and ufos, I have decided to publish my findings. Here in my first blog, I have started from jinns/genies as you might have heard about them.\n\nMy first blog post presents a summary on the whereabouts of these powerful entities. This is just the beginning, I will be publishing a lot of content based on paranormal across the world in which I'll be trying to connect the dots missing in the knowledge of these things. \n\nPlease have a read and don't forget to give your feedback. If you like it, you can give me a follow to stay connected for future posts.",
        "created_utc": 1673622429,
        "upvote_ratio": 1.0
    },
    {
        "title": "Famous watts murder house Colorado please help me understand",
        "author": "TheGingerNiNjA899",
        "url": "https://www.reddit.com/r/Paranormal/comments/10awkiu/famous_watts_murder_house_colorado_please_help_me/",
        "text": "So I’ve been doing some investigating tonight about the paranormal activity recorded in the house after the tragic events, I saw a reddit comment saying that in many photos you can see shadows in the window above the garage,  except on google maps the house has been demolished, but even weirder then that is so has like 4 other houses right next to it.  Is this something creepy and mysterious or a logical reason? These houses were massive and modern there wouldn’t be a reason to just bulldozer them for new houses.",
        "created_utc": 1673621944,
        "upvote_ratio": 1.0
    },
    {
        "title": "All you need to know about Djinns/Jinns",
        "author": "Fun-Mall3477",
        "url": "https://www.reddit.com/r/Paranormal/comments/10aw7jy/all_you_need_to_know_about_djinnsjinns/",
        "text": "[removed]",
        "created_utc": 1673620999,
        "upvote_ratio": 1.0
    },
    {
        "title": "Actress Joey King suffer mysterious blood illness during filming of The Conjuring",
        "author": "Hippydippy420",
        "url": "https://www.reddit.com/r/Paranormal/comments/10auiwn/actress_joey_king_suffer_mysterious_blood_illness/",
        "text": "Oddly enough, in the movie, the mother suffers from the same blood disorder.  I too had this mysterious blood disorder and, at the time I was living in a haunted house.  Link of Joey King’s story in comments.",
        "created_utc": 1673616437,
        "upvote_ratio": 1.0
    },
    {
        "title": "Street lights shutting off?",
        "author": "FartAss32",
        "url": "https://www.reddit.com/r/Paranormal/comments/10au2aj/street_lights_shutting_off/",
        "text": "Am i tripping? i often just notice street lights shutting off at peculiar times, its always as im leaving or as im entering a city/ town\n\nI dont see how theyd be motion activated as i would see it shut off as the other cars pass by, but its only at the exact moment i look in my rearview mirror that i notice it turning off\n\nI cant count on two hands how many times this has happened, so the chance for coincidence is pretty slim i would think",
        "created_utc": 1673615086,
        "upvote_ratio": 1.0
    },
    {
        "title": "New Netflix film on Allan Kardec",
        "author": "chmikes",
        "url": "https://www.reddit.com/r/Paranormal/comments/10aqs3p/new_netflix_film_on_allan_kardec/",
        "text": "I just saw that Netflix recently added the film \"Kardec\" to its catalog. Kardec is an important contributor to the study of spiritism. You can learn more on this person [here](https://en.wikipedia.org/wiki/Allan_Kardec) and his work [here](https://en.wikipedia.org/wiki/Spiritism).\n\nThe film tells his life story. You won't learn much about spiritism with it. \n\nIf you want to educate yourself on the matter of spirits, I invite you to read his books.",
        "created_utc": 1673603960,
        "upvote_ratio": 1.0
    },
    {
        "title": "saw a towel waved to get my attention. i was home alone",
        "author": "suspentacct9",
        "url": "https://www.reddit.com/r/Paranormal/comments/10aqqzj/saw_a_towel_waved_to_get_my_attention_i_was_home/",
        "text": "Title.  So's i don't know what to say about this. I don't believe in paranormal or glitches. I'm just doing my thing in this here life right, but,  this one occasion was just, i mean, it made me cry but i can't and won't admit it to myself that i was frightened. It's just not possible to happen. But, since I'm drunk right now I'm just going to let loose. I've only told this to my close family members and this one paranormal hotline person that dismissed me because they thought i was trolling them for whatever reason. Look, i refuse to believe glitches happen but this is just plainly unexplainable. \n\nThis happened about 6 years ago. It happened so randomly, and out of nowhere, it gives me the creeps just remembering this right now, i doubt I'll ever get an explanation in my lifetime about this no matter how much money i were to pay for this. It's one of those occasions that will last wonderful until my demise. Oh well. I guess. \n\nI used to live in a dual bedroom apartment with limited space, it was small. Upon entering this building there was a big closet to the left immediately after the entrance. To the right was the kitchen before a doorway like cutout and about a yard of wall from the door, (this is important). I was in the kitchen table eating, cereal to be specific. There were kids playing outside and i was home alone just like any other day. It was six years ago only, but all i did was either browse the web on my laptop or watch TV. On this occasion i was actually just eating my food and nothing else. I'm an avid day dreamer, as in, i dream about alot of stuff and just sort of space out on stuff on any regular day, I like to think of it as planning or call it what you want. But i do it even when i watch tv or when I'm working etc. When I'm bored i just do it. Well, this day was just a Normal day. It was about 3 or 4 in the afternoon and like i said, i could hear kids playing outside, nothing out of the ordinary. As I'm digging my spoon into some cereal, i heard what sounded like a loud thump coming from the closet.(Mind you, this closet is full of clothes, extra stuff from the house that couldn't be stored anywhere, shoes, blankets, files and books, etc. It had a top rack where there were plenty clothes stacked up that could've fallen and made said exact noise.) \n\nI thought nothing of it other than, \"damn a pile of clothes just fell off the rack and have now made a mess, something i have to clean up\". It was quite loud. It wasn't until it happened a second time immediately after in an unusually louder way that it just made me look up thinking wtf? When, and i swear to God I'm not making this up, i saw a purple towel being waved where whatever was waving it would have to be behind the yard sized wall before the kitchen cutout right in the entrance. There was nobody else in there with me. To this day i don't know what to make of this. Am i going crazy? I know it can't be a hallucination because I've never in my life taken meds even till this day. I blacked out for a milli second, next thing i know I'm standing and inspecting the area obviously to there being nothing there, no towel or nothing. I opened the front door immediately and tried to recollect what just happened. My spine was tingling like never ever before. I hadn't just hallucinated this but what the fuck was it? \n\nThe way the sound caught my attention was sort of violent. As in, what the actual sound was, was the towel itself being waved forcefully to get my attention, only to get my attention on the second try. I'm so freaking confused to this day and i have no idea what to think of this and i hate to classify with the rest of humanity who have shared alike unexplainable stories that just can't be possible. But it did happen and I'm not making it up. I'm not lying. It does happen. Stuff that just can't be explained does happen. I'm a big skeptic, and i claim to be fearless, i fear nothing, but this situation is unexplainable and weird. Wtf? Immediately after this incident i shed a tear because i thought i was losing my head, i was being haunted or i don't even know what, they were tears of confusion, it's such an extraordinary happening that i felt very vulnerable to stuff i didn't know and had no explanation to. I called a haunted hotline only to be hung up on because i was so distraught after just WITNESSING that, that i couldn't even make up an intelligible sentence. \n\nI'll never find out what the deal with that was. I've become even more fearless of \"glitches\" or stuff that isn't supposed to happen in this physical world. I have no words for anything like that. Like i said, I'm one of the world's biggest skeptics in unusual, impossible situations. I have to see it to believe it. It was presented in my eyes and i don't know what to do with it. It happened to me and i suppose it could happen to you too. Ever since then, i just, don't know. It messed me up. \n\nNot that it could matter, but, i feel like maybe i should mention for the believers that, my uncle was murdered about 4 months prior to this, just for the paranormal believers. Like i said i believe this has nothing to do with this obviously because it's impossible, life isn't a video game where stuff correlates with stuff to make stuff work. (If that makes sense), But, just so you can wonder. (Sigh) IDK.....",
        "created_utc": 1673603837,
        "upvote_ratio": 1.0
    },
    {
        "title": "Past nurse job of weirdness",
        "author": "EducatorAffectionate",
        "url": "https://www.reddit.com/r/Paranormal/comments/10aps1g/past_nurse_job_of_weirdness/",
        "text": "I worked as a nurse in an old person home where we had this lady who never ate or drank but lived forever. Talked multiple languages and talked weird. Always laughed and other people mostly came out crying. \nOnce entered and she told me who I was and talked bad about people I cared about. \nAlso heard the occasional moments where she bit people in arms hands and neck if you came to close. When talking about religion she laughed. \nIt was always cold in the room. And the door would close by idk reason every time you entered. Let me tell you these doors are heavy. \nYe everyone believed there was more at work here but higher ups never believed in the paranormal. \nI stopped working there then but heard from someone she died. \n\nAlso her neighbour never liked living there either. After the weird woman died her neighbour quickly followed too. And after that the 2 that came to live there after them also died one week after getting there. \n\nNever spoke again with anyone working there f that place. Scariest thing ever. \n\nAlso posted this as a reaction on a post somewhere in this group. Just thought I would also post it individually.",
        "created_utc": 1673600107,
        "upvote_ratio": 1.0
    },
    {
        "title": "Friday THE !3th Jan 2023",
        "author": "RepresentativeAd7523",
        "url": "https://www.reddit.com/r/Paranormal/comments/10aprbi/friday_the_3th_jan_2023/",
        "text": "[removed]",
        "created_utc": 1673600021,
        "upvote_ratio": 1.0
    },
    {
        "title": "With all the cameras these days, has there been a noticeable increase in captured activity?",
        "author": "GasRepresentative246",
        "url": "https://www.reddit.com/r/Paranormal/comments/10apeml/with_all_the_cameras_these_days_has_there_been_a/",
        "text": "Hey all, just wondering while watching a ghost show... has there been any noticeable uptick in capturing potential paranormal events now that so many people have cameras in and around their homes? Seems like a lot of paranormal encounters happen at just any old time in a house, wouldn't it be lovely to have some ready made evidence from your pet cam or something? Maybe the Ring cam captures a knocking ghost? I'd love to see any evidence out there captured by accident. I thought I may have had paranormal evidence for some loud bangs in my house, turns out my pipes were frozen and unhappy.",
        "created_utc": 1673598624,
        "upvote_ratio": 1.0
    },
    {
        "title": "Wife’s doppelgänger",
        "author": "GardenOk6074",
        "url": "https://www.reddit.com/r/Paranormal/comments/10aoy68/wifes_doppelgänger/",
        "text": "Greetings reddit.\n\nLet me start off by saying that this is my first ever post to reddit, so forgive me if this is written a tad awkward.\n\nThis happened around 2021, I can’t remember the month but I’d say mid to late 2021. My partner and I live in Australia, at the time we were renting my partners grand parents home from them as they were both put into elderly homes, because they were unable to care for themselves.\nMy partner was working as an EN (enrolled nurse) at the time and usually got back around 7pm every night. I however did night shifts at a fuel station but had the night off.\n\nNow here was the structure of the lounge room layout, the room was a rectangle and the north side was all windows which looked out at the front patio area, which you would have to walk up the drive way and directly past the front window to reach the front door. Once you walked in the front door you would then turn right to enter the lounge room where I currently was. So basically you couldn’t be not seen coming up to the front door if someone was in the lounge room as the sofas were along the south side of the room facing the windows.\n\nI was watching dragon ball super in the lounge room at around 6:15pm, I had the lights off and could see out the front through the gap in the curtains (which was about 1.5 feet wide) it was still kind of light outside at that time.\nThat’s when I heard the distinct sound of my partners feet walking up the gravel drive way, open the gate, and begin to walk past the front window.\n\nI remember thinking “wow she must have got off early tonight”, anyways, I saw her walk past the front window through the gap in the curtain. But after about 1 minute of no noise, I began to wonder why she wasn’t coming in the front door. It was as if she was standing at the front door doing nothing. So I got up and wandered up to the curtain to peek out at the door to see what she was doing, and to my surprise.. she was not there. \n\nAs I was pondering what just happened, I heard footsteps walking down the driveway and to my bewilderment.. it was her.\nI said to her when she came in, “did you forget something in your car?” She replied, “no, I got off early tonight..why?”\nI didn’t say anything… \nThere is more to this but this was the first thing to happen, and the creepiest. \n\nAnyways thanks reddit 🙏",
        "created_utc": 1673596889,
        "upvote_ratio": 1.0
    },
    {
        "title": "Dog seeing something i can’t see ?",
        "author": "Unique_Sign_9300",
        "url": "https://www.reddit.com/r/Paranormal/comments/10aovz2/dog_seeing_something_i_cant_see/",
        "text": "hi! so today, my 4 month old maltipoo started barking out of nowhere. he only barks when he meets new people, and he just kept barking at our dining table for so long. first my dad saw him do that and he was like “hey what’s wrong”, “there’s nothing there, come here” and etc. and this was not the dining table where we normally sit and eat, it’s in our other living room which is more for guests and stuff so my entire family was in our other one, not the one my dog was barking in. so since he was in the other side of the house, my dad followed him and that’s when he noticed he was just standing still in one spot continuously barking. then i heard him from upstairs in my room and came down and was like what’s going on, and my dad said he’s been barking at literally nothing.\n\n\nnot only was he barking but at some point he was walking backwards and barking like something was right in front of him, he was growling a lot as well. this was very out of character of him. we could tell by his stance he was in full defence mode!! we even called out his name and went in front of him to show him there’s nothing there but he would not stop. he would bark and step forward like something was coming towards him. He even turned his body a whole 90 degrees and started barking at another spot , like he was following whatever was in the room.\n\nafter a solid 5 minutes of barking he stopped and we picked him up and took him to our other living room and my mom pet him and snuggled with him to make him feel calm. he seemed fine for a bit, but when she let him go he ran back to the other living room AGAIN, but this time he was standing at the end of the hallway but not in the same exact spot he was barking at before, almost like he was scared to go any further. \n\n\nAfter 20 mins it was time for all of us to sleep so my parents took him in their room where he has his little bed where he sleeps and a couple minutes later he vomited. he’s only done this once and that was when we took him in the car for the first time to the vet.\n\n\n\n\ni just wanted to share this cause i found it really weird and like we’ve only had him for a little while and we’ve never had a dog before, but i’ve always heard stories of dogs seeing things that are not there and how they can sense spirits. he probably vommited because he was so stressed from all that barking but seeing him in his little stance has me distraught. the way he kept taking 2 steps forward when he’d bark and then he’d growl and step back a bit. it didn’t make much sense. i don’t wanna creep myself out but it was a weird thing to witness",
        "created_utc": 1673596693,
        "upvote_ratio": 1.0
    },
    {
        "title": "strange, maybe paranormal closed eye hallucinations as a kid, very strange",
        "author": "RedMenaceJo",
        "url": "https://www.reddit.com/r/Paranormal/comments/10aom1c/strange_maybe_paranormal_closed_eye/",
        "text": "To preface, as a 20 year old adult I have never suffered from any sort of hallucinations or schizophrenia. I am a healthy, reasonably well balanced adult. I'm not sure I believe in the supernatural, but the feelings that these memories bring me are irrational. I grew up in an old midwestern farmhouse well over 150 years. My sister is convinced it was haunted and has told me multiple stories that I may rely here someday. I also saw a few things that were odd but nothing that couldn't be explained by a child's imagination on a creepy house.\nHowever, once a year, usually in the middle of winter, I would get vivid closed eye hallucinations. Random images flashing as well as a voice. To clarify, these are NOT DREAMS. I could open my eyes at any point and they would dissappear, and as soon as I closed them they would start up as easily as unpausing a movie. \nThe visions would start with an distressed older man's voice and I would see random household objects. Shoes, lamps, dressers doors, etc. The man's voice would be repeating things along the lines of \"where is it? I can't find it. Where is it?\". I remember vividly that the specific line \"where is it\" would repeat several times. After several minutes I would see items like a globe or the sun or the sky, and a very soft, warm female voice would say \"it is me\". And as soon as she said that the sensations would end and I could just go back to sleep.\nThis would only happen once a year, every year for a few years, maybe ages 6-9. I would develop an anxiety around winter because I knew I'd have that dream. Then one year they stopped and almost I almost immediately forgot about them. Only in the last few years or so have I been reexamining these memories. Does anyone have any ideas of what this could mean, rational or supernatural? I really just want to get as many viewpoints as possible at this point because I am at a loss.",
        "created_utc": 1673595614,
        "upvote_ratio": 1.0
    },
    {
        "title": "Insanity or paranormal",
        "author": "SKUNKTHEMUNK",
        "url": "https://www.reddit.com/r/Paranormal/comments/10anzr4/insanity_or_paranormal/",
        "text": "[removed]",
        "created_utc": 1673593328,
        "upvote_ratio": 1.0
    },
    {
        "title": "I am leaving silver out tonight, for the extra normal creatures",
        "author": "zen_lee",
        "url": "https://www.reddit.com/r/Paranormal/comments/10anfww/i_am_leaving_silver_out_tonight_for_the_extra/",
        "text": "[removed]",
        "created_utc": 1673591450,
        "upvote_ratio": 1.0
    },
    {
        "title": "sighting of grandfather in law",
        "author": "ItemSpare",
        "url": "https://www.reddit.com/r/Paranormal/comments/10allki/sighting_of_grandfather_in_law/",
        "text": "So, my grandfather in law just recently passed away, and my husband and my two kids have moved in with my husband's grandmother whose husband just passed away, and he passed away here in the home. I haven't said anything about what I've seen just because I think it's too soon. My husband and I are also staying in his and grandmas' bed and bedroom. I have also never experienced anything like this before, which is why I'm coming here for some feedback maybe.\n\n1st sighting or glimpse of him was I was walking into the living room and i saw a shadow pass by the wall where his chair sits.\n\n2nd was I was coming out of the laundry room and its somewhat in the living room, so I walked out, and I swear I saw him bent down. \n\n3rd was when I was walking down the hall to the room my kids are sleeping in and the bedroom, we are staying in is on the right I saw him just lying in the bed all covered up and cozy and could only see his face.\n\nLike I said I have never experienced anything like this before and it was very surreal to me and as I'm writing this, I'm getting goosebumps, and I do believe in God and afterlife, and I am a Christian but have never experienced anything like this.",
        "created_utc": 1673585587,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is this paranormal activity or am I just paranoid?",
        "author": "Dogs4life2009",
        "url": "https://www.reddit.com/r/Paranormal/comments/10alihe/is_this_paranormal_activity_or_am_i_just_paranoid/",
        "text": "So a shelf and 2 pictures fell of my walls and I think maybe some spirit did it. Im pretty sure I have two in my house. But yet again maybe I’m paranoid. The house is 13 years old. I just have a lot of evidence that my house is haunted. But are spirits doing this stuff?",
        "created_utc": 1673585314,
        "upvote_ratio": 1.0
    },
    {
        "title": "Demonic possession/activity",
        "author": "Top_Independence_640",
        "url": "https://www.reddit.com/r/Paranormal/comments/10ajuvb/demonic_possessionactivity/",
        "text": "[removed]",
        "created_utc": 1673580456,
        "upvote_ratio": 1.0
    },
    {
        "title": "Strange occurances at night, knocking and unnatural sounds to me. Any ideas why?",
        "author": "AnxiousExtremeTarget",
        "url": "https://www.reddit.com/r/Paranormal/comments/10ajfnb/strange_occurances_at_night_knocking_and/",
        "text": "For the past few nights, i've been having someone knocking at my bedroom door and not coming in, or even announcing their there, and strangely enough it reminds me of my fathers knocking sequence.\n\nAnd I've also been hearing heavy thuds just about 10 minutes ago outside my door, any ideas why this may be happening and if you can. any ideas how to make it stop.\n\nContext:\n\nI live in Yaxley In England and I live with my grandma because i am still in school. but I've been hearing some strange things lately.",
        "created_utc": 1673579289,
        "upvote_ratio": 1.0
    },
    {
        "title": "my paranormal story",
        "author": "Signal-Village-6767",
        "url": "https://www.reddit.com/r/Paranormal/comments/10ahoey/my_paranormal_story/",
        "text": "When I was around 8 turning 9, I was living in this place that I didn't know had a tragic history. I'm not gonna name the places, due to legal trouble apparently, but this was in a small town In Texas. It was in October of 2009, and me and my family were watching ghost adventures. It was one of the scariest live events me and my sister had scene and it got a little late. Mom took us to bed and we tried sleeping it off. That was till my sister woke me up and pointed to something really scary, and what we saw kind of stuck with me for a while. I kind of forgotten we had seen it, until I started thinking about it many years later. Me and my sister saw a shadow figure, or what looked like a shadow figure. \n\nI asked my mom about what happened when we saw it, she said she didn't really believe it at first because \n\n1. We were kids\n2. We just watched a live television event that really scared us, mainly me.\n\nSo what else could it have been, but it doesn't end there. A few days after that incident, mom too started having an experience.",
        "created_utc": 1673574529,
        "upvote_ratio": 1.0
    },
    {
        "title": "Entity attack help",
        "author": "Top_Independence_640",
        "url": "https://www.reddit.com/r/Paranormal/comments/10ah7jp/entity_attack_help/",
        "text": "&amp;#x200B;\n\nHi people,\n\nthis is a long winded one so please bare with me. I'm wondering if anyone can help me with a dilemma I have? About 2 months ago, I ended up having a psychotic episode along with depersonalisation and derealisation, thinking I was in the matrix and that people weren't real. I took myself to A&amp;E and got medicated with something to ease with the stress. I get back to my shared house still feeling awful, I get to into my room and I walk into a foul smell, it smelled like burning flesh or something, just really bad. I'd read about this before so I had an idea what this was. Then I got an immediate attack from something. Its hard to describe, but the only thing I can compare it to is something trying to possess me. Tingling and burning sensations all over my body especially around genitals and in lower back. Extreme intrusive thoughts. Feeling like I was beginning to lose autonomy. I rang my dad and he told me to find a church or ring a helpline. I ended up pacing around the house trying to get some distance from whatever it was. I go for a walk, come back and I cant remember what happened but the symptoms subsided. I couldn't sleep that night and was still feeling burning sensations. The next morning I go out and come back later that day and the exact same thing happens, except its twice as aggressive, to the point I'm struggling to type on my keyboard and I actually turn around and yell at it to 'get off'. I panic and call my Christian friend and he tells me his grandfather has done exorcisms before. He tells me his family are praying for me and I need to pray to Jesus, so I do, frantically. after about 5 minutes, I feel this burning sensation that's been in my back all day slowly start to rise up my body, my back straightens and my head tilts as I start involuntarily growling and groaning pretty heavily. After a few minutes I stop and the symptoms subside but the burning sensation in my back still persists. I ring my friend again for reassurance that it will clear and he tells me it will, but it could take a bit of time. eventually over the week the symptoms subside and I'm clear. Fast forward to this week, I did something I cant mention in fear of being banned, similar to the first time the events happened. The following few days I begin having brutal anxiety attacks, I experience a toy turn on by itself twice at work, followed by something fall off what sounded like my wardrobe at like 9am, when I was slightly awake. I go back to sleep and have 2 nightmares, one of them I was battling with a poltergeist. (not really a surprise) I've ruled out schizophrenia and psychosis. So the only other options I have deduced this to, are hallucination/delusion or entity attachment/attack. I have had paranormal stuff happen around me at my mums house such as the TV turn on by itself and the dog seems to notice a presence. I'm not religious and I'm still not. I've thought of myself as spiritual for the longest time and yet I've never truly believed entities were real, although I believe in a lot of conspiracies and real life events as I'm open minded. I haven't been the cleanest, purest or healthiest person recently and have dabbled in a little occultism in the past. I made a few sigils for selfish reasons, but I'd happily revoke them now if its possible. I try to be a good person although I think I have personality disorder that I've developed from generational child abuse. This could be a reason I'm attracting entities that are feeding off of my negative energy. I plan on seeing a spiritual healer of some sort to get cleansed. Sorry this is so long winded, but I really would appreciate any insight into what might be going on or what to do about it. I'm worried this could continue and have no idea who to turn to for help regarding this. My family would struggle to understand and I don't want to scare them. This is all so surreal to me still. \n\nThanks.",
        "created_utc": 1673573276,
        "upvote_ratio": 1.0
    },
    {
        "title": "my house is very haunted. by multiple things.",
        "author": "pussmunchr420",
        "url": "https://www.reddit.com/r/Paranormal/comments/10aeuiv/my_house_is_very_haunted_by_multiple_things/",
        "text": "hi. i dont really know how to start this because i could write pages among pages among pages of things that have happened in this house. and before anyone asks, some beliefs/entities/experiences i talk about may slightly contradict each other and i dont really have an explanation as to why, im just stating what has happened to my family and what i believe is causing it.\n\nside note ANY and all advice from believers/nonbelievers/any religious standpoint is very welcome because at this point its getting worse pretty much constantly.\n\n*the backstory of my house*\\- so my house is in a rural area. it was built in the 70's and we moved in about 7 years ago from a neighboring state. when the realtor sold this house to us, he told us that a family of five had been killed in this house in a robbery gone sideways in the early 2000s. which is kinda terrifying looking back but whatever. we also came to learn that this area is an old Native American burial ground. which is extremely ironic and kinda effed up considering our neighborhood is named the lost colony and street names are based off of things to do with it. \n\nnow to get into some experiences i feel the need for categories because again i believe there are several types of entities/things here. first ill start with the Mimics. (sk\\*\\* wa\\*\\*\\*\\*\\*, i dont feel comfortable even typing that name) my neighbors, family, and i have seen things in and around our neighborhood, that can only be described as such. ive seen deer on their hind legs, walking in our backyard for an OBSCENE ammount of time, another time my dog wouldnt go near any of us for around 3 days and was growling and had an extremely unsettling look in his eyes, and was foaming at the mouth. (we got him checked for rabies and it wasnt that) my neighbor, who has lived here since he was born, claims to have seen mountain lions, bears, and deformed creatures his entire life. (neither of those are common here) and i think the scariest, my mom seeing a wild boar in our front yard, while she was out there grabbing groceries. and it wasnt normal. it wasnt walking right. not in a hurt type of way but in a way that seemed it had never walked before in its life. \n\nthe next thing is the sleep paralysis. all four people in my family experience it on at least a once every month basis. and we all see the same thing. a shadow, with orange waxy and melting eyes, somewhere in our room. even people who have come to spend the night, who have never experienced it before our house, have had it and experienced the same thing. \n\nmisc things- doors being locked from the inside randomly (we have turn locks, not push locks), hearing what sounds like women/kids/babies crying and screaming at night, constant shadows, and the feeling of being watched. always. i dont think ive ever spent a second inside this house without feeling like something is watching me. \n\nagain, i am open to all theroies and suggestions. i just need to get this off of my chest because nobody except for the people who have spent time in this neighborhood believe me.",
        "created_utc": 1673567245,
        "upvote_ratio": 1.0
    },
    {
        "title": "Seeing Very Dark Interdimensional Beings Only &amp; Need Answers",
        "author": "ExperienceTraveler",
        "url": "https://www.reddit.com/r/Paranormal/comments/10aehly/seeing_very_dark_interdimensional_beings_only/",
        "text": "[removed]",
        "created_utc": 1673566369,
        "upvote_ratio": 1.0
    },
    {
        "title": "Seeing Very Dark Interdimensional Beings Only &amp; Need Answers",
        "author": "ExperienceTraveler",
        "url": "https://www.reddit.com/r/Paranormal/comments/10aeh1x/seeing_very_dark_interdimensional_beings_only/",
        "text": "[removed]",
        "created_utc": 1673566329,
        "upvote_ratio": 1.0
    },
    {
        "title": "Very very weird event while meditating.",
        "author": "justacceptandmoveon",
        "url": "https://www.reddit.com/r/Paranormal/comments/10acs96/very_very_weird_event_while_meditating/",
        "text": "So, this all happened about two years ago. \n\nI was meditating one evening and wasn’t able to concentrate.\n\nI have what’s called visual snow syndrome, which is when someone constantly has kind of like visual static in their entire field of vision, kinda like the visual noise we can see on an untuned old TV. They don’t know why some people have that or what causes it, no matter, not important to this story.\n\nSo since I wasn’t able to concentrate that time I decided to focus on my visual snow, which is more pronounced in dark environments or when my eyes are closed. But something weird happened. The visual noise started moving in a vortex, the center being where I was focusing. I was completely captivated and honestly amused. But then, at the center of the vortex, I had the very weird feeling that I was looking at an eye. Then I saw an eye, but it felt familiar, it was kinda like, mine. I was feeling exactly like I feel when at I look at my own eye in a mirror.\n\nStill captivated, I continued looking into the eye and then, suddenly, a human face appeared.\n\nIt was SO realistic. I have never seen in such details and \"HD\" anything in my life. It was way more detailed then anything I can see with my eyes open in the \"real world\". And it was NOT akin to a visualization. I was seeing the face exactly as I can see with my eyes opened. It was so sudden that I screamed out loud and freaked out a little bit, but I wasn’t really afraid per se.\n\nIt was the face of a woman. A curly blond woman with kind green eyes and freckles. Her expression was almost as surprised as mine. \n\nI opened my eyes when I screamed and everything disappeared. I’ve never been able to replicate everything since then, but I can still see my \"eye\" sometimes when I try.\n\nWhat’s up with all of that? I’m not into paranormal and stuff but it’s been eating me alive since that time. I think now I am ready to actually understand. Can you help me?",
        "created_utc": 1673562319,
        "upvote_ratio": 1.0
    },
    {
        "title": "The Lightbulb Phenomena",
        "author": "222orment",
        "url": "https://www.reddit.com/r/Paranormal/comments/10abfd3/the_lightbulb_phenomena/",
        "text": "This is something that I haven’t been able to explain to this day and would love to hear other peoples opinions on it. I grew up living with my grandparents. My grandma passed away in 2018. This incident happened about a year later. One day, I came home from school and went downstairs to my room in the basement. The first door to your left was the laundry room, and in the laundry room is a crawl space under the stairs. I was sitting on my bed when I had noticed light coming from under the door to the laundry room. Annoyed that somebody left the light on all day, I went in to turn it off. The light wasn’t on. We had an old floor lamp under the stairs in the crawl space. The lightbulb was shining bright but it wasn’t plugged in, as there’s no outlet under the stairs… Can anybody explain what this could have been? The light had stayed on for hours, I was waiting for somebody to say something about it, and my mom thought I had turned it on somehow. But it was not me and there was no way for it to be on without being plugged in.",
        "created_utc": 1673559225,
        "upvote_ratio": 1.0
    },
    {
        "title": "More looking for advice or the meaning",
        "author": "FaerieCult",
        "url": "https://www.reddit.com/r/Paranormal/comments/10abccp/more_looking_for_advice_or_the_meaning/",
        "text": "I won't go into too much detail because it'd be way too long and difficult for me to type with how my hands have been lately(they get painful and tired easily if i type too much). My mother recently was home alone in bed and heard 3 knocks followed by another 3 knocks both were kinda soft but then about 30 seconds later she heard very loud banging 3 knocks. it happened on her bedroom door and she is a little crazy so she has cameras everywhere like covering every little corner inside and outside the house and she sent it to me and there's no body in the house or outside but you can heard the last 3 knocks in the video. It was a bit creepy. This happened Monday apparently between 10am-noon. She didn't open that door but did open the sliding doors in her room that go outside and apparently called my sister freaking out and had her on the phone as she went around to the front of the house through the front door and went around the entire house making sure no one was inside. she did since open her bedroom door and apparently has it tied open now claiming shes too afraid to close it. idk how i personally feel about it cause my mom is a little crazy tbh but seeing the short video obviously makes me realize she isn't lying. unrelated i saw my dead nana when i tried falling asleep a week ago and was jolted awake because she was in a mirror reflection in my moms old bathroom and she looked unimpressed and angry, i have my own feelings and theories about it so it doesn't bother me much but i just remember at the time feeling uneasy and nauseous(why she might be angry at me is i never got to say goodbye to her, i found out she was dying and i made stuff for her to send her in the mail living states away and the day she died was the day i was on my way to the post office but i got the call beforehand and ended up not doing it, my ex destroyed the stuff cause he claimed it was bad for me. i asked and so did my dads mom if we should buy a plane ticket to go there and my mother refused to let me come visit so i never did. i regret it everyday tbh. or the fact i denied their fortune when my poppy died because my mother convinced me why its be better for everyone if i gave it to her and how it would be better for my younger siblings if i did and so i agreed tbh i cant decide if i regret it or not cause I'm struggling badly even with a decent job and i see my mother buying expensive things for herself and not much for my siblings but they do seem happier so idk. sorry if none of this makes sense lmao",
        "created_utc": 1673559045,
        "upvote_ratio": 1.0
    },
    {
        "title": "Was/is my room haunted",
        "author": "Latter_Cauliflower_8",
        "url": "https://www.reddit.com/r/Paranormal/comments/10aa4v4/wasis_my_room_haunted/",
        "text": "Okay so basically about 1 year ago when I was like 13 I started getting really interested in paranormal stuff and haunted things for example I watched this girls tiktok content who has a haunted doll and stuff like that. I decided to install this one app which is like supposed to he a ghost box thing where you can hear ghosts or wtvr and put it next to this big stuffed bear I got weird vibes from and I actually kinda heard some things but I got scared so i deleted it. A while after that I started experiencing things at night for example I would randomly feel like ants were crawling over me especially my neck but it was very strong and it happened alot randomly (I don't have bugs in my bed or room) but the creepiest thing that happened was like a month later when my cousins were over and I was about to sleep when I suddenly started feeling scared and watched, I tried to close my eyes but I kept opening them but when I closed them again I started hearing breathing next to me and I was too scared to open my eyes but my eyes were literally rolling back like I felt it but I then yelled smth and opened my eyes but since then I wouldn't sleep without light, I had my curtains open and sometimes my phone's flashlight. The other thing that happened was the same year I think but a while later, I basically randomly woke up in the morning but my eyes were really heavy and I couldn't see clear like I was really really tired but I saw this black cloud thing fly out of my room, ik this all sounds fake or wtvr but I'm being fr. I basically want to know what you guys think it is or if it's paranormal bc I'm still confused about this. Also don't tell me to find a priest or exorcist because im not Christian. I also don't use reddit and english is not my language I just wanted someone to awnser this so don't comment abt my grammar or sh like that",
        "created_utc": 1673556216,
        "upvote_ratio": 1.0
    },
    {
        "title": "Dark Negative Energy Mass Above Me While Laying In Bed",
        "author": "CrazyWeather2196",
        "url": "https://www.reddit.com/r/Paranormal/comments/10a9z1i/dark_negative_energy_mass_above_me_while_laying/",
        "text": "[removed]",
        "created_utc": 1673555832,
        "upvote_ratio": 1.0
    },
    {
        "title": "Still haunted by this experience from 15 years ago. Ghost body falls onto me and my cat.",
        "author": "maaalicelaaamb",
        "url": "https://www.reddit.com/r/Paranormal/comments/10a7j0n/still_haunted_by_this_experience_from_15_years/",
        "text": "[removed]",
        "created_utc": 1673549993,
        "upvote_ratio": 1.0
    },
    {
        "title": "Hi paranormal friends",
        "author": "AngelLeighBBW",
        "url": "https://www.reddit.com/r/Paranormal/comments/10a7d13/hi_paranormal_friends/",
        "text": "Myself and my team have hire of a super cool haunted museum at the end of the month and we want to make most of it, is there any cool experiments we could do that anyone recommends? On our list so far is call out and listen, estes method, table tipping, human pendulum, ouija board.\n\nThank you",
        "created_utc": 1673549595,
        "upvote_ratio": 1.0
    },
    {
        "title": "How with Distressing Ghosts",
        "author": "GreatJothulhu",
        "url": "https://www.reddit.com/r/Paranormal/comments/10a766s/how_with_distressing_ghosts/",
        "text": "I work at a museum that happens to be in front of some train tracks.  Last month, a guy committed su*cide by jumping in front of a train, and what was left if his body was found behind the museum.  Immediately after, I found that the key to the cash drawer had been flipped upside down.\n\nBut that's not all.\n\nA few weeks ago, I was working in the 4D Theater, as well as the Gift Shop.  A kid &amp; his mom (who were not locals) exited the theater.  It went a little something like this:\n\nKid: I saw something scary inside the museum.\n\nMe: (in a happy tone) Oh?  What did you see?\n\nKid: I saw a bloody man inside the museum.\n\nAt this point, I could feel my face turn into one of shock.  I rang them up, then told the kid to wait outside for his mom.  I explained about what had happened.  The way the mom reacted, she had not heard about the su*cide.  I suggested she keep an eye on that kid, as I had a hunch that he had The Gift, as it has run in my family for generations.\n\nHere's the question: What should I do to deal with said spirit?  My first instinct was to ask my friend to smudge the area where the remains were found.  I don't want to smudge the inside, as I don't want to agitate the spirits already inside the museum, as they are pretty cool.\n\nSuggestions?",
        "created_utc": 1673549137,
        "upvote_ratio": 1.0
    },
    {
        "title": "Just shering my paranormal experiences",
        "author": "Edr1sa",
        "url": "https://www.reddit.com/r/Paranormal/comments/10a6j2s/just_shering_my_paranormal_experiences/",
        "text": "Hii everybody. I am writing today to share some experiences that i believe to be paranormal.   \nJust quick precisions. First of all english is not my first language so please be understanding if there are mistakes in this text.  \nIt is also important to note that everything I'll be saying here is only a testimony, you are free to believe it or not, i don't have any photo, video or audio recording to prove what i am saying, even if I tried.  \n\n\nEverything that happened took place either in my house where I live since i am 4, or at my grand parent's house, which was my first house and also kind of my second since they live 5 minutes near, i was always with them when i was younger. My house was built on an ancient vine culture, i don't have anymore information on the land. And for my grand parents, the house was bought to a previous owner, but they don't know anything about the past of the house nor what was the land.  \n\n\nMy first experiences began pretty late, before that i never had any disturbing experience except nocturnal terrors and nightmares, but nothing abnormal. Even though i grew up in a catholic family, i had never been taught that spirits exited. To me, ghost were just the ones you saw in cartoons with the white drape and the 2 holes for the eyes. I did not know that human souls could possibility stay on earth, my mum always told me that good souls went to heaven and bad souls went to hell and i never questioned it, I wasn't even interested about it, I was a kid and had others interests than death to be honest.  My mum never really believed to paranormal anyway, and my dad was even more sceptical.   \n\n\nIt all started when I was 9. In my house, there were 4 rooms. Three were on the first floor, and there was a guest room on the second floor which was basically used like an attic. The 3 bed rooms down stairs were mine, my brother's one and my parent's one. But then, my mum discovered she was pregnant again, and since I was the eldest, I had to move upstairs. It was a very big room, with a personal toilet and bathroom, and to be honest I like it a lot, but back then it wasn't the case at all. The first 2 years, I couldn't sleep in the room, I was always feeling like there was something heavy in the atmosphere. I was feeling watched, sometimes I was very cold when we were in the middle of summer (and summers are HOT were I live). So until i was 11, I was spending my whole time downstairs, in the living room or in my little sisters room which had became my bedroom too. Then i found the courage to move back in my bedroom, but things got worse.   \nAt first, it was just noises. Every evening, as soon as my father turned off the tv to go to bed, I heard noise in the living room. The light switch went on and off (it is a specific light switch, idk what's the matter with this one but it does a lot of noise when it's being used). The gaming chair of my father was wheeling, I heard as if someone was running barefoot on the ground, felt like kids footsteps running everywhere. There was also strange noises, as if someone was using a broom for hours. One evening, I heard someone climbing the stairs very fast. At first, it was so clear and distinct that i thought it was my brother, so I went out of the bedroom, but no one was there.   \nThen I felt as if someone was touching me while i was in my bed. I felt a heavy weight on the bed, sometimes even someone's breath. I was terrified, I remember crying of terror when i felt the hot breath on my face.  \nA lot of things started to disappear too. Some of my clothes, as well as some of my sister's shirts. A karaoke mic that mum had tied the dressing room. An entire file with the papers of our car that my mum had left in plain sight because the car was to be sold (and we all knew it, it wasn't a joke that we made or anything, we all know the importance of papers, and jokes aren't really a thing that we do). A pair of lace shoes, that my mum had just taken out of my father's shoes to clean them outside and when she came back 15 minutes later with the shoes to put them back, they were gone...   \nMy mum, who is not a real believer of those things, still confessed having experimented weird things herself. Weird noises, doors opening on their own. Once, she saw my brother running outside in our garden, and she opened the window to tell him it was lunchtime. But when my brother answered \"yes I'm coming\", the voice wasn't coming from outside but from his bedroom, and when mum looked outside again, there was nobody in our garden.  \nWe both heard strange noises coming from the rooftop as well, as if there were people running on it : heavy footsteps running everywhere around. Now, she also hears noise coming from my bed room at 4am when i am sleeping. She claims hearing loud footsteps, \"as if you were tiding up your bedroom\". Maybe I'm sleepwalking, but i don't move furniture or make things fall while i am sleeping, i would see that things were not at the same spot i left them on the next morning (i am a very observative person, when something moves in my bed room, i know it\".  \n\n\nNow, I'll come to the big events. The first happened in my house, i was maybe 14 at the time. It was during eastern holidays, my brother and sister were gone for the week, I was only with my mum and dad. It was a sunny afternoon, my dad was working at the other side of the garden, while I was reading on the opposite side with my mum. When it was 4pm, I decided to go and prepare my self a peanut butter sandwich, so I opened the window of my Livingroom, walked through it. If you continue straight forward, there is a window that opens to the other side of the garden, where my father was working. On the left was a door that is always opened and that leads to the kitchen. So I turn left in the the kitchen, and when I was almost done my the food,  I heard the window leading to the garden opening, and I saw my mum going out, probably to talk to my dad. I don't even pay attention, I close the peanut butter pot and I go back to my seat. It takes around 15 seconds if you walk very slowly to came back to the window where the seats are. And what do I see in the chair next to mine when I arrive ? My mum reading her book. How can she be there when she was on the other side of the garden like 10 seconds before ? The only way would have been to go by the living room again, but obviously if she had turned back she would have been behind me, and there is no way she would have had the time to take the outside way that requires to get around the house. My mum had an accident few years ago where the ligaments of her ankle got very damadged, she could not walk fast at that time and still can't. When i asked her what she was doing here, she just said \"what do you mean, i didn't go anywhere\"... And she had no reason to lie, she couldn't have moved and be here that fast anyway.... We did a test with my brother, if she had moved and was even just at the window near the kitchen, she would have had to RUN (not just walk fast, really run) around the house, and she physically can't. I just can't understand what I saw that day, and it is terrifying. It's important to note that a friend of my father went to sleep in my bedroom when it was still a guest room, and the guy confessed to my mum that he couldn't sleep in it and felt really bad in the bedroom, as if someone was watching him while he was sleeping. And he is definitely not the type to believe in spirits, he is an engineer and a sceptical man. I also have a dog since a few months. It is a very calm and sweet puppy, a shi-tzu. He is calm, never barks, he feels comfortable everywhere in the house. One day I wanted to take him with me upstairs to keep an eye on him since my mum was not home, but as soon as came in I felt he was not at ease. he kept looking around him as if he was afraid, he barked, but it was not an aggressive bark, it was a bark of fear. He went to my door, scratching it as if he wanted to run away. He NEVER did something like this, and I insist. He is calm and gentle. He was squealing with fear and really seemed terrified, and only calm down when he was out of my bedroom  \nThe second Thing happened at my grand parent's house. There is an extra  bedroom in their house, that used to be my mum's bed room (she never claimed that anything strange had happened though).  \nI never could stay in this bedroom. Sometimes, when we were playing hide and seek, I was hiding behind an old table in that room, and each time I was feeling sick, I felt nauseas and cold air, even in summer. And again, summers are hot where I live, average temperature was around 35°c at the time. Once, we went to clean that room with a friend because my grand ma was sick and couldn't do it and my friend needed money, so it was interesting for her and my grand ma as well. After 30 minutes in the room I could tell my friend felt uneasy. She complained from a head ache few seconds after I stated to have nauseas, and each time I was feeling something, she had violent headaches. During that cleaning session, the sponge disappeared, and magically reappeared in plain sight on a chair five minutes later...  \nBut, anyway, two years ago, I stayed at my grand parents house for the Christmas holidays. Problem : some of the radiators were broken and the one in the bedroom where I usually sleep is one of them. So, I have to sleep in my mum's former bedroom. I  was 17 at this time, and I was like \"you got this, you're not a kid anymore, it's just for one week\". At 10pm I went in the bedroom to read and chat with some friends, the ambiance was really good, even though the bedroom was very cold. I finally shut down the lights to sleep, but god that was the most terrifying moments of my life. Scratching inside the wall, strange noises, a weight on my bed. at some moments, I even felt as if something went to lie besides of me. I felt as if someone moved the plaid I was sleeping with. when I finally fall asleep from exhaustion, I made the strangest dream ever. I dreamt I was in a room, that looked a little public swimming pool, but with just one little pool. There was a balcony with bright green plants and little candle, and there was an old lady lying on the ground on a white mat. She was very pale, with long white hair, a white night dress, and big blue eyes. She wasn't scary at all, and the overall ambiance was very sweet but it still felt very strange. The woman told me to come closer with a very sweet voice and took me in her harms. She cried, telling that she was happy to see me, but that she had a cancer and that she was going to die very soon. I woke up on those words. I was crying, but the bedroom was warm, just like in my dream. I felt extremely sad, and even now when I think about this event I feel sadness but also a very intense sweetness. I don't know who this woman is, I never met her ans still haven't btw.  \n\n\nAnd that's all. I know it's very long but there is lot of things to say and a lot that is still to be said but it would be too long. Thank you guys for reading this, and if you could bring up some answer or thoeries about all this it would help because honestly, it is terrifying to live.  \nWish you all the best, bye :&gt;",
        "created_utc": 1673547572,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is the scariest experience you’ve ever encountered in your own home?",
        "author": "ComfortableObvious89",
        "url": "https://www.reddit.com/r/Paranormal/comments/10a658v/what_is_the_scariest_experience_youve_ever/",
        "text": "[removed]",
        "created_utc": 1673546652,
        "upvote_ratio": 1.0
    },
    {
        "title": "Experiences from my first apartment : is it paranormal or bad room agencement ?",
        "author": "lekurumayu",
        "url": "https://www.reddit.com/r/Paranormal/comments/10a4p4r/experiences_from_my_first_apartment_is_it/",
        "text": "Hi everyone! \n\nWarning : I'm sorry, this came out way longer than I intended it to be. You can find the extra-short version at the end if you want. \n\nI've left this appartement since 2018 after living in it for 3 years, but I'm still wondering and kinda creeped out thinking about it even if nothing really bad happened there. It was just weird and disturbing. \n\nI was leaving home for uni and the first semester was just fine. During the second semester I sometimes felt watched. The first time I thought it was anxiety, or because my room was messy, I had skipped cleaning that week and I have read that you don't sleep as well in a messy room so I let it slide like 1, 2, 3 times. I was always kinda messy (but not dirty) and didn't experience that in any of the 8 homes I have inhabited in all my life. So I thought it was bad room arrangement. One time it happened for two days in a row. I noticed that everytime it happened, my room was messy and not cleaned (I usually clean two times a week but I admit that I had gotten lazy and was often cleaning once a week, but bins were changed and dishes were done). It kept happening during the three years I lived there, whatever the season, weather or lifestyle. If it was happening and I was not cleaning the room the next day, the next night I would feel watched. I am not scared of the dark nor mirrors but i had a mirror facing the entry of the bathroom and I was always afraid to see something in the mirror. One time I begged to get some rest and promised I would clean the next day and it just... Stopped? But kept happening if not cleaning twice a week. At that point you probably think I would have been scared away into being a clean person, but each time life would like get in the way? The days after washing life just kept happening and I was always busy so I would end up judged by nocturnal eyes. \nAfter a while, I just brushed it off (even if I was still scared when it would happen, I was so uncomfortable that I would sleep with the night on, thing I have never done even in early childhood) because I thought I was just self-alimenting some kind of paranoïa. A friend of mine had the \"same\" flat (we were neighbours), with the same furniture and same arrangement and I always slept fine at her place and I got a weird look when I told her what was happening to see if she had the same issues. \n\nWhat really made me feel weird is that three different times I invited people over (clean appartement), and on two times (the first one during the first semester) the guest felt watched. One of these times I had two friends stay over for the night. They left, but later that month after one of this night I told them about it asking them not to make fun of me (they asked why I looked tired). They then stared at each other and hesitantly told me \"when, we didn't want to scare you but... After sleeping at your house we both had a talk because I told (the other friend) that I felt watched that night and it creeped me out, and she answered she felt the same. We didn't want to tell you because we didn't want you to feel uncomfortable after being so nice to let us sleep in your flat\" (it was forbidden). Weirdly, on the two occasions I never felt watched, only the guests. \n\nRecently I told my mom about it and she told me \"it's like you had a soldier ghost in your flat. You know, soldiers are forced to be very organised, and if he did some time of service there maybe he was mad at you for messing up his place you know\". She didn't know at the time that a small commemorative plaque was saying that marines troops stayed there during ww2. After some research today I found out the building was from 1930 and classified as historical monument (it is used as flats from students and I knew it was old because of the plaque but seeing the year was weird!). \n\nSo really I don't know what to think of it. I knew two people there and was the only one having this kind of issues. I don't know if it's reminiscent energy from aaaaall the tenants it had during the years, if it is the ghost or energy of one previous tenant that was particularly versed into cleaning and sticking to rules (keeping it clean was part of the rules), or anything else. Overall I remember it as a nice flat and I miss it sometimes, but some other times I still think about this (even if it's been 5 years since I moved out) and I get chills.\n\nWhat do you guys think? I also have to say that the apartment was kinda humid (old) and had bad isolation (old) but I knew three people in the exact same building and they never got this, which is what I find weird. Honestly I would think it is just really bad anxiety if three people didn't told me they felt it while sleeping there. So I really wonder if it was really something about the agencement and everything (but then why only on certain occasions?) or if there is other rational or paranormal explanation. \n\nSorry for the (unnecessary) long post! \n\nTldr : I was scolded into cleaning my appartement because I was feeling watched at nighr if I skipped doing it, and guests also felt watched when sleeping there even though I hadn't told them about that EVER",
        "created_utc": 1673543096,
        "upvote_ratio": 1.0
    },
    {
        "title": "Experience was so awful and need advice from someone",
        "author": "HopeCber",
        "url": "https://www.reddit.com/r/Paranormal/comments/10a4jjb/experience_was_so_awful_and_need_advice_from/",
        "text": "My hotel experience. In my hotel i have experienced a light swinging back and forth on its own, shadows moving across the room, high pitch left ear ringing (i dont have tinnitus) and a voice in my right ear that was deep and yelling the word early in my ear. I also have experiences knocking and tapping. My eyeliner lid was on the floor after i knew i put it up. My lightswitch also popped out from the wall. I feel uneasy and watched, any advice?",
        "created_utc": 1673542756,
        "upvote_ratio": 1.0
    },
    {
        "title": "Dead friend visits my dreams just before someone dies, paranormal or something else?",
        "author": "AmberKF13",
        "url": "https://www.reddit.com/r/Paranormal/comments/10a1e2g/dead_friend_visits_my_dreams_just_before_someone/",
        "text": "[removed]",
        "created_utc": 1673534898,
        "upvote_ratio": 1.0
    },
    {
        "title": "The night a shadowperson showed it self 3 times in 3 different places",
        "author": "rwbyluvr",
        "url": "https://www.reddit.com/r/Paranormal/comments/10a05c1/the_night_a_shadowperson_showed_it_self_3_times/",
        "text": "[removed]",
        "created_utc": 1673531524,
        "upvote_ratio": 1.0
    },
    {
        "title": "Advice for dealing with ghost?",
        "author": "Throaway4scaredgurl",
        "url": "https://www.reddit.com/r/Paranormal/comments/10a04z0/advice_for_dealing_with_ghost/",
        "text": "Hey everybody, this is a throwaway account since I don’t really use Reddit. I’m going to keep it up for a while to read up on advice.   \n\n\nIve recently had a few unexplained events happen and wanted advice. Let’s go back to December of last year, my mother was cooking Christmas dinner when she claimed she saw someones shadow (dressed as what I was wearing earlier that night before showering).\n\nIt went inside the bathroom with the lights off and disappeared after going through the door she said.\n\nI thought it may have been a trick of the mind, but my mother has seen ghosts or visions of shadows before in different houses. And no it’s never the same shadow but a different “person” wearing something else each time.\n\n  \nso fast forward to yesterday nothing strange had happened, but in the middle of the night there was a very loud crash on the roof or perhaps inside the house. The dogs went crazy barking at nothin, we searched inside and outside of the house but there was no one nor any dropped or broken items.\n\n&amp;#x200B;\n\nthen, a bit after that I was about to sleep when I decided to take a photo in my room to show my friend my hair. It’s important to know I was in the dark with just the tv on, I took a selfie facing away from the tv (so the tv was behind me) the other angles of my hair came out fine but the photo of my face at an angle came out red and purple with a white glowing pupil.   \n\n\nI understand maybe it was the lighting? Some camera defect at just that moment due to the dark room and the tv? The purple colors seemed to suggest that. But the red and the white glowing pupil was so scary.\n\nI laughed at first thinking “wow that looks so evil! Wtf!” But then I got scared, I couldn’t dare to look at the photo and so I deleted it. I tried to replicate it but it wouldn’t take another photo like that again.\n\n&amp;#x200B;\n\nSo that could have been just a camera glitch, especially in the dark. But what made me write this post isn’t because of that. After the whole photo thing, like I said before I just reassured myself it was a camera glitch and went to sleep. I felt unsettled and I thought I heard something drop in my room, but went to sleep anyways. \n\n&amp;#x200B;\n\nWhen I woke up this morning, on the floor at the foot of my bed I see 2 pieces of laundry I left in the basket 2 days ago. \n\n&amp;#x200B;\n\nYes,  I’m 100% sure there was nothing on my floor the night before. And as much as it’s gross, the clothes still are unwashed and you can tell by the smell. It’s 101% without shadow of a doubt the same laundry I put in the basket about 2 days ago, here on my floor.\n\nI sleep with the door locked, always double check if it locked throughly by shaking and pulling the knob each night as I’m ocd. When I went to the bathroom this morning sure enough it was still locked.\n\n&amp;#x200B;\n\nSo now I’m just here scared. I couldn’t really tell anyone. So I’m making this post.\n\n&amp;#x200B;\n\nAny advice at all? What am I dealing with here? And also if it’s some sort of ghosts carrying my laundry around, can the clothes go through doors and walls?\n\n&amp;#x200B;\n\nso weird….\n\n  \n\n\nalso I didn’t know what the flair was supposed to be? I could’ve used tulpa, shadow man or experience but since I have questions I just used that. I’m sorry if it’s wrong",
        "created_utc": 1673531494,
        "upvote_ratio": 1.0
    },
    {
        "title": "im tired of the entity who mess with my mirror",
        "author": "RottingVillain666",
        "url": "https://www.reddit.com/r/Paranormal/comments/109vdo3/im_tired_of_the_entity_who_mess_with_my_mirror/",
        "text": "Im seriously starting to get tired of this entity messing with my mirror. It's been a week. \nI clean the mirror everyday as i use it to comb, sometimes put make up on, creams and stuff. This mirror is hanged on the wall infront of me. I look at it before sleep sometimes. I don't know what is that, but i find handprints on the mirror. This handprints are clesrly not human, as they have three long slim fingers and a small, round palm. I know my cat print and i can tell you my cat is no supernatural thing. Yesterday i left a note on the mirror about it, asking them to stop leaving prints on the mirror. Today i found the note in my bed with a part missing.",
        "created_utc": 1673515371,
        "upvote_ratio": 1.0
    },
    {
        "title": "Clicking of a light/power outlet switch heard in a room with nobody in it and the door closed",
        "author": "ArmA3_Coyote",
        "url": "https://www.reddit.com/r/Paranormal/comments/109uz4o/clicking_of_a_lightpower_outlet_switch_heard_in_a/",
        "text": "I'm currently staying over at my friend's house (there's 3 of us in total) and about 50 minutes ago we all heard about 7-10 distinct clicks that sounded like a switch being flipped with about 4 second intervals between each flip. \nThe sounds came from a room with the door closed and nobody in there (2 of us checked everywhere) and the sounds stopped as soon as we opened the door and stepped inside. We were in the room directly opposite to it.\n \nIt's a relatively new house and there was nothing that we saw that might have been causing the sounds. \nI've got no clue as to whether there's a reasonable (natural) explanation to this or if it could be something supernatural as I've never had anything similar happen before that I can remember. We'd really appreciate some help on figuring out what it might have been.",
        "created_utc": 1673513832,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why are most of the paranormal experiences negative?",
        "author": "ofexagency",
        "url": "https://www.reddit.com/r/Paranormal/comments/109u9ro/why_are_most_of_the_paranormal_experiences/",
        "text": "There are countless paranormal experiences, many posted in this subreddit and I'd say a good 80% are negative where an entity is messing with someone and causing fear. \n\nWhy is that? Why don't we see more positive experiences, the kind where people are uplifted?\n\nMy guess is that it's mostly low-vibration entities that interact with us, they are somehow trapped on earth and they have direct access to us, while higher beings don't want nothing to do with lower beings so they don't bother.",
        "created_utc": 1673511122,
        "upvote_ratio": 1.0
    },
    {
        "title": "A ghost tickled my feet while sleeping",
        "author": "ofexagency",
        "url": "https://www.reddit.com/r/Paranormal/comments/109u8bu/a_ghost_tickled_my_feet_while_sleeping/",
        "text": "Just like that. Recently I almost have nightmares every night right before waking up. Yesterday tho, I had my feet out because they were super warm. While I was dreaming I noticed finger tickling my feet at night.\n\nYup, I immediately covered my feet because I knew someone was playing with them. Some kind of entity likes to mess up with me. But I don't really mind, it's not that bad. Seems more playful than anything else.",
        "created_utc": 1673510985,
        "upvote_ratio": 1.0
    },
    {
        "title": "I think I just saw the ghost of my dead cat",
        "author": "Top_Influence_2097",
        "url": "https://www.reddit.com/r/Paranormal/comments/109tjht/i_think_i_just_saw_the_ghost_of_my_dead_cat/",
        "text": "I don’t suffer from sleep paralysis but I was just waking up and and I saw my dead cat sitting (like in the way they’re half lying down with their paws tucked under their body, reminds me of a chicken lol) on my laptop (I forgot to put it on the floor before sleep) I didn’t feel scared like with they say happens with sleep paralysis, I was just curious because at first I thought it was my other grey cat when I was waking up and then I realised that she never comes on my bed, at this point I’m awake, sitting up and she’s still there because I woke up with a start and I reach out and try to stroke her but there’s nothing there and it’s like she disappeared after I tried to stroke her, I then turn my bedside lamp on and she’s gone, I’m crying as I’m writing this because it felt so real but because I generally lean towards the scientific explanation of things, I don’t believe this was a sleep thing, I hope I don’t sound irrational lol but I didn’t feel scared at all I just felt curious and comforted. This has happened to me before but I just brushed it off but this is going to sound weird but it’s like when I was sitting up and looking at her it’s like she realised I was awake and started to fade/disappear this was as I reached out to stroke her, then I turned the light on and nothing was there. She died over a year ago, poor baby had lymphoma and her death was so traumatic and devastating even though we knew she was dying. I’m 25 now but we had her since I was 12 so I grew up with her so it felt so nice to see her. 😢❤️",
        "created_utc": 1673508490,
        "upvote_ratio": 1.0
    },
    {
        "title": "GPS Went Nuts in Navajo Reservation at Night",
        "author": "fellowsandmen",
        "url": "https://www.reddit.com/r/Paranormal/comments/109r1y6/gps_went_nuts_in_navajo_reservation_at_night/",
        "text": "Hey all, I never post anything however I cannot find anything on any social media or anywhere else remotely near what I experienced in the Navajo and Hopi Reservations from the hours of around 00:00-03:00. I attend college in the state of Arizona, and driving home for Christmas break my girlfriend and I chose to complete as much of the drive at night as possible. This meant the Navajo and Hopi Reservation portion of our drive fell roughly in the hours I listed making it pitch black during this portion of our travel. My car is equipped with a screen on my dashboard that displays Google Maps and within some amount of time after entering the reservation, my route started adding jagged and strange loops off the main highway (160) that if selected said would add anywhere from 5 to 30 minutes of travel time while seemingly only being maybe a quarter mile. At first this was explainable because the route \"alternatives\" were coordinated with either driveways or utility routes, but after about 15 minutes of us noticing this the correspondence stopped and just random detours were left with no explanation.\n\nWe both were a little freaked out by that and other early morning oddities like a random Rivian truck being the only car we ever had pass us while headlights and distant taillights never caught up or were caught up to.\n\nI'm speculating, and unfortunately I did not get a picture, but the routes looked weirdly like some written language and were definitely not what roads look like. Some examples of what Google was displaying were sharp edges, triangle loops on the end of a straight line orthogonal to the highway (this I remember the most), very erratic zig-zags, and other weird knots.\n\nAnything at all helpful or informative on this would be immense to me because I cannot find anything anywhere else online and a family friend of mine said she had something similar happen about four months ago with her GPS on the same highway (this is what spurred me to actually write a damn chat board plea).\n\nAsk me any questions that might help clarify or explain my experience.",
        "created_utc": 1673500217,
        "upvote_ratio": 1.0
    },
    {
        "title": "Something crazy happened to me.",
        "author": "sohanbillu",
        "url": "https://www.reddit.com/r/Paranormal/comments/109qgrz/something_crazy_happened_to_me/",
        "text": " It was a few days ago. I was sitting in my room, playing on my Xbox (offline) and I hear a notification sound from the table my Xbox was placed on. Thinking nothing of it other than my ears ringing, I continue to play. No joke after just a few seconds I hear ANOTHER notification sound from right behind me. At this point I was concerned. As I am looking behind me, confused, I hear my own phone notification sound. The scary part in this, you might ask? It was three different notification sounds every time. What's even more scary is that I was all alone at my house at that time and my TV was on MUTE. I still think of that moment till this day as the craziest glitch in the matrix I have ever seen.",
        "created_utc": 1673498428,
        "upvote_ratio": 1.0
    },
    {
        "title": "Could I possibly be more in touch with the supernatural than most?",
        "author": "Superb_Vegetable_781",
        "url": "https://www.reddit.com/r/Paranormal/comments/109pfqb/could_i_possibly_be_more_in_touch_with_the/",
        "text": "In the past few years, I’ve had a fair share of paranormal experiences, ever since I moved into a house with previous owners when I was in 4th grade. I’ve looked into the stuff and a lot of sources lead me to the clairs. I’ve always been fascinated with the paranormal, but whenever something like that happens, I get so overwhelmed that I start to become legit terrified. The thing that eludes me the most is that I have anxiety and I get Anxiety attacks or the feeling of an oncoming attack just from being out on the spot by a teacher in class. Though, I’ve ever ever felt that sort of panic when dealing with stuff like this, and it’s confusing. I’ve read in places that some people are simply more receptive to the energy around them and it can make their pulse pick up and stuff like that, and I’m wondering if that is what this is.\n\nAnyway, I’m rambling so Im just going to get to the point. I’m going to be talking about the clairs, numerology, and my past paranormal experiences because I want to know if they could mean that maybe I’m more receptive (?) not sure if that’s the right word.\n\nFirst for the clairs. For those who don’t know, these are the basic senses we all learn for our world, but for the paranormal world. There’s Clairvoyance, aka being able to see spirits. Then there’s Clairaudience, being able to hear them. Next is Clairsentience, being able to feel them or things they experienced. Claircognizance, clear knowing. Then Clairscent (smell) and Clairgustance (Taste). Out of those five, the only ones I think I would have an affinity for are Clairsentience, Clairaudience, and Claircognizance. \nThere signs for all of them and many make sense. For Clairsentience, (I don’t want to list them all because that would be really long), but I’ve always been able to just get these vibes about someone, and they’ve always been right, or I’ll get bad feelings then something bad will happen, or I’ll get chills, feel as though someone just touched me or bushed against me, I can empathize with others really well, and the smallest things can create huge emotional reactions. Clairaudience, I have perfect hearing, despite my eardrum being almost gone in one ear. However, when I’m not alone, no sounds, and focusing on hearing, I’m hearing so mu and taking in so much that almost everything becomes muffled and I have trouble processing what I’m hearing. Sometimes I’ll hear knocks, footsteps, scratching at my door, but nothing will be there. Sometimes I’ll think I hear someone say my name but no one did. For Claircognizance, sometimes I’ll just know things, things I don’t know why I know. For example, there was this girl that used to hang out with my friends that I had literally never met or seen, didn’t even know her name. I HATED her from the get go and just knew she was fake, super fake. Well, a year later, she’s talking crap about my friends behind their backs and gossiping about their boyfriends, then blaming it on others when my friends confronted her. No one had believed me. I’ve also been able to just predict things a lot, tiny things, nothing big, but it happens so often that I’ve started to notice it.\n\nFor numerology I have a bunch of numbers calculated and if anyone knows what some of these mean, please tell me, I really only know about my life number being 5. But here is the list:\nExpression - 1\nHeart's Desire - 11\nPersonality - 8\nHeart's Desire: Personality Bridge - 6\nLife Path - 5\nBirthday - 3\nLife Path: Birth Day Bridge - \nFirst Challenge - 1\nSecond Challenge - 6\nThird Challenge - 5\nFourth Challenge - 7\nLife Path: Expression Bridge - 5\nMaturity - 6\nRational Thought - 9\nBalance - 7\nHidden Passion - 5\nKarmic Lesson - 7\nCornerstone - M\nSubconscious Self - 8\nPhysical Plane Of Expression - 6\nMental Plane Of Expression - 2\nEmotional Plane Of Expression - 11\nIntuitive Plane Of Expression - 9\nMinor Expression - 7\nMinor Heart's Desire - 4\nMinor Personality - 3\nFirst Pinnacle Cycle - 5\nSecond Pinnacle Cycle - 3\nThird Pinnacle Cycle - 8\nFourth Pinnacle Cycle - 2\nFirst Period Cycle - 2\nSecond Period Cycle - 3\nThird Period Cycle - 9\nNot sure what all of these mean so if anyone does, please let me know.\n\nThen, on paranormal experiences, I’ve had my fair share to know these things are real. I don’t want to go into too much detail because it still freaks me out and I’m going to bed soon so no thanks, but to sum it all up, I’ve been scratched, I’ve been watched, I’ve talked to my grandparents, I’ve left my room to come back and my window is open, or things have been moved to a great degree, I’ve seen things then had lights go out, I’ve just sometimes gotten the feeling that something is there and had dreams (some I’ve uploaded before). But I don’t know how common this is for people and they seem to alway revolve around me and my things instead of things that belong to others in my family. I know that my dad has had some of their own experiences, my sister has heard things, had glass shatter, and things fall of walls, and she was there to witness me being scratched, believing me as the night before, she’d been hearing scratching on her window that is directly perpendicular to mine.\n\nAnyway, is it possible that I’m just more pro or to paranormal happenings? I’ve looked it up and some places say I could be a medium while some day empath, and others just say I’m more in tune with this kind of stuff. But figured I’d get the opinions of others who have gone through similar things. So, thoughts?",
        "created_utc": 1673495385,
        "upvote_ratio": 1.0
    },
    {
        "title": "so i found out theres a ghost in my house and i dont know what to do",
        "author": "Sufficient_Ear_2831",
        "url": "https://www.reddit.com/r/Paranormal/comments/109pf9a/so_i_found_out_theres_a_ghost_in_my_house_and_i/",
        "text": "[removed]",
        "created_utc": 1673495345,
        "upvote_ratio": 1.0
    },
    {
        "title": "Crisis apparition",
        "author": "slynch111",
        "url": "https://www.reddit.com/r/Paranormal/comments/109o1az/crisis_apparition/",
        "text": "Hey,\n\nAbout a year ago I was able to say bye to a friend who had already passed. He was like a wispy translucent form on the side of my bed. It was relaxing to be able to do some telepathy with him. And let him know what I felt. \n\nI was wondering if there are ways to manifest him coming back as an apparition. Maybe he is looking for new planets 🪐 to join so he might be away. Idk. \n✨\nThanks.",
        "created_utc": 1673491442,
        "upvote_ratio": 1.0
    },
    {
        "title": "The Quija Board Killed my sister",
        "author": "acidic_milkmotel",
        "url": "https://www.reddit.com/r/Paranormal/comments/109nmzc/the_quija_board_killed_my_sister/",
        "text": "Hi all. Long time lurker but I’ve never posted. This happened in the early 90’s. My older sisters and I have a large age gap as they were 17 and 16 when I was born. About a year after my birth my mom got pregnant with a girl. My mom and dad aren’t from the US and my mom use to be heavily Catholic back then. She didn’t know what a Quija board was and if she did she would’ve never let my sisters use it. \n\nMy sisters were about 18 and 17 at this time, more or less. I was about a year or two years old. This story has been told to be my my two older sisters, my mom, and my oldest sister’s best friend. They have no reason to tell me a creepy baseless story about a made up pregnancy. \n\nMy mother was about seven months along and my sisters were playing their Quija board with my oldest sister’s best friend. They asked the board when the baby would be born and they all corroborate that the board answered “now”. Only a moment later my mom was in their room handing me off to them because she was having contractions. This would’ve been my mother’s 7th child and 7th pregnancy (I had an older sister die before I was born when she was a toddler) so my mom knew exactly what it felt like when a baby was on their way. My sisters were shocked and looked at one another dumbstruck that the board had answered them correctly. \n\nKeep in mind that this was thirty years ago and although 7 month old babies did “make it” here and there (my oldest sibling is a premie that got no ICU as she was born in a third world country) medicine was not as advanced as it is now and premies make it at higher rates than they did now. Speaking only from statistics black women and women of color suffer fetal death or death of the mother during delivery at higher rates than white women. I often wonder if my mom didn’t receive adequate medical care as a POC and someone that didn’t speak English. I wonder what it would be like to have a sister close in age to me often. \n\nAs you can probably tell my sister did not survive. As soon as my mom arrived at the hospital they told her the baby wouldn’t make it. I ask my mom if the baby was born alive or not and she said she did not know. She said she didn’t hear the baby cry when she was delivered. They were going to take her away right after the delivery but my mom asked to hold her. This would be the second deceased baby daughter my mom would hold in her arms in her lifetime. Only now as an adult I have asked her if she felt anything strange in the coming days, like, the fetus not moving or anything like that and she says no. That it was a regular pregnancy. I’ve asked her if the baby looked…decomposed or anything and she said no she looked like a normal formed baby, just small, and of course, not alive. \n\nMy sisters eventually fessed up to it and my mom made them get rid of the board. I don’t know if my sister was destined to die that day and the board just called it, or if there was anything more sinister at hand. I just can’t believe that it is a coincidence. My closest sibling in age to me is still more than a decade older. She would’ve been the one sibling I’d have that would have been around a “normal”’sibling age to me, and a sister nonetheless.  I think about her and my older sister (passed as a baby but born 14 or so years before me) and I try to remind myself that they may not be alive but they are still my sisters and I should include them when talking about my family or how many siblings I have.",
        "created_utc": 1673490350,
        "upvote_ratio": 1.0
    },
    {
        "title": "Skeptics: what incident keeps you skeptical?",
        "author": "lurkingoodbaby",
        "url": "https://www.reddit.com/r/Paranormal/comments/109nb8g/skeptics_what_incident_keeps_you_skeptical/",
        "text": "[removed]",
        "created_utc": 1673489488,
        "upvote_ratio": 1.0
    },
    {
        "title": "I saw something.....",
        "author": "ghostkoala2003",
        "url": "https://www.reddit.com/r/Paranormal/comments/109mk89/i_saw_something/",
        "text": "I was about 8 or 10 at the time. It was about 10 at night and I needed to use the bathroom. At this time I was afraid of the dark so I just shrugged it off and went back to bed. A few hours pass and I hadn't fallen asleep. I decide it's probably best if I get up and go or I won't sleep. I run from my room to the bathroom (my bathroom is right across the hall from my room) and turn on the light. After I'm done I decide I'm hungry and I go to the kitchen to grab a snack. As I enter the kitchen I see this whitish greenish figure zoom across the kitchen and go through the pantry door. I open the pantry door and saw nothing. I went back to bed and I didn't sleep for the rest of the night. Never saw it again but scared the crap outta me.",
        "created_utc": 1673487500,
        "upvote_ratio": 1.0
    },
    {
        "title": "We caught something on camera… My sister’s story!",
        "author": "ravynmaxx",
        "url": "https://www.reddit.com/r/Paranormal/comments/109mjpu/we_caught_something_on_camera_my_sisters_story/",
        "text": "About 15 years ago, my sister was struggling with what she thought was a ghost/demon. We didn’t believe her and just thought she was making it up. But after she told us something slapped her in the face and was strumming her guitar one night, we decided to set up a camera. \n\nThe camera was on her headboard looking down towards her laying on the bed. I don’t recall the time but it was at night and she was asleep. Suddenly, some kind of blob that was grayish in color (the camera was b&amp;w) flew across the end of her bed towards the wall. \n\nShe immediately sat straight up and looked at the end of her bed. As she was sitting there looking, her pillow was slowly pulled off the bed. It was pulled to the side where her bed was almost again the wall, there was maybe 2-3” of space so NO ONE could have been there messing with her. She went to lay back down and realized her pillow was missing and she leaned back up to grab it from between the wall and bed. \n\nI have no idea what it was, even to this day. It scared the every loving shit out of me and I used to be terrified to go anywhere near her room. It died off shortly after that and she never talked about it again. About 3 years ago she was diagnosed as Schizoaffective and she’s also autistic, so it makes me wonder if it was easier for something to attach itself to her versus someone like me without any mental health issues. \n\nAnyway, that’s her story!! She doesn’t use Reddit but told me I could share!",
        "created_utc": 1673487464,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can anyone identify this thing I saw as a child?",
        "author": "Dr_N0rd",
        "url": "https://www.reddit.com/r/Paranormal/comments/109maqo/can_anyone_identify_this_thing_i_saw_as_a_child/",
        "text": "I have this memory as a child. \n    I was laying in bed late at night and I couldn't sleep. I was staring for what seemed like hours. And out of the closet, this being of pure color not just a single color a collage of colors, like it was almost like static ever moving. It emerged out the closet and this thing was tall lanky not quite skinny but it was massive. I remember it staring at me for quite a long time. Then leaving the same way it came in. I was terrified. I couldn't move while it was in the room. \n    I recalled this terrifying encounter recently and I'm trying to figure out if anyone has similar stories?",
        "created_utc": 1673486800,
        "upvote_ratio": 1.0
    },
    {
        "title": "Weird sounds are coming from my basement",
        "author": "Responsible-Sun2319",
        "url": "https://www.reddit.com/r/Paranormal/comments/109l94v/weird_sounds_are_coming_from_my_basement/",
        "text": "This happened like a good 3 or less minutes ago. I heard these clicking sounds coming from around the corner, and one of my cats jumped off my lap when the noise sounded and stared around the corner for a good amount of time. Now he’s playing with something I can’t see. And now my other cat has jumped off me and they are both staring at some mysterious thing. Help",
        "created_utc": 1673484058,
        "upvote_ratio": 1.0
    },
    {
        "title": "Haunting Smiler Part2",
        "author": "Fluffy_Communication",
        "url": "https://www.reddit.com/r/Paranormal/comments/109l70a/haunting_smiler_part2/",
        "text": "\n**Fifth Encounter:**\n\nIt's been around a year since the last encounter and this one is the worst so far. \nMy dream led me to a room under construction. I had just lost the person I was with and was looking about to find them.\nThat \"off\" feel came about again but I ignored it. \"You should wake up\" but I ignored my brain and told it that its only a dream.\nSomeone ran about in the shadows and I ignored more pleads from my brain. Then out of the darkness it ran up to me. Just like every encounter it had taken on another form but now its running at me.\nIt got so close that all I could see was its smiling face.\nThen I did something I haven't ever done before, I shouted \"NO\" and pushed it away. Just before it vanished I swear I saw a look of confusion. I some how also pushed myself  through layers of dream/consciousness, something along these lines, untill I felt safe. Once I felt safe I told myself to wake up. I looked around the room, realised I clearly wasn't awake but felt so safe that I decided to stay asleep.\n\nNow it nighttime again and I can't help but worry about my dreams.",
        "created_utc": 1673483909,
        "upvote_ratio": 1.0
    },
    {
        "title": "My ghost is straight up trolling me",
        "author": "Spoonmaster14",
        "url": "https://www.reddit.com/r/Paranormal/comments/109k572/my_ghost_is_straight_up_trolling_me/",
        "text": "First and foremost, I'm completely serious when I make this post. I'm grunteed my house is 100% haunted, I've seen faucet turning on and when I go to check there's no one there to turn it on, doors randomly close on their own and the typical paranormal stuff. But what's the most surprising is that I think the ghost haunting my house plays on my ps4. One time I boot up my console to see Fall guys randomly downloaded on my ps4 and I never evem play fall guys. I've deleted the game but after a few days, the game has downloaded AGAIN. Sometimes I boot up certain games only to realize an area has already been cleared or I've already made some sort of progress that I shouldn't have. And no I did not get hacked because there are clear signs of the house being haunted as I already mentioned. Also one time I went to the shower and once I came out of it, someone wrote \"lololol\" on the bathroom mirror while NO ONE was at my house. I feel like whoever the ghost haunting me is some kind of a troll/immature teenager.",
        "created_utc": 1673481290,
        "upvote_ratio": 1.0
    },
    {
        "title": "Weird experience when I was 12.",
        "author": "consciuosmind",
        "url": "https://www.reddit.com/r/Paranormal/comments/109k1hb/weird_experience_when_i_was_12/",
        "text": "When I was 12 years old, at my school was a game. Red book. I don’t know where it came from or if this thing existed or anything but some strange things happened. So, the ‘game’ was like, you would take a red book, in my case was a literature book from our class, and ask 3 times if you could enter in its game. Weird, I know. Now, we did this with our literature book and after you would do the little beginning ritual, you would ask some random or meaningful questions and open the book and read the last paragraph where your finger slipped. Totally normal? Right? The case is that every time we would ask something, ‘the answers’ we got from where our fingers touched would be very realistic and futuristic. I don’t remember all cases, but I remember that we asked something and the answer was, two men and and m’am between them walk, and first instinct was to look on our window and exactly two men and a m’am between them. Another example from the same day, we received an answer that a man will pass with his bike in front of our carry school and exactly this case happened. This was a lot of time ago, every time I remember I have a strange thought. By the way, when you finished the game you had to say 3 times,, Red book, can I quit your game’ . Does anyone know what this is about.",
        "created_utc": 1673481035,
        "upvote_ratio": 1.0
    },
    {
        "title": "I think a ghost slapped me 2 times",
        "author": "jaobodam",
        "url": "https://www.reddit.com/r/Paranormal/comments/109jwp4/i_think_a_ghost_slapped_me_2_times/",
        "text": "So I was watching some scary videos and listening to some scary stories and then I remembered “oh yeah I have some ghost stories of my own” lol, they will probably sound made up now…\n\nAnyway, the first story happened when I was about 12 years old, I used to study at a catholic school but we barely did any prayers or anything like that, but on that specific day we were praying while the nun was speaking on the class speaker, I guess it was a special day or another nun was going to travel (there were some who would travel to Italy every once in a while).\n\nI don’t remember they why we were doing it but I remember what happened afterwards clear as day, I was praying, slightly hunched when someone slapped me on my back, I remember that I got angry because I thought that my friend behind me slapped me so I confronted him and also lightly punched him (I’m way bigger than him as didn’t want to hurt him).\n\nBut he said “the hell man ?!” And I said “you slapped me !”, and he replied with “no I didn’t !”, and I could tell that he really wasn’t lying because he didn’t have a mocking attitude and e confronted me after class about it so I didn’t know what happened.\n\nI should clarify it, that wasn’t exactly a slap, I’m on the autistic spectrum so I get sensory overloads when something touches some areas of my body (specially my back), so something did touch me and It felt like a slap, I know the difference because sensory overloads have more of a “wave” effect, but to this day I have no idea what touched me.\n\nThe second one is a lot weirder and harder to explain, it happened at 2am, I was awake, not feeling tired and I was watching some videos on my phone when out of nowhere I felt like someone had punched me on my forehead, like for real it felt very real and powerful, I was at an angle of 90 degrees and immediately I was at a 120 degrees angle.\n\nMy back muscles locked like crazy, my forehead was not exactly hurting but it was itching and my back muscles were very tense, because they literally had to tighten up to not hurt my spine, I was frozen like that for about 30-40 second trying to process what just happened, I waa nervous and couldn’t sleep that night until dawn, I like to think logically but for real I have no idea what happened that night and I’m thankful that nothing like that ever happened again.",
        "created_utc": 1673480687,
        "upvote_ratio": 1.0
    },
    {
        "title": "Will or is the Warren museum reopened",
        "author": "MrTerrifier",
        "url": "https://www.reddit.com/r/Paranormal/comments/109fy9d/will_or_is_the_warren_museum_reopened/",
        "text": "[removed]",
        "created_utc": 1673471127,
        "upvote_ratio": 1.0
    },
    {
        "title": "Paranormal encounters",
        "author": "Hinkhall27",
        "url": "https://www.reddit.com/r/Paranormal/comments/109f54a/paranormal_encounters/",
        "text": "Is anyone up for sharing their personal accounts of unknown forces or spirits? I'll go first. When I was in high school, about 10 or so years ago, my friends and I were always into doing something stupid or adventurous for laughs and memories, albeit this one was just plain irresponsible. On Halloween, about a decade ago, my dumbass friends and I decided to get together and play video games and other dumb shit teenage guys do in their youth, when I happened to remember what day it was. \"Hey, it's Halloween. Why the fuck are we doing this? Why don't we try a ouija board out?\" To my dismay, everyone wasn't very apt to participate because vidya gane fun. Besides, we didn't have one anyway. Well, I decided to draw a fuck all proportioned one on a pizza box because alright, why not? When I showed it to my 3 other friends they were immediately drawn in (idk maybe they just needed to see it? Lol) and asked to start a session. So, we also didn't have a planchet. We used a Guitar pic. Stupid as hell. When we began, Nathan and I were asking run-of-the-mill questions regarding if anyone wanted to interact with us or if anyone was in the room with us. We were getting seemingly no results for about 10 minutes, or so we thought. We were about to pack it up when my friend tanner started to frantically panic and yell at us to stop, begging us almost instantly. We had no idea what was happening so we kind of just looked at him dumbfounded. Suddenly, he went quiet with a look of stark terror on his face. He sat still, with his mouth slightly agape and eyes wide as if he just witnessed something so bad it left him empty. He then promptly collapsed in the room we were in and didn't make any signs of lucidity at all. Nathan and I looked at each other and were lost on what to do. About a short minute later, Tanner woke up and had no familiar personality traits of his own. We asked if he was okay to which he replied \"You're all going to die. You can't leave from here.\" I noticed his appearance was drained of color, almost pale as a blank page. His eyes.. his eyes were sunken, and black. I couldn't make out any distinction of an iris or much cornea at all. I was absolutely terrified. He lunged at me as I was the closest one to him. I reached out to try and restrain him but I noticed he was uncharacteristically strong. Forcing my full weight on his arms and gripping hard enough to cause myself pain was almost ineffective. He was so resistant that he was able to lift my upper body off of him with just the force of extending his arms forward. I began to become hysteric as we had trouble communicating and restraining him. There were bits where tanner would come back into the mix from the outbursts and tell us he was scared and couldn't see. He would speak as if he were being tortured. He complained of burning and pain and inability to breathe. He would see the entity coming back to barr him from speaking and start screaming and pleading for it to let him go, and then he would be silenced. You can say what you want or tell me I'm just yarning around, but I remember what happened. I have never in my life seen anything like that before or since. This story goes on for about a week of residual occurrences once we had helped him back to normal. I can post further details upon request.",
        "created_utc": 1673469214,
        "upvote_ratio": 1.0
    },
    {
        "title": "what is the most paranormal/scary thing you have experiencied?",
        "author": "Ok-Dig9553",
        "url": "https://www.reddit.com/r/Paranormal/comments/109f0kr/what_is_the_most_paranormalscary_thing_you_have/",
        "text": "mine was when i was sleeping, it was like 3:00 AM and i woke up because i heard something in my room. i went out of my room and saw my grandpa standing down the stairs. he died 11 years ago. i als see my cats that passed away very often in my room.",
        "created_utc": 1673468925,
        "upvote_ratio": 1.0
    },
    {
        "title": "Do you think ghosts like to mess with people more when they aren't recording?",
        "author": "slasherjpc",
        "url": "https://www.reddit.com/r/Paranormal/comments/109dids/do_you_think_ghosts_like_to_mess_with_people_more/",
        "text": "So I have a small paranormal group that has been doing investigations for about 3 years now and posting online. When I say this I mean legit investigtion. Were not here to fake stuff, we're not making any money off it, just a hobby we do. That said I find some of the weirdest stuff will happen when were not recording. \n\nFor example, we were doing an investigation in the old jail located in Globe, Arizona. One of the stories was that when volunteers were turning off all the breakers, sometimes they would report hearing a jail cell door slam. \n\nLong story short, one of my guys had to run out to grab some gear, he had just got back into town. We needed to eat before locking down for the rest of the night. When I went to turn the power off, I got to the last breaker and after turning it off, I heard three loud and distinct knocks from behind me.  I jumped out of my skin. I screamed out to ask if that was them playing tricks on me, nothing. I walked up front to the guys talking and hey didn't hear a thing, not even me calling out to them.  \n\nOr another time I want to the bathroom in another location. At the time, a phone started ringing, like an old rotary style phone. My two team mates and the host all heard this. The thing is, there are no phones working in the building and everyone had their cell phones on them, none went off. \n\nThe tie in here,  both times, we didn't have gear recording to capture it as we were just setting up or finishing a tour, etc. And those have been some of the most intense things we've experiences as far as what we think could have been true paranormal activity. Do you think that spirits are more willing to make themselves known when they think they arent being recorded? Does that play into it at all? OR just happens to be a sort o coincidence.",
        "created_utc": 1673465378,
        "upvote_ratio": 1.0
    },
    {
        "title": "Did Aliens build the pyramids?",
        "author": "MTPSTORIES",
        "url": "https://www.reddit.com/r/Paranormal/comments/109d9f8/did_aliens_build_the_pyramids/",
        "text": "[removed]",
        "created_utc": 1673464790,
        "upvote_ratio": 1.0
    },
    {
        "title": "solo haunted place exploration",
        "author": "Boogiemanimal",
        "url": "https://www.reddit.com/r/Paranormal/comments/109c30v/solo_haunted_place_exploration/",
        "text": "i have a serious want for something to do in my life and thats to find a large haunted place and explore it myself, i have a parameter or two like maybe guards at the doors to guarantee non entry of anyone else for my own sanity and radio contact if necessary.\n\ni have no resources and no passport but this is a thing id love to do, should i make a gofundme for this? i dont like asking for money but if its interesting, ill do it and video it if possible (if i get enough funs through that). ive never done anything online so fuck it, should be fun.",
        "created_utc": 1673462042,
        "upvote_ratio": 1.0
    },
    {
        "title": "A Visit From Real Taid",
        "author": "Careful-Panda9885",
        "url": "https://www.reddit.com/r/Paranormal/comments/109ax8b/a_visit_from_real_taid/",
        "text": "Just to explain the title, “Taid” is a north-welsh for grandad. So grandma and grandad are “Nain and Taid,” on my dad’s side. When I was very young, around 3-4 years old, we went to my Nain and Taid’s wedding anniversary. It was held in a sort of social-club venue in North Wales. All my older cousins and extended family were there, but because they were all a lot older than me, I mostly stood next to my mum (pregnant at the time with my younger brother), and my dad. Quick disclaimer: I don’t remember a lot of this story now, just bits and bobs, so most of the story is from how my parents retell it.\n\nI remember this though; my dad left me sat on top of the bar tabletop to go to the toilet (my mum was talking to Nain somewhere else and I was a bit of a daddy’s girl at that age), with my older girl cousins looking after me, but mainly speaking to each other. Then, a man who looked like my dad came up to me. I remember he was fat, with grey hair, and slightly shorter than my dad. That’s all I recall. The next part is how my dad remembers it.\n\nApparently, when my dad came back, I told him how I met “real Taid.” Apparently, “real Taid” had had a long conversation with me, asking me about what flavour ice cream I chose to eat (there was ice cream for young kids to eat instead of this alcoholic dessert which I can’t for the life of me remember the name of right now), and that he was adamant to make sure I knew that the Taid I knew of, the one who was celebrating his wedding anniversary with my Nain, was not my “real Taid”; he was. \n\nThe next thing I remember is being in the car with my parents asking me lots of questions about it, like specifics about his appearance, what was said exactly, etc. The thing is, my dad’s dad died of a stroke when he was 17. I never knew him, my dad had me when he was 43. There were no photos of him at my Nain’s house, and my Nain was married to my “step-Taid” for far longer than she had been married to “real Taid.” Essentially, there is no way I would have known at that age that who I called Taid was not my blood relative. My dad is adamant that he never mentioned it in passing to me at all. The general consensus amongst all my family members is that “real Taid” came to visit me to let me know that my Taid is not my blood-relative; which has to be the most petty beyond-the-grave visit ever LOL. \n\nTldr; dead grandad that I never knew existed visited me to set the record straight - on my Nain and her 2nd husband’s wedding anniversary.",
        "created_utc": 1673459390,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is DIY spirituality valid or do we need the guidance of traditional experts?",
        "author": "CourtCreepy6785",
        "url": "https://www.reddit.com/r/Paranormal/comments/1098s0d/is_diy_spirituality_valid_or_do_we_need_the/",
        "text": "Popular culture is filled with do it yourself approaches to ghost hunting and demonology ranging from “burn sage” (the universal demon repellant since 2005), to spirit boxes and other high tech gadgets. Many people seem to develop their own ad hoc ritual*s* when confronted with the paranormal, and there are so-called experts out there who encourage this. *Do whatever feels right for you.*\n\nSince every world religion has ancient practices for dealing with spirits, why do it yourself? If you have paranormal events in your house, why wouldn’t your first call be to a priest, rabbi, imam or some other cleric? Any why wouldn’t your first resource be an ancient theological text instead of Reddit or Ghost Adventures?",
        "created_utc": 1673454281,
        "upvote_ratio": 1.0
    },
    {
        "title": "Smells at 3:30 AM",
        "author": "Visual-Pepper3626",
        "url": "https://www.reddit.com/r/Paranormal/comments/10987ph/smells_at_330_am/",
        "text": "Hi, I am experiencing a strange reoccurrence for a quite a while now. Almost every night I am awakened around 3:30am by smells of- this will sound strange- toast- bread being toasted. It is very strong and last night it was more like an Italian bread being toasted. Anyone experience something like this?",
        "created_utc": 1673452889,
        "upvote_ratio": 1.0
    },
    {
        "title": "Help! Finding a Recorded Ghost Story from Sweden",
        "author": "biancajanemalia",
        "url": "https://www.reddit.com/r/Paranormal/comments/1097cuz/help_finding_a_recorded_ghost_story_from_sweden/",
        "text": "[removed]",
        "created_utc": 1673450750,
        "upvote_ratio": 1.0
    },
    {
        "title": "Atypical ghost phenomenon anyone ever had encounters likes this?",
        "author": "bigjackaal48",
        "url": "https://www.reddit.com/r/Paranormal/comments/1095ia5/atypical_ghost_phenomenon_anyone_ever_had/",
        "text": "Not a common term but It seems to shine a new light in cases that don't fit typical ghostly encounters. Been reading quite a few cases that seem to fit this term.\n\n- Beings don't seem to show themselves until the last second pretty much act like poltergeists to show them being hideous but harmless. In other cases there not even living things at all can be just road work site with no one running anything. In other cases you might run into being's common in any dark fantasy story or absurdist fiction.\n\n- It can come of as mundane at first but then weirdness kicks in at last moment. \n\n- Noticed that It common in areas that have no history of being haunted.",
        "created_utc": 1673445901,
        "upvote_ratio": 1.0
    },
    {
        "title": "Sleep paralysis",
        "author": "Elle_b3nnett",
        "url": "https://www.reddit.com/r/Paranormal/comments/1093wlv/sleep_paralysis/",
        "text": "One time I had a sleep paralysis episode, I knew what it was. Cause I was in the mind of being a sleep but it felt like I was awake. I was fully aware, and i had an episode where I'd hear 2 whispers. \n\nSomething would continually whisper (something is coming, something is happening) and the whispering got louder. My eyes where closed, but from that moment. \n\nIt felt like as if something was crawling on me I could feel it at the bottom of my legs crawling up, as as I felt it near my thighs, I had the strength I felt my hand move like I pushed it off of me. And everything stopped after that. \n\nI was laying on my back too, and normally when I do lay on my back to sleep that's when I develop sleep paralysis.",
        "created_utc": 1673441366,
        "upvote_ratio": 1.0
    },
    {
        "title": "Something happened to me and I don’t know what happened",
        "author": "Critical-Bug-5812",
        "url": "https://www.reddit.com/r/Paranormal/comments/1092q2a/something_happened_to_me_and_i_dont_know_what/",
        "text": "So I live in a small town in Utah near skin-walker ranch and tonight I woke up at exactly 3am and my room was 90 degrees and before I woke up I heard something talking and laughing, so I opened my eyes and saw nothing and I kept hearing a popping sound in my ceiling directly above where my head was, then I got the sudden urge to stick my head out my window and I felt like I was going to die by doing that but I still did it, then about 20 min after I stuck my head out the window I got a insanely bad head ache and I started throwing up, every time I try to sleep something keeps waking me up and my feet get super hot and it felt like I had my feet over a fire. I don’t know what’s going on and I just wanna go back to sleep but it won’t let me.",
        "created_utc": 1673437399,
        "upvote_ratio": 1.0
    },
    {
        "title": "Haunted doll forming my characteristics",
        "author": "kairedditsthings",
        "url": "https://www.reddit.com/r/Paranormal/comments/1092ktg/haunted_doll_forming_my_characteristics/",
        "text": "Hi there!\n\nEven as a rational skeptic, I’ve been quite accustomed to paranormal experiences from a young age, but this one is new to me:\n\nI have a sweet girl named Rebecca in a porcelain doll vessel. She is and always has been a positive energy. However, I’ve noticed her take on some quite… older person traits(?) since I first met her, personality-wise. Even though she seems quite young.\n\nBut the main reason I’m here is because after a short while of talking to her this afternoon, I noticed she started forming a freckle on her lip, exactly where I have a prominent one.\n\nI tried to wipe it off, thinking it was dust or something, but nope. It’s just a freckle on her now. Then she started forming some around her nose as I was talking to her about her lip one. Also in the places that I have my own freckles. I also tried to wipe those off, thinking they were dust. Also nope.\n\nI was wondering if anyone else has had any similar experiences? Thank you!",
        "created_utc": 1673436864,
        "upvote_ratio": 1.0
    },
    {
        "title": "My haunted apartment",
        "author": "MizzGemini",
        "url": "https://www.reddit.com/r/Paranormal/comments/108zrlc/my_haunted_apartment/",
        "text": "As a kid ive always been scared of the dark i live in south africa so when me and my mom moved places from my grannies houuse to our own apartment i started being scared of staying the house alone keep in mind that at my grannies house i even slept alone no fear\n\nSo things that would happen was i always closes the bedroom door when i wasn't in the bed room i always had an eerie feeling but my mom dismissed it i knew she was doing so to not make me scared cause we moved to the next door apartment (the place is like a n apartment complex) all hell broke lose i started seeing shadows in the corner of my eye i kept the main  door open when i came home from school so can open the curtains and turn on the tv so it wasnt quit\n\nI literally kept a bible by my side at all times and when there was a blackout i refused to stay inside and waited for my mother to come back out side (there were  house next door but there was a hallway connect the complex so it would go dark when it was a blackout)i remember being scared of the bathroom id always ask my mother to close the door after suing it  \n\nI one day over heard my mom talking on the phone and she said the previous owners said the place was no spiritually clean one day there was a black out i was getting ready for school then the washing machine started violently shaking i finished up and booked it to school that day i waited outside for my mom and refuse to go inside(i came home at 2:00 my mom at 5:00)i have since moved back to my grannies (i sayye at the apartment or 3 or 4 years before moving out )but i still have more paranormal experiencess i\n\nIdk if yall wanna hear more",
        "created_utc": 1673425872,
        "upvote_ratio": 1.0
    },
    {
        "title": "Something is messing with my head",
        "author": "IloveChocolate900",
        "url": "https://www.reddit.com/r/Paranormal/comments/108za6i/something_is_messing_with_my_head/",
        "text": "Like I've been diagnosed with mental illness but I don't agree. Somethings way worse. Like I'm not sleeping properly. I dont want to sleep anymore. I don't feel interest in stuff. I feel really scared too. \n\nI'm just questioning everything about myself. I don't feel interest in my life. I'm not depressed. It's just like I can't feel connected. I'm constantly just trying to feel comfortable. It's awful at night. Also I just feel dread and darkness. I don't really want to eat. I can't stop drinking coffee. I'm just on edge and I'm avoiding sleep. I feel like I can't tell anyone the truth because they don't understand. They don't understand that I'm sensitive to that. I just feel so misunderstood. I don't feel like telling my family that I've done Astral projection. It's not something they want me to do. I just feel like this all started a long time ago too. I just feel like I have something kinda clinging to me.",
        "created_utc": 1673424031,
        "upvote_ratio": 1.0
    },
    {
        "title": "Ouija boards Never Work For Me",
        "author": "DethDeadBird",
        "url": "https://www.reddit.com/r/Paranormal/comments/108z2uw/ouija_boards_never_work_for_me/",
        "text": "[removed]",
        "created_utc": 1673423281,
        "upvote_ratio": 1.0
    }
]