[
    {
        "title": "Non Believer had things happen I can't explain",
        "author": "Universe4087",
        "url": "https://www.reddit.com/r/Paranormal/comments/10fxmgk/non_believer_had_things_happen_i_cant_explain/",
        "text": "Non-Believer but had stuff happen I couldnt explain\n\nSo I'll say I'm a non-believer in all things spiritual, demons, ghost, god, etc etc. I'm 24 now the events I'm going to describe were when I was around my teenage years like 15-18 when still living with my parents.  \n\n\nSo the first thing was I'm not sure if this paranormal related or not. But I woke up with scratches alot, not like little scrapes or anything from just everyday activity, but like deep long scratches that looked almost like claw marks, usually in sets of 3 or 4. They were all over my body in random places. When I asked my parents about them they just said \"oh your probably scratching yourself in your sleep or something don't worry about it. But I kept my nails trimmed and couldn't replicate them while awake.   \nThey continued appearing until I moved out of the upstairs bedroom into the now finished basement.   \n\n\nThe second event also in the same bedroom, was I was 16 I think?  I was having trouble sleeping one night, I regularly and still do have some minor sleeping problems, but most nights I slept with my door closed for whatever reason I left it open that night, must have just forgot to close it or something. Anyway I'm tossing and turning I look at my phone its like 3:45am, I'm like Shit i gotta be up for school soon. So I roll over in bed about to go to the bathroom, and I look at my door and there was a white figure, almost looked a man with no face, wearing some kind overcoat, leaning in my door just staring at me. It scared the hell out of me. I rolled back over and kept my head under the covers, checking every so often it was still there just staring at me. Eventually I just passed out and my alarm woke me up for school and it was gone in the morning.   \n\n\nAnyway those were my experiences sorry for the long post, just figured I'd share get some thoughts and opinions. I chalk up the second encounter to lack of sleep, but the scratches I still cant explain.   \n\n\nThanks for hearing me out!",
        "created_utc": 1674121085,
        "upvote_ratio": 1.0
    },
    {
        "title": "ghost dog whimpering???",
        "author": "fairyhorsegirl222",
        "url": "https://www.reddit.com/r/Paranormal/comments/10fvckr/ghost_dog_whimpering/",
        "text": "today me and my partner were in the living room and heard a dog whimpering. \n\nwhich wasn’t unusual because our roommate has a dog. and we thought it’s obviously hers.\n\nLater tonight my partner and roommate were leaving work and my roommate asks if they can stop and pick up her dog from her aunts house. \n\nHer dog wasn’t even home. So what the hell did we hear. \n\nTHE WEIRDEST PART YET IS. \n\nThe other night my roommate was asleep with her dog in her room, when her dog started whimpering from the floor, like she wanted to be let on the bed. \n\n\nShe calls her dog and tries to get her to jump on the bed. And then she realizes that her dog is right next to her. \n\n\nWe are a little freaked out rn",
        "created_utc": 1674112184,
        "upvote_ratio": 1.0
    },
    {
        "title": "Would Anyone Be Interested In Potential Chicago Based Ghost Squad?",
        "author": "Clear-Section7636",
        "url": "https://www.reddit.com/r/Paranormal/comments/10fu53b/would_anyone_be_interested_in_potential_chicago/",
        "text": "[removed]",
        "created_utc": 1674108016,
        "upvote_ratio": 1.0
    },
    {
        "title": "Wondering what I could have seen",
        "author": "Shelly_Kelly",
        "url": "https://www.reddit.com/r/Paranormal/comments/10fu4jf/wondering_what_i_could_have_seen/",
        "text": "So I met this person when I looked at them in the eyes I saw a misty, dark, shadow drift away from them into the darkness. It had a darker dense looking center and a misty grey outlining it. And I am just wondering what that could be? And also if it could be afraid of me because it drifted away when I came over?",
        "created_utc": 1674107995,
        "upvote_ratio": 1.0
    },
    {
        "title": "Need help with ouija board.. nothing is working 🥺",
        "author": "Fit-Marionberry3506",
        "url": "https://www.reddit.com/r/Paranormal/comments/10frbty/need_help_with_ouija_board_nothing_is_working/",
        "text": "[removed]",
        "created_utc": 1674099259,
        "upvote_ratio": 1.0
    },
    {
        "title": "Ever since I was a child something has been following me",
        "author": "54321RUN",
        "url": "https://www.reddit.com/r/Paranormal/comments/10fqu0g/ever_since_i_was_a_child_something_has_been/",
        "text": " \n\nWhen I was 6, we moved into an old house, and I used to hear all kinds of noises at night, like banging on the walls, or footsteps coming up the stairs. But as I got older the footsteps got closer until one day while I was in bed, I heard the door open and close, then someone walked over to my bed and sat down right-on top of my legs, I thought it might have been my dad or mom, but I wasn’t going to find out. I carefully tried to pull them out without them knowing but I couldn’t they were too heavy, so I just lay there terrified until I eventually fell asleep. \n\nI asked my parents the next day who was sitting on my bed, but everyone denied it. The next night it happened again, and the night after and so on. I was always too scared to look, until one night my dad was supposed to bring me home a gift but went out for a drink on the way home and was late, so I had to go to bed. But I couldn’t sleep every noise I heard I thought it was him, then I heard footsteps up the stairs, then the door opens, and he walks over sits down on my legs. This time I was sure it was my dad so I threw the blanket off and jumped up, but there was no one there and when I looked down at my legs there was an ass sized shape on my legs. Without thinking I tried to pull them out, suddenly the ass sized dent started moving as if some unseen person was trying to get more comfortable. \n\nAs I got older the closer he got to me until one night he lay down beside me and put his hand around me. I was freaked out, but too scared to move so I just lay there too scared to even breathe, I would have believed it was a real person if I had not locked the door with a key like I did every other night.  \n\nMy parents never believed me, not even after I woke up with deep cuts on my back, but they did take me to a doctor. Which did not go well for them because they got accused of hurting me even though I swore that it wasn’t them and that I just woke up like that. I still have the scars today but now I lie and say that I just fell, which people still don’t believe because they look like whip marks. What happened next is a very long story. \n\nBut now I am 40 and have kids of my own, my youngest is 12 and something is following her ever since she was a baby when we heard it talking to her on the baby monitor. \n\nThe whole family seen it multiple times, it’s the shape of a little girl, but I don’t think it is. We often see it hiding in her room or running past the kitchen door, we tried moving 3 times, but it keeps following her. I am afraid the same thing that happened to me will happen to her and it will be all my fault.",
        "created_utc": 1674097821,
        "upvote_ratio": 1.0
    },
    {
        "title": "Woken up by warm, clammy hands grabbing mine.",
        "author": "AdAfraid8844",
        "url": "https://www.reddit.com/r/Paranormal/comments/10fqsjw/woken_up_by_warm_clammy_hands_grabbing_mine/",
        "text": "I’ve noticed since we’ve moved into our house I’ve experienced a lot of “activity”. Nothing scary, just noticeable. Typically I feel pressure near my feet, like a cat or dog laying down - our pets don’t sleep in our room. \nWhen I fall asleep at night I’m super weird about leaving my hands outside of the covers, it creeps me out. I always sleep on my side with my back to my husband. This specific night my hands were outside of the covers, fingers curled loosely into my palms. I felt a warm, clammy embrace - as if someone facing me slid their fingers in between my fingers and palms. Once I realized what I felt I screamed and jumped up. My husband half woke up and asked if I was ok. I was, but I was completely shook.  I can’t explain it. I haven’t experienced anything like it since, but now  I never leave my hands out..",
        "created_utc": 1674097709,
        "upvote_ratio": 1.0
    },
    {
        "title": "My friend got possessed and now has an attachment",
        "author": "Kkcassie12345",
        "url": "https://www.reddit.com/r/Paranormal/comments/10fpwtx/my_friend_got_possessed_and_now_has_an_attachment/",
        "text": "One of my friends lets call them CC got possessed by a spirit ill start from the beginning\n\nWe were all cereus about ghosts and stuff and decided to do some hunting in my friend H's basement and we were using rods and asking questions it was small questions like are there spirits here and stupid stuff like that well that question said yes and me and CC started to feel strong senses of anxiety I feel like I'm going to throw up so we say something and they ask if there are bad spirits and guess what it said yes we asked who the spirit was here for and it said CC  we all go upstairs and CC decided to stay down stairs where H gave me a chain neckless that had a bottle of moon water tied to it shut with a cork and when we go back down and CC is laying back on the couch with there eyes closed we have a Simi hard time waking them up but we do a little later they were standing as we asked more questions and then they sit down this is when we think they got possessed because that is the last thing they fully remember they end up going and sitting on the couch a little later and ask questions for CC the bottle of moon water falls off the neckless so we try to get CC upstairs and my friend we'll call them K puts there had on CC's back to push them on so we can go up stares and CC says \"Don't touch me\" in a series voice so K backs off and CC goes up on there own everyone creeped out Me and CC are sitting on  bed and I give H the bottle and chain and the water spills on her the cork had fallen off so one person stays in H's room with me and CC since we were the most affected the others go to the bathroom to talk about what to do before they tell us the plan H proceeded to throw salt on all of us and when they get to CC they lunged for H grabbing the arm that had the salt and pushing it to the wall and with the other hand going for either H's heart or throat I could not tell which and it is decided that me and CC either go home or we move locations we all decided to move locations there were three cars I had me and 1 other in my car another person had just CC in there car and the rest were in the last car H and another friend could not go CC later said that she was having a strong urge to turn the steering wheel off the road(they were not driving they were in the passenger seat) once we get to the other location we get the rods out and start asking questions by this point CC was there normal self we could tell that the energy was lower in this location which K's house but we ask anyway we ask if the spirit that was with CC is here now (btw it was so low that only CC could hold the rods) and we ended up coming to the concussion that CC was not safe that night but it was a school night so we could do nothing I drive her home and get a flat tire on the way so my Parental had to come and change the tire in the rain I seen that as a bad omen or something but it could have been a coincidence it has been a cupule days at this point ant they feel like they can talk to whatever possesses them and sometimes it takes over they yelled at someone during lunch to \"stop\" doing something in the same voice they said the \"don't touch me\" from earlier which is all we have for now\n\nIf anyone has any information on what could have possessed her or what we can do to help please help\n\n(Btw we were on call all night the night we did it till we were all at school and the only thing CC said was she felt like something was watching her and her bed shook)",
        "created_utc": 1674095193,
        "upvote_ratio": 1.0
    },
    {
        "title": "Stories My Dad Has Told Me: Part 1",
        "author": "Professional_Can9430",
        "url": "https://www.reddit.com/r/Paranormal/comments/10fpnj0/stories_my_dad_has_told_me_part_1/",
        "text": "A lot of people in my family have and had always been interested in /receptive to paranormal activity of some sort. My dad has told me stories forever about all kinds of things he’s seen. Here’s one:\n\nMy dad and aunt (his sister) would use the Ouiga board often and have interesting experiences. My aunt had a small house and not much space so she turned a walk-in closet into a little bedroom with a bed for her daughter (my cousin). My cousin was probably 4 or 5 at the time. She was napping with her back to them. My dad and aunt were using the Ouiga board and not getting much results. The hand would move around erratically and pretty much speak jibberish to them. My dad started getting frustrated and yelled “well fuck, just say something already!!” At that moment, my little cousin’s body flipped over (like a flapjack, no other movements to steady herself) toward them and yelled “NO! I DON’T WANT TO!” And then she flipped back over as quickly as she had faced them and was silent. She doesn’t remember it to this day. And my dad and aunt were pretty tripped out by that, needless to say.",
        "created_utc": 1674094476,
        "upvote_ratio": 1.0
    },
    {
        "title": "Ghost smacked my ass?",
        "author": "Beautiful-Unit-8085",
        "url": "https://www.reddit.com/r/Paranormal/comments/10fpjwa/ghost_smacked_my_ass/",
        "text": "About five years ago I (then 26F) was asleep in bed with my then boyfriend. It was summer and hot as ever so I was sleeping naked with no blankets. At about 1am I woke up to the distinct feeling of someone smacking my butt. Hard. Not only did the feeling of it wake me up but the loud smack sound did too. I was absolutely distraught. I’ve had many paranormal experiences but nothing ever physical and was completely caught off guard and terrified. My boyfriend searched around the room for some logical explanation while I sobbed and tried to explain what happened but he couldn’t find anything to explain it. He had also been woken up by the loud smack. \n\nOnce I calmed down enough we went back to sleep with the lights on. Shortly after falling asleep I woke up lying on my side in a full sleep paralysis episode. I couldn’t move or speak and could hear a man’s voice (not my boyfriend’s) laughing behind me. This went on for a bit as I tried to scream or move and finally was able to roll over and saw nothing. I didn’t go back to sleep that night. \n\nThe next day I called my grandmother who is a medium and asked her if she could sense anything in my home. I told her nothing about my experience from the night before. She told me there was a man in my house who would sit in the living room and wait for me to come home. She said he was mostly harmless but enjoyed seeing me scared and would get a good laugh out of frightening me. A couple days later I worked up the courage to yell into my “empty” house that he wasn’t welcome and had to leave and wasn’t all of to scare me anymore. I had no more experiences with him after that.",
        "created_utc": 1674094193,
        "upvote_ratio": 1.0
    },
    {
        "title": "evil grey closet (portal/wormhole?)",
        "author": "biggest_oopsie",
        "url": "https://www.reddit.com/r/Paranormal/comments/10fpdek/evil_grey_closet_portalwormhole/",
        "text": "20 minutes ago open my closet and its black and white in there? i put various objects in there it turn black in white... testing it out. i put m,y sister in there and she turn black and white..... then the next moment she gone??? how do i get sister back. My mom will be mad.",
        "created_utc": 1674093678,
        "upvote_ratio": 1.0
    },
    {
        "title": "We are baffled as to what is going on here",
        "author": "Scale-Alarmed",
        "url": "https://www.reddit.com/r/Paranormal/comments/10fpc6u/we_are_baffled_as_to_what_is_going_on_here/",
        "text": "[removed]",
        "created_utc": 1674093606,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is there any footage that convinces you that ghosts may exist?",
        "author": "harrybarrydairy",
        "url": "https://www.reddit.com/r/Paranormal/comments/10fovpm/is_there_any_footage_that_convinces_you_that/",
        "text": "[removed]",
        "created_utc": 1674092307,
        "upvote_ratio": 1.0
    },
    {
        "title": "Dream: January 12, 2023",
        "author": "ConferenceDry5693",
        "url": "https://www.reddit.com/r/Paranormal/comments/10fn2mz/dream_january_12_2023/",
        "text": "Dream: January 12, 2023\n\n(Among the scariest and metaphorically deepest dreams I had)\n\n(Honestly, I am writing this an hour and a half after because I need something to keep my mind busy. I don't want to go back to sleep)\n\nIntro:\n\nThe dream was much longer but I'll describe a series of events towards the end of my dream that I remember quite clearly and where it became meaningful. The majority of what I wrote was directly after my dream, a rare instance when I remember far more of my dream than I usually do. Grammar and writing are also somewhat bad. But I wrote things fast and described more the feelings I had during my time in the dream.\n\nSome more context: I live in a house with 10 other people. Each shares a room except me I have my own. Don't have strange vibes in the room outside of this one incident. Although I recall dreaming of the same building in a different dream as a tenant. Also was an odd dream, but not scary in any capacity just a weird feeling as I had with this dream until it got scary. Dreaming of the building was also in this room not sure exact date.\n\nSide Story:  \n\\-Was told by one of my roommates. Two people living there in my room before both had sleep paralysis at the time in my room. Both people had sleep paralysis in sequence at the same time. She also keeps saying there is 'something' in my room.  \n(Didn’t believe her thought she was messing with me when she mentioned the first time) (mentioned it again after 3-4 months, thinking what she said could be probable)   \n\\-Now I had it. The first time I remember having it and needing to scream.  \n\\-Although I screamed (deep scream: I am male) because I thought I was still in the dream. I think people in the rooms next to me heard me.\n\nStart:\n\n\\-I visited the outside of one big building which could have been hospital (played as hotel/apartment in my previous dreams), was in older dreams a decrepit place as a hotel/apartment I stayed in. \n\n\"This time it was not.\" -(I wrote this when I was writing this after the dream) ( may have been a feeling? hinting towards a metaphorical hospital) (As in the dream it did not appear as a hospital.) (Had the vibe of coming back after a long period of time in the dream)\n\n\\-Remember talking to the employee (black clothes/hat like Vallé) out front.\n\nAsked: (Do the elevators work? (Do people live here))\n\nResponds: (With enthusiasm/friendliness) Yes.\n\n\\-The building had red bricks made up of it originally. The outside where I have had an alleyway structure as they have for Vallés in movies. However, I only recently saw a structure similar to this last with a similar layout at the hospital where I dropped my grandfather off whom died only a couple hours later last summer.\n\n\\-When walking away from it and looking back, saw a more complete view of the building. It however, morphed from a red brick building layout to a modern building with billboards etc. Remembering 2-3 towers separated in the building's overall layout.\n\n\\-Next to the hospital there was a side shelter from which you had to go downstairs for pub/drinks. I walked there after talking to the employee of the hotel.  \n\\-Bartender, says alcohol is cheap because of how direct it is made. \"I am fortunate that I am not affected (turned off) by it's look.” (Bartender was very close to me as bar was very small, and remember drinking offbrand beer)  \n\\-Some time passes- remember sitting down at the staircase of 'bar' and talking to the bartender sitting next to me.  \n\\-I remember describing to the bartender \"How my soul is stuck in the building and my physical body is not.\" (Not sure why I said this: Upon waking up I think it was a metaphor)  \n\\-Bartender asks ‘How?'\n\nAfter this, I only remember the last bit before I woke up.\n\n\\-Something went wrong, I started having flashes every time I closed or opened my eyes. Every time a different frame.   \nMetaphorical things. (Picture the following POV: stage set type lights/but looking straight down in an omniscient point of view)  \n\\-Rameen noodles and some water moving it like on a beach (remember this scene being red and white), further random things every time I blinked: I don’t remember but many frames I remember were ones similar to the one previous, (gradually building up, scenes were not scary but the vibe was)   \n(After the build-up, I am trying made to wake up? Heart rate increases?)  \n(Last frames happened fast as I was scared and blinked fast to try to get out and wake up, however, each time I blinked a new frame was completely different from the one before.)  \n\\-one of the last frames was a white dog (creature)? seemed like it was crawling on the ceiling,   \n\\-last few frames I remember picturing my head under my bed covers and there I couldn’t hide something was there (kept blinking)\n\n\\- I kept blinking each time I appeared in or out of the bed covers. However, everytime I couldn't get away... something was there.  \n\\-last frame (I screamed) the bed covers was above me and something was in the corner that was holding it up. \n\nEnded up screaming in direction of my left curtain thinking that was holding my sheets up. When I heard my voice I realized I woke up finally.  \nNot sure when I dreamed this:   \n(Could have been what happened after with the bartender or before the building)  \n\\-remember being asked to pick up an Xbox game for Roommate A/somebody else (maybe other roommate B)  \n\\-Remembering going into pawn shops to find a Watch/Xbox?  \n\\-Remember just appearing in front of places no real physical journey was made.   \n\\-Nothing was recognizable although I remember English being present. So not Europe. \n\nMetaphors:\n\n\\-Building can be metaphorical to a hospital? This is due to the alleyway structure/red bricks in front of it that I saw last summer. \n\n\\-Rameen noodles are metaphorical because I ate it day of and is a common food I eat in the house.\n\nHouse itself: I may have seen a black dot in my peripheral vision before. When looked nothing was there. Happened 1-2 times since here.\n\nOverall: I am not one who believes in ghosts. But after this dream/sleep paralysis. I decided to write the contents of the dream. There could be something in this room.\n\nIf anything happens again. I'll update this account. If no update: I either died (ironic) or nothing happened again (plausible).",
        "created_utc": 1674087489,
        "upvote_ratio": 1.0
    },
    {
        "title": "My paranormal experiences from 22 years ago.",
        "author": "AlfieDerby",
        "url": "https://www.reddit.com/r/Paranormal/comments/10fjjy2/my_paranormal_experiences_from_22_years_ago/",
        "text": "I know some of you aren’t going to believe me because I have no prove to back me up but here are my paranormal experiences\nbelow are things that happened when I moved into a house 22 years ago that I’ve since moved out of\n\n\nThe light fitting was on the floor one day.\nI could hear people upstairs walking about and running upstairs.\nI could feel someone staring at me. \n All my fish in my fish tank boiled one day when I came down.\nMy friend stayed over in guest room and she felt someone sit on the bed she was in. \nMy sister was baby sitting one night and saw an old lady walk past my child’s room. \nMy child saw a snake coming out of the walls. \nMy child used to talk to the lady in the pink room \n\n(The walls used to be pink before I painted them blue)",
        "created_utc": 1674078936,
        "upvote_ratio": 1.0
    },
    {
        "title": "Encounter with a tall, white entity",
        "author": "Dry_Relative5815",
        "url": "https://www.reddit.com/r/Paranormal/comments/10fji78/encounter_with_a_tall_white_entity/",
        "text": "This is a story told by my grandmother. The kind of story related with her eyes wide open. I trust her, she's sincere, so I'm ruling out the possibility of a made-up story. I've been asking her about it over the years because it's so strange and curious for me to imagine such encounter.\n\nPlease note that I'm a rational person, critical-thinker, who usually seeks explanation of phenomena in a pure scientific manner. I'm not looking for the sensational and I hate made-up stories because I feel that my intelligence is offended. But I'm also aware that there is more to Nature than science and I approach the unknown with an open mind.\n\nWhen she was a kid, 70 years ago, she was walking home through her village's forest, at night. The road and forest weren't unknown to her, as she often took that road at day or night. There was nothing special about that forest or village, nor any special past-time stories about them.\n\nBut in this particular night, suddenly she saw a tall, thin, white, ghost-looking entity walking between the trees. She couldn't say if she was noticed, because she got so afraid, that she ran until home, hurting her feet.\n\nThat's it. How do you interpret this story? Have you heard of similar stories? Is there a history of these kind of sightings? Can it be categorised somehow? Are there any trust-worthy sources where I could read more about this phenomena? I recall watching a documentary about a strange forest in some nordic country, where all the people knew about strange appearances, \"forest spirits\", even the Prime Minister was interviewed about it. Do you happen to know the name of this film?\n\nThank you",
        "created_utc": 1674078825,
        "upvote_ratio": 1.0
    },
    {
        "title": "Blur in the woods",
        "author": "AtomicFarmer",
        "url": "https://www.reddit.com/r/Paranormal/comments/10fjf6w/blur_in_the_woods/",
        "text": "[removed]",
        "created_utc": 1674078631,
        "upvote_ratio": 1.0
    },
    {
        "title": "I'm curious to know if that ever happened",
        "author": "Mental-Damage4614",
        "url": "https://www.reddit.com/r/Paranormal/comments/10ficix/im_curious_to_know_if_that_ever_happened/",
        "text": "I'm wondering if any of you, when you knew that someone close to you was going to pass away, asked them to do certain things to let you know they are here like specific signs and if it happened.",
        "created_utc": 1674075078,
        "upvote_ratio": 1.0
    },
    {
        "title": "The most irrefutable piece of evidence for ghosts is in the Chris Watts bodycam footage",
        "author": "effinx",
        "url": "https://www.reddit.com/r/Paranormal/comments/10fi7os/the_most_irrefutable_piece_of_evidence_for_ghosts/",
        "text": "[removed]",
        "created_utc": 1674074758,
        "upvote_ratio": 1.0
    },
    {
        "title": "Paper towel went missing",
        "author": "HolidayIcy7892",
        "url": "https://www.reddit.com/r/Paranormal/comments/10fgq44/paper_towel_went_missing/",
        "text": "I don’t know if this counts and if it doesn’t you can downvote tf out of me. \nThis just happened to me about 20 minutes ago. I was making a sauce for my meal and wiped off a spoon with a paper towel. I knew I would need it later so I set it on the island counter. I made the sauce and after I was going to wipe the area down with the paper towel. It was nowhere to be found however and I know I didn’t throw it away even absent mindedly because I knew I was going to wipe down the area later. It just disappeared and it couldn’t have just fallen or anything like that. What could have happened? Could it possibly be a glitch in the matrix?",
        "created_utc": 1674071222,
        "upvote_ratio": 1.0
    },
    {
        "title": "Has anyone experienced the evil eye? Is it likely I am a victim of it?(25M)",
        "author": "OHmon3y",
        "url": "https://www.reddit.com/r/Paranormal/comments/10fffix/has_anyone_experienced_the_evil_eye_is_it_likely/",
        "text": "Long story short, I graduated from college in 2020 at the peak of Covid. I could not find a decent job at the time so I pretty much had to take anything I could get. Most of the jobs weren’t ideal but it helped me stay afloat until I could land something better that i could use my degree towards…\n\nFast forward 6 months, I finally found the job I was looking for and I felt I was starting to do really good for myself. I was able to do things for my family and help where needed. I started saving money, and eventually got out of my beater vehicle from college and into a better one. I could finally travel, and just live my life how I always dreamed of. Everything was great..Until about 3-4 months into the job…\n\nA series of unfortunate events started to take place over the next year or so. And it seemed to have a domino effect. One after the other, thing after thing. Anywhere I traveled, I had separate run-ins with the law (would have been life altering and debilitating had I been stuck with any of the situations - in three SEPARATE states I might add). I totaled my new vehicle in a freak car accident. I came out completely unharmed, not even a scratch on me. No one else was harmed or involved thank God. But there were about 4 instances I could have been seriously injured (or worse) during the collision but miraculously I wasn’t. \n\nIt just seemed like everywhere I went trouble seemed to follow. Before taking this job, I had never experienced anything as severe in my life happen. I chalked everything up to be just pure bad luck, wrong place, wrong time sort of deal. But 4 separate close calls that would have been seriously life altering/threatening in such a short span of time? It just can’t be a coincidence. \n\nI always had it in the back of my mind that maybe someone had been wishing bad upon me all along, maybe they’ve done something to send evil my way. Then I started looking into my old friend groups/acquaintances from the past that I’ve ran into here and there throughout the years. Maybe there are a few people I could think of who would do such a thing out of spite and jealousy. Is this really possible? Has anyone else experienced anything like this before? Pretty spooked after reflecting the last couple of hours.",
        "created_utc": 1674068170,
        "upvote_ratio": 1.0
    },
    {
        "title": "Two stories i have questions about.",
        "author": "_repairmanmanman",
        "url": "https://www.reddit.com/r/Paranormal/comments/10fel2f/two_stories_i_have_questions_about/",
        "text": "First i want to share that myself and my family have always believed some kind of supernatural something. I am 100% open to the possibility that all monsters we hear about are true. There has been far too many unexplained things in my life personally, as well as life in general for people to think otherwise. \n\nI know a little bit about a little bit but have two stories that I’d like someone who knows a little more to share what they think. \n\n(Please ignore my grammar and spelling. I get it, I’m dumb)\n\n-When i was a kid, between 10 and 12, my brother and i had a friend over. It was around 7pm and my mom was at choir practice. We were the only people in the home. We were playing in the living room when we saw my mom outside waving her keys that had a very specific Harley Davidson leather strap on it, through the window playfully like “yooohooo!” We were confused because she left for practice a while ago and usually didn’t come home for another hour or so. We waited for her to come inside. When she didn’t we were scared so we went to my brothers room and stayed there until my mom was home. We told her about it and she swore it wasn’t her and said we were smart to not go outside looking for her. \nI’ve read things about skinwalkers and a couple other theories. But 🤷🏻‍♀️\n\n-the next story is harder to explain and i wish i could draw lol. A couple years ago my ex picked me up from work around 11pm. We weren’t even smoking, just taking the long way home and chatting. We were coming up to an intersection with a car coming to their stop sign in the opposite direction. Their car stopped short as this thing ran across the road. It was blueish but transparent, taller than the car, had very weirdly bent back legs the way a ware-wolf would be drawn i guess, and very long arms but running on all 4. The way it was shaped looked like it wasn’t always on all 4 like a dog. Maybe the best way to try to describe it would be when you see those videos of people running around like a horse lol. Like butt in the air, feet flat, hands flat, head down. But it’s body was not human like, it’s body was longer and dog like. Ugh see, this is why i wish i could draw none of this makes sense lol. \nThe car filled up with tension as we both stopped talking when we saw it. We didn’t say a word until we were out of that intersection. I was like “i think” and she interrupted “i know” and she kept driving until we were away from that area to talk about it. We described it exactly the same as eachother. At first we figured a warewolf but I’m not sure. When i was a teenager my friend and i would ride our bikes around town all night into the morning and one day as we were heading home around 5am when we saw (i think) the same thing running along side of us very briefly before running into the woods. \n\nAnyone have any thoughts on what either could be?",
        "created_utc": 1674066206,
        "upvote_ratio": 1.0
    },
    {
        "title": "Chinese man finds secret organ harvesting facility.",
        "author": "Alarming_Worth_8506",
        "url": "https://www.reddit.com/r/Paranormal/comments/10fddb1/chinese_man_finds_secret_organ_harvesting_facility/",
        "text": "[removed]",
        "created_utc": 1674063408,
        "upvote_ratio": 1.0
    },
    {
        "title": "Walking sound from roof at night",
        "author": "garv_tf",
        "url": "https://www.reddit.com/r/Paranormal/comments/10fc1fb/walking_sound_from_roof_at_night/",
        "text": "So basically I noticed it when I was 13 or 14 and experienced it once again.\nAt night when my all family members fall asleep then sometimes I heard sounds of footsteps from my roof at night. Even there is no way to get on our house's roof because main gate is always locked at night. From many years I didn't noticed it untill yesterday. This time I am at my Grandmother's house Yesterday when I was sleeping with my cousin brother then again I heard loud sound of someone walking on roof again there was no way to get on roof and even how can someone walk on cold nights on the rooftop.",
        "created_utc": 1674060341,
        "upvote_ratio": 1.0
    },
    {
        "title": "could i be a dead person?",
        "author": "FederalAd5886",
        "url": "https://www.reddit.com/r/Paranormal/comments/10fa5vr/could_i_be_a_dead_person/",
        "text": "i am aware that this may not be considered paranormal but honestly, i didn't know where else to post this and i need answers. \n\ni am also aware that reincarnation is an iffy topic and is only heavily considered based on ones beliefs. \n\nlet me start out by saying that i never thought too much on the idea of reincarnation, though when i did, it has always brought me some sort of comfort. i have always been sensitive to the paranormal. i can't see them, but i can feel them and hear them very loudly in my ear now and then.\n\nmy dads cousin (f,40, we will call her Stacy) and my dads uncle (m,50, we will call him John), (they are not father and daughter in case you were wondering), are also very sensitive. my great grandmother (uncles mom, cousin and dads grandma) passed away shortly before i was born, though i don't know the exact dates or even an estimate of the time frame. \n\nwe will call my great grandmother Celia.\n\nlet me preface everything i am about to say by saying that i was not present for the following conversation. my mother and \"Stacy\" were the ones to have this conversation, so excuse me if at any point my details are scrambled or non-existent. \n\nso, because Stacy is sensitive to the afterlife, my mother brought up the fact that i am as well. i don't speak on it often just because it's so normal to me that i don't find myself thinking about it. my mother told Stacy about an experience i had on our family vacation to Maine back in August 2022. Stacy wasn't on the vacation. Stacy's response to me being sensitive was \"we know.\" \n\nwho the f is \"we\"? that would be Stacy and John. what she meant by that was that she and John had always had a feeling that i am Celia reincarnated, if not just one of the \"lucky\" ones to be sensitive. \n\nStacy said that my presence had always felt like Celia's, that things that i say and faces that i make are just like Celia and that i know things about Celia's children that i shouldn't know without having been told.\n\nfor example, as children, my cousin, sister and i would always ask my grandmother (dads mom, Celia's daughter) and her 4 siblings what they were like as kids, and i never failed to tell them exactly how they were like to the T. \n\na few things that also help put the pieces together are that when i was younger, every time i visited my grandmothers house i always wanted to hear about Celia but i could never remember her name. i wanted to know specifically how she died. every. single. visit. another thing is that i have always had a fascination and a draw to the early 1900's. i have always wanted to know about the fashion, the language, the lifestyle, but i never cared too much about anything else besides just the average citizens that would have lived back then. this fascination matters because considering my grandmother was born in 1953 and she has older siblings, i find it safe to assume Celia was born late 1910's / early 1920's.\n\never since hearing this information i haven't felt like myself. i have actually felt like my body is my own, but my soul is someone else, which i'm sure is normal with this. though i have also found an odd comfort in knowing my soul could have existed before. \n\nare me and my family thinking too much, or could this be real?",
        "created_utc": 1674055864,
        "upvote_ratio": 1.0
    },
    {
        "title": "The mirror lady",
        "author": "Overlord-Echo",
        "url": "https://www.reddit.com/r/Paranormal/comments/10f8g4w/the_mirror_lady/",
        "text": "The house I grew up in has been haunted since my family first moved there in 2001. I’d say this happened around 2003. It’s located in upstate New York. In this I was 7 or 8 at the time, my sister was 5 or 6.  The house was built in in the late 1800s. One time during a summer day, me and my sister were in the house. My mom was preparing lunch. We heard a knock at the front door and my mom asked my sister and I to see who was there. We ran to the front door, checking the side window first to see if we could see anyone but didn’t. We then open the two doors but no one was there. We had an oval mirror next to the door. Now I was too short to see myself in the mirror, but what I did see was a very tan lady, who maybe looked in her early to mid 30s with blonde hair. In the mirror, she was looking straight at me. I turn around and no one is behind us. I turn back to the mirror and she is gone. My sister and I look at each other and quickly run to our mom and tell her what we saw. She goes and checks it out and sees nothing. It was the only time I saw that lady in the house, but I experienced other events in the house as well, but this one always struck as one of the stranger ones.",
        "created_utc": 1674051461,
        "upvote_ratio": 1.0
    },
    {
        "title": "A dream I had not too long ago.",
        "author": "IWantToBoxMyUncle1v1",
        "url": "https://www.reddit.com/r/Paranormal/comments/10f7tqt/a_dream_i_had_not_too_long_ago/",
        "text": "So, I've always heard anecdotes on Reddit, TikTok, and other forums that say, \"Never tell anyone in your dream that you know you're dreaming.\"\n\n\nI never believed them, until today.\n\n\nNot too long ago, I was asleep and I was having a dream about work. I was aware that I was asleep because now and again I would have a dream where I would float in the air as if gravity doesn't affect me. The only thing stopping me from flying into space is that I'm usually in a building, so the ceiling always stops me.\n\n\nThis building happened to be the store I work at.\n\n\nAfter a few minutes of chatting with my coworkers, I got bored with the whole floating-in-the-air thing, so I asked one of them for help. Only then did they notice me, laughed it off, and asked me, \"is this a common occurrence?\" To which I replied, \"Only when I'm dreaming,\" and they laughed again. \n\n\nThey stopped helping me down and instead let me go, to which my body started to float inside the store. The customers inside were no longer shopping, but rather standing at both entrances with the sliding doors, their silhouette grayed out, but it was clear they were staring directly at me. As I floated past them, inside the store, which now had all the lights turned off; the entrance was only dimly lit by the sunlight outside. Meanwhile, everyone stood still - continuing to look at me without saying a word. \n\n\nAll except this one girl. \n\n\nShe was walking next to me as I floated by her, her head down towards her cart. She wasn't walking fast, but she also wasn't moving slowly - just keeping pace with me. Yet, she refused to show me her face, though her hair made me think of someone I hadn't seen in years since I graduated high school.\n\n\nEventually, I felt myself getting heavy and I knew I was about to wake up. Every time I try to control my dreams and spawn something in, my body gets heavy and it automatically wakes me up. \n\n\nExcept for this time, I wasn't alone. On my bed, was the same girl that refused to look at me. She was just sitting on my bed, looking away. I tried to reach out and touch her, but my arm was moving slowly as if time had slowed down. She turned around and smiled at me with this creepy look, and then quickly turned back around. That happened three times until I felt like I was about to touch her, then my entire body reset - my arms now back to my side and she was this time laying on her stomach, her head in her arms as she cried. Before I could do anything to move again, I blinked and she was gone. My body had jolted itself awake, and it was over.\n\n\nI won't lie, it wasn't scary since I was aware she was a hallucination of my sleep paralysis, but now I kind of want to do it again. I'm curious if she would appear again or if it would be someone new. The sun has just gone up and my room is dimly lit, just like how it was in my dream, which means that my brain was using that as a reference. I do remember vaguely in those forums that people say you shouldn't mess with these things, so would it be a good idea to try again?\n\nAnyways, I just had to tell someone about this experience. Thanks for reading.",
        "created_utc": 1674049715,
        "upvote_ratio": 1.0
    },
    {
        "title": "Friend request from my dead Grandpa at 6:27 AM",
        "author": "gibsonsgspecial2",
        "url": "https://www.reddit.com/r/Paranormal/comments/10f6ag0/friend_request_from_my_dead_grandpa_at_627_am/",
        "text": "So some of you guys and gals know how it usually is whenever it comes to fake friend requests on Facebook from like hackers/scammers, etc. It’s just a scary and sad moment for me or maybe I’m just overthinking a lot but who knows.\n\nAnyways, I wasn’t on Facebook whenever this happened, I just so to be on my home screen and boom, out of the fucking blue, I wish I would of screen shot it but it’s not under my notifications anymore, this literally gave me Stephen Kings’ movie “Mr. Harrigan’s Phone” vibes. As soon as I seen that friend request pop up from the top of the screen, I got on facebook and the friend request is no longer there. Most of the time whenever you have that one friend that gets their facebook hacked or something, the friend request stays there and everyone knows not to accept it because you already have them added and sometimes usually has that weird profile picture blur but this was totally different and I’ve never got a friend request were it would immediately disappear after viewing it. I honestly don’t know what to say at this point, I’m just hoping it’s just a spam bot request or something, and I know that Facebook is corrupted with these hackers and scammers but I’m hoping some of you have experience something like this because I’m just shook, I mean anyone would if it was their dead relative, right? 🤦‍♂️😂",
        "created_utc": 1674045121,
        "upvote_ratio": 1.0
    },
    {
        "title": "Hearing Breathing At Night",
        "author": "doveonzaza8",
        "url": "https://www.reddit.com/r/Paranormal/comments/10f5ank/hearing_breathing_at_night/",
        "text": "Hello,i need some advice or direction of what i could possibly have been dealing with. i have been hearing breathing coming from the corner of my room in the morning every 2-3 times a month. The first time i heard it was 4 years ago while i was still living in eastern europe, it was at a very early morning,so loud it had woken me up. I didnt realize i was hearing it until i stopped breathing for a minute to realize it wasn’t me (i sleep alone in my room)i sat up and listened and heard it very clearly  coming from the corner of the room,it sounded very heavy but at a normal pace.the sound didnt stop until i asked who it was. I was experiencing a lot of sleep paralysis at the time as well, it scared me at first but as it became occasional i sort of just got used to it just being a weird thing i cant understand until i moved to the US three years ago and it had stopped for a while,two months into the move my boyfriend woke me up telling me he can hear a breathing noise coming from the corner of the room where the bedroom door was, he usually doesn’t believe in anything paranormal/spiritual but this time he was freaked out, once again i could hear it very clearly. since then i haven’t heard anything but lately got very curious as to what or who it could have been, please let me know if anybody has any info of what this means.",
        "created_utc": 1674041963,
        "upvote_ratio": 1.0
    },
    {
        "title": "The visitation dream from a dad a week after he passed away",
        "author": "gtrfhjutdxcb",
        "url": "https://www.reddit.com/r/Paranormal/comments/10f3d34/the_visitation_dream_from_a_dad_a_week_after_he/",
        "text": "(Trigger warning for talk of eating disorders &amp; cancer/terminal illness)\n\n4 years ago my dad died from stage 4 melanoma that had spread to multiple organs including his brain. He was in hospital for around 9 days and 1 day in hospice where he died. When he was in the hospital, before he massively declined and stopped talking, he was quite confused because of the tumours in his brain. He didn’t know he was there because he was about to die, he thought he was there for treatment. One day I was alone with him when he went into a series of seizures. I stayed with him while the doctors worked on him. I talked to him and between seizures he seemed to recognise my voice. Afterwards, when he was awake again he was saying how proud of me he was for working with the doctors on his treatment. He was telling my mum he was so proud of me.\n\nAt the time, I was dealing with a bad ED relapse because it was the only way I could cope with what was happening, including bulimia which he never knew about. My dad was always proud of me but I felt sad and ashamed that he wouldn’t be if he knew how I was actually doing. Fast forward to after his death, around 1-2 weeks later I had a very vivid visitation dream. He was standing in my room. I could see the details of my bedroom exactly how they were, I might as well have been awake with how vivid the dream was.\n\nMy dad was healthy looking again and had a calm, peaceful energy to him. He told me he was okay, he knew we had been by his side when he died and he heard everything we said. He said “I know you are scared I wouldn’t be proud of you but I still am. You were amazing and I will always be proud of you. I’m just sorry you are going through this and want you to be happy”. \n\nI told him again that I love him and I hope he’s okay, he reassured me he was. Then I woke up, already crying but with this amazing feeling of peace… it’s hard to describe. Some people would say this is just a dream, but I know this was my dad’s spirit visiting me. The vividness, the feeling when I woke up, the sense of peace that was there. Him visiting me really did help let go of the shame and I felt reassured he was okay. \n\nSorry this was so long! If you made it to the end, thank you ☺️",
        "created_utc": 1674034918,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is a haunting sort of like having a rat issue?",
        "author": "EdwardBliss",
        "url": "https://www.reddit.com/r/Paranormal/comments/10f1f7c/is_a_haunting_sort_of_like_having_a_rat_issue/",
        "text": "In both cases, you hear scratches in the walls and ceiling, they rustle bags and make things fall over, they make bumping noises, you never see them, it always happens at night, and sometimes you catch quick glimpses of them.",
        "created_utc": 1674027320,
        "upvote_ratio": 1.0
    },
    {
        "title": "I think I made the ghosts angry",
        "author": "Mycatlovesbiscuits",
        "url": "https://www.reddit.com/r/Paranormal/comments/10f16ec/i_think_i_made_the_ghosts_angry/",
        "text": "My 5 year old nephew had a ghost friend named Hary. Hary followed him everywhere. My nephew told me he was naughty and he told me Hary pretends to hurt me when I’m at his house and he grabs my butt. He came to visit one day and said he brought Hary with. He was downstairs playing and when he came up he told me Hary wanted to stay in my basement with another ghost named hate. And hate is very very naughty according to him he does inappropriate things to me.  Now several years later I jokingly yelled down the stairs hey hate and Hary why won’t you come hang out. A few moments later a very light weigh decoration flew off the top of a speaker and bounced roughly 6feet from the speaker. The other wooden decoration Thst was sitting beside it did not move. My friend was standing beside me and the decoration flew in front of both of us. \nThere have been a few weird things happen at my house That I can’t explain like my curtains opening by themselves, getting locked in my garage, and my cat getting shut in a closet in a room where the door was shut. But these things have happened years apart. I don’t give them much thought until something else weird happens.",
        "created_utc": 1674026422,
        "upvote_ratio": 1.0
    },
    {
        "title": "Has anyone experienced the evil eye? Is it likely I am a victim of it?(25M)",
        "author": "OHmon3y",
        "url": "https://www.reddit.com/r/Paranormal/comments/10f0zwx/has_anyone_experienced_the_evil_eye_is_it_likely/",
        "text": "Long story short, I graduated from college in 2020 at the peak of Covid. I could not find a decent job at the time so I pretty much had to take anything I could get. Most of the jobs weren’t ideal but it helped me stay afloat until I could land something better that i could use my degree towards…\n\nFast forward 6 months, I finally found the job I was looking for and I felt I was starting to do really good for myself. I was able to do things for my family and help where needed. I started saving money, and eventually got out of my beater vehicle from college and into a better one. I could finally travel, and just live my life how I always dreamed of. Everything was great..Until about 3-4 months into the job…\n\nA series of unfortunate events started to take place over the next year or so. And it seemed to have a domino effect. One after the other, thing after thing. Anywhere I traveled, I had separate run-ins with the law (would have been life altering and debilitating had I been stuck with any of the situations - in three SEPARATE states I might add). I totaled my new vehicle in a freak car accident. I came out completely unharmed, not even a scratch on me. No one else was harmed or involved thank God. But there were about 4 instances I could have been seriously injured (or worse) during the collision but miraculously I wasn’t. \n\nIt just seemed like everywhere I went trouble seemed to follow. Before taking this job, I had never experienced anything as severe in my life happen. I chalked everything up to be just pure bad luck, wrong place, wrong time sort of deal. But 4 separate close calls that would have been seriously life altering/threatening in such a short span of time? It just can’t be a coincidence. \n\nI always had it in the back of my mind that maybe someone had been wishing bad upon me all along, maybe they’ve done something to send evil my way. Then I started looking into my old friend groups/acquaintances from the past that I’ve ran into here and there throughout the years. Maybe there are a few people I could think of who would do such a thing out of spite and jealousy. Is this really possible? Has anyone else experienced anything like this before? Pretty spooked after reflecting the last couple of hours.",
        "created_utc": 1674025778,
        "upvote_ratio": 1.0
    },
    {
        "title": "Nephews playmate",
        "author": "Queen5252",
        "url": "https://www.reddit.com/r/Paranormal/comments/10expsp/nephews_playmate/",
        "text": "my big sister gives birth to my nephew, and we are all overjoyed. We finally have a baby in the family to hold. When my nephew hit about 3 he would play off in the hallway. Talking with himself and running around, of course we played it off as it was an imaginary friend. \n\nMy sister one day calls me to tell me that she had been flipping through old photos of our family…. And my nephew points at a photo with a group of men in it. His little finger points directly at my big brother. States he see’s his “uncle Benny” …..\n\nNo one had ever given my brother that nickname. “Uncle” wasn’t even a thing back then, we don’t even bring up my brother because he passed away so suddenly 2 years before my nephew was born. To hear a child say he’s been playing with his uncle, had shocked us. To this day, my nephew claims he saw my big brother, played with him. Even tells his mom he misses him…. My brother died back in 08 due to heart problems. We still talk about this today, we know our people are around us. Watching over us, making sure we are ok. Let me know if anything like this has happened to you or your family. I just know, we aren’t the only ones.",
        "created_utc": 1674015391,
        "upvote_ratio": 1.0
    },
    {
        "title": "My security camera captured a floating white blob.",
        "author": "JuryFabulous",
        "url": "https://www.reddit.com/r/Paranormal/comments/10exilu/my_security_camera_captured_a_floating_white_blob/",
        "text": "[removed]",
        "created_utc": 1674014829,
        "upvote_ratio": 1.0
    },
    {
        "title": "possible sleep paralysis? please explain",
        "author": "catlover12390",
        "url": "https://www.reddit.com/r/Paranormal/comments/10ex7f4/possible_sleep_paralysis_please_explain/",
        "text": "This story takes place wayyy too long ago. I was like 3 or 4. Late enough to be a memory, early enough for it to be fuzzy. So sorry for lack of details. \n\n\n\n\n\n\nSo, when I was a toddler, we moves out. We moved around a lot, and everywhere we went there were spirits, ghosts, whatever. Of course at this age I didn't know\n this. Back to the story, the first day we spent the night they put a small cot in the middle of a completely square room, with the door at the front left section. I vividly remember waking up, completely normally, late a night, and seeing a figure in the doorway. I know it wasn't my parents, because when I ask them they say they didn't do that type of thing. So a dark figure, in the doorway. I don't know if it was sleep paralysis because, due to my young age at the time, the memory is fuzzy and I'm not sure if I had the ability to move or not. I have never had sleep paralysis since then, and I'm just curious. Paranormal or sleep paralysis???",
        "created_utc": 1674013958,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can I get any phone numbers",
        "author": "Mcguivr336",
        "url": "https://www.reddit.com/r/Paranormal/comments/10ewka6/can_i_get_any_phone_numbers/",
        "text": "I am in the middle of trying to find what happened to my keys I was just about to put them on my new keychain and they got miss placed within my own apartment. If anyone has any experience strength and hope on dealing with material items while going through paranormal activity I would really appreciate it this evening.",
        "created_utc": 1674012128,
        "upvote_ratio": 1.0
    },
    {
        "title": "\"They have no eyes!\" - a question about invisible entities",
        "author": "Lurububy",
        "url": "https://www.reddit.com/r/Paranormal/comments/10et6us/they_have_no_eyes_a_question_about_invisible/",
        "text": "Hello! I have had experiences with the entity known as \"Hat Man\" several times, which I won't get into here but might be useful info for some of you. I'm kind of hoping Michael Shermer or someone super smart will read this and explain it in a way that doesn't kill my last sliver of hope. Question related to the post title starts in paragraph three.\n\n&amp;#x200B;\n\nQuick background: during my teen years my homelife was very unstable due to mentally disturbed parents, and before then, when I was a child, my parents had been great. It was like they flipped a switch and became extremely psychologically abusive and manipulative over night (my therapist spent years trying to understand this, as my parents' behaviour didn't follow any personality pattern known to science, but neither of us ever figured it out, and she *knew* they were disturbed because they kept calling her practice to talk about weird stuff to the lady at the front desk even though they weren't patients there).\n\n&amp;#x200B;\n\nIn my 20s, I woke up one night and saw Hat Man in my apartment while having a night terror. That's the first and only time I've seen him, and while it terrified me, I didn't think anything of it the next morning. Two years later I saw that people on the internet had seen a pitch black man wearing a trench coat and wide-brimmed hat during SP, and when I saw their drawings of him I almost fainted with fear because he looked exactly like I had seen him. Then, even worse, when I told my therapist about it she went pale and asked me what I thought HM might be, and I realized that she'd seen him herself. Before that session she'd been an unapologetic atheist, but after that she became less and less dismissive of religious teachings.\n\n&amp;#x200B;\n\nAnyway. About six months ago, I had a dream that I think was meant to be a nightmare, except I wasn't scared. The dream took place in my parents' home in broad daylight, and in their living room was a deathly pale man standing in my way so that I had to push past him whenever I wanted to go through the living room. He was about 5'7, kinda prehistoric looking with a rodent-like face or like his teeth made a box shape at the lower front of his face with his mouth closed and his cheeks were hollow. His hair was yellowish blonde with grey streaks in it and slicked back, and his hairline began far back on his head. He had no other hair anywhere on his body (which was VERY white). A clean, white cloth worn as underwear was the only piece of clothing he had, and so he was near-naked. He had no eyes. Instead, the eye sockets (like, imagine the size of men's eye sockets when they're not covered in flesh and skin, just the skull, except the size of this guy's eye sockets was visible in spite of being covered in skin) looked like they'd been covered in eye shadow: lightly applied at the periferis of the sockets, and then gradually darker towards the center. Except the sockets looked bottomless, as if it wasn't eye shadow that made them dark like that, but as if his eye sockets were tunnels that went into his head and continued straight in for miles even though his head looked normal on the outside. \n\n&amp;#x200B;\n\nI don't know if he could see with his eye sockets or not. All I know is that he kept blocking my way to scare me everytime I needed to pass, but I never got scared for whatever reason. When I walked past him, kinda shoving him aside with my shouder, he would slightly resist with his own shoulder and turn his face towards me. Then, when I was in the next room looking back at him, he produced a white mask (kinda like the ones you did at school where your friend covered your face with plaster and left holes for the eyes and nostrils, except this guy's mask looked plastic and had little to no features), and he held the mask in front of his face so that I could see the darkest parts of his sockets but nothing else. While looking at him, I thought to myself that he was covering his face to scare me because getting in my way hadn't been enough, but I just didn't feel anything, and I also thought that he was kind of an idiot because the mask honestly didn't make much of a difference to his appearance, and then I walked past him one more time.\n\n&amp;#x200B;\n\nNow, I read reddit posts yesterday about the creepy last words of dying people. One user said that they'd heard a dying person say \"they have no eyes! they have no eyes!\" in absolute terror. Then, of course, another user reported having heard a dying person describe a pitch black man with red eyes (Hat Man, presumably).\n\n&amp;#x200B;\n\nThe reason I'm reaching out for advice on here is because I'm at my wit's end. What exactly does a person have to do to not get stuck with these assholes when you die? I mean, I've heard that serial killers who've had NDEs have reported seeing pleasant things, and I bet all those pedophilic catholic priests have wonderful death moments (you never hear otherwise). Meanwhile, I've never murdered, raped, or otherwise harmed anyone, and I still can't seem to get away from the worst that hell has to offer. WHAT AM I DOING WRONG!!!??\n\n&amp;#x200B;\n\nAny thoughts you have on this subject - PLEASE share them!!!\n\n&amp;#x200B;\n\nI was raised a very moderate and liberal protestant and wasn't taught about hell at all, but I'm pretty sure there are better candidates for that destination than myself.\n\nAlso: like I said, the abuse was only ever psychological (and not to gross you out, but the hymen that covered my vaginal opening when I moved away from home kinda confirms that I was never raped). And yet, I woke up one night to my body being positioned on its back with my arms over my head on the pillow and my thighs being forcefully pushed apart. As I was seeing a therapist at the time, I told her about it and we went over the whole \"suppressed memory\" things for months, but I have absolutely no sex trauma, no PTSD and no issues with hearing about rape or the like (other than the empathy all people have for rape victims, of course).\n\n&amp;#x200B;\n\nAm I destined to be with the eyeless and the pitch black assholes of the universe forever and ever when I'm dead? What for? Is it because I'm depressed? How the fuck is that my fault!?",
        "created_utc": 1674003052,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can anyone debunk this?",
        "author": "Secret86",
        "url": "https://www.reddit.com/r/Paranormal/comments/10et2o3/can_anyone_debunk_this/",
        "text": "For weeks now I've been smelling smoke from the roll up cigarettes. The same kind that my brother smoked before he passed just before COVID. \nQuite literally the same smell.\nI live with my father and neither of us smoke at all. I am in a relationship with a wonderful guy that started relatively recently.  But he doesn't smoke either and it's around when my partner isn't too. \nWhen my brother smoked the roll ups he used to save the end to reuse the unburned tobacco. Sometimes the browny yellowed paper would be found on the floor where he collected the tobacco to be used. \nWell I've just found some of those papers with a strong smell of the tobacco too. But not in the area that he would've used it...plus he smoked outside. The smell I could possibly debunk as someone outside and the smell coming in....but I can't figure out the paper. We have had no guests the last couple days. \nDebunk theories please?",
        "created_utc": 1674002750,
        "upvote_ratio": 1.0
    },
    {
        "title": "Dreams, after life, and the universe.",
        "author": "Ri_Ri69",
        "url": "https://www.reddit.com/r/Paranormal/comments/10esyoz/dreams_after_life_and_the_universe/",
        "text": "I find all of this cool. I feel as if there is more to like physical world and what we are seeing now. There’s definitely some things we don’t know and we don’t see.\n\nWhat if dream characters are conscious beings? And are aware and can have thoughts to themselves,  I sound crazy, I know. But trust me. \n\nWhat if we are just entering another dimension/reality when we go to our dreams? Because many people report some dream character telling people knowledge that they don’t know or a correct prediction of the future. What if these aren’t just our minds? \n\nWhat if when we die we could possibly do anything ? Our consciousness/soul is energy. And seeing and feeling and thinking about nothing after we die just seems unreal.",
        "created_utc": 1674002469,
        "upvote_ratio": 1.0
    },
    {
        "title": "The lights and the flash",
        "author": "c_point_adae",
        "url": "https://www.reddit.com/r/Paranormal/comments/10estik/the_lights_and_the_flash/",
        "text": "So, last night, my brother calls out to me, scared. He's in my mother's room. This is a 1970s British house, and nobody has died here. Other than a few things here and there I wouldn't call it haunted. My mother's lamp is going crazy. It's one you touch to turn on. Further touching changes the colour. It was flashing every colour at once. I turn it off, and soon it does it again, only this time, it won't let me turn it off until I disconnected it from the electricity. \n\nToday, my mum made burgers. I'd finished my meal and went upstairs. The stairs require a U turn to reach the top, and in the middle is a landing with a window to the garden and neighbours house. In this window is a potted plant. \n\nI see the brightest flash of light I've ever seen. I've seen lightning up close, and this was brighter. I could see the shadow of the walls and the plant. Everything else was pure white. I got a headache and felt sick a while afterwards. The neighbours definitely weren't outside, and the flash seemed to come from the garden. I can't explain how odd it was. I thought the city had been nuked or something. I swear if my eyes were closed I'd still have seen perfectly.\n\nLater, I'm calm. It had snowed and I was happy, drinking some Vermouth. Dad complains about the light at the bottom of the garden, near the woods. It's motion activated. I look, and sure enough it's constantly being activated until the battery finally dies.\n\nI feel like this is more than just coincidence. I won't explain, but recently I angered the neighbours across the street. They are satanists. There are always strange lights coming from that house and the blinds move in odd ways on their own. I'm thinking that she (the daughter, who dabbles in that stuff) has done this. I'm not too scared, as my family on my mother's side are self-proclaimed witches. Not your stereotypical reddit, teenage witches. The real, celtic kind.\n\nThis story probably sucks but yeah, this is just the last 2 days. There were also noises, including banging and crying, in the garden tonight.\n\nAm I attributing random things to the supernatural here? Or have I entered a spiritual war with a neighbour?",
        "created_utc": 1674002107,
        "upvote_ratio": 1.0
    },
    {
        "title": "Repititive event",
        "author": "EducationalEast1899",
        "url": "https://www.reddit.com/r/Paranormal/comments/10esk21/repititive_event/",
        "text": "Hello! It’s me again. I know i’m not the only one whose events in my life randomly keeps repeating. \n\nLike, i would chats with my friends and the following year or months it would be like that again. Same paragraphs, same texts messages, same sitting style (me), and all of it are repeating again. When this usually happens i wouldn’t know it the first 2 seconds but it just suddenly pop around my head and then being aware that it just repeat while my heart is beating fast (prbbly bcs of fear/shocked). Starting today i would mark my calendar and keep it in my notes of what had happened again. I would make an update if y’all asked me if it happened again.",
        "created_utc": 1674001453,
        "upvote_ratio": 1.0
    },
    {
        "title": "Mental illness or demonic experiences",
        "author": "StrawberryKiwi23",
        "url": "https://www.reddit.com/r/Paranormal/comments/10es52s/mental_illness_or_demonic_experiences/",
        "text": "TLDR: I dreamt a demon was in a room in an old house that my mom never told me she thought was haunted.\nSeeing someone look like they’re possessed and them saying they felt something evil go through their body\n\nThere’s a lot to say this was an issue for many years. I’m going to just say a few things.\n\nFor years I was dealing with constant demon nightmares and sleep paralysis a few times auditory hallucinations. I could feel the evil in my dreams and in my house especially my room. I have been trying very hard to convince myself it is mental illness.\n\nThe first instance that makes me think it’s real:\nIn one of my nightmares there was a demon living in the guest room of my childhood home. It was invisible but I could feel where it was and it was coming for me. Trying to get in my room while I’m holding the door shut and my sister was staring blankly into a void while holding a bible.\nI told this dream to my mom and she was shocked. She never told me before but she could always feel evil in that room and had some terrifying experiences in there.\n\nThe second instance:\nI had been extremely upset about this situation going on for years and was exhausted from fear and broken. I was sitting with my mom crying and hugging her.\n I looked at her and she was not my mom. Her eyes did not look right it is hard to explain. The rest of her face blank. Kind of like a dead person. She just stared at me and I gasped and jumped away. She immediately went back to normal and said it’s okay it’s mom it’s me and grabbed me and hugged me.\nIt’s like she was gone for a few seconds she was not herself. About 6 months ago I brought this up and she told me she felt a wisp go through her body in that moment and could feel the evil I was telling her about. She thinks a demon went through her body but couldn’t stay.\n\nThere were a lot of things that happened and still deeply upset me but these 2 instances I cannot explain with mental illness or my fear influencing other people",
        "created_utc": 1674000430,
        "upvote_ratio": 1.0
    },
    {
        "title": "Meeting a psychic and weird stuff",
        "author": "quentinscottxx",
        "url": "https://www.reddit.com/r/Paranormal/comments/10er2tp/meeting_a_psychic_and_weird_stuff/",
        "text": "[removed]",
        "created_utc": 1673997871,
        "upvote_ratio": 1.0
    },
    {
        "title": "Sprowston manor uk",
        "author": "ivebeentotheyear2000",
        "url": "https://www.reddit.com/r/Paranormal/comments/10eq7fp/sprowston_manor_uk/",
        "text": "Okay so last year in October my partner and I drove down to Norwich, uk to pick up our new dog. I booked sprowston manor hotel because it was dog friendly and all round has good reviews. \n\nThe first night around 1am I decided I should go to sleep, my partner already snoring next to me I lay down and my head started spinning, I suddenly felt violently sick and roasting hot and drenched in sweat. I tried to get up to go to the bathroom but the whole room was spinning and I couldn’t walk, I ended up crawling to the toilet, being sick and dragging myself back to bed where I must’ve eventually fell asleep.\n\nThe next morning I was sick until we left the hotel, couldn’t eat breakfast but the minute we were in the car and off the grounds I felt weirdly normal again. That night the exact same but our new dog now growling at the door and having to guide me to the bathroom.\n\nThankfully we went home the next morning and I quickly searched the hotel to find that above our room children died in a fire 100-200years before.\n\nHas anyone any experience with this? Or any ideas?  Never stopped thinking about it",
        "created_utc": 1673995764,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is it just a dream or more?",
        "author": "GreenSvi",
        "url": "https://www.reddit.com/r/Paranormal/comments/10ep2im/is_it_just_a_dream_or_more/",
        "text": "i had a very vivid dream that felt so real where i couldn’t breathe. i’m in bed with my SO &amp; in the dream he was in the same position he fell asleep in. Both of my nostrils felt clogged or shut. In the dream I woke up gasping for air &amp; asking him to call 911 but my words wasnt coming out due to me gasping for air also my eyes were rollling back. my vision started to get blurry &amp; cloudy. I couldn’t fight it anymore so i fell back. I woke up with him in the same position &amp; he was awake in the moment. I’m known for sleep talking and sometimes when im dreaming so i don’t know if he heard any if of that or heard me gasping for air.",
        "created_utc": 1673993111,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why are ghost Hunting videos always done at night?",
        "author": "ProfessorLongBrick",
        "url": "https://www.reddit.com/r/Paranormal/comments/10enagc/why_are_ghost_hunting_videos_always_done_at_night/",
        "text": "All the videos I've seen of ghost Hunting are always done at night and now I'm wondering why. Is there evidence to show spirits are more active at night? If so, that can explain it but I've never heard anything concrete about it. I guess it's because of the tropes of media in either fiction and it's stayed ever since.",
        "created_utc": 1673989024,
        "upvote_ratio": 1.0
    },
    {
        "title": "what is happening to me ?",
        "author": "RoyalChallengers",
        "url": "https://www.reddit.com/r/Paranormal/comments/10en6i8/what_is_happening_to_me/",
        "text": "So about a week ago it all started. I saw a haunted dream. And after that i am not able to sleep the whole night 11 pm to 6 am i am wide awake. If i sleep between these hours another haunted dream comes and i have to wake up. \n\nNow what i am feeling whole day: \n\nSo sometimes i feel like i am being watched. Like maybe there is someone in the corner standing i cant see him/her but he/she can etc. Also when ever I wake up from dream i feel a chill leaving my body. I also feel this chill at different times of day. Although i can think properly but i think someone is altering my thoughts. I am having some strange thoughts and can't really focus on anything. Also i feel like someone's hands on my shoulders waking me up when i sleep between 11 pm to 6 am.",
        "created_utc": 1673988771,
        "upvote_ratio": 1.0
    },
    {
        "title": "Anyone have any personal experiences with/thoughts on Lilith/Lilit?",
        "author": "Roadkill_Vegan",
        "url": "https://www.reddit.com/r/Paranormal/comments/10en0g3/anyone_have_any_personal_experiences_withthoughts/",
        "text": "[removed]",
        "created_utc": 1673988382,
        "upvote_ratio": 1.0
    },
    {
        "title": "My mom visited me in my sleep before I knew of her passing",
        "author": "ThrowAwayJellyBean77",
        "url": "https://www.reddit.com/r/Paranormal/comments/10empfh/my_mom_visited_me_in_my_sleep_before_i_knew_of/",
        "text": "So in this dream I'm in my room sleeping on my stomach, my son is sleeping next to me with his dad on the opposite side of him. It looks exactly how my room is set up. It's dead silent until I felt this pain in my lower abdomen. It felt like something had been ripped out of me. I became breathless and loudly gasped from the pain I felt. I didn't dwell on it long because right after that I heard my mom say my name. She was using that stern voice all moms use when they want you to pay attention or knock off whatever you're doing. It instantly got my attention. It felt like subconsciously I knew what it meant to be hearing her in my room. This fueled the urgency so I looked over my shoulder to see her but she's not there.\n\n My dream then switches to me being up in the corner of my room, I'm with someone and we're watching me and my son sleep. I know it was my mom, I couldn't see her and for whatever reason I couldn't turn to look. I just felt this warm heat on the left of me. When I tried to use my peripheral it was like a fuzzy gold light was blurring my vision in that area. I know she was talking, I could feel the words, I just couldn't hear them. I don't remember ever getting to say anything, I was just listening to whatever she was saying to me. I woke up shortly after and rolled over onto my back, I stared at the ceiling for a long time. That empty feeling from the Velcro rip in my dream was present. 2 hours later would be when my sister called to let me know about our mom's sudden passing.",
        "created_utc": 1673987675,
        "upvote_ratio": 1.0
    },
    {
        "title": "My Haunted Adventures",
        "author": "Blackwolf3569",
        "url": "https://www.reddit.com/r/Paranormal/comments/10el6w3/my_haunted_adventures/",
        "text": " Hello everyone, I am back with more spooky stories. I hope everyone is enjoying my writings of all of my paranormal encounters. Today's parts include two more stories.  \n Part V: In December of 2021, my girlfriend and our son moved into an apartment in Aberdeen, WA. In no way is she a non believer of the paranormal, but she does get spooked at the idea of sharing a roof with a spirit. In the year of living at this apartment, she hadn't heard any knocking, movement and/or seen any shadow figures. Some time after I started visiting her, we quickly found signs that we weren't alone. She would hear knocks or what sounded like something wandering around in her home.   \n\n\nAround the third or fourth time of me coming over, we hopped into the shower after a long day of adventuring. After rinsing off and stepping out to dry off I looked up into our son's room, and peering out at me was a tall shadow figure with long arms and glowing red eyes. Within a blink of an eye, it disappeared. Panicked, I leaned into the shower and told my girlfriend what happened. Shocked and stunned she responded “s\\*\\*\\* up no way, you're joking right?” After drying off and getting dressed I inspected our son's room but couldn't find any sign of the apparition. After both of us calmed down and went to bed we woke up the next morning talking about what we encountered.  \n\n\n Fast forward to a couple more weeks later, we started moving our son to his own bed and plugged in our baby monitor then climbed into our bed cuddled up in pure darkness. As we were slowly drifting to sleep, we could hear our son start to cry. We were laying there letting him cry out a bit. Then suddenly, hitting us like a truck, a deep demonic-like voice came through the monitor “WAKE UP!” Chills went up our spines and raced into his room and scooped him up and ran back to our bed. We finally moved her out of the apartment and closer to town.  \n Part VI: My first adventure with my girlfriend in a ghost town. As a sweet surprise my girlfriend took me out to The Franklin Ghost Town. It was an old coal mining town back in the 1880’s. In 1894, thirty-seven coal miners suffocated due to a fire that was intentionally started. It's around a 2.5 mi hike but the path splits in two. At the split, there's an old black minecart. The first path we took was straight, past the cart and into the residential area where old foundations are riddled with vine everywhere, along with beautiful scenery.   \n\n\nWe continued further down the path and thought we were walking onto private property. So we quickly turned around walking back to the split path. It felt different, almost as if we were being watched from the old foundations. When we made it back to the other path, we heard some of the conversions from the other hikers as they were passing by talking about the cemetery. Continuing on the path we made it to a big hole covered in old rail tracks and welded rebar which is the same tunnel that the miners suffocated in. I desperately wanted to visit the cemetery, so my girlfriend and I continued down this narrow path.   \n\n\nOne look on our left side and we could slide down the steep slope. We got about half way there to our destination when my girlfriend pointed out this massive mine cart track that goes through the woods (side note: nature reclaiming man made buildings is something I enjoy taking pictures of and witnessing.) After a little while of hiking, we finally made it to the cemetery. It was beautiful. Some headstones had fallen over on their own due to time in the elements, others had ivy and moss grown over and every headstone had a gift left out for them: old coins and toys for the little ones.   \n\n\nI remember reading a headstone of a little one who passed when they just turned one. This hike was gorgeous and the sights and smells were capturing and will forever be engraved in my head. It definitely gave me spooky vibes but I might have to return with a spirit box.",
        "created_utc": 1673984162,
        "upvote_ratio": 1.0
    },
    {
        "title": "Abandoned House Story",
        "author": "wisdompuff",
        "url": "https://www.reddit.com/r/Paranormal/comments/10ekw97/abandoned_house_story/",
        "text": "I was 10 years old. \n\nBack then, my friends and I would ride our bikes as far as we could, looking for adventure or to discover something new and exciting.\n\nAt this time my community was a mix of new and old and it was easy to find an old tunnel, the remains of a farmhouse or decayed paths and trails.\n\nWe set out that summer day with 1 extra boy than the usual crew, I had not formally met him yet. Nonetheless, we headed out on our bikes.\n\nWe came across an abandoned house near a farmers field and forest. \n\nWe started to explore the premises and we decided to settle here for a while. We walked in, checked things out and were just hanging out and sharing our findings. \n\nI started to hear the sound of rocks or gravel being moved through water ( like a slurry) emanating from the basement, I thought it was my friends playing in the house. I briefly ignored this. Suddenly there was wailing and the sound of gravel was getting louder like thrashing, like someone was throwing rocks or gravel. \n\nFrozen. There was no way my friends could make that noise. Quiet fast talking surrounded us. My one friend started to cry uncontrollably, his brother ( a warrior type kid) was preparing to protect his brother.\n\nTogether, we could see inside the house's front Hall and stairwells. The new Boy was giggling and gesturing us to come downstairs by waving us in with his hand.\n\nWe stood there dumbfounded. How or what? How did he not know the immediate danger we were in, that he was in!? I wanted to get him as I thought this was possibly his last moment on earth. \n\nBut I watched him return up from the dark stairwell leading to the basement.  He was still giggling and mirroring the exact same motion, he returned again downstairs and out of sight. \n\nWe screamed at him! But he kept doing the exact same thing over and over again. He was actually speeding up, like 2x then 3x faster. \n\nThe noises from the basement, I can only describe as pure despair, like an agonizing, painful and doom like quality, but they were human, or atleast human like.\n\nWe screamed at the Boy that we were leaving and it seemed like he was coming outside.  \n\nFrantic, we just started biking as fast as possible, petrified with fear I couldn't look back.\n\nIt was Dusk now and we had no time to reconvene, we separated immediately and went home before we were grounded. \n\nI asked my friends the next day if anyone saw the other boy?\n\n They responded, they thought he was someone else's friend from our group. We didn't even know his name or where he came from and we never saw him again.",
        "created_utc": 1673983495,
        "upvote_ratio": 1.0
    },
    {
        "title": "House near Hindenberg Crash Site",
        "author": "Hot_Ad_4306",
        "url": "https://www.reddit.com/r/Paranormal/comments/10ekqgy/house_near_hindenberg_crash_site/",
        "text": "From 2007-2009 I lived on Lakehurst Naval Air Station (NAWCAD). It is also the location of Hangar No. 1. \n“Hangar No. 1 is an airship hangar located at Naval Air Engineering Station Lakehurst in Manchester Township, New Jersey. It was the intended destination of the rigid airship LZ 129 Hindenburg prior to the Hindenburg disaster on May 6, 1937, when it burned while landing.”\n\nWe lived in a Sears kit home on the circle which was down the street from Hangar No. 1.\n\nThe home had a basement with a cement floor that covered about half the area and then there was a finished room with yet another adjoining room that once had a toilet and sink (they were removed so that a dirt floor with a closed off pipe was all that was there). This particular room made me physically ill whenever I went near it.\n\nThe second floor of the house had 1 large bedroom and rooms that were were overhangs on each side, so the height of those two rooms was only about 5’-6’. We let our daughter use one side as her bedroom and the other side as a playroom. The playroom had what we called an elf door, but it was just access to a crawl space. The playroom also gave me a bad vibe. \n\nMy daughter was 3-4 at the time and she would frequently ask me at breakfast why the tooth fairy was visiting her if she didn’t have a tooth under her pillow. I was alarmed but played along and asked what does she look like? My daughter said she was always in a white dress with white hair and her feet never touched the ground. I said maybe she was just checking on you because she likes you. It was frequent and my daughter was never scared. She said sometimes the lady tucked her in. \nIn the same house I once felt someone sit on the bed while I was laying down having a minor meltdown. I also had items misplaced only to find them in the place I just looked. \nThe first floor was where I spent most of my time. I am a big fan of puzzles and every time I put one together I would always be missing the last piece. I would leave the room and loudly announce that I couldn’t finish without the last piece and when I returned.. it was there. The area is within the Pine Barrens as well. The Pine Barrens is the location of the Jersey Devil.",
        "created_utc": 1673983121,
        "upvote_ratio": 1.0
    },
    {
        "title": "Thoughts on the Estes Method? Are there any other known methods out there for investigating?",
        "author": "gotghostco",
        "url": "https://www.reddit.com/r/Paranormal/comments/10ejcch/thoughts_on_the_estes_method_are_there_any_other/",
        "text": "[removed]",
        "created_utc": 1673979829,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is anyone noticing an uptick in paranormal activity. Solare flares maybe responsible",
        "author": "th3allyK4t",
        "url": "https://www.reddit.com/r/Paranormal/comments/10ejamp/is_anyone_noticing_an_uptick_in_paranormal/",
        "text": "For some reason I have a couple of friends who have mentioned they are having issues with ghosts. One does believe the other didnt. I have a theory an uptick maybe linked to increase in solar activity. Anyone notice any increase in the last six months or so ?.",
        "created_utc": 1673979715,
        "upvote_ratio": 1.0
    },
    {
        "title": "I am looking for a channel I forgot the name of, help please",
        "author": "Ok_Usual_8659",
        "url": "https://www.reddit.com/r/Paranormal/comments/10ej2vb/i_am_looking_for_a_channel_i_forgot_the_name_of/",
        "text": "[removed]",
        "created_utc": 1673979204,
        "upvote_ratio": 1.0
    },
    {
        "title": "Disembodied Foot Steps at my Aunts House",
        "author": "duchampio",
        "url": "https://www.reddit.com/r/Paranormal/comments/10eipp5/disembodied_foot_steps_at_my_aunts_house/",
        "text": "When I was around twelve years old, my cousin and I experienced something strange at his home. \n\nIt was early morning and I had stayed the night for a sleepover. He had an extra bed in his room where I had been sleeping  until waking up from the sound of his voice calling from the restroom, “Someone’s here!” His voice was shaky. I opened my eyes and looked toward the hallway. He was peeking out of the restroom door, looking down the hall and then back at me, worried. Then he ran into the room and jumped on my bed, staring into the hallway. I tried to see what he was so afraid of. There was nothing there. But then immediately, we heard slow deliberate foot steps as if someone were walking through the hallway toward our room. Yet there was no one there to be seen. My cousin, who was normally a pretty tough kid, was holding my arm and shivering in fright. I tried to rationalize what was happening, but the foot steps were crystal clear and not subtle at all. We even heard the metal floor heater shake as the foot steps passed over it. “It” walked to the threshold of the bedroom, then stopped. At that point the room felt very cold. \nNote: there were no pets in the house at that time. And the only other person there was my Aunt. She was clearly asleep as my cousin tried to wake her up first when he initially heard the steps moving through the house. Also, her bedroom door was open at the end of the hall, so we could see her as lying there as we heard the steps. My Aunt also had many paranormal experiences in the house as well, which we learned after we told her what happened.",
        "created_utc": 1673978387,
        "upvote_ratio": 1.0
    },
    {
        "title": "PLS HELP ME OUT ON THIS!!",
        "author": "RealisticAmbassador1",
        "url": "https://www.reddit.com/r/Paranormal/comments/10eilvu/pls_help_me_out_on_this/",
        "text": "Im now 18 but the paranormal always hounted me. When i was young like very young my parents did divorce.. didnt care i was 2 but when i grow older my parents still talked. Sometimes my mother will kome over and have a chat. Anyways my mom was there for some talk, and i remembered i was about to get a board game to play with them. I did go in my room and was about to grap a board game. But then my blanked from my bad was mooving like something js trapped in there. I was playing it normal after i got to my parents wasnt scared or anything. So after this it stoped. Until i was 12 when my family started a camp fire in our yard ( we do this like every month) some neighbours came around to drink and talk with my parents. They broudht there kids to and so we play together... Yk just some silly shit like catch and hiding. I was with a girl and we did run around the house . We have like heating tanks with oil under our house and for this reason there was a little basement. Basacly there was nothing there only the heat thinks yk. So we stand on the stairs from the basement ( remeber we are outside of it noone got down there and its was open too the outside so noo indoors) and we talked to each other when we heard fast steps and a very deep grouwling... No more like screaming coming towards us from down the stairs we got scared and run too our parents !! But those mf just told us we should fuck with them they wanna talk about \"parents stuff\" so anyways noobody was getting close to that fking thing the whole night. Its stopped from there.... I just was scared when it was dark... But now i can feel the presents everytime when im alone. Something is watching me. And my body turns cold. Only my head and upper torso. And im figuring out hoe i can find out or even comunicate with this presents or am i just paranoid ?",
        "created_utc": 1673978132,
        "upvote_ratio": 1.0
    },
    {
        "title": "¿A alguien le ha salvado la vida un suceso paranormal? 😶‍🌫️👻",
        "author": "HermanosParanormales",
        "url": "https://www.reddit.com/r/Paranormal/comments/10ehsbg/a_alguien_le_ha_salvado_la_vida_un_suceso/",
        "text": "[removed]",
        "created_utc": 1673976165,
        "upvote_ratio": 1.0
    },
    {
        "title": "Thé haunted laboratory",
        "author": "Messycrown_Zz",
        "url": "https://www.reddit.com/r/Paranormal/comments/10ehfz8/thé_haunted_laboratory/",
        "text": "[removed]",
        "created_utc": 1673975348,
        "upvote_ratio": 1.0
    },
    {
        "title": "body shaking and paralysis",
        "author": "vamprocket",
        "url": "https://www.reddit.com/r/Paranormal/comments/10eh4sj/body_shaking_and_paralysis/",
        "text": "A long time ago I used sleep in the living room of my apt. It was a warm summer night and I had my fan on low quiet mode. I was like in a state of near falling asleep. Then my entire body just shook. While I'm shaking I could hear my fan moving in slow motion. It was as if time slowed down. And the fan sound was loud. Then the shaking stop and I'm in some sort of paralysis. I could hear something in the kitchen. It sounds as if someone is getting closer. I try to say help, hoping my brother could hear from his room but I can't muster the breath to yell. I instead let out a whisper.\n\nThen I was able to snap out of it by somehow microshaking. Like I did everything possible to shake my body little by little until I was fully snapped out of it. This happened a few more times throughout the years but I eventually figured out how to counter it. Once I realized I could shake myself to snap out of it, I would always use that technique when I felt like it was going to happen again. I often wondered what would happen if I just surrendered and let the effect ride on. But I always shook myself awake. \n\nWhen I moved away from that apt, it never happened again. Was that a paranormal experience or just sleep paralysis? And why did it only happen in that apt?",
        "created_utc": 1673974630,
        "upvote_ratio": 1.0
    },
    {
        "title": "a paranormal investigation at a medieval battlefield",
        "author": "soulreaperparanormal",
        "url": "https://www.reddit.com/r/Paranormal/comments/10egwfx/a_paranormal_investigation_at_a_medieval/",
        "text": "[removed]",
        "created_utc": 1673974067,
        "upvote_ratio": 1.0
    },
    {
        "title": "Ah childhood Memories",
        "author": "Lawnsocks",
        "url": "https://www.reddit.com/r/Paranormal/comments/10eg494/ah_childhood_memories/",
        "text": "I have trouble believing in spiritual stuff, im quite the skeptic, but there's one situation that I've experienced that I remember quite well and think about often. \n\nI was 13 years old at the time, it happened at night. I had a closet door beside my bed facing the side of the bed (If you where laying on your side in my bed facing the closet you would see directly into it). Anyways I go to sleep that night and I always close the closet door as it always kinda spooked me out if it was open.\n\n One night i went to bed as everyone does every night. In the middle of the night I ended up in a sort of half, asleep state. I couldn't really move, but I felt like I could talk. And awoke in this half asleep state with my closet door open and me at the entrance of the closet out of my bed, and all I could see was something with a black leathery face with horns white eyes with black pupils. And whatever it was it was demanding me to come with it, all it kept saying \"come with me, come with me\" over and over.  \n\nMe being a dumbass I started yelling at it: \"No fuck you! Go fuck yourself!\" I kept saying that over and over again at whatever it was hiding in my closet. \n\nAnyways I wake up the next morning thinking I had a nightmare that felt very real. I've heard about sleep paralysis and thought that had to have been what I experienced. \n\nThe only thing I don't understand is how my closet door was open the next morning when I woke up.",
        "created_utc": 1673972115,
        "upvote_ratio": 1.0
    },
    {
        "title": "Ghost Waking Me Up at 3am??",
        "author": "Rbliss11",
        "url": "https://www.reddit.com/r/Paranormal/comments/10efmsv/ghost_waking_me_up_at_3am/",
        "text": "So to start off, last week I was having a dream about communicating with a ghost. I can’t remember anything from the dream except that I knew I was talking to a ghost in it. As soon as the dream ended, I woke up to my Amazon Echo (which sits on my nightstand next to my bed) making noise as if someone was turning the volume up. Obviously I was in the middle of the bed and there was no way for me to reach over and accidentally tap it in my sleep. I also noticed the time was exactly 3:00 in the morning. \n\nFast forward to last night, the same thing happened except I don’t recall having a dream. I just woke up to my amazon echo volume going up at exactly 3am. Please, can anyone give me some advice as to what I should do, and if something is trying to contact/mess with me? It doesn’t freak me out but being woken up at 3 is annoying that’s for sure!",
        "created_utc": 1673970938,
        "upvote_ratio": 1.0
    },
    {
        "title": "Speaking with my deceased aunt",
        "author": "certifiedpharb",
        "url": "https://www.reddit.com/r/Paranormal/comments/10efhm2/speaking_with_my_deceased_aunt/",
        "text": "For context, I live in my great aunt's old house. It used to be an apartment but when the man downstairs passed away (in the hospital, not in the house) we turned it into a single family home. Anyways, I was very close with my aunt Julia who was very old when I was born. Even though she was old she would read to me, color with me, play with me, and held me- even broke her hip holding me knowing that I was getting too big, but she loved me so much that she kept trying. I spent every day at my grandma's house with her while my parents worked, and one day while I was in bed with her holding me, she passed away. Many family members were also in the room, and when I realized that she passed I felt this sense of pure comfort and peace come over me. My grandma took me out of the bed and explained what happened, and I apparently smiled and said that I knew. I was about two and a half when this happened. After that, I kept telling my family that she sat in my room while I slept; she told me that she was there to protect me. Everybody thought that I was just processing death the best I could as a child, but I was never really upset with the fact that she died while she was holding me because even as as kid I understood that she went peacefully and there was nothing to be scared of. My family was religious so at the time I was happy that she went to heaven. Of course, my parents and grandparents sat me down and had conversations about it, and I took it well. Every morning when I woke up I would tell my parents that she was there watching me sleep and it started to freak them out, so they took me to a doctor to talk about my feelings and what I was \"imagining.\" A couple days after the appointment, I was playing in my room and saw my aunt and started talking to her while we played together. My mom walked in and asked me who I was talking to, and I pointed and said Auntie Julia. My mom looked horrified and picked me up and took me out of my room and sat me on the couch and turned on the TV so she could make a phone call. I heard her on the phone with my grandma in the other room telling her that she walked in on me pointing to and talking to my aunt, and when she walked in it smelled like her perfume that she used to wear before I was even born. When she came back out to the living room she was teary eyed and asked if I was scared and I said no, and she told me that one of the last conversations she had with her, my aunt told her that she would forever be there for me and do whatever she could to make me feel safe. Eventually I stopped seeing her and talking to her but I can still physically feel her presence around me mostly when i'm sad or going through rough times with my mental health. I still remember all of the times she visited me so vividly and i've talked to many therapists about it and they don't really have an answer. I'm not religious anymore so I haven't turned to anybody in a church to seek out an explanation but it's really comforting to know that I meant so much to her and that her energy is always with me.",
        "created_utc": 1673970578,
        "upvote_ratio": 1.0
    },
    {
        "title": "The lady with no legs",
        "author": "Major-Air4089",
        "url": "https://www.reddit.com/r/Paranormal/comments/10efb0o/the_lady_with_no_legs/",
        "text": "To start off, I live beside a cemetery so paranormal experiences aren’t really surprising in this circumstance. Anyways, when I was around the age of 9 and my sister was around 12 we shared a bedroom. To give you a bit of an idea, my bed was against one side of the wall and hers was against the other and there was a window between our beds. So, one night I had woken up (I’m unsure of what time it was) and I turned over to see a dark figure of a woman standing beside the head of my sisters bed. She had medium length hair, a tank top and a skirt on. It took me a second to realize that she had no legs… I put my pillow over my head for at least a minute expecting her to be gone but when I took the pillow off of my head she was still in the same spot. I was completely terrified and started kicking the wall, after a minute or so my dad got up to check what was going on. So, he decided that he would sleep in my bed and I would sleep in his with my mom. Eventually, I fell asleep and when I woke up the lady was standing beside me and I jumped and moved close to my mom. Then, I saw what looked like a little version of me sitting beside her partially on the bed wearing the exact same clothes that I was wearing at that moment.",
        "created_utc": 1673970114,
        "upvote_ratio": 1.0
    },
    {
        "title": "Sceptic ideas needed! Have opportunity to test spirits",
        "author": "CameronHicks",
        "url": "https://www.reddit.com/r/Paranormal/comments/10eexwr/sceptic_ideas_needed_have_opportunity_to_test/",
        "text": "[removed]",
        "created_utc": 1673969186,
        "upvote_ratio": 1.0
    },
    {
        "title": "What made you believe?",
        "author": "Secretlyabug",
        "url": "https://www.reddit.com/r/Paranormal/comments/10edq4g/what_made_you_believe/",
        "text": "I'm extremely curious about what other's turning points are, a significant event that made you believe in the supernatural?\nI don't think many just believe without having their own experience/s.",
        "created_utc": 1673966063,
        "upvote_ratio": 1.0
    },
    {
        "title": "Last night I saw the Djinn",
        "author": "hyperbolicuniverse",
        "url": "https://www.reddit.com/r/Paranormal/comments/10edh6j/last_night_i_saw_the_djinn/",
        "text": "Last night I saw the Djinn, or being that fit that classic bill\n\nYou can find from my other posts that I have a technique that allows me to see the shadow biosphere\n\nDon't ask me to prove it.  I'm not gonna try.   I am put this out there for info.  Burn me all you want.  I don't give two shits.\n\nIn this instance I was able to see what I believe is the same realm I have seen in the past.  All the usual suspects where there.  The landscape was the same.   As well as the flora and fauna.\n\nThey were many dozens of them.   They were having a party or maybe it was like a bar scene.  I'm not sure.\n\nOn thing for sure that surprised me.  They are JUST LIKE US.  They act just like us.  They play music and instruments like us.  In fact, in the bar, many of the song I heard were human songs.   Some were not, but many were.\n\nThey had phones.  Like, iPhones.  Of course there were not iPhones, but something very similar.\n\nAnd each had a small white dot on middle of the screen.  Somehow, they could activate that dot and from it would begin plotting out a physical mesh that became a permanent window to another place, the other place they \"called\" I assume\n\nThe were absolutely ecstatic that I could see them.   They kept come up to me and talking miles a minute and gesturing to take my picture.\n\nThey even video called.  Yes, they did.  And they would hold their \"phone\" with me in the back ground, like a selfie.  Whenever I would wave hello at the other parties on the call, usually several, they would go WILD that I could see them.   Jumping around like their team won the World Cup.   Waving and smiling back.  It was funny and kind.\n\nI can see them, but I can almost not hear them.   All I hear is a quiet muffle and sometimes a few words.    I can \"sort\" of feel them because they would sometimes touch my finger tips to see if I would react.  \n\nEach time, I would point at my ear and shake my head \"can hear you\".   Each time, they would write something on their \"phone\" and hold it up.\n\nIt was just too dark to see the screen.  But I could almost.  So, more to come.  We will work that out.    I wrote on my phone \"Can't hear you.   See you, but dark.   Your screen is too dim for me to read\".   I think this was not necessary because I think they could hear me fine.\n\nOne funny thing:  I have the large piece of art on my wall that says \"(my name) &amp; Company\"\n\nOn of the people there pointed at that sign and said \"(My Name)\" and &amp; company (pointing to all the people in the room).  Haha\n\nThey were kind.  Very happy.   Seemed to like to engage in a lot of open sex.   They have technology.   Also they could float when they wanted.\n\nNo one will believe me.  I don't care.   \n\nI see them.  I will see them again.\n\nI told them I would be back.",
        "created_utc": 1673965405,
        "upvote_ratio": 1.0
    },
    {
        "title": "Gnomes, Shadow People, Ghost, Witches and an unknown entity",
        "author": "Cultural_Ad_1838",
        "url": "https://www.reddit.com/r/Paranormal/comments/10ecdql/gnomes_shadow_people_ghost_witches_and_an_unknown/",
        "text": "I've had encounters with each creature from above, I started to see gnomes when I was 12 or 13, they were small and ran across the floor, this has continued to happened without provoking or summoning.  My last encounter I was not the only one who saw it my friend and I were sitting on my porch and one humanoid figure ran by, It was too small to be a human with those capabilities. Shadow people have always been a problem, my mom said when I was a baby one figure hovered over me. I have tried taking videos of them and I have had technical difficulties where they can not be captured and the video no longer loads and works. They have been ranging in heights but are usually tall. They are dark but have humanoid figures. I see them more clearly in sleep paralysis but when I am awake I see them as well. My last memorable sleep paralysis shadow figure hovered over me they resembled the figure of death. I've had feeling of levitating during paralysis and getting blankets taken off me, along with waking up in weird positions like laying horizontally in bed when i go to sleep vertically. When they are around I feel anxious and fearful. I pray in hopes they will leave. In terms of ghost I have seen a pale woman with a face dressed in dark clothing in my home. They were there for a moment and left. I am concerned due to my use of the Ouija board in my home. I had two childhood homes that were haunted. One a boy lived there, there was foot steps and you would see the boy at times. We moved, in this home things would move by themselves, items will fly off counters and shelves. My mom would see it as would I.   In terms of witches my mom and dad both practiced one day I went to the woods and saw a witch or what I believe to be one, I was in a wooded area by myself going on a walk and in the trees I saw a woman wearing a black dress that was very layered they were not flying more just levitating I pretended to not see it and quickly walked away outside of the woods, when i looked back the woman was on the side of the trail there was not a possibility that it could have gotten there so quickly it did not make contact other than stare. Unlike the woman i perceive as a ghost, this entity was solid, they looked like a human and were aged but had capabilities that were not human. Lastly, i make painting and draw but i have terrible experiences making them. I will see shadow people around me crawling on the walls which in turn makes me destroy all my art because I think it releases evil. I slept on the couch last night and I heard a voice coming from near my last painting. I feel eerie when looking at it. It is hung in the living room behind the couch. As i laid down I heard my roommates voice from behind me. I knew he was not behind me because he was sleeping in his room. It kept calling me and I did not respond. I try to never respond. I don't know why supernatural encounters keep happening.  If any one has any way I could decrease the encounters from happening please help.",
        "created_utc": 1673962421,
        "upvote_ratio": 1.0
    },
    {
        "title": "Hello. Please, answer or reply to my question if u know. Tysm.",
        "author": "EducationalEast1899",
        "url": "https://www.reddit.com/r/Paranormal/comments/10eblda/hello_please_answer_or_reply_to_my_question_if_u/",
        "text": "Hello. I a student in senior high school, i’m 17 yrs old. I am not used to reddit and this is my first time using this (i’ve seen videos of reddit in tiktok and i also want to ask you all if you’re experiencing the same thing because i still can’t believe what i am experiencing and thinks it’s just all a coincidence).\n\nI didn’t really care about this when i was young. But now that i am a young adult (?) i am curious about it. \n\nWhenever we watch tv series or movies (anything) i knew who’s gonna be the villain, hero (protagonist and anta), who’s gonna died, and what is the plot twist. I was shocked that people don’t usually know what’s going to happen or GOING TO HAPPEN in movies/series. I thought they know what’s going to happen.\n\nI can also see what’s going inside the person (her feelings, thoughts, ideas etc)… or if she/he will lie to me or is lying to me. O can not predict a certain future but i can see it but i’m not sure about it tho. That’s why i feel alone most of the time because i know what’s going on inside them esp that i know my parents feelings. I also feel that i have no friends because of the things i see in them. (Humans are not perfect..they said so i just had to carry it all along after all we are all humans). \n\nI can also know what’s going to happen in the next moment. Or if this person going to be great someday or will be famous. \n\nI also know if this person is going to teach me or guide me in my life. \n\nIf you have read this far, please let me know about your perspective (no hates allowed i’m sensitive)  I just want to know your answers. Thank you. And yes. Ghosts is real but they only appear in the eyes of childrens and animals and if you do have contact with them then just leave them be or if they haunt you that’s evil and u might want to leave ur house).",
        "created_utc": 1673960111,
        "upvote_ratio": 1.0
    },
    {
        "title": "My experience with a ghost cat",
        "author": "Saeis",
        "url": "https://www.reddit.com/r/Paranormal/comments/10ebeoa/my_experience_with_a_ghost_cat/",
        "text": "I just wanted to share because it convinced me that ghosts are real. Maybe others can relate.\n\nExperience 1: I see a cat run into my room through the corner of my eye. Nothing there, I didn’t have a cat at the time.\n\nExperience 2: Time goes on, and I got a real cat. At some point, I started noticing something jumping on the bed every night and walking around me. It felt exactly like a cat walking around the bed, except my cat was either laying next to me or on the chair near me. I could even feel chills like it was breathing on me when it got close to my face. This became a nightly occurrence.\n\nExperience 3: Some time in the night, I wake up out of a dream. When I open my eyes, I see a ghostly looking cat laying on my chest with its head pointing away. It instantly notices me, turns and looks at me, and then jumps off and disappears on my bed’s headboard. I actually felt it jump off of me.\n\nSome other bits to wrap up: We had a plumber inspecting the basement and foundations He found 6 cat corpses from when they were apparently getting in during the winter but couldn’t get out. There were other strange things happening like cabinets opening on their own, specific lights dimming at the same time, etc.\n\nI ended up moving and all the experiences stopped. Sometimes I wonder if the cat(s) just wanted comfort and what could be done to lay their spirits to rest.",
        "created_utc": 1673959536,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can I sense things?",
        "author": "chanmariexoxo",
        "url": "https://www.reddit.com/r/Paranormal/comments/10eb851/can_i_sense_things/",
        "text": "Sorry for the long post in advance. Thank you for reading.\n\nI've always felt like I can tell the difference in energies in certain places. These are some of my experiences: \nWhen I lived in a flat when I was about 12/13 I felt like I was being watched from particular doors and I had a sense it was an old man. Then I've had the feeling of being rushed down the stairs with someone pushing on my back. When my stepnan died I dreamt she visited me; she walked through the door with a purple aura around her and a few other people came through after her that I didn't recognise. The room was pure white ( white door, floor, walls, sofas, tables etc). It felt extremely real and I had to come round for 10 minutes after because I couldn't tell if it was reality or not. I've had a few more dreams like this but its always about a loved one going missing although I eventually find them. When I was a child I drew a picture of a woman, and my stepfather (who can see things) said she was my spirit guardian. Currently in the house I live a few months ago I was convinced someone was watching me from the wardrobe, every night I would feel like someone was touching my arm as if stroking me. I also had an alarm clock turn on without anyone being near it, like when you touch the button and it beeps. About 10 years ago I slept at my nans and held hands with someone while laid in her bed for over 15 minutes when I was on my own. I've walked down a road with the feeling my feet were burning to later find out years later that at the top of the street a woman and her kids died in a house fire. My cat currently runs away for days at a time and I could spend over half an hour shouting him but when I ask for help from my nannan and grandad (who died 3 years ago) he comes to me within 5 minutes. \nIf you've made it this far, can I sense things or is it all in my head?",
        "created_utc": 1673958974,
        "upvote_ratio": 1.0
    },
    {
        "title": "Ghost investigation",
        "author": "Royal-Satisfaction31",
        "url": "https://www.reddit.com/r/Paranormal/comments/10eb68t/ghost_investigation/",
        "text": "Okay  so I've had several nights of no sleep due to activity any tips or advice for this? I've never done this before so it's all new for me. But what i can't keep having sleepless nights. My only solution is to do some digging history wise and do a ghost investigation",
        "created_utc": 1673958808,
        "upvote_ratio": 1.0
    },
    {
        "title": "I see dead people..",
        "author": "Queen5252",
        "url": "https://www.reddit.com/r/Paranormal/comments/10eaj6s/i_see_dead_people/",
        "text": "My little brother……. He’s an amazing man with a magnetic personality. A person that you can stand next to and automatically feel safe around. As you can tell, I adore him. He called me to vent about the crazy things that’s happened and im ready to share it with you all. \n\n\n \nIt all starts with him going out with a group of friends to a brunch. As he uses the rest room he bumps into an old high school friend. As he is catching up with the friend he notices someone standing behind the friend and is an older gentleman trying to speak. My brother had never seen anything spiritual before so when he asked the friend if he is here with anyone. The friend said no…. So automatically my brother knows it’s a spirit. So he watches the spirit and the spirit is trying so hard to hand something to the young man. My brother notices it’s a necklace with a cross on it. So naturally my brother starts to describe the older man and telling him what he is holding in his hand. As my brother nearly finishes the description, the guy is full blown crying saying it’s his grandfather and that’s his necklace he gave to him. That this was the first time he hasn’t worn it since it was given to him. \n\nsame night he walks out of the brunch spot with his friends. My brother catches a woman standing near, she ends up telling my brother about how proud she is of her daughter and how amazing all her tattoos are. My brother not knowing ends up telling the ladies about the woman that he spoke too… telling them that she said her tattoos are amazing. In that instant a young lady who is covered neck down starts crying softly. My brother never met her before, this was a friend of a friends. Yet my brother was telling her about how her own mother who passed away. Anyway, there are more stories. I’m just ready for bed… goodnight all!",
        "created_utc": 1673956768,
        "upvote_ratio": 1.0
    },
    {
        "title": "Forest not far from the village where I live",
        "author": "Blahkchan",
        "url": "https://www.reddit.com/r/Paranormal/comments/10eaa2e/forest_not_far_from_the_village_where_i_live/",
        "text": "I will try to sort the events chronologically, they happened between my 14 and 20 years of age, for context I am currently 22. The village in question is called Mójcza, it is less than a kilometer from the city of Kielce, Poland. I have also not lived there for two years.  \n\n\nAn important thing I want to mention is a warm friend of mine I met here, Jacob, who will be crucial to several situations.  \n\n\n1. The forest itself was huge although typical of forests in Poland. My friend and I often spent our free time there. The forest had no owner, and we loved exploring it. We built a small bridge by the stream so that we didn't have to go around it or jump over it. A few days after building it, when we were returning home from deeper parts of the forest, as if from a tree, a stone flew towards me, which almost hit me in the head. At the time and for a long time afterwards we joked about it, although it was a dangerous situation. Of course, we ignored it.\n2. It was harvest time, as I remember there were bales of hay in the fields at the time, which we loved to jump over. We chose fields that were more submerged in the woods so as not to risk being caught by farmers. It was already getting dark, more slowly sunset. On our return we saw a black figure, behind a small stream (Different from point 1, this forest is repeatedly crossed by water). We looked at the figure for a while, but did not care about it at the time. We even laughed that it was the figure that threw the stone then.\n3. We saw this figure again, twice on another day, shortly after the previous incident, in the same areas. \n4. This is the last part where my friend was with me. In the deeper parts of the forest we found something like rabbit holes, only bigger. We have seen rabbit den quite often, so I doubt we could have been wrong. Nearby we found a traveling suitcase, with strange things inside. From that moment on, my friend stopped attending this forest.\n5. I myself enjoyed running through the forest, in other parts of it, especially in the evening. I came across a phenomenon that I would most simply describe as earth-breathing. In a certain area, the ground regularly rose and fell. \n6. And this is where things started to get weird. I covered my running route as usual, but on this day I turned back. While running, I heard an unnatural growl from the bushes (Over the years I've clocked wolves or foxes, it sounded much different). There seemed to be nothing in the bushes. I preferred not to tempt fate and turned back home. The growl itself was deep, very bass.\n7. Last, and probably the strangest thing. I was already of age. It was dark, my one of the few trips after dark. I don't even remember what for. Passing a long path in the woods, I heard not far away but in a denser part a kind of choir, something like church singing. I'm not an expert but it sounded like it was in Latin. I ignored it, going back I didn't hear anything anymore.  \n\n\nYears later, my friend and I came to the conclusion that there were probably black masses or something of that nature. There were also often suspicious cars hanging around in the area for years. I'm not a big believer myself, but who knows.  \n\n\nP.S. Forgive me, but my English is not at the highest level.",
        "created_utc": 1673955886,
        "upvote_ratio": 1.0
    },
    {
        "title": "Items in my room keeps disappearing only to appear later on",
        "author": "Alert_Refuse8078",
        "url": "https://www.reddit.com/r/Paranormal/comments/10e9zmw/items_in_my_room_keeps_disappearing_only_to/",
        "text": "I think my (22F) bedroom is haunted or there is a spirit moving things around. This all started happening after I have received multiple there knocks coming from outside. The first couple of times my window had been closed which I ignored. The last time hearing it my window was open and I just ignored it. Now items in my room keeps disappearing only to be found in an unusual spot. Lately it seems to be my keys or items I use daily. I have lost my keys twice last week within a couple of days apart of each other. Tuesday I had remembered seeing my key that day and when I needed to leave for my appointment they vanished. I have a lock on my door and accidentally locked myself out so I had to enter through the window. While doing this I had to step on my bed. I tore my room upside down with no luck. I had to leave otherwise I would’ve been late and took my spare key out of my bag and locked my door. When coming back home I then had to renter through the window and onto my bed. When going to look for it again I had found it underneath a pillow below the window. My bed was made before I tore my room apart and it definitely wasn’t there. Friday I lost it again and found it on the ground underneath a bag on the floor with clear view from the door. I have told my Mum about this and she doesn’t believe me. \nHas anyone experienced this and what can I do about it?\n\nPs. My phone has been fine all day and as soon as I start to type this out my keyboard is very flow and lagging.",
        "created_utc": 1673954863,
        "upvote_ratio": 1.0
    },
    {
        "title": "the car wreck dream",
        "author": "db115651",
        "url": "https://www.reddit.com/r/Paranormal/comments/10e8h52/the_car_wreck_dream/",
        "text": "A few years ago I woke up hysterically crying from a dream I had. \n\nIn this dream my younger sister was in a really bad car accident. She was thrown about the car slamming her head on both front side windows and then landing behind the driver's seat. her spirit was left in this limbo state just like bright white but greying area where we were our physical forms. I somehow was there with her in that realm and letting her know she had to scream and scream and try to find her way back but she can get back to us and tried to reassure her to not panic just get back in her body. Something snapped me out of the dream and I just start bawling.\n\nMy husband asks me what was wrong and I tell him the dream. Really shook up I took a shower to try to calm down. I finally get back to sleep and 45 min later we get a phone call.\n\nMy sister in law was in a car crash. Put into a medically induced coma after hitting her head and on breathing machines. She wouldn't come out the coma for a few days (the time in the hospital was moving extra slow but also somehow so fast it's a blur). \n\nIt's still the spookiest thing that's ever happened to me. I had felt other intense feelings after dreams like when my aunt died or grandmother in law died, but those were just feelings I got that they left and we were expecting them to pass more or less. I had also had premonitions before of really mundane stuff honestly, very random and mostly unimportant. this was like watching it in real time from the backseat but the it was the wrong person's face and the in-between void was both pleasant and unnerving with a lot of anxiety.\n\nWe've talked about it and she doesn't remember anything from that time. I don't like to talk about it and I still get flashbacks to that dream I had, but now the face is just a blur. It still really upsets me if I dwell on it too much",
        "created_utc": 1673949334,
        "upvote_ratio": 1.0
    },
    {
        "title": "Need help identifying this haunting",
        "author": "HolyMolyRoliePolie",
        "url": "https://www.reddit.com/r/Paranormal/comments/10e83c3/need_help_identifying_this_haunting/",
        "text": "[removed]",
        "created_utc": 1673947879,
        "upvote_ratio": 1.0
    },
    {
        "title": "Apartment of 3 years suddenly haunted?",
        "author": "mothgall",
        "url": "https://www.reddit.com/r/Paranormal/comments/10e6yhj/apartment_of_3_years_suddenly_haunted/",
        "text": "     I have been living in the same apartment for three years now and I have never noticed anything out of the usual. I have had experiences I would deem paranormal before so I usually know when a house gives me the heebie jeebies, but my current apartment has been fine so far. \n     Recently however I’ve noticed some weird things starting with random knocks and sounds like cabinets opening- things I can dismiss. However, last night I experienced something really scary and I gotta get some advice. \n    I woke up to my fire alarm beeping I guess because the battery needs to be replaced. I walked over to hit the silence button when I heard my roommate who lives in a room downstairs questionably say my name through the door. I opened the door and nobody was out there, I called for them a few times but nothing. I closed the door and hit the hush button just to hear my name called again. I opened my door and instantly felt scared so I slammed it shut and locked it (lol like it would do any good. \n    I called my roommate and heard their phone ring downstairs when they answered they had clearly just woke up and had no clue what I was talking about.\n   It’s three am the next day now and i cannot sleep so any consolation is welcome!",
        "created_utc": 1673943664,
        "upvote_ratio": 1.0
    },
    {
        "title": "baby called for me from his crib, while in bed with me",
        "author": "Dismal_Ad2432",
        "url": "https://www.reddit.com/r/Paranormal/comments/10e6xd2/baby_called_for_me_from_his_crib_while_in_bed/",
        "text": "This morning, my son (1 1/2) woke up in his crib yelling “mama”. My husband got up and brought the baby back to bed with us. As all three of us were lying in bed together when we heard him say “mama“ from the crib again. ALL THREE OF US WERE IN BED TOGETHER. My husband and I both heard it, clear as day. I seem to be the only one super creeped out by the fact that a demon child said “mama” from my son’s crib. could this be considered a glitch? or should I call a priest?",
        "created_utc": 1673943546,
        "upvote_ratio": 1.0
    },
    {
        "title": "Goteborg sighting circa 1960’s",
        "author": "scrfvicious",
        "url": "https://www.reddit.com/r/Paranormal/comments/10e6qw5/goteborg_sighting_circa_1960s/",
        "text": "I’ve posted this story before. Long ago. \nHere it is again\n\nMy grandparents were walking home one night after a dinner with friends in an industrial blue collar type neighborhood of Gothenburg Sweden. My grandfather an ex boxer survived nazi occupation etc .. As my grandparents are walking home they see a figure across the street hovering above ground slightly with a box type head and a cape that fully surrounded this figure- the cape sparkled , the figure turned towards them and as my grandfather went to investigate or perhaps punch this thing my grandmother said simply think of our daughter.  As they walked around the corner this figure slowly turned and followed them with (sight)? Never moved   Just floated and was stationary.",
        "created_utc": 1673942853,
        "upvote_ratio": 1.0
    },
    {
        "title": "The White Car I Swore I Saw.",
        "author": "AdVegetable9560",
        "url": "https://www.reddit.com/r/Paranormal/comments/10e6gq1/the_white_car_i_swore_i_saw/",
        "text": "From a young age I had been introduced and involved with the idea that there may be something beyond living things, such as spirits, ghosts, etc. I would see the occasional shadow person, or experience the unexplainable, but what happened on this night truly tops everything. \nOctober 8th, 2021. I had been sitting in my living room confiding in the movie I was watching. From the place I had been sitting, you could see the front door, meaning you could see if someone was there or not. We also had a doorbell camera that would notify me that there was motion detected, even cars. Knowing this, what I had seen truly makes no sense.\nA “white car” had abruptly stopped in-front of my house, typically I would brush this off because people randomly stop by my house on the daily. But it was the dead of night, and my neighborhood is quiet.\nMy house is positioned in a way where you could even feel someone dribbling a basketball from outside. This would come to explain why I was able to “feel” something, or rather someone, trudging down the sidewalk by my house. \nLater I would come to find out that my older brother had claimed to have heard this so called person scream whilst getting out of the car. His room is in the front of the house, meaning that he could have seen this whole ordeal go down. Unfortunately this is not the case, he had only seen the car peel off into the night after the “girl” had screamed and ran away. \nMy brother and I were the only ones to have seen this happen, we even turned to our mother who had access to our front door camera footage. You would think that this camera would come in handy right? Well unfortunately that very camera had nothing to show. When we looked at the doorbell camera, it was just darkness. Nothing seemingly abnormal, no white car, and definitely no woman in distress. The most definite thing I could point out about the footage was that it looked like it had been altered in a way, as if it were copy and pasted. \nThis is as far this story goes unfortunately, seeing as that I have yet to learn anything new. I am left with more questions rather than answers.",
        "created_utc": 1673941819,
        "upvote_ratio": 1.0
    },
    {
        "title": "Sleep paralysis?",
        "author": "Wide-Bug-2567",
        "url": "https://www.reddit.com/r/Paranormal/comments/10e60p7/sleep_paralysis/",
        "text": "Hello everyone I think I just had a sleep paralysis not sure though\nI woke up at 8am but still felt tired so I accidentally felt asleep again \nAt first I felt like something was thrown beside my bed but I was to tired to “investigate” so I let it be but then slowly I started hearing heavy breathing right in front of my face \nOnce I opened my eyes something held my arms right were they are and I started feeling like something is on top of me with the breathing keeps getting louder (like a wolf or something like that) \nI wasn’t really scared I just found it interesting in a way so I kept calling my sister so she can see but nothing would come out but a whisper \nWhen the breathing came closer to my face I kept saying hi to the thing and wanted to tell it that I’m not scared and I just want to know more \nBefore I know it I woke up \nWas that a sleep paralysis?",
        "created_utc": 1673940210,
        "upvote_ratio": 1.0
    },
    {
        "title": "My stepdad dreamt of our heads floating in a bath of blood, before he met us..",
        "author": "Emotional_Cress1272",
        "url": "https://www.reddit.com/r/Paranormal/comments/10e5ve1/my_stepdad_dreamt_of_our_heads_floating_in_a_bath/",
        "text": "So reading through stories brought up a memory of my stepdad telling me a story when I was about 15, that I thought I'd share.\nMum was out somewhere and I was at home watching a movie with my stepdad. He'd been in our lives for a couple of years by this stage.\nHe started to tell me about a dream he had when he was much younger, previous to meeting my mother and us kids. \nHe says in his dream he walked into a bathroom, which had the same tiles from the bathroom in our previous home, and there stood a wich looking lady, laughing. He looked at the bathtub and in it were mine, my brothers and my mothers heads, floating in blood.\nHe said when he first came over to our old house he recognised the tiles in the bathroom from his dream.\nI mentioned it to my mum and she just says \" Yeah he's told me about that too\" uhm ok 😳.\nHonestly if I was in her shoes I probably would have left him over that. Whether or not it was true , it's severely messed up.\nHe says he never mentioned it while we lived in that house so as to not scare us.\nWould love to hear peoples thoughts on this.",
        "created_utc": 1673939668,
        "upvote_ratio": 1.0
    },
    {
        "title": "Playing with a dead relative",
        "author": "DistributionDeep9656",
        "url": "https://www.reddit.com/r/Paranormal/comments/10e55uh/playing_with_a_dead_relative/",
        "text": "I was about 6 years old at the time and was at my cousins birthday party the backyard was pretty big they had a good number of people there probably about 25-35, there was a big bouncy house In the back yard and they also had a pool. I remember going on the other side of the pool because a older man with a thick mustache wanted to play catch with me , me and him played catch for like 10-15 minutes it felt like only me and him were there but this area we were in was in the open. I had never seen this man in my life until now. After we’re done I tell him bye and I go back inside and talk to my older sister and cousins and say I was playing with a man I’ve never seen before and he had a thick mustache and while trying to describe him we pass a little 4x 7 picture of him sitting on a little table smiling with aunt and mother and I ask them who this was and tell them I’m sure that’s the guy I was playing with I recognized his eyes and mustache turns out it was their father who had died before I turned 2. I swear till this day he was tossing the frisbee with me , his face , the mustache I’m sure it was him.\n\nDisclaimer: I’m kinda skeptical about paranormal stuff but I truly believe somehow he was there",
        "created_utc": 1673937169,
        "upvote_ratio": 1.0
    },
    {
        "title": "My TV comes on randomly",
        "author": "Kumba1974",
        "url": "https://www.reddit.com/r/Paranormal/comments/10e4z25/my_tv_comes_on_randomly/",
        "text": "So, we have lived in our house for about 3 years. The house and our neighborhood are only about  20 years old, with no relevant history that I know of. The previous owners had a teenage son who died while they lived here but not in (or near) the house. The couple never recovered understandably, their life spiraled with one heartbreak after another and they ended up divorcing a handfulofyears after their son died. There was very angry writings in red matker on our bedroom doors that indicated the wife had been unfaithful. The whole house was very unkept, except for one room, which was IMMACULATE and empty.  I guess I've never added up all the details til now because as I'm typing, I keep going back to 'no relevant history', but that just doesn't seem so with the negative energy and soul crushing sorrow the previous owners endured.  Anyway, we have a TV in our bedroom that randomly turns on nearly every day/night at all different times. Our closest neighbors who face the side of our house where our bedroom is are way out of remote control  range with their house being 200-225 ft away. Could this be an actual TV malfunction or something else?  Any questions or ideas welcome! Thanks in advance!",
        "created_utc": 1673936514,
        "upvote_ratio": 1.0
    },
    {
        "title": "Experiences I've had at my friends Apartment",
        "author": "Payido",
        "url": "https://www.reddit.com/r/Paranormal/comments/10e4mda/experiences_ive_had_at_my_friends_apartment/",
        "text": "I moved into this apartment with my mother and older brother about 4 years ago, and I've had a few different things happen. I can't add a drawing of my apartment layout, so I'll explain it to the best of my ability. When you walk into the apartment, to your left is the living area and to your right is the dining room in front of you is the hallway and the hallway bends left (after a few feet) before the bend there's a room and the door goes back a little and kinda disconnects from the hallway. After the bend is my room door on the right (so you can see it from in between the dining and living area)  \n\nI was in my friends apartment, which is a mirror image of my apartment. This friend of mine has had these odd dreams for almost a year now. In these dreams, he sees the same lady with a silk white nightgown. Her hair is dark, and she has a long Bob. A few times, this lady has helped him, but more so, she tries to make him fail. But normally, she hangs out in the background. When she was trying to save him in this one dream, she grabbed his wrist and where her hand was it burned. When I was over there, I was walking out of his room and he was standing in front of the hallway (in between the dining room and the living area) he turned around and dropped the plate he was holding and his jaw dropped. He saw her sitting in a chair in the living area. He blinked and she was gone. A few days later, I went over again, and I was standing in the same spot he was that time, and I turned to look down the hallway and saw a lady flying threw the wall (in front of where the one door disconnects), she had a dirty white layered dress, and dark layered-ish hair. And she just flew across the hallway. \n\nI was in the same friends apartment, but I was standing in the part where it turns left, past my friends door) and I turned around to face where I had seen the lady but this time I saw a very tall dude who looked like pinocchio, he was definitely over 6ft. Believe I've seen him twice but I can't remember the other time. (That was the first time I saw he so it was more shocking. Therefore, I remember it better) \n\nThis is my first time posting on here, and these stories are Definitely, not as crazy as some things I've read on here, but I still wanted to share!",
        "created_utc": 1673935341,
        "upvote_ratio": 1.0
    },
    {
        "title": "Strange floating lights",
        "author": "that_one_kid_on_bo2",
        "url": "https://www.reddit.com/r/Paranormal/comments/10e3nwh/strange_floating_lights/",
        "text": "[removed]",
        "created_utc": 1673932316,
        "upvote_ratio": 1.0
    },
    {
        "title": "seeing things as a child",
        "author": "asdfcrow",
        "url": "https://www.reddit.com/r/Paranormal/comments/10e3mb0/seeing_things_as_a_child/",
        "text": "when i was a child, i have for the longest time had a memory of a reporter on the television with a mouth on his forehead. i did not know what to make of it but was unsettled.\n\ni eventually chose to forget about it after it haunting me for but recently i saw myself become possessed by a demon during a psychosis, i believe it’s possible i was affected by this, that the psychosis facilitated the demonic visions i had. i suddenly remembered this memory and i think they must be connected in some way or related in some sort. i have never told anyone about the first incident",
        "created_utc": 1673932187,
        "upvote_ratio": 1.0
    },
    {
        "title": "I need help please with a attached spirit",
        "author": "albino_yeti_f150",
        "url": "https://www.reddit.com/r/Paranormal/comments/10e1ncd/i_need_help_please_with_a_attached_spirit/",
        "text": "Hey I believe a spirit of some sort has attached itself to me, i hear taps on random objects such as mirrors, window seals, tables and walls I was wondering what kind of spirit will do this and how to get rid of of it. Any help is greatly appreciated 🙏 this spirit doesn't harm me in anyway... yet and I've heard the tapping noise at different places I've stayed but only for one night weeks in between and it's currently gotten worse where it does it during the day aswell and throughout the day and I would like it to stop, I've tried praying, being polite and asking to go towards the light and to leave me alone but it sorta like to keep me up at night just tapping on stuff",
        "created_utc": 1673926395,
        "upvote_ratio": 1.0
    },
    {
        "title": "Hell Hounds are they real or just feared creatures with a bad wrap",
        "author": "TheMidnightLight3",
        "url": "https://www.reddit.com/r/Paranormal/comments/10e0rik/hell_hounds_are_they_real_or_just_feared/",
        "text": "So my buddy saw Two Big Black Dogs with Red eyes while he was walking out of the woods when he was leaving a party we were at. He told us the next day before cell phones we stayed there 5 hours after he left. He ran when he saw them cause he didn't have a flashlight. See the first thing I said it was Coyotes and u flashed ur light on them but like I said he didn't have a flash light he ran got in his car and saw the dogs walk by his car and they were up were the top of the window was he drove a Monte Carlo. He was supposed to come back but never did we weren't mad but well a couple of us were I didn't care I grew up in the woods u see alot of stuff u can't explain when u live in the woods. Number One what do u think it was and Number two was it fucked up he didn't drive back and tell us.",
        "created_utc": 1673923902,
        "upvote_ratio": 1.0
    },
    {
        "title": "Paranormal Activity? should we be worried?",
        "author": "Haunting-Ad3852",
        "url": "https://www.reddit.com/r/Paranormal/comments/10e0lc7/paranormal_activity_should_we_be_worried/",
        "text": "[removed]",
        "created_utc": 1673923416,
        "upvote_ratio": 1.0
    },
    {
        "title": "Dancing Orbs of Light",
        "author": "Decayin_with_theboys",
        "url": "https://www.reddit.com/r/Paranormal/comments/10e0as8/dancing_orbs_of_light/",
        "text": "A few years back in Boy Scouts we were staying at a cabin at a weekend camping trip. Everyone was asleep but I awoke in the middle of the night. I looked over to the main area in the middle of the cabin where the dining tables were located. Near the top of the ceiling in one focused area there were 4-5 glowing balls of different colored lights. Each one was probably only as big as a ping pong ball. They ranged in color from white, purple, orange, and blue. They danced around each other but didn’t leave the concentrated huddle they were in. I rubbed my eyes. I waited to see if my eyes were playing tricks on me. They were still there. Normally I am very easily spooked but I was incredibly calm and fascinated. This continued for the next few minutes until I suddenly felt tired again and was comfortable enough to go back to sleep. Has never happened to me again. Still curious as to what these were. Curious to see if this has happened to anyone else or what that means.",
        "created_utc": 1673922597,
        "upvote_ratio": 1.0
    },
    {
        "title": "The show I worked on had paranormal activity on set, and the studio is trying to cover it up",
        "author": "FaeWingThrowaway",
        "url": "https://www.reddit.com/r/Paranormal/comments/10dzy37/the_show_i_worked_on_had_paranormal_activity_on/",
        "text": "Hi, I'm sorry if this a lot but I really just needed to get this off my chest because I need outside perspectives so I can maybe sleep just a bit better at night? I was a crew member on a popular fantasy show that was recently filmed in Ireland during the COVID-19 pandemic. I never believed in ghosts or paranormal activity, but what happened on set has completely changed my mind. It all started with small things - equipment malfunctioning for no apparent reason (we had to reshoot multiple times), strange noises when filming on location at the castle-like estate, and the feeling of being watched when no one else was around. But things quickly escalated as crew members and a few actors began reporting sightings of ghostly figures on location, and some even claimed to have felt physical pushes from what was seemingly nothing.\n\nThe producers tried to brush it off as \"set jitters,\" as \"apparently\" nothing like this had happened during the previous season, but it soon became clear that something was seriously wrong as a lot of us were replacing other people's jobs who didn't return for production, including some of the leading actors who were completely replaced. We were told by higher-ups that the studio had hired a paranormal investigator to come and check things out, but they found nothing out of the ordinary.\n\nThings came to a head when wrapping production on a night shoot in the forest, where multiple members of the production crew and I all witnessed terrifying hooded and ominous apparitions in the forest that vanished right before our eyes as quickly as they appeared. Everyone was terrified and despite all of these events being brought up to our superiors, the studio carelessly continued with production and more and more people were experiencing strange things on set. More people began reporting more frequent sightings of ghostly figures and alarming physical sensations. The studio's decision to continue production despite the obvious danger to the cast and crew only added to the eerie and terrifying atmosphere on set until the last day of production. Nobody got seriously hurt, but the entire experience is still so haunting to think about.\n\nThe true horror of the situation is that everything is being kept under wraps. This popular fantasy show had plans for several future seasons as obvious from the finale, but it has since been cancelled and left on one of the most devastating cinematic cliffhangers I've ever seen, leaving fans absolutely devastated to the point that it was a trending topic. One of the creators involved in the show, who rarely speaks out on social media, had to make a statement to help bury what happened, after one of the producers delivered the news in an abrupt and confusing manner on social media saying there was a bright side to the series being axed. The studio behind the show is determined to bury the truth about what happened during filming, and many of the cast and crew are too terrified to speak out. The events that occurred on set were so terrifying that plenty of others who I've spoken to on my team said they would never go back to those locations. The studio's desire to bury the show and pretend it never happened only adds to the eerie feeling surrounding the situation. It's clear that the safety and well-being of the cast and crew were not a priority for the studio, and it's a tragedy that such a promising show had to end in such a traumatic way.\n\nTo add onto this, allegedly the studio tried to bury the buzz about the show for months, hoping their lack of advertisement would contribute to low viewership so they could to fool the public into believing that nobody was watching it so they could cancel it without anyone suspecting anything. There was a very specific scene in the show that where a character jokingly name drops the streaming service as this scene was supposed to be in an advertisement, but they never used it in the marketing which was a clear indication that they wanted this series to fade away. When they saw the series still had large viewership predictions for the fall premiere because of the existing fanbase, they released a new, controversial show at the same time and spent a lot of money on advertising to make sure it was more popular, so their cancellation looked like it was due to low viewership in comparison to \"new records\". It's really a shame that the studio is more concerned with protecting their reputation than being transparent and honest with the public about what happened.\n\nThis studio still won't give the public a direct explanation from their words as to why the series was cancelled as they don't want to draw more attention to it, and the actors and production team is being tight-lipped about it. I never believed in the paranormal/unexplainable before, but I do now, and I still have nightmares about what I saw that day. It's a shame that such a promising show had to end this way and that hundreds of people (myself included) lost their jobs. I'm too afraid to ever consider returning to Ireland ever again and I'm not sure what to do, I just had to get this off my chest because it's seriously bothering me.",
        "created_utc": 1673921633,
        "upvote_ratio": 1.0
    },
    {
        "title": "Did I walk through a portal in my doorway?",
        "author": "LunaDomha",
        "url": "https://www.reddit.com/r/Paranormal/comments/10dzqwi/did_i_walk_through_a_portal_in_my_doorway/",
        "text": "I was moving from my living room to the kitchen and right at the doorway I heard the sound of a loud muffled party. It felt like if I went to the bathroom at a wedding, I could still hear a ton of people talking but it's super muffled. I only heard that sound for a split second and I registered what I heard when I was in the middle of my kitchen. I turned back around and tried to listen for any sound and I couldn't hear anything. I walked around my house, I went outside to see if my neighbors were having a party. Not a single sound. What did I just witness cause I am convinced that I walked through a portal for a split second.",
        "created_utc": 1673921099,
        "upvote_ratio": 1.0
    },
    {
        "title": "Salt randomly appearing",
        "author": "salusua",
        "url": "https://www.reddit.com/r/Paranormal/comments/10dzb3l/salt_randomly_appearing/",
        "text": "Before you try to rationalize this, you have to know before it happened to me I was a hardcore atheist, no paranormal bs, everything could be explained by science and if not it’s because our tools aren’t sophisticated yet type of person. I would be also rationalizing it and trying to explain it if it hadn’t happened to me. It was such a simple thing that was so factual that there’s no way I imagined it. \n\nI’m also not changing any details because I was so shocked by this that I kept replaying the event in my head over and over telling people every single detail every single time to not forget the way it happened.\n\nAnyways, almost 10 years ago when I was a teenager living with my dad, step mom and step sister I woke up on a Saturday morning. My step mom and step sister were gone every Saturday for my step sisters cheerleading practice. My dad was making a traditional breakfast soup from my country of origin and woke me up to eat it. On the way from my room I passed by the kitchen to grab an individual placemat (made out of plastic). I carried it with my hand vertically and put it on the table, placed my elbows on top of it. I glanced at it for a second to make sure my pajamas wouldn’t get dirty in case it was unwashed or stained from last nights dinner. It was clean.  I put my elbows on top and started scrolling on my phone. After a few minutes, my dad came with the soup walking slowly holding it with both hands as he tends to fill the bowl all the way up. At that moment he placed the soup down, on top of the placemat, I took my elbows out of the way and saw a line of salt next to the bowl. \n\nIt wasn’t scattered but clearly defined like somebody had cut a bag of salt’s corner and made a line with precision. It was a centimeter wide and about ten centimeters long. I looked at my dad and said : and this? He said idk, did you put salt there? I said no, and pointed out the fact that there was no salt shaker on the table. He went to grab a new placemat as I just sat there wide eyed saying but how the fuck did it appear there? I asked him if he had maybe salt stuck to his hand while cooking, he said no his hands and the bowl were clean. Also the line of salt was about five centimeters away from the bowl and there was no scattered salt between the bowl and the line of salt. My dad told me to get over it and eat and I was like but how!!!?? Random salt appearing out of NOWHERE!!!?? \n\nI brought it up several times to him and just said to stop thinking about it. Obviously I haven’t. Ever since then I don’t consider myself an atheist but more of an agnostic. I don’t know the meaning of it or if I will ever find an explanation. I read another post about salt appearing randomly in this forum and decided to post after so many years. It was fucking crazy.",
        "created_utc": 1673919937,
        "upvote_ratio": 1.0
    },
    {
        "title": "I think my ex roommate was being followed by something evil",
        "author": "cocobunnyy",
        "url": "https://www.reddit.com/r/Paranormal/comments/10dyys8/i_think_my_ex_roommate_was_being_followed_by/",
        "text": "[removed]",
        "created_utc": 1673919037,
        "upvote_ratio": 1.0
    },
    {
        "title": "should I be concerned",
        "author": "kkdawg65",
        "url": "https://www.reddit.com/r/Paranormal/comments/10dyvbj/should_i_be_concerned/",
        "text": "Hello! I need some advice, in my apartment we have somthing that's been knocking on the walls and windows (we are second floor, and a normaly non noisy apartment)  for like a good year or so. We never thought much of it untill my roomate and I both experience weird feelings in the apartment with random things like hair ties that went missing showing up placed in the middle of our beds. Sometimes when you look at a certon mirror it falls (it's extreemly sturdy on the wall) we normaly catch it but it's weird. Our cat has also started acting weird i.e hair up walking weird into the living room when the lights there are off, she will eventually run and hide in her tunnel.\n\nI have also woken up in a sleep paralysis type state where I saw somthing with a skull as a head turn towards me to stare at me. I have also had weird phone issues i.e my recomened news pages all being about terrot readings somthing I never search.",
        "created_utc": 1673918783,
        "upvote_ratio": 1.0
    },
    {
        "title": "Some of my paranormal experiences! ❤️",
        "author": "thingsareoksometimes",
        "url": "https://www.reddit.com/r/Paranormal/comments/10dqxvv/some_of_my_paranormal_experiences/",
        "text": "Hey everyone! I'm glad to be here and boy do I love reading paranormal stories! I have a few that I'd like to share here from my old house.\n\nSo our last house was a townhouse, and I believe one family before us lived there. To my knowledge no one died there, but our neighbor in the house across from us passed away there, and we also lived walking distance from a cemetery.\n\nThe way the house was laid out, it was 4 floors. Bottom floor was basement, main floor was living area, kitchen, dining room. 2nd floor was my bedroom, parents bedroom, laundry room. Top floor was attic/loft type space with walk in closet which was my sisters room.\n\nSince my sisters room was the entire top floor, part of it was directly above my bedroom. This is your pretty standard paranormal stuff, but whenever my sister was at work, I'd hear distinct footsteps from upstairs. I don't mean the *house settling* BS, but it was feet dragging across carpet footsteps, as if someone refused to pick their feet up off the floor.\n\nThe next one is when I was about 9 or 10, I always wanted to sleep with my sister in her room despite having my own room. Eventually she got tired of me sleeping with her, so that night my parents made me sleep alone. I was laying in bed crying and upset. In the middle of me crying, directly in my ear, I hear \"shhh\".\n\nNow for this next one, I was sitting in bed on my laptop. My bedroom was perpendicular to the hallway. My door was open, and in my peripheral vision, I saw what appeared to be a figure poke its head into my bedroom, then retreat. I looked up after this and called out for anyone, but no one was there.\n\nThis one may be the scariest one, but this one is at least a bit rational. I was asleep one early morning, and was woken up to the sound of someone whisper screaming in my ear \"WAKE UPPPPPPP!!!\" and I felt as though I was being shaken. This one may be written off as a half sleep/half awake hallucination, but it was still freaky.\n\nSince moving to my current house I haven't really experienced anything. Thanks for reading!",
        "created_utc": 1673901540,
        "upvote_ratio": 1.0
    }
]