[
    {
        "title": "Someone was standing by my bed last night. Paranormal activity is starting again.",
        "author": "PinkRaven1",
        "url": "https://www.reddit.com/r/Paranormal/comments/11jt7za/someone_was_standing_by_my_bed_last_night/",
        "text": "Can someone tell me what’s happening here?\n\nParanormal stuff has been happening the majority of my life, I’ve always been called an old soul, the activity it comes and goes, my house has been quiet for the last few months, I try to ignore it because I’m scared of being tricked by bad spirits when I’m vulnerable. Last night I woke up and looked at my side of the bed, there was a black figure standing there. I thought it was my Husband but as I checked his side of the bed he was sleeping. When I looked back the figure was gone and I went back to sleep, I don’t know why it didn’t register at the time. A few days ago I was sitting on my sofa and a white shadow passed the open door, like it was walking up the hall. It reminded me off a curtain blowing in the wind, that hall had no windows. Recently I’ve been waking up at 3-4am most nights I am coming up to the anniversary of my Granny’s death so I’m not sure if it’s related.",
        "created_utc": 1678092100,
        "upvote_ratio": 1.0
    },
    {
        "title": "cone of light from ceiling and sparkles",
        "author": "hoofie242",
        "url": "https://www.reddit.com/r/Paranormal/comments/11jsrvy/cone_of_light_from_ceiling_and_sparkles/",
        "text": "I was house sitting for my grandmother when I saw a stream of of yellow light and sparkles coming down from the ceiling directed at me face. I got scared and ran out of the room but looked back and nothing was there. I was using my laptop at the time. It is completely almost like little explosions of light. It was frightening.",
        "created_utc": 1678090601,
        "upvote_ratio": 1.0
    },
    {
        "title": "My Paranormal Experience",
        "author": "JoshuaMcLawnLen",
        "url": "https://www.reddit.com/r/Paranormal/comments/11js9jx/my_paranormal_experience/",
        "text": "\tSo first off a little context I am usually the first person to wake up in my house and I have a trundle bed which is elevated above like a bunk bed but there’s nothing at the bottom. So I would be about 8 feet off the ground give or take. When this experience happened to me I was about 12 years old. During this time I would also get scared pretty easily so if that changes your opinion on anything so be it.\n\tAbout four years ago now I woke up before everyone else like I often do and The first thing I do is stretch and look around me. Which is when I saw my orangoutang stuffed animal (about 7 pounds  1x2 square ft) fly at me from the hallway and hit me in my face which is when I started to question whether or not I was still dreaming. I am a pretty lucid dreamer and I used to often spend what felt like days in my dreams without realizing I was dreaming. I made extra sure that I wasn’t dreaming to which I started to freak the fuck out and yell if anyone else was awake or up to see if I was getting played for a fool in a prank. To my surprise before I started to scream they were all still asleep which is when I got up and sat on my couch to contemplate what just happened. To this day I think about that paranormal experience wondering what and or who it was.\n\tI was wondering if any of you could offer me some inside so I could put my mind at ease about it.",
        "created_utc": 1678088907,
        "upvote_ratio": 1.0
    },
    {
        "title": "I think something went wrong after we played Ouija board. Would there be any consequences?",
        "author": "Fi_097",
        "url": "https://www.reddit.com/r/Paranormal/comments/11jrdz3/i_think_something_went_wrong_after_we_played/",
        "text": "[removed]",
        "created_utc": 1678086094,
        "upvote_ratio": 1.0
    },
    {
        "title": "Little (possibly paranormal) story about my grandma's death.",
        "author": "Fortune_Platypus",
        "url": "https://www.reddit.com/r/Paranormal/comments/11joavd/little_possibly_paranormal_story_about_my/",
        "text": "So my mom has had a couple of possibly paranormal things happen to her. I wouldnt say shes a definitive believer but she does not exclude the possibility since she has her fair share of stories. One of which started when her sister died in a car crash.  \n\n\nMy grandparents (both long gone) used to live in a big apartment building near our house. She lived on one of the top floors and had this amazing view of the neighboorhood when stood on the balcony. i could even see my own house. It was quite an empty balcony however. Just 2 chairs with a small table to sit and have a smoke. \n\nBut this changed when my mothers sister died (my grandma's daughter). Ever since that day, every day a little bird would show up and watch through the window, A little (European) Robin to be clear. It seemed way more comfortable around humans than other birds and would only fly away if you went outside and got really close to it. Only to come back onces you went back inside.\n\nMy mom didnt think much of it until my grandma mentioned reincarnation and that it might have been my moms sister coming over to visit. Eventually the whole balcony was decorated with all sorts of bird feeders and even a little bird house.  \n\n\nA couple years later (i don't know the exact time line cause i was still very young) My grandma got a stroke and passed away in the hospital. My mother and her brothers were trying to figure out what kind of card they would send to people who were invited to the funural. They weren't really sure what to put on the front so they eventually just settled with a pink rose.\n\nThey called up this local shop and told them they wanted cards with a rose on the front. My mom still was kinda hesitant about the rose thinking there mustve been something better to put on it.   \n\n\nThen later that evening it hit her: IT SHOULDVE BEEN A ROBIN.\n\nSo she instantly calls the shop telling the owner everything about the robin etc. The owner then told her he was really sorry but there was nothing he could do as the order already went through and was nearly finnished. My mom couldve made a new order but i guess she thought it wasn't worth the money as the cards weren't really *THAT* important.\n\n&amp;#x200B;\n\nNow if that was the end of it i wouldn't be telling this story.\n\nThe next day the owner of the shop calls back my mom and he told her he was very confused. All of the cards my mother ordered somehow came out wrong, Even though all the other orders came out fine. Cards printed before and after hers came out fine.\n\nHe told her they would reprint the cards and that she could have the cards with the robin if she still wanted those, which she ofcourse wanted.  \n\n\nShe has told me she thinks it might have been the owner himself making up a story to do a little good deed, but like to believe it was her mother intervening from beyond the grave.",
        "created_utc": 1678076872,
        "upvote_ratio": 1.0
    },
    {
        "title": "Dog barking in the basement",
        "author": "bullitt2968",
        "url": "https://www.reddit.com/r/Paranormal/comments/11jn20e/dog_barking_in_the_basement/",
        "text": "We just moved to a new home. My little hotdog goes in the basement and barks for like 30 mins every night. I have giving up on looking for mice rats and other things it could be. Is there an easy way to find out if it's something else?",
        "created_utc": 1678073343,
        "upvote_ratio": 1.0
    },
    {
        "title": "Paranormal Signs",
        "author": "TheHauntingOfSeaDame",
        "url": "https://www.reddit.com/r/Paranormal/comments/11jmuy3/paranormal_signs/",
        "text": "Hi all, I’m Nat! I’d like to share a story with you all and get some feedback on it. Have you ever had a dream and had the same situation occur in real life? Weird right? Maybe it’s just deja vu or idk…what really is deja vu and why do we have it? Anyway, story time…\n\nBack in 2009 I moved in with my girlfriend at the time who lived with her mother, brother, and cousin. Her mother was handicapped and such a loving person. Her and the cousin would get high together every night (I guess it helped with the pain?). It was July 4th weekend when her long lost friend visited (some guy). My parents were visiting at the time as well for the holiday weekend. I remember her going into her room with the guy friend for hours (they were doing drugs). The next day she stayed in bed the whole time. We’d check on her every now and then. She wasn’t feeling well enough to go watch the fireworks with us so, we went without her. That same night, my phone rang…her picture showed up as it was supposedly her calling me but the phone froze on the image/call. I thought that was weird but likely just some weird phone glitch. Little did I know…it was a warning/sign. The next morning my parents left to go home. Again, she spent the day in bed. She was communicating with us fine and all when we’d check on her. That night we were all in bed. I remember around 11pm or so, I started to feel really weird. Like I really needed to go check on mom. Our dog started barking like crazy bad I went to check on it. She was barking at the front door…I thought that was really weird to. I then get the urge to check on mom. I opened her room door (it was pitch black in it and freezing). I touched her and said “mom, are you okay?” No response. And she was cold to the touch. I found her passed away… \n\nI won’t go any further into details but I think about the occurrences often. Was I getting a warning that death was coming? What are your thoughts on this? Anyway, thanks for reading my story.",
        "created_utc": 1678072804,
        "upvote_ratio": 1.0
    },
    {
        "title": "Haunted abandoned places around central coast Newcastle can someone please tell me thanks",
        "author": "Jessholz24",
        "url": "https://www.reddit.com/r/Paranormal/comments/11jmgdo/haunted_abandoned_places_around_central_coast/",
        "text": "[removed]",
        "created_utc": 1678071706,
        "upvote_ratio": 1.0
    },
    {
        "title": "Ring disappeared mysteriously and then reappeared six months later",
        "author": "Bornserene",
        "url": "https://www.reddit.com/r/Paranormal/comments/11jm273/ring_disappeared_mysteriously_and_then_reappeared/",
        "text": "[removed]",
        "created_utc": 1678070648,
        "upvote_ratio": 1.0
    },
    {
        "title": "Phantom music playing",
        "author": "Worried-Addendum-747",
        "url": "https://www.reddit.com/r/Paranormal/comments/11jlymd/phantom_music_playing/",
        "text": "Everyone always talks about objects moving or apparition hauntings but has anyone ever heard actual music playing but absolutely no source?\nI used to have the craziest experiences/dreams/sleepwalking when I lived at my parent’s house, especially when I slept downstairs on the living room couch. \nThe house was built in the 1800s also. \nThis happened in 2008. The whole day was a weird one and me and my friend came back to the house after spending the day in Salem to visit the witch museum in October. My car ended up having a flat on the hour and a half drive back so we got back to my parent’s place late and me and my friend simply crashed in the living room. I remember waking up to the sound of classical music playing, on a piano. Clear as day. Extremely audible. We don’t own a piano, and no tv or radio was on. I walked all over that house, upstairs and in every room trying to find the source of that piano music. The music never faded no matter where I went in the house like it was following me. I felt like I was going crazy. I tried waking my friend up to see if she heard it too but she was knocked. I tried going back to sleep hoping If I closed my eyes the music would stip playing. Nope. I couldn’t sleep the whole time because that damned ghost piano kept me up all night.",
        "created_utc": 1678070381,
        "upvote_ratio": 1.0
    },
    {
        "title": "Not sure where to go.",
        "author": "ChefCookTheBooks",
        "url": "https://www.reddit.com/r/Paranormal/comments/11jljp3/not_sure_where_to_go/",
        "text": "I didn’t know where to go. So my wife and I have been having some crazy things happen. That being said I believe in the paranormal and so does she. But recently things have been moving literally infront of us sliding or falling over like things on the shelf or the ground. Then the most recent thing is that at night when we’re laying in bed. To preface this I’m a one leg in one leg out sleeper I’ve been feeling grabbing and pressure on both feet just let it go didn’t think to much about then my wife had told me the same thing happened to her. What are we dealing with?",
        "created_utc": 1678069254,
        "upvote_ratio": 1.0
    },
    {
        "title": "Signs from the afterlife?",
        "author": "shadow_okami",
        "url": "https://www.reddit.com/r/Paranormal/comments/11jl41h/signs_from_the_afterlife/",
        "text": "I had a couple of experiences happen that I can’t quite explain, and the timing of them seemed even more of a coincidence. \n\nA few years ago, my Dad passed away pretty unexpectedly from a heart attack. The next few days were obviously pretty chaotic, but I remember a few days or so later, I had just woken up in the morning and I was laying in bed. At the time I was living in my first house I had ever purchased and I lived there with my girlfriend. The house I lived in was an older 1.5 story house, with our bedroom being the only room upstairs. On one side of the room was our bed, the other was a set of stairs down to the dining room, which was attached to the living room. While I was laying in bed I rolled over and picked up my phone and was scrolling as I tried to wake up for the day. Then I heard a loud click from a light switch and the light turned on by the stairs. The light by the stairs is controlled by a three way switch, a newer quieter switch at the bottom of the stairs and an older louder switch at the top of the stairs. I put my phone down and stared at the stairs to the room expecting my girlfriend to come up stairs. After almost a minute I could still hear the TV playing downstairs and there wasn’t any movement that I could hear (it’s an old house so you can hear everything). I got out of bed and went downstairs and saw my girlfriend sitting on the couch still watching TV with our dogs laying at her feet and a cat sitting comfortably in her lap. My girlfriend looked at me and must have seen that I had a confused look on my face because she asked what was up. Looking back at it, there was no way that she could have got up and turned the light on and sat back down that quickly without the animals being disturbed, I didn’t hear her walking around either. I wish I could blame it on old wiring, but that light never did anything like that for the rest of the time I lived there.\n\nThe second incident was a couple years later. My mom got really sick with pneumonia and was hospitalized and basically put into a medical coma. She had several other long term health issues with her lungs so it wasn’t looking great. A couple days go by and I’m at work driving my assigned company vehicle (a 2018 SUV, which was pretty new at the time) my mom isn’t showing any signs of improvement and I’m thinking pretty hard on it while I’m driving down some random rural road. I remember getting this weird feeling as I was driving by some big outdoor party or wedding reception. There was one person just standing outside by himself staring at my car as I drove by. As I got passed the place, my car radio randomly shut off, like all the way to a black screen, but it was the only electronic that seemed to have an issue. A few seconds later I saw the ford symbol pop up and it booted back up and continued playing music from my phone as if nothing happened. For the rest of the night I remember having this sadness and feeling of hopelessness. Late the next night, my mom passed away. That same company car was still mine for another couple years and the radio never malfunctioned like that any other time.\n\nHas anyone else ever experienced anything similar?",
        "created_utc": 1678068121,
        "upvote_ratio": 1.0
    },
    {
        "title": "I was levitating.",
        "author": "randykindaguy",
        "url": "https://www.reddit.com/r/Paranormal/comments/11jkhzq/i_was_levitating/",
        "text": "When I was 8 or 9 years old, I woke up in the night to pee. The bathroom was on the ground floor so I walked to the stairs. The stairs are completely enclosed by walls and a door at the bottom. I approached the stairs and took one step (my hands were touching the walls) and I floated all the way down those long stairs. I remember wondering why my feet were not touching the stairs. I made a gentle landing and peed. The return trip was normal.",
        "created_utc": 1678066512,
        "upvote_ratio": 1.0
    },
    {
        "title": "Sleep paralysis",
        "author": "Ok-Sport7568",
        "url": "https://www.reddit.com/r/Paranormal/comments/11jk2hc/sleep_paralysis/",
        "text": "I’m going to make this long story very very short. My younger brother use to see spirits when he was about 9-13 I don’t really remember the age. He saw the same ones specifically in the house with specific features of the face missing. We found out reasons why. Fast forward we did a cleansing and he stopped seeing them. We’ve had instances of very weird things happening rarely around the house (just to my dad). But nothing seen or big. Dast forward to today we are still living in the same house and I have a 1 year old baby now. ( I’m his 23 year old big sister, he’s 20 now) he just had sleep paralysis and seen the same girl he first saw when he was a kid. She walked up to him and touched his hand that was hanging off the bed. He wasn’t scared and nobody is scared of them. They are harmless and I feel\nLike are just lost souls who had their life taken in a way. What are your thoughts on this? Why are they back? Well she? “She” I’m sure had a father who my brother use to see as well.",
        "created_utc": 1678065378,
        "upvote_ratio": 1.0
    },
    {
        "title": "Weird question - did anyone else have a strange ‘spiritual’ experience when you were pregnant?",
        "author": "cloversentiment",
        "url": "https://www.reddit.com/r/Paranormal/comments/11jjv0d/weird_question_did_anyone_else_have_a_strange/",
        "text": "\nSometime in my 2nd trimester I had a strange experience. I had woken up early in the morning and closed my eyes to go back to sleep a little more. I found myself completely relaxed in an in between sleep and awake state. \n\nI started to have this dream where I was sitting on the swing we have in our backyard. I was just kind of sadly kicking my self back and forth on the swing with my head down (I’ve been struggling with depression and had a difficult pregnancy).\n\nSuddenly I felt this invisible force like a gust of wind come up from behind me. it took me up in the swing until I was swinging high and felt happy and energized for the first time in so so long. Like the invisibly wind being was pushing me and letting me have fun and feel like I was flying. Usually I get motion sick really easily but this was so enjoyable and fun - something I hadn’t felt in a long time.\n\nThen this high energy vibration took over my whole body (at this point I was fully awake again) and it felt like I was buzzing with this vibration and it was very pleasant. Like my consciousness was more awake and alive than usual, hard to describe.\n\nAfter several seconds of this I popped back to normal. \n\nWas this a weird pregnancy thing, or the spirit of my child entering my body, or am I just crazy?",
        "created_utc": 1678064829,
        "upvote_ratio": 1.0
    },
    {
        "title": "Flashing white lights before friend/family passes?",
        "author": "WhiteLightsQuestion",
        "url": "https://www.reddit.com/r/Paranormal/comments/11jjkwx/flashing_white_lights_before_friendfamily_passes/",
        "text": "This has bugged me my entire life and I’m curious if there is a name for it or if others experience this phenomenon. \n\nIn the days before someone I know dies, I’ll see extremely bright white flashing lights in my sleep. It only happens for a few seconds, but they’re usually so jarring that I’ll wake up from them. It doesn’t matter how close or distant I am to the person and I have no way of knowing who it will be. I just know that within a day or two I’ll find out someone I know has passed. It’s happened since I was a kid with my uncle, my mom’s friend, my classmate’s dad, and most recently my cousin who I haven’t spoken to in years. Overall it’s probably happened 15-20 times in my life. Not all of the deaths are from prolonged illness or old age so there’s no way to connect seeing the lights to knowing a specific person is dying, which I think is what bugs me most about it.",
        "created_utc": 1678064109,
        "upvote_ratio": 1.0
    },
    {
        "title": "Mind control is here",
        "author": "Curtainlove",
        "url": "https://www.reddit.com/r/Paranormal/comments/11jjh7p/mind_control_is_here/",
        "text": "[removed]",
        "created_utc": 1678063833,
        "upvote_ratio": 1.0
    },
    {
        "title": "Some thoughts about aliens and reptilians, and where they actually come from.",
        "author": "Yaffffujer",
        "url": "https://www.reddit.com/r/Paranormal/comments/11jia5k/some_thoughts_about_aliens_and_reptilians_and/",
        "text": "The Sanskrit term 'Asura' can be translatet as \"dark being\", based on the word for light \"sur\", and the A- at the beginnig to reverse the meaning. They are seen as powerful beings who are in opposition to the gods (Deva) and also the humans.\nWhile not all kinds of Asuras are actually evil, they have a strong tendency to pride and violence, and the lowest of their kind (Rakshasa) are know to eat humans.\n\n\"Rakshasa means 'to belong/relate to the Raksha (demonic)'.\"\n\"The term Raksha occurs frequently in Vedic literature where it is used to refer to the evil forces trying to destroy humanity.\"\n\"Rakshasas were most often depicted as shape-shifting, fierce-looking, monstrous-looking creatures, with fangs protruding from the top of the mouth and having sharp, claw-like fingernails. They were shown as being mean, growling beasts, and as insatiable man-eaters that could smell the scent of human flesh. Some of the more ferocious ones were shown with flaming red eyes and hair, drinking blood with their cupped hands or from human skulls. Generally they could fly, vanish, and had 'maya' (magical powers of illusion), which enabled them to assume the form of any creature.\"\n\nThe ancient text about the different beings of this world locate the Asura-realm deep under ground. Not in a sense of hell or place of torture for damned souls (that also exists and is called \"Naraka\"), but as a subterran kingdom of the Asura. There, the Asura tribes are often at war with each other, and don't interfere so much with the human world. But it's possible for humans to connect to Asuras, through occultist methods, and receive supernatural powers in exchange for whorship and offerings (including blood sacrifices). It's further said that Rakshasas are coming up to the surface to prey humans, possibly hidden with human or animal form.\n\nThis texts describe many phemonena from the modern paranormal science, such as demons, vampires, werewolves and also reptilians. I tend to believe that there are no beings from other planets here on earth. They are all natives of this planet, just live hidden underground since ancient times. Maybe they had technology long before humans had, and maybe they had always certain influence on human politics and religion. Could be that they even use machines like UFOs, but they are not aliens/extraterrestrials. I think to search for them in the sky is the wrong direction.\n\nIt is really difficult for English speakers to do research on the Asuras. We can hardly see silhouettes of information. Hinduism and Buddhism have their own versions of them, what they do, what their objectives are, what they represent symbolically in the human psyche. Gods drunk with all kinds of excesses, gods of war and violence. Stories of forbidden loves, battles of poetry. The list goes on.",
        "created_utc": 1678060799,
        "upvote_ratio": 1.0
    },
    {
        "title": "I feel like something was in my car",
        "author": "ScatterArrow1971",
        "url": "https://www.reddit.com/r/Paranormal/comments/11jh1c4/i_feel_like_something_was_in_my_car/",
        "text": "Alt handle because I feel like I can't trust my senses, and don't want folks I know laughing at me.\n\nI went to my car today and was actually about to go to church. When I opened the door, I saw something thin, black/shadowy, and FAST dart from my front seat into the back of my car through the gap between the driver's seat and the doorframe.\n\nI saw no legs, head or tail. There was a sound as it moved, like it had pushed off the seat, and another slight sound like it had 'landed'.\n\nI have a degree in zoology and know most of the critters around here. This thing was so fast, if it weren't for the sound, I would have brushed it off even more. It was not a snake, salamander, etc.\n\nI opened all my doors and my hatch and looked all around the car. I saw and heard nothing out of the ordinary.\n\nThere's been a lot of trauma in our house the last few years, from spouse's cancer to child's serious mental health struggles, financial stress that comes with medical bills, etc. I have sometimes gotten slightly 'off' feelings in the house, but chalked it up to me. I am a person of faith and I do believe there's more to the universe than matter and energy, but I don't know how it all works.\n\nI just don't know if it was nothing, or if I should do something.",
        "created_utc": 1678057757,
        "upvote_ratio": 1.0
    },
    {
        "title": "Where does this photo come from and who is this man?",
        "author": "VoVokle23",
        "url": "https://www.reddit.com/r/Paranormal/comments/11jgph9/where_does_this_photo_come_from_and_who_is_this/",
        "text": "[removed]",
        "created_utc": 1678056996,
        "upvote_ratio": 1.0
    },
    {
        "title": "Abnormal Time Vortexes",
        "author": "SignorAlberto2022",
        "url": "https://www.reddit.com/r/Paranormal/comments/11jfz2d/abnormal_time_vortexes/",
        "text": "[removed]",
        "created_utc": 1678055256,
        "upvote_ratio": 1.0
    },
    {
        "title": "My blanket levitated once and I really would like some help/suggestions",
        "author": "Effective_Power_6930",
        "url": "https://www.reddit.com/r/Paranormal/comments/11jedzz/my_blanket_levitated_once_and_i_really_would_like/",
        "text": "It was pretty late and I was getting something from my closet and when I turned around my blanket was literally levitating. It was like in mid air levitating at one spot. I got scared when I saw it so I immediately pushed it down. I tried to rationalize it by saying it could've been because the A.C. was on but it just didn't seem humanely possible. I was very much conscious when it was happening and was not dreaming or anything\n\nDoes anyone have any ideas/suggestion as to what that could have been? I would very much appreciate it. I've never had anything paranormal happen to me until that occurred.  I'm not tooo scared about it but I am pretty bewildered",
        "created_utc": 1678051637,
        "upvote_ratio": 1.0
    },
    {
        "title": "What are some unexplained, paranormal experiences that have happened to you or someone you know?",
        "author": "HappinessIAm",
        "url": "https://www.reddit.com/r/Paranormal/comments/11jcvvs/what_are_some_unexplained_paranormal_experiences/",
        "text": "[removed]",
        "created_utc": 1678048710,
        "upvote_ratio": 1.0
    },
    {
        "title": "Tell me your true scary stories",
        "author": "Mysterious-Mess-3287",
        "url": "https://www.reddit.com/r/Paranormal/comments/11jc8eo/tell_me_your_true_scary_stories/",
        "text": "[removed]",
        "created_utc": 1678047875,
        "upvote_ratio": 1.0
    },
    {
        "title": "i keep seeing the same “person” invading my thoughts as i’m trying to sleep.",
        "author": "wovenbasket69",
        "url": "https://www.reddit.com/r/Paranormal/comments/11jbq7e/i_keep_seeing_the_same_person_invading_my/",
        "text": "i daydream about stuff whilst trying to sleep. (i think we all do?) i keep seeing this man (don’t know him irl) trying to make his way towards me. in the last one i remember shoving his face away from me, he got so close. no matter what weird situation is playing out in my mind, he pops up and tries coming at me. its a recent development in the last couple years. any insights?",
        "created_utc": 1678047323,
        "upvote_ratio": 1.0
    },
    {
        "title": "How can I encounter a ghost?",
        "author": "ConfidenceClassic660",
        "url": "https://www.reddit.com/r/Paranormal/comments/11jahps/how_can_i_encounter_a_ghost/",
        "text": "I, 17 years of age, a male junior in high school have never witnessed something paranormal. And this is on my bucket list. The more I see videos of paranormal stuff the more I wanna experience it. Anyone know how I can do it? I’ve been told ouji board… however, my family is very very religious. Me personally, i was raised Catholic and never really liked church but i was forced to go at a young age. Now, i don’t mind it. I’m not that big in religion tho. But still, using a ouji board is probably outside of my religion isn’t it? Plus, I’ve heard if you don’t use it correctly, it will leave a portal open or something. \nIs there any other way to experience something that doesn’t possibly put my life in danger?",
        "created_utc": 1678045958,
        "upvote_ratio": 1.0
    },
    {
        "title": "It wasn’t my sister.",
        "author": "kayleeamerie",
        "url": "https://www.reddit.com/r/Paranormal/comments/11j8wn2/it_wasnt_my_sister/",
        "text": "I’ve had three encounters, im not sure what im seeing. \n\nThe first encounter was small, so small i thought i had imagined it. I left my room and walked past the bathroom door. i could have sworn i saw a tall figure standing there, in the dark. i assumed maybe it was a family member, so i spoke to the figure. As soon as i did i heard the creak of the front door and the voices of my parents and siblings filled the house. I was confused, who was that then? i turned back to the figure to find it gone, i decided maybe i just slept worse than i had thought and i was still tired, and i never spoke to anyone about it. That was months ago.\n\n\nThe second encounter was last week. I was sat on the floor of my kitchen with my dog chase. it was late at night, maybe around midnight. chase suddenly got irritated and was staring at the doorway. confused, i turned around and met a pair of eyes in the doorway. it looked exactly like my sister. shes only nine so i assumed she needed a snack or some water, so i asked her “what do you need molls?” and she whispered “nothing” and kind of hovered away. i got to my feet and followed her, i was maybe three steps behind, not far at all, i rounded the corner she had just gone past and i was met with nothing. it was a long hallway and she couldnt have gotten away that fast, especially not that quietly. i felt like i was going crazy, i texted my mom and asked if molly had entered her room and she said that she had about 10 minutes ago. i was confused and asked if she was sure she hadn’t just entered and she told me that she had been in there for a good amount of time, and when she left she had only gone to get her water from the hallway, which is only steps away from the door. she wouldnt have even come near me. it couldnt have been my sister. \n\nthe third encounter was just last night, at midnight again. i got out of bed realizing i had forgotten to feed my animals. i had just given them their food in the kitchen, i made sure they were all there before i went up the stairs. i walked to the fourth floor to get a book from the library, as soon as i reached the top of the stairs the door right across from the stairs opened slowly. i just ran, all the way down the stairs and into my room. i locked the door and tried to make sense of it all. i blamed the draft last night, but a draft cant turn a doorknob.\n\nsomeone please tell me what is happening im terrified. its not the first house this has happened at, at my old residence i had friends who refused to come over a second time, said they saw things. i never understood. i do now, and i dont want to be here either.",
        "created_utc": 1678044240,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do I summon a succubus",
        "author": "LemonStealingWh0res",
        "url": "https://www.reddit.com/r/Paranormal/comments/11j6mow/how_do_i_summon_a_succubus/",
        "text": "[removed]",
        "created_utc": 1678040739,
        "upvote_ratio": 1.0
    },
    {
        "title": "Something was in my kitchen last night",
        "author": "No_Creme8502",
        "url": "https://www.reddit.com/r/Paranormal/comments/11j6krm/something_was_in_my_kitchen_last_night/",
        "text": "I (24f) and my husband (26m) had dinner last night and I cooked in my pressure cooker I severed him his food and left the lid off the pot so it can cool off around 10 pm . 30 mins later when I was cleaning up the kitchen I placed the lid back on the pot and left the pot on the kitchen counter . Later that night around 2 in the morning while my baby was sleeping and my husband and I were in bed talking we heard a loud noise like if something fell . I sent him and my dog to go look my dog started soft barking like she was sensing something . Since they took a while i went over to check it out and the lid of the pot was across the kitchen floor . I was so confused on how it got their due to the fact their was no pressure built up in the pot and if their was the valve was open to release anything . Today I called my mother and told her the story she said similar things happen to her and her house ( my mother is very sensitive to the supernatural/paranormal ) but it never bothered her as she tends to ignore it . She asked me if I seen anything in my house anything paranormal. I just told her I seen shadows around my house and that’s all but never sensed anything bad she tired to calm me down (even tho I was fine ) by saying those are shadow people and sometimes they do stuff like this. What are your thoughts on this have any of you experienced something similar",
        "created_utc": 1678040666,
        "upvote_ratio": 1.0
    },
    {
        "title": "Flashing light in my room",
        "author": "Puglife2027",
        "url": "https://www.reddit.com/r/Paranormal/comments/11j5yxw/flashing_light_in_my_room/",
        "text": "Okay so I was up at around 1:30 am last night and I was staring at my ceiling trying to go to sleep. All of a sudden I see a flash of light appear on my ceiling then disappear. It appeared right over my desk where my phone was. However my phone was off and it wasn't charging so it couldn't have turned on, but just to make sure I decided to put it face down on my desk. About a minute later the light appeared and disappeared again. It goes away so quickly that I can't check to see if there is anything that could possibly make that happen. I looked everywhere in my room this morning to see if there was anything that would cause this but I haven't found anything. \n\nThis has happened before at different places like the living room, in hotels that my family stays in, and at my friends house. All around the same time, and all when everyone else is asleep. I've heard it could be my eyes but I feel like this is something paranormal. I would like to get everyone's opinion on it.",
        "created_utc": 1678039912,
        "upvote_ratio": 1.0
    },
    {
        "title": "Inside a 170-year-old house.",
        "author": "LardMallard",
        "url": "https://www.reddit.com/r/Paranormal/comments/11j4q1v/inside_a_170yearold_house/",
        "text": "[removed]",
        "created_utc": 1678038466,
        "upvote_ratio": 1.0
    },
    {
        "title": "Weird Night - Fruit Flies",
        "author": "Dreammy_11",
        "url": "https://www.reddit.com/r/Paranormal/comments/11j2uyo/weird_night_fruit_flies/",
        "text": "Okay... so this happened to my husband and I a few years ago... and to this day we are still weirded out!! We are laying in bed one night, about to fall asleep.. and I feel like something tickling my face. I turn the light on and our whole bed spread has these little fruit flies on it. I think they were fruit flies, or some type of little gnat. I would say like 100+. They literally just like appeared???? We don't eat in our room or anything like that, and our house is very clean! We decided to go downstairs to sleep. We go into the kitchen, just checking for any spoiled food or anything like that. There was nothing but there was a hugeeee swarm of them in the corner of the ceiling. Just in one group????? In the morning, they were completely gone, not one.   \nIs there any explanation for anything like this?",
        "created_utc": 1678036378,
        "upvote_ratio": 1.0
    },
    {
        "title": "Siren Mimic At 3 AM",
        "author": "vulpes_mortuis",
        "url": "https://www.reddit.com/r/Paranormal/comments/11j0y9n/siren_mimic_at_3_am/",
        "text": "This happened a couple weeks ago. My mom witnessed it and so did my dog, otherwise I would chalk it up to a hallucination or my mind playing tricks on me. \n\nI live with my mom and we both stay up really late at night. We were up past 3 AM (this was probably around 3:20) when we heard police sirens outside down the street. Now this is a fairly normal occurrence, even sometimes at that hour, so there was nothing weird about that. But then, in between, it was suddenly cut with this horrifying, ungodly noise that I don’t even know how to explain. If I had to describe it, I would say it was like something outside was mimicking the sirens in a way that was very *wrong* somehow. I know it wasn’t a dog howling- it was nothing like that. My dog heard it and immediately started growling. This thing had no semblance to anything we had ever heard before. It was an uncanny moaning wail that sounded almost human but somewhat animal at the same time, yet not enough of either to make it familiar in any sense. Basically as though a warped, distorted voice was attempting to impersonate the sound of the police sirens, combined with an almost pained sounding cry. \n\nWe heard it repeat about two or three times, then it abruptly stopped and there was just silence. \n\nI’m quite learned with animal calls and the area we live in is somewhat rural, so I’ve heard my fair share of creatures etc out there. I know the disturbing noises that mountain lions, foxes, and bobcats can make. So I mean it when I say that this was straight up the most terrifying, chilling sound that we have ever heard. My mom is generally a very skeptical person, but we’ve had quite a few strange occurrences where we live, not in our house but in the surrounding areas, including seeing multiple black shadow figures around. Lots of flickering lights and bad electricity, which I realize is likely nothing paranormal at all, but it can still create an unnerving atmosphere at times. \n\nThis experience left both of us incredibly spooked because of how unnatural it was. I don’t know what it could have been but all I know is that it wasn’t an animal or a human, and it definitely wasn’t part of the sirens.",
        "created_utc": 1678033082,
        "upvote_ratio": 0.99
    },
    {
        "title": "haunted workplace",
        "author": "vietcrimer",
        "url": "https://www.reddit.com/r/Paranormal/comments/11izp95/haunted_workplace/",
        "text": "i’m about to go into the spiel you have probably heard a million times- i live in a small, historic town where nothing really happens. i work in a herb and tea shop in central PA and the building was built in the civil war era. there is an apartment upstairs but the guy who lives there is rarely ever even there- but that’s beside the point. there have been a handful of times where i have been in the grungy ass old basement to restock and i swear i hear loud, hard footsteps that sound like they are right above me. this has happened a few times. once i was at the front desk and i thought i heard someone come in through the side door because usually there is a loud creek of the door that is in desperate need of WD-40 followed by creeks of the floor. i heard that and went to go back and greet them, but there was no one there. i locked the hinge lock and went back to the desk and brushed it off as the wind. an hour or so later, i heard it again and grabbed the pepper spray we keep under the desk and the door was wide open after i know i locked it. i literally almost shit myself. i saged thé place and tried to forget about it, but i don’t think i ever will.",
        "created_utc": 1678030031,
        "upvote_ratio": 1.0
    },
    {
        "title": "Paranormal anyone?",
        "author": "Mysterious_Can_84",
        "url": "https://www.reddit.com/r/Paranormal/comments/11iz18o/paranormal_anyone/",
        "text": "I want to share something paranormal too. \nSo when i was around 9-12 i don't really remember, i was sleeping with my brother (he was maybe 3? Or younger or older) we were the only ones in the room, there was a window just above the headboard. I don't know what came over me, but i woke up in the middle of the night, i don't know the time/i forgot. I lifted up the curtains very little bit by the edges. Again, i had no idea why i was only picking the edges like i was a peeping tom. \n\nThe room was on the ground floor, and our property consisted of forest behind the house. And my window had a direct view of it. So as i picked up the edges of the curtain i saw a lady, in a white saree, her face half burnt, hair loose, i couldn't see her feet. \n\nAgain, i had no idea what i was doing, it was purely instinct or something else, i calmly started at her, she wasn't looking at me specifically but somewhere around me. Maybe that was the reason why i was only \"peeking\"? Anyways, after that i calmly let down the curtains and fell asleep like i saw nothing, i didn't even register what i was seeing. \n\nI had seen stuff like that many times and never really thought to tell my parents about it. I don't know, it's not like they could do something about it and i (unconsciously) really didn't trust my life with them unless they were driving. I told my mom a few months ago and she went quiet as i described the face of the lady and how i am used to seeing shadows in our house, or when I'm alone or when they are all asleep and i somehow wake up and feel something. \n\nShe told me that she usually sees them not often as me and not in those details. \nI see them, feel them and hear them sometimes (like the wind when they move from one place to another near me). \n\nI'm still an atheist and still don't believe in god, and i don't think I'll ever believe in god unless god straight up shows up in front of me.",
        "created_utc": 1678028246,
        "upvote_ratio": 1.0
    },
    {
        "title": "¿Entidad paranormal o Parálisis del sueño?",
        "author": "alvarez_cesar15_",
        "url": "https://www.reddit.com/r/Paranormal/comments/11iyy8l/entidad_paranormal_o_parálisis_del_sueño/",
        "text": "Bueno... Es la primera vez que uso Reddit, pero queria hacerles una pregunta.\n¿A alguien mas le ha pasado que escuchan pasos en la noche y que de la nada, se dirigen en tu dirección? \nEso fue lo que senti hace unas semanas. Fue algo muy extraño, no podia moverme, tan solo escuchar y fue eso lo que me dio bastante miedo.\nSentia como una presión y escuchaba esos pasos viniendo hacia mi, de repente se detuvieron, pero unos segundos despues comencé a escuhar algo como garras arañando la pared, intentava abrir los ojos y voltear a ver, pero como dije antes, no podía moverme. Me quede escuchando esos arañones por unos minutos y realmente daba miedo, también habían sonidos como de respiración (a parte de la mia) de algo grande, luego de eso volvi a escuchar los pasos, pero esta vez se acerco completamente a mi cama, por alguna extraña razón podía sentir que estaba a solo medio metro de mi. \nMi corazón no paraba de latir tan rápido y por mas que intentaba moverme no podia hacerlo, pero... De la nada, siento como algo me agarra de las piernas y lentamente me estira hacia fuera de la cama.\nMe moria de miedo, queria gritar pero NO PODIA HACER NADA! \nSe escuchaba ese horrible sonido de respiración que parecía la de un animal grande, como la de un Oso o algo así. Este intentaba echarme de mi cama supongo, pero comence a orar en mi mente (porque estaba como paralizado) repetí la oracion del padre nuestro como unas 3 veces y luego me soltó, senti como mis piernas cayeron en mi cama de nuevo y senti los pasos de nuevo, pero esta vez alejándose, volvio al costado del armario donde inicialmente escuche los arañones, comence a pedirle a mi cuerpo que reaccionara y de la nada, pude moverme, pero lo primero que hice fue cubrirme con la frazada y a intentar explicarme lo que habia ocurrido, unos minutos después, levante un poco la frazada para mirar cerca del armario y no vi nada. Luego de eso me levante (asustado, claro) y fui al baño, intentaba buscar alguna explicación pero solo se me ocurrieron dos cosas.\nLa primera es que pudo haber sido algo Paranormal\nO la seguda es que fue simplemente un paralisis del sueño, esa semana trabaje muchi y fue muy estresante para mi.\nPero lo mas loco fue sentir que algo cogió mis piernas y me jalo. Supongo que tendre que quedarme con la incógnita.",
        "created_utc": 1678028012,
        "upvote_ratio": 1.0
    },
    {
        "title": "A career in paranormal investigating?",
        "author": "DrawnToLiberty",
        "url": "https://www.reddit.com/r/Paranormal/comments/11iy0rp/a_career_in_paranormal_investigating/",
        "text": "My sister and I were talking about potential future career paths and she told me that she plans on being a paranormal investigator as a living and she is going to save up money to buy the equipment to do it. She didn't give me any specifics on how she would be making money this way except she alluded to content creation and people paying her to investigate haunted places.  \n\n\nI don't want to squash my sister's dreams but I internally balked at the idea of being a ghost hunter as a career... I will admit, however, that I don't have any interest in the field, and am pretty ignorant of the field.  \n\n\nIs this something I should encourage or should I try to talk her out of it? I'd hate for her to save up money, buy expensive equipment, and not make any money in the end.",
        "created_utc": 1678025363,
        "upvote_ratio": 1.0
    },
    {
        "title": "Best ghost tours in NY",
        "author": "friendlyspecterblog",
        "url": "https://www.reddit.com/r/Paranormal/comments/11ixl9f/best_ghost_tours_in_ny/",
        "text": "I am going to New York and would like to know if you have any tips on the best ghost tours/ haunted sites to visit! I want an authentic experience, not those fake tours just there to rob you of money. So tired of those.",
        "created_utc": 1678024159,
        "upvote_ratio": 1.0
    },
    {
        "title": "A presence in my Childhood and Dreams",
        "author": "mochaburneykihei",
        "url": "https://www.reddit.com/r/Paranormal/comments/11ixkh3/a_presence_in_my_childhood_and_dreams/",
        "text": "I've had this feeling for as long as I can remember. I used to be the terrified kid who had nightmares and would sleep on my mom's floor for safety. I'm posting today because \"it\" visited me again last night in my dreams. My whole life I've felt as though something is trying to entice me or call me to it. As a kid, I felt like it was more physical, standing in the corner of my room, in the little conjoined bathroom, in the closet, down the hall. I had to sleep with all the doors shut and a TV on, I even got a trundle be so there was no chance something was under it. I don't remember the dreams as a kid so much but I'm sure they were there.\nI'm a lucid dreamer and have a clear memory most mornings of my dreams. Which brings me to last night. I had dreamt that I was roaming at night through places in my childhood. Very recognizable places. First, I was on my aunts coldisac wandering to the house across the street from her's. The house glowed blue like a TV screen and a red laser shot across, I imagined it was a trip sensor for an alarm system. The front door was open and I felt a dark black shadow beconing me in. I don't remember walking toward the house but found myself \"waking\" out of it to find the neighbor at that door (I've never met the neighbor but he had a human form and a face I didn't eecpgnize). \nThe dream switched to a party at a house I've never seen. I was wandering with a high-school friend seeming to try to explain to her this demon that follows me at night. \nLast, it switched to my high school . It was night and I'd been at my highschool at night a handfull of time. A small group of students were leaving. I'd said in my dream \"mom says to meet her at the bus stop so I am safe\". I stood at the bus stop and kept feeling the urge to look back at the empty school. The same creature, a black shadow, nearly saying words in my head tried to call me back to the school gate. I was turned away from the bus and though I wasn't meant to get on, my jacket got snagged on the bus door and I got tugged in.\nThey seem to only be childhood places and never include college or my husband or our new homes. \nThanks for reading, let me know what you think and if there are other threads I should share my story with. TY",
        "created_utc": 1678024097,
        "upvote_ratio": 1.0
    },
    {
        "title": "I was driving with my best friend, at midnight...",
        "author": "MissZami",
        "url": "https://www.reddit.com/r/Paranormal/comments/11iwsmr/i_was_driving_with_my_best_friend_at_midnight/",
        "text": "We were about to cross roads, in one moment big black dog was coming from left side. My friend stopped car and just said:\"What is that?\"... Two moments later, dog become women without clothes, looking crazy, start runing. I just said:\"Drive as fast possible!\" That happened ten years ago, yesterday I asked my friend did she saw what I saw that night, she confirmed.",
        "created_utc": 1678021829,
        "upvote_ratio": 1.0
    },
    {
        "title": "Thin wisp of light in cemetery",
        "author": "Mission-Disaster-126",
        "url": "https://www.reddit.com/r/Paranormal/comments/11iwlv4/thin_wisp_of_light_in_cemetery/",
        "text": "So don’t really know how to start this one off. I live in New Zealand and decided to go to the local gas stat at 1am to get some water and snacks. Right next to the station is a huge cemetery, usually it is locked by the main gate at night but I was driving past and saw lights, the locals like to place fairy lights and such on graves, I thought it looked very pretty, I frequent this cemetery many times during the day for fitness and such. \n\nI drove around the top back and found an open one way road going in so went down and all was perfectly normal, I should also mention I am not religious but my grandfather was very superstitious, he is the only member of our family that seemed to have beliefs on the subject. \n\nI was driving around just having a look and had the urge to lock my car and the deeper in I went the more increasingly uncomfortable I felt, to the point I started to leave, as I was creating the hill to the exit I noticed what can only be described as a thin wisp like line of light about the height of a small child on the road appearing right in front of me. I drove though it and felt increasingly uncomfortable like I was being observed.\n\nYeah, was just creepy in general",
        "created_utc": 1678021259,
        "upvote_ratio": 1.0
    },
    {
        "title": "Paranormal video",
        "author": "Quirky_Difference_30",
        "url": "https://www.reddit.com/r/Paranormal/comments/11iwbvx/paranormal_video/",
        "text": "[removed]",
        "created_utc": 1678020399,
        "upvote_ratio": 1.0
    },
    {
        "title": "The House in the Woods",
        "author": "Burnhermit420",
        "url": "https://www.reddit.com/r/Paranormal/comments/11ivu23/the_house_in_the_woods/",
        "text": "I will start by saying this happened in the summer of 2000.  Kinda long story…\n\nMy friends (JF and JD, for short) and I all grew up in our small town in Ohio. We often frequented the woods behind our homes and would play games like hide and seek or capture the flag very often with other neighborhood kids. Needless to say, we all knew the woods like the backs of our hands.\n\nOne day, while bored, JF and I decided to roll a joint and go hiking in the woods. We did this all the time back then, mind you. About 30 minutes into the hike we stumble upon an area with 8 perfectly lined up pine trees with a small white house behind hidden behind the pines. We had never seen these trees or house before in this area so we were thoroughly confused. We could see no trails or driveways leading to the property so we had no clue how this house could’ve been built out in the middle of the woods. The house, from all outward appearances, seemed to be in good condition for the most part and mostly unassuming. We both started getting an uneasy feeling and decided to turn back and leave the area and head back home.\n\nSegue to a couple weeks later. I’m over at my friend JD’s house to play some PS2 and chill. At some point we start talking about the woods and he tells me about a little white house he came across in the woods. He goes into detail about the same rows of pine trees and how he got a creepy feeling when he got close to the house. I then told him about how JF and I stumbled upon the same house a couple of weeks earlier and got the same feeling.\n\nLater that weekend, all three of us decided to go back to the woods to go explore the house. We spent a good 4-6 hours i combing those woods but could not find that house or the rows of pine trees again. They weren’t just missing. There was no trace that the house or trees were ever even there.\nTo this day, all three of us get the heebiest of jeebies when we recall that summer and the mysterious house in the woods.",
        "created_utc": 1678018819,
        "upvote_ratio": 1.0
    },
    {
        "title": "I got Attacked and Possessed",
        "author": "magkozak",
        "url": "https://www.reddit.com/r/Paranormal/comments/11itpcc/i_got_attacked_and_possessed/",
        "text": "I am possessed right now. I have been possessed for a year. I’m a Christian and have been most of my life. I never invited the demon in. It started with attacks. Before the demon would attack, my ears would ring and my nose would hurt. There was even one attack where this demon physically forced me to ground in the kitchen. After one attack, my entire body itched and burned. I had heard it (in my mind) telling me it would make my body burn before this specific attack. After weeks of these absolutely terrifying attacks, I understood what happened when my ears rang and nose hurt. This meant lots of nights when they both were happening and I was terrified to sleep most of the time. After a month or so, I became fully possessed. It has full physical and mental control. It also controls my speech. This evil being has done quite a lot. It controls my thoughts and feelings. I’ve heard the demon’s voice for a year and I mean 24/7 non stop…..literally from the second I get up to when I sleep….everyday for a year. It tortured me with music for weeks to the point of insanity and then took music out of my mind. Then it tortured me with images. It tortured me with images of my previous sexual assault and (separately) someone’s previous attempt at my life. All while the demon told me they would do each of these things and then actually did them. It made me feel level 10 chest pain for a week. It made me feel chest pain constantly through the year. This demon has made me scratch myself, makes me physically feel like passing out whenever, restless legs, took away my eyesight COMPLETELY for 20 seconds, wouldn’t let me pee, makes me have the shits, made me put out multiple cigs on myself, controls energy levels, itching and burning anywhere. Right now, I am being heavily sleep tortured. This is embarrassing but it’s making me go to town on myself (full control of body) against my will all night instead of sleeping. I just talked about the physical things but the ENTIRE time the voice of this demon threatened to do them and did them all over the year I have been possessed. I mean did each of them immediately after threatening.\n\nI have never had super strength or spoke in a different language like in the movies. I’m not saying it can’t happen but this is has not happened during my possession at all. If have any questions, message me.",
        "created_utc": 1678011458,
        "upvote_ratio": 1.0
    },
    {
        "title": "I heard my Dad call my name while in the woods",
        "author": "boocious_crust",
        "url": "https://www.reddit.com/r/Paranormal/comments/11isd3d/i_heard_my_dad_call_my_name_while_in_the_woods/",
        "text": "I was in the middle of a large clearing with patches of juvenile trees. As I was walking through this clearing I heard my Dad call my name clear as day in the treeline to the left maybe 150 feet away. I got weirded out and walked home.",
        "created_utc": 1678006755,
        "upvote_ratio": 1.0
    },
    {
        "title": "I need help ASAP I keep hearing knocks",
        "author": "vulcazv20",
        "url": "https://www.reddit.com/r/Paranormal/comments/11isbsm/i_need_help_asap_i_keep_hearing_knocks/",
        "text": "How do I get rid of a ghost knocking at my door, I don't want sceptics I'm being serious. I've been hearing knocks on my door for a while but no one is there, my friends have heard it too. This morning was the worst however with it going on consistently and loudly that I've woken from my sleep as soon as I opened my eyes it did one loud final knock and stopped. I have shouted at it to go away a good few times ive tried to get it on video, It always goes quieter when I record or starts knocking after I stop recording. What should I do??!! I really need some advice.\n\nAlso I want to add It has been more than just knocks but it’s knocking that has been going on the most. So far I’ve heard a robot voice, a baby cry and a friend heard me and my other friends voices when she used my shower however we hadn’t returned from the shops so it wasn’t us. The hall lights also cut out the day after I heard the robot voice. I was too afraid to check the door when I heard it so it could’ve been someone outside messing but I didn’t want to find out. I did manage to get that one on video tho.",
        "created_utc": 1678006621,
        "upvote_ratio": 1.0
    },
    {
        "title": "I think I've an attachment.",
        "author": "dan_ieh",
        "url": "https://www.reddit.com/r/Paranormal/comments/11ir0v2/i_think_ive_an_attachment/",
        "text": "[removed]",
        "created_utc": 1678002020,
        "upvote_ratio": 1.0
    },
    {
        "title": "GENTE DE reddit",
        "author": "OutlandishnessOk294",
        "url": "https://www.reddit.com/r/Paranormal/comments/11iqxvf/gente_de_reddit/",
        "text": "[removed]",
        "created_utc": 1678001723,
        "upvote_ratio": 1.0
    },
    {
        "title": "attacked by ghosts",
        "author": "SelfAssembledMachine",
        "url": "https://www.reddit.com/r/Paranormal/comments/11ipmdq/attacked_by_ghosts/",
        "text": "[removed]",
        "created_utc": 1677997242,
        "upvote_ratio": 1.0
    },
    {
        "title": "Doors opening and closing on their own, dad is in the hospital",
        "author": "SnooCheesecakes9828",
        "url": "https://www.reddit.com/r/Paranormal/comments/11ipaxh/doors_opening_and_closing_on_their_own_dad_is_in/",
        "text": "Recently my dad was admitted to the hospital and diagnosed with stage 4 cancer. The night before we found out he had cancer, as we were settling into bed, the bedroom door opened and slammed shut, we weren't looking at the door, but heard the sounds. Basically we just brushed it off and started to go back to sleep. Later in the night at about 4am I heard the door handle jiggling and woke up, looking right at the door I watched it open about half way. I sat up in my bed and stared at the door, I didn't feel scared, or confused, it's weird, I just felt peace, I went back to bed. The next day my dad is taken to the hospital for health issues and diagnosed with terminal cancer, he is given 8 weeks to 6 months to live. \n\nDoors started opening and closing throughout the house at all times of the day, everyone in the family eventually sees it happen at random times, sometimes two of us together. \n\nLast night I have a dream, and in the dream I hear the words \"your dad is tired\". In my dream I replied \"I know\".",
        "created_utc": 1677996178,
        "upvote_ratio": 1.0
    },
    {
        "title": "I’m waking up w random scratches on my body",
        "author": "ZealousCryBaby",
        "url": "https://www.reddit.com/r/Paranormal/comments/11ip20b/im_waking_up_w_random_scratches_on_my_body/",
        "text": "This has happened before and I have no memory of this - especially about what causes this. A year ago, I was waking up with random scratches. Scratches on my leg or my hand. I was in touch with someone who was into ‘messing with energy.’ I told him about this but he said, maybe I’m Clumsy and asked me to not read into a lot of this which I agreed with. \n\nIt eventually stopped.\n\nA few days ago, I found 2 scratches on my Tummy and woke up with a random scratch on my face. I don’t know what’s going on. I really don’t and I don’t know if it’s valid to even question this.\n\nAm I going through something and have no memory of it? Should I record myself? Am I acting crazy?",
        "created_utc": 1677995393,
        "upvote_ratio": 1.0
    },
    {
        "title": "My boyfriend saw a woman in a white dress on the side of the road",
        "author": "giant_spermbank",
        "url": "https://www.reddit.com/r/Paranormal/comments/11ioieu/my_boyfriend_saw_a_woman_in_a_white_dress_on_the/",
        "text": "My boyfriend lives roughly two hours from me. He came to visit this weekend, and while driving home at around midnight, while on the phone with me, spotted a woman walking on the side of the road. He described her to have black hair and was wearing a white dress. I heard him go, “what the f**k is that?” and then the sound of his car speeding away. He then informed me that he saw the woman’s limbs grow to unnatural lengths, and she dropped to all fours and started running almost at pace with his car, which was flying at around 120 mph (he was terrified and tried to put as much distance between himself and her). Can someone add some insight into this? Was he just imagining things because he was sleep deprived, or is this a universal experience?",
        "created_utc": 1677993678,
        "upvote_ratio": 1.0
    },
    {
        "title": "paranormal at the pound",
        "author": "BeautifulCarp",
        "url": "https://www.reddit.com/r/Paranormal/comments/11ina3b/paranormal_at_the_pound/",
        "text": "i was recently down at the pound, and I kept hearing these noises. almost like a wailing, but a little deeper. on and on and on. I really tried to open my third ear to the sounds and really ... hear *through* them, but all I could hear were these loud sharp gravelly almost ... shouts. they couldn't have been human. no way. I wanted to shout back but I was too scared. you know what they say: ears are for tears and fears. I was so close to the sounds though. I couldn't just leave them. something was calling me to them. a whining almost. it invoked a sympathy deep in my heart, and I just had to do something. this time I tried to open my fourth ear, but a tall man in a hat appeared out of nowhere from the door and started gabbling at me. he had really sharp elbows and that freaked me out. I blacked out and next thing I know I was in. what was he doing with these poor ghostly souls. what's going on here?",
        "created_utc": 1677989957,
        "upvote_ratio": 1.0
    },
    {
        "title": "Skinny fingers with long nails.",
        "author": "ateurchild",
        "url": "https://www.reddit.com/r/Paranormal/comments/11im3s8/skinny_fingers_with_long_nails/",
        "text": "So, my girlfriend has her third eye open, and she told me something that she has been seeing quite frequently. \n\nSkinny fingers with long nails coming out of door frame, or an opening in an attic door, or reaching over something. \n\nShe said when she was in my hallway, the lights were low, she saw a hand reaching over the door frame and it had skinny fingers and long nails, and she felt something was off. \n\nDoes anyone know that could mean? Or if it has a message behind it? I tried looking it up, but the internet is no help.",
        "created_utc": 1677986559,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why do paranormal experiences mostly happen at 3 am?",
        "author": "Alternative_Eye_2799",
        "url": "https://www.reddit.com/r/Paranormal/comments/11ilsob/why_do_paranormal_experiences_mostly_happen_at_3/",
        "text": "[removed]",
        "created_utc": 1677985690,
        "upvote_ratio": 1.0
    },
    {
        "title": "Weird encounters",
        "author": "Professional-Type316",
        "url": "https://www.reddit.com/r/Paranormal/comments/11ikqq5/weird_encounters/",
        "text": "I have had several strange encounters over the years. \nMy husband used to live in a very old house by a lake, its where rangers that oversaw the park lived. \nI did not know any of the history of the house, other than my husband telling me it had been built in the early 1930's. \nI had a feeling a tall man with red hair that had a red and black checkered coat, with a flappy eared hat was lingering around. I could picture him in my mind as weird as that was. I felt like his nickname was 'Ol'Red.' \nOne night I came into the kitchen from outside and flipped on the lights, I looked over and saw a figure with boots and green pants and was too afraid to look up toward the face. \nI ran outside and as I stood there the door was hit by something and made a very loud sound. There was no one there. \n\nI think it was this man. I had the feeling he was mad his hatchet had been displaced. I asked my husband if he had found an old hatchet, my husband had and gave it to a friend. My husband had gotten rid of a lot of old tools and things he had found. \n\nI told my husband about the man but my husband is skeptical of paranormal. My husband looked into it and the first ranger that lived in the house had red hair and looked as I had described. \nIn this same house my stepson and I had the same dream on the same night, of a tornado hitting the town. \nAnother time I woke up in the night with an old woman kneeling on my side of the bed with her face inches from mine. She kept opening her mouth and looked frantic, but I couldn't understand what she wanted to tell me. I told her to go away and didn't see her again. \nI think that house was haunted by the first man that lived there and peehaps the old lady. \n\nIn a house I lived in 2 years ago, I had very odd things happen. My tv remote would be moved often and I was the only one home so no one could've moved it. \nOne night I was standing at my back porch and I heard my son call out \"mom.\" As I walked toward his bedroom I heard \"mom\" two more times. \nMy son was asleep and he was not talking in his sleep. I wonder if a ghost was able to use his voice. I yelled out loud to stop it and I didn't hear anymore. \nI started recording at different times in the house to see if I could pick anything up, because it just felt off most of the time. \n\nMy son was bouncing a ball off of the wall while I was recording. Later after I listened to the recording, an angry, deep male voice could be heard saying \"who bought him this.\" \nI was afraid I was crazy so I had my mom and sister listen to it, they heard it, too. \nI woke up once with my arm extended straight up and saw my son's arm do the same another night. \nI yelled to stop it and his arm went back down. \nI sold that house a few months after, I started feeling scared living there. \nI've had several other weird encounters, I wonder if I am a magnet for these strange occurences since they've happened in different houses. \nI don't have any mental illnesses.",
        "created_utc": 1677982757,
        "upvote_ratio": 1.0
    },
    {
        "title": "I’ve been hearing laughing children when alone at night",
        "author": "whatsup-dude",
        "url": "https://www.reddit.com/r/Paranormal/comments/11ikqnn/ive_been_hearing_laughing_children_when_alone_at/",
        "text": "Sometimes when I’m alone outside smoking I’ll hear laughing children. I live in a big city so my friends suggestion of a sk*n*alker (I know I’m ridiculous but I’m also paranoid you’re not supposed to say it) seems a stretch but what about hauntings?",
        "created_utc": 1677982752,
        "upvote_ratio": 1.0
    },
    {
        "title": "My kids report discomfort in one bedroom of our home?",
        "author": "SheerShel_",
        "url": "https://www.reddit.com/r/Paranormal/comments/11ikjxi/my_kids_report_discomfort_in_one_bedroom_of_our/",
        "text": "I’ve spent much of my life encountering paranormal activity. However, this is the one home I don’t experience anything. About a year ago my son was staying in one of our rooms (he was 11), he refused to sleep in there. He wouldn’t even hang out in there during the day. He reported nightmares, feeling of being watched, hearing things, and seeing things at night. We changed his room and he’s been fine since. I casually mentioned  to my 14 year old daughter who stays in there now, that my son is afraid of that room. Her response “oh I know exactly why”. She proceeded to tell me about seeing a person in her room, hearing things talk to her, hearing knocking under her bed, feeling of being watched and nightmares. A few months ago we tried to bunk my 4yo in the room with her older sister but it did not work. She wouldn’t sleep, begged for the door to stay open and often woke up with nightmares in the middle of the night. I don’t experience any of this. I’ve checked all the outlets and fixtures for emf dumps, there’s nothing. I’ve ordered some white sage and Palo Santo, but I am at a loss. My dtr came out of her room about 10 mins ago and asked why I was yelling for her. Except I’m sitting in a quite living room scrolling TikTok??? Thoughts? Advice?",
        "created_utc": 1677982245,
        "upvote_ratio": 1.0
    },
    {
        "title": "Figure in window",
        "author": "Ill-Region-2781",
        "url": "https://www.reddit.com/r/Paranormal/comments/11ikcxp/figure_in_window/",
        "text": "[removed]",
        "created_utc": 1677981720,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does anyone else have access to a Fae realm?",
        "author": "PotatoPowerOP",
        "url": "https://www.reddit.com/r/Paranormal/comments/11ijej3/does_anyone_else_have_access_to_a_fae_realm/",
        "text": "When I’m in there it looks just like the real world and has the same stuff but people act differently and I can control what comes up on a random channel on TV just by imagining it beforehand. Also things seem to be just in perfect places down to dog breeds conveying certain messages like a big friendly dog reminding me to be friendly and use my words. An Angel told me the people in my Fae realm aren’t real but I shouldn’t hurt them and there is a real world out there. It’s like a simulation pocket world within reality.",
        "created_utc": 1677979157,
        "upvote_ratio": 1.0
    },
    {
        "title": "Orb activity. Spirits in my house? Just passing through?",
        "author": "VividlyEffervescent",
        "url": "https://www.reddit.com/r/Paranormal/comments/11ii47c/orb_activity_spirits_in_my_house_just_passing/",
        "text": "I feel that my home is inhabited by spirits but I don't believe there is any malevolence. To my knowledge there was an older person that used to live on the land that my home is on now. But in this particular video I see so many orbs and I'm wondering if there are just many spirits passing through my living room? No one close to me has died recently. The only correlation I can think of is the poor souls that lost their lives in the Greek train catastrophe.\n\nLet me know what y'all think.",
        "created_utc": 1677975781,
        "upvote_ratio": 1.0
    },
    {
        "title": "And I making a transaction with the occult?",
        "author": "TheHydrogenator3000",
        "url": "https://www.reddit.com/r/Paranormal/comments/11ii2yn/and_i_making_a_transaction_with_the_occult/",
        "text": "I don’t have issues with money, but it would be nice to have more. It’s always comfier when you have a lot of it and not need to worry about it. I always wish I had more money to not have to worry about bills and stuff and so I can go and vacation, you know stuff like that. Here is where the occult comes in. I had sleep paralysis and had the whole frozen body thing and seeing a dark shadowy being at the edge of my bed and I was scared to the point of crying and I’ve never had sleep paralysis. I was able to get to sleep afterwards but I had a VERY vivid dream of going into my local Safeway grocery store and buying a $10 bingo scratcher (I NEVER GAMBLE AND I HATE IT) but in the dream I got it and walked into my car and scratched it. I got a triple bonus winning $25k then I woke up. The next night, I had the same dream. I woke up today thinking if I should buy that ticket. But if I DO buy that ticket and I WIN did I just make a transaction with something evil? Will they come back for their “payment?” This is just so scary. Because it’s happening over and over and it’s so vivid and exactly the same. Please help and let me know. Thanks",
        "created_utc": 1677975692,
        "upvote_ratio": 1.0
    },
    {
        "title": "A pastor’s demon story",
        "author": "Safe-Foot2023",
        "url": "https://www.reddit.com/r/Paranormal/comments/11ih69e/a_pastors_demon_story/",
        "text": "When i was in college I had a brief religious stint (cliche, I know) and my dorm mate and I were discussing the nature of demons, (I’ve always had an interest in paranormal and had ton of experiences growing up that I will share here on a later date!) and she told me a story from her childhood pastor:\n\nAs the story goes, one night the pastor woke up in the dead of night to see a figure standing in the corner of her dark bedroom. She described the figure as having a body of pitch darkness- almost indistinguishable from the wall. But, the most “horrifying, painful and gut wrenching” face she had ever seen and piercing, white eyes. She told me that her immediate reaction wasn’t even to freeze- because apparently it was so disgusting and disturbing- her first instinct was to scream- loud and clear. This awoke the pastors husband sleeping next to her. At the minute her husband woke up from the scream the “demon” vanished.\n\nFor the next SIX WEEKS, every single night, she said, whenever the pastor would feel comfortable and safe enough to actually sleep, the demon would awaken the pastor and the same would occur. Over and over, wherever she was sleeping. The only thing that would get the demon to disappear wasn’t a “get out” or “leave me alone” -it was if she screamed. Only until the next night, of course. \n\none night she was able to prepare enough and be quick enough that when she was awoken again she proclaimed a classic “in the name of jesus, you will never terrorize me again” or something similar or christian lingo adjacent, you know the vibe.\n\nThat pastor would tell this story in church to affirm the power of jesus, I guess.\n\nMy dorm mate was confused as to why this story did not comfort me in the “power of Jesus” haha, she would tell me that to her it was comforting?? Anyways, I didn’t sleep well for months as I imagined the possibility of being awakened in my twin XL dorm bunk by something staring at me in the corner.",
        "created_utc": 1677973422,
        "upvote_ratio": 1.0
    },
    {
        "title": "I heard someone but I am home alone",
        "author": "SnooDoodles172",
        "url": "https://www.reddit.com/r/Paranormal/comments/11ih1gm/i_heard_someone_but_i_am_home_alone/",
        "text": "Hi. What I’m telling you just happened. Like 5 minutes ago. I am not gonna lie I’m terrified and I desperately want to call my brother back home even if he’s at a birthday and that we don’t have a good relationship.\n\nI am not sure of what happened. First of all, I’m suffering of depression so I don’t know if it’s hallucinations or not. I’ve heard things before that I can’t explain.\n\nContext:\n\nIn my house, everyone felt weird vibe. But me the most. The thing is, my depression makes me paranoid and especially when I am home alone, like right now. \nAbout 10 minutes ago I heard outside “muffled thuds” outside (I am not sure of those words English isn’t my native language sorry if that make not sense) that scared me (that’s why I’m not sure if I really heard what I heard, fear could have made me heard that thing). \n\n5 minutes ago I heard a woman says “bonjour!” Outside my window. With a thin voice. \nLike who does that ??? Who says casually “hi!” at 00:30 am outside someone else’s house?\n\nAm I insane ? What should I do I can’t go see what it was, I can’t call my parents there are in holidays, what do I do ? \nDo you think I ever even actually heard that ??? Can it be burglars to you ?",
        "created_utc": 1677973089,
        "upvote_ratio": 1.0
    },
    {
        "title": "My sisters “gray lady”",
        "author": "picklesanddogs123",
        "url": "https://www.reddit.com/r/Paranormal/comments/11ifge8/my_sisters_gray_lady/",
        "text": "When my sister was growing up, there would be a few occasions where she would mention “the gray lady.” She was never scared by this. In fact, she would bring it up so casually.\nThe first time, as far as i know, was when she was anywhere from 3-5. Me, my mom, and my sister were all at my grandmas house. My sister had been outside or had glanced outside and came back to my mom in the kitchen and said “the gray lady is outside.”\nThere was another time where my sister mentioned seeing the gray lady while she was on a trip with her grandparents. \nThe whole gray lady thing stopped for a little bit, once she got into school, but then one day, probably while she was in 3rd or 4th grade, she brought up that she had seen the gray lady once again. She wasn’t scared or confused, she was just letting me and my mom know. \nOur mom has always been very confused and worried about this. She asks my sister about it about once a year and will spend a few minutes searching stuff about it afterwards. \nIm genuinely curious what it could mean. I know my sister has seen the gray lady more times, but i can’t think of the specific times that has happened. \nShe describes the lady as tall with a gray dress on. I don’t know much else about it. \nMy sister is in 6th grade now, going into 7th very soon. She doesn’t ever mention the gray lady unless its asked about.",
        "created_utc": 1677969214,
        "upvote_ratio": 1.0
    },
    {
        "title": "Very intrigued by paranormal things (despite few experiences)",
        "author": "solaral03",
        "url": "https://www.reddit.com/r/Paranormal/comments/11ifg7q/very_intrigued_by_paranormal_things_despite_few/",
        "text": "[removed]",
        "created_utc": 1677969201,
        "upvote_ratio": 1.0
    },
    {
        "title": "Moved into a 120 year building that use to be a candy/corner store.",
        "author": "Peaches1089",
        "url": "https://www.reddit.com/r/Paranormal/comments/11idtid/moved_into_a_120_year_building_that_use_to_be_a/",
        "text": "I moved into a two family 2 years ago. This building use to be a candy/corner store. Going into the basement gives me the creeps. You can only get down there from the outside of the building. Going down there gives me chills and bad vibes. Sometimes i feel a heavy weight on my chest. When we first moved in here, my cats would try to get into my spare bedroom every night around the same time (12 pm est). I normally keep that rooms door closed because that room gives me the creeps. I converted that room into a home hair salon. Sometimes when im in there, The door randomly closes too, even after being open for an hour or two with no issues. There have been times where im home alone watching tv on the couch, and it almost feels like someone puts their hand on my shoulder, pulls my hair or pokes my shoulder. I normally do not even acknowledge it. Things in my home get moved around and disappear for a while and then reappear. Ive set up cameras in my home to record to see if my boyfriend or i were sleep walking, or forgetting we move things. Nope. I try to speak out loud that nothing is allowed to touch me and i only welcome love and light. Im unsure if that even helps. Since i moved here, my hair has been falling out and i get dizzy often. Ive been going to a lot of docs and they have no answers for me. That could also be the result of living in an old building and everything in the building was here since the building was built. Weve been looking into moving, but i feel like no matter where i live, i always feel like im not truly alone. Our last apartment my cats would play with something (not each other) and gather into my bathroom to stare at the walk in shower at 10 PM every night ( i kept the shower curtain open when not in use). One of the cats would look scared, and all the hair on his body would stick up. Im hoping it is only my great grandmother visiting me. We were VERY close. I keep a picture of her in my spare room. Has anyone else experienced anything like this? Would love to hear!",
        "created_utc": 1677965317,
        "upvote_ratio": 1.0
    },
    {
        "title": "I think I used to get recurring sleep paralysis when I was a child",
        "author": "sromaz3",
        "url": "https://www.reddit.com/r/Paranormal/comments/11idk2z/i_think_i_used_to_get_recurring_sleep_paralysis/",
        "text": "I’ve always had a memory of a recurring dream I used to get when I was young, probably between the ages of 5 and 10.  For the record, I’ve never really ever had nightmares or strange experiences or anything like that.\n\nI remember these dreams vividly.  I’d wake up in my bed, looking out at my bedroom.  My ears would start ringing, and this weird black substance, which I used to identify as swarms of ants back then, would start going up the walls and covering the entire bedroom, then the bed, then me.. and then I’d wake up for real.\n\nI remember feeling really unnerved and unsettled but never really spoke about it to anyone.  I don’t remember how many times I experienced this but it was definitely more than 4-5 times.  Was this sleep paralysis?  Has anyone experienced something similar?",
        "created_utc": 1677964706,
        "upvote_ratio": 1.0
    },
    {
        "title": "What’s y’all’s opinion on ghost hunting “gear”",
        "author": "the_orange_alligator",
        "url": "https://www.reddit.com/r/Paranormal/comments/11id7a5/whats_yalls_opinion_on_ghost_hunting_gear/",
        "text": "Really love the idea of using gear to try to tap into some of the strange occurrences I’ve had happening around my home (I reassure you it’s not a carbon monoxide thing, my house had already been tested for it). I’ve been looking at stuff like spirit boxes, but they seem so pricey. Is there anything cheaper I can use, and it stuff like spirit boxes and other ghost hunting mumbo jumbo actually work it?",
        "created_utc": 1677963869,
        "upvote_ratio": 1.0
    },
    {
        "title": "Unknown scary laughter",
        "author": "catpies77",
        "url": "https://www.reddit.com/r/Paranormal/comments/11iczlv/unknown_scary_laughter/",
        "text": "When I was about 10, me and my family lived in an old apartment. I have experienced several odd encounters but this one was the most unexplainable as far as I remember. One afternoon all my family members weren’t at home except for my mom and she was taking a nap. I was washing my hands in the bathroom and heard a strange laughter coming from inside the sink( I had my hand on the sink and I felt the vibration) it was almost like it was out of a horror movie. I was shivering in fear and immediately ran to my mom. She obviously didn’t believe me because I was just a child but I still remember the sound to this day and get goosebumps from it. I also wanna add that I’m a skeptic and hardly believe in paranormal stuff. Thoughts?",
        "created_utc": 1677963389,
        "upvote_ratio": 1.0
    },
    {
        "title": "why am I scared of being in my own house?",
        "author": "windatcha",
        "url": "https://www.reddit.com/r/Paranormal/comments/11ibq49/why_am_i_scared_of_being_in_my_own_house/",
        "text": "i always get this nauseous feeling whenever im near or entering my house.\nthere’s something about it that keeps giving me a sick feeling.\nwhenever im away from the house its like that ugly feeling is just .. gone.\ndoes anyone know what could be the problem??",
        "created_utc": 1677960418,
        "upvote_ratio": 1.0
    },
    {
        "title": "A month of paranormal experience.",
        "author": "Ok_Orange_4022",
        "url": "https://www.reddit.com/r/Paranormal/comments/11iahv6/a_month_of_paranormal_experience/",
        "text": "\n\nTo start. I have never experienced paranormal activity but have been a huge fan of it and wonder what it would be like if it happened to me. Well it did and here's the story.\n\n\nIt started on January 5th, i started to hear something coming from my wall when i turned my fans off to clean and I thought i was hearing things until i put my ear to it and heard it get louder. On my wall(the wall faced east towards my dads room and the side door, and was next to the front door) i thought the noise could be our landlord working or someone else maybe even tv in my dads room since the living room is consistently empty causing a silence throughout the house whenever the AC was shut off. When it was shut on everything would be louder because the silence is replaced with the \"cooling\" sound of a AC unit. So when the silence was present it was very clear i could hear everything. This noise just appeared and it sounded like mumbles as if someone was speaking in literal twisted tongue. \n\n All i heard were straight mumbles of incomprehensible words.. I couldn't sound out a complete word this voice in my wall mumbled for anything, i could check the other side of my wall the minute i heard this noise... nothing. Not a single voice here in the living room, theres just silence. I even tried knocking on the wall a little or something to act like i wanted to disturb whoever was mumbling on both sides and nothing changed.\n\n\nAfter that day i heard it whenever i slept, ate in my room, did anything with my fans off but even if i dropped everything and went into the living room to go hear this mumbling. Nothing. If i went to my wall of course i would hear it but i wanted to know why i could only hear it in my room.. keep in mind im fascinated with this its just all sudden so its abrupt. Fast forwards a few weeks were now on January 27th. That early morning around 12:30 &lt;12:34&gt; i heard it in my ear directly, the mumbles of something, i dont even remember clearly what i heard it woke me up though and i was awoken to my closet lamp being on and my room being completely dark. I have one lamp in my room and another in my closet, with my tv being my \"main\" light of my room. Everything was off but my closet light and i swear someone was standing right there compressed against the door. I could see the shadow so vividly it was like it was me in there. I use my closet as a closed space to just relax and listen to music. Its only like 7 feet of space in there and im the only one to use it. \n\n\nOut of the 22 days of this mumbling, this is the brighter side of my paranormal activity. I got up immediately and as i walked to the closet i didn't just open the door. No, i looked under the door.. and someone with a hollowed pupil and grayish white skin color at the best was looking through the tiny crack i could see into my closet, the space is about an inch or half wide and i know what i saw. I know what i saw. I didnt get scared and jumpy i got hyper and ecstatic. I started to be like \"Okay, what is that and why is it in my closet?\" for about 2 minutes until i saw the shadow was gone. Clear light on the floor now. I know what i see and i saw the very clear difference. I open my door slowly and feel coldness come out. In my mind im just absolutely fascinated i really do wonder what the hell this is. That feeling i had seeing my closet empty and the light just on.. it felt like instead it was standing behind me but i didnt bother turning around scared, i turned my light off and when i turned around to go back into bed (in the dark yes) and in the dark i just felt the cold on my skin, chest, legs, everywhere and knew i was either in-front of someone or in-front of my fan even though i didnt move at all and im still at my closet door. I kept my peace and walked through it and got goosebumps from the feeling of walking through whatever was in front of me in the darkness. I got into bed and just stared into the darkness and specifically my tv. I didn't sleep and because of my fans and AC unit being on that mumbling was the less of my concerns so i just stayed up and realized i got what i asked for. \n\n\n\nWith it being two months since this, the voice is gone and the activity is completely gone. \n\nI didn't do anything. You all and i are the only ones and i don't really want to speak on it to anyone else.\n\nYour opinion?",
        "created_utc": 1677957585,
        "upvote_ratio": 1.0
    },
    {
        "title": "Shadow Person at Work",
        "author": "Id0lsenpai",
        "url": "https://www.reddit.com/r/Paranormal/comments/11i96sh/shadow_person_at_work/",
        "text": "I work at a skilled nursing facility as a deitary aide. I hward stories of paranormal activities and shadow people. When I was mopping in the kitchen at the corner of my eye I saw a black figure zoomed passed me. It wasn't my coworker because she was taking out the trash. This is my first encounter at work. Second overal experience",
        "created_utc": 1677954526,
        "upvote_ratio": 1.0
    },
    {
        "title": "I need help right now",
        "author": "bobmynameisbobim68",
        "url": "https://www.reddit.com/r/Paranormal/comments/11i73ua/i_need_help_right_now/",
        "text": "I been feeling a Prescence behind me and when I look over my shoulder I see nobody and when I was getting ready for bed I just couldn't I feel like something is putting things in my ear and that presence has been  sitting on my right side in bed pls help if you know anything it 4 am and I still cant sleep",
        "created_utc": 1677950383,
        "upvote_ratio": 1.0
    },
    {
        "title": "Help. Long shot, but I'm looking for a creepy story i listened somewhere.",
        "author": "Left-Community2418",
        "url": "https://www.reddit.com/r/Paranormal/comments/11i6fem/help_long_shot_but_im_looking_for_a_creepy_story/",
        "text": "[removed]",
        "created_utc": 1677949558,
        "upvote_ratio": 1.0
    },
    {
        "title": "Mysterious hole appears in my celling, and a black hand with four fingers reaches through.",
        "author": "uniqleyinteresting",
        "url": "https://www.reddit.com/r/Paranormal/comments/11i2i4f/mysterious_hole_appears_in_my_celling_and_a_black/",
        "text": "Hi everybody. My partner and I had a highly weird experience in my home. In my lounge room I have a 3-seater and a 2-seater couch. It is a small room, and the couches are up against the opposite sides of each wall. With the tv on the wall they are facing. We fell asleep one night watching a movie. I was awoken with a start by my partner shouting my name. As I woke up, I felt a weird floating sensation and then felt like I had suddenly fallen onto the couch on my back. As I landed my partner was still freaking out as he was telling me we were both just levitating and I am trying to get my bearings, I look above me and notice a rectangular hole about the size of a bedroom window screen on my celling. However, this was no normal hole. It was see trough. As in I could see the sky and the stars through it. It was as if the celling in that section had disappeared. As I jumped up in shock, I pointed it out to my already freaking out partner who then proceeded to freak out even more. That confirmed to me that we were both seeing the same thing and I was not imagining it. We stood there looking up at it for a couple of minutes both freaking out. I then gathered myself enough that curiosity set in, and I decided to climb onto the couch and try and put my hand through the hole to see if it was really there or a possible shared hallucination (which has never happened before I have just heard of this). I steadied myself enough to reach up and try to reach the middle of the hole. Sure enough to my complete shock my hand went straight through what should have been the celling but was in fact a hole. Even more terrifying as I reached through the hole a black arm and a hand with four long thin fingers reached through from the other side of the hole (above me) and reached for my hand. Before I could process what was happening, I snapped my hand back in fear and jumped off the couch screaming in terror. My partner who was still shitting himself saw this and after another minute of us freaking out he decided to try it himself. To rule out it not being real. He then climbed up onto the couch and reached through the hole only to do the same thing I did screaming as he jumped off the couch in terror that he had seen it aswell!! (The black reaching hand). We grabbed onto each other and looked up at the hole for approximately another ten minutes and watched as over that period of time the hole seemed to close over again until it was a celling again. However, after that event my celling has a weird diagonal mark going through what would have been the center of where the hole appeared and on the celling in the same spot you can make out four finger marks that have gotten darker over time. I have no idea what happened to us that night, the only conclusion we could come to was that we had experienced an attempted alien abduction. We are both believers of aliens and the paranormal but had never experienced anything like this before. Neither of us has mental health issues or anything of that nature. We both saw the same thing, remember the same thing and experienced the same thing. My partner later told me the reason he called out my name to wake me up was because he awoke suddenly to feel himself levitating and looked over and saw me doing the same thing and managed to shout out my name. Has anyone else ever experienced anything like this before or know more about what it could have been?",
        "created_utc": 1677945152,
        "upvote_ratio": 1.0
    },
    {
        "title": "Doppelgänger experiences?",
        "author": "Cattanne",
        "url": "https://www.reddit.com/r/Paranormal/comments/11i227w/doppelgänger_experiences/",
        "text": "Growing up I do remember occasionally I would hear how there’s a girl who looks JUST like me or I would have somebody trying to say hi and get my attention that I didn’t know for me to turn around and hear how sorry they were I look just like so and so, but recently I’ve noticed that these occasions have been slowly becoming more and more frequent. From happening to a once or twice a year growing up to now once or twice every 1-2 months. From people honking at me in traffic to strangers Cstopping me that I’ve never met before at my current job( I just started working here 4 months ago ) \nI heard that doppelgänger experiences could possibly mean there’s a tragedy or death to follow, I’m not sure if it’s only if YOU see the doppelgänger or not. But it’s just a little weird to me that it’s slowly been increasing and now happens a lot. I’m the worlds literally most unlucky person there is too, I’ve been in like 9 car accidents where I’ve totaled 7 of the vehicles completely ( not my fault ) &amp; probably should have died. For reference I’m 26, didnt get my license until I was 19. I know people in their 30s who have only been in maybe one or two accidents. Growing up I had a really hard life, and in my adult life it’s honestly just been one bad thing after the next. Looking at all of this i might be reaching by connecting some things together that shouldn’t be but I’m basically just wondering , am I gonna die???? LOL . Possibly a bad omen/ entity following me around ???? Are the occurrences becoming more frequent as a sign?",
        "created_utc": 1677944140,
        "upvote_ratio": 1.0
    },
    {
        "title": "just finished gargling shiit 😭🖕",
        "author": "Nutunen",
        "url": "https://www.reddit.com/r/Paranormal/comments/11i19pb/just_finished_gargling_shiit/",
        "text": "[removed]",
        "created_utc": 1677942197,
        "upvote_ratio": 1.0
    },
    {
        "title": "my kitty she's possessed",
        "author": "heejinohmygodyas",
        "url": "https://www.reddit.com/r/Paranormal/comments/11i0506/my_kitty_shes_possessed/",
        "text": "She's acting strange, she always used to stay silent and still, but for few days she's acting bizzare idk what to do, it's maybe because I didn't bath her for a month",
        "created_utc": 1677939296,
        "upvote_ratio": 1.0
    },
    {
        "title": "I think i may have left the simulation",
        "author": "black_sparrow_chick",
        "url": "https://www.reddit.com/r/Paranormal/comments/11hzvlq/i_think_i_may_have_left_the_simulation/",
        "text": "\nI am not exactly sure how to type out my experience so please be patient while reading this. I'm going to do my best to explain what happened.\n\nAbout 2 months ago I went to sleep like any other night. As I drifted off to sleep I entered the dark void people sometimes speak of when describing themselves falling asleep and then having that falling feeling and being jolted awake. It's like your consciousness turns off and you're floating in darkness. It's total peace and calmness.\n\nFrom this point on, nobody seems to remember what happens after you leave the dark void. 1st you're in this void and next thing you know you are in the middle of a dream and can't remember or even notice how you got there. It's like a stretch of time is unaccounted for. Well....i think I experienced what happens after you leave the dark void. This is gonna sound nuts.\n\nWhile I was in the void floating in nothingness I slowly started to come to. The best way I can describe the feeling is imagine you are waking up from anesthesia. I was put under twice and it is the closest feeling I can describe how I felt while leaving the void.\n\nI felt like I was waking up but I didn't blink at all. It was as if I was waking up with my eyes already open. It started getting brighter and brighter. I felt like I was lying down but couldn't see my body. The room I was in was extremely white and bright. At the same time it felt like I was in a whole new world and in a familiar place all at once.\n\nAs I looked in front of me I saw a white man that looked to be about 65 years old. He had blue/grey eyes. He had grey hair and was balding on the top a little bit. He seemed to be about 6 feet tall. I can't remember what he was wearing even though I have a strong feeling it was a dark grey suit. I knew this man well and he knew me. In a way it felt like I was him and he was me. \n \nHe looked at me indifferently. He wasn't sad, mad or happy. His expression was almost robotic but also human. He said “you're not supposed to be here”. \n\nIn that moment I felt something I had never felt before. I knew EVERYTHING. Everything made complete sense and I had the answers to literally everything! every mystery, every question, every doubt. I knew the meaning of life and the meaning of death. This was all in less than a second. \n\nThe man leaned toward me and seemed to be putting something back over my eyes. It happened so quickly that I didn't even get a chance to see what it was that he was doing to me. \n\nI jolted awake and was unsettled. I wasn't scared or frightened but more so intrigued and curious. I kept thinking about what just happened. I felt as if I had an experience that wasn't supposed to happen. \n\nThis gives the whole, life is a simulation theory, a whole new meaning in my opinion. In a way I feel like none of this is real and that I'm currently dreaming, if that makes sense. I feel like when I experienced this I was really awake. Now I feel like our walk through life is all just one big “virtual reality” simulation. \n\nThis was removed from another subreddit so I'm going to share this on another subreddit since I am unsure where this belongs. I'm Interested in reading others thoughts on this. Thanks for taking the time to read this.",
        "created_utc": 1677938595,
        "upvote_ratio": 1.0
    },
    {
        "title": "Hi, quick question, am i haunted? If so by a ghost or demon?",
        "author": "RepresentativeLast66",
        "url": "https://www.reddit.com/r/Paranormal/comments/11hzuyy/hi_quick_question_am_i_haunted_if_so_by_a_ghost/",
        "text": "I heard what sounded like a phone ringing, going bdmmm bdmmm, bdmmm bdmmm, then switched to a soft, deep, rrruuuummmm rrruuuuummmmm noise coming from my kitchen drawers, checked all drawers that could be suspects by a single one had a vibrating object like 10-15 minutes before writing this. My house is pretty new, was being built from 2016 to 2022, so it couldn’t be a previous home owner. any thoughts?",
        "created_utc": 1677938551,
        "upvote_ratio": 1.0
    },
    {
        "title": "Has a face ever peeked out at you?",
        "author": "Cosmeticitizen",
        "url": "https://www.reddit.com/r/Paranormal/comments/11hz9kr/has_a_face_ever_peeked_out_at_you/",
        "text": "[removed]",
        "created_utc": 1677936880,
        "upvote_ratio": 1.0
    },
    {
        "title": "Hotel Cecil- Elisa Lam cctv",
        "author": "Jordansierraa",
        "url": "https://www.reddit.com/r/Paranormal/comments/11hwao8/hotel_cecil_elisa_lam_cctv/",
        "text": "I visited Hotel Cecil today and I am very intrigued to learn more information. My question is, from what l've read online her floor didn't have security cameras.\nInsinuating that from what I've read online, other floors possibly had security cameras? Was there any other cctv footage that was released other than what was shown on mainstream media? And also, has anyone else noticed the time stamp is always covered somehow on the mainstream media footage? If anyone has a link to other footage or information regarding Elisa Lam or any other incidents I would be so interested. Thank you in advance!",
        "created_utc": 1677926316,
        "upvote_ratio": 1.0
    },
    {
        "title": "hearing stuff in the morning",
        "author": "Expensive_Ability_33",
        "url": "https://www.reddit.com/r/Paranormal/comments/11hux7g/hearing_stuff_in_the_morning/",
        "text": "not sure if this is paranormal at all i just didn’t know where else to post about it. has anyone else woken up in the morning and heard dishes clinking, people laughing, bacon sizzling, tv on and then walked out to and empty dark silent kitchen? used to happen to me a lot and maybe i’m just crazy lol",
        "created_utc": 1677921387,
        "upvote_ratio": 1.0
    },
    {
        "title": "EMF detector went crazy at the graveyard - normal?",
        "author": "KX_Alax",
        "url": "https://www.reddit.com/r/Paranormal/comments/11htkqj/emf_detector_went_crazy_at_the_graveyard_normal/",
        "text": "[removed]",
        "created_utc": 1677916815,
        "upvote_ratio": 1.0
    },
    {
        "title": "Something strange with my girlfriends phone",
        "author": "PoemZealousideal4123",
        "url": "https://www.reddit.com/r/Paranormal/comments/11hrtoe/something_strange_with_my_girlfriends_phone/",
        "text": "So whenever I wake up, my first instinct is to text/call my girlfriend so that she wakes up and doesn’t go to work late. But this particular morning was different, I had called her around 11:20 to wake her up (we call on WhatsApp due to us living in different countries) and the phone rings about seven to eight times. After the eighth ring what I assume is her answers the phone, but here’s the thing, when I tried to ask her if she was there all I heard was what sounded like rustling of clothing or blankets, then the phone hung up. I called her about four more times to check on her because at this point I was worried that I had upset her or she was annoyed with me and the same things happened two more times. I didn’t comment about it until a couple minutes ago while I was on call with her, currently she is telling me that it WASN’T her, she locks her door in her room every night and the only way you can go inside is if you would use extreme force and barge in, she tells me she has no paranormal experience in that house other than nightmares from time to time. I’m not sure what is happening but we’re both creeped out, any thoughts or ideas would be appreciated….",
        "created_utc": 1677911173,
        "upvote_ratio": 1.0
    },
    {
        "title": "Evil Spirits In The Creek",
        "author": "spiritsnthedark",
        "url": "https://www.reddit.com/r/Paranormal/comments/11hqygh/evil_spirits_in_the_creek/",
        "text": "So, a couple of weeks ago I was headed out to my family cemetery about 5 miles outside of town, I hadn't been out there since a couple of days after Christmas, right after I had learned that my dad had finally lost his battle with lung cancer. I have spent a lot of time at this cemetery in the last few years, I like to go out there and do audio recordings and just for the fact that it's so peaceful out there, well, it USED to be.\n\nI have had some really bad experiences out there in the last couple of years, have gotten some really nasty EVP's and it turned into a very dark place at night, but that's a story for another time. Now when I go out there, I always stop at a little country church about a mile down the road . The reason for this is because the church used to belong to my great grandfather and my great uncle, both of whom preached there, and I go there and ask for their protection and guidance before going to the cemetery, but on this night I changed my pattern for some reason.\n\nInstead of going to the church first, I drove on past the cemetery about a half a mile to some property that my aunt and uncle own, there's a small creek that runs along the road, just before you get to the creek, is where my life started out at, the old homestead. Now at the bottom of the hill the creek crosses under the road and makes a sharp turn to continue following the road, in that turn is what used to be a pretty deep hole.\n\nMy mom and dad grew up right down the road from there, and all of my family used to swim in that hole and fish. Now it's been a very long time since my parents and my uncle and even me have swam there, as a matter of fact, over the years that hole has filled in and is no more, just a shallow bend in the creek. Back in the day, one of my uncles high school friends drown there, my uncle also drowned there, but they were able to revive him thank God.\n\nSo when I arrived there, I backed my truck into the drive, I was barely off of the roadway and left my headlights on and the motor running, I was only going to be there for a minute. I started to record a video with my Iphone and was describing why I was going to the cemetery, now during all of this, at one point I thought I saw something pop up from the creek and then go back down really quickly, however I tried to ignore it and kept going with my video. After a minute or so, it happened again, I didn't miss a beat and kept on filming, but noted that it appeared to be a figure of human nature, but a grayish white, kind of skinny, but I didn't see a face.\n\nOnce again I kept right on going, trying to ignore what I had \"seen\", and then it happened a third time, this time it looked more gray than white and there was no face, and at that moment, the feeling of something dark, unfriendly and mad that I was there washed over me and every hair on my body stood straight on end. I start saying \"this isn't good\" repeatedly and then I got the feeling that something aggressive and mad as hell was approaching very quickly. I tried to get out of there as quickly as I could, but it wasn't quick enough.\n\nAnyone ever get what some call spirit jumped? It's where a spirit or entity jumps into your body, it's brief most of the time, but not brief enough. Your body goes into survival mode, adrenaline dumps, but not like a normal adrenaline dump, this is 10X worse, it may also feel like your breath is sucked right out of your lungs and it's a struggle to breathe in any air, it's scary as hell when it happens, you also feel like something evil has reached into your body and grabbed your soul, it's a very demanding warning to get the hell away and they mean business. \n\nWhen I pulled out of there, I headed straight up the road to the church, but before I could get there, I heard a very ominous growl over my left shoulder and got hit a second time, this time was much worse than the first time. I became very vocal and demanded that it get away and get  out of my truck, but it stayed until I reached the church, when I pulled in I called upon my great grandfather for help. Then I was hit a third time, it was brief, but the point was gotten across to me. I could then feel everything lighten up as they say, the hairs went down and I became relaxed fairly quickly. I left the church and went back home, where I had my daughter bring out my bible and I didn't go inside until I was certain that whatever it was had left me.\n\nThe next evening I went to the family cemetery, stopping at the church first of course. I used the Necrophonic app, which I use quite a bit from time to time, I didn't even ask about the night before, but I was told that there was evil at the creek, stay away from the water, they called it dark water, I had never in almost 3 years of using that app ever gotten those responses, or any mentions of water or dark water. And no, I was not under the influence of anything, I take no medications, and other than PTSD, I have no mental health issues.\n\nThis particular area is pretty rural, the area had a lot of Native American activity and is within 300 feet of a known burial ground, as well as another cemetery that has long been forgotten, as a kid, the woods around this area always seemed to have a dark side, we always felt watched when we were playing in the woods around there, there is also a piece of property within a 1/4 mile that was rumored as being owned by a witch.",
        "created_utc": 1677908571,
        "upvote_ratio": 1.0
    },
    {
        "title": "Do spirits usually appear as cartoons for anyone else?",
        "author": "PotatoPowerOP",
        "url": "https://www.reddit.com/r/Paranormal/comments/11hq4k4/do_spirits_usually_appear_as_cartoons_for_anyone/",
        "text": "I’ve had them appear once as a human, once as an Angel, twice as ghosts, and a whole whopping six times as cartoons. Do they usually appear as cartoons for other people or is my spirit tribe just speshul?",
        "created_utc": 1677906128,
        "upvote_ratio": 1.0
    },
    {
        "title": "A silence phone call",
        "author": "tan_p4719",
        "url": "https://www.reddit.com/r/Paranormal/comments/11hmqmj/a_silence_phone_call/",
        "text": "When I was 9-10 I used to live In Bangkok Thailand with my parents, that year my grandfather passed away. The day after his funeral my parent went to buy groceries, I was home alone and our house phone line(that we barely use) rang. When I went to pick it up it said that it was my grandmother’s number so pick it up, but there’s was nothing but silence. For about 5 minutes I was just sitting waiting for someone to speak so I hung up and calls back, it was picked up instantly but it was a complete silence again but I noticed that the tv at my grandparents house is playing and my grandma is speaking in the background. After that hung up and went back to doing whatever I was doing at the time.\n\nNote I’m not scared of this incident but I’m curious if this could be my grandfather’s final goodbye of sort? Also I don’t mind if someone tries to rationalize it or debunk it with science im all open to answers.",
        "created_utc": 1677896573,
        "upvote_ratio": 1.0
    },
    {
        "title": "My Trip to Wales",
        "author": "Inspector-_",
        "url": "https://www.reddit.com/r/Paranormal/comments/11hlosa/my_trip_to_wales/",
        "text": "I know what's more scarier than going to Wales. But still this is not what I wanted to post on here. I have way more scarier and more 'realistic' stories about the supernatural normally surrounding the more generic side of it. but I don't know where else to post this and well this seems more of the right place to do so. You don't have to believe me but I need to just say this, it still seems their must of been a reason for it, hopefully ill find an answer here.\n\nMay 17th 2022-6:00AM\n\nMy alarm has just woken me up. my friend Joe is waiting outside for me in his car and we're just about to leave to go to our friend Ieuan in wales. we've been friends for 4 years up until this point we had met on a zoom call with our management team for acting and we were paired up for an improv class and well we got on very well, we became friends very quickly and decided to add each other on discord that same night and began to play sea of thieves. we haven't stopped talking since. so when joe passed his driving test we instantly made plans to go see our 3rd member in wales. the car journey for the first 45 mins was great, we had snacks, drinks and began wondering what was gonna happen while we were down there, joe mentioned the very 'generic' and all be it stupid remark of \"they do shag sheep down there right?\" and laughed and mentioned we'll just have to wait and see. we ended up making the rest of the way go quite smoothly listening to music and trying to guess what each sign in welsh meant. until it hit us we were extremely early it was now 10:00AM and ieuan didn't finish work until 2:00, and we would be at his house in 15 mins we couldn't just wait outside for that long we had done a straight 4 hour journey nearly and we were desperate to get walking so that's what we did. What I'm about to say is the main reason why I'm making this post.\n\n&amp;#x200B;\n\nMay 17th 2022-10:00\n\nit was still very early however most of the shops were open, and also MacDonald's, we got our double sausage egg mcmuffins and we began walking. the town seemed like it was stuck in a 2010 time warp, everything seemed dated and worn out, we began walking into the town Centre, I don't know how else to explain but it looked like the mall from stranger things but without the cool lights, cool aesthetic and no secret Russians sadly. Anyway we walked out the back entrance, as at that time their was really nothing to see until we eventually saw a building that looked like it was being rebuilt but looked like they had given up straight away. their was still power tools all be it covered in rust and workers radios surrounding the scaffolding , but they seemed like they hadn't been touched in ages. I jokingly said \"LETS TAKE IT\" but joe summarized that builders normally leave their stuff on a site that another party ( another building company) would not be turning up to. as soon as we stepped away we saw a door open on the left side of the building. \"let's go\" I said. Joe had never been the guy to explore abandoned buildings unlike me,  even if it was just unattended. I begged for a good 20 minutes and described how cool his Instagram story would look with the pictures we could take inside of the place, and to that he could not decline.\n\n&amp;#x200B;\n\nMay 17th 2022-10:20\n\nThe inside was hanging on by threads, quick fixes to the interiors stability as far as the eye could see, joe began taking photos of the place, but the lighting was so horrific with all the tarps covering windows it made it seem like we were underground. seriously it was that dark. Their were two floors we could visibly see, but not enough, we saw some flood lights near the stairs and whacked them on, and fucking hell did it turn into a whole new area, this place used to be a second part of the mall but just not connected, it was insane, until someone from the corner appeared, they looked homeless and well it was evidently clear by the smell, but not a normal smell, it was horrific don't get me wrong but me and joe had never smelt something like it before. we shouted \"HELLO\" twice over we began using the generic \"we're taking photos, we'll be out in 15 mins\" he didn't say anything and began to look more confused than angry like he did earlier, I started shitting myself at this point, I'm normally a confident guy but fuck me this was terrifying, I asked \"how long has this place been abandoned\" their was a long silence before he answered \" 23 years, how did you end up in here theirs a reason why this place is locked up\" we mentioned that the door was open and that we hadn't broken anything. he was still hiding in the corner. \"why don't you come out and you can show us around then you can keep an eye on what we're doing\" Joe said, and again silence, at this point I had text joe on my phone mentioning what if theirs others and almost if he had been looking over my shoulder he shouted \"ITS JUST ME\" and let out a belly laugh. me and joe looked at him wide eyed. Joe still thinks it was a coincidence and that he said it because he saw us texting and guessed that's what we were talking about, but fuck that it was on queue AS SOON as I sent it to joe's phone he said it, it freaked me out. we began to walk away and as we looked back and he was staring back at us. watching me primarily maybe caused I looked more on edge, we didn't think he was violent and to be honest we knew we could handle him, we both picked up a plank of wood just incase. we had been in there for a span of 10 minutes and already we wanted to leave, but we couldn't I think due to the fact we were both 20 and we just got the shit scared out of us by someone who looked like Sméagol wanting his precious back we didn't leave. I began climbing the stairs, the stairs were creaking, we looked back and the man was gone, we both sighed and believed he had just left and carried on with his day. the second floor was covered in dust expect for the certain areas in rooms, just the corners. we laughed and thought how weird it looked even the surrounding walls were covered in dust, it really made no sense, after the whole ordeal we glanced over it as something small, but we shouldn't of. the next room was filled with old paintings and various different shaped mirrors. it felt uneasy and like something was on my chest and well i began to cry not like sobbing but just a few tears, joe noticed and wondered if i was joking, but i wasn't, i felt scared, and worried and it overwhelmed me as soon as i went into that room, we left into the next room and it had a floodlight in it. i felt safe and told joe that it must've been the dust, but dust   doesn't make you feel like that, it made me feel mortified like i just saw someone i love die. i never told joe this at the time. joe mentioned to go but i didn't know if the guy downstairs had returned to where he was or even worse he was waiting at the way we came in. i mentioned that the next floor had a balcony and we could double check. \n\n&amp;#x200B;\n\nMay 17th 2022-11:55\n\nNow your probably wondering why I'm putting the timestamps well we'll get to the in a second its important and makes this whole situation much weirder. We went upstairs and looked over the balcony, thankfully the coast was clear so we began our descent. This time though everything changed the corners of the rooms had footmarks coming out from them and only coming out of them, mine and joe's footmarks were still visibly clear and we both swore we had not done this as a joke besides we were wearing shoes, whoever made these marks were not and they were very fresh, we began exclaiming that the guy downstairs must've had done it. lets just say our pace this time was much faster than before. We got downstairs in record time. we struggled with the door until we noticed this door was stuck unlike before, now it wasn't stuck with an object or anything we could visibly see, we began booting it and throwing shit at it. our wooden beams didn't do shit to it. we tried for 20 mins until we both reluctantly gave up, it wasn't budging so we had to look somewhere else, when looking we saw two doors leading to the outside, now remember their was two, their was two, and their cemented into the wall, nothing could've made them move and no-one was there to remove them ok. we went through the exit to the right and we were outside, finally, I we went to shut the door and I noticed something, looking down the the 1st level our front door that we went through was now open, and now the man was on the stairs and we could visibly see him now, I wish we took a photo but I will try and describe in best detail what I was looking at. He covered himself in what seemed red paint, he had on a brown leather jacket, and had only pants on, his feet seemed mangled and I was surprised that he was standing, and the worse part was his feet didn't match the ones we saw in the dust upstairs, the feet upstairs were around size 5-6 and well he was missing two fucking toes and the dust prints were perfect. symmetrical and seemed staged, if that makes sense, i said to him before leaving \" fucking hell how did you get that door open, us two couldn't\" he looked upset and almost on the verge of tears and in a gruntled voice he mentioned that he never shut it, well after that we both said goodbye and left. \n\n&amp;#x200B;\n\nMay 17th 2022-2:15\n\nwe had made it back to the car and we were on our way to pick ieuan up from work, we were relived but we were upset that we didn't take any photos but their was no way we were going back in there, we grabbed ieuan, had a bite to eat, had a few beers and headed back to the hotel with ieuan with us, now we had already told him what happened, and where it was and he mentioned how strange it was and how it was probably some crack den, it didn't explain the room, why I cried, and the footprints and the door not opening, but you know it don't matter, it made us all laugh. and then we fell asleep.\n\n&amp;#x200B;\n\nMay 18th 2022-9:00AM\n\nThis time joe woke me up and said he wants to show ieuan where the place was and I fucking hated the idea it was a creepy place and well I wasn't happy that he would even mention going back after he saw what I got like in that room. but it was only showing the place, not going in, and I was fine with that. we met up near an ice cream shop and walked down towards the building whilst re-iterating what we had experienced. Now the builders gear was gone, now this doesn't seem weird to me I just thought I would add it in, the door was slightly open and ieuan mentioned about going in, but I refused, but joe said that ieuan can at least poke his head in, I didn't see any problem with that, poking his head he mentioned the same thing's we did, no light, dark as shit, and it looked like if you were buried alive. nothing just darkness. \"yeah and look down the left that's how me and joe got out\" I said, he was saying where and saying liar theirs nothing down there. so I looked in there too, but lo and behold, their was nothing, fucking nothing only two walls, I'm writing this now I still feel sick thinking that the door I went through, that I literally pushed and walked out of and shut, was now not there. I was feeling ill, did I imagine it ? I must be going insane. joe thought that it must've been a different set of doors but it was definitely that one, then ieuan mentioned something else \"how long where you in there for\"?  \"since 10:00\" I said\n\n\"Well what were you doing\"? ieuan said, \"theirs fucking nothing in here\". I pushed past ieuan and well he was right.. their was nothing.. rubble, left over tools, and well that 2nd floor, their was no way up it, it had been cordoned off, the line of tape covering the balcony said 'KEEP AWAY, Hard helmet required entering this zone' I told joe to take a look and he was as distraught as I was. we both fell down and began telling ieuan that we got up there and saw the rooms, but he believed us, I think the falling on our asses down to the floor proved we weren't bull shitting. their was no man in there. no second floor, and those fucking doors, that I swear I went through were gone.\n\n&amp;#x200B;\n\nAfter that we went home, that was it, we spent the rest of the car journey trying to find ways to explain it but we couldn't. and that made it even scarier, what were doing in there for nearly 2-3 hours ? that's what I'm trying to figure out. who was the man in there ? the footprints in the room? the door locking? and the two doors that were never there apparently. it makes it easier to say this was a carbon monoxide but I checked the place out on forums and its not been running for 23 years, just like the guy said, theirs no running gas mains. nothing. hopefully this gains attention, I want to feel less scared and less worried that I wasn't control of my own thoughts in those 3 hours.",
        "created_utc": 1677893723,
        "upvote_ratio": 1.0
    },
    {
        "title": "Anyone had an \"imaginary friend\" as a kid?",
        "author": "ComprehensivePie888",
        "url": "https://www.reddit.com/r/Paranormal/comments/11hjfow/anyone_had_an_imaginary_friend_as_a_kid/",
        "text": "Mine wasn't a friend. I remember a tall, beer gut, old man who had a receding hairline with gray hair. My mom would say I was always scared of the man upstairs. If I ever saw him, I wouldn't go near him. I remember being upset that no one else could see him but me. A man did die in that house. When I think about him, I get predator vibes. He was always trying to be near me.",
        "created_utc": 1677888019,
        "upvote_ratio": 1.0
    },
    {
        "title": "ghost haunting my dorm room",
        "author": "did-i-ask-",
        "url": "https://www.reddit.com/r/Paranormal/comments/11hj41l/ghost_haunting_my_dorm_room/",
        "text": "I have a suspicion that there’s a ghost in my dorm room. I didn’t start having this suspicion until recently when my debit card went missing months ago and randomly popped up in my dorm room this week. I finally gave up on trying to find my card and canceled it Monday and replaced it. Tuesday, my debit card was laying on top of my fridge which I recently moved so I wouldn’t have accidentally overlooked my card laying on top of it. two weeks ago I lost my wallet and haven’t been able to find it. after finding my debit card I jokingly asked, “ghost can I please have my wallet back?” today, i find my wallet underneath my desk. again, I wouldn’t have overlooked this since I have tore my room apart multiple times. with these two instances, I am now connected past events to the possibility of a ghost. my dorm door randomly opening with no one outside, random knocks with no one outside. there’s no possibility that this is my roommate fucking with me because she’s almost never in our room. theres always been talk about a ghost named jack in our dorm building but I never believed it. should I try to communicate with him?",
        "created_utc": 1677887221,
        "upvote_ratio": 1.0
    },
    {
        "title": "The forest trail",
        "author": "TotallyNotGoodish",
        "url": "https://www.reddit.com/r/Paranormal/comments/11hieuu/the_forest_trail/",
        "text": "When I was around 8 I lived in a house in a heavily forested neighborhood in East Texas. My mom was married to my then stepdad and we moved into his house which was quite huge.  Outside of the neighborhood was pretty regular but the neighborhood itself was quite dense, and there was another house about every 100 yards or so. So one day in the summer I was playing outside by myself with mom in the living room inside. I often would just play outside by myself in the summers when I was bored and it was quite normal. This time though I guess I was just really bored, so I decided to take a walk through the woods by myself. The tree line was pretty close to the pool and surrounded it on all three sides, but there was a path to the top left of the tree line that me and my then stepbrother would go exploring down sometimes.  I hadn't been down the path too many times before, but I felt comfortable going by myself as I was quite adventurous at the time. The walk would probably take around 10 minutes and would spit you out in the front yard when the treeline ended. So I started strolling through the trail but stopped about halfway through when I noticed a woman walking towards me on the trail. I was startled by her but also curious about what she would be doing on the trail on my property. I expected her to stop too and explain what she was doing but she just kept walking. I thought she was gonna walk right past and act like I wasn't there but she stopped right in front of me. I was pretty scared at this point but then she ask me my name. My fear almost vanished instantly from the sweet and kind tone in her voice and I was able to get a good look at her. She had long brown hair and a pretty face with a white gown of sorts, she seemed to be in her late teens maybe still a kid. I told her my name and she complimented it and asked me if I was lost. At this point, I was a little confused but knew she was no danger so I told her how I was walking on the trail on my property and that I thought she was lost. She didn't respond right away and kind of just looked me up and down with a slight smile and then replied with something along the lines of that she was taking a walk in the woods when she stumbled upon this trail and was wondering where it led. At the time I was still a little shy but I completely believed her since she was so nice. I told her she could come to my house if she was lost and call her family. She thanked me but said she knew how to get back to her house and that she would be ok. I asked why she had on the gown and she told me she just hadn't changed since she got up. I thought that was strange but thought it was funny and giggled a little. She giggled with me and then she asked if I would walk back with her and that it would only be a few minutes. I was reluctant at first, but since she was nice I said I would. She thanked me and was telling me about how kind I was which made me feel good since I would get in trouble in school a lot and be told to be nicer. We started walking when she offered me a chocolate and I didn't want to be rude so I excepted and thanked her. It was to this day one of the best things I've ever tasted even though it was just a piece of chocolate. I told her all about how amazing the chocolate was and she said she made it herself and was glad I liked it. I asked if she could come to play with me another day and she told me maybe but I couldn't tell anyone and it would be our secret. I agreed and we walked a little further down the trail until there was another trail going to the left that I had never seen before. I told her how shocked I was that there was a whole new trail leading deeper into the woods and she said her house is straight ahead when we went onto the new trail. I was sort of confused as I had no knowledge of there being any houses deep into the woods and I originally thought she was a neighbor. I asked why her house was so far into the woods and she said she liked how relaxing it was away from all the noise. As we went ahead I started noticing how the path was getting wider and trees were thinning out. I don't remember much of the conversation from that point on but I remember the amazing sites and views I saw as we walked on. There were lakes, meadows, orchards, ect. They were all so beautiful and mesmerizing that I stopped talking and was just focused on all the nature. I told her that I didn't know all this pretty stuff was behind the woods and she told me about how it's her secret place and that I had to keep it a secret. About a minute later we approached some trees and a cabin. She told me that was her cabin and invited me in. The cabin was quite small and the wood almost looked untouched. I told her I couldn't and that I needed to get home or my mom would be mad. She insisted that she just wanted to share some more chocolates with me, and even though I was intrigued I politely told her no thanks and that I could come over another day. She seemed saddened by that but told me she had fun. I told her I did as well and that I would see her later. She waved at me and reminded me to keep this a secret, and I made a zipping motion with my fingers on my mouth and was on my way. As I walked back I thought about all the fun I was gonna have this summer with my new friend and turned around to wave back again and that's when I was shocked. When I turned all I saw were the same dark trees that were on my original trail with the path on the ground in front of me. I was extremely confused especially when I realized it was dusk. I turned back around and saw the same area I had originally entered the trail from so I walked out and saw my house. My stepbrother then saw me and started calling for my mom and stepdad. My mom was super relieved to have found me and said she and my stepdad had been looking for me for 2 hours and were about to call the police. I was still kind of in shock at what had just happened and they asked where I was and I was able to tell them about the woman and what happened. They were confused as I was in disbelief. My stepdad went to the trail and didn't see any other trail leading into the woods. They thought I was lying and making an excuse for why I wandered off. My mom also told me how the trees only go back about 200 yards from the trail until you hit the road. I didn't know what to believe at this point and to this day still wonder if I was hallucinating or had a paranormal experience. Sorry for the long story but thanks to any of you that read it:)",
        "created_utc": 1677885558,
        "upvote_ratio": 1.0
    },
    {
        "title": "Wish me luck tomorrow!",
        "author": "foxybarnes86",
        "url": "https://www.reddit.com/r/Paranormal/comments/11hh8ev/wish_me_luck_tomorrow/",
        "text": "Well since moving in 4 years ago various paranormal things have happened in my house including whispers, cold spots, items moving without explanation, electrical issues, seeing shadows and more\n\nWe visited a medium a month ago and she said it was family visiting but tomorrow we have a medium visiting the house so let's see if she picks up on any paranormal activities 😱",
        "created_utc": 1677882794,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does anyone know where this is in California?",
        "author": "WhereasSecret3112",
        "url": "https://www.reddit.com/r/Paranormal/comments/11hgh9i/does_anyone_know_where_this_is_in_california/",
        "text": "Does anyone know where this is in California? \n\nSo I'm looking for this house so I can do some research about it but I don't know the name or where I Cali it is. If anyone has any ideas please comment below. \n\nSo it's a third party account. My friends mother in law told her the story and she told me.\n\nSo there's this big old mansion that over time got converted into a hotel. We don't remember the price point but apperantly it was pretty expensive because they are supposed to be fancy. So a few years ago her mother in law was on vacation with some friends and that's where they were going to stay (she ended up not spending a single night lol). Now keep in mind that this woman doesn't believe in any type of paranormal anything. So anyway, she was checking in and all that and when she was going up to her room this woman in her mid 40's joined her in the elevator. She noticed this woman was wearing old Era looking clothing (late 1800's to early 1900's). So to be nice and not feel awkward she smiled at her and tried to make conversation with her about her clothing. Saying like wow I've never seen anywhere with that style of dress before. It's beautiful, where'd you get it? And she said the lady turned to her, just looked at her for a second, and then turned back facing the elevator doors and just ignored her. She was just like oh okay she doesn't want to talk and they stayed quiet the rest of the way. Then when they got to their floor they both went their seperate ways. Later on that evening she was going to a restraunt with her friends (they were staying there as a group) she stopped by the front to ask. She assumed the lady was the owner of the house so she commented on her cloths saying she hasn't seen that style of clothing before. And girl at the front was like what are you talking about? The owner to the house does a long time ago. \n\nBackstory:\nShe told her a story that she house belonged to a wealthy man and his wife. Well behind her back he was having a secret affair with one of the maids. And so to be together, and to save public face he had to get rid of his wife. But fast because the maid was pregnant with his child. So of course, like any normal person would do 🙄, he murders his wife and tells the town she either left him and ran off with someone else, or that she simply just dissappeared. So after that he moves the maid in and they live happily ever after right? Except a few months goes by and his wife's parents come down to try to find their kid. They didn't vekuheve that she just dissappeared or ran off. And I guess for him to not look suspicious, he allowed them to stay for a while. Well, while that stay they stated investigating and I think they got too close to finding out the truth and exposing him, so he turns around and kills them too. Then he flees which I think is how he gets caught later down the line. So it's said the ghosts still roam the house looking for their daughter and/or because the unfinished buisness of having him exposed. \n\nI'm not sure if these are exact details becaise I wasn't there and the mother in law can't remember anything about the place. If this sound even remotely similar can someone comment any info thet might know so j could do some kind of research? Please and thank you :)",
        "created_utc": 1677881073,
        "upvote_ratio": 1.0
    },
    {
        "title": "What's your haunted doll experience?",
        "author": "Honey8811",
        "url": "https://www.reddit.com/r/Paranormal/comments/11hcs63/whats_your_haunted_doll_experience/",
        "text": "I just got a doll that I believe is haunted. I'm a medium and so I see ghosts quite often, however I only got the doll an hour ago so I need them to open up to me a bit. But I believe it's haunted cause I had a dream where I was at good will and there was a doll with blonde, straight hair, blue eyes, a green dress, etc. So today I stopped at good will and boom, there was that exact doll (and I've never been to this good will so it's not like I've seen it before). So for $6 I bought it cause I wasn't sure but even seeing it I felt very drawn to it. \n\nDon't comment saying that it's fake or evil, I have dealt with 'demons' or whatever before (I just consider them negative energies) and so I know how to deal with that, however I'm 90% certain that this is just a regular spirit. It just feels very weird for me because I feel like I just bought a person and that just feels wrong. So yeah. If you have any experiences then I'd love to hear, and I can update once I know more about the doll",
        "created_utc": 1677872705,
        "upvote_ratio": 1.0
    },
    {
        "title": "How can I experience the paranormal/supernatural?",
        "author": "fromuklad",
        "url": "https://www.reddit.com/r/Paranormal/comments/11hbpe0/how_can_i_experience_the_paranormalsupernatural/",
        "text": "I have to see to believe in the paranormal, however I am quite interested in it. Are there things I can do/places I can go to experience these things or is it purely by chance?",
        "created_utc": 1677870232,
        "upvote_ratio": 1.0
    },
    {
        "title": "My first and only paranormal experience",
        "author": "LordBeeron_",
        "url": "https://www.reddit.com/r/Paranormal/comments/11ha1hd/my_first_and_only_paranormal_experience/",
        "text": "It was back when I was at school, I was doing an internship in a company to get familiar with the tasks and everything was going alright until the day I had to go in the archives that were kept in a room with a damaged big ass door closed by three large locks in another building right next to the one where we were working all day long.\nThis building was the same in which we had lunch and I remember each time I had to walk past the archive's door I felt unsettled, and I swear sometimes I could hear weird noises coming from behind it.\nOne day I was given the task of going in the archives to take a cardboard box containing all the files from a given year, and I was stressed out, but I had no choice so....\nI remember this strange feeling of disquiet while going up the stairs and when I finally arrived in front of this big damaged door everything was silent. \nI opened the three locks with the key that I was given, and I pushed the door to discover a room plunged into darkness and when I turned on the lights I've seen a hundred and a hundred of cardboard boxes stored in broken shelves and some of them dating back to 1910. \n\nI was starting to look for the box with the right year on it and the longer I was in this room the more I was feeling oppressed, and eventually I found the box I was looking for. It was on a high shelf so in order to reach the box I had raised my hand and as soon as I had grabbed the box I felt a sudden and violent pressure on my throat that made me fall on the ground with the box still in my hand, I had run away from there as fast as I could locking back the three locks and I had never gone back to this room again.\n\nThis memory haunts me until today and I don't know what happened to me this day",
        "created_utc": 1677867520,
        "upvote_ratio": 1.0
    },
    {
        "title": "I keep having night terrors about my apartment and I don't know why",
        "author": "tsunamikumquat",
        "url": "https://www.reddit.com/r/Paranormal/comments/11h9rrv/i_keep_having_night_terrors_about_my_apartment/",
        "text": "Ever since I have moved into this apartment, I've experienced night terrors. \n\nFor example, parts of the apartment that don't exist in real life appear in my dreams. For example, a door that opens to a place where a scientist experiments on children. He harms the children. I get glimpses of past tenants and how they hide their abuse. One was a black woman who saved so much food to block the terror/abuse as a child from coming forth like binge eating. One was a skinny blonde woman who was into some sort of witchcraft or divination. She was a medium.\n\nLast night just takes the cake...\n\nI was looking up history about this town, about this place that I live. It's a very small town and this apartment is only 10 years old. I don't understand why I keep having these nightmares!! I found out the town was home to a primary road during the 1800s. I live in the US.\n\nThis young black woman keeps appearing with a knife to attack me. Turns out that she was trying to defend herself against someone that she had been murdered. Her boyfriend ( or a man) chopped her up and buried her in the field behind my apartment (it's corn fields). She kept trying to go towards the light, but couldn't because she felt she had to let someone know what happened to her. A black man from Africa appeared (??) saying that he was a medium and that she needed help moving on and explained her situation.\n\nThe next was a young girl who was trapped in an office in secret. She was taken around in her prior years, but due to an accident she had become handicapped and kept out of view. Her mother left her locked in a room with no means of escaping. She was locked in a hidden room. I kept trying to find her but couldn't find her. Again, it was different from my apartment.\n\nIf anyone has any interpretation to these wild dreams, I'd love to know lol",
        "created_utc": 1677867223,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do I get stuff to happen?",
        "author": "Ask_-_Everything",
        "url": "https://www.reddit.com/r/Paranormal/comments/11h8zj1/how_do_i_get_stuff_to_happen/",
        "text": "All I see is post about people having experiences and stuff happening but never to me, I want something to happen, honestly I want to talk shit to ghosts or whatever you call them, I got one of them Emf readers with the red yellow green lights, but I want to like EXPERIENCE something, it would be fun, so how?",
        "created_utc": 1677866367,
        "upvote_ratio": 1.0
    }
]