[
    {
        "title": "Can the paranormal mess with phones?",
        "author": "renywenny",
        "url": "https://www.reddit.com/r/Paranormal/comments/z0wxv2/can_the_paranormal_mess_with_phones/",
        "text": "Hello everyone so this happened about an hour ago and after consulting Google I thought I would ask here because I know my phone isn't hacked. \n\nMy girlfriend and I stay on the phone with eachother all night, we do this every night and what happened today has never happened. \nWe were both woken up by heavy breathing coming through our phones, neither of us could hear eachother, the breathing turned into mumbled words, growling, a weird screaming and what sounded like if you rewind something very very fast. It kept going through each of the noises randomly with the heavy breathing in between. We eventually had to hang up because we were both terrified. \nWe both would like some answers so any help would be appreciated!",
        "created_utc": 1669031032,
        "upvote_ratio": 1.0
    },
    {
        "title": "Alguien puede ayudarme",
        "author": "Leynalem",
        "url": "https://www.reddit.com/r/Paranormal/comments/z0wm88/alguien_puede_ayudarme/",
        "text": "Hola comunidad de Reedit, quiero comentarles algo que me\n\nsucedió hace unos 15 minutos aprox. (3:45 am). En mi familia siempre hemos tenido la creencia de que hay seres y energías fuera de nuestro entendimiento y el que más ha estado inmerso en todo esos temas esotéricos y místicos a sido mi padre. Yo me empecé. A interesar a los 15 aproximadamente y siempre buscaba en Internet los típicos videos de apariciones o capturas en video de seres extraños, duendes o entidades.\n\nAhora no se que habrá sido lo que vivi pero les escribo para saber si lo que me acaba de pasar es algo que alguien más a experimentado, si suele pasar o que es realmente lo que sucedió. Hace unos 15 minutos estuve recostada en mi cama y estaba entre dormida y despierta, yo recuerdo estar consciente pero con una sensación de extremo sueño como si estuviera batallando para no quedarme dormida, ante esto yo me había despertado a eso de la 1 de la madrugada y me quedé mirando videos y tiktoks, y dentro de ese lapso no recuerdo en que momento pero empecé a sentir como un sonido seguido de una vibracion en todo mi cuerpo, primero fue leve y luego empezó a ser más intenso, no sentia dolor ni algún malestar, era más que nada como si algún tipo de máquina me estuviera disparando? esas vibraciones... digo maquina porque no se que otra cosa puede hacerte sentir esa sensación en todo tu cuerpo, no sentí ningún movimiento en mi cama ni olor ni sensación desagradable, en esos momentos empecé a pensar que era algo entre el subconsciente y consciente y que quizás me estaba quedando dormida y luego empecé a pensar que quizás sea algo de todo lo que vi en videos. Primero pensé que era algo relacionado con ovnis o algo parecido luego pensé que podrían ser duendes o algún ser que estaba\n\nexperimentando o que se yo, también podría ser que quizás estaba tratando de desdoblarme en astral (para esto antes de niña más cuando tenía una fiebre altisima solía sentir al querer dormir una sensación como si mi cuarto giraba y mi cuerpo empezará a caer y veía que el techo se alejaba, mi madre pensaba que era por la fiebre pero mi padre me decía que era porque estaba saliendo en astral, y esa experiencia es la única que tengo de referencia de como se siente el querer salir en astral así que no estaba segura que si lo que estaba viviendo era algo relacionado a eso), y al final creí que quizás era algo de mi cuerpo y el cansancio que me hacía generar esa sensación. Por un momento pensé en dejar que pasara hasta que terminará pero cada vez empezó a sentirse más intenso y ahí si me empecé a asustar, como dije antes, no sentia dolor o malestar solo como que mi cuerpo vibraba por lapsos de 1 a dos segundos como si me estuvieran lanzando un rayo invisible que generaba esa sensación y ya cuando empecé a incomodarme trate de moverme y sentía extraño mis brazos, cada vez que trataba de moverlos sentia un hormigueo en los brazos y como si no tuviera fuerzas para levantarme, trataba de mirar a los lados y no veía nada más que mi cuarto, hasta que pude girar mi cabeza y ahí fue donde vi algo que me asusto.\n\nNo se como describirlo bien pero, recuerdo que era una cosa pequeña como una bruma que estaría a unos centimetros de la altura de mi cabeza, justo al lado mío, estaba parado en una parte de mi cama moviendo no sé si sea su brazo, pero a mi me pareció un brazo con una mano blanca como si tuviera un guante, solo pude ver y reconocer ese brazo y la mano porque su cuerpo no lo vi bien estaba desenfocado y parecía como una bruma gris. Era un ser pequeñito de no más de 10 centimetros y lo que me asustó era que estaba agitando ese brazo muy rápido como si me estuviera queriendo dar viento con su mano y ahí empecé a respirar más fuerte como tratando de asustarlo porque no podía gritar, hasta entonces ese ser seguía agitando su mano y no sabía si el o ella estuvo ahí desde un inicio cuando empecé a sentir las vibraciones o si era el responsable de lo que estaba pasando o solo trataba de ayudarme a reaccionar. Habrá pasado menos de un minuto y cuando al fin pude volver a mis sentidos y poder moverme vi como ese ser empezó a desvanecerse hasta que desapareció, no sé si se habrá ido o solo deje de poder verlo pero, desde ese momento ya no quise volver a dormir a pesar que sentía sueño, no por miedo a volver a sentir esas vibraciones, sino por volver a ver a ese ser, que en ningún momento sentí que me estaba haciendo daño pero de todas formas aún estaba asustada de toda la situación.\n\nPor favor quisiera leerlos y saber si a alguien le ha pasado algo similar o sabe más o menos que me ha pasado. Estaré agradecida de sus comentarios.",
        "created_utc": 1669029960,
        "upvote_ratio": 1.0
    },
    {
        "title": "Who/what sat on my bed last night?",
        "author": "lucky_locket888",
        "url": "https://www.reddit.com/r/Paranormal/comments/z0t5s1/whowhat_sat_on_my_bed_last_night/",
        "text": "Last night at about 10:35 I was about to go to sleep with my fan on in my room but nothing else was plugged in or turned on or anything. Apart from the hum of the fan there was complete silence. As I was lying there I felt my bed move a lot as if someone sat down/jumped onto my bed next to me. My bed moved so much that everything shook, my bed, my headboard, even me. I sat up and turned the light on but everything looked and seemed normal. I could not see anything out of the ordinary inside of my room nor could I recreate or identify any possible way something like that could have happened. Nothing else weird happened after that, and I researched any tremors or seismic activity in the area but there was nothing. Does anyone have any sort of idea or comment about what happened?\n\nTL;DR felt like someone sat/jumped onto my bed next to me last night and I can’t imagine what it could have been.",
        "created_utc": 1669017522,
        "upvote_ratio": 1.0
    },
    {
        "title": "I'm back from my Old Alton Bridge one-man trip!",
        "author": "Nearby-Hyena-7664",
        "url": "https://www.reddit.com/r/Paranormal/comments/z0t2hd/im_back_from_my_old_alton_bridge_oneman_trip/",
        "text": "Sorry I'm late. But yes, I'm back from Goatman's Bridge. And I mean the Old Alton Bridge in Texas.\n\nIt was very spooky. I heard unexplainable sounds, like screams and cries, and even saw shadows. And throughout the entire trip, it felt like someone was watching me. Mind you, I went alone.\n\nI tried the Ouija board on the bridge just before I left. Nothing happened, but it did feel like the atmosphere went from spooky to downright terrifying, as if any minute now someone, or something, was about to jump on me.\n\nAfter that, I immediately bolted out of there. \n\nShame I forgot to bring my camera.",
        "created_utc": 1669017173,
        "upvote_ratio": 1.0
    },
    {
        "title": "Unexplainable Noise",
        "author": "Seoulcxol",
        "url": "https://www.reddit.com/r/Paranormal/comments/z0skqm/unexplainable_noise/",
        "text": "Hey guys, so this happened earlier this year but I just suddenly remembered it after watching some horror stories so I thought I might hop on and share this experience here with you all.\n\nSo this took place about 9 months ago, which would be February and I've never experienced anything as horrifying as what Im about to say. I've had a demon attached to me before, experienced a possession first hand, and other paranormal encounters but none of them compares to this one. \n\nI suddenly woke up one early morning (3:40am ish) and it felt as if I never slept at all, and at the same time, I felt like something was off. a minute or so after, I realized how silent it was and when I say silent, I mean it was as if someone pressed the mute button and everything went completely silent. I found it weird because, where I live is near the woods and you'll always hear something like the crickets or even the wind haha. It's like the complete silence you hear in horror movies right before something happens, and I immediately went into a panic and I could tell something was about to happen. nothing could've ever prepared me for what happened next. at around 3:50am is when I heard the most terrifying growl you could ever imagine. This thing sounded like a mix of a bear, a wolf, and a dog but we don't have bears or wolves here in my state, and it sounded something much larger than a dog. I've never been terrified in my entire life up until that point. a few seconds after, I heard howling but it didn't sound like a normal dog? if that makes any sense at all. that lasted for a good few minutes then it went completely silent again. after that, the silence got cut off and I could hear the wind again and the crickets. I remember I was so terrified that I hid under the sheets and started to cry quietly, and I couldn't sleep at night for at least a week. It left me so scared that I always close my windows and curtains from now on, just so I don't ever hear it again. \n\nI can't help but wonder what it could've been, and I almost did something stupid which was to look outside my window and I just can't imagine what would've happened if I did and I made eye contact or get a glimpse of whatever it is / was. I've told my parents and friends about it and they all brushed it off as it just being a dream or that I just made it up just to spook them, but I know what I heard and I knew for sure it wasn't a dream.",
        "created_utc": 1669015356,
        "upvote_ratio": 1.0
    },
    {
        "title": "Might be going crazy, help me out",
        "author": "audmac0107",
        "url": "https://www.reddit.com/r/Paranormal/comments/z0s38c/might_be_going_crazy_help_me_out/",
        "text": "I have an entity that i have never seen but only heard and sensed. It only comes around when i am anxious or scared. I have heard it run on the floor below me, heard it mess with things in the kitchen, and I’ve heard it walk up next to my bed and breathe. I always feel it’s presence outside of my door constantly when I’m anxious. What do i have?",
        "created_utc": 1669013644,
        "upvote_ratio": 1.0
    },
    {
        "title": "Do you guys think this is mental or paranormal?",
        "author": "Princessmichee",
        "url": "https://www.reddit.com/r/Paranormal/comments/z0roaw/do_you_guys_think_this_is_mental_or_paranormal/",
        "text": "[removed]",
        "created_utc": 1669012213,
        "upvote_ratio": 1.0
    },
    {
        "title": "Something that I don't know what it is takes me back to the cemetery in my sleep",
        "author": "veryybadbakht",
        "url": "https://www.reddit.com/r/Paranormal/comments/z0qyqh/something_that_i_dont_know_what_it_is_takes_me/",
        "text": "In my dream, I don't know what he is, he or she is a genie, he or she is a spirit, I don't even know if he is a woman or a man,It takes me to a scary cemetery, that cemetery is very familiar to me،But I don't know where it is. I haven't seen it,How many times has he she taken me to that cemetery, it is full of corpses.There I saw my childhood friend who said he came to meet me, I saw him and we talked, and he left.I also wanted to go with him،No matter how much I looked for him, I couldn't find the way he went, I don't know what the people in the cemetery were, but they scared me, I was scared of the corpses.\nI didn't know what to do, I've been there more than a few times",
        "created_utc": 1669009859,
        "upvote_ratio": 1.0
    },
    {
        "title": "I worked at a haunted subway",
        "author": "dragonflyy1116",
        "url": "https://www.reddit.com/r/Paranormal/comments/z0qkz8/i_worked_at_a_haunted_subway/",
        "text": "So, for context, I am an 18 F who used to work at 24-hour subway. I worked there for almost 2 years until I quit this past July for mental health reasons. For over a year I was one of the \"store openers\" and would get there around 7am to start tasks. Keep in mind I would usually be alone until around 9 or 10, when another coworker's shift would start. Even though I only have a few scary stories from my 2 years of working there, I and some of my old coworkers still believed it was somewhat haunted. Ok so, one morning when I was alone, I was standing in the back when I heard from the front a womans voice saying \"hello,hello,hello\". It was almost like a loud whisper. Of course, my first instinct is that the bell we have on the door didn't work and a customer is out there waiting. Except when I walked out to the front, there was no one there. Not even a car outside of the store. The song on the radio was a familiar song from the 90's, sang by a male artist, so there is no way it could've been that, and why would an artist put background vocals of a creepy whisper in a song anyways. I remember hearing the first hello and turning my head and listening more carefully as it said hello two more times, so I know for a fact I did not imagine it. After this instance, I had another a while later where I was in the back and heard one of our bread cabinet doors slam shut out front. This is a very distinct noise for anyone who has worked in a subway because we are constantly getting bread and closing the cabinets. Immediately after I heard it shut, I ran out of the back to again see nothing, no customers, no cars out front, NOTHING. We also don't like to keep bread cabinets open since air could get in and make the bread stale, so I know for a fact I did not leave it open for \"the wind\" to shut it. My last story happened more than once on different occasions, and I would like to think that this was \"the spirit\" messing with me and wanting me to think I was crazy. Again, I would be in the back alone, when I would hear what sounded like somebody sweeping the floor in the front towards the cash register. It was a \"swoosh\" noise that would happen over and over again for at least 3 seconds at a time. The thing is, is that I would move slightly, and it would start, and when I stopped moving, it took another second for it to stop, so I knew it wasn't me making the noise. For example, I would take a step \\*swoosh\\*, I would stop \\*swoosh\\* and then it would stop. It would happen sometimes 5 times in a row, until I would walk to the front that is 3 feet away and see nothing. It would only happen when I was alone and would start to happen when I was just sitting or standing around on my phone in the back. I feel like the spirit wanted me to think that I was the one making the swoosh noise, while also making me feel creeped out at what I was hearing. Also, whenever I heard the swooshing noise, I pictured a woman with blonde hair in a white dress, which I don't know why is what popped in my head when I heard it. At the time of these things last year, I was in a bad mental place and exhausted from always being out of the house at school, work, or competitive dance, which is why I feel like the spirit only really showed itself to me, because I was depressed and didn't have any friends at school. Even though those are my only experiences, I still feel as though there was a woman's spirit roaming around that subway.",
        "created_utc": 1669008607,
        "upvote_ratio": 1.0
    },
    {
        "title": "Some one joins me every night in bed. I live alone.",
        "author": "RedneckWasteland",
        "url": "https://www.reddit.com/r/Paranormal/comments/z0q8rj/some_one_joins_me_every_night_in_bed_i_live_alone/",
        "text": "For the past few years, I've been experiencing something I really can't explain.\n\n&amp;#x200B;\n\nEvery night when I settle in for bed. Almost without fail it feels like someone else comes and lays down next to me.  At first it feels like a cat jumps up like they do when they want to join up a cuddle pile.  Thing is, I do not own a cat.  A short while later I'll feel the bed shift like it would when a S.O. comes to bed themselves.  This is long before I fall asleep, or even get close to it.  I usually watch an episode or two of something to settle my mind before sleeping. This usually happens within the first few minutes once I'm settled in. There's no strange feelings or cold chills, nor the pressure in the chest that comes with sleep paralysis. \n\n&amp;#x200B;\n\nI'm trying to remain a skeptic about this, but I swear I can feel the bed shifting with the weight of someone who isn't there.  Once I swear I got bopped on the face by something. I've tried Google. But all I got were more people asking about this.  So I know I'm not the only one.  \n\n&amp;#x200B;\n\nIs there a name for this phenomenon? Is it a normal part of sleep? It's far from disruptive in my life. But it's piqued my interest in a very Fox Mulder sort of way.\n\n&amp;#x200B;\n\nIt might also be worth noting that I work the night shift. So I end up sleeping most often during the day.  It doesn't matter what hour I go to lay down to sleep.  It always happens.",
        "created_utc": 1669007552,
        "upvote_ratio": 1.0
    },
    {
        "title": "I thought it was a dream",
        "author": "Purple_Worldliness47",
        "url": "https://www.reddit.com/r/Paranormal/comments/z0pd3k/i_thought_it_was_a_dream/",
        "text": "\n\nThis happened when I (44f) was around 12 years old, which would make my brother about 10 years old.\n\nIf I were to lay on my right side in bed, I could look out my door, across the hall, and in to my brother’s room.\n\nOne night I woke up in the middle of the night, no idea what time.  I’m laying on my right side, and when I open my eyes, I see my brother standing in his doorway.  He was expressionless, not looking at me, but looking straight ahead.  Then he started walking toward my doorway.  Here’s the weird part… as he walks toward me, he seems to stretch, like get bigger.  Not aging, just expand.  Once he reached my doorway he disappeared and reappeared in his own doorway.  This happened 3 times, then nothing.\n\nLike the title says, I assumed I was still half asleep and dreamt it.  I wasn’t scared, just thought “huh, that was weird”, and went back to sleep.\n\nJust a few years ago we (my brother and I) were talking about weird stuff that has happened to us and I told him this story.\n\nI noticed that when I had finished the story, his eyes were as big as saucers.  He said that the exact same thing happened to him, except it was our father in my doorway walking towards his.\n\nAfter a few months of reading stories in this sub I’m thinking it could have been a Mimic or a Doppelgänger.  Any thoughts?",
        "created_utc": 1669004829,
        "upvote_ratio": 1.0
    },
    {
        "title": "The past couple days have been strange.",
        "author": "Paladin-Aurum",
        "url": "https://www.reddit.com/r/Paranormal/comments/z0p62i/the_past_couple_days_have_been_strange/",
        "text": "I don’t necessarily believe in ghosts but something is up and I cannot deny. For the past couple nights I’ve been having dreams of a recently deceased relative whom I shared a bond with closer than anyone else in my life. I’ve heard of people crying themselves to sleep but never crying themselves awake. Also, I rarely ever cry. It’s an odd feeling when I woke up yesterday morning feeling so distraught and I really can’t figure out why. I feel as if this person is trying to tell me something in my dream, but when I see them that’s when emotion overcomes me and I wake up in tears. \n\nI usually have control of my emotions. Other than that, I’ve been extremely irritable since they passed away. I was holding their hand the moment he passed. \n\nOn top of that, even when I’m awake, I’ve been hearing voices in a quiet room. Knocking on the walls, and lights turning themselves off even when I’m in the room. I have a housemate here, but it’s not him I’m hearing. \n\nJust moments before I wrote this I had an event I can’t explain, that’s the final straw. I was minding my own business, on my laptop, the dresser to my right started to rattle. Violently. It only lasted about 2 seconds but It freaked me out. It’s in arms reach. I wasn’t touching it. I jumped up and was instantly hit with a wave of grief. I can’t explain it. I was focused on a video game and now I’m an emotion wreck. \n\nI need advice. Or maybe it’s all in my head.",
        "created_utc": 1669004239,
        "upvote_ratio": 1.0
    },
    {
        "title": "I think my girlfriend has been turned into a worm?",
        "author": "Swagvikar",
        "url": "https://www.reddit.com/r/Paranormal/comments/z0ozg5/i_think_my_girlfriend_has_been_turned_into_a_worm/",
        "text": "I know this will sound ludicrous but it’s real and I’m really confused.\n\n5 nights ago I was talking to my girlfriend late at night in bed. She asked me a silly question like she normally does asking “What would you do if I turned into a worm”. I let out some funny response and went to bed.\n\nHowever when I woke up, she was not there and in her PJs wriggling, I found a worm. I nearly killed it before I remembered the question and thought this was some elaborate prank. Even though it was a prank I kept the worm safe just in case and waited till 9PM that day and she still hadn’t come back.\n\nI was worried as her phone and everything was still in my room. I asked our housemates and they didn’t see her leave. In addition to this I checked my neighbours CCTV and saw she had never left the house. After two days I called her parents and they think I’m crazy and stupid for letting her go missing.\n\nThe police are looking into it as a missing persons case but I don’t know how to tell them I think she’s a bloody worm. It sounds stupid but how could she have never left the house on the CCTV? It sounds silly but I think something paranormal was listening and turned her into this worm. I have been taking care of it but how can I turn her back? My Muslim friend said it seems like the work of a Jinn.\n\nIt could be some elaborate prank, but I have a feeling that this worm really is her.",
        "created_utc": 1669003697,
        "upvote_ratio": 1.0
    },
    {
        "title": "Lack of sleep any ideas?",
        "author": "Royal-Satisfaction31",
        "url": "https://www.reddit.com/r/Paranormal/comments/z0ov7k/lack_of_sleep_any_ideas/",
        "text": "Lately I've had little to no sleep. I live in a late victorian farm house and around November December time the house changes.  I hear like things getting thrown in the night, the room atmosphere changes to well intense and you feel like you're getting watched but when you go check it out no ones there. I also wake up angry, spacey and out of it and just want to cry",
        "created_utc": 1669003347,
        "upvote_ratio": 1.0
    },
    {
        "title": "Do ghosts know they are dead?",
        "author": "LoveAndHappiness96",
        "url": "https://www.reddit.com/r/Paranormal/comments/z0oba5/do_ghosts_know_they_are_dead/",
        "text": "Do you think when people die they know they are dead? Like I’ve always wondered when someone passes do they wake up somewhere else or what??? I lived in a townhouse where a lady and her child was killed and you would hear them walking up and down the stairs at night because she was doing her laundry, my mom saw her in a dream and told her she was dead and needed to move on(she really didn’t know she died) her boyfriend killed her &amp; her son.She wasn’t try to haunt us she was literally doing her normal routine as if she was living.",
        "created_utc": 1669001737,
        "upvote_ratio": 1.0
    },
    {
        "title": "I never saw Soco the same",
        "author": "Test_Sicle",
        "url": "https://www.reddit.com/r/Paranormal/comments/z0nme4/i_never_saw_soco_the_same/",
        "text": "A while back, when i was roughly 8, my grandmother (oma) had been living in this house that i swear had something in it.\n\nI always believed in ghosts since i was a kid with my few paranormal experiences, one of which had never left my mind. Our family used to have a cat, his name was Soco and he sadly passed away about 2 years ago. \n\nMy grandmother had another cat as well at the time! His name was squeaks, this is because his little “meows” sounded like a dog’s chew toy. Shortly prior to Squeaks kicking the bucket fore-say, him and Soco would always fight for no apparent reason. \n\nI’m fairly sure i was partially at fault, I loved to chase the cats round’ the house and it brought me great joy! But one time, it traumatized me so much, i never saw them the same as i had before. \n\nAs i ran through the hallway into the secondary living room, chasing Soco as  I usually did, they suddenly began to fight as they always had, and a bright blue flash of light about the size of a football flashed for a split second, as they seemed to “change places”. It sounds weird but it was scary enough to make little me cry for my mom. \n\nEvery time i looked into Soco’s eyes, i always saw squeaks.",
        "created_utc": 1668999773,
        "upvote_ratio": 1.0
    },
    {
        "title": "I started saying the lord's prayer and almost fell out",
        "author": "Embarrassed_Pear3114",
        "url": "https://www.reddit.com/r/Paranormal/comments/z0mbit/i_started_saying_the_lords_prayer_and_almost_fell/",
        "text": "[removed]",
        "created_utc": 1668996110,
        "upvote_ratio": 1.0
    },
    {
        "title": "What happens when a house with intense haunted activity is demolished?",
        "author": "EdwardBliss",
        "url": "https://www.reddit.com/r/Paranormal/comments/z0mac5/what_happens_when_a_house_with_intense_haunted/",
        "text": "I've been rewatching episodes of Paranormal Witness and was thinking, when these houses are demolished for a patch of grass or pavement, do these spirits still haunt the land? Do they cross over? I'm not talking about building condos our houses over it, but just a piece of flat unassuming concrete or grass. Which actually brings up another question, do these restless spirits actually need a house, dwelling, or something with four walls, with people to haunt?",
        "created_utc": 1668996021,
        "upvote_ratio": 1.0
    },
    {
        "title": "have a lot of weird encounters but I'll start with the most significant one.",
        "author": "CaptainSeriousToast",
        "url": "https://www.reddit.com/r/Paranormal/comments/z0m4h8/have_a_lot_of_weird_encounters_but_ill_start_with/",
        "text": "Okay, so this is my first post took some personal debate and haven't really talked about these experiences in a long time to anyone figured I might as well write it down here. My grammar and spelling aren't the best so sorry about that, I may or may not answer questions after depends on how distracted I get with other things, anyways straight to it I guess.  \n\n\nBit of a quick off note, I've had tons of odd encounters but this entity was my first encounter with anything of the paranormal sort.  \n\n\nMy mom passed away when I was super young, before I even really knew her so I spent awhile with my dad when I was really young in fact my earliest memories were living at my grandma's place. The house was a big house near the beach my grandma and grandpa built the house so no one had lived there before us. Anyways, I loved that house but a specific area of the house always made everyone feel uncomfortable, this area was in the basement near a cellar. My memory of back then is kinda foggy because it was so long ago, but I remember spending a lot of time with my grandma since my dad was working, and what not. Now, we used to pray every night, go to church every sunday... I was fairly catholic at the time. Anyway I remember eventually seeing these shadow people, they looked almost like little skeletal shadows that would peak out from behind doorways and corners signalling me to follow them. They had glowing eyes, and a sharp almost jagged black shadowy skeletal body.  \n\n\nNow I remember ignoring them for a long time, but one day growing curious I followed them. I saw one near my grandma's room doorway, and walked to the doorway turning the corner and it was gone, then it reappeared at the stairway to the basement down the hall and signalled me to follow again. I followed it and again it was gone, this time appearing at the bottom of the stairs in the basement, as a kid I was terrified of the basement so I didn't follow it. Anyways some more time passed and eventually curiosity took the better of me and I ended up following it in to the basement the next time they showed up. When I turned the corner in the basement I remember seeing this person, they where towering above me (then again being like 5 or 6 years old tops everyone towered over me.) They had a deerskull with horns instead of antlers for a head, wore a big fur cloak, and behind them was darkness. I remember them slowly pointing at me then I screamed and ran for it, right back upstairs.  \n\n\nOver the next couple weeks I'd see this thing in different places, one time hanging itself off the door, other times standing in the trees near the river. (Learned later my family was also getting messed with in the way of weird dreams and odd events like poltergeist shit.) Anyways, eventually I stopped seeing this thing in person and it plagued my dreams instead. I couldn't get a nights sleep without this thing appearing turning it into a nightmare until sometime I remember someone coming to me in the dream, they told me to fight and banish this being, and so I did. I remember in the dream grabbing a broom handle or stick and hitting this entity when it showed up, the dream seemed to crack and I woke up.  \n\n\nYears went by and I forgot about the whole thing until I was about 13-14ish, I was hanging out with some friends and as we were walking back to my buddies place one night I remember his sister turning around and asking \"What's that?\" to which we all turned around. At the end of the street we all saw this tall entity, deerskull with horns and a big fur coat at the end of the street under one of the lights, my memories came back to me and I just remember saying \"We need to leave.\" We proceeded to run back to my friends place, and aside from some odd moments like the power going out, and doors opening and closing it seemed to leave us alone.  \n\n\nA few months later I'm in the gymnasium bleachers watching some sports at my highschool when I suddenly start to feel tired, now I was resting kind of against the railing, when I almost blacked out which would have caused me to fall off the railing suddenly I saw that deerskull image appear in my mind and I was snapped wide awake. The next few years it was off and on, I'd see the entity, then some of my friends or my brother and his friends would. When it was around it always made everything darker and the smell of mildew would suddenly become very noticeable.  \n\n\nHe attacked one of my friends once, but that seemed to mostly be a warning to get my friend to back off. He gave me a scar on my wrist that I've had pretty well my whole life. I moved out of my home town years ago and kinda figured he was gone but back in february I was walking home one night and felt a familiar feeling only to look over at the trees and see him standing there, first time I've seen him in a few years so caught me a bit off guard. Still no idea exactly what it is, though the running theory is a nature spirit of some kind due to the alleged history of the land of my hometown.",
        "created_utc": 1668995577,
        "upvote_ratio": 1.0
    },
    {
        "title": "Writing and symbols on the mirror and windows",
        "author": "PandaPlayZLP",
        "url": "https://www.reddit.com/r/Paranormal/comments/z0lw05/writing_and_symbols_on_the_mirror_and_windows/",
        "text": "Hey, its my first time posting here but I wasnt quiet sure where else to write or talk with. \n\nSo basicly everything startet a few weeks ago when I am under the shower the fog layed on the mirror and windows of my bathroom and I started to see eyes being drawn on booth things. I didnt thought much about it as it could be just an random coincident from cleaning them but today it freaked me out. The eyes where gone and instead there was text on the mirror. It formed a textbox on the bottom where I was able to tell there where some letters but I wasnt able to read anything could just recognize some E and A. But what freaked me out the most was the text in the middle it was a clear to read \"I am\" and next to it 2 eyes. Like I am watching you. I really dont know what todo right now and never had something similar in the past. Not living alone but no one besides me using this bathroom. Do you guys got any idea what this could be? \n\nTrying to upload a picture when going for another shower",
        "created_utc": 1668994912,
        "upvote_ratio": 1.0
    },
    {
        "title": "Orbs Following Me",
        "author": "jessatlien23",
        "url": "https://www.reddit.com/r/Paranormal/comments/z0lcuv/orbs_following_me/",
        "text": "I was driving home from my mom’s house in an urban part of Atlanta. I was wearing glasses. I have seen orbs in videos. Never in person.\nOrbs followed me home. I cleaned my glasses! They moved. They were in different aspects of my vision on my drive home. I have never experienced this before. I have not seen them since I’ve been home….",
        "created_utc": 1668993465,
        "upvote_ratio": 1.0
    },
    {
        "title": "I regularly hear voices talking but can never understand what they are saying",
        "author": "mimigros",
        "url": "https://www.reddit.com/r/Paranormal/comments/z0kxkf/i_regularly_hear_voices_talking_but_can_never/",
        "text": "For years I have been hearing 'people' talking as if they were in another room.  I can never make out what they are talking about.  Why would I be hearing this?\n\nI have had some weird experiences with objects falling off shelves, closet doors opening and closing with a bang, seeing shadows creeping on walls and more. None of it ever scared me though.",
        "created_utc": 1668992349,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why would this happen",
        "author": "Human255856",
        "url": "https://www.reddit.com/r/Paranormal/comments/z0khsm/why_would_this_happen/",
        "text": "Why would a spirit say “help me”. \nWhat are you suppose to realistically do besides freak out you may have a mental disorder. \nAll jokes aside, what are you suppose to do with that. \nWhat is the likelihood of a spirit saying that and it be something with ill intentions masking as something else? \nWhy would a spirit even need help from a person who’s living…do they know we are alive and they’re dead?",
        "created_utc": 1668991132,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why its only Hungary",
        "author": "miksa124",
        "url": "https://www.reddit.com/r/Paranormal/comments/z0kb2v/why_its_only_hungary/",
        "text": "[removed]",
        "created_utc": 1668990625,
        "upvote_ratio": 1.0
    },
    {
        "title": "Mom’s still here taking care of everyone.",
        "author": "lowmack92",
        "url": "https://www.reddit.com/r/Paranormal/comments/z0jzp4/moms_still_here_taking_care_of_everyone/",
        "text": "TL;DR- My aunt’s father is on his deathbed and said my mom, who has also passed away, is there to take care of him. \n\n\nMy mom died of a massive heart attack last December. It was sudden, completely unexpected, and caused my entire world to crash around me. \n\nA little background, I grew up in the Christian church. Although I still say I’m Christian, most people would probably define my views today as Agnostic. I still think they’re something out there and a life after this one, but it’s easier to believe in Heaven when the person you shared a soul with is still here on Earth. I’ve always believed in the paranormal, but after losing her I feel like I’ve been desperate for proof. I’ve experienced a handful of strange events this past year concerning her, and although their circumstances have been 1 and a million I still can’t convince myself it’s not all coincidence. \n\nMy mom’s best friend, who I refer to as my aunt (they’ve been best friends since they were 5) told me about an experience she had yesterday. Her father is very old and on his deathbed, basically to the point where it would be a blessing if he passed away. The last 12 months he’s had dementia to the point where he often doesn’t know who her or her sister are anymore, and if you’ve never experienced a loved one with dementia/Alzheimer’s, this tends to be the most traumatic experience for the family. \n\nAlso, important to note, my mom was literally the most caring person on the planet. She took care of everyone and everything all the time to the point she was everyone’s go to when they needed help. She also went through a similar situation a few years ago when my grandfather was dying. \n\nAnyway, my aunt said her dad was having one of his episodes the other day, throwing his blankets off and yelling at them like they were strangers. She’s said these are the moments lately where she misses my mom most, bc she knows my mom would be right beside her to help and comfort her, and would know what to do in these situations. After they finally calmed him down and all was quiet, my aunt went to put his blanket back on. Before she could cover him up he looked her straight in the eye and said in the most calming tone “Baby girl, don’t you worry about that. Cathi (my moms name) is here and she’s going to cover me up. She says everything’s going to be alright and she’s here to take care of me.” \n\nWhat makes this even weirder, is that when my mom died he was already so gone mentally that they decided not to tell him. The only other person he’s talked about like that has been his sister, who passed away 7 years ago.\n\nI’ve read before this is actually a common occurrence before death, so much that hospice includes it in their info packet of what to expect when someone’s dying. What shakes me most though is that he only talks about seeing the dead, not also hallucinating about anyone who is still living. \n\nI know this could also be a coincidence, but this is the one experience that has given me true hope that she’s still out there. I hope by sharing this I reach someone else who is also grieving and desperate for hope. Thanks for reading.",
        "created_utc": 1668989777,
        "upvote_ratio": 1.0
    },
    {
        "title": "I heard someone whisper “Help me”",
        "author": "Human255856",
        "url": "https://www.reddit.com/r/Paranormal/comments/z0jrhj/i_heard_someone_whisper_help_me/",
        "text": "Hi. \n\nI don’t know what to do, so I guess..I’m on Reddit asking strangers their opinions on this situation. \n\nI guess for context, and helpful information I have ruled out the possibility of having schizophrenia, BPD, Bipolar, basically the major disorders. \n\nThe only thing I have is severe awkwardness and ADD. \n\nI moved to a new apartment that has been recently built within the last few years (5-10 years or so)\n\nI was sitting at home, alone, at this point I’d been living here for about 6 months or so. You CAN hear your neighbors doors being slammed, and them stomping up and down the stairs. But you don’t hear them talking. \nSo I was sitting there, my Netflix account had asked me if I’m still watching so there were no noises  playing, and I heard very clearly “help me” whisper in my ear, which then sent me into full panic mode because I was seriously thinking I have schizophrenic disorder or something. So much so, I went and got myself a therapist, and was tested over a period of time. I was THAT convinced. But everything turned out fine from testing. So I gave up on it and just tried to push that memory super far down. \n\nThen..I was cleaning up my kitchen probably a month or so after, and I was loading the dishwasher, I was turning around, grabbing things to put in it and when I turned around to grab the last spoon that was on my counter, it wasn’t there. I was confused and searched for it, couldn’t find it, turned back to the washer to close it, and there was the spoon. At this point I stopped in my tracks and told myself “I’m ok” and tried to comfort myself because now I’m certain the professional I saw were clearly very wrong and I’m having issues. \n\nI called my friend to vent and she convinced me to forget about it and that I probably just loaded the spoon and forgot. \n\nThen I’m putting my toddler to bed, and the bathroom light is flickering. Which that in itself is normal, I’ve had plenty of lights flicker but I’ve never had all of these things happen, knowing the past situations, I just get a weird feeling. \n\nWhen I go up my stairs, it feels like I’m being watched even though I know I live alone with my toddler and no one is watching me. But it gives me such a weird feeling that sometimes..I’ll even run up my stairs to get it over with. I’ve felt the stair thing since I moved in and just thought I was being a weirdo. But now I’m thinking maybe not?\n\nI did some quick research and no one has died in my apartment that’s been documented. \n\nI just feel like I’m going crazy despite what professionals say, this is a fairly new building, so I just don’t understand why there would be a “ghost”. \n\nThe only thing that comes to my mind is my estranged fathers murder victim. He killed his girlfriend in a domestic violence situation 4 and a half years ago, even though we were estranged he managed to reach out to me to let me know what he did to her, I had to alert authorities to her body and had to testify against him. He’s now in prison where he belongs, and I’ve since moved on without any issues that would ever make me think there’s a “ghost” around. Until this apartment. \n\nBut besides that, I have no idea why a spirit or a ghost would be hanging around me. I haven’t been anywhere that’s considered haunted, so I didn’t bring anything home with me. \n\nThere’s rumors that the building is built on an Indian reservation but I’ve researched it a thousand times, I’ve never seen one thing stating it use to be that. And I’m wondering would something like that be documented online? Where would I even go besides online to figure something like this out? \n\nAlso, it’s not carbon monoxide poisoning.",
        "created_utc": 1668989179,
        "upvote_ratio": 1.0
    },
    {
        "title": "I Think I Can Sense Spirits.",
        "author": "ALadWithCuriosities",
        "url": "https://www.reddit.com/r/Paranormal/comments/z0h5sj/i_think_i_can_sense_spirits/",
        "text": "I've always had weird experiences with haunted houses, but I've noticed a lot in the past 2 or so years, in any house that I hear strange noises and notice objects in different places than before, I just know it's haunted. Not in the paranoid sense, but just a certainty that there's something here with me, I don't feel afraid, or in danger, or anything, it's just a feeling of acceptance and certainty that there's something here. I don't experience this feeling any other time, it's a very strange feeling as well.\n\nThe best examples I can give to explain it better are these:\n\n1. My girlfriends old house was haunted in the basement, she always told me that there weird noises that happen that can't be explained. So there was a situation which I had to live with her for a month about a year and a half ago, and I had to stay in that basement, it's a very open basement, having only wooden beams and pillars to keep the house up. One night I kept feeling like I was being watched so I kept looking at the one window they had looking into the backyard, but then I looked left towards the opposite and completely black corner of the basement and I start getting this tingly vibration feeling in my head but only in the top part where my brain is, it felt like my whole brain was vibrating, kind of gentle though. I would look a bit to the right and left of that corner and it would go away, but would go back to the corner, and it'd come back.\n\nAnother night after that I was trying to sleep but was getting the feeling of being watched again, all the lights were off so it was completely black, I really don't know why I did this but I stood up, walked to the middle of the basement, closed my eyes and started talking. I started talking about how I was just here temporarily, and that I want no trouble, and to please leave me alone. I got another feeling during when I was talking that I was certain that I was being listened to, I don't know by who or what, but I was. Throughout the rest of my stay after that night, I didn't have any feeling of being watched again.\n\n2. My girlfriend's current apartment has a spare room at the front of the place which the hallway of the room and front door is visible to the living room, a very small room for storage. Sometimes when I would spend the night and would be up late alone in the living room, I would get the urge to just look over at the hallway, and every time I look over during this urge I get that same tingly vibration feeling in my brain, that I'm looking straight at something that isn't visible, but this time the vibration isn’t gentle but an aggressive strong vibration, like it almost hurts to look. My eyes would snap to a different but specific spot of the hallway every time the urge happened, like a person normally would for eye contact. There are also some times where I would go to get my shoes from that room, and my eyes would snap to a spot of the blank wall or something inside the room and get the same vibration feeling in my brain. This still happens to this day every once in a while.\n\nIt's not just my girlfriend's places that I get the tingly vibration feeling in my head, it happens at my house, and sometimes at certain friend's houses. It's whenever I get the urge to look in a specific spot that I get the feeling. Again, it's a feeling of certainty, a feeling of knowing I'm looking at someone. Even in my house, I know it's haunted, and sometimes I get the feeling of being watched so I would just start talking out loud towards the spirits, random statements, then it would go away.\n\nI'm not certain that this feeling means I can sense spirits, but I'm open to the idea that I can, just like how I'm open to the idea that I can't. I would just like to hear what people have to say after reading what I've said.\n\nTL;DR: I think I can sense spirits but am not 100%, I just know what I've felt during the scenarios I've explained above^ and it's a very strange feeling. Would like opinions, thanks.",
        "created_utc": 1668982782,
        "upvote_ratio": 1.0
    },
    {
        "title": "Personal Experience",
        "author": "sylvyrfyre",
        "url": "https://www.reddit.com/r/Paranormal/comments/z0gzz5/personal_experience/",
        "text": "Very early on Saturday morning I was lying in bed in that half-awake, half-asleep state when you've just woken up.  As I was lying there I heard what I can only describe as a sound resembling an expression of surprise, as if a person had seen something unexpected.  The sound came from very close by, literally right next to me, as if someone was lying in bed directly by my side.  (I was alone in the room at the time).  Now I know that I didn't make that sound, so I was confused by the event, as I couldn't explain it.\n\nFast forward a few hours and I received a text from my sister telling me that one of my aunts had just died on Saturday morning.  It occurred to me that this explained the sound I heard: because I've received information like that before several times. Each time something like this has happened, I've always (within hours) received notice of a death in the family or of a close friend.",
        "created_utc": 1668982395,
        "upvote_ratio": 1.0
    },
    {
        "title": "Being followed by spirits?",
        "author": "Little_Art8272",
        "url": "https://www.reddit.com/r/Paranormal/comments/z0fs7d/being_followed_by_spirits/",
        "text": "A couple of days ago there was a house explosion and fire, it killed 1 person. The place was leveled, normally things like this don't bother me but I went to get coffee at a local coffee shop up the street the owner who lived across the street from the house that it was pretty traumatic. \n\nAt around 1pm I started feeling like something was trying attach itself to me or get my attention. I started feeling really weird. When I went home my husband said he was in contact with the coffee shop owner who had to go home. The man's spirit came to him and he had to send him away because it was too much.\n\nMy husband was like you need to tell it to go away. So, I went back to work and it seemed to lighten up. I came home and the cats were acting all weird. Things were back to being weird again. When we woke up the next day our dining room light was on. Then in another room a light was flickering. The cat was acting weird towards me and looking at things that weren't there.\n\nThe cats are terrified of me. I don't feel possessed or anything thing but they are sensing something. Today when I got home from church the cat looked at me and hissed. I was like WTF. So I saged the house I'm hoping that helped. This has been a strange couple of days.\n\nAny ideas guys? What the hell... I plan on getting reiki soon to see if that helps with my energy.",
        "created_utc": 1668979529,
        "upvote_ratio": 1.0
    },
    {
        "title": "Younger version of my mom vs current age mom and a door.",
        "author": "Kayleeh0724",
        "url": "https://www.reddit.com/r/Paranormal/comments/z0fk4r/younger_version_of_my_mom_vs_current_age_mom_and/",
        "text": " don’t know if this is the right place to ask this but I had a dream that really freaked me out. In the dream my mom who’s 59 and myself 31, were in our dining room talking and the front door was being opened and I ran to shut it and on the other side of the door was my mom but her younger early 30s self that I remember her being when I was 8 or 9. She was asking me to come with her.. my dad passed away when I was 21 in real life.. it was 10 year anniversary of his death. Idk if it was subconscious.. but the younger version mom was telling me to come with them back to that time of our life and my 59 year old current version mom was behind me begging me to shut the door and not go with the younger version of her. I was torn between going or staying and I chose to stay with my current 59 year old mom and not leave her alone. When I tried to shut the door my young version mom seemed almost possessed and used her strength to keep the door open and I finally shut it on her. I was trying to wake myself up the entire dream but I couldn’t. When I finally could move again and was out of the paralyzed feeling I ran downstairs and told my mom and had a panic attack. My dog was shaking in the dream and when I woke up in real life. What was this? What if I walked out the door with my younger version mom? Was this like an alternate dimension I could have entered? Idk. This one will stick with me though",
        "created_utc": 1668979020,
        "upvote_ratio": 1.0
    },
    {
        "title": "My one year old playing peekaboo at the hospital",
        "author": "plantdoggy",
        "url": "https://www.reddit.com/r/Paranormal/comments/z0e4um/my_one_year_old_playing_peekaboo_at_the_hospital/",
        "text": "I was sleeping in the hospital cot with my 13 month old when he sprung up and started playing peekaboo. He was facing the door but was looking up toward the ceiling since we were low to the ground. Obviously no one was in the room. He went back to sleep almost immediately after 2-3 minutes of play. \n\nNot sure if it was just a random dream, but this really creeped me out 😬",
        "created_utc": 1668975607,
        "upvote_ratio": 1.0
    },
    {
        "title": "I have more and more frequently been seeing tall pitch black figures.",
        "author": "nyxiethemisfit",
        "url": "https://www.reddit.com/r/Paranormal/comments/z0dfic/i_have_more_and_more_frequently_been_seeing_tall/",
        "text": "The very first time I ever saw these things, I was around six or seven years old. My family was camping at some lake in oklahoma, and I saw two strange figures. I was standing outside our camper, alone, and I saw a ghostly white figure (it looked like a preteen girl with long hair and a gown) running into the woods, chased by a tall, thin black figure. I froze and called for my dad, who went into the woods where I saw these, but he saw no footprints or anything.\n\nI moved to a rural property in 2015, and its definitely my home. It's my home. \n\nIn January of 2016 (aged eleven), I was standing outside, and just kind of staring out at the trees on the property. For a solid three seconds, I made \"eye contact\" with this abnormally tall, emaciated, pitch black humanoid. I use quotations around eye contact, seeing as it had no eyes. It was hanging upside down by its knees from a tree branch, its long arms were touching the ground. If I had to guess, I'd say it was around seven to ten feet tall? I felt a deep sense of dread and ran inside to tell my father. When we came back out a few seconds later, it was gone. \n\nI hadnt started seeing them again until recently, starting in september. On september 28th my boyfriend, brother, and I were down the road from my house trying to catch fish at a bridge. I got bored and uncomfy because there were gnats, so I started walking up the road back to my house. I was about halfway there when I saw the figure standing in the center of the road. I froze, it froze, and we stood there for about a minute or two. It was around 9ft tall, and its hands nearly touched the ground. I ran back down to the bridge and waited to walk back home with my brother and my boyfriend. I didnt speak for a solid two hours.\n\nTwo days ago I was closing the blinds to a window my cat enjoys perching at, and one was straight outside the window. It had its face inches from the glass, and it opened its mouth. I don't know why this one had a mouth, but in its mouth was a big bulging eye. i freaked tf out and curled up in my bed. \n\n&amp;#x200B;\n\nToday I saw it peaking around a corner in my livingroom. Im terrified.\n\n&amp;#x200B;\n\nDoes anyone know anything about this?",
        "created_utc": 1668973909,
        "upvote_ratio": 1.0
    },
    {
        "title": "My Best Friend's Cousin Spoke to Me",
        "author": "Jaded-Organization-5",
        "url": "https://www.reddit.com/r/Paranormal/comments/z0c46y/my_best_friends_cousin_spoke_to_me/",
        "text": "So this happened about a year and a half ago (long before I found this sub reddit). My best friend (we'll call her B) and I were sitting on my back patio relaxing and talking. It was a rough day for her as it was the anniversary of her cousin's (we'll call him J) passing. \n\nNow B has had multiple instances of having dreams of certain events before they happen. The night before her cousin died she had a dream of his death. The two were very close, and the evening of his accident she was invited to go out with her cousin and his friends. She turned the offer down and chose to go home instead. While drinking with some friends J and another boy got into an argument and began to fight. Unfortunately this resulted in his passing. (One punch landed just right, exactly how she'd dreamt it.) \n\nYears later she still blames herself for not going and/or not stopping him from going. They were extremely close and the loss hit her very hard. I try my best to help console her when the anniversary comes around, but unfortunately I never actually got the chance to meet J. \n\nBack to that night a year ago. B was reminiscing and again blaming herself for not being there. As she was talking an unfamiliar voice kept repeating a phrase in my ear. \"Take me to the Sun.\" So I stopped her, and I explained what I'd heard. She bursts into tears, smiling, but sobbing uncontrollably. \n\nWhen I asked her what was wrong she told me as story about a time she'd gone fishing with her cousin and some friends. The boys had drank too much and were sluggishly making their way back towards the car. Upon reaching a rather steep hill just before the parking lot J laid down, refusing to move. B of course told him to get up, but J said no. So B asked \"where am I going to take you if you're laying there?\" So J responded, pointing up to the sky, \"Take me to the Sun!\"",
        "created_utc": 1668970714,
        "upvote_ratio": 1.0
    },
    {
        "title": "Father's energy in people ?",
        "author": "Warm-Froyo6139",
        "url": "https://www.reddit.com/r/Paranormal/comments/z0b7ks/fathers_energy_in_people/",
        "text": "ever since my dad died, i have experienced his energy in some new people i have met. it's weird but since he died my life changed in alot of ways. i picked up playing sports and the coach reminds me alot of my dad, features, height, attitude. i feel like my dad is somehow communicating with me through him. \n\n&amp;#x200B;\n\ndoes anyone else experience this?",
        "created_utc": 1668968492,
        "upvote_ratio": 1.0
    },
    {
        "title": "I keep feeling like somones watching me",
        "author": "topg135790",
        "url": "https://www.reddit.com/r/Paranormal/comments/z0an6q/i_keep_feeling_like_somones_watching_me/",
        "text": "I had a few questions on some stuff recently that u guys answered for me(thanks) but this is somthing else. Recently about little less than a week ago I had a nightmare about a home intruder.  I'm not going to go into detail about what happend in it but ever sence then I have felt like somone has been staring at me all the time.  To the point where I can't even not notice it.  My family hasn't been really religious growing up and I used to live in a very haunted house were alot (ALOT) Of shit happend. I was wondering if my past situation had anything to do with it or if I'm just being really paranoid . I keep hearing the sound of metal breaking throughout my day but nothings actually breaking. I keep getting adds about a home security system too",
        "created_utc": 1668967194,
        "upvote_ratio": 1.0
    },
    {
        "title": "Black cloaked floating figure",
        "author": "dawnwn",
        "url": "https://www.reddit.com/r/Paranormal/comments/z0892s/black_cloaked_floating_figure/",
        "text": "Hi guys, new to the sub but experienced quite a few paranormal occurrences. I just wanna describe something I saw as a youth and see if anyone has any clue what it may have been or have experienced the same thing before.\n\nWhen I was about 10 years old, I was out in the front of my house playing because it was getting dark and I wasn't allowed to roam the neighborhood after dark. Our house sat next to an alleyway that led to the adjacent street. When I was playing with a ball, I looked down the alleyway and saw a tall, pitch black figure that appeared much like the grim reaper. Dark hooded figure, no face, so black it was like Vantablack. I noticed it was not a person because it was floating 1-2 feet from the ground. It had to be at least 7 feet tall and filled me with dread. Then it was gone in an instant. For context, I did live in a house with a semi recent murder, drug addicts and poltergeist activity as well inside the house. I never figured out what it was to this day. For additional context, the house burnt down several years later.",
        "created_utc": 1668961454,
        "upvote_ratio": 1.0
    },
    {
        "title": "Strange mark symbol appeared on my tv screen. Images below.",
        "author": "DeafGamerDucky",
        "url": "https://www.reddit.com/r/Paranormal/comments/z07gte/strange_mark_symbol_appeared_on_my_tv_screen/",
        "text": "[removed]",
        "created_utc": 1668959507,
        "upvote_ratio": 1.0
    },
    {
        "title": "My doppelgänger in hotel bathroom",
        "author": "Admirable_Candy2025",
        "url": "https://www.reddit.com/r/Paranormal/comments/z07e9e/my_doppelgänger_in_hotel_bathroom/",
        "text": "This happened last month when me and my son were visiting friends and stopped the night in a Premier Inn hotel on Halloween night. It’s been stuck in my head since and wanted to share. \n\nThe hotel is converted from a very old big textile mill. It has a department store on the bottom few floors and a hotel on the top.\n\nMy son was having a bath and I was relaxing on the bed in the room watching TV. I’d got changed into my pyjamas in privacy while he was in the bathroom. \n\nWhile I was relaxing I heard him shout “Mum!?!” in a kind of, ‘what the hell are you doing walking in on me in the bathroom’ way! Then a second really scared sounding “Mum!!”.\n\nI quite grumpily got off the bed, walked in the bathroom and put my hands on my hips looking at him and asked whatever was the matter?\n\nThat’s when he really looked frightened. He said he’d seen me come in the bathroom and stand there hands on hips in my distinctive pyjamas and he’d been cross I’d walked in on him, so he’d shouted “Mum!?!”, then I’d disappeared. Then when he freaked out and called me the second time, I’d now come and was stood there exactly like he’d seen me do a minute before. Except this time I was real.\n\nI’ve no idea what happened and I didn’t feel the place was creepy at all though I suppose it’s a very old building. The pyjamas were ones I never normally wear as they’re too warm so it’d be strange for him to have even imagined me in them. It was an exceptionally huge L-shaped hotel room and the bed I was on was way round the corner from the bathroom. The bathroom door was shut but not locked and there’s no way he could’ve seen me in my pyjamas and mistakenly thought I was stood right by him hands on hips.",
        "created_utc": 1668959340,
        "upvote_ratio": 1.0
    },
    {
        "title": "things breaking in my house",
        "author": "kabosstheguy",
        "url": "https://www.reddit.com/r/Paranormal/comments/z02ryk/things_breaking_in_my_house/",
        "text": "for more than 3 weeks,a lot of things in my house keep breaking,most of them were accidental but this one batted an eye. i was chilling with my brother while my mom was sleeping when suddendly something punches the bathroom mirror so hard,the whole thing that had the mirror completely collapsed. no one was in the bathroom,any idea?",
        "created_utc": 1668946872,
        "upvote_ratio": 1.0
    },
    {
        "title": "Felt entity merge into my body. what Is happening?????",
        "author": "Nikthetripper",
        "url": "https://www.reddit.com/r/Paranormal/comments/z01tvw/felt_entity_merge_into_my_body_what_is_happening/",
        "text": "So yesterday I posted about an entity waking me up around the same time calling my name saying \"Nik. Don't move\" 'Nik. don't move I won't hurt you.\" And tonight I was awoken again at around the same time and he came and touched me and it felt warm and loving and I just surrendered to it and next thing the entity did was merge into my face I felt him go inside of me and I woke up. It felt so vivid again. What is happening?? i am so confused.",
        "created_utc": 1668943751,
        "upvote_ratio": 1.0
    },
    {
        "title": "heard voice calling my name early this morning.",
        "author": "topg135790",
        "url": "https://www.reddit.com/r/Paranormal/comments/z00qlc/heard_voice_calling_my_name_early_this_morning/",
        "text": "Check out my other post for more details but basically very early this morning I heard my ne being called by a female voice from very far away. Around a football field.  My house Is surrounded by a small forest . Recently for the past week or so I have felt like somone has been watching me. It doesn't matter were I am I always feel this . After I had a nightmare about a home intrude I cant quite seem to get the feeling off my back. Idk if this is related to my current situation",
        "created_utc": 1668939804,
        "upvote_ratio": 1.0
    },
    {
        "title": "Looking for info on haunted items in The Traveling Museum of Paranormal and Occult",
        "author": "Pretty-Witness-5774",
        "url": "https://www.reddit.com/r/Paranormal/comments/yzzlay/looking_for_info_on_haunted_items_in_the/",
        "text": "I'm currently looking for the list of all items including pics and the files on objects within The Traveling Museum Of Paranormal and Occult. It only has a few items on the web page. Thanks:)",
        "created_utc": 1668935345,
        "upvote_ratio": 1.0
    },
    {
        "title": "Am I being haunted?",
        "author": "Gamernerd200",
        "url": "https://www.reddit.com/r/Paranormal/comments/yzydge/am_i_being_haunted/",
        "text": "[removed]",
        "created_utc": 1668930586,
        "upvote_ratio": 1.0
    },
    {
        "title": "Signs of a skinwalker or something else???",
        "author": "scaredshitless04",
        "url": "https://www.reddit.com/r/Paranormal/comments/yzyah5/signs_of_a_skinwalker_or_something_else/",
        "text": "So my friends and I went out cruising the country roads of Nebraska late at night. We stopped at the   entrance of a feild to gaze at the stars. With two of us sitting in the windows of my car and one standing outside of the car. We were enjoying the view and the sound of the coyotes yelping and hollering in the distance. When suddenly the coyotes went silent. It was dead quiet around us until the sound of footsteps on the hollow, dried corn stalks from the feild behind us broke the silence. The steps were steady and consistent, thump thump, and very clearly two legged. We panicked and yelled for everyone to get into the car. While we all rolled up the windows and I started my car, the footsteps remained steady, thump thump. While I drove way, we all looked around to see what was coming towards us, but we were met with nothing. We didn't see anything in that feild, or anything around us at all. We started to rule out what it should have possibly been. It couldn't have been the deer that we passed right before this experience because deer are too graceful to make those thumps, plus they are four legged. If it was just a person, then why didn't they call out to us, why didn't we see them when we drove pass, and if they had malicious intentions,  then why didn't they charge after us when we were yelling for all of us to get into the car? What did we just experience? Was it a skinwalker? Are they even in Nebraska???",
        "created_utc": 1668930257,
        "upvote_ratio": 1.0
    },
    {
        "title": "This made me believe in the afterlife 100%",
        "author": "kiwigirl83",
        "url": "https://www.reddit.com/r/Paranormal/comments/yzx4vv/this_made_me_believe_in_the_afterlife_100/",
        "text": "[removed]",
        "created_utc": 1668925799,
        "upvote_ratio": 1.0
    },
    {
        "title": "Extremely bright orange light outside my window in the middle of the night",
        "author": "LowKeyAidan",
        "url": "https://www.reddit.com/r/Paranormal/comments/yzwe3p/extremely_bright_orange_light_outside_my_window/",
        "text": "\n\nIn my teenage years, my room was in the upstairs portion of our house. It was technically the “finished” portion of our attic, and was the only thing on the upper floor, but it was very small. My room was shaped like an L and only had one window at the long end of the L. My bed was in the corner of the L, facing the short end of the L, but you could obviously still see the window. Directly outside my window was a huge tree and then the side of our neighbor’s roof, which essentially block all view.\n\nOne Friday night, in the fall, I suddenly woke up around 2-3 AM. My sleep schedule was out of wack, so it wasn’t uncommon for me to wake up at this hour, but this time was different. I felt like I was almost half awake and half asleep, but was very much aware of what was happening around me. What had woke. Me up was a low, humming noise that seemed to be rattling my insides. I woke up facing the wall. That’s when I realized that my wall was completely soaked in an orange light, which immediately alarmed me. Because of the direction my window faced, it was impossible for any lights from the street to be pouring in through my window, let alone at this intensity. My neighbors backyard light was not this color either, and whenever it was on it was never this bright. I nervously turned around, and saw a massive orb of orange light directly outside of my window. It seemed to be emitting the humming noise I was hearing. It was so bright, at first I thought that maybe the house next to me was on fire or something, but after staring for a moment I began to make out the circular shape. It took up the entirety of my small window and was shining so intensely that it lit up the entire long portion of my L-shaped room. After staring for maybe 20 seconds I felt my stomach drop. My brain had finally caught up and realized that it wasn’t a street light, wasn’t my neighbors, wasn’t the sun, and couldn’t even possibly be someone on the ground outside because of how bright it was. I threw the covers over my face and cowered like a baby. I don’t know if it actually became louder, but it felt like the humming got louder. I just slammed my eyes shut. I don’t remember falling asleep, but I do remember not wanting to get out of my bed when I woke up in the morning. I was so shook that my legs were shaking as I eventually walked down the stairs. I didn’t tell any of my family members about this because they wouldn’t have believed me. To this day, that was the strangest and most unexplained thing that’s ever happened to me. I’m unsure of my belief in the paranormal, but I didn’t know where else to share this. If anyone has had any similar experiences feel free to comment down below. Thank you for reading.",
        "created_utc": 1668923094,
        "upvote_ratio": 1.0
    },
    {
        "title": "I Lived In A Haunted House for 3 Years",
        "author": "Jd11347",
        "url": "https://www.reddit.com/r/Paranormal/comments/yzw0yd/i_lived_in_a_haunted_house_for_3_years/",
        "text": "The summer between my 7th grade and 8th grade year my family switched houses and we moved one city over. It was the end of summer and the day before school started was the first day we had moved into the house permanently after completing all the renovation and getting all of the utilities up and running. It was about 10:30 PM I was laying in bed trying to sleep before school the next day. Everyone in the house was also in bed for the night. I started to hear the sound of footsteps walking on the roof above my bedroom. Just a few steps at a time, and then the sound would stop for a while before starting again. If you have ever been in a house when someone is walking on the roof it is a very distinct sound. At first, I thought that I was crazy. There wasn't any logical reason for someone to be walking on my roof late at night. I wrote it off as the wind that was blowing a tree branch from a nearby tree onto the roof. I know that the sound of a tree branch hitting the roof doesn't match up with the sounds of walking on a rooftop, but it was the only logical conclusion that I could make. \n\n&amp;#x200B;\n\nI thought about this for a few minutes and looked at my window. There was a shear curtain over it and the outside porch light cast the shadows of the nearby tree onto it. I decided that I would watch the curtain to see the wind blowing the tree in time with the sound to confirm that it was just the tree. The footsteps started again a few minutes later and no shadows from the tree moved on the curtain. In fact it was not windy outside at all. I got up and woke my parents up. We all went outside with flashlights looking around the roof. Nothing was there. Also, the tree near the house came nowhere near close to touching the roof. I went back to bad and tried to get some sleep. It wasn't easy because the footsteps kept coming and going.\n\n&amp;#x200B;\n\nThis sound happened on a pretty regular basis. Not every night, and not for a long time, but a few foot steps at a time and with or without wind present. After living in the house for about 3 months my brother and I had made friends with the neighbor kids across the street. One day their mom was talking to my mom and my mom asked if she knew the people who lived in the house before us. The neighbor mom told my mom that it was an old lady who lived in the house alone. One day she went up onto the roof (right above my bedroom) and she fell off of the roof, broke her neck, and died.\n\n&amp;#x200B;\n\nThis wasn't the only thing that happened. Over the 3 and a half years that I lived in that house many strange things happened. The telephone would ring with an abnormal ring in the middle of the night, if you answered there was nothing there. No dial tone, no sound, just nothing as if the phone was unplugged. Maybe just a buggy phone line because the house was old, but it was still creepy,\n\n&amp;#x200B;\n\nAnother time I woke up in the middle of the night, barely awake and I see my collection of Micro Machine jets floating around the room in a circle. I'm delirious with sleep and just called out: \"Knock it off!\" they all floated back over to the dresser where they belonged. I went back to sleep. The next morning when I woke up and walked over to the dresser the Micro Machines were all there but they were not all lined up in a neat row like they should have been, but strewn about and some of them were flipped over. \n\n&amp;#x200B;\n\nBy the time I was in the 10th grade my friend Gabe would come over to spend the night at my house. I told him that my house was haunted as I did anyone that spent the night. The ghost never bothered to show itself for anyone except Gabe. It had some sort of thing for him. IDK if it liked him or didn't like him. Anyways, Gabe and I are in the living room listening to music. I came out of the kitchen with a glass of water in my hand, take a drink from it, and set it down gently on the table next to me. The glass shatters outward into several pieces. I didn't smash it down hard, and it didn't have any crack in it, but when I say that it shattered outward, I mean it shattered with force and not just crumbled from me setting it down because of some unseen crack. Gabe, freaked out and I just said: \"I told you dude. My house is haunted.\" \n\n&amp;#x200B;\n\nThe last part of my story involves Gabe. Gabe and I were in the house again all alone. All of the windows were closed and we were sitting in the living room watching TV. We hear this creaking sound coming from the end of the hallway and look down the hallway. At the end of the hallway is a cabinet door that covers the hot water heater. This door was opening very slowly and we both sat there and stared at it in silence as it completely opened. It stopped at completion for maybe one second, before it slowly started to close again. By slowly, I mean it took about 5 seconds each time to open and close. Gabe was fully freaked out by this and vowed to never come over to my house again.\n\n&amp;#x200B;\n\nAnyways that's my story. I don't think that the spirit that lived there was malevolent in any way. I just think that it wanted attention. Maybe the lady who lived there before us had her spirit imprinted on the location at her death. I moved to another town in my JR year of high school and I haven't had any kind of encounters like that since. Whatever was happening at that house, stayed at that house.",
        "created_utc": 1668921792,
        "upvote_ratio": 1.0
    },
    {
        "title": "Arabic Prayer ID?",
        "author": "pomalways0716",
        "url": "https://www.reddit.com/r/Paranormal/comments/yzvljy/arabic_prayer_id/",
        "text": "While watching different videos on ghost hunters all around the world, my\nfriend and I noticed a common prayer being used in what we believe is Arabic. The explorers will typically use this several times in succession when they feel they have encountered something. Does anyone know what this prayer may be? I’m sorry for not having better information, but it’s hard to describe.",
        "created_utc": 1668920369,
        "upvote_ratio": 1.0
    },
    {
        "title": "my friends dad passed and my dreams are weird",
        "author": "LongjumpingSmoke5605",
        "url": "https://www.reddit.com/r/Paranormal/comments/yzvc0v/my_friends_dad_passed_and_my_dreams_are_weird/",
        "text": "this is a very odd thing but most likely a way of coping? so my best friend of 13 years her dad passed away this october. i go to school in arizona and are originally from the east coast, so i flew home for his funeral. he basically watched me grow up, i would walk to her house everyday (we live a 30 second walk from each other) and spend days upon days together. he drove us places and stuff extremely devastating loss and this is a really personal loss of mine since i’ve never had someone this close to me pass away. after all the services and stuff i flew back to arizona and a few days later i started having dreams of my own dad dying and all of us being there but the weird part is i kind of remember her dad being in the back of the funeral home standing there watching all of us with his arms crossed. no one approached him, everyone acted like he wasn’t there even i did but i saw him, he was also in the same suit as he was in the casket and holding his rosary beads. is this paranormal related or just a way of my brain is coping?",
        "created_utc": 1668919458,
        "upvote_ratio": 1.0
    },
    {
        "title": "Strange Happenings in Home",
        "author": "SpaceCat446",
        "url": "https://www.reddit.com/r/Paranormal/comments/yzuth6/strange_happenings_in_home/",
        "text": " \n\nMy boyfriend has, on multiple occasions, claimed to see or hear stuff. He has issues with paranoia so we weren't quick to think something was actually there. However, one night while we were on the couch together I had positioned myself on his lap and caught a glimpse of a shadowy figure behind him in the hallway. I immediately got off of him and explained what I saw. He got up and stood in the hallway and asked if this was where I saw the figure. I said yes and he admitted he's been seeing it too.\n\nIn his bedroom we found a long black strand of hair. it's not tied together anywhere and is about four feet long. He is not cheating. We do not know anyone with hair that long. He currently has it taped to his wall as proof of something weird going on.\n\nHe claims he fell asleep in his bedroom and has woken in the living room on the couch. Only has happened once. I've never seen him sleepwalk. On this same occasion he described having strange nightmares and upon waking he saw a figure crouched by the bed staring at him inches away from his face. He says he threw a punch at it but no contact was made and it quickly disappeared. Perhaps that was something similar to sleep paralysis?\n\nHe has LOTS of weird nightmares. Mostly about the same humanoid creatures.\n\nWhile I was writing this he texted me saying it looked like someone had walked in front of the light inside the garage. he says it absolutely wasn't a flicker and the cats were in the house. (there's a screen door to the garage visible from the couch). The entrance to the attic is in the garage.\n\nWhile on the toilet he says he was watching something on his phone when he heard a scream coming from the spare bedroom. he says it was a man's scream, almost animalistic, and practically shook the walls. He says he was terrified and immediately left the bathroom and ran outside, he had to pass the bedroom on his way out though and says it sounded like something was following him,\n\nHe says sometimes he hears a loud ringing and the cats react to it too. I cannot find the source of the ringing he hears and am not home when he hears it.\n\nAbout 6 months ago he'd tell me about a man he'd see in the home. He described him as an old naked man that would stand facing the corner then disappear. He's convinced he's an omen and a death or bad event always follows.",
        "created_utc": 1668917694,
        "upvote_ratio": 1.0
    },
    {
        "title": "I was interested until it scared me",
        "author": "Gloomsoul",
        "url": "https://www.reddit.com/r/Paranormal/comments/yzud8h/i_was_interested_until_it_scared_me/",
        "text": "So I recently read a small article about how 2% of children report hearing voices that aren't actually there. It made me start thinking back to my childhood. I remember hearing voices nobody else could as a 90s kid. Many occasions I would wake up in the middle of the night because I would hear things going on in my house. I would hear people speaking as if they were on a Chat show like Maury, or Jerry Springer. I could never make out the words they were saying, but I could basically hear muffled speaking followed by laughter. I have more stories about this kinda shit that please let me know if anyone else has experienced this kinda stuff",
        "created_utc": 1668916177,
        "upvote_ratio": 1.0
    },
    {
        "title": "3 knocks on my bedroom door.",
        "author": "MarBeca",
        "url": "https://www.reddit.com/r/Paranormal/comments/yzuard/3_knocks_on_my_bedroom_door/",
        "text": "I have lived in my 79 year old home for about two years now. I have sensed something here. It's not evil or ominous, just there. It feels like a male presence.I have used those stupid tiktok wing filters and it recognized something, as has my SLE detector. The one SLE video I go that was a perfect human shape, happen to be unable to watch after the first three times of viewing. No other videos had that problem. I used the detector after seeing a shadow whiz by my bedroom door.  Then the other morning at about 245am I woke to 3 loud distinct knocks on my bedroom door. They were loud enough to jolt me awake, though I am a very light sleeper. I opened the door and nothing was there. I decided to tell my mom about it the next morning and she told me that when she was house sitting, sleeping in my room, she had the same thing happen but she was awake at the time. Three loud knocks. Has anyone experienced anything of the sort or know of it is a way of spirit communicating? I want to add that I work from home and I often hear things from upstairs moving. It doesn't make me afraid, just aware and like I'm being watched at times.",
        "created_utc": 1668915950,
        "upvote_ratio": 1.0
    },
    {
        "title": "I got cockblocked by a ghost",
        "author": "Creative-Difference3",
        "url": "https://www.reddit.com/r/Paranormal/comments/yzte7g/i_got_cockblocked_by_a_ghost/",
        "text": "If you guys saw some of my last posts I’m dealing with a demonic entity that I’m struggling with. It’s been really stressing me out knocking on stuff throwing glasses playing music on unplugged radios ect and is basically driving me nuts. It’s gotten to the point where I have a dollar store squirt gun filled with holy water I shoot at the orbs and apparitions that pisses it off more and more daily but back to the main story. \n\nI have been talking to this person for a while and decided to ask them over to hangout. Ironically enough we were watching the conjuring series when it started. We were cuddling and watching the movie when there was this tapping that started on the wall above our heads. She kept saying “op what is that?!?” Over and over I didn’t wanna say the truth so I said we have issues with animals even though we don’t. It stopped and she started to calm down, I had a candle lit on my table near the tv and it started rapidly flashing which I had never seen a candle do before we couldn’t even watch the movie after that. we still kept it on and she wasn’t so much freaked out by this but more weirded out. I wanted to calm her down so I went down to make her food. Abt 15 minutes goes by and she comes down pale faced saying she was hearing whispers and saw black orbs dancing around my room I told her the little fountain I had can sound like whispers sometimes and the orbs are probably just your eyes playing tricks on you because you’re scared. We went back up ate and watched a non scary movie I cheered her up but I don’t have the heart to tell her what she saw and heard was real and that I’m the haunted one not my house. I feel so bad I really like her and don’t know what to do I’m kind of at a loss.",
        "created_utc": 1668913059,
        "upvote_ratio": 1.0
    },
    {
        "title": "a ghost in my room was playing animal crossing",
        "author": "bunnifangz",
        "url": "https://www.reddit.com/r/Paranormal/comments/yztao8/a_ghost_in_my_room_was_playing_animal_crossing/",
        "text": "this was quite a bit ago, somewhere around a year or such, so bare with me (lol). im like a really heavy sleeper and it takes a shit ton to wake me up at night. well one night i woke up in the middle of the night to hear like that animal crossing new horizons start up screen music, and still being half awake i was confused but also a little unsettled. i kind of woke myself up some more and heard those walking in the grass sounds in acnh. i was still so confused but especially so when i saw the tv that was connected to my switch wasnt on the start up screen anymore and it was my character like actually walking around. i immediately was fucking terrified and got up and as soon as i got up it turned off. i ran out of my room slept in a different room that night. looking back, i honestly think the spirit just wanted to chill and i just panicked due to tiredness.",
        "created_utc": 1668912733,
        "upvote_ratio": 1.0
    },
    {
        "title": "House suddenly haunted",
        "author": "SubversiveCommando",
        "url": "https://www.reddit.com/r/Paranormal/comments/yzr7xc/house_suddenly_haunted/",
        "text": "First of all, I'm a sceptic, but with recent events, I'm not sure where else to turn to.\n\nThe house was built by the original owners, elderly, but, as far as I know, still alive, around 1970. \n\nThe day we moved in I (12 at the time) was incredibly ill, I didn't want to move here, the woods and the garden that transitioned into them, gave me the creeps. I still remember that night, I didn't even tell anyone I was ill, felt like I was gonna die at the time but I was fine. The house was mostly quiet. \n\nAcross the street, an American family moved in. One daughter was a satanist, and before she even told me, I'd see all the curtains moving, and glowing balls of light when nobody was home.\n\nBut our house was fine until recently. My mental health took a bad turn (OCD, nightmares, anxiety, sleep paralysis demons (which i dont count as paranormal)). and I was (am) on prozac, which numbs me to everything. Recently things started happening. It does not scare me. Probably because I'm on meds, but still it's odd. I'd dream of demonic entities attacking me, and messing with my dreams. They would fly away towards the smoke alarm outside my room when I woke, and it would go off. We've turned it off now. My dog would go crazy, barking at like 3am which he never has before. During the day, things would fly off counters. Things like plugs, knifes. Stuff that shouldn't move by itself. Our garden faces the woods. We put Halloween masks on some homemade mannequins. One, with a demon mask, would move almoat every night facing a new direction. Could be people crossing the stream onto our property, but still weird.\n\n\nWe have a very heavy front door, parents lock it every night. After I'm asleep usually, but it's always unlocked and open in the morning. \n\nThere are many other things I won't mention here. If there is something, it certainly loves playing tricks and causing fear. My fear is something demonic. I'm not religious but we have alot of self-proclaimed satanists here. Many have been attractive girls my age who seem... not themselves, taken over. Again, I don't believe in it, but something is up. And, if this stuff is real, I figure someone here may have advice.",
        "created_utc": 1668906190,
        "upvote_ratio": 1.0
    },
    {
        "title": "I think my grandfather came to see me",
        "author": "dirtdobber_205",
        "url": "https://www.reddit.com/r/Paranormal/comments/yzqr8n/i_think_my_grandfather_came_to_see_me/",
        "text": "I don't really know if this belongs here, and this is really the only experience I had that I couldn't really explain. About a week and a half ago my grandfather on my dads side of the family finally passed. He had already passed away a long time ago, sometime when I was in middle school he became a hollow man with the lights on, but no one home. When he was there he loved his grand children, and loved bonding with us, especially me. I was the more sporty one, and we connected with that, and bonded.\n\nThe night he passed I woke up in the middle of the night with a warm fuzzy familiar feeling. I didn't feel alone. The room was filled with his scent, and I started to tear up. I didn't think him passing would make me cry, because I already did when I realized he no longer knew who I was. But this feeling made me cry, the smell, the familiar warm feeling. It was really weird.\n\nI told my dad about it, and he started tearing up and said \"yeah buddy he definitely visited you before leaving our world. I bet he visited all his family before seeing the rest.\" I am still iffy on paranormal things, and I'm trying to think of anything it could've been, but I'm blank. I really think he came to say the goodbye he never was able to say. I love you so much Papa Jefe",
        "created_utc": 1668904836,
        "upvote_ratio": 1.0
    },
    {
        "title": "No Fortune in a Fortune Cookie",
        "author": "David11648",
        "url": "https://www.reddit.com/r/Paranormal/comments/yzqr6q/no_fortune_in_a_fortune_cookie/",
        "text": "[removed]",
        "created_utc": 1668904831,
        "upvote_ratio": 1.0
    },
    {
        "title": "The Natural Satellite: The Engine of a Film (God, Reality and Art)",
        "author": "MajorFault8734",
        "url": "https://www.reddit.com/r/Paranormal/comments/yzop3d/the_natural_satellite_the_engine_of_a_film_god/",
        "text": "[removed]",
        "created_utc": 1668898991,
        "upvote_ratio": 1.0
    },
    {
        "title": "I think our homes old owner never left",
        "author": "Icy_Ad9595",
        "url": "https://www.reddit.com/r/Paranormal/comments/yzno25/i_think_our_homes_old_owner_never_left/",
        "text": "Hi there I live in a fairly old home, not too old but still old compared to other houses in my area. It’s one of those houses that still have those ugly giant brown gas powered heaters. There’s a few small instances that made my family and I feel like the past owner never left. It was an elderly man with a few kids and after he passed his kids rented this house to us. One of the first thing I noticed is the footsteps at night, we have a crawl space so the floor is very squeaky. During quarantine I would stay up very late and sometimes I’d hear footsteps outside my door but I ignored it thinking it was my family maybe waking up to use the restroom. But then it started happening when I was home alone, very heavy and slow foot steps outside my door. I was never scared of this but it always freaked me out a little. Another incident was when our family were relaxing in the living room, we had a metal door and a wooden door. The metal door was closed and locked and the wooden door was open because it was hot. The wooden door has two locks the one on the door knob and a hard one you have to twist on top of it. The wooden door suddenly closes and the top lock was locked. The last major thing I can think of was when I washing dishes at night. I heard footsteps behind me, I thought it was my step dad trying to scare me. The steps got faster and I felt two hands grab my shoulder and I could feel someone huff on my neck. I turned around to tell my dad I knew it was him but was surprised to see no one was behind me. We have so many more little bizarre things that happen in this house. This isn’t my first encounter and I have a few more stories from other homes I’ve lived in especially when I use to live in the phillipines island. Just wanted to share and I might share more, thank you for reading :)) (also idk what flair to use for this, sorry)",
        "created_utc": 1668896155,
        "upvote_ratio": 1.0
    },
    {
        "title": "My experience with a vampire",
        "author": "Odd_Bu115h1t_Ch13f",
        "url": "https://www.reddit.com/r/Paranormal/comments/yznezq/my_experience_with_a_vampire/",
        "text": "(This is a reupload without the link to the bitemarks. If this post needs to be removed because it doesn't meet the rules, please let me know why. I just want to share my experience.)\n\n \n\nI want to get my experience out there because I've been going through this but feel there is no one I trust enough to talk to. I'm also using an account I don't use very often for the sake of privacy. I am a 23 y/o woman and this is my experience with a vampire.\n\nIn 2020, a vampire started visiting me at night and he has bitten me multiple times. It all started around the same time that the pandemic started ramping up and everything was going into lockdown in the US. At first, I was having dreams about a man who wanted to come into my apartment. One night, in one of these dreams, I recall making sure all the doors were locked for the night before going to bed and I looked out my porch window to see a tall dark figure with glowing red eyes standing at the door - I didn't know him or what he wanted, but I could sense that he damn-well wanted to be let in. I then woke up in a sweat screaming, \"No!\" which also woke up my then boyfriend lying next to me and our roommate in the other room.\n\nIt was in June 2020 that I discovered the bitemarks (I have photos of the bitemarks, but this thread won't let me post them.) By that time, though, I already had a few sets of them on the right side of my back. They look like two little red dots slightly larger than pin pricks and about 1-1.5 inches apart. However, at first, I wasn't even sure if it was a vampire, but it kept happening. Then, one night, I was dreaming about fighting someone - a lunatic who had broken loose from an asylum. In the nightmare, I was able to beat him by cutting his arm with a pair of scissors I found and then I woke up... I was lying on my back and felt this weight on me like someone was lying on top of me. My head was turned to the right at first, so I turned my head to look up and I started trying to push whatever was on top of me off, but it was extremely strong. It was a man with glowing red eyes - he snarled at me and we locked eyes for a time, all the while I was pushing him, and he eventually pulled up and sort of faded into the darkness. I turned to check on my boyfriend next to me, and he was sound asleep (and so I knew for sure that it wasn't him lol). The next day, I found bloodstains on my pillow and the same type of marks on the left side of my neck. I also recall a dream where he was wanting to get to me through the window next to my bed. At first, he was just knocking at the window, but then he was somehow able to \"phase through\" the glass and he grabbed my foot and tried to put it up to his mouth, but I struggled with him to pull it away; the same thing happened again with my hand.\n\nEvery evening on the nights he would later come to \"visit\" me, I would have these sexual visions/daydreams about him and then later I would become extremely tired, kind of like as if in a stupor. Now, I'm almost sure he was causing it. I feel like we had some kind of telepathic connection since he was biting me. I also eventually started craving mint and I was feeling really weak, so I might have been anemic - my boyfriend's mom who's in healthcare even noticed me/how I was acting and asked if I had anemia.\n\nIn October 2020, he stopped visiting me, and his last bite was on the inside of my lower right thigh. This happened after I tried telepathically asking him if he wanted to kill me and I felt like he responded, \"I couldn't bear the thought of killing you.\" I thought he was gone for good, but he came again in July 2022. That time, I had a dream that he had been standing outside my window peering in, then he seemed to disappear, but when I turned back to look in my room, he was standing in the corner. He was extremely tall, pale, and thin, and in all seriousness he seemed to be naked. I also saw his face, and it's kind of hard to describe, but it felt like staring at a predator like if you locked eyes with a big cat out in the wild at night - just straight up primal fear. At first, I honestly thought he was an alien or something (like the grays) because he was just so \"unhuman\", but I think he really is a vampire. I then woke up gasping from the intense sensation of fear, and I looked around the room but he was gone. I found out the next morning that he had bitten my left shoulder blade. (Again, I have pictures, but can't post them for some reason - any ideas on how to upload them?) A few nights later, I'm sure he came back again and slammed on my window for a solid 10 seconds or so, waking me and my ex-boyfriend (we still live together and sleep in the same bed) - I think he vampire was frustrated... I feel like he was hoping that I would have been alone.\n\nEvery single time I have seen him, I am filled with an inexplicable sense of dread. What I mean by this is I'm not really consciously afraid of him, but it's like I can sense him/his aura and it's terrifying. For whatever reason, though, I don't feel like he actually wants to hurt me or kill me - he would have done so already. At this point, I don't know what is going to happen, but I can still sense him.",
        "created_utc": 1668895466,
        "upvote_ratio": 1.0
    },
    {
        "title": "The most terrifying night of my life, and the reason I’ll never sneak out again.",
        "author": "-JasonOfArgos-",
        "url": "https://www.reddit.com/r/Paranormal/comments/yznbw9/the_most_terrifying_night_of_my_life_and_the/",
        "text": "Context: I am male, 18 years old, a senior in high school. This takes place when I was around 12 years old and is probably the most terrifying night of my entire life.  My name is James. My friend is called Jesse, he’s around 4 months older than me, but that’s unimportant.\n\nIt was the year 2016, summer vacation had just started, and I was living my best life on Fallout 4. Jesse’s distant grandma, that he actually never met, had passed away the week before and so his parents were out of town. My mom said he could stay with us while his parents sorted things out in their hometown. Jesse was staying in my room with me, which we loved. We had been the best of friends for as long as I can remember, and we still are. So, as all teens or pre-teens do, we were intent on sleeping as little as possible each and every night.\n\nOne night we decided what we were going to sneak out, not for any malicious purposes, for some reason we just liked the thrill of knowing that we had been wandering around my block while my parents were asleep and didn’t know we were out. My parents were usually too preoccupied with my older brother and sister since we found out my sister was pregnant. It was probably 1, maybe 2 am when Jesse and I finally got out. We went to the local park and just chilled there for a while. That’s when we heard something that still sends shivers down my spine whenever I think of it. A woman’s scream, and it didn’t sound like it was that far away from where we were.\n\nImmediately, I regretted sneaking out and thought we should run back home. But Jesse wanted to investigate, he said he was worried that someone was getting hurt. And so, I reluctantly agreed to search for the source of the scream. We thought the scream came from the other side of this small forest, but we were too afraid to walk through it and so we walked around the edge of the treeline. That’s when we saw a woman crouched over something up ahead. She was facing the other direction, and Jesse called out “Ma’am, are you okay?” She stood but didn’t turn to face us and didn’t respond either. Her hands looked bloody. We slowly moved towards her, “Ma’am, did you scream? Are you alright?” Jesse said, lightly poking her back.\n\nShe turned to us and vomited up a liquid, it was dark brown and smelled like rusty metal. Even worse there was something moving inside the vomit, maggots, I think. We just froze, neither of us had any clue what to do. She looked at us with her gaunt face and cloudy eyes, pushed me with surprising force and just ran into the forest. That’s when we saw a rotten dead deer with bite marks. She had been eating the rotten raw deer, and seemed like she had been tearing it apart with her hands. How this was even possible, I have no clue.\n\nWe just looked at each other and ran home. We were so scared that we didn’t sleep at all that night. Whoever she was, we never saw her again. Never heard any reports of a crazy woman being found living in the forest, nothing. We still don’t understand what we saw, but all I can say is I’m thankful she didn’t seem to want to harm us.",
        "created_utc": 1668895241,
        "upvote_ratio": 1.0
    },
    {
        "title": "My Ongoing Encounters with a Vampire",
        "author": "Odd_Bu115h1t_Ch13f",
        "url": "https://www.reddit.com/r/Paranormal/comments/yzmmq8/my_ongoing_encounters_with_a_vampire/",
        "text": "I want to get my story out there because I've been going through this but feel there is no one I trust enough to talk to. I'm also using an account I don't use very often for the sake of privacy. I am a 23 y/o woman and this is my story about my encounters with a vampire.\n\nIn 2020, a vampire started visiting me at night and he has bitten me multiple times. It all started around the same time that the pandemic started ramping up and everything was going into lockdown in the US. At first, I was having dreams about a man who wanted to come into my apartment. One night, in one of these dreams, I recall making sure all the doors were locked for the night before going to bed and I looked out my porch window to see a tall dark figure with glowing red eyes standing at the door - I didn't know him or what he wanted, but I could sense that he damn-well wanted to be let in. I then woke up in a sweat screaming, \"No!\" which also woke up my then boyfriend lying next to me and our roommate in the other room.\n\nIt was in June 2020 that I discovered the bitemarks (I have photos of the bitemarks, but this thread won't let me post them.) By that time, though, I already had a few sets of them on the right side of my back. They look like two little red dots slightly larger than pin pricks and about 1-1.5 inches apart. However, at first, I wasn't even sure if it was a vampire, but it kept happening. Then, one night, I was dreaming about fighting someone - a lunatic who had broken loose from an asylum. In the nightmare, I was able to beat him by cutting his arm with a pair of scissors I found and then I woke up... I was lying on my back and felt this weight on me like someone was lying on top of me. My head was turned to the right at first, so I turned my head to look up and I started trying to push whatever was on top of me off, but it was extremely strong. It was a man with glowing red eyes - he snarled at me and we locked eyes for a time, all the while I was pushing him, and he eventually pulled up and sort of faded into the darkness. The next day, I found bloodstains on my pillow and the same type of marks on the left side of my neck. I also recall a dream where he was wanting to get to me through the window next to my bed. At first, he was just knocking at the window, but then he was somehow able to \"phase through\" the glass and he grabbed my foot and tried to put it up to his mouth, but I struggled with him to pull it away; the same thing happened again with my hand.\n\nEvery evening on the nights he would later come to \"visit\" me, I would have these sexual visions/daydreams about him and then later I would become extremely tired, kind of like as if in a stupor. Now, I'm almost sure he was causing it. I feel like we had some kind of telepathic connection since he was biting me. I also eventually started craving mint and I was feeling really weak, so I might have been anemic - my boyfriend's mom who's in healthcare even noticed me/how I was acting and asked if I had anemia.\n\nIn October 2020, he stopped visiting me, and his last bite was on the inside of my lower right thigh. This happened after I tried telepathically asking him if he wanted to kill me and I felt like he responded, \"I couldn't bear the thought of killing you.\" I thought he was gone for good, but he came again in July 2022. That time, I had a dream that he had been standing outside my window peering in, then he seemed to disappear, but when I turned back to look in my room, he was standing in the corner. He was extremely tall, pale, and thin, and in all seriousness he seemed to be naked. I also saw his face, and it's kind of hard to describe, but it felt like staring at a predator like if you locked eyes with a big cat out in the wild at night - just straight up primal fear. At first, I honestly thought he was an alien or something (like the grays) because he was just so \"unhuman\", but I think he really is a vampire. I then woke up gasping from the intense sensation of fear, and I looked around the room but he was gone. I found out the next morning that he had bitten my left shoulder blade. (Again, I have pictures, but can't post them for some reason - any ideas on how to upload them?) A few nights later, I'm sure he came back again and slammed on my window for a solid 10 seconds or so, waking me and my now ex-boyfriend - I think he was frustrated... I feel like he was hoping that I would have been alone.\n\nEvery single time I have seen him, I am filled with an inexplicable sense of dread. What I mean by this is I'm not really consciously afraid of him, but it's like I can sense him/his aura and it's terrifying. For whatever reason, though, I don't feel like he actually wants to hurt me or kill me - he would have done so already.",
        "created_utc": 1668893345,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is one paranormal encounter you’ve had?",
        "author": "Left-Negotiation6440",
        "url": "https://www.reddit.com/r/Paranormal/comments/yzmdn0/what_is_one_paranormal_encounter_youve_had/",
        "text": "[removed]",
        "created_utc": 1668892671,
        "upvote_ratio": 1.0
    },
    {
        "title": "I saw myself sleeping",
        "author": "TittyWolff",
        "url": "https://www.reddit.com/r/Paranormal/comments/yzmb2c/i_saw_myself_sleeping/",
        "text": "About 14-15 years ago (currently 30m) I was in my family home watching tv, laying on the couch. I got thirsty, so I stood up and went to the bar to grab a glass of juice. I was startled by the doorbell, and spilled a little bit next to the glass\n\nI put the juice jug down, turned right and went up the stairs to my front door. When I opened the main door, leaving the outer glass door shut, no one was there. It was a nice day out, so I left the front door open and opened the “window” on the glass door to get a breeze in the house then went downstair\n\nI was walking back to the couch I saw myself laying down, asleep. I remember the feeling I got when I saw myself, and it was unlike anything I’d ever felt before. I was questioning my entire existence at that point. I stood there for nearly two minutes frozen in fear, and the only idea that came to my mind was to touch myself (lol). I reached out with my shaking right hand and stroked my left cheek with my right index finger\n\nI felt the touch on my face for what felt like a millionth of a second then immediately jolted awake in the position I saw myself\n\nMy first thought was, “well that was a weird dream.” After thinking about it I remembered that I had juice in my dream and it made me thirsty. So I walk over to the bar and I see the glass, spilled drops, and jug next to it. I look to the right up the stairs and see the front door open with the “window” on the glass door open, just as it all was in my “dream”. I panicked hard, even started to cry. I ran upstairs to close the door, put the juice away and wiped up my spill, and went to hide in my closet (my safe place at the time). I didn’t come out for two days due to how scared I was. When I saw my parents again I told them I stayed at a friends house, because I knew they’d just laugh at me and call me stupid for making up such a ridiculous story (I didn’t have the nicest parents)\n\nI have no explanation for this, it still gives me anxiety attacks thinking about it. I haven’t told anyone in my life because I’ve convinced myself that they won’t believe me, and react the way my parents would have \n\nThat event still haunts me, keeps me awake, and I’m starting to question if there’s something wrong with me, mentally\n\nDid I have an experience, or should I get myself assessed at a mental health clinic? I don’t know what to do, or how to process this event. Any advice/input would be greatly appreciated \n\nThank you for reading",
        "created_utc": 1668892489,
        "upvote_ratio": 1.0
    },
    {
        "title": "Gnomes Fairies Duendes",
        "author": "Louzifur",
        "url": "https://www.reddit.com/r/Paranormal/comments/yzlw9p/gnomes_fairies_duendes/",
        "text": "I wanted to share something that happened to my family. My family comes from the coast of Mexico. They lived near the ocean and jungle in small homes built of bricks and wood. Nothing fancy. Fast foward my parents had their first child. It was great up until some weird things started happening. My parents claim these little people called \"chaneques\" would sometimes visit their home. They say they're mostly out at night when everyone's asleep. My parents swear these \"chaneques\" would play tricks on them every now and then. Their child (older sister) would end up being in random places in the morning. They tell me their favorite spot was hiding her under the bed. My parents never heard anything because my sister never cried during that. They even claim one night they put her between them in the bed and the next morning she was gone, under the bed again. They eventually moved once she got a little older and they never experienced that with the rest of their children. My uncles and aunts all have their little story about these \"chaneques\" but they all swear they exist. Has anyone else heard of these little people?",
        "created_utc": 1668891399,
        "upvote_ratio": 1.0
    },
    {
        "title": "The night before my grandfather died",
        "author": "ErudringTheGodHammer",
        "url": "https://www.reddit.com/r/Paranormal/comments/yzjgm3/the_night_before_my_grandfather_died/",
        "text": "As preface, my mothers father was Puerto Rican and Catholic which gives me a few hunches as to what my mom and her sisters saw that night. He died back in 2017 from congestive heart failure in a hospice care home down in Florida.\n\nThis is going to sound relatively unbelievable, especially considering that the pictures my mother took of this thing we can’t get cause her sisters took the SD card out of her phone and they started fighting (due to an unrelated incident) and haven’t spoken in years. So I apologize that I don’t have anything to show you all.\n\nWhen my grandfather was on his deathbed, my grandmother kicked my mom and her sisters out of his room because they’d been talking too loudly and were making him uncomfortable. So the three sisters went out onto the balcony and were talking to one another when my aunt Marian sees something sitting half in shadow and points it out to my mom and my aunt Carmen. It apparently was a man dressed in a suit that had long black hair, a flat wide nose that looked as though it had been broken at one point with a mustache underneath and he looked either Puerto Rican or Cuban; my mom said he looked a lot like my grandfathers childhood friend who was around when my mom and her sisters were kids, his name was Guíto; this figure kept staring in the direction of my grandfather’s room and never broke eye contact with the room no matter what. A little backstory; Guíto was apparently a drunk and was riding the bus one night when the bus got a flat, him being drunk, decided to walk home from there whereupon he was hit and killed by a car.\n\nSo anyways the night that my grandfather died, they saw who they thought was Guíto who had two other figures standing in the shadow nearby. The other two figures had faces that would shift between several people and my mom recognized one of the faces as being my late grandfather from my fathers side; but the faces would continually shift every few seconds. There was a swarm of bats that were flapping around during this time frame as well and would keep flapping over the figures but would never stray far from them. This sight made all of them really uneasy and when my grandma went out to see what they were looking at, she immediately went back inside after hearing what they were saying but she never said if she saw it or not and still won’t say anything to this day.\n\nMy mom and aunts took pictures of everything and my father saw the pictures when my mom came home to NY from Florida. He said he never saw Guíto but saw a skeletal shape in the pictures that made his hair stand on end when he looked at it. A woman my mom worked with at the time said she didn’t see anything at all in the picture. So I asked my mom to see them and then I found out that my aunts had taken the SD card, I will be reaching out to them to try reacquiring that card if they still have it. \n\n*Any thoughts at all on what this could have been?*\n\nTLDR: Mom and aunts saw a dead family friend the night before my grandfather died who stared eerily at my grandfathers room and made everyone uncomfortable. All picture evidence was taken by my aunts and my mom and them don’t speak to an unrelated issue, I will try to acquire proof.",
        "created_utc": 1668884860,
        "upvote_ratio": 1.0
    },
    {
        "title": "After the first few strange events in a large Bunker, real creepy stuff is happening again.",
        "author": "Florian_Claassen",
        "url": "https://www.reddit.com/r/Paranormal/comments/yziv7u/after_the_first_few_strange_events_in_a_large/",
        "text": "[removed]",
        "created_utc": 1668883325,
        "upvote_ratio": 1.0
    },
    {
        "title": "Answering general questions about the paranormal",
        "author": "Walkingthruaranormal",
        "url": "https://www.reddit.com/r/Paranormal/comments/yzijrk/answering_general_questions_about_the_paranormal/",
        "text": "Hey guys, I’m a paranormal investigator and have been such for the last 4.5 years. If you have any questions or story’s that need answers drop them in the comments and I’ll help you out with what I can make from it. \n-Paranormal.Craig \n-InvestigatorOf4Yeara",
        "created_utc": 1668882505,
        "upvote_ratio": 1.0
    },
    {
        "title": "I'm a non-believer with a few questions to believers.",
        "author": "cheesetexanboycow",
        "url": "https://www.reddit.com/r/Paranormal/comments/yzfbrd/im_a_nonbeliever_with_a_few_questions_to_believers/",
        "text": "1. Have you ever thought an event was paranormal but then started to realize it isn't?\n\n2. If you said yes to number one, are you embarrassed?\n\n3. Have you ever posted about it still thinking its paranormal?\n\n4. Does anyone know of this?",
        "created_utc": 1668874099,
        "upvote_ratio": 0.99
    },
    {
        "title": "Still freaks me out.",
        "author": "Cool_Adhesiveness_75",
        "url": "https://www.reddit.com/r/Paranormal/comments/yzfato/still_freaks_me_out/",
        "text": "So when i was 9-12 i was getting ready for school. I was brushing my teetg suddenly i heard a deep voice whsiper in my ear in a different language. I ran out crying. Im 21 now and still am terrified to go brush my teeth sometimes. My mom said she has heard a similar thing before",
        "created_utc": 1668874031,
        "upvote_ratio": 1.0
    },
    {
        "title": "Did I have a visitor?",
        "author": "joakimk84",
        "url": "https://www.reddit.com/r/Paranormal/comments/yzdgb6/did_i_have_a_visitor/",
        "text": "A few years ago I had a very strange experience when I came home from work on a Friday afternoon. And the feeling remained throughout the weekend.  \n\nI am a very particular person when it comes to how it looks at home, bordering on obsessed, some would probably say. I live alone so I can be like that. Everything has its fixed place, nothing is placed in random places. I also have a surveillance camera at the frontdoor and one that films the inside. And the only one besides me who has a key is my mother, who was out of the country on holiday at the time.  \n\nAs I said, I came home on a Friday afternoon and before I had time to turn off the car I felt an overwhelming feeling that something was not right. As if someone had been on my property. But when I looked around everything was as it should be. When I locked myself in, I felt the feeling got even stronger, as someone had been inside my house. But again everything was as it should be. Everything was where it should be, nothing was missing. And while I'm not rich by any means, I did have a few somewhat valuable possessions. I look at the surveillance cameras and they didn't show anything. But I couldn't shake the feeling that someone had been on my property and in my house while I was gone. I spent the whole weekend feeling this. Nothing happened, no inexplicable noises, no shadows in the corner of my eye while I sat doing things or anything like that. Apart from the overwhelming feeling that someone had been there, the weekend was completely normal.",
        "created_utc": 1668869084,
        "upvote_ratio": 1.0
    },
    {
        "title": "My first ever ghost experience",
        "author": "seauxtreaux",
        "url": "https://www.reddit.com/r/Paranormal/comments/yzdbvm/my_first_ever_ghost_experience/",
        "text": "This happened when I was in junior high school. Me and my friends that were also my classmates were preparing for a play, and we are assigned to do the background props.\n\nWe needed a house to meet up and work on these props and also leave them there, luckily, my classmate offered their old house since they moved to another place and it was also close to our school so we agreed to work on their house. Immediately after class, we decided to check and see their house to also familiarize the location of it. We arrived and went inside the house... Nothing out of sorts. We rested for a bit at the sofa in the living room then headed out and made sure everything is locked.\n\nSaturday came, we were bit by bit moving the materials we were working on to the house after classes everyday or so I remember. We were a total of six people working at that time, we arrived early in the morning so we can accomplish the tasks earlier. It was around noon, my friend needed to go outside to run errands. We were all at the front yard doing the background prop when this friend asked us if we saw his other shoe. We said we didn't know and asked hime where did he last put it. Under the sofa, that's where he saw his one shoe.\n\nWe helped him find it, even inside one of the rooms where we didn't even stayed at, it wasn't found. One of our friends had a feeling that we were being toyed by a ghost so all of us went outside the front yard while this friend said in a calm manner to please bring the shoe back and closed the door.\n\nThe door was not closed, rather it can't. The shoe was hanging on the corner of the door. We were all spooked so we ran outside the gate of the house. We were discussing on who could it be among us (🧐) that put the shoe on top of the door, we were all busy working outside the front yard so...\n\nAnyways, after we had calmed down, we went back inside and just cleaned the materials left on the floor and get the hell outta there.\n\nOf course, we still came back on that house to finish our  props or else we're gonna have no background to use for our play. Nothing spooky happened then—not to me, to say the least...",
        "created_utc": 1668868729,
        "upvote_ratio": 1.0
    },
    {
        "title": "My house is hunted",
        "author": "Orochumarusama",
        "url": "https://www.reddit.com/r/Paranormal/comments/yzcw00/my_house_is_hunted/",
        "text": "I live in a very old house it's about 150 or 160 years old .There are strange things happening in it with little to no explanation like doors creaking and opening all by themselves I can somethimes hear footsteps  when then there's no one except me in the house.\nSometimes I even see a shadow of a little boy staring at me. Just as i said before the house is very old and it has a pretty rich history there was a big fire and the whole house including the family who lived there burned down and quite frankly I think that's why the boy is here I feel like he can't leave and I want to help him but I don't know how I also have dreams about the fire and the house burning down so I think that might be it.\n\nDoes anyone have similar experiences?\n(Btw Englisch is not my first language so sorry for any mistakes.)",
        "created_utc": 1668867473,
        "upvote_ratio": 1.0
    },
    {
        "title": "My friend thinks he got abducted by aliens.",
        "author": "Glad-Construction-55",
        "url": "https://www.reddit.com/r/Paranormal/comments/yzb23q/my_friend_thinks_he_got_abducted_by_aliens/",
        "text": "For the sake of his anonymity I’ll call him Brian. \n\nI’ve know him for years and he told me a bunch of fragmented stories that he thinks are connected and potentially linked to alien abductions.\n\nHe told me that when he was a very young kid ( between age 1-3 ), he had the urge to look at the sky almost every night according to his parents but he doesn’t remember why he was so curious about the sky. However, he said that one of his oldest memories is about him as a 3 years older staring at the sky at night and seeing a massive white ball orbiting really fast around the moon for about a minute before it disappeared out of nowhere.\n\nWhen he was still about 2 or 3 years old, he apparently spent the night at his grandmother’s house and got so nervous about a lot of stupid unrelated things that at some point he’s unsure if he was hallucinating or not but he allegedly saw himself and some parts of the room in third person before seeing a flying glowing orb near the window and that’s all he can remember.\n\nAbout the same year, he remembers himself floating out of the bed during a daytime nap to the point of almost touching the ceiling and uncontrollably but slowy moving around the house before being put back on his bed. He says everything looked clear that day and that the house looked just like the way it was supposed to be, including the location of a specific family member that was there that day in the house.\n\nThen he said that about a year later, he once randomly talked about the Big Bang and how it works even though he was only about 3 or 4 and that his parents allegedly never spoke to him about it. He said that’s there’s a billion ways he could have heard about it but that for a 3 or 4 year old kid to understand it was rather odd.\n\nNow this is where things gets even weirder:\n\nHis most “ shocking “ memory is about him finding a green glowing entity outside of the room of his window when he was 4. It was about the size of a child and seemed to have a weird shaped-skull and could disappear anytime someone else was coming to the room before “ reappearing out of the fucking floor “. The whole encounter lasted about 2 minutes. One of the most terrifying moment of his life.\n\nAbout the same year, he had the same dream over and over for about 2 months. In that dream he couldn’t move or hear anything and all he could see was a red/pinkish looking room, a circular-shaped tv in the center of the room showing strange hypnotizing patterns of random colours and about 10 to 15 tall lanky dark-skinned entities moving around the room. He said it looked like some sort of PTSD dream even though he doesn’t remember having lived that moment irl. Sometimes the dream would stop there but sometimes he would having an out-of-body experience and seeing a military camp in the Middle East filled with soldiers that seemed to be Talibans. ( keep in mind that’s rather odd for a 4 years old ). He thinks they sort of experimented on him by doing a “ imaging screening “ and that they showed him patterns of colours and footages of the war that was happening in the Middle East.\n\n\nSame year, he remembers a dream about a tall dark-skinner entity holding him in his own room while his father was absolutely terrified and seemingly more confused about the look of the entity than the situation that was happening. At some point in the dream he remembers something penetrating his right ear and it sort of felt like as if the inside of his ear was getting branded and it felt like the most painful experience of his life.\n\n\nHe remembers having a a missing time experience in 2012. He was coming out of his room to check himself in the mirror and out of nowhere he felt as if a couple of minutes had passed but couldn’t remember jackshit about what happened during those last few minutes. His dad was seemingly sleep-walking behind him even though he wasn’t there until he woke up from the missing time, indicating even more that time had passed.\n\nThe last thing he remembers is having a fuzzy dream in 2015 when he was around 9 years old about an adult showing him children twins and seeing a window showing an hangar behind those children.\n\n\nI’m sometimes freaked out by my friend but I don’t know what to think.  He also asked to share his stories. He thinks those dreams are fragmented memories of encounters he had. \n\nWhat do you guys think ?",
        "created_utc": 1668861868,
        "upvote_ratio": 1.0
    },
    {
        "title": "Lullaby music home alone",
        "author": "WeirdParticular2772",
        "url": "https://www.reddit.com/r/Paranormal/comments/yz9uiu/lullaby_music_home_alone/",
        "text": "I’ve had concerns about my flat, hearing footsteps/movement/voices and even feeling touches for a couple weeks now. Woke up this morning to a lullaby playing, which I thought was maybe my flatmates alarm and he had slept in for work but when I called him he was on his way to work. The lullaby kept playing but I was too anxious to check because I knew I was alone in the flat. As soon as I plucked up the courage to check and stood up, before I got to my door, it just stopped completely and I’ve not heard it since? It’s kind of freaked me out but also could just be a random coincidence? I also have a video of the sound playing so I know I’m not going crazy. Has anyone had any experience similar to this?",
        "created_utc": 1668857496,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can anyone remember the old story?",
        "author": "Northerner-15",
        "url": "https://www.reddit.com/r/Paranormal/comments/yz972o/can_anyone_remember_the_old_story/",
        "text": "[removed]",
        "created_utc": 1668854985,
        "upvote_ratio": 1.0
    },
    {
        "title": "Colleague heard another voice in the room with me",
        "author": "SalamanderPlus625",
        "url": "https://www.reddit.com/r/Paranormal/comments/yz8szi/colleague_heard_another_voice_in_the_room_with_me/",
        "text": "The older I get, the more I'm coming round to the idea of a link with the spirit world. \n\nAbout a year ago I was working from home, as per the joys of the pandemic, and some heavy objects \"fell\" onto the upstairs landing floor with a loud bang. The floorboards are exposed so it made a racket. They were on the half size wall around the top of the stairs (not really a bannister). For them to move (as far as I can explain) you'd have to go along the wall and push them off for them to have moved so it really startled me and my heart started racing thinking someone was in the house with me. My dog who barks at all loud noises didn't react.\n\nAnyway, out of the blue I called out, \"If that's you and you're there, Irene, I'm really sorry\". I don't know what made me do it, it just naturally happened. I called out again and then thought, \"what are you doing you idiot?\". And went back to working. \n\nAs I sat down my colleague called me on MS Teams. When I'm at home i work in my private office so I don't often use my headphones. I answered and she said, \"whose that with you? I'll call you back if you're busy\". I asked her what she meant as I was on my own and she said, \"I just heard a woman's voice I didn't recognise saying 'hiya love' and talking to you\". \n\nSide note: Irene was my husbands great grandma who had died not long before this incident. Lovely lady, fantastically adventurous life, lived alone until her 90s and was still driving when she was 94! Died just before her 101st birthday.\n\nCould be a perfectly natural explanation, but I like to think she came by to tell us she was ok.",
        "created_utc": 1668853376,
        "upvote_ratio": 1.0
    },
    {
        "title": "Old St Augustine jail",
        "author": "Skiznit",
        "url": "https://www.reddit.com/r/Paranormal/comments/yz7p0l/old_st_augustine_jail/",
        "text": "streamable(DOT)(COM)/4phjw1      I have way more if you guys are interested. Back story to this was that I saw a black shadowy figure sittisng here on the bunk earlier in the night so I decided to place a rempod in case something was there. Half way thru the night we hear this thing going off from the other side of the building and we get voices from the spirit box in addition to a translator device. It says something along the lines of remain, can you see me. Rempod goes crazy as well. There has to be something...",
        "created_utc": 1668848790,
        "upvote_ratio": 1.0
    },
    {
        "title": "Tried killing while in sleep paralysis.",
        "author": "Typical-Elderberry77",
        "url": "https://www.reddit.com/r/Paranormal/comments/yz7o8d/tried_killing_while_in_sleep_paralysis/",
        "text": "I was sleeping and had a normal dream, nothing special. Was hanging out with friends in that dream if you are curious. I became conscious of the fact i was dreaming, tried to turn the dream lucid and it got fucked up. I suddenly was in my bed facing on the wall side. I was turning to the side of my desk and i saw under me bed fingers coming out. I was consious i was in sleep paralysis and  tried  pulling the demon and ripping it in 2 pieces using my mind since it was in my head and i control it. Seems like i dont have control over my own head. Instead it put its long fingers in my stomach and it hurt. I also see fingerprints on my window.",
        "created_utc": 1668848694,
        "upvote_ratio": 1.0
    },
    {
        "title": "Im being annoyed",
        "author": "ashen_raye",
        "url": "https://www.reddit.com/r/Paranormal/comments/yz7432/im_being_annoyed/",
        "text": "I guess it’s that time of the year for me. Holidays have most times been bad for me so i feel like i tend to attract annoying shit to me. \nLast few weeks it feels like someone is trying to wake me up or sneak up on me when im trying to sleep. I reach over expecting it to be my cat but it rarely is. She’s usually close by but not at all where i feel the movement or pressure.",
        "created_utc": 1668846272,
        "upvote_ratio": 1.0
    },
    {
        "title": "I think I might be a medium",
        "author": "Ugot_nerve",
        "url": "https://www.reddit.com/r/Paranormal/comments/yz6dub/i_think_i_might_be_a_medium/",
        "text": "Sometimes out of the blue I feel an intense urge to communicate with a specific spirit through tarot cards and it always turns out that the spirit was trying to reach out to me and it's really easy for me to communicate to spirits even without my tarot cards, just me.",
        "created_utc": 1668843161,
        "upvote_ratio": 1.0
    },
    {
        "title": "another question.",
        "author": "daleksrule22",
        "url": "https://www.reddit.com/r/Paranormal/comments/yz5se5/another_question/",
        "text": "Since I was like kid, I have seen a man in black. Shadow figure. I've seen him stand at the foot of my bed, in the corner of a room, in another room, he was next to my bed where I lay my head. Another place since I moved from my parents house, a couple years ago, he was in the closet doorway. Most recent place I seen him, In my newest living place, was in my bedroom closet. I used to ask what he wanted and he never says. He just stands there. I will glance in my rear view mirror and see him then he disappears. But the rooms, he stays even if I see him and blink. So I know he's there. I haven't been hurt by him ever and he never causes fear. So I don't think he's malicious. I had one dream that we briefly spoke. He said his name finally and he wore a white suit and had a beard maybe an inch in length. Charcoal black in color. White skin. Maybe 35 years of age. I asked what he was doing watching me, and he didn't audibly say. Then I woke up. I don't know what to say. He's still around after that confrontation but only as the man in black.",
        "created_utc": 1668840755,
        "upvote_ratio": 1.0
    },
    {
        "title": "I have a constant dream(s).",
        "author": "daleksrule22",
        "url": "https://www.reddit.com/r/Paranormal/comments/yz5n2r/i_have_a_constant_dreams/",
        "text": "I'm down a hotel corridor. Everything I open the door and wake up. But it happens to be on the 4th floor every time, all the rooms are 401, 402, 403, 404, etc. Endless hallways. I managed to peak inside one of the rooms one time and it had a TV on, the room was dark so I couldn't see much but a older man watching something on TV. He turned and looked at me. The carpet was red and the walls were a wood with resin on them. Lights were dim. At the start of the hallway, presuming where you get off the elevator, to the immediate right side of you is stairs leading to the 5th floor, where I hear blood curling screams but I never go up or down a floor. I've opened a door once or twice, and woken up from it. I have a picture of the hotel hallway as close as I could get it. Anyone have suggestions? I know it exist in real life, but I get called to this hotel hallway. It's not the only time I've had dreams of places. (I'm gonna go on to my other dreams I've had that pulls me to them. If you don't wanna read on that's the end of the hotel one.)\n\n2nd place is in a place near where my grandmother lived in. It was a gas station. I went inside, I've never been in this gas station, but there was stairs going up to another floor. I walked in the door to the gas station and got a look from the clerk and they pointed up the stairs. I went up the stairs, and at the top its just the ceiling. I wake up when I look up the stairs.\n\nAnother dream at the outside of the gas station, gas pumps the whole nine yards. But on the back side of the gas station was a corner boxed in with two tall cement walls. One connected to the gas station exterior and the other side is to hold up a ton of dirt with a hill going up behind the gas station, and chain link fence on top of the hill. (Best I can describe it.) In the dream I have had 3 separate times, two different views. One looking down at what goes on. 2nd time is first person. Something goes down and it gets violent fast. I have this urge to go and see this place, it's near where I live, but scared to find out what it really is like. Any suggestions?",
        "created_utc": 1668840148,
        "upvote_ratio": 1.0
    },
    {
        "title": "Clown music, voices, and stomping. Louisiana 10:20 P.M",
        "author": "Remding",
        "url": "https://www.reddit.com/r/Paranormal/comments/yz3pxb/clown_music_voices_and_stomping_louisiana_1020_pm/",
        "text": "So my friends are sleeping over tonight and we decieded to play sticks, a ganme we created. Anyway, I was at the end of the road right in front of deep woods that we're scared to go in.. so as I was at the end of the road, and I heard extremely faint calliope (clown music) I decided to ignore it, but then about 4 mins later I heard stomping footsteps about 20ft away from me, in the woods. I bolted back to my friends and before I got back I started hearing very faint talking, almost like a little girl. When I got back to my friends I told them what I heard and they said that they had heard the SAME THING. They heard the calliope as well, but the voices they heard they described as deeper and more country-like. They didnt hear the stomping cause they were at the other end of the road, as I'm writing this, we're hearing bangs and other stuff. If anyone else has heard clown music in the woods, please tell me because I've done some deep research and can only find one story. Any other information on this type of thing would be a massive help and I'll respong to all comments asking questions. (TRUE STORY)",
        "created_utc": 1668832968,
        "upvote_ratio": 1.0
    },
    {
        "title": "weird wood damage in an old house",
        "author": "Ok_Pumpkin4350",
        "url": "https://www.reddit.com/r/Paranormal/comments/yz34me/weird_wood_damage_in_an_old_house/",
        "text": "My parents live in an old house that we always have had weird vibes in, not necessarily bad just weird. When they moved in the previous owners left a ouija board alone on a shelf in the attic. It was the only item left in the whole house. My mom has always felt pretty ok with the idea of the house so they just threw it out and didn't think much of it. Within a month of living there they found random scratches on the wood but figured they made them themselves. Then they found a bite mark (still not feeling anything threatening). The wood is just disappearing in their house now. There's random holes and pieces missing with no residue and it doesn't look like termite damage. They are pretty poor and haven't had anyone come do a consult to check for an infestation of any kind but it really doesn't look like it. There's holes in the wood but they are perfectly laminated underneath. My mom said she always notices it gets really bad when they leave for awhile, and she just got home after taking care of my grandmothers estate for a couple months and SO much damage was done while she was gone. Including this weird pattern that she is 100% sure was not there when she left, it was in a super noticeable spot. Its a circle with a dot in the center with a vertical dashed line underneath it, i wish i could post a pics of all of this. WHAT is going on??? Are we crazy and could this just be insect damage?",
        "created_utc": 1668830870,
        "upvote_ratio": 1.0
    },
    {
        "title": "Ghost Locations",
        "author": "DwellingintheShadows",
        "url": "https://www.reddit.com/r/Paranormal/comments/yz2nln/ghost_locations/",
        "text": "Is there a way ghosts end up where they do? It would make sense that they stay where they either died or had a long past at. However, I was on a ghost tour tonight and they were talking about a ghost that lived in the opera house. He wasn’t born in the same town, but came under an alias to get away from a crime. Then he moved on to another town in another state where he committed suicide. Why would the ghost be in the Opera house when he didn’t die there and didn’t have any real connection? Or can ghosts just end up wherever they feel like going?",
        "created_utc": 1668829261,
        "upvote_ratio": 1.0
    },
    {
        "title": "One night at cheer camp.. ghost story",
        "author": "arielrodrxguez",
        "url": "https://www.reddit.com/r/Paranormal/comments/yz1tvw/one_night_at_cheer_camp_ghost_story/",
        "text": "As you can tell from the title I was at cheer camp when this occurrence occurred. I was at the university of incarnate word in San Antonio, TX staying in the Dubuis hall to be more specific. I have stayed at this camp for many years every summer. It was really always fun and we always stayed in different buildings every year. Until my final summer camp, I got into my assigned dorm room for the week which shared a bathroom between me and another girl. One night as I’m on the phone with my bf at the time I’m laying in bed just looking around the room not anything specific but I’m looking around and talking, bored. All of a sudden it’s as if someone comes and sits on my bed next to me while I’m laying down. An impression was made as someone was sitting on my bed, but there was physically no one there. Immediately I felt cold and an insane feeling in my chest still to this day that I cannot shake, and it’s been years. I was still on the phone and I just got up and started screaming and ran through the restroom to my roommates room and it took me about 10 minutes to calm down and explain myself. They still remember how scared I was when I came running in and then after that day I was terrified to be in my room, when I went in for my stuff the room felt so cold and very uncomfortable. There’s stories of a nun who hung herself in the building we stayed in. Copying from an online story “The ghost of a nun who committed suicide has reportedly haunted students in Dubuis Hall. After her death, her bedroom where she was found hanging was blessed by priests and nailed shut. No one has entered the room since her death over fifty years ago. Paranormal investigations have recorded cold spots and electrical anomalies.” I can’t help but wonder if I was next door and didn’t realize or just why me lol but I was probably just the perfect target since I was alone. I’m still scared when I’m in a room or home alone because of this!",
        "created_utc": 1668826501,
        "upvote_ratio": 1.0
    },
    {
        "title": "Question?????????",
        "author": "BabySosa24",
        "url": "https://www.reddit.com/r/Paranormal/comments/yyzrrx/question/",
        "text": "[removed]",
        "created_utc": 1668819886,
        "upvote_ratio": 1.0
    },
    {
        "title": "Saw a child sitting in a chair at the end of my bed looking at me",
        "author": "ApartmentPig",
        "url": "https://www.reddit.com/r/Paranormal/comments/yyzepe/saw_a_child_sitting_in_a_chair_at_the_end_of_my/",
        "text": "So the other night I woke up around 4am to go pee and I saw an unknown boy sitting in a chair staring at me.\n\nFor context, I live in a converted primary school (for non uk readers, it was a school for ages 6 to about 8). It was built back in the 1700s and has a lot of history. \n\nAt the end of my bed is normally a suitcase because I’m going away soon, but as I opened my eyes I noticed it was a chair and in it was a boy of about 8 years old. I didn’t recognise him. He turned his head and stared right at me. At first I was startled but weirdly I calmed right down when the initial shock of seeing him passed. I turned on my bedroom light and he was gone. The suitcase had returned. I went to pee and returned to bed like normal.\n\nI understand I was probably still half dreaming but it was kinda cool none the less. I wonder who he was?",
        "created_utc": 1668818796,
        "upvote_ratio": 1.0
    },
    {
        "title": "childhood ghost stories",
        "author": "no_im_dirty_dan03",
        "url": "https://www.reddit.com/r/Paranormal/comments/yyz7yf/childhood_ghost_stories/",
        "text": "sorry this is kinda long but so worth it \nokay so when i  was younger, around ages 6-9, my dad was dating a woman that never treated me the best. she was the kind of white woman that loved black men/boys but hated black women/girls. me being black, i’m sure you could tell how that went however that’s a completely different story that isn’t meant for this sub. \nanyways back to the point, i grew up on horror movies. ones about ghosts and demons always freaked me the hell out but they were my favorite if i’m going to be honest. i’d also like to point out beforehand that my family and i are in no way skeptical and after these experiences there’s no way we could be (my eyes are watering already lol). so to keep this more organized i’ll be listing the experiences that my father and i, and everyone else living with that woman, has experienced. \n#1. My father’s an ex-marine and he wasn’t discharged until i was in 4th grade. He spent 12 years and i’m incredibly proud of the fact that he’s my father and everything he’s done for this country. This info is relevant because at the time he was stationed in Il, and we were living in the suburbs of Chicago. Glenview to be exact. i’d also like to add that I was about 6 years old at this time so this experience is what he told me years after the fact. We were living in a townhouse that just so happened to be near a graveyard and on night he fell asleep on the couch in the living room. with the way that this house was set up it was the front door, then right in front of that were the stairs leading upstairs where there was also a corner that you could stand in that you could look out into the living room. anyways, he fell asleep on the couch that night and woke up in the middle of the night because he felt something staring at home from that corner upstairs that i mentioned before. Now one thing that i noticed over the years is that when you feel like something is watching you, you can tell EXACTLY where it’s coming from, so i just kinda feel like that story checks out lol \n#2 this is the reason why i don’t sleep with closet doors open lol. this is the same house in glenview and the sleeping arrangements were that my parents got the master bedroom and the 4 kids (2 boys 2 girls ) would share the room. i was spoiled as a kid, i won’t lie, and the bed that we used was an old one that i had when i was much younger that was like a bunk bed but the top part was where my mattress was, and the bottom part was like a play area. well Kim’s (dads gf at the time) daughter and i got the top part while kim’s two sons got that play area which my dad put a mattress under and called it day. here’s the weird part: some nights i would feel something watching us from the hallway but nothing was ever there. other nights i would feel something watching us from the top rack of the closet. And even though i never actually saw anything there, i always had a really strong feeling that whatever it was, was curled up in a ball, almost like a fetal position, watching us. and don’t even get me started on the fact going to the bathroom in the middle of the night was the scariest time ever. \n#3 my dad got stationed back in NC so we all packed up and moved there and for some reason my room didn’t have a door and guess what? that’s right! I constantly felt something watching me from the doorframe !! at this house tho, we’ve never really felt more than something watching us.  and then came the time when i accidentally put a hole in the wall because i slammed my closet door open and to hide it, i slept with the closet door open and i felt something watching me from the back of the closet (it was a walk-in one) EVERY. SINGLE.  NIGHT.  and this isn’t my personal experience but i remember kim also telling us how the house SHE grew up in was haunted but a bit more active. she told us a story of how she and her family were having dinner and a cup moved off the table like someone had just grabbed it and slid it back. she also told us how she would hear the shower curtain open and close some nights. \n#4 still living in NC but moved houses and i feel like the activity picked up in this house. most nights we would hear footsteps coming from the attic. and neither of these two experiences are necessarily paranormal but still strange and i felt like it just made a bunch of sense when i got older. okay so i remember this one time i got in trouble but i don’t remember what for and when kim was yelling at me, she was literally foaming at the mouth and i remember being weirded out and just being like ew. and with this next one is really important and makes a lot of sense later on. my dad had just watched the gate with me the night before and i had just learned what demons were and didn’t really understand them and i looked at my dad and jokingly said that there a demon behind you. he got very serious and told me that demons are real and that i shouldn’t joke about that \n#5 still in NC, same house. it was storming really bad that night and had sounded like lightning hit something in our yard. and so kim and my dad went to go check it out. please keep in mind the power did not go out and my parents always closed their door when they weren’t in their room. i feel like this was more of kim’s habit than dads just cuz my dad doesnt do that anymore. our door was open and  i seen a black figure run down the hallway but the power wasn’t out out and there was a night light in the hallways so even if i couldn’t see the face i should’ve been able to tell what clothes they were wearing but it was just pitch black. i didn’t even hear it run down the hallway and both doors at the end of the hallways were closed and i don’t hear either one of them open. \n#6 almost done i swear. moved back to IL after my dad got discharged and we were living in plainfield\\joliet area. when i would get punished i would either have to stand or sit in the corner in the loft. however i always felt something watching me from the bathroom but every time i’d turn around and look because the feeling was so intense, there’d be nothing there \n#7 one time i woke up to her daughters and i’s bunk bed shaking so i’m like hey D, what are you doing? i’m trying to sleep. D said she was dancing. confused, i told her to stop and go to sleep. D walked me up and tells me that there was a green(?? maybe she meant mean) man watching us from the closet and she wanted him to go away. obviously that freaked me out but i don’t want her or the man to know that so i just told her to go back to sleep and was that \n#8 last one and it all comes together. my dad went to school for IT and while was doing that, he laid floors when he didn’t have school. one of the guys he worked with was able to see demons and he’s seen quite a few at the places they worked. the guy comes over to pick something up and meets kim. as soon a kim leaves the guy tells my dad that he needs to leave because kim has a tail on her. meaning there was an attachment. \nshe had a demon attached to her the whole time. \nneedless to say they aren’t together anymore and props to that guy for being a homie",
        "created_utc": 1668818222,
        "upvote_ratio": 1.0
    },
    {
        "title": "stress causing more paranormal?",
        "author": "cjuddy1",
        "url": "https://www.reddit.com/r/Paranormal/comments/yyy78p/stress_causing_more_paranormal/",
        "text": "Usually I can sense... I don't know, sprirts?, around me. I can feel my dog that passed sit beside me on the couch, I see an older darker figure with a top hat and his dog walking around my residence, street lights turn on when bad things are ahead while I'm driving, electrical things power surge or act weird when I touch them, dimes being left everywhere. Things I consider kinda paranormal but I've never really ventured or looked into it any further than acknowledging that it was something spiritual. I am not religious in the least so there's none of that (no judgement if you are). Recently I have been extra stressed and in turn I have been having a lot more things happen. Water faucets being turned on and off in front of me with no reason, noises that cannot be explained as I am the only person in a building, and dark shadows. Sometimes these figures are human shaped, other times they are just dark..orbs?. They're usually seen in the corner of my eye and when I look nothing is there. I don't know if this is paranormal, spiritual, me going crazy from stress, coincidence or other. \nAny insight would help, criticism won't. I'm not even sure who to ask or talk to about this as it sounds \"crazy\" when said (or typed)",
        "created_utc": 1668815236,
        "upvote_ratio": 1.0
    },
    {
        "title": "Something said “hi there” to me outside at 2am",
        "author": "Crabgas",
        "url": "https://www.reddit.com/r/Paranormal/comments/yyx47j/something_said_hi_there_to_me_outside_at_2am/",
        "text": "Every morning I wake up at 2am to let my dog out and then we go back to sleep together on the recliner. I have neighbors but they aren’t squished right up against my house. There is a field behind my house, and behind that field is a few miles of dense woods. I take my dog out towards the field because he doesn’t like doing his business right up against the house. \n\nSo this morning I hop up and take him out. Leash goes on and I grab my jacket. We walk out towards the field and he starts sniffing around and doing his thing. Out of no where, I hear a clear male voice say “Hi there”. I played it off as 2am groggy brain, but my dog heard it too. His hairs were shot up all down his back and his tail was tucked. He started looking around and growling. I was instantly freaked out and we hurried back inside. I had a flashlight and saw no one. There couldn’t have been anyone near me. It’s 2am and my backyard is fairly large. The field is large too and the grass is about a foot tall. The voice sounded like it came from a few feet away. I still cannot wrap my head around this.",
        "created_utc": 1668812241,
        "upvote_ratio": 1.0
    },
    {
        "title": "My car communicates with me, or someone/something does through the car",
        "author": "b41t4ll",
        "url": "https://www.reddit.com/r/Paranormal/comments/yyvy8e/my_car_communicates_with_me_or_someonesomething/",
        "text": "So a little over two years ago, I bought my first car. It's a special car for me, bought with my own savings after a long time with no drivers license. Never had the money for that, then someone in the family helped me getting the license by paying drivers ed, which is super expensive here. This gave me the will to save money for a car and there we go. From the beginning, I was convinced that I was supposed to buy *that* certain car after the chance for another car, same model, different color, passed by but there were some issues (on my side). When first driving my car, I knew it was *mine*, it was like a very strong feeling.\n\nIt's a wonderful older car from early/mid 2000s, always reminded me of the one my grandparents had, though a different model. Has some minor technical issues here and there but I don't mind, it doesn't matter and if you know, you know how to avoid them. For example one can definitely be avoided by driving and slowing down the car gently and cautious.\n\nI kinda developed the habit of talking to the car a little while driving. And somewhere along our two year journey it started to talk back! Like not literally, it does not speak words but actions. On two occasions it slowed down by itself when the situation demanded to slow down but I didn't react properly or didn't pay enough attention. I mean, there were other close calls but those situations were important. One where I'm supposed to let other cars/traffic pass because they have priority. Another where I didn't brake enough and someone on the motorway went back on the right lane very close in front of me, where I technically couldn't have held the safety distance and didn't do it for the third car, the one they were pushing themselves in between. Both times would have been a crash or at least damage to the car. \n\n&amp;#x200B;\n\nThen there was the situation where I went on a four day trip, it was supposed to be a trip for self discovery, going alone, thinking a lot. I ended up enjoying three days without thinking about it much but on day four the car acts up with two error messages that were technically impossible because they do not happen from one second to the next. It left me stranded in a parking lot, actively forcing me to overcome fears and emotion and coming up to strangers for help, also walking 20 kilometers with nothing but my thoughts alone. After a bit of time, it miraculously went on again, let me go to a repair shop and fix the 'problem' within minutes, just a little 'error' in the system, no damage. But not before I spent a day trying to solve the problem, in a foreign country, in a foreign language all by myself. Those hours taught me more than the three days I spent in peace. Sounds kinda stupid but well it is how it is.\n\nThe most recent is today. Sometimes I forget my AirPods in the car. Sometimes I leave them, sometimes I go back to get them. Always a nuisance. I was in a hurry and put them in the car without their case and I would have 100% forgot them overnight... if the car's radio wouldn't have turned on by itself. I got a little scared with this one because it was set to a frequency I never listen to and to a station I never listen to, it didn't have good reception and was only static noise but you could guess there was hint of music or radio broadcast somewhere at the frequency. I turned it off immediately because of the scare but it reminded me of the AirPods and to take them home when leaving. I turned the radio on and off again after that, no problems. It never went on by itself before.\n\n&amp;#x200B;\n\nThat makes four instances so far where those things happened and I can't believe in coincidence. Sometimes I said it as a joke, oh my car has it's own life but I feel like this is not a joke anymore. I believe it does talk to me through it's actions. What I don't know is if it really is the car, as a \"ghost in the machine\" type thing just because I love the car or if someone or something who/that is able to have an influence on machines/technical things/electronics is trying to communicate. All I can say is it has been communicating in a good, helping and rescuing way so far. \n\nUnfortunately I only have part of it's history. When it was made and brandnew, it was bought by an employee of the manufacturer ex factory. After that, a young man bought it. He later sold it to the family I bought it from, they gave it up because their daughter, who once was supposed to take the car, didn't need a car because she lived at the city. I have no idea if the first owner, the manufacturer employee is still alive or who he was. The car never had an accident so far and nobody got hurt or died in it. Also this is too different or complex to be a technical issue or glitch, especially since the situations were so diverse.",
        "created_utc": 1668809113,
        "upvote_ratio": 1.0
    },
    {
        "title": "Deceased people calling you?",
        "author": "TortoiseBlaster",
        "url": "https://www.reddit.com/r/Paranormal/comments/yyuw6n/deceased_people_calling_you/",
        "text": "I have a big question about this phenomenon, why does this happen? I’ve seen many videos and posts about deceased close relatives calling them and them answering the phone. Almost always it’s some kind of static sound too. Are these stories real? I’ve seen so many of them and I am really confused as to why this happens.",
        "created_utc": 1668806321,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can pets become ghosts?",
        "author": "bugelle",
        "url": "https://www.reddit.com/r/Paranormal/comments/yys1jb/can_pets_become_ghosts/",
        "text": "Dumb question. I know. But I also don’t know where else I’d ask this. If this doesn’t fit the criteria or is too stupid of a question, I’ll delete. \n\nI put my dog down a few weeks back and got her urn last week. Since I’ve gotten it, I’ve smelt and heard her. She had a unique smell since she was sick so I can’t think of anything else that’d smell like her. Sometimes I’ll hear her nails walking on the floor upstairs, and it can’t be my other pets because their walking sounds differently. I also have other pets who will look like they are tracking something on the floor, but there won’t be anything. No bugs or anything. \n\nIs it possible my dog is with me again? Or could it be from grief?",
        "created_utc": 1668798857,
        "upvote_ratio": 1.0
    }
]