[
    {
        "title": "Revenge on an ex of mine",
        "author": "huskofapuppet",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/11ierdo/revenge_on_an_ex_of_mine/",
        "text": "[removed]",
        "created_utc": 1677967556,
        "upvote_ratio": 1.0
    },
    {
        "title": "Spam callers donate to charity",
        "author": "Every-Progress-1117",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/11ib38d/spam_callers_donate_to_charity/",
        "text": "I have to thank someone over on /r/suomi for this,\n\nMy wife gets a lot of spam calls, I get very due to it being an unlisted number. Normally we just put the phone down on them, but a poster on another group suggested getting the callers to call another number:  one that you use to donate a fixed amount to a charity.\n\nHere in Finland we have a charity called Mannerheinin Lastensuojeluliitto - a famous charity for childrens' welfare. They have a donating number 0600 17000.\n\n&amp;#x200B;\n\nCaller:  Can I interest you in subscribing too....\n\nMe: Yes\n\nCaller: Great...\n\nMe: My phone's battery is very low, can you call me back on my work number - it'll get transferred directly to my computer.\n\nCaller: Yes\n\nMe: 0600 17000 ... call me back in a minute please\n\nCaller: Certainly\n\n&amp;#x200B;\n\n10 minutes later I get a rather irate call about that they'd called the number 5 or 6 times but only got the donation line.... I calculate that about 30 euros they donated\n\nI do feel a little guilty doing this to someone who is just trying to earn a living, but spam callers are an absolute pain (getting a call at 11 in the evening for example) and a few are quite aggressive, so....",
        "created_utc": 1677958972,
        "upvote_ratio": 1.0
    },
    {
        "title": "the wildest revenge I ever did",
        "author": "Ambitious_Twist_9809",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/11i9vt9/the_wildest_revenge_i_ever_did/",
        "text": "[removed]",
        "created_utc": 1677956167,
        "upvote_ratio": 1.0
    },
    {
        "title": "Petty challenge accepted.",
        "author": "VintageHilda",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/11i9j5h/petty_challenge_accepted/",
        "text": "Circa 1996; my first vehicle was a 1986 Toyota 4x2 pickup with massive mileage and several layers of paint. One morning on my way to school I stop by a 7-11 I frequented to get some junk food for lunch. As I exited the store a brand new Cadillac sedan pulled in the spot next to my drivers side and sloppily parked partially in my space not leaving me enough room to get in my truck. \n\nAs he gets out I say, “Hey man I can’t get in my car now!” He replies, “Just get in the passenger side.” I told him, “I can’t the lock is broken from the outside”\n\nHe looks at me with an absolute asshole grin and tells me in the most condescending tone, “I guess you’ll have to wait, I won’t be long”\n\nPetty challenge accepted. I unlocked my truck and squeezed myself into the vehicle pushing and scraping the door of his brand new car with all the force I could muster and then continued on to school.\n\nThe next time I went to 7-11 the clerk told me how bad the guy freaked out!",
        "created_utc": 1677955328,
        "upvote_ratio": 1.0
    },
    {
        "title": "wow",
        "author": "birdofthebee",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/11i8ddk/wow/",
        "text": "[removed]",
        "created_utc": 1677952695,
        "upvote_ratio": 1.0
    },
    {
        "title": "TW: ABUSE Petty Revenge to B-I-L",
        "author": "gamingclarinetist",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/11i48wq/tw_abuse_petty_revenge_to_bil/",
        "text": "My sister is going through a divorce with her ex. He became abusive and almost cracked her skull open on a kitchen counter because of a dispute over the dishes. He left a hefty scar on her head.\n\nHowever, for some reason she didn't want to press charges. He played the \"support\" card for her and then when he got his sentence. She did this because they have a child together and she said going to jail would do nothing. \n\nAfter this he completely stopped being supportive to her. He went to her and told her he never loved her and that he was miserable on his wedding day and never wanted to marry her. \n\nMy ex brother-in-law broke my sister literally physically and mentally. However, they have a child and are co-parenting. My ex-brother in law is an excellent father, and would never hurt my nephew \n\nHowever, now my ex-brother in law now has to deal with me, giving my nephew the most obnoxious toys for him to take over and show daddy and play with. Loud electronic baby toys, poppers, anything annoying. \n\nI already bought him a tiny electronic drum set. It's the most annoying thing in the world. He plays with it all the time. It's his dad's most hated toy.\n\nAny suggestions on some more annoying toys to give my nephew that will annoy  my ex brother in law 😂",
        "created_utc": 1677947076,
        "upvote_ratio": 1.0
    },
    {
        "title": "Boss didn't help me when I needed it, so I did the same when he asked me for help.",
        "author": "scrapped85",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/11i22t7/boss_didnt_help_me_when_i_needed_it_so_i_did_the/",
        "text": "Reposting this as it was removed from r/prorevenge which is understandable. 😊\n\nSo this happened in my old job during the pandemic. I worked as a travel advisor in a Luxury travel agency in France.\n\nDuring this period, no business was coming in and the French government stepped in to cover our salaries while staying at home. This government aid covers 70% of our salary and the remaining 30% has to be covered by our employer. This means that we are only allowed to work 30% of our original hours with our company, and that equates to less than 10 hours of work per week.\n\nSince there was no business coming in, and since the bulk of my income was commission from sale of travel packages which was not coming in, I had run into a small financial dilemma and needed a bit of funds to cover my rent for a month. So I reached out to my boss to ask for a salary advance which is to be deducted from my paycheck at the end of the month. By the way, for context, it is an employees legal right in France to have a salary advance if needed for as long as the amount of the advance is covered in full by your end of the month's pay check.\n\nMy boss told me that it is not possible and messaged me the following text \"If you have personal financial problems, you should check with your banker.\"\n\nI was flabbergasted by his response especially because I was his top seller and brought in 1.4 million euros in revenue the year before the pandemic. Even though I knew he was a d*ck, I never imagined he would refuse my access to this right of mine as an employee. I could have sent him a formal letter of demand by mail to force him to give me an advance as provided by the labor laws, but I decided not to as I was able to borrow money from a friend.\n\nWeeks gone by after the incident and business hasn't improved. The company's funds are dwindling since no income was coming in. To help French companies, the government decided to give them an option to decrease the vacation leaves of their employees by somehow allowing them to 'impose' vacation times even when the employees are not working anyway on those days. If I could remember correctly, it was 3 days that they can fully impose without objection from the employee and 4 days extra with the consent of the employee. All of my colleagues agreed to give their vacation time except for me an another disgruntled Co worker.\n\nSince we still haven't given our consent, and the end of this government is nearing, he messaged me and the other employee stating that we are the only people who haven't agreed. He is saying that we should help the company as it is going through financial problems due to the pandemic and that it would be really nice of us to give him our consent.\n\nUpon receipt of the message, I promptly responded with the following text 'I am really sorry to hear that the company is going through some financial problems, but let me remind you of the advice you gave me when I asked for your help a couple weeks back - if you have financial problems, I suggest you talk to your banker.' and that means I am not going to give you my vacation leave. (I had to guts to be upfront because I know that he can never fire me due to my performance and very strong French labor laws, and I was also planning to leave soon anyway) \n\nI wished I was in front of him when I told him that. Knowing him, I'm pretty sure he went all red and mad when he read that message. And his forehead veins should be visibly throbbing like whenever he is mad at someone. He was too shook that the only response he gave me was 'ok'.\n\nI was extremely satisfied with my comeback that I had a smile on my face the entire week. Revenge can really be satisfying.",
        "created_utc": 1677944180,
        "upvote_ratio": 1.0
    },
    {
        "title": "4 words:Whole.Foods. Parking. Lot.",
        "author": "Luci_Wolf630",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/11i19np/4_wordswholefoods_parking_lot/",
        "text": "About a year ago, at the tail end of the pandemic I made the very big mistake of going to Whole Foods at peak hours.\nI’m not sure what the Whole Foods parking lots are like in the rest of the country but I’ve been to quite a few on the east coast and they are all the same 7th level of hell. Is it the clientele? Is it the layout? Is it the urgency to go buy overpriced food? Anyhow..\nThis particular location is an absolute SHIT SHOW and it triggers all types of rage within me. I’ve had several altercations in this parking lot, but this one takes the cake. \nI was patiently waiting to turn into a spot next to a car where the driver (an elderly woman) had her door wide open. I was allowing her the time to get her life together and close the door, so I could pull in next to her. I was waiting for 5 + minutes with my left directional on. \nI then see a car driving towards me coming from the opposite direction. They waited there for maybe a minute, and fucking slid right into the spot I had been waiting for (almost taking the elderly lady’s door off).\nI WENT NUMB. \nRather than brush it off, I just HAD to know why this bitch did this. I waited for her to get out of her car and lowered my window.  “Excuse me, why did you do that? You saw me waiting with my directional”….. she looks right at me..AND FLIPS ME OFF WITH THE DOUBLE BIRD AND SAYS “Sorrrrrryyyyyyy” and continues walking into the store. \nTo quote a fav movie of mine..THE DISHES WERE DONE, MAN.\nI have never in my life experienced the type of rage that took over my body. \nMy knee jerk reaction was the following:\nWhipping my car around to the next row..and parking as far away from her car as I could. Once stopped,I looked around my car for some type of liquid (old coffee, old soft drink cup) but was out of luck. Suddenly, a calm came over me and I knew exactly what I had to do.\nLet me preface this by saying that the only vandalizing I’ve ever done in my life was egging an ex boyfriends house in high school. That’s it. I’ve never stolen anything, and am honest to a fault\nI stepped out of my car, big Meryl Streep sunglasses on, fabulous long flowing coat, wind in my hair, and gracefully walked back to the row this bitch was parked. I never once stopped walking as I flicked my VW key open like a switchblade, walked down the side row of her car and sliced that baby from ass to nose. I dug my key so hard into that car I could hear it . I glanced back to check my work…and it was good. \nI then breezed into Whole Foods looked around for her like a total creep, but then decided that justice had been served. \nThe end.",
        "created_utc": 1677942195,
        "upvote_ratio": 1.0
    },
    {
        "title": "John went out and got a degree",
        "author": "ImbambiBitch",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/11hzksi/john_went_out_and_got_a_degree/",
        "text": "This is the story of our CEO who I admire and respect...became CEO. \n\nHe had been SVP for a few years now, and the owner of the company wanted him to take over as CEO as the owner was going retire and the company was going transition into more of a corporate governing structure, some of this had already been completed. Like they had a board of directors etc.\n\nThe debate over who would be the CEO came down to two people.\n\nJohn: He was hired by this company straight out of college when he was 21, he grew from the bottom up. He had worked in basically every department, lead every department, and understand the company inside and out.\n\nAlex: came into the company as a VP, he has an MBA and experience in the industry. He was the 2nd favorite to become CEO. \n\nIn an early discussion, the board apparently wanted to vote on who would become the interim CEO before the owner retired. They wanted this to be an 18-month run-up as taking over was considered a big deal. Alex knew John was the primary contender and had him beat out by a few votes. So Alex brought up the fact that in the company bylaws, it stated the executive officers (CEO, CTO, CIO, CFO) all had to have college degrees, and therefore John wasn't qualified.\n\nThis caused the meeting come to an end. I believe at this point Alex felt he had John beat. So John went to the owner and had a conversation.\n\nAt the next meeting, the CEO stated he intended on doing one year longer. The board was shocked, but nothing said the CEO had to retire when he said he would.\n\nThat's when John went into action. You see John had 90 college credits. His brother was also the assistant dean at the local community college. John was an English major when this company hired him 35 years prior. The local community college quickly admitted John as a Senior into their English Lit major. Due to John's 35+ years of business three required business classes were given to him. John also loved math he cleped his final math class. This gave John 102 credits....18 credits shy.\n\nSo John enrolled in the 12 credits for the spring semester. He completed those and finished up his last 6 credits in the 8 week summer semster. \n\nIn the Q3 board meeting the CEO announced he was prepared to allow the board to vote on his replacement come the Q4 meeting. The CEO made it clear he considered the two front runners John and Alex. Alex brought up the fact that John needed a degree. John smiled, reached into his briefcase and pulled out his diploma from the community college clearly showing he graduated with honors with a major in English Lit. \n\nIn the Q4 board meeting, John was by a landslide to become the next CEO.\n\nTL:DR John helped build the company, and wanted to be CEO, Alex tried to stop him over a technicality and was clearly the 2nd favorite. John went out and got his degree. \n\nI would of posted this in malicious compliance...but the story has to be about you there...and this story isn't about me. John was just a great mentor of mine and something that I really respected and he shared this story with me over a few beers one night.",
        "created_utc": 1677937809,
        "upvote_ratio": 1.0
    },
    {
        "title": "petty revenge gone wrong... for him",
        "author": "Recklesslove101",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/11hvoqg/petty_revenge_gone_wrong_for_him/",
        "text": "[removed]",
        "created_utc": 1677924213,
        "upvote_ratio": 1.0
    },
    {
        "title": "This was my petty revenge",
        "author": "AutisticMuffin97",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/11hvdc6/this_was_my_petty_revenge/",
        "text": "2 years ago I was engaged and happy. That all came to a crashing halt when I found out my fiancé had cheated on me at a party with a girl he knew from way back in high school. His best friend texted me photo evidence of it happening so he can’t deny what happened. 3 months prior to that we had planned to move in together. 2 nights later we were supposed to move in together at my place. \n\nThe night he was packing his shit up I packed my shit up too. I was renting from an elderly man (super sweet guy) and told him I would not be renewing my lease after I got that text. \n\nMy friends helped load all of my things up and I left. I waited to get a text about why he couldn’t get into the house and why it was vacant. I sent him the picture I was sent I also sent it to his mother, his father, his step mother and his step father. That afternoon I changed my phone number and deactivated my email so he can’t get ahold of me. \n\nHis parents won’t let him move back in with them and he is homeless. Even his best friend isn’t his best friend anymore. \n\nLast I heard he got addicted and is now living in a homeless camp. \n\nTLDR; my fiancé cheated on me, and I disappeared before he could move in and basically made him homeless by letting his parents know what kind of “man” he is. He got addicted and is living in a homeless camp.",
        "created_utc": 1677923045,
        "upvote_ratio": 1.0
    },
    {
        "title": "when should I distance myself from a friend?",
        "author": "faith1107",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/11ht9gn/when_should_i_distance_myself_from_a_friend/",
        "text": "[removed]",
        "created_utc": 1677915771,
        "upvote_ratio": 1.0
    },
    {
        "title": "My boyfriend cheated!",
        "author": "alexialeex",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/11hrd9e/my_boyfriend_cheated/",
        "text": "[removed]",
        "created_utc": 1677909791,
        "upvote_ratio": 1.0
    },
    {
        "title": "My ex boyfriend cheated on me throughout our whole 4 year relationship with his ex before me and more than likely with other girls……what should I do?",
        "author": "alexialeex",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/11hrav0/my_ex_boyfriend_cheated_on_me_throughout_our/",
        "text": "",
        "created_utc": 1677909614,
        "upvote_ratio": 1.0
    },
    {
        "title": "Should I get some petty revenge on a marine?",
        "author": "Pandepon",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/11hp201/should_i_get_some_petty_revenge_on_a_marine/",
        "text": "My partner and I are doing instacart, it’s dark, cold and raining at 10pm. We accepted an order to shop and deliver. The guy only ordered beer. Upon arriving to the store he tries to cancel the order saying that he doesn’t know if the marine base will allow us to complete the delivery. We’ve had no problems in the past delivering to military bases. They typically take information from our ID and license plate number  of the vehicle we’re driving. We notify the customer that if he would like to cancel the order at this point he must contact instacart, otherwise we would attempt to deliver his order. He also says he “doesn’t know how to cancel his order because his wife usually does the shopping on the app”. If we cancel the order in the tab we could be penalized for it, if we spend the time to cancel his order for him through customer service we might get some kind of compensation without getting penalized but that takes time away from us as sometimes we’ve waited an hour for customer service to handle these things and it shouldn’t be on us to do this for a shitty $5 when we could have completed the order in less time. If we attempt to complete the order but cannot we usually get reimbursed for most of the order’s value. I suspect he was trying to dodge a cancellation fee.\n\nAnyway we go in, grab the beer and check out as he didn’t respond to our previous message about making an attempt to deliver his beer (checking out always notifies the customer). He sent a message calling my partner a bitch and said something about his wife does instacart and that we are trying to “play” him. \n\nI was thinking about reporting him to the marines for his online misconduct (name calling and accusing us of fraud for trying to complete an order he placed) as he is clearly not representing the marines with any sort of military decorum. \n\nShould I go through with this type of petty revenge? The marine is in his early 20s and could use some humbling on how to treat civilians doing his beer run for him in shitty weather late at night that he elected to cancel while we were in the middle of completing the order. \n\nWe returned the alcohol to the store and got a hold of customer service saying we did not feel safe to deliver the order as with any alcohol order we must meet the person and scan their ID. Instacart gave us $15 for attempting to complete the order, returning the beer and I suppose dealing with a rude customer.",
        "created_utc": 1677903021,
        "upvote_ratio": 1.0
    },
    {
        "title": "Am I the ass hole for yell at this girl",
        "author": "Weekly-Donkey1480",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/11how13/am_i_the_ass_hole_for_yell_at_this_girl/",
        "text": "[removed]",
        "created_utc": 1677902535,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to fuck over a racist troll",
        "author": "Artistic_Character55",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/11hoq1y/how_to_fuck_over_a_racist_troll/",
        "text": "[removed]",
        "created_utc": 1677902070,
        "upvote_ratio": 1.0
    },
    {
        "title": "Fuck Trannys!(God please don't take that literally)",
        "author": "kbabs1987",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/11hn6i8/fuck_trannysgod_please_dont_take_that_literally/",
        "text": "[removed]",
        "created_utc": 1677897783,
        "upvote_ratio": 1.0
    },
    {
        "title": "My best friends screwed me over on a publication so I removed everything they wrote so I wouldn't have to list them as contributors",
        "author": "No-Mammoth6539",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/11hmmuf/my_best_friends_screwed_me_over_on_a_publication/",
        "text": "[removed]",
        "created_utc": 1677896290,
        "upvote_ratio": 1.0
    },
    {
        "title": "Write me up for staying home during an ice storm? Imma hit you where it hurts",
        "author": "MothertruckingQueen",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/11hm1px/write_me_up_for_staying_home_during_an_ice_storm/",
        "text": "[removed]",
        "created_utc": 1677894694,
        "upvote_ratio": 1.0
    },
    {
        "title": "Petty revenge on brother",
        "author": "bdoz779",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/11hktwq/petty_revenge_on_brother/",
        "text": "My brother and I were close when we were young, that changed when we got into high school. And got even worse when he believed some rumors my abusive boyfriend (granted I didn’t tell my brother what they did) told him. So he started being overall petty to me. He drove an old Tacoma, I got to sit in the jump seats when no one was in the front. Telling our group of friends not to talk to me etc. \n\nI’m not much of an outright mean person. I hate confrontation, and I don’t like saying hurtful things. But I wanted to get back at my brother… so I became pescatarian.  My brother LOVES red meat, pork, etc. and my mom wasn’t about to cook multiple meals. So, red meat became a rarity in our home. He was pissed. He kept telling me to get past my feelings and start eating meat again, because he wants his god damn steak. I kept this up for 3 years, until we both went off to college, i kept it up for a a year after he did, since he came home a lot. \n\nI have since restarted eating meat, I did in college, he was pissed when he heard. And I finally told my brother about my exs, and their abuse. He was nice about it all in the end. I’m now decent friends with him. As decent as one can be with a self proclaimed apathetic asshole. \n\nHope this wasn’t too scrambled. I’m weaning a 17 month old from nursing and 14 weeks pregnant so my brain is utter mush.",
        "created_utc": 1677891499,
        "upvote_ratio": 1.0
    },
    {
        "title": "Yeah dude….",
        "author": "golden_swanky",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/11hkqy8/yeah_dude/",
        "text": "[removed]",
        "created_utc": 1677891280,
        "upvote_ratio": 1.0
    },
    {
        "title": "New step sister thought being horny on Instagram was normal",
        "author": "Caleigh_the_simp",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/11hje57/new_step_sister_thought_being_horny_on_instagram/",
        "text": "[removed]",
        "created_utc": 1677887917,
        "upvote_ratio": 1.0
    },
    {
        "title": "Lack of cooperation works both ways",
        "author": "SquareOrganization33",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/11hfr23/lack_of_cooperation_works_both_ways/",
        "text": "[removed]",
        "created_utc": 1677879430,
        "upvote_ratio": 1.0
    },
    {
        "title": "Ooooppooos, I did it again 😁👊🏼",
        "author": "golden_swanky",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/11hfp6d/ooooppooos_i_did_it_again/",
        "text": "[removed]",
        "created_utc": 1677879307,
        "upvote_ratio": 1.0
    },
    {
        "title": "1st grade teacher and squats.",
        "author": "MinnieCreations",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/11heufh/1st_grade_teacher_and_squats/",
        "text": "This all happened in between 2008-2009. My teacher in 1st grade Mrs. M, would makes us hold a squat for 20 minutes for any minor wrong action you did. if you broke that squat, time started over with 5 minutes added. Her friend next door Mrs. B was worse it was 1 hour she made her kids hold it. Well I informed my grandparents and my grandmother told me \"if they ever threaten that with you, you tell them to call me\". \n\nFast forward, my teacher along with others had lunch duty, so (3 classrooms in 1) went next door to Mrs. B, We were reading a dinosaur book out loud. I was mouthing the words. Mrs. B told me \" Ms. T, you better start actually reading out loud or your going to hold a squart.\" I told her what my grandmother told me to do in that situation. She called my bluff and called my grandmother. Mrs. B explained the situation to my grandmother. (My grandmother was not on speaker) Mrs. B kept trying to argue with my grandmother. we all stopped reading because you could hear my grandmother cussing her out. They never threatened me with that again.",
        "created_utc": 1677877369,
        "upvote_ratio": 1.0
    },
    {
        "title": "Cookie, with a little extra.",
        "author": "Significant-Can-3960",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/11hdhoh/cookie_with_a_little_extra/",
        "text": "So I used to work with this woman who was so miserable to me (she pretty much never acknowledge we shared the office). I had to do part of her work, and pretty much she never talked to me. I complained to our supervisors but nothing happened, to the point that I decide to left the job. \n\nHowever, the last time I saw this horrid woman, and just 2 days before Covid shut down our office, a  nice coworker stopped by with cookies and left her a cookie on top of her desk as she was on break. As soon as this coworker left, I grabbed and licked the cookie and out her back on her desk.\n\nI was hoping I had Covid just so I could have given it to her, but no, only saliva!  Hope she enjoyed it, I did.\n\nSorry for the grammar, not a native English speaker.",
        "created_utc": 1677874336,
        "upvote_ratio": 1.0
    },
    {
        "title": "Be grateful…or learn to love walking",
        "author": "NobodyKnowsMeOutHere",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/11hbthl/be_gratefulor_learn_to_love_walking/",
        "text": "Yesterday, while fighting a cold and standing at the school bus stop to meet my children, I met a foul-mouthed woman who was on the phone with elementary school staff about why her son (grandson?) didn’t get on the bus that afternoon. The bus had already left so there wasn’t much that the school could do. Once this woman hung up on the receptionist she called a family member who explained that this woman didn’t do what was agreed upon, immediately realized her mistake. There was a discussion between them about how to pick up the child without a car. I just wanted to walk my kids home and pour myself into bed and let my wife, who is also fighting the same cold, manage homework duties for the kids. Still, I couldn’t help but wonder about this kid, who was stuck at school because of this woman, would get home. I told the woman I live across the street and once my sons have crossed the street I’ll get my car and we can pick up her (grand)son. As soon as I made the offer I was her ”best friend”. \r\n\r\nAs we drove to school she said “I bet you reslly like your job” to which I thought “which one”, “how do you know what I do”, and finally “don’t engage she’s just making small talk”. A few minutes later I lost my resolve and asked her what she thought I did to which she answered “oh, I don’t know” in a sing-songy voice.\r\n\r\nWe arrived at the school where she promptly exited the van, met the child and got back in the van, only closing the door upon reentering the van. It seemed a little odd that she didn’t close the door but it was only a few seconds. As we worked our way back to the bus stop she asked for us to stop at the convenience store for “refreshments”, where she left the door open again. She knows I just want to get home and sleep so I declined her offer. I realize that life without a car makes shopping a lot harder, so I was happy to help. About 10 minutes pass before it occurs to me that this impromptu pit stop is taking way too long. So, I stick my head in the door to see what is going on and I heard all I needed to know to justify my next action: “$40.81 please”. What refreshment costs $40?! This twit who dropped the ball on picking up her (grand)son is doing her weekly shopping at a convenience store! So I waited another 30 seconds and went home. Unknown to her my disabled wife who is fighting the same cold is sitting on the couch and she needs to go to the bathroom. So I went home to take care of her.\r\n\r\nToday, as my sons and I headed to the donut store for our weekly donut they discovered a cell phone and backpack on the rear bench seat. I had no idea they were there. When we arrived at school I spoke with the receptionists about this woman whom they could easily identify.\r\n\r\nTo the entitled, ungrateful woman who abused my generous offer: the phone and backpack aren’t at school. They’re not in my possession. Perhaps an apology to the receptionist at the elementary school will help you in your search to retrieve your abandoned property.\r\n\r\nTo the little girl with the foul-mouthed (grand)mother who rode with us yesterday: it’s not normal or acceptable to use profanity around children. Please don’t pickup on this vulgar habit.\r\n\r\nTo the community: I’m working on starting a taxi service for people who need rides to or from medical appointments, but don’t have the means to do so. I’m confident my passengers will be more grateful than this woman.",
        "created_utc": 1677870483,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to train your Puppy",
        "author": "patriotoneT",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/11hb3as/how_to_train_your_puppy/",
        "text": "[removed]",
        "created_utc": 1677868999,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to sign someone up for spam calls",
        "author": "starsalikeog",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/11h7nt0/how_to_sign_someone_up_for_spam_calls/",
        "text": "[removed]",
        "created_utc": 1677864869,
        "upvote_ratio": 1.0
    },
    {
        "title": "Get rid of spam calls, Spam Caller For Insurance called me twice this morning 10 minutes apart and woke me up. Second time I asked for her personal number since they bother me on mine",
        "author": "Ia_ja",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/11h3bwo/get_rid_of_spam_calls_spam_caller_for_insurance/",
        "text": "Now I’m awake and mad because I was sleeping really good.\n\nI’m pretty sure they blocked my number because I tried calling back to really tell them never to call me again but I can’t even do that it tells me I was put on a do not call list and if I want a copy of their legal policy press 2\n\nSo hopefully they never call me again thank the lord\n\nI had vaguely looked at health insurance around 4 years ago and the calls flooded my phone to the point I couldn’t even use it.\n\nI blocked the numbers and now I still get around 4 calls and 3 text a day, annoying but manageable.\n\nThey never call me back to back though. However this morning was different.\n\nThis morning,\n\nMy phone rang and I didn’t even bother to look then I started to fall back asleep 10 minutes later it goes off again this time I answer\n\nHer: “This Marion looking for so and so are they there?”\n\nMe: yeah what do you want?\n\nHer: I see you requested an insurance quote\n\nMe: What’s your number?\n\nHer: Well this is our number but if you get disconnected you can call back 888-880-8888\n\nMe: No,No, No. What’s Your Number?\n\nHer: mmmmm…. Well you can call 888-888 and ask for-\n\nMe: - What’s YOUR number?\n\nHer: what do you mean?\n\nMe: YOUR NUMBER, Your personal number, so I can call you while you’re not at work and sleeping and call you back to back and wake you up.\n\nHer: super fast ok ok ok ok hangs up\n\nI don’t see the problem? Why the freak out? Don’t want me calling you on your personal number like you call me? Isn’t that only fair?\n\nI looked through my call log they call my twice a day everyday.\n\nBut never at this time that’s probably why I haven’t noticed it’s usually in the late afternoon also never 10 minutes apart. Usually 3 hours.\n\nI tried calling them back to be serious and tell them seriously don’t call me because now I’m awake and mad.\n\nTurns out I can’t even call them anymore\n\n“ Hi, You’ve been put on the do not call list. Press 2 for our legal policy. Goodbye” hangs up\n\nI said what I did this morning out of sarcasm and annoyance but\n\nNow I know what I’m asking the spam call people, I have said to be put on do not call before and it doesn’t work they just call from different numbers or a different rep.\n\nI don’t see why it was such a big deal? Isn’t it only fair I get to call you too while you’re not at work?",
        "created_utc": 1677856859,
        "upvote_ratio": 1.0
    },
    {
        "title": "Get rid of spam calls, Spam Caller For Insurance called me twice this morning 10 minutes apart and woke me up. I hung up out of second time I asked for her personal number since they bother me on mine",
        "author": "Ia_ja",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/11h3029/get_rid_of_spam_calls_spam_caller_for_insurance/",
        "text": "Now I’m awake and mad because I was sleeping really good.\n\nI’m pretty sure they blocked my number because I tried calling back to really tell them never to call me again but I can’t even do that it tells me I was put on a do not call list and if I want a copy of their legal policy press 2 \n\nSo hopefully they never call me again thank the lord\n\nI had vaguely looked at health insurance around 4 years ago and the calls flooded my phone to the point I couldn’t even use it.\n\nI blocked the numbers and now I still get around 4 calls and 3 text a day, annoying but manageable.\n\nThey never call me back to back though. However this morning was different.\n\nThis morning,\n\nMy phone rang and I didn’t even bother to look then I started to fall back asleep 10 minutes later it goes off again this time I answer\n\nHer: “This Marion looking for so and so are they there?”\n\nMe: yeah what do you want? \n\nHer: I see you requested an insurance quote \n\nMe: What’s your number?\n\nHer: Well this is our number but if you get disconnected you can call back 888-880-8888\n\nMe: No,No, No. What’s Your Number? \n\nHer: mmmmm…. Well you can call 888-888 and ask for-\n\nMe: - What’s YOUR number? \n\nHer: what do you mean?\n\nMe: YOUR NUMBER, Your personal number, so I can call you while you’re not at work and sleeping and call you back to back and wake you up. \n\nHer: *super fast* ok ok ok ok  *hangs up*\n\n\nI don’t see the problem? Why the freak out? Don’t want me calling you on your personal number like you call me? Isn’t that only fair? \n\nI looked through my call log they call my twice a day everyday.\n\nBut never at this time that’s probably why I haven’t noticed it’s usually in the late afternoon also never 10 minutes apart. Usually 3 hours.\n\nI tried calling them back to be serious and tell them seriously don’t call me because now I’m awake and mad.\n\n\nTurns out I can’t even call them anymore \n\n“ Hi, You’ve been put on the do not call list. Press 2 for our legal policy. Goodbye” *hangs up*\n\n\nI said what I did this morning out of sarcasm and annoyance but \n\nNow I know what I’m asking the spam call people, I have said to be put on do not call before and it doesn’t work they just call from different numbers or a different rep. \n\nI don’t see why it was such a big deal? Isn’t it only fair I get to call you too while you’re not at work?",
        "created_utc": 1677855992,
        "upvote_ratio": 1.0
    },
    {
        "title": "Hi",
        "author": "Character-Pilot-4261",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/11h2ahu/hi/",
        "text": "",
        "created_utc": 1677854120,
        "upvote_ratio": 1.0
    },
    {
        "title": "I finally yelled at the old lady who keeps telling me how to handle my dog at the park and it felt good",
        "author": "yeetmedeet",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/11gz48f/i_finally_yelled_at_the_old_lady_who_keeps/",
        "text": "I need to give a little background here. I live in Europe and I got a dog last summer because I was approved for a government-issued service dog. (Basically, the state pays for my dog's education to become a service dog.) It was a huge deal for me to expose her to as many dogs as possible from a young age. She's a welsh cardigan corgi so of course, I got excited when one day, I saw someone at the local park with their Pembroke corgi. I went to say hello and our dogs played together. All was fine, but then this old lady who owned the other dog started talking down to me about how to train my dog. Since I have a professional trainer due to the whole service dog thing, I kinda just brushed it off, nodded, and went on my merry way. And I want to point out that I don't mind tips about how to train my dog, that is very much welcomed, but that isn't what this old lady does. She speaks to me like she knows best and if I don't do it her way, there's no right way to do anything.\n\n&amp;#x200B;\n\nThis is how she has been almost every time I've met her. She talks to me like I'm an idiot who doesn't know anything about dogs and as if she knows best about everything. I haven't explained to her that my dog is in training as a service animal because honestly, it's none of her business. Plus, my dog is a puppy, of course, she's a monster right now. But I sort of always just brushed off her comments and went on with my day.\n\n&amp;#x200B;\n\nToday, I finally had enough. The old lady goes for her morning walks through the local park at about the same time as I do and when my dog sees hers, she gets excited and wants to play. So we go to them and they play for a bit before we move on. The old lady even throws a ball to my girl, which gets her even more excited and anyone who knows corgis, also knows that they bark. A lot. Especially when they're excited. I usually throw some treats in the grass for my girl to find to get her to shut up when I talk to people, and I did this today as well. This old lady's dog, another old lady's dog, and my own then go on their sniffing adventures and we all stand there and look at them as they do and as I throw out some more treats. We move on through the park, I throw some sticks for the dogs and play with them while the old ladies talk. (Once again, the Pembroke lady gives me a few crude comments about my dog and her PUPPY behaviour, but whatever, I just brush it off as I usually do.)\n\n&amp;#x200B;\n\nAfter a bit, the dogs get bored with the sticks and I throw out some more treats for them. Of course, I would never do this if any of the dogs had resource defense issues but I know for a fact that none of these dogs do and both of these old ladies just watched me throw out several handfuls of treats so I figured, no issues, but then the famous first old lady suddenly flips her shit. She gets really mad and puts her leash back on her dog. This is when I figured play time was over, I shake my head at her and I walk off with my dog. But I was SEETHING inside. I finally had enough of her constant berating me and I couldn't take it anymore. So, I turned back, went straight to her face, and asked her what her problem with me exactly was since she always had to talk to me like I was an idiot who didn't know how to train my dog. The old lady then complains about my dog barking when she's excited (which was extra hilarious to me, considering her Pembroke just barked her little lungs out over the sticks I was throwing to the dogs) so I tell her directly, \"Listen, if you don't want my dog to come to you, then just tell me that your dog shouldn't be saying hello right now, that's totally fair, but you never do that, do you? No, you throw balls at my dog and play with her, so, of course, she gets excited!\" then she went directly to her issues about the treats being thrown out and claimed that she hadn't seen me to it earlier. Which is a lie, and I know for a fact it was because she was standing right there and looking at it, but that wasn't my point, so I told her to drop it, because clearly, she had some issues with me, since she always had to correct me on how to train my dog and talk down to me. I told her, right there to her face, \"The training of my dog is none of your goddamn business.\" And then I turned around and walked home.\n\n&amp;#x200B;\n\nThe weird part is that despite my anxiety diagnosis, my autism, and all of my social handicaps, it felt really, really, *really* good to finally snap at this old hack and let her know that her high-horse bullshit behaviour was.. well, bullshit.",
        "created_utc": 1677845322,
        "upvote_ratio": 1.0
    },
    {
        "title": "Math assistance requested to exact my petty revenge",
        "author": "TheEmptyMasonJar",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/11gyxei/math_assistance_requested_to_exact_my_petty/",
        "text": "I haven't had to do significant math in a long time, and I'm trying to remember functions or something function adjacent in order to stick it to a company I'm no longer believe is pricing fairly. \n\nI have 5 items I'd like to return, but the restocking fee is $3.99 per item. I'm trying to decide at what point keeping one, some or all the items makes financial sense for me. I want to maximize my return value. \n\nI remember there being some set up you could do with math that involved a graph and a function and you could determine the tipping point value at the bottom of the parabola graph. It's sort of in my head, but it's real fuzzy. Sort of like is it cheaper to buy ten shirts a $7 vs buying five shirts at $9 dollars, something like that. \n\nI'm sure if I sat down and tinkered with the numbers for a bit, I could get there, but if I could get some help remembering how to set up the equations in relation to one another, that would likely be more accurate and I feel more potently petty. \n\nDoes anyone know what I'm talking about? I clearly don't. lol \n\nThanks!\n\n&amp;#x200B;\n\n**Faux Data Set**\n\nItem One   | $10.00\n\nItem Two   | $15.00\n\nItem Three | $20.00\n\nItem Four   | $25.00\n\nItem Five    | $30.00",
        "created_utc": 1677844780,
        "upvote_ratio": 1.0
    },
    {
        "title": "I finally yelled at the old lady who keeps telling me how to handle my dog at the park and it felt good",
        "author": "[deleted]",
        "url": "",
        "text": "[removed]",
        "created_utc": 1677836737,
        "upvote_ratio": 1.0
    },
    {
        "title": "screw tow truck companies",
        "author": "Appropriate_Ad3300",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/11gvpxs/screw_tow_truck_companies/",
        "text": "Not sure if this fits here, but I was driving a beat up 95 jeep for work. I was moving stuff for work one day and I had a coca cola provided refrigerator inside. I stopped by to get some lunch between transfers and my car got stolen. Some tow company found it and called me a few days later asking me for 2 thousand dollars to get the car back with it's contents. The owner didn't want it back and neither did I. I knew that they couldn't sell the refrigerator. A few days later once they found out the same, they called me begging me to take the car back with the refrigerator and they only asked me for 200 bucks. We still didn't take back. Fuck tow truck companies.",
        "created_utc": 1677832929,
        "upvote_ratio": 1.0
    },
    {
        "title": "I used urinal etiquette to fight a racism accusation",
        "author": "Gondwa54",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/11gsj2u/i_used_urinal_etiquette_to_fight_a_racism/",
        "text": "[removed]",
        "created_utc": 1677821724,
        "upvote_ratio": 1.0
    },
    {
        "title": "Squirrels Get Revenge For Us!",
        "author": "DearBanana2532",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/11gs7i9/squirrels_get_revenge_for_us/",
        "text": "[removed]",
        "created_utc": 1677820744,
        "upvote_ratio": 1.0
    },
    {
        "title": "College Work Study Hangover",
        "author": "Sure-Victory7172",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/11gpz04/college_work_study_hangover/",
        "text": " \nI had a work study job in the fitness center at a small state university in Southern Ohio. Basically, it was answering the phones, signing out equipment, checking ID’s, keeping the weight room and cardio areas straightened out, etc. Most of the time, it was a laid-back job that didn’t require much effort, except Saturdays during the high school swim meet season. These were the worst.\n\nThe high schools in the area would have their swim meets at our Natatorium since it could accommodate all the teams at once. The student athletes themselves were not the problem. It was their parents and their younger siblings. The parents would bring their younger elementary aged kids with them and let them run amok all over the place since they were too cheap to get a babysitter. It was like Lord of the Flies in a college gym setting with them screaming, running around unsupervised, getting into everything. Most Saturdays, I was not in the mood to deal with that type of chaos since I was usually nursing a hangover from partying the night before. There was even one instance where these two brats thought it would be cute to piss on the rocks inside the men’s sauna. Yeah, imagine dealing with cleaning up that mess.\n\nOne Saturday morning, hungover and not exactly in the mood to put up with a bunch of “high maintenance” parents, I'm at the front desk and see some of the parents lugging in folding tables and several boxes of snacks to set up their own little snack bar right there in the lobby. Nice little impromptu fund raiser for some of the enterprising booster parents: pop, chips, candy, pretzels, etc. Never mind, there were already several vending machines in the lobby that sold the exact same items. What really aggravated me was they didn’t even ask if it was ok, guess they thought since their schools are paying to rent the swimming pool each Saturday then they had free reign to do whatever they wanted like they owned the place. That’s what really pissed me off about it, their body language/sense of entitlement and their nonchalant attitude about the whole situation, like us college students were somehow “beneath them”.\n \nMonday morning, I checked with my supervisor to ask if he knew anything about it, and he didn’t, cue petty revenge plot. The food service company (rhymes with Aardvark) contracted with the university has first right of refusal to set up a snack bar for the entire campus aka same way they’d operate a snack stand for the basketball games, volleyball games, etc. I knew several student employees who worked for them, and I also knew how they did their contracts. That’s the cool thing about going to a small university. After you’ve been there for a while, you get to know a lot of people and how things operate.\n\nI typed up a nice little anonymous letter to “Aardvark” informing them of this rogue snack stand encroaching on their turf and slid it underneath their office door after hours. I’m assuming “Aardvark” sent them a “cease &amp; desist” letter since the next time there was a swim meet and the rest of the swim meet season there was no more booster snack bar.",
        "created_utc": 1677814174,
        "upvote_ratio": 1.0
    },
    {
        "title": "Roommates stopped contributing, so we left them nothing",
        "author": "Not_A_Bimbo",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/11gktdj/roommates_stopped_contributing_so_we_left_them/",
        "text": "This happened during my junior year of college. I (Claire) lived with five other women. (I'll call them Abby, Brooke, Dani, Ella, and Fran.)\n\nWhen we signed the lease on the house, we agreed to a one-year deal (June 1-May 31). The house was off-campus and unfurnished, so we needed things to make it feel like home. Prior to moving in, we all sat down and decided what we needed for the house and who was going to bring what and also settled on a chore schedule. We also decided that we'd have a household supply fund set up so we could buy things we all would use like toilet paper, paper towels, dish detergent, and laundry detergent. As it turns out, Dani, Ella, Francesca and I brought most of the stuff we needed like a couch, small dining table, dishes, silverware, drinking glasses, cookware, food storage containers, etc.\n\nThings went pretty well during fall semester. Shortly after that, however things started to decline. Abby's boyfriend Andy basically moved in with us and the two of them started acting like they owned the place. Left a dirty dish in the sink? They'd leave a passive-aggressive note about how rude it was to do that. Come home after the library closed at midnight? Abby and Andy went to bed at 10 and if you woke them up there was hell to pay. Pretty soon, Brooke and her boyfriend Brad were acting in much the same way. \n\nBy early February, it was clear to Dani, Ella, Fran, and me that we did not want to live with Abby and Brooke another year. The four of us found a different off-campus place and signed a lease. We let Abby and Brooke know and from then on, the two of them, plus their boyfriends, went from partial jerks to complete jerks. They'd do things like stop the clothes washer mid-wash, take our clothes out, dump them on the floor, and start their own laundry. They'd use up all the hot water by taking super long showers. They'd write \"return to sender\" on our mail. They destroyed flowers our boyfriends sent or brought to us. They refused packages. They stopped contributing to the shared supply fund and stopped doing chores. \n\nAbout a  week before Memorial Day, Ella got a call from the landlord on our new place saying the previous tenants had moved out and we could move in early if we'd like at no charge. Dani, Ella, Fran, and I discussed it and decided to get out of our current house ASAP but didn't tell Abby and Brooke of our plans.\n\nMemorial Day weekend rolls around and Abby, Brooke, and their boyfriends head out of town to go camping while the rest of us put our plan into action. With the help of friends, Dani, Ella, Fran, and I got all of our stuff moved out. And when I say all, I mean **all**\\--living room furniture, dining room furniture, dishes, silverware, cookware, food storage containers, baking supplies, shower curtain, rugs, lamps, vacuum, broom, dustpan, etc. We also decided that since neither Abby nor Brooke had contributed to the shared household supply fund since March, the toilet paper, paper towels, dish detergent, laundry detergent, and so forth was ours, so we took all of that too. \n\nAbby, Brooke, and their boyfriends were shocked to return from their camping trip to an empty house. What made our petty revenge even sweeter was that on their way home from the camping trip, all four of them got food poisoning and were really, really sick. The scathing texts we got about moving out unannounced AND taking all shared household goods--especially the toilet paper? Priceless. Dani, Ella, Fran, and I are great friends still get a good laugh about the situation about 12 years later. None of us have heard from Abby or Brooke since graduation.",
        "created_utc": 1677800697,
        "upvote_ratio": 1.0
    },
    {
        "title": "\"Can you EVEN get enough people in here?\"",
        "author": "10Kfireants",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/11gkr1x/can_you_even_get_enough_people_in_here/",
        "text": "Sorry for the length, explaining the Northern Midwest here. TL;DR we didn't and they didn't think we could fire them, we found out we were wrong, did that and keep packing our place while they miss out on sweet money \n\nMy boss owns a restaurant that I do events and marketing for.\n\nIn our state, if your restaurant has a bingo, raffle, etc., a registered nonprofit has to conduct it -- basically any \"gambling;\" gambling is any game of chance that you pay to play. Free drawings? We can do those. $1 raffle ticket? Must go through nonprofit/they get the ticket money. Our biz is in this little township that has an additional city ordinance: Your restaurant's chosen nonprofit HAS to operate in the township. That way, $$$ stays here and doesn't go to an org in the nearby city. It's a great principle and sentiment, but this is important in the story.\n\nThere's also a craze here of what I'll just call chance cards ... like scratch tickets but you pull the tab up to see if you won. They're CRAZY here, and you make way more from having a live person selling them at a booth than just from a dispenser machine. It's very cold in the Northern Midwest and we need simple things to bring us joy, OK?\n\nSo my boss wanted to hold more raffle events that have one prize: various kinds of meat. Look it is VERY COLD and we need joys like winning meat at the bar, ok? Our chosen nonprofit's gambling manager gave the runaround. My boss had reviewed the list of nonprofits, but the only one with our township's zip code was this one. Finally we ran into gambling manager when he was checking our ticket machine at the restaurant. He gave me his number. I called later, and his first words were how \"hard\" raffle events are. I said hey, just tell me so in writing, and I'll ask the city for an exception to their ordinance. Suddenly he said, \"well I didn't say it was *impossible* !\"\n\nThe next time we talked was 3 pm and he looked around the restaurant -- which had a typical crowd for 3 pm -- and asked, \"do you think you can *get* enough people here for an event like this?\" He laid down his rules that he buys the meat from a local grocery chain -- not the locally famed meat market, he doesn't get along with them. He buys whatever is on sale that week, no promises on what we'll get. And we only got 5 raffle rounds. He didn't want to waste money on prizes for no one to come. \n\nWe promoted the event on Facebook and it immediately took off. We met with him again and he said, \"well that's who's interested, not *attending* .\" He let us know that the employee he had coming **had** to leave the booth where she sold tickets at one of our competitors, and that was if he could get her to work our event. He asked my boss what we'd do if he couldn't come up with staffing, until I finally said I'd work his event if I had to. \n\nNight of meat raffle, there was not a table to be had. The lady running the raffle whisked in, told me **not** to post any pics of her (assuming since her allegiance was to our competitor) and just as I was texting my boss the great turnout ... it was over. 30. Minutes. \n\nThe next day Gamble Guy texted me to congratulate on how great the event went. I sent our concerns: grocery store meat, the event ended in 30 minutes and the person conducting it literally told our staff how she was missing out on tips from our competitor. He had a bunch of rebuttal, **but then** told me how excited he was to do these events every week??? We had a great event... but decided we could and would not do this weekly. Gambling guy proceeded to text me back 4 more times telling me we lied to him when we expressed a \"maybe\" interest, and how we were making a huge mistake... in our restaurant... that he didn't own.\n\nNeedless to say, we took a harder look at that list of nonprofits after that. I was **ready** to talk to city council about how we needed an exception. But some regular customers asked why we didn't just use the other nonprofit that our other competitor used? \n\nSure, the only dang available P.O. Box was in the nearby city. But all their operations are in our township and that's just fine with local gov! Gambling guy's whole, \"this is how I do things and I'm the only option you have,\" attitude wasn't our only option after all. In fact, the first thing New Nonprofit asked was whether we'd be interested in adding a live booth to sell chance tickets. \n\nA restaurant regular asked if he could bring up our qualms to the board president before we took action. The board president told our regular they couldn't just set up a live booth to sell chance tickets when *they didn't think we'd get enough people in* to be worth it. The rest of it was me emailing the president, him telling gambling guy to make it right with me and gambling guy yelling at me in front of patrons. It took everything I had not to fire him right there.\n\nOne month later, a line of 40 people deep waited to buy chance tickets from the new booth attendant. Our oft-neglected ATM straight up ran out of cash. We keep packing the place again for our ticket booth (we're VERY COLD AND EASILY ENTERTAINED). Customers are excited for the next raffle event, which we've promised will come from the local meat market and last twice as long. Can we EVEN get enough people in to make it worth it?! Our new nonprofit hasn't complained ;).",
        "created_utc": 1677800560,
        "upvote_ratio": 1.0
    },
    {
        "title": "Bombard this Karen with calls please +1 (416) 524-7383. She wants to kick me out, keep her busy.",
        "author": "Awkward_Matter_3925",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/11ghi39/bombard_this_karen_with_calls_please_1_416/",
        "text": "",
        "created_utc": 1677796467,
        "upvote_ratio": 1.0
    },
    {
        "title": "I let a homeless friend move in and now I’m homeless",
        "author": "Throwawayaway2323232",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/11gghdr/i_let_a_homeless_friend_move_in_and_now_im/",
        "text": "[removed]",
        "created_utc": 1677795382,
        "upvote_ratio": 1.0
    },
    {
        "title": "my mom’s ex-fiancée treated her like garbage, and they finally broke up. now i get to mess with him from 9 states away.",
        "author": "venomoussunsets",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/11gfe9c/my_moms_exfiancée_treated_her_like_garbage_and/",
        "text": "[removed]",
        "created_utc": 1677794225,
        "upvote_ratio": 1.0
    },
    {
        "title": "Friend’s girl friend is such a drag.",
        "author": "OkOutlandishness1363",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/11gd4iy/friends_girl_friend_is_such_a_drag/",
        "text": "*note* I cannot begin to describe what this girl has done to our friend and his own friendships. She has done awful things to all of us, probably why we don’t like her. The term “not meant to get along” doesn’t apply. We have no desire to get along because it’s just not possible for her to get along with anyone. She copies how I dress and my makeup and hair. She’s a weirdo fs. \n\nI(33f) have a lot of the same friends as my bf(33m). This particular friend(29m) has a long term gf(33f) who is just awful. She is one of those women that doesn’t have one single close in her life. She is the ULTIMATE pick me bitch. \n\nThe best description I can give of her line of thinking is this; \niDoNtLiKeDrAmAaNdHaTeWoMeNiMoNeOfThEgUyS. \n\nLiterally not a single person in our entire friend group likes her. She is like so trashy but doesn’t think she is. Their family is just seriously beyond the scope of leaking trash bags. \n\nIt’s hard to describe her personality. She hates myself, my bf and another friend(31m) because we wouldn’t let her bring her 13yr old cousin to a party for a 25yr old. She has decided that I am her sworn mortal enemy. \n\nHer sister is FOURTEEN and their mother allowed her to drop out of school in the 7th grade. She is ALLOWED at parties with them, she drinks and smokes weed and vapes so none of us go. \n\nOk onward to story-\n\nShe forced friend to build her 2 chicken coops. She got obsessed with that I guess. In the summer she puts eggs in a fridge by the road with a sign and lockbox for the $$. \n\nDuring the egg shortage, damn near everyone that drove by stopped and got some. \n\nThe next day I made my move. I showed up right after she stocked the cooler and left for work. \n\nLet me just say- this ding dong supreme doesn’t know how to drive. I don’t mean like manual or shifting on a rec vehicle. She cannot drive AT ALL.\n\nI took every single egg and dropped it on the ground. It was painstakingly slow but so worth it. \n\nShe posted about it on Facebook, she was big big mad. Do I care she got mad? No. Idgaf lol. She still doesn’t know it was me.",
        "created_utc": 1677789088,
        "upvote_ratio": 1.0
    },
    {
        "title": "M-I C-K-E-Y",
        "author": "xboxgamer2122",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/11gcv36/mi_ckey/",
        "text": "\n\nIn my son’s high school there was a science teacher (I’ll call her Mrs. Corn) that everyone hated. She was an absolute witch. If she took a disliking to you, it would be a long hard semester. She would assign chores to the students who were on her fecal roster (AKA Shit List), making them stay after school to do things like clean out the animal cages that became disgusting after only a few days, or polish the wooden desks with a lemon fresh cleaner. Chores that she was supposed to do. \n\nHis best friend, Michael, got into trouble with Mrs. Corn for something he didn’t do, even though there were witnesses, and he was punished by having to stay after school for a whole week. Rather than fight it, Michael decided to give the illusion of cooperation that he was OK with the punishment. It wasn’t until the third day that he saw his opportunity for revenge. There was a Corn Snake in a glass tank that had to be fed once a week. The food was a frozen mouse (in a box labeled “Gourmet Rodent” of all things) but the mouse needed to be thawed before feeding it to the Corn Snake. To do this, you were supposed to put the frozen mouse, still in its plastic wrapper, into a bowl of warm water and feed it to the Corn Snake after unwrapping it once it was thawed. The water would be heated in the microwave in the teacher’s lunch room, and then brought back to the classroom to thaw the mouse. Mrs. Corn assumed Michael knew the drill (he did) and didn’t bother to explain the proper way to thaw the frozen mouse to him. She just told him to get the frozen mouse from the freezer to feed the Corn Snake. \n\nCue petty revenge: \n\nMichael, fully aware of what he was doing, dutifully took not only the bowl, but also the frozen mouse to the teacher’s lunch room, to use the microwave to warm the water. Instead of putting water into the bowl, he removed the mouse from the wrapper and put the bowl with the frozen mouse into the microwave. He set it for ten minutes and went back to the classroom. When Mrs. Corn saw he didn’t have the thawed mouse, she asked him where it was, and he told her it was warming up in the microwave. She ran out of the classroom to the teacher’s lunch room, but it was too late. The mouse had exploded in the microwave. There were teachers there who had heard the “Poof”, and when she rushed in they were already eyeing the “Gourmet Rodent” box and the disgusting interior of the microwave, and connecting the dots. \n\nMrs. Corn quickly assured them that she would make the student clean the mouse guts from the microwave, but they informed her there was no way they were ever going to use it cook their food again. Michael and his parents apologized profusely, but they did not offer to replace the microwave, since Mrs. Corn hadn’t instructed him on how to thaw the mouse, and because of that he couldn’t possibly be held accountable. In the end she had to buy a new microwave for the teachers to use. \n\nFootnote: Michael’s new nickname at school became “Mickey”, a name he still uses to this day.",
        "created_utc": 1677788478,
        "upvote_ratio": 1.0
    },
    {
        "title": "Inaction can be evil too",
        "author": "dmattox10",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/11gc6hi/inaction_can_be_evil_too/",
        "text": "[removed]",
        "created_utc": 1677786914,
        "upvote_ratio": 1.0
    },
    {
        "title": "Could you put out your cigarette?",
        "author": "ratherBwarm",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/11g9hqs/could_you_put_out_your_cigarette/",
        "text": "[removed]",
        "created_utc": 1677780470,
        "upvote_ratio": 1.0
    },
    {
        "title": "Streaming service didn’t work and wouldn’t reimburse me",
        "author": "CriticalWorker9833",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/11g7t8g/streaming_service_didnt_work_and_wouldnt/",
        "text": "I signed up for a British streaming service in the summer of 2019 for my husband. I knew he would like the British dramas and he was recovering from radiation, etc, so I paid upfront for a year ($98). You had to access this through an Apple box and we tried several times and it would just buffer. I contacted them for help and they advised me to upgrade my Apple box ($250). I asked to cancel so they said yea, after the year was up they wouldn’t continue the service. If I had signed up for monthly service I could have cancelled immediately so this did annoy me. \nEarly Fall my husband passed away. I took it upon myself as a distraction to comment on Facebook every time I saw their ads. I would read comments and reply that people should only take monthly membership because their could be streaming issues and if so, they wouldn’t be reimbursed. I was polite and didn’t slander the company, just pointed out what had happed to me. I must admit I probably posted 100s of replies because it became a vendetta. \nCome December I get a DM from them asking what my problem was. I explained again and they said they had reimbursed me. I checked my card and they had reimbursed the tax ($13). I messaged back and got a big apology and then the rest of my money was reimbursed. They didn’t ask me to stop commenting but I did.",
        "created_utc": 1677776462,
        "upvote_ratio": 1.0
    },
    {
        "title": "🍑 or 🍒? check the link😉",
        "author": "rooseberryy",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/11g687p/or_check_the_link/",
        "text": "[removed]",
        "created_utc": 1677772655,
        "upvote_ratio": 1.0
    },
    {
        "title": "Italian cyclist Antonio Tiberi fined after killing San Marino tourism minister’s cat with air rifle",
        "author": "bigalphamale789",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/11g66uw/italian_cyclist_antonio_tiberi_fined_after/",
        "text": " \n\n**Professional cyclist Antonio Tiberi has been fined and suspended from his team for shooting dead a minister's cat in San Marino.**\n\nThe 21-year-old rider reportedly said he was trying out an air rifle and pointed it at the cat's head and fired.\n\nThe ill-fated feline belonged to his neighbour, San Marino's tourism and posts minister Federico Pedini Amati.\n\nA court fined Mr Tiberi €4,000 ($4,250; £3,500) and his team Trek-Segafredo suspended him for 20 days. \n\n&amp;#x200B;\n\nWhat are your thought about this crazy man !!! i think his sponsor should give up !! I would not buy nothing from company who sponsor this killer",
        "created_utc": 1677772564,
        "upvote_ratio": 1.0
    },
    {
        "title": "my ex best friend dated my ex, and now he dumped her",
        "author": "Muted-Charity8100",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/11g3tfy/my_ex_best_friend_dated_my_ex_and_now_he_dumped/",
        "text": "[removed]",
        "created_utc": 1677766502,
        "upvote_ratio": 1.0
    },
    {
        "title": "Woman slandered my name to push me in a relationship with her.",
        "author": "mcbridejm83",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/11g3prq/woman_slandered_my_name_to_push_me_in_a/",
        "text": "A dude I used to be friends with had a sister that apparently liked me or something and had a funny way of showing it. They got some wild hair up their ass about me and I was getting heat from their direction. I'm not going to a grown adult to work out their problems for them. so I gave them some space. But year later She tried to actively catfish me around town, with some chick they told everybody I was stalking, while that same chick was trying to lead me on while I was still unaware of the big picture. For peer pressure to have full effect the people around me had to beleive. I wasbelieve. away do anything about it so it and I pieced it together a little at a time.  She had people casing me in public so when they saw I had interest in other women the slander graduated to pedo rumors, and the town was sold on the idea that she was my cure. All I know is a lot of eyes on me at all times so I watch my back around everyone and make my way around everything. Well I GET IN THIS WRECK, I didn't have insurance, so I make a deal with the guy I ran into to pay him cash.  I go to the bank where she worked, and friend sister fills out a loan papers along with a subtle smokeshow to gaslight me. She says to wait for her manager...she was a manager...then tries to bribe me with the loan paper she had the authority to sign with some acted repertoire...she believes quiet people are weak and stupid, so my silence was an act of submission to her. She came in blushing to hand me the loan papers, ready to be embraced, but she already signed the papers and I walked off and went on my way...like I didn't know her and the previous 5 years of her bullshit never happened.",
        "created_utc": 1677766224,
        "upvote_ratio": 1.0
    },
    {
        "title": "Bad driver + very aggressive neighbour = Saturday morning entertainment",
        "author": "RobbyT34",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/11fyqsw/bad_driver_very_aggressive_neighbour_saturday/",
        "text": "[removed]",
        "created_utc": 1677750263,
        "upvote_ratio": 1.0
    },
    {
        "title": "My ex tried hard to get a petty revenge",
        "author": "Dreamerto",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/11fxxty/my_ex_tried_hard_to_get_a_petty_revenge/",
        "text": "[removed]",
        "created_utc": 1677747401,
        "upvote_ratio": 1.0
    },
    {
        "title": "Call this number",
        "author": "KBeth7777",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/11fxrt2/call_this_number/",
        "text": "[removed]",
        "created_utc": 1677746775,
        "upvote_ratio": 1.0
    },
    {
        "title": "when Sil copies you",
        "author": "truthlady8678",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/11fx3vv/when_sil_copies_you/",
        "text": "[removed]",
        "created_utc": 1677744444,
        "upvote_ratio": 1.0
    },
    {
        "title": "Petty revenge on non-seat switcher",
        "author": "rduncang",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/11fti4k/petty_revenge_on_nonseat_switcher/",
        "text": "[removed]",
        "created_utc": 1677733124,
        "upvote_ratio": 1.0
    },
    {
        "title": "Be a racist AH? They will find you.",
        "author": "dajur1",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/11fqy38/be_a_racist_ah_they_will_find_you/",
        "text": "I don't know if what I would consider this revenge on my part, but I definitely directly facilitated it for 2 people. \n\nAbout 15 years ago I lived in an apartment where my balcony faced the alley at the rear of the building. My building was near a major university, and lots of students rented the apartments and houses and it could get pretty rowdy on the weekends.\n\nI was awoken one night to a bunch of crashing and yelling from the alley, so I went out to my balcony to see what was going on as fights happened every few months back there (shots fired once too) as there were 3 bars within a few blocks. It ended up being 2 girls and they were throwing beer bottles at my building. At first I was pissed at them, then I heard a guy from the 4th floor (top floor, I was on the 3rd floor) yelling at them calling them N words and other insults (the girls were black. When he insulted them, they started throwing bottles with renewed vigor. They were getting the bottles from a full recycle bin out front of the party house across the alley from my building. \n\nAfter about 10 bottles each, one of my neighbors from a second floor unit who was below the douche from the 4th floor (2nd floor was unit 206 while douche was 506) came out pleading for them to stop throwing bottles. He acknowledged that they had a right to be angry, but could they please leave because all the bottles they threw broke and were all over his balcony (they didn't get close to hitting douche's balcony). \n\nThe girls calmed down, apologized to the 2nd floor guy for all the broken glass and started to walk away. After they had made it 20 feet, douche started insulting them again with lots of bad names and more of the N word. \n\nThe 2nd floor neighbor yelled at the 5th floor guy to STFU and calmed the girls down again and they started to walk off. Again. But, this is Reddit, so you probably already guessed that douche started yelling at them again.\n\nThis time, before 2nd floor guy came back outside, I yelled out, \"Come to the front of the building and I'll let you in\". Both girls immediately said, \"okay\" and the 5th floor guy said, \"oh shit\" and I heard his door close.\n\nI threw on a pair of pants and went to the entrance where they were waiting. I escorted them to the 5th floor where they proceeded to kick the shit out of douche's front door. He didn't open it or say anything, but they gave that door a right beating. One of the girls drew a dick out of lipstick. After a minute or two, they thanked me and left. Good times.",
        "created_utc": 1677726089,
        "upvote_ratio": 1.0
    },
    {
        "title": "Neighbor called the cops on me smoking weed so I outed him to his family",
        "author": "Odd_Implement_7444",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/11fq51j/neighbor_called_the_cops_on_me_smoking_weed_so_i/",
        "text": "First off, where I'm from, weed is illegal. I'm very conscious about the smell, and I understand that for non-smokers the smell of weed is horrendous. I completely understand why and I always do my best to avoid any discomfort to anyone. That's why I usually smoke late at night, when I know that everyone should be asleep, including my downstairs neighbors. (We live in an old apartment building)\n\n\nThe thing with this guy is that he's a heavy tobacco smoker, and I can always hear him coming in and out of the terrace, mostly because he shuts that door so damn hard that all the walls shake. From the pattern of slamming doors, I can tell that he smokes his last cig at around 2:30 am, therefore I decided to go for my nightly puff at 3am. I opened the windows, turned on the oil diffuser that is also anti tobacco, and lit up my joint. 15 minutes later, cops knock on my door, alongside them is my neighbor, and I get taken to the pd for statements. I end up with a warning for possession, a fine for disturbing the peace at night and a sleepless night.\n\n\nBefore this point, he wasn't exactly a friendly neighbor either, but his wife was sweet, from the few interactions I had with her. The first few days after I moved in he always gave me the death stare, but I assumed he was just grumpy\n\n\nFast forward a few days, I'm scrolling through grindr when a new profile pops up at the very top of the list. All my neighbors all mostly elderly people, so I was quite confused as to who this is. I clicked on his profile, and it was him. I started a conversation with him, sent him a pic of a friend (with consent) to pretend I was him, and a couple of hours later we were sexting and he sent me a couple of nudes.\n\n\nThe next morning, I caught his wife before going to work and showed her everything. When he came home from work, I could hear a lot of crying and he eventually got kicked out. It's worth mentioning that they also have a 16yo kid.\n\n\nI'm very satisfied with my revenge, but I also feel terribly sorry for both the wife and child, they didn't deserve this.\n\n\nWhat do you think?",
        "created_utc": 1677723992,
        "upvote_ratio": 1.0
    },
    {
        "title": "Simple but loud gym revenge.",
        "author": "ABooShay",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/11fq2mg/simple_but_loud_gym_revenge/",
        "text": "I was at the gym today, minding my own business with my AirPods in, music up loud, so I could drown out the sound of the television which they keep very loud.  My gym is very tiny, the cardio room has 8 machines in it.  The older guy on the machine next to me was on the phone talking louder than the television, so I could hear him even with my music playing.  I was trying to be nice thinking maybe he had an emergency or something, but after about 15 minutes, I was really annoyed.  Other people even started leaving because it was so obnoxious.  So, completely out of character for me, I started singing at the top of my lungs, purposely out of key.  The song on my playlist at that moment was “She Wants to Move” by NERD.  I think the guy got the point as he hung up shortly after I started “singing”.  Don’t mess with an introvert.",
        "created_utc": 1677723826,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is it true that the intelligence of a woman is destructive in nature?",
        "author": "unityofreligions",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/11fod6q/is_it_true_that_the_intelligence_of_a_woman_is/",
        "text": "[removed]",
        "created_utc": 1677719590,
        "upvote_ratio": 1.0
    },
    {
        "title": "Couldn't be happier my athletically inclined niece wants to play ice hockey",
        "author": "yuckyuck13",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/11fmwst/couldnt_be_happier_my_athletically_inclined_niece/",
        "text": "My sister has always been a narcissist and controlling.  I work for a university that has 8 women's teams ranked in the top 25.  And I've been taking her to in season games.  About a month ago I took her to a women's ice hockey game with a free skate with the team afterwards.  She really enjoyed the free skate and immediately fell in love with the goalie.  Ever since the game she's been begging her parents to let her play.  Since ice hockey is an expensive sport makes me happier, even more so if she tends goal.  Hurt that bank account!",
        "created_utc": 1677715915,
        "upvote_ratio": 1.0
    },
    {
        "title": "Early morning strobe lights!",
        "author": "minabina6714",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/11fmead/early_morning_strobe_lights/",
        "text": "Not sure if this is really revenge but it sure was petty.\nSome backstory: typically I take the train to work but this day was rainy and I didn’t want to walk to the station. When I drive, I leave pretty early (around 5:50am) so it was still dark out.\nAnyway, I’m making my way out of my neighborhood, speed limit is no more than 35. Everyone is cruising leisurely since we’re out before traffic starts so I was in no rush, as well as the car I was behind. Eventually a car comes up behind me, right up in my crack type tailgating and starts honking!! Weird? Did I leave my coffee cup on top of my car or something? No of course not, so what’s this guys problem? The cars ahead of me and I were still cruising along when he then passes me on a double yellow and scooches his silly little car in front of me!!! Okay? He must be in a rush. I was wrong. Continuing out of the neighborhood he had NO INTENTION to pass anyone else… just me!!! Appalling. This silly little vehicle is going nowhere faster by being in front of me. \nSo of course I took that personally. Insert me just being a POS and everytime we stopped at a red light I made sure to give him the most intricately choreographed light show with my high beams I could give. If anyone knew morse code, I’m sure I signaled some strange indecipherable message. This went on until we finally took the exit to get onto the highway to where I even ended up passing him as soon as I exited! So why was he so adamant about being in front of me??\nWas this revenge? Not really.\nShould I stop taking every thing personally? Yeah.\nBut did it make me feel a little better? Yes.\nWas this story absolutely pointless. Also yes.",
        "created_utc": 1677714664,
        "upvote_ratio": 1.0
    },
    {
        "title": "poop bandit",
        "author": "ssgg1122",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/11fl05k/poop_bandit/",
        "text": "looking for the pettiest advice!\ni live in a small(20 units), secure access apartment building. last week i found a purple dog poop bag in the lobby, a few days later i found another on the floor in the trash room (i picked it up and put it in a rash can literally 6 feet away). all week i have been seeing at least 1 purple poop bad on the sidewalk around my block, when there are trash cans on every corner. i’m brainstorming what is the best way to get this person to stop doing this and would love to hear from this subreddit. i’m keeping my eye out for whoever in my building carried purple doggy bags.",
        "created_utc": 1677711391,
        "upvote_ratio": 1.0
    },
    {
        "title": "Kid harasses me till 8th grade, I ruined his privileges.",
        "author": "T0MB7t0n3",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/11fhk90/kid_harasses_me_till_8th_grade_i_ruined_his/",
        "text": "[removed]",
        "created_utc": 1677703664,
        "upvote_ratio": 1.0
    },
    {
        "title": "Move my effing truck? Not with that attitude.",
        "author": "Resident-Device-2814",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/11fh207/move_my_effing_truck_not_with_that_attitude/",
        "text": "Other posts on here about parking pettiness reminded me of a story that happened to me several years ago.\n\nI have a weekly meeting for a community service group I volunteer with.  After that meeting several of us then go out to our \"neighborhood bar &amp; grill\" chain restaurant to have some food and drinks and talk about whatever.  This place can sometimes be crowded, especially when a big sports game or tournament is going on, as there are many television screens that play those events.\n\nOn one of these occasions, during the annual March Madness college basketball tournament, I arrived to find the parking lot completely and totally full, except for one space.  Unfortunately it was open because the person who parked in the space to the left had parked over the line into the open space.  I was able to squeeze my truck into the space, but just barely, and my passenger side was less than a foot away from the driver's side of the car parked immediately to my right.  I figured in the next half hour or so the place would calm down, and I'd go move my truck so it wasn't blocking this other car.  But then food and drinks came out, and my group of friends and I were talking and having a good time and I forgot about my truck.  Oops!\n\nAbout an hour later, the place had mostly cleared out (game had ended), and it had started to quiet down.  I'm sitting with my friends at a high top table just adjacent to the bar, and overhear a man talking to the bartender about how he can't get into his car because it's blocked.  Ohcrap.jpg.  I jump up and say, \"Sorry man that's me, the lot was full and that was the only available spot.  I'll go move it and...\" (I was going to finish by offering to buy the guy a drink on my tab for his troubles, but he cut me off.)\n\n\"Go move your fucking truck,\" this complete rando I've never spoken to before says to me.\n\n\"Excuse me?\"\n\nAs if on some mysterious cue, the Touchtunes jukebox finishes the song it was playing and nothing else was queued up so it goes dead silent in the place.  I could not make this up if I tried, it was eerie how it happened exactly at that moment.\n\n\"I said go move your fucking truck,\" dude bro repeats.\n\nSo instead I sit back down with my buddies and say, \"Nope, not if you're going to talk to me like that. Happy to move it but you come at me like that I'm not going to do anything for you.\"\n\n\"What?\" now somewhat angry but also surprised dude says.\n\n\"Crawl across from the fucking passenger side for all I care.  Try not acting like a jerk to folks, especially people you've never met.  I'm not doing shit for people I've never met who act like that to me right off the bat.\"\n\n\"What the fuck do you want me to, I'm blocked in,\" he says.\n\n\"Try asking nicely, or like I said you can climb across your fucking passenger side for all I care,\" I replied.\n\nI turn back to my friends, and a few moments pass.  Then the guy responds with, \"Will you please go move your truck?\"\n\nI jump up and with the most aggressively cheerful demeanor say, \"Absolutely, more than happy to move it for you!  Sorry it was blocking you, the lot was pretty full and someone parked across the line on the other side of me.\"\n\nThen I went and moved the truck.  He followed me out and kept talking, probably at me but mostly to himself, saying \"Don't know what you wanted me to do, I can't get into my car with your truck blocking me.\"\n\nI moved the truck, apologized again and waved goodbye to the person as he drove off.  Went back inside the restaurant, and saw my friends not trying very hard to contain their laughter, the manager holding the cordless phone looking relieved, and the bartender and some of the patrons laughing and supposedly clapping (my friends told me that part, I didn't see it).  The manager it turns out had dialed 9-1 and was standing at the door waiting to press the last 1 in case a fight broke out, so he was happy to not have to call the police for a bar fight.\n\ntl;dr - The story of the time I blocked in a guy's car and made him ask me nicely to unblock him.",
        "created_utc": 1677702637,
        "upvote_ratio": 0.99
    },
    {
        "title": "College Work Study Hangover Pettiness",
        "author": "Sure-Victory7172",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/11fgdr5/college_work_study_hangover_pettiness/",
        "text": "[removed]",
        "created_utc": 1677701520,
        "upvote_ratio": 1.0
    },
    {
        "title": "Hang out in the street blocking traffic, drinking, and throw your empties into my garden? Let's keep it civil",
        "author": "Bondo_Wallace",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/11ffz2u/hang_out_in_the_street_blocking_traffic_drinking/",
        "text": "Setup: This happened a few years ago, reminded of it while talking to my FIL. Before covid we had a bunch of college kids for neighbors. As soon as they moved in the parties started. They would have people pouring out their door, their friends cars lining the street. They repeatedly blocked the entrance to our street preventing vehicles from entering or leaving, by standing around in groups. The cops here are already no help called it \"civil matter\". \n\nThe property manager for our HOA was friends with college kids father. The kids father is who owns the townhouse. Any complaints went unanswered because the property managers friendship with the father. \n\nThe straw: One of the last nights of these parties, the kids decided to ramp up their antics and threw a bunch of empty beer cans in my garden. \n\nThe petty: April rolls around and it's time to work on the garden. I clean it up and of course find a empty can i didnt see earlier. At this point I decided I needed to find the most \"effective\" compost mix for my precious roses. I searched and found a manure/mushroom compost mix. It smelled like a dead body exploded after sitting outside for 3 weeks. I wait for a Friday afternoon and laid the compost down. \n\nMy college neighbors lived downwind from me and are the first house on the breeze. The smell also prevented their friends from hanging out near the street entrance and near the garden that weekend. Grumbling from the friends as they walked by let me know they weren't happy and some decided to walk into the yard (as a protest maybe not sure why). Next weekend rinse and repeat. \n\nThe weekend after oh look the grass around the outside of the garden looks malnourished, it could use a layer of compost, just enough if someone walks through it, it covers their shoe and tracks into a nearby house. This stopped them from using the garden as a trash bin, from walking into the yard and cut down their hangout time in the street for the summer. \n\nIt stopped completely once I and some new people got on the board, and we were able to replace the property manager.",
        "created_utc": 1677700997,
        "upvote_ratio": 1.0
    },
    {
        "title": "My dad does cocaine on the table (insert cartwheel)",
        "author": "Sad-Artichoke133",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/11ffmpm/my_dad_does_cocaine_on_the_table_insert_cartwheel/",
        "text": "",
        "created_utc": 1677700594,
        "upvote_ratio": 1.0
    },
    {
        "title": "Ruining my life.",
        "author": "JudgePsychological90",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/11ffd25/ruining_my_life/",
        "text": "So there’s a woman that’s stupidly into me, but she gets angry? That I’ve never gave her the time of day. For FOUR years now she has made fake Facebook accounts texting the women I’ve been with telling them lies (and I mean like absolutely crazy stuff) spreading rumors that I sleep with her and all that jazz… we’ll I’m finally at my breaking point. I can’t deal with it anymore. The police aren’t going to do anything about it. I need revenge. I need people to text her boyfriend or something and make up some wild stuff. I can’t do it because it would be obvious with new fake accounts or a obviously fake number. Help. Me… out… please",
        "created_utc": 1677700283,
        "upvote_ratio": 1.0
    },
    {
        "title": "use my email to sign up to stuff ok then",
        "author": "Flyingcloakers",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/11fcc10/use_my_email_to_sign_up_to_stuff_ok_then/",
        "text": "[removed]",
        "created_utc": 1677696859,
        "upvote_ratio": 1.0
    },
    {
        "title": "steal my plants? enjoy the stink then!",
        "author": "stinkypesticide",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/11f9xyk/steal_my_plants_enjoy_the_stink_then/",
        "text": "[removed]",
        "created_utc": 1677692266,
        "upvote_ratio": 1.0
    },
    {
        "title": "wouldn't sell me alcohol cause wife didn't have ID, so I went and bought it by myself.",
        "author": "Shame8891",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/11f9too/wouldnt_sell_me_alcohol_cause_wife_didnt_have_id/",
        "text": "Not sure if this is petty enough, but I felt better after.\n\nWife and I went to do some grocery shopping at Walmart with the kids. Our kids are aged 13, 3, and 1. Decided to get some beer, wife left her purse at home but I had my wallet with all my cards and ID in it so didn't think there'd be a problem. When we get to check out I produce my ID, then cashier asks for my wife's which she doesn't have and says he has to see her ID.\n\nMe: our kid here is 13, you really telling me one of us is under age with a 13 year old kid?\n\nCashier: sorry sir if you're both here together I need to see both of your IDs.\n\nMe: if I came only with my daughter would you refuse to sell me alcohol cause she's underage?\n\nCashier: no\n\nMe: but you're refusing to sell it to me cause my wife doesn't have her ID?\n\nCashier: yes\n\nMe: ok\n\nWe then bought everything except the beer and loaded it in the car. I then went right back into Walmart by myself, got the beer, and bought it at a different register. On the way out I walked by the cashier I was at the first time, held up my beer and said \"hey man I got it\" and he looked at me with dumbest look on his face. I walked out without a problem and had a beer that night.",
        "created_utc": 1677692005,
        "upvote_ratio": 1.0
    },
    {
        "title": "call me a toddler and to repeat school? i make you eat your words and change your ways",
        "author": "RestaurantOk6343",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/11f8lwl/call_me_a_toddler_and_to_repeat_school_i_make_you/",
        "text": "[removed]",
        "created_utc": 1677689166,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is it true that the intelligence of a woman is destructive in nature?",
        "author": "unityofreligions",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/11f76ew/is_it_true_that_the_intelligence_of_a_woman_is/",
        "text": "[removed]",
        "created_utc": 1677685818,
        "upvote_ratio": 1.0
    },
    {
        "title": "What sites can I sign up with using a phone number",
        "author": "princessbee-",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/11f3520/what_sites_can_i_sign_up_with_using_a_phone_number/",
        "text": "[removed]",
        "created_utc": 1677675518,
        "upvote_ratio": 1.0
    },
    {
        "title": "Someone took my parking spot, so they got blocked on it all afternoon.",
        "author": "SaliktheCruel",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/11f2ifw/someone_took_my_parking_spot_so_they_got_blocked/",
        "text": "First of all, sorry for the formating, I'm on my phone.\nSecond, sorry if for my bad english, it's not my native language.\nThird, sorry for the long post.\n\nHere's the context: I work at a hospital as a lab technician.\nOur hospital site is near the city center and quite old so there are no real parking lot, and not many parking spaces available.\nBetween students, patients, hospital workers, and people coming and going for different reasons, it's nearly impossible to find a spot after 8AM.\nSince I work in a small team (only 4), and the evening shift is also on call for any emergency, we have ONE reserved parking spot. There's a sign saying it's only for on-call lab technicians from our department, and there's a chain with a padlock in front of it.\nIt is located between a pillar and another building's wall, right next to our lab.\nThere is another team in the lab, and we sometimes let them use the parking spot when we have others available  or when we come using public transportation but otherwise we don't share it.\n\nSo the story: \nA few weeks ago I started doing the evening shifts. Usually from from 10AM to 7PM but it can last much longer.\nI was also on-call so I took my car to the lab.\nI arrived one morning near 9:45, went to the reserved parking spot but the chain was down and the spot was taken.\nAt first I thought it was someone from the other team but I didn't agree to share the spot with anyone and I didn't recognize the car.\nSo I decided to park JUST in front of it, horizontally so that my car wouldn't be on the road.\nThat way, the other car was stuck between the wall, the pillar and my car.\n\nAt first I was thinking I would move it as soon as I found the colleague and he agreed to let me my spot. \nBut it turns out the car didn't belong to anyone from the lab.\nOne tech had witnessed by the window a lady parking in the spot around 9:40. \nWhen he opened the window to tell her not to park there, she just said \"I'm in a hurry I won't be long !\" and left walking fast. I checked if there was a phone number left under the windshield that I could call but nothing.\n\nSo we decided \"You know what ? My car is fine where it is. It's not on the road, it leave enough sidewalk for pedestrians to be safe, and it's only blocking her. I don't have time to go find another parking spot at this hour, which would probably be at the end of the hospital site. Plus I have a sticker on my car saying it can park at some places in the hospital for emergencies.\nAnd the day went on.\n\nI had almost forgotten about it until 4PM when someone called the secretary(the lab's phone number was on my sticker): It was a lady wondering why there was a car parked in front of her. \nTurns out she was also a hospital worker, from another department, who had arrived late to work and couldn't find a place to park so she took the chains down and parked there. No idea how she got rid of the padlock but it was old and weathered so it might just have broken.\nShe had just finished (\"I won't be long\" my ass) and now she wanted to leave but couldn't.\nFirst the secretary, a nice woman but not known for her calm temper, berated by the phone. Then she connected the lady to our phone, where a colleague did pretty much the same. \nNext, another colleague went out to check on my car.\nAccording to said colleague, she looked relieved as she thought he was going to move my car. He just told it was illegal for her to park there and now she had to wait for me or we'd call to have her towed.\nMeanwhile I was in the middle of a complex procedure that required to be in a \"white room\" (sterilized room with controlled atmosphere,  sterilized blouse...) so I couldn't just leave what I was doing like that.\nSo she waited. And she called twice more to complain that she needed to leave.\nAnd twice she got berated by my colleagues until one of them told to stop or they would involve the hospital's security and actually get her towed.\nIn the end I got out of the white room at 5:30pm.\nMy colleagues and I thought it was enough so I changed myself as slowly as possible, took the time to get everything in order and let everyone know in building I was going out for 5minutes, and and finally got out. \nShe was visibly pissed as fuck because it was almost 5:45pm, but the threat to get her car towed might have stuck because she didn't say anything except passive agressive \"thank you\". \n\nBy the time she could get out it was almost 5:50pm so she waited a little less than 2hours.\nCould have been worse since I ended my shift around 7:30 that evening\n\nSo far no one else has parked on the spot except us.\n\nTL;DR: Someone stole my parking spot at work, so I blocked her car and she had to wait two hours to leave while my colleagues berated her.",
        "created_utc": 1677673645,
        "upvote_ratio": 0.98
    },
    {
        "title": "Offered my help and was told it “wasn’t worth it”. Cue petty revenge.",
        "author": "Southern_Bathroom_89",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/11f1ei9/offered_my_help_and_was_told_it_wasnt_worth_it/",
        "text": "I work as a psych nurse in long-term care home for seniors (LTC). I love my job and most of the people I work with. I predominantly work night shift. (11pm-7am). We have a large facility, and unfortunately with health care tanking, so is our staff ratio. When I work nights I am the charge nurse of the facility; there’s myself, one LPN and 6 care aids for roughly 150 seniors. The facility is split into 3 wings/units, with two care aids per unit. Myself and the LPN float between all 3 to offer our help. We often work alongside the care aids at night, and step into the position if there are any absences. Being a nurse does not excuse you from personal care or helping out in general, and live by that philosophy daily. \n\nWe have one care aid who I’ll refer to as C (cunt also begins with that letter, what a coincidence). C has a shitty attitude that infects those around them. Each morning C shows up at 6:30am for a start at 7am, with their Starbucks in hand and a scowl plastered on their face. For the thirty minutes we see C, they sit there and complain to us about how terribly we handle the night, what we miss (which is generally nothing) and how they are going to complain. Meanwhile we are ran off our feet until the end of our shift, while C sits there and sips their coffee. (No they are not obligated to work yet, but do anything else with your time, C). \n\nOne particular morning, as I was giving report to the next nurse, C rudely interrupts us to let us know they are down one care aid on their specified unit. We unfortunately had no bids on the open shift, meaning no one was coming in. Before we can answer they walk away in a huff. I looked at the other nurse and said, why don’t I stay an extra two hours after my night shift and work care aid duties to help out. I walk out to the group morning meeting and let them know the plan. Before I can even return to the nurse to finish report, C comes up behind me and says “you’re only going to stay two hours? That’s not even worth it, you might as well go home”. Stunned, I said nothing and returned to the nurse. \n\nI explained what happened to the nurse and had finally had enough of C’s shit attitude. I grabbed my things and walked back to the group of care aids and said “I guess I’ll head out, C told me it wasn’t even worth my time since I was only staying two hours and told me to go home”. The room was dead silent and all eyes on C, whose face couldn’t have been redder. Another care aid who works a different unit than C spoke up and said “OP, we are short one care aid today too and would really appreciate if you stayed” so I happily obliged (I never planned on leaving, I just wanted to prove a point). I gave C my best shit eating grin while their unit stayed short and I helped out elsewhere. \n\nC still comes in early with their Starbucks and unhappy attitude, but they don’t converse with us anymore and  we no longer hear how terrible we are as a group on nights. I overheard from a care aid that the day C did that, they made them the sole bedpan (basically a toilet bowl that and be positioned under a patient who is bed ridden to urinate/defecate into) cleaner.",
        "created_utc": 1677670201,
        "upvote_ratio": 0.98
    },
    {
        "title": "Age Comparison Revenge",
        "author": "AccomplishedAd3432",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/11f1bn0/age_comparison_revenge/",
        "text": "I am the oldest sister in my family. My next sister is 15 months younger than me. By the time we were in high school she was at least four inches taller than me. I think she is six inches taller than me now. Whether it was our height difference, or something about our face, by the time I was a Junior and she was a Sophmore everyone thought she was a year older than me. She rubbed it in every chance she got. But, I finally thought up a good response.\n\nSo, after thinking up this response I waited. Eventually a fellow student on the school bus noticed we were sisters. The standard conversation started and with glee my sister asked, \"Can you tell which one of us is older?\" The other girl thought my sister was older (standard response). My sister was gleeful, again. I just looked at her and smiled, \"Yep! And when I am 31 and you are 30, I'll still look younger than you!\" Some of the students around us laughed! I only had to do that a few times and she finally stopped asking the question!",
        "created_utc": 1677669922,
        "upvote_ratio": 0.95
    },
    {
        "title": "Want to stall a chess game? Have fun waiting 2 hrs!",
        "author": "hyperkritikal",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/11f04ci/want_to_stall_a_chess_game_have_fun_waiting_2_hrs/",
        "text": "First, a bit of background info. If you know how online chess works, feel free to skip to the next paragraph. Ranked online chess games run on a timer which varies in duration depending on the queue you join. Unfortunately, some people choose to needlessly run their clock when they know they are about to lose rather than resign. Not only is it frustrating as hell, its just shitty etiquette.\n\nI was playing 10 min ranked games last night and I ran into a player who saw that he was going to lose in three moves. He rushed through the opening so he had almost 8 mins left. Rather than play it out or resign, he opted to stall. I asked him nicely to either move or concede and he replied with a single word, \"Cope\". Given the fact that I had ample amount of free time, I decided to make him suffer. Lichess (the platform I play on) gives players the option to give an additional 15 sec of time to their opponent. So, I pressed that fucking button like I was a meth addict giving CPR to their unconscious hamster. If he wanted to time out the game, he had to wait nearly two hours to do so. I put on an episode of House on my laptop and kept the app running on my phone. 30 minutes later, he caved and left the game.\n\nTLDR: Asshole decides to stall a lost match, so I oblige  and extend the amount of time from 8 mins to ~2 hrs. He gave up after 30 mins.",
        "created_utc": 1677665632,
        "upvote_ratio": 0.98
    },
    {
        "title": "Someone tried to steal from me by hacking my Walmart account, how can I (legally) prank them via mail?",
        "author": "avesinolam",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/11ew5te/someone_tried_to_steal_from_me_by_hacking_my/",
        "text": "[removed]",
        "created_utc": 1677651191,
        "upvote_ratio": 1.0
    },
    {
        "title": "Cowardly neighbors",
        "author": "nick8388",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/11ev0vp/cowardly_neighbors/",
        "text": "[removed]",
        "created_utc": 1677647528,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to get your district manager at a pharmacy chain fired",
        "author": "KetoSaiba",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/11eu2bk/how_to_get_your_district_manager_at_a_pharmacy/",
        "text": "This one will be a bit of a writeup, but I'll skip some details and keep it brief.\n___\nA few years ago I worked at a pharmacy/convenience store as a shift manager, think cvs or riteaid or walgreens. I won't say which for secrecy reasons. We had a pretty chill boss who was let go for not meeting certain metrics arbitrarily set by corporate. Surprise, guess where this is going. We get an assistant manager from another store as the new boss and hes very good at his job, but corporate is stonewalling all his new hires. We're supposed to have 4 shift managers and 6-10 cashiers. We did not. The new guy lasts.... 7 months and quits. He'd been with said company for 13~ years. Even my vendors thought I was lying when I said he'd quit. In the interim we'd lost 2 cashiers, we had managed to get a shift from another store who said it was too stressful so she quit, and then another who also said I can't do this and went back to his previous job.\n\nAnd this is just front end. By the way, all shift+ people have to be pharma tech certified so if the pharmacy gets behind, because we had some nursing students pharma students college kids who could only do seasonal work etc. so our workforce back there was also not very stable, the pharma had to pull us from the front to go count pills. wonderful to go from 2 to 1 registers with 9 people in line.\n___\nSo, with that backstory in mind, we get into the meat of the story. We get this new hotshot district manager who wants to reinvent the wheel. She asks the remaining 2 competent shifts what she can get for us and she promises everything. She tried for a bit, but man she started getting super petty.\nI asked if we could quit getting pulled back to the pharmacy so frequently because we're behind on customers and photo lab and stocking shelves and all the other stuff and she goes *\"ohoho you can't do that the pharmacy makes 80% of our money\"*\nThen I asked if we could close on Sunday because the pharmacy is closed on Sunday. She scoffs at me and says *\"ohoho we can't do that, that would be silly\"*\nThen I asked if we could match store hours to pharmacy hours, because the pharmacy opens later and closes earlier, and we're super understaffed, she scoffs and says *\"ohoho we can't do that, that would be silly\"*\nIf you're sensing a trend yet... yeah.\n\nThis lady is the kind who almost broke a $6000 printer because she didn't know how to release the latch on a discard tray... yeahhh...\n___\nAnywho, our biggest priority was getting a new boss and maybe we could get it together. She promises me and other remaining shift that she can do that. A week goes by. 2 weeks. 3 weeks. We're falling further and further behind. I picked up scheduling, my other coworker picked up all the invoices and inventory. No extra pay.\nAnd finally the straw that broke the camel's back. I had a 5 day \"vacation\" that I had planned before boss #2 quit, and she texts me asking if I could work through my vacation even though I would be out of state, had already booked tickets with my friends, a hotel room. So I ended up walking out and left her a very polite note saying \"I'll miss you guys. It was fun at times. Also (Karen) go fuck yourself\"\n\nShe texts me the morning after the note and says if I want to talk to her, I can still \"keep my job\".\n\nThis company, instead of doing covid bonuses, did $200 in in-store credit, and they had not deactivated my employee account, takes a few days-weeks. I know, I've had to do it and totally above my paygrade. Anyways, I go in the next afternoon, she's there behind the counter, very pissed off and I go over and pick up the most expensive electronics I can with my friend, and we throw them on the counter and I use up my points. The company gets $0 on in store credit purchases so we wiped out their electronics section, completely legally, at their loss. The face she made as she was ringing us up was beyond priceless.\n\nOh and she got fired like 3 weeks later. Moral of the story, don't piss off your competent employees",
        "created_utc": 1677644571,
        "upvote_ratio": 0.86
    },
    {
        "title": "Homophobe gets the feet skin",
        "author": "MangoAvacadoSushi",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/11er07r/homophobe_gets_the_feet_skin/",
        "text": "[removed]",
        "created_utc": 1677635965,
        "upvote_ratio": 1.0
    },
    {
        "title": "Ten years experience needed? Four weeks it is!",
        "author": "TalesfromtheCryptKpr",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/11epwq3/ten_years_experience_needed_four_weeks_it_is/",
        "text": "[removed]",
        "created_utc": 1677632989,
        "upvote_ratio": 1.0
    },
    {
        "title": "Need help for ideas of legal revenge",
        "author": "[deleted]",
        "url": "",
        "text": "[removed]",
        "created_utc": 1677632520,
        "upvote_ratio": 1.0
    },
    {
        "title": "Not everyone deserves to be in a healthy relationship, change my point of view?",
        "author": "Intelligent-Cherry23",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/11epe02/not_everyone_deserves_to_be_in_a_healthy/",
        "text": "",
        "created_utc": 1677631634,
        "upvote_ratio": 1.0
    },
    {
        "title": "Getting even with my exwife and her new boyfriend",
        "author": "Gravastorm1986",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/11eo41d/getting_even_with_my_exwife_and_her_new_boyfriend/",
        "text": "[removed]",
        "created_utc": 1677628334,
        "upvote_ratio": 1.0
    },
    {
        "title": "A dirty kiss, a dirtier marriage.",
        "author": "Alone-Day1429",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/11enjo0/a_dirty_kiss_a_dirtier_marriage/",
        "text": "A few months ago I went to a singles mixer in a bar. All was going well and I got chatting to a lovely lady who told me she was recently widowed to a man called Dennis. We hit it off and we seperate from the event and I ordered us some food and drinks. \n\nShe told me about how much of an amazing job her deceased ex had, and that she had loads of money and didn't mind spending it and got a huge payout. But this was after I said I would cover it. \n\nPersonally as someone in a decent job, meeting someone who is well off is just not essential for me.\n\nFast forward to her telling me about the luxury cars and expensive holidays she had. When suddenly her phone rang and she began to act a bit shady and tried turning her phone so I couldn't see.\n\nThe night went on and at one point we had a passionate kiss, her mouth tasted like some sort of divine ashtray. Eventually she went to the bar to order drinks she left her phone on the table and low and behold Dennis is calling again. His name calling with a heart beside it too!\n\nI just watched it ring then a message pops up saying \"baby when are you back from Sarah's? I'm so horny for you\" that's when I knew she was just out cheating. She was clearly out for free food and drinks and was going to go back to him then.\n\nI questioned her on it and she immediately got defensive and started accusing me of looking through her phone (which I didn't at all) and that she felt nothing when we kissed and said I was crazy. This was clearly her excuse to leave now that she got some free stuff.\n\nAnnoyed more by the fact this poor guy didn't know she was cheating, later that night I found the guy Dennis on Facebook and it turned out they were married. I messaged him to say we had been out and explained the entire situation to him. He didn't seem to belive me at first but as I told him details of conversation he realised he was being played by her and was letting her live rent free with him. He thanked me and said he'd sort it out.\n\nWell a few days ago, I see her on Facebook complaining about how men are all pigs and that she had to move back in with her mother because he had kicked her out and wanted a divorce. She also is unemployed now because the location in her parents was too far from her job. \n\nI'm so glad her phone was facing upright and I saw those calls and messages but so glad I called her out and managed to get her caught by telling her husband. \n\nDon't waste my time and money again or your (ex) husbands!",
        "created_utc": 1677626918,
        "upvote_ratio": 0.97
    },
    {
        "title": "Increase my workload? Let me just use my UNO reverse card!",
        "author": "TheBonus1996",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/11emq93/increase_my_workload_let_me_just_use_my_uno/",
        "text": "Once upon a time I worked as an attending physician on a nephrology clinic, in the hemodialysis unit. I am not sure if this is how it works in other health systems, but in my country this kind of jobs is done by GPs, who are under the supervision of a specialist, in this case a Nephrologist. \n\nThe characters of this tale are Dr. Umbridge (36ish? F) ,my coworker; Dr. Bob (31M) ,our boss, and myself , at the time 26F. The setting goes like this: the hospital had three hemodialysis units, two big and one small. The big ones had room for 20 patients each, while the small one had room for 10. \n\nWhen I first arrived, as the newbie, I was assigned to the small unit. Meanwhile Dr. Umbridge , who had previously held my place, was \"promoted\" to one of the big rooms. She didn't like this at all, as it was an obvious increase in workload without an increase in the pay. \n\nWhat did she do to release her anger? She made my workday stupidly heavy with the power of bureaucracy. For this to make sense, you need to understand that A LOT of a doctor’s job is behind a screen doing paperwork, filling charts, doing formulas, making epidemiology reports, sometimes calling patients, etc. After a month or so after I started working, she started whispering to Dr. Bob, telling him how the big units were full and there was too much to do, while I was most of the time looking at my cellphone because I finished a lot faster. This was a lie by the way; while I did have a more relaxed shift than the others, it was no vacation time. \n\nSo, little by little , week by week, Dr. Umbridge whispering convinced Dr. Bob to assign me more and more bureaucracy tasks , to the point that after 6 months I felt more like a secretary than a doctor. I barely saw my patients because I was basically handling all the paperwork of my unit and Dr. Umbridge's Unit; and maybe half of the third unit (whose doctor is not really that relevant, he was pretty oblivious about it all). All under the guise that I had less patients and more free time. \n\nNow, here comes the revenge. The most amazing think of all of this is the simplicity of it, to the point that I sometimes think it barely counts as revenge because it needed no planning at all. One day I just got the idea of asking Dr. Bob if I could change units, as I thought I was ready for a bigger professional challenge.\n\nUnder other circumstances, there may have been the risk of him saying no, as the bigger units needed more experience. Whoever, Dr. Umbridge's constant nagging had convinced him that she was suffering from a burnout and that she would be ecstatic of going back to the \"easier\" unit for a while. \n\nI am not sure if the face she did when Dr. Bob announced the change was from happiness, but it surely had a lot of emotion behind it. She herself had bonded the small unit to mountains of paperwork that she knew will now fall on her, and she also knew there was no way of saying no as she had spent months preaching how \" hard\" the big unit was. \n\nThe rest of my time there was amazing, I learned a lot and barely had to do the boring stuff, while poor Dr. Umbridge soon learnt what a real burnout felt like",
        "created_utc": 1677624932,
        "upvote_ratio": 1.0
    },
    {
        "title": "Play stupid games, grandpa gives out stupid prizes",
        "author": "ZephyrNerd113",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/11el35x/play_stupid_games_grandpa_gives_out_stupid_prizes/",
        "text": "[removed]",
        "created_utc": 1677621061,
        "upvote_ratio": 1.0
    },
    {
        "title": "Sure, tell your kid to bug me about my age...",
        "author": "MusketeersPlus2",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/11ekwu6/sure_tell_your_kid_to_bug_me_about_my_age/",
        "text": "Let's start with the fact that my brother's wife and I do not get along.  Never have, never will.  It's mutual - both fault and feelings.  Also, she is very sensitive about her age.  What she failed to realise is that I'm not.\n\nSkip to my 30th birthday &amp; my mom throws a party, including my brother &amp; his family.  They have 4 kids - 5, 4 and 1 year old twins at the time.  The kids are playing, we're eating cake, everyone is getting along, and the wife calls over the 4 year to whisper something in his ear.  Immediately the kid comes to me and (in typical 4 year old fashion) yells \"Auntie, guess what?!\"  What, kiddo?  \"Mom says you're 30 now and that's OLD!\"\n\nMy face lit up.  I delightedly answered \"Yes, I am!  And do you know who's a whole THREE YEARS older than me?\"  \\*wide eyes, shaking his head\\* \"Your MOM!\".  Everyone except her had a good laugh.",
        "created_utc": 1677620663,
        "upvote_ratio": 1.0
    },
    {
        "title": "my ex broke my gaming PC and bashed my car.",
        "author": "SufferMyWrathBoi",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/11ekqaq/my_ex_broke_my_gaming_pc_and_bashed_my_car/",
        "text": "[removed]",
        "created_utc": 1677620235,
        "upvote_ratio": 1.0
    },
    {
        "title": "If I wanted to ruin someone's reputation:",
        "author": "[deleted]",
        "url": "",
        "text": "[removed]",
        "created_utc": 1677617626,
        "upvote_ratio": 1.0
    },
    {
        "title": "Wells Fargo charged me 2 months of late fees for paying mortgage early and often",
        "author": "brobruce004",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/11ej46z/wells_fargo_charged_me_2_months_of_late_fees_for/",
        "text": "So I used to split my payments in half and paid twice a week to save on compounding interest charges (for ex: $1800 mortgage due at the end of the month I would pay $900 on the 1st and the 15th). Everything was going fine until I saw there was a late fee charged on my account 6 mths ago. Apparently they applied one of the payments to my principle as an \"extra payment\" instead of it counting towards my bill. This happened for 2 months and it was $3.82 fee both times. A lot of back and forth but long story short, I lost the battle but will play the long game for my petty revenge.\n\nThey offered me to overnight my payment history to show me how payments were applied. I asked if I was going to be charged for this and they said no. I asked how often can I ask for payment history to keep for \"my records\". They said as often as I need. So each year I will ask for overnight mailing of my history and switched my statements to mailing instead of online. \n\nCharge me $7.64? I'll make sure you will lose more than that over the next 5 years before I pay off my loan. PS ignore the $100k of interest that I will have paid over the life of the loan and give me this victory.",
        "created_utc": 1677616383,
        "upvote_ratio": 1.0
    },
    {
        "title": "Free subscription limited time only 💦🍆Secret.scarlett69",
        "author": "Secretscarlett69",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/11ei8zi/free_subscription_limited_time_only/",
        "text": "[removed]",
        "created_utc": 1677614413,
        "upvote_ratio": 1.0
    }
]