[
    {
        "title": "Swiss lady knows how to handle a nuisance",
        "author": "carcharodona",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/z2i17f/swiss_lady_knows_how_to_handle_a_nuisance/",
        "text": "[removed]",
        "created_utc": 1669186409,
        "upvote_ratio": 1.0
    },
    {
        "title": "Driving your car through my pile of leaves the first few times might be funny, but not after the second time.",
        "author": "Laughingwithyou2",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/z2hekh/driving_your_car_through_my_pile_of_leaves_the/",
        "text": "When my father moved from Ohio to Sacramento in the 1950's, he initially had six roommates (2 per room) so they could keep things as affordable as possible. In the fall, the residents would rake their leaves into large piles in the gutter/side of the street. The City would send out vacuum trucks and collect the leaves on specific prearranged days. Well some kids thought it was great fun to drive their car through the big piles of leaves and scatter them everywhere. My father and his roommates would then have to scramble to rake everything back into a pile or the City would not vacuum up the unorganized leaves. After about three weeks of this, one of his roommates who worked graveyard shift as a mechanic at the municipal bus yard was tired of screwing around with the leaves after a long night of work. Without telling the other roommates, when he left for work he dropped an engine block off his truck and covered it in a big pile of leaves. At around 2 AM, there was a horrific crash that woke up all the neighbors. Fortunately, the kids in the car were not beat up too badly since the car was only going about 15 mph upon impact. It turns out the kid who was driving was the son of a police officer. When the cops contacted his father, he asked if his son was injured. When he was told he was fine, his father told the cops to let him walk home and not under any circumstance were they to give any of the kids a ride home. That must have been a long, cold walk. In the morning when the roommate returned from his shift, he came in the house said something like, \"You never know what you are going to catch when you go fishing.\" I interpreted this story as a warning that screwing with people might be funny the first few times. More than three times, the same joke is no longer funny.",
        "created_utc": 1669184345,
        "upvote_ratio": 1.0
    },
    {
        "title": "Entitled male Karen",
        "author": "Specialist_Algae9851",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/z2geja/entitled_male_karen/",
        "text": "[removed]",
        "created_utc": 1669181194,
        "upvote_ratio": 1.0
    },
    {
        "title": "Fuck me? Guess who's going to get a nice big smile and a wave!",
        "author": "Fomention",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/z2g1pu/fuck_me_guess_whos_going_to_get_a_nice_big_smile/",
        "text": "I was obeying traffic laws at a very busy intersection. People who are raging during traffic sometimes freak out because it's common to miss the light the first time while making a left and you have to wait another 90 seconds.\n\nI'm in the car with my daughter from the opposing side (also being held up) hoping to move forward and not miss my light (I'm going to).\n\nGuy who wants to turn left is having a fit and since I'm right next to him he screams, \"FUCK YOU!\" and gives me the finger. I smile and wave like I couldn't be happier to see him.\n\nHad it been possible for him to be any angrier, he would have been, but was already maxed out.",
        "created_utc": 1669180096,
        "upvote_ratio": 1.0
    },
    {
        "title": "Stealing beer for a party I’m not invited to? I don’t think so",
        "author": "exciter706",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/z2fp96/stealing_beer_for_a_party_im_not_invited_to_i/",
        "text": "Worked at a really shitty locally owned grocery store in high school with some high school friends after school. \n\nIt was super easy to steal from and everyone mostly just kept it to food items for breaks ie. damages. \n\nMy buddy/best friend, we will call Z, got me the job and also his other buddy, we will call D. D and I never really got along for some reason, he just didn’t like me and did his best to drive a wedge between Z and I. \n\nIt was Friday night and there was a party and D made it clear he was excluding me from all party conversation, plans, hype. I wasn’t formally not invited but formally not included in our usual Friday shenanigans.\n\nAnyway I noticed that he was carting beer out with the trash and hiding it outside so they could pick it up later. So when I caught Z alone in the break room I asked about the party and whatnot and he basically said D didn’t want me around so I told Z I saw the beer stash and I was going to tell the manager.\n\nI’m no snitch but I will let D think I am. I went to the manager and just had a friendly chat with her, she was cool so I just hung out with her and made it appear like I was spilling the beans. \n\nI should mention this was about 5 mins before we all clocked out.\n\nD and Z were freaking out and clocked out asap, and did not attempt to retrieve the beer. D had apparently hyped up to the party that he was bringing beer, and everyone was upset.\n\nI had a laugh and enjoyed having them both afraid they were gonna lose their jobs and or face more severe consequences over the weekend.",
        "created_utc": 1669179041,
        "upvote_ratio": 1.0
    },
    {
        "title": "I got revenge on a snitch.",
        "author": "Levi_gay",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/z2fgmu/i_got_revenge_on_a_snitch/",
        "text": "[removed]",
        "created_utc": 1669178294,
        "upvote_ratio": 1.0
    },
    {
        "title": "Shitty parking job --&gt; shitty time getting out",
        "author": "GeoffreyTaucer",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/z27wf8/shitty_parking_job_shitty_time_getting_out/",
        "text": "I was out running errands, and came across a double-parked Porsche. On his drivers' side, there was JUST BARELY enough room that I could still park inside the lines on that side -- while making his drivers side door completely inaccessible. The only way he could possibly get into his car would be to climb awkwardly through the passenger side.\n\nSo I did exactly that. Went and got myself a coffee. And I got back at exactly the right time -- almost. Sadly I missed The Climb; he was just getting settled in when I got back. I stood right in front of him when I unlocked my car; he stared daggers at me. I hopped in my car, gave him a nod, and maintained eye contact while I sipped my coffee, and he very slowly and carefully backed out.\n\nMost satisfying cup of coffee I've ever drank.",
        "created_utc": 1669157677,
        "upvote_ratio": 1.0
    },
    {
        "title": "Petty message to classmates",
        "author": "Infinite-Mark5208",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/z27799/petty_message_to_classmates/",
        "text": "[removed]",
        "created_utc": 1669156088,
        "upvote_ratio": 1.0
    },
    {
        "title": "Will this petty message get me in trouble?",
        "author": "Infinite-Mark5208",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/z27033/will_this_petty_message_get_me_in_trouble/",
        "text": "[removed]",
        "created_utc": 1669155641,
        "upvote_ratio": 1.0
    },
    {
        "title": "Roommates wouldn’t stop taking my stuff so I dosed my juice with laxatives.",
        "author": "Katerpillar3",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/z26x3w/roommates_wouldnt_stop_taking_my_stuff_so_i_dosed/",
        "text": "[removed]",
        "created_utc": 1669155454,
        "upvote_ratio": 1.0
    },
    {
        "title": "Want me to have sex with a woman? Have sex with a man yourself",
        "author": "[deleted]",
        "url": "",
        "text": "[removed]",
        "created_utc": 1669150886,
        "upvote_ratio": 1.0
    },
    {
        "title": "Got paid to harass scammers",
        "author": "SessionPowerful",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/z247s2/got_paid_to_harass_scammers/",
        "text": "Back story: (TLDR at bottom)\n\nThis happened a few years ago, while I was working is a framing and drywall Foreman. We were building an office in an older building, and the security measures required that a general contractor be on site during all consteuction. The client paid the company I worked for to provide this, so after scope of work was complete I was literally paid for 2 weeks to sit at a desk ajd do nothing other than be present.\n\nOne day during that stint, I got a very recognizable scam call saying something about my social insurance number being used in tax fraud and giving me a number for the \"RCMP\" (Canadian Federal police) to call and organize payment.\n\nI spent the next 6 hours calling in and giving fake names, surprised to find out every member of the RCMP station had an Indian accent, and letting them run through their script. I even used celebrity names like Bradley Cooper and got the reply \"ah yes mister Cooper I have your file right here\"\n\nAnyways I drove a few of them mad when I wasted 45 minutes to an hour of their time and then called them out. The one that got me was when one scumbag finished his spiel and asked of I had any questions, to which I replied \"just one, how did you manage to pull up a file for a name I just made up?\"\n\nHis voice went shaky and he got much quieter and tried to explain that it was a joke, just a prank. I managed to get a few different \"RCMP Officers\" to admit they were scamming and frankly it just felt good to make them say it out loud, at least a couple sounded genuinely ashamed.\n\nPlus, I got paid a decent wage to harass them all day which also put a smile on my face.\n\nTLDR: job required me to be present without any actual work, used the time to harass and piss off scammers",
        "created_utc": 1669149321,
        "upvote_ratio": 1.0
    },
    {
        "title": "If you think I need a mother, you’re on drug and I will prove it to everyone!",
        "author": "the_raingoose",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/z23okv/if_you_think_i_need_a_mother_youre_on_drug_and_i/",
        "text": "This is going to be a long one, so I apologize in advance. There will be tldr at the bottom, but I think it’ll be worth the read. I remembered this yesterday and got a bit of joy, I hope you do too.\n\nWhen I (25f) was 15, my dad starting dating a woman named Crystal (using her real name because I really don’t care). Crystal had always wanted a big family but had medical issues so she was unable to have more children and tried to fill the void by mothering my siblings and I. The problem is we already had a mother, were older teenagers at the time, and she was clearly on drugs. Her drug problem was so obvious that we used to call her Crystal-Meth behind her back. She ended up moving in almost immediately after they started dating, but would move out pretty frequently, and claim she was a stay at home mom. She would deep clean small areas of the house (ex: shampoo only a 2x2 ft square of carpet) all day and display other tweaker behavior but we couldn’t prove she was on drugs so we let it go. Soon after she came around, my brother (then 18) moved in with my mom so it was just my sister (then 16) and me dealing with her.\n\nAt first, I went along with her new rules (curfew, new chores, etc.) but then she started to cross the line. I caught her going through my phone, going through my room, and she would tell my dad what she found in there (or make things up if she didn’t find anything) to get me in trouble. On top of that, she would lie to my dad and try to tell him that my sister and I told her about his cheating (which he wasn’t doing, but that’s typical drug induced paranoia). We tried to reason with him, but, classic father of the year move, he never believed us. She would have emotional outbursts claiming my sister and I were evil and trying to break them up or not respecting her as our mother (she wasn’t our mother) to cause fights between us and our dad. However, I think the craziest thing that came of her wrath, was my dad accusing my siblings and me of stealing his spoons and throwing them away. I don’t know if my dad lost them when we moved but none of us ever threw away his spoons. I literally got grounded over spoons for a week because we only had 5 left, which was the same number of spoons we had the prior week.\n\nOne day after school, I came home and she was waiting for me on the couch sobbing. My dad came in the room and immediately started screaming at me for “disrespecting my mother”. As punishment, I was to clean their bathroom but as heading over to do so, I heard Crystal say, “I’m the mom of this house, you treat me like a slave! You need to learn your place.” And something in me snapped. I put my stuff down in my room and headed to the kitchen, I grabbed two spoons without my dad noticing (they were watching a movie on the couch peacefully), went to his bathroom where I waited for my sister to come home. I knew he had a lighter in his bathroom because he would light candles in there to cover up his bowel movement smell. When my sister got home, I burned the bottom of the spoons and grabbed the candle that dad kept under his sink, it was showtime!\n\nI grabbed my “evidence” and went to the living room where the whole family was. I asked my dad why I found all of this under his sink and then demanded to know why he kept accusing us of stealing his spoons when he had these ones hidden in his bathroom next to Crystal’s hair dye (she used tin foil for her highlights that she did herself). My sister looked disgusted and point blank asked if he was doing drugs. He looked at Crystal with shock and disgust before telling my sister no and asking Crystal for a private moment in his bedroom. There was lots of yelling, but she left that day. Eventually my dad took her back, but for those few days I was at peace, and for the rest of her time with my dad she had been known to our entire family as a druggie. To this day, we still bring the spoons up to my dad as a way to shame him for freaking out over spoons and dating a tweaker. He’s ashamed and always apologizes. No one knows I framed her.\n\nTLDR: my dad’s girlfriend would constantly invade my privacy and try to get me in trouble so I framed her for using drugs (even though she was actually on drugs but I couldn’t prove it).",
        "created_utc": 1669148066,
        "upvote_ratio": 1.0
    },
    {
        "title": "I'm holding up your free deli meal ? My bad!",
        "author": "FamousOhioAppleHorn",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/z23o1f/im_holding_up_your_free_deli_meal_my_bad/",
        "text": "I was at the Walmart deli counter ordering General Tso's chicken. A woman &amp; her teenage daughter approached from my left side and acted like they were going to nudge in front of me. Which I thought was rude, since there was already one person in line behind me. The mom asked the employee preparing my food \"Where's the popcorn chicken ?\" I said \"Oh, it's in the hot bar up front. In front of self checkout.\" She gave me an exasperated look before replying \"I don't want to *buy* it. I want it to munch on while I shop.\" Seemed like a bold thing to announce, but you do you, honey. \n\nI then asked the employee to bag up 4 chicken tenders. At which point the mom made a snotty comment about \"Can you believe it ? Ordering 4 chicken tenders. So rude. Taking up so much time.\" That made me feel really spiteful. Oh gee, Mr. Deli Guy, you have macaroni available ? I would love a big container of that. And you all know how important it is to carefully scoop the macaroni, so the sauce doesn't dribble everywhere! The teenage daughter piped up \"We should have brought your water, Mom.\" Her mom said \"I know! I'm so thirsty. And I just want my popcorn chicken. How long is this gonna take ? Sheesh!\" A second deli employee ambled over with a full pan of potato wedges. Golly, I think I would like some of those, too! The mom exclaimed \"Oh for pete's sake, this is ridiculous! Let's just go!\" and they stomped off. I guess I suddenly have enough food in my cart now!",
        "created_utc": 1669148033,
        "upvote_ratio": 1.0
    },
    {
        "title": "Smooth Kickin Keto Gummies- Reviews Does It Work?",
        "author": "hazelriya",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/z238ah/smooth_kickin_keto_gummies_reviews_does_it_work/",
        "text": "[removed]",
        "created_utc": 1669147053,
        "upvote_ratio": 1.0
    },
    {
        "title": "Revenge on ex",
        "author": "Additional_Mess_",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/z22lee/revenge_on_ex/",
        "text": "[removed]",
        "created_utc": 1669145561,
        "upvote_ratio": 1.0
    },
    {
        "title": "Telemarketer revenge idea? What y’all think?",
        "author": "logdeg",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/z227d6/telemarketer_revenge_idea_what_yall_think/",
        "text": "[removed]",
        "created_utc": 1669144674,
        "upvote_ratio": 1.0
    },
    {
        "title": "Parking lot revenge",
        "author": "itsaconspiraci",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/z222g4/parking_lot_revenge/",
        "text": "Just happened (20 min ago). Got my Thanksgiving stuff and went to my car. Someone in a small pick-up was parked at an angle from almost my left rear bumper. His back right tire was in my spot and the front was on the line. Just a $hi++y parking job. Left me about 6 inches at the corner to squeeze by. I could open my driver's door and get in, but had to squeeze. No reason for it except an inconsiderate act. Just as I'm adjusting his fold in mirror, he walks up. I tell him thanks for leaving me so much space. He ignores me and unloads his groceries. Then walks his cart back.\n\nSo I wait unt he is away, then park my cart against his bumper. Not much, but between that and him having to adjust his mirror, I was happier.",
        "created_utc": 1669144337,
        "upvote_ratio": 1.0
    },
    {
        "title": "My boss fired my colleague",
        "author": "Artofghetto",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/z21vk2/my_boss_fired_my_colleague/",
        "text": "[removed]",
        "created_utc": 1669143895,
        "upvote_ratio": 1.0
    },
    {
        "title": "I suspected my landlord was being shiesty so I set up a camera",
        "author": "Intrepid_Ad3062",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/z21kwy/i_suspected_my_landlord_was_being_shiesty_so_i/",
        "text": "I can’t say what it was exactly but he just didn’t sit well with me. Him and the building managers (old married couple) always seemed to be bothering me about some dumb thing and asking nosy questions about my life for no reason. I am quiet, polite and keep to myself but to be honest, I do seem mysterious and people are often drawn to me. It’s irritating. Anyway, I started suspecting that someone had entered my apartment after I returned from a long trip. It’s easy to see if I’m not home because my car would be gone from the lot. So I bought a motion sensor camera online. ICOULDNT  FIGURE OUT HOW TO GET IT TO WORK as the instructions were all in Chinese and you were supposed to download an app and hook it up to your phone and blah blah omg 😓BUT…. I decided it would still be rather useful. I put batteries in it so the red light would be on, and set it on a tripod a few feet away from my front door before I left for my next trip. It couldn’t record anything but I figured if I were right, it would be a big deterrent.\n\nNine o’clock that night while I’m out of town, I get a frantic text from the building manager couple that they had to enter my apartment as they thought it was an emergency 😂😂😂😂😂😂😂😂 I asked what kind of emergency but they couldn’t say. I asked why they didn’t try texting or calling BEFORE entering for this “emergency” but they couldn’t say either. Fuuuuuckkkk.Dumbass boomers.",
        "created_utc": 1669143231,
        "upvote_ratio": 1.0
    },
    {
        "title": "Pass the buck then say i have to prove myself to you? Enjoy the fines",
        "author": "scorpiorising29",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/z20vqo/pass_the_buck_then_say_i_have_to_prove_myself_to/",
        "text": "Bit of back story. \n\nA few months ago my manager gave me a list of jobs to do and specifically told me NOT to do a certain part of the job because she would do it. \n\nA month or so after she asked me why I hadn't done it. I explained she told me not to but I would do it that day if she's too busy to do it. \n\nAbout a week later, I get pulled into an \"emergency\" meeting with the board of directors. I was questioned on why I hadn't been doing work that my manager had been asking me to do. Manager had told the directors she HAD asked me to do the work. Apparently the job was a real high paying client and they lost the client due to being unreliable. I explained the manager had told me not to do it and pulled up the emails showing exactly what she had said.\n\nNow, this didn't go as I had expected. I was given a warning. I was told to delete these emails immediately as it makes the company look bad. My emails are now monitored and I have to have a weekly meeting with the board of directors to discus my ongoing suitability for the role (im still on probation). They said I'll have to work really hard to show them I'm worth taking off probation.  (They've had nearly 20 of their 45 staff leave in the past 6 months and i can see why.)\n\nThe revenge. Due to being so incompetent, ive been doing a fuck ton of my managers jobs as well as my own so over the past 8 weeks or so I've been working really hard. Completing as many jobs as I can each week up to manager review stage (around 50 in total). Due to my manager being so incompetent the turn around time for her reviews are about 6 weeks. I've completed so many jobs its going to take her a few weeks to review them all. The thing is, these jobs have a deadline for her to file them. This is a legal requirement and the company will be heavily fined for missing  these deadlines. \n\nWhelp. I'm leaving a week before the deadline. I only have to give 1 weeks notice because I'm on probation. That week I'm doing the bare minimum. The manager wont have reviewed none of the files. I'm just gunna sit back and watch the chaos unfold\n\nFuck em",
        "created_utc": 1669141576,
        "upvote_ratio": 1.0
    },
    {
        "title": "My neighbors wouldn’t stop smoking on the balcony. I bought a super soaker.",
        "author": "Intrepid_Ad3062",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/z20ofn/my_neighbors_wouldnt_stop_smoking_on_the_balcony/",
        "text": "It swept into my apartment at all hours of the night. There was a designated smoking area but that was inconvenient for them. I bought a massive water gun and waited one night until it was good and dark outside. When the smoke began, I stepped silently out into the night and sprayed all of the ice cold water as hard as I could into their direction. I heard them yelp in shock as I quickly retreated back into my apartment. My heart was racing and I had a huge thrill. I felt scared but satisfied. They had no way of knowing it was me, but they did know I often complained about them. The next day, I acted like nothing had happened and said hi to them cheerfully. They began to accuse me, I acted shocked and appalled until they admitted they didn’t know for sure what had happened. I said things like “Are you sure it wasn’t raining?” “Maybe another neighbor smelled smoke and thought there was a fire?” Then I went back home and laughed my ass off in glee.",
        "created_utc": 1669141096,
        "upvote_ratio": 1.0
    },
    {
        "title": "i didnt forget about that rickroll, kid",
        "author": "punkalution",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/z20jox/i_didnt_forget_about_that_rickroll_kid/",
        "text": "[removed]",
        "created_utc": 1669140781,
        "upvote_ratio": 1.0
    },
    {
        "title": "Idk",
        "author": "Y0ur0ddl0calFr0gg",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/z1ztro/idk/",
        "text": "[removed]",
        "created_utc": 1669139071,
        "upvote_ratio": 1.0
    },
    {
        "title": "Wronged at a restaurant",
        "author": "Call_me_mark6969",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/z1zon2/wronged_at_a_restaurant/",
        "text": "I was with my girlfriend at a restaurant with a menu that only highlights the item titles without a description for the items so there's no way to know what's in the food. We order what what called \"Grilled Vegetables\".\n\nThe food arrived with a white sauce on it. We didn't think much about it and started eating. I noticed the sauce is heavy and immeidately told her to stop. I asked the waiter if there's butter in it and he says yes. I ask \"may you please change my plate to one without the sauce? It did not say the item comes topped with sauce. It literally said grilled vegetables and came with a heavy animal product (butter) and told him that my girlfriend has a bad allergy to butter.\"\n\nHe said sorry I cant exchange it, I will have to throw the plate, you already moved the vegetables to your plate. I said we can't Eat it though. I was bummed and didn't eat it either since we were supposed to dine together.\nI left the full plate on the side of the table, the waiters, managers and other worker group of 4-5 people were looking at us from afar. No one bothered to come checkup on us or why we havent touched the plate. They were chatting about though.\n\nAt the end they charged me full price even though we did not eat any of it. I calmly paid the bill although I was super outraged.\n\nHeaded back home, grabbed 2 cans of matt black spray paint and headed off at 3 am back to the restaurant and completely cover sprayed all of their 8 signs &amp; logos that lead up to the establishment. Including the entrance.\n\nPetty Revenge well served.",
        "created_utc": 1669138736,
        "upvote_ratio": 1.0
    },
    {
        "title": "he/she stopped drinking in my water jug after what i did",
        "author": "saltedeggwingslover",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/z1wqzj/heshe_stopped_drinking_in_my_water_jug_after_what/",
        "text": "please forgive my english\n\nwhen i was in high school, i always bring a water jug because i get thirsty easily. but when i was on my 3rd year, the school management told us not to bring a drink inside our classroom, even water. so i have no choice but to leave it on the food racks in the canteen together with lunches from different students.\n\neverything was well until i noticed that when i first drank in my jug, the water is already in half or less. i always put ice in it and fill it with water before leaving the house so i was sure it should be full. but for the past week, that is not the case. since i know i would never catch who drinks in my jug (because of my classes), i thought of something.\n\nwhen i poured water in the jug, i added drops of vinegar. then i melted a packed grape juice on a mug to lessen the smell of the vinegar. once done, i mixed the juice. when i was not satisfied, i added drops of soy sauce and lots (i mean lots) of pepper. the appearance looks good because the juice was dark. then i did not put ice to maintain the mixture.\n\nwhen lunch time came, i went to the food racks and saw the small lid of my jug left open. there are droplets of the juice around it, so i was certain it was what he/she used to drink. i never brought the water jug home again and told my parents about the incident.\n\ni am now 24, but still do not know who drank in my water jug.",
        "created_utc": 1669131680,
        "upvote_ratio": 1.0
    },
    {
        "title": "Insufferable students make me email regional traffic company",
        "author": "Happy_I_Am",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/z1ud9a/insufferable_students_make_me_email_regional/",
        "text": "[removed]",
        "created_utc": 1669125771,
        "upvote_ratio": 1.0
    },
    {
        "title": "Made my stupid neighbour move out. (sweet revenge)",
        "author": "Itchthatneedsscratch",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/z1tw4b/made_my_stupid_neighbour_move_out_sweet_revenge/",
        "text": "[removed]",
        "created_utc": 1669124518,
        "upvote_ratio": 1.0
    },
    {
        "title": "Fool me once shame on you.",
        "author": "WonderfulSecretary27",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/z1tbri/fool_me_once_shame_on_you/",
        "text": "I (25M) was dating a 20F in college for a little background she has BPD and a mom ready to check her into a mental institution any chance she’d give her. My relationship of 6 months came to a hold after my girlfriend went out and cheated one night drunk, I broke up with her and didn’t speak for a month. She reached out to me last month and wanted to work things out and like a dumbass I thought she changed. Needless to say I was cheated on again this past weekend. My first petty idea worked perfectly, I knew who’s house she was at so I called the police for a welfare check while she was there. That interrupted that pretty well. My ex drinks and blacks out 3 times a week, does coke regularly, isn’t on birth control and is sleeping with these guys with no condom. I did what any good man would do and informed her mom and two brothers of her behavior, blocked her on everything and to put icing on the cake her landlord has been looking for a reason to evict her, was a shame someone reported the animal she’s not suppose to have to him.",
        "created_utc": 1669122924,
        "upvote_ratio": 1.0
    },
    {
        "title": "Any ideas welcome !",
        "author": "randomgaldem",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/z1rm9q/any_ideas_welcome/",
        "text": "[removed]",
        "created_utc": 1669117852,
        "upvote_ratio": 1.0
    },
    {
        "title": "I’m a vindictive kid",
        "author": "seakysnakey",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/z1m0k1/im_a_vindictive_kid/",
        "text": "[removed]",
        "created_utc": 1669096953,
        "upvote_ratio": 1.0
    },
    {
        "title": "My ex cheated on me for months…",
        "author": "thatsdogwater",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/z1lcfj/my_ex_cheated_on_me_for_months/",
        "text": "[removed]",
        "created_utc": 1669094703,
        "upvote_ratio": 1.0
    },
    {
        "title": "Upvote for a nude (instant) add me on my snap 👻: rosemartin9736",
        "author": "Frequent_Record9582",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/z1j4jq/upvote_for_a_nude_instant_add_me_on_my_snap/",
        "text": "",
        "created_utc": 1669087711,
        "upvote_ratio": 1.0
    },
    {
        "title": "Wanna scam older people enjoy being called out!",
        "author": "mixmatchpuzzlepieces",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/z1j0fn/wanna_scam_older_people_enjoy_being_called_out/",
        "text": "Okay so I work for a federal insurance company that is for people 65+ years old. Well the customer service portion, and these past few weeks it’s seems as though there is more and more of calls that are about someone calling these older people about other programs with the insurance. These are real things, but we never call you to sign you up. We’ll mail you stuff, or see an ad of tv or the radio plays an ad. But we will never call you about it. \nSo funny thing, tonight I got that call! The voicemail said press one to be put threw with a representative. Confused I called it, I’ve had a long ass day. I kept it on mute in case it was collections. “Thank you for calling *scammy business name* where you can get into *programs with this insurance* press one to be put threw to a rep!” In this preppy voice that was kind of like a fancy hotel that’s trying to up talk it’s rooms and benefits. So I press one “hi thank you for calling *scammy business name* my name is *Scammy name* can you tell me what you’re *special info* is.” \nQue my inner bitch, “oh man this is real great shouldn’t you have that?” \n“Well I do but I need you to confirm it.”\n“Oh cool and you’re a program with Medicare?”\n“Yeah, we’re *scammy business* we work with *my business*” \n“Man that’s really funny because I work with them and I’ve never heard of anyone allowing this.”\nThis guy stammers and what I caught was  “oh shit oh fuck. Oh I uh gotta go!” *click* \nI lost my shit over this. I don’t know if this belongs here. But I will say I called them back and they blocked my number or something because I just get a phone tone beeping. I love getting back at these people especially when I know for a fact it’s a scam.",
        "created_utc": 1669087373,
        "upvote_ratio": 1.0
    },
    {
        "title": "Rude Girls Get What They Deserve",
        "author": "Dapper_Dickie",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/z1itpr/rude_girls_get_what_they_deserve/",
        "text": "[removed]",
        "created_utc": 1669086833,
        "upvote_ratio": 1.0
    },
    {
        "title": "My earliest petty revenge memory",
        "author": "Illustrious_Leg_2537",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/z1ihwf/my_earliest_petty_revenge_memory/",
        "text": "[removed]",
        "created_utc": 1669085901,
        "upvote_ratio": 1.0
    },
    {
        "title": "I exposed my boyfriend for the whole school to see",
        "author": "Ok_Judge_1149",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/z1hgo5/i_exposed_my_boyfriend_for_the_whole_school_to_see/",
        "text": "[removed]",
        "created_utc": 1669082980,
        "upvote_ratio": 1.0
    },
    {
        "title": "Girl's at summercamp insulted 10 YO me and lied to my friends there about me and another friend.",
        "author": "Severe-Base-6155",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/z1h1jp/girls_at_summercamp_insulted_10_yo_me_and_lied_to/",
        "text": "[removed]",
        "created_utc": 1669081832,
        "upvote_ratio": 1.0
    },
    {
        "title": "Cazzo succede",
        "author": "Brsita2022",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/z1g0th/cazzo_succede/",
        "text": "[removed]",
        "created_utc": 1669078992,
        "upvote_ratio": 1.0
    },
    {
        "title": "Oops..",
        "author": "Tyrannosaurus_Rex84",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/z1fpi1/oops/",
        "text": "When i was in grade 2, I had a bully and he was the worst, he would steal other people's money and lunch. So one day, I had enough, The bully had a low spice tolerance, how did i know? He tried to steal my friends lunch but my friend's lunch had pepper in it so he was blowing his mouth and crying so i decided to do the same this time, with wasabi and pepper.\n\n&amp;#x200B;\n\nI placed my egg sandwich in my lunchbox and pretended to walk to the bathroom and just waited until i heard that it was breaktime. And there he was opening my lunchbox. He just looked at me and laughed, he then called me \"Stupid\" for leaving my lunch unattended and i just stood there and said, \"Okay\" with a slight smile. And as he ate the sandwich, his face changed from smug to horror, His eyes turned red, His nose running like a hose and blowing his mouth like a fan. He stayed in the bathroom and from that day on, he never stole my lunch.",
        "created_utc": 1669078136,
        "upvote_ratio": 1.0
    },
    {
        "title": "God has entered into my body, as a Ghost body! My same size! Baptism of The Holy Ghost! Acts 2:38!",
        "author": "Sad-Glove7499",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/z1d688/god_has_entered_into_my_body_as_a_ghost_body_my/",
        "text": "[removed]",
        "created_utc": 1669071559,
        "upvote_ratio": 1.0
    },
    {
        "title": "Make me say words I'm not comfortable with? Deal with my mother.",
        "author": "Sofia_roxa",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/z1cgjw/make_me_say_words_im_not_comfortable_with_deal/",
        "text": "[removed]",
        "created_utc": 1669069829,
        "upvote_ratio": 0.99
    },
    {
        "title": "Instant regret",
        "author": "skinnybitchrocks",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/z1biu5/instant_regret/",
        "text": "This was inspired by a fellow Redditor’s post from earlier today. \n\nThis happened on holiday in the US (I’m from Ireland) when I was shopping with my mum, sister and my aunt who were were visiting. We were at an low end luxury outlet mall. \n\nI went in to one of the stores with my sister who was 16 at the time (I’m 12 years older). I do look young for my age but not dramatically so. \n\nThis store is a fairly well known brand. I really wanted a pair of flats and I was thinking of getting a handbag as well- I’d already saw the shoes and bag I wanted. \n\nAnyway my sister and I were meeting my mum and my aunt for lunch and I was going to head back to the store after that to buy the shoes and possibly the bag. As I was walking out one of the sales associates said “you look too young to afford anything in here anyway”. I felt really awkward so I laughed but I was actually shocked. \n\nI’d told my aunt and mum afterwards and my aunt got really annoyed about it. She immediately walked into the store and asked who was the associate who had spoken to her niece like that. The sales associate said that I’d laughed so she didn’t think she had been rude and she didn’t have any ill intentions. Another sales associate piped up and said “well actually I heard what you said to her and I think you were trying to be rude”. \n\nIt turned out the area managers were also in the store at the time and were walking near the front of the store overhearing the exchange. They introduced themselves and asked what was happening. My aunt explained the situation, with the other sales associate confirming my aunt’s story. \n\nTo add further insult my aunt told them she wanted to buy gifts for her two nieces and had intended on buying stuff from that store but that she was going to go elsewhere. Obviously the area managers didn’t reprimand the rude sales associate immediately but I’m certain she wouldn’t make remarks like that again. \n\nI’ve never wanted to buy anything from “Bory Turch” since.",
        "created_utc": 1669067691,
        "upvote_ratio": 1.0
    },
    {
        "title": "Shame on Methany",
        "author": "Personal-Parsnip-463",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/z1b7kx/shame_on_methany/",
        "text": "[removed]",
        "created_utc": 1669066967,
        "upvote_ratio": 1.0
    },
    {
        "title": "AITA?",
        "author": "Aggravating_Bed_8350",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/z1b0lt/aita/",
        "text": "[removed]",
        "created_utc": 1669066528,
        "upvote_ratio": 1.0
    },
    {
        "title": "Need your help with petty revenge!",
        "author": "benji950",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/z1axm5/need_your_help_with_petty_revenge/",
        "text": "[removed]",
        "created_utc": 1669066344,
        "upvote_ratio": 1.0
    },
    {
        "title": "Keep destroying mailboxes, your hands are gonna hurt",
        "author": "logdeg",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/z1a8h3/keep_destroying_mailboxes_your_hands_are_gonna/",
        "text": "This is a story from a friend, not me. \n\nSo, one day a man goes out to get his mail and sees his mailbox is broken off of its post, lying on the ground, and has a big gash through it as if an axe had been brought to it.\n\nMan goes to the store, pays with his own money for a new mailbox, and installs it on his own time.\n\nNext morning, the new mailbox was in the same condition. \n\nThis time, he went to the store and bought two mailboxes and a bag of quick Crete. Filled one of the mailboxes with quick-Crete and installed it.\n\nNext morning, there was a gash through the third mailbox, but it was still on the pole and there was a broken off axe head on the ground near the mailbox.\n\nHe installed the next mailbox and that was the last time his mailbox ever got hit.\n\nWe hope that the axe wasn’t the only injury.",
        "created_utc": 1669064733,
        "upvote_ratio": 1.0
    },
    {
        "title": "Translation, please",
        "author": "remainoftheday",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/z1a3fl/translation_please/",
        "text": "I was thrown out of a class once. Just once in high school. Was worth the laugh... and the comment was that the teacher had no sense of humor....\n\nIt was second year German and the teacher had just received a shipment of a young teens little magazine..I mean little. Perhaps 4 or 5 pages of simply written ditties... So she divvied us up into groups of 3 or 4 kids each. I was not popular, probably a lot my own fault. But I was stuck with two arrogant little males. My group had a total of 6 paragraphs to translate. The self appointed big wig and his toadie took a paragraph each and left me with the other 4. \n\nI told them to do their fair share and take 2 each but 'oh you can do it better'.. I could have gotten the teacher in on it but.. I warned them they had better do it or else...   Anyway, I get more experience. I go home I translate the 4 paragraphs into English. And then I translate the English into the Middle Earth rune language. All of it. I kept the real translation in a book bag. \n\nNext day king Todd (not real name) is all set to parade himself before the teacher and the class until I hand him the Angerthas translation. I timed him; it took him 30 seconds to realize he couldn't read it. Now, mind you, everyone is talking and the was a noise level... Mr king turns to me and says 'Hey, \\*\\*\\*\\* I can't read this!' .. Again, everyone else is talking but for whatever reason the teacher decides to target us and tells Mr King to shut up. I couldn't resist and I shot back 'That's your problem.'... She threw us both out. Typical male he couldn't care less, I might have cared a bit more. I just went to the library and read.",
        "created_utc": 1669064415,
        "upvote_ratio": 1.0
    },
    {
        "title": "Steal $500? I steal it back and get you kicked out of college.",
        "author": "PoisonWaffle3",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/z18tc0/steal_500_i_steal_it_back_and_get_you_kicked_out/",
        "text": "I posted this as a reply in a different sub today, but thought you guys were might enjoy it too. \n\nMy Gmail account got hacked way back in the day (2008) before 2FA. I never found out how, but I'm guessing it was a dictionary attack (I had a short and weak password). I stupidly had my PayPal account under the same email address, and had the same crappy password. And of course I had PayPal linked to my old checking account (though online banking had different credentials). And after I realized I was hacked and went to see how bad the damage was, of course there was a new transfer of $500 from my PayPal (via the checking account) to a different PayPal account. \n\nI hadn't used that checking account for a few years and it's balance was basically zero. I called the bank, told them what was going on, closed the account, and they confirmed that any pending withdrawals would simply fail when they got them. I was in the clear on their side.\n\nI checked the still-pending PayPal transfer, and found that there was an email address associated with the destination account. I looked around (mostly Google searches, nothing fancy) and found that the email address belonged to a college kid in California. I found his Facebook account, a bunch of other social media accounts, and the college that he went to. I messaged him on one of the social media accounts, and told him that if he didn't send the $500 back that I would file a police report, tell his parents (who I had found on Facebook) about his deeds, and report it to his college to get him kicked out. And he needed to do it *now*, before the $500 he took went through (he didn't know it would fail or that my bank account was closed). He sent $500 back right away, the $500 in his direction failed, and then the $500 in my direction went through. I didn't file a police report, but I sent the whole thing to his parents and his college (of course I left out the details about me blackmailing him for $500). There was nothing he could do to get it back without incriminating himself, so I had $500 free and clear that I moved to a different bank account later. \n\nI think he learned his lesson (or maybe learned to change passwords after taking an account and to not use a personal email address), and I learned to have better passwords and 2FA. And I had an adventure and scored $500. Successkid.jpg",
        "created_utc": 1669061386,
        "upvote_ratio": 1.0
    },
    {
        "title": "Stole ex-friend’s locker combination",
        "author": "Plinkwad",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/z18pcj/stole_exfriends_locker_combination/",
        "text": "[removed]",
        "created_utc": 1669061121,
        "upvote_ratio": 1.0
    },
    {
        "title": "Am I TA for refusing my ex gf back in my life?",
        "author": "Icy-Sound5848",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/z18hhf/am_i_ta_for_refusing_my_ex_gf_back_in_my_life/",
        "text": "[removed]",
        "created_utc": 1669060613,
        "upvote_ratio": 1.0
    },
    {
        "title": "Want to hack into someone's phone to delete pics",
        "author": "Own-Raccoon-18",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/z18gvz/want_to_hack_into_someones_phone_to_delete_pics/",
        "text": "[removed]",
        "created_utc": 1669060573,
        "upvote_ratio": 1.0
    },
    {
        "title": "Revenge is Best Served Cold",
        "author": "Middle-Worker-4543",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/z169wf/revenge_is_best_served_cold/",
        "text": "\n\nI was with my dad getting ice cream. At 11 years old, I'd grown accustomed to my dad's driving. Let's just say it wasn't the best...\n\nWe get our ice cream and as my dad is exiting the shop, a driver aggressively cuts him off. We continue behind this driver until my dad and this driver are making the same right turn. My dad speeds up, cuts in front of the driver, takes one last lick of his ice cream, rolls down his window, and chucks it at the car's windshield. For context, the car was very close to us, didn't damage the windshield aside from the cone of ice cream sticking to it. \n\nAs a grown up myself, I don't condone the action, but as a child you bet I was hysterically laughing in utter disbelief. Petty revenge served cold in the form of Ice cream.",
        "created_utc": 1669055519,
        "upvote_ratio": 1.0
    },
    {
        "title": "2 strangers “Pretty Woman” a sales associate on my behalf",
        "author": "lmpellmom",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/z14cfg/2_strangers_pretty_woman_a_sales_associate_on_my/",
        "text": " I have lost nearly 50 pounds due to illness, so none of my winter clothes fit. My husband and son decided to take me to a nicer store in a nearby town and treat me to a shopping spree.\n\nMy guys dropped me off at the front door then went to park the car. As I entered a 55ish male store associate who was staring at his phone greeted me with “Welcome to \\[store name\\]” then turned away. I said “Excuse me.” No reply. I figured I was short of breath and wearing a KN95 mask so he probably didn’t hear me. I repeated “Excuse me.” At this point 2 young women who were shopping nearby stop and look at me. The store associate looks up from his phone, looks me up and down and sneers “We don’t have anything for you here” rolls his eyes and goes back to his phone. \n\nI was completely deflated and turned to leave. \n\nBehind me I hear a young female voice say “Do you know who that is?”\n\nThe associate replies “No.”\n\nThen the other woman said the words from “Pretty Woman” which make my heart sing every time I replay this in my mind’s eye “Big mistake. Huge.”\n\nThe women were empty handed as they passed me and exited the store. My guys arrived just as I reached the sidewalk. \n\nWhen I relayed what had happened my son gleefully predicted the store associate would spend the rest of his day reviewing security footage and trying to Google image me to find out what rich or famous person he insulted (I am neither but with the mask and my physical changes he won’t figure it out!).",
        "created_utc": 1669050961,
        "upvote_ratio": 1.0
    },
    {
        "title": "Try to harass me? Uno reverse.",
        "author": "IdkWhatToCallUser",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/z13z1f/try_to_harass_me_uno_reverse/",
        "text": "[removed]",
        "created_utc": 1669050040,
        "upvote_ratio": 1.0
    },
    {
        "title": "Just give the unwelcome guests a cuppa. If not enough, then a kettle",
        "author": "Strange_Part_2339",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/z13dhf/just_give_the_unwelcome_guests_a_cuppa_if_not/",
        "text": "[removed]",
        "created_utc": 1669048558,
        "upvote_ratio": 1.0
    },
    {
        "title": "Just give the unwelcome guests a cuppa. If not enough, then a kettle ;)",
        "author": "Strange_Part_2339",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/z13bsi/just_give_the_unwelcome_guests_a_cuppa_if_not/",
        "text": "[removed]",
        "created_utc": 1669048439,
        "upvote_ratio": 1.0
    },
    {
        "title": "Just give the unwelcome guests a cuppa ;) if not enough, then a kettle ;))",
        "author": "Strange_Part_2339",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/z139lq/just_give_the_unwelcome_guests_a_cuppa_if_not/",
        "text": "[removed]",
        "created_utc": 1669048289,
        "upvote_ratio": 1.0
    },
    {
        "title": "High school bully",
        "author": "CrazyDiamond7594",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/z0z3eb/high_school_bully/",
        "text": "[removed]",
        "created_utc": 1669037538,
        "upvote_ratio": 1.0
    },
    {
        "title": "What would classify as petty revenge?",
        "author": "GiftSun",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/z0st6g/what_would_classify_as_petty_revenge/",
        "text": "[removed]",
        "created_utc": 1669016205,
        "upvote_ratio": 1.0
    },
    {
        "title": "I ate my mother's fritos so she couldn't enjoy her chili.",
        "author": "K1llM3Pl3453",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/z0s3he/i_ate_my_mothers_fritos_so_she_couldnt_enjoy_her/",
        "text": "[removed]",
        "created_utc": 1669013670,
        "upvote_ratio": 1.0
    },
    {
        "title": "Revenge is Best Served Cold",
        "author": "Middle-Worker-4543",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/z0q413/revenge_is_best_served_cold/",
        "text": "[removed]",
        "created_utc": 1669007142,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do I tastefully go about outing my ex for who he truly is to warn others??",
        "author": "Rashibashiboo",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/z0p718/how_do_i_tastefully_go_about_outing_my_ex_for_who/",
        "text": "Pretty much sums it up. He hurt me countless times and repeatedly. Is manipulative and intentionally inflicts pain just to do so. Says nice/“loving” shit when sober to get me back after fucking up, then shows his truest side when drunk and relapsing without a care in the world as to the hurt he does unto me. I’ve only loved him; he’s only hurt me. I don’t even want anything no revenge or anything, but he is toxic and has already threatened to: trash and toss my belongings, send my naked pictures to everyone and etc. after I’ve done nothing out of malice or hate; that’s what he chooses to do though.",
        "created_utc": 1669004316,
        "upvote_ratio": 1.0
    },
    {
        "title": "Going to steal and swear at me? Let's see how far you get...",
        "author": "AMLT1983",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/z0p4dt/going_to_steal_and_swear_at_me_lets_see_how_far/",
        "text": "Years ago, I used to work at a multi-state family own hardware store chain.  Our store was located behind a local high school and at the start of every school, we'd have a rash of high school student coming in after school and try to steal things, mostly, just because it was something \"bad to do\".  After a few weeks of us keeping an eye on them, they would get the hint and stop coming in.\n\nOne year, we had a few kids that were stealing more than candy and things to be annoying, but higher ticket items.  One of the kids was in a motorized wheel chair and would hide things in his lap and in his backpack.  One day he comes in and steals about $250 worth of small items, (paint sprayer tips I believe) and I calmy follow him out and ask him to return the items he stole.  He starts yelling and swearing at me, calling me every swear word he could think of.  I remained calm and said, if you don't return the items, I will call the police.  He responds with f\\*\\*\\* you, I'll be gone by the time they get here.  \n\nSo, I paused, walked up behind his chair and disconnected his battery from his chair. I called the police, as he was stuck in front of the store, swearing at me.  The police showed up, and his tune quickly changed.  He was ticketed him, and arranged to have him taken home with a ticket and a court date.  \n\n\nA few days later he was brought in by his mother and apologized.  His dad pulled me aside and said he is sorry his son stole, followed by \"My son was really embarrassed by that, but that is what happens when you do stupid thigs.  I think it was hilarious and he will not be doing that ever again.\"",
        "created_utc": 1669004102,
        "upvote_ratio": 1.0
    },
    {
        "title": "Put milk in my coffee? Enjoy the aftermath",
        "author": "colobirdy85",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/z0mxwi/put_milk_in_my_coffee_enjoy_the_aftermath/",
        "text": "I'm slightly lactose intolerant. Milk gives me horrid gas and today my cousin put whole milk in my coffee when I wasn't looking. It took about an hour for the bubble guts tobstsrt and at that point we were in her car heading to a family gathering...3 hours away. It's been fairly cold and so she didn't want the car windows down. I spent most of the car ride letting silent but violent air biscuits that made the whole car smell like a Woodstock port a potty. She thought an animal had died in her air vents.",
        "created_utc": 1668997846,
        "upvote_ratio": 1.0
    },
    {
        "title": "Sailor got tired of everyone using his mug. Made sure no one else would want it.",
        "author": "wichessway",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/z0lzfa/sailor_got_tired_of_everyone_using_his_mug_made/",
        "text": "Okay so I'll preface this by saying this is my dad's story from when he was in the Navy and it cracks me up every time I tell it to someone else, and I figured it belonged here too! This is just the general story so if Navy details are inaccurate please be a bit gracious.\n\nSo at the time my dad and his fellow sailors lived on the ship they were assigned to, and they had their standard cutlery, dishes, glasses, mugs, etc. Well, a lot of the guys all had their own personal mugs that they liked to use in the mornings for their coffee, and while there was no official rule obviously regarding mug use, it was generally understood that you didn't use another guy's mug, though this wasn't strictly enforced.\n\nNow occasionally the guys would use each other's mugs, not a huge deal to most of them as long as it was clean and not stained when they were done, but there was one sailor, let's call him S, who did not appreciate this in the slightest. No matter what, if anyone ever used his mug and he caught them or found out, he would berate them and tell them not to use it because it was HIS mug, not theirs. Some guys respected this, but some honestly just didn't care enough and kept occasionally using it.\n\nWell, one day I guess S snapped, and that morning when all the guys were drinking their morning coffee, my dad included, S went and grabbed his mug then stood in front of everyone and cleared his throat loudly. When everyone turned to look at him, he held up his mug, unzipped his pants, pulled out his you-know-what, and rubbed it all over the mug, in and out. Then he calmly tucked himself back in, held up his mug and said, \"Don't use my mug.\" Then he washed it, poured himself a cup of coffee, sat down and enjoyed it.\n\nNeedless to say, no one ever touched his mug with a ten foot pole after that.",
        "created_utc": 1668995174,
        "upvote_ratio": 1.0
    },
    {
        "title": "Hack my Facebook account and pretend to be me? Hope you like Sonic the Hedgehog or Huggy Wuggy!",
        "author": "PuddieBlackcat",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/z0l8s5/hack_my_facebook_account_and_pretend_to_be_me/",
        "text": "So a couple of days ago, I got hacked by some guy. It happened when I was in Algebra class. When I first realized I got hacked, I was LIVID. Then I post my problem on Instagram, forgetting the hacked account was linked to my Instagram. I also saw that the person who hacked my Facebook account changed my picture to some blonde. I got pissed about my Instagram being linked to my Facebook, but that was when I got an idea. I started spamming photos of Sonic on Instagram, knowing that the hacker is going to see this. So I ask my mom if I can stim on my Instagram account, and she gave me the all clear (I have autism, just to clear it up). For the next few days, I spend time on Instagram, spamming my Instagram and hacked Facebook account with as many Sonic the Hedgehog or Huggy Wuggy pictures I can find on Pinterest that are safe for work. That account later tried to pretend to be me, from changing the profile picture to be of a picture of my siblings all the way to using a picture of my family at Hanukkah.\n\nThat was the last straw. Today, I got my account back and I found things that made me VOMIT. I found a lot of NSFW texts and the same dumb looking blonde (my boyfriend told me that the same blonde was seen on CornHub). I also found out the guy’s real name because he was dumb enough to demand people to send money on PayPal and leave his username. So now I’m going to track him down and update soon!",
        "created_utc": 1668993161,
        "upvote_ratio": 1.0
    },
    {
        "title": "Use building funds to host a private party? Now host everyone",
        "author": "tktsmnypssprt",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/z0jsws/use_building_funds_to_host_a_private_party_now/",
        "text": "This is still fresh!!!\nMy building super is a right pr***k. He and his wife and only been managing the building for about 18months but we have all had it. They have let this “power” get to their head, to the point where there are always multiple signs around the building warning about something. They have questioned me about what I am doing (I took a couple of months off last year to recover from something and he outright asked me “are you working????”), they are absolute busy bodies (I had a guy over, then the following week was getting my carpets cleaned by a young guy- building super thought I was doing both and came over to ask me who this guy was like he was my father!!! Even if I was hooking up with both of them NONE OF HIS BUSINESS. They watch us on cameras and monitor what we do (friend got a puppy and within 5 min had a text from the super re puppy, so they definitely watch).\nAnyway, they regularly have these lame little parties that are always so “exclusive”. I’ve recently found out they are using building funds to pay for them. This years early Xmas party is to be FULLY CATERED. I declined the invite because these parties look boring at best but I am 100% not ok with the entire building paying for this stupid party- i think if you are going to use building fund, you’d better invite the whole building. I don’t work 12 hours a day to subsidise this. Neither does anyone else. I have also noticed that these parties always have the “white” people. We have a diverse community and yet nobody of colour is ever invited. My terrace overlooks the courtyard so I know exactly who attends and who they are chummy with (hint: it’s a pretty specific demographic)\n\nFrankly, I’ve had enough of him and his BS.\nSo I downloaded the invite. Made 150 copies and had a friend put one in everyone’s letterbox overnight. \nNow as people RSVP I can enjoy watch him lose his mind- not sure what the outcome will be. This many people getting invited surely will raise a flag to some of the other residents re how this will be funded as previous smaller parties could fly under the radar. So now he will either need to fork out from his own pocked or cancel the party. \n\nSorry not sorry.",
        "created_utc": 1668989286,
        "upvote_ratio": 1.0
    },
    {
        "title": "Won’t refund me? Enjoy losing a few sales.",
        "author": "i_8_the_Internet",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/z0gred/wont_refund_me_enjoy_losing_a_few_sales/",
        "text": "[removed]",
        "created_utc": 1668981831,
        "upvote_ratio": 1.0
    },
    {
        "title": "Boss was withholding my checks",
        "author": "dante_1983",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/z0gnw2/boss_was_withholding_my_checks/",
        "text": "This is probably stupid but here goes. So I was a teenager working at a small local chain of stores. I was trying hard to get my honors diploma, work 32 hours a week, and sleeping in my car a lot of the time. My dad had some alcoholism issues. I’d stay with friends when they’d offer but that was rare, most didn’t know I was essentially homeless. So anyway, top manager says everyone is going on direct deposit, it’s not a requirement but is recommended. I didn’t even have a bank account. There were only a couple of banks in my town and they didn’t come out with student checking accounts til a few years later. If you wanted an account you had to keep a $400 minimum. Not really an option at $7 an hour living in your car. Well, maybe for some ppl but I wasn’t one of them. I could cash my checks at my dads bank.. So several weeks in a row I go in on Friday for my check, it’s not there. I ask the manager, he says corporate still has it they won’t send it with the stubs. Well one Friday I am well and truly broke. I can’t do anything about it that night. Saturday morning I’m really hungry and on my last bit of gas, I drive the 45 minutes or whatever to this other town where the main branch is. I ask for my check, the lady at the customer service counter looks confused. She calls the accounting lady, she calls down the owner. At this point I’m hungry and sleep deprived and on the verge of tears as I explain again that I need my check. He gets angry, has no idea what I’m talking about, of course the checks are sent with the stubs. Tells me my check will be waiting when I get back to my store, walks away looking disturbed and not happy. I got my check, never had another problem…. Buuut, I was an angry teenager. I didn’t want to hurt the guy, but I thought he should feel some inconvenience. In the middle of the night I walked by his house, and let the air out of one tire. Every few months I did this again for like a year until I grew up a little. Ps. This is a rural area, everybody has an air compressor, I didn’t cut it or hurt it. He’d just have to pull in his driveway on a flat, or take the wheel off and roll it up the road to his garage. Like I said, stupid, immature. Few years ago. But I still think of it from time to time",
        "created_utc": 1668981611,
        "upvote_ratio": 1.0
    },
    {
        "title": "Maybe you shouldn’t have talked to me that day…",
        "author": "No_Possibility2521",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/z0g4pj/maybe_you_shouldnt_have_talked_to_me_that_day/",
        "text": "Back during my Sr year of high school my bf cheated on me with a girl who was supposed to be a friend of mine. She was the younger sister of another member of our friend group but we got along fairly well. I gave him a second chance. \n\nKnowing that avoiding her was going to be impossible, my one condition was that he couldn’t be alone with her. Things seemed to be ok for a couple of months until he got in a car accident and she was the only passenger in his car. I ended it right then and there. \n\nThe girl, I’ll call her C, started skipping school a lot to spend her days with him (he had graduated the year before). When she got in trouble for it, she tried to claim that she was afraid that I was going to beat her up. \n\nI wound up getting called to the headmaster’s office to have a discussion with Mr B. I asked him if she had been in school every day the week before and he said no. Well, I had been on vacation with my family the week before and she was aware of it so, no, I wasn’t the reason she was skipping school. I promised Mr B that I had no intention of beating her up, but that I was going to get my revenge if the opportunity ever presented itself. \n\nWell, two months later, opportunity came knocking. I was sitting outside with a friend during lunch. Guess who came up to talk to me. If you guessed C, you would be correct. Mr B also happened to be outside and was keeping an eye on us to make sure a fight didn’t break out. \n\nI looked at C and could tell she was high as a kite, which is why she had the nerve to try and speak to me as if nothing was wrong. She turned away from me for a second to say something to someone else and when she turned back I asked her what was on the back of her jacket. She took it off to see what I was talking about. \n\nC: I don’t see anything \nMe: you can’t see that stain?\nC: no, I don’t see anything \nMe (as incredulous as I could sound): that stain is huge. I can’t believe you don’t see it. If you don’t believe me, go ask Mr B\n\nDid I mention she was REALLY HIGH?\n\nWell, she goes to ask Mr B who told her there was nothing on her jacket. She then goes inside. \n\nMr B looked at me, shook his head and quietly laughed as he walked into the school. Half an hour later, as I was sitting in class, C got called to Mr B’s office and wound up getting suspended for 2 weeks.",
        "created_utc": 1668980337,
        "upvote_ratio": 1.0
    },
    {
        "title": "Don’t mess with my soda!",
        "author": "dkirsh62",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/z0frhs/dont_mess_with_my_soda/",
        "text": "This happened many years ago when I worked in a factory. I used to sit with three guys everyday for lunch. Most of the time it was a bag lunch or something from the food truck and a soda from the soda machine.  One day I went to heat up my bag lunch at the microwave. I had already opened my soda. When I came back I went to take a drink of my soda and found clumps in it. One of the guys at the table was laughing historically. It seems that he thought it was funny to put popcorn in my soda. I was pissed. I was not in the mood for his humor. \n Here’s the revenge part. A couple days later I went to the store and bought 4 full size Milky Way candy bars.  I got a syringe from my diabetic father and filled it with Tabasco sauce. I proceeded to shoot one of them full but you could not see any holes. The next day I told the other two guys what I was up to. At lunch I took out the candy bars and gave them to the guys as a “treat” for being good guys. When the “jerk” bit in to his… his face told the whole story. Holy cow did we laugh. This was before cellphones so no video. At that point he said he will never mess with anyones food ever again!",
        "created_utc": 1668979485,
        "upvote_ratio": 1.0
    },
    {
        "title": "Help me get revenge on my 14 year old spoiled rotten little sister",
        "author": "theSpanarchy",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/z0eir7/help_me_get_revenge_on_my_14_year_old_spoiled/",
        "text": "[removed]",
        "created_utc": 1668976514,
        "upvote_ratio": 1.0
    },
    {
        "title": "Text this number if you’re bored",
        "author": "Personal_Leg_1926",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/z0czde/text_this_number_if_youre_bored/",
        "text": "[removed]",
        "created_utc": 1668972804,
        "upvote_ratio": 1.0
    },
    {
        "title": "10 year old me getting a small taste of victory over my sister in a fight for the couch",
        "author": "Illustrious_Leg_2537",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/z0bcjx/10_year_old_me_getting_a_small_taste_of_victory/",
        "text": "[removed]",
        "created_utc": 1668968832,
        "upvote_ratio": 1.0
    },
    {
        "title": "am I the ah for bulling my family.",
        "author": "burninglampswarno",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/z0b8a2/am_i_the_ah_for_bulling_my_family/",
        "text": "[removed]",
        "created_utc": 1668968542,
        "upvote_ratio": 1.0
    },
    {
        "title": "the Uno card ( got back at the bully)",
        "author": "Round_Teacher_224",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/z0a6bs/the_uno_card_got_back_at_the_bully/",
        "text": "so this can be pro-revenge or nuclear but to me, it's just petty revenge due to lack of context.\n\nwhere my parents come from they have many people who practice witchcraft  ( in secret ) so many people have to be careful,  and there was this guy who I will call DAMIAN who was infamous for practising witchcraft and proud of it which is legal by the way.           \n\nyou would have a small confabulation with him and all of a sudden you are sick,  or a cow dies or some kind of bullshit ( you know all African villages shenanigans), \n\nand then people started dying like you have a conflict with him all of a sudden you'll die that year and it went on like that for years and not just normal deaths but something like dying after drinking one beer bottle, random unknown diseases, or you will become a mad person and you will start running around naked. ( this went on for a span of a few years )\n\n and to put salt in the wound is that you can't legaly prosecute someone for witchcraft because it is hard to prove.\n\ndid I say that it is the reason why my parents moved away ?? or that DAMIAN had no neighbours because everyone started dying all of a sudden??\n\n**cue the revenge**\n\nwhere I come from it's a hilly country so they started burying people in full view of Damian's house on the other hill so that he will have to see those he killed or any random people just to make his mornings suck more just to piss him off.\n\nthen somehow a deranged guy started showing up and standing in the compound just stalking the family to piss them off, \n\nthen he got sick ( elephantiasis) then he became mute before he died the last year.                                                    funny thing is that the stalker still shows up sometimes even after his death.\n\n&amp;#x200B;\n\nmaybe the villagers got tired of the guy and decided to go down on him and the family.",
        "created_utc": 1668966088,
        "upvote_ratio": 1.0
    },
    {
        "title": "My school denies me my IEP access ipad?, I guess I just have to steal 16 chromebooks.",
        "author": "ChubbiHyena",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/z0a5od/my_school_denies_me_my_iep_access_ipad_i_guess_i/",
        "text": "[removed]",
        "created_utc": 1668966045,
        "upvote_ratio": 1.0
    },
    {
        "title": "Sell me a car then steal it? Is a kick in the nuts I still feel it",
        "author": "Only_Influence_7109",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/z09wvm/sell_me_a_car_then_steal_it_is_a_kick_in_the_nuts/",
        "text": "[removed]",
        "created_utc": 1668965468,
        "upvote_ratio": 1.0
    },
    {
        "title": "I'll get to the restaurant first",
        "author": "Poortio",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/z09di1/ill_get_to_the_restaurant_first/",
        "text": "My middle daughter Claire, has a frenemy, Emma, who is obsessed with a local mexican fast casual restaurant The Costal Life and was so excited that we were getting one a few blocks away. Emma was braging about how she was invited to the early open Friends and Family and how she was going to be the first one in line etc.\n\nMy oldest daughter's friend Bre works at the new Costal Life and was at our house saying they were doing a training and needed 3-5 volunteers the night BEFORE the friends and family night to prepare for the full service. Well Claire volunteered and went to help out making sure to post to all the socials about the new Costal Life and her experience being one of the first to eat there, saying how she's so sad she's not invited to the Friends and Family night the next day.",
        "created_utc": 1668964200,
        "upvote_ratio": 1.0
    },
    {
        "title": "♥️21 [F4M]Sending my sextape to whoever 💋upvotes just because i’m horny💋 (my autoreply is on) 💋add me Snap: zarasex78",
        "author": "wryuhdtihcyivcy",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/z083cu/21_f4msending_my_sextape_to_whoever_upvotes_just/",
        "text": "",
        "created_utc": 1668961054,
        "upvote_ratio": 1.0
    },
    {
        "title": "Well that STINKS !!!!",
        "author": "specimenhustler",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/z0738l/well_that_stinks/",
        "text": " I owned a condo and lived on the top floor, I had neighbors that were VERY loud. They had two kids and they let them bang on the adjoining  walls , all day long sometimes. They also let the kids leave tons of toys on our front steps. You would think complain to the HOA but nope , He was treasure of the HOA. But i did complain anyway with no response , soon after the complaint they started slamming their front door when they went out. &gt;Ill back up here and say I worked 12 hr shifts from 8p till 8 am . So I was a day sleeper&lt;.  well some times they slammed the door so hard I would have pictures of mine fall off the wall. I confronted HIM a few times and his answer was well he will let his wife know and ask her to keep the kids calmed down on the days I worked.... VERY long story short after living this way for three years I decided to sell. we were NOT allowed to sublet. For whatever reason my unit had access to the attic from inside one of my bedroom closets. Well my unit sold I lost money because of down market but I just wanted to get out. The day  before closing I went fishing. I did good got My limit of Trout and also snagged 2 or  3 creek suckers all about 12\". I gutted the trout kept the guts and along with the suckers you guessed it. I went into the attic. I waited till they went out , yea the slamming of the door was the clue. I placed a fish near one of the electrical junction boxes that was above their bedroom then above the bathroom /kitchen wall I found it open for the mechanicals . vent line ect so I dropped the rest of the guts and fish down in. they dropped about 8 feet down to floor level between the kichen and bathroom. I wish I knew how it ended =)",
        "created_utc": 1668958570,
        "upvote_ratio": 1.0
    },
    {
        "title": "Need help: how to get someone fired",
        "author": "lyricbranch1029",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/z04wy6/need_help_how_to_get_someone_fired/",
        "text": "[removed]",
        "created_utc": 1668953013,
        "upvote_ratio": 1.0
    },
    {
        "title": "Please rate my petty revenge plan",
        "author": "Shakin__Stevens",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/z027o8/please_rate_my_petty_revenge_plan/",
        "text": "[removed]",
        "created_utc": 1668945058,
        "upvote_ratio": 1.0
    },
    {
        "title": "Farewell, Twitter",
        "author": "CerousRhinocerous",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/yzxwnw/farewell_twitter/",
        "text": "[removed]",
        "created_utc": 1668928752,
        "upvote_ratio": 1.0
    },
    {
        "title": "I should have just stuck with my plan on being single",
        "author": "Flashy_Emergency_702",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/yzv676/i_should_have_just_stuck_with_my_plan_on_being/",
        "text": "[removed]",
        "created_utc": 1668918879,
        "upvote_ratio": 1.0
    },
    {
        "title": "Petty, but satisfied",
        "author": "qtakhisis",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/yztp61/petty_but_satisfied/",
        "text": "This happened years ago. And it's very petty.\n\nThe day I found out my now ex-husband had a girlfriend is the day I threw him out. I called him at work, told him to get his stuff and get out. \n\nHe came, in HER car, packed most of his stuff, and said \"I need at least 2 dressers. Clean them out while I'm gone. I will be back in an hour.\"\n\n...\n\nExcuse me?\n\nSo I did. I cleaned out the 2 dressers he liked best. I then carried them to the front steps, and kicked them down. The concrete steps. \n\nThey only had minor damage. \n\nSo, I hauled them back up, my dear friend who lived next door was laughing hysterically at this point, and punted those sons of bitches as hard as I could.\n\nThey shattered beautifully.  Big giant, completely unusable and unfixable mess. I'm talking splinters.\n\nI went back inside and waited.\n\nI waved at both of their scowling faces when they slowly drove by a little later. \n\nVery minor, extremely petty. Totally made me smile on a day I really needed a smile.",
        "created_utc": 1668914007,
        "upvote_ratio": 1.0
    },
    {
        "title": "Steal my groceries? I’ll steal your pizza.",
        "author": "Nova_Voltaris",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/yzq54l/steal_my_groceries_ill_steal_your_pizza/",
        "text": "I live in an apartment complex. A month back my mother ordered a box of groceries worth about sixty dollars. Eggs, veggies, some meat, and such. It was delivered to the wrong address, to another apartment building with the same number as me. My mother got a photo of the box at their doorstep and a notification that it was delivered.\n\nIt took less than five minutes for the guy inside to swipe the box of groceries and hide them inside his home. My mother confronted him about it but he denied everything and we didn’t get our groceries back.\n\nTonight that same dude ordered two pizzas and some subs, and it was delivered to our door. Since he stole all of our groceries that day, we kept the pizza for dinner tonight. The pizza was worth 24 dollars in total, not even half the worth of the box of groceries he stole. But still, its a small victory.",
        "created_utc": 1668903032,
        "upvote_ratio": 1.0
    },
    {
        "title": "Evicted - ok",
        "author": "Zoeyjonesybinx",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/yzq1un/evicted_ok/",
        "text": " Many years ago, during my senior year of college, I rented an apartment in a house that had been converted into four units.  The city had a program to ensure that young renters weren’t scammed by slumlords.  The apartment had to pass certain occupancy standards before the utilities were activated.  I was given a checklist and encouraged, by the landlord, to mark everything as a pass so I could get utilities connected.  My apartment failed a few items and I noted those on the checklist that went to the city.  Landlord was not happy to have to fix the items.  Strike one.\n\nThe downstairs tenant was a lady with a teenaged daughter, renting in an area dominated  by college students.  The lady was a nuisance but the daughter was ok.  The lady constantly complained about people using one of her two parking spots when she had only one car.  My boyfriend would use her spot on purpose, which she reported to the landlord. Strike two.\n\nThe walls and floors in this house were so thin you could hear everything that went on in the other units.  The guys across the hall and I had fun with it.  Joking about bathroom routines and weekend visitors.  The lady downstairs complained to the landlord that I had a live in boyfriend and a cat (not allowed).  I could prove that my boyfriend had his own apartment, but, I did have a cat.  Strike three.\n\nNine months in to a twelve month lease I get an eviction notice.  Of course my young self freaks out!  I have another month before graduation and nowhere to go!  I  mention this to one of my professors, who teaches business law.   He asks me if I had planned to leave in a month (breaking the lease) and I say yes.  Well, he says, if you broke the lease they could make you pay the rest of the lease and keep your deposit.  Since they evicted you,  they have give you 30 days to vacate, have to refund the deposit and cannot collect the remainder rent. \n\nWhen I graduated I sent the downstairs neighbor a Thank You note for my graduation gift of two months rent / security deposit.",
        "created_utc": 1668902762,
        "upvote_ratio": 1.0
    },
    {
        "title": "Debating on a spite hookup just to piss her off 🤷‍♀️",
        "author": "Chaoticqueen19",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/yzm9o3/debating_on_a_spite_hookup_just_to_piss_her_off/",
        "text": "My baby daddy/ex wants to sleep with me again. I don’t like or want him but I do want to spite his ex fiancé who is also baby mama #2. \n\nHe started trying to sleep with me 2 days after him and his ex fiancé broke up and I guess while they were together she was trying to encourage him to take my kid from me, went to a relative of hers that calls herself a “psychic” and got the psychic relative to say some SERIOUSLY f’ed up sh💩t about me to convince my ex/bd that I am some kind of bad mom, and pretended to be nice to me so I’d add her and she could “keep an eye on me” on social media. Apparently she’s quite jealous and insecure about me (she’d throw in his face any time they argued that she bet if they broke up right then he’d run straight back to me), hates me for no reason since I was always kind to her and I never wanted him back (if I had, he certainly wouldn’t have been with her any longer lmao), and even tried to get my kid to call her mom too at one point. \n\nThey’re currently fighting after their breakup so ex/bd spilled the beans. Anyway, what do you guys say, should I get it one more time to make her reallll mad?",
        "created_utc": 1668892385,
        "upvote_ratio": 1.0
    },
    {
        "title": "Ex best friend watches my insta story",
        "author": "ok67889",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/yzm8sa/ex_best_friend_watches_my_insta_story/",
        "text": "[removed]",
        "created_utc": 1668892319,
        "upvote_ratio": 1.0
    },
    {
        "title": "I am messy? Okay then I leave a huge mess on my way out",
        "author": "faegoodies",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/yzlbnd/i_am_messy_okay_then_i_leave_a_huge_mess_on_my/",
        "text": "This is a bit of a long story because there are multiple parts. \n\nLast year I moved out of my parent's house to move in with my boyfriend who was subleasing an apartment from his father. The father has a lot of mental issues like paranoia and would frequently make random visits to our apartment. Sometimes when we weren't there. He would make awful comments about how we were living and if there was an inspection he made me move out all of my stuff because technically he wasn't supposed to be subleasing the apartment. It made sense, but after a year of doing this multiple times and dealing with having two landlords, the first chance I got to leave I did. I felt like my boyfriend wasn't going to help us find a better place to live anyway.  (This is the second part of the story) \n\nMy father had plans to buy my grandmother's house and make an effort to take care of her until he died. My father had asked me from time to time if I could stay the night to watch her because he cannot live on her own. At first, I refused, because it was a 30-40 minute drive from my apartment, and was exhausted from trying to live on my own as is. \n\nAnyway, after feeling like the apartment was a turning into a bad idea, I thought it'd be nice to live in a spacious place and have some time with my grandmother because my other one recently died (thank god that is another story) and my alive one wasn't a bad person necessarily. The plan was to stay at my grandmother's until Spring and in that time I could try to find a better place to live. And it was sooooo much better than that dump of an apartment. \n\nFast forward, a bit, and my oldest sister and my family cut ties after a family vacation. A lot of drama let me tell you. But despite this, I really really wanted to have a relationship with my sister. My parents spoke nothing but poison about my sister and I never understood why. I decided that her issues in the past like doing drugs and having a child early were just decisions she made. She is 10 years clean now anyway from drugs. So I got her gifts, drove (2hrs there and back)  to my nephew's birthday party (lots of smoking and uncomfortable) got her a ticket to a lunar fair, offered to help her, and be a supportive aunt to my nephews. \n\nHere's the kicker. When I went to the birthday party, she didn't talk to me. I talked to her husband's Aunts more than her. The gifts I bought for my younger nephew were his birthday gifts, but because of the long drive, I gave them their Christmas gifts early. I told my sister she could have her's early because I figured she having a tough life might want to have a gift, and I could get her something small for Christmas anyway. But I found out the next morning, she had her kids opened their gifts already. I get maybe she didn't want to hold onto them for a month, but it kind of hurt a little? Maybe I messed up idk. Then the next weekend, we go to the lunar fair together. (It is basically a mini renaissance fair every new and full moon throughout the warmer months) She arrives at my grandmother's and talks to her for a solid hour before we head out. Thank god, I drove in my own car because after being there for barely 2 hours she leaves. Mind you, she and I were separated the whole time. Excuse me? You drove 2 hrs to see me and didn't even talk to me??? \n\nI decided at the time I was being selfish because her husband's grandfather was dying. He told me the doctors told him he had 24 hours to live. So despite feeling abandoned again, I just tried to enjoy myself at the fair alone. \n\nThen after a long day at work I come home to see a car in the driveway, at first I thought it was my Aunt (more on her later) but in fact, it was my sister, her mother (my sister and I have the same dad, different mothers), my sister's half brother, and my older nephew. Wait wait wait, why are you here? And why did no one tell me? My sister stayed for a few hours talking non stop to my grandmother and then left!!! Didn't say hi, didn't ask how I was doing NOTHING. \n\nSo that night I messaged her how I know I was living with my grandmother, but a heads up would have been nice. Cuz then I could have gotten out of work a little earlier, made some food ( even snacks) etc. And she in her own words, told me how she wasn't there to see me. Grandma was the only one that mattered. Wow... I started to cry...\n\nBacktracking a few weeks before all of this, my Aunt (the dictator in all of this) started to rile up my grandmother saying that my father wasn't taking care of her. Mind you, he came up every day to bring her food, open some stuff for her because she is weak, clean up after her dogs, change her bed, take the trash out, etc. Grandma honestly should be in a nursing home considering her condition, but my Aunt knows best. Anyway, my father and my grandma got into an argument and after that, he left my grandma to be taken care of by this other lady who comes up to the house once a week and me. I helped her when she needed help, but the original plan was my dad was going to do most of the work. \n\nSoon after, my grandma says that she can no longer pay for the house (which btw my dad was paying for all of her expenses except for the car insurance) and now my boyfriend and I have to move out. Which is fine, because staying at her place wasn't going to last long anyway. But what triggered me the most was my Aunt and her had been talking behind my back for weeks since my dad left the picture. Saying I am slob, that I should be at my grandmother's hand and foot, that I don't share, the house is too cold, I keep grandma locked downstairs. Excuse me? I have a full time job! Some days I am too tired to clean or cook. And btw, I constantly asked my grandma id she needed anything or if the house was too cold, but she always said everything was good or no thanks. LIKE WTF!!! My Aunt started to talk crap about me when I asked her for 10 bucks btw. That whole story was just me lending my grandma so we can get some pizza and my grandma wanted to pay me back. My Aunt yelled at me saying I shouldn't have anything. But my grandma insisted???? I don't understand!!! Whatever...\n\nSo now we go back to my sister. Apparently, when she made the last visit she was talking to my grandmother about how horrible I was too. My Aunt who lives 1,000 miles away is one thing, but my sister who I have been nothing but nice too? After that, all my pent of anger and rage just came out. If my family was nothing, but evil snakes, I was going to treat them like it. \n\nRevenge Time\n\nI blocked my sister on everything, blocked my Aunt, and my grandma. Upon moving out, I sprinkled the whole house with sugar, felt garbage everywhere (cuz apparently I am a slob), I left cat litter on the floor, tossed some poop under dressers, threw more sugar all over my grandma's fancy clothes, I left every single light on in the house, turned the heat off, opened all the windows, I dumped the last of my cooking oil down the kitchen sink and whatever I could find. I stopped starting my grandmother's car so it wouldn't start, I hid her mailbox key (eventually gave it to my dad cuz he actually owned the locks on the mailbox), I ran a bunch of appliances at once so there would be a mini power outage in her kitchen. So no fridge or freezer. I took all the ant and mouse traps. I was done with this family. \n\nI did all of these things because for years I have felt nothing but used and manipulated by my flesh and blood. It happens all the time to my parents. So I did it for them and myself. \n\nJust so everyone is aware, I am living back with my parents and my cats and boyfriend are safe. We are looking for a small house with no family attached.",
        "created_utc": 1668889832,
        "upvote_ratio": 1.0
    },
    {
        "title": "Bullying in the workplace",
        "author": "Threebirds1143",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/yzjt8x/bullying_in_the_workplace/",
        "text": "(I posted this elsewhere but I guess it fits better here) \n\nI work in a kitchen. An older lady has always had it out for me. I've literally never done anything to her. When I ask other people what her deal is they say that's just how she is. \n\nI've worked there for roughly three years, and this year is by far the worst with her. So I've started getting her back in really small, petty ways. \n\nFor example, she has a favorite chair in the break room and also a favorite area to sit in. So I move the chair a few spots over. It really makes her mad. And she doesn't even think it's me because I never sit in it. \n\nShe gets her prep for the next day ready before she leaves everyday and puts them on a speedrack with a bag over it. She leaves a note on it that says \"do not remove items or tear bag\". So I tear a small hole in the bag. She gets really cranky about that one and says, \"these idiots can't even read.\" Which makes me laugh because I do read it. \n\nSo recently she called me fat. To my face. Out of nowhere. (Tbf I did gain a bit of weight recently 😅). So I called my union president and complained about her getting sent to a woman's committee retreat this year. (The union pays for everything for these, including time lost from work.) I said she obviously isn't a woman's advocate. She agreed and said that she'll set a stipulation for next year that only woman who haven't gone before can go. \n\nI've got more up my sleeve. And I love doing these things secretly. It's fun, and makes me feel better about the harassment and blatant bullying.",
        "created_utc": 1668885796,
        "upvote_ratio": 1.0
    },
    {
        "title": "Need help!",
        "author": "Primary_Poet_7487",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/yzjqbh/need_help/",
        "text": "[removed]",
        "created_utc": 1668885587,
        "upvote_ratio": 1.0
    }
]