[
    {
        "title": "They will probably ban me.",
        "author": "mansurhasanazer",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/117jj1x/they_will_probably_ban_me/",
        "text": "[removed]",
        "created_utc": 1676924771,
        "upvote_ratio": 1.0
    },
    {
        "title": "Storytime",
        "author": "grooploop13",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/117i69y/storytime/",
        "text": "[removed]",
        "created_utc": 1676921583,
        "upvote_ratio": 1.0
    },
    {
        "title": "I have one",
        "author": "pflickner",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/117h5tr/i_have_one/",
        "text": "Many moons ago I was hired at Melon Bank ass systems programmer and was made a junior to the other guy they hired because he had MICS experience and I didn’t. I began to suspect something was up when changes that I’d put in Friday suddenly weren’t there when production ran Monday. Queue the over-the-top response as he tried to humiliate me. I didn’t know how he did it, but I knew somehow he was responsible. I searched, but couldn’t figure out how he did it. So I started backing up all my changes and then get in before production started on Monday to make sure the changes were there. Nearly every time, I would find the original code instead of the changes.\n\nThis went on for nearly 2 years until he moved to HQ (I was in Philly) and then our data branch was sold to Fiserv. We still had to work together. Meaning I had to fix all his issues because he never bothered to understand the language and the changes that were coming for an upgrade. Then comes the full upgrade for the bank. He gets selected to do the upgrade along with a contractor who knew nothing about the business and I wasn’t allowed to address anything. I laughed really hard when they told me this in the meeting and got calls from others who attended wanting to know how bad this would be. The boss had gotten our group because he was someone’s friend (knew NOTHING about technology) and treated the guy like the golden boy. Birds of a feather.\n\nI maliciously complied and did not assist at all, while keeping my coworkers in finance apprised of the problems so they could push back. Two failed attempts later, they finally put it into production. Nothing worked right for months.\n\nDuring this time, I find out, quite by accident, how he was using one application to restore MY data to its previous existence after copying my changes. I called my cohort who was now her junior and find out that she’s been having her changes disappear, too, including just that morning. Her husband happened to be a systems programmer as well, so I called him and asked if he could close that hole where a log entry wasn’t made, because normally people would only restore their own data. Once he said it was done and what to look for, I called the guy and told him I knew what he did and how he did it, and the next time he did it, he’d be caught.\n\nBecause he didn’t learn the stuff, his performance dropped and 2 months later I get a frantic call from my friend that everything is failing and he’s in the hospital bleeding from his penis. I got permission to take over, fixed 99% of the problems in a couple hours (I’d kept track just in case), and later get a call from the VP thanking me for fixing it and what did I think caused the problem. I told him. The next month the manager announced his leaving, and the other guy left shortly after that.\n\nThose two months were quite satisfying to watch",
        "created_utc": 1676919255,
        "upvote_ratio": 1.0
    },
    {
        "title": "Former employee turns me in for fraud, enlists his father/lawyer to push it.",
        "author": "fiya79",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/117gwa2/former_employee_turns_me_in_for_fraud_enlists_his/",
        "text": "I was a public employee for many years. I had a middle management role for about 20 years. I reported to a department head, who reported to the mayor. I had a small staff, typically 5-10 people who were mostly part time. They rotated every few years and I tried my best to make their time with me valuable. I helped them pad out their resumes, paid for trainings and more.  Tim was initially a decent employee but quickly decided he was the greatest employee of all time. His over confidence often led to mistakes or being over extended and he needed bailed out.  He was good at basic tasks but had a hard time with math, grammar and interacting with adults. \n\nPart of my job was seeking federal grants for small infrastructure projects. Think adding ADA benches to nature trails and curb cuts on old sidewalks or bridges on walking paths across ditches. I would write the grants and specs. The small staff would help administer the grant. Sometimes they would do the work. Sometimes they would oversee contractors. \n\nThe grants were extremely clear and included a matching component. Sometimes we would add cash or equipment time or staff time. Sometimes we would have volunteer organizations match with labor. \n\nWe were doing a bridge grant and I put the  employee Tim in charge. It was phase 3 of 3 and we had a lot of experience. There were 21 bridges we were replacing in batches of 7. Tim just had to keep the process going with volunteer match labor hours.  The process was practically automatic. All he had to do was show up with materials and stay out of the way. \n\nHe did an adequate job, barely. I had to keep him on track to stay in spec.  We are spending money to improve water quality. He wanted to improve recreation.  We sent a lot of emails and texts about it. The department also used project codes to track grant spending. Each grant had a code and it was very easy to code all the time and materials though the accounting department. The volunteers signed logs each day and the process was pretty tidy. \n\nThat fall Tim continued to struggle with basic tasks and eventually demanded a promotion for his outstanding work. He did not meet the very clear requirements for a promotion (government requirements) through his own laziness despite being given opportunities to become qualified. \n\nEventually he became intentionally negligent and put himself and others in danger. I call him into the office after an egregious incident and offered him the opportunity to resign or be fired. Resigning means he could be eligible for rehire in a different department. Fired means he is blacklisted from the city. He refused to resign and so I terminated him. He seemed shocked. I think he thought it was a bluff or scare tactic. He thought he was a critical cog in the machine. But he was a thorn in my side. \n\nHis dad is a well known local attorney. I had pulled Tim’s state criminal record and on close inspection it was clear daddy was bailing him out throughout life. \nAssault charges dropped\nDUI pled to a traffic violation\nPossession pled to an infraction\n\nTim decided to come after me. His first move was to call the federal division that oversees my grants and report fraud. They launched an investigation. My records were 1000% immaculate. They called him into a meeting and his proof of fraud was that he felt that the bridges should have been a lower priority and the money would be better spent elsewhere so the fraud was misuse of funds.  But the grant specs were followed precisely- by him. He had tried to divert funds and I had stopped him. I had written evidence. \n\nThe project he had accused on was the literal poster child for success and was included in a slideshow to the legislature on the success of the grant program. \n\nThe feds and city powers were livid for wasting time. I had reams of perfect documentation. He was yelled out of the building. \n\nThen he filed a wrongful termination suit. He told his dad about the apparent mistreatment and his dad filed. I contacted the city attorney and dumped hundreds of pages of documentation, with a summary, in his email. \n\nI was in city hall when daddy attorney came slinking out of the legal department apologizing for his idiot son. \n\nI heard from a mutual friend daddy gave Tim a thorough reaming and withdrew the financial support that had allowed him to live on part time work. \n\nHe is doing better today but right around that time his wife discovered his ongoing affair, the mistress got pregnant and things got rough.",
        "created_utc": 1676918639,
        "upvote_ratio": 1.0
    },
    {
        "title": "VYC MOVIE - Hindi movie | Facebook | By VYC MOVIE | #sports #sportscar #sportswear #sports #sportsnews #sportsphotography #movie #movies #movies #movietime #movienight #moviereview #anime #animeedit...",
        "author": "surydav",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/117eai1/vyc_movie_hindi_movie_facebook_by_vyc_movie/",
        "text": "",
        "created_utc": 1676913192,
        "upvote_ratio": 1.0
    },
    {
        "title": "VYC MOVIE - Hindi movie | Facebook | By VYC MOVIE | #sports #sportscar #sportswear #sports #sportsnews #sportsphotography #movie #movies #movies #movietime #movienight #moviereview #anime #animeedit...",
        "author": "surydav",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/117e926/vyc_movie_hindi_movie_facebook_by_vyc_movie/",
        "text": "",
        "created_utc": 1676913123,
        "upvote_ratio": 1.0
    },
    {
        "title": "Petty at Work",
        "author": "MeggaGem",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/11795zr/petty_at_work/",
        "text": "[removed]",
        "created_utc": 1676906033,
        "upvote_ratio": 1.0
    },
    {
        "title": "Need petty revenge suggestions",
        "author": "PhattiesRus",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/1178w0p/need_petty_revenge_suggestions/",
        "text": "Long story short I dated this girl for a little over two years and it turns out that she was hooking up with my (ex) best friend of over four years at that point during our whole relationship. I moved to a completely different city for this girl just to have my entire existence shit on. Still wake up and go to sleep thinking about it everyday. This happened a year and a half ago so it’s been simmering. Nothing illegal but definitely something petty enough as I still have an email and phone number.",
        "created_utc": 1676905638,
        "upvote_ratio": 1.0
    },
    {
        "title": "Nueva comunidad",
        "author": "Lailalove2002",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/1173gs6/nueva_comunidad/",
        "text": "[removed]",
        "created_utc": 1676889217,
        "upvote_ratio": 1.0
    },
    {
        "title": "I always get the last laugh when it comes to food.",
        "author": "Forsaken_Struggle_13",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/1173efi/i_always_get_the_last_laugh_when_it_comes_to_food/",
        "text": "[removed]",
        "created_utc": 1676888973,
        "upvote_ratio": 1.0
    },
    {
        "title": "Oppsie... Did i say that?",
        "author": "DearBanana2532",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/116ydsz/oppsie_did_i_say_that/",
        "text": "This is yet another story about my crazy neighbor i had last year! If you haven't read my other stories, please do. I have many more to come, though some will be in other subs, i am trying to fit stories where they go as i remember them here and there. Honestly so many things happened i forget about it (or blanked it out) until reminded. I will admit this was totally accidental, at first. \n\n&amp;#x200B;\n\nBackground: This happened right before she was moved. Looking back, probably was one of the reasons she was forced to move. If you remember my last post and how it said she read out her lease violation letter out loud in front of my cameras? Well, this was one of the reasons. Neighbor lived above us in a duplex for like 8-9+ months at this point. We knew she had a cat, as did everyone who lived on the street. It liked to sit in the windows so we figured LL knew. We had 2 dogs and paid extra for having pets. \n\n&amp;#x200B;\n\nWell one day, after we stopped living there (still rented but couldn't sleep there anymore, worked out of town as much as possible) , and had been withholding rent (legally) for at least a month. She's (once again) walking in circles around the house setting off our cameras. However this time she's fucking screaming her head off and her baby is trying to follow her, and failing. It was like 10PM and she's outside screaming \"LUNNNAAA FUCKKKKK LUNA YOU FUCKER LIKE FUCKKKKKKKKKKKKKK\" primal scream shit. We were out of town and had bad service so saw it the next day. We figured out why she was freaking out and just said fuck it. No use in complaining. We already had to complain about trash weekly so this was ignorable. The cops also showed up to our house for her at all house, all the time. We only called like 3 times, i have NO IDEA who was calling on her so often but not us. \n\n&amp;#x200B;\n\nIt wasn't until she had an illegal fire (again) did the manager call us and we mention the above incident, off hand. Trying to explain about the fires/police showing up we had on camera... we said was \"oh yea, well that (police showing up the week before) was likely just her looking for her cat since it got out. OHHH then it was \"CAT?!?! WHAT CAT?!?!\" and we were SHOCKED first off. We were like?? uh yea?? the cat she's had since she like moved in? it sits in the windows all the time?? She nor LL had ever seen it. We can only assume she hid it when they came to her apartment. Which BTW in 5 years of renting from them i only had to call them 2x to fix things for me 1st when our water heater went out and 2nd when the pipe that went to our washer leaked... She on the other hand called for them to \\*replace the batteries in her smoke detector\\* even though its right in our leases it's on us. She also broke one window her unit and one in ours, plus her fridge, that we know of. \n\n&amp;#x200B;\n\nThen, again as i mentioned in my other post, the lease violation letter came. She violated for having a cat and illegal fires!!! I assume she had to pay the pet fee back to them. I don't know. \n\n&amp;#x200B;\n\nWhat i DO know was she got forced to move to a even smaller apartment, with no yard (as it was in a apartment building in the downtown area), and no driveway of her own (turns out she has a medical condition and shouldn't be driving anyways BUT WAS when she first moved in above us?!?!?) AND paid at least $100 more for that apartment... Then she was evicted no more than 3 months later from her new apartment. For nonpayment, the 2nd time that year! She had also been harassing and threatening her new neighbors as well. \n\n&amp;#x200B;\n\nI pray for whoever her next neighbor is!",
        "created_utc": 1676869853,
        "upvote_ratio": 1.0
    },
    {
        "title": "Want pictures of my notes? Have fun trying to read them.",
        "author": "_Dr_Dinosaur_",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/116y51n/want_pictures_of_my_notes_have_fun_trying_to_read/",
        "text": "So this story just happened last week and I realized it may be a good fit for this sub. So I go to a small liberal arts college, and one day last week we had a skills test in my analytical chemistry lab, meaning that we had to perform a laboratory procedure in an allotted amount of time that we had done previously, except this time graded on the results' accuracy for a good amount of points in the class. Needless to say, this is a very stressful thing to do, as it requires making very precise measurements, and for this specific lab, counting individual drops one-by-one that could go into the 90s, over and over again. This is all to say that this particular day in lab required a lot a focus and counting, and mostly everyone was quiet and diligently yet stressfully going through the procedure. *Mostly everyone.* This is where the revenge victim comes in. Let's call her Hannah. Hannah is part of a group of three girls that are always incredibly inconsiderately loud in lab. This day in lab, the usual loudest one was working comparatively quietly like the rest of us, while Hannah and the third friend remained loud, with Hannah very much in first place for volume. Not only was Hannah very rudely loud, but the substance of her loudness were topics that were very much inappropriate for a small lab with a professor nearby (ex. talking about going shopping for thongs with someone across the room). Hannah also tried to get friend #3 to play music, which thankfully was shut down by the instructor. The result of all of this was an extremely frustrating lab experience for basically everyone who isn't part of the loud trio, as we all tried to count dozens of individual drops with an absurd level of inconsiderate background noise during a lab that is supposed to be quiet for everyone's ability to focus. \n\nThe following day, I had a psychology class that Hannah is also in, and she sits in a position where I am able to see her laptop screen. I noticed that during the entire class she didn't pay attention whatsoever, switching between being on her phone and working on another assignment for a different class. Class that day was particularly more note-heavy than usual. After class, Hannah came up to me and asked if I could send her pictures of my notes from that day, as she said she had another assignment she had forgotten about and had to do during class instead. I told her I would because I couldn't think of any good reason to tell her why I wouldn't, but I was still heavily irritated from my frustration the day before and therefore saw this as my chance for petty revenge. She could have pictures of my notes, but she was going to have to put in effort. Immediately after, while trying to figure out ways to make my notes harder to read (more than my already hard to read handwriting), I realized that I could take pictures of my notebook with the 0.5x magnification on my camera, and then crop the photo down to make it look normal again, but with far blurrier words. Eventually I found the perfect distance for the camera in which the words weren't impossible to read, but were certainly not easy by any measure; just enough that she would have to zoom in on almost every individual word to figure out what was written. Afterwards I sent her the pictures of my six pages of notes, apologized for my hard-to-read handwriting, and satisfyingly hoped that she would have just as hard of a time with them as I had listening to her in lab the day before.",
        "created_utc": 1676869044,
        "upvote_ratio": 1.0
    },
    {
        "title": "And the Moon was high in the sky…",
        "author": "purrfunctory",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/116xupq/and_the_moon_was_high_in_the_sky/",
        "text": "A recent post asking for advice on annoyance reminded me of what I did to an ex. \n\nThe guy was a real jerk and I’d absolutely had it with him. He worked in Manhattan and commuted in from Long Island, a 90 minute train ride followed by a subway ride and a few blocks of walking. So going home wasn’t really an option if something happened to his clothes. \n\nAnyway, we’d had a fight the day before and he called me some pretty foul names because I had corrected him and proven him wrong about some “fact” he swore was true. He was a petty fucker and I have no idea why I stayed with him as long as I did. \n\nAnyway, he *hated* being embarrassed and one night when he was drunk he told me how during school when he was a teen the seat of his pants gave out and ripped during class. His parents both worked in the city and commuting home to get him from school or bring him a change of clothes wasn’t an option. He ended up having to wear a pair of basketball shorts from the Lost &amp; Found over his ripped jeans all day. The teasing lasted until he graduated a few years later. \n\nAnyway, he’d called me a “sanctimonious c*nt” for politely saying, “Josh, you’ve got your dates mixed up. The Civil War started in 1861, not 1859.” He was verbally abusive over *his* mistake and said I embarrassed him. We were playing a trivia game with 2 friends of his in teams and I wanted the point for getting it right. Losing team paid for pizza and beer and his two friends could eat a whole pie each and put away a six pack on top of it. \n\nI’d had enough of his bullshit. His friend brought up the high school incident and I realized I had the perfect revenge. \n\nHe wore his blue slacks more often than the others so wear and tear was expected, they were several years old and I had to help him fix a hem that let down a few months earlier. Something going wrong with them wouldn’t be suspicious at all. \n\nSo I took a seam ripper and carefully undid every third stitch, just enough damage that they’d eventually fail but not so much damage they’d fail the first time he sat down. \n\nThe next day, he pulled them on and went to work like normal. Around lunchtime, I get a panicked phone call because the entire seat of his pants had torn out, exposing his skid mark stained tightly whiteys to everyone in the conference room during a meeting. He had nothing else to wear and obviously couldn’t leave the building to go shopping like that. The whole seam had just given way. \n\nFuck, it took every ounce of control I had to sound sorry and bewildered. I must’ve asked a half dozen times how that could just happen. He said they must have been older than he remembered and begged me to bring him new slacks. \n\nSadly, I was at work and unable to leave and help. Welp. \n\nSo imagine a grown ass man walking around with a suit jacket tied around his waist all day to hide his underwear. He resigned soon after because of the humiliation. \n\nI dumped him about a week later. \n\nIt was glorious. He was utterly humiliated while giving a presentation. I had no idea he had a presentation that day, I just figured they’d bust in the break room or when he sat down at some point during the day. \n\nMessing with seams is a great way to get petty revenge on someone. They’ll have no idea it was you and think it’s just a wardrobe malfunction.",
        "created_utc": 1676868102,
        "upvote_ratio": 1.0
    },
    {
        "title": "Reported my brothers phone as lost because he refused to give me some of my dad’s ashes.",
        "author": "racers_raspy",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/116ws0g/reported_my_brothers_phone_as_lost_because_he/",
        "text": "[removed]",
        "created_utc": 1676864532,
        "upvote_ratio": 1.0
    },
    {
        "title": "Thank Ypu for being a Friend",
        "author": "Intelligent_Owl_0403",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/116w8rk/thank_ypu_for_being_a_friend/",
        "text": "[removed]",
        "created_utc": 1676862823,
        "upvote_ratio": 1.0
    },
    {
        "title": "tell me your story to share it in my podcast (anonymously)",
        "author": "Intelligent_Field_99",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/116vzta/tell_me_your_story_to_share_it_in_my_podcast/",
        "text": "",
        "created_utc": 1676862055,
        "upvote_ratio": 1.0
    },
    {
        "title": "Revenge, home alone style",
        "author": "gollumsixx",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/116stwd/revenge_home_alone_style/",
        "text": "Hi everyone, I’m new on this sub and thought I should tell you my story nearly one year after it happened.\nSo last year I was a receptionnist in an hotel for 2 years and a half, back then it felt not horrible but just annoying, but afterwards I realize that a lot of things that  my bosses made me deal with were not right but I’m not here to talk about that…\nTo set the story, the hotel was run by a couple both are truly racist, homophobic, fatphobic and to add for the wife she was bipolar ( confirmed by his husband) and he the husband was misogynist.\n\nI was the only male at the time ( exept for the two night receptionnist) and the boss wanted only me to do every maintenance from changing a light bulb to completely set up a bathtub since I’m a man and only men do that. This situation was ok for my female coworkers cause it was less work for them and even if they wanted to do these they could not cause I was the only one he gave the password to the maintenance room and he will show only to me things I did not knew at the time (like set up a bathtub). \nI was upset by this situation cause he was acting alone with me like a father teaching a children how to do those things, but in public with coworkers and customers he called me a donkey and was very bad with me.\nSo it ended with me wanting to quit my job because I was tired of going to work with à ball in the stomac knowing you’ll be treated like shit, have to deal with douche customers and and jerk bosses, and to add knowing you have to change 8 lightbulb, repair two housekeeping vacuums, unclog two toilets etc…\nSo when I finally found an other job and made my one month prior notice before going out, so on my last week I made up a Kevin Mcallister like plan to sabotage the whole building…\n\nI ended up : \n•unscrewing to the edge some of the frames and fire extinguishers in the corridors so they’ll fall within few days / weeks.\n•Carefully took some boxes piled up in different rooms and cutted the tape on the bottom of the boxes and piled them again so when they’ll take them everything in it falls.\n•Changed the passwords on some some websites they needed to login often like (booking, expedia and other hotel related websites).\n•Poured some powdered fish broth in the toillet water tank so I smells horribly.\n•The boss let a few jars of arranged rhum aging in the cellar, wich in I added tabasco, vinegar or beef broth.\n•Inverted some keys in the 80 keys chest.\n•And slightly cutted the electric wires in some vacuums so he’ll have to disassemble them like he made me do.\n\nI left this place with a great taste of vengeance in mouth.\nSorry for my writing English is not my mother tongue thanks for reading if youre reading this far, hope you enjoyed.",
        "created_utc": 1676852949,
        "upvote_ratio": 1.0
    },
    {
        "title": "Tied up ex-boss in HR meetings as my accidental farewell gift",
        "author": "ofthefallz",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/116rmzx/tied_up_exboss_in_hr_meetings_as_my_accidental/",
        "text": "Reddit\n\nIf there was a thread called “satisfying comeuppance” I would’ve put this story there, but I’m new to Reddit and this seems to be the best spot for this here tale based on what I’ve found.\n\nThe TL;DR is that I wrote a detailed letter to my boss’s boss about workplace issues and found out later that this letter had instigated a multi-meeting series of discussions that mysteriously followed the exact format of my letter, thus tying up my boss in a ton of accountability meetings that I know she would’ve hated. \n\nSkip to “the meat of the issue” if you don’t feel like reading about the circumstances leading up to the main problems.\n\nBACKGROUND:\n\nI started working at a certain establishment the second I was old enough to legally work. (We shall call it The Place so that I have a proper noun to work with here.) The Place was super convenient to get to after school and I already knew my boss, who had a very high opinion of me at the time. So overall a cushy after school and summer job, even though I’d finish every summer at The Place wanting to ram my head through a window. I would complain to my friends about feeling so wigged out and tired at the end of each season, but I figured I was just a lazy teen that was learning about work ethic.\n\nFast forward a few years and I’ve graduated from college. I’ve been working at The Place every summer until the pandemic, and I’ve just gotten married (and my boss attended my wedding too!). While my spouse finishes the last semester of his degree, I realize I need to somehow find a job during the 2nd wave of the pandemic to support us. The Place has recently reopened in the past few months, so back I go! At that point the job market was still absolutely ravaged by COVID restrictions, so I was grateful for the chance to work anywhere at all.\n\nI worked that season with some friends, who saw the work environment with fresh eyes and informed me that I was not, in fact, lazy and lacking workplace stamina. Instead, I was suffering under inflexible management, the inefficiency of having multiple bosses, and a persisting hostile work environment. Huh. Eye-opener. Having my concerns validated and not gaslighted for the first time really helped me start to look over the systems at The Place with a critical eye. \n\nTHE MEAT OF THE ISSUE:\n\nI had started out part time but was offered a full time position that opened up a few months after my return. I would work more hours, have more responsibilities, an additional boss to report to (ontop of the pre-existing 3), and I’d split my time between two departments. The catch? A $2 pay cut. I offered to waive my rights to insurance or waive ANYTHING in exchange for my same hourly wage, but my suggestions were turned down. I didn’t have a choice. Working full time, it would still be a larger chunk of money each month despite the pay cut and we needed the money. I took the “promotion” and vowed to myself that I would work the duration of my contract and never return.\n\nIn my last days there, my main boss whom I loved and had known for the majority of my years on this planet, called me up. She said she knew I was leaving soon but she was sending everyone an extra $300 in their paychecks as part of a grant The Place had received. I said thank you and she asked if I would consider staying. They had some major staffing shortages and The Place would need to close if they couldn’t find new hires. Just to test the waters, I asked:\n\n“Well, would I still have that pay cut?”\n\n“Oh. Ummmm, I guess I could look into that for you.”\n\nYep, fat chance. I politely told her I wouldn’t be returning.\n\nAt this point I felt hugely disrespected, taken advantage of, and unappreciated. I had been at this place on and off for almost a decade. I had accrued an insane amount of experience of The Place’s systems and policies in exchange for pay raises that only ever reflected new minimum wage laws as they came around every few years. I had been given a pay cut at the earliest opportunity, and my mental health had taken a huge blow every season due to workplace cliques, clashing bosses jerking the staff around, and spotty staff support. It’s not hard to imagine why they were having a hard time finding and keeping employees.\n\nSo I wrote a letter. I wrote a 4-page letter with headings and subheadings that very clearly laid out everything wrong with what I had experienced during my many years at The Place, in the hopes that it would help them understand their persistent staffing shortages. I made sure it was professional and honest and I had friends and family proof read it to make sure it wasn’t lined with any latent vitriol. Despite everything, I still loved my Main Boss and what she was trying to accomplish there and I truly just wanted to help, even as I was on my way out. I made 3 copies of the letter and left one on Main Boss’s desk, one on HR’s desk, and one on MB’s boss’s desk. \n\nFast forward to a coffee date with an old friend who still works at The Place. MB never let anyone see her copy of the letter, and told others that it was nothing but a big smear letter against the department (definitely not true). Despite the attempted coverup, MB’s boss “somehow got a copy of the letter”. MB and her co-bosses are now tied up in a multi-meeting series of talks about several persistent issues in the workplace. Strangely enough, almost every meeting aligns with a section of my letter. Hmmm…\n\nKnowing how much MB hates change and meetings, I can’t help but get some smug satisfaction from all of this. Plus, kudos to upper management for actually listening. After so many years of working at The Place, I would certainly hope my honest insight means something more than an attempted coverup.",
        "created_utc": 1676849858,
        "upvote_ratio": 1.0
    },
    {
        "title": "Layla the cheating whore 12173412975 is her number @laylar7546 is her snap",
        "author": "RabbitEvery181",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/116qo46/layla_the_cheating_whore_12173412975_is_her/",
        "text": "",
        "created_utc": 1676847492,
        "upvote_ratio": 1.0
    },
    {
        "title": "I don't give her the time of day",
        "author": "One-Champion-344",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/116p5c5/i_dont_give_her_the_time_of_day/",
        "text": "So I don't know if this counts. I'm not  usually cold like  this. This got me acting different also. 4 of my friends told me to post this story, so for context, I met a blonde girl in Class I was 17, turning 18, and she was eighteen me and my freind were doing a class project and ended up meeting her lets call her Livia I started talking to her being friendly and nice my mate was trying to get me her number for me so he decided to tell a horrible joke for laughs basically he said \"U know he's killed 5 elephants with his bare hands\" her response was \"really\" we were both confused cause she somehow thought he was telling the truth I found out later I knew her ex and he was my freind. skip to new college year first day me and the same freind see her she comes up to us while we  eating and brings up that she sells bikini picks all of a sudden, skip to 4 hours later she slaps my friend  a different freind for hanging out wither ex my plan was to avoid Livia but then she end up in my class for the rest of the year cause of that incident there were a lot of witnesses I ducked out 5 minutes before it happened I actually when to go see the girl she let's call her Sophie I knew something was up but her freinds were walking her home so I decided to leave it be and found out the next day of the incident and that there was group chat about this I wasn't in it didn't wanna get involved. Oh yeah, I was warned that day she has a thing for black men, which I am. Sophie told me the whole story a week after she had to duck out of college for a week cause of the incident. May I add the only reason that girls in my class is because she knew my name\n\nThis was recent she comes in college and goes to me take your shirt off I want to wear it cause I didn't bring mine my response \"why In the seven hells would I ever give you my shirt which I bought, ask a girl I ain't a buy one get one free\" she literally storms out and get a shirt and me an my mate are both like if u knew were to get one why didn't u get it from the start. Now here's where I'm seriously cold she stares at me the next day for about 20 mins. I tell her to put her head down and start working cause me and my freind are in deep conversation and doing work , she comes up to me and goes \"Can u not be a dick today my freind just died\" It didn't sink in what she  said all of sudden I go \"Enjoy\" I didn't realise till my freind reapeated that I said back to me cause I was basically ignoring her talk to me.my friends know how she is cause she's touchy with me and flirtatious even though I show zero interest and they actually warned me to be careful they know im not cold like that unless for a reason.",
        "created_utc": 1676843782,
        "upvote_ratio": 1.0
    },
    {
        "title": "Seeing Dollars That You Cannot Tuch (Rastafairan) by Zzlastnumber",
        "author": "ikepman",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/116omj2/seeing_dollars_that_you_cannot_tuch_rastafairan/",
        "text": "",
        "created_utc": 1676842441,
        "upvote_ratio": 1.0
    },
    {
        "title": "Found out he cheated on me, imidiate revenge.",
        "author": "Soytumadre86",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/116nrtt/found_out_he_cheated_on_me_imidiate_revenge/",
        "text": "",
        "created_utc": 1676840304,
        "upvote_ratio": 1.0
    },
    {
        "title": "Distributing flyers a little too freely",
        "author": "AnalogDigit2",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/116njg5/distributing_flyers_a_little_too_freely/",
        "text": "So a few years ago I was driving around some suburban American area with only one lane going each direction.  I started noticing these weird colorful papers\\brochures\\flyers littering the road in my lane (I should mention it was a little trafficky and while we were moving at a decent pace between stop lights\\stop signs there were a few cars bunched up together.)  The papers were making a terrible mess and there were probably at least a couple hundred or so of them scattered about in a continuous stream as I continued to drive.\n\nSo the car directly in front of me turns at an intersection and I suddenly realize that the car that I an NOW directly behind is the one that is \"leaking\" flyers.  It's like a hatchback and the trunk is ajar by a decent margin and these things had been stacked in the trunk and are now spilling out everywhere (and there are plenty more yet to come.)  I try to honk and get their attention as we are now in a straightaway with no stops soon.  I get not even a head turn to the mirror or anything.  \n\nSo I'm fuming and thinking that there's this big mess that no one is going to be able to clean up.  And I think, \"Where's a cop when you need one!\"  Then I glance in my rearview mirror and (like some kind of miracle) I realize that I am being followed by one.\n\nI realize that he has certainly been noticing the copious litter as well, but does not know its origin because my car is in the way.  Just then we pass a turn on for an old-folks home or something where there was a short lane dedicated to that.  Without even thinking (or putting on my blinker) I jerk my car into that so that now there is nothing between the problem and the solution.  \n\nThe cop car slowed way down for a moment (probably considering giving me a ticket for changing lanes without a blinker) before looking ahead and seeing the flyers spilling from their source.  Lights go on and they pull the flyer car over.  \n\nI had to continue on my way to make an appointment, but I like to think that the car owner was forced to go back and pick up as many of the flyers as they could find or face a hefty littering fine.",
        "created_utc": 1676839715,
        "upvote_ratio": 1.0
    },
    {
        "title": "Don’t know whether to laugh or cry",
        "author": "Daisieswhoopsies",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/116ni4i/dont_know_whether_to_laugh_or_cry/",
        "text": "[removed]",
        "created_utc": 1676839619,
        "upvote_ratio": 1.0
    },
    {
        "title": "Ho ragione?",
        "author": "MILANISTA_SGRAVATO",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/116kkue/ho_ragione/",
        "text": "[removed]",
        "created_utc": 1676832420,
        "upvote_ratio": 1.0
    },
    {
        "title": "I need help with this petty revenge.",
        "author": "FenriDeWolf",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/116k3cp/i_need_help_with_this_petty_revenge/",
        "text": "In 7th grade there was this girl who would constantly pick on me because I had a tumor on the side of my face. One day I got fed up with it I went up to her and recorded the conversation she admitted to only bullying me for having cancer (dont worry it's not aggressive). I didnt post it for a while I was waiting for the right moment to post it (I'm legally allowed to in my state) but she moved away before I could. Now here is where I need your help I need you to make this video popular so that I can ruin her life here is the link. I will update more on how she ruined my life when I have the time. Her name is meleah hardeman (I may have spelt it wrong)\n\nhttps://www.instagram.com/reel/Co1XK4cjJ1Q/?utm_source=ig_web_copy_link",
        "created_utc": 1676831250,
        "upvote_ratio": 1.0
    },
    {
        "title": "Arcade token wench",
        "author": "LemonComprehensive5",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/116j3o8/arcade_token_wench/",
        "text": "[removed]",
        "created_utc": 1676828852,
        "upvote_ratio": 1.0
    },
    {
        "title": "Am I wrong???",
        "author": "Independent_Help8789",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/116imya/am_i_wrong/",
        "text": "[removed]",
        "created_utc": 1676827733,
        "upvote_ratio": 1.0
    },
    {
        "title": "Gonna be a jerk? Enjoy getting transferred and losing a shipment.",
        "author": "Mab494",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/116gqmp/gonna_be_a_jerk_enjoy_getting_transferred_and/",
        "text": "This happened while I was working at a grain elevator over the summer. We were wrapping up the wheat harvest and loading up shipping trucks to outbound our wheat to other facilities. \n\nWorking at this location was me and my boss. I would load trucks and he would weigh them and sign off their shipping ticket. One of the days we were outbounding, a driver came through in the morning who did not have a working weight gauge in his truck, basically the little dial that told him when he had the right amount of wheat in his trailer. For context, the weight must be 80,000 pounds for interstate shipping, and 85,500 pounds for highway shipping, or what we call 85-5. This truck needed the 85-5, and since he had no gauge I had to eyeball it. I got close, 82,500, but he threw a fit that he was under weight, and told my boss how bad I was at my job. \n\nHe came back around noon, and said he fixed the gauge and would tell me when to stop loading his truck by honking the horn. I agreed, filled his truck until he honked. Went and weighed in way under, around 78k. He complained again to my boss, saying I should be let go, although my boss backed me up since he heard the horn and knew he told me to stop filling his truck. He came back and we filled his truck up to 83k. More complaining, but he left eventually. \n\nHe came back one last time that afternoon. He again told me to wait for the horn. I obliged, filling his truck to his desired amount. The thing was though is that I knew he's be over the weight limit, as you can see how much you filled the trailer on the previous load from the dust marks on the sides of the trailer. He weighed in, 88k. He complained to my boss again, which got him nowhere. Since he was over, my boss would not sign his ticket, and he could not leave until he dumped. The thing was is that I was loading other trucks, and so he had to wait about half an hour before I even got to him. \n\nI unloaded his truck until he said I needed to stop, and then went back and weighed. 500 pounds over. He threw a big fit, but my boss shut him down saying he was just following the law, and that it would be him that got in trouble and not the driver should something happen. The driver claimed he had never been in a wreck before and that my boss was overly cautious, even though we had already had four really bad grain truck accidents this season already. He eventually stopped complaining and came back out to weigh, and had given up, letting me decide when to stop.\n\nI decided to get a little revenge for how much trouble he had been causing, and how delayed he had made us,while simultaneously trying to get me fired from my job. I uloaded his truck around 450 of the needed 500 pounds, and told him to go weigh. My boss radioed back, he was 40 pounds over. Cue more complaining from the driver, and he refuses to get off of our scale or to go through the unloading pit again. My boss offers to have one of us grab a 40 lbs capacity bucket and climb up the trailer, fill the bucket, and send him on his way. He refuses, and angrily dumps the wheat on our scale, gets my boss to sign the ticket, and leaves. The only downside was I had to shovel the 40 lbs off the scale. He was at our facility for about 2 hours, which was enough time for him to go to the plant and pick up another shipment before closing time. It's important to know that these truckers are paid more by the amounts they bring in, not by the hour as much. \n\nThe next morning my boss tells me while I'm opening he called the regional boss, and that driver was severely criticized for trying to break the law, get me fired, and dumping wheat on the scale. He was transferred to a elevator another 30 minutes away from his plant, meaning he'd have to drive more and likely loose a shipment a day versus if he had been picking up wheat from our elevator. The elevator he got sent to also happened to be the main county elevator, so he would likely get fined if he acted like that there. \n\nTLDR: a trucker was being a jerk and tried to get me fired, I purposely overfill his truck, which causes him to throw a tantrum and get transferred away.",
        "created_utc": 1676823608,
        "upvote_ratio": 1.0
    },
    {
        "title": "Someone suggested I post this story from my wedding here, featuring my husband's ex",
        "author": "internetdramalobster",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/116au4m/someone_suggested_i_post_this_story_from_my/",
        "text": "Important info - we decided to have a micro wedding, with just our immediate family there, around 10 people. We got married at a venue that is known for holding very large events, but we hired a smaller room there. \n\nMy husband has a child with his ex, so sees her quite often for things related to my step kid. We were always planning on inviting her to the wedding to see their kid all dressed up and to generally keep a good coparenting relationship. Before we had invited her, she informed DH that she'd be there, and asked when and where it was. He was a little taken aback but as we were planning on inviting her anyway he just told her.\n\nOn the day, she showed up to our morning ceremony wearing the shortest dress I've ever seen, over stockings and suspenders (the suspenders could be seen for a good 6 inches before the bottom of the dress), skyscraper heels, nightclub makeup, and costume jewellery. My father actually pulled me aside to ask \"who hired a stripper?!\".\n\nI found out afterwards from mutual friends that she had texted all of them asking when they were getting there - because she had invited herself we hadn't thought to let her know it was such a small ceremony - and when they let her know it was family only and the reception was completely separate she began to panic a little.\n\nAnd I had the best petty revenge. I asked everyone to be EXTRA nice to her. Every time she tried to sneak away someone would engage her in conversation. She was extremely uncomfortable, and ended up sitting down with her coat covering her. The wedding went off without a hitch.\n\nI'm not sure what she expected to happen, but it all worked out fine in the end 🤷🏻‍♀️",
        "created_utc": 1676814910,
        "upvote_ratio": 1.0
    },
    {
        "title": "reverse phone lookup",
        "author": "Optimal_Commission98",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/1167cji/reverse_phone_lookup/",
        "text": "[removed]",
        "created_utc": 1676802753,
        "upvote_ratio": 1.0
    },
    {
        "title": "I went Grumpy Old Men on him",
        "author": "SingSilentPoetry",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/1166hof/i_went_grumpy_old_men_on_him/",
        "text": "When my ex and I divorced I was shocked to learn about all the secret property and finances he’d been hiding throughout our relationship, including a sedan that I’d been driving that he told me was his mother’s. \n\nMy ex got the sedan back in the divorce, but before I returned it I went Grumpy Old Men on that car. \n\nI hid a dozen condoms in wrappers around the vehicle, including one condom inside the passenger-side seat belt.  (Here: I’ve seen you go through hundreds of condoms during our marriage, although none of them with me, your wife.  I thought you could use a few more, now that you’re officially single again). \n\nI glued a note to the passenger makeup mirror that said “thank you for cheating on me and hiding it so poorly - if not for that I would’ve wasted my whole life being faithful you”.   (Enjoy your first single date, babe; you’ll know from the look on her face when she’s finally checked her lipstick in that mirror). \n\nAnd as a crowning gesture I hid an old potato in the sedan in a place where I knew he’d never find it.  Nothing! stinks worse than a rotting potato, and that smell takes a year or more to go away.  I handed the keys over to my ex with a smile on a warm sunny day: “Enjoy that sedan!” \n\nI watched him drive away, knowing that old potato would start stinking in a week in its hiding place.  It wasn’t a fish like in Grumpy Old Men, but it had the desired effect. \n\nHe got me too though.  I got the coupe in the divorce, and my ex drained all its engine fluids before giving me the keys.  I guess he was hoping the engine would overheat and seize on the highway and cause an accident - but I was ready for him.  \n\nI figured he’d do something like that, after being married to him, and I topped off all missing the fluids and promptly sold that vehicle after having it checked out by a mechanic for further sabotage.",
        "created_utc": 1676799691,
        "upvote_ratio": 1.0
    },
    {
        "title": "DTF!!I'm available for meet up and contents hmu I serve you to my best of satisfaction..",
        "author": "aliciahuerta",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/1163h33/dtfim_available_for_meet_up_and_contents_hmu_i/",
        "text": "",
        "created_utc": 1676787856,
        "upvote_ratio": 1.0
    },
    {
        "title": "It’s the little things that make it so worthwhile",
        "author": "Purple_Station7030",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/116286c/its_the_little_things_that_make_it_so_worthwhile/",
        "text": "So, my exhusband treated me horribly for the last 11 years we were married. Started with him telling me he wasn’t sure he loved me anymore while I threw up everyday all day,  made it to work, and was pregnant as “you aren’t doing enough for me”. He eventually figuratively beat all the love I had for him out of me by just progressively being worse. Gaslighted my kids into thinking he was the victim. Anyway, a decade later his new rich wife and him are too cheap to kennel their dogs on their frequent weekend trips. Usually talks one of our adult children into dog sitting even though they all live at least an hour away. They ask me to come over as my ex and I still live in the same town to see the dog we had together, visit and to not tell him about it. I’m sooooo cool with that. So while I’m there I do petty shit just to annoy him with him not ever knowing it was me. Like taking his work badge which hangs by his front door and drop it behind the bookcase next to it. Moving things in his den from one drawer to another as everything has to be exactly in a certain spot or he loses his shit. Only one or two at a time so it doesn’t look deliberate. Even let some air out of one of his tires. Not enough to be flat, but enough he will have to make an extra stop to fill it up. One of my kids a few months later said it was weird how pissed he got about a tire being less full as it “causes uneven tire wear”. He’s very obsessive about it but too lazy to check his tires. My kids are unaware and I know little things just stab him lol",
        "created_utc": 1676783360,
        "upvote_ratio": 1.0
    },
    {
        "title": "Someone who criticized my wife and I for getting married in 4 months.",
        "author": "papipendejo",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/115y2r0/someone_who_criticized_my_wife_and_i_for_getting/",
        "text": "[removed]",
        "created_utc": 1676770680,
        "upvote_ratio": 1.0
    },
    {
        "title": "I peed in a letterman jacket",
        "author": "StrangePlantain",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/115xndm/i_peed_in_a_letterman_jacket/",
        "text": "When I was in my freshman/sophomore year of high school I was friends with a girl who was on the geeky and obnoxious side. We kinda of fell out by senior year, but I accepted her mom's request that I housesit while their family was on vacation.\n\nSince I was a 17-year-old idiot I thought it would be fine to invite a small group of friends over so we could drink and smoke a little weed. My parents were super strict so this was a small taste of freedom for me, especially since I wasn't cool enough to get invited to parties very often. I think people showed up when it was still light out, and of course I got drunker as the night went on.\n\nBefore I knew it, the house was full of people. I honestly still have no idea who invited the entire high school or why people thought they would be welcome. All these people that literally never gave me the time of day showed up so they could have somewhere to party. I couldn't get anyone to leave, and people kept pushing their way in or jumping the fence, it was nuts. \n\nAt some point a family friend (total douchebag football bro who I think is a finance bro now) showed up and said something like, '(former friend) told me to check up on you because she knew you would do something like this'. I tried to explain that I didn't invite the whole high school but he didn't believe me. I asked him to please just help me get people to leave if he was so concerned, but he just stayed and partied (douchebag).\n\nIn the morning I woke up to the mom screaming at me to get out of the house since she had been tipped off by this asshole guy who didn't help at all. As I was cleaning up I noticed he had left his letterman jacket in the kitchen. I took it outside, pulled down my pants, and peed (a very pungent hangover pee) inside it. I left it on the front porch so it could really bake in the sun.",
        "created_utc": 1676769441,
        "upvote_ratio": 1.0
    },
    {
        "title": "Delete My Account? I'll Hack Yours!",
        "author": "b_0nko",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/115wu9g/delete_my_account_ill_hack_yours/",
        "text": "[removed]",
        "created_utc": 1676767031,
        "upvote_ratio": 1.0
    },
    {
        "title": "Exposing cheaters for a living",
        "author": "SEO403",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/115w50f/exposing_cheaters_for_a_living/",
        "text": "This post might come across as self-centred but I am keeping it honest.\n\nFrom a young age, I noticed that I got quite a lot of attention from women. I'd regularly get approached and flirted with but I was very naive. I didn't act on it until I was 18. At that age, I got scouted to work in commercial modelling and after that, it made the attention factor even bigger as I became somewhat recognisable among young people in London. It is a tiny pool of commercial models that get used for most established and up-and-coming brands. So, you appear in Asos and best believe that a few people will recognise you and approach you every time you go out.\n\nI started posting pics from my shoots and grew a pretty big following on IG as a byproduct of that. Many women from my town back in Spain that were in relationships would constantly react to my stories with hearty eyes or fire emojis, but I never did anything.\n\nThat was until my best friend got cheated on. I don't believe in cheating and I place loyalty as my top 1 of everything. So did he. I saw him cry for weeks for the first time in years. I didn't even know what to say or do but I was pissed. Almost as if I was the one that got cheated on.\n\nI made it my mission to entertain women in relationships that would engage and tell their boyfriends. I started posting a few thirst traps here and there and would look among the women I knew or even didn't know that had public profiles and were in relationships. The first one that responded to my DM and I were talking and flirting for a few days and talking about meeting. The boyfriend could only be seen in one story within her IG highlights and was not tagged. I searched every one of the men she followed, found him and sent him screenshots.\n\nThat dude told me to get a life and blocked me. I don't know if he trusted me despite the evidence. \n\nWell, after that encounter, although I hated the idea, in order to get my revenge, I had to do it and gather irrefutable evidence. I would do the same, post, DM, and talk to those that replied, flirt, suggest we meet, meet...\n\nTo give you an idea, I have 87k and normally get 40 to 100 reactions from women when I post anything nice. The majority of the reactions are literally teenage girls, which, obviously... then, older women and in the middle, uni age women. about 30%.\n\nIn 1 intense month, I managed to go out with 5 women in relationships a few times, take selfies, and avoid having sex but sext with them a lot and screen record it on snap as I have android and you can do so without it being flagged with Play store screen recording apps. \n\nMind you, they never once disclosed that they had a boyfriend, and they all had the same thing in common as the first woman. You had to DIG to learn that they have a boyfriend. I did the work beforehand and saved the usernames of the boyfriends. \n\nAs soon as I had enough evidence, I just sent it over to them. Guess what? Pretty much all of them believed me. I apologised and told them that I didn't have sex with them as I knew they had boyfriends but that if I hadn't held, we would have as they suggested so after the first meetups. \n\n2 of them sent me screenshots of the girlfriends lying and accusing me of being a liar despite the overwhelming evidence, they later told me that they ended things. 1 of them straight up broke up with his gf, the other one thanked me and said nothing more despite my asking, and the last one saw it but didn't reply.\n\nDo I feel bad? NO. Would I do it again? I do it every time I find out a woman that is entertaining me has a man, which has happened many times for good or bad\n\nLook out for each other ladies and gents. If you are a woman that gets lots of male attention, expose them, a man that gets lots of female attention, expose them.",
        "created_utc": 1676765012,
        "upvote_ratio": 1.0
    },
    {
        "title": "I want to be petty but don’t know how",
        "author": "ComfortableAwkward34",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/115nx8q/i_want_to_be_petty_but_dont_know_how/",
        "text": "[removed]",
        "created_utc": 1676749653,
        "upvote_ratio": 1.0
    },
    {
        "title": "Poured porridge on my car... phone you all night",
        "author": "Michaeld256",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/115myhx/poured_porridge_on_my_car_phone_you_all_night/",
        "text": "I live on a small side road and it's never really busy and loads of parking. However one night after returning from a late shift at around 11pm I found that there was a religious event at the local churches and there was no parking. \n\nI managed to find a small spot however it overhung on my neighbours driveway slightly however was in no way blocking him in. I felt bad but I was tired and it shouldn't have caused him any problems. I wrote a note with my number and asked him to give me a call if he needed me to move it when he woke up in the morning. \n\nI woke up the next day, literally 7am on the dot. I got a phone call from a house number. I answer, and it's my neighbour screaming down the phone that he's going to have my car towed away. I told him to calm down and that I'll move it now. I went outside and found that he had poured porridge all over my windscreen and left a cone on the roof. \n\nI knocked and asked he why he did that to my car, to which he replied \"Shouldn't have parked on my drive, now move your car\" and slammed the door. I was furious! \n\nI moved my car for fear of further breakfast related items being thrown at it and I thought about how to get him back. I then realised that I now had his house phone number and I was working nights that particular day. So come 10pm I go to work and every half hour I call his house phone until he answers then immediately hang up. \n\nI did this for two full nights and honestly felt so good hearing the frustration in his voice.",
        "created_utc": 1676748117,
        "upvote_ratio": 1.0
    },
    {
        "title": "Girl Scout Cookie Revenge",
        "author": "jdubiu77",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/115lmjn/girl_scout_cookie_revenge/",
        "text": "A few years ago, I was bowling in league and a teammate's husband showed up to watch/visit. A Girl Scout had set up to sell cookies, so he and I walked over together to make a purchase. \n\nWhen we arrived at the table, she informed us she had only 5 boxes of Thin Mints left. Friend's hubby was ahead of me, and that rat bastard bought all 5 boxes! I ended up buying the lemon cookies while he gloated.\n\nI spent the next hour listening to him talk trash about my \"punk-ass lemon\" cookies and the obvious superiority of Thin Mints - all while plotting my revenge.\n\nFirst step was to borrow super glue from the pro shop. \nNext, I waited for him to leave his cookies unattended. At the first opportunity, I swapped his Thin Mints for my lemon, and glued the boxes back shut. Then I waited... And waited.\n\nApparently, these cookies went in the freezer. About 3 weeks later I received a text from the hubby that just said \"You bitch.\" \nI have to admit those Thin Mints were delicious.",
        "created_utc": 1676744494,
        "upvote_ratio": 1.0
    },
    {
        "title": "My suite mate constantly took/used my toilet paper and even used my hand soap as body wash so I returned the favor!",
        "author": "Deelicous",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/115kl6b/my_suite_mate_constantly_tookused_my_toilet_paper/",
        "text": "TL:DR My suit mate would use my toilet paper and paper towels without refilling them and was using my hand soap as body wash so I kindly took all his things he left behind \n\nWhen I was a senior in college I had a very dirty/filthy roommate. Before knowing how he was I always tried to be generous and bring my toilet paper or paper towels If I would see it running low because I would want someone to do that for me. Things started becoming an issue when I would notice that my toilet paper would be almost empty or empty whenever I would just put it on like either he was taking massive dumps or he was allowing all his friends to use our bathroom. I told him that I’m noticing the toilet paper wasn’t getting filled after I would bring one in and he assured he would start replacing mine and putting his own in which he never did so I stopped refilling it and only brought in my toilet paper when I had to us the restroom and would take it out after. I then started to notice my hand soap started to dwindle faster than it usually has which I didn’t really think anything of it until I came in the bathroom one night and seen my hand soup on the shower floor which meant in my mind he’s been using it as bath soap to shower with and I was furious! He couldn’t even remember to put it back on the sink so I wouldn’t find out. I was going to confront him or go to an RA but we were graduating in a few weeks and I didn’t want to have to deal with the mediation stuff so I said F it and started taking everything that’s mine out of the bathroom. Fast forward to a few days before we had to leave our dorms we were required to clean our rooms and the bathroom I knew he wasn’t going to do anything and when it came time to clean the bathroom I noticed he had left because his room door was open and nothing was inside but he had left all his toiletries inside the bathroom such as his bathroom rug, shower curtains, trash can, shower mat etc. so after I finished cleaning everything I took all his things  washed them, took them with me and left the dorm! A lot of people leave things behind and get them later if they can’t fit everything into one trip wherever they’re going so I wish I could’ve seen his reaction when he came back to the dorm and his things were gone.",
        "created_utc": 1676741715,
        "upvote_ratio": 1.0
    },
    {
        "title": "My boss has been being a bitch since i got here",
        "author": "Nsanc0902",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/115g2gi/my_boss_has_been_being_a_bitch_since_i_got_here/",
        "text": "[removed]",
        "created_utc": 1676729155,
        "upvote_ratio": 1.0
    },
    {
        "title": "Jagwar Twin - Happy Face (Lyrics)",
        "author": "Sweaty-Barnacle6286",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/115fx3i/jagwar_twin_happy_face_lyrics/",
        "text": "",
        "created_utc": 1676728738,
        "upvote_ratio": 1.0
    },
    {
        "title": "Kicked out a lady who was trying to insult my coworkers on how to do their job",
        "author": "Different-Craft-5926",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/115ew91/kicked_out_a_lady_who_was_trying_to_insult_my/",
        "text": "Exactly how it says. I work in a traditional Vietnamese nail salon and the way I see them get treated is really baffling sometimes and one thing I will not tolerate is someone who is trying to provide a service and the client is nit picking and telling her how to do her job!!!! Not even in a nice way. Let me tell you, I am all about speaking up when you’re getting a service but there’s a right and wrong way to go about it. Nail tech then gets up and tells her she’s not doing her service and walks away. The client goes and tries to tell my boss who (speaks English but she does have an accent) that SHE should have done her service and took over. So I’m working on my client and as soon as i hear her I say “you made your appointment with Kim why are you upset that Katie can’t service you when her appointment is coming in soon” and she says “i know i did but i don’t even know who she is … and you need to mind your business idk why you’re talking to me” ma’am. You made it my business  when you decided to speak loud enough for me and all of the other clients and employees to hear.",
        "created_utc": 1676725523,
        "upvote_ratio": 1.0
    },
    {
        "title": "You are Right, I'm Not Your Mom",
        "author": "AccomplishedAd3432",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/115aku2/you_are_right_im_not_your_mom/",
        "text": "[removed]",
        "created_utc": 1676708646,
        "upvote_ratio": 1.0
    },
    {
        "title": "I hate draft kings!",
        "author": "Meta_or_Whatever",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/11592cl/i_hate_draft_kings/",
        "text": "[removed]",
        "created_utc": 1676702700,
        "upvote_ratio": 1.0
    },
    {
        "title": "My Petty Neighbour Kicked Out Her Husband. He Wants Her Back",
        "author": "ConfidentAd3638",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/1158hv2/my_petty_neighbour_kicked_out_her_husband_he/",
        "text": "[removed]",
        "created_utc": 1676700557,
        "upvote_ratio": 1.0
    },
    {
        "title": "Inconvenient Revenge Ideas",
        "author": "blush_ing",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/1157llh/inconvenient_revenge_ideas/",
        "text": "[removed]",
        "created_utc": 1676697338,
        "upvote_ratio": 1.0
    },
    {
        "title": "Block the footpath so you can watch cricket in your car?",
        "author": "tallmantim",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/11574ja/block_the_footpath_so_you_can_watch_cricket_in/",
        "text": "[removed]",
        "created_utc": 1676695675,
        "upvote_ratio": 1.0
    },
    {
        "title": "got tired of being bullied by my boss everyday, so i got her fired",
        "author": "strawberry-phd",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/1156l5i/got_tired_of_being_bullied_by_my_boss_everyday_so/",
        "text": "In 2021, i worked as a receptionist/admin assistant in a retirement home. It was a really fun job, excluding dealing with covid regulations and outbreaks. I was 21, and i felt like i had 30-40 grandmas/grandpas to visit everyday. I got to hear all their stories and felt very supported, and i think i lessened the loneliness a lot of our residents felt.\n\nI had started there as a waitress but got promoted into the front desk position, which didnt actually exist before i got there. Because of this, me and my boss worked closely in figuring out what my duties were. I trained all of the receptionists going forward, and personally wrote the job description to hire a weekend receptionist.\nMy boss was amazing, kind and supportive, and a fantastic leader- until she resigned from the executive director position due to life changes. For a few months, our CEO filled in as director. I think she must have liked working with me or the rest of this story mightve turned out differently. Eventually the CEO found a new executive director- lets call her Kira.\nShe had moved to our state from California, just for this job. She was standoffish, but i told myself she deserved every chance to enjoy working with us. We had a great staff that truly cared about our residents, and we all got along well.\nI filled her in as best i could. Part of my job was creating social content for the business, and it was her job to oversee my work and help write the newsletter. The first few months were fine, but since we didnt click, our communication often went through the office manager, who was an excellent coworker. Kira pretty much abandoned all of her social media responsibilities, but i knew i could handle it alone so i did.\n\nThen, one terrible summer day, the office manager and activities assistant left for 3 months, for unrelated health issues. Suddenly we were working with 2/3rds staff and i had twice as many responsibilities. And i had to deal directly with Kira.\nShe was big on unhelpful, rude remarks. She loved to call in sick, especially when we really needed her. She concerned a lot of her time with bringing me into her office to give me long lectures about how i had done something wrong (typically just doing my job, except she was so new that she didnt actually know what was going on). \nOur entire cleaning staff quit, and she failed to hire anybody to replace them, so we instanty had a building full of filthy apartments and angry residents. Kira asked the cleaning staff of one of the other buildings in our company to come in on their weekend to clean up her mess. I watched Kira walk through the lobby with the head of their team, and i heard the cleaning team say \"we wont be able to clean every apartment in one day, but we will try.\"\nFast forward to the following sunday, Kira calls me to update her on the cleaning, and is enraged to discover they couldnt clean every room. She tells me shes going to ask the CEO to fire the cleaning team for lying to her. I tell her, \"i dont think they intended to lie, they worked really hard but i think there was some miscommunication about what they could do.\" Kira goes ballistic. She starts speaking to me like im 5 years old, yelling at me about misunderstandings. Its completely inappropriate, and luckily for me, another coworker is listening to this call as she steps miles out of line. \nThe next day, im working on the weekend to train the weekend receptionist. She starts calling me to chew me out further, demanding i come up with a list of apartments that haven't been cleaned, although i have no way to contact the cleaning crew on their weekend. Full of anxiety, i stop answering her calls as she blows up my personal phone. Then she blows up the front desk phone. Knowing she only wants to bully me, i let the weekend receptionist pick it up while i help residents. I spend my lunch break in tears, on the phone with our office manager. We decide to start reporting everything to HR. \nWhen i come back from lunch, Kira comes into work on her day off just to yell at me in her office for half an hour- except this time, im recording the whole thing. As always, i swallow my pride and pretend shes right about everything, i take the abuse and it feels horrible. She loved to say that our visitors would complain that i never pick up the phone- i guess she didnt know i managed the voicemail services and never missed a call while we were open. (\"Whos call did i miss?\" \"I dont need to tell you that\")\nI go over her head to meet with HR. I show them the recordings and talk about the constant bullying, i snitch on her for not working on social media, i explain all the ways she hasnt been supporting the staff. They ask me to stay cool and not quit, and theyll see what they can do. \nOver the next few weeks the abuse increases, to the point where she pulls me aside just to yell at me for not smiling at her. (Im not dumb, i still greet her and everyone else that comes into the building because its my job. But i cant smile at her.) Every interaction is recorded and emailed to HR. The rest of the staff knows im reporting it all to HR, and nobody tells her... and then other members of the staff start making their own appointments with HR to talk about how much Kira sucks at her job and how poorly she treats me. Even the residents snitched on her behavior.\nIt all culminates on a dark and stormy tuesday, where Kira has decided shes going to fire me. She tells a coworker her plans, someone who has worked at the building for 10+ years and has a lot of influence. That coworker texts me to warn me and HR to prevent Kiras schemes. Im sitting at my desk, too emotionally exhausted to care either way. First, Kira calls HR to get permission to fire me. They say no. Then, Kira goes to the HR office in person. They still say no. Then, Kira goes to the CEO to try and fire me. Nope. She comes back for her lunch break, and then sets out again on her unholy crusade to fire her receptionist. Still no results. At one point HR calls to ask: am i really sitting at the front desk with headphones in, ignoring the visitors? Obviously, im not. Kiras creating all kinds of lies to get me fired.\nKira goes home early, stomping her way out of the building after 6 hours of doing absolutely none of her job. \nThe next morning, an hour before my shift starts, the CEO and HR fire Kira. Ive been told there was a lot of unprofessional kicking and screaming. She was ultimately banned from the building due to some vague threats that i was grateful to never personally hear, and turned out to be bluffing anyways.",
        "created_utc": 1676693822,
        "upvote_ratio": 1.0
    },
    {
        "title": "should I worry if my boyfriend is still interested in me or not ?",
        "author": "starrycar",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/1153nop/should_i_worry_if_my_boyfriend_is_still/",
        "text": "[removed]",
        "created_utc": 1676684464,
        "upvote_ratio": 1.0
    },
    {
        "title": "To my ex friend",
        "author": "Pearlzxoxo",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/1153j1z/to_my_ex_friend/",
        "text": "[removed]",
        "created_utc": 1676684066,
        "upvote_ratio": 1.0
    },
    {
        "title": "Yell at me over keeping data private? Fuck around and find out.",
        "author": "RadiumGirl88",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/1152vlz/yell_at_me_over_keeping_data_private_fuck_around/",
        "text": "Let me give you a little background of what I do for work. I work at a hospital as a nurse technician, however at times I pickup shifts on the (VMON) video monitoring unit. Basically, if we have patients who are a risk to for elopement, falls, confusion, pulling on lines, etc, but doesn’t need a 24/hr sitter, we put a camera in their room and watch from a live feed. If we see any the patient doing anything they’re not suppose to, the camera has a loud alarm so we can notify nurses/techs that are nearby. It’s never recorded so it doesn’t violate HIPPA and it saves staff members to help out in other places as they don’t need to sit in the room. \n\nI have a coworker who we’ll call Karen. Karen is around 60 and has been working in vmon since it started 12 years ago. She’s very bossy, acts like she knows everything, she’s an expert in anything she does and she’s NEVER wrong. She has three very “successful” kids, she rambles on and on about them, we don’t know how much is true and how much is exaggerated. She likes to make sure everyone knows she’s been here for 12 years and knows everything about the monitoring system. No one really challengers her because it’s too much work to argue with her and no one really likes her but we put up with her, because she’s retiring in a year. Now, not every signal patient we have is naughty 24/7, so we have some down time to chat. I’m young and I like to use the term “fuck around and find out” a lot. \n\nSo Karen here, started talking about how horrible smart phones and the internet because they steal your information. She said she always makes sure no one has her data. I replied, honestly I don’t care anymore. I protect my vital information, but I said almost everyone knows if someone really tried they can find out your stuff. She was like no way why would you just let people find you like that!?!? That’s a bad idea. Proceeds to lecture me about identity theft. She then said, I never share my information. Even my kids don’t even know my maiden name! No one does. That’s vital information and I know it’s not out there. I though ha! If anything, that’s super easy to find.  So I spent like 10min looking through public records.  I found her first husbands last name. Kept looking. Found her three most recent address. Her three kids. Her maiden name. Her birthday. Her current husband. I took a screenshot but haven’t shown her yet, still don’t know if I should.",
        "created_utc": 1676682134,
        "upvote_ratio": 1.0
    },
    {
        "title": "Best way to get PR on someone who leaves notes on your car every day?",
        "author": "its_fiddy",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/1150p7g/best_way_to_get_pr_on_someone_who_leaves_notes_on/",
        "text": "Pretty straight forward: there’s someone who leaves notes on my car everyday telling me I can’t park in my paid spot and claiming that they paid for it. This is 100% not true and I think they’re mocking me, because when I moved in I put a note on their car asking them to not park there as I pay for it every month. How can I get some petty revenge on this person who has the energy to leave a note every day?\n\nI was thinking collecting all of the notes and then piling them all on their car at once. Need some suggestions!",
        "created_utc": 1676675991,
        "upvote_ratio": 1.0
    },
    {
        "title": "Delete my files? I’ll start a (minor) crusade.",
        "author": "Mryan7600",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/1150exy/delete_my_files_ill_start_a_minor_crusade/",
        "text": "\nIn high school one librarian was in charge of literally everything computer related for students. She controlled the printer in the library with an iron fist and allowed you to print only with a note from a teacher saying how many pages an assignment will be, otherwise she charged us 15 cents a page(the local library allowed up to 5 pages free and then 5 cents a page after).\n\nEvery student had a separate partition space on our computer network where we could save and edit our files. We were forbidden from using flash drives(they were too expensive at the time anyway) or putting any personal disk into a computer because we could bring in a virus. This was a massive pain in the butt because we also weren’t allowed to use email on school computers so if you did an assignment on a home computer you couldn’t print it at school.\n\nI had a graphic design class senior year and all our work was done on photoshop. So very large files. We turned in each assignment when we were done, but we had to keep all our raw files for the final which was to create a website portfolio with a tutorial for each of our projects and include images of every step in the process.\n\nQueue one week prior to the end of the class and my partition is empty. No files at all. Lost notes from classes and several papers but all of those had been turned in. The big problem was all of my images and raw photoshop files were lost. I talk to my teacher who says this has never happened before. He talks to our IT guy who says he didn’t do it and the only other person who would have been able to is librarian.\n\nWith my teacher with me we go and talk to librarian. She says she didn’t do anything like that. But then she looks me square in the eye and says. “But you did have a lot of large files in there, you know when you use that much you limit other students. When they get that high sometimes we have to delete files without looking, didn’t you have a backup?” so she just confirmed that she did delete them while saying that she hadn’t, she also was well aware there was no way I could have backed any of these files up within the schools rules.\n\nSo here comes my revenge. One of the hard fast rules at school is no changing anything on the computers! It was set up so you couldn’t change the background on the computer through the normal methods. But I noticed that they hadn’t changed the settings on MSPaint so you could still change it from the file menu there. So I screen shot the only approved background and edited it slight. Instead of saying “Microsoft Windows”, I edited the logo to say “Microloft Bindows”(hardly inspired I know, but I was 17). I started doing it every time I sat at any computer in the school. Probably about 2 a day. I even recruited a few friends to do the same. By the time anyone noticed we had probably done like half the computers in the school.\n\nAfter a few weeks there were flyers printed all offer the school about computer rules and saying that any changing of computer settings could result in disciplinary actions. It tickled me to know that the woman who had been charging me 15 cents a page for almost 4 years had to print dozens of flyers because of my harmless prank. Even funnier was hearing her talking to another librarian about how it was either a virus or somebody had the admin password because there was no other possible way somebody could change the background. \n\nFor anyone who wonders. I had the option of taking a B in my class(I had a high A at the time) or redoing about half the class assignments on my own time so I could make the portfolio. I chose to redo it, I had tons of fun in that class and I had my own car so staying late wasn’t an issue.",
        "created_utc": 1676675212,
        "upvote_ratio": 1.0
    },
    {
        "title": "Netflix app is amusing",
        "author": "ZanyZanyaA",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/114ztbg/netflix_app_is_amusing/",
        "text": "[removed]",
        "created_utc": 1676673613,
        "upvote_ratio": 1.0
    },
    {
        "title": "Run off with a car you don't own...",
        "author": "JeepHammer",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/114zonr/run_off_with_a_car_you_dont_own/",
        "text": "[removed]",
        "created_utc": 1676673269,
        "upvote_ratio": 1.0
    },
    {
        "title": "New roommate has been a nightmare…",
        "author": "Drackarious",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/114zahk/new_roommate_has_been_a_nightmare/",
        "text": "Hey guys! So I ended up moving into a new place with a couple coworkers on December 1st. In the beginning it was a sweet deal, all of us saving money on these inflated rental costs and we could all pitch for common household items… so I thought. \n\nThe nightmare roomie lives in the basement with their two LARGE dogs. We were all in agreement about the dogs living with us and under the impression they actually care for their dogs and that they are well trained. Turns out they leave them locked in the dark basement for 12+ hours a day, no walks or anything, resulting in accidents and them having to do laundry on other peoples laundry days. Not to mention I caught them totally using my personal laundry detergent… Originally we figured it’s horrible but not really our business how they ‘care’ for their dogs despite our personal feelings… until the dog had an accident in the common area. Turns out one of them peed on MY quite expensive couch that I agreed to put in the common living area, again assuming the dogs would be behaved/supervised. \n\nAnyway, I notice the mess and I confront roomie who is somehow completely oblivious to it and claims that they took the dogs out to pee before they went on my couch. Well, it’s there, and it’s definitely piss so I send a pic and they lose their shit saying they don’t feel welcome in our home anymore just because I told them not to allow their dogs on MY couch anymore... 🙄\n\nThese are just a couple examples of why this roomie has become a nightmare in such a short time among so many other things, like using up common area things and never replacing, never takes out the trash, never cleans common space… I could go on all day. \n\nHere’s my mini revenge: \nWhen we first moved in, I was so gracious as to share my Netty and Disney+ account with them since they are too broke (seems to be a trend despite working the same hours as I do) to get their own and at first I sympathized. However, now that they’ve proven to be a total sleezebag mooch, I decided to log out all devices so their TV would sign out of my accounts. They don’t know the passwords. \n\nHave fun in your dark ass basement with absolutely nothing to do but think about how your poor dogs spend their days just like that... Alone and in the dark. Get fucked. ✌️",
        "created_utc": 1676672253,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can't Respect the Fridge? Let Me Put a Lock On It.",
        "author": "kateyybeth",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/114wq2k/cant_respect_the_fridge_let_me_put_a_lock_on_it/",
        "text": "[removed]",
        "created_utc": 1676665742,
        "upvote_ratio": 1.0
    },
    {
        "title": "Petty family",
        "author": "Particular-Cod3540",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/114wo6d/petty_family/",
        "text": "[removed]",
        "created_utc": 1676665599,
        "upvote_ratio": 1.0
    },
    {
        "title": "Lauren Boebert sponsors a bill to eliminate the Department of Education",
        "author": "vpniceguys",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/114vz41/lauren_boebert_sponsors_a_bill_to_eliminate_the/",
        "text": "[removed]",
        "created_utc": 1676663842,
        "upvote_ratio": 1.0
    },
    {
        "title": "Wanna Smoke In My Truck, See What Happens",
        "author": "WickedStorm614",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/114vx0n/wanna_smoke_in_my_truck_see_what_happens/",
        "text": "[removed]",
        "created_utc": 1676663698,
        "upvote_ratio": 1.0
    },
    {
        "title": "To stop my supervisor from blaming me for the hair in the food of my customers, I dyed my hair brown.",
        "author": "LvlyClair",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/114vbo4/to_stop_my_supervisor_from_blaming_me_for_the/",
        "text": "[removed]",
        "created_utc": 1676662207,
        "upvote_ratio": 1.0
    },
    {
        "title": "Valentine’s Scandal Update",
        "author": "Methkitten03",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/114tiww/valentines_scandal_update/",
        "text": "Sorry for the late post!!! Got into an accident. So yes, my sister finally rejected the two timing cheater guy while his girlfriend broke up with him right after her rejection. When my sister was at the exact date spot the girlfriend chose, the cheater was so nervous and shocked to see my sister with the letter he wrote to her. The girlfriend and her were already on call as planned as the girlfriend waited for the guy to admit his “feelings” for my sister and she showed up saying “Oh then that means you have to be single first”. \n\nThe best part? My sister and the girlfriend (now ex) went shopping and hungout after this encounter. The cheater is now trying his best to defend his actions at school now but no one is siding with his two timing ass.",
        "created_utc": 1676657628,
        "upvote_ratio": 1.0
    },
    {
        "title": "I revealed my stepmother's scandal after she tried to make my dad take me off his medical aid.",
        "author": "KiowaMai2809",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/114takn/i_revealed_my_stepmothers_scandal_after_she_tried/",
        "text": "[removed]",
        "created_utc": 1676657055,
        "upvote_ratio": 1.0
    },
    {
        "title": "Customer Karen",
        "author": "DarkLily7",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/114rf5h/customer_karen/",
        "text": "Customer Karen needed a specific kind of wine for an event. She was rude and obnoxious the whole time, while we were assisting her. \n\nTo give an example this is how our conversation went:\n\nKaren: Do you have pink red wine?\n\nMe: Oh did you perhaps mean a rosé? The rosés are over here… *happily points to the rosé section of the catalog* \n\nKaren: NO I specifically asked for the pink kind of red wine! I will say ROSÉ if I mean ROSÉ. I am not an idiot! \n\nMe: I’m sorry I didn’t mean to… \n\nKaren: I DONT GIVE A RATS A** ABOUT WHAT YOU MEANT. WHERE IS YOUR MANAGER?! WERE YOU DROPPED ON YOUR HEAD? \n\nI called my manager so she dealt with Karen - ending was she was also rude to my manager and yes she pointed out a specific bottle of Rosé. My manager and I were so pissed and apparently SHE REALLY NEEDED THOSE BOTTLES or else the event was a no-go. Manager and I decided to buy the last 5 boxes and told her it was unfortunately out of stock. Next shipment would be in two months. She ran out of our office cussing.",
        "created_utc": 1676652429,
        "upvote_ratio": 1.0
    },
    {
        "title": "If you feel guilty about stealing from a big business just remember corporations are not people but under our corrupt laws are legally recognized as such",
        "author": "PlasticYou9295",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/114q3l2/if_you_feel_guilty_about_stealing_from_a_big/",
        "text": "[removed]",
        "created_utc": 1676649957,
        "upvote_ratio": 1.0
    },
    {
        "title": "Emily’s revenge on her bf…",
        "author": "CutieNotice",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/114ov11/emilys_revenge_on_her_bf/",
        "text": "[removed]",
        "created_utc": 1676648241,
        "upvote_ratio": 1.0
    },
    {
        "title": "Making my blind mother in law walk into the road? Well good luck replacing your wing mirrors..",
        "author": "simsyboy",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/114mmyf/making_my_blind_mother_in_law_walk_into_the_road/",
        "text": "My mother in law is legally blind with less than 10% sight and uses a guide dog. She lives in a street where all homes have a drive way and there is room to park on the road if need be. However, I'll often see someone who's parked on the pavement (sidewalk) with literally less than a foot between the car and the garden wall.\nIf my mother in law would go out with the dog and came to this hazard, the dog would have to take her around the car and into the road. The dog is amazing, but it's still not safe for a blind person to have to walk into the road. I contacted the council numerous times but they did nothing, so whenever me, my partner and mother in law would go walking, if we encountered these idiot parkers, my partner would escort his mum and dog around the car, whereas I would close my eyes like I was a blind person and squeeze between the car and garden wall and unfortunately I'd always hit the wing mirror, often knocking it off the car. Depending on the cars age, it would either hang off the car or fall clean to the floor.\nThis issue still happens, but I'm always ready. I hate selfish parkers.",
        "created_utc": 1676645149,
        "upvote_ratio": 1.0
    },
    {
        "title": "Have a nice trip",
        "author": "SirensofTTown",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/114jyts/have_a_nice_trip/",
        "text": "Wife and I were flying into JFK. Back of a Jet Blue plane, there are maybe 3 or 4 rows behind Us. \n\nHuge pet peeve is when folks behind stand up and crowd into the aisle next to us, which this girl did. It even says on the screen not to do that. \n\nSo we’re talking to each other about how annoying it is and the girl says something smarmy like “I’m so glad I’m in front of you” and while my wife tells her about how much more valuable her time must be than ours, the girl agrees.\n\nWhen the aisle finally starts moving my wife (whose foot was out in the aisle already) trips the girl behind us, who stumbled and then walked back like she was gonna fight or something. \n\nOn our way out she had stopped in a middle aisle and was complaining to a stewardess about it, but we just kept walking and de-boarded before her anyway.",
        "created_utc": 1676639449,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do I make my cat happy",
        "author": "circapet",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/114j50h/how_do_i_make_my_cat_happy/",
        "text": "[removed]",
        "created_utc": 1676636766,
        "upvote_ratio": 1.0
    },
    {
        "title": "Call me a little shit? Well...",
        "author": "Tiefschlag",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/114i4nc/call_me_a_little_shit_well/",
        "text": "[removed]",
        "created_utc": 1676633151,
        "upvote_ratio": 1.0
    },
    {
        "title": "My dad deleted my recording of jersey boys so i deleted 2 years worth of football",
        "author": "Leather-Insurance-46",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/114hadd/my_dad_deleted_my_recording_of_jersey_boys_so_i/",
        "text": "This happened like 2014/15 we had direct tv, no movie channels besides like fx so nothing new or good was ever on. Randomly, for a week direct tv would give you a couple channels for free and i learned the recordings will be kept even after the special was over so i saved ones i liked and would use them for background noise.\n\nAnyways my mean drunk of a dad that could never be wrong insisted that because i was the main box my recordings wouldn’t be deleted but would clear up space on other devices. It did not work like that. So my stuff would regularly be deleted and i didn’t care too much because he left Jersey Boys alone. Until he did delete it. I don’t know what happened to my brain that day. it’s not even close to being the worst thing he’s done i think it was just a final straw for me. I went after all his football games that he recorded and 2 super bowls.\n\nLong story short; it took him almost a week to find out, i was too scared to admit it so my mom took credit and said it was for jersey boys. he didn’t delete my recordings again but i still kept doing it to him for another year before finally cancelled direct tv.",
        "created_utc": 1676631021,
        "upvote_ratio": 1.0
    },
    {
        "title": "Small Petty against BF",
        "author": "ILoveAllSupernatural",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/114gk2d/small_petty_against_bf/",
        "text": "So last week my other half was off work and was kindly taking me to work instead of me having to get the bus, well my bf has a hard time waking up in the morning so we ended up having a mini argument where he had a go at me.for 'moaning' at him to wake up. I was still tired too, so it got me a bit emotional.\n\nQueue my petty revenge.\n\nIt was the Thursday this happened so when i came into work i asked my manager if i could take Friday as a Lieu day, which he agreed to. My BF was due to take me work the next day, i told him due to our disagreement in the morning that i would take the bus the next day, not telling him about my day off for the next day.\n\nHe woke up the next day about 10.45am in a panic cause i was still in bed. I calmly said I have a lieu day and laughed. He was pissed at the time cause he panicked but we laughed about it later. \n\nAnd that is my little petty revenge story.",
        "created_utc": 1676629603,
        "upvote_ratio": 0.99
    },
    {
        "title": "Entitled Delivery Driver Fk'd Around and Found Out",
        "author": "D4nM4rL4r",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/114ge3j/entitled_delivery_driver_fkd_around_and_found_out/",
        "text": "Pardon the grammar\n\nI work as a contractor for restaurants, cleaning them after the restaurant closes. I have been doing it for nearly 4 years and quickly learned that I need to think about \"what if a delivery truck comes while I'm working\". When I set up my truck and equipment, this involves hoses and extension cord. I cannot move my truck once set up  So tonight is no different and I had planned on the possibility of a delivery semi coming, so that's why I parked where I did. This left the entire walkway open and plenty of room for a semi truck to park and deliver the goods. I put up my emergency cones around my truck and work area. The most it would be to the driver is a minor inconvenience of a few extra steps, but that's all it is. \n\nOnto the story...\n\nI was finishing up cleaning with about 5 minutes before I could start packing up. I was correct and a delivery driver did show. The driver comes up to me and asks how long till I'm finished. Told him 30-45 minutes. He ask if I could move my truck 15 feet forward. I told him that I'm working right now and I'll be finishing up here soon with what I was doing. Then I can work on packing up my equipment, and after that, I can move, but it would still be bout 15 minutes. He raises his voice and tells me I need to move. I repeated that I'm not moving until I'm done cleaning and packing up my equipment. This goes back and forth 5-6 times. He gets angry,  starts yelling and cussing. Acting like if he talks over me and demands I move, I will do something. Having enough of this, I tell him that I'm not moving and he can wait. He's calling me everything in the book. I angrily tell him if it wasn't for his attitude and being a fucking ass, that we'd wouldn't be having any issue. Plus, I was there 1st and he can go fuck himself. He doesn't stop his verbal assault but I don't care. This interaction takes less than 2 minutes.\n\nI make my way outside when I finish and he's in his semi. I see that he had tossed my cones and some of the business's supplies I was cleaning outside, out of his way. I laugh when I see this. I go up to the back of my truck to pack up, and it's at this moment I hear him put it in gear and pull forward. He came within a foot of me and my truck. I didn't move. He did it quickly to try to intimidate me, I believe.\n\nUp to this moment, I was planning on packing up my truck and move it even though he was being an asshat. THAT was my cue to commence with pettiness.\n\nI moved all my equipment beside my truck on sidewalk. I didn't pack anything up. Instead, I went and finished everything I had remaining to do inside. The whole time he is yelling and cussing me. He was trying to intimidate me more by following me around with a constant barrage of insults. I had just emptied a trashcan of water and had put it back where it went. He grabs it and tosses it in my direction. I laughed again. He hears me. This gets him heated even more. He again tells me to stop being an ass and move my truck. The last thing I said to him was, I had nothing else for him and didn't talk to him from that point on. This. THIS SILENCE had the same effect as laughing at him. \n\nAnother time I make my way outside and I see he's calling the office number for my company that's written on the side of my truck. I hear him leaving a message cuz no one's there this time of night. \n\nHe then moved his semi again and put out the trailers side ramp. But I only noticed a moment later that he had unhooked his trailer. I see him move his semi in front of my truck and left the trailer behind me so that I'd be blocked in and would have to wait for him to finish. I laughed and laughed at this cuz I could see an out for me. So I laughed more where he could hear me. He was ragging so bad, I think he could've gave himself a heart attack if he would've been prone to that. \n\nI finished everything inside and then packed up all my equipment. He did a shit job of blocking me in cuz I was able to put 2 wheels on the curb and get by.  I had the window down and I was laughing the whole time. He was raging mad as I did this. I love it. I then let loose with my horn as I'm leaving the parking lot that he's failed to keep me in, to the little tune everyone does when honking or knocking on a door. Honk, ha Honk, Honk...HONK! HONK!  FUCK YOU!!!\n\nTL/DR: I left plenty of room for a delivery truck. But the delivery driver wanted the absolute closest spot and thought himself entitled to it. Got attitude when he could've had a bit of patience or just use the actual walkway like what it's actually there for. Would've cost him about an extra 50' of walking each way but he would've been getting the delivery done. Ended up costing him an increased stress level, 45+ additional minutes of waiting and the extra work of unhitching then re-hitching his truck. A situation he caused. \n\nAm I an ass? I can be. Was I? Hell yeah! Do I care? Nope.\n\nOh, I'm not worried about any retaliation or discipline from my company. It's an extremely small company with the owner being my direct contact. I got all types of pictures backing me up. When we talk, he tells me of all the fuk'd up shit that he had to deal with when he was just an employee doing the same job. We'll probably have a good laugh at it next time we do talk.",
        "created_utc": 1676629273,
        "upvote_ratio": 1.0
    },
    {
        "title": "I got my cursive teacher fired",
        "author": "Smarcle",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/114d6p1/i_got_my_cursive_teacher_fired/",
        "text": "[removed]",
        "created_utc": 1676617308,
        "upvote_ratio": 1.0
    },
    {
        "title": "Warning! Ohio State Waterproofing",
        "author": "imlostdunnowhattodo",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/114blap/warning_ohio_state_waterproofing/",
        "text": "https://ibb.co/BVmXmDB\nhttps://ibb.co/w67Z751\nhttps://ibb.co/kmRxywf\n\nOhio State Waterproofing otherwise known as Ohio State Home Services inc. has ruined my home in 2 days. 2 days for 3- 5 day job. They are more concerned with their bottom line and maximizing profits by any means necessary. They will NOT waterproof your basement! They can't even figure out where a drain line goes..... \n\n1)I mean they charged me 20k and don't have the ability to scope drains? I mean that is a part of that scope of work....why doesn't a $75,000,000 company have this ability? \n\n2)Why was I charged $20,000 and then handed 2 tubes of caulk and said do it myself? \n\n3) Why were my tools used without my permission? I'm sorry you loaded your equipment up before the job was complete! \n\n4)Why am I missing tools? \n\n5) Why is my entire family sick days after your work from the damage you did to sewer line? \n\n6)Why did you damage my sewer line? \nRush jobs much? \n\n7)Why do I have 1 inch gaps in my foundation now? \n\n8)Why did my wall shift? \n\n9)You send a supervisor to make it right.... your special chemical you use to clean walls uhhh...Why are you buying consumer grade products at lowes claiming its a specialty formula you use? \n\n10) Why is it I can physically stick my entire hand under my foundation now? \n\n11) Why were your techs disposing cigarette butts in the trench you dug in my basement? \nI don't even smoke inside my house! \n\n12) your employees cleaned my basement walls twice your so called \"mold remediation\" Why is it there's still dirt, debris, and cobwebs all over the walls? \n\n13) Why is it your company flat out lied to me about permitting requirements and assured me you didn't need a permit? My number 1 concern!!! \n\n14) Why am I having to run around to find a hotel and come up with money to pay for it becuase your company has made my home uninhabitable for my family? My wife had to be seen in the er and poison control had to be notified and the fire department had to be sent back out! I'm being told not to have my family in the home now..... \n\nOSW do you intend to make my my family whole again? \n\nHow many times am I supposed to allow you in my home to remedy this? I don't trust your company or employees any further. \n\nAt this point I am initiating action with the following entities and escalating this matter via legal avenues until your company agrees to a settlement in private in a timely manner. \n\nOhio Attorney General David Yost\nStark County Bar Association \nAlliance City Health Department \nAlliance City Prosecutors Office \n\nMy next steps are to involve entities at the county and state level. \n\nThis review and complaint is being posted with all signed documents proving your company in fact did the work and will be remain posted until such time we can reach an agreement.  I implore your executives to take this matter seriously!",
        "created_utc": 1676611486,
        "upvote_ratio": 1.0
    },
    {
        "title": "Remove my wet laundry from the dryer I paid for, I hope you like ice cream",
        "author": "markwells1",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/114atda/remove_my_wet_laundry_from_the_dryer_i_paid_for_i/",
        "text": "This happened to me a long time ago when I was in my first year of university.  This is a little different than most of the stories on this sub because the revenge is against someone that I do not know and never actually met. \nI lived in an off-campus apartment. The apartment complex had about 200 units. There were three laundry rooms for the whole complex, each had four coin operated washers and four dryers.  One day I went in to move my laundry from the washer into the dryer.  None of the dryers were currently in-use, so I just loaded my stuff into the first one.  I discovered that I only had enough change to run the dryer for about 10 minutes, so I started it and headed back to my room to grab enough change to add 30 more minutes to the cycle.  I came back to the laundry room no more than 5 minutes after loading the laundry into the dryer and my load of laundry sitting in a pile on the table and the dryer was running with someone else’s laundry inside. Still the only dryer in-use.  Now, the cost of running the dryer was minimal, so losing the cost of 10 minutes of dryer run time was not going to cause any hardship, but this is about the principle of stealing someone’s dryer time. I transferred my still-wet laundry to a different dryer and put in the coins necessary to dry my laundry. I should have just left it there, but then I wouldn’t be writing this post.   I had read something in the past about someone who took revenge on someone by tossing an ice cream bar into the dryer full of the victims best clothes.  So, instead of going back to my apartment and resuming my studying, I decided that the dryer thief needed to learn a lesson that day. Since I was a poor student, I didn’t happen to have any ice cream bars, but there was a big bucket of vanilla ice cream in the freezer.   So, I grabbed a big spoon and scooped out a huge spoonful of vanilla ice cream, ran over to the laundry room, opened the dryer with the evildoers clothes and tossed the ice cream into the dryer. I closed the door, restarted the dryer and went home. I went back about an hour later to retrieve my laundry and the thief’s dryer was empty.    Sorry I can’t tell you whether the dryer thief learned anything.",
        "created_utc": 1676608905,
        "upvote_ratio": 1.0
    },
    {
        "title": "Please don't steal reserved seats.",
        "author": "Jakinator178",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/11498aw/please_dont_steal_reserved_seats/",
        "text": "I went to see Antman today. I specifically reserved an aisle seat in the back of the theater (As I always do). I claimed my seat during preshows, and as the trailers started, I went to the concession stand. I grabbed my popcorn and a drink, went back to the theater, and there were 2 kids and 2 adults where I put my stuff.\n\nI just briefly grab my phone battery and cable that I left in the drink holder and take a seat a row down. During the trailers, one of the seat thieves right behind me is kicking my chair (probably a nervous habit, but annoying nonetheless). I just recline back the whole time, and they still kick a few times. Their 2 tweens also talk during the movie, mimicking the lines. I make shushing noises but they only quiet briefly. Eventually, they jabber on again, I start turning my head around to tell them to shut up, but their adult warns them to be quiet. My head made it halfway, but I retreat. \n\nFrom about the 30-minute mark onwards, they are well-behaved. When the movie ends, they leave in a hurry as the credits started. I craned my head to see if all of them were gone. They were. Guess who left a lanyard with car keys behind and didn't come back for them?\n\nMy petty revenge:\nAfter waiting through all the credit scenes, I grab the lanyard with the keys they left hanging, and I take it straight to concessions, politely informing them which showtime we were in, and where they physically sat in the theater. \n\nWhat? Were you expecting some criminal revenge? Thinking I was going to make off like a badass and steal their car? Throw their keys in the trash? They probably have a backup key or can call a taxi. I'm just happy knowing that whenever they get home, the adult will be frustrated that one of their car keys was lost, so their night and their kids' night is now ruined.\n\nI know, its not much of actual revenge and this thread probably isn't going anywhere, but I'm proud of my pettiness this one time.",
        "created_utc": 1676603738,
        "upvote_ratio": 1.0
    },
    {
        "title": "Don’t want a clean flat? Then you’ll have nothing",
        "author": "ahyusnioe",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/1148a50/dont_want_a_clean_flat_then_youll_have_nothing/",
        "text": "After months of getting pushed around and taken advantage of by my flatmates, I have finally taken a petty step which makes me feel great. \nI’m the only person in my flat that cleans, puts dishes away, and buys essentials. I have OCD and clean when stressed/ out of compulsion and my flatmates have taken advantage of it. I have never seen any of them lift a cloth, sponge, or mop. It’s taken me months to get to a place where I am mentally comfortable to do this, but I finally feel able to. As of tonight I have taken all of the following out of the communal areas of our flat, all of these I have bought with my own money and have been buying repeatedly for months-\n\nBin bags, hand towels, kitchen towels, sponges, dish soap, hand soap, toilet roll, kitchen roll, cloths, bleach, floor cleaner, disinfectant, kitchen cleaners, bathroom cleaner, clothes drying rack, washing powder, fabric softener, toothpaste, mouth wash, face cloths, face cleanser, shaving foam, shampoo/conditioner, body wash. Also, every single one of my dishes, pots, pans, glasses and utensils which they so love to use and never clean. \n\nOur flat is now barren. I’m going away this weekend and locking my bedroom door. I’m currently sitting in my bed looking at everything on my desk and listening to them going to the bathrooms knowing they have no toilet roll or hand soap, smiling at my little petty victory. If they need anything they can buy it themselves for once.",
        "created_utc": 1676600906,
        "upvote_ratio": 1.0
    },
    {
        "title": "Help me get revenge",
        "author": "Additional-Method855",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/1147sts/help_me_get_revenge/",
        "text": "[removed]",
        "created_utc": 1676599459,
        "upvote_ratio": 1.0
    },
    {
        "title": "Stinky surprise",
        "author": "_lucidL",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/1147raz/stinky_surprise/",
        "text": "My coworker told my boss I have body Oder which led to a very uncomfortable conversation that still haunts me to this day. Coworker and I have a falling out between us and a new lifelong fear has been unlocked for me. I have worked at the company for 8 years and nobody once thought to tell me that I smell bad? This particular coworker smokes cigarettes so I don’t know how they even have grounds to say I smell offensive but I digress. \n\nThis coworker is out of town for a few days so I put one of my dirty socks in their desk drawer. I remove the sock before they return effectively leaving a lingering but untraceable mark.",
        "created_utc": 1676599330,
        "upvote_ratio": 1.0
    },
    {
        "title": "Unwanted \"Throuple\"",
        "author": "kirstywh",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/1145c8t/unwanted_throuple/",
        "text": "Hope this is allowed here and also hope its enjoyed because its a TLDR sorry!!\n\nSo this isn't MY petty revenge story, the best ive ever managed is going onto my ex boyfriends netflix account after he cheated on me and messing up algorithms/suggested movies by liking a bunch of crappy rom-coms. HOWEVER, I have a petty revenge story that my friend did, that has always made me cackle in delight because its the most insanely crazy and extreme level of revenge I've ever witnessed in real life.\n\nSo, my friends grandfather died, she was very close with him and he left her £25,000. She and her boyfriend decided to buy a house together with it because they'd been together 3 years at that point and had a 1 year old daughter.  My friend and her boyfriend apparently talked about it and because he couldnt afford to save anything for a deposit, he agreed that she pay the 25,000 deposit and then they'd get a joint mortgage for the remainder and HE would pay the first 2 years of mortgage repayments to make their contribution \"equal\".\n\nSo, fast forward 18 months, her daughter asks where daddies friend is and my friend finds out the BF had been having an affair for about a year AND bringing the other woman TO THEIR HOUSE while my friend worked (shes a nurse so does shifts including nights), WHILST THEIR DAUGHTER WAS HOME.\n\nObviously my friend was devastated and very angry and looking back or \"logically\" now, she should have kicked him to the curb outside but instead, because she knew he had brought this woman into their home etc, she was the one to pack a bag and leave with their daughter back to her mothers house.\n\nBy the time she had \"recovered\" a few weeks later, and obviously the reality of the situation had set in, she immediately told him they had to sell the house because she wanted her investment back (the 25K deposit she had paid). Because he really was an absolute leech/loser of a man, he had never been the sole payer of the mortgage repayments either like they had agreed when purchasing the house, as his way to \"make up for\" not contributing anything to the deposit. He had only paid the monthly mortgage amount out of his wage only for about 3 or 4 months before they ended up just splitting all bills equally because it's obviously just easier.\n\nHe informs her at that point he's already moved his girlfriend in...the girl he cheated on her with...and the only thing she can do is \"Buy him out\" of his half cause he wasn't moving otherwise.\nHe also threatened her, that she had no legal leg to stand on if she \"expected\" a bigger share of the house sale because of her much bigger contribution via the deposit because it wasnt documented, and so she shouldn't expect much money back anyway even if she could make him sell because \"he was entitled to 50-50\".\n\nMy friends response?\n\nShe waited for her next mid week day off work, waited for the time when she knew her scummy ex and his new girlfriend would leave for work and got her family and a van to move a bed, wardrobe etc into the second bedroom of the house which had been just her daughters room at the time.\n\nShe said when him and his girlfriend walked in that evening to find her and their daughter sitting on the sofa watching TV they looked like their brains exploded.\nHow she managed to live in that house for A MONTH with her ex and his mistress/girlfriend and not blow up is beyond me! She even said she actually enjoyed keeping her calm and acting as if they weren't there while they just got more and more uncomfortable and awkward living there till they eventually did give in and leave. 🤣\n\nShe is forever a legend in my eyes.\n\nThe absolute ULTIMATE petty revenge is moving back in to your family home where you scumbag ex has moved his girlfriend in thinking he's won. 🤣",
        "created_utc": 1676592354,
        "upvote_ratio": 1.0
    },
    {
        "title": "Am I taking This Petty Revenge to Far?",
        "author": "drop4obvious",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/11455s7/am_i_taking_this_petty_revenge_to_far/",
        "text": "[removed]",
        "created_utc": 1676591884,
        "upvote_ratio": 1.0
    },
    {
        "title": "Time to do the Caramelldansen!",
        "author": "Rawr_in_Here",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/11452xn/time_to_do_the_caramelldansen/",
        "text": "I live in some VERY crappy apartments where I have to share a bathroom with the room next door. In the past, I have tried being a good neighbor by talking with them in person, writing them a letter that included my phone number, and even politely knocking on the door to ask for them to turn down their music with please/thank you. \n\nThey have responded with various forms of harassment but not actually talking to me. I don’t know WHY they are angry and I am rather uncomfortable/afraid now as their unexplained actions are just so unfathomable to me. I told management and they stopped. \n\nHowever, they still do annoying things like play their music loudly while in the shower, take showers together (they are a couple), and having loud phone conversations while they are on (or at least nearby) the toilet. I can hear ALL of this because we share the bathroom and my crappy apartment has nowhere else for me to go to. \n\nI just play music really loudly whenever they do this stuff. My favorite go-to song is “Caramelldansen,” as I find it upbeat/have fond memories of dancing to it during middle school. I also enjoy the anime opening “Lucky Star” for the same reasons. (No, I will NOT use “Baby Shark,” because my niblings have made me hate this song.)\n\nIt almost always seems to get them out of the bathroom faster and I don’t play it if they’re just doing their business without these extra noises. I only do it if they bring these outside factors in. I even avoid it when they randomly shower at 3/4 in the morning, because (even though it wakes me up and makes me rage) I’m not going to begrudging someone that might just be getting ready for work. \n\nAs always with these types of revenge, please feel free to suggest your own music if you would like.",
        "created_utc": 1676591667,
        "upvote_ratio": 1.0
    },
    {
        "title": "Ex and her friend lied about me so I got them suspended.",
        "author": "PymIndustries",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/1140zvs/ex_and_her_friend_lied_about_me_so_i_got_them/",
        "text": "Last year on February, I was dumped by my GF. We didn't really have the best relationship, so I didn't mind, although I was irked my ex didn't have the guts to least text me about the breakup and instead someone else tell me.\n\nThe next week, one of my friends and I were talking on Discord, and she sent me a picture of a message my ex had sent her talking about me being mentally abusive, transphobic, etc. My ex had been trans, which I was fine with, but I was not fine with her calling herself things like \"America\" and \"Israel\" as \"man names\". Come to find out both her and a friend have been telling MY friends all this.\n\nNext month, in March, my ex's friend was flaunting a doc in my face regarding several lies about me, telling me to stop trying to stop them or else she would show it to the principal. Luckily, I had friends, so I had one who was intigrated in my ex's friend group send me the doc. I was disgusted when I saw that it had lies regarding transphobia, death threats, supporting the suicide of an 8th-grader who had died recently, TELLING him to do so, and not pronouncing pronouns (again, fine with that, but please use normal ones like they, him, her, etc., instead of neo/clown. Bruh.). \n\nAs soon as I got access, I immediately notified the principal about the doc and sent them photos and edit access. I then talked with the vice-principal in the office about it. They were going to call the two down, but the friend had come with the computer after my friend gave me access to show them everything (and because I had purposefully gotten in a yell fight with her) and was caught dead ass. The friend and the ex both got suspended for being creators of the doc, but the friend got the longer time in since she literally got caught red-handed.\n\nStill don't think 3 days-4 days in ISS makes up for that, but they definitely left me alone and stopped spreading rumors to my friends after that. I did lose a friend but pretty much all of the others didn't believe her/their crap.",
        "created_utc": 1676581326,
        "upvote_ratio": 1.0
    },
    {
        "title": "Take my seat and don't want to move? OK...enjoy your flight.",
        "author": "Smolame",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/1140xom/take_my_seat_and_dont_want_to_move_okenjoy_your/",
        "text": "This was a few weeks ago. \nI was flying to visit my best friend across the USA FL-CA. I get on and am in the back of the plane in an aisle seat 23C. Upon arrival I see a 20 something (f) sitting in my seat so I point out \"Hey sorry you are probably in the wrong seat\" and show her my ticket. With an eye roll that could have sounded like she was playing Yahtzee she says \"oh I'm 24C.\" I look at 24C right behind her and see why she took my seat. There is a 300-400lb (f) sitting in the middle seat. I'm a 6'1 230lb (m) ...not ideal. After a 15 second stare down I say \"well?\" and she says she is 'comfortable already' and 'not moving' and 'wants to sleep' blah blah. \n\nOK I see how it is....real dumb to put someone upset with you in the seat behind you...\n\nI proceeded to set a silent timer on my phone that went off every two minutes to remind myself to kick her seat, violently, and then every time the seat belt sign went off I'd get up, grabbing the top of the seat to lift myself up pulling her seat back and forth and one time (accidental but worth) pulled her hair she put over the back of the seat. \nSafe to say she had lots of extra 'turbulence' and got absolutely no sleep. There were MANY death stares and head turns. Each time I would just smile and wave. I knew she wouldn't say anything either because she is not even supposed to be in that seat anyways. Happy travels.",
        "created_utc": 1676581184,
        "upvote_ratio": 1.0
    },
    {
        "title": "Lazy construction manager gets the runaround",
        "author": "redditmodsthroat",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/1140le8/lazy_construction_manager_gets_the_runaround/",
        "text": "I was working on a project that was funded by the county, they assigned a site manager to direct and assess the job. He wasn't completely incompetent but he was exceptionally lazy and always looking for a scape goat. He routinely was NOT on site as he was supposed to be, and instead assigned a young guy as his \"proxy.\" I watched him doing side projects with county equipment and materials but just let it go. \n\nOne day I noticed a huge error with the survey and location for the next units. This clown starts screaming at me over the phone to: \"just do it! You don't know what you're talking about.\" I refused and since he wasn't there, sent everyone on the team home. The next day he shows up late and after getting in my face I calmly told him I would be happy to build it on the neighbors property if that's what he wanted. After checking the survey markings he quietly slinked off and told his proxy we should go home until the survey crew returns. \n\nFrom this point forward he had a huge issue with me, always looking for something to blame me for. It all culminated on a day we were pouring foundation walls. He checked the walls and said everything was good to go, I asked if he checked that they were plumb and got an earful about minding my business. The next morning I walked up to a section of wall and held a level against it... It was way off. It leaned 15cm inward at the top of the wall. Suddenly he starts screaming that I had built everything wrong, calling me names etc. I had enough and got in his face calling him a lazy incompetent fuck. He got scared and left for the day. He eventually had this epiphany that it wasn't a big deal at all and he could easily fix it. His botched attempt failed and spilled half a truck worth of concrete. That was the final straw for me, I told him to shut the fuck up and go away. I Instructed the crew to no longer answer to him and we're doing it MY way. The third pour went perfectly and I took the time to measure all my work and found the error in the wall. The ONE thing he had been working on with his proxy, a simple support beam hadn't been attached properly and let the wall lean.\n\nAfter that he was basically afraid of me and showed up maybe once a week... Which I documented very thoroughly. I set a meeting with the county project manager and asked him amazing questions like: \"how much materials did he pay for on these side projects he was doing\" [show picture of him pouring concrete] Did he inform you the one foundation wall is 15cm off and needed to be poured 2x more? Is it normal for a site manager to work from home 75% of the time?\n\nHis contract was somehow not renewed. About a year later he walks into the office of an employment agency with a really nice resume. What he didn't know was my wife was the manager. She had her employee set a meeting with him about a great job opportunity. I wish I had seen the look on his face when she informed him it was working for her husband \"you may know him, he also worked on that county project\".\n\nGet fucked dude.",
        "created_utc": 1676580300,
        "upvote_ratio": 1.0
    },
    {
        "title": "Husband couldn’t keep up with my sex drive so I can’t keep up with his personal care",
        "author": "SangerAnger",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/11407ys/husband_couldnt_keep_up_with_my_sex_drive_so_i/",
        "text": "[removed]",
        "created_utc": 1676579339,
        "upvote_ratio": 1.0
    },
    {
        "title": "I made my best friend's bully rethink everything",
        "author": "suzuyagabbs",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/113zkg2/i_made_my_best_friends_bully_rethink_everything/",
        "text": "For some context, me and my entire friend group have had problems with bullies at our high school ever since we could remember, but we mostly ignored the problem all together. \n\nAbout a few months ago, Ali, one of the girls that always bullied us decided to directly target my closest friend, Dee. It wasn't just some simple off-hand comments, it was a entire Instagram page created to body shame and consistently bully Dee. First it was comparing her to a whale, then posting unsolicited photos of Dee without her even knowing. Ali kept posting and posting and never seemed to stop. Whenever Dee would see the account and what was in it she would burst into tears, I hated seeing my best friend feel like absolute shit because of some pathetic girl. \n\nI knew Dee didn't deserve any of it, she's one of the nicest and honest people I've ever met, she helps anyone without even questioning it. I decided to do something about the page, about Ali altogether. My friend group went around the school asking every person who we knew was close to Ali or at least was considered to be friends with her about things she had done in the past. I uncovered a lot of dirt on her, her friends weren't ashamed of what they were doing or what they had done, they just had never revealed it directly, but they would take any chance to brag about it and be like Regina George wannabes, I finally had proof that Ali was the one running the page bullying Dee. One of her friends felt bad about it and sent me pictures that showed Ali was the creator of the page. I told everything to our school counselor. She contacted Ali herself and got her to take the page down. She had to do over 100 hours of community time after the counselor found out. \n\nI decided to reveal what Ali and her friends had done, I revealed it to my classroom, sharing secrets with a bunch of teenagers and it spreading was the one thing I knew would happen, so I just let it. By the end of the school year, almost everyone knew what Ali had done, almost no one wanted to interact with her, or even look at her, the only time anyone would interact with her was to make off-hand comments or look at her weirdly. She felt so ignored that she ended up moving out of town altogether, not before without picking a fight with me about how my friend group ruined her life, about how it was our fault her boyfriend wanted nothing to do with her, about how we were childish and could've just solved the problem by talking to her, I told her I didn't feel bad about it, I didn't understand why she would direct the page at Dee in the first place. Ali just told me she was bored, and Dee was already antisocial so only our friend group would care about the page. Her parents hadn't even known about the entire situation, I found her mom's Instagram and sent her all the proof of what her daughter had done. Her mom grounded her and took away all her privileges, phone, car, everything. She left the school a while after that, I don't know what happened after she moved since It's been around a year since it happened but I can't say I'll ever regret what I did",
        "created_utc": 1676577640,
        "upvote_ratio": 1.0
    },
    {
        "title": "Damn pocket calls",
        "author": "Any-Village5468",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/113xk1m/damn_pocket_calls/",
        "text": "[removed]",
        "created_utc": 1676572503,
        "upvote_ratio": 1.0
    },
    {
        "title": "Sent pregnancy test receipt to ex’s dad on his birthday",
        "author": "whizewhan",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/113x3e0/sent_pregnancy_test_receipt_to_exs_dad_on_his/",
        "text": "This happened awhile ago, but back in college I was dating this girl and her strict conservative parents didn’t like me because of all things, I had a tattoo….. it wasn’t anything disrespectful or weird, just a symbol from a triathlon race I had competed in and her parents saw it when they came to a swim meet that we were both in (it was a small school where both the men and women competed at the same time). \n\nThis got our once close relationship onto a rocky path, and the nail in the coffin was when I openly questioned the motivations behind her high school swim coach inviting her to stay with him for the summer. Which in retrospect the coach had clearly been grooming her. \n\nShortly afterwards we broke up, and just a few days later she started sleeping with my team rival. It was small school and a close team, so it was very personal. She gave me a response of “what are you going to do about it?” \n\nAt first there wasn’t a whole lot I could do about it until soon after I looked in my wallet and realized I still had a receipt from the pregnancy test she had taken. We had a scare about a month prior and even though she paid for it with her debit card she wanted me to keep the receipt (I don’t remember why but that was her idea) which clearly stated her name and the purchased pregnancy test. \n\nSo the next day when she was being an asshole again at practice I decided to send it home to her conservative asshole parents. I wrote “do you know what an ept test is? L___l does…” \n\nIt wasn’t on purpose, but the letter and receipt arrived when she was home for her dads birthday 🥳",
        "created_utc": 1676571308,
        "upvote_ratio": 1.0
    }
]