[
    {
        "title": "I Poured Water On Someone I Used To Be Freinds With",
        "author": "ameliexxxx",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/10n7ui9/i_poured_water_on_someone_i_used_to_be_freinds/",
        "text": "[removed]",
        "created_utc": 1674885925,
        "upvote_ratio": 1.0
    },
    {
        "title": "Goodreads War",
        "author": "Scary-Persimmon5564",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/10n716p/goodreads_war/",
        "text": "[removed]",
        "created_utc": 1674883118,
        "upvote_ratio": 1.0
    },
    {
        "title": "Tip your Server",
        "author": "Plastic-Comment5403",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/10n6xp1/tip_your_server/",
        "text": "This just happened 8 minutes ago\n\nI am sitting at a bar.  My particular has so happened to serve me at a couple places. I always tip above the expected norm in the States. \n\nA guy and \"his girl\" ask if anyone is sitting next to me.  I politely invited them and continue watching  the Warriors/Raptors game.  \n\nThey order their drinks, close out, and find another place to sit.  I noticed that the dude tipped my server NOTHING.  MInimum expects is 15%.  I call the waitress over and point out that shithead tipped her 0.0%.  I write in 20%, slide the receipt to her, and she kindly accepted.\n\nIf you're in the States, tip your server.",
        "created_utc": 1674882813,
        "upvote_ratio": 1.0
    },
    {
        "title": "Please Help Me Win an Argument",
        "author": "Scary-Persimmon5564",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/10n6bkq/please_help_me_win_an_argument/",
        "text": "[removed]",
        "created_utc": 1674880846,
        "upvote_ratio": 1.0
    },
    {
        "title": "So im not sure where this goes and may not necessarily be revenge but i think it fits",
        "author": "thebeastlybeast3",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/10n5rde/so_im_not_sure_where_this_goes_and_may_not/",
        "text": "A little back story: back in 2017 I did LSD fairly often as i liked to study philosophy while on it. Note i dont drive or do anything while on drugs. So at some point i get pulled over for speeding and cop says your court date is this day blah blah blah. So after that i get ahold of an attorney and he says he will represent me when we go to court , awesome . So after a couple months i completely forgot about the court day and the night before  i take some lsd to enjoy the weekend i had off and just explore. Well come the next morning my dad sends me a text at like 7am saying he is on his way to take me to court( my car got stolen and thats why im not driving, im 20 at this time) now of course i completely forgot and still fairly out of it as i just started the come down of the lsd. I dont say a word cause im FREAKING out because i can hardly think straight to make a simple conversation. Well i get inside the court house and text my lawyer and he responds telling me he is in another case but sent one of his other attorneys to represent me . Well she gets there and makes a deal with the DA/ Judge( i dont remember who) and i have to pay 300 something dollars but i got confused because i had completed this driver safety thing so it would not go on my record. Well i tell my day because at this point im pretty much sober and tells me that he will call the original lawyer.( maybe should have added family friend) well about a week or two goes bys and i finally heard back that she showed up to court drunk and got fired. I thought it was hilarious because i showed up tripping on acid .\n\n\nNot sure if this counts as petty revenge but i figure why not share the story . Alsoci do apologize for being vague but if you are wondering im in the midwest US",
        "created_utc": 1674879081,
        "upvote_ratio": 1.0
    },
    {
        "title": "suggestions for petty revenge?",
        "author": "gogo7891011",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/10n4ktx/suggestions_for_petty_revenge/",
        "text": "[removed]",
        "created_utc": 1674875539,
        "upvote_ratio": 1.0
    },
    {
        "title": "Don't destroy my sandcastle and you won't break your toe! It's that simple.",
        "author": "pretentious_hat",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/10n46dy/dont_destroy_my_sandcastle_and_you_wont_break/",
        "text": "I'm at a proper beach for the first time in decades and this story just came up in conversation. I totally forgot about it until today -- and thrilled there's a sub to share it with!\n\nI grew up in California but not close enough to beach to go there often, so it was a major treat for my brother and me. One summer when I was about 8 (which would have made my brother about 6 or 7) we were having a blast building sandcastles with our little plastic pails and shovels. We'd found a spot with just the right amount of moisture in the sand for maximum structural integrity. It had towers and a moat and everything. We were about to call our mom over look at it when this bigger kid - my age or a bit older - did a running jump into the middle of the castle. And he didn't stop there. He kept jumping around and kicking until it was totally leveled, laughing the whole time.\n\nI knew when it was pointless to object so I sat there silently while my little brother started crying until the kid finished his destruction and ran off. I hugged my brother and said we'd build another one. He said, tearfully, \"but he'll just kick it down again\". I looked around for a moment and saw a large, flat rock jutting up through the sand, about a foot high in my memory, and seemingly sunk very deep. I told him not to worry and immediately got to work coating the rock in a layer of wet sand. I don't know if my brother understood but we started rebuilding our masterpiece. \n\nWe didn't get very far before we saw Big Kid coming and moved out of his way. He did an elaborate spin-kick right into the rock and collapsed instantly with a scream, grabbing his foot. I don't remember him saying anything to us but just dragged himself up and limped away crying. Little brother and I repaired the damage to our castle and continued building happily.\n\nMy memory is hazy after this but I feel like I saw a woman, who I assumed was Big Kid's mother, arguing with my mom. Somehow I knew I wouldn't be in trouble so I didn't worry about it and she never even brought it up with us. I got my sense of poetic retribution from her.\n\nFin.",
        "created_utc": 1674874339,
        "upvote_ratio": 1.0
    },
    {
        "title": "AITA",
        "author": "MetalSwimming7308",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/10n34z4/aita/",
        "text": "[removed]",
        "created_utc": 1674871404,
        "upvote_ratio": 1.0
    },
    {
        "title": "Fire me after giving 2 weeks notice",
        "author": "Ha-Funny-Boy",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/10n1trv/fire_me_after_giving_2_weeks_notice/",
        "text": "[removed]",
        "created_utc": 1674867839,
        "upvote_ratio": 1.0
    },
    {
        "title": "Don't be Stupid Behind the Wheel of a Company Vehicle",
        "author": "TroublemakingB",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/10n18zr/dont_be_stupid_behind_the_wheel_of_a_company/",
        "text": "On my way to work one morning driving o the freeway and some poor planning asshole swerves over in front of me to catch the exit that, as it turns out, he didn't really need to take . \n\nI grumble and take the next exit, stay in the left-hand lane as I will be turning. It's a pretty long light and as I'm waiting here comes the idiot that cut me off. He stops just ahead of me and gestures that he wants in front. I shake my head, disbelieving, and mouth the words \"you cut me off,\" sort of pointing back. He gives me the finger then moves up and forces himself in front of someone else, needlessly since the middle lane had the option to turn left as well. We both caught the next light and I took the opportunity to write down the company name, phone number and license plate. \n\nWhen I arrived at work I called the number and spoke to a very nice lady and conveyed just how poorly their driver operated their vehicle, how unnecessary it had been to cut me off, how rude it was to shoot me the finger, and how stupid your employee must be to behave that way in a company vehicle. She thanked me very kindly and said it would certainly be investigated. Hope he learned that if you want to be stupid and an asshole don't do it in a vehicle with your boss's phone number on it.",
        "created_utc": 1674866313,
        "upvote_ratio": 1.0
    },
    {
        "title": "Who's the one getting hurt now?",
        "author": "RavenMemes",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/10n0u2h/whos_the_one_getting_hurt_now/",
        "text": "[removed]",
        "created_utc": 1674865245,
        "upvote_ratio": 1.0
    },
    {
        "title": "Motorhome wouldn't let vehicles pass, so I showed him how",
        "author": "Karma_1969",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/10mztaa/motorhome_wouldnt_let_vehicles_pass_so_i_showed/",
        "text": "[removed]",
        "created_utc": 1674862729,
        "upvote_ratio": 1.0
    },
    {
        "title": "Disgusting, lying granny.",
        "author": "sickboybaz",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/10mzljb/disgusting_lying_granny/",
        "text": "Apologies if this is long. Also it may need reposting if this isn't petty. I posted this as a comment on another post and people wanted more information.\n\nBack at the end of the 90s, I worked in a large store in the UK. Argos for the interested folk.\n\nI was working on the returns desk on Boxing Day. We had a policy where if we could see that we sold that item, we'd accept it as a return, with or without proof of purchase. \n\nThis lady came up to the desk with her husband,  both holding armfuls of toys,  Barbie toys to be precise. And there were 2 of everything. 2 of each doll, 2 cars, 2 planes, 2 horse and carriage sets etc. We were talking several hundred pounds worth of toys. \nOur rules in relation to returns were that anything over £65 had to be run by a manager to authorise. We also had to ask why they were returning the item(s). Bear in mind we would take anything back that we sell, in any condition, between 26th Dec and 10th Jan. \n\nThis is where the title comes from. The lady's [sic] response was \"my son, daughter-in-law, and twin 10 year old granddaughters were coming round to our house yesterday for Christmas lunch. Unfortunately on the way they were in a car crash and no-one survived\". \nNow, even the most cynical customer service worker would crumble at this, myself included. None of the toys had even been opened, all packaging intact. My manager also immediately approved the return. The lady handed me her card and I processed the refund. One thing about me is that I have a hell of a memory for names, and hers was one I would never forget.\n\nFast forward to 4 years later, and I'm working at a different location, same company. I happened to be helping on returns again, when in walked this lady, a younger man, and 2 very alive teenage twin granddaughters. I felt sick to the stomach as I realised she had used a lie that her family had been killed to get a refund on toys that we would have given her if she had even said \"they didn't like them\"\n\nFor her transaction she handed over her card, and I noticed a different name to the one I would never forget. Not even close - think Smith/Flanagan. A little known fact among retail workers is that we cam usually spot/stop card fraud. I asked if she had got married recently as the name is different to the one she had last time I served her. She said she'd been married 20+ years and just had cards in maiden and married name, which I knew was fraud. I decided to run checks on the card and called the card company (Capital One) who wholly agreed that this was a definite case of fraud. Whilst on the phone to Capital One, she attempted to get a colleague of mine to use her other card as she was in a hurry. Because I'd called and explained my reason for suspicion, they had stopped both cards, meaning she lost both cards in the space of 3 minutes. Back in those days if you stopped a card that had been reported as having been used fraudulently you got £50 as a 'reward' from the CC company.\nThus, this is the reason that I made £100 off of her and she never spoke to me again for the next 5 yeara that I was with the company. \n\nI have never, and will never, understand what led her to use the death of her entire family as the reason to return the toys. Who in their right mind uses that excuse, that they've lost their entire family, on Christmas Day no less, and decides that on Boxing Day they need to return all their presents to the shop they got them from.",
        "created_utc": 1674862195,
        "upvote_ratio": 1.0
    },
    {
        "title": "Spam Calls are Her Problem Now",
        "author": "BadMynx",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/10mzfvq/spam_calls_are_her_problem_now/",
        "text": "I've had my current cell number for about 4 years now. The entire time I've had it, I would receive 1-3 phone calls and/or text messages A DAY asking for a woman named (let's just say) Cheyenne. They always ask the same question, \"Is your property at (...) still available for sale?\" I kindly inform the caller that this individual no longer has this number and to have a nice day. Here we are 4 years into this. Why don't I just change my number? Because my child has this number committed to memory and at such a young age, it's important for her to know how to call mommy in an emergency since she's too young for a phone or may not have access to it when she's older.\n\nAfter all of these years I'm curious to know what this property looks like, so I Google it. Nothing fancy, just a run down shack of a house. Her name and my phone number are on the listing. I then ask myself, \"How many people have had my number\"? This phone and number were passed to me by my ex-brother-in-law when I urgently needed a working phone. I've since gotten a new phone but kept the number for the reason given above. I search my number and the first result is the name of the woman that all the phone calls and text messages are asking for. I select it and it pulls up her public profile along with every registered phone number and address she's had. I see her most recent phone number. I call it.\n\nShe answers and I explain that she has quite a few callers trying to reach me at my number to buy a house from her. She said she already sold the house. I asked her if it were possible to pull the listing down or at least change the contact information for it. She asks me to repeat my number and she says that she's never had that number before so she can't help me. I tell her that her public profile states that she had it in 2007 and it's on the listing. The woman tells me that it's not her problem and abruptly hangs up.\n\nThe very next caller that rang my phone received an apology for the confusion along with her current phone number for them to contact her directly. I haven't received a call or text since. I win.",
        "created_utc": 1674861804,
        "upvote_ratio": 1.0
    },
    {
        "title": "help",
        "author": "SpoopyPoopyCoopy",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/10mzbxy/help/",
        "text": "[removed]",
        "created_utc": 1674861545,
        "upvote_ratio": 1.0
    },
    {
        "title": "Petty revenge against corporate finance department.",
        "author": "thelastword4343",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/10mwwra/petty_revenge_against_corporate_finance_department/",
        "text": "So I work as a project manager for a small social business; we assist vulnerable people to obtain items they need.\nThere is a large organization, and we use one of their small trading arms to purchase and deliver items to the vulnerable people we work with. We receive invoices from their large corporate finance department for payment. \nAs project manager, part of my role includes checking all these invoices, making sure they match the order we sent out and setting up the schedule so that our finance officer can make the payments. You can guarantee in a batch of invoices there will be multiple mistakes and I have to send them back to be corrected! I keep meticulous notes! I know what has been paid, what hasn't and why!\nThis week I received an email with a zip file attached with 80 invoices inside and a rather abrupt email stating \"these invoices have not been paid, make payment within 7 days and forward remittance advice to avoid further action\"\nWell that pissed me off for starters! There was absolutely no way we had not paid 80 invoices!!! So doing my due diligence, I checked every single one just to be sure we hadn't missed any of them!  It took me all afternoon, which pissed me off more because I had other work to do! This was obviously due to them not doing data input and proper checks they needed to at their end...\nOut of 80 invoices, not one single one had been unpaid due to any issue at our end!\nI could have been nice and helpful, I could have pulled off just the information they required...\nBut instead I chose petty revenge!\nI asked my finance officer to pull off remittances for all invoices from them since April 1st 2022 talking 600+ list (bear in mind it doesn't list in invoice number order).\n\nDear Corporate,\nPlease be advised of the 80 invoices you have demanded payment for:\n-59 have been received and already paid\n-5 are not invoices intended for our company\n-11 are ones we have returned for corrections and not received back- please check previous emails \n- 5 are duplicates which have been paid under different invoice numbers!\nPlease ensure all relevant checks are completed before contacting us in the future, we are a small organisation and do not have the capacity to investigate invoices we have received, processed and paid correctly. \n\nI attached the 600+ list of remittances on a PDF (so they couldn't copy and sort) and sent the email!\n\n\nNow I could have been nice, and sent them the document I had worked on, telling them specifically which invoices had been paid, which ones had been returned for corrections and which ones were not ours.... But, they don't pay me and I'm not doing their work for them!\n\nThe pleasure I got from knowing they would have to actually do the same, if not more work than I had done, searching through the zip file and remittance list,  finding the 80 invoices, checking emails, checking for duplicates, ...well it was immense and very petty of me!",
        "created_utc": 1674855625,
        "upvote_ratio": 1.0
    },
    {
        "title": "Don't want to comply with our agreement? Then the party is over.",
        "author": "jippyzippylippy",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/10mvy7y/dont_want_to_comply_with_our_agreement_then_the/",
        "text": "Back in 2002 I had a retail business that was in a pretty huge space. A guy stopped in to ask if they could throw a salsa dance party there. I said \"Sure, give me a 100-dollars (I know, too cheap) and you can do your party. But you have to be done by 11:00 sharp, because this is a residential building on the 2nd floor.\" \n\nHe gave me the deposit a few days later and then the next week stopped by with his sound equipment/mixer board and set up for the party. He had one long, thick extension cord that everything was running off of. He asked for a set of keys and said he'd lock up when they were done, but I laughed let him know that there was no way I was not going to be there to close up since it was my business and there was merchandise there. He made a face, but was OK about it.\n\nI lowered the lights and he started up his light effects and low music. Then people started arriving around 7pm. Loud salsa music starts. People dancing, drinking, having fun. Probably a total of 40 people, maybe more at the height of the night. \n\nAt 10:45, I told the guy that they needed to start winding down things and clean up so I could get out of there at 11:00 like I had planned. He just looked at me from his DJ area and smiled and nodded. I went back to the office. 13 minutes later (yes, I was watching the clock) still music and dancing. So I went back to him and shouted over the music in his ear \"Look, this needs to end in 2 minutes or I'm going to catch hell from my landlord. Got it?\" He nodded and smiled again.\n\nAt 11:05, I gave him another warning. Still no action. Then at 11:10 my phone rang and the landlord (who lived above the space and was a total prick) started ragging on me about the music and said he'd evict me if it didn't stop. I said I understood and that it would stop immediately. \n\nWent to the back of the store, turned up the lights to full (which was extremely bright) and then unplugged the extension cord. Big \"Awwww\" from the crowd, but I didn't care. I got up on a counter and announced \"Your dance party was supposed to be over at 11, your host agreed to this. Everyone needs to leave\". The guy was PISSED. Again, didn't care. He packed up everything and carted it out while people were leaving. \n\nThen he came back in all butthurt and said that usually places would let them go an hour over and that I messed up his software by unplugging things. I said \"You agreed to 11:00. It's now 11:40, the people above us have kids that are trying to sleep. I gave you three warnings and all you did was smile at me like I was an idiot. You can leave now. Bye.\" Locked up the place and drove home and vowed to not rent the place out for parties any more in the future.",
        "created_utc": 1674853296,
        "upvote_ratio": 1.0
    },
    {
        "title": "She made my life a living hell",
        "author": "Nkotbfan613",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/10mvnd6/she_made_my_life_a_living_hell/",
        "text": "[removed]",
        "created_utc": 1674852554,
        "upvote_ratio": 1.0
    },
    {
        "title": "Help us to reach our goal to go SAE AeroDesign 2023 - RAMS Aerospace - Mexico",
        "author": "Fritzz433",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/10mvjf6/help_us_to_reach_our_goal_to_go_sae_aerodesign/",
        "text": "[removed]",
        "created_utc": 1674852286,
        "upvote_ratio": 1.0
    },
    {
        "title": "Co-worker wanted my job",
        "author": "6_8wyo",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/10muu11/coworker_wanted_my_job/",
        "text": "[removed]",
        "created_utc": 1674850556,
        "upvote_ratio": 1.0
    },
    {
        "title": "A guy pretends to be his lover. They are no longer lovers.",
        "author": "TheBigg3stFool",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/10muty5/a_guy_pretends_to_be_his_lover_they_are_no_longer/",
        "text": "[removed]",
        "created_utc": 1674850550,
        "upvote_ratio": 1.0
    },
    {
        "title": "Unprofessional boss's wife",
        "author": "reality-check-is-imp",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/10mumeo/unprofessional_bosss_wife/",
        "text": "[removed]",
        "created_utc": 1674850036,
        "upvote_ratio": 1.0
    },
    {
        "title": "Don't ever be late to the meetings, again",
        "author": "reality-check-is-imp",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/10mu1i6/dont_ever_be_late_to_the_meetings_again/",
        "text": "[removed]",
        "created_utc": 1674848666,
        "upvote_ratio": 1.0
    },
    {
        "title": "My dad makes us think we destroyed windows for 15 years",
        "author": "Pawneewafflesarelife",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/10mttck/my_dad_makes_us_think_we_destroyed_windows_for_15/",
        "text": "enjoy a journal entry of me reflecting on one of the most embarrassing moments of my life. The head-stuck-in-fence incident was worse but I only have sketches of that, not text. My dad played this well\n\nanyways\n\n────────\n\nMost don't know this about my father, but he was one of the first men in California to win joint custody after a divorce. He went in swinging and came out with the dubious victory of taking care of me and my sister for half of his waking days – while precedent-setting, I do sometimes wonder if he ever regretted his choice. I doubt he did, though, for my dad was the type of person who committed to things, despite the consequences.\n\nThey chose custody dates like one would members for a dodgeball team – Saturday was especially coveted and my dad dived with his first pick for that day. My mom countered with a Sunday. Soon, the entire roster was filled: Monday at mom's, Tuesday and Wednesday at dad's, Thursday mom, Saturday dad, Sunday mom...oh, but Friday? Friday was special. Friday they split.\n\nEvery other Friday our dad would have off work, so he'd wait for us after school. My sister was in elementary school, so she was done an hour before me. The two would wait at Mister Frosty's – she would have rainbow sprinkles and he a chocolate dip while they waited for seventh period to let out. I'd race out of history, usually my favorite, but far-forgotten in the furor of off-Fridays. Off-Fridays meant trips and adventure and excitement. Off-Fridays were our time with dad.\n\nAnd off we would go, the Thomas Brother's map in my lap and my sister bouncing in excitement in the back of the pickup's cab. \n\n“Let's go to the desert today,” my dad might say, and my fat little twelve-year-old finger would thumb through the maps to the right one, tracing out a route for us. “Highway eight, east,” I'd say and we'd be off, Pink Floyd wailing as he'd snake a route through mountain roads to go visit the apple town of Julian, or past emu farms to watch animals at dusk at the safari park, or down along the bay and beach to go roller blading on the boardwalk at sunset. Sometimes we wouldn't go anywhere at all, and would instead head to Point Loma for a dinner at the Venetian – my sister would order cheese bread and I'd pretend to be an adult, trying something new off the Italian restaurant's entrees section each week.\n\nPerhaps that last option was exercised too much – at the least, there's no doubt in the family history library that both myself and my sister carry the blame for our most infamous moment at that restaurant. In our defense, our trio had been going there for years. The two of us had grown....comfortable. Still, we have yet to fully live down what we did...\n\nOnce, long ago, the Venetian had a lovely waiting area, complete with window seats – the windows were frosted glass. This detail is important. Now, my sister and I? We weren't the worst children in the world. We weren't savages, for the most part. I often fancied myself as some grand princess in a fantasy novel. My sister was adorable and sweet and mostly only ate cheese for the relevant years for this story. However, we were CREATIVE and creative leads to boredom at an alarming rate. We were the type of children who held photo shoots and made movies. Waiting to be seated for dinner was a hurdle we could easily overcome.\n\nOur dad went to the bathroom. \n\nIn our defense, this was an amateur mistake on his part, and I would suggest my sister and I are thus, at the most, only fifty percent culpable for what happened next. Many a war has been lost to the bladder's calling and this was no exception. Once again, let me set the scene: a waiting room, pleather benches stiff, stern and cruel. Two children hungry and bored and CREATIVE. Again, I must emphasize that we were creative children. With that forewarning, my father's trip to the bathroom becomes a starkly terrifying decision, the kind you scream at characters not to make in horror movies.\n\nHe left.\n\nFree from our non-existent shackles, my sister and I gleefully revolted. At first, we just bounced on the pleather cushions – they were quite bouncy – but soon we felt the need for more. The frosted windows beckoned.\n\nI licked my finger and pressed it to the glass. A beautiful, soft remnant was left behind, the print of my touch ghosted across the glass in a vague blur. \n\n“Oh!” I murmured, delighted by this new revelation. “Look, we can leave marks!”\n\nThis was the beginning of the end.\n\nI began to paint, licking my finger and swooping it across the glass in wide streaks. I sketched out little clouds, a happy sun, even swaying flowers...and then I turned to my sister. Six years younger, she had no chance.\n\n“You should lick the glass,” I whispered with a giggle.\n\nShe giggled back and immediately did so, leaving behind a blurry, wet blob across the frosted glass. We both found this incredibly amusing and began the pepper the plexi with pecks and slobber. This is when my dad returned.\n\nHe said nothing – he never needed to. My father was a mild-mannered man, so as soon as he cleared his throat in JUST the right way, we both knew we had fucked up. And he cleared his throat. Shit.\n\nWe smiled and fidgeted. Maybe he wouldn't notice? He said nothing. That was worse than punishment – only on the worst offenses would he say nothing at all, letting us simmer in our own guilt. This was one of those offenses and boy did we simmer.\n\nHe let us stew for a week – an entire week! - before he relented, finally taking us back to the restaurant...but we weren't coming to eat. Instead, he asked to speak to management. It was a family-owned place, so Joey, the owner's son, came out. Joey's known both of us since we're small; he grinned the moment he saw our woebegone attempts to avoid his eyes. He knew what we were there for.\n\nWe had destroyed their windows! They had had to put in entirely new windows! We had messed up BIG TIME.\n\n“I think my girls have something to say,” my dad said, eyebrows raising as he looked to us. We had no words, and blushes and tears were all that could be wrung out of us at first. Finally, eventually, after stern coaxing and much shame, we confessed our crime – we had destroyed the windows! We had painted them! We were the rogue kissers!\n\nJoey just grinned and winked at my dad and then sat us at our usual booth, vanishing for a moment before returning with a beer. “Veal Parmesan?” he asked my dad and my father nodded, mirroring Joey's grin. Justice had been served, and a veal parmesan was next on the menu.\n\nWe learned many years later how frosted glass actually works. \n\nTl;dr: sister and I messed around with frosted glass to \"paint\" on it. Father let us believe we had permanently altered the glass.",
        "created_utc": 1674848127,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to get back to stealing neighbors?",
        "author": "Artistic-Throat8754",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/10mtn16/how_to_get_back_to_stealing_neighbors/",
        "text": "[removed]",
        "created_utc": 1674847728,
        "upvote_ratio": 1.0
    },
    {
        "title": "Yellow flashers do not make you an emergency vehicle.",
        "author": "insidemyvoice",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/10mt98g/yellow_flashers_do_not_make_you_an_emergency/",
        "text": "I was leaving work yesterday. I pulled out of our parking lot and made it about 200 yards down the road when a pickup truck zoomed up behind me with flashing lights. My first impulse was to pull over an let him pass when I realized those are yellow \"construction zone\" lights. The yellow lights are intended for use when workers are working near a road or other area the requires caution and your attention. They are not intended for driving in traffic. \n\nHe got right up on my back bumper, goosing me. We made a right turn at a light I noticed the logo of a private company on the side of his truck. He wasn't even Department of Transportation. Then it dawned on me, it's after 5 o'clock and this douche is using those lights because he's in a hurry to get home and trying to intimidate people in to moving out of his way. Nope, not today, the closer he got the slower I drove. When he was inches away from my rear bumper I pulled out my phone and pretended to film him. When he noticed he backed way off and turned into a side road. A few seconds later I saw him pull back out on the road, this time without the yellow flashers.",
        "created_utc": 1674846843,
        "upvote_ratio": 1.0
    },
    {
        "title": "Toot in my cube? Faint fart never won fair maiden.",
        "author": "xboxgamer2122",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/10msz5x/toot_in_my_cube_faint_fart_never_won_fair_maiden/",
        "text": "I worked with a guy (Karl) who was a nice guy, but could be a total neanderthal at times. He would walk into his friend's cubicles when they weren't there, slip out a fart, and quickly leave. He had some digestive issues and it would sometimes reek for quite a while. We had a new hire from college assigned to our department, and she was a very attractive woman; drop dead gorgeous. She came into my cubicle to drop off something I had sent to the printer while I was out letting the cube fumigate, and as I walked back in I said, \"That wasn't me.\" It happened again, and this time she responded to my denial; she laughed and told me her brothers always blamed the dog for that exact same thing, but it was OK, she was used to being around guys. \n\nGiven that she really didn't believe me, I felt it necessary to tell her who was responsible, and her voice grew very quiet as she informed me that Karl had asked her out for a drink after work. She really wasn't interested, and he had asked her out again. Twice in fact, and she was getting a bit irritated that he wouldn't take no for an answer. \n\nA few days later she saw him entering my cube, and quietly followed him, standing in the doorway about two feet behind him while he farted quite loudly. He was giggling as he turned around to leave, but that stopped abruptly when he realized he'd basically farted in her general direction (to use a Monty Python term). She confessed to me later that day that she was waiting to catch him in the act hoping that would stop him from pursuing her. When he turned around she said she just shook her head and walked away without saying a word. I told a few people and word spread quickly. He never asked her out again.",
        "created_utc": 1674846216,
        "upvote_ratio": 1.0
    },
    {
        "title": "HELP!! Help me scam a scammer",
        "author": "PrestigiousGolf8652",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/10msymm/help_help_me_scam_a_scammer/",
        "text": "[removed]",
        "created_utc": 1674846180,
        "upvote_ratio": 1.0
    },
    {
        "title": "Terrible manager can’t find the smell after trying to steal $4,000 from me.",
        "author": "BargleFlargen",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/10mqoap/terrible_manager_cant_find_the_smell_after_trying/",
        "text": "I worked at a National restaurant chain with a GM that was a turd. He consistently lied about everything, lied about bonuses, lied about benefits, etc. all the fucking time. I quit after he told me that I owed the company over $4,000 in insurance premiums. \n\nThe offer for management was 0% employee contribution, but we got to the middle of the year and the budget was not looking good. We were losing employees and customers at an alarming rate, but the GM would not change food order quantities because “we need to be ready when we bounce back!” and food cost went through the roof. \n\nI came to work and he said “I have bad news. We looked at benefits and insurance will no longer be company funded as of Jan 1st.”\n\n“Jan 1, next year?”\n\n“No, this year.”\n\n“Ok, we’ll then I’ll cancel it and just stay on my wife’s insurance. I only took it because it was free to me and would help with copays and coverage gaps.”\n\n“That’s fine, but we still will be collecting the past due premiums to the start of this year.”\n\n“You can’t do that.”\n\n“Actually, we can!” [fucking smirk]\n\nI left for the day, seethed in violent anger, and went to the grocery store on my way back in. \n\n#Cue revenge. \n\nWe had a weird desk drawer that did not go all the way to the back of the desk. It was a modified counter top and the drawers were not the full depth of the counter. One drawer had a file cabinet under it. I bought a can of sardines in mustard sauce, took off the lid, and sneaked it onto the file cabinet behind the drawer. \n\nThen, I handed him my keys and quit on the spot, with a warning that if he tried to garnish my last paycheck, it will mean trouble for you assholes, beware!\n\nThis was 2002. LAST WEEK I was at a bar and the manager was a former coworker from ShitHole Restaurant Inc. She said that after several days, the smell was so bad that the managers had to start doing their work at a booth, because no one could stand to be in there. Ultimately, they decided a rat had died in the wall and brought in remediation experts to start tearing open walls. After just a few minutes, they came out with the nastiest, oldest, grossest wad of biomass and said “here’s your problem”\n\nThe file cabinet had to be replaced as it was wooden and the stink juice had soaked into it. She asked if I remembered that smell that started just before I quit, but I had no memory of it. \n\n#fuck that guy",
        "created_utc": 1674840773,
        "upvote_ratio": 1.0
    },
    {
        "title": "Ambien Walrus in the land of Oz",
        "author": "Obvious_Whereas4895",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/10mq1ft/ambien_walrus_in_the_land_of_oz/",
        "text": "[removed]",
        "created_utc": 1674839251,
        "upvote_ratio": 1.0
    },
    {
        "title": "Boomer doesn't understand tech",
        "author": "PM_Georgia_Okeefe",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/10mpg5a/boomer_doesnt_understand_tech/",
        "text": "This happened about 10 years ago. There was a Karen that had been with the company for nearly 15 years. Her title was \"Project Manager\", but she was really more of an office admin and various internal projects would get pushed to her. These were things to help improve how the office worked, but nothing critical. \n\nOne of these projects was actually deemed to be important and it was re-assigned to me. She hated this and stonewalled me all the time. It caused the project to be delayed, and I was getting crap from some of the executives because of this. When I commented that it was difficult to get information from Karen, she became super-sweet and said she was bending over backwards to help me, I didn't understand the project, etc. I powered through anyway. \n\nBut, then there was a round of layoffs and she was one of them. Due to her time with the company, she received a 3-month severance and extended benefits. It was weird, but the company essentially cut monthly severance checks instead of paying them out all at once. But, she also had to sign an NDA and non-disparagement agreement on the exit, as well as confirm that she had handed over all company materials and files. \n\nI went to go grab some files related to the project and everything was gone. Karen had deleted everything. This was before using things like Teams, Google Drive, etc. Everything was on a shared network drive, so it wasn't super easy to get the back up.\n\nBut Boomer Karen was the type that used her work email for all her personal accounts, including LinkedIn. It was also company policy that the emails of departed employees would be forwarded to their department heads for a few months. \n\nUsing this knowledge, I went to LinkedIn and sent a message. \"Hi Karen - I heard about your departure. I hope you can use the time to take the vacation you talked about. I went to grab some of the files but noticed they were missing. Do you have back ups you could share?\"\n\nWhen she responded, it also went to her old email, and thus to the department head. \"Don't pretend to be nice. I wouldn't be surprised if you helped me get fired. Good luck finding any of those files. I DELETED EVERYTHING. Screw you.\"\n\nWell, when that got forwarded to HR that she had put in writing that she had deleted everything it was determined that this violated the severance agreement. All severance checks were immediately stopped. \n\nOh, so sorry Boomer.",
        "created_utc": 1674837869,
        "upvote_ratio": 1.0
    },
    {
        "title": "Getting a call from a “Microsoft employee”…",
        "author": "Life-Love-Lemons",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/10mpchg/getting_a_call_from_a_microsoft_employee/",
        "text": "I can’t count how many times I have received bogus calls from fake MS employees. \nSo this guy calls me and I am sitting in my couch scrolling away on my Mac. I am very friendly to oblige him. He tells me to sit at my PC and open the computer. I tell him to hold on, put my phone on speaker and hold him for two minutes.\n“I am at my PC now, what do I do?”\nHey tells me to open Windows. I ask him to hold. A few minutes later I tell him: the ones downstairs are all open, and ask if he wants me to open the windows on the other floors too?\nI know how to waste someone’s time too, in the time he calls me he can’t talk  to a believing victim.",
        "created_utc": 1674837624,
        "upvote_ratio": 1.0
    },
    {
        "title": "stay petty",
        "author": "PikaThePichu",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/10moyh8/stay_petty/",
        "text": "[removed]",
        "created_utc": 1674836692,
        "upvote_ratio": 1.0
    },
    {
        "title": "THE SECRET OF LIFE",
        "author": "unityofreligions",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/10mosil/the_secret_of_life/",
        "text": "[removed]",
        "created_utc": 1674836274,
        "upvote_ratio": 1.0
    },
    {
        "title": "stay petty",
        "author": "PikaThePichu",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/10mn6qx/stay_petty/",
        "text": "[removed]",
        "created_utc": 1674832345,
        "upvote_ratio": 1.0
    },
    {
        "title": "Rez Tingz",
        "author": "BlissBrittany",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/10mkvbk/rez_tingz/",
        "text": "[removed]",
        "created_utc": 1674826282,
        "upvote_ratio": 1.0
    },
    {
        "title": "Work bully gets ignored",
        "author": "Fancy_Clerk9416",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/10mkkbe/work_bully_gets_ignored/",
        "text": "[removed]",
        "created_utc": 1674825379,
        "upvote_ratio": 1.0
    },
    {
        "title": "Won't put your rubbish in the bin? Enjoy living in filth.",
        "author": "Degen900",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/10mhj5v/wont_put_your_rubbish_in_the_bin_enjoy_living_in/",
        "text": "[removed]",
        "created_utc": 1674814620,
        "upvote_ratio": 1.0
    },
    {
        "title": "Steroids are bad for you as much as being nasty towards my friends.",
        "author": "Longjumping_Sky3706",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/10mge7b/steroids_are_bad_for_you_as_much_as_being_nasty/",
        "text": "So I had this boyfriend once... popular restaurant chef on the clock, gym fanatic reast of the day. \nOnly because we knew each other beforehand, he knew that i am a big supporter of LGBTQ community (as I am a part of it), and I knew of his ways to be fit.\nWe have set the boundaries. I was told not to have side relations with women, and I told him there's no space for steroids in this relationship. He agreed it's not healthy for him and promised he's done with it. \nIn the beginning, he showered me with beautiful bouquets of flowers. Being respectful towards my LGBTQ friends and everything seemed to work just fine. \nA few months passed, and I noticed his mood swings. He started to be extremely jealous over my female friend as he was paranoid that i am cheating on him with her. When I faced him with  my suspensions about him using steroids, he straight up lied to me and tried to turn the table by gaslighting me with stuff like, \"Oh, you're so pissed off because it's this time of the month?\" or \"Stop PMSing at me\" and straight up attacking my circle of friends for being supportive. There were more nasty things he did and said that time, but I don't want to go back to it. \nOne day, I did some chores around the house and found his steroid kit. I have packed his bags and left them outside my door. \nDon't worry, I haven't finished there.\nI was so angry, I ordered flower delivery straight to his busy and popular place of work (my trans friend worked for flower delivery company at the time so I could send an extra gift along with the flowers). I have emptied his steroid box and filled it in with different kinds of tampons and period pads, i also managed to fit in there a small packet of femfresh wet whipes. Of course, I didn't forget to leave a note for him as well. \nI HOPE YOUR MANGINA IS OK. TAKE CARE.\nFlowers along with the menstruation kit has been delivered by my friend in full drag by walking through a front door of a restaurant focusing everyones attention. My friend was showered with compliments on her looks and made sure whom this gift was for. My ex lost his shit on the spot and got sacked later on that day for his transphobic and homophobic comments.\nCherry on the top was the fact that my exes boss is gay🤣 😂",
        "created_utc": 1674809823,
        "upvote_ratio": 1.0
    },
    {
        "title": "Doggie Poop Bags Left In Common Area",
        "author": "tyronesnugget",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/10mg1wy/doggie_poop_bags_left_in_common_area/",
        "text": "[removed]",
        "created_utc": 1674808343,
        "upvote_ratio": 1.0
    },
    {
        "title": "Park in a private parking lot without permission? Win stupid prizes",
        "author": "icorrectotherpeople",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/10mdbhs/park_in_a_private_parking_lot_without_permission/",
        "text": "I manage a restaurant with an enclosed parking lot (rolling chain link gate with barbed wire, no way in or out when closed). We're a couple blocks from a sports stadium so during the game people like to park in our lot and walk to the game. We have \"customer parking only\" signs all over the place, and we try to enforce it but sometimes not as well as I'd like.\n\nAnyway, they had a late starting game recently on a day where we close early. I was the last one on site, doing my final walk through when a Mercedes SUV pulls in and parks in our lot. Group of 5 fans decked out in jerseys and hats etc get out and start walking off. I inform the driver that we're closed and they can't park there. Dude yells \"oh well!\" and they continue on their way.\n\nI didn't feel like waiting for a tow truck to come remove the car (usually takes up to 30 mins here, during game days when there is traffic). So I closed the gate and locked it like we always do.\n\nI have mobile access to our security cameras. They came back and lingered outside the fence for 30 mins before leaving. Car stayed in our lot overnight. I assume the driver came and got the car the next morning (we open 11am but gate is open for employees around 10am) because it was gone when I came in the afternoon.\n\nTL;DR guy messed up his and his friends night by parking in the parking lot of a closed restaurant.",
        "created_utc": 1674797857,
        "upvote_ratio": 1.0
    },
    {
        "title": "Wasted a seller's time for wasting my time!",
        "author": "illuminix123",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/10mciqt/wasted_a_sellers_time_for_wasting_my_time/",
        "text": "I recently posted an ad up on a website for a used monitor that I was selling. I no longer needed it since I got a better one. I posted the ad up online for $250, and someone messages me a few days later asking if I was firm on the price. I replied with no, but I would like some of my money back since I paid more than $350 for it brand new. The buyer responded with,\n\n\"Are you willing to do $200? Come on bro, it's all the birthday money I have saved up, and this is for my dad.\" Since this was more than 50% what I paid for, I agreed and told him to come ASAP. Note, I was outside during this time so I had to rush home and get everything ready. He told me he wanted to see if the monitor worked so I told him sure, come inside for a few minutes, I will have the monitor set up in my living room so he can rest assured it works perfectly fine.\n\nHe replied \"Sure, I will be leaving shortly\". 15 minutes go by and I asked him if he has an ETA since he lives in my neighbourhood (same 3 digits of their postal code), so it shouldn't take more than 10 a minutes drive. Nothing. 30 mins go by, still nothing. An hour goes by and I text him \"the deal is off, have a great day\". \n\nMind you, I have two accounts on the website, with two completely different emails. I've had the other account for more than 4 years now so when they check the profile, it will look really believable. I noticed this seller had a large Honda CRV engine up for sale... Bingo.\n\nI logged into my other account, and messaged him and what do you know? He responds! Jackpot. This engine weighs easily a few hundred lbs. Of course, I waited a few days before doing this or else it would seem suspicious. I peppered in some believable crap like I got work, I gotta get my truck ready, bunch of other hogwash I could think of. He was extremely intrigued.\n\nCut to the next day, I scheduled to meet him the next day at **7:45 am**, and the engine is covered with snow. I asked him if he can wake up early and brush the snow off so I can come by and load it up. I got the dude to wake up, go outside in below freezing weather, clean the snow off of an old engine, all in hopes of him making a few hundred bucks lol.",
        "created_utc": 1674795192,
        "upvote_ratio": 1.0
    },
    {
        "title": "Boycott Jacksonville Film Festival",
        "author": "Boycott_JFF",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/10mc3e0/boycott_jacksonville_film_festival/",
        "text": "[removed]",
        "created_utc": 1674793799,
        "upvote_ratio": 1.0
    },
    {
        "title": "Short and Sweet : Eviction Party Is Ove",
        "author": "sandwichartist08",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/10mbhmo/short_and_sweet_eviction_party_is_ove/",
        "text": "These kids were having an eviction party across the street on a Sunday night. I had to work in the morning and their bad music was still really loud at 2am. I walked over and let myself in. Knowing what I know about music gear, I just unplugged the mixer and the music went silent. Lights went on. Someone punched me. I yelled at everyone and stormed out. \n\nI didn't walk to my house but went to a neighbor's property (who is a cop) and then went home via the alley so as not to get fucked with.\n\nIt was quiet after that.",
        "created_utc": 1674791893,
        "upvote_ratio": 1.0
    },
    {
        "title": "Short and Sweet : Eviction Party Is Over",
        "author": "sandwichartist08",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/10mbg9o/short_and_sweet_eviction_party_is_over/",
        "text": "In van these kids were having an eviction party across the street on a Sunday night. I had to work in the morning and their bad music was still really loud at 2am. I walked over and let myself in. Knowing what I know about music gear, I just unplugged the mixer and the music went silent. Lights went on. Someone punched me. I yelled at everyone and stormed out. \n\nI didn't walk to my house but went to a neighbor's property (who is a cop) and then went home via the alley so as not to get fucked with.\n\nIt was quiet after that.",
        "created_utc": 1674791775,
        "upvote_ratio": 1.0
    },
    {
        "title": "No more snacks for you.",
        "author": "Zealousideal_Price55",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/10m8qns/no_more_snacks_for_you/",
        "text": "There was this girl in my class that literally was so obnoxious. She was a mouth-breather, and made such backhanded comments all the time. She felt like she was better than everyone and she would make sure you knew that's what she thought. \n\nAnyway, we had a seating chart made in our class and WHAT LUCK, I get to be next to her. ..\n\nShe used to eat these foul smelling peanut butter like cracker things, and always ate them in this class.  \n\nAnyway, I thought the only reasonable thing to do was to pretend to be allergic to peanuts. I made a huge ordeal about how I would literally die if she even remotely pulled them out of her bag. The teacher took note of this, and he lowkey knew I wasn't allergic but he didn't like her either so he told her she was no longer allowed to have snacks in the class.  \nShe always complained about how hungry she was and would look at me but I wouldn't let her know that it was all a facade, still haven't told her to this day.",
        "created_utc": 1674783677,
        "upvote_ratio": 1.0
    },
    {
        "title": "Glitter in the mail",
        "author": "lapsteelguitar",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/10m86ed/glitter_in_the_mail/",
        "text": "[removed]",
        "created_utc": 1674782007,
        "upvote_ratio": 1.0
    },
    {
        "title": "\"Call the cops\" he says",
        "author": "Patrickmonster",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/10m760p/call_the_cops_he_says/",
        "text": "There's a small parking lot next to my wife's salon. Only three spots at one end. These three spots are right up front and highly fought over because of the busy check cashing place nextdoor. \n\nI pull in to one of the three and get my kids and just as I'm putting my rig in reverse a guy pulls in with his little pickup truck and double parks right behind me. \n\nI pop out and give him a \"hey dude, wtf?\" And he tells me to \"call the cops\" as he walks into the check cashing place.\n\nMy rig has a pretty good turn radius so I was able to back out after a couple tries. As I pull along next to his truck I grabbed the bag of Doritos of the seat next to me and crunch it up real good and proceed to fling the tiny chips all over his truck. Bed, cab, and Hood tiny crumbs were everywhere. \n\nHe chooses this moment to pop out of the check cashing place and yells \"hey, I saw that!\"  \n\nI lean back out the window as I drove off and told him \"call the cops\" just as the first of the seagulls descended onto his truck.\n\nSure, not the best way to handle it. But this is r/pettyrevenge",
        "created_utc": 1674779111,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is your newspaper still wet?",
        "author": "Bondo_Wallace",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/10m72bm/is_your_newspaper_still_wet/",
        "text": "This happened about 7 years ago. My SO and I had recently moved to a new state and we ended up getting side jobs delivering newspapers. This was an overnight job, we'd get in around 11 or midnight, wait for the hulk delivery, grab our route print outs, go about stuffing the papers with the required advertisements and heading out by 2 and have the deliveries done by 6 or earlier. \n\nBeing new we ended up with the \"trail by fire\" route. A lot of out the way deliveries and a few with specific delivery instructions (like throw paper to the left of the car port not the right.) \n\nThis route had one customer we were warned about. No matter how much was done, at least 4 times a week they would call complaining about receiving a wet newspaper. Of course they get comped for the cost of the paper and every Sunday paper they got arrived wet. \n\nSo we start and first night get the complaint. Ok I wrap the paper twice with plastic bags, tieing each end to make it more waterproof. They complained again claimed the paper was tossed is a water puddle (it wasnt). I got up to triple bagging the paper and placing it on their doormat before I got word from my manager they were still complaining. Of course the owner refused to stop delivery to them because sometimes they paid which leaves the delivery person ends up with a complaint in their file.\n\nSo I decide one last attempt. I end up wrapping the newspaper six times in plastic bags, tieing off the ends, hanging it on the door handle, and snapping a picture proving how the paper was delivered. Making it practically impossible for the paper to get wet and proving where it was placed. The customer canceled their account claiming they never read the paper. Not very petty but maybe better than average.",
        "created_utc": 1674778823,
        "upvote_ratio": 1.0
    },
    {
        "title": "Don't want to discuss transition details during my two weeks notice? Don't be surprised if I don't want to do it after in exchange for a Big Mac.",
        "author": "BlueberryNo542",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/10m3npk/dont_want_to_discuss_transition_details_during_my/",
        "text": "[removed]",
        "created_utc": 1674769997,
        "upvote_ratio": 1.0
    },
    {
        "title": "Revenge for stealing my Blazin' Rewards",
        "author": "Onsyde",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/10lzqzt/revenge_for_stealing_my_blazin_rewards/",
        "text": "Never hack a BDE with too much time on their hands.  \n\n\nTwo nights ago my Buffalo Wild Wings account was hacked. Someone had spent thousands of points on a late night feast. There's nothing more precious to me than my Blazin' Rewards, so I took this personally. Because I got a series of emails saying my points were being redeemed, I was able to login momentarily to catch their cell phone number on my profile page.  \n\n\nI texted the number to provoke him a bit, telling him I knew the general area he is in and that he was sloppy for giving his number away so easily (in hindsight, this was a bad idea). He responded \"Yeah come by and say hey :)\". He also taunted me further by ordering a few gross items and DoorDashing them to my house using my account. Apparently he had that login as well.  \n\n\nAfter fixing that mess, and with some help, I was able to find out he probably used a burner phone which meant he could be anywhere. My next idea was to contact BWW support to see if I can trace the order to the location. They told me there is no master database but I can call an individual location to verify an order.  \n\n\nSo that's what I did, starting with Atlanta.  \n\n\nI was prepared to call every single location, but after the 3rd call I was able to confirm a canceled order with the info I gave him. I guess he was just too lazy to swap out the area code on the spoofed number? The manager told me they recently started requiring full identification for online orders before they pick up.  \n\n\nApparently he had given a first name but could not give any more info so he was not allowed to pick it up, and they canceled the order. The good news, I had a unique name now. The bad news, he was in Atlanta. However, there were only three people with that name that would be in logical ordering distance to that specific BWW location. One was a doctor, one was a head of product development, and the other was an \"IT entrepreneur\" (I wonder who it could be).  \n\n\nI texted the number back with his full name, telling him I reported him to the FBI, every spoof phone number company, and worse of all - every BWW in the Atlanta area.  \n\n\nHe gave a long explanation of how what he does actually doesn't hurt anyone because he just uses rewards points that can be refunded anyways, and that this is how he feeds his family.  \n\n\nI replied \"Get a job :)\"\n\n&amp;#x200B;\n\nNormally these kinds of crimes get unpunished because nobody has the time to track these people down to do something about it. Well unfortunately for this guy, I am extremely petty and extremely unemployed.",
        "created_utc": 1674760251,
        "upvote_ratio": 1.0
    },
    {
        "title": "Driving is fun",
        "author": "tonycheeks",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/10lzdff/driving_is_fun/",
        "text": "After reading someone’s last post, I thought I would share my own petty driving experience. \n\nI was on my way to work in the morning, maybe around 5:45 am. On my way to work, there is a speeding camera right before I turn. I am a bit of a speedster, but I don’t tend to go too excessive and I always slow down just enough and in time before the camera. \n\nI was starting to realize that I had to switch over to the next lane over so I can turn to work. The car over was going just the same speed as me. So to make it to the next lane, I decided to speed up a bit to pass him. The other driver maybe did not want that to happen so they sped up too so that I wouldn’t change lanes. \n\nSo my petty ass started to play with him. I start going a little faster and he was right beside me every step of the way. I noticed earlier that their license plate was from a different state, so they may not know about the abundance of cameras we had on our streets. \n\nRight before we got to the cameras, I slammed by breaks in just enough time where I was going the speed limit to the camera and they were going 15 plus! \n\nThe camera caught him. \nI laughed. \nAnd went to work. \n\nThat started my day off well. \n\nI know I’m a shit bag. But my humor is terrible.",
        "created_utc": 1674759343,
        "upvote_ratio": 1.0
    },
    {
        "title": "I need suggestions for revenge against my milk thief",
        "author": "EscapedSmoggy",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/10lvujz/i_need_suggestions_for_revenge_against_my_milk/",
        "text": "[removed]",
        "created_utc": 1674750535,
        "upvote_ratio": 1.0
    },
    {
        "title": "Hurt My Niece? You're Fired!",
        "author": "Explainer003",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/10luyx5/hurt_my_niece_youre_fired/",
        "text": "Cast:\n\nJ- My little cousin\n\nB- The nasty co-worker\n\nMe- OP\n\nL- My aunt, J's mom\n\nK- Mine and J's aunt\n\nDad- My dad\n\nS- My grandpa's eyes, ears, and voice for the company\n\nT- Mine and J's uncle\n\nG- The company accountant\n\nBackground: I (25) work for my father, two aunts, and three uncles. My aunt brings her daughter, J (10), into work after school and on holidays as she can't get a babysitter and my grandparents (Who own the majority of the company) aren't stable enough to take care of J.\n\nStory: Three years ago, my grandfather hired S as a general manager. S hired B from an employment agency to help L in the stockroom. At first, B was quite the employee, easy to get along with, and all in all, a great employee. Everyone, with the exception of Dad, wanted B to stay. My aunts and uncles brushed my dad's concerns off and paid off B's contract. That was the start of the decline.\n\nOver the years, B became more and more unbearable. Her entitlement increased and less and less people wanted anything to do with her. I began to avoid her like the plague myself. B was even starting to but into family business.\n\nLate 2022 came around. I began to ignore her antics. When she realized I wasn't falling to her demands and entitlement, she targeted J. The littlest things J would do (So kids stuff) sent B over the edge. B blamed her OCD for her outbursts. She screams at J for the smallest things. \n\nThe downfall began in Sept. 2022. I had offered to give L a break for a night and babysat J. J was excited as she didn't want to go to our grandparents place or go with L out for dinner. J was in L's office to grab a fidget toy and a few items for the night. B saw J and began to scream at her for \"Going through company property\".  I sighed and shook my head when J told me. I told J to ignore her and we went home.\n\nFlash forward to the beginning of January. B came storming into the office cussing and screaming, looking for J, who was in hiding in her fort that she made in Dad's office. I was talking to G about wiring parts when we heard it. G and I shrugged it off and kept talking. Later, I was telling K about what G and I heard when B came into the office and screamed at J. K and I both heard \"You F\\*cking C\\*\\*T!\" and other profanities thrown in J's direction. After B left the office, I ran back to check up on J, who was sobbing. I saw red after she told me what happened. I had my boxing gloves (I was at the gym earlier that morning and went straight to work from there) and was willing to risk jail time to avenge my little cousin. K, Dad, and L all had to stop me, telling me it wasn't worth it.\n\nYesterday was the day B placed the nail in the coffin. I was out on the shop floor cutting wires when the afternoon break buzzer went. B ran over to me and screamed at me for taking a sign down someone put up that I was given permission by K to take down as it wasn't authorized. I told B to shut up. Dad saw this and wanted answers. Dad can be protective of his siblings, but I think he wanted to go off on B and fire her for screaming at me, who often gets dragged into the drama.\n\nFinally, at quitting time, the hammer was laid down. J was getting ready to go play in the snow by B's bench as she didn't want to get ready in L's office. After the last family member left the stockroom (L was in the main office), B went off on J *AGAIN* saying that J's triggering her OCD. J said that OCD wasn't an excuse to be a jerk and J mentioned her FASD (J's adopted before you all go saying L's a bad mother). My one co-worker ran to get L, who sent G out to defuse the situation (G is like Ghandi). I was in the main office grabbing my phone from my desk. G brought J in, who was hyperventilating. I saw red. Through tears, J explained what happened.\n\nThe revenge: T was seeing red, along with Dad, K, L, and I. T first demanded to know where S was, wanting B fired. When S was nowhere to be found, T took matters into his own hands. He stormed out to the stockroom. In there, he shouted \"Pack your shit! You're done!\" I have never seen T so mad in my life.\n\nS in currently in the process of firing B officially. I'm sure you're all wondering why this is petty. Well, in my province, this level of harassment could land you in jail for up to 10 years. Let's just say B got off easy on this one.",
        "created_utc": 1674748341,
        "upvote_ratio": 1.0
    },
    {
        "title": "Laundry Revenge",
        "author": "Ratjar142",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/10luvzt/laundry_revenge/",
        "text": "I live in an apartment building with a common laundry room. There are four washers and four dryers. The laundry room opens on 9am. One morning, I bring my laundry down right at 9am. As I arrive, I realize I forgot my laundry card in my apartment. I leave my laundry in the basket, and leave the basket on a machine. I retrieve my card, then return to the laundry room. I the 5 minutes I've been gone, one of my neighbours has loaded all 4 washing machines with their clothes and linens.\n\nI expressed my disapproval of her selfishness and pointed out that there was obviously another tenant who was obviously looking to do laundry. She gave me a barely coherent excuse about \"just needing to get the laundry done.\" At this point the machines are loaded and the cycle has begun. Pissed, I take my clothes back upstairs.\n\nAt this point I am fuming about how someone could be so inconsiderate. I know that the washing machines take 30 minutes for a cycle, the dryers take an hour for a cycle. So I waited about 28 minutes, then returned to the laundry room. I started a cycle on each of the dryers on the heat free setting, forcing the rude neighbour to wait an hour to finish their laundry. Best eight bucks I ever spent.",
        "created_utc": 1674748143,
        "upvote_ratio": 1.0
    },
    {
        "title": "Karma playing out",
        "author": "monicarperkins",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/10lsnkf/karma_playing_out/",
        "text": "[removed]",
        "created_utc": 1674742231,
        "upvote_ratio": 1.0
    },
    {
        "title": "Was I too brutal?",
        "author": "CapableLingonberry56",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/10lrzx9/was_i_too_brutal/",
        "text": "[removed]",
        "created_utc": 1674740320,
        "upvote_ratio": 1.0
    },
    {
        "title": "I gave someone lice on purpose",
        "author": "FreakyLeakSoup",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/10lrdu0/i_gave_someone_lice_on_purpose/",
        "text": "[removed]",
        "created_utc": 1674738430,
        "upvote_ratio": 1.0
    },
    {
        "title": "I gave a kid lice on purpose after he teased me for having lice.",
        "author": "FreakyLeakSoup",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/10lrc0i/i_gave_a_kid_lice_on_purpose_after_he_teased_me/",
        "text": "[removed]",
        "created_utc": 1674738268,
        "upvote_ratio": 1.0
    },
    {
        "title": "Follow the leader",
        "author": "Advanced_Parsnip",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/10lqnva/follow_the_leader/",
        "text": "I few years back while going home from work(normally a 2 hour drive when roads are good) I ended up about 60 vehicles back from the plow truck. With everyone so close together there was no room to advance to try to pass the slow moving vehicle.\n\n After about 35 minutes and 4 km later a side road was finally coming up, to I turned so I could get home at a more decent hour. After rounding the corner I see a set of lights following me and making every turn I make on all the back roads. With the snow letting up I could now see that there was not 1 car following me, but at least 3. \n\nAn hour and a bit later as I turn into my driveway on a small dirt road, they were all still behind me. With the deep snow and only my tracks to use without getting stuck, I wonder how they got to where they needed to be. Why do people still blindly follow others without knowing the destination. \n\nNot sure if this is petty or just stupid people, but wanted to share as yet another winter storm as just rolled through here.",
        "created_utc": 1674736054,
        "upvote_ratio": 1.0
    },
    {
        "title": "Email Spam Provider Required",
        "author": "baked_tomato6969",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/10lqgq6/email_spam_provider_required/",
        "text": "[removed]",
        "created_utc": 1674735344,
        "upvote_ratio": 1.0
    },
    {
        "title": "Make my life in school a living hell? I will ruin your job and get some petty revenge",
        "author": "revo952",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/10lptx2/make_my_life_in_school_a_living_hell_i_will_ruin/",
        "text": "\n\nFor an introduction I am currently 19 I used to go to a primary school in the uk it is relevant to the story I am a nerd in programming and I suffer from autism and ptsd \n\nThis all started in the final 2 years in primary the teachers were always awful to me but to make this a complete story I will skip over the minor pickings and on to striaght up bullying so this kid let’s name them “oli” was a bully of mine and was the teachers pet he would jump me and get others to bully me and I was always told I was lying because my “autism made it exaggerated” when we all clearly knew it was not as it was going on for nearly 5 years then \n\nThe teacher: my other teachers were good but my final year teacher let’s call him David (not real name) would always make sure to push my sensory needs by making me stand up in front of the class ect always nearly every day (autism and shy kid thing) and there were multiple complaints put in about him\n\n\nThe kid: Oli we are naming him was in my class and was the main bully of my class he was always for nearly 5 years\n\n\nQue the revenge day:\nIt is the final week of school the teacher is awful to me including giving me detention for having trouble getting into school due to sensory issues and we had a bunch of accounts on a lot of teaching programs (were my programming nerd skill comes in) I realise all the passwords for the accounts were (name).(year born) so when I went home I got into a voice chat with one of my friends from the school and changed nearly 600 passwords and then I ended this revenge with getting back at the bully where I jumped him on the final day of school\n\n\nInjuries and revenge meter\nBroken nose\n1-2 broken ribs \nConcussion \n\nFull password reset for every school account by it \n\n\nFrom this nearly every person and teacher has said sorry to me for making my life hell all those years ago\n\n\n\nDid I go to far or nope?\n\n\nThis was made off memory mostly some numbers may be off feel free to ask more questions",
        "created_utc": 1674733004,
        "upvote_ratio": 1.0
    },
    {
        "title": "What to do if my EX GF has been harassing me for a yea 3 months?",
        "author": "thatgoodbunny",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/10lnfhu/what_to_do_if_my_ex_gf_has_been_harassing_me_for/",
        "text": "[removed]",
        "created_utc": 1674722678,
        "upvote_ratio": 1.0
    },
    {
        "title": "Petty revenge on driver tailgating me",
        "author": "iceariina",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/10lmqvu/petty_revenge_on_driver_tailgating_me/",
        "text": " \n\nNot sure if this is \\*quite\\* the sub for this. Do direct me elsewhere if there's a more fitting sub.\n\nI worked nights for over a year. The route home took me on a rural, one-lane highway. No street lights, lots of curves, lots of trees, lots of deer. The speed limit on this stretch is 55mph. Almost everyone goes 65, but I had noticed cops cracking down on people speeding on that road, so I stopped pushing the speed limit so much.\n\nI was on my way home, tired after a 12-hour overnight shift. It was pitch black out, no stars or moon because of cloud cover. I mean it was DARK. But there was no one else on the roads at that time. Still, I didn't want to deal with deer or drive too fast on the winding roads while tired, so I kept my speed pretty close to the speed limit.\n\nA car pulls up behind me. Rides my tail. Flashing his lights, making like he wants to pass. Now, there's NO shoulder, so I can't just pull over and let him go. Also, there's NO ONE else out on the roads at this hour and hasn't been for the whole drive, he could easily pass me. So I slow down. He keeps on my tail, despite being on a straightaway where he could easily pass me.\n\nI set my cruise control at exactly 55mph and decide to ingore him, because I'm petty like that. I WAS going 58, almost 60 on the straightaways, but not anymore. You gonna be an ass, despite having ample opportunity to pass, that's on you, dawg.\n\nAs soon as we get to a No Passing Zone (as you do), he apparently decides he's had enough and floors it, zipping around me. Finally! Moments later, I see flashing lights in my rearview. A police car pulls around me and pulls over the impatient driver.\n\nBoy am I glad I kept it at the speed limit!\n\nTL;DR guy waits till we get to a no passing zone to pass me and gets immediately pulled over.",
        "created_utc": 1674719669,
        "upvote_ratio": 1.0
    },
    {
        "title": "Guy riding my tail gets instant karma",
        "author": "iceariina",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/10lmnzs/guy_riding_my_tail_gets_instant_karma/",
        "text": "[removed]",
        "created_utc": 1674719334,
        "upvote_ratio": 1.0
    },
    {
        "title": "What have I done",
        "author": "Only-Mud-4170",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/10lmfqk/what_have_i_done/",
        "text": "[removed]",
        "created_utc": 1674718320,
        "upvote_ratio": 1.0
    },
    {
        "title": "Force kid-me me to go on a long pointless drive, I’ll scar you for life",
        "author": "kidostars",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/10ll0bf/force_kidme_me_to_go_on_a_long_pointless_drive/",
        "text": "I just remembered this from when I was 10, and I’m so glad there’s somewhere to tell it!\n\nWhen I was a kid we lived in a place with gorgeous scenery. Whenever we had out-of-town guests, my parents would force me to take a long drive with them in the car, just to look at…hills.\n\nMind you, now that I’m old, I totally get it. But at the time, there was nothing I would less rather do. By age 10 I had earned independence and was allowed to stay home alone (look, it was the 90s, parenting was very different), so I just could not understand why they forced me to come with them and their stupid friends on long, pointless drives. Plus I got carsick, so it extra sucked. My parents would bribe me by allowing me to bring my own Walkman (again, early 90s) so I could listen to whatever I wanted — and I guess so the grownups could talk. \n\nWhen one visiting grownup couple visited, I had just discovered Prince’s “Purple Rain” album. And I was PISSED at having to go for a drive, probably because Rugrats or some shit was on TV and I wanted to stay home and watch.\n\nSo we’re in the car in the middle of all these hills, and I’m feeling sick, so I decide to sing along, out loud. I can tell the grownups think this is cute, so I don’t stop. \n\nThen the song [“Darling Nikki” plays.](https://youtu.be/j8oxXkUjYHg)\n\nI kinda knew that the song was adult, like I knew the word “masturbating” was naughty. But at the time I had no idea what I was saying, really. Just, eff everyone for making me be here, you know?\n\nCan you imagine a CHILD singing the lyrics to that song?\n\nMy dad almost drove off a cliff. My mom snatched that Walkman off me so fast…. And then, the silence of that car. \n\nI know those people never forgot that drive.\n\nAnd I don’t remember being forced to take one ever again, either.",
        "created_utc": 1674712822,
        "upvote_ratio": 1.0
    },
    {
        "title": "Attempt at mockery ends up in drop in grades",
        "author": "IntercomB",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/10lke88/attempt_at_mockery_ends_up_in_drop_in_grades/",
        "text": "Firstly, thanks to the people who redirected me toward a more suited subreddit.\n\n\nTL;DR: a two-faced classmate got close to me so she and her friends could make fun of me. I sped up the lecture so everyone would fall behind, and coerced the class against them.\n\n\nThis story happened during my senior year of high school (I'm now 34). I was the weird kid of my class, which I didn’t mind as I had been used to that title for years by then (as most undiagnosed autistic kids end up being). The one bright side of this is that I had learned how to stand up for myself after years of bullying. And since this was a private school full of entilted kids, I knew none of them would get physical, so I could shut any attempt at harassment with a few humiliating words before going back to sleep on my desk.\n\n\r\nThis meant that all I had to do was keep to myself, indulge in friendly banter, shut it down whenever it was going too far, and I would be left in peace. I even had close friends for the first time ! This was the life !\n\r\n\r\nThen, I made the mistake of trusting the wrong person. She was one of the popular kids, but we had been in the same class for the 3rd year in a row and she never once was less than cordial and friendly with me. I didn’t especially like some people she hung out with, but I never had any trouble with her personally. So we got progressively close enough to the point of occasionally mentioning more personal things. Let’s call her Betrayer.\n\r\n\r\nAt some point, she left one of our conversations in the middle of it. And since I have trouble with social cues, I didn’t realize at the time she left because I made her uncomfortable.\n\r\nI don’t remember the exact thing I said, but I realized later (too late) that it was something that could be misconstrued as me implying I had a crush on her (which I didn’t).\r\n\n\r\nNow, as I said, Betrayer was a popular girl, with a whole clique of friends around her. Think of the most steroeotypical clique of popular and attractive people you can think of from teen movies, with the exception that a few of them had pretty good grades, and none of them wore US football team jackets (because we’re in France). I’ll call them the Window Rowers from now on (because they were all seated in the row next to the windows in class).\r\n\r\nOur class was basically split in 3 rows of double-seated desks: one near the windows, one in the middle, and one near the wall. So I was seating at the opposite side of the class from the window rowers, yet I started hearing them whispering Betrayer’s name. \n\nAt first, I thought they were just trying to get her attention. But they were usually more subtle than this so I wondered what was happening and looked toward them, only to see the whole group of window rowers (except one, more on that later) giggling while looking at me. I rised an eyebrow. Why are they whispering Betrayer’s name toward me ?\n\r\n\r\nIt took me a while, and one of them quoting something I had said in a private conversation with Betrayer to understand what happened : Betrayer had told them about our recent conversation. And now that they thought they had something embarassing on me, they were trying to make fun of it.\r\n\r\nI shrugged it of at first. But the more they insisted, the more it pissed me off for some reason. It shouldn’t have. It was childish. This was nothing. And they were not even latching onto something true.\n\n\r\nI looked at Betrayer, slightly embarassed but still laughing with them at my supposed expense, and realized why it was bugging me so much. It wasn't their mockery that angered me, it was the attempt. Had they found something that was truly embarassing to me, they would’ve had no problem using it. And more importantly, she had betrayed my trust.\r\n\n\r\nOther students had noticed and started looking around, wondering what was happening. Me ? I took out my schedule and started planning.\r\nMy neighbour asked me what was happening.\r\n\n\r\n*\"I’m getting serious.\"*\r\n\n\r\nI’ve known most of the window rowers for almost 2 years now (3 for some of them). And my father was the family doctor for most of them, so I had heard more gossip than all of them reunited. I know what would and wouldn’t work on each of them.\n\nBut going after 10 people individually would be a *lot* of work, and it wouldn’t prevent them from retaliating (or at least, trying to). What I needed was to make a statement by hitting all of them at once, with something they all cared about : their grades.\n\n\r\nThe window rowers could be split into 2 groups : the ones with bad grades, to the point of being worried for their graduation, and the highly competitive ones, who wanted to keep their grades as high as they could so they could get into good preparatory classes.\n\n\nFor those who don't know, preparatory classes are schools you go into after graduating so they can prepare you for the entrance exam of very prized schools. Imagine taking two intensive years of classes after graduation just to be ready for the entrance exams to get into Harvard.\n\nThe people running preparatory classes are very concerned with their success rate, meaning they are very selective. So if your grades aren't the best of the best during your first interview, they won't take you in. And even when they do, it's under condition of a required level of performance during the finals.\n\n\nAnd a few classmates from the window rowers were aiming for the most notorious preparatory classes around.\n\n\r\nUnfortunately for them, we had 2 hours of Math this afternoon, so I had a few hours left to study my schedule and figure out how many casualties I could avoid before dunking on their grades.\r\n\n\r\nTo provide a bit of context, before I entered this school, I was in a school specialized for gifted students. I had to leave it for reasons I won’t go into. All you have to know is that I understand and absorb new concepts extremely fast.\n\r\nHowever, since I don’t have a competitive spirit, and after years of bullying, I wasn’t feeling any need for being an overachiever. I didn’t really engage in the lectures more than necessary, and had a very laid back attitude when it came to studying.\n\nI was more than happy to let the hardworking students getting first place, as I didn't have as much ambition as they did. And I definitely didn’t want that kind of attention.\n\r\nAs a result, my grades were good, but not exceptional. People knew I was booksmart. But since I didn’t really try, they never knew *how* smart I was. I even suspect some of the window rowers were under the impression that they could still beat me, and it was time to show them how wrong they were.\n\r\n\r\nMath class is starting. I close my schedule, and start to focus. My neighbor is getting excited and restless. I usually just goof around with him and take a few notes in class, so this is all new to him and he loves seeing people be put in their place..\n\r\n\r\nThe teacher starts her lecture. As usual, she stops to ask a question to the class, see if someone knew where she was going. In almost three years, I had never raised my hand once, because I’d rather keep to myself and let the class process new informations at their own pace.\r\n\n\r\nBut today, I’m pissed. So fuck’em.\r\n\n\r\nI raise my hand faster than Hermione Granger ever could. The teacher, all too happy to see the usually uninterested student engage with her lecture, doesn’t take the time to see if someone else has the answer and lets me reply immediately. I’m correct. She says 2 more sentences, and starts writing a few equations onto the board.\n\n\r\nWhen she turns back to ask a new question, my hand is already up.\n\n\r\nThe back and forth continues like that for a few more minutes. Meanwhile, the rest of the class barely have time to copy what’s on the board before it gets erased, they don’t even have time to check if they understood.\r\n\n\r\nI’m picking up the pace. Now I’m starting to truly get it, so I’m deducing properties of the function we’re studying based on what I already know, to the point that I basically can finish the teacher’s sentences.\r\n\r\nAt this point, one of the window rower looks at me, baffled, and quietly ask a confused *\"how do you know ?\"* To which I respond with a shrug and a *\"I don't know\"* expression (I just didn't want to be the asshole saying *\"it's obvious\"* to someone who was already struggling). The girl sitting next to him, however, looks at me with clear disgust, like I’m some kind of freak of nature.\n\r\n\r\nWell, this freak is not done yet, so either buckle up or change your attitude.\n\r\n\r\nThe teacher is too happy have that back and forth to stop me. My classmates are so busy taking notes they forget to even ask when they didn’t understand. And for once in a long time I’m not bored in class.\n\r\nAt the end of the first hour, both the teacher and I are in a much better mood than at the start.\n\n\r\nUsually, it takes us a few hours of class to cover one new chapter. I had just crunched 2 chapters in 1 hour.\n\r\n\r\nThe teacher leaves the room for our usual 5 min break. Time for the confrontation :\n\r\n\r\nThe first feedback comes from my fellow wall rowers, who are torn between confusion, admiration, and being worried about how the speed of that lecture will affect their grades. To which I reassure them that they will be fine, and that this is why I was working on my schedule during history class (a class I was already flunking and had no issue to sacrifice).\r\n\n\r\nNext comes the best graded student in Math. He is sitting in the window row, but he’s not one of the *\"Window Rowers\".* He just gets along with them due to proximity. Normally, he keeps to himself, so it was weird seeing him cross the class to talk to me. \n\nHe wasn't a genius or anything, he just worked really hard. I respected him a lot because of that at the time, since I didn’t really know how to do that. He was also a pretty chill, humble guy, which I also respected because I definitely didn’t know how to do that either.\n\n\r\nLet’s call him SuckUp.\r\n\n\r\nSuckUp politely asks me if it’s possible for me to slow down. Because me engaging the way I did with the lecture sped up things so much that, even though he had no trouble following, the other students might struggle (he actually used the word *\"we\"* to make it seem like he could relate to me, even though I clearly saw him struggle to keep up earlier).\n\n\r\nI raised an eyebrow, and was about to ask him if he seriously thought I didn’t know that. Buddy, I’ve been silent in class for years for that specific reason, and I was **really** transparent about it.\r\n\r\nBut as I opened my mouth, I noticed a few window rowers spread nearby, seemingly talking between them but clearly listening to our conversation. I assumed SuckUp either volonteered or was pressured into asking me to stop. I didn’t care to know which to be honest : he accepted to be the messenger of a bunch of cowards, he had lost my respect at that point.\r\n\n\r\nI said, loud enough for the nosy people around to hear, that everyone will likely lose 4 points (we were graded out of 20) on their next test because of what I did today, and that next time someone pissed me off, it would be more.\n\n\r\nTo be honest, I gave this number at random. There was no way I could evaluate that in any way, even less on the fly. I’m not a seer. I just needed a number for them to do the math on how it would hurt their average scores.\n\r\n\r\nKeep in mind that more than half the class had no idea what had transpired earlier and was really confused at my statements. They were basically innocent casualties that I needed for later.\n\nHowever, in order for the next step to work, I needed them to understand enough of what had happened, so I dropped them a hint.\n\r\n\r\n*\"By the way, if some of you can’t afford a bad grade, I made time to tutor up to 10 people during the next two weeks. There’s like 5 people I care about in this class, so only half the slots remain.\"*\r\n\n\r\nSuckUp opens his mouth. But before he can say anything, I hit him with a loud and clear *\"window rowers are rejected by default\".*\r\n\n\r\nThe rest of the class turns to them, a bit confused. They don’t necessary know how or why, but now they definitely know *\"who\"* angered me.\r\n\n\r\nThe day after, I asked the Math teacher permission to use a classroom in order to tutor a few other students. When she saw 10 names on the list, she asks if I’ll be okay because it was highly unusual to tutor that many students. I said that I had already worked up a schedule with all the classmates involved, and that it would only be for a short period of time so I wouldn’t risk to overwork myself. So she gave me permission.\r\n\n\r\nI worked my ass off for maybe the first time these 2 weeks. No shortcuts, no cutting corners, no procrastination. I didn’t even put my classmates together in a study group. I took the time to tutor each and everyone of them in one on one sessions in order to make sure they could take it all in at their own pace. \n\nSome of them had conflicting schedules with me, so I even took time out of school to help them during free time. I had given my word to 10 students that their grade wouldn’t suffer from my stunt, so I wasn’t about to let them down. \n\r\nFive of them I actually got along very well with, so I really didn’t want them to suffer from my pettiness. I could’ve stopped with them, but I had basically ruined the next test for more than half my class, so I needed as much allies as possible. The more people knew I made an effort to help however I could, the more they were likely to blame the window rowers for what happened instead of me.\r\n\n\r\nWhen they heard what happened, 2 of my friends even freed their slot after a week, claiming I helped them understand enough of the lecture that they could figure out the rest by themselves, so I could help someone else instead. True bros.\r\n\n\r\nRemember how I told that one of the window rowers was not participating in the incident ? Well, it’s time to talk about her, so let’s call her Bystander:\n\r\n\r\nBystander was the essence of teenage popularity given form. She was stunning, funny, and probably had never heard of serotonin because she always had enough. She was different than her friends because she’d prefer to laugh *with* people rather than laugh *at* them. She only made fun of someone when she was close enough to them to know whether or not they were comfortable with it, a boundary most of her friends never bothered to figure out.\r\n\n\r\nBut the greatest difference between Bystander and her friends was that we were in the same middle school for 1 year. In fact, she was in my class during the worst year I ever had. She knew how badly I got bullied, and even witnessed most of the fucked up shit I had to endure before leaving that school.\n\r\nSo when her friends started to fuck with me, she wasn’t laughing. She was, once again, being a bystander.\r\n\n\r\nWhich is why, when she came up to me on Friday, I didn’t tell her to fuck off like I would’ve with the rest of them. Mostly because I was curious. She rarely interacted with me for anything other than formalities.\n\r\nShe apologized, for once again being a bystander and not having the guts to try and stop them. I accepted her apology. They felt sincere, and I suspect that she was beating herself down over not being able to call them out when they were going too far.\r\n\n\r\nI told her that she didn’t have to feel bad about it, that I was more angry at the attempt than hurt by what they thought was a success. She asked what I meant by that and I explained that Betrayer had the wrong idea in the first place.\n\r\nWe laughed about it and I ended up offering her one of the two recently open slots for tutoring. I felt guilty because she didn’t do anything wrong, and I knew she had trouble in Math. She refused, saying she didn’t come to me to save her own ass, and that it wouldn’t feel right if she went behind her friends’ back to save herself. \n\nI was honestly taken aback, as it was very different from my initial assumptions of her. I wanted to tell her she was worth better than the window rowers, but I shut up. If there was one thing I valued at the time, it was loyalty toward friends. I just hope she finally realized that by herself at some point.\r\n\n\r\nEventually, the test dropped, followed by the results a few days after.\r\n\n\r\n*\"Alright, so apparently we’ll need to spend a bit more time on those chapters, because the average grade is a lot lower than usual. You guys are 4 points below the last test.\"*\n\r\n\r\nI had ***so. much. trouble*** keeping a straight face. When I said 4 points the first time, I had just said that at random, something that sounded significant but still plausible. I wasn’t expecting to hit the bullseye ! And the baffled looks I got from the whole class didn’t help me maintaining my composure in front of this insane luck that made me look *way* smarter than I actually was.\r\n\n\r\nI gave a side eye toward the window row. They were all livid. I was gloating internally.\r\n\n\r\nThe best part ? The people I tutored had actually better grades than usual, which meant the rest of the class grades had dropped by even more than what I had \"predicted\".\n\r\nBlissfully ignorant, the teacher congratulates me for being top of the class. Because I had tutored so many classmates, I ended up studying as a byproduct. I usually didn’t care for my ranking, but this was a very nice bow ribbon for that foul gift I had just offered the class.\n\r\n\r\nOne of the window rowers, who I’ll call Instigator, was fixated on me for the whole rest of the class, turning a new shade of red as each minute passed by. When the teacher left, he got up, but one of his friends put his hand on his shoulder to stop him. I looked straight at him, with what I understand as a \"try me\" attitude. He sat back down.\r\n\n\nI know for a fact that almost all of them got into trouble with their parents. Betrayer even got rejected by the preparatory class she was aiming for. She had to take her second choice, which greatly lowered her chances of landing her school of choice. Next time, take your beef to my face, instead of being a two-faced backstabber.\n\nSuckUp was still accepted, but his requirement for the final exams were higher than what he expected. It was still under his usual performances, so there was nothing to worry about. But his parents were putting a lot of pressure onto him already, so I can't imagine that part had gotten better. He almost had a near perfect score in Math up to now, so a 4 points drop represented around a 20% drop in performance. No way his parents would let that kind of stain slide.\n \n\r\nNow, onto the next part, and why I made sure to look as little villainous as I could by busting my ass for two weeks.\n\r\nI would love to tell you that the window rowers learned their lesson. But that would be giving Instigator’s memory too much credit.\r\n\n\r\nA few months later I made another mistake. See, I am really, really frank. I say things as I see them, which can be very disturbing in a school full of hypocrisy and people concerned with appearances, who communicate between themselves with some kind of secret spy code. I understood some of the customs overtime, but inevitably I would accidentally walk into a social minefield because I didn’t see the warning sign.\n\n\r\nBecause of that, I very often end up with people giving me intents based on things I didn’t say, but unknowingly implied.\r\n\n\r\nWhich is why, when I complimented a classmate of mine on her appearance, I didn’t realize that the *way* I did it was apparently code for me initiating some kind of courtship dance I knew nothing about. And it just happened that a member of the window row, that I’ll name Smol, was present when it happened.\r\n\n\r\nSmol was actually a nice guy. Most of the window rowers were in fact nice people most of the time. It’s mostly that they had a tendency to become nasty whenever they were together (particularly when Instigator was involved). But Smol had a taste for gossip, and the window rowers were very thristy for drama.\r\n\r\nSo inevitably, they started to try and set me up with the classmate I had complimented. Now, let’s be honest, the classmate in question was a very sweet, introverted and clever girl (let’s call her Raptor). And as I implied earlier, I did find her attractive. I just didn’t know her that much, so I didn’t really know if we had any chemistry.\n\nMy earlier compliment was just that: a compliment. And it kind of annoyed me that you couldn’t even compliment someone without everyone immediately thinking you had ulterior motive.\r\n\n\r\nI had tried to explain to Smol, whose attempts at setting us up was obvious to the point that ***I*** had noticed them, that I didn’t mean anything by that. But the window rowers insisted. I honestly think they meant well, thinking we would be cute together or something (we would’ve, she was freaking adorable). But it was seriously starting to get annoying to see them trying to make something happen between us instead of minding their own business.\n\r\n\r\nIt got to the point where Raptor came to see me, visibly uncomfortable, to tell me that she appreciated what I had said to her, and was flattered but she wasn’t really interested in a relationship right now. \n\nThis happened **despite** me having previously clarified with her that I didn’t mean anything when I said that. But they seemed to have somehow convinced her that I was actually serious in pursuing her. I likely had said something that made them think that way, but once again I never meant to give off that vibe. So I ended up having to reassure her about the fact that she didn't break my heart.\r\n\n\r\nThen, at some point, Instigator got tired of waiting for something to happen between us, so he decided he prefered to make fun of us instead.\n\r\nNow, I was really pissed. I don’t mind taking shit like that in the face, but now he involved Raptor, who was already uncomfortable with the whole situation, and clearly not as well equiped as I was to handle that kind of attention. I gave Instigator a death stare.\n\n\r\nOnce again, thinking he finally had a way of hurting me, he kept going. And that’s when the consequences of my previous stunt hit.\r\n\n\r\nA middle row student looked a me, panicked, got up, and yelled at Instigator to stop it. Instigator tried to blow him off by telling him to mind his own business, but he was interrupted:\n\r\n*\"I don’t fucking care, I’m not lowering my next grades for your stupid shit !\"*\r\n\n\r\nAnd that’s when everyone was reminded of what happened last time they pissed me off. Instigator tried to argue that I was the one who made their grades drop. True. But I was also the one who could spare them by tutoring them. And since I could only help up to 10 people at once, and 5 slots would be already taken, it was in everyone’s best interest to take my side in order to ensure a slot if I were to do something.\n\r\n\r\nInstigator turned to his friends for back up. Most turned their eyes away, one shook his head, one of them said something I didn’t quite hear but he looked concerned. Instigator had no choice to back down, for good. He knew that whenever he tried to mess with me, people would get angry at him, and he would progressively lose social status.\n\r\n\r\nAnd that’s how, by putting an effort for two weeks, I saved the trouble of defending myself for the rest of the year.",
        "created_utc": 1674710574,
        "upvote_ratio": 1.0
    },
    {
        "title": "What revenge can I get on a person trying to tempt my wife",
        "author": "Truckierobh",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/10lj6b0/what_revenge_can_i_get_on_a_person_trying_to/",
        "text": "[removed]",
        "created_utc": 1674706553,
        "upvote_ratio": 1.0
    },
    {
        "title": "I don't bring no-tippers complementary chips and salsa and my manager thinks it's amusing.",
        "author": "TexanLoneStar",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/10lj32g/i_dont_bring_notippers_complementary_chips_and/",
        "text": "Most people tip something, but there's always the usual culprits: high school kids, and regulars who just don't care about tipping.\n\nI don't bring them complementary chips or salsa.\n\nMy manager is too busy dancing to cumbia, cooking the food, and texting girls in the back, and gives me full authority over my job.\n\n\"But aint the customer always right?\" I asked, naively, on one of my first days on the job. \"Nah, fuck that shit.\" he responded.\n\nI enjoy seeing the disappointment on no-tippers faces as they wait at an empty table until I bring their paid for food out. No chips. No salsa. No hot sauces. Hell, I might even \"forget\" your silverware -- or, if I do remember it, replace it with some plastic knife that can barely cut through the food without breaking.\n\nI remember the first time I did it; 4 high school boys walk in, order some low-profit, high-labor foods, don't tip, and go to take their seats after saying \"We want chips and salsa.\" The looks on their faces as they kept looking at the register was priceless. I was hiding in the back looking through a secret window that overlooks the whole dining room and couldn't stop cracking up.",
        "created_utc": 1674706264,
        "upvote_ratio": 1.0
    },
    {
        "title": "My friend got cheated on and dumped. I was not cool with it.",
        "author": "SEO403",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/10lill9/my_friend_got_cheated_on_and_dumped_i_was_not/",
        "text": "The likelihood of what I had in mind being successful was very low but I knew I was the only one in the group who could do it.\n\nWe are all from a small town. I have got a pretty large following on socials which opened many doors for better or worse. Vain? Totally. But that is the state of the world today. One of the things I got most based on working in the modelling industry and gaining followers is female attention. Especially back home after leaving the country. I've seen his ex like many of my posts while they dated despite not following each other. Never thought much of it but apparently, she did not know her bf and I were close buddies.\n\n**Story:**\n\nWell, there is this one guy I am pretty close with since early school but we do not hang out as much since I moved to London. We only talk online via memes and every now and again he shares about his love life with me.\n\nMost people we have in common don't even know about our friendship because it is under the radar. He had a girlfriend whom I had not met in the past aside from seeing her like a couple of posts of mine. They were together for 4 years. They were both very insecure about their appearance apparently, and it somewhat became a part of their bonding, I guess.\n\nHe was very slim, and she was overweight. Over the years, she got even bigger while he remained the same. It was a topic they both avoided he said. Well, one day she took it upon herself to join the gym and over the next year, she got really in shape. A lot. I saw it from pics myself.\n\nFor some reason, that brought up a strain in the relationship. She would start arguments for the dumbest reasons: leaving a cup on the table, taking too long in the bathroom despite being there for like a minute... he suspected something was wrong so he tried to talk to her and she gaslit him.\n\nTwo weeks later, she randomly broke up with him. He pleaded for an explanation and she refused. I guess she felt remorseful and admitted losing attraction for him and that she started seeing someone behind his back whom she met in the gym, that she is sorry for cheating but that the relationship had died and she couldn't lie to herself. She left him and was official with that gym dude right away.\n\nWe never ever ever facetimed before. So, when he did hit me up and explained the whole thing while holding his tears until he couldn't, I got pissed off beyond understanding.\n\n(She apparently didn't last with that gym dude for some reason but that's beside the point.)\n\nI told him that I wanted to give him a hand and teach her a lesson. He first asked me to let go and to let life play out but I guess he started getting ultra resentful over the situation and changed his mind, to the point where he would insist to me on doing X and Y.\n\nCoincidentally, I was already planning to spend half the year back home (last year). \n\nEveryone moves around the same circle in my town in terms of parties, and gatherings... the whole ordeal was on the back of my mind to the point where I almost forgot as I too have a life. That was until I saw her on a night out. As soon as I saw her, it kicked in. So, I approached her and her group at the table they were at and began talking to her and introducing myself. After a couple of laughs, I exchanged socials with her and her friends and told her that I was hosting a gathering the following weekend as I was staying in a pretty cool place with 4 friends for that period in my town. I told them that I would give her the details the next day.\n\nI didn't text her the next day and around 9 pm, she replied to my story asking about it, I knew she was in at that moment. Gave her the details, and she came around. I showed her a great time and told her that I wanted to take her out the next day. She said she worked but that she could meet after work. We met. Had a blast once again. We kept on meeting throughout the following three weeks and I had not even kissed her once. To the point where she was super confused and began asking me whether I actually liked seeing her. Unfortunately, I was starting to like her, and the emotional and human factor within me was forgetting the plan, this shit only works in movies.\n\nI kept on talking with my friend about it and he too couldn't help but feel super conflicted about the whole ordeal. It was all a mess but we kept going. The next time I saw her after my moment, we met at my place, we kissed and had sex all night. Unfortunately, it was great. I knew I was not cut out for this, I wasn't catching feelings per se, but I couldn't see her as the asshole she is. We kept dating and having sex for weeks on end while I was taking her to amazing places. I asked her to date exclusively. She agreed. Not a relationship but one step from it.\n\nWe live in a very humble town where the average salary is very low. So, the life most live is very very standard. There is nothing wrong with that, but, the fact that I am earning well, I guess helped me create experiences with her and keep her very attached.\n\nWell, the emotionally unavailable part of me kicked in at some point, when I saw that she was getting too attached. It freaked me out a bit and I felt like it was time to part ways. I had met her friends a few times by then, and the ex-boyfriend who is my friend told me that they were pretty fake and would somewhat bully her a little sometimes but that she feared being alone. So, she stayed with them. There was one of them in specific that would often make odd comments the only few times we all did hang. I knew it was as easy as going on a night out to the local spot a night that my friend's ex wouldn't and hope that her friends were there. Approaching the flirty friend, remove me and her from the masses, make out with her and if possible, have sex. \n\nThe three happened, we made out and both took vids and snaps making out. We left the spot and went to my place. We had sex.\n\nAfter sex, she started somewhat feeling guilty while enjoying doing her friend wrong. It was weird. She said, and I quote \"I am awful, why (insert kiss) did you (insert kiss) get me (insert kiss) to do this? (insert kiss)\".  I started recording myself tucked in bed saying silly things after sex, and I knew she would pop her head in and chip in. You're damn right she did. It is worth mentioning that she was 23 but acted like an 18-year-old college student. So, it was all very predictable\n\nI still was shocked by how fucked up the whole thing was.\n\nI am no Saint, but I felt like I somewhat was less foul than the gym ex-girlfriend and the friend who secretly hated her and looked forward to having sex with me with zero regard for her friend.\n\nI sent my friend many vids the ex's friend sent me of us that weren't revealing anything other than making it obvious that we made out and fucked.\n\nHe wasted no time, sent her the vids and told her that we planned it all together along with a whole explicit resentful rant with bad words over voice message that shouldn't be repeated.\n\nShe called me a few times, but I did not pick up, she sent me voice messages crying and calling me everything. I felt like an absolute piece of shit. A lot. \n\nI called my friend and asked him to explain their breakup again. He did. I remembered how foul she was to him and simply didn't reply to her. I blocked. She then sent other messages to my friend. He was loving it but felt sorry for her at the same time. I asked him to promise not to take her back no matter what if she ever tried. She was fully broken at that moment and he started taking care of himself, eating more... this dumbass took her back in less than 7 weeks.\n\nNow, I just mind my business.",
        "created_utc": 1674704728,
        "upvote_ratio": 1.0
    },
    {
        "title": "My grandmother wouldn't let dogs in the house",
        "author": "myatoz",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/10lhjis/my_grandmother_wouldnt_let_dogs_in_the_house/",
        "text": "[removed]",
        "created_utc": 1674701532,
        "upvote_ratio": 1.0
    },
    {
        "title": "Petty revenge by living your dream",
        "author": "throwaway9865931",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/10lhc85/petty_revenge_by_living_your_dream/",
        "text": "[removed]",
        "created_utc": 1674700925,
        "upvote_ratio": 1.0
    },
    {
        "title": "Looking for guests for a YT show",
        "author": "Notadabbler",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/10lgyn1/looking_for_guests_for_a_yt_show/",
        "text": "I am the cohost of Subreddit Surfing on YT. Each week we interview members of different subreddits. We are looking to explore every aspect of this sub and why you are here. We are comedians that like to talk to people, learn and have fun with the topics but we don’t ever make fun of our guests. We record Mondays at 8pm eastern time. You can be anonymous as I am as well (using the Snap Cam app) \nIf you have a story to tell please join us. \nAll we ask for is honesty and a good internet connection. \n\nPlease DM me if you would be willing to join us on a Monday evening. \n\nThank you in advance.",
        "created_utc": 1674699803,
        "upvote_ratio": 1.0
    },
    {
        "title": "You wont honor my school schedule but want me to do extra work? OKAY",
        "author": "DeadestBug",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/10lfzep/you_wont_honor_my_school_schedule_but_want_me_to/",
        "text": "[removed]",
        "created_utc": 1674696980,
        "upvote_ratio": 1.0
    },
    {
        "title": "I called ICE on my ex",
        "author": "default_mode_",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/10lbpz0/i_called_ice_on_my_ex/",
        "text": "[removed]",
        "created_utc": 1674685664,
        "upvote_ratio": 1.0
    },
    {
        "title": "A woman parked so close to my car over the line that I couldn’t get my baby in, then came back to her car.",
        "author": "Skankula42069",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/10lazjs/a_woman_parked_so_close_to_my_car_over_the_line/",
        "text": "I asked her if that was her car and showed her how she parked over the line. I told her how she made it so I couldn’t get my baby in or get myself in and how she should park better. She had a huge attitude and acted like I was in the wrong for saying anything. She got in her car and left, and I got stuck behind her on the way out. She had nobody in front of her but braked to a complete stop in the middle of the road 4 times for no reason other than to try to provoke me. Well that pushed my final button. Right before she came back to her car, I took a photo of her car and license plate just to send a pic to some friends to shame her, like we do with bad parking jobs. Well it turns out she was illegally parked in an electric vehicle only space! In this city, that is punishable by a $350 fine. I reported her and submitted the photo of her parked as well as her road rage like driving after, and she will be fined for that $350 now! I hope you enjoy your vacation, and I hope when you get home to Florida that you love going through the mail and finding your new bill :)",
        "created_utc": 1674683877,
        "upvote_ratio": 1.0
    },
    {
        "title": "Friend of 5 years gets signed up for multiple insurances. (And other)",
        "author": "The_Red_God_1",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/10laueh/friend_of_5_years_gets_signed_up_for_multiple/",
        "text": "I had this friend (T) of 5 years, who I considered one of my best friends. We went to the same gymnasium (age between 16-20 for the confused). We, together with 3 others, formed a small group of socially awkward, weird hobby loving people. \nAll was good and we were all right. Think stereotypical rom-com bff tight. We all did everything together. \n\nBut as the years passed and we all moved to different parts of the country, we all hung out online instead. Things were good, and fortunately T lives the closest to me, so we saw each other more often than the others did. \n\nFor 5 years we were in each other's life, and talked daily online. I helped him through joblessness, he gave me rides when public transport sucked, we had game nights together. All was bliss. \n\nBut then new year of 2022 happened. \nNow our little friend group didn't see each other often, and therefore I decided to throw a new year party, just for us. \nI actually started this tradition 2 years back.\n \n1st new years was a T's house. Very small, but fun. Food wasn't the greatest, and we ran out of alcohol after 4 hours. \n\n2nd was hosted by another friend L, he had a bigger house and his mother cooked. Things were lovely, but a tad too underwhelming for new years. (Basically the party could have been mistaken for an old folks home new years. \n\nAnd that is why we decided I would host the 3rd party.\n\nI started planning, and threw a pretty good party. During the party however T got super pissed about the food choices, and when I tried to settle everything, he cussed me out. He stormed out, and we were all flabbergasted. We didn't see him more that evening, but we got confirmation he had gone home to some family nearby. \n\nThe next days I would try and contact T to figure out what happened. He didn't pick up. \nFor weeks this went on, untill two days ago when I get a message from L. He informed me that T didn't like me anymore. \n\nHis reason? We disagree on too much. \n\nI will be the first to admit I am opinionated, but I don't hate on others viewpoints. Apparently he wanted me to agree with all he said. News to me. \nThis all came as a shock, but I still respected him. I told the rest of my friends what happened, amd that I didn't want them to pick sides. \n\nAt least that was my decision until today. \nI learned today that T had been shit talking me for weeks leading up to new years. And also after. Basically calling me a power hungry dictator, and everything had to be my way or the highway. \n\nThere was more but this is already long enough, and that was the most recent. \n\nThe revenge:\n\nAs I mentioned me and T used to be tight, I knew alot about him. I used his phone number and email to sign him up for multiple insurance phone calls, and all the spam I coul find that would actively call you. \n\nI also went into some google docs documents he had shared with me about various hobbies. I deleted all the information in them. \n\nI could have done a lot worse, but I didn't want to go nuclear, so this is my sweetness amongst all the shit he dumped on me.",
        "created_utc": 1674683527,
        "upvote_ratio": 1.0
    },
    {
        "title": "You're gonna wish we never met",
        "author": "spanishhybrid18",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/10lapgu/youre_gonna_wish_we_never_met/",
        "text": "One of my flatmates (ana) has a job. Her bf is a dealer. They told another flatmate that they claimed benefits which is benefit fraud. \n\nHere's the list of reasons why Ana is a cunt:\n- I let her use my kitchen stuff on the condition her and bf cleaned it straight away. They never did. I had to remind them like a mother and ironically, I'm the youngest of the house \n- they finally got pans but still used mine under the excuse we can't tell the difference. Yes you fucking can. Ones old and yellow and yours is nice and grey.\n-Ana complained that it was unfair of her bf to pay £60 to the other flatmate so we could break the lease. I was going to say he's been here since the beginning but she shut me down in a child. \n- she insists I'm gay and twerked on me. I didn't say anything as I didn't know what to say and was uncomfortable \n- she makes fun of the way I say Barcelona (I am hispanic). Apparently she does this because its funny and it annoys me. I am learning Spanish; I can read, write in B1 and speak A1/almost B1. Since I'm a citizen of the UK and Spain, I want to make sure I pronounce stuff correctly.\n\nTheir new house starts in June. We're hoping they move by then, if they do I will report them anonymously for benefit fraud.",
        "created_utc": 1674683186,
        "upvote_ratio": 1.0
    },
    {
        "title": "Steal my Work? Look like an Idiot",
        "author": "chilldude890",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/10landv/steal_my_work_look_like_an_idiot/",
        "text": "[removed]",
        "created_utc": 1674683043,
        "upvote_ratio": 1.0
    },
    {
        "title": "Separated from employer in August of 2022 and I received my health insurance cards from them today (USA)",
        "author": "2x4caster",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/10laf98/separated_from_employer_in_august_of_2022_and_i/",
        "text": "As the title says. I separated from my previous employer in august of 2022. I got a new job shortly after that and i am on my new jobs insurance. I found out today that they are still paying for me to have health insurance that I will not be using. I am calling their benefits company soon to let them know that I have not been employed with them for several months and then I will be sending an email to their HR. is there any petty revenge I can entertain with impunity? I’m on my new employers insurance and I understand it’s illegal to be double insured.",
        "created_utc": 1674682485,
        "upvote_ratio": 1.0
    },
    {
        "title": "Sister pisses of my uncles at my grandma’s funeral- Tale of the missing rings",
        "author": "Irishlass83",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/10laed1/sister_pisses_of_my_uncles_at_my_grandmas_funeral/",
        "text": "TL/DL at the bottom\n\nMoney makes enemies and vultures of family members. \n\nMy dad grew up in a large household (six biological kids, 5 adopted) in Nebraska. There was an ongoing problem with my dad, and two of my uncles about my grandparents’ trust. Later own, my dad had to fight to get back things which had been given away, or had gone missing. \n\nGrandpa died several years before grandma. He and grandma had a trust. At grandma’s funeral, my uncles wanted to cheap out, and have me do her funeral for free (I am a former seminarian). I refused. \n\nAt the viewing, my sister noticed my grandma’s rings weren’t on her fingers, especially her wedding rings. My dad spoke to my two uncles, inquiring about the rings. They said the rings were in a safety deposit box. My uncles called the trust officer, to have him open the safety deposit box, to “look” for my grandma’s rings. It was 10PM, the bank was closed. The funeral was early the next day. The trust officer was out of town, and wasn’t going to be able to open it. The rings have never been found. This is not the only story of their greed, but I won’t get into it.\n\nThis is where the revenge comes in. My sister is very clever. Before the casket lid was closed, to bring grandma in the sanctuary for the service, my sister put her own wedding band on my grandma’s wedding finger. After the gravesite service, my dad told my uncles what my sister had done. They were pissed. My two uncles asked the cemetery manager how much it would cost, if they delayed grandma being lowered in the grave. It was determined it was too much, since it would be a couple hours, and complicated by the fact it was in the middle of the winter in Nebraska, and there was snow on the ground. To this day, we celebrate my sister’s cleverness, every time we get together. And my uncles refuse to talk about it. \n\nTL/DL Clever sister puts her own wedding band on grandma’s finger, before her funeral. Thieving uncles get pissed.",
        "created_utc": 1674682424,
        "upvote_ratio": 1.0
    },
    {
        "title": "My School Humiliated Kids For Doing The Bottle Flip Challenge",
        "author": "Then_Hunter5157",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/10l9bzb/my_school_humiliated_kids_for_doing_the_bottle/",
        "text": "[removed]",
        "created_utc": 1674679847,
        "upvote_ratio": 1.0
    },
    {
        "title": "Repeated Calls for Request to Donate to a Scam Charity",
        "author": "miller_drinkertx",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/10l8r0r/repeated_calls_for_request_to_donate_to_a_scam/",
        "text": "[removed]",
        "created_utc": 1674678430,
        "upvote_ratio": 1.0
    },
    {
        "title": "Rude Facebook Marketplace Buyer",
        "author": "CarlosDanger277",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/10l4shc/rude_facebook_marketplace_buyer/",
        "text": "[removed]",
        "created_utc": 1674669143,
        "upvote_ratio": 1.0
    },
    {
        "title": "Anyone interested?",
        "author": "MuchButterscotch8702",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/10l1wv5/anyone_interested/",
        "text": "[removed]",
        "created_utc": 1674662177,
        "upvote_ratio": 1.0
    },
    {
        "title": "She made my life a living hell",
        "author": "Nkotbfan613",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/10l1oq8/she_made_my_life_a_living_hell/",
        "text": "[removed]",
        "created_utc": 1674661607,
        "upvote_ratio": 1.0
    },
    {
        "title": "I made an asshole customer regret being a Karen for free stuff",
        "author": "ChaoticCurlyFry",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/10l1f0z/i_made_an_asshole_customer_regret_being_a_karen/",
        "text": "[removed]",
        "created_utc": 1674660912,
        "upvote_ratio": 1.0
    },
    {
        "title": "Stealing our food? Enjoy our 'special' cereal!",
        "author": "Lunatic976",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/10kxxtm/stealing_our_food_enjoy_our_special_cereal/",
        "text": "[removed]",
        "created_utc": 1674651173,
        "upvote_ratio": 1.0
    },
    {
        "title": "My paychecks bounced so pay up",
        "author": "Lord_Rae",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/10kv4fj/my_paychecks_bounced_so_pay_up/",
        "text": "So I posted this in Pro revenge a while back but it got removed for not being pro enough. Petty seems right I guess? Unfortunately I didn't copy it before it was deleted so I've been dragging my feet about retyping the whole thing... tldr at the end.\n\nAbout 2005 right after I graduated college I scored a video editing gig for a news station. This wasn't your local or even a national news program though. It was nationally syndicated on mostly small religious tv stations. We made news for these stations by taking the normal news from other websites and tv and then taking out the sex and violence. Think Iraq war footage and reports with no bodies or anything remotely violent. So nothing was ever live it was all recorded and edited later.\n\nAnyway I get the job and find out on the first day that I have to do a lot more than edit. This \"Tv station\" as the owner called it only had 4 employees at it's highest level not including the owner/manager.  I was the editor but also the camera man, sound guy, lighting tech, producer and director of the whole thing. I sat in a control room with a little remote control camera and tried to run the prompter, monitor the audio and do camera moves and camera changes when needed. I did learn a lot there. But it's far from industry standard.\n\nWe had an office manager who handed out the paychecks and kept tabs on the employees which 90% of the time I worked there was just me and 1 other reporter. But we never had the same anchor for long. The owner would hire the new talent and start them off at a reduced salary until \"we see how it works out\" and then 6 months later when they asked for the raise they would be shown the door. After the first 2 anchors came and went I tried to warn any of the new ones to get their money first. Most never made it to the 6 month mark.\n\nI worked there for 3 years putting up with a lot of controlling and strange behavior. The office manager and owner were old friends and like a married couple. 2 old guys always screaming at each other and slamming doors but they 1000% had each others backs and you could not say anything bad about one or it would get back to them. They talked like they hated each others guts and couldn't wait to murder the other. But the next day they are buddy buddy. The owner wouldn't come in often and he came in less often when money was tight. Which happened a lot towards the end. \n\nBut sometimes he would show up and come see what I was working on; whether it was new graphics, station bugs or sets and say how much he liked what I was working on. Just maybe change 1 thing or 1 color. Then he would go into his office with the door shut and make strange noises for an hour. Then he would come out wired with crazy coke eyes and HATE EVERYTHING. He would hate the color he made me change, hate the graphics he just said he liked etc. He would always blame it on him not having his coffee yet and \"now he has his head on straight\". We all knew what it was. His trash can was filled with rolled up post it notes. \n\nAnyway after 3 years we had expanded from 5 shows a week (1 a day) to 13 shows a week 2 a day and 3 special weekly shows. I was still doing all the editing, camera work, etc. We still only have 4 employees But I was getting burned out. I had 1 weekday off in a 2 year span and it was only because I was too sick to even sit in the chair. But it was my first job out of college and I was making decent money and couldn't find anything else. \n\nSo several times during my employment they would say \"hey we can't give you a paycheck this week as we don't have the money\". They would usually give it with the next paycheck and you'd get 2. So it was nice occasionally but tough to budget for. When I quit I had gotten to the point where I was 3 paychecks behind. I hadn't been payed in over a month. The owner had made himself scarce as he always did when he was behind on pay but he couldn't handle not micromanaging so he set up a new policy for me. I now had to call him from the office before I could go home at night. It wasn't a \"hey time to go home\" he wanted to decide day to day whether or not I'd done enough work before I could go home. So it might be 10pm and he'd say go home or it might be 2 am. I did that for maybe 3 days before there was an issue.\n\nKeep in mind my normal routine was to show up for work at 8 am and work on graphics and anything new for the shows until it was time to tape. Then we would tape the early show and somewhere before 4pm I would edit the show and send it to 2 tapes. I would then drive the 2 tapes to different satellite uplink facilities. Then I would drive BACK to work, tape the late show and or any weekly specials and then work on that until before 10pm when I would have to repeat the export to tape and then drive those tapes to the same locations. THEN I could go home. Usually. The sets were digital backdrops and he liked to change them constantly. If I finished a new one the day before he would still ask \"What are you working on that's new?\" before I could go home. He had told me before he was diagnosed as bipolar and on medication for it and I'm guessing the blow didn't help his thought process. \n\nSo one night I'm working on a few hours of sleep. I've been at work for 15 hours. I'd just rolled out a new graphic, set and bug for him the day before and I really wanted a few hours of sleep.  So I called him after I dropped off the late show and said I'm going home. His response was \"Are you on your cell phone? Get back to the office right now and call me\". \n\nSo I'm sleep deprived, exhausted and furious on top of not having a paycheck in a while. I instead drive home and then call him from home. I tell him I'm exhausted and all that and his response was \"But don't you have a lot of things you could be working on? Where are the new sets?\" I said they were on air since he approved them the day before. And he goes \"Oh no the new ones. What are you working on next? We need to have a discussion tomorrow about your attitude... blah blah... Most people would be happy to have this job.... blah blah blah. And I just snapped and said \"Go take your medication... I quit\" and hung up on him. So satisfying. \n\nI was young so I got convinced the next day that if I worked a 2 week notice and trained a new everything person for them I could get all my paychecks and be flush. They made it sound like I would still get my paychecks if I didn't train the new person but If I did then I would get them immediately and otherwise I would have to wait. I liked the anchor and didn't want to screw her because without me they LITERALLY can't do the show. It would be dead air or a repeat. I also had no other job so another 2 weeks pay works for me. \n\nSo yeah I worked my 2 weeks with them being passive aggressive while trying to convince me to stay. I trained this poor girl on how to do the job in the best way I could but she ended up calling me for months with issues and problems. At the end of my 2 weeks I get 4 paychecks handed to me. These are handwritten checks with no taxes taken out because of course everyone here is an independent contractor for tax reasons. Then with a shit eating grin the office manager says to me as I'm walking out \"Oh you might not be able to cash these right away. We will give you a call when it's good to cash them and we will get you paid back eventually.\" With that smirk and me being there 3 years I knew the games they played. \n\nSo I found out what bank the checks were from and then figured out how to check if my paychecks had the available funds to cash it. I then monitored it for several weeks until they had the funds and then I cashed all 4 at once. Apparently I screwed up some deal or scam he was trying to pull because he called me furious and threatening lawsuits but yeah he was screwed and I got mine. He didn't know you could check with the bank whether a check was good or not and assumed that I had done something illegal. But apparently all that money was in the account not for me but earmarked for some deal to buy tv station call letters so he could be \"a real tv station\". Lucky accident my bad paychecks torpedoed his deal.\n\nThere was so much more about working there. The black mold in the ceiling tiles. The fact that I couldn't use the bathroom in the office and had to go out to the food court bathrooms to pee. The owner scamming his fiancé, the small business that he screwed over when they sublet part of the office and more. But this is way longer than I meant. Got a new job a few months later and I've been here ever since. The show is no longer on the air. Can barely find a mention of it online. After I left they went back to just 5 shows a week and dropped the late show and all the specials. The lady I trained lasted a bit over a year and then quit. \n\n&amp;#x200B;\n\nTLDR my boss tried to screw me by passing bad paychecks but I just waited until the money was in his account and cashed them without telling him screwing up his (probably) shady deal.",
        "created_utc": 1674640435,
        "upvote_ratio": 1.0
    },
    {
        "title": "I reported my old workplace to the tax office because they fired me.",
        "author": "SmileNorth",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/10ku8qg/i_reported_my_old_workplace_to_the_tax_office/",
        "text": "Context: I was the only white person, everyone else was Punjabi/Pakistani. I am also 19f and am completely self reliant on putting myself through university/college and don’t get any help from my family. Also ATO = Australian Taxation Office. \n\nSo I worked for a local pizza place for 10 months before the owner sold the business and changed ownership. It was only a small place, you only needed 4 staff for a busy night and I was the pizza chef. During the transition phase i trained the new owners on everything, making and packing pizza, using the order system and all of the health and safety rules and we got along really well, even on some late nights they would drop me home if it was raining and we talking about family/friends/hobbies etc. Unfortunately on the first week they took over I got sick from tonsillitis and couldn't work, but when i came back their attitude towards me changed completely. They were rude, gave me less shifts and dismissed me completely when i tried to help and refused to give me more responsibilities when before hand they told me that when they took over id be learning how to make pastas and not just pizzas, they were also not listening to me when i told them they weren’t following the OHS (occupational health and safety) rules, working without a hairnet, not washing hands, etc), during this time i saw one of my coworkers without a hairnet on, she has butt length hair and it was down in a braid, i told her in front of the owner that she needed to wear a hairnet as its a breach of our OHS rules and that if someone gets a hair in their food or gets sick then the company will be liable and we could get in trouble, she told me no and the owner agreed with her. 10 minutes later i found a ball of her hair sitting right where I make pizza, i grabbed it and took it to her and told her where i found it and that she has to put a hairnet on. She put a hairnet on top of her head but left her braid out 🙄. The next week I was talking to one of my coworkers and he wanted the next day off and I wanted to work so we asked if we could switch as it would have been a tuesday (normally slowest days of the week) and that it would be a good opportunity for me to get training in making pastas. The owner said no and that they wanted the other guy to work and not me. A month or so later I had a 2 week holiday to the US  that they knew about and approved of and when I came back I asked about my shifts and they told me they don’t need me anymore. When I asked why they couldn’t give me a proper reason, some reasons they gave me were that I was rude and racist to coworkers, that i refused to work in the kitchen, i messed up paperwork and that they were over staffed. All of which is false, I’m literally a chef and i texted my now ex-coworkers asking if I was rude or racist to them, they said I’m not and the only paperwork was my employee form which i didn’t mess up. They then hung up on me and then sent me abusive texts saying that im racist to my coworkers (again i asked them this and they said im not) and when I responded they told me they would get a lawyer involved if i contacted them again. Just to reiterate, under the old ownership who i worked for for 9ish months there were never any problems between myself, the owner and any of my coworkers. Anyway so here is where my petty revenge comes in, while i worked there I saw them do a lot of cash in hand payments to staff along with some other sketchy stuff with money (its been 3 months and i don’t have my super/ retirement fund payment). So I called the ATO (Australian Tax Office) and told them about everything, about all of the cash in hand payments, about the absence of my super payment, not paying staff fairly, etc. The person on the phone told me that my information was more than enough and that they would be starting an investigation which will most likely turn into the owners getting audited. So go ahead and fire me for no reason. Ill report you. Btw I now have an amazing job and absolutely love my coworkers, I’ve been there for a while now and I’ve never had any complaints, this workplace is also pretty diverse.",
        "created_utc": 1674636655,
        "upvote_ratio": 1.0
    },
    {
        "title": "‘Cropdusting’",
        "author": "1988rwl",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/10ktcy0/cropdusting/",
        "text": "[removed]",
        "created_utc": 1674632960,
        "upvote_ratio": 1.0
    },
    {
        "title": "CALLED THE RA ON MY DORM PLUG FOR SELLING ME FAKE DAB CART",
        "author": "Jazzlike_Zucchini414",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/10kqm3r/called_the_ra_on_my_dorm_plug_for_selling_me_fake/",
        "text": "[removed]",
        "created_utc": 1674622846,
        "upvote_ratio": 1.0
    },
    {
        "title": "My college dealer screwed me over",
        "author": "Jazzlike_Zucchini414",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/10kqcum/my_college_dealer_screwed_me_over/",
        "text": "[removed]",
        "created_utc": 1674622018,
        "upvote_ratio": 1.0
    }
]