[
    {
        "title": "Ultra petty microaggression",
        "author": "ApplicationKlutzy208",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/10x0zxz/ultra_petty_microaggression/",
        "text": "[removed]",
        "created_utc": 1675870751,
        "upvote_ratio": 1.0
    },
    {
        "title": "My line manager makes xenophobic comments about me",
        "author": "Adventurous-Sun-8840",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/10x0vqi/my_line_manager_makes_xenophobic_comments_about_me/",
        "text": "[removed]",
        "created_utc": 1675870633,
        "upvote_ratio": 1.0
    },
    {
        "title": "Grocery revenge",
        "author": "cherryxbomb_xd",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/10wzzvn/grocery_revenge/",
        "text": "[removed]",
        "created_utc": 1675869734,
        "upvote_ratio": 1.0
    },
    {
        "title": "Make my job slightly more difficult, I will donate to a cause you hate",
        "author": "seanbeaniebaby",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/10wzoc5/make_my_job_slightly_more_difficult_i_will_donate/",
        "text": "[removed]",
        "created_utc": 1675869407,
        "upvote_ratio": 1.0
    },
    {
        "title": "item not as described.",
        "author": "Cryptolution",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/10wxtbp/item_not_as_described/",
        "text": "I ordered something off eBay and received an item that was not as described. It was a video game that was supposed to be sealed and a specific variation that made it worth  a bit of money. My eBay account is 22 years old and I've been collecting games for nearly 20 years so have a bit of experience doing this sort of thing.\n\nWhen I received the item and found that it was not the variation described in the listing I reached out to the seller and informed him and asked him if he would kindly take it back as his listing was set to no returns.\n\nGuy made a huge stink about it. The item he sold me was worth maybe $20-30 whereas the variation it was supposed to be was worth maybe $200. I paid $70 for it so it was not some crazy lucky find just run of the mill average boring stuff for a collector. Since I paid more than double what it was worth I didn't feel like eating the cost since the listing error was his mistake.\n\nWhen he appeared to not be willing to do the return I informed him that I will just be contacting eBay and that they will force the return. Seller started throwing around his ego calling me a \"whiny peasant\" for asking to return it because it was not as described. I did some research on the guy in the community and found out he was a pretty notorious scammer with a history of this kind of behavior. \n\nCalled eBay and got the return authorization along with a return address. So for my petty revenge I squirted fart spray over the cellophane and then taped it nice and airtight in bubble wrap before putting it in a box and sending it back to him. For anyone who has never smelled this stuff before I would say it is a mixture of diarrhea and 30-day unwashed vagina smell, absolutely putrid. Difficult to not gag when smelling.\n\nSo the glorious day came and he received the package. He wrote an extremely long message in the return message thread in eBay stating that he is not a rookie so he made sure he videotaped the unboxing .... So he got my prank \"on video\" and was demanding eBay make me recompensate him for the damage. \n\nI responded to the thread and gaslit him accusing him of pretending there was a bad smell to try and scam me out of getting my refund ...😂😂😂 eBay sided with me and gave me the full refund.\n\nI acknowledge that there is a small ethical issue here damaging the value of his game with fart smell, but it was only worth around 20 bucks anyways so I don't feel too bad. Shouldn't have called me a peasant 😁",
        "created_utc": 1675865837,
        "upvote_ratio": 1.0
    },
    {
        "title": "Now you want a job? I dint think so.",
        "author": "whadya_want",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/10wx6l3/now_you_want_a_job_i_dint_think_so/",
        "text": "I was poor my entire life. Up to and including graduate school. I was working at 3 jobs, had an internship and was finishing up classes my last year. I honestly don't know where I found the time looking back. Anyhow, as a poor student I didn't have access to all the right tech for a class project. The library had some but they were in such demand it was difficult to get so as soon as I knew what I needed, I asked a classmate (call her Penny) to help me out and she agreed. I'd checked with Penny a few times prior to the meeting and we were good to go. \n\nAs you probably guessed Penny doesn't show. She doesn't answer texts, calls or emails. I frantically try to get in with the library but it's like a 2 week wait so I can't. I email my prof for an extension he denies it. She did the damn assignment without me. I end up with a B in the class which is not good in grad school.\n\nAbout 2 years later, I'm working in our field and Penny applies. She gets through an interview or two then has the group interview. I'm there. She tries a friendly approach with me that I shrug off. When decision time comes I pull for the other candidate hard. I even shared the story about her screwing me over. I'm pretty sure it's why they went with the other person.",
        "created_utc": 1675864242,
        "upvote_ratio": 1.0
    },
    {
        "title": "No, I won’t sign off a process change",
        "author": "Bumlords",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/10wtf2h/no_i_wont_sign_off_a_process_change/",
        "text": "I used to work on a production line, and if you know production lines, you know that there’s the official way to do your process, and then there’s the easiest way to do your process. You only break out the official way when you’re being audited.\n\nI worked with my opposite, Matt, for a couple of years and it was great. We’d both stay 5 minutes after and arrive 5 minutes early to make sure we were both set up for our shifts and we got on well. \n\nEventually, someone on Matt’s shift quit, and because Matt was a good worker, he was transferred to the now empty position. Cue Andy. Andy had been at the company for 20~ years so he knew it all. Matt was training him up and he was set to be my new opposite. \n\nAndy’s shift overlapped with mine for an hour, so Andy would watch me for that hour and criticise how the official process was wrong. I had no idea what he meant, as I wrote the official process around how I did the role and had trained most people on it, including the person that originally trained Matt. \n\nMatt had suffered an injury a few months before, and unbeknownst to me, he’d changed how he did the process. It didn’t really matter, as like I say, there’s the official way and the easiest way, but Andy got a bee in his bonnet about this. \n\nAndy put in a complaint about me doing the process wrong, which confused my team leader, but we had a chat and deducted that Andy was an arsehole. The complaint went nowhere and eventually Andy was my full time opposite. I didn’t like him from the get go, but that complaint solidified it.\n\nCouple of months of pettiness go by (we had to leave 15 bolts for the next shift, I’d leave a 200 pack for Matt, but Andy was meticulously leave me 15 every day so I’d return the favour) and there’s a paperwork mishap. The team that writes the process guidelines needs to update every process, and for some reason, they only consult Andy’s shift. That day, every official process guideline became the way that the other shift did their job. My shift should have been consulted but we weren’t, bad job all around.\n\nAndy got his way, his process was “correct” and I was now wrong. He decided to stay behind and watch me from a distance, then complain about me again, which royally fucked me off.\n\nAndy was an old boy, he had joint pains and issues fully doing the process, but he toughed it out. \n\nOne day I come in to Andy’s manager waiting for me. He wants me to agree to changing the process to suit Andy better. We would drill holes 1 and 2 and the person after us would drill hole 3, but with the way things were set up, it would be easier for Andy to drill holes 1 and 3, and let the other guy drill hole 2.\n\nI refused.\n\nI said that there’s no way I can drill hole 3, it doesn’t work for me. If Andy needs accommodations, he should be moved. I got into a big argument with his manager, but there was nothing they could do. The process stayed that way for the next ~2 years. I like to think that he suffered for the next year until he retired. \n\nI eventually got the process order changed back after showing my new opposite how efficient it was, weird that!\n\nI came to find out when I spoke to Matt one day that Andy had 0 friends in the business, no one liked him and he sat alone at lunch. Oh well.",
        "created_utc": 1675852550,
        "upvote_ratio": 1.0
    },
    {
        "title": "A Girl Who Was Scored Top Regularly Being Alone In Class",
        "author": "lifestorykids",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/10wse83/a_girl_who_was_scored_top_regularly_being_alone/",
        "text": "[removed]",
        "created_utc": 1675848593,
        "upvote_ratio": 1.0
    },
    {
        "title": "Help me get my sister's ex back",
        "author": "NoseHot1852",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/10wrdkx/help_me_get_my_sisters_ex_back/",
        "text": "[removed]",
        "created_utc": 1675844534,
        "upvote_ratio": 1.0
    },
    {
        "title": "an accidental revenge on my high school crush",
        "author": "spaaaaamisgoood",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/10wpdt0/an_accidental_revenge_on_my_high_school_crush/",
        "text": "[removed]",
        "created_utc": 1675837340,
        "upvote_ratio": 1.0
    },
    {
        "title": "How my life fell apart, part one: the ex-boyfriend",
        "author": "parry_otter_394",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/10wp26d/how_my_life_fell_apart_part_one_the_exboyfriend/",
        "text": "[removed]",
        "created_utc": 1675836272,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is my sis the bad guy",
        "author": "Money-Ad6262",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/10wlrp5/is_my_sis_the_bad_guy/",
        "text": "[removed]",
        "created_utc": 1675826197,
        "upvote_ratio": 1.0
    },
    {
        "title": "The death toll from the earthquake exceeded 7,800",
        "author": "trucall2120",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/10wl0pu/the_death_toll_from_the_earthquake_exceeded_7800/",
        "text": "[removed]",
        "created_utc": 1675824063,
        "upvote_ratio": 1.0
    },
    {
        "title": "Want to call me a transphobe over a videogame? I’ll pull an uno reverse on you",
        "author": "Depressed-NotEmo",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/10wji6o/want_to_call_me_a_transphobe_over_a_videogame_ill/",
        "text": "You can probably guess from the title that this is about the oh so controversial Hogwarts Legacy game. I have major issues with JK’s hateful rhetoric on twitter but I’ve been obsessed with Harry Potter (more specifically with the idea of an entire magical world where I could be a damn wizard) I read all the books, played all the PS1 and old pc games, got merch of my Hogwarts house etc so when an open world Potter inspired RPG game was announced I was hyped the hell up because YES I can be a wizard! Then when JK gave up on keeping her big prejudiced trap shut and I read through what she was saying online (and who she was promoting) I felt sick to have ever looked up to her as an author—but I still knew that I loved the fantasy world she’d created. I kept up with the trailers, teasers etc of the game and was posting on social media, excitedly theorising on what features could be in the game and what the plot could be, which of course summoned the social justice keyboard warriors who proceeded to spam me with vile messages about how much of disgusting person I am, how liking the Potter books and anything related to them made me a terf, how I should unalive myself, that I’m a transphobe etc. The best part? I wasn’t even planning on buying the game since its a lot of money for someone with a limited budget, I was probably going to watch a few streams of gameplay, but that was about it. Here’s why I didn’t just block/report, why I decided to make it personal. I’m not cis, not even slightly, so after having to deal with years of gender dysphoria, body dysmorphia, unsupportive family members, doctors not listening to me etc being accused of transphobia was something I took very personally and decided that some petty revenge was warranted. So I took great joy in preordering a copy of the game for my PS4 (too broke for a PS5) and taking the time to send a screenshot of the order confirmation to every single person that insulted me along with a lovely little note informing them that, by the way, you’ve been harrassing a trans person online and told them to commit unalive, which sounds a lot more transphobic that buying a videogames. Boy oh boy I’ve never seen so many comments be deleted so quickly. Is it petty? yes. Do I regret it? No, I’m cackling like a little gremlin and feeling very smug at the moment and as a bonus I’m getting a game that let’s me be a F-ing wizard.",
        "created_utc": 1675819896,
        "upvote_ratio": 1.0
    },
    {
        "title": "Amusement park quitting... then return",
        "author": "Fancy_Upstairs5898",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/10wh715/amusement_park_quitting_then_return/",
        "text": "This is somewhere between pretty revenge and malicious compliance.... \n\nWhen I was in college (late 90's) working in the theatre at an amusement park nearby as a summer job, a whole pile of groundskeeping staff quit 2 weeks before school started.  They decided that the theatre crew would have to pick up garbage and sweep the area around their venue.  So I talked to my manager about how I didn't want to do that work and it isn't the job I signed on for.  They gave me the do it, or quit ultimatum, so I gave them my 2 weeks notice. \n\n I start the new term at school and about 3 weeks in, I get a call from another manager there that I really liked, begging me to come in to work one concert that they were really short staffed for.  I agreed and worked the day, very professionally, but not killing myself to make it happen. \n\nAt 60min to show time, the lighting lead asked me to work follow-spot for the show.   I hate that particular job.  I wasn't interested in the artist, the spots they had were really good at creating lower back pain and if you had to pee mid-show, you better hope that your water bottle was empty.  So I said no and they replied with, \"But you have to do what I say!\"\n\n\"Um, nope. I'm sure that if you talk to 'manager' you'll find that I don't.\"\n\nSure enough, the manager comes up to me and asks, \"So you won't do follow-spot?\"\n\n\"Nope\"\n\n\"Ok, I guess we'll find someone else\"\n\nMan that show was the most stress free day at work I ever had.",
        "created_utc": 1675813776,
        "upvote_ratio": 1.0
    },
    {
        "title": "No sleep til Chiapas",
        "author": "K4FFT4N",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/10wgoeq/no_sleep_til_chiapas/",
        "text": "[removed]",
        "created_utc": 1675812449,
        "upvote_ratio": 1.0
    },
    {
        "title": "Online Scammer Picked The Wrong Target.",
        "author": "Loosie22",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/10wg84z/online_scammer_picked_the_wrong_target/",
        "text": "[removed]",
        "created_utc": 1675811325,
        "upvote_ratio": 1.0
    },
    {
        "title": "Im the biggest ass hole ever",
        "author": "thomasspear83",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/10wg4ov/im_the_biggest_ass_hole_ever/",
        "text": "[removed]",
        "created_utc": 1675811086,
        "upvote_ratio": 1.0
    },
    {
        "title": "If you're so desperate for toilet paper and paper-towels to steal them from me...might as well send you enough to last you a few years...",
        "author": "NoGoodDeed3579",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/10wfzbp/if_youre_so_desperate_for_toilet_paper_and/",
        "text": "[removed]",
        "created_utc": 1675810740,
        "upvote_ratio": 1.0
    },
    {
        "title": "Ex acquaintance insulted my appearance publicly so I made sure she wouldn't get a $50,000 prize",
        "author": "Daligheri",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/10wfxjb/ex_acquaintance_insulted_my_appearance_publicly/",
        "text": "We'll call her Missy. I imagine if she has reddit (which I'm pretty sure she does) and she finds this, she will know regardless it's about her. \n\nMissy and I were never officially friends. Our best friends were friends and often, the four of us would go out together. Missy was just rude in general and often made snarky comments when I would try to engage in conversation with her. She liked being the 'smartest one in the room' if that's a good way to put it. \n\nWhen our friends went separate ways, so did we. I never heard from Missy again. That was until I had joined a facebook group. The facebook group belonged to a certain large fandom at the height of the fandom becoming a tv show on Netflix. Several people posted their cosplay photos, so I posted mine. All around good comments and everyone was very kind. Except one in particular I recognized. \n\nMissy. She had commented and insulted my makeup skills and laugh reacted the photo and went as far as insulting my gender (I am FTM and was cosplaying a male character). I responded to reintroduce myself to her. She was shocked it was me and I tried playing nice and asking how she was. She ended up blocking me. \n\nA few months later, I saw her husband post something on facebook about Missy being in the running for a huge social media contest and she was actually in the top 50. The prize? 50k. I checked out her 'profile' on the contest site and it was self written, speaking about how kind she is and how non-judgmental she is. I had a good laugh about it. \n\nThen I found out, you can vote multiple times a week, multiple times for each contestant the remaining 8 weeks of the contest. So I decided to dedicate myself to ensuring she wouldn't get the prize and be the face of the 'non-judgmental girl of the year' and voted against her every single day, multiple times a day, for 8 weeks. \n\nShe was knocked out of the running halfway through the 8 weeks due to low numbers. \n\nMissy, if you see this, you will know it was me. Don't be a vvitch(er).",
        "created_utc": 1675810612,
        "upvote_ratio": 1.0
    },
    {
        "title": "My ex irritated me so I touched his soul",
        "author": "No-Concept-Sag84",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/10wf3mz/my_ex_irritated_me_so_i_touched_his_soul/",
        "text": "So my 1st ex-husband is bipolar. He randomly calls or pops up in fits of rage or trying to start drama to soothe whatever part of his brain needs that dopamine fix and adrenaline rush he gets from the drama he creates. Yep he's currently unmedicated. Refuses medical care for it. He believes the drs are wrong. Everyone is wrong and is out to make him look crazy.\n\n He calls and I answer unaware there was an issue. He starts with \"How are you mad at Pooter over a tablet you ain't buy\". Pooter is our oldest together. Now the tablet hes referring to is an old fire tablet his moms sister bought 4 years ago. It was recently found at his moms house with a cracked screen. Neither he, his parents, aunt that bought the tablet or cousins or siblings could figure out how to factory reset it. Guess Google only works for me....must be special 🤣.\n\nI reset it and everything is fine then BOOM! He called back 37 times in one day. On the 38th he left a voice mail THREATENING MY LIFE AND SAFETY and calling my 5 year old son a mistake.\n\nI called him back and told him \"By definition YOU'RE the walking EMBODIMENT OF A MISTAKE. YOU only exist because YOUR mom was cheating on her current husband with her ex husband, whom she previously left for the current one.\" I followed up with, \"your bio dad denied you just to keep his new wife and kids happy and my son was planned. You were a literal mistake; an accident if you will! Your existence literally RUINED WHOLE MARRIAGES AND LIVES! After all ONLY A MISTAKE IS NAMED AFTER THE WRONG PAPPY....You were 18/19 when you found out the truth...accidentally on purpose right? Are you mad that he's a jr and you are too but he's named after his actual father? Does that bother you?\"\n\nAnd that folks is when I brought him to tears and didn't feel any guilt.",
        "created_utc": 1675808606,
        "upvote_ratio": 1.0
    },
    {
        "title": "Dating mr. Money bags",
        "author": "HotNet351",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/10wez9w/dating_mr_money_bags/",
        "text": "[removed]",
        "created_utc": 1675808326,
        "upvote_ratio": 1.0
    },
    {
        "title": "Petty little revenge taken on my smoker sister",
        "author": "swedishguynot",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/10weefc/petty_little_revenge_taken_on_my_smoker_sister/",
        "text": "So, my sister  (22F)  and I (20M) live in a two-bedroom apartment in a city in Greece. We're both studying at the university, so my parents pay the rent and give us a monthly allowance. \n\nLast week, my sister started smoking cigarettes in her bedroom, inside the house. Since it is winter, it's fairly cold outside and she kept her window closed. That means that the whole apartment smelt like smoke. Now, the smell of smoke is really annoying to me and therefore I'm not a smoker. \n\nI tried telling her that it's not fair to me that she smokes in the apartment. She replied with a bitchy attitude, saying \"Fuck off\". \n\nI decided to let it slip and not make it a big deal, because I thought that she wouldn't do it again. Next day comes, I get inside the apartment and there it is. The fucking smell of smoke. In the entire apartment. I asked her again not to smoke inside, because it's really annoying to me. She told me that she is only smoking in her bedroom and that it is her right to do so. \n\nSo, few days later, I come up with a revenge. \n\nThis week, she is having exams every day in her uni. That means that she needs a quiet environment in order to study and sleep. It was 11:00 PM.  I was sitting in the living room with my friend and decided to play some music on my phone. \n\n30 seconds later, she rushed through the door, demanding that I turn off the music immediately. I replied with the same \"Fuck off\" that she told me when I asked her not to smoke. Then, she started getting absolutely mad and she threatened to break my phone. I told her that if she said sorry about smoking inside and promised that she wouldn't do it again, I would turn off the music. \n\nObviously, she didn't. She went to her room and called my father and started crying and yelling on the phone. Minutes later, she wore her shoes and exited the apartment while murmuring something like \"You will see what I'll do to you\".  Then, she slammed the door behind her. \n\nI'm really sorry that I have to act in this way. I really don't like it. But in the end, why should I respect someone that doesn't give a fuck about me? What's your opinion, did I take it too far?",
        "created_utc": 1675806965,
        "upvote_ratio": 1.0
    },
    {
        "title": "My ex cheated on me so I cheated on him months later, AMTA?",
        "author": "3lain33",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/10wdqem/my_ex_cheated_on_me_so_i_cheated_on_him_months/",
        "text": "[removed]",
        "created_utc": 1675805360,
        "upvote_ratio": 1.0
    },
    {
        "title": "I cheated on my boyfriend because he cheated on me, AMTA?",
        "author": "3lain33",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/10wdmqs/i_cheated_on_my_boyfriend_because_he_cheated_on/",
        "text": "[removed]",
        "created_utc": 1675805113,
        "upvote_ratio": 1.0
    },
    {
        "title": "Most horrendous work environment I’ve ever been in - so I licked all the biscuits in the staff room on my last day.",
        "author": "Adepta_Sororitas_KT",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/10wczbn/most_horrendous_work_environment_ive_ever_been_in/",
        "text": "[removed]",
        "created_utc": 1675803604,
        "upvote_ratio": 1.0
    },
    {
        "title": "Stinky Feet on Plane = Goodbye Shoe",
        "author": "PAPointGuy",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/10wb4ol/stinky_feet_on_plane_goodbye_shoe/",
        "text": "As he wedged his large, sweaty frame into the center seat next to my aisle seat, I knew it was going to be a long flight (Pittsburgh to San Francisco). Then he took off his shoes--I'm not going to say it was the worst stink, but it was hot foot juice none the less. I should have said something right away, but chose to sit there and brood.   \n\n\nSeveral hours into the flight, I noticed he was sleeping. Inspiration struck. I reached under his seat and was able to get one out (by the shoe string I should add). I then carried his solo shoe all the way to the back of the plane and put it in an overhead.   \n\n\nWhen we got the announcement we were starting our decent, stank toes began to wake. I could see him feeling around with his foot for his missing shoe. Then, he did that awkward 'half bend' trying to feel with his hands. Then he asked everyone around him to look. He was getting more and more panicked by the minute. I assured him it must have slid forward or backward and it would turn up.  \n\n\nAs I was exiting the plane, I had a brief conversation with the flight attendant: All I said was there is a guy seat 2C (or whatever) who is missing a shoe. After everyone is off, look in the overhead in the back left side of the plane. She realized what was happening and smiled.   \n\n\nI sat outside the plane waiting for him to exit. Dead last. Hope he learned a lesson.",
        "created_utc": 1675799226,
        "upvote_ratio": 1.0
    },
    {
        "title": "Don’t like me pointing out your mistakes? Fine, I’ll stop",
        "author": "messedupProgrammer",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/10wap57/dont_like_me_pointing_out_your_mistakes_fine_ill/",
        "text": "Alt account. On Mobile. English is my native language, but I still make mistakes. \n\nI work as a Software Engineer. Recently started working on a new project within the org. It was already being worked on by a few folks, but primarily by one person. Let’s call them DD. DD apparently came in through a referral from someone in upper management and had no experience or knowledge on anything to do with the project. Was learning on the job, but lacked knowledge on even the basic stuff. One example of what they did - the project needs a framework X to run. DD claimed that they had tested everything on their machine and all good to test. But none of us could run it. Asked DD the version of X they were using to run it to identify the cause. Turns out, they didn’t actually install X. But still claimed that the code runs. Had enough of them and spent a couple of days fixing it ourselves. \n\nRecently I had been going through the code and noticed that the code had some issues. It was doing a requirement R, but not in a correct way which would lead to a lot of bad results from the code. Pointed this out in the dev group and mentioned that we have been giving people the impression that these components are done, when are having issues like this. \n\nThey then scheduled a call with me and in the call explained a very bad reasoning for why it is done the way it is done wrong. The equivalent to it would be - “I didn’t get power with the fuse connected. So I removed it and directly connected the wires. So everything works now”. Then they proceeded to lecture me saying that I shouldn’t point such stuff out since it is mean and that this change would be taken up as an enhancement. I tried to argue saying an enhancement would be an improvement on something that already works. But what we have does not work, at-least not in the way it is supposed to work. I also explained that I wasn’t being mean and that I was just pointing out the issues we have in our code. They kept repeating that I was mean and I shouldn’t be mentioning them in the group (it is just the devs who work on this in the group and they are the most senior one there) and that it will affect the team harmony. After a while, I had enough of them so just said okay and brought the call to an end. \n\n\nSince then, I have spotted several other issues. But I am not pointing it out as they asked and I have started looking for another job. \n\nNote: The changes we are working on aren’t live yet, but will be soon. Will share details about the fallout then.",
        "created_utc": 1675798193,
        "upvote_ratio": 1.0
    },
    {
        "title": "My Furry tales",
        "author": "FurryLife_happy",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/10w9tma/my_furry_tales/",
        "text": "[removed]",
        "created_utc": 1675796102,
        "upvote_ratio": 1.0
    },
    {
        "title": "I want my money back",
        "author": "FastLingonberry5579",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/10w6csf/i_want_my_money_back/",
        "text": "[removed]",
        "created_utc": 1675787998,
        "upvote_ratio": 1.0
    },
    {
        "title": "I got revenge on my crushs bf!",
        "author": "RecipeResponsible824",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/10w679d/i_got_revenge_on_my_crushs_bf/",
        "text": "[removed]",
        "created_utc": 1675787613,
        "upvote_ratio": 1.0
    },
    {
        "title": "Prevent me from sleeping by keeping your tv on at night ? I'll just turn your power off.",
        "author": "philcaduc",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/10w08rm/prevent_me_from_sleeping_by_keeping_your_tv_on_at/",
        "text": "A long time ago, I was living in a ground floor appartment with a separate entrance, in a 5 floors building. One night, I woke up around midnight because a neighbour from upstairs was watching TV very loudly. I was very tired and did not want to get up, get dressed (it was winter time), go in the street to the main entrance of the building and find the right appartment to make it stop. I tried ignoring it, fell asleep and woke up again, then I hit the ceiling with a broom several times and it stopped.\nThe same happened a few more times. It was quiet for a few weeks, and then my neighbour started to do it again, and it was even LOUDER, I could recognize what he was watching, the lame tv movies that are broadcasted on public TV at night. I tried the broom again, but it did not work anymore. The worst part was that I could almost fall asleep while the characters spoke, but then a commercial or strong background music would come and wake me up. So, at around 2am, I went to find the right door. It was easy, the volume was so high I could listen to the whole show from the lobby. I knocked, rang the Bell. No answer. Talked through the door. No answer. I waited for a while, tried again. No answer. And then I heard... snorring. The guy was sleeping !! Despite his tv being full volume,  and me banging his door. I was pretty pissed off at that point. Then I had a radical idea. As I used the common garbage bins, I had the key to the service/utility room. I opened the power panel, and tried switching off and on every breaker until I found the one that turned off his TV. I went to sleep in peace. \nAfter that night, there were a couple more times when it happened again. I went straight to the breaker, each time. I guess third time's a charm because I never heard his TV again after that.",
        "created_utc": 1675771707,
        "upvote_ratio": 1.0
    },
    {
        "title": "My just desserts",
        "author": "Pannda0017",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/10vxgc0/my_just_desserts/",
        "text": "[removed]",
        "created_utc": 1675761125,
        "upvote_ratio": 0.99
    },
    {
        "title": "To be petty or not be petty",
        "author": "Grouchy-Tax4467",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/10vua6v/to_be_petty_or_not_be_petty/",
        "text": "So I am living in a student housing apartments ( pretty much individual leases for each room and everything else is shared)   me 25F have a roommate let's call her jan 60F now jan has been here for two years pretty much has the whole apartment filled with her stuff, now for some reason jan likes to gatekeep everything, if I move her stuff on the kitchen counter she has a fit, if I move her stuff in any share area she has a fit, if I asked her to make space for me in the share area she has a fit 🫤 annoying and lucky me her butt is not allowed to renew for the upcoming year BUT I've been sick and tired of not being able to use the share area that I pay for too so one night  I see she put some clothes in the dryer then just went to bed, soooo I was like oh no mama so I knocked on her door until she answered ( you know since she doesn't like me touching her stuff) and asked are you done with the dryer 🤣 her butt was stumbling out of bed and took her stuff out the dryer and I just threw in some random sheets.",
        "created_utc": 1675749409,
        "upvote_ratio": 1.0
    },
    {
        "title": "smashed my ex-stepmoms stuff",
        "author": "Purpple-cow",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/10vrzpr/smashed_my_exstepmoms_stuff/",
        "text": "[removed]",
        "created_utc": 1675742594,
        "upvote_ratio": 1.0
    },
    {
        "title": "disfrutando de bodas de plomo... entretenida película",
        "author": "Ok_Creme_5706",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/10vp1zg/disfrutando_de_bodas_de_plomo_entretenida_película/",
        "text": "",
        "created_utc": 1675734700,
        "upvote_ratio": 1.0
    },
    {
        "title": "Bann the word \"An\"",
        "author": "Puppyblogger",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/10vnu5k/bann_the_word_an/",
        "text": "[removed]",
        "created_utc": 1675731539,
        "upvote_ratio": 1.0
    },
    {
        "title": "Snooty customer gets comeuppance",
        "author": "Master_Ranger4729",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/10vkmq6/snooty_customer_gets_comeuppance/",
        "text": "About 15 or so years ago I had a very brief stint working at a mobile phone operator in their customer care centre. It wasn’t the easiest of gigs and to make it worse the company argued that £14k a year warranted us to have thicker skin when it came from verbal abuse from customers on the phone. \n\nI remember my last day, I was quite content and happy enough that I was leaving, everyone was nice enough. Then it must have been one of the last few calls. An  extremely snooty and patronising man called up and explained he’d had his phone cut off for no reason. I looked into the system and relayed off his contact details and then got to payment info. Turned out they’d somehow took the wrong credit card details in the shop (no idea how that happened, it must have been manual in the day). I then apologised (on behalf of the company) and asked “could I get your card info?”to which the man replied “oh yes that would be helpful wouldn’t it? You absolute arsehole”. \n\nI smiled, sat back and took my hands off the keyboard for what I was ready to enter the key details. I repeated each number he said like I was typing it and told him he’d have his phone back online within an hour.",
        "created_utc": 1675723372,
        "upvote_ratio": 1.0
    },
    {
        "title": "Get your trash delivered back to you.",
        "author": "nastywomenbinders",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/10vk8a8/get_your_trash_delivered_back_to_you/",
        "text": "[removed]",
        "created_utc": 1675722403,
        "upvote_ratio": 1.0
    },
    {
        "title": "Lying ex gets greedy, files for child support and ends up with nothing",
        "author": "birdlawlawyer293939",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/10vjui8/lying_ex_gets_greedy_files_for_child_support_and/",
        "text": "So back in March last year, I had tried settling with my ex for 100 dollars above guideline early last year after we signed a stipulation agreement where I had 35% timeshare.  I offered more because we make similar salaries (she makes slightly more) and felt bad because the amount wasn’t that high.\n\nBut she got greedy and thought negotiations were “taking too long” and that she could get more, so ghosted me and filed with child support (DCSS) with an old address for me. DCSS tried super hard to push through a very high CS amount based on 0% custody and 0% income for her. \n\nLuckily I had mail forwarding set up and put my phone number into the DCSS website.  DCSS called me and I was able to file an answer within the allotted time.  It then took 8 months to get a hearing, the entire time my ex could have been getting paid if she had settled.\n\nDuring this period she lost some custody due to things unrelated to child support so timeshare changed to 50/50.\n\nIn her filings and at the hearing she lied about the timeshare trying to use a very old order that was only in place for about 2 months to claim I only had 22% timeshare to get backpay (during backpay period I actually had the kids 45% of the time).\n\nThe outcome of all this was after almost a year, the judge ordered 0 backpay and 0 CS going forward.  I am so relieved.\n\nMy ex still refuses to pay any of the unreimbursed medical fees but whatever, I pay them, just as I provide school supplies, extracurricular payments, and purchase their clothes (so don’t worry about her not being able to provide for the kids, she just bought our older son some 200 dollar jordans and a 100 dollar lizard to replace the one she killed).",
        "created_utc": 1675721493,
        "upvote_ratio": 1.0
    },
    {
        "title": "Music Wars",
        "author": "Dense-Tutor-2771",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/10vhzqf/music_wars/",
        "text": "I was reminded of this petty revenge when I heard a song on the radio, and despite hating the song know all the words thanks to my little bro'.\n\nHe had a habit of getting home from school, going into his pit (bedroom) &amp; playing his latest CD at window rattling volume, which is a) incredibly annoying when you're attempting not to fail your A levels (UK based) &amp; b) the reason he now has hearing issues.\n\nAs my folks worked full time, they had no idea about his annoying habit.\n\nCue petty revenge, one day I had enough of his shit &amp; he'd borrowed one of Mums albums which he was blasting loudly (Paul McCartney Tug of War btw) luckily this was an album I liked.\n\nAs I was moving out soon I'd bought the album on CD, so I loaded it up, waited til the next track started, then about a minute into the next track I pressed play &amp; cranked the volume up higher (as a hi-fi geek I had better kit than him) the more he protested, the louder I went.\n\nSo all the time he tried to finish the album, he got his track, then mine blasted louder a minute behind.\n\nHe didn't do it again.",
        "created_utc": 1675717140,
        "upvote_ratio": 1.0
    },
    {
        "title": "Quit as the head of the college bakery and walked out with all my recipes, 45 minutes before lunch service started.",
        "author": "Wise-Knowledge-3471",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/10vg0my/quit_as_the_head_of_the_college_bakery_and_walked/",
        "text": "[removed]",
        "created_utc": 1675712674,
        "upvote_ratio": 1.0
    },
    {
        "title": "My mom’s boyfriend really annoys me",
        "author": "Low_Geologist4093",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/10vf6ni/my_moms_boyfriend_really_annoys_me/",
        "text": "[removed]",
        "created_utc": 1675710766,
        "upvote_ratio": 1.0
    },
    {
        "title": "Bitch ass neighbour playing a random ass 'toy' alarm every 5 minutes - the sounds are gunshots and barking dogs",
        "author": "OneSugarTspPls",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/10veska/bitch_ass_neighbour_playing_a_random_ass_toy/",
        "text": "Every 5 minutes this old ass bitch ass senile motherfucking nazi ass neighbour plays an alarm. Not even house alarm. An alarm he hangs outside. We asked him 2-3 times. He stopped for an hour / half a day then continued. For a few days it was changed to **only** every 20 minutes. Now its back to every 5 minutes.  \n\n\nGunshots and barking guard dogs. Every 5 minutes. From 16:00 till 23:00.   \nFor the first day 2 weeks ago it was past 23:00. Now he \"changed\" it on purpose (I assume on purpose) to be on \"legal times\" Nazi ass bitch.  \n\n\nPolice won't do shit. He is also a very bitch ass thats experienced in lawing people. So I feel like he is baiting us or others, idk what this cunt wants.  \n\n\nThe only way I can maybe get to him is to get somewhat a large speaker and blast music from 08:00 til 23:00 in the allowed hours. But I don't have any + his hearing isnt good, cause apparently \"he didnt hear the alarm\" from his house. Either he is lying, or his hearing really is shit, then no speaker would help",
        "created_utc": 1675709875,
        "upvote_ratio": 1.0
    },
    {
        "title": "Ex boss did not expect this",
        "author": "chubfri88",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/10vdzgg/ex_boss_did_not_expect_this/",
        "text": "[removed]",
        "created_utc": 1675707997,
        "upvote_ratio": 1.0
    },
    {
        "title": "Expensive behaviour",
        "author": "chubfri88",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/10vdypm/expensive_behaviour/",
        "text": "[removed]",
        "created_utc": 1675707951,
        "upvote_ratio": 1.0
    },
    {
        "title": "That is not what the (ex) boss wanted",
        "author": "chubfri88",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/10vdtvu/that_is_not_what_the_ex_boss_wanted/",
        "text": "[removed]",
        "created_utc": 1675707647,
        "upvote_ratio": 1.0
    },
    {
        "title": "I failed on my revenge",
        "author": "No_Syllabub_4264",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/10vds8n/i_failed_on_my_revenge/",
        "text": "For a while I’ve been noticing a lot going on at work. I was quite happy in a late shift, but was moved into early shift a while ago. Boss mentioned I would be back in late shift soon. \n\nIt didn’t happen. My collegues are mad I got a few cents more pay in the late shift, so called it a ’shady payraise’. They do have an option to move into late shift, but they don’t want to. \n\nSo I was kept in early shift. It made me a little angry. Boss has been absolutely amazing, so I desided my petty revenge should not hurt him or my job. My plan? I knew I was better than most at my job. So I almost doubled my effort without letting quality drop. I did a new speed record. They don’t want me get a raise from late hours, so let’s get something more permanent. In two weeks I normalized the speed I felt possible to keep up. \n\nAnd why it failed? I let the boss know about the speed record. I modified a certain tool to make my job easier and thus faster. Boss was happy and amazed.\nBefore the next payday our union blew everything up. Raises are freezed, no overtime allowed. They are planning strikes and nobody knows when things get back to normal. F my luck.",
        "created_utc": 1675707547,
        "upvote_ratio": 1.0
    },
    {
        "title": "Volunteer travel",
        "author": "More_Way_8712",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/10vcnnb/volunteer_travel/",
        "text": "[removed]",
        "created_utc": 1675705016,
        "upvote_ratio": 1.0
    },
    {
        "title": "My boss's golden retriever loves to bring squeaky toys to work",
        "author": "Bert_no_ernie",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/10vcm52/my_bosss_golden_retriever_loves_to_bring_squeaky/",
        "text": "First thing, I love my boss's dog, Rory. I work in an office, and on most days when Rory comes to work he's a joy. He's a golden retriever and is super well-behaved and happy, but sometimes, Rory brings a squeaky toy to work. My boss is seemingly immune to the squeaks, but for the rest of us, it's agony. It's like a squeak every 20 seconds. Usually we have to wait for Rory to chew through his toys' squeakers - hours, days. We don't really want to say anything because he's so good, but one Monday, my will to ignore it broke. I had awoken with pounding headache, and the caffeine was not alleviating the pain. Each new squeak felt like the smallest of needles passing through my brain right behind my eyes.  I'm not proud of this (yes I am), but my boy in IT has a cordless drill on hand that he let me borrow. I took Rory's pink penguin right from under his nose, faked a throw down the hall, and hid the stuffy in the back of my shirt. With Rory bewildered, I took the toy into my office and felt around the toy for the squeak valve. Once I found it, I took my pocket knife and made a small incision in the fuzzy layer, and with the borrowed IT drill, I carefully drilled a 1/8\" hole through the squeaker's valve, silencing the animal forever, before throwing it back to Rory.   \n\n\nNow I just do it automatically when Rory gets a new squeaky toy. People seem be genuinely grateful, and my boss assumes Rory chewed through his toy.\n\n&amp;#x200B;\n\nTLDR: The squeaky toy version of an icicle murder",
        "created_utc": 1675704921,
        "upvote_ratio": 1.0
    },
    {
        "title": "Call me a whore?",
        "author": "toxicduckz",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/10vaoep/call_me_a_whore/",
        "text": "[removed]",
        "created_utc": 1675700412,
        "upvote_ratio": 1.0
    },
    {
        "title": "Got bullied at the work-place and did the pettiest thing and got fired.",
        "author": "TheKingOfHeartsss",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/10v94mk/got_bullied_at_the_workplace_and_did_the_pettiest/",
        "text": "[removed]",
        "created_utc": 1675696689,
        "upvote_ratio": 1.0
    },
    {
        "title": "He needed to learn to be afraid of women",
        "author": "spideratemyface",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/10v8vj3/he_needed_to_learn_to_be_afraid_of_women/",
        "text": "I used to go to a certain 24 hr gas station close to my house around 3 or 4am regularly b/c that's when I got off work and not much else was open.  It was usually the same guy working. He was always  friendly but not really creepy seeming. \n\nOne night I was just getting some honey and he said dont worry about paying. It was odd but I figured maybe he already counted his drawer or was mad at his boss. Whatever.  Then he said hold on I wanna show you something and started walking toward the back. I followed him. Not nervous but I prefer a good amount of personal space so I stayed about 4 to 5 feet behind him. \n\nHe opened the door to the back room and I could see from where I was that it was just a stock room and it was mostly empty so when stepped in the door way and motioned for me to follow I stopped and asked what he wanted to show me. \n\nDude lunged at me, grabbed my arm and tried to yank me into the room. Fortunately for me I am really strong, a lot stronger than I look, and I grabbed him back yanked him away from the room toward the cameras and kinda threw him into the wall.  I said \"Thanks for the honey  bitch\" and I left.  \n\nAt first I was mad, then I was depressed about it.  I thought about calling the cops but in the place I lived they didnt even show up for gunshots half the time. I thought about calling his boss but he had been there for years and  a lot of times these things dont get taken seriously. I didnt know what I was gonna do but the next day I went in with my phone, clearly video taping him and when he saw me he smiled! He liked that I had him on video and called me honey and flexed his muscles for the camera. WTF?!? He literally just thought what he did was cool until I started talking and I let him know in no uncertain terms that I was angry.  His response was A  nervous  \" Oh are you gonna get your boyfriend to come do something to me?\" \n\nThat made me even more mad. Like why wasnt he afraid of me. He already knows Im stronger than him. But he had such little regard for women that he thinks what he did was ok and the only thing to worry about is if I got a man involved. \n\nThe more I thought about the more I started to worry about other women to cross his path. Not all women are as strong as I am and somebody else may have wound up in that back room. I thought he needed to learn that a woman can be scary and not feel so comfortable just casually assaulting us.  I didnt wanna hit him and go to jail so I made a plan, and it was a fun one. \n\nI kept going in at random intervals. Sometimes multiple days in a row. Sometimes not for weeks. Sometimes after work, sometimes after a performance, dressed in any kind of mask or strange dirty sweaty clothes I had worn on stage.  Every time was a new demented scenario. \n\nThe first time I put a handful of coins in my mouth. ( yeah its gross but worth it) It was well over the amount that honey cost. I walked in staring at him with a blank look on my face and grabbed a honey , never breaking eye contact. He was not happy to see me this time.\n\n He was on the phone and I walked toward the counter but stayed about 10 ft away and just stared. He tried to wave me to the register and cash me out while he was on the phone. He really didnt wanna interact with me and my dead stare started to creep him out pretty quickly.  \n\nIt took about 5 minutes for him to get off the phone. He was weirded out by this time but he couldnt really call the cops or do anything because I had him on video admitting to assaulting me. I held my ground and my stare. It was so hard not to smile as he got more and more nervous but I held on for about 10 solid minutes then slowly walked up to the  counter and opened my mouth, just let all the coins just fall out.  I stared blankly for another few seconds and walked out with my honey. \n\nEvery time was something equally crazy. Once I just kept opening candy at the counter taking one bite  then dropping it and saying\" It doesnt taste good. Why doesnt it taste good? I need it to taste good!!\" Then I left a 20 in the counter and walked out. Im not a thief. One time i just cheerfully  sang a cramps song and rearranged an entire aisle. Every time he tried to tell me to stop I death glared him and sang louder. \n \nI visited him often for around 6 months. Sometimes I would act like he was my best friend and just hang out at the counter telling him random nonsensical stories. Sometimes I would act like I was so heartbroken and sad about like the donut display or something. But I NEVER EVER let him speak. I would change my expression to a murder stare and keep talking but make my voice very loud and firm until he shut up. \n\nEventually he developed a twitch and I could tell he was truly miserable so I felt done.  My boyfriend really wanted to see this dude so I brought him in for one last visit. Did a whole introduction like we were buddies. We both leaned on the counter drinking soda and eating candy for about 30 minutes. It was earlier than usual do  a few other people were in and out. We were cheerful as fuck. \n\nI told him that I felt like he didnt like me as much as he used to. I told my boyfriend in front of him \" He used to like me A LOT!  He liked me so much he tried to drag me into that back room over there. You gotta really like someone to do that\" I asked him why he didnt like me as much as he used to. Told him I felt like I have been a really good friend. I even come to see him all the time. I even eat candy that doesnt taste good and help arrange shelves and sing him songs. I acted so hurt. So my boyfriend acted really offended and asked him why he doesnt like me as much.  He knew better than to speak by now so it was a real deer in the headlights scenario. \n\nAs we were leaving I said \" Oh, I have a present for you but I forgot it!!  It's ok, I'll just bring it to your house. Don't worry I wasn't following you or anything..I was just driving behind you and watching where you go! Bye!!\" Then I never went back.  \n\nI dont have any way of knowing if it worked but my hope is that next time this POS wants to put his hands on a woman that doesnt want it, he remembers the 6 months of hell the last one gave him.",
        "created_utc": 1675696056,
        "upvote_ratio": 1.0
    },
    {
        "title": "My ex barely spent any effort in our relationship despite me trying to communicate about it so many times, so I wrote an AITA post from his pov and sent it to him, and finally told his brothers gf about his brothers affairs.",
        "author": "Caliluxun",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/10v5jrk/my_ex_barely_spent_any_effort_in_our_relationship/",
        "text": "[removed]",
        "created_utc": 1675686951,
        "upvote_ratio": 1.0
    },
    {
        "title": "30[F4M]/tx/ Online - Bored emotionally drained and very horny.",
        "author": "AngelinaRose000",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/10v060f/30f4mtx_online_bored_emotionally_drained_and_very/",
        "text": "[removed]",
        "created_utc": 1675666521,
        "upvote_ratio": 1.0
    },
    {
        "title": "Question gentlemen and ladies.",
        "author": "Horror_Sort_6531",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/10v05s9/question_gentlemen_and_ladies/",
        "text": "[removed]",
        "created_utc": 1675666498,
        "upvote_ratio": 1.0
    },
    {
        "title": "The parking spot I waited patiently for got stolen",
        "author": "20236452",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/10uy4sg/the_parking_spot_i_waited_patiently_for_got_stolen/",
        "text": "Today I was waiting patiently for an entire family with a baby stroller to get in their car and for them to leave so I can take their spot. It was in a parking lot inside the mall and it's a Sunday and PACKED. I signaled very early right when I saw the family walking to their car. I was waiting patiently and then see that another car saw their spot as well and signals too a lot later than I did. I had already waited a few minutes already. I even waved my arm out at them to let them know I had been waiting for the spot already. They don't care. They then manage to steal the spot and I get really pissed and honk at them. \n\nThe next time something like this happens to me, I'm planning to put a sticky note on their windshield that says \"I hit your car\" (not actually damage it though) AND super glue/put wood glue on the back of it. I know some people will say to just get over it but nah, I can't let this happen to other people. People who steal other people's spots need to learn their lesson.",
        "created_utc": 1675659606,
        "upvote_ratio": 1.0
    },
    {
        "title": "I am making a confession. I was such a nutcase, idk why i had to be that crazy. Help...",
        "author": "Appleee_pieee",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/10uvo0d/i_am_making_a_confession_i_was_such_a_nutcase_idk/",
        "text": "[removed]",
        "created_utc": 1675652064,
        "upvote_ratio": 1.0
    },
    {
        "title": "Take away my door? That's fine, I'll make you scared of my room.",
        "author": "no-door-no-sleep",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/10utic6/take_away_my_door_thats_fine_ill_make_you_scared/",
        "text": "[removed]",
        "created_utc": 1675646065,
        "upvote_ratio": 1.0
    },
    {
        "title": "Take away my door? That's fine, I'll scare the hell out of you.",
        "author": "no-door-no-sleep",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/10utbvf/take_away_my_door_thats_fine_ill_scare_the_hell/",
        "text": "[removed]",
        "created_utc": 1675645585,
        "upvote_ratio": 1.0
    },
    {
        "title": "Revenge on my Cheating boyfriend",
        "author": "Gabriellaaxox",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/10uscr0/revenge_on_my_cheating_boyfriend/",
        "text": "[removed]",
        "created_utc": 1675643047,
        "upvote_ratio": 1.0
    },
    {
        "title": "Petty revenge at a woman treating a 10yr old girl like crap",
        "author": "Remarkable_Panda952",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/10us1i7/petty_revenge_at_a_woman_treating_a_10yr_old_girl/",
        "text": "[removed]",
        "created_utc": 1675642262,
        "upvote_ratio": 1.0
    },
    {
        "title": "Gave my kid a birthday party out of spite",
        "author": "Anjapayge",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/10ura0g/gave_my_kid_a_birthday_party_out_of_spite/",
        "text": "Our daughter was born a couple days before MIL’s birthday.  My original due date was MIL’s birthday, but I had to be induced early so I was able to pick her day.   Sharing birthdays suck - and especially if it’s with a woman who doesn’t respect you as an adult and boundaries.  \n\nIt was 2019 and MIL found out that she had another grandchild.  BIL found out through a paternity test that the girl he denied was his was actually his.  MIL backed her son up and once the paternity test was positive - Ohhhh! I have another granddaughter.  Lets all celebrate my birthday at Disney!  \n\nThe plan was renting a hotel room and all the grandkids visit which was our daughter, my niece, BIL and his new GF and her daughter and my husband and myself.  We had to pay for our daughter and us.  \n\nI didn’t think it was right we would have to pay for us when our daughter’s birthday was basically the same weekend and I’ve been to Disney with her.  She sucks all the fun out with her complaining.  \n\nOur daughter REALLY wanted a party.  She was turning 9.  And she has lots of friends.  I didn’t want to do a party because of the planning.  But because MIL was pushing us to go to Disney to celebrate her birthday, I told daughter - hey! How would you like that party?\n\nI planned it right when MIL planned her getaway.  And when MIL pushed I said so sorry, we have our daughter’s birthday party then.  \n\nI printed about 20 invites from Walgreens for the party to be held at the local park.  I let my daughter hand them out at the School Trunk or Treat.  She invited about 17 kids.  I then let daughter pick the menu and decorations and daughter had her party while MIL had hers. \n\nMy daughter had the best time and I didn’t have to deal with the drama of MIL and even BIL.  And the cost was probably cheaper than all of us going to Disney.",
        "created_utc": 1675640377,
        "upvote_ratio": 1.0
    },
    {
        "title": "The impossible Conservatory",
        "author": "Lemon_Plums",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/10ur9h6/the_impossible_conservatory/",
        "text": "[removed]",
        "created_utc": 1675640339,
        "upvote_ratio": 1.0
    },
    {
        "title": "The Impossible Conservatory",
        "author": "Lemon_Plums",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/10uqrzp/the_impossible_conservatory/",
        "text": "[removed]",
        "created_utc": 1675639122,
        "upvote_ratio": 1.0
    },
    {
        "title": "The impossible conservatory",
        "author": "Lemon_Plums",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/10uqii4/the_impossible_conservatory/",
        "text": "[removed]",
        "created_utc": 1675638447,
        "upvote_ratio": 1.0
    },
    {
        "title": "Keep bothering me about switching my seat? Fine, petty revenge it is.",
        "author": "BallLow3825",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/10upwk9/keep_bothering_me_about_switching_my_seat_fine/",
        "text": "[removed]",
        "created_utc": 1675636938,
        "upvote_ratio": 1.0
    },
    {
        "title": "Ex boss accused me of reporting his illegally downloaded software, so I did it anyway",
        "author": "doriangray433",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/10updvx/ex_boss_accused_me_of_reporting_his_illegally/",
        "text": "I left the job on what I thought was good terms after 6 months. The work wasn't as challenging as I'd hoped and the company was very small. As a younger person I wanted to be somewhere bigger.\n\nA few months later I'm getting on with my day when out of the blue I get a call from a private number. It was my old boss. He didn't bother to make small talk and went straight to asking if I'd reported his use of downloaded software (I didn't know this at the time but he admitted it by telling me). He was really paranoid and said the software company was onto him. \n\nWhen I told him I had no idea what he was talking about and that I was quite angry with this call, he raised his voice and became threatening. I was so pissed off I reported him straight after the phone call.",
        "created_utc": 1675635677,
        "upvote_ratio": 1.0
    },
    {
        "title": "Ex boss called me up after sacking me and accused me of reporting his illegal software, so I actually did it",
        "author": "doriangray433",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/10up24h/ex_boss_called_me_up_after_sacking_me_and_accused/",
        "text": "I left the job on what I thought was good terms after 6 months. The work wasn't as challenging as I'd hoped and the company was very small. As a younger person I wanted to be somewhere bigger.\n\nI'm getting on with my day 2 months later when out of the blue I get a call from a private number. It was my old boss. He didn't bother to make small talk and went straight to asking if I'd reported the use of downloaded software used (I didn't know this at the time but he admitted it by telling me). I was so pissed off I reported it straight after the phone call.",
        "created_utc": 1675634891,
        "upvote_ratio": 1.0
    },
    {
        "title": "HS bully encounter at a new shop in my old neighborhood",
        "author": "microfiber345",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/10uof47/hs_bully_encounter_at_a_new_shop_in_my_old/",
        "text": "[removed]",
        "created_utc": 1675633344,
        "upvote_ratio": 1.0
    },
    {
        "title": "Vigilante parking lot justice.",
        "author": "MrsBrightssside",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/10umt62/vigilante_parking_lot_justice/",
        "text": "Hey Reddit! Some context:\n1) Last week the drivers’ side passenger area of my van got sideswiped and the guy did a hit and run. It still runs, but my kids’ door is collapsed in and we haven’t been able to afford to get it fixed just yet. It looks pretty bad, but looks worse than it is. \n2) People who leave shopping carts in parking spaces are a personal pet peeve of mine. \n\nSo I’m sick, cold, not C0vid, and I go to my local Walgreens for some heavy DayQuil and Tylenol for my kids. I walk out and this woman my mom’s age (I’m 39) takes her shopping cart and very deliberately parks it in the painted over section between the only two handicapped spaces in the lot. Like, the part that’s supposed to be left clear so people can get out. It’s literally 15 steps to the door of the Walgreens. I reflexively call out,\n“In the HANDICAPPED space?? Really???”\nShe goes, “Yeah, I know…” and usually at this point (because I am one to always tell people, “the door is right there”) people get embarrassed and walk their cart to the door. Not this woman. \n\nShe launches into a whole soliloquy about how she thought about the placement because it’s close to the door so the person inside can grab it easily, and she put it there, on the “passenger” side so people can still pull in and they probably won’t have anyone with them anyway (wtf??? People with placards are loners now?) and anyway she gets it because her husband has has several bypasses so she understands how there things work. Btw all this took her at least twice as long to say as it would have taken for her to walk the darn cart to the door. \nMe: “Well. Glad you’ve got that all justified for yourself.”\nHer: (walking to her car) “I don’t need to be justified, I’m in love!” (No idea what this woman is talking about.)\nMe: (Getting into my car, which happens to be parked across the aisle from her) No, I meant your rudeness.”\nHer: Literally laughs as she climbs in her car. \n\nSo I back up and angle my car like I’m pulling out of the parking lot, but instead stop right in front of her hood. The banged in side of my car is in full view. Go ahead lady. Does it look like I care if my car gets hit? She goes nuts inside her car, yelling and leaning on the horn, I just turn off my engine and visibly pull out a book. The cart got put back.",
        "created_utc": 1675629517,
        "upvote_ratio": 1.0
    },
    {
        "title": "Johns Abusive Childhood Tale.",
        "author": "CompletelyBroke123",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/10ufiwl/johns_abusive_childhood_tale/",
        "text": "[removed]",
        "created_utc": 1675611963,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to piss off a privileged interior design major roommate",
        "author": "AstronautTham",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/10uei9d/how_to_piss_off_a_privileged_interior_design/",
        "text": "[removed]",
        "created_utc": 1675609326,
        "upvote_ratio": 1.0
    },
    {
        "title": "Treat your workers horribly? I won't save you when I have the chance.",
        "author": "ChaoticForkingGood",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/10udfd1/treat_your_workers_horribly_i_wont_save_you_when/",
        "text": "[removed]",
        "created_utc": 1675606473,
        "upvote_ratio": 1.0
    },
    {
        "title": "Don’t mess with someone who has receipts. They can (and will) absolutely light you up.",
        "author": "ItsStrib1978",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/10ublfi/dont_mess_with_someone_who_has_receipts_they_can/",
        "text": "[removed]",
        "created_utc": 1675601050,
        "upvote_ratio": 1.0
    },
    {
        "title": "Petty revenge after an argument",
        "author": "NecessaryHour3422",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/10u88wq/petty_revenge_after_an_argument/",
        "text": "[removed]",
        "created_utc": 1675587697,
        "upvote_ratio": 1.0
    },
    {
        "title": "Made the theater close",
        "author": "Left-Star2240",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/10u7cd5/made_the_theater_close/",
        "text": "This happened 20 years ago and is still a point of pride. I had a 2nd job at a movie theater when I 1st graduated college. Under the GM that hired me it was actually a pretty cool gig, then the company was sold and each GM after that got worse. \n\nI no longer needed the job an had turned in my notice. A snow storm hit Saturday night into Sunday. I was scheduled as the projectionist for the day shift. I also rented where I had to shovel out my car PLUS the entire driveway. \n\nI got the call that we had a delayed opening when I’d taken a break from shoveling. I was pissed off that I had to go in for 4 hours. ( I realize now I could’ve told them to F off and gone back to bed.) \n\nA couple hours into my shift (I’d started the matinee movies only) the evening projectionist called bc his street hadn’t even been plowed. \n\nThe lengths they went to to try to get me to stay were impressive, and if I hadn’t already turned in my notice I might’ve taken the money. The last offer they made was double time for a double shift (including the initial 2 hours that we were closed due to the storm) if I’d just start the 7 pm showing. And I just said the same thing I’d said the whole time they thought they were negotiating with me: that my shift was over at 6pm and I was unavailable after that. \n\nWe all got sent home early. The theater was closed for the day. My est day of my working life.",
        "created_utc": 1675584088,
        "upvote_ratio": 1.0
    },
    {
        "title": "Should I take him back",
        "author": "Fancy-Worldliness554",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/10u59he/should_i_take_him_back/",
        "text": "[removed]",
        "created_utc": 1675576453,
        "upvote_ratio": 1.0
    },
    {
        "title": "Don’t doubt someone who has receipts.",
        "author": "ItsStrib1978",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/10u0g4x/dont_doubt_someone_who_has_receipts/",
        "text": "[removed]",
        "created_utc": 1675569840,
        "upvote_ratio": 1.0
    },
    {
        "title": "No balls 😂",
        "author": "DARKSTALKER30",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/10tzujk/no_balls/",
        "text": "So I have this crush and I have this big plan to confess to her , but unfortunately this annoying girl that always prys into other peoples matters found out and has been threatening to expose me for 1 year . Today I realised that I didn’t give a damn if she exposed me so when she had a argument today and tried to pull out the “if y don’t stfu I’ll tell card” , I told her to do it , she actually said half the name before asking me if I want to be revealed , but what she didn’t expect was my reply . I just said go ahead and then she proceeded to say out her nickname before asking me the same question again . So I did the most unexpected thing and just said my crushes name myself in the group chat , since she was in a different school , I’m also a pretty average person in school, and not those popular kids so I realised that people won’t give a damn about me . I actually insulted her so hard she just dmed me apologising and asking me stop . So that’s the tale of my petty revenge",
        "created_utc": 1675567960,
        "upvote_ratio": 1.0
    },
    {
        "title": "Ultimate dixie cup payback for annoying rich dorm mate.",
        "author": "desidivo",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/10tzs5l/ultimate_dixie_cup_payback_for_annoying_rich_dorm/",
        "text": "This was many years ago when I was in college. We had mostly amazing people on our dorm (1st floor) except for Charles (who was very rich). He flaunted his wealth by pointing out his watch, computer and other items by saying how expensive they are and hope no one would steal them. \n\nAll the rooms in our dorm had vinyl flooring. This was not acceptable to him so he had his dad have some carpet guys come over during thanksgiving break and put wall to wall carpet down. \n\nIn December, the floor get cold and your would not want to walk on it barefoot so we all had slippers/flip flops we used to walk around the dorm. He would keep pointing out how nice it was to walk barefoot in his room and he wish he could get the hall way carpeted for the hallways. \n\nCue the petty revenge. When Christmas break arrived, we ask our floor preceptor to leave Charles room unlocked before leaving for Christmas break. The preceptor also hated this kid since we would complain about all kinds of things. All she said was not to steal anything or do anything that would have campus police investigate. \n\nSince a couple of my high school friends lived near by the college, we snuck into the dorm (no one was there on New Year's day). We bought about a huge case of small coated dixie cups, a stapler, huge box of staples and two water jugs. We started in the corner farthest away from door and would lay down dixie cups and staples them together. Then we would fill with water and work our way out to the door and leave enough room for the door to open.\n\nWe got back to the dorm early once school started and told everyone that someone was playing a joke on Charles and then we all waited in the common area till Charles came in and opened his door. The look on his face was worth all the trouble and money we spent on this. There was no way for him to remove the water since if he tried to pick up a cup it would pull the others cups and water would ruin his precious carpet. \n\nCharles was fuming and yelling and said he was going to go to the dean. We pointed out that would not be a good idea since the carpet was illegal and he would get in trouble for modifying the room, which strictly forbidden. When he realized that he was screwed, he had to walk over the cups to make a call to his dad since none of us would allow him to use our phone (only landline in those days). I am sure the clean up crew got paid a lot of money to clean up and restore the room. We became famous on campus after this and Charles left the school at the end of the semester. \n\nRevenge is best served in a dixie cup full of water.",
        "created_utc": 1675567763,
        "upvote_ratio": 1.0
    },
    {
        "title": "I don't know if this would be considered petty revenge or karma.",
        "author": "aprild99",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/10txo91/i_dont_know_if_this_would_be_considered_petty/",
        "text": "[removed]",
        "created_utc": 1675561544,
        "upvote_ratio": 1.0
    },
    {
        "title": "You think I stomp? Okay I'll stomp then.",
        "author": "WitchThatShit",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/10txnep/you_think_i_stomp_okay_ill_stomp_then/",
        "text": "This happened a few years ago when I was in college. In my college dorms we have apartments, and each dorm building is three stories tall. I was on the second floor, in the apartment closest to the stairs (this is important to remember). On the third floor above me was my best friend, and the apartment below me were strangers I didn't know.   \n\n\nOn the first day moving in, my roommate let me know that the dorm below had been blasting music loudly. I decided I would exchange numbers with them, with the idea that if I was unnecessarily loud they could let me know (the previous year I was on the first floor with very sexually active neighbors above me and it was awkward talking to them).   \n\n\nThis is where the issue would arise. They played music extremely loud. All the time. To the point it vibrated my apartment. Now you never hear anything from next door neighbors, so I'm not surprised their neighbors didn't notice anything, but oh boy I sure did. I would try to text them about them, but it would either get ignored or they'd get mad and tell me to just leave my apartment (which this was during the pandemic so expecting your neighbor to leave the dorm in the midst of Covid so you could blast music was mind boggling to me). At the same time they would claim that me and my roommate would stomp all the time(going so far as to slam a broom against their ceiling while we were sitting down for dinner). Which was also mind boggling because most the time I was either in classes, or passed out, or at my desk. My roommate was a very quiet person as well.  \n\n\nTheir noisiness got so bad that at one point, at 3 AM it woke me up. I had spoken to an RA at some point, but finally one came out this night and just sat with me in the dorm. The RA shock at how loud they were being. I showed them the texts we exchanged and they explained to me that no matter if it was quiet hours or not the dorms had curtesy rules. If you are too loud, you are too loud and you need to keep it down. You are expected to not cause a ruckus. In this case it was worse because you can get in trouble if you're unnecessarily loud during quiet hours, which we obviously were in. Furthermore, they explained, telling someone to leave the dorm because they complained you were loud was not okay.  \n\n\nIt took 2 hours before they finally stopped blasting music, and in the morning they sent an angry text to me about calling an RA on them for.... playing music at 10 am? Whatever, but they stopped playing music after that, but still would send confusing and snippy texts about me and my roommate stomping.  \n\n\nIn about a week I finally realized what they were talking about. They sent another text, except both me and my roommate were not in the dorm at the time. I realized that what they thought was us stomping, were in fact people stomping up and down the building's stairs. If you walked down them, you couldn't be heard, but if you ran or stomped down them you were extremely loud. I explained this to them, and from that point forward I never received a text from them again.  \n\n\nAnd it may have been small revenge, but I got great exercise and joy from stomping down those damn stairs every fucking day for the rest of the year. As loud as I could I would slam my feet on the shitty linoleum, and in the crusty hallway near their room. And I never heard a peep out of them because they assumed it was just some asshole on the stairs. They were right.  \n\n\n TLDR: Downstairs neighbor got in trouble for being loud, thought I was stomping above them, it was actually people in the stairwell, so I started stomping in the stairwell.",
        "created_utc": 1675561476,
        "upvote_ratio": 1.0
    },
    {
        "title": "Got revenge - felt great",
        "author": "Zackdelafan",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/10twqip/got_revenge_felt_great/",
        "text": "Hi just found this sub this morning and was excited to share my story from when I went to uni in Southampton nearly 20 years ago -\n\nSo I went to a house party and got there before any of my friends did . I poked my head into the living room and there was a dj set up and about four people in there . I didn’t know anyone so I just gave an awkward nod and went back into the hallway . The dj goes “who was that dickhead?” over the speakers and I hear everyone laugh . I was going through a rough time at that point and it really cut me . \n\nSo I proceeded to put drinks close to his decks all night . I was subtle but I made sure to keep stacking them up .\n\nSure enough I was talking to a girl in the kitchen when suddenly all the music cut out and the whole party gave out a collective sigh . Dj freaked out as his decks were ruined .\n\nIn answer to his q -\n\nI’m that dickhead :)",
        "created_utc": 1675558874,
        "upvote_ratio": 1.0
    },
    {
        "title": "Horrible roommate with insane boyfriend who won’t leave? Byeeeeeee!",
        "author": "nolatravis",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/10tugtr/horrible_roommate_with_insane_boyfriend_who_wont/",
        "text": "Managed to find an awesome house to rent after college with two other friends. One was my good buddy from undergrad, let’s call him Ben. The other was someone who I’d gotten to know through another close friend, and let’s call her Crystal. Everything is all fine, and actually great for quite some time. Lived our own lives, but had a great time hanging out together too. The perfect roommate situation.\n\nThat is, until Crystal started dating Pablo.  Pablo was the ultimate deadbeat with a Napoleon complex. Just a little over a month into our lease, Pablo got evicted from his placed, and Crystal asked if he could stay for a short period while he looked for a new place. Being understanding and empathetic, and trusting Crystal (we had no reason not to), we said sure as long as it’s temporary. Big mistake.\n\nPablo lost his job. Pablo had been dishonorably discharged from the military. Pablo was a(n) (unsuccessful) gambler. Pablo was a drunk (it was New Orleans, so it’s not like any of us had a leg to stand on here), but he was a dangerous drunk. He would verbally abuse Crystal, waking up the whole household in the middle of the night with fights. He killed her pet fish by running it under scalding hot water. He would hurl racial slurs at my then-boyfriend. He broke Ben’s Wii. On numerous occasions, he left the front door wide open (anyone who knows New Orleans knows this is a bad move, even in the safest areas). He left an empty pot on the stove with the burner on, and I came home to a house full of smoke. He was really putting everyone’s lives in danger.\n\nBen and I decided to have a house meeting to discuss our concerns with her, and, knowing that sometimes emotions can flair, we came with a written agenda so as to just stick to the facts. Yet Crystal defended him, and offered no solution to when he would be leaving and finding his own place (spoiler: he never would).\n\n[Really rubbing salt in the wound, Pablo had gambled much of their money and Crystal was having trouble making rent one month. She asked if she could borrow it and pay me back next paycheck. Again, being a trusting empath, and feeling like we had no other choice, I did. I was furious to find out that the two of them had left for a long weekend at a casino resort in Mississippi before having paid me back.]\n\nWell, now for the petty revenge:\n\nI had been working two full-time jobs. I saved like crazy, and it was 2008 and housing prices had dipped. I decided to buy my own home. Ben knew all about this (so did my landlady), and was planning to be my roommate in the new house, but I never mentioned a single word to Crystal. I found a great place, made an offer, and closed a little thereafter.\n\nIt just so happened that the day I closed on the house, when we were already planning to move and just get the hell out of dodge, Crystal and Pablo took one of their famous casino getaways. We got around 15-20 of our close friends, one of whom had an enormous truck and a giant flatbed (of course someone did, it was Louisiana). Many hands make light work, and within a few short hours the entire house other than their room was cleared out. (Ohhhh, did I mention?: All the furniture, all the kitchen stuff, everything in the common rooms belonged to either me or Ben).\n\nCrystal and Pablo returned home at the end of a full day of gambling, only to find a completely empty house except for their room. We told them we had switched the utilities (that were under my name) to the new house, and we had informed the landlady, and paid out our share of the remainder of the lease. The looks on their faces was priceless. We left and never saw them again, halleloo.\n\nTL;DR - Roommate’s psycho boyfriend moved in, never left, went bananas. Other roommate and I got a huge group of friends to help move all our stuff to a new house without telling them, in just a few hours time while they were away. They returned to a completely empty house except for their stuff. Priceless looks on their faces as we left for the last time.",
        "created_utc": 1675552791,
        "upvote_ratio": 1.0
    },
    {
        "title": "Would This Be Petty Of Me?",
        "author": "[deleted]",
        "url": "",
        "text": "[removed]",
        "created_utc": 1675551305,
        "upvote_ratio": 1.0
    },
    {
        "title": "When being controlling backfires due to malicious compliance...",
        "author": "Jennabear82",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/10tthxs/when_being_controlling_backfires_due_to_malicious/",
        "text": "Years ago I was going through a nasty divorce. I was living alone in an apartment with my son and my parents lived about a half hour away.  My mother is a Narcissist (I discovered this years later), and any time she does something \"nice\" there's always strings attached and stipulations.\n\nI needed a car. I never asked for one. I was walking and biking to work bc I didn't have the money for proper transportation at the time.  My parents showed up to my apartment one day out of the blue with a car and a contract. The deal was that it would remain in my mom's name until the divorce was finalized and that I would pay them back with my tax refund. I cried as I signed, feeling like I was making a deal with the Devil, but I need a car, so looking back on it I signed under protest, invalidating the contract's legality.  According to them, the contract was to protect us both. The purpose of keeping it in my mom's name was so that my ex couldn't claim it as a martial asset, so it was \"mom's\" car in name only.\n\nThe thing was a money pit. I put more money in it than it was worth trying to keep it running.\n\nTowards the end of my divorce a visitation schedule was set and we had to meet at a certain location, which was too far for me to walk. \n\nMy mom and I got into an argument and then she said \"Well why don't I just take the car back?  You're not using MY car for your EX'S visitation!  He can come pick up your son from your apartment!\"  Oh really?...  You're gonna go there?... \n\nBTW, my ex is the kind of person that would just be fine with not seeing our son for his scheduled visitation, so I would be responsible for paying for more childcare expenses and having to find help. Also, my mother didn't really want the car and she didn't have to deal with the BS of my ex.\n\nI said, \"Fine. Take it back. We'll walk. A court doesn't care how I get my son to see his dad. So if you want your 4-y-o grandson to walk on a busy road, so be it bc that's our only option. You know (Ex) doesn't give a shit and will just find a way to use it against me in court. But go ahead. Take the car back. It's a lemon anyway and I can't afford the upkeep. I'll be glad to get rid of that burden.\"\n\nShe didn't take the car back and never threatened to take it back again.\n\nMy circumstances are better. My car was totaled in an accident (not my fault) and I was able to get a newer car on my own merit and credit.",
        "created_utc": 1675550300,
        "upvote_ratio": 1.0
    },
    {
        "title": "Noisy neighbors",
        "author": "Stainsey11",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/10toja8/noisy_neighbors/",
        "text": "Love all of the pettiness here, especially dealing with shi&amp;&amp;y neighbors!\n\nBut this is a little different - we just moved into a nice apt complex this week and, unfortunately,chose a middle floor apt. Neighbors above us have a 2-3 year old little girl who runs all over their apt. It sounds like thunder up there’ll day long, including first thing every morning. \n\nWe haven’t met the neighbors yet, and harbor no ill will. I also understand that kids are generally noisy and full of energy. \n\nAny non-petty suggestions here? Been in this situation before and it never seems to end well. But I’d like to start off on the right foot while managing healthy boundaries. Hate awkward conversations, but willing to have them to let’s these folks know their kid is noisy as hell.\n\nI guess I’m automatically assuming that this will ultimately turn ugly. Crap!\n\nAsking you all, the Best and Brightest, for the best way to start this off.",
        "created_utc": 1675537924,
        "upvote_ratio": 1.0
    },
    {
        "title": "Our Karen neighbour want to sue us but she’s too dumb for that",
        "author": "I-luv-2seok",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/10tmpaz/our_karen_neighbour_want_to_sue_us_but_shes_too/",
        "text": "[removed]",
        "created_utc": 1675533534,
        "upvote_ratio": 1.0
    },
    {
        "title": "Hound me out of a job? Enjoy nonstop phone ringing",
        "author": "Either_Coconut",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/10tl0gk/hound_me_out_of_a_job_enjoy_nonstop_phone_ringing/",
        "text": "About 18 years ago, I worked in an outpatient medical clinic at the front desk. There was a lot of turnover with that job, primarily due to the OTHER front-desk person and her two pals (the nurse and the medical assistant). I caught wind of the fact that they had bullied my two predecessors into quitting before 6 months had passed, and was told to be on my guard. It was solid advice.\n\nThe three of them, especially my colleague at the front desk, started in on me, too. I was accused of other people's errors, I was blamed for things not being done that were someone else's responsibility, and they were just plain nasty human beings. I even would come in every morning to find that my adjustable-height desk chair was pushed all the way down to the lowest possible height, so I would have to adjust it to my own height every freaking morning. There's more, but I will spare you the details. Just presume daily low-key and high-key harassment.\n\nThe way this clinic was set up, we were both checking patients in and out, AND we were answering phones and forwarding them as needed. There was also one cordless phone located behind the desk, specifically for patients to use if they needed to call a cab or make some other call. Mobile phones were just starting to really take off in the early 2000s, and not everyone had one yet, especially not the older patients.  We couldn't have patients using the front desk phones to make calls, because we had to keep those lines clear for incoming calls from patients and doctors; hence, the solution was this cordless phone. \n\nWe were instructed to never answer incoming calls to that phone, as it was not one of our official phone lines. The problem was that some recipients of patients' calls would then try to call that number when they wanted to reach the patient, as that was what they had on their caller ID. So while the phone didn't ring daily, there were some days when that cordless phone would ring off the hook, due to some really, really persistent person who kept trying, and we couldn't answer it no matter how long they let it ring.\n\nAfter a few months, I had had enough. No one before my arrival had ever successfully figured out how to turn the ringer off that phone. But I picked the thing up and dug, dug, and dug some more through the menus. Finally, about three or four menu levels deep into the settings, I found the volume setting and turned it to zero. (Again: early 2000s tech, which was far less user-friendly than what we have now.) PEACE and QUIET at last!\n\nWell, the bullying continued. Unlike my two predecessors, I actually lasted a year in that job. But even I can only tolerate so much torment. The stress was starting to cause medical issues, so I knew I had to go.\n\nShortly before my last day on that job, late in the afternoon when I was the last one left in the office, I dug through the multiple menu levels on that phone again and turned the ringer volume up to the maximum. \n\nUnfortunately, I forgot to call myself with that phone to get the number on my caller ID, so I was not able to call it and let it ring ad infinitum myself, lol. But know from experience that there were people who would call repeatedly and let it ring for a year, rather than hang up after a reasonable amount of time. And I am equally sure that no one else figured out how to turn the ringer back off, because if they had been able to do that, it would already have been turned off long before I got the job.\n\nSo for the next few years, at least until the building closed and they moved to their new location, I hope that phone rang off the hook for them on a regular basis. Petty? Sure. But nowhere near what they deserved for being bullying AHs. Bullies can go kick rocks.",
        "created_utc": 1675529522,
        "upvote_ratio": 1.0
    },
    {
        "title": "Priority Of Education System",
        "author": "lifestorykids",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/10th8b8/priority_of_education_system/",
        "text": "[removed]",
        "created_utc": 1675519725,
        "upvote_ratio": 1.0
    },
    {
        "title": "Sales Rep Hits on Boss. Costs Him Expensive Lunches",
        "author": "Eph2vv89",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/10tgoik/sales_rep_hits_on_boss_costs_him_expensive_lunches/",
        "text": "Several years ago I worked in a doctor's office. Normally drug company sales reps make appointments to talk to doctors in their offices to let them know if the newest drugs available, what they are for, benefits and risks, etc. And that's how it was in this office as well. Until the day when a rep hit on one of the doctors.\n\nThis guy didn't just ask the doctor out and accept no for an answer. He kept asking and made the doctor uncomfortable. He didn't do anything illegal, just tried to pressure the doctor into dating him.\n\nAfter this, our office changed the rules about appointments with drug company reps. They had to come during lunch hour and buy lunch for the entire office so the meetings weren't one-on-one any more. This was to protect the doctors from any potential harassment.\n\nMost of the time the reps would call the office and ask one of us receptionists about which restaurant and/or what food to order, but a few would simply ask the receptionist to choose a restaurant and call them to order the food herself. One of these reps that had the receptionist do the ordering was the guy who harassed the doctor. One particular receptionist had requested to be the person doing the ordering for this guy and we all let her.\n\nHer petty revenge? She ALWAYS called the most expensive restaurant in town and ordered the most expensive foods on the menu. She also ordered extra food in case people were extra hungry.\n\nDon't take no for an answer when hitting on one of our doctors, it's going to cost you big bucks!",
        "created_utc": 1675518112,
        "upvote_ratio": 1.0
    },
    {
        "title": "You're suing me? Game on!",
        "author": "BuddhaMcDonald",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/10teqai/youre_suing_me_game_on/",
        "text": "[removed]",
        "created_utc": 1675511760,
        "upvote_ratio": 1.0
    },
    {
        "title": "The smallest of petty revenges... but talk about cathartic relief",
        "author": "ButterMyParsnip",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/10tdczh/the_smallest_of_petty_revenges_but_talk_about/",
        "text": "So, long story short, my sister has a douchebag of a boyfriend. I can not stand this moron.\n\nHe buys stupid branded clothes, and is snobby about buying anything cheap - but can't hold down a job. He puts everything on credit and is in serious debt with his bank (he is with the collections department and has been for some time). Yet he continues to buy £120 shirts and stuff like that.\n\nHe isn't funny, or clever. He isn't good at small talk. Doesn't have an ounce of banter. He is downright difficult to talk to. For reference, I have suffered with social anxiety and depression for over a decade. He's not like me. You're lucky if you get a \"you alright?\" out of him. He can't seem to manage more than 4 or 5 syllables at once.\n\nHis personality is so bland it isn't even true. He doesn't have any discernible traits that would make him attractive.\n\nHe has no manners. He's never thanked me once for cooking him dinner, or brought round a bottle of wine. He drinks our alcohol when he comes round (without asking) and doesn't replace it. He's broken in to our back garden when he got too drunk. He's had the police called on him outside our house because he was shouting and punching himself in the face (???) at 3 in the morning. He got barred from my sister's place of work for turning up drunk, banging on the windows, and trying to fight the owner.\n\nBut worst of all, he's very obviously been drunk and on other substances - we think mostly \\* coca cola \\* - around my nephew.\n\nI could write essays and novels about why this guy is a waste of oxygen, but please just trust me - if you're a relatively sane individual, you wouldn't like him. Have we tried to get my sister to dump him? Of course! But she is, of course, \"in love\".\n\nSo my petty revenge, as small as it is, is based on these 3 things - he has a very short temper, sleeps very badly and is therefore usually up all night, and has and a very bad credit history. Which means he has a crappy mobile phone data plan and therefore, relies on wi-fi.\n\nI control the wi-fi in my house.\n\nI have been blocking and unblocking him from our wi-fi every time he stays over for weeks now. I know he's awake and using the wi-fi because of an app I use.\n\nVery occasionally I'll block him all night long, but most of the time I'll do it on &amp; off. If I wake up to pee at 2am? I'll block him, and then unblock him when I get back to my room. If I can't sleep I'll block him, unblock him, wait until he logs back on, wait 60 seconds and then block him again. I have done this repeatedly for probably 30 minutes straight at times. I've even set alarms for 4 or 5am to block him and go back to sleep, because I know he wakes up early. I have heard him cursing from my sister's bedroom. I've heard him crashing about in the living room at half three in the morning, turning the router on and off.\n\nI don't know. This story is probably not very thrilling for most people. But god DAMN does it feel good when I hit that block button. It's like a little gland in my brain releases a happy buzz.",
        "created_utc": 1675506818,
        "upvote_ratio": 1.0
    },
    {
        "title": "Anyone that can help with petty revenge?",
        "author": "Ctrl_Tef",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/10td2b2/anyone_that_can_help_with_petty_revenge/",
        "text": "[removed]",
        "created_utc": 1675506051,
        "upvote_ratio": 1.0
    }
]