[
    {
        "title": "My monster Mom &amp; brother relayed private info to other family members from emails they read on my best friend's computer after he died. It was my Dad.",
        "author": "Southern-Code-6593",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/101lzqu/my_monster_mom_brother_relayed_private_info_to/",
        "text": "[removed]",
        "created_utc": 1672689599,
        "upvote_ratio": 1.0
    },
    {
        "title": "Show off to my girl? What does it feel like whe she slaps you with adult money?",
        "author": "Kaoz-Lord",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/101ltls/show_off_to_my_girl_what_does_it_feel_like_whe/",
        "text": "I've always loved games, I mean I'm a 44 m and always played games, since the Atari 5600 I've owned every console I could get my hands on.\n\nI have 3 girls 18, 12 and 9 and only the middle one shares my video game addiction, I tend to pamper her in that regards, she had a gamer PC fully equipped, her sisters dont really like gaming so their PC is a bit more to their liking, since they dont really know much about specs they really don't care but my middle daughter let's call her Nani is just as obsessed with games as I am.\n\nDue to changes in tech I grew very fond of mobile gaming, back in the days I used to play a game or two when the game downloading on mobiles began so I've always bought devices that could support my addiction.\n\nLast december right after chistmas eve we were on the park of the residence we live in and my little one was playing with her bike and the eldest was chatting with some friends while Nani was just messing around with her phone cashing some daily rewards on one of her games until this entitled kid who lives in the building sees her.\n\nAs sson as he notices her phone he starts to bash and shame her for it, I mean it's not a crap phone in either way, It's a Samsung A22 128Gb of internal and althrough it's an entry phone runs some games pretty smoothly. Kid states that with a phone like that she won't be playing cool games like Call of Duty Mobile like it should and might want to stick with low end games like FreeFire and stuff like that.\n\nNani is mischevious like me in many ways and when she sees the kids phone (Samsung A72) she smirks and says \"You play CoD Mobile? Cool can I see your account?\", little boy proudly showed her the game. As she watches she starts to check here and there and says cool you have a legendary skin and 2 legendary guns!\". The boy was pretty proud and says \"Yeah I'm gonna be legendary in no time!\". My daughter then looks at him and says \"well maybe one day you'll catch up with my dad!\"...\n\nBoy had a puzzled face while Nani runs to my side and says \" Daddy can you give me your phone a sec\", I've heard the whole interection and smirked while giving it to her.\n\nFrom the moment the boy saw my phone he was stunned, I recently got and Asus Rog Phone 6 pro, he was stunned and looked at it with his mouth wide open, the final stake to his heart was when my daughter opened the game and showed him my legendary skins and my mythic weapons, wile proudly saying \"Daddy's been legend since season 1\"...\n\nWhile the boy was still amazed my girl finished with a master touch \"My sisters have an iPhone but I have a deal with dad, he bought me an awesome gamer pc and I'll get his old phone when he buys a new one ... (evil grin) I'll have this one!\"... The boy just shut his mouth and went on without saying anything else.\n\nMy girls are pretty humble and don't like to show off but my Nani gets triggered with egocentrical pricks easily and she is freaking merciless...",
        "created_utc": 1672689187,
        "upvote_ratio": 1.0
    },
    {
        "title": "The blues Bot",
        "author": "djmarcelca1234",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/101lrjz/the_blues_bot/",
        "text": "[removed]",
        "created_utc": 1672689049,
        "upvote_ratio": 1.0
    },
    {
        "title": "dated guy ex-best friend was obsessed with",
        "author": "rednecklobotomy",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/101lnsd/dated_guy_exbest_friend_was_obsessed_with/",
        "text": "[removed]",
        "created_utc": 1672688794,
        "upvote_ratio": 1.0
    },
    {
        "title": "You’re gonna make fun of my hard of hearing friend? have fun looking for a new job!",
        "author": "DecrepitFungus",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/101le7r/youre_gonna_make_fun_of_my_hard_of_hearing_friend/",
        "text": "this happened just a couple months ago, and for some background I have a good friend who’s hard of hearing and needs hearing aids (we’ll call him A). he’s dealt with this his whole life and he’ll most likely be completely deaf by the time he’s 40. Now neither of us are very physically active, but when we have to be active we are. now we were in gym class when our teacher (We’ll call him douchebag) says something towards A and A didn’t hear him (it’s a large gym and sound doesn’t carry very well already). Douchebag then proceeds to insult his hearing, making fun of his haircut all because he couldn’t hear. I interjected, explaining how A is hard of hearing but Douchebag just brushes me off. Now we were pretty pissed but we didn’t want to start anything. halfway through volleyball I ask Douchebag if I can go to the water fountain to get some water, and he puts his hand to his ear and shouts “whats that? i’m hard of hearing i cant hear you”. that was my last straw, I began yelling at Douchebag about how A is in fact hard of hearing, and I pull A over to show him the hearing aids. Douchebag starts apologizing profusely but the damage was already done. later that day, me, A, and A’s Mom talked to the school board and threatened to sue the school for letting this guy teach there, because this apparently wasn’t the first time this has happened, nor was this the first job he had where he was let go due to inappropriate behavior with the students. the next week Douchebag was gone, and the week leading up he was obviously pissed. \n\nTL;DR: me and my friend got my Gym teacher fired for making fun of him for being hard of hearing",
        "created_utc": 1672688175,
        "upvote_ratio": 1.0
    },
    {
        "title": "My next door neighbor threatened me, so I fooled him and had him kicked out of the building.",
        "author": "chiledoesntexist",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/101kijo/my_next_door_neighbor_threatened_me_so_i_fooled/",
        "text": "Santiago, Chile. The night Argentina won the World Cup I came home around 10PM and a massive party was being held next door. I had to work early on Monday morning so I rang my neighbor's bell and ask the first person to come out the door to lower the music down.\n\nOur balconies kind of connect so, moments later, my neighbor was screaming onto my apartment to come out and fight him. We are both adults, Im almost forty and he doesn't look any younger than that.\n\nFor his disgrace, I wrote an entire book later turned podcast about being bullied as a kid, and I don't take shit from people anymore. Add to the equation that my gf had an anxiety attack, we had to zoom call her therapist, and while she was talking to him over the pc, more screaming from the other balcony could be heard, threatening us.\n\nI called the police, they stopped the party right away.\n\nNext morning, the landlord (who loves me for some reason) told me she left a massive warning on my neighbor's apartment, and this was so big it deserved two strikes, so one more and he was out, and said I should call her if anything out of the ordinary happened, etc. One more \"event\" and he's out for good.\n\nThat wasn't enough for me. I came up with a plan to get him out the building asap.\n\nWe can hear each other's conversation from balcony to balcony. I was invited to a New Year's party far from here, an hour drive. He had the nerve to ask the landlord if he could invite some friends over for New Years Eve, and she called me with this info. I said no prob, but didn't mention why I was cool with it.\n\nEvery time I knew he was at his balcony, I sat on mine and pretended to call friends to invite them to my own party, here, I fake called about one hundred people, and this guy was clearly listening. I knew because my landlord asked me if I was holding a massive event on Saturday night. I said I might have some friends over and that was it.\n\nAt any given chance, he was on the balcony and I fake rented a DJ, a smoke machine, and of course, many, many guests.\n\nWhy did I do this? Because he relaxed and did the same.\n\nI went to my new years party at around 5PM and people were already getting to his place.\n\nAt around 11PM, the whatsapp group all neighbors talk about what happens in the building blew up. It was f\\*king Times Square in his apartment and the cops stopped the party.\n\nThird strike, bye bye.",
        "created_utc": 1672686095,
        "upvote_ratio": 1.0
    },
    {
        "title": "Total wine would not sell me the specific wine I drove 60 miles to that location for because they claim I was with someone else who left and they need to see iD for that person. I was alone. So I made a mobile order of 10k and never picked it up",
        "author": "Ia_ja",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/101k2vz/total_wine_would_not_sell_me_the_specific_wine_i/",
        "text": "I’m got mad all over again writing this because of the sheer amount of disrespect from total wine management. I have the receipt for this order too. \n\nThere’s a specific wine I use to pair with food the closest total wine that had it was a 60 mile drive and it was storming out and I wanted it for the holidays because most likely was going to be cooped up inside.\n\nSo I drive over, this used to be my typical total wine until I moved 2 counties away. \n\nAnyways I go in and pickup the wine and get some other stuff for holiday parties was in there maybe an hour and it comes time to check out and the cashier asks me for my iD so I give it to her and then she tells me she needs to see the iD of the other person I was with so now I’m confused and say I’m alone? And she says well I have to go get my manager. Ok fine? \n\nSo he comes out to tell me that she told him I was with someone and they need to come back and bring their iD or they won’t sell it to me. \n\nI told him I wasn’t with anyone. He asks to see my iD looks at it and says “well unfortunately you look young”\n\nAt this point I’m like are you serious??? And he’s like “you can come back tomorrow ALONE” \n\nI find it extremely disrespectful to tell someone they look young while you’re holding their iD in your hand and not to mention I’ve been shopping at that exact location for about 4 years and have never had a problem \n\nSo I told him about how I drove there and have been shopping there for years and that I even have a second form of iD and he was just kind of giggling and saying no.\n\nSo I left very angry and it was late around 9 pm and then I had the about hour and a half drive back home in the rain storm.\n\nSo I was home pissed about it all night and the next day I went in to the one close to my house to get the other stuff I was getting unfortunately that one was out of the wine that’s why I didn’t originally go there.\n\nThey were pleasant as usual actually beyond nice and didn’t even iD me which just goes to show the other location was on some kind of power trip or something. \n\n\nThen I got an email from them to review my experience. Which they send every time I go there and I never do it but I decided to select the location I had the bad experience at and give feed back on it.\n\nSo I wrote exactly what happened and then the next day I got a call from the store manager. Turns out the guy that night was an assistant manager or something. However he was much more pleasant than the woman that called me. She was extremely rude and condescending and told me that she reviewed the cameras and that someone walked in with me at the same time and that made us a party. I told her I didn’t know them. She said it didn’t matter. so apparently people can’t walk in to total wine at the same time as you???\n\nThen she said that the employees were watching me and that the person left 30 minutes before I went to check out and they saw it.\n\nOk so? Also if that is the case and that is your policy, why didn’t you say something when you saw the person leave and we could have cleared up the whole situation right then and there. Instead of continuing to allow me to shop for another 30 minutes and waste my time to know that when I came to check out you were going to deny it? \n\nSo I told her even if that is the case someone can’t leave a store??? And she said “no. To complete the transaction they would have to drive back with their iD” \n\nThis made me extremely angry because even if that is the case and that is your policy at least you can offer an apology for the inconvenience or something like that. Not just call me to argue and stir the pot. I was already kind of over it because it had been like 2 days but just her whole attitude and nastiness about the whole thing was really insult to injury. \n\nSo I decided to look up their policy and their policy clearly states that this only applies to parties at checkout so the rule is who is with you at checkout which that makes sense or is at least more understandable. \n\nAnother policy I read which was interesting was that any online order not picked up within a week they will issue a full refund to your original payment method.\n\n\nSo my friends and I were sitting home drinking the stuff I had got at the other location later that day and telling them what happened and they were all shocked. \n\n\nI used to work retail for a long time specifically during covid and I know what an inconvenience it is to setup big curbside pickup orders because they take up a lot of space on the order shelf. \n\nSo drunk and mad I decided to enforce their own policy on them and make a $10,000 order for the soonest possible pickup time which they promise orders ready in 3 hours.\n\nSo I made sure to order the cheapest heaviest bottles I could think of so it can take up the most amount of space in their curbside are and made sure to only order like 1 or 2 of each so they couldn’t just give me a case they had to get individual ones and I ordered their whole supply of Tito’s since it’s popular and it’s the holidays and I know people are going to be looking for it and this total wine has its curbside order section in the front behind a counter where you can see it \n\nAnd I know when customers saw it they would ask for it and then they would have to explain how someone ordered all 238 bottles and they’re back there on reserve. Then they’d probably get grouchy and ask for a manager.\n\nBut the manager would be busy because I also made sure to order a lot of bottles behind glass so they would have to run around with their keys scrambling to get this order ready. I worked retail and I know how much stuff like this throws off a schedule and annoys the managers. \n\nSo I loaded up the cart and stopped when I got bored and placed the order. I got the email confirmation which specified that you have to wait for the pickup confirmation email and that pickup times aren’t guaranteed so I thought for sure they were either going to cancel the order or call me or something.\n\nAnd something interesting that is sent with the email is a pickup policy that states specifically “the recipient of the order needs to be 21” so you can have other people in your car not 21??? \n\nWell 5 hours later I got the pickup email. It took them longer but I was still surprised.\n\nThen later I got a pickup reminder email. Then 3 days later a second reminder. Then 7 days I got my “final notice” email\n\nAnd then day 10 I got a phone call. It was the manager acting like a completely different person this time asking when I was coming for the order. At this point I think she knew I was fucking with them because it had been 10 days and she knew my name from the previous feedback thing because when she called she asked for me by name and my name was on the order \n\nSo I told her “yeah I went to pick it up and was told I look too young, so I just went to the other total wine and picked it up the same stuff there” \n\nSo then she was mad and said “are you seriously not coming to pick this up?” Lollll restockkkkkkk \n\nI just said “nahhh”\n\nShe hung up lmfaooooo\n\n\nWhen your higher up asked you why your store had to refund someone $10,000 explain to them what you did  lmfaooo.\n\nThey were supposed to automatically cancel the order at the 7 day mark but didn’t she called me at the 10 day. \n\nSo I called their customer service line to cancel it and she told me some stores wait to the end of the month to do it. \n\nI’m assuming the manger was trying to hold out on refunding to end the year on a better number. Retail does that.\n\nI made them cancel it right then lmfaooo",
        "created_utc": 1672685038,
        "upvote_ratio": 1.0
    },
    {
        "title": "Revenge on a bunch of 2nd and 3rd graders.",
        "author": "IronGelatin",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/101jm4m/revenge_on_a_bunch_of_2nd_and_3rd_graders/",
        "text": "[removed]",
        "created_utc": 1672683900,
        "upvote_ratio": 1.0
    },
    {
        "title": "Record Computer screen for short video around mouse ||",
        "author": "dostyaar121",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/101fabd/record_computer_screen_for_short_video_around/",
        "text": "[removed]",
        "created_utc": 1672673307,
        "upvote_ratio": 1.0
    },
    {
        "title": "Nightly dorms party countered by random calls during the day",
        "author": "HikeAnywhere",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/101arel/nightly_dorms_party_countered_by_random_calls/",
        "text": "This happened back when I was in college. We had old style (POTS) phones hanging in the wall in each dorm (no cells) and internet access was via modem. Some muscle bound brutes were working hard to fail out their first quarter. Every night going out then coming back and blasting music. RA involved, but nothing really happened except warnings so I figure \"keep me up all night? I'll keep you up all day\". I set up a script for my modem to call them at random times during the early morning. I also set my modem to do this silently.\nDude was pissed and figured it was one of the geeks on the floor. Came into my room checking on me and at that moment I heard the soft click of my computer picking up to dial him. He never got the chance to ask me because his roommate yells \"DAMN IT! THEY'RE CALLING RIGHT NOW!\". He never figured who was doing it and failed out that quarter.",
        "created_utc": 1672660178,
        "upvote_ratio": 1.0
    },
    {
        "title": "Little he",
        "author": "Financial-Fly6772",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/101aip7/little_he/",
        "text": "",
        "created_utc": 1672659265,
        "upvote_ratio": 1.0
    },
    {
        "title": "Ruin my baby announcement, I will ruin your divorce.",
        "author": "Tabby_The_Catt",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/1016xdb/ruin_my_baby_announcement_i_will_ruin_your_divorce/",
        "text": "[removed]",
        "created_utc": 1672645900,
        "upvote_ratio": 1.0
    },
    {
        "title": "Petty parking games",
        "author": "Witty_Comfortable404",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/1016ftc/petty_parking_games/",
        "text": "I told my friend about this, she told me to post it here. I’m not sure if it’s actually petty revenge or just petty, but it gave me a laugh anyways…\n\nI took my son to a heritage village/museum yesterday, and seeing as I am borrowing a big truck, I am pretty cautious about where I park. The overflow lot had tons of space though. When we left, the whole lot was packed, and I saw a shiny Tesla turns around to follow me to my vehicle, obviously wanting my spot. So I tried to leave pretty quick. Buckled up, google maps loaded up while I cleared the windows. Tesla lady still at the entrance. \n\n I backed out of the stall and go to turn out and Ms. Tesla had pulled forward and was completely blocking me (she was in the middle of the lane, even a sedan wouldn’t have fit, and I parked beside a building so couldn’t back up). I waved her back, she points aggressively at the spot and waved at me to go around. I wasn’t interested in road raging with this woman, so after a brief confused stare down,  I did what any other petty assh*le in an otherwise dead lot would do. I turned off the truck, grabbed my phone, and scrolled through Reddit. Ms. Tesla was MAD. Like really, I could almost feel the anger radiating, it was like a soul inferno. It warmed me though, it truly did. But alas, she finally decided to back up, so I turn the engine, and start driving forward, thinking she got the hint. Wishful thinking though! Ms Tesla thought that by moving back and not to the side, the extra 10’ would magically shrink my truck to 4’ wide. She gestures at me frantically, but I still can’t move past her. And I wasn’t past the spot enough to let her pull in. So, petty me, I turned off the truck AGAIN. Another 5 minutes go by, me scrolling Reddit, reading AITA, and sneaking peeks. She FINALLY MOVED!! Instantly I start driving, slowly. As she was passing me, she signalled me to roll down my window and she yelled “wtf are you doing! I moved!” I asked her what kind of magic she thought I possessed to drive my wide truck through less space her little car took, and unless she wanted me to go over her, it wasn’t happening. And then I rolled up my window, put on “Fast Car”, and enjoyed my sweet drive home.",
        "created_utc": 1672644155,
        "upvote_ratio": 1.0
    },
    {
        "title": "I won’t let my fiancés sister bring her boyfriend to our family only wedding because according to her standards he’s not family.",
        "author": "SnooPeripherals528",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/10161uj/i_wont_let_my_fiancés_sister_bring_her_boyfriend/",
        "text": "AITA for not allowing my fiancés sister to bring a plus one to our wedding?\n\nMy fiancé (M and F both 20) and I have been together since middle school and will be getting married July 2023. \nFor the most part his family has always been very welcoming of me and considering how long we’ve been together I considered myself to be part of his family and him part of mine. Apparently I was wrong. \nHis sister (F25) unfollowed and removed me from her social media. I had her cell number so I texted her asking why. She responded with “I didn’t mean to offend you but I deleted everyone except family. You can reach me through my number if you need to get ahold of me.” When I showed my fiancé he felt like she was being rude and assured me the rest of the family does not share her view of me. This is where it gets dicey. \n\nHer and her boyfriend let’s call him J have been together for 5 months. At the family Christmas party she made a remark about not seeing why I was invited because I’m not a part of the family and their mother defended me and my fiancé said her boyfriend is not part of the family either so he shouldn’t have been invited either. She didn’t like that and told my fiancé that he was being rude and making J feel like an outsider.\n\nNow we are working on invitations for our wedding. We are planning on keeping it quite small- only family and maybe a couple close friends. I was feeling really petty and decided to let her know that her invite did not include J because we are only inviting family. She hasn’t responded yet but I’m feeling a bit guilty and like maybe I should just drop the petty revenge and take it back. \n\nEDIT: I forgot to add that my fiancé has 4 siblings counting her and I have 3. All of my singlings are single and all of his are too except her, so plus ones weren’t a thing we were even thinking about until she started being a hater, lol.\nAdditional info: future MIL and FIL both stuck up for me on Christmas and told her there’s no reason for her to act like I’m not part of the family after all this time. My parents think I’m being petty, but that she deserves it. My mother said something along the lines of “it’s so bad, but it’s so good.” Fiancé says not inviting her is too far (I agree) but that there’s no reason for J to be invited anyway. We don’t know him and nobody else is bringing a plus one so why should she?",
        "created_utc": 1672642853,
        "upvote_ratio": 1.0
    },
    {
        "title": "AITA for not allowing my fiancés sister to bring a plus one to our wedding?",
        "author": "SnooPeripherals528",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/1015s00/aita_for_not_allowing_my_fiancés_sister_to_bring/",
        "text": "My fiancé (M and F both 20) and I have been together since middle school and will be getting married July 2023. \nFor the most part his family has always been very welcoming of me and considering how long we’ve been together I considered myself to be part of his family and him part of mine. Apparently I was wrong. \nHis sister (F25) unfollowed and removed me from her social media. I had her cell number so I texted her asking why. She responded with “I didn’t mean to offend you but I deleted everyone except family. You can reach me through my number if you need to get ahold of me.” When I showed my fiancé he felt like she was being rude and assured me the rest of the family does not share her view of me. This is where it gets dicey. \n\nHer and her boyfriend let’s call him J have been together for 5 months. At the family Christmas party she made a remark about not seeing why I was invited because I’m not a part of the family and their mother defended me and my fiancé said her boyfriend is not part of the family either so he shouldn’t have been invited either. She didn’t like that and told my fiancé that he was being rude and making J feel like an outsider.\n\nNow we are working on invitations for our wedding. We are planning on keeping it quite small- only family and maybe a couple close friends. I was feeling really petty and decided to let her know that her invite did not include J because we are only inviting family. She hasn’t responded yet but I’m feeling a bit guilty and like maybe I should just drop the petty revenge and take it back. AITA?\n\nEDIT: I forgot to add that my fiancé has 4 siblings counting her and I have 3. All of my singlings are single and all of his are too except her, so plus ones weren’t a thing we were even thinking about until she started being a hater, lol.\nAdditional info: future MIL and FIL both stuck up for me on Christmas and told her there’s no reason for her to act like I’m not part of the family after all this time. My parents think I’m being petty, but that she deserves it. My mother said something along the lines of “it’s so bad, but it’s so good.” Fiancé says not inviting her is too far (I agree) but that there’s no reason for J to be invited anyway. We don’t know him and nobody else is bringing a plus one so why should she?",
        "created_utc": 1672641915,
        "upvote_ratio": 1.0
    },
    {
        "title": "My friend kept annoying me, so i got him back hard.",
        "author": "Minute_Breath5898",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/1015qj8/my_friend_kept_annoying_me_so_i_got_him_back_hard/",
        "text": "[removed]",
        "created_utc": 1672641778,
        "upvote_ratio": 1.0
    },
    {
        "title": "Nerd vs bully",
        "author": "Well_I_made_mess",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/1015739/nerd_vs_bully/",
        "text": "[removed]",
        "created_utc": 1672639956,
        "upvote_ratio": 1.0
    },
    {
        "title": "Put deep heat on my ex step dads toothbrush.",
        "author": "itschickentime2001",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/1014co4/put_deep_heat_on_my_ex_step_dads_toothbrush/",
        "text": "Exactly as the title says but a little background; this man was satan’s spawn. He was an alcoholic and abusive in all of the ways you can think of.\n\nSo on with the story. I was 7 or 8 and I can’t remember exactly what happened that day. Just know he was in one of his fits of rage and my mom was on the receiving end. I tiptoed into the bathroom that night to go for a pee and then i had a moment of realisation…He was an asshole and a crappy person. I needed to get back at him. I noticed deep heat in the medicine cabinet and decided to put it on his toothbrush. I rubbed it in real good so he didn’t notice it was there. I knew the result was going to be glorious. For those who don’t know what deep heat is, it’s a muscle ache reliever. It gives off an intense radiating heat so obviously not good for gums. \n\nI didn’t fully understand the consequences of my actions but I did know the next morning was hilarious. He started brushing his teeth before work and his mouth started burning. His lips were swollen about 2x it’s original size, he was drooling and could barely speak. My mom couldn’t contain her laughter but of course he was in too much pain to react. He came home that night and was still an ass to her but less than his usual. No regrets.",
        "created_utc": 1672637192,
        "upvote_ratio": 1.0
    },
    {
        "title": "Don’t want to approve time off prior to my resignation? I’ll ruin your reputation and convince my replacement not to take the job",
        "author": "curiousiteena",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/1013mqw/dont_want_to_approve_time_off_prior_to_my/",
        "text": "Hopefully more suited here than /ProRevenge. \n\nI worked for a federal contractor for three years. It was my first contracting job--and my last. The government agency I worked at was great, but I’m pretty sure the actual contracting company was being run by idiots.\n\nFor instance, they recommended I put in my two weeks notice at my then current employer; but it turns out I did not actually start until a few months later and spent the whole summer without income or health insurance. And then when I was finally told my actual start date, I showed up at the federal agency and there was no one there to meet me because they had not been informed that I would be starting that day. Honestly, I should’ve changed my mind and walked away then, but I was sick of being without a paycheck and living off my savings.\n\nThere were other issues over the next few years. When I finally decided to resign for a state government offer, I had a ton of leave saved up from not taking time off during the pandemic when I worked from home. What does one normally do in that situation? You use what leave you can during those last days. But the contracting company rejected the request since it was “policy” (that may or may not have been noted in the employee manual that was conveniently inaccessible online). I was also informed of another policy to only to pay out two weeks of vacation leave instead of the six I had accumulated. \n\nIt was a bitter pill to swallow, but I knew I was going to have my revenge.\n\nRevenge part I: The assistant division manager (ADC1) of the federal agency called to say that I could use her for a reference and asked if there was anything about my time there she should know off the record. Well, I thought she should know about the shitty agency whose contract would be up next year. \n\nI told her about some of my concerns and how if I were to have the opportunity again, that I would turn the job down in order to not be associated with the contractor. And that if it were up to me, I’d rather go with a new contracting firm for the upcoming multi-year, million dollar contract I knew the company way vying for versus continuing with them.  ADC1 was silent for a moment and then admitted that she also felt something was off and appreciated my frank words. \n\nAnother ADC (ADC2) who happened to be in charge of the other 50% of hiring lived in my area and offered to meet up after being able to attend the virtual farewell on my last day. I accepted and over drinks a few weeks later, conveniently mentioned some of the issues with the contractor that I “afraid” to bring up while I was still employed. She was very appreciative of my comments and also expressed concerns with the contractor being disorganized and underperforming. I knew that once it was time to renew the contract, both ADCs would compare notes and likely bring up my concerns.\n\nRevenge part II: There were a number of other contract employees who worked at the agency. One of them contacted me a couple months after I left and asked if I would be willing to speak to a friend (Jane) who was being considered for my position. Did someone say more revenge? It turns out Jane had already been offered the position but wanted to know more details and asked if I’d have a conversation with her. Of course I was!\n\nJane and I spoke for an hour and I happily gave her an accurate but positive description of my former duties. Then I segued into talking about my not so positive concerns with the contracting company like how we were asked to take a vacation day on a new federal holiday because they did not have the budget. Or how we were forced to get together for team-building activities during the pandemic. \n\nShe shared she had an offer from another federal agency and asked me what I would do in her shoes. Of course, I let her know that I would rather take the other offer if I had her choice. She thanked me for my honesty. Three days later after the long weekend, she texted that she took the other offer and thanked me for my input which solidified her decision. I promptly asked her if we could keep in touch and connect on LinkedIn. Now I personally hate LinkedIn, but I knew the big wigs at the contracting company would see the connection in their feeds and figure out why Jane turned down the job.\n\nFurthermore, a couple of weeks later I had plans to get together for brunch with five former coworkers (non-contractors). After a couple of mimosas, I asked how the search for my replacement was going and they shared that someone had been lined up but changed her mind about taking the job. I, of course, had to clue them in on my conversation with Jane and told them to feel free to share it around the office.\n\nRevenge part III: A lot of people decide to start the new year looking for a new job. Knowing this, I’ve waited six months to post very detailed reviews on the top job sites to coincide with the 2023 new year job seekers. That gave me time to read every review I could find about the contractor and incorporate the major themes from those into my own reviews for continuity’s sake. \n\nNow whether or not the contracting firm will be offered another extension or be considered when new contracts are awarded, but I know I did my part to besmirch their name and continue to have others do so on my behalf long after I’ve left.",
        "created_utc": 1672634939,
        "upvote_ratio": 1.0
    },
    {
        "title": "I offered my roommate her own solution",
        "author": "queencub",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/1012nvl/i_offered_my_roommate_her_own_solution/",
        "text": "This happened some years ago, but it still fills me with joy whenever I think about it!\n\nBackground:\nMy college roommate started hanging out with a drug deaker after she went through a breakup that she initiated. Unsurprising, she started using and became addicted, but she reassured me that she had \"everything under control.\" One afternoon, I came back from class, and I found this guy (the dealer) in our apartment. I initially thought nothing of it, until he never left. Suddenly this drug dealer was living in our apartment, and there were ZERO conversations had between me and my roommate regarding this guy moving in. This guy lived rent-free in my apartment, didn't contribute any money towards internet or utilities, and he started selling out of my home. With strangers coming in and out of the apartment at odd hours, I felt very unsafe in my own home because the people who were entering were also addicts.\n\nEventually, my roommate dropped out of school because she slept all day and used all night. Then she and the dealer started making plans to move to California, basically leaving me to find a roommate to fill her spot on the lease. She had suggested that one of the dealer's customers take her spot, and in the same breath reassured me that he was cool and that I'd like living with him. At this point, I was so done with her shit and finally came to terms that I had lost my friend, and she did not give a single fuck about me. \n\nRevenge:\nI immediately looked for roommate adds on Craigslist because I figured that nothing could be worse than my current situation, and I didn't tell my roommate that I was looking for other places to live. Eventually, I found two other girls who needed a roommate due to them going through a shitty roommate situation, and they offered me the room that same day with move in being less than 2 weeks from then. Once I got all my ducks in a row, I informed my roommate that I would be moving out in less than 2 weeks. The look on her face was priceless, and after a few moments of standalone \"wows,\" she asked, \"Who is going to take your spot?\". My response, \"You can ask the guy who you were telling me was going to take your spot. I heard he's cool.\" Immediately, her face turned bright red, and she gave me all the reasons why she didn't want to live with him. After I moved out, she made attempts to rekindle the friendship and went on about how much she missed me. I went NC with her after telling her what a shit friend she had been and that I had no interest in having her in my life. Any time I heard from mutual friends that she had been badmouthing me and saying that I was a bitch to her for no reason, I happily shared the details of what lead up to me moving out and sending her that text. Last I heard, she and the guy moved an hour away from the college town (not to California).",
        "created_utc": 1672631994,
        "upvote_ratio": 1.0
    },
    {
        "title": "Neg me? Enjoy your booze-less New Year!!",
        "author": "roary-wilder",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/10120aq/neg_me_enjoy_your_boozeless_new_year/",
        "text": "Short and sweet: Be me, 20sum' person with tits (relevant). I work in a college town liquor shop. A lot of students come back to celebrate the new year with each other. The store gets incredibly busy with some genuine pieces of work coming in for booze and cigs. \n\nSome college age bro comes in on a video call with someone, and after about twenty minutes of loudly arguing about which shitty beer to buy, and another fifteen minutes waiting in line, he comes up to the counter. Bro takes one look at me, flashes his friends on screen a \"watch this\" face, and says, \"Youve got great boobs for a liquor shop girl.\" \n\nCould I have let this go? Yes. Do I deal with this shit every day I work? Yes. \n\nDid I let it go? No. No I did not. \n\nI smile very politely and ask for his id, no other acknowledgement of what he said. He laughs and hands me his card. I take one look at it, set it down, and very loudly announce, \"Sorry, we don't take fakes here. You're going to have to leave.\" \n\nMan's goes RED and starts acting up. My boss (bless you, bossman) steps in, comes over from the other register and tells him to listen to me or face permanent banishment from our shop, the only liquor station for fifteen miles.\n\nBroseph storms out with no beer, no ID, and no dignity. I neither know nor care if the card was actually fake or not. Act like an idiot child, get treated like one. \n\nHappy New Year y'all!!!",
        "created_utc": 1672630041,
        "upvote_ratio": 1.0
    },
    {
        "title": "How can I ruin my dads life he’s a con artist , hiding debt money , physically and emotionally abusive and steals from people and is the reason people go poor. Ruin business , send him to jail , ruin reputation anything someone help",
        "author": "Stargirlmoonl3ght",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/1011v11/how_can_i_ruin_my_dads_life_hes_a_con_artist/",
        "text": "",
        "created_utc": 1672629599,
        "upvote_ratio": 1.0
    },
    {
        "title": "Tailgate me? Have fun being stuck behind the slow semi truck!",
        "author": "Lyaeth",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/1010nyh/tailgate_me_have_fun_being_stuck_behind_the_slow/",
        "text": "[removed]",
        "created_utc": 1672626085,
        "upvote_ratio": 1.0
    },
    {
        "title": "5 Things You Should Do Differently in 2023",
        "author": "Anniessence",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/100wmn7/5_things_you_should_do_differently_in_2023/",
        "text": "[removed]",
        "created_utc": 1672615144,
        "upvote_ratio": 1.0
    },
    {
        "title": "I just wanted to confirm an address. It's not my fault you were playing drunken bumper cars in the parking lot.",
        "author": "OverlyOptimisticNerd",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/100wm2v/i_just_wanted_to_confirm_an_address_its_not_my/",
        "text": "Obligatory - this happened about 2-3 hours ago.\n\n***\n## Background\n\nA couple of months ago someone broke into my home via the garage and stole my wife's purse from her car in that garage. I'm leaving out specific details beyond that because they are material to both the criminal case (pending) and civil case (I'm getting there).\n\nI called the police immediately after the burglary and they weren't interested. Fine, I have a smartphone and credit card notifications on. I told my wife - \"don't cancel the cards.\" Sure enough, he got gas down the street. I got footage from them. He then went shopping elsewhere. Every time he used a card, we canceled it. We got footage, statements, witnesses, and/or evidence from several different places. I then put it all together and gave it to the cops.\n\nDespite this, the police told me it likely still wouldn't go anywhere, and if it does, it would be slow. That's fine. I waited for them to finish their report, then I did a public records request. This gave me the burglar's name, vehicle, and plate number. I used that to obtain an address online, which may or may not be current. (For reference, from start of story to this point is about 3 months). The report was a gold mine. One of the police officers was able to identify the man as having previously been arrested for similar crimes (there's more here I'm leaving out for brevity).\n\n***\n\n##Today\n\nSo, that's where the petty (and totally accidental) revenge begins. I drove by the address and realized it was a condo community. The address wasn't specific enough so even if he does live here, I need a unit number. So, let's start with confirming if the vehicle is at least on the property and go from there. Sure enough, it was. And he was sitting it in, drunk off his ass. Still drinking.\n\nThe guy and the truck match the description, but I wanted to confirm the plate. He didn't have this front plate on (legally required but almost never enforced) so I pulled into a nearby spot and wanted to wait him out. Then I'd walk around the back of the vehicle to see the plate.\n\nWhile I'm looking down at my phone and looking to see if there is a main office number for this community, I hear a loud noise. I look up to see that he had pulled forward out of his parking spot, and made a hard right into the parking, pavilion? If that describes it? He hit a pole and side-swiped a car. He started backing up and making a 20-point turn to wiggle his massive truck into this tiny spot. There's also a beer can on the ground in his former parking spot.\n\nSo, I drive behind him, confirm the plate (it's 100% him), leave the community for the drug store parking lot on the next block, then call the local cops. Non-emergency line. The police officer assigned calls me for more details before going. I tell them my sob story and he hooks me up with the burglar's unit number and wishes me the best. I then get to watch through the gate as the police arrive. Guy is still in his truck. He stumbles out, they cuff him, and assist him into their back seat.\n\nNot sure what happens next. Really dude, I just wanted to confirm your address so I could take you to small claims for the shit you stole. I didn't expect your drunk ass to be playing bumper cars.\n\n***\n\nDepending on how this shakes out, I may try Pro Revenge with all of those missing details. Hopefully there's a happy ending, but if there is, it's months away at minimum. But current plan is:\n\n* Later this week call the prosecutor's office. Haven't spoken since mid-November. Want to see if there are plans to move forward and if I should hold off on a civil case (not needed if criminal court orders restitution), or proceed.\n* If given the green-light I'll mail the guy a demand letter. Typical response period is 30-days, but I'll do 45 or 60. I have reasons for wanting to hold this off until March. Call it a scheduling conflict.\n* Unless he agrees to a settlement, take him to small claims court. It's cheap in our county to file, no lawyers allowed, just 1-on-1. We'll have a mediation hearing and, if no settlement reached, a court appearance. Given his history, I expect a no-show and a default judgement, so I'll have to look into things like wage garnishment, but we're talking 6+ months down the road so my planning at this point is to save that for later, if necessary.",
        "created_utc": 1672615103,
        "upvote_ratio": 1.0
    },
    {
        "title": "Either get your ass out of bed or turn off your alarm... JUST STOP HITTING SNOOZE!",
        "author": "reddimus_prime",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/100v1q9/either_get_your_ass_out_of_bed_or_turn_off_your/",
        "text": "This happened 20+ years ago when I was in college. I shared a town home with 3 other roommates. We are all males, and at the time, in our late teens/early twenties.\n\nOne of my roommates, lets call him Roomie #1, had an early 8:00 AM class that he did not like to attend because... college and 8:00 AM. However, he did always set his alarm clock, so he could get to class on time if he decided to go. No one else in the house had class that early, and we all liked to sleep in as late as possible.\n\nNow, Roomie #1 had a nasty habit of hitting his snooze button many, many times before deciding whether or not he was going to get his ass out of bed and get his learn on or skip. This meant that everyone within in ear shot would hear his alarm clock buzzing over and over again, every 10 minutes, until he either got up or finally turned off his alarm and stayed in bed.\n\nThis didn't bother Roomie #2, who's room was on the first floor, because he was far enough away, and he was such a sound sleeper that not even gunfire or fireworks couldn't wake his ass up. But, it sure bothered the hell out of Roomie #3 and me. We both had bedrooms on the second floor with Roomie #1.\n\nRoomie #3 was kind of a shit stirrer and had a toxic personality. He liked to pit the other 3 of us against each other and watch chaos ensue. We did not realize this at the time, but he eventually ended up driving the other 3 of us out of the house and started all over again with 3 new suckers, but I digress.\n\nAnyway, Roomie #3 and I got together and hatched a plan. One day, after Roomie #1 left for class, we opened up his alarm clock and clipped one of the wires running to the speaker. Now, the next time that Roomie #1's alarm went off, it wouldn't make a sound.\n\nThe next day, there was no buzzing early in the morning. Roomie #3 and I both got to sleep until our own alarm clocks sounded. Of course, Roomie #1 overslept and missed his class. When he finally woke up, he had no idea why his alarm clock didn't go off. He eventually determined that it was broken and just replaced it.\n\nSeveral weeks later Roomie #3 decided to stir up some shit and confessed the entire plot to Roomie #1, but left out the part that it was his idea and blamed the entire episode on me... but that's another story.",
        "created_utc": 1672611136,
        "upvote_ratio": 1.0
    },
    {
        "title": "Don’t stop for us in the crosswalk, have fun finding parking.",
        "author": "chiller8",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/100u6fo/dont_stop_for_us_in_the_crosswalk_have_fun/",
        "text": "Was finishing up a hike and while crossing the street from the trailhead to the small parking lot, a guy decides to not yield to us in the crosswalk and blows right by our group in his stupid ass lifted jeep that has probably never been off road. I see that he turned into the parking lot (into the “exit only” opening mind you) and is looking for someone to leave so that he can park. He rolls up to us and has the nerve to ask us if we’re leaving. I tell him “not for a bit”.  He zips off, exits the \nlot and heads up the road, I assume to park at another lot about a quarter mile away. A couple of minutes later as were driving home I see that he and his family are walking on the shoulder towards the trailhead.  I slow down, give a friendly honk, roll down the window and tell him to be careful walking some drivers don’t look out for people walking.",
        "created_utc": 1672608998,
        "upvote_ratio": 1.0
    },
    {
        "title": "Update to gift revenge",
        "author": "chaoscrochet",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/100u5kn/update_to_gift_revenge/",
        "text": "Here’s the original https://www.reddit.com/r/pettyrevenge/comments/zvmjfq/forced_to_accept_gift/?utm_source=share&amp;utm_medium=ios_app&amp;utm_name=iossmf\nSo during our family Christmas my extended family kept asking him about it and gushing about how nice it was that I gave them that and how nice the items were. I ended up having several family members follow my Facebook for my shop and order items from me due to this. \n\nAll the sports fans in the family loved them and excitedly told S and T how nice it would be to wear at their yearly game they go to. My gifts were the talk of Christmas.\n\nVery satisfying petty revenge",
        "created_utc": 1672608938,
        "upvote_ratio": 1.0
    },
    {
        "title": "I got barked at so i barked back",
        "author": "Pristine_Muffin_6213",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/100txxb/i_got_barked_at_so_i_barked_back/",
        "text": "[removed]",
        "created_utc": 1672608421,
        "upvote_ratio": 1.0
    },
    {
        "title": "Need your best pettyrevenge ideas...",
        "author": "Traditional-Cell-612",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/100tpam/need_your_best_pettyrevenge_ideas/",
        "text": "[removed]",
        "created_utc": 1672607820,
        "upvote_ratio": 1.0
    },
    {
        "title": "I taught a 6 year old girl how to pick locks because her mother wasn’t looking after her",
        "author": "el-destroya",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/100tiq1/i_taught_a_6_year_old_girl_how_to_pick_locks/",
        "text": "[removed]",
        "created_utc": 1672607370,
        "upvote_ratio": 1.0
    },
    {
        "title": "Stole them back",
        "author": "Localgreensborogal",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/100pury/stole_them_back/",
        "text": "When I was a teenager, I had a party at my house. About a year later, my friend “Al” came to me with a confession. His friend “Kyle” (who he’d brought to party)  had come back later and stolen the hubcaps off my neighbor’s Corvette. He put them in his own car. Al and Kyle had a falling out, and Al wanted revenge. We sneaked over to Kyle’s house in the middle of the night and stole the hubcaps back.  (I drove, Al got them off the car.) We left them in my neighbor’s front yard, right next to his Corvette. I always wondered what my neighbor thought when his stolen hubcaps magically appeared next to his car a year later. \n\nBut wait…there’s more. \n\nIn 2020, my college-aged daughter needed a car. I was hunting Facebook Marketplace and I came across an ad for a car in our price range. It was ridiculous, going on about new windshield wipers, recent oil change, detailed inside and out, etc. As I read it, I said out loud, “What bullshit, this guy is trying way to hard to avoid talking about the actual condition of the car!” Then I scrolled down to the bottom and saw the seller’s name. Yep, Kyle. Clearly still a dishonest piece of shit, 35 years later.",
        "created_utc": 1672597890,
        "upvote_ratio": 1.0
    },
    {
        "title": "Credit Card Advertisements",
        "author": "catybear90",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/100ml8u/credit_card_advertisements/",
        "text": "My husband and I are anti credit cards (that’s another story). Just like everyone else, we get loads of credit card offers in the mail. Each offer comes with a prepaid envelope to return the completed application to the company. We would send back the blank application in the prepaid envelope so that the credit card company had to eat the postage. It became a bit of a competition between us eventually on how much we could fit into the envelope before mailing it back (increasing the cost of postage). My record was an entire cereal box cut into pieces to fit into the envelope! Take that Capital One! We no longer get very many credit card application in the mail, so I guess it was effective at deterring the ads.",
        "created_utc": 1672588922,
        "upvote_ratio": 1.0
    },
    {
        "title": "My Wife Left Me For Her Pastor",
        "author": "Koov-_-",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/100m73k/my_wife_left_me_for_her_pastor/",
        "text": "[removed]",
        "created_utc": 1672587801,
        "upvote_ratio": 1.0
    },
    {
        "title": "Rip my necklace pay with your body",
        "author": "Revengestorybydaniel",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/100lrr7/rip_my_necklace_pay_with_your_body/",
        "text": "[removed]",
        "created_utc": 1672586489,
        "upvote_ratio": 1.0
    },
    {
        "title": "How I found out I like carrot cake!",
        "author": "GottaLoveACuppa",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/100l7y6/how_i_found_out_i_like_carrot_cake/",
        "text": "[removed]",
        "created_utc": 1672584803,
        "upvote_ratio": 1.0
    },
    {
        "title": "Enjoy the hangover music 😈",
        "author": "ITZOFLUFFAY",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/100kugl/enjoy_the_hangover_music/",
        "text": "This is short and sweet but I found it satisfying. I work hotel front desk. Friday night I checked in a bunch of guests with unruly kids who proceeded to scream and run around the hotel unsupervised, making all kinds of noise and messes that I had to clean up, along with noise complaints that I had to deal with including a few different room changes. Fast forward to today, I’m working day shift and most of those same guests are still here, except now they’re notably hungover. Funny, I hear a lot of shushing of kids today that was definitely not happening Friday night. So my petty ass decided to play Disney music in the lobby. I heard a collective groan from the breakfast area when We Don’t Talk About Bruno came on and my smile could not have been any more wicked. Let It Go is up next. Happy New Year mfers!!!",
        "created_utc": 1672583522,
        "upvote_ratio": 1.0
    },
    {
        "title": "Be nice to your future brother in law",
        "author": "fatcat623",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/100k7b5/be_nice_to_your_future_brother_in_law/",
        "text": "[removed]",
        "created_utc": 1672581372,
        "upvote_ratio": 1.0
    },
    {
        "title": "Should I have my ex’s truck and Jeep repoed?",
        "author": "Hewbiedoo2022",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/100i53g/should_i_have_my_exs_truck_and_jeep_repoed/",
        "text": "[removed]",
        "created_utc": 1672574114,
        "upvote_ratio": 1.0
    },
    {
        "title": "Have fun letting Pickle Rick murder your CPU",
        "author": "Uhhh_Insert_Username",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/100gucl/have_fun_letting_pickle_rick_murder_your_cpu/",
        "text": "Okay so I had a scammer take over my Facebook account, which is super annoying especially with how old my account is. However, the dude forgot to log out of all sessions, so I could still access my account on my phone. I could go under contact info and see the email he used to replace my own, and with all the email notifications of some random device in a foreign country logging into my account, FB Support worked quickly and restored my account.\n\nBUT! I really don't like scammers, and I have a friend who's fantastic at coding. So I decided to ask for a favor!\n\nSo this friend of mine wrote a .exe file that I could send to the email of the scammer, and when it's ran, essentially the file will simultaneously open 100 individual tabs of pictures of Pickle Rick every second which theoretically will murder their CPU.\n\nI saw the email was read after about a day after sending it, and MediaFire notified me of one download, which means he fell for the bait.",
        "created_utc": 1672568427,
        "upvote_ratio": 1.0
    },
    {
        "title": "My petty aunt",
        "author": "theoneandonlyfool",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/100eipy/my_petty_aunt/",
        "text": "[removed]",
        "created_utc": 1672558290,
        "upvote_ratio": 1.0
    },
    {
        "title": "Revenge on the sugar flower thief",
        "author": "whoopiedo",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/100edqh/revenge_on_the_sugar_flower_thief/",
        "text": "This revenge happened about 30 years ago for an incident that happened  about 8 years previously.\n\nI (f) am one of 5. My oldest sister(M) is 3 years older than me an our birthdays are two weeks apart. The year that I turned 18 and my sister turned 21, we had a combined birthday party. Mum baked some beautiful cakes and a friend decorated them with beautiful sugar flowers - they looked like mini wedding cakes.  We had a great party, but one of our younger sisters (B) pinched some of the flowers that were on our cakes. The cakes didn’t look too bad but we were a tad cranky.\n\nFast forward 8 years to B’s wedding eve. We were all home and again Mum made some beautiful cakes which were then set up in tiers and iced beautifully by the same friend. It was sitting safely in our parents office. What B didn’t know is that M and I had arranged for some extra sugar flowers to be made.\n\nWe timed it well - B walked past the office where M and I were loudly crunching on large sugar flowers. She just stopped and stared in disbelief!!!!  We didn’t string her along too much because it was the night before her wedding and she didn’t need the stress, but we totally got her.",
        "created_utc": 1672557698,
        "upvote_ratio": 1.0
    },
    {
        "title": "Sweet revenge for a cheating ex?",
        "author": "Most-Consequence4736",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/100a2or/sweet_revenge_for_a_cheating_ex/",
        "text": "My (M 22) (ex)girlfriend (F 19) and I moved into a new rental apartment but to help cover the costs, we agreed to let my best mate (M 28) move in with us. She paid for all of the bond and the 2 week advance payment as I had just bought a new car just a week before we got accepted. The total was $3260 there abouts. Her and I were on the lease, but my mate wasn’t due to the fact landlords wouldn’t accept 3 young people onto a lease, however they would accept a few months down the line after we submit a new lessee application. \n\nEverything was fine up until my mate moved in and she slowly started changing with everything she said and did. After a month into living there, she wanted to end things with me for reasons that weren’t her own and started to pack my things into a box. She had no where to go but I did so she made the decision that she was going to stay there and kick me out of our place. \n\nShe then ‘decided’ with my mate that they would stay there until they could find someone else and so my mate could finally get onto the lease and build up his rental history. I knew our relationship was over and I was completely oblivious that my girlfriend was doing this on the side with my mate/roommate that I’ve known longer than her so out of the kindness and the trusting person I was, I agreed to leave, let them have the place not thinking anything of it and staying on the lease until my mate could gather his financials to be officially on the lease. \n\nI was willing to do anything to make it easy for her because I still loved her, all until 2 days later. See she forgot to sign out of her instagram account on my phone so I was getting all the messages she was sending and receiving, to which I stumbled across her and my mates conversation on how they had sex the night before on my bed that I hadn’t yet taken from the apartment and that’s when my attitude changed. \n\nI knew she had no where to go, my mate didn’t want to move back home so they needed this place really badly, so I put in a request to end the lease on the spot and cancel the contract. She couldn’t afford the place by herself and the law states, I need to approve anyone to be on the lease and no one can force me off the lease, though I had the upper hand with my income. \n\nImmediately their life flipped and they scrambled to figure out ways to keep the place but couldn’t. I then requested all the fees when came to be $1000 (break lease, re-advertising, bond clean, rent until a tenant was found) to come directly out of the bond my ex solely put in for. \n\nWhen we signed the contract, even though she put in all the money, she signed off that we put in half and half so contractually I get half of what’s left of the bond and she can’t do anything about it. I started getting threatening messages from her to pay her back or else but she was shit out of luck. \n\nSo in the end, I took the place from them, all the furniture, all her money and from $3260, she was only left with $747 and with her income, no possible way of getting a new place to live in. Hadn’t I had found out, they would be living there having their best life and by that time, it would have been too late for revenge.\n\nThe motive behind taking the deposit was purely the fact I was just a bank account to her. In about 4 months I’d spent close to $15,000 on her with gifts, nights out, helping getting her car etc which I never ask for a cent back nor cared about. She on the other hand kept a note with a dollar break down of what she bought me and what I owed her for which the total being about $2,000 from the bond and her having to cover me on a weekend away.\n\n\nUpdate:\nThis post breaks AITA rules but I do have to ask, AITA?",
        "created_utc": 1672540975,
        "upvote_ratio": 1.0
    },
    {
        "title": "I need help",
        "author": "Ok-Dragonfly9233",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/1008dvo/i_need_help/",
        "text": "[removed]",
        "created_utc": 1672535282,
        "upvote_ratio": 1.0
    },
    {
        "title": "Employer decides to retaliate and fire me, so I get the company shut down",
        "author": "embarrassedkitten",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/10056k6/employer_decides_to_retaliate_and_fire_me_so_i/",
        "text": "[removed]",
        "created_utc": 1672525212,
        "upvote_ratio": 1.0
    },
    {
        "title": "Apartment Porch Pirate",
        "author": "xminimalmapx",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/100561e/apartment_porch_pirate/",
        "text": "[removed]",
        "created_utc": 1672525170,
        "upvote_ratio": 1.0
    },
    {
        "title": "Steal my tip money? Have a health scare.",
        "author": "sangemini",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/100531r/steal_my_tip_money_have_a_health_scare/",
        "text": "I was bartending with this guy (we can call him Fred) who was notorious for pocketing all the cash tips and still taking half of the credit card tips when the day was done. Management was told this several times but never did anything. \n\nThis place was a gigantic college game day bar where we pooled our tips and divided them at the very end of the day. \n\nIt was a game day and I worked a double. Fred only worked one shift but at the end of the night he was bragging about the money he had made and it was more than what I had made for twice the work. I told some coworkers that I suspected Fred had pocketed some tips and a bar back confirmed that he saw him do so several times. \n\nI tried confronting him but he was drunk and blew a gasket and I just left it. The next day, the staff went to lunch and he asked if anyone had any advil. I said I did and asked how many he wanted. He said 3. \n\nI gave him 3 of my Azo pills. (If you aren’t a woman: they are for UTI’s and they turn your pee a horrifying shade of red/orange.) \n\nApparently he later freaked out and went to the ER :/",
        "created_utc": 1672524918,
        "upvote_ratio": 1.0
    },
    {
        "title": "So, you like my chair?",
        "author": "mtngoatjoe",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/1004d56/so_you_like_my_chair/",
        "text": "My wife and I were camping with some friends one summer, and while I was setting up my camp chair, my buddy mentioned how nice my chair was.\n\nI looked at him and said, “Thanks, this is my favorite chair, and I really enjoy it. But unfortunately, it has a truly tragic history.”\n\nMy buddy said, “Oh, what happened?”\n\n“Well,” I said, “I actually bought this chair as a birthday gift for someone who was going to go camping with us. But they canceled at the last minute, and I decided to keep the chair for myself. And do you want to know what the tragedy was?”\n\n“What?”\n\n“It was your birthday.” And I continued enjoyed my chair for many years.\n\nMoral of the story: Don’t cancel on people at the last minute just because you can’t plan ahead or get a better offer.",
        "created_utc": 1672522771,
        "upvote_ratio": 1.0
    },
    {
        "title": "35-Year Petty Revenge",
        "author": "rsumm1313",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/1000ti2/35year_petty_revenge/",
        "text": "Most of you were probably not alive when I began this revenge, however petty it might seem.  \n\nIn about 1984-85 (can't remember exactly) I was managing a business in a southern college town which was heavily dependent on customer service and meeting schedules, especially when college students came back to school for fall semester.   Well, we were late for our scheduled appointment with one student (female) and she came to our office to register her complaint about our 'poor customer service'.  I agreed to meet with her in my office, and she proceeded to go on a tirade about how we had disrupted her schedule and her life, called our employees incompetent and yelled for a good 15-20 minutes without stopping.  In my decades of management since I've never had a customer speak to me like that.  \n\nSo one of the memorable things about this young 'lady' was that she was wearing a shirt with the logo of her employer - a popular national pizza chain that I will refer to as 'Mominoes'.   After she left, and I was able to enjoy a moment of silence, I vowed that from that moment on that I would never eat another Mominoes pizza.  Ever.   And I didn't for 35 years.  Unfortunately, we were invited to a friend's house just a couple of years ago and they were serving Mominoes and beer, so I figured that at that point Mominoes had suffered enough of my revenge and I had a slice.   Kinda wish I hadn't, but still I had a good 35-years of pettiness.",
        "created_utc": 1672512515,
        "upvote_ratio": 1.0
    },
    {
        "title": "maybe the mods of this board will block me",
        "author": "negativeimage2019",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/zzzbed/maybe_the_mods_of_this_board_will_block_me/",
        "text": "[removed]",
        "created_utc": 1672508359,
        "upvote_ratio": 1.0
    },
    {
        "title": "GOP spam texts several times a day? I sign you up for the DNC texts.",
        "author": "lavenderfox89",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/zzxulx/gop_spam_texts_several_times_a_day_i_sign_you_up/",
        "text": "I have been getting 1-2 GOP campaign texts per day even though I never signed up, and I always text STOP. I always block the number and I just get texts from another one. I'm not a Republican or a Democrat... although I'd vote Democrat over republican if I had no other choice most of the time... I hardly ever get any spam texts from Democrats. If I was, I'd take a similar approach.\n\nNow when I get a text message from a republican spammer, I head on over to democrats.org and sign them up for campaign texts. I have yet to see if this makes a difference to me or not, but I feel better knowing they're getting annoyed right back. Maybe they'll rethink things, but probably not.\n\nIf it doesn't slow down, I heard that scientologists never delete a number....",
        "created_utc": 1672504308,
        "upvote_ratio": 1.0
    },
    {
        "title": "They think my backyard is ugly, and want to use it for growing potatoes? Good luck!",
        "author": "DangerousWoman393",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/zztorh/they_think_my_backyard_is_ugly_and_want_to_use_it/",
        "text": "The people there lives right behind me don’t like my backyard, and asked not me, but the landlord of they would use it for growing potatoes and stuff like that, because it was ugly and i did not use it they said.\nSo when the workers next to where i live needed some space for all the tools, a big shipping container, pipes and stuff like that i said they could use my backyard. \nSo now they can look at my backyard and it’s just a mess, not a patch of grass is not covered.\nAnd im pretty sure they are mad, and i love it!",
        "created_utc": 1672491861,
        "upvote_ratio": 1.0
    },
    {
        "title": "think you are smarter? enjoy the riddle.",
        "author": "Fantasy_Assassin",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/zzssa6/think_you_are_smarter_enjoy_the_riddle/",
        "text": "Background: I  (25f) and my sister (18) don't get along most of the time, thanks to our parents favoritism of her which resulted in some mental health issues for me Years ago. \n\nDue to that I couldn't get to the college I liked, software engineer. But my sister got it this summer because the accepting grades had taken a leap of faith. She got it with a much lower grade. \n\nEver since my mum said she is smarter than me and my brother (15). We had enough of it and came up with a little plan. \n\nEvery year for my siblings birthday I give them riddle ans and they solve it, at the end their  gift is waiting. This year I got about 50 or so A4 sheets and filled them with numbers from top to bottom both side. Like the  movie knowing. \n\nMy sister blew the candles on October 5th and received her 50 sheet of numbers. The look of confusion on her face as she tried to figure out what they meant was priceless. \n\nTill today she didn't figure it out, and had cried several times, our parents are helping her, hoping to find something.\n\nPlot twist is there is no riddle. They are just random numbers. No matter how much she tries, she won't get it. She asked for help or hints from me, I told her she was the smartest in the family, right? So she should be able to figure out on her own.\n\nGuess I have next year birthday present too.",
        "created_utc": 1672488653,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can’t handle taking a break? Then no friendship for you!!",
        "author": "stegz337",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/zzsiak/cant_handle_taking_a_break_then_no_friendship_for/",
        "text": "[removed]",
        "created_utc": 1672487714,
        "upvote_ratio": 1.0
    },
    {
        "title": "Throw an apple at my wife? I'll ruin your night.",
        "author": "Apprehensive_Duck631",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/zzlrys/throw_an_apple_at_my_wife_ill_ruin_your_night/",
        "text": "[removed]",
        "created_utc": 1672462383,
        "upvote_ratio": 1.0
    },
    {
        "title": "Block my driveway, I'll make sure you stay where you're at.",
        "author": "Cthulhu_Spawn96",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/zzldo1/block_my_driveway_ill_make_sure_you_stay_where/",
        "text": "[removed]",
        "created_utc": 1672461076,
        "upvote_ratio": 1.0
    },
    {
        "title": "Revenge served cold.",
        "author": "nemoii",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/zzkbup/revenge_served_cold/",
        "text": "In high school, I was a banquet waiter.  I was setting up the tables and the event was just starting.  I notice a guy in a wheelchair coming to the door.  It's winter time, and I hold the door open, waiting for him to come through.\n\nA Karen, loudly complains, \"It's so cold, close the door. Geez.\"  In comes the guy, I give her a look, and the guy comes in and thanks me.\n\nWell about 45 minutes later the event is in fulll swing.  The hall seats about 250 people, so lots of tables, and it's time to serve salad.  Sometimes I have to haul a tray pull of 10 plates, and it can be a burden when you have to go to other side of the room.  I forget what happened, but one of the plates tips, and some of the bigger vegetables, tomatoes, etc. drops to the floor.  \n\nI pick it up, put it back on the tray, carefully remembering to not serve it and to bring it back when I serve the others.\n\nWell, wouldn't you know, I hear a familiar voice sarcastically sigh say something to the effect of, \"I guess I'm not getting a salad.  Ridiculous.\"\n\nAll I can say is Karen got her salad right away, and I no longer needed to worry about bringing the plate back on my tray.",
        "created_utc": 1672457787,
        "upvote_ratio": 1.0
    },
    {
        "title": "A little parking justice",
        "author": "Useful-Hat9157",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/zzjvct/a_little_parking_justice/",
        "text": "Im a story teller so enjoy.\nOne of my many pet peeves is parking. Most spots are big enough for a standard vehicle but you always find those who think thier car deserves two or even three spots.\n\nMany moons ago, i went grocery shopping with my wife and toddler son. Whe  we go shopping wed typically park beside the cart  return, as they usually get stuck in a way, that if you park in the spot beside them, gices you more space on one side of your vehicle. Very useful with small children.\nSo we pull into this lot and  spot an escalade parked in this spot. No big deal. Exept they parked across 2 spots essentially eating up 2.5 usae parking spots.\nAt the time i drove a little square body jeep cherokee. And wouldn't you know it! It fit perfetcly in the lines an inch from the escalade and well withing the lines of the parking spot i chose! \nSo we grab a cart from the return (no wacky wheel! my lucky day!) And do our shopping. I keep an eye out for the privileged parker and as we ring out our bounty, i see a lady walking toward the truck. Oh boy! I see her slowly approach, then look around, pause, go all the way around me jeep and come back. Seh unloads her cart and returns it (these carts have coin deposit so they usually get returned). She returnes to her escalade....then  nothing. Doesnt move, doesnt come back to the store looking for the hobo driving a clapped out jeep, nothing. Just sits there. At this point my wife is getting agitated as she doesnt like confrontation.  But im petty and bored. We wander out slowly. As we round the vehicle i see her huddling in her seat glued to her phone. She glances at me and averts her eyes just as fast.\nIm loving it. I unload the groceries carefully, i dont want to squish the bread after all.  At this point my toddler starts asking questions about stuff i stop what im doing and answer the questions, then continue the groceries. Stop every time they ask somthing then continue. After all groceries are in place i stap tje kiddo carefully into his seat, then return the cart. All this time the lady is on her phone eyes darting to catch a glimps at me then back to her phone call well im to close on my driver side to get in, so my wife gets out of the passenger side so i can slide on overto the driver side, she gets in, start the jeep, let it idle to warm up, all the while im staring right at this lady in the most possibly happy smile i can give her.\nI then wave at her and slowly drive away. I wasted a good 15 minutes of her time. \nPark in the lines people or park farther away if you fear door dings.",
        "created_utc": 1672456443,
        "upvote_ratio": 1.0
    },
    {
        "title": "Que debería hacer en el caso de una infidelidad de mi padre hacia mi madre",
        "author": "Anderxn",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/zzjkpg/que_debería_hacer_en_el_caso_de_una_infidelidad/",
        "text": "[removed]",
        "created_utc": 1672455599,
        "upvote_ratio": 1.0
    },
    {
        "title": "Beware of Kathy Brown cheater!",
        "author": "Plane_Inspection1664",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/zzilb9/beware_of_kathy_brown_cheater/",
        "text": "[removed]",
        "created_utc": 1672452733,
        "upvote_ratio": 1.0
    },
    {
        "title": "You won't behave yourself in traffic? I'll nullify your free parking.",
        "author": "Fiempre_sin_tabla",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/zzige6/you_wont_behave_yourself_in_traffic_ill_nullify/",
        "text": "[removed]",
        "created_utc": 1672452366,
        "upvote_ratio": 1.0
    },
    {
        "title": "Won't Give Me Personal Space? Enjoy this Air Drop!",
        "author": "boxfullocats",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/zzhtgk/wont_give_me_personal_space_enjoy_this_air_drop/",
        "text": "Obligatory posting from mobile warning , so sorry for formatting. And while English is my first language, my fingers are often faster than my brain. So excuse any typos/omitted words.\n\nSo I was reminded of this recently as my MiL for Christmas got us tickets to Disneyland.\n\nIt's 2017, and personal space wasn’t as big of a deal like it is today. We were with family at Disneyland, close and extended. My oldest was 7. If you've been to Disneyland then you'll know there is a Buzz Lightyear ride, right by the Space Rockets. It was taking forever to move in the line. Lots of kids in our group wanted to ride the Lightyear ride. And not a single kid could go solo. So as parents we had suffer the wait with them.\n\nWe got to the point where we weren't moving and my oldest wanted to ride the Rockets. We could see them from our place in line. Wait for the Rockets was as long is it took the previous riders to get off, more-or-less. Tired of waiting, oldest and I jumped out the Lightyear line and stood for the Rockets. There was maybe half a dozen people in front of us and they just loaded the rockets so we had a little wait. Behind us comes along a mom and her daughter. This girl was younger than my kid, but not by much. Again, it's 2017 and apparently personal space has not been introduced to this duo at this time. 2020 was probably very hard for them.\n\nNow what I haven't mentioned is that I was on my period. And I tend to be a bit gassy when I am. I was basically waiting to get on this ride and drop a silent but deadly in the air. It would get dispersed mid-air as we whirled away. No one needed to suffer.\n\nThis mom and daughter kept stepping closer to us, their fronts pressed against our backs. We'd take a step forward to put more space, they'd scoot in more. Her daughter started to dance in front of us, between us, just generally not being minded. They weren't in danger of not making the next load of passengers. Don't know why they insisted on doing this. I got the feeling the mom was trying to use her kid to cut in front. (\"Oh, my child in front of you now, I'll just get in front of you and stay.\") We'd seen it happen in a few other lines earlier that day.  \n\nI turned around and politely asked them not to crowd us, to give us some personal space. (Also for the sake of their noses if they bumped me - my chamber was loaded and just waiting.) Just to take a step back - the people behind them had given them enough room to do so.\n\nThe mother proceeded to snap, that it didn't matter, it was crowded (the park: maybe, this ride: no) and so on. Just generally being a jerk about the whole thing. I asked her to keep her daughter with her then. Gave the excuse that if she fell she could get hurt. This she obliged with much murmuring. \n\nI decided the next time they got too close I'd let my silent but deadly fart loose - because that's the kind I get on my period, so I made sure my kid stayed in front of me. No unnecessary casualties needed. Didn't have to wait long. Felt them push into my back one last time, and the package was dropped. What I didn't know was it was the daughter who bumped me, and her face was the same height as my derriere. So I let it go, and this little girl went \"Ewww!\" Then the mom made a noise once she got a whiff of it. \n\nNeedless to say they took more than a few steps back and found a rocket to ride on the opposite side from us.",
        "created_utc": 1672450562,
        "upvote_ratio": 1.0
    },
    {
        "title": "House next door",
        "author": "Swt19",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/zzhj90/house_next_door/",
        "text": "I was seeing a guy who had separated from his ex quite a while beforehand. She found out about me and successfully did everything to  ruin our relationship along with making several threats to me over messages - I knew she was all talk and would never have the guts to follow through with any of the ‘if I ever see you in person’ threats.. long story short, I found out where she lived and booked a viewing for the house next door to her that was up for sale. I made sure she saw me standing outside with the estate agent. funnily enough I never received another threat from her again.. Petty but put her in her place… what’s the prettiest thing you’ve ever done?",
        "created_utc": 1672449777,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can't behave yourself in traffic? I'll nullify your free parking privilege",
        "author": "Fiempre_sin_tabla",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/zzhgq5/cant_behave_yourself_in_traffic_ill_nullify_your/",
        "text": "[removed]",
        "created_utc": 1672449579,
        "upvote_ratio": 1.0
    },
    {
        "title": "Just got fired",
        "author": "DragonfruitUnfair752",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/zzh58t/just_got_fired/",
        "text": "[removed]",
        "created_utc": 1672448693,
        "upvote_ratio": 1.0
    },
    {
        "title": "When petty creates a book dragon.",
        "author": "Master-Protection-29",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/zzfzy7/when_petty_creates_a_book_dragon/",
        "text": "obligatory notice on phone and have dyslexia, there will be spelling and formatting errors.\n\nThis is from my childhood, rotary phones, A/C in cars wasn't standard, and written checks were common use. my mom could not only be petty, she could be a Karen, and take things extremely literal at times, this normally happened when someone threatened her safety or her children's well-being and education. The players are m for Mom, t - teacher, p- principal, and me. I'm also not completely sure this is petty enough, I don't think it's Karen enough and all the tags I looked for within education didn't fit.\n\nBackstory:\n I have dyslexia, and as a young child had beyond deplorable reading skills. Deplorable enough the school talked about holding me back a year to work on those reading skills. So, my mom knew I'd do just about anything for non-chore earnings, took me to the city library and we made a deal for each book I read and each half page synopsis/overview I wrote I would receive a quarter. Think Dr Seuss and Golden books were right up my alley at the start. As my skills improved the books became larger and longer because they and reading became less daunting. I'd graduation from Dr. Seuss to Popular Science publications, anthologies then to novels. The librarians were great help introducing and directing me to other books that seem to perk my curiosity and also my mom didn't care what books I read as long as I read. Backstory done.\n\nI was walking from one class to the next and a teacher stopped me and took my library book and refuse to return it. When I refuse to go to class and let said teacher keep my library book, the book and I were sent to the principal's office and mom was called.\n\nMom arrived to see me sitting in a chair outside the principal's office and after she was assured I had not been physically harmed she was introduced to the teacher and we were ushered into the principal's office. \n\nThe teacher waves my book by mom and the teacher informs her I had it.\n\nMom confused tells them she was with me when I checked it out. \n\nAll these years later I still mostly remember the conversation verbatim.\n\nT: This isn't appropriate for school.\n\nM: A book isn't appropriate?\n\nSigh taps books cover T: This *tap tap* isn't appropriate.\n\nM: Again it's a book. \n\nHuff T grabs book and slaps P. desk with each word: This is not appropriate for school.\n\nNot liking being talked down to moms voice is sharp: A book has words inside. Words inside a book educate. This is a place of education. How are words bound into a book in a school not appropriate?\n\nT grabs the bridge of his nose: This is a place of education this *waves book* is not appropriate in a place of education.\n\nM: Are you saying my child isn't allowed to have a public library book in a public school?\n\nT looks to P who gives T a continue wave and motion. T tosses book to mom who looks at the book and back to him. T: This isn't appropriate for a student.\n\nMom hands me the book. M to me: I love this book, when's it due back.\n\nT to P: Really your going to encourage this?\n\nM stands and shushes any response that might happen to say something stupid: I can't believe you have dragged my child here to be reprimanded for having a book. This is absolutely deplorable.\n\nT: A child shouldn't have that. It's Inappropriate!\n\nM: It's A Book! She's reading! How Can You Say A Dyslexic Child Reading Is Bad.\n\nT: It's a banned book!\n\nM: I. Don't. Care. She's Reading.\n\nP: Whao whao! Mom many school systems across the country have removed this book from circulation because it has been deemed inappropriate in those school districts. T. This book isn't banned on this school district, your recommendation for detention is revoked. Mom, to ensure this type of confusion doesn't happen again, can the public library books stay at home. Me, I'll lift any and all age restrictions on the school library, you can check any of those out and they're approved for all reading ages in this school.\n\nMe: Mom what's a banned book?\n\nM: Books that make little minded people uncomfortable.\n\nMe: I want to read them all. \n\nMom and I left the school, our next library visit I told the librarians all about 'Banned Books' how mom stuck it to the mean teacher and I wanted to read all the banned books they had. Mom said I can read all the banned books I wanted after I read her favorite book, The Death of Ivan Ilyich. By Tolstoy. I was in 8th grade when this happened and a freshman in high school when I finally finished Tolstoy. If you're wondering what book I had that sent me to the principal office, Fahrenheit 451. In remembrance of this I read each new book added to the banned book list when I hear of a book kerfuffle.\n\nI hope you enjoy this story about my mom, I have many.",
        "created_utc": 1672445614,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to become the happiest person you know",
        "author": "Anniessence",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/zzeuv6/how_to_become_the_happiest_person_you_know/",
        "text": "[removed]",
        "created_utc": 1672442692,
        "upvote_ratio": 1.0
    },
    {
        "title": "Be a crappy neighbor...sure I will give your kids wifi.",
        "author": "chevyfried",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/zzemu1/be_a_crappy_neighborsure_i_will_give_your_kids/",
        "text": "[removed]",
        "created_utc": 1672442123,
        "upvote_ratio": 1.0
    },
    {
        "title": "AITA for cutting off my best friend bc she used me to get other friends and slowly friend to manipulate everyone into hating me?",
        "author": "Bestfriend_revenge",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/zzbkya/aita_for_cutting_off_my_best_friend_bc_she_used/",
        "text": "[removed]",
        "created_utc": 1672434504,
        "upvote_ratio": 1.0
    },
    {
        "title": "Cheated on cheater then posted it online.",
        "author": "feytoday",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/zz948a/cheated_on_cheater_then_posted_it_online/",
        "text": "Basically, I am an a-hole here too but not really.\nI was in relationship of 3 years with this girl. During last 2 years, my friends kept telling me that shes cheating on me.\n\nEveryone claims to have seen her w other guys but I always said that I trust her and that she wouldnt do that. But in fact, I did trust them as I found clear evidence of this myself.\n\nThis went on for two years. My entire friends group and people who knew me thought that I was a cuckold.\n\nAfter 3 years of relationship with her, I broke up. She cried, begged me. I never told her that I actually knew she cheated. I just broke up.\n\nShe went public with this guy right away.\n\nOne month later I posted picture of my gf’s hand with engagament ring on it with caption “After 2 beautiful years, she said yes” followed by a reel of quick slide of our days from many vacations in these 2 years that I allegedly went to with my parents and siblings. \n\n*everyone* I know including my ex raided my dms. She came to my doorstep to cry and assault me calling me cheater. Neighbours vitnessed her throwing a big rock and breaking my window for “humiliating” her. Called cops on her and she got arrested.\n\nImagine. 💀",
        "created_utc": 1672428475,
        "upvote_ratio": 1.0
    },
    {
        "title": "Try and embarrass me in front of the class? You're gonna join me.",
        "author": "MattyCRapper",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/zz8mti/try_and_embarrass_me_in_front_of_the_class_youre/",
        "text": "[removed]",
        "created_utc": 1672427274,
        "upvote_ratio": 1.0
    },
    {
        "title": "Embarrass me in front of the class? Have fun recovering when I embarrass you.",
        "author": "MattyCRapper",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/zz8lp5/embarrass_me_in_front_of_the_class_have_fun/",
        "text": "[removed]",
        "created_utc": 1672427199,
        "upvote_ratio": 1.0
    },
    {
        "title": "Try To Make Me Look Stupid In Class? Good luck.",
        "author": "MattyCRapper",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/zz8j41/try_to_make_me_look_stupid_in_class_good_luck/",
        "text": "[removed]",
        "created_utc": 1672427018,
        "upvote_ratio": 1.0
    },
    {
        "title": "Revenge from beyond the grave",
        "author": "Former-Afternoon-918",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/zz80g2/revenge_from_beyond_the_grave/",
        "text": "My sister-in-law (SIL) died suddenly on Thanksgiving this year. Her memorial was set for this past week. Her sons put on a very respectable event for about 50 people. SIL was divorced in the 1970's. No contact with ex-husband. During the testimonial part, one of her closest friends who only knew her post-divorce gave a short speech. The friend related how SIL's ex drank a LOT, and it was the cause of their divorce. Friend then told what SIL did as the final act in her marriage.  SIL rearranged all of the furniture. Her husband came home after midnight stinking drunk, and unable to maneuver through the house. Everyone had a good laugh at this brilliant passive/aggressive behavior.  What the friend giving the testimonial didn't realize is that the ex-husband was attending the memorial! SIL sure got him back from beyond the grave.",
        "created_utc": 1672425738,
        "upvote_ratio": 1.0
    },
    {
        "title": "Claim my music as yours? Have fun trying to remake it.",
        "author": "Corto_Prince",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/zz68w3/claim_my_music_as_yours_have_fun_trying_to_remake/",
        "text": "I met my roommate in college 5 years ago. We were both going for studio engineering and music production. We became great friends almost instantly, we would often share beats with one another and also collaborate on some projects together. At one point we were marketing ourselves as a duo for music production. We were trying to get notice by more famous artist in our area, we made trap and R&amp;B beats. Some local artist have used our beats but no one major. Here is a quick side note. Whenever we would send out beats we would send them .wav files and it would always be in a loop never the complete beat.  Never the actual project file. This protected us from thieves. \nDuring the holidays I went home he stayed behind. I sent him over a loop (in a .wav file) a few hours I’m on Snapchat he is in a studio with a local artist playing my loop. At first I’m super stoked, I try to FaceTime my roommate he doesn’t answer, he just sends me a message saying, “Send over the project file.” I tried to FaceTime him again he doesn’t answer. Right away I know what’s he’s trying to do. So instead I go over to the local artist instagram and check his story. It’s him in the studio with my roommate, the artists says, “Yeah I’m here in the studio about to hop on this track that my man (insert my roommates name) made.” Now I’m livid. I tried calling my roommate again he answers and my first question was. “Why is he saying that’s your beat?” My roommate just says, “ you know how it is man just send over the project file so I can arrange it for him he’s ready to go right now.” I hang up and never send the file over. \nHe calls me over 20 times then  he send me a message saying, “ That’s fucked up that could have been our big break, you know he knows ppl in ATL and NYC I was gonna tell him it wasn’t mine, fuck you bro you just ruined us. Now he left, you made us look stupid.”  I didn’t respond. \nInstead I message the artist explaining the situation and told him I could be in his area if he really wanted the beat I told him I lived 20 minutes outside the city and could be there im about an hour. Now remember this is a local artist no one famous by any means he does know people but he himself is not famous. So he responds and tells me to come through. I play the full beat for him he said he wasn’t feeling it anymore. (Which artist say a lot) he then goes on to tell me that my roommate tried for hours to remake my beat but couldn’t even figure out the drum pattern. That’s how he knew he lied about the beat being his. He even called him out and my roommate still said it was his but that he was “drinking and smoking,” when he made it. Now he will never trust him again, and he told all of his homies to do the same. \nNow local artist don’t want to work with my roommate because they don’t know if what he brings is stolen or not. Which everyone knows in the music world is a really bad idea. Bottom line don’t try and steal from me. But now I gotta find a new place to live.",
        "created_utc": 1672421469,
        "upvote_ratio": 1.0
    },
    {
        "title": "Delete the only thing you care about",
        "author": "Jjones201",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/zz1xgf/delete_the_only_thing_you_care_about/",
        "text": "So going back about 6 years there was this girl in high school. Always started drama with anyone she could drag into it, even if you had nothing to do with her. Literally once a year or so she’d be the story of the school (smaller school). Anyway she hated me and my best friend who had nothing to do with her and would try to drag in into her shit.\n\nWell fast forward to last year, my cousin is into this crypto stuff and knows all these people that can do things on the internet. For example completely delete your Twitter/Instagram and such. Well this girl was a holy roller and had amassed a good following from going to church camp and meeting all these people through the years. (Nothing against these people she just acted as though she was the lord herself). Anyway so much cousins like who’s one person you’d get rid of, I throw out her name and he’s like “$10” and I’m like no she’s not worth it. \n\nWell low and behold the next day I get a venmo request for $10 saying “it’s done”. Years worth or followed and social media junk gone, and she’ll next know why or how. Had to make a whole now one, wish I could’ve seen her face.",
        "created_utc": 1672410690,
        "upvote_ratio": 1.0
    },
    {
        "title": "Malicious Compliance! Does anyone have any interesting work stories?",
        "author": "GottaLoveACuppa",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/zyzsgs/malicious_compliance_does_anyone_have_any/",
        "text": "[removed]",
        "created_utc": 1672404646,
        "upvote_ratio": 1.0
    },
    {
        "title": "I need advice on what to do about my selfish husband...",
        "author": "Lumpy-Company-6457",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/zyz3bu/i_need_advice_on_what_to_do_about_my_selfish/",
        "text": "[removed]",
        "created_utc": 1672402336,
        "upvote_ratio": 1.0
    },
    {
        "title": "Block my driveway, I'll make sure you stay where you're at.",
        "author": "Cthulhu_Spawn96",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/zyx4cc/block_my_driveway_ill_make_sure_you_stay_where/",
        "text": "[removed]",
        "created_utc": 1672395424,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why You Should Never Piss Me Off",
        "author": "THE_Mr_Visitor",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/zysqqa/why_you_should_never_piss_me_off/",
        "text": "[removed]",
        "created_utc": 1672380060,
        "upvote_ratio": 1.0
    },
    {
        "title": "AITA for keeping warm",
        "author": "ExtremeTrack9051",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/zysauh/aita_for_keeping_warm/",
        "text": "",
        "created_utc": 1672378700,
        "upvote_ratio": 1.0
    },
    {
        "title": "My friend got hit in the face because of a 'ya mum' joke and got revenge, obviously",
        "author": "Averagepersonidk",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/zyqda1/my_friend_got_hit_in_the_face_because_of_a_ya_mum/",
        "text": "[removed]",
        "created_utc": 1672372918,
        "upvote_ratio": 1.0
    },
    {
        "title": "My friend got punched in the face because of a \"your mum\" joke and got revenge, Obliviously.",
        "author": "Averagepersonidk",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/zyqaqx/my_friend_got_punched_in_the_face_because_of_a/",
        "text": "[removed]",
        "created_utc": 1672372734,
        "upvote_ratio": 1.0
    },
    {
        "title": "Petty revenge over disassembled motorcycle",
        "author": "Fit-Finger-6278",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/zyq6y8/petty_revenge_over_disassembled_motorcycle/",
        "text": "About 10 years ago, I told a friend I would build his old motorcycle into a custom cafe racer. He had already completely dismantled it a couple years prior (he hadn't ridden it in years) so he brought it to me, long distance (1k+ miles) while he was already coming here for another reason. Not long after, and before I had a chance to do anything with it, my life hit the fan and I was never able to build it. (I physically didn't have the means.) So I stored it, fully disassembled even the engine, in boxes and frame and wheels and exhaust and forks, in boxes and bins all that, and lugged it with me for multiple moves over the course of all those years.\n\nWe had a falling out about it around 5 or 6 years ago when he got all entitled and demanding and like I owed it to him or something. I get it. He hauled it up here, we had a plan, all that. I felt bad. I told him I'm sorry it didn't work out and that it would be safely here with me to pick up whenever he wanted. I haven't heard from him since, even though I've reached out. We were friends for some time so I know he can be a complete asshole when he wants to be.\n\nI'm moving across the country in a couple months so I reached out to return it to him - I was even prepared to pay for shipping it back to him. Turns out he's living back here in the same city. He flat out says he doesn't want it, refuses to come get it, and told me via text to sell it.\n\nBut he's being a complete dick and won't give me the title and has since stopped communicating entirely, despite multiple texts. Without the title, I can't even legally dispose of it - it's not my property. Abandoned property laws don't seem to apply because I consented to taking it, back then. I don't want a legal battle, I just want it gone.\n\nEven though we had a falling out, I've cared for this damn thing for 10 fucking years, in good faith, doing the right thing. Because I'm a good person. But no good deed goes unpunished and he's basically getting revenge and shitting on me in the process. One last \"fuck you.\"\n\nSo I got one last fuck you right back. I found where he's working (professional office environment) and I'm considering having some friends help me haul it down there and drop it off at reception. I can just picture a line of people walking in the front door each carrying a greasy old dirty box and plopping it at the reception desk! Right along with a note in a pink envelope that says \"here's your fucking motorcycle\". (and a photo as proof I returned his property.)\n\nOr, have a courier company do it. That might cost a lot, but it would almost be funnier and gets me off the hook of hauling it! Plus it'll be formal proof of delivery!\n\nWhat say you?",
        "created_utc": 1672372410,
        "upvote_ratio": 1.0
    },
    {
        "title": "I made him regret it",
        "author": "OkDiet4756",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/zyn4qe/i_made_him_regret_it/",
        "text": "[removed]",
        "created_utc": 1672363992,
        "upvote_ratio": 1.0
    },
    {
        "title": "I made him regret it",
        "author": "OkDiet4756",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/zyn4qf/i_made_him_regret_it/",
        "text": "[removed]",
        "created_utc": 1672363992,
        "upvote_ratio": 1.0
    },
    {
        "title": "Clean up your dogs poop then, crazy lady.",
        "author": "OkOutlandishness1363",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/zykv41/clean_up_your_dogs_poop_then_crazy_lady/",
        "text": "On mobile- apologies\n\nSo about 8yrs ago my bf and myself moved in to a new apartment and had 2 kitties and our doggo. It looked nice, neighbors seemed quiet and easy to get along with. We quickly found out that, as far as the people living across the hall, that was not the case. \n\nThey had a Yorkie (I love them, my parents Yorkie just passed away) and he was a very sweet boy. They let him shit on the front walkway and never cleaned it up. \n\nWe were nice at first. It’s not hard to pick up shit that you left behind. Asked her to please do it, yadda yadda. She would always say she would and then NEVER do it. \n\nThis is probably one of my best of all time petty revenge stories. \n\nI decided to pick them up. The 3 little mini tootsie roll poops. I decided to just pick them up every time and fill bags after bags. of of them.\n\nFast forward 9mo\n\nWe decide not to renew our lease and cited that as the main issue. Keep in mind, I’ve been saving these literal shit filled bags and stashing them in the communal shed the whole time. No one ever uses it  so no one ever saw them. \n\nAt this point I have 4 bags full of of her dog’s shit. We finished up cleaning and. Then dumped the massive amount of their own dog’s shit in a gargantuan pile right in front of their door. Turds are now raining down the stairs(only used for the 2 upper apartments), from the pile being so large.\n\nAfter that, we locked up the apartment, put our keys in the mailbox and left. I still wonder what everyone’s faces looked like upon the discovery of it. \n\nWe didn’t get our deposit back, obviously. The satisfaction of just imagining her staring at it was so great.",
        "created_utc": 1672358333,
        "upvote_ratio": 1.0
    },
    {
        "title": "Wondering why you are still single?",
        "author": "Anniessence",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/zyjr9y/wondering_why_you_are_still_single/",
        "text": "[removed]",
        "created_utc": 1672355700,
        "upvote_ratio": 1.0
    },
    {
        "title": "No need to backbite I'll talk trash in front of you",
        "author": "Hey_Joe1000",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/zyivl1/no_need_to_backbite_ill_talk_trash_in_front_of_you/",
        "text": "[removed]",
        "created_utc": 1672353587,
        "upvote_ratio": 1.0
    },
    {
        "title": "College laundry rooms are the best for revenge",
        "author": "LingonberryMedium780",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/zyez0j/college_laundry_rooms_are_the_best_for_revenge/",
        "text": "[removed]",
        "created_utc": 1672344397,
        "upvote_ratio": 1.0
    },
    {
        "title": "Gifted my Nephew a Power Bill for Christmas",
        "author": "BunHein",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/zyewqa/gifted_my_nephew_a_power_bill_for_christmas/",
        "text": "[removed]",
        "created_utc": 1672344251,
        "upvote_ratio": 1.0
    },
    {
        "title": "I made her eat trash...",
        "author": "Sea-Disk-414",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/zyehqi/i_made_her_eat_trash/",
        "text": "[removed]",
        "created_utc": 1672343308,
        "upvote_ratio": 1.0
    },
    {
        "title": "Illegal Airbnb Owner too cheap to fix issues",
        "author": "riddix",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/zye7h3/illegal_airbnb_owner_too_cheap_to_fix_issues/",
        "text": "I want to note that I hate Airbnb and I think a majority of the hosts have no business being hosts. I have had some bad experiences and have avoided using them the past 4 years. Someone gifted me a Airbnb gift card and I had it in my possession for over 2 years. I thought okay, it has been 4 years, wounds heal and maybe I can try it again and finally use this gift card. Also, I am not a Karen and I rarely leave bad reviews. Normally I try to be very understanding of situations and not vengeful, but this experience had too many issues for me to ignore. \n\nI planned a vacation to Canada and found a listing, it was a condo. 4.5 star rating, 3 bedroom, 2 bathroom. Price seemed okay and it had a designated underground parking space available for our car rental. I booked the place and didn't think much of it. \n\n3 days before my reservation the owner sends me instructions on how to access his place, the parking garage, etc. There is a note in his instructions, the property does not permit short term rentals like Airbnb and if anyone asks, I should lie and say I am staying for a month. Okay. Whatever shady stuff you want to do, fine with me as long as I don't get into any legal trouble here. \n\nI had no problems locating the condo and letting myself in using the instructions provided.  However, there was a slew of other problems that I don't think I should have had to deal with: \n\n1) The underground garage key button did not work though and cars would come in and out of the underground parking. No matter what I pressed on the garage key, it wouldn't work. I messaged the owner who said try this, try that, get closer, I fiddled with this thing for a hour. I ended up parking on the street, but that was permitted for overnight parking. Overall, I spent like 3 hours on this dumb garage key issue during the whole trip. \n\nHis solutions were: \n\n\\- Go replace the battery on the garage key button, but I didn't have a screw to free the battery from inside the garage key. I was also a bit annoyed that I had to spend my vacation time fixing an issue with his garage key. \n\n\\- He would send someone over, well that person never came and he changed his mind 4 hours later to send someone.  \n\n\\- He suggested I park in a paid parking lot, a one way 15 minute walk away from the condo. I would have to spend 30 minutes a day walking to and from my vehicle. He would pay for parking, but nothing else. I suggested he pay or give me money to discount the time I'm losing each day. A big reason I booked this Airbnb was because of the parking spot. \n\n2) Why am I paying a cleaning fee? The condo was not clean. Just the toilet was clean I think and the floor was swept. The carpet floors had human hair all over it gathering up around the corners and around the bed. The beds were made, but the bed sheets were not washed. You can smell body odors on it. There was a washer and dryer in the condo so we threw all of the bed sheets, pillow covers, and towels into the wash - it took about 4 hours to get through all of that laundry. \n\n3) The TV that sits on a TV stand was flimsy and broken. If you put any weight on the side of the TV stand, the top portion of it will dislodge and the TV will topple over. Which it did and an 15 year old flat screen TV was broken. I took responsibility and replaced it with a brand new one.  He was fine with that. I didn't blame him, but did inform him the stand was broken and sent him a video of it, he said he sees nothing wrong with it. \n\n4) While I was replacing the TV, I also took the garage key with me and replaced he battery. The garage key still doesn't work, I sent him the receipt for the battery purchase and my paypal information. I had to message him 3x until he randomly sent me a wire using Canada banks that I couldn't accept.. and I couldn't accept the money because I have a U.S. bank. He was just like too bad. I had to take it up with Airbnb whom reimbursed me. \n\nAfter all of that, the Airbnb host said his cleaning lady tried the garage key and she was able to get it to work by standing really close to the garage hub box (I'm not sure what it is called). I don't see the point in him saying that, but whatever. \n\nI left him a bad review on Airbnb, but I just didn't think it was enough. \n\nHere comes my revenge...\n\nI remembered on the first day of my stay, someone knocked on our door and asked who we were. I lied according to the host instructions that we were visiting from out of town and staying a month. \n\nI looked up the property management company of that building and emailed them. I informed them of my instructions to lie, shared the Airbnb listing link, and specified what unit it was. \n\nI got a response a few days later and the property management said it was unacceptable and they will be speaking to the owner. I'm not sure what the outcome is, I'll check in a few weeks to see if the listing is still up. Let's see if I shut down his Airbnb business.",
        "created_utc": 1672342639,
        "upvote_ratio": 1.0
    },
    {
        "title": "how do i get revenge?",
        "author": "Jetterblu",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/zycw31/how_do_i_get_revenge/",
        "text": "[removed]",
        "created_utc": 1672339642,
        "upvote_ratio": 1.0
    },
    {
        "title": "I’m gonna expose his ass and his little secrets",
        "author": "RevolutionaryMeat978",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/zybvej/im_gonna_expose_his_ass_and_his_little_secrets/",
        "text": "[removed]",
        "created_utc": 1672337188,
        "upvote_ratio": 1.0
    },
    {
        "title": "Need help spamming a cell phone",
        "author": "Fuckmynebula",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/zybrs6/need_help_spamming_a_cell_phone/",
        "text": "[removed]",
        "created_utc": 1672336946,
        "upvote_ratio": 1.0
    },
    {
        "title": "Making my friend pay for a jar of peanut butter",
        "author": "mixedcan42",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/zybaue/making_my_friend_pay_for_a_jar_of_peanut_butter/",
        "text": "[removed]",
        "created_utc": 1672335828,
        "upvote_ratio": 1.0
    },
    {
        "title": "I know someone who loudly takes personal calls in another language on speakerphone at work",
        "author": "Broccoli14",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/zyaryn/i_know_someone_who_loudly_takes_personal_calls_in/",
        "text": "[removed]",
        "created_utc": 1672334537,
        "upvote_ratio": 1.0
    }
]