[
    {
        "title": "Ruin my makeup, I’ll ruin your reputation",
        "author": "mommyissues4losers",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/zj22i0/ruin_my_makeup_ill_ruin_your_reputation/",
        "text": "[removed]",
        "created_utc": 1670782018,
        "upvote_ratio": 1.0
    },
    {
        "title": "I replied to a condescending comment in kind",
        "author": "rand0muser21",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/zj1oi1/i_replied_to_a_condescending_comment_in_kind/",
        "text": "So, I'm not from the US originally. I went to high school here, college, been here more years than not. I would say I have assimilated well. But sometimes, I still get the usual \"Where are you from originally?\" \"Your English is so good!\" \"I've been to this country that's 3 countries away from yours, so I'm basically an expert.\" Most of the time it's well meaning and people usually are genuinely interested. But when you hear this over and over, you get a sense on who's being genuine and who's not.\n\nSo over Thanksgiving weekend, my girlfriend invites me to dinner with her family. I've met them before and we get along great. Her dad calls me to rant about the football team. Me and her brother are in a fantasy basketball league. Her mom always suggest baby names to us. Good vibes all around. At the dinner, some of her extended family is there, which includes a lady who was introduced to me as wife of the uncles. She's a recent addition to the family, from what I can tell. Anyway, I immediately know what kind of person this is. \"Karl an I were recently in Marrakesh (The most obnoxious pronunciation,) it was so eye-opening.\" \"We donated to all these charities this holiday season, we're just trying to do out part\"\n\nEventually, I have to talk to her. She finds out I'm not from the US originally. Her eyes light up. Huge smile, the most high pitched, condescending voice. \"Wow, your English is so good!\" So I replied with something I wanted to say for a while, but hadn't seen a good opportunity. \"Thank you, so much! Your English is good, too!\"\n\nEveryone in the vicinity got very quiet. GF's mom came to the rescue to take her away on some task. The evening passed without further incident. After everyone left, her brother and dad are laughing hysterically, recounting the incident. Her mom, is trying to appear stern, but can barely keep the smile of her face. In the following days, GF is gleefully relaying to me all the family members who thought this was hilarious. I am about to beat her brother in fantasy this week. Life is good.",
        "created_utc": 1670781410,
        "upvote_ratio": 1.0
    },
    {
        "title": "I replied to a condescending compliment in kind",
        "author": "mwright0429",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/zj1igx/i_replied_to_a_condescending_compliment_in_kind/",
        "text": "[removed]",
        "created_utc": 1670781134,
        "upvote_ratio": 1.0
    },
    {
        "title": "Former Employer Revenge",
        "author": "scaf007",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/zj0ym0/former_employer_revenge/",
        "text": "[removed]",
        "created_utc": 1670780176,
        "upvote_ratio": 1.0
    },
    {
        "title": "\"It's obvious you're not reading the material\"",
        "author": "InitialTofu",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/ziu9fl/its_obvious_youre_not_reading_the_material/",
        "text": "No matter how much I studied I was always a flunk when it came to history class. I used to have a 5pm-12pm schedule where I would just try to POUND the material into my head, but in the end I would always fail my exams. The only thing that kept me from absolutely failing and having to retake the class in highschool were my homework, my assignments, and extra credit the teacher would give out.\n\n\nNow, my teacher was one of those \"teacher of the year\" types. She appeared in a lot of teachers magazines and had quite a reputation in the school. Everyone really appreciated her hands on approach when it came to mentoring students. She would always pull us out of the classroom one by one and individually go over our progress reports when the time came to. During one of these sessions, she was fairly disappointed with my progress and told me :\n\n\"It's obvious you're not reading the material (myname). I don't know what to tell you, you're not putting in the work and I'm done trying with you.\"\n\nHearing this absolutely shattered me, because I know goddamn well I PUT IN THE WORK. I just wasn't the best at absorbing the material like everyone else in my class.  I hate how she just assumed that of me without any real affirmation.\n\nTime flies by and it was eventually time for us to take our state exams. For this special occasion, we were all given study guides that contained everything (and I mean everything) we needed to know to do well on the test.\n\nI don't know what came over me, but I would spend every moment I could writing what was on that study guide over and over again on a sheet of paper until I memorized it by muscle memory (all 60 pages front and back). When it was time for us to take our test I must have looked insane because I was muttering and scribbling the air with my writting hand the entire time.\n\nWhen the results came in, there was only one person who scored a 100 in the entire US History AP class: ME! My teacher was very shocked and asked me how I did that. I didn't know what to tell her other than \"I read the material.\"",
        "created_utc": 1670769120,
        "upvote_ratio": 1.0
    },
    {
        "title": "Keep me awake? I'll blast my thrash metal music",
        "author": "EzrasNoseDent",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/ziqqkv/keep_me_awake_ill_blast_my_thrash_metal_music/",
        "text": "[removed]",
        "created_utc": 1670763166,
        "upvote_ratio": 1.0
    },
    {
        "title": "Yes, i owe you money, but i'll pay you in the most annoying way i can think of.",
        "author": "Lecheroo23",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/zipq28/yes_i_owe_you_money_but_ill_pay_you_in_the_most/",
        "text": "[removed]",
        "created_utc": 1670761042,
        "upvote_ratio": 1.0
    },
    {
        "title": "am fost batjocorit de copii de la școală am fost batjocorit de copii de la școală ei ma băteau și făceau misto de mine și ma înjurau într o zi am început sa plâng și de atunci toți copii au început sa îmi dea mai mult bully ei chiar mi au pus și o porecla morcovita după aceia eu i am bătut pe toți",
        "author": "valiiiiii456",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/zimj15/am_fost_batjocorit_de_copii_de_la_școală_am_fost/",
        "text": "",
        "created_utc": 1670752235,
        "upvote_ratio": 1.0
    },
    {
        "title": "Armrest In Peace",
        "author": "Existing-Anything-34",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/ziijc8/armrest_in_peace/",
        "text": "Allow me to ramble, as is my habit: a few years back I wound up in Florida for technical training.  A week of cramming to take an industry test, interspersed by as much food as my expense account would reimburse and as much bourbon as it took to knock me out for seven hours.  You IT guys can feel the angst, right?  This time around, I actually knew a pretty good slice of the material, and I got bored and chose to take the certification exam a day early.  Got a good score, so I'm done and it's only 10 AM.  Now, call the airline and change my ticket - the fee is on the company, not me, and they were saving the expense of four extra meals and a day's car rental.\n\nScored a reasonable flight, but had to take the middle seat.  No sweat - the flight's only a few hours, I'm getting the airline miles for the segment, and my loyalty credit card got me boarded in the second group so plenty of overhead luggage space.  I settled in, comfy, in a good mood, ready to relax and to get home early.\n\nThen Prick showed up.  Dressed in a French shirt with a white collar, braided belt and pinstripe pleated pants.  Who let the 90s back in here?  Plops down in the aisle seat, pulls a sheaf of paper from the obligatory leather briefcase, and without so much as a howdy-do says \"I need the armrest, move your elbow.\"  Not \"please move your elbow.\"\n\nI have a short fuse for bullshit.  I let it burn just enough not to get fired, arrested, or thrown off of an airplane.  I pointed to the control buttons under my left palm, then pointed past him to the control buttons on his left-hand armrest.  I said \"look, sport, these are my buttons, attached to my armrest.  Those over there are your buttons on your armrest.  The ones over here (to my right) are buttons on the armrest belonging to the person who will show up for the window seat.  You see that extra armrest under the window?  You want two armrests, next time buy the fucking window seat.\"\n\nNow I'd boarded early, as I said, so there was a long interval in which I listened to Prick shuffle the papers almost non-stop as he engaged in a very unnecessary business call while he could still use his phone.  As the cabin door closed, the seat to my right was still empty.  I thought about staying put, but in a moment of humanity I thought maybe Prick was being a prick because this was a last-minute trip he didn't want to take, or maybe because someone called him out for dressing like Gordon Gecko.  So I turned to him and said \"looks like we've got a no-show over here.  Since you're feeling crowded, would you care to have the window, and we can leave the middle vacant?\"  Prick didn't even look up.  He just grumbled into the stack of papers he was holding \"no, I'm fine.\"  Not a \"thank you\", no \"please, you take it.\"  Not an ounce of grace in him.  Maybe his wife was cheating on him.  With his boss.  While he was away on business.\n\nSo, I moved over to the window seat.  It was a sunny day, and I got a good look at the scenery below as I split a can of tomato juice between two minis of vodka.  Prick never said another word to me the whole flight, which was fine, but he did look at me funny when I raised my left-hand armrest so I could manspread into the middle seat.  I know you were expecting more, maybe I should have stayed in the center bucket but my comfort was more important than Prick's discomfort, and the best petty revenge is getting my way over and above anything else.  Happy landings.",
        "created_utc": 1670740935,
        "upvote_ratio": 1.0
    },
    {
        "title": "Chocolate Chip Cookies",
        "author": "Interesting-Click600",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/zihvh9/chocolate_chip_cookies/",
        "text": "I was talking with a friend when I remembered this story. This happened a while back when I was at my dad's house. We got into a discussion over something I've since forgotten. I went to my room for a bit and cool down. When I finally decided to get up and do some laundry my dad and little brother were making cookies. They were using premade cookie dough because the majority of men in my family are helpless. I was walking by the kitchen as the timer wen off and my dad took the cookies out of the oven. (You need to walk by the kitchen to get to the laundry room) My dad poked them saying they were still soft in the middle so he decided to put em back into the oven to let them bake for a little bit longer. (maybe five minutes) Now, I could have said something... But I was still salty about whatever he said earlier so I kep my mouth shut. He kept putting em back in the oven becuase they were still soft until he dicided he didn't want to burn the cookies. Those cookies could go head to head with a brick. Still edible if you soaked it in milk for a minute. In hindsight I feel a little bit bad because my little brother wanted fresh baked cookies. (probably soft)  I can't go back in the past. Maybe I'll make up for it by making them some. Guess we'll see",
        "created_utc": 1670739489,
        "upvote_ratio": 0.99
    },
    {
        "title": "[PC] (Game) RappelzTournament #MMORPG Open World",
        "author": "AminaAzanu",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/zigh7m/pc_game_rappelztournament_mmorpg_open_world/",
        "text": "[removed]",
        "created_utc": 1670736402,
        "upvote_ratio": 1.0
    },
    {
        "title": "Deja Vu and the dog mat.",
        "author": "Helln_Damnation",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/zienq0/deja_vu_and_the_dog_mat/",
        "text": "About 10 years ago I had a friend who we will call Karen.  Karen had adopted a little dog, so that Christmas I made her dog a snall patchwork mat.  I was quite proud of that mat as I was learning the craft and did a pretty good job, with nice fabrics and reasonable quilting. I told her how much I enjoyed making it and I hoped it was what she wanted for the dog. It was in colours that matched her decor and she said she loved it.  And Dog liked lying on it too, he kept going back to it all evening.    \n\nAs anyone who does any kind of craft will know we can always recognise our own work...  \n\nSome months after Christmas I drove to visit my family 1300kms away.  I always stop overnight in a town half way there.  Now Karen’s daughter lives in this town, and Karen had been to visit her for the holidays. I got there quite early so wandered around the shops for a bit and went into a charity store.  And saw my mat - Definitely my mat, that I had made, with my little label and initials in the corner.  So, I bought it.\n\nHer birthday was the next month, and I gave it to her again. I told her how much I enjoyed making it and I hoped it was what she wanted for the dog.  (I managed to say the exact same words with a straight face) And the dog went over and lay down on the rug. The look on her face was worth it.  \n\nNot friends any more.",
        "created_utc": 1670732405,
        "upvote_ratio": 1.0
    },
    {
        "title": "I quit my job before they could fire me",
        "author": "kamamad1",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/zicnpc/i_quit_my_job_before_they_could_fire_me/",
        "text": "So, I found out I was getting fired from my job. I am a mortgage underwriter by profession. With the way the economy is I got laid off in June. I found a new job in August, but I really wasn't into it. Unlike my previous position, there wasn't any formal training at all. Just a quick Zoom call with the previous person at my position. They also hired me a month before a massive deadline and gave me very little guidance on how to proceed.\n\nI had reservations about taking the role, it was a much lower salary than I had and benefits sucked. But it was WFH and the salary would be enough to cover my expenses. In the first month leading up to the deadline, I really tried. I stayed late into the night finishing projects, getting familiar with the financials and trying to learn on my own. After that, I checked out of the job. I felt like they didn't care enough about this position to invest resources into structured training and expected me to figure it out on my own, then why would I care?\n\nThe last couple of months passed with me going thought the motions. Last week, big blowup. There was an error in the big project I completed in the first month. I fix it, but another error on a different task. This one, I know for sure isn't my fault. There was an excel sheet with the wrong formula, which led to the data being completely off. Thing is, my boss told me to specifically change the existing formula to the one that was used. I remember, because I thought that was weird, but didn't argue and did what I was told, because at that point I didn't care.\n\nThis week I very important and time sensitive task. Tuesday, I am on LinkedIn doing my customary scroll though available remote positions. I see my company posted a new position. Mine. I took a lunch break and went for a drive to clear my head and get some Chipotle. I come back, email from my boss. After you're done, please compile a list of your responsibilities, the projects you worked on and the resources you used. This was needed for HR for \"new record keeping process.\"\n\nSo to sum up, they worked me through the busiest time of the year with no training, were about to fire me &amp; have me compile training materials for my replacement. So I decide to quit. I didn't do the task and spent the next two days eating pecan pie with coffee in front of my TV catching up on some Netflix. At 1 PM on Thursday, I write a resignation email to all the bigwigs. Immediately, my phone is blowing up. My boss goes into the usual song and dance. Why? How could you? This is irresponsible. You're letting down the company and your coworkers. We have invested so much in you. You're supposed to give 2 week notice. Etc. I pointed out to them that my offer letter when they hired me bolds and underlines the words at will employment, wished them well and hung up. Since then, I've gotten many more texts, calls and emails. I remain steadfast.",
        "created_utc": 1670728113,
        "upvote_ratio": 1.0
    },
    {
        "title": "Idiot kid calls the cops because we \"hurt his feelings\", ends up self-reporting.",
        "author": "mememasterthegreat",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/zice7r/idiot_kid_calls_the_cops_because_we_hurt_his/",
        "text": "This happened when I was in grade 8ish and I (14m at the time) wasn't actually involved in the situation itself but it happened in my class so I thought I would share. \n\nThis kid in question was a total jerk and hated by our entire grade (of 67 people). He would regularly steal things like pencils, calculators, erasers, and other things sometimes DURING A TEST. If it wasn't during a test, he would play dumb and say it was his own. Sometimes he would even go through peoples' lockers and take their stuff without asking.\n\nOn our class's snapchat, he would also be like \"guys me VS (some guy) in a fight tomorrow bring everyone call ALL the teachers too\". That was an actual message he sent a couple times. Not only that, but he would also not show up to school the next day. \n\nHe was generally really annoying too. His breath smelled like crap, which made him disgusting to be around in general. He failed every subject, which is expected when you go on 70-minute \"bathroom breaks\" (the bathroom was literally right outside the classroom).\n\nSo then, one time he threatened he was going to fight someone the next day again. This time, however, my classmates snapped. \n\nYou see, this kid wasn't even super tough or shredded. In fact, he was 5'2\" and 140lbs. \n\nHe couldn't even do a pushup. He claimed he could do 100, then when asked he failed to do one. He would try, then struggle to pull himself back up (not even in the pushup position; he would straight up lie down and then struggle to get up)\n\nThen, everyone started roasting him so bad (idk what the roasts were) that we suspect he deleted his snapchat account entirely. He had taken some screenshots beforehand, so that he could show the principal of our school and try to get us in trouble (he was just trying to get us in trouble - he wasn't easily offended.) \n\nSo then, this kid told his parents, who told the principal. The parents also called the cops, and they were to show up the next day. \n\nWe come into school the next day, and there are 4 police officers in our school. They call down the kids who were roasting and each of their parents down to a meeting room. I wasn't there, but I heard the interview/mild interrogation went something like this. For simplification, the kid will be known as Jay. \n\nPrincipal: So what have these men (gesturing to the kids) done to you that you have had to call the cops?\n\nJay: They called me names and were hurting my feelings!\n\nOfficer: Do you have proof like images or screenshots?\n\nJay: *pulls out phone* Here! This is what they said about me!\n\nPrincipal: This is really bad. Why did you guys do this? (asking the kids who roasted Jay)\n\nKid 1: Wait. We have a reason. He did (proceeds to explain everything he does, and shows screenshots of the fight threats). We were tired of it, and so we did what we did. \n\nOfficer: Ok, what are your thoughts on this? (asking the parents of the kids who roasted Jay)\n\nAll the parents said that they fully support this action taken by them and they would have done the same if they were in that situation (supporting the roasting). \n\nOfficer: Thanks, we will follow up with more news tomorrow.\n\nThe next day, we found out that Jay ended up getting in trouble. The kids who roasted him were set free, and Jay was given an in school suspension for a week. \n\nThe next day,  days ago, we had a supply teacher. Our grade is notorious for being *mischevious* when a supply is teaching us, so I was expecting a fight to break out.\n\nThat's exactly what ended up happening. Kid threw 2 punches, thankfully missed and the other kid backed off and the supply took Jay into the hallway to lecture him. They were gone for 15 minutes. \n\nAs soon as Jay got back in the classroom, he was FUMING. For some reason, he decided to charge fullspeed (slow) at a kid who didn't even do anything wrong. He ended up getting sent into the office, and he got in even more trouble because he wasn't in the office for his suspension anyways.\n\nThe day after that, we had recieved great news. \n\n\"Due to reasons you all know of, and I'm sure you have been keeping track,\"\n\n\"Jay has been removed from the school by the police as he not only threatened to fight and actually followed through with it several times, but also wasted the police's time for something that Jay knew he would lose.\"\n\nWe also found out he had been similarly removed from 9 other schools because his parents baby him. This was his first suspension, but only because his parents pulled him out of the schools before he had the chance to get suspended.",
        "created_utc": 1670727515,
        "upvote_ratio": 1.0
    },
    {
        "title": "A tad petty",
        "author": "Lilyisboredd_",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/zi9bj1/a_tad_petty/",
        "text": "When I was younger in one of my lessons at school I was friends with everyone that sat  on my table except one girl as she did something horrible to my other friend who also sat on the table and was quite snarky and rude with me aswell. Before this happened I usually got everyone’s workbook when I went to get my own but after it happened  whenever I got them i left hers there and said “ sorry I couldn’t see your book anywhere” \n\nIt’s not very big of a thing but I found it quite funny and laugh whenever I think back to it.",
        "created_utc": 1670720677,
        "upvote_ratio": 1.0
    },
    {
        "title": "Don’t wanna let me go to a party? Ok",
        "author": "Lonely-Librarian4724",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/zi91cd/dont_wanna_let_me_go_to_a_party_ok/",
        "text": "[removed]",
        "created_utc": 1670719931,
        "upvote_ratio": 1.0
    },
    {
        "title": "To give in or not to give in to petty revenge",
        "author": "datapicardgeordi",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/zi82v4/to_give_in_or_not_to_give_in_to_petty_revenge/",
        "text": "[removed]",
        "created_utc": 1670717383,
        "upvote_ratio": 1.0
    },
    {
        "title": "Bye, you lying fake-named fuck",
        "author": "truthfulness69",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/zi5ssk/bye_you_lying_fakenamed_fuck/",
        "text": "[removed]",
        "created_utc": 1670711634,
        "upvote_ratio": 1.0
    },
    {
        "title": "Ms. Queen B at the yoga studio leaned over me while I was lacing my boots and said “you know, you’re supposed to leave your shoes in the lobby.”",
        "author": "Llor_lo",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/zi4sk9/ms_queen_b_at_the_yoga_studio_leaned_over_me/",
        "text": "[removed]",
        "created_utc": 1670709277,
        "upvote_ratio": 1.0
    },
    {
        "title": "Put me on probation and I'll ruin your weekly event",
        "author": "pink_turtle_23",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/zi47xi/put_me_on_probation_and_ill_ruin_your_weekly_event/",
        "text": "I was at this really terrible grad school. The professors were antagonistic to all the grad students regardless of personality or work ethic. Anyways one jerk professor loved having cookies with the professors and grad students of the department on Fridays. Anyone could bring cookies; you can buy them or bake them. It usually was a way for professors to gloat or tell the grad students how \"lucky\" we are for being in this \"great\" department. \n\nAnyways I was having issues with my advisor and tried to report him for provable incidents. But the department decided to retaliate against me put me on probation. Go figure, bad people support bad people. They absolutely were pushing me out of the department and trying to make an example of me. Plus they were trying to get the grad students back in line, and it did work. The remaining grad students were much quieter after my probation..\n\nThe department wrote my probation that once I get an advisor I was off probation. At that point I decided to leave the university completely and go to another program. I applied to a university where I already had connections; they pulled a few strings so I had my acceptance within 2 weeks of applying. \n\nSo I scheduled my probation meeting on Friday right before their cookie party, and signed up to bring cookies too. The jerk professor who started cookie club was also the grad coordinator, and on my probation committee. He was the main force behind putting me on probation. His main concern is the image of the department, and he decided getting rid of me was better than admitting my advisor had \"issues.\" Plus he thought he could silence and destroy me. \n\nDuring my probation meeting, I wore a sweatshirt of my new university and printed my new acceptance letter off and highlighted the name of my new advisor. I gave them the letter at my probation meeting, and technically they had to let me off probation based on their own rules since I had a new advisor. They didn't write it had to be an advisor from their department.\n\nThen we went to the cookie meeting and the cookies I brought were made from a cookie cutter of the new universities logo. I then announced to the professors and grad students that I was leaving and no longer tolerating this department. One professor who liked me literally slow clapped at how funny this was. The jerk professor who started cookie club just stared daggers at me the whole time. No professors were gloating that day, and a few of them literally ate cookies with another universities logo.",
        "created_utc": 1670707924,
        "upvote_ratio": 1.0
    },
    {
        "title": "took the last creamers",
        "author": "SnooBunnies7461",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/zi0ii6/took_the_last_creamers/",
        "text": "I was at a hotel that had a complimentary breakfast every morning from 6 to 9:30. The woman who clean and replenished things spoke very little English but was so nice to everyone. \n\nThis guy was there the first 2 mornigs basically ordering her around and making board line racist comments. So rude for no reason. \n\nThe 3rd morning he was there as she finished putting everything away and barked out an order for something. She gave him what he wanted and then locked up the storage area and went onto her next task. \n\nNow I had watched this guy and knew he used creamer in his coffee so I took the entire bowl of creamers as he was toasting his bagel, opened every last one and poured it into my cup of coffee. Then I listened to him complain about having to use powdered packets of non dairy creamer as I sauntered out of the room.\n\nThe most petty but rewarding thing I have done in years.",
        "created_utc": 1670699046,
        "upvote_ratio": 1.0
    },
    {
        "title": "Keep kicking down our snowmen? Have fun breaking your toes.",
        "author": "XxFireflyxxX",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/zhzr50/keep_kicking_down_our_snowmen_have_fun_breaking/",
        "text": "This was more than a decade ago, back when my sister and I were children (I think I was 9, and she was 11, but I could be a little off).\nAround winter, like most kids, we built snowmen in our yard, and that year was no different. \nThe only thing that changed was that someone had been repeatedly destroying our snowmen. \nAfter the third time it happened, her and I decided to do something about it and began plotting our revenge.\nWe have a fish pond in our backyard, surrounded with large decorative rocks; rocks that would hurt a lot if someone were to kick them.\nIt took at least half an hour, but her and I managed to haul enough of them into the front yard to make a good sized stack of rocks. \nNext, we built a snowman around the stack, hiding the rocks inside of it. \nSure enough, our serial snowman-killer took the bait. \nThe next day, my sister and I were in the backyard. We were feeding the fish (after chipping a hole in the ice that covered the pond) when we heard someone shouting in pain and cursing.\nWe rushed to the side of our house and saw a couple of older boys standing around while their friend was sitting in the snow and clutching his foot. Our snowman was destroyed, exposing the pile of rocks inside of it. \nJustice had been served, so we went back to feeding the fish.\nThe snowmen we built after that were left alone. Pain is a pretty good deterrent, I guess.\n\nTL;DR: guy keeps kicking down the snowmen my sister and I built, so we made him break his toes.",
        "created_utc": 1670697178,
        "upvote_ratio": 1.0
    },
    {
        "title": "Bye, Felecia!",
        "author": "TekJansen69",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/zhzkhf/bye_felecia/",
        "text": "Years ago, there was this guy in my office who used to delight in teasing me.\n\nI'm not sure if it was bullying, but it didn't bother me much, and maybe I'd even over respond.\n\nFor example, one day I was just making photocopies, and he says, \"If I didn't know you were married, I'd assume you were one of those people who never had sex.\"\n\nI replied, \"And I always assumed you were one of those people who never had sex, unless someone was yelling, 'No, Uncle John! Bad touch! BAD TOUCH!\"\n\nResponses among the bystanders were... mixed. Too far? Maybe.\n\nAnyway, one day \" John\" announces in our weekly meeting that he's accepted a job at another firm, and will be leaving in two weeks. There was sadness and a few tears.\n\nThe moment the meeting ends, I walk into John's office, while he's on the phone, and start walking around, putting little yellow post-it notes on things. \n\n\"Tek, what are you doing?\"\n\n\"I'm just calling dibs on some of your stuff, before you go.\"",
        "created_utc": 1670696737,
        "upvote_ratio": 1.0
    },
    {
        "title": "TP shenanigans.",
        "author": "Visual-Ad-916",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/zhy4e3/tp_shenanigans/",
        "text": "[removed]",
        "created_utc": 1670693288,
        "upvote_ratio": 1.0
    },
    {
        "title": "The bitchiest petty revenge I’ve ever had😹",
        "author": "xPettyprincessx",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/zhxnha/the_bitchiest_petty_revenge_ive_ever_had/",
        "text": "[removed]",
        "created_utc": 1670692162,
        "upvote_ratio": 1.0
    },
    {
        "title": "Any ideas for getting back at an abusive boss?",
        "author": "JW_2",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/zhvxnv/any_ideas_for_getting_back_at_an_abusive_boss/",
        "text": "[removed]",
        "created_utc": 1670687876,
        "upvote_ratio": 1.0
    },
    {
        "title": "Selective Literacy.",
        "author": "gypsypoetry",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/zhuemb/selective_literacy/",
        "text": "So I was telling my daughter this story the other day and thought it might fit well here.  \n\nYears ago... (think shortly after 9/11)... I worked at a small airport in a mountain town.  The airport was smaller than a strip mall, and had two incoming lanes into it. The one on the left went into the parking lot, and the other was a two lane drop off/pick up lane. It was similar to any other drop/off at a larger airport, and had the necessary signs explaining its purpose. Specifically,  it had signs that said \"no parking, drop off and pick up only\" or something to that effect. \n\nWhile standing outside a lady in a small sedan pulls up right beside the sign. She turns off her engine and takes out the keys.   I look at the sign, then I look at her and figure its what I call selective literacy.   So I speak up and let her know that she can't park there or they WILL tow her car, pointing to the sign.  She dead faced looked at me and told me that she wasn't parked there, and ran inside. \n\nNow I knew the guys who were responsible for towing the cars, they worked for the airport and did other things as well. And if they saw her car they WOULD tow it. And since her argument was that she wasn't parked, but she took her keys, I decided not to wait for one of the guys to come around on their own. I called them and let them know the whole story. They were there in two minutes and towed her car before she came out.  \n\n\nI still imagine her going to court to fight it, and trying to explain that she wasn't parked there.... yet she had her keys.  I know it was petty. But I'd do it again in a heartbeat.",
        "created_utc": 1670683886,
        "upvote_ratio": 1.0
    },
    {
        "title": "No watching The Office for you.",
        "author": "fuckcovid19",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/zhud2q/no_watching_the_office_for_you/",
        "text": "So... this might be small, but it felt so good I thought I'd share it. My ex introduced me to The Office, it became our thing to watch one or two episodes before bed almost every night. Now, I know that it was her favorite show before she met me and she referenced it constantly. \n\nWe started doing long distance and broke up due to what I consider cheating (but that's another story) and just disrespect from her part.\n\nNow for the petty revenge:\n\nNetflix has The Office in the country where we met. The Netflix catalogue of the country where she moved does not. \n\nI let her use my Prime Video and she watched it constantly there.\n\nThe day we broke up I knew she'd try to cheer herself up by watching The Office, so I logged in to see if it my account was being used in that country. BINGO.\n\nI immediately changed my password and logged out all devices.\n\nShe hurt me pretty badly so even if it's a small thing, it felt good to deny her that piece of escape.",
        "created_utc": 1670683778,
        "upvote_ratio": 1.0
    },
    {
        "title": "Oh, I'm stupid? I'm in the same grade as you now, asshole.",
        "author": "IamaLuna-tic",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/zhqklt/oh_im_stupid_im_in_the_same_grade_as_you_now/",
        "text": "Me (16F) and my brother (18) argue way too much. We're 16 months apart and all we ever do is argue. \n\nWhen i was in year 6 (grade 5), he decided to piss me off by saying that hes a grade ahead, and he'll graduate before me, and i'll still be in school like the loser I am. He kept calling me a child. (Again, that makes no sense but i remember how angry I was)\n\nLong story short, i worked my ASS off. I studied everyday for hours, I'd ask for extra assignments, i nailed every single fucking exam I got because i was driven by pure spite. \n\nSo, wouldn't you know it, I ended up not going to Year 7, no, i ended up in year 8. I skipped a grade because teachers said I was very smart and advanced for my age and i'd do better if i skipped a year (im not, im just petty). \n\nFirst day of school, I walked in, saw my brother in one of our classes together and I said \"WHOS THE FUCKING LOSER NOW, ASSHOLE!\" and he was confused at first, but i reminded him and then he couldn't stop laughing and high-fived me. \n\nHell, when my parents told him i'd be in the same year as him he was so confused, but didn't say anything and just went to bed. They told him a day before as a surprise. I think he thought it was a joke.\n\nNow, we're both in Year 13 (Grade 12) and we're vibing. He made me do his homework a lot, but at this point i dont fucking care. I'm A GENIUS among my classmates and family.\n\nEveryone in my family just thinks im this genius, but nah. I'm just petty and i do everything out of pure spite. \n\nIt worked out, i got great university offers.",
        "created_utc": 1670672608,
        "upvote_ratio": 1.0
    },
    {
        "title": "Bully me for 10+ years over my appearance? Well now your Fiancee hates you to! 😈",
        "author": "CountryQueenOF",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/zhomtg/bully_me_for_10_years_over_my_appearance_well_now/",
        "text": "I never had it easy growing up. My dad committed suicide when I was 7 and apparently that's a good enough reason to be picked on. I had people telling me everyday that my dad killed himself because he was embarrassed to be my father. Ouch. It just got worse over the years, I was the first to hit puberty in my grade.. and so I was bullied for having breasts, I was bullied for gaining a little weight, I was bullied because I had to bring tampons to school.. I'm sure you get the picture. There was one girl in particular who went as far as to physically beat me up on multiple occasions just over my appearance.. jealousy? Maybe. I somehow survived the teenage years and grew up into a strong, confident young woman.. found the love of my life, settled down and had kids all while she was doing drugs, sleeping around blah blah blah. Until finally, she met her \"soul mate\" ..aka, my ex-boyfriend.. I DID NOT HOLD BACK! I got in contact with him straight away, told him EVERYTHING! I'm surprised he believed me over her to be honest, but he remembered me telling him the absolute HELL I went through at school when we were together and when I told him that she was the main suspect, he immediately broke off his engagement with her, moved out of her house (ended up moving 2 hours away) and hasn't spoken to her since.. now we are great friends and she messages him daily asking for forgiveness.. he just tells her to shove it where the sun doesn't shine. 😉😋🤗",
        "created_utc": 1670666477,
        "upvote_ratio": 1.0
    },
    {
        "title": "Broke all the links in my Excel Worksheet??",
        "author": "abcrseenu",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/zhntzs/broke_all_the_links_in_my_excel_worksheet/",
        "text": "So my senior was a crap and toxic towards me, we needed to handover a project in just 1 day and I sent my all working without linking in excel so he can't figure out how the amount sum up or where they are coming from but i securely send my original working to my Manager saying please review and atat h it to the platform. Turned my phone off for two days ( sat and sun) he was so furious and devastated. I met him the other Monday and he shouted and I simply said sorry maybe the file is corrupted i sent another one to the manager and it's all correct and attached fo platform Don't worry. He said u ruined my entire weekend man u could have at least told me, u have sent another copy to the manager. That's what I want, to ruin your weekend bruh.",
        "created_utc": 1670663858,
        "upvote_ratio": 1.0
    },
    {
        "title": "Pay Per View",
        "author": "Training_Ad_7585",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/zhnqgb/pay_per_view/",
        "text": "[removed]",
        "created_utc": 1670663507,
        "upvote_ratio": 1.0
    },
    {
        "title": "Has someone left you without saying a word? A goodbye was not doubtful at that time... I'm left with nothing, just memories",
        "author": "Kavi-Matt",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/zhkui4/has_someone_left_you_without_saying_a_word_a/",
        "text": "",
        "created_utc": 1670652990,
        "upvote_ratio": 1.0
    },
    {
        "title": "Petty revenge from a 11f and I couldn’t punish her for it.",
        "author": "Jaderian",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/zhicr1/petty_revenge_from_a_11f_and_i_couldnt_punish_her/",
        "text": "[removed]",
        "created_utc": 1670645067,
        "upvote_ratio": 1.0
    },
    {
        "title": "KFC",
        "author": "CalligrapherIcy7408",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/zhh7rk/kfc/",
        "text": "[removed]",
        "created_utc": 1670641683,
        "upvote_ratio": 1.0
    },
    {
        "title": "Short Sibling Revenge",
        "author": "NewtonEudora",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/zhezns/short_sibling_revenge/",
        "text": "Just read another post about someone taking revenge on a short ex and remembered this from a few years ago\n\nStraight out of high school i went to be a full time nanny for my sister as she had 3 (now 4) kids and wanted to go back to school. At the time, their parenting style was very lax, except theyd ask me to enforce rules on the kids that they (the parents) wouldnt. This led to a lot of fighting with the kids (until i gave up)\n\nOne particular fight was about my oldest niece. She was old enough where her pacifiers had begun to hurt her teeth so her parents told me “no pacifiers” EXCEPT they never followed the rule. The moment she started screaming (yes, screaming) she would get what she wanted. \n\nThe thing is, im the tallest of my siblings, even my (then) BIL, so i just started hiding them at the top of the closet everyone used, where they couldnt see them on a shelf. Theyd buy more and up they go. Eventually they refused to keep buying them and had to put up with my niece screaming at them (much like myself on a daily)\n\nMy sister ended up getting a divorce before a year was up and while moving we found all the pacifiers i had hidden. She thought they had done so well with weening my niece off of them! Nope she was just too short to enable her daughter anymore lmao",
        "created_utc": 1670635445,
        "upvote_ratio": 1.0
    },
    {
        "title": "Walk by farting",
        "author": "gonzo-is-sexy",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/zhelcp/walk_by_farting/",
        "text": "I (F49) am not a confrontational person and tend to get along with most people. But there’s always that one person you just can’t get along with. Her name was Jasmine and she liked to remind that she just didn’t like me.  I was too quiet, I was chubby and should eat better and more demoralizing comments. I tried. I once found a four leaf clover and offered it to her. She freaked out in the middle of our office area and said she was afraid of plants. I’m not kidding. That was it for me.\n\nI have a very sensitive stomach and certain foods will cause me to have the most vile, noxious, soul destroying gas. I sat two desk’s behind Jasmine and would have to walk past her constantly. For a full week I ate those foods. For a full week I would crop dust that smug twat. There were some innocent casualties but I didn’t let that deter me. I continued the bombing. The pain and insufferable smell was worth it. I swear a green mist surrounded us.\n\nShe never said anything to me which was really surprising. We never became friends and she would still make snide comments but I was happy she smelled my farts.",
        "created_utc": 1670634347,
        "upvote_ratio": 1.0
    },
    {
        "title": "Anyone need SEO services?",
        "author": "zackanwood",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/zheiog/anyone_need_seo_services/",
        "text": "[removed]",
        "created_utc": 1670634140,
        "upvote_ratio": 1.0
    },
    {
        "title": "I hope I can sell my JustNoGrandma’s jewelry lol",
        "author": "Vibes-room",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/zhe5ng/i_hope_i_can_sell_my_justnograndmas_jewelry_lol/",
        "text": "\nMy grandma (narcissistic)gave me a ring she promised to my sister a month ago. There’s a bigger story to it but the way everything unfolded me and my mom  realized she was trying to cause another rift between me and my sister lol so now we are getting the jewelry she gave me (2 rings and a pair of earrings)  appraised lol fuck that woman and the kids she had lol I hope it’s actually worth something so I can sell it and use the money to pay off my debts, I’ll update y’all more tonight on how much they were worth and if I sold them. \nJNA= Just no aunt \nJNG= Just no grandma \nJYSM= Just yes stepmom\n\n*So basically the story is simple. My grandma and grandpa are narcs, ones worst than the other lol. Because my dad was the scapegoat child we became the scapegoat grandkids. And my brother moved away, I (22NB) live with my stepmom and my older sister lives with my JNA and JNG and cousin lol so poor sister has had a epiphany after I talked to her and has realized how bad JNG is. \n\nSo JNG has seen that me and my sister has gotten closer and she stopped talking to JNG. Which angered her more, so she hatched a devious plot, that me and my mom couldn’t believe because it was just like a hallmark movie lmao. Basically, Sunday, she went to the Kingdom Hall with me and JYSM. During service, she took off her ring and gave it to me( which was weird because she’s given me necklace and earrings, but only 1 ring in my entire life) so I thought it was weird and asked her why when I took her to the car after service. \n\nShe literally told on herself( thinking she’s smarter than me and I won’t realize) she told me that and I quote” She doesn’t give me anything, and apparently I deserve things, she gives others 1000$ dollar rings and SOMEONE always wants her rings but she doesn’t give me enough”  and my first thought was” did she want to give my sister the ring but decided not to?” \n\nSo later on that night I told my mom she gave me the ring, she laughed at the fact that she said it was 1000 dollars lol and I then said to my mom “ I think she wanted to give the ring to my sister” and my mom laughed and agreed. On Wednesday morning, my sister spent the night on Tuesday, and I got ready, something told me to show her the ring, so I walked up to her and showed her and the face she made told me everything.\n\nA month ago, my JNG brought out all her rings and went through them with her and sister fell in love with the ring. JNG promised to give her the ring, told her to wait a little because she wanted to wear it around a bit until she buys a ring that looks similar. Then as you read above, enacted a vile plan to make sister mad at me and her, but because sister was living with her, she thought she would argue with her, then sister would forgive her ( cause she would lie to her) but not forgive me. \n\nWhich is stupid but if it was years before could’ve worked. So when I told my JYSM everything, she suggested selling the tainted ring, because not only was it not meant for me, (JNG)she lied to my face about wanting to give me things because she cares about me, tried to use me as a pawn to get back at my sister because she’s mad at her( she believes that if she’s mad at someone, no one should talk to them and everyone should be mad at the person she’s mad at) and tried to pit us against each other.",
        "created_utc": 1670633153,
        "upvote_ratio": 1.0
    },
    {
        "title": "Found Social &amp; ID",
        "author": "Head-Government7412",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/zhdpoq/found_social_id/",
        "text": "[removed]",
        "created_utc": 1670631939,
        "upvote_ratio": 1.0
    },
    {
        "title": "How can I get petty revenge on ex boyfriend and Prostitute he cheated on me with?",
        "author": "Mariakrc",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/zhdmoy/how_can_i_get_petty_revenge_on_ex_boyfriend_and/",
        "text": "[removed]",
        "created_utc": 1670631719,
        "upvote_ratio": 1.0
    },
    {
        "title": "Ball is in my court",
        "author": "RAWisROLLIE",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/zhd46x/ball_is_in_my_court/",
        "text": "About 15 years ago, I was working in what had once been an awesome job. Unfortunately my boss's wife left him and he began to neglect the small, lucrative subcontracting company he had built in favor of drunken escapades and constant hangovers. He became increasingly more difficult to get on the phone, started forgetting to give us our job assignments, and then the biggest crime--not paying us on time. \n\nOne Saturday morning, I made the 50 mile drive to one of his offices only to find that the envelope with several weeks of back pay was not under his computer keyboard as promised, and he was not answering his phone. I did what any disgruntled 20-something would do--I took the ball out of his wired mouse and threw it into the woods as hard as I possibly could.\n\n(And we all soon quit to work directly for one of the companies he had been subcontracting us out to.)",
        "created_utc": 1670630411,
        "upvote_ratio": 1.0
    },
    {
        "title": "Nepotism and petty revenge",
        "author": "MeetGood2158",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/zhcyab/nepotism_and_petty_revenge/",
        "text": "[removed]",
        "created_utc": 1670630008,
        "upvote_ratio": 1.0
    },
    {
        "title": "Misogynistic date wouldn't shut up about crypto, so I minted his text as an NFT.",
        "author": "Medical-Pizza9745",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/zhcvks/misogynistic_date_wouldnt_shut_up_about_crypto_so/",
        "text": "[removed]",
        "created_utc": 1670629819,
        "upvote_ratio": 1.0
    },
    {
        "title": "you want to lie about me on social media? enjoy losing everything",
        "author": "Used-Walk-4970",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/zhccdn/you_want_to_lie_about_me_on_social_media_enjoy/",
        "text": "[removed]",
        "created_utc": 1670628528,
        "upvote_ratio": 1.0
    },
    {
        "title": "okay this is gonna be frowned upon im sure bc of her scenario.",
        "author": "witchwmommyissues",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/zhbhlc/okay_this_is_gonna_be_frowned_upon_im_sure_bc_of/",
        "text": "[removed]",
        "created_utc": 1670626549,
        "upvote_ratio": 1.0
    },
    {
        "title": "About to super glue my neighbors door..",
        "author": "ChunkyLover10",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/zhben5/about_to_super_glue_my_neighbors_door/",
        "text": "[removed]",
        "created_utc": 1670626362,
        "upvote_ratio": 1.0
    },
    {
        "title": "Hid my short ex’s vape and coffee on top of the fridge",
        "author": "hemlockpopsicles",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/zh9xyt/hid_my_short_exs_vape_and_coffee_on_top_of_the/",
        "text": "My (38f) ex (40m) was a high functioning alcoholic and couldn’t get out of bed without a LOT of coffee and nicotine. After months of suspicion, I finally used his thumb to open his phone while he was passed out. I discovered he was still very involved with his ex gf, who broke into his house and tried to assault me early in our relationship (I was pretty scrappy in my younger years so she fucked around and found out. That was also a glorious moment, but I digress)  \n\nI hid his coffee, vapes, and cigarettes on top of his fridge, which was actually in plain sight for someone who isn’t the size of a garden gnome. That little man ran around his house like an angry elf for 30 min until he had the wherewithal to just take his ass a couple blocks away to buy more. Each second of his panic was so satisfying to watch. When he finally left for the store I packed my things and bounced for good.\n\nEdit: no, he was not a little person medically, he was 5’4”.",
        "created_utc": 1670622928,
        "upvote_ratio": 1.0
    },
    {
        "title": "Made a huge take out order at a restaurant I used to work at, obviously never picked up",
        "author": "Ocelot_Fluid",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/zh9nju/made_a_huge_take_out_order_at_a_restaurant_i_used/",
        "text": "I used to work at a restaurant when I was 18.\n\nOwner there was the biggest jerk ever, he said some things that really scarred me.\n\nEmotional abusive, passive aggressive, personal attacks and insults. He's just someone I would call a fucking asshole, fuck him. I told my friends some of the things he said and they flipped. Even looking back as a woman in her mid 20's, I can definitely say that he's a bunghole.\n\nMy petty revenge: \n\nUsing a fake #, a fake voice with an accent and making a huge order worth of $100 + and never picked up. And I did it more than once\n\n&amp;#x200B;\n\nThoughts? Brutal honesty welcome =)",
        "created_utc": 1670622204,
        "upvote_ratio": 1.0
    },
    {
        "title": "the house accident",
        "author": "CassElliot_",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/zh9dz6/the_house_accident/",
        "text": "So, I'm a 20 year old female and had moved out of my apartment into a house, I had a roommate at my new house named Walter (not real name), but he was a gamer, he played games 24/7. This is where it starts, as I was working and him sitting on his butt all day, he had gotten into my old minecraft save file, I had been making that world for 3 YEARS (it could take a day to actually tour the whole place) but it was a village, and a realistic castle, dragons in the sky, realistic bridges, and pixel art, it took years to make this because I worked. But, after he gotten into that file, he had DELETED THE FILE! The world was gone, not even I could access it, but when I got home, I had decided to work on the world, and I come to find that it is gone. I WAS PISSED. I had confronted him, he didn't care, he said \"oops\" and started playing games again. This is were the revenge starts. When he went to the store, I had decided to wipe all his data from all his games, factory reset his computer, and then putting his coffee mug at the very edge so it breaks when the cabinet opens, I then decided to get creative and set tacks on the driveway for him to run over. It. Was. PERFECT. When he got home, he complained how his tire was flat, I said \"oh well\" and went to lay down, when he got on his computer, I could hear him scream bloody murder, he ran to me saying \"WHAT DID YOU DO?!\", and i said \"oops\" and rolled over. In the morning, I woke him up,  I made my coffee in a glass cup, because he wouldn't suspect I did it, and the mug would break if I did it. When I  sat down, I heard it, the sweet sound of the mug breaking, he then screams at me more, saying \"THAT WAS MY FAVORITE MUG\" and \"THERE WAS ONLY 1000 OF THOSE MUGS MADE\". I was so happy, I laughed in his face, I will never forget how he looked like anger from inside out.",
        "created_utc": 1670621541,
        "upvote_ratio": 1.0
    },
    {
        "title": "need ideas for petty revenge",
        "author": "user1424771",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/zh9d7x/need_ideas_for_petty_revenge/",
        "text": "[removed]",
        "created_utc": 1670621492,
        "upvote_ratio": 1.0
    },
    {
        "title": "She gr00med me, I made her waste her money.",
        "author": "Only_Razzmatazz_4960",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/zh99bk/she_gr00med_me_i_made_her_waste_her_money/",
        "text": "[removed]",
        "created_utc": 1670621242,
        "upvote_ratio": 1.0
    },
    {
        "title": "You want to use my mug? Okaaaaaaaay! Mwahahahaha",
        "author": "shmartyparty",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/zh8gvb/you_want_to_use_my_mug_okaaaaaaaay_mwahahahaha/",
        "text": "Someone at my work kept using my mug for......I have no clue what for. All I know is I would come in every morning and find my mug in the dish strainer by the sink in the kitchen wet and obviously used. There are only a few people who arrive before me and I had a sneaking suspicion as to who it was...someone that I don't particularly like and would not want using my mug for any reason. \n\nSo I started making mixed hot drinks like cappuccino or hot chocolate that would leave a nice film of gooey stuff on the inside of the mug. At the end of the day I would sit the mug upside down in the dish strainer without washing it. \n\nEveryday I would come in to find the mug upside down and wet and would giggle to myself and say \"Hope you like my cooties and sludge Mr. So and So!\". \n\nOne time I got sick with some viral something or other. When I came back after a few days I found out that Mr. So and So was off sick with the same thing! HA!\n\nEventually work got rid of Mr. So and So and I no longer find my mug wet so I was right about the suspected perpetrator. \n\nNot the most drastic petty revenge but it was a huge WIN for me! ",
        "created_utc": 1670619347,
        "upvote_ratio": 1.0
    },
    {
        "title": "Quitting on a bad boss on a very inconvenient time",
        "author": "KatarinaRen",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/zh89m6/quitting_on_a_bad_boss_on_a_very_inconvenient_time/",
        "text": "",
        "created_utc": 1670618836,
        "upvote_ratio": 1.0
    },
    {
        "title": "Punch me up for fun? Having fun tasting rabbit poop!",
        "author": "Ok-Garlic4162",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/zh5mv9/punch_me_up_for_fun_having_fun_tasting_rabbit_poop/",
        "text": "[removed]",
        "created_utc": 1670612585,
        "upvote_ratio": 1.0
    },
    {
        "title": "I hid all the power cords and Hdmi cables.",
        "author": "Ok_Comparison_4487",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/zh4lbr/i_hid_all_the_power_cords_and_hdmi_cables/",
        "text": "So it's major petty I know, that's why I'm here lol. My boyfriend \"wanted\" to game with me last night so naturally I'm pumped cuz dude doesn't play with me often anymore. So he goes downstairs to set stuff up and I shower quick and I go downstairs and he's passed out. Like full on snoring loudly passed out.\n\nI try to wake him up and he says he just wants to nap quick and he'll play, okay that's fine. An hour goes by and I try to wake him again, just a little bit longer he says. I give him another hour, he's lucky I'm having fun getting soft lobbies so I can practice with the marksman rifles. Well I try to wake him up one more time and nows he's cranky with me for waking him up.\n\nSo what started as a nap at 7:30pm ended up with him just sleeping for the rest of the night and my butthurt ass playing MW2 by myself, honestly played better anyways, probs cuz I was mad lol. \n\nWell fast forward to today, he's at work right now for another hour and I work in 20 minutes for the next 8 hours and I just hid all the power cords and Hdmi cables in the house 🙂 you won't game with me, you're not gaming with your buddies either 🙂",
        "created_utc": 1670610124,
        "upvote_ratio": 1.0
    },
    {
        "title": "She gr00med me, I made her waste her money.",
        "author": "Only_Razzmatazz_4960",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/zh3qin/she_gr00med_me_i_made_her_waste_her_money/",
        "text": "[removed]",
        "created_utc": 1670608231,
        "upvote_ratio": 1.0
    },
    {
        "title": "Unintentioned Babysitter",
        "author": "KryptonianEarth",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/zh1krp/unintentioned_babysitter/",
        "text": "Not me, my buddy Eric's story.\n\nTwenty years ago, Eric was working at a mini-store. Three children were hanging in front of the store's main doors. He walked outside to ask said children not to block the front doors. They moved upon being asked, however, one who rode a bike parked himself back in front of the doors. Once more, Eric asked him to move, he did so, a few minutes later, the kid is back in front of the doors.\n\nOnce more, Eric went to the kid and ordered \"You, home, NOW.\" The kid asked \"Why\". Eric responded \"This is the third time I've asked you not to block my door.\" He returned home and shortly after came back with his father. The father asked Eric \"Why does my son always have problems at this store?\"\n\nEric responded \"I don't have time to babysit your son. I have a job to do, he kept parking his bike in front of my doors, he did it three times and I told him the third time to leave. I cannot have him blocking my doors.\" \n\nThe look the father gave his son, told Eric, the son gave a COMPLETELY DIFFERENT STORY. Eric knew he did NOT want to be that kid at home.",
        "created_utc": 1670603109,
        "upvote_ratio": 1.0
    },
    {
        "title": "Seriously, Don't piss Off The Sound Guy",
        "author": "coresect23",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/zh1eay/seriously_dont_piss_off_the_sound_guy/",
        "text": "A recent similar post reminded me of this one at a club in Rome, Italy where I organised nights back in the 90s. The venue had a competent but rather short-tempered sound guy who was not always the easiest to work with, but if you were respectful he'd go the full nine yards and beyond to get the concert sounding good.\n\nOf course one day a local solo act turned up late to soundcheck and then proceeded to make life exceedingly difficult because of a rather large ego problem. I could see the sound guy fuming but just accepting it all. Come showtime the lights went down, the guy took to the stage grabbed his mic and started yelling into it, and sound guy casually turned off the PA and went to the bar. The primadonna did his whole gig on the stage monitors alone. It sounded awful out front, you could hear the guys bootsteps as he stomped back and forth. He could hear the monitors so he thought it was all OK. All his songs ran one into the other without any silent gaps and nobody in the public had the nerve to tell him something was wrong until he'd finished. At which point he stormed out to the bar and headbutted the sound guy. \n\nSound guy said it was totally worth it.",
        "created_utc": 1670602670,
        "upvote_ratio": 1.0
    },
    {
        "title": "So very wet and gross",
        "author": "Magikal_bacun",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/zh18kl/so_very_wet_and_gross/",
        "text": "The war began when we were young bunkmates… my sister and I were constantly engaging in mutually assured destruction with her bunk being on the top.\n\nOne evening, after having sugar being limited to us by a certain time of evening every night for months, my sister grew tired of our parents tyranny… so she somehow snuck entire damn handfulls of granulated sugar into her bunkbed so she could feast in the moonlight or some crackhead hours shit like that\n\nIn my slumber, anti sleep powder in the form of sugar speckles filling my eyelids brought me to life… Evanescence style. In confused frustration I quickly deduced my sisters stupidity… silly girl. I am a snitch and in this war I will show you no mercy!!!!\n\n I immediately stormed across the house and *woke up my parents* They were already mad about being distributed from sleep let alone that I was out of bed being a snitchy little bitch. Thankfully my sisters deviance was so audacious and to my parents disbelief that I didn’t even get lectured about being a tattle. The soon to be discovered mound of semi crystallized sugar, glistening in saliva might have somehow been a partial blessing to me that night regardless of the sugar snowstorm that assaulted my eyes.\n\nAnyways she got FLAMED. Absolutely grounded. for a hot sec and she was so tilted because i could waych monster high and play roblox but she couldn’t🤪",
        "created_utc": 1670602278,
        "upvote_ratio": 1.0
    },
    {
        "title": "Was I being petty",
        "author": "PossibilityStrict176",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/zh0fey/was_i_being_petty/",
        "text": "[removed]",
        "created_utc": 1670600299,
        "upvote_ratio": 1.0
    },
    {
        "title": "Am i the drama?",
        "author": "Character-Heart126",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/zgykhk/am_i_the_drama/",
        "text": "[removed]",
        "created_utc": 1670595651,
        "upvote_ratio": 1.0
    },
    {
        "title": "Cat towed before funeral",
        "author": "monicarperkins",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/zgx24n/cat_towed_before_funeral/",
        "text": "[removed]",
        "created_utc": 1670591666,
        "upvote_ratio": 1.0
    },
    {
        "title": "I exposed the fight between my ex bestie and me to our common friends",
        "author": "Dear-Awareness6093",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/zgsmjk/i_exposed_the_fight_between_my_ex_bestie_and_me/",
        "text": "Okay so a little bit of back story here. \nI (17F) was best friends with a girl (18F).\n\nWe were inseparable for over a year and a half. \nI first started getting annoyed with her when she used to talk to totally random people from other schools etc on Instagram just by looking at their profile picture and having a minimum of 1 mutual. She used to talk for hours with these completely random people, and often chose them over me. \n\nOfcourse, that used to annoy me but I never voiced it, because I know that i have a tendency to be clingy and should keep it to myself. I let it go. Then she started calling some random friends of her cousins to our plans of watching movies etc. I let that slide too. \n\nOne day, she messages me out of the blue, filled with cuss words saying I do not support her. She got that from a common friend of ours who i vent about this to. She said that i just seek attention and am lonely. She called me all sorts of things like a wannabe and how i try being her but fail at that. I responded with a thumbs up emoji for a while, but she didn't stop and i started to lose it as well then. \n\nThis is the part where i messed up. She was incompetent, i mean never scored well in anything, she didn't try. I sarcastically implied that. And that's when she said wow and please never talk to me again. \nI was super upset about what I said and regretted it instantly. I called her up to apologise, but she ended up yelling, cursing and insulting me so I told her off and blocked her. I cried a lot after. What pissed me off more was that she had 0 remorse. She laughed a lot about it to one of our common friends.\n\nTo take revenge i told all our common friends (3-4 people) what she did and sent screenshots to everyone. \nShe then messaged me on instagram saying how dare you. I blocked her there and sent those screenshots to everyone as well with a little bit of manipulation (deleting some of my mean texts). I miss her, but she wasn't a very good person and this whole thing was toxic.",
        "created_utc": 1670578713,
        "upvote_ratio": 1.0
    },
    {
        "title": "my plug caught feelings and stopped serving me",
        "author": "03332213332210",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/zgqm9h/my_plug_caught_feelings_and_stopped_serving_me/",
        "text": "[removed]",
        "created_utc": 1670572183,
        "upvote_ratio": 1.0
    },
    {
        "title": "Confused my ex best friend",
        "author": "Ordinary-Orange-5952",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/zgqgvw/confused_my_ex_best_friend/",
        "text": "[removed]",
        "created_utc": 1670571709,
        "upvote_ratio": 1.0
    },
    {
        "title": "Used SMS bomber against a scammer",
        "author": "trinadh_crazy",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/zgqcgg/used_sms_bomber_against_a_scammer/",
        "text": "So recently my colleague/friend got scammed by a scanner through Quikr, it's a website where u can sell/buy used/refurbished items, \n\nScammer posted best quality pics of a laptop at very low price my friend got tempted and contacted the scammer and got scammed of Rs 14,000/- INR, he is still trying to get more money as of today, and I tried to mediate between them as my friend is not so fluent in hindi which the scammer was talking in, but scammer started verbally abusing me as I was questioning everything he said and started to abuse my family and I wasn't gonna let anyone abuse my family so I took the mobile numbers he was using as he was in India we can use a script to send spam OTP messages to his mobile numbers( I can also attach the github repository link if any of you are interested) and so I did exactly that and has sent nearly 10000 messages to his numbers, so now he mobile will keep on receiving messages one after the other till the count reaches 10000 and if each message takes at least 5 seconds to get delivered it will take 50,000 seconds to complete that is around 13 hours of non stop messages,   \n\n\nI know this is not as big of a revenge but after I started doing this he called my friend asked us to stop the messages, my friend just didn't know it was me so he just said we have no idea about those messages and I am a bit happy, we are also planning to report him.  \n\n\nTL DR: scammer abused my family so I bombed his mobile numbers with 10000 messages each which will keep on buzzing his mobile   \n\n\nIf u guys are interested in detailed explanation check out my posts [part 1](https://www.reddit.com/r/indianscammers/comments/z9jhmg/online_electronics_sale_scam/?utm_source=share&amp;utm_medium=web2x&amp;context=3) and [part 2](https://www.reddit.com/r/indianscammers/comments/zgpgzv/update_online_electronics_sale_scam_part_2/?utm_source=share&amp;utm_medium=web2x&amp;context=3) in r/indianscammers subreddit.",
        "created_utc": 1670571330,
        "upvote_ratio": 1.0
    },
    {
        "title": "The sounds next door",
        "author": "Equivalent_Key_1841",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/zglc5b/the_sounds_next_door/",
        "text": "[removed]",
        "created_utc": 1670555948,
        "upvote_ratio": 1.0
    },
    {
        "title": "Throw A Party When Being Delibritaly Told Not To? Get Banned On Airbnb!",
        "author": "LifeVisit8496",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/zgi4s8/throw_a_party_when_being_delibritaly_told_not_to/",
        "text": "[removed]",
        "created_utc": 1670547610,
        "upvote_ratio": 1.0
    },
    {
        "title": "Car Staring Contest",
        "author": "Zoreb1",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/zghxte/car_staring_contest/",
        "text": "I had to take my mom to the medical complex for a postop surgery checkup (she came out fine).  I enter the parking garage and it is a bit busy.  No empty spots (except for a couple of buttholes taking up to spots) until the 4th floor.  A women enters her her which is in a handicap spot by the elevator (my mom has a placard).  So I pull up near her and wait.  And wait.  And wait.  For at least 5 minutes.  She saw I had my turn signal was on for her spot and wasn't on her phone but her rear lights were on, so she had started her car.  My mom said she is probably one of those people who won't leave if they think someone wants their spot.  (I didn't honk my horn and wasn't close enough to impact her leaving.)  So my mom gets out of my car to go to her doctors office (in a connecting building with me following eventually when I get the spot).  Once the woman saw my mom had started leaving and I would stay there she backed out and left.  It is hard to out wait a retired civil servant.  She finished her appointment and my mom's would seen be starting.  Unless an attendant requested that I move I could have sat the until my mom returned.",
        "created_utc": 1670547141,
        "upvote_ratio": 1.0
    },
    {
        "title": "Spain lost to Morocco",
        "author": "green-things",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/zgh14b/spain_lost_to_morocco/",
        "text": "[removed]",
        "created_utc": 1670545025,
        "upvote_ratio": 1.0
    },
    {
        "title": "Petty revenge backfired",
        "author": "PlastiCs_one",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/zgdyek/petty_revenge_backfired/",
        "text": "[removed]",
        "created_utc": 1670538436,
        "upvote_ratio": 1.0
    },
    {
        "title": "give my position to someone else? I'll shut down the unit.",
        "author": "Automatic-Ad9358",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/zgab5c/give_my_position_to_someone_else_ill_shut_down/",
        "text": "So, a little backstop here. I (25m) was in a national guard artillery unit. My MOS (job) was a 13J. What that job entails is receiving a fire mission, target position, and using our own data then making the calculations for cannon adjustments, then sending it down to the gun line for them to load the cannons, make the adjustments and fire. You can't fire cannons without the fire mission being processed by the FDC (Fire direction control) section first. And that's on the battery (company) level. I was the headquarters FDC chief, meaning I delegated those fire missions to the battery FDCS. Now, let's get on with the show\n\n I was in HQ, as a sergeant (E-5) holding the position of chief and junior NCO. The chief is supposed to be an E-6, but we didn't have one. The slot was open. The idea was that I would step into that role now,and the promotion would come later. No problem, mission first. It was a difficult task because, as a chief, you oversee the section as a whole. Go to meeting, attend briefings, and pass information up and down the chain. As a junior NCO, your job is much more hands-on. You're supposed to work directly with your soldiers, train and teach as you work, handle individual soldier training, counseling, performance reviews, etc. Well, I had to do both. I was sitting in the only E-5 slot for my section, so they couldn't promote anyone else. I had to be \"in the weeds and out of the weeds\" at the same time. Meanwhile, I get yelled at for petty mistakes I make by my 1SG because I'm spread so thin. \n \nThat being said, every drill I was literally running ragged. Constantly moving from place to place. Fire mission came down, processed and delegated, gotta run to a battalion briefing, and give a report to the Lt. Colonel for our last 24, next 24 and 48, and then get back asap. The only relief I had was the E-7 (call him SFC P) his responsibility was all FDCs and coordinated between  all the sections. But he was on a state active mission and often was needed there and didn't attend unit missions unless absolutely necessary.  \n\n I get a call from my admin telling me that if I completely DLC2 (a mandatory online course), I can be put in for promotion the next day. Finally, now I can finally have the rank I work for, and that will free up the E5 slot. We can promote one of my soldiers and finally have 2 NCOs for the section. This is great. My work is divided in half, and the soldiers finally have someone who had the time to train them to standard. Win-win. I completed the course, turned in the certificate, and do my packet for leadership school. This should be great, right? Nope.\n\n I get a call from a battery FDC chief ( let's call him SSG R.)\nMe \"hey SSG R, what's going on?\"\nSSG R \"is it true they're transferring me to headquarters?\"\nMe: \"Probably not. I was just selected for school, I'll be getting promoted to E-6 soon. There won't be a slot for another E-6\"\nSSG R \"maybe talk to SFC P and get back to me.\" \n\nThat was strange, so I met up with SFC P and asked him. Turns out, he and the 1SG intend to promote me, then swap me out with SSG R. Finally, I'm getting the squad back to a place where it should be and transferring me out as soon as it's finally easy. Well, fuck your plan. I head down to the admin office and demand reclass. They ask about my promotion and I tell them to cancel. I get the number to battalion career counselor. Tell them I want to go 91E (welder and machinist) after a month of back and forth they find a E-5 slot at a unit 10 minutes from my house. Cool, ill take it. But what happens to the unit if I leave? Well... \n\n Headquarters no longer has a chief. Or Junior NCO. no fire missions can be processed unit wide. Which means the entire artillery unit can't shoot cannons. SFC P has to come off orders every time the unit drills and loses money. He now has to act as the FDC NCOIC, the chief and the junior NCO. given this, the soldiers fell to the wayside and out of a squad of 10 4 don't re-enlist and 2 transfer away to other units. The unit scrambles to grav soldiers from the battery level FDC sections to replace the missing headquarters staff. SSG R is transfered within a couple months to help mitigate the short staff. Unit misses a BCT firemission in the feild because they're to slow due to being short staffed. And the LT. Colonel is not happy. Unit calls me back to see if I won't consider transferring back. It's not happening. Talks of dissolving the unit entirely due to a long history of stuff like this happening. Unit has to spring their budget for Australia rotation for the next AT to secure the budget for another year. \n\n I'm now a welder in a comfy unit. I don't sleep outside, I don't get yelled at I'm unofficially the weapons training NCO for the unit due to my previous combat unit experience and I learned skills I can use in the civilian world should I ever need a trade job. Life is good. Still an E-5 but at least my workload matches my rank.",
        "created_utc": 1670530846,
        "upvote_ratio": 1.0
    },
    {
        "title": "Never Piss Off the Sound Guy",
        "author": "RichCorinthian",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/zg9m8o/never_piss_off_the_sound_guy/",
        "text": "I've been playing in bands off and on for about 35 years, and this happened roughly back in 2000.\n\nWe were playing as an opening act at a popular club in Dallas that frequently hosted mid-level touring acts as headliners. These would be bands that were having national radio success but hadn't yet broken to the level where they were playing huge halls and arenas. Sometimes the bands would bring their own opening acts, but more commonly the club would enlist local acts that were a good fit with the musical style of the touring band.\n\nBands arrive early, usually several hours early, to set up and soundcheck at a time when the crowd is minimal or nonexistent. I won't name the band in question, but if you are above a certain age you have probably heard of them. They set up their gear at the very back of the stage, where it will remain during the opening acts, and do their soundcheck.\n\nThe singer VERY quickly demonstrates that he is a total prima donna, with demands about moving the furniture, having food catered, getting lights moved...you name it, this guy wants it. Most musicians are familiar with LSD (Lead Singer's Disease) and this guy could be the poster child, making demands that far outstripped the venue and the band's popularity level.\n\nThe worst target of his wrath is the poor sound guy, who is responsible for making sure that the band sounds good through \"the mains,\" which are the speakers pointed at the crowd, but also through \"the monitors,\" which are wedge-shaped speakers pointing backwards at band members so they can hear themselves above the mains. Singers have a lot of trouble hearing themselves while singing over a rock band, so the singer's monitor mix will usually just be his/her own vocals and maybe the backing vocals. Because of the way the monitor is angled, virtually nobody out front can hear what's going on in the monitors. **This is important.**\n\nDuring soundcheck, the crowd absent, the singer is tearing the sound guy a new one. This sound guy is a fixture in the local Dallas scene and he knows what he's doing, but \"everything sounds like shit up here no matter what you do\" and \"if you can't do this right, you need to go find somebody who can.\" He takes it on the chin and does his best to appease Mr. LSD.\n\nThen comes showtime. We play our set without any trouble and can hear ourselves just fine in the monitors. But then the headliners come on, and the singer is still visibly pissed and after the first song calls out the sound guy, which **you just don't do.**\n\nAs their set proceeds, something strange happens. Mid-song, the singer goes flat. **Noticeably** flat. Like, he sounds bad, and his pitch is wavering all over the place, and he's looking around in a panic. After about 10 seconds, everything is fine again. Next song, same thing happens...he gets to the big chorus, his pitch goes wild, and he's looking to his bandmates. They look concerned too. Then everything fixes itself.\n\nI'm still hanging around because that's good etiquette, and I notice that the sound guy has a big-ass smile on his face every time this happens. He's tweaking faders on his mixing boards, but that's not unusual, that's what he's there for. But I've got to figure out what's so goddamn funny.\n\nI go over to the sound booth and yell in his ear \"WHAT'S SO FUNNY?!?\" (because it's a loud club) in his ear and he points to a piece of rack-mounted gear and shout-explains.\n\nAuto-tune was in its infancy at this point because auto-tune is ridiculously complex; auto-tune has to analyze pitch in a micro-second and adjust it to fit a key or scale. So we didn't have auto-tune in clubs, but what we DID have was pitch shifting, which is nothing but brute-force pitch manipulation.\n\nHe was periodically...ever so briefly...running the singer's monitor mix through a pitch shifter set to be exactly a half-step sharp. Go play a white key on a piano and simultaneously play the black key next to it to hear how unpleasant this interval is. The singer is hearing himself as sharp, so he goes lower to counter-act it, and the overall effect through the mains is genuinely terrible.\n\nNever piss off the sound guy.",
        "created_utc": 1670529435,
        "upvote_ratio": 1.0
    },
    {
        "title": "I tipped my exfriend and bully as petty revenge",
        "author": "FlashyCow1",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/zg6h2s/i_tipped_my_exfriend_and_bully_as_petty_revenge/",
        "text": "To start this girl and I were best friends the first half of high-school. However, something changed in her. She became depressed and suicidal because she was being severely bullied online. I reported what she told me to both the school counselors and her parents, and I told her that I told them. She decided I betrayed her and suddenly became a bully towards me. Ironically she became \"friends\" with the girls who bullied us both right after. She later found out they were the online bullies too.\n\nMy first job was front end at a restaurant and she knew when and where I worked. So she made it a point to show up at my work where I really couldn't do much. I had to serve her and her new \"friends.\" She saw me coming and said to not expect a tip because \"Service industry workers are servants who don't need to be paid.\" That stuck with me for years. I told my manager that I refuse to serve her or them ever again. Manager was fine with it at that point as I had made comments before. From that day on I never spoke to my ex friend for years.\n\nRecently I went to my hometown in a local restaurant. Low and behold my waiter is my ex-friend. Again, I haven't spoken to her at all since that day she basically said I was her servant. I decided to get petty revenge by Killing her with kindness. I was polite, but never acknowledged that I knew her. She kept saying she swears she recognizes me from somewhere. I kept brushing the question off. Then came the bill. When the receipt for the tip came, I put a note on it that said \"first and (former) last name, do you still think Service industry workers are servants who don't need to be paid?\" with a 100% tip on a $40-ish meal. As I walked out I saw her face as she read the note. She turned very very red. I think my kind petty revenge got to her.",
        "created_utc": 1670522938,
        "upvote_ratio": 1.0
    },
    {
        "title": "Neighbor feud in the ultimate petty revenge story. TL/DR",
        "author": "Jaderian",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/zg5oz8/neighbor_feud_in_the_ultimate_petty_revenge_story/",
        "text": "All names have been changed to funny ones. \n\nSo I used to live in a town that operated a lot like the way HOAs operate. When we moved in we got a package from the local town it included (not joking) a rule book. I kept this book just for laughs. The first rule is: the town may enforce any rule and all rules in order to keep the piece and quiet of this town. So basically as long as you weren’t nothing others you didn’t have to worry. We liked the neighborhood because it was quiet and no one bothered you ever. \n\nSome time after moving in we got a new neighbor, let’s call him jack. He rented the property but was expected to maintain it during his time living there. He immediately showed how much of a jerk he was. After moving in jack came to my door to complain that my dogs were untrained and causing disturbances to his little fur-ball. He also complained that my wife’s car was too damn loud. Now yes my cat meows a lot and it can get annoying but cats aren’t that loud. Also my dogs are hunting dogs so you can’t get much better trained than them. I listened to his complaints and told him I am doing nothing wrong and he will have to deal with it. \n\nAbout a week later he decided to throw a big party. This is a problem in that town as you must post notice to all your neighbors prior to any gathering at your house of more than 20 people. I didn’t call because I quite honestly didn’t care. I wasn’t home when the party started. When I did get home I noticed that there were extra cars in my driveway so I called a tow truck and the local PD. The desk officer told me an officer was already on the block. Let’s call him bubba, because the name fits. A tow truck arrived and bubba had him pull all the cars out of my driveway and onto the street so I could park my car. Now something to note about this town is almost every house has a minimum of a 6 car driveway and a 2 car garage. The town also has a rule which is posted everywhere “no parking on any street”. By the time I got into my house 6 police officers were there handing out tickets, shutting down the party, writing citations for indecent exposure in front of minors and for having a gathering of over 20 people without notice. \n\nWell jack believed it was us that called it in. I told him that my girlfriends and I called about the cars in our driveway and that the police were already called. I also informed him that the town board member in charge of code and rule enforcement lives across the street. The only thing that jack got out of the conversation was me saying girlfriends. He asked what I meant by that and I said “it’s no different than the orgy you had in your pool last night. He flipped me off, called me a jerk and said “it’s on”. And boy was it. The next day I found that all 4 of our vehicles had slashed tires. I called the police and bubba was called. Insurance covered most of it but we couldn’t prove jack did it. It was at this point we were at war. \n\nI don’t remember the order of events exactly but I am going to list who did what. Ask so realize bubba was the officer to respond to most of these. \n\nI bought a yard of manure and had I spread on his house border. \n\nJack parked his work truck on my yard several times. \n\nMy girlfriend Mary (not real name) set off a mortar firework in front of his house the day he was setting of fireworks. Which caused him to spend a night in jail. \n\nJack TPed my entire house\n\nI dropped several cases of liquid skunk onto his property. The smell was that of nightmares. \n\nJack drove across my lawn. \n\nI sprayed ground clearing weed killer on his lawn. \n\nJack tried to feed my dogs something that I believe would have killed them. \n\nI put blue dye into his pool. They looked like the blue man group. \n\nJack had a group of his friends drive through town with their loud exhaust. \n\nMy girlfriend Jane (not real name) decided we should have a naked pool party of 19 people. It lasted 3 days. Jack’s wife kept calling the police to the point they detained her.\n\nI know there was more but these are the highlights. We feuded for a few years and it was insanely childish. Now might be wondering how does this end? Well I decided to replace my fence. How does this result in the feud ending? Well ever since I moved in my property was in violation of my county’s anti erosion regulations. I went to the town and got a permit and the surveyor found that I was in violation. The town ordered in a crew that tore down my fence moved tons of dirt up the hill erected retaining walls and had to take down the awning on jacks side.\n\nJacks landlord came out and had them survey his land as well. Goodbye pool forever. Jacks dog was too scared to go outside and his wife cursed at Mary saying this our fault. Mary flipped her off and said “yup it sure is”. Their dog was apparently shitting all over their house. When it came to the new fence jacks landlord decided to use the same company as us and told the fence company there is no rush. \n\nAfter all the work was done I decided to drop two 5lb box’s of nails in the area on my property that jack liked to park his truck. I wasn’t sure if he would dare to park there again or if the nails would do anything. I was shocked when he came slamming on my door screaming about having 4 flat tires. I called the police. Bubba showed up with a tow truck. He asked if I wanted to have jack trespassed. I grinned and said “yes sir” jack managed to talk bubba into having his truck towed to a repair shop. Bubba gave me a ticket for the nails and demanded I clean them up right away because they are hazard to people, children, animals, and Bubba’s mental health.\n\nThe last act for Bubba in this was arresting Jack’s son for peeping on my girlfriends in the shower. We didn’t press charges but Jack’s son ended up in juvenile detention anyway. Jack moved out shortly afterwards. \n\nTrigger warning: we don’t know how it happened but their dog died at one point we had nothing to with it. But we suspect the son had something to do with it.",
        "created_utc": 1670521157,
        "upvote_ratio": 1.0
    },
    {
        "title": "https://t.me/+qbyS7TCeXooyNTI0",
        "author": "ConfidentAd7015",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/zg28jg/httpstmeqbys7tcexooynti0/",
        "text": "[removed]",
        "created_utc": 1670513559,
        "upvote_ratio": 1.0
    },
    {
        "title": "You never know who's listening",
        "author": "baka-tari",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/zg096r/you_never_know_whos_listening/",
        "text": "Christmas is almost here, time for gift-giving! Gifts come in all shapes and sizes and sometimes you get one when you least expect it. Merry Christmas - here's a gift for you!\n\nI'm on my my first Army assignment in Hawaii a while back with my wife. Her sister and brother-in-law come to visit for a few days. Like many visitors to Hawaii, the sister wants to go shopping in Waikiki. Anybody here been to the Stadium Flea Market or the International Market in Waikiki? That was the first destination, followed by an afternoon at Sans Souci beach on the other end of the strip.\n\nWe all head down to make a day of shopping and beaching, anticipating a good time. The first shop we hit in the International Market is a gold mine. It's got pretty much everything that the two women are looking for and they're loading up. Holy hell, maybe it's going to be a quick day of shopping and we can go to the beach ahead of schedule!\n\nNote: It's important to know that I'm white. Not like Norwegian white, but there's no way I'll ever be mistaken for anything but Caucasian. Regardless of my appearance, I've always had a knack for languages - I pick 'em up like bad habits. At one time or another I've studied Spanish, French, Japanese, and Chinese. I can even speak a little English. At the time of this story, I'm a fairly recent graduate of Defense Language Institute, where I learned Chinese for the US Army.\n\nWhen we enter the shop I note that the two ladies running it are talking to each other in Chinese. I'm not a Karen, so I don't automatically assume that anyone speaking a foreign language is talking about me, I just figure they're talking business. The shop isn't very busy yet, and I catch snippets of their conversation here and there. They aren't being quiet, turns out they *are* talking about us, they're saying some pretty shitty things, and they're really going on about it.\n\nYes, of course you know where this is going. Time for the setup:\n\nI head over to my wife and her sister, encouraging them to be generous with their selections - I'm really egging them on: \"What about this shirt for cousin Bob? How about this knick-knack for your Mom? Do you like this doo-dad your Brother? I bet that skirt would be great on Aunt Sara! Be sure to get a couple of those whose-its and whats-its for the other niblings. . .\" and so on. I really want them to have a huge pile of goodies at checkout.\n\nAfter a while I can see that the shopping is about to end and the paying is about to begin. The women pile their stuff on the counter. They haven't let me down - it is a *very* big pile! I ask them to hold up and give me a moment with the shop ladies. The two of them smile because they've also heard the shop ladies speaking Chinese (they asked me and I confirmed for them, but I didn't tell them the content of the conversation). They know I love to bargain, so they assume I'm going to use my language mojo to work on getting us a nice discount.\n\nThe shopkeepers look very happy until I catch their eyes and I tell them in Chinese \"You are very polite.\" /s. No yelling, no cursing, no stomping my feet. Just four simple words in spoken calmly in their own language tells them everything they need to know.\n\nI'm immediately given the wonderful gift of two surprised Pikachu faces . . . as the two of them realize the price *they're* about to pay.\n\nI tell my family we can leave now, and we leave everything on the counter behind us. As I'm ushering everyone out I explain what happened. They're momentarily disappointed when I fill them in, but there are about twenty-eleven more shops around us so off we go.\n\nAnd damnit, there goes my early day at the beach.",
        "created_utc": 1670509193,
        "upvote_ratio": 1.0
    },
    {
        "title": "My ex friend wronged me and my friends so I exposed all her secrets",
        "author": "Master-Afternoon-696",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/zfze7z/my_ex_friend_wronged_me_and_my_friends_so_i/",
        "text": "[removed]",
        "created_utc": 1670507213,
        "upvote_ratio": 1.0
    },
    {
        "title": "Need help with a scammer",
        "author": "rachel_wilki",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/zfwaz8/need_help_with_a_scammer/",
        "text": "[removed]",
        "created_utc": 1670498933,
        "upvote_ratio": 1.0
    },
    {
        "title": "Women of reddit, What’s the best revenge for a cheating partner?",
        "author": "Lethaltoxinn",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/zfvjir/women_of_reddit_whats_the_best_revenge_for_a/",
        "text": "[removed]",
        "created_utc": 1670496334,
        "upvote_ratio": 1.0
    },
    {
        "title": "Former coworker pretending to work",
        "author": "Fickle-Chemistry-483",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/zfuunf/former_coworker_pretending_to_work/",
        "text": "This happened back in 2008.  We had a HR manager at the time, we will call him Bob who would daily show up to his office around 9:30 with his Starbucks and walk into his office.  Start time for most of the front office was 6:30 to 7:30.  Us engineers around 6:30.\n\nBob had a good personality so it was hard not to like him.  If there was a coworker who was being a problem Bob would handle it.  Bob just wouldn’t show up on time when the rest of us averaged at least fifty hours a week.  Bob also liked to take long lunch breaks from 11:30 to 1:30pm.  He would come back and work a few more hours.  Bob would also like to leave work early, around 4:15pm.  Bob also didn’t like to wear safety glasses when on the shop floor, even though there was a case right on the shop floor next to his office.\n\nEvery time Bob would do this he would leave his office phone off the hook and office light on so it looked like he was working.  He had no other buildings to go to, his car was gone, so we knew he was stealing time.  \n\nDifferent operation managers tried talking to him about it but didn’t care to do anything.\n\nWe started locking his door behind him after he left everyday for work, and during his lunch break so when he would be late for a 1:30 office meeting because he couldn’t get his pc.  This didn’t change,he kept it up.  We increased our efforts to annoy him.  We emptied the safety glass container next to his office, he didn’t care anyways, and would lock that door behind him so he would have to take the long way back to the office around the shop for everyone to see.\n\nOne day there was a tour at one thirty but someone got hurt on the shop floor legitimately.  All the big wigs were there.  Bob was late responding since he just got back from his office, didn’t have his PC and was not ready to respond, and had no safety glasses on with the HR director watching,  Photos were taken and since Bob didn’t respond properly he had a near miss along with the accident that happened.\n\nBob was written up and as standard procedure had to take a drug test also.  Bob tested positive for opioids, so Bob was put on a two year review and had to attend outpatient rehab.  He had to take twice weekly drug tests, attend safety classes, and had to punch in like shop floor people so his attendance could be verified. Months later he came back from lunch again late and was fired.",
        "created_utc": 1670493860,
        "upvote_ratio": 1.0
    },
    {
        "title": "Consumer Insurance phone scam harassed me for years, so I returned the favor.",
        "author": "_daddyissues666",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/zfssku/consumer_insurance_phone_scam_harassed_me_for/",
        "text": "If you ever get a call from this ‘Company’, don’t believe a word out of them. They’re not a legitimate company, they’re just trying to get money out of you and fuck you over.\n\nSo starting like 4-5 years ago, I’ve been getting regular calls from people claiming that they can help me save money on my car insurance. It was usually daily but sometimes just two or three times a week - never less.  It was never a multiple times a day thing.\n\nWhen they first called me, I didn’t even have a license yet. I thought it was just a genuine mistake on their end rather than a scam. At the time, I didn’t have a phone that alerted me about potential spam or scam calls. So I informed them that I didn’t have a license yet let alone car insurance. And they immediately hung up on me. No apology, no acknowledgment - nothing. Figured whatever that’s fine.\n\nThen they just kept calling every day after that. So I kept telling them “hey please delete my number, I don’t have a license, a car or car insurance.” Every time they either said “ok” and hung up or just hung up on me.\n\nAfter that, I would just ignore every call until finally blocking the number all together.\n\nIt worked for a few days before they started from a different number. Blocked it, but they just called from new numbers.\n\nI alternated between telling them my usual ‘no license. Delete my number’ or just ignoring. Eventually, the daily calls were always from a different number. So blocking stopped doing any good. Soon I got a new phone with a new number hoping it would end but it didn’t. They called my new number.\n\nJust. Kept. Calling. \n\nAgain - this went on for years. Blocking didn’t help, ignoring didn’t help.\n\nAbout two days ago, they called again of course. I’ve learned nothing I do is gonna stop them at this point so I answered it and just pterodacyl screeched into the phone before hanging up.\n\nThen they did something new.\n\nThey called BACK.\n\nThat’s what did it for me I guess because I was genuinely pissed.\n\nI answered and asked who they were trying to call. \n\nCaller: Hi my name is Andi from consumer insurance, I’m trying to help save you money on your car insurance.\n\nMe: not what I asked. Who are you TRYING to call.\n\nC: I don’t know. All we have on file is a number, we don’t have specifics.\n\nMe: so you’re trying to save me money on my car insurance but you don’t even know who I am?? You have my number. That’s already pretty specific.\n\nShe hangs up.\n\nI call back, same person answers. Same lisp, same accent, same voice.\n\nC: Hi this is Sophia, who am I speaking with?\n\nMe: wow Sophia, you sound EXACTLY like the Andi bitch that just hung up on me.\n\nShe hangs up again.\n\nSo I call back.\n\nC: Hi this is *different name, same person*. Who may I ask am I speaking to.\n\nMe: same person you’ve been speaking to. Y’all have been harassing me for YEARS and I’d like a damn apology and for my number to be deleted from your records.\n\nC: I’m calling to save you money on your—-\n\nMe: No. I tried telling y’all for years I didn’t even have a license and you kept calling. I’ve told y’all to delete my number and you didn’t\n\nShe hangs up again so I call her back.\n\nC: who is this\n\nMe: Same person you keep hanging up on\n\nC: fuck (took everything in me not to laugh at that one)\n\nHangs up. I call back and FINALLY get someone else\n\nC: Hi this is *fake name probably* with consumer insurance. How can I help you?\n\n\nMe: listen y’all don’t get to harass me for YEARS and then hang up on me when I do it back. Delete my god damn number and at least apologize.\n\nC: I’ll delete it\n\nShe then hangs up with no other words.\n\nHaven’t gotten a call back yet but it’s only been a few days. So I’m hoping this much worked.\n\nMaybe I’m an asshole for it, but I’ll take it. Sure Sophia/Andi/Whoever probably wasn’t one of the scammers harassing me over the years, but if you’re gonna work for a ‘company’ that does harass/scam, it might as well be part of the job at that point.\n\nCall me once a day for several years, shame on you.\nCall me twice in a day, got me fucked up.",
        "created_utc": 1670486324,
        "upvote_ratio": 1.0
    },
    {
        "title": "Technically speaking bio warfare💀",
        "author": "Magikal_bacun",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/zfsm22/technically_speaking_bio_warfare/",
        "text": "[removed]",
        "created_utc": 1670485650,
        "upvote_ratio": 1.0
    },
    {
        "title": "So childish but so gratifying",
        "author": "arbeekay",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/zfp4qr/so_childish_but_so_gratifying/",
        "text": "Many years ago we sold our home to move to a new neighborhood just a few miles away. Unfortunately, we sold to a bit of a lunatic who demanded unrealistic and unreasonable hand-holding after we closed on the sale. She made our lives miserable for several weeks after she and her family moved into our former home. \n\nDespite us leaving behind tons of practical information and user guides for appliances, pool operations, recommended vendors who service the neighborhood for lawn care, pest control if needed, etc. - the wife managed to find my direct work phone number and email address as well as my husband’s and she would call and email with questions and random, unsubstantiated complaints DAILY.  She went so far as to threaten to come to my office to confront me in person if I didn’t answer questions immediately. \n\nIt occurred to me that I still had my car programmed/configured to operate the automatic garage door opener for our old house. So, after one particularly frustrating day of dealing with her, my husband and I decided to drive by and just press the button in my car to jack with them a bit. Turns out, the husband was in the driveway working on something and we watched him in a complete panic as his garage door somehow started to close with him left outside. \n\nWe didn’t stick around to see if he ended up locked out and we felt more guilt than satisfaction at first, but we look back on it and laugh pretty hard when we remember it now.",
        "created_utc": 1670474326,
        "upvote_ratio": 1.0
    },
    {
        "title": "Buy soma online",
        "author": "Practical-Expert3497",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/zfkf71/buy_soma_online/",
        "text": "[removed]",
        "created_utc": 1670462060,
        "upvote_ratio": 1.0
    },
    {
        "title": "When my coworker spoiled Spider-Man",
        "author": "Fit_Specific4763",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/zfj9wr/when_my_coworker_spoiled_spiderman/",
        "text": "When I was maybe 18 I was working in retail. It was nice the department I worked in were all people my age and we chatted often. I had tickets to the Spider-Man movie that had just come out and had told my coworkers how excited I was to see it after work. This was the day after it came out. We were all excited as most of us were going to see it or had saw it already so we were really looking forward to discussing it together. \n\nThere was a guy there, we’ll call him John he was pretty new to the store and me and my other coworker we’ll call max were his references if he still needed help figuring things out. \n\nI liked John I thought John liked me. But I guess not because when the others left the room he patted my shoulder and told me the biggest plot reveal of the movie. I was heart broken. Sounds dramatic but I love Spider-Man. I looked him in the eye and just shook my head and walked away. \n\nI’m a bubbly person so it was noticeable my mood turned sour, my close friend and coworker asked what was up and I told him what had happened. We agreed it was an asshole move and went to go back to work when we heard John call over the walk-in asking for help. Being his trainer I couldn’t ignore him but I knew the aisle numbers and knew he didn’t so whenever he’d call for help I would tell him the aisle and turn my walke off. \n\nOver the next few days I continued this along with childish silent game when he was in front of me, just looking at him straight faced and shake my head. \n\nEventually a my friend and other close two coworkers started the same thing just dead panning and shaking our heads. \n\nEventually after a week of this John apologized for spoiling the movie and even got me a Spider-Man keychain \n\nI got a keychain and a friend out of it.",
        "created_utc": 1670459191,
        "upvote_ratio": 1.0
    },
    {
        "title": "MIL hates pet holiday cards",
        "author": "MelodicReference2503",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/zfi9oq/mil_hates_pet_holiday_cards/",
        "text": "[removed]",
        "created_utc": 1670456741,
        "upvote_ratio": 1.0
    },
    {
        "title": "Parking enforcement at work",
        "author": "Mryan7600",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/zfh9vu/parking_enforcement_at_work/",
        "text": "Not my story, but told to me by my dad from when he worked at a small grocery store in Wheaton Illinois when he was a teenager. Hope that’s allowed.\n\nIt was his first job and he was a bag boy/stocker. A customer complained that the way he bagged her groceries had damaged some items. The manager on duty replaced them and docked my father’s pay but did not allow him to take the damaged items(not sure how legal that might have been at the time, it was the 70’s).\n\nThis particular manager always parked on the street right behind the store which had a 2 hour parking limit during the day. At the time parking enforcement would walk up and down the street marking tires and ground next to it with chalk and would come back later in the day to ticket cars that hadn’t moved. He would only walk this block in the morning and right after lunch. The manager knew this so he would go out every day and wipe the chalk away rather than moving.\n\nMy father began taking his lunch break after the manager did this and would mark the tire back up with chalk. He said it took a few weeks, but the manager finally got a ticket. Then he started moving the car down the road instead of just wiping the chalk off but my father continued to mark it and he got another one. My dad continued to do this until the manager started parking in the lot.",
        "created_utc": 1670454432,
        "upvote_ratio": 1.0
    },
    {
        "title": "Gonna flip out over an accident? I'm gonna make you wait.",
        "author": "Jennabear82",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/zffcvw/gonna_flip_out_over_an_accident_im_gonna_make_you/",
        "text": "This story happened when my son was a toddler (circa 2009/2010?).  I did have a digital camera on me at the time, but I didn't own a cellphone with a camera on it.  Come to think of it, I don't even think I had a cellphone then.\n\nI'll mention that it's relevant that I was on the passenger side of my vehicle.  I was getting my son in my truck and he was fighting me bc he didn't want to get into his car seat. He kicked the door and it swung open, hitting the blue truck parked next to me. Just great. I get out to assess the damage and see a line about an inch long from where my door hit the side of the truck and scraped it.\n\nNow I'm a responsible person and being responsible has cost me bc people take advantage of my mistakes.  I had left my insurance for a woman years prior when I backed into her tail light on accident.  She claimed whole bumper damages.  Thankfully pictures proved otherwise and I have great insurance.  She had rusty old prior damage that she tried to claim as new.\n\nAnyway, I turn to start to get my insurance card and a notepad out of my glove compartment, only to look up and see this guy hopping mad and charging towards me with his shopping cart.  \"This day just keeps getting better\" I think to myself.  \"I want your insurance card NOW, or WE'RE going to have a PROBLEM!\" he yells, as if I'm getting ready to flee the scene. At that point I grabbed my digital camera instead of my insurance. I said \"Calm down dude. Nobody died and it was an accident. My son kicked my door open as I was putting him in his car seat.\" He then threatened to call the police if I was planning on fleeing. I told him he was more than welcome to call the police if he wished, but I'm going to go into the store and get some batteries for my digital camera first so that he doesn't try and claim more damage than what was actually done to his vehicle.  He chose to wait.\n\nI get my son out of my car, adrenaline still pumping, close the door and lock it. I waltzed in the store and took about a good 30-45 minutes of sweet time to find batteries and check out. He got my insurance card AFTER I took my photos and stood there fuming the whole time.  I had things to do that day, but making him wait out of spite was very gratifying.",
        "created_utc": 1670450327,
        "upvote_ratio": 1.0
    },
    {
        "title": "I hate coffee",
        "author": "timeytrooper",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/zffb2f/i_hate_coffee/",
        "text": "This was back in the 90's.\n\nI had a boss, probably in his 80's. Every morning the man walked past the coffee pot, to come to me to order me to get him a cup of coffee.  I hate coffee. I hate everything about it. \n\nThis man was also quite rude.\n\nI wasnt required to get him coffee (nor anyone) he just demanded it of me. So i started brewing coffee for him. Sometimes it was decaf. Sometimes it was 3 bags of coffee to one pot (bitter and full of caffeine!)  But i never did it the same way twice.  \n\nAfter 2 weeks he finally stopped demanding coffee from me because \"you are too stupid to learn how to make it.\" \n\n🤣",
        "created_utc": 1670450221,
        "upvote_ratio": 1.0
    },
    {
        "title": "Couple weeks ago someone stole my airpods. Since then i’ve been tracking them and playing sounds when the pods are in use.",
        "author": "fragiletestes",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/zfe2yx/couple_weeks_ago_someone_stole_my_airpods_since/",
        "text": "[removed]",
        "created_utc": 1670447685,
        "upvote_ratio": 1.0
    },
    {
        "title": "Exes best friend lost job to gaming",
        "author": "Green-Ad2078",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/zfdw0c/exes_best_friend_lost_job_to_gaming/",
        "text": "[removed]",
        "created_utc": 1670447291,
        "upvote_ratio": 1.0
    }
]