[
    {
        "title": "Revenge on a high school principal",
        "author": "mactheprint",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/1111313/revenge_on_a_high_school_principal/",
        "text": "\nThis is something my husband was involved in while in high school, some 40+ years ago. You'll notice that no actual damage was done by them. \n\n\nThe principal in his high school was a jerk.  He did everything from selectively enforcing school policy to attempting to confiscate the funds raised for the prom (fortunately the most influential booster club in the school stopped this) to pay for new jackets for the football team. \n\nThis first revenge instance he told me about was when a group of students decided to fertilize his grass ... selectively. My husband prepared a water-type extinguisher with two pounds of Epsom salts then added the water and air pressurization. Then he handed it off to other conspirators. Then one day (or maybe night) they went and \"wrote\" things on the lawn with it. I'll leave it to you to imagine what high schoolers would write in this instance. \n\nWithin days the \"writing\" appeared as VERY GREEN grass. Of course, the principal went to the cops, and wanted someone arrested for malicious mischief. However, in that town, that was defined as the DESTRUCTION of property, not benefitting the property, even if only selectively. The principal had to arrange to have his entire lawn fertilized. \n\nThe other revenge my husband told me about was much simpler. Someone took a few packets of sugar and poured it on the (closed) gas cap off the principal's car, and sprinkled some on the ground below it. Next, the person carefully polished off the gas cap, to make it seem someone had poured the sugar in the tank. \n\nWhen the principal saw it, of course, he assumed precisely that, and got his tank and gas line purged for what was really nothing. That's not cheap! \n\nThe students got away with it both times! Alas, I haven't been told about any other revenge they did, but I'm pretty sure there was some.",
        "created_utc": 1676268274,
        "upvote_ratio": 1.0
    },
    {
        "title": "Sign up this number for spam please - U.K.",
        "author": "hbrown94y",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/11107i8/sign_up_this_number_for_spam_please_uk/",
        "text": "[removed]",
        "created_utc": 1676265290,
        "upvote_ratio": 1.0
    },
    {
        "title": "Discriminate against my Neighbors? Enjoy extra attention.",
        "author": "See-A-Moose",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/110z04n/discriminate_against_my_neighbors_enjoy_extra/",
        "text": "So my background is in public service working directly for elected officials. As such, I have a lot of friends and contacts at the various levels of government I have worked in and worked with. The rental community we live in used to be decent, but 2-3 years ago a very well known individual with family in real estate purchased our community. Following that services have steadily declined. Repairs and maintenance have been slower, hours cut, etc. The same company even had to settle a lawsuit with the state for predatory behavior in another county. \n\nWell after finally getting fed up with this place my wife and I decided to move. While talking to some of our longtime neighbors about our upcoming move some information came to my attention. Namely that while our service requests have all been processed relatively quickly, theirs have often taken months. And while our rent renewal was about a $100 increase, theirs was going up $300 (even though they have perfect credit, decent income, and have been there longer). I was already aware of another Black neighbor having a large rent increase and was surprised when ours was less. And my neighbor went on to tell me that the reason one of our other Black neighbors moved was that they were quoted a $700 per month rent increase. Odd... None of my white neighbors have been quoted huge increases. But all of my Black neighbors I have talked to have been for comparable or worse units.\n\nWould be a shame if someone living here knew the State Senator who chairs the committee in charge of landlord tenant issues and was friends with the Chair and Vice Chair's Chiefs of Staff. Wonder what would happen if I dropped them ALL a line... As well as county officials and folks in the AG's office. \n\nNot sure what will happen next, but even money says it won't be good for this rental company.",
        "created_utc": 1676261397,
        "upvote_ratio": 1.0
    },
    {
        "title": "I put pepper juice on my cousins underwear",
        "author": "Mean-Neighborhood772",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/110txnh/i_put_pepper_juice_on_my_cousins_underwear/",
        "text": "A few years ago a few cousins came to live with us (me 18, my sister 15 my mom and step dad) as their dad’s girlfriend could no longer deal with one of the kids that I will call Ick (16). Ick was very combative constantly trying to pick fights and just generally try to throw his weight around with me and my sister (empathize the try there).\n\nWell one day I got pissed at him since he tried to make noodles but somehow managed to burn my school text book (partly my fault I left it near the stove but not on it) and mom made me pay for it out of my money. Upset I spent the week trying to figure out how to get back at him, during this time he had not showered once for at least two weeks and I was getting feed up with this as well as you could smell what room he was in as well as recently in. So I took one of the bigger green peppers (not the small one I’m not that cruel) and rubbed some of the juices on the crotch of his underwear and put it on the top of his clean underwear pile. It was over a week before I woke up to him screaming that his privates hurt. At this time I completely forgot about what I did so I just ignored him till his crying started to annoy me and I got up to see what was going on. \n\nMy mom was trying to figure out why his privates were hurting and assumed it was a UTI. I did as well considering how he never showered and suggested he go shower to which he told me something along the lines of to go pound sand. Shrugging it off I just started to eat my cereal as mom reluctantly began to get ready to take him to the doctor.\n\nIt was not till after they were gone and I was in class did I recall what I had did and began to feel kinda bad. Especially when I got back home and he was just sobbing in a ball. I tried to get him to go shower and change cloths but he screamed at me to leave him alone so I did.",
        "created_utc": 1676245720,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to get my flatmate to stop taking my kitchenware/pantry ingredients",
        "author": "thankyoumydarling",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/110t0jn/how_to_get_my_flatmate_to_stop_taking_my/",
        "text": "[removed]",
        "created_utc": 1676243132,
        "upvote_ratio": 1.0
    },
    {
        "title": "Violate me after I said no? I'll expose to you your friends and neighbors:)",
        "author": "nycrina305",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/110qd0e/violate_me_after_i_said_no_ill_expose_to_you_your/",
        "text": "[removed]",
        "created_utc": 1676236162,
        "upvote_ratio": 1.0
    },
    {
        "title": "An artiste runs us ragged",
        "author": "Worker11811Georgy",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/110pvp5/an_artiste_runs_us_ragged/",
        "text": "I worked several 'no-budget' film shoots in the late 1980s, early 1990s. We worked for nothing with the promise that we'd get money if the film got a distribution deal. Out of the ten I did, two actually did pay off!\n\nI worked the lighting crew and one of these movies was being shot by an 'artiste,' someone that called themselves an artist (by saying something like, \"I paint wiz ze light!\") but had no clue how to use the equipment to achieve that 'painting.' One time they were grumpy and the gaffer asked for his instructions. The 'artiste' snapped at him, \"Just put everything where it looks the best!\" He took so long to light that it routinely took us HOURS to get our first shot off, sometimes until lunch!\n\nThe last part of the schedule were all the interiors in a studio. It was one of the last shooting days and we were relieved it was almost over. We electrics were sitting on appleboxes behind the set and the artiste asked for a check on some random highlight he had placed. He wanted to see what a particular light was doing, what it looked like on set. An electrician just turns it off and on slowly as the DP watches the results on the set.\n\nI started to get up to go to the light, but the gaffer stopped me. In his hand he had a clothespin. Lighting crew on film shoots use the wooden, spring loaded clothespins by the handful to clip colored gels and diffusion in front of the lights; each electric will have a half-dozen on them.\n\nHe made the clothespin snap in his hand and said, \"It's off!\" even though it was already off.\n\nHe snapped it again, \"It's on!\" Snapped it again, \"Off!\" Snap, \"On!\"\n\nThe Artiste said, \"I see nothing, leave it off.\"\n\nThe gaffer snapped the clothespin one more time, \"It's off!\"",
        "created_utc": 1676234946,
        "upvote_ratio": 1.0
    },
    {
        "title": "I'm from Russia",
        "author": "No-Classroom-1971",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/110o9ik/im_from_russia/",
        "text": "[removed]",
        "created_utc": 1676230830,
        "upvote_ratio": 1.0
    },
    {
        "title": "Pulling the (sound) plug on a computer hog",
        "author": "DishGroundbreaking87",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/110km1s/pulling_the_sound_plug_on_a_computer_hog/",
        "text": "10 years ago I worked in a community centre where people would come to play pool, play board games and drink tea.  There was a computer available for clients to use as many still didn’t have smart phones or home WiFi.  The client’s were always considerate of others until one guy joined and ruined it for everyone else.  He would rock up, plug in his headphones and hog the computer all day, watching Beyoncé videos, playing pocket billiards and laughing like Beavis and Butthead. all.day.long.\nThe manager was a coward who wouldn’t let us do anything, even when he started becoming aggressive towards other clients, who only asked nicely if they could use the computer for 10 minutes to pay a utility bill or check their emails . \nA week or so after being told not to challenge him I got a new home computer and had a eureka moment whilst setting it up .  Turns out it’s really easy to enable/disable a sound card once you know how, so next day I got to work early and and did just that.\nNone of the other clients noticed because they only used the computer for admin, not for perving over music videos. When he realised there was no sound he threw a tantrum.  I played dumb and said “no idea, it was working yesterday, maybe your headphones are broken?” He sulked off and came back 20 minutes with a pair of freshly bought expensive looking headphones, but of course there was still no sound.  At this point he threw an even bigger tantrum and demanded I fix it.\nWhen I carried on playing dumb and said I didn’t know how he lost his temper and grabbed me by the shirt collar.  That was too far even for my manager, who finally grew a backbone and banned him from the centre.\nI enabled the sound card again the next day and everyone was able to enjoy their tea and board games in peace again.",
        "created_utc": 1676221634,
        "upvote_ratio": 1.0
    },
    {
        "title": "My teacher enjoyed picking on the small kid…",
        "author": "Kind-Cheetah-9699",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/110h53l/my_teacher_enjoyed_picking_on_the_small_kid/",
        "text": "This whole event took place my sophomore year in high schoo. I hadn’t quite physically matured yet and stood at all of 5’ 4”. I generally caught a lot of shit from kids because I was the easy target. I was a star soccer and baseball player who was respected for that, but still got to hear the constant jokes from anyone who felt the need to make themselves feel better. \n\nI had an AutoCad/Drafting teacher who always loved to make jokes about my height and girls. I was somewhat timid and shy due to self-esteem issues, so I never really spoke up for myself and responded to his remarks. It’s almost as if he would make a point to say things in front of the class to make them laugh. Eventually my friends and peers realized I hated it, so even they stopped entertaining him. One day I finally decided to speak to him after class…asking him to stop because I was embarrassed and couldn’t concentrate in the environment. His response was “Jesus Christ….stop being such a pu**y and to get out of his room.\n\nI never forgot this. One day I came in and I had just gotten my learners permit to be able to drive, so I was showing it off to a friend. The teacher came over and exclaimed ”look everyone their giving 10 year old licenses now!” He then grabbed a stack of four encyclopedia books and told me I could have them in case I needed to sit on them while driving. \n\nWell it just so happened he was going through a messy divorce at the time. Everyone knew about it because his wife was cheating on him with another teacher at school. Being a day before Valentine’s Day, I had bought a Rose from the little booth at school to give to my crush. Reaching my breaking point, I confidently held the rose up and asked if he wanted the rose to try and get his wife to love him again or if I should just give it to Mr.Johnson(teacher his wife cheated with) to give to her…\n\nHe absolutely went ballistic on me and lost his shit to the point of freaking out and having teachers come across the hall to see what was going on…When he finished his outburst and I had a second to speak, I calmly responded, “With all due respect, I think you should take your own advice and stop being a pu**y”. In that moment I thought he was going to physically assault me and I was ready for whatever would happen. He left for the day shortly after. \n\nBeing this took place on a Friday, I showed up Monday expecting discipline or the class to be awkward, but instead the guys father had filled his spot as a teacher and stated that his son was checked into a mental health facility. I initially felt bad, but then I thought about all the shit he gave me and I never felt emorse after that or since. He had the option to stop and decided to push it further, so I did what I needed to do to end it. \n\nThis was a turning point in my life because I learned to speak up myself to accomplish things and not sit on the back burner all the time. I eventually matured into my 5’ 11 200 lb frame when I saw him around 5 years later at the store. He didn’t recognize me at first but when he did, he came up to me and apologized and told me he was a dick and took his frustrations out on me. Being an army veteran, he said he had thoughts about killing himself and killing me “like he did his enemy in Iraq….” and informed someone, which led to him being involuntarily committed to a VA mental health facility. He eventually thanked me because he said he finally received the help he needed. Obviously this was never my intention, but I got my revenge and he got help. Win Win scenario!",
        "created_utc": 1676212615,
        "upvote_ratio": 1.0
    },
    {
        "title": "Pizza?",
        "author": "Significant_Limit_68",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/110gnz0/pizza/",
        "text": "I was just reminded this from several years ago. I was driving home after picking up a pizza and some idiot pulled out in front of me only to stop at the red light directly in front of me. \nI got out of the car told what he just did and asked him for 20 bucks for the pizza.  He  told me to go fuck myself. (We’re in NJ) I went back to my car got the pizza open the box and put it face down on his windshield and just started sliding it all over. Got back in my car and took off. I didn’t get my pizza, but it sure felt good to do that and see his windshield completely covered in cheese and sauce. 😂 it made ur actually worth it!",
        "created_utc": 1676211273,
        "upvote_ratio": 1.0
    },
    {
        "title": "I put pepper juice on a cousin’s underwear",
        "author": "Mean-Neighborhood772",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/110g9ac/i_put_pepper_juice_on_a_cousins_underwear/",
        "text": "[removed]",
        "created_utc": 1676210092,
        "upvote_ratio": 1.0
    },
    {
        "title": "Petty revenge for giving me an embarrassing nickname",
        "author": "browneyesguy",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/110f60g/petty_revenge_for_giving_me_an_embarrassing/",
        "text": "[removed]",
        "created_utc": 1676206752,
        "upvote_ratio": 1.0
    },
    {
        "title": "https://app.temu.com/m/FFff0JPr67Vcj",
        "author": "Dizzy-Touch8069",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/110eytg/httpsapptemucommffff0jpr67vcj/",
        "text": "",
        "created_utc": 1676206086,
        "upvote_ratio": 1.0
    },
    {
        "title": "Exes and social media",
        "author": "hundopercentthatb",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/110d252/exes_and_social_media/",
        "text": "[removed]",
        "created_utc": 1676199168,
        "upvote_ratio": 1.0
    },
    {
        "title": "Some teachers are just mean",
        "author": "nagolmr",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/110c5u2/some_teachers_are_just_mean/",
        "text": "My male gym teacher was telling the gym class the rules of the gym on the very first day of middle school. First day of 6th grade. We’re 10 minutes in and he tells me, a 12 year old little girl, to come stand infront of the class (50 people) and get in “push up” position for as long as my arms will hold me up for chewing gum in class. I didn’t know that was a rule. I wasn’t chewing loudly or anything. I had not even spoken yet. I think he just wanted to make an example. Im extremely shy and introverted and was very skinny. I’m really pale too so when I blush, I get super red. It was humiliating. I absolutely could not stand that guy through out middle school and made it my goal to get on his nerves. I made sure to take gym in seventh grade for 2 quarters (half year) and 4 quarters (all year long) in 8th grade. He was extremely rude to anyone that wasn’t his popular favorite kids.\n\nI got lucky one quarter in 8th grade and had almost my entire friend group in my class. We wouldn’t ease up one day with the playing around and the other gym teacher told us we needed to stop, that the mean teacher had to go in the locker rooms for a break to calm down. He eventually left the middle school and we got a super cool new teacher. \n\nAnd then the other gym teacher I mentioned, (that told us to give him a break) had a son in my grade. We became best friends 8th grade and were inseparable until I was 19. Not intentional but it tied it all together",
        "created_utc": 1676195804,
        "upvote_ratio": 1.0
    },
    {
        "title": "Petty revenge with a side of Federal charges",
        "author": "Sarcastic_Otter",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/1109eis/petty_revenge_with_a_side_of_federal_charges/",
        "text": "Way back in the ancient days of 1985, I was tormented by a complete tool named Jimmy who was 1 grade above me in high school in a small town where everyone knows everything about you and who said what. \n\nHe was a “redneck” who hung out with similar losers who liked chewing tobacco. \n\nOne day, he thought it would be fun to use my backpack that was hanging off the back of my chair as his spit cup. \n\nI was furious but with his gang of cretins, there was nothing I could do about it. \n\nAt least not until he turned 18 and hadn’t graduated yet. \n\nIn school, I heard him bragging to his friends that he stole some mail from the post office by reaching into his PO Box and grabbing the mail in the adjoining boxes. \n\nHe bragged that he got someone’s Social Security check and cashed it, using the money to buy some Coors beer. \n\nWell…my friends mother worked at the Post Office and I let her know and to keep an eye out. \n\nSure enough, a couple of weeks later he got caught. The mailman inside saw his scrawny arm reaching in and just grabbed him by the wrist and bent it at a 90 degree angle, trapping his arm until the police showed up. \n\nHe ended up not finishing school while in jail waiting trial and going to prison for the better part of a decade.  \n\nFurther investigation by the FBI (because it is a Federal Crime) got some of his asshole friends caught up as well. \n\nI moved away right after high school and never went back.\n\nBut before I left, I made sure everyone knew I tipped them off.",
        "created_utc": 1676184734,
        "upvote_ratio": 1.0
    },
    {
        "title": "Want the yard so bad? You can have the YARD all to yourself.",
        "author": "DearBanana2532",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/1108fw7/want_the_yard_so_bad_you_can_have_the_yard_all_to/",
        "text": "You guys liked my last story, i think this fits here too so here's another one! This happened before the water issue from what i recall.\n\n&amp;#x200B;\n\nBackground: Years before the issue neighbor moved in, we had signed a lease agreement that included we had exclusive use \\*and care\\* of the yard. We lived in an upstairs/downstairs duplex and had the downstairs; it was common for upstairs apartments like this to have no yard \"rights\" in lease. We allowed the previous tenants to use our things and would have let her had she not been such an issue and rude. Her kid did NOT live with her and was there on average 1 day a week. This neighbor was under the impression if they could see it, it was shared, Including things IN MY HOUSE.\n\n&amp;#x200B;\n\nOur upstairs neighbor moved in late fall. We used our yard year-round and still had (fully legal) fires in the winter. Around spring she started bothering the Manager about it. She wants to use the yard and \"We won't let her\" and her kid \"keeps asking\" and we are \"telling her kid no\"!!! I was shocked, we had never talked to the child at all (nor her about the yard) and manager had not brought it up to us, plus I'm not a monster, the kid could play in the yard without asking! I heard her saying this outside very loudly on the phone.\n\n&amp;#x200B;\n\nWe tried working things out through the Manager. Went through different options (Her/Us), Front yard/Backyard split. Front &amp; Left(her) side yard split/Back &amp; right side yard split. Front, Lefts side and 70% of backyard/ small walkway access out our backdoor to right side yard. All a Big, Fat, NO. Neighbor did get their own firepit after they were told they couldn't use ours (and threw a fit about it) but failed to pay attention to safety guidelines.  This included having a 6ft+ fire 5ft from our duplex, 911 was not called but SHOULD have been, we were NOT home at the time. Also video of her and her friends laughing about how \"it's about to go up\" and how they have no water to stop it, and laughing harder about how it could burn the house down. Luckily our dogs and us weren't home at the time.\n\n&amp;#x200B;\n\nAt this point, the daily harassment was insane. She stomped so hard she broke a window in our unit under her stairs. My dog started ripping his hair our from stress because of the nonstop impact noise, we later found out was a basket ball, upstairs. We moved our dogs out for their heath and safety. Then it was petty revenge.\n\n&amp;#x200B;\n\nWe removed EVERYTHING we owned from the yard. The fire pit, the patio chairs, tables, fire wood, Horsehoe pits, down to our rocks, EVERYTHING. Only left what we did not own, which was nothing but yard. Most of our stuff we gave to our next-door neighbor. Then we told the manager, she can have the exclusive use of the yard and all that comes with it, the care/landscaping. Manager was more than happy to get her off her back about yard use and asked when we would be giving her the key to our lawn mower. I laughed and said \"no, she can't use my mower. Even if i did let her, she wouldn't do it. that's your problem now. If i can't use the yard without being harassed, she might as well have it. This is on you\". Eventually they got the point and hired someone to care for the lawn as there was no way she would (Even if she had a mower)!We had doorbell cameras at this time that covered our backdoor and backyard, as well as the front yard.\n\n&amp;#x200B;\n\n\\*She used the backyard ONCE, to drag her baby in circles around the house\\*. Once she saw all our shit was gone and she couldn't use it, she was pissed and NEVER used the yard again. Turns out she didn't want the yard, she wanted the shit we owned in the yard.",
        "created_utc": 1676181182,
        "upvote_ratio": 1.0
    },
    {
        "title": "Thread dedicated to this asshole",
        "author": "SweatyBoiOhio",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/11080ak/thread_dedicated_to_this_asshole/",
        "text": "[removed]",
        "created_utc": 1676179611,
        "upvote_ratio": 1.0
    },
    {
        "title": "Swag Kennels",
        "author": "Prestigious_Bar2908",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/1107dt2/swag_kennels/",
        "text": "[removed]",
        "created_utc": 1676177395,
        "upvote_ratio": 1.0
    },
    {
        "title": "Teacher Trying to be Clever gets Roasted",
        "author": "cobanat",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/1106teh/teacher_trying_to_be_clever_gets_roasted/",
        "text": "This is more of a playful revenge when compared to basically everything else on here and the situation is a lot more wholesome.\n\nSo bit of context: I was a student who barely ever spoke and always kept to myself. Basically the quiet kid in the corner people forget that was even in the class. My teacher, let’s just call him Mr Teacher, was about late 30’s to early 40’s balding man. He was one of those fun teachers that was pretty into current memes but not in a cringy way. He was genuinely pretty good with his sense of humor and up to date jokes. However, he also had a bit of an ego. Not too big, but he always seemed to want to prove he was the smartest in the room one way or another. \n\nOne day, instead of doing class work, we got distracted as he tried to prove that no wish is safe from being manipulated by a genie. So the class challenged him that they could find an incorruptible wish. There were a few basic wishes that people made such as:\n\n “I wish for more wishes,” to which he would say “Granted. Now you have 2 wishes left but you desire an infinite amount of wishes and can’t make up your mind anymore”. \n\n“I wish I was a top streamer on twitch.” “Granted. Streaming is now your life. You have gained no other life skill and by the time you’re as old as me, you will realize that all you have is streaming and nothing more.”\n\n“I wish for no loopholes in my other two wishes”. “Granted. Consequences are not loopholes and words can have multiple meanings and interpretations.”\n\nEtc etc. No wish was safe and the students were becoming more and more hopeless that there really was no incorruptible wish for Mr Teacher the Genie. All this time I’m just enjoying the fact that there’s no class work being done and not really paying much attention to what’s happening. But seeing Mr Teacher with that shit eating grin, so happy that he made all his students depressed so early in the morning, I just had to do something about it. I came up with my own wish that he wouldn’t dare mock or corrupt.\n\nAt this point no one is giving anymore suggestions and Mr Teacher is just begging for one more wish to ruin. So here comes my hand being raised in the back of the class with my own shit eating grin to match his. He motions at me to go ahead and I say: “I wish Mr Teacher got his hair back.”\n\nAll the students collectively lost their shit. Mr Teacher could only open and close his mouth a few times with no words coming out before finally blurting out, “I don’t wanna do this anymore!” Then proceeded to make the whole thing into a “be careful what you wish for” lecture. I never got an answer for my wish.",
        "created_utc": 1676175438,
        "upvote_ratio": 1.0
    },
    {
        "title": "Petty roommate revenge",
        "author": "jerrylee678",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/1104agc/petty_roommate_revenge/",
        "text": "[removed]",
        "created_utc": 1676167256,
        "upvote_ratio": 1.0
    },
    {
        "title": "Hello I’m bored asf",
        "author": "LindahDO5",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/1103xo9/hello_im_bored_asf/",
        "text": "",
        "created_utc": 1676166158,
        "upvote_ratio": 1.0
    },
    {
        "title": "mess around and find out im not the one: a personal story from today…",
        "author": "International-Cod553",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/1103s8k/mess_around_and_find_out_im_not_the_one_a/",
        "text": "so, about a month or two ago, a friend and i had bought concert tickets for june of this upcoming year. all was good and dandy. said friend bought the tickets, i had sent money for my half. long story short, she goes ghost about a week ago. i ask what’s wrong which she takes about a day to reply that she’s been angry about something i had said at the gym about 2 weeks ago. (not that i need to explain myself but i basically told her i was going to do a different split because the one she was doing wasn’t ideal for me with the job i have, not sure how that was to be taken personal?) anyway, I try to talk it out, she ignores me. i tell her send me my ticket if you’re not gonna say anything. THAT prompts a response. we go back and forth and i made her send me my ticket and bought her out of hers, then proceeded to block her on everything because she’s proven her true colors one too many times and quite frankly, i don’t have time for someone who can’t communicate. never think you are irreplaceable :)",
        "created_utc": 1676165696,
        "upvote_ratio": 1.0
    },
    {
        "title": "Help Me Get Revenge On My Brother's TOXIC Girlfriend",
        "author": "Emo_is_Lyfe",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/1100wvy/help_me_get_revenge_on_my_brothers_toxic/",
        "text": "[removed]",
        "created_utc": 1676157529,
        "upvote_ratio": 1.0
    },
    {
        "title": "The ‘CEO’ cleaner.",
        "author": "dunc180",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/10zydsj/the_ceo_cleaner/",
        "text": "[removed]",
        "created_utc": 1676150720,
        "upvote_ratio": 1.0
    },
    {
        "title": "Dirty uncooperative roommate",
        "author": "TheUniverseHasNoEdge",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/10zxs9t/dirty_uncooperative_roommate/",
        "text": "I’ve seen a lot of roommate posts recently so wanted to throw mine in here. \n\nI lived in a house of 6 guys and as you can imagine, it was a messy, messy house. The main problem other than the beard hair and bathrooms that only got cleaned once a year was dishes. We tried so many systems including wash as you use, dish bins and even dish day where you only had to wash dishes one day a week with Sundays rotating. By far the most successful was dish day. It would take you an hour and a half, but for some reason it’s the only one that worked. \n\nDuring the dish bin time period, everyone had a 1 ft by 1 ft plastic bin that would hold your used dishes until you had time to wash them. A lot of our house were engineers and the rest were social sciences so there was a big discrepancy in our amount of free time. To appease everyone you could hold some dishes in your bin if you had to run off to class and wash them later. \n\nLong story short, there was a roommate who was notoriously bad at washing his dishes in due time. Basically there was one time where about 7 or so days went by between him washing his dishes so the rest of the house got fed up. We tried talking to him several times over that time and he refused to do them because anytime he was called out, he would double down on his original position. One of those types of people. \n\nThere were hardly any dishes left in the house at this point so we needed to do something. We were taking dishes out of his bin and washing them just to be able to eat properly. After the 7ish days the rest of us got together and my idea was when he was out of the house we would take his overflowing bin and dump it in his bed. As you can imagine, it was quite disgusting. Week old eggs, fruit, ketchup, tomato sauce, and more. \n\nHe came home that night late and was absolutely livid, but I think he learned his lesson. Although we almost came to blows that night, he definitely washed his dishes more often. If you can’t respect the public space you don’t deserve your own private space to be clean. \n\nHour did we do, Reddit?",
        "created_utc": 1676149154,
        "upvote_ratio": 1.0
    },
    {
        "title": "Try to replace me? I’ll just leave you hanging then.",
        "author": "Realistic_Meeting_86",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/10zxd6y/try_to_replace_me_ill_just_leave_you_hanging_then/",
        "text": "I was just reminded of this story today because I ran into the person (antagonist) in this story:\n\nYears ago I worked at a business with many departments. The department I worked in had a lot of recent turnover and suddenly I became the most experienced person in that area. Being young and female, not a lot of people took me seriously but I was ready and willing to change their minds and excited to succeed. \n\nA few weeks in I catch word the company has sent someone who I considered a friend, let’s call them Shelby, from another department to another location to train for…..my position! \n\nI confront the manager, cry (because I’m young and very heartbroken they still aren’t taking me seriously) and begin formulating my plan.\n\nI found another company in the city that was hiring something similar. I had to do some studying and pass a test first though. \n\nDuring that time Shelby has come back, knows I know, and is utterly sorry for betraying me etc.etc. I barely talk to her. She eventually informs me she has decided to resign and I simply say, good luck (knowing I’ll be leaving soon after). \n\nFast forward a couple of weeks, I’m feeling confident in my studies and am ready to give my notice, but I wait, until the day after Shelby’s last day….ahhhh it felt so good to tell them I was leaving especially after the person who they were trying to replace me with was already gone. \n\nJust ran into the manager today and was glad to tell them I am now in the highest position of the company I went to work for after they failed to see my value.",
        "created_utc": 1676148040,
        "upvote_ratio": 1.0
    },
    {
        "title": "Steal detergent and get payback",
        "author": "Laurelartist51",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/10ztoas/steal_detergent_and_get_payback/",
        "text": "Many years ago I lived in a multi-family student housing cooperative. Laundry facilities were shared with roughly 24 families. Residents had always left their laundry detergent (powder in those days) in the laundry room and there were never issues. In the fall several new families moved in and one was clearly saving money by helping themselves to other people’s detergent. We were all broke but if they had asked we would certainly have helped them. But no one was sure who this was…just a guess that it was a new family. Finally by spring one woman was tired of buying detergent for them. She used a half empty box of detergent and sprinkled blue, black and green powdered fabric dye under the top layer.\nThe thief was caught within a few days although she insisted someone sabotaged “her” detergent. Her kids spent the summer outside in streaked grey play clothes and her husband went to every door and apologized for his wife.",
        "created_utc": 1676138508,
        "upvote_ratio": 1.0
    },
    {
        "title": "put an inconsiderate flatmate in her place",
        "author": "blue_butter_357",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/10zt9jr/put_an_inconsiderate_flatmate_in_her_place/",
        "text": "I have a flatmate in my student accom who's super inconsiderate and really noisy. She uses my dishes without asking and practices her singing until late at night. All the rest of my flatmates and I have told her to be quiet and actually contribute to chores consistently but she doesn't listen. \n\nToday she was singing extra loud so I decided to plan some revenge to make her feel pretty bad about herself. Since she wouldn't listen to any of us I wanted to make it seem like other people also had a problem with her.\n\nI wrote a note saying: \"to whoever lives in here that sings really loud, please stfu, you sound like a dog. People are trying to work\" and placed the note by our front door to make it seem like someone slid it under there (we live in a uni accomm block, for context). She was pretty butthurt when her friend found the note on their way out and read it aloud to her. Hope she learns her lesson.",
        "created_utc": 1676137446,
        "upvote_ratio": 1.0
    },
    {
        "title": "gunpowder cigarette",
        "author": "Legitimate_Tackle_87",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/10zsse0/gunpowder_cigarette/",
        "text": "[removed]",
        "created_utc": 1676136217,
        "upvote_ratio": 1.0
    },
    {
        "title": "She would be arrested today, but in 1971, I deserved this petty revenge.",
        "author": "SpaceLaserPilot",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/10zs9ht/she_would_be_arrested_today_but_in_1971_i/",
        "text": "I was a little shit to my sixth grade teacher in Catholic school.  It was her first year teaching, and I pushed her limits every day.  It was not my proudest year in school.\n\nOn the last day of school, I squirted her with a squirt gun.  Her eyes turned to violence, she grabbed me by the back of the neck, and she hissed, \"Come with me.\"\n\nShe marched me out of the classroom and down the hall.  I was terrified, thinking I was going to be taken to the principal's office, an old nun we all feared and called \"The Goose.\"  \n\nShe marched me right up to a drinking fountain, forced my head into it, and turned on the water.  She held my head there, soaking my hair thoroughly, then marched me back to class by the neck, still dripping.\n\nWhen she brought me into the classroom, my fellow students all laughed at me.\n\nI deserved it.",
        "created_utc": 1676134852,
        "upvote_ratio": 1.0
    },
    {
        "title": "Bully knocks holes in wall, gets $10 for shattered hand...",
        "author": "JeepHammer",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/10zqm8q/bully_knocks_holes_in_wall_gets_10_for_shattered/",
        "text": "This was SO long ago... in the very early 80s when video arcades were all the rage...\n\nMy cousin and I worked crappy jobs, decided to open a video arcade, rented a building, repainted the place, had signs made, all the things that cost money before you make money and were completely flat broke...\n\nOpened the arcade and had a lot of traffic, including the local bully and his minions, which completely turned the atmosphere sour when they showed up.\n\nThe bully eventually wanted to show dominance to us and punched a hole in the sheet rock wall. I was FUROUS and was ready to take him and his 'gang' on, my cousin on the other hand laughed, bet him $5 he couldn't do it again next to where the hole was...\n\nHe did it again, and my cousin gave him $5.\n\nAnother round of hitting the wall, another $5. The bully is $10 up and liking this money and attention.\n\nThen my cousin bet him once again he couldn't do it for $5 and the bully took him up on the bet. This old building had lousy sheet rock, brittle and easy to knock holes in, but it was built with rough sawed hardwood studs in the walls that had been drying into nearly steel in strength for 50 years...\n\nThe guy wound up a punch, let it fly, hit the wall stud and it wasn't sheet rock we heard breaking. With tears running down his face, holding his destroyed hand he took off so no one would see him break down with the pain...\n\nAbout a week later I saw him at the convenience store, a metal rack around his hand, several pins through his fingers/back of his hand, and it strapped up to his chest and ask him how he spent the $10. All I got was a lot of \"Frick Off\", and \"Just You Wait\"...\n\nBut it doesn't stop there... He had claimed his hand got caught in a business door and was threatening to sue that business for his medical bills when my cousin heard about it and informed the business of how the hand actually got damaged. With a little investigation members of his 'gang' rattes him out, he wound up paying his own medical bills, and was threatened with being charged with insurance fraud (don't know if it actually happened).\n\nLater he threatened to sue us, but the insurance company lawyer explained to him not only wasn't it an accident, but being a deliberate act he could be sued for damages to the building. He backed down.\n\nAbout two years after that he got his teeth knocked out in a fight, then tried to claim they got knocked out at his job, but someone informed the company what actually happened. He was fired, and they didn't pay for the teeth. Years later I found out it was my cousin that informed his workplace. \n\nWhat reminded me of this? I just saw him 40+ years later in life (in my 60s now), complaining about the arthritis in his hand and talking with a lisp from the still missing teeth. \n\nApparently he doesn't remember I was co-owner of the arcade and was 4 feet away when he totaled his hand, tried to pass it off as a workplace injury where he \"got screwed out of disability\"... But bragging he screwed the hospital out of the bill...\n\n... Or remember that it cost us about $200 to replace the sheet rock and repaint the wall. $200 we really couldn't afford at the time... (well, $210 if you count the $10 in bully bets! 😉)\n\nMoral, don't be a bully A-hole, it will follow you for life...",
        "created_utc": 1676130770,
        "upvote_ratio": 1.0
    },
    {
        "title": "Spam this person send infected emails calls texts help me out here guys",
        "author": "Heavy-Play",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/10zjj44/spam_this_person_send_infected_emails_calls_texts/",
        "text": "[removed]",
        "created_utc": 1676112823,
        "upvote_ratio": 1.0
    },
    {
        "title": "I was told I smell, so I made him smell",
        "author": "Delicious_Ad_9982",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/10zgrv9/i_was_told_i_smell_so_i_made_him_smell/",
        "text": "About 10 years ago, I still went to school. Everything was fine except this guy that didn't like me. He would always sit on my back and make some nasty comments about something that always smells so bad. I already thought he meant me me by that, but I simply ignored it since I was used to bullying at school. If I really would smell this bad he would come to me in private and tell that in a nice manner instead of letting the whole class know. Or take a seat somewhere else. Or someone from the class would tell me. Ironically he would always make these disgusting sounds where he coughs out his slime and swell it again (yikes!) \n\nI never had a problem with anyone ese from this class except him. And after having been bullied in all the school stages before, and finally being happy that I was finally put in a class that where nice to me and showed respect to each other, there had of course to be that ONE cockroach that had to destroy this happiness for me. And of course in one of those classes we had a teacher that was so old-fashioned that she would only look one side of the story and immediately blame the other person not her favorite Randall that gets a compliment from her everytime he somehow managed to uses his brain for a couple of second answering some questions. \n\nSo it was a normal day, we had our class finished and the teacher suddenly drags me to her and tells me how she observed that this guy always \"hints\" about me smelling bad and of course she must assume that this was the only true answer to that problem and this was totally just my fault. and that I should shower more and wear more perfume/deo. I kind of laughed it of, I take a shower every morning before I go to school and on the evening, I shave my armpits regularly and use a deodorant. My family and friends never told me I smell bad, and I literally asked the teacher right there and then if I smell bad right. She denied it and told me that it wasn't today but all the other days. I asked a friend from my class and she told me I didn't smell sweaty.\n\nBut yeah I could just mind my own business and ignore it, but I thought the best thing after months of stupid comments and slime coughing terror I could take some petty revenge. \n\nThe next day I bought with me LOTS of perfumes and deodorant. On every class he sits beside me so I covered myself in perfume before, in the middle and after class. I did this more especially when that old fashioned bitch ass teacher had classes just to annoy the shit out of her too. When he commented I smell bad, I simply put out the deodorant and sprayed it around my and his desk. He shut up pretty fast and moved his seat somewhere else but this doesn't stop here. When he moved hos seat somewhere else I would sit on his back and of course spray some deodorant at a random time. When he coughed out his slime I would either imitate him or I would comment something along the line :\"sounds like someone is chocking/dying of his own cough right now\" or \"sounds like someone in class needs to see a doctor, that coughing does not sound good\" \n\n\nOf course my teacher told me to stop since it smelled too good in class, but I still continued. She told me to stop with these comments but I told her he did the same and that was totally ok for here. So that implied that I am allowed to say nasty comments too. I told her he bullied me for 6 months now with his shitty bitch ass comments so he gets 6 months back from me. I told her one of us could switch classes but that would be to much work for someone that has her retirement long overdue. The class thought it may have been a little childish but they didn't seem annoyed. \n\n\n\nIn third year i stopped with it and we ignored each other. I guess he learned his lesson.",
        "created_utc": 1676106604,
        "upvote_ratio": 1.0
    },
    {
        "title": "We will secure our shipment",
        "author": "thebakerWeld",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/10zd8ef/we_will_secure_our_shipment/",
        "text": "So I am working on a big project and we were asked to ship something back to the team that designed it. We built a crate and shipped it off. Well there are obvious design flaws that cause it to break in a specific way all the time. While it was shipped it broke in this specific way and when it arrived we got an earful about how we didn't secure it properly; even when we explained this is normal they weren't having it. WELL they wanted another one shipped back to them, so we grabbed every 2x4 we had and every screw we had and secured it by stripping every screw we put in. We never got a complaint since.",
        "created_utc": 1676093390,
        "upvote_ratio": 1.0
    },
    {
        "title": "Lil Sis Monopolizes the Phone, Pays the Price",
        "author": "tallgirlinVA",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/10zd413/lil_sis_monopolizes_the_phone_pays_the_price/",
        "text": "This goes back to when I was like 19. So we had two phone lines in my house - one for my mother and one shared between me and my sis. And we both had cordless phones (yes it was the 90s). But here's the thing. My absolute terror of a **15-year-old younger sister who** was always on the phone**,** used to sometimes pick up  while I was on the line with a friend and TELL ME to get off the phone!  While I was in mid conversation!\n\nAnd I was by no means a phone hog either, okay??!!\n\nShe did it more than once, and it wasn't the only thing she did. Like stealing my clothes, instance. One day I'd had enough, and in the most passive aggressive petty revenge one could have, I left to spend the weekend at my girlfriend's house who lived a couple of miles away. My mother was away on a trip so it was my chance. I made sure both cordless phones were in my bedroom. Which had a key lock which I made absolute sure to lock.\n\nAnd I stayed away from Friday night until Sunday afternoon. As an older adult looking back, I suppose it probably was unsafe to some degree - with her having no phone whatsoever and no way to drive but at the time...I DIDN'T CARE!!!!\n\nWhen I returned she was like OMG you accidentally locked the phones away! It may seem minor but for a phone freak like her, it was the ultimate revenge and she damn well deserved it! We get along now, mostly.",
        "created_utc": 1676092950,
        "upvote_ratio": 1.0
    },
    {
        "title": "You’d prefer crappy hip hop over quiet hours? OKAY!! You GOT it…coming *right up*… (;",
        "author": "No-Shelter-7753",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/10zd224/youd_prefer_crappy_hip_hop_over_quiet_hours_okay/",
        "text": "Okay. So this one neighbor who recently moved in, continues to not respect quiet hours in our lease. \n\nI’m not a Karen, but they literally will park right in front of 24 different apartments between two buildings, and any time between 11pm through 7am, they blast their music as loud as their Honda Civic can manage when they pull into their spot and sit there. \n\nDisclaimer: We do have TONS of always open parking spots down the street, 150m to 200m away, where there is no housing because the dog park and pool are right there instead. \n\nIt happens to be hip hop they’re blasting, so the sound REALLY carries. \n\nExcept…….they have TRASH, super basic  taste in hip hop 😅😬 ….I haven’t heard a *single* Wu-Tang jam…no TroyBoi, no Gorillaz, no Jack Harlow, no Eminem (!!??), no Snoop Dogg, no Desiigner, no Cypress Hill, no Sublime, no Joyner Lewis, no Watsky, no 50cent, no Queen Herby, no Mac Miller even!! Literally nothing good. \n\nSo this has been happening for a year about and I’m tired of being woken up to *bad* hip hop bumping. \n\nEspecially since it’s bad music, it’s just this ambiguous and unpleasant “thump thump thumpppp. Thump thump. Thump thump thumppp. Thump thump.” \n\nBut it literally vibrates the buildings bc the buildings are poor quality. \n\nThe other night I had an idea.\n\nWorking with horses is what made me think of this. It’s called Parelli Horsemanship and I am certified/fully trained in it. \n\n[[ Explanation/example of one situation: For a horse that runs from a halter, you remove all the other horses from the corral, and you make that horse run. You are not actually whipping or hurting them, don’t worry! And the horse runs *round and round and round the corral* at a good run, *while you tell it to by wiggling a carrot stick whip or a quick pop if they don’t move*,and the *exact second* the horse turns towards you, or comes towards you, stop with the carrot stick whip and drop it to the ground. Your horse should lick their lips, signaling they learned what you were teaching, then they will walk up to you on their own. “\n\nIt’s sort of malicious compliance…”You’d like to run around the corral today instead of being haltered and groomed?? OKAY!! (: Go on then!! *flick of the hand holding the carrot stick*” \n\nHere’s where it all mixes…And I fully realize I may be an asshole for this. But I’m hoping it’ll make them stop it. If it doesn’t make them jam out in the neighborhood I’m general and not a parking spot by housing, I’m not going to keep doing it. I have done this twice. \n\nHere’s what I’ve been doing. \n\nAnytime this person blasts their music at 11pm through 4/5/6/7am, I have been manually tuning on my car alarm to blast louder than their bad hip hop music. \n\nIt ruins their jam and it’s basically the same bbbbbbb bbbbbbb bbbbbbb sound, just not on beat with their music. Their music turns off within one minute each time. Lol \n\nAnd all I have to say as a totally valid explanation is “well they were blasting music so loud it was vibrating my building, and my car’s security system is sensitive, so the alarm probably was triggered by the vibrations from the stereo. I turn it off as quick as I can! You know though, it’s happening when normal people are asleep, so I have to wake up and get to my keys…” \n\nI am ashamed to admit I smiled a bit when it worked the second time. Lol One more try and hopefully they jam (safely) while moving through the neighborhood, but give up on the music when they turn onto the street we live on, to park.",
        "created_utc": 1676092770,
        "upvote_ratio": 1.0
    },
    {
        "title": "Small bathroom victory",
        "author": "bluberried",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/10zciix/small_bathroom_victory/",
        "text": "[removed]",
        "created_utc": 1676090987,
        "upvote_ratio": 1.0
    },
    {
        "title": "stole my date",
        "author": "Left-Action-3442",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/10z6k8c/stole_my_date/",
        "text": "[removed]",
        "created_utc": 1676072716,
        "upvote_ratio": 1.0
    },
    {
        "title": "oh no where’s your reputation?",
        "author": "lunarxysm",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/10z4cfr/oh_no_wheres_your_reputation/",
        "text": "[removed]",
        "created_utc": 1676066534,
        "upvote_ratio": 1.0
    },
    {
        "title": "stepdad made fun of my career choice and mom is pissed",
        "author": "EdgyEmoKid5503",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/10z3e9w/stepdad_made_fun_of_my_career_choice_and_mom_is/",
        "text": "[removed]",
        "created_utc": 1676063986,
        "upvote_ratio": 1.0
    },
    {
        "title": "Petty Porsche Revenge",
        "author": "Kibbles35",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/10z2vfg/petty_porsche_revenge/",
        "text": "In a past life I used to be a chiropractor (BGT - Before a Garbage Truck hit me... another story).  I sub-rented office space from an established doctor, Dr. N.  Turns out Dr. N was an obsessive-neurotic narcissist who liked to dominate people - a total control freak.  He pretended to be a nice, friendly boss, but actually he was quite cruel, and not the person he *pretended* to be.\n\nA couple points relevant to the revenge.  He was obsessed with the Holocaust. He would buy the most detailed and graphic historical books and read them over and over, and then would rant about the injustice of the German government.  He was smart enough not to do this with his patients, but since I was there a lot I heard it all the time.\n\nHe was also an avid street racer.  He owned 2 or 3 Porsches and would drive them through the winding and narrow roads up into the hills.  It was not uncommon for him to hit well over 100 mph on roads where 45 was dangerous (he bragged a lot).  People died on these roads all the time  (mostly cyclists and motorcyclists hit by cars racing the turns), but he couldn't care less. He was obsessed with his cars as much as he was by the Holocaust.\n\nMy petty revenge happened at a professional development conference.  I was sitting next to him and his wife (also a chiro) and a handful of other chiros.  Dr. N, as usual would not stop talking and eventually his monologue looped back to the Holocaust and then onto how the German government today is \"just as evil as it was during the Holocaust\".  He ended his rant by saying,\n\n\"But what can you do about it?\"\n\nI looked right in the eyes and totally deadpanned, \"Well... I would start by not buying any more of their cars.\"\n\nHis wife burst out laughing so hard I thought she might fall out of her chair.  His face turned bright red, and for **one of the few times ever**.... ***he had nothing to say.***  Literally, he gagged trying to say **anything** but could not get out a single words for almost a minute.  After that he stopped talking about the holocaust and Porsches to me - which was fine with me :)",
        "created_utc": 1676062708,
        "upvote_ratio": 1.0
    },
    {
        "title": "I don’t know what to do anymore.",
        "author": "James4_40",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/10z2d7y/i_dont_know_what_to_do_anymore/",
        "text": "[removed]",
        "created_utc": 1676061485,
        "upvote_ratio": 1.0
    },
    {
        "title": "Builder doesn't want to pay his bill, ends up losing over $1000.",
        "author": "BandiTToZ",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/10z25ft/builder_doesnt_want_to_pay_his_bill_ends_up/",
        "text": "I use to work for my family's plumbing contracting business. It was decent sized company doing about 200-400 homes per year across subdivisions and custom homes, as well as some commercial and hydronics work.\n\nMy role was pretty broad but my main ones were purchasing, scheduling, dealing with customers, quoting and writing contracts .  Basically an office type job with some occasional trips outside to job sites.\n\nThis one custom home builder was a bit of a pain in the ass. Changing schedules last minute, wanting to make changes without paying,  disorganized, and just gave me an impression that he would screw you over if he could to save a buck.\n\nThe project we were hired to do kind of went into limbo and he ghosted me for over 6 months while owing our company about $1500.00 that had not yet been paid. He calls me up out of the blue and asks if I can complete the job for him. We had completed the rough in drainage work and the water pipe, the house needed tubs installed and the rough in inspection completed and passed.\n\nThis guy had already given me a skeevy vibe so I told him I will complete the work only after I had been paid to which he agreed to and said he would have the money in hand when my workers arrived on site. He agreed to the amout owing as well but I could tell something was off. He was agreeing but being very vague when I was giving him my terms, using terms like \"yeah\" \"uh-huh\" when trying to iron out details for the job. I had been doing this for nearly 20 years so I could spot a crooked builder pretty easily by that point.\n\nCue the petty revenge... \n\nSince I had been already ghosted and burned by this guy. I had written the $1500 off since I hadn't heard from him in over 6 months as well as the fact that even though he owed me $1500, I owed him 3 tubs that totalled over $2500 before taxes not including the work we needed to complete. I called my supplier to check stock and asked if I could return them without a restocking fee as I think this builder may try to not pay me. They agreed and said it wouldn't be an issue as long as the tubs remained in their original boxes, as these tubs were all regular movers for them.\n\nI ordered the tubs and called the builder back to schedule the work for later that week. I reminded him that I will only start work once I had been paid as well as the amount owed. He responded with a vague yet curt, \"uh-huh.\" I told him to have cash or a certified cheque ready for my workers when they arrive on site which again I got another vague acceptance from him. \n\nThe day arrives to do the work. My workers arrive there a little before 8am. Jobsite is locked up and nobody is around. I call the builder and he tells me his wife will be there in 15 minutes to let my workers in. I remind him to make sure she has our payment. He responds with another vague, \"ya, uh-huh.\" \n\nShe finally shows up an hour later and surprise! No payment! No cash, no cheque, not even an apology for making my guys wait for her for over an hour. Since I had expected this I made sure to have another job nearby lined up so the work day would not be wasted. I told my guys to pack up and leave for the other job. \n\nI called the builder back and asked him why he didn't have payment ready. He starts making all kinds of excuses,  saying it's too much, blah, blah blah! I told him the time to bring that up was a few days ago when we agreed to everything not when my guys were about to start the work. To which he responded, \"I'm not paying that!\" I said, \"Ok, then lose my number asshole!\" Then I hung up the phone, called my supplier and scheduled the tubs for pick up.\n\nI don't know if he thought I was naive,  stupid or just so desperate for work that I would cave and work for free. Either way, his greed cost him well over $1000 in material alone, not to mention the labour for finishing the job. \n\nTLDR:  Crooked builder tried to get my company to work for free on a job we actually owed him more than he owed our company. I saved my company well over $1000 by not falling for his bullshit and not starting work until we got paid.",
        "created_utc": 1676060973,
        "upvote_ratio": 1.0
    },
    {
        "title": "Builder doesn't want to pay his bill, ends up losing over $1000.",
        "author": "[deleted]",
        "url": "",
        "text": "[removed]",
        "created_utc": 1676057459,
        "upvote_ratio": 1.0
    },
    {
        "title": "This community sucks people’s here ain’t talking to new people",
        "author": "angelisa_horny_girl",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/10yzcc2/this_community_sucks_peoples_here_aint_talking_to/",
        "text": "",
        "created_utc": 1676054335,
        "upvote_ratio": 1.0
    },
    {
        "title": "Necessary antibiotic to treat a gut infection: $2,169.56. Learning that Blue Shield of California is petty as fuck and I will never do business with them again: PRICELESS",
        "author": "StarStuffApplePie",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/10yyop5/necessary_antibiotic_to_treat_a_gut_infection/",
        "text": "The timing couldn’t be better. Blue Shield of California decided to push their micro-denials strategy on me, two weeks before open enrollment. \n\nIt was an antibiotic prescription for a gut infection. It was a one time cost for two weeks. I have paid over $30k in out of pocket medical costs in 2022. My husband and his employer have paid Blue Shield of California $33,000 in 2022. They cover almost nothing. Never. Even the gut tests I took were out of pocket. Brilliant accountants they have over there. That C-suite deserves their bonuses. They can choke on it. \n\nDoesn’t matter, I’m not mad. I’m happy to never do business with them again. Even if I die soon, my husband and daughter will likely live a long time. We are happy to spend money with another company. \n\nI’m just so happy to see their true colors now versus later.",
        "created_utc": 1676052731,
        "upvote_ratio": 1.0
    },
    {
        "title": "Please stop turning off the heat",
        "author": "otakuchips",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/10yy15e/please_stop_turning_off_the_heat/",
        "text": "Just read the freezing out the coworker post and reminded me of my own freezing revenge. \n\nThis happened back in college when I rented a house with 2 other girls. \n\nOne of the girls ran hot and her room got the most heat based on how the ducts worked (We'll call her Girl A). I kept the thermostat at 72 degrees during the winter because my room ran cold and got the least amount of heat. (I'm using I because my previous roommate moved out and didn't care about the temp so I was the one setting it. The other girl living with us, whom we can call Girl B, didn't care.) I already wore a sweater and socks to bed to counter this.\n\nSo instead of discussing turning down the temp, or just straight up turning down the temp, Girl A started turning off the heat entirely when she went to bed at 3am (I know it's her bc I was still awake). I get up at 9am and every morning it was FREEZING. I shoot the roommate group chat a message like \"hey, please stop turning off the heat at night it is freezing cold in the morning.\" Got some \"ok\" replies, life went on. \n\nBut she kept doing it. And every morning I get up freezing, turn on the heat, make breakfast and hightail it out of there. I started wearing 4 layers to bed. But since I turned on the heat in the morning, she wakes up nice and cozy at 1 when I come back for lunch. \n\nSo one day during finals week, I was planning to do some last minute cramming at the library at 5am. Girl B was at her boyfriend's so Girl A was home alone. So when I left that morning at 5am, I simply did not turn the heat back on. Went to the library, studied, took my final, and lo &amp; behold, after my final Girl A had messaged the group chat \n\nGirl A: \"Hey I think we need to talk about the heat. It was freezing this morning\" \n\nMe in my head: You Don't Say Meme\n\nMe in chat: \"Yes, that's what I've been saying. I don't think you should turn off the heat entirely.\"\n\nGirl A: \"Yeah I only do it because my room is really hot and I don't want to pay too much for utilities\"\n\nMe: \"I think that turning it off and turning it back on again makes the heat work harder (Although I'm just pulling that out of my ass at this point) and can make the pipe burst which we would be responsible for. Please just turn down the heat from now on\"\n\nGirl A: \"Okay I will try\"\n\nThe rest of the year I kept it at a nice 70 which she turns down to 67 when she goes to bed.",
        "created_utc": 1676051105,
        "upvote_ratio": 1.0
    },
    {
        "title": "Who’s in my bed?",
        "author": "AdMaleficent503",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/10yxkjj/whos_in_my_bed/",
        "text": "[removed]",
        "created_utc": 1676049908,
        "upvote_ratio": 1.0
    },
    {
        "title": "warzone is out!!!",
        "author": "AdMaleficent503",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/10yxi1q/warzone_is_out/",
        "text": "[removed]",
        "created_utc": 1676049713,
        "upvote_ratio": 1.0
    },
    {
        "title": "hey guys👋",
        "author": "AdMaleficent503",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/10yxevn/hey_guys/",
        "text": "[removed]",
        "created_utc": 1676049486,
        "upvote_ratio": 1.0
    },
    {
        "title": "You make me freeze? I make you freeze!",
        "author": "TheBestOpossum",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/10yt8wm/you_make_me_freeze_i_make_you_freeze/",
        "text": "It's currently ranging between 0°C and about -5°C where I live. Despite this not exactly t-shirt weather, I have a colleague who constantly cracks open windows in random rooms at work and leaves. She does in the loo, in the office kitchen, in the meeting room, everywhere. She only works half a day, so she doesn't have to suffer the cold herself- she opens the windows, then takes off a few hours later and someone else (often me) then comes into a room where your breath makes little clouds and has to deal with it. And of course, when she comes back next morning, all the rooms will be nice&amp;cozy again and she can restart her little mission to freeze us to our desks.\n\nI have tried to talk to her, of course. Asked her to close the windows she opened after a few minutes, explained to her how unpleasant it is to be afraid that your teeth will chip from chattering while you wait for your tea water to cook. To no avail. Her answer is usually something along \"I usually close the windows, of course. If I occasionally forget, then please do me a favour and close it yourself and just turn up the heater a bit\".\n\nSince to me this problem isn't worth the hassle to take it to our boss, I just went around closing her damn windows every day, even specifically making grounds for that.\n\nUntil this week.\n\nSee, her and I usually don't have 1:1 meetings due to our work being pretty different, and any bigger meetings are over video calls in our company. But this week we did have something to talk about and agreed to meet wednesday at 08:30. At meeting time, she came knocking and expected to come into my office, but I share it with a coworker and told her that the coworker needed quiet time and that the meeting room was empty.\n\nAt this point you can probably guess that when making my window-closing rounds the day before, I left the meeting room alone. You can also probably guess that I made sure to wear some extra warm clothes to work that day. And you don't even need to guess that I made sure the meeting took longer than necessary (about 15 minutes) and that I was ignoring her signs of growing discomfort while I noticeably dragged my feet.\n\n\"Oh no, not necessary to send me an e-mail, just tell me and I'll write it down right now. No, really, writing it down helps me think. Wait, this pen is garbage, I'll get a new one. Didn't they use to have those good black pens just a few months ago? Haven't seen them since, but maybe one of them got forgotten in one of these drawers here.... ah, no, that's a disappointment. Well nevermind, I'll just take one of these. Maybe after our meeting, I'll ask the front office if they have more. Anyway, please continue!\"",
        "created_utc": 1676039010,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can't Store That Here? No Problem!!",
        "author": "oblivious_ghost",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/10yt5vj/cant_store_that_here_no_problem/",
        "text": "[removed]",
        "created_utc": 1676038791,
        "upvote_ratio": 1.0
    },
    {
        "title": "Sure.... I'll resign; but first let me arrange a meeting",
        "author": "Impressive-Raisin189",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/10yom8d/sure_ill_resign_but_first_let_me_arrange_a_meeting/",
        "text": "It's my first time posting here, English is not my first language and I'm not sure if this belongs in this sub.\n\nThis happened in a time span of 1 year around 8 years ago, things could be off but the main event remains vivid in my mind. \nFor this story: hr in our office will be Susan (because apparently we don't like Susan's), lazy assistant AH will be LAH, LAH direct boss will be Tom...(other characters will come in play but they won't be so relevant for the outcome) it's a long story but I'll try my best to summarize it.\n\nI was fresh out of college (22-23f), and looking for a job in my field of expertise (law); one day my bf Patricia and I go to this huge governmental office to submit out cvs to their work bank, to our luck Susan appears like an angel and took our cvs, went on interviews and we both got hired.\nWhile Patricia started with a better position as an assistant to one of the big dogs, I was stucked doing this boring job of receiving and distributing files sitting in an office with Susan and someone else, but it only lasted one month because soon I was working at the front desk with the boss from that office acting as his hands right and....HAD A NEW AND BETTER CONTRACT, this is when sht start to bend. \n\nApparently Susan made a mistake when making the contract from LAH and gave him the position from my new contract, so to avoid creating chaos she gave me his position (not an issue at first); see his position earned a bit more than mine and LAH was a pain in the butt because he disappeared from the building, locked his files (so I couldn't provide people information about things handled in his office unless I called his boss office), His digital cards where not updated.... The guy made my work more difficult but I enjoyed throwing him out of the bus.\n\nOne day Susan and LAH approached me to tell me I needed to resign from my position so LAH could get his (earn more and do nothing) and I could get mine (do everything and earn less), I said I would, but after dealing with him for so long I was reconsidering; until this 2 decided to hunt me, try to make my life miserable by putting others against me. I was done with them but being young with the most innocent face, you wouldn't think I was plotting against you. So the last day Susan warned me about resigning came.... PETTY REVENGE TIMEEEEEE!\n\nI worked at the front desk so no one was suspicious if I was gone from my position because sometimes I needed to get files, talk to people, gather info....I put over my shoulder lots of responsibilities, so after Susan's last tirade I waltzed into LAH bosses office and directly said I needed to speak to Tom, and it went like this:\n\n-OP: hey Tom I'm having and issue with LAH and Susan; they tell me I need to resign from my position so it can be given to him, but that's not the issue, the issue is that LAH is not doing his job... (Before I could continue)\n\n*Tom: I know, I also have issues with LAH, my work is behind, everything is a mess and my assistants complain about him...give me a sec...going to call big dog A(biggest dog from that area) and big dog B.....\n\nTom calls both of them and what seemed small at first turned into the biggest fk u meeting from that year 😂\n\n*Tom: ok they are coming but I also want Susan in here.\n\n15 mins and Tom's office is full with tension, 3 angry big dogs, an impressed OP and a not so smuggy and scared Susan.\n\n*Tom: OP came here and said that she is required by Susan to resign...(wild Susan tries to interrupt) so big dogs, after I filled you in with the tea, what are your insights?\n\n+Big dog B: we are proud that OP said something, but Susan, you have been working here for 15 years, I had mad respect for you but now I'm disappointed. What happened?\n\n-Susan: I made a mistake with the positions and as LAH is Tom's assistant he should have OP's contract and vice versa. OP said she agreed to the switch.\n\n*Tom: ofcourse OP would agree, you are terrorizing her, she is afraid of 2 older people plotting against her. And as I know everything that happens at the main desks office; LAH and OP will keep contracts as they are because LAH is not fulfilling his responsibilities and you made a mistake, not OP...thank you everyone, you may leave....NINAAA (his secretary) call LAH, I want him here NOW!\n\nand off we left to a land of dirty looks, 3 people from the 30 that worked at main desk not talking to me, reputations lost, and a happy OP left alone at last having her first victory in that mined field.\n\nI resigned a couple of months later after someone from the same building went into my office saying her boss wanted to interview me that same day (I went, we spoke and I was instantly hired, but I lasted 1 month because someone else in the same building offered me a better position with the biggest dogs in the country). \n\nI have a couple of stories about that hell hole.",
        "created_utc": 1676025193,
        "upvote_ratio": 1.0
    },
    {
        "title": "Nurse stiffs DoorDash driver, gets arrested",
        "author": "Tonguetied23",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/10ykpy3/nurse_stiffs_doordash_driver_gets_arrested/",
        "text": "This occurred in September, last year. \nI was making a routine lunch delivery to the hospital nearby. The customer didn't provide any delivery instructions other than to call when I arrived. \n\nI called and called.  No reply. Waited and waited.\nIn that instance,  we leave the food in a safe place,  in this case at the admissions desk, and notify the customer. \n\nAbout 5 minutes later,  I started getting furious texts from this person.  \"Where's my food? I told you where to bring it, you goddamn moron, not to leave it there! This is all your fault! You're a f**king idiot\"\n\nI apologize profusely despite her incessant lies that she said where to leave it. And her swearing at me.\nFive minutes go by and I get notified that she claims she never received the food and left a negative rating. \n\nSo I contacted support to address the rating and since I was nearby,  returned to the delivery location to find out what happened to the order.\n\nWhen I arrive, the admissions desk personnel tell me  this individual came down in a huff cussing and took the food and it's on camera. \n\nDoor dash is on with the customer who is texting that someone stole it and she refuses to pay for it.\nI knew that the order name was Russian, unusual. \n\nDoor dash says if I can verify it was received,  they will remove the rating.\nAdmissions people notify an Admin to come talk to me. \n\nThe admin contacts hospital security who speaks to me, then decides to go ask the nurse to pay for the order. They talked to her, she refused.\nThey said that they might be forced to notify the police and she said,  \"go ahead\" to hospital security!!!!\n\nAnywho, the police are contacted,  I file a brief statement for theft of services and a female detective reached out to me a few weeks later. I said,  \"Do you really think it's worth pursuing such a small amount?\" and she reminded me of her vindictive texts and how she was offered multiple opportunities to avoid charges and she refused. She literally came after me. Hard.\n\nMy mind was instantly made up.\n\nThe detective said she would go to her house first but if she wasn't home,  she'd arrest her at the hospital. \nIt was misdemeanor fraud and something else.\n\nThen months went by. Heard nothing back.\nThen got an email from the court on Tuesday asking for my address where to send the check for restitution and she pled guilty.",
        "created_utc": 1676017733,
        "upvote_ratio": 1.0
    },
    {
        "title": "Tailgate, then want to race?",
        "author": "tbakerweb",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/10ykgx1/tailgate_then_want_to_race/",
        "text": "[removed]",
        "created_utc": 1676017244,
        "upvote_ratio": 1.0
    },
    {
        "title": "My ex best friend took it too far",
        "author": "Breezygirl2020",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/10yjhlx/my_ex_best_friend_took_it_too_far/",
        "text": "[removed]",
        "created_utc": 1676015155,
        "upvote_ratio": 1.0
    },
    {
        "title": "Try to blame us for YOU using all your own hot water? okay no hot water next time!",
        "author": "DearBanana2532",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/10ygj91/try_to_blame_us_for_you_using_all_your_own_hot/",
        "text": "We used to live in a duplex with a total asshole neighbor upstairs. They harassed us daily in the worst way for months, classic shitty neighbor stuff with extra sprinkled on top. Suddenly they started running their bath faucet for \\*hours\\* on end every day.  One day we found out they had been complaining their hot water \"kept getting used up\" and blamed us for \"doing too much laundry\". Manager must have blown these off for a while because they knew we didn't share a hot water heater just a water bill. Her complaining got so bad they started asking us to check her heater temp. which we did and it was fine. \n\n&amp;#x200B;\n\nAfter this went on for over a week i noticed a pattern. After running the faucet all day, she'd turn it off for 20 mins or so, turn it back on and for an hour or so, with no stomping upstairs. So we figured, that must be when she takes a shower. \n\n&amp;#x200B;\n\nThe next day same thing, hours of running water, then shut off. This time we went and turned the water heater to luke warm, not off, but down. Within 5 minutes she was stomping up a storm and could be heard yelling upstairs, screaming at the manger we \"used all the hot water again\". FINALLY this is when the manager informed her it was impossible for us to use all her hot water because \\*she had her own hot water tank\\*!!!! MORE stomping happens and she i having a fit. They tell her they will send Maintenace out the next day while she's at work. The next morning when we wake up, we just put her heater back to normal. \n\n&amp;#x200B;\n\nMaintenance came, ran her hot water for almost an hour without it running out. We had a good laugh about how she just used it all taking a too long shower. She never ran the water that long again too and got kicked out a few months later for harassment. Have other stories but not sure if they are actually \"revenge\"!",
        "created_utc": 1676004512,
        "upvote_ratio": 1.0
    },
    {
        "title": "Prank Vday",
        "author": "EsotericW",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/10yfudf/prank_vday/",
        "text": "[removed]",
        "created_utc": 1676002240,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to get petty revenge on a daycare operating in my building?",
        "author": "Accurate_Insect1272",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/10y9qfo/how_to_get_petty_revenge_on_a_daycare_operating/",
        "text": "[removed]",
        "created_utc": 1675985113,
        "upvote_ratio": 1.0
    },
    {
        "title": "Woman road rages against me. Gets arrested during Christmas",
        "author": "Al1G8R5",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/10y95g2/woman_road_rages_against_me_gets_arrested_during/",
        "text": "This happened in early December last year.\n\nI’m driving home from school one afternoon, and I accidentally cut off a lady in a bigass Suburban. I quickly got back into my original lane and waved an apology after she honked at me. I was a bit tired, so I missed her in my blind spot. I thought that would be the end of it, but boy was I wrong. My one careless move triggered a series of road rage incidents from her that I never thought anyone would be capable of resorting to.\n\nFirst, this woman speeds around me and aggressively cuts me off and brake checks me VERY hard. Mind you, the speed limit was 45 mph, and I was already doing 50 mph. She had to be passing me at no less than 70 mph. I gave her some room in case she brake checks me again, which she did, bringing our whole lane down to 15 mph all while flipping me off outside her window. I have a dashcam, so even if I hit her, I could’ve taken the insurance payout, but dealing with insurance is too much of a hassle, and I love my car, so I didn’t want to damage it.\n\nOther cars start passing us, so I try to do the same, but she dives in front of me again. Eventually, she lets me pass and I wave her sorry again, which she responds to with the finger. Finally, we stop at a red light, and she pulls alongside me yelling at me to “roll down your fucking window you n-word (I’m not even black)” Of course, I don’t in case she pulls something out on me. \n\nOther cars are honking at her for blocking my adjacent lane while yelling at me, but she gives zero shits. Once the light turns green, I make a loop around the block to try and lose her but to no avail. I even haul ass down an open road to see if she gives up. My car is heavily modded so it can comfortably smoke her SUV, but she persists. I’m thinking, “What kind of person has this much time on a weekday to follow someone around?” Had I driven home, she could’ve come back later and did god knows what. So finally, I resort to calling the cops. \n\nUnfortunately, I’m right at the boundary of three counties, so I get bounced around dispatchers for about 5 minutes before finally ending up with the right jurisdiction. I explain my situation, and the dispatcher directs me to drive toward the nearest police precinct while an officer tries to intercept us.\n\nDuring the conversation with the dispatcher, she is still flipping me off, and the dispatcher can hear her honking… that’s how close she was tailgating me. It’s been over 30 minutes since the original incident. Seriously, who the f\\*ck has this much time? I stay calm and continue to relay to the dispatcher where I am as I pass intersections. \n\nFinally, after what felt like an eternity, I saw a Dodge Charger speeding up behind us. I couldn’t tell if it was a patrol car as it appeared to be an undercover vehicle. No blues and reds yet, so I confirmed with the dispatcher if there was an officer behind us. It was! Once I saw the lights come on, I pulled over and she promptly followed.\n\nAs I parked in some church lot, this fatass dove out of her car, and only THEN, she notices the Christmas Tree of lights behind us. The look on her face was PRICELESS. And what does this dumbass do? She darts towards the officer’s car. The officer quickly commanded her to stop, which this bag of meat seemed to understand. Not long after, his corporal and another officer arrived.\n\nNow, I’m still sitting in my car waiting for the officer to come to me. I hear the bitch making up some bullshit story, and in a few minutes, he comes up to my window to hear my side. The moment I stepped out of my car to talk to him, she yells at me “you fucking suck at driving!” This was retaliated by the officer yelling at the woman. I told him my side, and about all the brake checking and racial slurs, and she obviously denied it. The instant when I mentioned that it was all on dashcam, her face went pale.\n\nThe officer saw all the brake checks, excessive speed, and tailgating once I pulled up the footage on my phone, and he then asked me if I wanted to press charges. Of course I did! They searched her SUV and found an unregistered Glock underneath the driver’s seat, AND a tiny bag of weed (which isn’t legal in my state). This woman got arrested for reckless driving, endangerment, possession of marijuana, and a couple of other things! I was just told to drive carefully with no ticket!",
        "created_utc": 1675983708,
        "upvote_ratio": 1.0
    },
    {
        "title": "We drove a mean nurse nuts with googly eyes",
        "author": "Putrid_Ad695",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/10y8ntq/we_drove_a_mean_nurse_nuts_with_googly_eyes/",
        "text": "Before I go into why this specific nurse in my psychiatric hospital deserved the googly eyes, I should mention that this woman is an exception and the people working in psych hospitals are generally great people. Psych hospitals (at least in countries with well-funded healthcare) are a great resource to get better.\n\n3 years ago I (f24 at the time) spent a total of 12 weeks in psychiatric hospital for severe depression and PTSD. On my second day during a group feedback session a patient asked for a window to be opened. A nurse „The Wrinkle“, named after the prominent scowl wrinkle between her eyebrows and the fact that her name rhymed, responded „Are you dumb? It‘s February!“ I immediately hated her. She also regularly made patients cry, insulted them, yelled at them for small mistakes, made up random rules like no TV during meals even if everyone wanted to watch, and worst of all sent away patients with serious problems if they disturbed her meal. She yelled at me (and others) while I had a panic attack because she was busy with her dinner. Sorry if I interrupted you with your job. We reported her multiple times but the Hospital couldn’t do anything because she had a fixed contract and they already had a staffing shortage. With the complaints not working, even her ignoring patient emergencies not having any consequences and us being unable to do anything bad without risk of losing our treatment spots we were left with petty revenge. \n\nSo a patient friend (m26) and I bought a large pack of googly eye stickers. We started putting googly eyes on the rule paper with random new made up rules only applicable during her shift, that she hung on the office door, then on her photo which hung in the lobby with all other employee photos. The Wrinkle started angrily taking those down but we added new googly eyes during her every shift. Other young patients started joining in by putting googly eyes in all common areas where she was. The friendly dinosaur at the sink reminding you to wash your hands, the coffee machine, the fridge, magnets on the timetable magnetboard, the calender, the entry sign and the office door all got googly eyes. And it pissed The Wrinkle off. Every shift she would be too preoccupied searching for all these taunting googly eyes to yell at patients. The doctors and therapists (not knowing the reason for all the googly eyes) started encouraging us to continue being silly and having fun decorating the ward. We all started sticking googly eyes to our foreheads and running around like some sort of „mental patients“ from the psych hospital (when in Rome…). The Wrinkle eventually retreated and left us patients alone.\n\nI left 4 weeks into our googly terror campaign but patient friends reported that The Wrinkle soon left the ward. And even months after I left my therapist still found random googly eyes and said they reminded him of us. \n\nAs you can tell it‘s not all sad on the depression ward. The patients have a lot of dark and silly humor and when you‘re bored, have no reputation to lose and start to rediscover fun day to day life becomes very silly. Between chubby-bunny-karaoke, rollerblade-tabletennis and jell-o-sculpting getting forcibly admitted to the psych ward was (despite one mean nurse) a life saving and actually enjoyable experience.",
        "created_utc": 1675982564,
        "upvote_ratio": 1.0
    },
    {
        "title": "want to tailgate me? fine... I'll go slower than the speed limit",
        "author": "IllDesk2915",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/10y7ajl/want_to_tailgate_me_fine_ill_go_slower_than_the/",
        "text": "[removed]",
        "created_utc": 1675979364,
        "upvote_ratio": 1.0
    },
    {
        "title": "How I got the best of a rude co-worker, a raise, and better grades",
        "author": "Dbjfdb",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/10y74wd/how_i_got_the_best_of_a_rude_coworker_a_raise_and/",
        "text": "*Names and some unimportant details have been changed.* \n\nIt’s somewhere around the summer of 1988. I was 14 and had gotten into a bit of trouble with the police in another state while on a one-week trip. This was was uncharacteristic of me…I was a smart, good kid otherwise. A bit of theft and damage. I was trying to show off for some kids I had met and ended up making a huge mess of things. Damage was a $100 or so. My parents required that I pay the person back double the loss, and the way I’d do that is to get a job. I accepted all of this as I was truly sorry for it. Mom told me to go down to our local convenience store and ask Mr. Smith for a job. \n\nMr. Smith needed a stock clerk for his busy convenience store and hired me on the spot at $3.35/hour. I worked about 20 hours a week. Saturday 11 - 6, Sunday 11 - 6, and Tuesday nights. The job was good…on one end of the building was a sub shop and the other end was the store. The middle was where the desk and all the stock was. Walk-in coolers and such were between this room and the store. There were four cashiers that worked there. Amy, Betty, and Charlie. Charlie only worked Sundays. Betty worked Saturday nights and several nights a week. Amy handled the bulk of the shifts. At the time they were all old as dirt, but if I had to guess Amy was in her 50’s and Betty and Charlie in their 30s. Betty and Charlie were always very nice to me and the customers…but Amy was a sneaky and conniving bitch. \n\nThe summer ended and I kept working there through the fall and into winter. I started also working Wed nights…whatever the maximum hours I could work were, that is what I was scheduled for. During the six months I was there Mr. Smith had fired three other stock clerks…all for theft. Dropping cases of beer into the dumpster to retrieve later, food, cigarettes, and so on. I never did…and it honestly never even occurred to me to. Mr. Smith was generous…I could have soda and candy when I wanted…just don’t touch the beer and don’t steal from him. I loved the little round beef jerky that was in a glass jar at the counter and Orangina soda. \n\nThe job was simple and I had it down. Keep the cooler stocked, sweep/mop the floors, help customers carry things to the car. On Tuesdays we got the week’s order so that night I’d put price tags on everything (loved using the tag gun), rotate stock, and so on. Stocking the cigarettes was the cashier’s job, but I never minded doing it and would help them by bringing out the cartons they needed and so on. \n\nBasically…I did what the employees needed. Never bitched, always showed up on time, and never complained. Mom enforced a strict rule with my paychecks: I could spend half the net but half had to go in the bank. So my bank account was getting higher and higher. I used to enjoy looking at the account passport book and the balance printed in there. \n\nMy mom worked in a place in town where she saw and kinda knew everyone. The kind of person that when I got my drivers license years later I wouldn’t dream of breaking any laws, driving too fast, or playing music in the car (we were forbidden to play music the first year we got our license…good rule…keeps us from being distracted) because someone always told her what they saw. And we always got caught. \n\nSo one day mom comes home from work and says she needs to talk to me. She proceeds to tell me what her friend told her. That her friend was in the store and Amy (who didn’t know she knew my mom or me) was smoking and talking with one of her friends and said something like “watch this…DBJFDB (she screamed) GET UP HERE” and I did. “Go sweep the parking lot”. It was drizzling out, but I put a coat on, grabbed the sweeper and got to work. Amy and her friend got a huge laugh out of it all. My Mom’s friend paid and went straight to my mom and told her the story. As the day went on Mom found out from someone else that Amy had said some other demeaning things about me, too. Amy was a yeller and cranky. She’d slam things. She’d say rude things about other people to me. She wore these heels that used to make a clomp clomp clomp sound throughout the store when she walked around. \n\nI remember being stunned. I was a good kid and no one knew about my little issue with the police, which had since all been cleared up and I was quite law-abiding. I played a varsity sport, easily got good grades, and had friends. Why would an old-ass adult do this to me??\n\nMom asked me what I wanted to do and I told her that I can’t work there anymore. “Good. Get on your bike and go tell Mr. Smith you quit. And tell him why”. So I did. Mr. Smith seemed shocked when I told him the story. I also told him that my grades were beginning to suffer…see I was now working Tues and Wed nights till 11:30pm (close). We lived a mile away so I’d ride my bike home, but was still too wired to go to sleep and my parents were in bed already so I’d stay up till 1 watching Hogans Heroes reruns. I got up at 5:45 AM to use the shower before my brothers, and then off to the bus stop for 7:15 pickup as we lived on the far end of town. \n\nMr. Smith was amazing. He offered me the following: A raise to $4.25, I could do my homework at work in the backroom at the desk, I only had to do certain things for my job (basically keep things stocked, clean the floors, occasionally help someone bring their stuff to their car, and the kicker: “you don’t have to do anything Amy tells you to do any more”. I agreed. \n\nI went home and told Mom…she was so happy. Made my favorite dinner, hot dog soup (basically elbow macaroni, pasta sauce, hot dogs, and garlic bread on the side). My dad shook my hand and congratulated me. $4.25 an hour! \n\nIt was, I think, a week before I worked with her again. It was a weeknight so the store was quiet and I had got through my homework and done all my work except the final bit of cleaning the floors. I could hear her screaming for me from the other end of the store. I didn’t move, I didn’t reply. I then heard the CLOMP CLOMP CLOMP of her coming. My back was to the open door leading into the store as I was sitting at the desk. She stands in the door way and screams “I’ve been calling your name for a half hour…what the fuck are you doing!!??”. My knees were shaking. I wasn’t used to being yelled at by anyone other than my parents. I slowly spun the chair around, made eye contact and simply said “Mr. Smith said I didn’t need to do anything you told me to do any more”. Then I slowly spun the chair around and pretended to read…I was too scared to read but made a show of it. \n\nThe pause and the quiet in the air was palpable. A short moment later she clomped back up to the front of the store, quicker this time. In those days if you had more than one phone on the same line, the phones would “ding” when the other receiver was picked up. I heard the receiver at the desk “ding” and thought oh no, she’s calling Mr. Smith. I heard muffled yelling from out front for a few moments and then heard the receiver crack down with a resounding BANG, the receiver at my desk whimpered a subtle “ding”. I waited for her to come back. I was a bit scared. But nothing…she never came back. I finished up my shift, swept, mopped, left when she did as she locked up, and quickly rode home. \n\nAmy didn’t talk to me much for a couple weeks after that. She didn’t order me around and didn’t make my life harder. The other two cashiers, Betty and Charlie, however, really opened up more to me. While not friends because of age differences, they treated me like a colleague. Betty got me to tell her the story, and then I found out so much more. Mr. Smith had given her a verbal lashing. Her kids and husband stopped spending so much time out front as well. While Amy and I never officially made up, things smoothed over after a few weeks and she was never rude to me again. \n\nAs a final note…being able to do my homework at the store turned out to be amazing for my grades. I had several hours a night where I really didn’t have anything to do, so I’d get ahead of my homework for the week, study for tests, read more, and my grades went up almost immediately. I ended up working there until the end of the next summer and then focused on school, sports, and friends.",
        "created_utc": 1675978978,
        "upvote_ratio": 1.0
    },
    {
        "title": "Scream at me and punch me in the face in front of the whole hallway? Here, ill destroy your social life for you.",
        "author": "My-cat-made-me-do-it",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/10y6pu3/scream_at_me_and_punch_me_in_the_face_in_front_of/",
        "text": "This little ditty starts in middle school. Id recently met this girl, well change her name to Shawna for privacy reasons and I will be known as Kai.\n\nWe’d been talking about something I don’t remember what when a guy shed liked at the time came up to us and started talking to Shawna. He asked her to go out with him over the weekend, to which I said “Aren’t we hanging out this weekend?”, she followed up with “No?”\n\nThere was a bit of back and forth when she said “Dont be ridiculous, I’d rather hang out with [Insert name here bc he’s not relevant to the story]”\n\nI said “Wow, okay” and she went OFF on me. Telling me how I’m always begging her for attention, how I’m so pathetic and such a loser for always hanging on her all the time. Among many other things that are a little foggy. Taken aback, I ask if she really felt that way. To which she called me annoying and punched me in the eye. I fell to the ground. Not even crying, purely in shock.\n\nShe then said bye and walked off cackling with this dude. \n\nDisciplinary repercussions ensued, and we stopped talking.\n\nA year later, towards my sophomore year in high-school, she contacts me asking if we can talk. I say sure because at this point I want to see where this is going.\n\nShe says she’s sorry about how she treated me, and was wondering if we could make amends and be friends again. Id said that it would take a while to get to trust her again, but I’m willing to play ball.\n\nSo we go about doing the things friends do. Hanging out at the mall, having sleepovers with other friends, that sorta thing. But I had a funny feeling after a month.\n\nI assume she felt like we were back where we used to be, because she started telling me all the fucked up things she liked to do. She’d home wrecked relationships just because she could, trash talk our mutual friends behind their backs, and most times id leave her on read or say “Idk maybe”\n\nOther times I’d change the topic.\n\nShe started being more rude to me, excluding me from group hangs “on accident”, etc.\n\nThen i found out through (well call her) Olivia that Jessica had been trash talking me in a groupchat she made and left me out of.\n\nSo, I play nice. I condone it for the sake of building up evidence. I screenshot all her snap stories with guys that were both not her boyfriend and were other girl’s boyfriends, I guess she never bothered to check who screenshotted because Id never been found out until i showed the whole school.\n\nI screenshot all her texts detailing all the scummy things shed do.\n\nId ask for screenshots of the terrible things shed say about me.\n\nA couple months went by and it was summer. I felt like I’d built up enough evidence to take her down. First day of sophomore year comes around and I make a instragram page that has been inactive ever since. First day i posted all the screenshots of her with other people’s boyfriends and tagged her. Eventually she sold herself out by coming up to me while we were waiting for first bell and screaming in my face about how I’m a liar and a fake friend and how dare I post pictures of her with other guys.\n\nPeople in earshot apparently started searching Instagram because followers went up real fast within a day. After NC for that one day she came up to me yet again and you guessed it, started screaming at me for ruining her friendships.\n\nI told her “Theres a lot more where that came from” and smiled sweetly\n\nShe called me a bitch and told me she was going to mop the floor with me\n\nSo i stood up (Im about 6 inches taller than her and did kickboxing at the time, so i wasnt worried)\n\nShe pushed me, and i did nothing. She yelled “Fight back p*ssy!” And pushed me again. When I barely budged, she punched me in the face.\n\nAt that point i lunged at her. And people had started gathering around us to watch and record.\n\n(Im not trying to brag by saying this, at the time i was only a little stronger than her, and even then I wasn’t very strong. If id taken anyone else I definitely would have gotten my ass beat, i was just lucky it was her, and i stopped doing kickboxing and lost most my strength over the years that followed so I couldn’t even take a tree branch now)\n\nThe only damage she’d done to me was give me a bloody nose. Most of her face was busted up and she was holding her ribs\n\nShe told the office that i was cyber bullying her and when she confronted me about it i attacked her. So they checked the cameras because obviously our stories didnt line up. She got 2 days out of school suspension.\n\nWhile she was gone i posted the rest of the screenshots i had, logged out of the account pretty much abandoning it, and blocked her everywhere.\n\nShe kept trying to fight me and get in contact with me after she came back, but id mostly ignore or breeze past her. Otherwise it was a short “Shouldn’t have fucked me over in middle school” or “you had it coming”\n\nI slowly watched her go from sitting with a table of almost 20 people to slouching on her own against the wall playing on her phone.\n\nI dont regret a thing, most satisfying year of my life.\n\nAs far as i know now shes still trying to paint me as the asshole, most people understand my side and only a few agree with her. Even then I’d never see her talking to anyone\n\nShe got kicked off the volleyball team and had to go to summer school for 2 years in a row",
        "created_utc": 1675978001,
        "upvote_ratio": 1.0
    },
    {
        "title": "Tried to rip me off",
        "author": "davtack",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/10y2dmp/tried_to_rip_me_off/",
        "text": "I bought a trolling motor on ebay for $500, like new the listing said. I got the huge package and opened it. It wasn't the model he claimed, a $217.00 difference. I quickly wrote him telling him this and offered to keep it if he pays half the cost to convert it to the other model (5 speed vs variable). He refused. I went back in the garage and checked the motor over and saw it was damaged. The prop was chipped, shaft bent (a new armature costs $150 for parts). He obviously hit rocks and tried to sell me a broken trolling motor. I wrote and told him about all that and he refused to except return. \n\n&amp;#x200B;\n\nI contacted ebay. They sided with me, but then he called them and they reversed their decision, siding with him now. So I called and mentioned the damage along with wrong model and they reversed it again, siding with me. So I had to repackage this huge motor, about 3' wide by 7' long and weighed 90#. I had to take it to the dock at P.O. because it was so big. \n\n&amp;#x200B;\n\nA few days later I was wondering if he got it yet so I could get refunded. Then a ups truck pulled up with the trolling motor! He listed the wrong address and it was returned to me! I called ebay again, I wasn't happy. They checked and found it was his error and he was now supposed to send me a new shipping label ($97), but he never did. So after a certain amount of time, I again contacted ebay and they told me they would refund me my $500 and said that I could keep the trolling motor!\n\n&amp;#x200B;\n\nI replaced the $20 prop, the $217.00 switch and the $150 armature, and used the motor for years. It cost me about $400 to fix, but I ended up with a $700 trolling motor. He got nothing and was out $97 shipping costs.",
        "created_utc": 1675967975,
        "upvote_ratio": 1.0
    },
    {
        "title": "what websites to sign up for online that'll get you texts or calls ?",
        "author": "GuardTasty",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/10y1g8p/what_websites_to_sign_up_for_online_thatll_get/",
        "text": "",
        "created_utc": 1675965856,
        "upvote_ratio": 1.0
    },
    {
        "title": "The Only Free Cakes Are Ruined Ones? Okay…",
        "author": "Funny-Ad9357",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/10y0e9g/the_only_free_cakes_are_ruined_ones_okay/",
        "text": "In the early 2010s I worked in a supermarket bakery/deli. Since most of my shifts were closing shifts, one of my tasks was to gather all of the expired bread, cakes, pastries, etc, and scan them out to be thrown away. Some days this might be one or two loaves of bread, sometimes it was a PILE of perfectly good, edible food. For example, the cinnamon buns had a one-day sell date. If I baked them on Monday afternoon, I would need to throw them away Tuesday night. \n\nIt was company policy at the time (as it is unfortunately a lot of places) that all food past its sell-by date had to be thrown in the trash. Employees were not allowed to take anything home for free, even if it was literally about to be thrown in a trash bag. They would need to pay for it. We also couldn’t donate the food to food pantries, community groups, or homeless shelters.\n\nEarly on, I even asked the store manager to clarify why we couldn’t donate or give away the food, or take it ourselves. His response was that it was a liability, what if someone got sick, etc. It’s all bullshit, I know. There are plenty of places like Panera Bread that give away day-old bread at the end of the night, and the vast majority of the food I threw away was still perfectly good. But store policy was store policy, and I could have gotten fired for “stealing” food about to be thrown away.  (Granted, I was a poor college student, so often I’d smuggle home small items that I could fit in my bag, like bagged rolls or cinnamon buns.)\n\nA few months into the job, my bakery section supervisor was carrying a stack of sheet cakes out of the walk-in freezer, and one fell off the top. The plastic clamshell lid didn’t come off (so no food touched the floor), but the cake inside was smashed and unsellable. She told me to mark the cake as shrink (product loss), and said I could put it in the employee breakroom. I realized in that moment that because the cake wasn’t EXPIRED, just visually unappealing and unsellable, employees were “allowed” to eat it. \n\nWouldn’t you know it, after that I found myself becoming increasingly clumsy! And always with items that were set to expire the NEXT day! I’d still have to throw away a truly egregious amount of food each night, but at least I could occasionally provide free cakes and pastries to my other minimum wage coworkers.",
        "created_utc": 1675963475,
        "upvote_ratio": 1.0
    },
    {
        "title": "Petty revenge",
        "author": "ContentFig9556",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/10xv402/petty_revenge/",
        "text": "[removed]",
        "created_utc": 1675950324,
        "upvote_ratio": 1.0
    },
    {
        "title": "I put things where they don't belong if I find them in worse places",
        "author": "gingerwarrior8",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/10xtfvz/i_put_things_where_they_dont_belong_if_i_find/",
        "text": "[removed]",
        "created_utc": 1675945347,
        "upvote_ratio": 1.0
    },
    {
        "title": "Called corporate on me, still kept my job.",
        "author": "Vivid-Bike-5489",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/10xt1vj/called_corporate_on_me_still_kept_my_job/",
        "text": "So about 6 months back, I got into a fight at work over finding out my ex cheated on me with a girl who was trying to be my friend (he didnt admit to until almost a year later) really just drama. Well I had to deliver to her one night, well we got into it and it almost got physical. She called corporate saying she feared for her life, that I was inappropriate all kinds of stuff. She also gave me only 20 dollars out of a 40 dollar order. She also made sure to tell everyone how she got her pizza for half price because of our scuffle. Well my Dm in fact did not do anything to me, didnt write me, told me great job, and gave me a pay raise. She came in one night, and seen I was still working and continued to call corporate stating I was stealing money, smoking on the job, you name it. Corporate put her on a no contact list, she cant be delivered to anymore, and everytime they order food, it's always raw and theres no one she can complain to. I also put them in the system as a prank caller so anytime they try to order we hang up. it's kinda of a win for me. :^)",
        "created_utc": 1675944062,
        "upvote_ratio": 1.0
    },
    {
        "title": "haha",
        "author": "Vivid-Bike-5489",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/10xsuuy/haha/",
        "text": "[removed]",
        "created_utc": 1675943418,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is extra farting during pregnancy normal?",
        "author": "woolfej",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/10xsujx/is_extra_farting_during_pregnancy_normal/",
        "text": "[removed]",
        "created_utc": 1675943392,
        "upvote_ratio": 1.0
    },
    {
        "title": "You want to cheat on me? I don’t think so.",
        "author": "Snow_Cookie",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/10xppzd/you_want_to_cheat_on_me_i_dont_think_so/",
        "text": "[removed]",
        "created_utc": 1675931753,
        "upvote_ratio": 1.0
    },
    {
        "title": "The cycle of actions and fruits is very deep subject",
        "author": "unityofreligions",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/10xpphe/the_cycle_of_actions_and_fruits_is_very_deep/",
        "text": "[removed]",
        "created_utc": 1675931702,
        "upvote_ratio": 1.0
    },
    {
        "title": "Revenge of the step mom",
        "author": "Nice-Statistician633",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/10xmscp/revenge_of_the_step_mom/",
        "text": "[removed]",
        "created_utc": 1675921461,
        "upvote_ratio": 1.0
    },
    {
        "title": "Punished my middle school Bully &amp; he couldn't file a complaint either.",
        "author": "RealityCheck18",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/10xlty6/punished_my_middle_school_bully_he_couldnt_file_a/",
        "text": "This happened during my 7th/8th grade (in a school in India). My class had a Bully, who was the son of the Teacher who was next in line to become the Vice Principal (basically No.3 in hierarchy). He was rich as well, so he naturally became a Bully. He had a gang with him, but they were mostly Extras filling the atmosphere. He was the prime Bully. He had psychopathic tendencies IMO. For ex- I had seen him puncturing bicycle tyres randomly with a compass, while walking through the school parking, just to mess some random kid's evening.\n\nHis path didn't cross mine and I was extra careful not to cross into his. I was many inches shorter than him, and must have weighed 30-40% lesser than him. I cannot stand a physical fight with him any day (even today). He was always treated different than others. For offences which any other Kid would have got at least 1 week suspension, he would at best get \"scolding\" from his Mother and let go with a \"Final Warning\" every time. His mom was basically enabling him to be a Bully. Years later, I came to know, his mom herself was a Bully among the teachers, pushing people out to get higher positions.\n\nI had 3 other friends, most of whom coincidentally were also smaller in physique, like me and mostly pacifists. At some point, the Bully decided it was time to mess with my group. One of my 3 friends stayed back in class during the Physical Training (PE) class as he was not well. I stayed back with him, just in case he needs help (and I hated PE class as I was being forced to play volleyball when I was interested in Soccer/Football). My friend needed water and I went to get some, and when I came back, I found my friend down on the floor and the Bully &amp; his friends were stomping him. I quickly rescued him by creating noise, attracting some attention. The reason he was attacked was, they were going to listen to songs in class (in some portable music player) &amp; wanted to chase him away. My friend would have not ratted them out anyway, but still they attacked him. Complaint was filed &amp; he was let go with another \"Final warning\". His mom underplayed it as if it was a friendly mischief.\n\nA couple of weeks later, during lunch my friends &amp; I were changing to short pants at the restroom stalls, getting ready for the PE class later that day. (We didn't have any locker rooms).  We were already running late when we heard the bell ring. We also heard the voice of the bully as he was telling his friends to inform the teacher he'll come in a minute. \n\nHe was there all alone in the Rest room, and we 4 of us. We were still furious about the events from the other week, and we don't know how we decided, but we dragged him on to the floor and stomped him, exactly the same way he &amp; his group did to my friend. We were careful not to cause any bloody bruises or serious injuries. After a few minutes of satisfying stomping, we left. He reached the class a few minutes after us.\n\nNow, he looked like he had seen a ghost, and when teacher asked what happened, he just said that he \"slipped &amp; fell down\". He couldn't inform or complain to anyone that he got beat up by 4 short weak nerds. This would make him loose is \"Bully\" status. We ensured that a rumour spread around the class that he got his ass kicked by someone in the restroom, but never revealed to anyone that it was us. So, everyone kind of knew what happened, but he kept denying that &amp; he couldn't officially complain against us as well. \n\nWe loved that sweet spot. \n\nWe were afraid he'd try to corner one of us again, but may be he was afraid that we'd hit back, and he avoided eye contact with us ever since.",
        "created_utc": 1675918459,
        "upvote_ratio": 1.0
    },
    {
        "title": "Need revenge ideas",
        "author": "Texas-Tornado11",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/10xiwel/need_revenge_ideas/",
        "text": "[removed]",
        "created_utc": 1675910041,
        "upvote_ratio": 1.0
    },
    {
        "title": "Locker hog revenge",
        "author": "Odd_Brick_510",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/10xewc4/locker_hog_revenge/",
        "text": "I go to a gym where there are both long-term rental lockers (for a small fee) as well as daily ones which are sparse, especially when the gym is busy. For what it’s worth I have an injury that means I’m not able to lift anything up to the top lockers so I always look for one on the bottom row.\n\nThere’s someone in the female changing room who keeps a small padlock on the hook of one of the accessible daily lockers. It’s hidden by the locker door so is not visible to the cleaners walking past it and basically renders the locker unusable even though it’s actually empty most of the time. There’s a sign saying locks that are there for more than a day will be removed, but they never are. There are also thieves in the area so it’s best not to leave stuff unlocked. \n\nSo the other day there were no other free spaces, I pried the padlock open with tweezers (easy!) to use the empty space, and then did it again when they replaced it. They always use the same type of lock and the same locker so you can tell who they are. The third time I saw it , it was being used by the hog (which doesn’t happen often), so I pried that one open too, used a different padlock and lock their stuff in. Hopefully that will get them to stop :)",
        "created_utc": 1675899835,
        "upvote_ratio": 1.0
    },
    {
        "title": "My previous boss, the VP of HR, tried to quietly terminate me (an HR Rep) by putting me on a PIP despite high performance.",
        "author": "Upbeat_Look_5026",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/10xe3c8/my_previous_boss_the_vp_of_hr_tried_to_quietly/",
        "text": "[removed]",
        "created_utc": 1675897917,
        "upvote_ratio": 1.0
    },
    {
        "title": "Supermarket bullying",
        "author": "Master_Ranger4729",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/10xd9tq/supermarket_bullying/",
        "text": "Back in the late 90s/early 2000s I had my first job working at a supermarket (now defunct thank god!)It was awful and the reasons were (and not limited to):\n- being made to clean fixtures with a toothbrush. \n- threatened with pay deductions if I was too slow. \n-Told to pick up pieces of rubbish off the floor before I could go home. \n- General name calling from the supervisor. \n\nAll this for a whopping £2.50 an hour. \n\nAs I was only 16 and never worked before, and coming from a very rough school, I thought this was the world of work. \n\nOne day, a kid from my class came in with his girlfriend and a baby and as I was scanning their items and making conversation, the diapers wouldn’t scan. I briefly looked around and saw no supervisors on duty (probably in the back pissing about) so I just didn’t scan it. The kid from my class didn’t realise. I saw him a few times after this, and each time I wouldn’t scan any of the baby items. \n\nThis snowballed into other customers who bought baby related items. \n\nI suppose it felt good helping people out, but it was also partly to do with the way the supermarket culture allowed for bullying in the workplace, especially just to a kid like me at the time. \n\nEvery time I drive past now where it used to be I remember not the time I was subjected to the above, but glad that the company had been put to an end!",
        "created_utc": 1675896073,
        "upvote_ratio": 1.0
    },
    {
        "title": "Delicious Petty Revenge",
        "author": "Kibbles35",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/10xax1w/delicious_petty_revenge/",
        "text": "When I was in college at San Jose State, a group of 4 of us students rented out a house near SJSU.  My younger brother (not a student) needed a place to stay. He wasn't always a pleasant person and he wasn't very responsible either.  He didn't pay rent or clean up much, but as long as he didn't create problems for the other roommates, they didn't mind if he crashed on the couch or the floor so we allowed him to stay.  After a few months, and for a number reasons, his welcome started to wear out...\n\nBaby brother didn't have a lot of money but he had enough to buy his own groceries, but instead he simply ate ours - all the time.  Funny thing was... he sometimes ate food bought by the roommates, but mostly he ate mine.   He felt 'entitled' to eat my groceries that I and ignored hints about paying for or buying his own.\n\n*Enter petty revenge.*  Among other foods he liked to eat my canned tuna fish.   So, I bought a can of canned sandwich spread (Devilwood Chicken) - and a similar sized can of 'chicken flavor' cat food. I peeled the label off the Devilwood Chicken and carefully glued it down over the cat food label. \n\nIt took him a few days to discover it, but sure enough I walked into the kitchen and he was making himself a \"chicken salad\" sandwich with the relabeled cat food, mayonnaise, mustard and pickle relish. I couldn't help but to grin like a Cheshire Cat as he made his sandwich.  He knew something was amiss, but kept building his sandwich - ignoring that it was my bread, mayo, mustard and canned meat he was about to eat.\n\nJust as he sank his teeth onto the sandwich - I told him to check the label. He was a very vindictive person, and if I had actually let him eat the sandwich, it definitely would have turned into a physical altercation.  At first, he didn't actually believe me ...until I peeled the Devilwood label off and revealed the cat food label.  He turned 4 shades of red and purple, threw the plate into the sink, stomped and screamed at me, then stormed out. After he left, all of the roommates had a hardy laugh \n\nHe didn't completely stop eating my food, but he started buying a lot more of his own food.  A few weeks later all the room mates agreed it was time for him to leave. This was a few decades ago, but I still laugh when I think about it.\n\nky",
        "created_utc": 1675890702,
        "upvote_ratio": 1.0
    },
    {
        "title": "Rocky breakup, so i changed his all of his netflix account launguages",
        "author": "Yelz30",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/10xadjk/rocky_breakup_so_i_changed_his_all_of_his_netflix/",
        "text": "[removed]",
        "created_utc": 1675889457,
        "upvote_ratio": 1.0
    },
    {
        "title": "MY EX HAD MY XBOX IN LOCKDOWN AND MOVED TO MY FRIEND",
        "author": "Yelz30",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/10xa5gz/my_ex_had_my_xbox_in_lockdown_and_moved_to_my/",
        "text": "[removed]",
        "created_utc": 1675888924,
        "upvote_ratio": 1.0
    },
    {
        "title": "EX HAD MY XBOX IN LOCKDOWN AND MOVED TO MY FRIEND",
        "author": "Yelz30",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/10xa40i/ex_had_my_xbox_in_lockdown_and_moved_to_my_friend/",
        "text": "[removed]",
        "created_utc": 1675888829,
        "upvote_ratio": 1.0
    },
    {
        "title": "My Boss Liked To Punch Down",
        "author": "MorriganNiConn",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/10xa0sb/my_boss_liked_to_punch_down/",
        "text": "This took place back in 1989.  \nI used to work with a company that had a contract to provide temp workers for the city government and it's various agencies. In addition to having a full array of secretarial skills (typing, business writing, dictaphone transcription, records management &amp; filing, keypunch data entry, etc.), I came equipped with 4 year bachelors and volunteer experience in the arts including commercial display/design.   \nBecause of the last part, I got a job working at our convention center. In addition to clerical work, I worked with a manager doing the hallway and main lobby displays that focused on our local attractions, holiday displays, etc. It was a sweet gig that I worked half days for while also temping in the city legal office in the afternoons. At least it was until my boss, who was a big-ish art collector, got crosswise with another city organization she tried manipulate into providing public art for her office, but which had been budgeted for &amp; earmarked for the city council chambers. And she asked me to LIE. To lie to the very person who was &amp; had been my personal friend for about 15 years at the time and who was the public official who ran the city's public arts office. ***My boss wanted me to lie to my friend*** in order to get minutes from a board meeting that she wanted to review and which had not yet been finalized and published. She was not a board member. She was not authorized to review &amp; mark up minutes of that meeting. I told her I needed her request in writing. She did, heavily underlining instructions that I was not tell my friend *who* was asking for those minutes.   \nI failed. I could not get those minutes for love nor money. When his secretary asked me specifically if my supervisor had sent me, I didn't lie. They sent me off.  I reported back to my boss that the office would provide the minutes once the board had approved and published them. So, she fired me and lied to my employer, who I had already provided a photocopy of her written instructions, about it. Faxes were wonderful things back then!  I was damned upset and crying (which was how I dealt with anger that had nowhere to go) when my friend in the public arts office ran into me. Retaliation is an ugly thing. Anyway, as a temp, I was pretty powerless, but my friend was not. He understood my boss put me in a bind and her firing me was unfair.   \nThe revenge was not mine specifically, but my friend's. He used his social connections with all his artist friends to tell the story of how I got shitcanned for refusing to lie to him on her behalf. She found herself banned from several major galleries and a couple major art fairs. There turned out to be several dozen artists who refused to sell anything to her at all. About 10 years later she looked me up and asked me to go to bat for her and ask them all to rescind their bans, since my friend had since died. I got the pleasure of telling her no.",
        "created_utc": 1675888609,
        "upvote_ratio": 1.0
    },
    {
        "title": "Cell Phones Cheap",
        "author": "Prior_Leg9199",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/10x9y11/cell_phones_cheap/",
        "text": "[removed]",
        "created_utc": 1675888432,
        "upvote_ratio": 1.0
    },
    {
        "title": "My friends revenge",
        "author": "Mobile-Avocado-1428",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/10x96t4/my_friends_revenge/",
        "text": "[removed]",
        "created_utc": 1675886702,
        "upvote_ratio": 1.0
    },
    {
        "title": "Passed down twitter troll",
        "author": "Chads-Obsession",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/10x3dbt/passed_down_twitter_troll/",
        "text": "[removed]",
        "created_utc": 1675873134,
        "upvote_ratio": 1.0
    },
    {
        "title": "My high school history teachers revenge.",
        "author": "Cryptolution",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/10x2fpj/my_high_school_history_teachers_revenge/",
        "text": "Mr Smith was a pretty boring teacher. He had the passion of a turtle when teaching history so we as a class struggled to stay engaged.\n\nIt was an open secret that Mr Smith would leave a copy of the weekly test questions in one of his cubbies (kind of like a stacked mail slot to place papers) on the side of the room the day before the test. Word got around to pretty much everyone in the class so someone would grab it, make copies and distribute it. The natural outcome of this scenario is that no one studied the material as we all knew we could just rely on his rather generous placement of the quiz materials.\n\nFast forward to finals week. It's the big test and it has some serious weight so bombing on this test could drop your entire grade at least a letter possibly two if you were right on the edge.\n\nDay before the test comes.... And there is no answers left in the cubby. That sneaky dull turtle did this on purpose and apparently reveled in watching his cheating students fail 😂 \n\nHe had a habit of taking phone calls in the middle of class and walking with the corded phone outside, closing the door and having 5 to 10 minute conversations while we dicked around in class.\n\nI took that time to pilfer through his desk until I found the answers. I hand wrote them down, made a copy and distributed to my friends. I don't know about anyone else but I would always make sure to miss an answer or two has to not be obvious. I aced my final got an A+ in the class and skipped on with life.\n\nSorry Mr Smith for thwarting your petty revenge.",
        "created_utc": 1675872182,
        "upvote_ratio": 1.0
    }
]