[
    {
        "title": "Neighbors have been *busy* all week so I helped with the ambiance",
        "author": "Effective_Donkey_840",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/11mghu1/neighbors_have_been_busy_all_week_so_i_helped/",
        "text": "[removed]",
        "created_utc": 1678330024,
        "upvote_ratio": 1.0
    },
    {
        "title": "Smart, tall, attractive, in shape guy posted to Tinder sub looking for sympathy, and deleted the post when Redditor’s weren’t on his side. So I took screenshots and posted it here.",
        "author": "Dismal-Fig-731",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/11mg7ao/smart_tall_attractive_in_shape_guy_posted_to/",
        "text": "For those who enjoy irony…\n\nOriginal complaint: “We had one date where she insulted and belittled me the entire time.”\n\nThis guy posts a single screenshot showing his cut off comment, and everyone asked for more context. So he gave it.. and didn’t seem happy with the response. He deleted the rest of the convo and continued to argue on his main post that he’s a great guy and she’s psycho. Ironically, her responses showed she was for insecure simply because she kept talking to him. This guy insults her while talking about what a great catch he is. He admits in comments he’s only talking to her because “she was *super* hot”, and continues to engage with a woman he has no respect for in hopes of getting laid. While explaining to her that he is a kind guy who cares about forming relationships.\n\nFor all the women out there working on their confidence… who’ve been led on and mocked by self-entitled jerks who lack emotional intelligence… this one is for you.\n\n[Link here for your reading pleasure](https://imgur.com/gallery/iXWCHWC)",
        "created_utc": 1678329228,
        "upvote_ratio": 1.0
    },
    {
        "title": "Theatre Critic",
        "author": "ATXLMT512",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/11me1fv/theatre_critic/",
        "text": "Years ago, I was stage managing a play.  The lighting designer was a major diva (as several in theatre are wont to be).  He berated me several times to the point where I was crying.  The artistic director told me that while he was an asshole, he was a brilliant designer.  I’ve worked with designers from NYC, and I really didn’t think he was anything that special.  \n\nHe always used fog machines in his designs.  People said it was a signature, but I always saw it as a crutch.  \n\nA couple years later, I saw a production at another theatre where he also designed the lights.  Of course he used a fog machine.  After the show, I saw that there was an opportunity to give feedback on the experience.  I anonymously submitted a form and said, “I have seen several shows where X has designed lights.  While he is talented, I don’t understand why he uses fog machines in every production.”",
        "created_utc": 1678323463,
        "upvote_ratio": 1.0
    },
    {
        "title": "Water splashing over balcony",
        "author": "ScaryButterscotch474",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/11mdypb/water_splashing_over_balcony/",
        "text": "I live in an apartment building that has balconies on each floor. The ground floor has a huge courtyard. All of the balconies drain water by using tiny pipes that spill over to the ground floor courtyard. The courtyard has a drain directly under one set of pipes but not under the other set. So small amounts of water can fall on the courtyard below from the balconies above.\n\nMy husband and I moved into the building, storing our boxes on our balcony. Took us months to unpack. When the balcony was finally set up nicely, we cleaned using a broom and a few buckets of water.\n\nThe resident of the ground floor courtyard saw us and yelled about the water coming through our pipes. We apologized. We had not realized this would be a problem. He had no furniture out there and we have only seen him use his courtyard once - he set it up for a Christmas party. I have never seen him clean his courtyard. This was also the first time that we saw the drainage situation.\n\nAfter that, we always cleaned our balcony when it rained so that we would not disturb this guy. Often that meant waiting until 9 or 10pm. In the middle of Winter.\n\nOne day, some water had collected in something that we had stored on our balcony. My husband turned the item over without thinking and some water went down the drain. I’m talking about a cup’s worth of water.\n\nThe downstairs resident flew into a rage. He knocked on our door, tried to enter our home and threatened my husband. He acted like a complete psychopath. My husband told him to take it up with the body corporate so he issued a complaint to them and tried to get us evicted.\n\nWhat he didn’t know is that I am a lawyer and I was home at the time of the incident, listening to everything. I wrote back to the body corporate outlining our version of events. I also pointed out our legal obligations to keep our balcony clean under the body corporate rules, the apartment building laws and our lease. I suggested that the resident place a big pot plant on his courtyard to catch the water. Or that the body corporate dig up his courtyard to install more appropriate drainage.\n\nWe were not evicted. The resident chose not to take up my suggestions.\n\nWe no longer clean late at night in the rain and cold. We clean at a time that is convenient for us. I also purposely push water and dirt over the side of the balcony now rather than trying to gather it up. It’s my petty revenge to him for causing trouble.\n\nWe see him around the building occasionally but none of us speak with each other. I like it better that way.",
        "created_utc": 1678323267,
        "upvote_ratio": 1.0
    },
    {
        "title": "Parking Pettiness",
        "author": "setfaceblastertostun",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/11mdak2/parking_pettiness/",
        "text": "This story starts a little over three years ago when a new neighbor moved across the street from me. He had 5 boys, the youngest being 15. At that time, only 4 lived at home. But then Covid happened and his oldest moved back in with him. As the year went on, his youngest also became 16. Each of these boys had a car as did their dad. That is 6 cars and they kept only one in their single drive way so they are always parking up and down the street. I frequently had two of them parking in front of my house but as I wasn't using the area, I didn't mind.\n\nThis continued for over two years until November of last year. I had a few people over. Just one of the people who came over parked in front of his house (apparently most of his family was out because the two spaces in front of my house were clear too). When he got home, he apparently started knocking on neighbor's doors to find out who parked in front of his house. When he got to mine, he asked me to have my guest move their vehicle because he \"needed\" the spot in front of his house for his family and after all as he told me, \"It is *my* spot as it is in front of *my* house.\"\n\nI will say that he wasn't overly aggressive about it but he was insistent, so my guest did move his vehicle. This kind of pissed me off. So, since then, if I come home and they aren't parked in front of my house, I will park there. I also park in the middle so it blocks both spots. Today, he finally saw me parking like that and asked why I wasn't parking in my driveway and I simply said \"Well, it is my spot as it is in front of my house.\"\n\n&amp;#x200B;\n\nUnfortunately, he looked confused so I don't even think he remember using that line on me 6 months back. Ah well, I'm still enjoying being petty.",
        "created_utc": 1678321553,
        "upvote_ratio": 1.0
    },
    {
        "title": "Now you'll",
        "author": "Smedleycoyote",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/11m7oij/now_youll/",
        "text": "So this isn't so much a story of me exacting revenge.... More like the universe, or at least the town planning board.   In my early 20s, my girlfriend cheated on and broke up with me.  I was heartbroken and mad, and spent months pining over a girl who, to be honest, was way out of my league.  She then happened to move to a condo in the town I grew up in.  A few months after the break up, my family got some wonderful news.  They were naming a street in the town after my uncle, who was killed fighting in WW2.  And guess which street they picked to re-name!  For the next few years while she lived there, she saw my name outside of her house.  She had to write it every time she sent out mail.  It was printed on her license.   Years later when i ran into her (time heals all wounds) she told me living there reminded her every day of the shitty way she treated me.  So thank you Uncle Lou.  We never met, but you haunted my ex!",
        "created_utc": 1678308472,
        "upvote_ratio": 1.0
    },
    {
        "title": "Payback’s a d!ck. Cost my highschool half a mil in renovations.",
        "author": "NoCow3628",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/11m7865/paybacks_a_dck_cost_my_highschool_half_a_mil_in/",
        "text": "[removed]",
        "created_utc": 1678307421,
        "upvote_ratio": 1.0
    },
    {
        "title": "The lines designating parking spaces exist for a reason, right?",
        "author": "from64n65notfrom63rd",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/11m6i8q/the_lines_designating_parking_spaces_exist_for_a/",
        "text": "I'm not usually into petty revenge, but this has been happening for a really long time at my campus. People tend to sort of just swing their cars into a spot and get out on the first attempt. Today, there was a chick who parked next to me in a Nissan Sentra with the front of her car on the left white line. I was going to park in the spot on the left, as it was the only one remaining in that lot. So, I did. But...not before inconveniencing her just a little bit. \n\nI pulled my car in like normal, but then rearranged my position so that I was within my space's lines, but also so that my passenger mirror was about an inch of her driver side mirror. For the sake of free amusement, I decided to wait and just listen to the radio on accessory power. Next thing you know, I hear a car door open slowly, and see her wiggling out of the car. Took her a solid minute to figure out how to get out while not door dinging me (she could've straightened her car out in half the time). She glared at me, so I smiled back at her. \n\nI know it was unnecessary, but I'm not a perfect person. Also, parking a car is one of the easier things to do when driving in my opinion, so it really irritates me when people can't be bothered to do it properly.",
        "created_utc": 1678305794,
        "upvote_ratio": 1.0
    },
    {
        "title": "Send Satanic bible to a Jehova witness.",
        "author": "loisenid",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/11m4dbg/send_satanic_bible_to_a_jehova_witness/",
        "text": "I put this story in AITA comunity, but they told me put here. I'm(40female) atheist. Sorry for my grammar, english not my first language. I have this uncle, (Jehova witness) and this aunt (christian). My uncle come 1 time with others members (jehova witness) and i told him, im not interested because im atheist. I think this Will end there, but no. They come each saturday to \"help my soul to be free of satan claws\". I try to be rude, dont work. I try to go and be in anoche place, dont work, they start to come other days. So i took a plank, glue a baphometh póster, and took some rotten fruit of my yards (oranges, advocados, pumarosas, panapen etc) in a bowl like and offering. I think this Will end this. But no. It got even worst. Start to come christians, pentecostal, mormons, JW, etc to my place. Now i have each church in my home everyday.. i try to put my nace in the no contact me list, like others sugest, but my uncle (JW) and my aunt (christian) took like a personal goal to convert me.. pass 11 months.. they cross my limit. I have 2 daughters (14/8) and start the harrasing with them. In a public school. (Some teachers christians like my aunt, start harrasing my daughters) they try to force them to pray, i go to school, and talk with the social worker, and the teachers, but dont work, and the teachers tell all (illegal) to the others parents in the school, so they start to harrasing my daughter. 1 parent(68 y) tell my daughter she Will go to hello because your mother(me) dont believe. So go to the legal and i win a religios persecution lawsuit. \nThis dont stop my uncle. I ignore him.. when the pandemic hit, they start to send letters, i politely answer some, telling im in a no contact list, and i dont want more letters. Some stop... i recibe vía mail 1 or 2 letters pero weeks.. my  uncle continúe the harrass by mail.. so i buy 3 satanic bibble, and send vía mail, with the satanic temple propaganda, i download from Internet. Send 1 bibble to my uncle, and 1 to my aunt. And tell them i have my own bibble and i found my lord and savior called Satan, aún i want to talk and pray for satan.\nThis stop the harrass. They dont talk to me anymore.",
        "created_utc": 1678301045,
        "upvote_ratio": 1.0
    },
    {
        "title": "Steal my money? Here's your prize.",
        "author": "ThrowRA_283954851",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/11m384r/steal_my_money_heres_your_prize/",
        "text": "[removed]",
        "created_utc": 1678298442,
        "upvote_ratio": 1.0
    },
    {
        "title": "You want coffee? I'm not gonna serve you",
        "author": "jan_olbrich",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/11m2f7h/you_want_coffee_im_not_gonna_serve_you/",
        "text": "Long time lurker, english is not my native language and further disclaimer ;)\n\nThis happened about 11 years ago. I was member of a student group which was trying to actively promote culture (in a sense of concerts, dancing lessons, video night, etc) on campus. All of that was financed by running a cafe. We were all honorably active, so no money was involved and we all did it for the fun and knowing we did something good for other students.\n\nOne day, the guy who was responsible for running the cafe that day had to study for an important exam. He would have to pass thas exam otherwise he would be kicked out of university and wouldn't be able to study the same major again (Germany has some weird regulations regarding this). So I took over for him even though it was my birthday. (He did fail the exam anyways btw)\n\nNormally there would always be people (mostly other students having fun) behind the counter serving the students coffee or other drinks. As there was no pay, they simply could drink as much as they wanted (even beer) as long as they were able to do their job properly... oh and they had control over the music (which resulted in some fun encounters). In this case though the noon shift had noone so it was my job to take care of it.\n\nNoon is always the high time and I'm used to it as I did it with a friend regularly. With two people the queue would already be 20+m long going outside but this time I was alone having to not only sell drinks, but also brew coffee restock the fridge for coke, beer and other stuff you have to do.\n\nI told the customers in front of me, they would have to wait a few seconds so I could organize some things (can't remember what exactly, but I believe just setting up coffee to brew) and went my merry way. Then a guy further down the queue started ticking with his coin on the counter (I really dislike this habit) and after a few seconds shouted: \"Hurry up! I want my coffee!\"\n\nWell.. remember we do it for the fun.. there is nothing for me to be gained doing this.. it was my birthday.. no other student (even though we also ask and have signs suggesting they could help and if they wanted, all they had to do was ask.. sometimes people helped for 10 minutes to get their coffee faster and we were fine with that) would help... hearing that I was a little bit pissed about his entitlement. I frankly told him my opinion and that it was unacceptable (but I have to admit I did raise my voice, which was part of the reason I got my nickname there). Then I continued what I was doing and started serving the customers again. \n\n&amp;#x200B;\n\nCue petty revenge:\n\nWhen it was his turn I looked into his face and said: \"I don't want to serve you. You can go to the end of the queue and hope I'll be in a happier mood next time you're here.\" and ignored him. He actually went back to the queue and waited again (10+ minutes) when he showed up again, I did the same and sent him again to the back of the queue. This happend 2 more times until he gave up.\n\nIt was very fulfilling sending him back every time and wasting his time. Guess he got coffee somewhere else. Oh and yeah I'm happy it was possible due to the structure we have. Employees sadly can't really act like that :D",
        "created_utc": 1678296616,
        "upvote_ratio": 1.0
    },
    {
        "title": "friend stole my lecture notes and exam prep questions.",
        "author": "yako678",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/11lyfwy/friend_stole_my_lecture_notes_and_exam_prep/",
        "text": "[removed]",
        "created_utc": 1678287466,
        "upvote_ratio": 1.0
    },
    {
        "title": "I don't know if I'm wrong for this but....",
        "author": "Ok-Owl-691",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/11ly02h/i_dont_know_if_im_wrong_for_this_but/",
        "text": "So...I used to work at a retail store. It was my first retail job and honestly I liked it because of the people I got to meet and build connection with. I had regular customers whom I have developed deeper connections with. But as usual, I have had the difficulty ones too.\n\nOn this fine day, I was put in the registers and we had a huge sales going on so people have been buying like 30-100 items and the line was so long that we had to open the second sets of registers. I was having an okish day but was putting on brave face for the customers. \n\nAs I called up the next person on line I saw she had her daughter with her and me being lover of kids I waved and smiled but the little girl gave me a dead angry look so I figured she is angry with the world because her mommy didn't buy her anything. But as the mom was placing the items the little girl grabbed a small round toy and placed it on the counter top so I moved it to the side to scan the big items before scanning the small one. The girl pick it up and shove it on my face saying \"you better not put this in a bag okay, you better not put in a bag, you got me, you better not put it, I'm warning you\". I grew up with siblings and have met other children who act like they're giving you a warning but are super sweet so you won't take them too seriously.\n\nThis girl wasn't giving me that vibe and the vibe I got was that she views me as some sort of servant and the fact that her mom didn't correct didn't sit well right with me. From that I realized this girl was just spoiled brat. Mind you I was scanning about 50 items the mom bought so they spend about 20-30 minutes with me and this girl was kept repeating herself. So I decided today is the say she learn the consequences of of her actions. After scanning all the items I placed them in a big bag and then scanned the toy last placed it in a small bag, tie it so tight and then placed it in another bag, tied that and put in another bag. The girl got mad and was screaming at me going \"I TOLD YOU NOT TO PUT IT IN A BAGGG\" I ignored and told her mom how some parents have came back saying the toy broke or got lost so as an extra precautions thing, I like to help my customers get their item home in one piece (was a lie btw) and the mom bought it. I still heard the girl screaming the same thing over and over again as they walked to the parking lot. \n\nThis wasn't a big thing but sometimes I remember this and just think about how parents need to raise their kids better than being a spoiled brats.",
        "created_utc": 1678286335,
        "upvote_ratio": 1.0
    },
    {
        "title": "You played yourself buddy",
        "author": "iwoofjuice",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/11lwhn2/you_played_yourself_buddy/",
        "text": "[removed]",
        "created_utc": 1678282292,
        "upvote_ratio": 1.0
    },
    {
        "title": "Boss complained about me taking too many breaks, regrets it immediately",
        "author": "Several-Brilliant-93",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/11lqzdx/boss_complained_about_me_taking_too_many_breaks/",
        "text": "[removed]",
        "created_utc": 1678264704,
        "upvote_ratio": 1.0
    },
    {
        "title": "Lousy loud Neighbors",
        "author": "Neither_Syllabub_885",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/11lpjgk/lousy_loud_neighbors/",
        "text": "Hey petty revengers, I need help in getting petty revenge on my upstairs neighbor. You see I am always hearing them having sex, banging on walls, moving their furniture around, blasting music in the early mornings or late at nights and I’ve always just dealt with it. I work night shifts and come home around 2-4 AM. Sometimes I’ll be on the phone with my friends who also work nights and sometimes I forget to not talk so loud, one night at around 4 AM we were talking about a concert and I started almost yelling of excitement talking about it and my upstairs neighbors SLAMMED something SUPER hard it made me jump. Oopsies, sorry my bad, and I’ve always tried to keep my voice down and be respectful. Never blast music on my speakers, always on AirPods, always keep TV below 15, But the banging wouldn’t stop! \n\nAs days/ weeks go by, these people would BANG LOUDLY against the walls and floors so loud and unexpectedly throughout the night! Like 3 AM I would LITERALLY be sitting in my room in SILENCE scrolling through my phone and BAM, then another BAM then another BAM. It’s loud and scary! It makes me jump! Like WTH are y’all doing up there?!? I’m not even doing anything?!? Then they played loud music BLASTING with their speakers at 7 AM. Like I get that I sleep during the day and it’s my bedtime and that’s my problem, but what about all the other neighbors?! I don’t think they would appreciate BLASTING crazy music at 7 AM! So I complained to the landlord and it’s stopped… for a little bit. \n\nOne time I was on the phone at 6 AM (I wasn’t loud) and there she goes, BAM against the wall, I had enough, I grabbed my broomstick and BAM BAM BAM hit the ceiling. She immediately came down and knocked on my door, I have a ring camera and can see she wasn’t going to be nice so I didn’t answer. I’m not good with confrontation. After that it’s been smooth. She hasn’t made noise and neither have I. Except two nights ago, again, I was on the phone and I SWEAR I AM NOT BEING LOUD…. BAM!!!! sounds like she dropped a freakin piano on the floor and starts angrily stomping around the floor like WTF? I can’t even talk on the phone?! I just ignore it and turn on the TV. \n\nNow tonight I am working from home and I hear her and her girlfriend arguing…. Then I hear crazy footsteps, then I hear them run outside, girlfriend left, and now she is angrily talking on the phone. And I can hear everything…. I want petty revenge, if I can’t calmly talk on the phone then you shouldn’t be able to comfortably do all the yelling and slamming around but… I don’t want them to know it’s me. What can I do?!",
        "created_utc": 1678259883,
        "upvote_ratio": 1.0
    },
    {
        "title": "How I physically shut up my manager in an unusual way.",
        "author": "FMLitsSML",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/11lo8x8/how_i_physically_shut_up_my_manager_in_an_unusual/",
        "text": "TLDR at bottom, SFW (safe for work).\n\n&amp;#x200B;\n\nThis story takes place a few years ago. I (20F at the time) was back home from university for Christmas. I'd picked up a temporary job in a furnishing company for a few weeks - basically how I paid for my Christmas presents.\n\nI worked with about a dozen others, all men, ranging in age from 30 to 60. They were lovely, no problems at all. The first part of this story is purely my fault, so please bear it in mind.\n\nMy role in the company was purely administrative. I worked in the logistics area. My role was to collect the pickup sheets that had been processed by the stores, check the inventory they'd brought out to the dispatch area, do a quick bit of QA, scan in the internal sheets, update the inventory, and then create release sheets. Whilst this was in the (very early) 2010s, the company still used older systems which weren't fully wireless/automated yet. It worked for them, they didn't need to update it. No bother.\n\n&amp;#x200B;\n\nSo here's where part 1 of petty revenge comes in, which was at my expense. I was barely out of my teens and not really accustomed to the working world. I was also your typical 20 year old in an office environment, thought I knew everything. \n\n&amp;#x200B;\n\nThe process we were to follow was to grab all of the internal tags, head over to the outbound goods desk, scan them via a little PDA, then update the inventory with which serial numbers tied to customer orders, and print off release sheets. Just like any other logistics companies, sometimes we'd have items with damaged or missing barcodes, so I'd have to physically go to the product and type in the numbers I could see. I was lazy and figured I could do most of the job whilst sat in the dispatch bay. Since most of our goods were bulky, it was easier for me to just sit in the dispatch area and faff around on the PDA, rather than go back to the office.\n\nOne of the guys noticed me doing this and he said \"hey SML, I know it's not a big deal, but you might not want to look like you're being lazy. Those PDAs look like phones, best to go to the desk and at least look busy in front of a computer.\"\n\nAt the age of 20 I had no idea what he meant and just said \"no I'm fine\" - he replied, \"okay, well, don't say I didn't warn you.\"\n\nA few days later my manager asked me for a chat. Said the same thing - \"SML, you're doing a good job, but please don't hang around in the dispatch bay. It makes you look like you have nothing to do.\"\n\nSadly, it went in one ear and out of the other. \n\n&amp;#x200B;\n\nWe had a corporate audit coming up, where one of the senior regional managers would be coming by. The guys I worked with realised that I wasn't listening, so they devised a plan. One afternoon I went to the dispatch bay and did exactly as I'd done, for my long career of about 3 weeks. Grabbed the paperwork, sat on a rolled rug shipment, and started to prepare my bar code scanning.\n\nAs soon as I sat down, I felt movement. It was one of the guys, hidden as a package, waiting to scare the living daylights out of me. He grabbed my arms and shouted \"RAAAAAA\" like an angry dragon.\n\nHe succeeded.\n\nI screamed. \n\nLOUD. \n\nI ran out of the dispatch area as fast as I could. One of the guys who was in his truck at the other end of the yard heard me screaming. Everybody inside had heard me. It was hilarious, although at the time I didn't see it that way.\n\nWell, what I did learn was a valuable lesson that day. Sometimes your colleagues look out for you. I followed process every single time afterwards, and when we had our senior visitor attend (who turned out to be the CEO, no less), he stopped at the desk (that I now almost religiously went back to), in order to shake my hand and thank me for what I was doing. \n\nI left on good terms after my temporary contract was over but I applied again the next year, when I was 21, and was accepted. The same guys were working there and they joked about how my screaming was still a highlight of the year before.\n\n&amp;#x200B;\n\nSo, part 2. Time to get my own back.\n\n&amp;#x200B;\n\nThe company had taken a second temp on. Let's call him Mike (M22). Mike was working in the loading area, which is what it sounds like. Loading/unloading trucks. Being that we were roughly the same age and were in the same year at university (he'd taken a gap year), we got along well. As expected there were lots of frivolous \"oh SML are you and Mike an item\" type comments, which were untrue but also light-hearted, so no real issues there. Mike and I did enjoy the attention so we played up to it now and then.\n\nAnyway, at one point there were a lot of items in the dispatch area, and Mike was sent over to help. I remembered my lesson from the previous year so I made sure to tell Mike that we needed to use the desk, which was fine.\n\nOne afternoon I'd wandered over to the desk and noticed there was a pallet with a long bag on top of it, coincidentally close to the desk. Mike had seen it and didn't think twice. However, I realised what it was - mainly because it was the exact same bag the other guys had hidden someone in to trick me the year before!\n\nIt looked like bag man was expecting one of us to go and sit at the desk, at which point they'd roar into life and scare one of us. \n\nI wanted to play the guys at their own game. I asked Mike to follow me into the main office and use the computers there. This wasn't an issue normally, consider it like using a downstairs toilet rather than an en-suite upstairs. A little questionable but nothing that would draw too much attention.\n\nThe bag had mysteriously disappeared a few hours later when we were back in the dispatch area. Mike didn't notice and I knew what the plan was, although I didn't let on. I did, however, tell Mike to keep it quiet, but to expect a package to \"come alive\" at any moment. He knew my screaming story and put two and two together, and said \"okay, got you\".\n\n&amp;#x200B;\n\nA few days later, a bag reappeared next to the computer. I was feeling particularly mischievous that day, so I thought I'd revisit something I hadn't done for over a year.\n\nMike and I went to go and log our records into the computer, but I said \"ah, I'll just sit on this pallet.\" I don't think bag man was expecting it. Well, as per the thread title, you can guess where I sat (spoiler alert, on bag man's face). It's difficult to shout if you're in a cabin bag and have 160 lbs of unforgiving SML sat on top!\n\nThere was a lot of flapping about from underneath me and the rest of the guys, who were hiding, waiting to see what happened, found this even more hilarious than my screaming the year before.\n\nI acted innocent - a little bat of the eyelids and an \"oops, what just happened?\"\n\nMike played it off perfectly. A well-timed sarcastic \"oh dear, who are you in there? Did SML sit on you? My my, that must be so embarrassing.\" \n\n&amp;#x200B;\n\nIt turned out that my manager thought the prank was hilarious first time round, and did indeed want to prank Mike in a similar manner. What I didn't know, was that it was my manager himself who was hiding in the bag. \n\nThis didn't go unnoticed and the guys in the company switched their (good-hearted) teasing to the manager. Not only did he get outsmarted by a \"young girl\", he also couldn't speak until I got up, which of course took me a few minutes to milk the situation.\n\nI appreciate nowadays this might be slightly inappropriate, but as pranks go, this was very well received by all. Even the manager saw the funny side.\n\n&amp;#x200B;\n\nThe eventual fallout was wholesome. My contract with the company expired a few weeks later, but in the meantime the guys treated me like their sister, knowing that I'd learned how the game works. No pranks, always supportive, and on the one day that I called in sick, they'd said to the seniors that I was on an \"experience day\" with one of the truckers (also good guys), so I got paid for that day too. Mike also got upgraded to the \"one of us\" status, but being a young guy, still got a few minor pranks here and there. \n\nThe company subsequently offered me a full-time role but I had another year and a half of education to finish, and I was looking for a role in what I studied. I thanked them nonetheless, went to their Christmas do and am still in contact with a few of them. \n\nThe manager ended up moving to a different site on good terms, as the company had partnered with another logistics firm and they had a similar position open in a town near his wife's parents. As he and his wife had just had a baby, this worked well for them. Mike was promoted to the manager position in the previous location, which the other guys were supportive of. \n\n&amp;#x200B;\n\nTLDR: long-serving staff petty revenge my ignorance. I petty revenged them back. All in shop floor humour and everybody remained friends. Nobody clapped.",
        "created_utc": 1678255708,
        "upvote_ratio": 1.0
    },
    {
        "title": "I ended up on a MURAL facing my exes window.",
        "author": "tmonfredini2",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/11lnnau/i_ended_up_on_a_mural_facing_my_exes_window/",
        "text": "I thought this was kind of awesome. \n\nA long time ago I had a relationship that ended poorly. There was a cheating incident involved and not participated in by me, so that’s all I’ll say about that. \n\nThere was a huge fight and then the breakup and then a long period of not seeing each other. (I’d say about six months) \n\nHere and there I’d hang with a mutual friend who always gave me all the drama. “She hates you” “She thinks you’re in the wrong for not seeing her side” and then my personal favorite: “she thinks you’re ugly”. \n\nI just rolled with it and moved on with my life. Looking back, I chalk that relationship up to “shit happens” \n\nTHEN! My good buddy who is an artist, asked if he could use my face, as well as several other peoples faces for a mural he was painting. It was a move with the record label I work for to team up with him, and they got the permits and everything. \n\nOne day, weeks later I’m driving through town, having only seen texts of the finished product and actually being very impressed at the finished project through photos. I’m at the corner next to where my ex lived and low and behold I see my “ugly” mug plastered on the white wall directly facing her window. \n\nAnyways that’s my story. Mural only stayed up for a few months but I take solace in the fact that she got to see my “ugly face” every day for a good long while.",
        "created_utc": 1678253887,
        "upvote_ratio": 1.0
    },
    {
        "title": "I started calling my she/her (biologically male) ex he/him via text.",
        "author": "FiveShotLynel",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/11llp3i/i_started_calling_my_sheher_biologically_male_ex/",
        "text": "[removed]",
        "created_utc": 1678248238,
        "upvote_ratio": 1.0
    },
    {
        "title": "\"Bank Transaction Fees\" and 2.5% charge for Debit Card as Payment Method?",
        "author": "Alarming_Square8891",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/11lkxla/bank_transaction_fees_and_25_charge_for_debit/",
        "text": "[removed]",
        "created_utc": 1678246148,
        "upvote_ratio": 1.0
    },
    {
        "title": "I despise people who speed through school zones. So I got revenge.",
        "author": "Dredgen_Erwin",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/11liy9q/i_despise_people_who_speed_through_school_zones/",
        "text": "As a kid, I can’t tell you how many times I was nearly hit by a car speeding through a school zone. Although it may have been because of personal incompetence on my end, I still saw no reason why people sped through school zones. So I called the non-emergency police line and reported that people were repeatedly speeding around my elementary school. Keep in mind, I was in 5th grade at the time. That very next week, there was not one, not two, but three cars pulled over for speeding through. Needless to say, my plan had worked. \n\nOh, but this wasn’t the only act of petty revenge I’ve committed.\n\nNow I’m an adult. When I go to pick up my girlfriend, I pass by a busy elementary school that always has the sidewalk packed with kids and their parents. Speed limit is normally 35mph, but with the school zone it’s 25mph. I’ve witnessed people going upwards of 45-55mph through there. Don’t get me wrong, I drive fast too. I’m a huge car guy, so speed and horsepower are kinda my thing, but I refuse to speed through school zones. So what I’ve started doing is purposefully inconveniencing speeders. I’ll slow my happy ass down to 15mph if I see someone speeding. Yesterday, for example, I was passing by the school zone, during that school’s dismissal, and doing 25mph like a good citizen I am. I see a very nice Corvette Z06 doing about 40mph behind me. They started tailgating me, so in spite, I slowed down to 15mph. I even stayed that speed past the school zone, and when I took my turn off the street, I was extraordinarily slow about it. I turned on my blinker, and about a block away from my turn, I started slowly applying the brake, going slower and slower and slower. He was continually flashing his headlights, honking his horn, etc. and I just sat there with a huge smile on my face. I heard him speed off, and all the only feeling I felt was pure joy and happiness.",
        "created_utc": 1678240987,
        "upvote_ratio": 1.0
    },
    {
        "title": "Funny thing we saw one morning",
        "author": "Faith75070",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/11likta/funny_thing_we_saw_one_morning/",
        "text": "My husband and I used to live in a very big  building with somewhat of 200 condo's. The building was L-shaped and maybe 7 stories high. Inbetween the sides of the building was a large parking area. It had enough spots for all the cars belonging to the renters in the building. One neighbour used to persistently park his car in front of the main entrance of the building, wich was not an assigned parkingspot. He was very proud of his car and was very protective of it. He felt entitled to place his car in that spot. He blocked people in wheelchairs, motorcarts and people with buggy's. He didn't care as long as his car was safe. Annoying. But we didn't think much of it.\n\nOne morning my husband and I bumped into him in the main entrance hall. He aproached us and asked us if we heard or witnessed something last night or early morning. The guy was close to tears. Someone had damaged his car. We didn't hear or see anything. We went our way. Of to work. Outside, near his car were two cops sizing the damage to his car. They had a puzzled look on their face. As we passed the car, whe saw a large and very deep indent in the hood of his car. In the indent there was resting a seemingly large and heavy iron. (The kind you iron your clothes with.) My husbands and my eyes got very big. But whe kept our composure until we got in our car. We burst out laughing en laughed all the way to work. \n\nWill never forget my neighbours sad face. Sometimes I feel bad for laughing at his misery...but no, fuck him.",
        "created_utc": 1678240055,
        "upvote_ratio": 1.0
    },
    {
        "title": "Roommate watches TV and talks on the phone until 5 in the morning, We share a room",
        "author": "Skelezz",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/11lhlon/roommate_watches_tv_and_talks_on_the_phone_until/",
        "text": "[removed]",
        "created_utc": 1678237519,
        "upvote_ratio": 1.0
    },
    {
        "title": "Evict me after making it impossible to pay rent? Enjoy your court fines!",
        "author": "wiltedtree",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/11len9k/evict_me_after_making_it_impossible_to_pay_rent/",
        "text": "First time posting so please excuse anything out of whack. I do not give permission to any part of this story to be used anywhere. Seriously, don’t use it.\n\n​\n\nI live in a VERY landlord friendly area (Miami) where rent is beyond ridiculous and practices are shady. The last place we lived was a small 2/1 duplex. Lived there for over 4 years before the landlord got greedy and decided he wanted to raise our rent by an additional $700 a month. We had been having issues with the place falling apart for the last 2 years and nothing being done about it. By law, he needed to give us a written notice of the increase 30 prior to it going into effect and told him so. Don’t hear anything back from him. Instead, he immediately filed an eviction for non payment as we were not adding the extra money. We didn’t even know he had filed it against us until almost 2 months later since he never posted anything like a notice to us and stopped answering us back. He even closed his bank account that we sent rent payments to. Tried to fight it, paid the rent directly to the court, in the end, but had to be out of there. Judge didn’t even let us speak.  Not only did we lose our 3 month deposit, we lost everything paid to the courts as well. It was a rough 2 weeks scrambling to find a place to live and come up with a new deposit.\n\nWe ended up finding an amazing new place so happy ending for us. But, I’m angry. I did not need the added stress in my life. This is when I come to find out this duplex is all under illegal construction. No permits. Shared utilities (a big no no). Other massive illegal jobs done incorrectly on the property. So, I decided to contact the county. Filed a report. Forgot about it. Weeks later, we hear that a county inspector showed up and has now fined him thousands of dollars and he will continued to be fined DAILY until everything is fixed. He can’t even sell the place until it’s done.\n\nHell hath no fury like a woman scorned.",
        "created_utc": 1678230398,
        "upvote_ratio": 1.0
    },
    {
        "title": "A long time coming",
        "author": "N0CLlP",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/11ldpd3/a_long_time_coming/",
        "text": "[removed]",
        "created_utc": 1678228331,
        "upvote_ratio": 1.0
    },
    {
        "title": "Petty revenge request: what are the laws regarding holding a protest outside a politician’s house, considering the fact that I’ve had beef with these people in high school?",
        "author": "Yt_GamingwithCharlie",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/11lbybf/petty_revenge_request_what_are_the_laws_regarding/",
        "text": "[removed]",
        "created_utc": 1678224502,
        "upvote_ratio": 1.0
    },
    {
        "title": "a good fence from a bad neighbor.",
        "author": "iknowthissoundsweird",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/11lasok/a_good_fence_from_a_bad_neighbor/",
        "text": "not my story, but a friend of mine told me this one recently.\n\nshe lives on a decently large lot that's been in her family for a couple generations. it used to be outskirts farm land, but development has been encroaching for a while. \n\nher house was built by her grandparents, and she bought it when they both passed. it's kind of old. it needs a ton of work. she's doing it a little at a time as she can afford it. \n\na while ago, the lot next to her was bought by a developer. they cleared the land to dirt and some apartments or something are going up soon.\n\nthere was a pretty old chainlink fence separating the very long property line, and the new landowner decided to replace it with a block wall. he knocked on her door one day to ask if she wanted to go halfsies. she said she'd like to, but apologized and said she doesn't have that kind of money. he got pissed she couldn't share the cost and said he was going to tell the contractor not to finish the side of the wall she could see, so the mortar would be all glooping out and look terrible. she thought that was unnecessarily mean, but couldn't do anything about it.\n\nfast forward to the day the building crew shows up the construct the fence. they knock on her door. the cleared land now has zero water access and they can't complete the job without access to water.\n\nshe confirmed with the foreman that the land owner had told them not to finish one side of the fence. the foreman agreed that if they could use her garden hose for the day, they wouldn't make her side look crappy.\n\nnot only that, they also paid her $100 cash for the water, which they no doubt then billed to their client as part of the job.",
        "created_utc": 1678221971,
        "upvote_ratio": 1.0
    },
    {
        "title": "Another company email disaster",
        "author": "Cheap_Direction9564",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/11l84ey/another_company_email_disaster/",
        "text": "[removed]",
        "created_utc": 1678216022,
        "upvote_ratio": 1.0
    },
    {
        "title": "Handicap Spaces Are About Accessibility, Not Convenience",
        "author": "dogswelcomenopeople",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/11l7kyt/handicap_spaces_are_about_accessibility_not/",
        "text": "Many years ago my daughter has been fussy all day long. My wife was ready to pull her own hair out, therefore, I took my daughter with me to the store. She was very young, and pretty, with the cutest little purple wheelchair secondary to Spina Bifida. We get to the store, unload her wheelchair from the Chevy Suburban, she climbs down into said chair, and off we go. After shopping is done, we’re back at the Suburban reversing the process to load her up and stow the chair.\n\nAs I’m loading said chair, dude pulls up next to me in a new Corvette still with paper tags on it. Convertible, containing dude and his trophy, er, significant other. I casually mention that he’s pulled into a row of handicap space without a handicap tag or placard. He’s says yeah, I know, and saunters off to shop with his SO. Well I’m a little pissed at this moment, but don’t want to do damage to such a beautiful car. Then, an evil thought enters my brain.\n\nI go to the cart storage, just in front of where we’re parked. I put carts in a loose formation around his car. Security guard comes out, but just watches. A n off-duty city cop also comes out, and also just watches. I proceed to put several layers of carts, tightly packed together, 360 degrees around his car. I approach the guard and city cop, and explain that dude was using handicap space for convenience, not due to an accessibility problem. I point out that no carts are touching his car, so no damage, but that he sure as hell has an accessibility problem now! They both crack up laughing at this point. The cop says that he hopes the guy complains, because he’ll write a ticket to the dude. I laughed quite a bit over this, and quite frankly, still do every now and then!",
        "created_utc": 1678214825,
        "upvote_ratio": 1.0
    },
    {
        "title": "Loud neighbors in college - two can play at that game",
        "author": "ValkyriesOnStation",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/11l5y0e/loud_neighbors_in_college_two_can_play_at_that/",
        "text": "This story is from when I was in college and lived upstairs from Berkley students. \n\nNow, to set the stage. I originally loved our downstairs neighbors. There were 5 of us living upstairs and 5 in their unit. We hung out with them from time to time and we joined each others parties. Nothing too crazy, just late college nights with plenty of drinking.\n\nFast forward a year and the situation changed. Only 2 of the original neighbors were left with 3 new students moved in. First thing they did is throw a massive party. The party itself didn't really bug me, but what did is when I got home from work I was stopped from going into my house by some drunk 19 year old I've never met, on the porch in front of my door, asking me who I knew (in my own house). \n\nMy answer, \"I live here, and I'll call the cops if you don't let me by.\" \n\n\"Oo ahh no, you can go in.\"\n\n\"Really, I'm allowed to go in my own house?\"\n\nThis really irritated me. But after this night, for the most part, things were manageable. \n\nThere were a few situations where they got really loud. Mostly just big parties. One time a kid started playing drums at 2am. We went down there and they were cool and immediately stopped. I wasn't offended, sometimes you get drunk and get out of control. College me was a reasonable man. They stopped right away so no big deal. Just sucked that some of my roommates who work early got woken up by it.\n\nThings were cool, until halfway though the semester, some girl moved in who really, really sucked.\n\nShe would have really loud sessions in her room that made our whole upstairs shake. She played bass, and she would start playing at 1am and go really late. She also had tons of people in her room playing with her so it was incredibly loud.\n\nHer room was also directly under my room so it started to drive me crazy.\n\nWe went down there to talk to them about it but her roommates wouldn't confront her, and she would never come face us. They said 'that is just the way she is.'\n\nI banged on the floor and I yelled out my window at hers only to be met by laughter.\n\nAfter 2 weeks of this, one night I was fast asleep and got woken some point after midnight with incredibly loud music. So loud that I enacted the plan I had been cooking up the last few nights.\n\nI booted up my laptop. Opened my pirated copy of FL Studio. Added the FL Kick to my pattern sequencer. Mixed the hardest bassiest sound I could muster, and turned my sub woofer all the way up. \n\n140 BPM and.... **BOOM... BOOM... BOOM... BOOM... BOOM...**\n\nIt was loud. And my sub was on the floor right over her room. No one could possibly play anything and hear themselves with the racket I was making.\n\nAnd now that I'm up, going to shut the door to my room and play some Mass Effect in the living room. I played for about 20 minutes while my masterpiece of a mix was going. My roommates came out because they are now all waking up and I just raised my hand, 'don't worry, I've got the whole situation covered.'\n\nAfter 20 minutes was up I turned my mix off, and only just started to hear the broom handles they were banging on their ceiling. I must have woken up all my downstairs neighbors because I can hear plenty of yelling and banging from all over.\n\nGood.\n\nOnce they realized the battle was over... silence. \n\nPure silence.\n\nI never did hear another peep from that girls room. Not for the remainder of that year she lived there.\n\nIn fact. I don't think we ever had a noise issue from them ever again after that. I remember hearing from one of my roommates that they were finally able to talk to her about being loud late at night after my stunt.\n\nI don't think anyone down there was very happy with me, but their happiness wasn't causing me to lose any more sleep.",
        "created_utc": 1678211203,
        "upvote_ratio": 1.0
    },
    {
        "title": "Try to BS me into thinking my land is yours? Get a property line stake right in front of your door.",
        "author": "WinterApart4464",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/11l53v1/try_to_bs_me_into_thinking_my_land_is_yours_get_a/",
        "text": "[removed]",
        "created_utc": 1678209268,
        "upvote_ratio": 1.0
    },
    {
        "title": "Mug of Revenge",
        "author": "No-Way-6986",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/11l1ho4/mug_of_revenge/",
        "text": "[removed]",
        "created_utc": 1678201008,
        "upvote_ratio": 1.0
    },
    {
        "title": "Screw me? No, screw you.",
        "author": "JustCallMeDuchess",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/11l19cn/screw_me_no_screw_you/",
        "text": "First time posting so please excuse anything out of whack. I do not give permission to any part of this story to be used anywhere. Seriously, don't use it.\n\n&amp;#x200B;\n\nI live in a VERY landlord friendly area (Miami) where rent is beyond ridiculous and practices are shady. The last place we lived was a small 2/1 duplex. Lived there for over 4 years before the landlord got greedy and decided he wanted to raise our rent by an additional $700 a month. We had been having issues with the place falling apart for the last 2 years and nothing being done about it. By law, he needed to give us a written notice of the increase 30 prior to it going into effect and told him so. Don't hear anything back from him. Instead, he immediately filed an eviction for non payment as we were not adding the extra money. We didn't even know he had filed it against us until almost 2 months later since he never posted anything like a notice to us and stopped answering us back. He even closed his bank account that we sent rent payments to. Tried to fight it, paid the rent directly to the court, in the end, but had to be out of there. Judge didn't even let us speak.  Not only did we lose our 3 month deposit, we lost everything paid to the courts as well. It was a rough 2 weeks scrambling to find a place to live and come up with a new deposit.\n\nWe ended up finding an amazing new place so happy ending for us. But, I'm angry. I did not need the added stress in my life. This is when I come to find out this duplex is all under illegal construction. No permits. Shared utilities (a big no no). Other massive illegal jobs done incorrectly on the property. So, I decided to contact the county. Filed a report. Forgot about it. Weeks later, we hear that a county inspector showed up and has now fined him thousands of dollars and he will continued to be fined DAILY until everything is fixed. He can't even sell the place until it's done. \n\nHell hath no fury like a woman scorned.",
        "created_utc": 1678200432,
        "upvote_ratio": 1.0
    },
    {
        "title": "Nigerian Prince to the rescue!",
        "author": "Apprehensive-You7643",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/11kxnz5/nigerian_prince_to_the_rescue/",
        "text": "[removed]",
        "created_utc": 1678191069,
        "upvote_ratio": 1.0
    },
    {
        "title": "¿Soy la mala por no cuidar a mi sobrina?",
        "author": "Solid-Training9586",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/11kx29u/soy_la_mala_por_no_cuidar_a_mi_sobrina/",
        "text": "[removed]",
        "created_utc": 1678189337,
        "upvote_ratio": 1.0
    },
    {
        "title": "Reddit users what was the worst thing that happened to you on the darkweb",
        "author": "fallienking123",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/11kwp5m/reddit_users_what_was_the_worst_thing_that/",
        "text": "[removed]",
        "created_utc": 1678188245,
        "upvote_ratio": 1.0
    },
    {
        "title": "I can show you the world",
        "author": "ConcentrateAfraid849",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/11kvjqh/i_can_show_you_the_world/",
        "text": "[removed]",
        "created_utc": 1678184683,
        "upvote_ratio": 1.0
    },
    {
        "title": "Japanese hot massage || hot oil massage || Japanese massage oil || oil m...",
        "author": "victoriaforrest",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/11kts0v/japanese_hot_massage_hot_oil_massage_japanese/",
        "text": "",
        "created_utc": 1678178389,
        "upvote_ratio": 1.0
    },
    {
        "title": "Cock-a-doodle doo to you, neighbor!",
        "author": "Khalil_al-Besa",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/11kte3i/cockadoodle_doo_to_you_neighbor/",
        "text": "[removed]",
        "created_utc": 1678176976,
        "upvote_ratio": 1.0
    },
    {
        "title": "A smelly revenge on some entitled \"models\".",
        "author": "skipyeahbuddy",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/11ksu91/a_smelly_revenge_on_some_entitled_models/",
        "text": "One fine Sunday afternoon recently, my girlfriend and I took a couple of beers and a fishing rod down to the river for a swim and a relax.\n On our way to our spot we walked past a group of good looking young people doing a bit of a photo shoot using the board walk with the river in the background. There were two guys in boardshorts and two girls in very small bikinis, a photographer and an assistant all having a couple of beers and generally just laughing and having fun while getting some lifestyle type photos for what I think may have been a small sunglass brand. (Think Instagram level of marketing, nothing particularly professional)\n We found a quiet spot further along on the sand where I proceeded to chill and catch bugger all. There was another family beside us fishing as well, mum and dad and their two kids. The son actually caught a small fish at one stage.\n After a while the photoshoot moved down into the water, for some splashing photos and stuff. They were gradually making their way further along the bank until they were directly in front of the family and the kid fishing and continued to splash water around for their photos. At one point they even laughed and said \"Omg we've just taken over your spot haven't we?\" but made no effort to apologise or move out of the way. The family seemed polite and just put up with it but I was angry for them.\n Pretty soon it was time for us to pack up leave and as usual I looked around to pick up any other rubbish that I could take with me as well, I try to look after what I enjoy. Someone had left a bag of bait prawns, apparently from quite a bit earlier in the day as they were blackened by the sun and stank a bit. I started to throw the prawns (not the plastic bag) into the water, thinking the fish might still eat them and noticed that they were drifting in the current towards the photo shoot. So I proceeded to throw the rest a bit further out to make sure the current would take them right through the middle of where the \"models\" were.\nMy girlfriend heard me chuckling to myself and asked what was so funny and had a good laugh as well when I showed her. Unfortunately as we were walking away we got distracted chatting and I never did see their reaction, I like to think they would have been grossed out but they were probably too full of themselves to even notice. Still made my afternoon a little funnier.",
        "created_utc": 1678174967,
        "upvote_ratio": 1.0
    },
    {
        "title": "Busy prison officer",
        "author": "dunc180",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/11kriqw/busy_prison_officer/",
        "text": "[removed]",
        "created_utc": 1678170452,
        "upvote_ratio": 1.0
    },
    {
        "title": "Vandalize my house over a boy? Just wait until Christmas",
        "author": "PrincessofPetty94",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/11kpsjo/vandalize_my_house_over_a_boy_just_wait_until/",
        "text": "[removed]",
        "created_utc": 1678165315,
        "upvote_ratio": 1.0
    },
    {
        "title": "I'm sorry I don't have any one to relieve you.",
        "author": "Super_Rando_Man",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/11kopbp/im_sorry_i_dont_have_any_one_to_relieve_you/",
        "text": "So I worked for a security company that literally hired the least competent supervisors possible.\nThe one that hired me effed up my payroll and for the duration my w2s had a k as my MI. Expected an audit every year.\nI was started at a site that paid 12 and after 2 weeks was moved to another paying minimum. \nI was the only person drug tested since noone else would pass from my site.\nI worked 6 months graveyard when I was supposed to get the first morning shift avail .I had school age kids and all the new hires got morning after my stupid self agreed to work the new site and rate I guess.\nGot a 10$hr site and after 6 most it went to his new assistants wife.\nThey both wound up quitting 2 months later and we lost the site.\nThe final straw was the last site I worked my relief was the most unreliable schmuck ever. 6 times I had no relief till 1-4 hours after the end of my shift ... I was a single parent my kids got home 2hrs after my shift ended... they were 4 and 6 . My bosses response not my problem if you leave you are fired. Family managed to get there but once just as the bus arrived since they had little notice. \nI began applying everywhere.\n\nMy petty revenge\n12 am email to corporate outlining everything effed up he did. Resigned and forwarded him the email. When he called 10 mins after corporate begging me to cover my shift for 2 weeks so he can find someone I laughed and said \"how's that my problem? if you don't find someone fast your fired! (The client only kept the contact a week due to lack of coverage. And all contracts in the region 5 mos later.) I of course told him harassment lose my # etc.\n\nTLDR SECURITY boss put my kids at risk so I left him in a lurch.\n\nIf my quitting led to them losing more sites and people their jobs I hope yall got unemployment.",
        "created_utc": 1678162287,
        "upvote_ratio": 1.0
    },
    {
        "title": "Don’t get even. Get ahead.",
        "author": "Icy_Nerve_6477",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/11knl33/dont_get_even_get_ahead/",
        "text": "Long one sorry but first time posting and I had to get this out.\n\nSo I live in a fraternity house at a big 10 school. I am a sophomore in college and during my freshman year, I dated a girl from roughly November until late august just before school started back up. I thought she was awesome and she would always hang out with my friends and I. After we broke up, I was extremely depressed and would drink every day for around 2 months. \n\nHowever, she said that she still wanted to be friends. I eventually realized that this was horrible for my mental health and that I was being manipulated and jerked around a lot and told her she needed to start treating me not like I was a joke or I couldn’t have her in my life. We haven’t spoken since. \n\nIt was around this same time that my roommate who was one of my closest friends the year before, began treating me like absolute shit. He would constantly pick fights and call me stupid, retarded, etc (I am also slightly on the autism spectrum so this stung a bit). I just assumed it was because he was attracted to the new girl I had been talking to (which as it turns out he was).\n\nAbout two weeks ago, I found out that my roommate had tried to drunkenly confess his love to the new girl and had also told her that he had been hooking up with my ex and the first time it had happened was in the bunk bed underneath me while I was passed out during the two month bender. \n\nWhen he found out that she told me he sent her a series of absolutely horrible texts trying to gaslight her into thinking it never happened. I asked a few of my exes best friends who I was still close with and they confirmed that my ex and roommate had hooked up. While I was livid, I have been trying to be a less violent and reactionary person. \n\nIt was then that I realized we were having a Greek wedding with a sorority and my roommate had been trying to get with an uninterested girl in that sorority for the last year and a half. She was also one of my friends so I asked her if she wanted to get married, and when we exchanged our vows (where we basically just make a bunch of good natured sex jokes at each others expense), I closed it out by saying that I was marrying her so that my roommate had a chance, since he wouldn’t hook up with a girl until after I had already done so. I also made him my best man for this. \n\nIn addition, someone reminded me that he had sworn on the house that he had not hooked up with my ex a few months back. When you break an oath on the house, you get kicked in the balls at the next house meeting. Guess who did the honors…\n\nMy last bit of revenge was to move out of the room and take the refrigerator. However, I did leave behind copious amounts of itching powder in his underwear, sheets, etc. as well as a device that beeps at random intervals hidden in the room. I don’t believe he will be able to find it. He has lost any friends and respect he has in the house, and many other sororities in Greek life now hold my ex and ex roommate in contempt and they are the butt of many jokes. Don’t get even. Get ahead.",
        "created_utc": 1678159227,
        "upvote_ratio": 1.0
    },
    {
        "title": "Petty corporate email",
        "author": "TheMothmanProbably",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/11knjds/petty_corporate_email/",
        "text": "At work there are currently 4 of us that do the same job, all on different shifts. One girl sends an excessive amount of emails. It’s become a topic of conversation with every one else that works in our office and we’re all sick of getting her emails. People have talked about asking her supervisor to limit how many she can send a day. \n\nThe rest of us can go days without needing to send an email; she routinely sends more than 5 a day. Generally her emails are clarifying things that she would know if she had paid attention earlier, or complaining about someone not doing the most minuscule part of our job. (It’s important to note that she’s on second shift so she has an abundance of free time that those on day shift don’t have)\n\nShe also likes to include far too many people on these emails. She includes managers, supervisors, people from other shifts, people who have absolutely nothing to with the situation. \n\nSo awhile back she sent an email to the three other people who do our job, 2 managers, a supervisor, and a person from a different department just to say that another employee on my shift forgot to do something. The thing is that people on her shift constantly forget the same thing and I have to spend the first 20 minutes of my day unfucking things they fucked up. I always just fix it myself and leave her a post it so she can tell the employee. \n\nThis particular day I was beyond done with her. So I hit reply all to her email and listed the 5 or 6 things that got fucked up or forgotten on her shift the night before. She never replied.",
        "created_utc": 1678159102,
        "upvote_ratio": 1.0
    },
    {
        "title": "Noisy Neighbor Petty Revenge Inquiry",
        "author": "koolaidgrl",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/11km2oa/noisy_neighbor_petty_revenge_inquiry/",
        "text": "[removed]",
        "created_utc": 1678155336,
        "upvote_ratio": 1.0
    },
    {
        "title": "I made an elaborate plan to get away with throwing a roach at a bully in 7th grade.",
        "author": "NoOutlandishness5969",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/11kkxpv/i_made_an_elaborate_plan_to_get_away_with/",
        "text": "[removed]",
        "created_utc": 1678152525,
        "upvote_ratio": 1.0
    },
    {
        "title": "Am I the asshole?",
        "author": "lassseerrrtaaggg",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/11kir2o/am_i_the_asshole/",
        "text": "[removed]",
        "created_utc": 1678147254,
        "upvote_ratio": 1.0
    },
    {
        "title": "I need suggestions on how to be petty.",
        "author": "chris3-tom3",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/11kgfcb/i_need_suggestions_on_how_to_be_petty/",
        "text": "[removed]",
        "created_utc": 1678142011,
        "upvote_ratio": 1.0
    },
    {
        "title": "That time my grandad changed our last name and started a passive-aggressive multigenerational intra-familial feud.",
        "author": "AnonTricky6841",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/11kfmer/that_time_my_grandad_changed_our_last_name_and/",
        "text": "[removed]",
        "created_utc": 1678140199,
        "upvote_ratio": 1.0
    },
    {
        "title": "Traffic cones of doom",
        "author": "Svirfnil",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/11kfe8l/traffic_cones_of_doom/",
        "text": "At a previous rental house, there was an old gravel/dirt access road that cut between my house and my neighbors, and the two houses behind us. I think it was a remnant of the old neighborhood and the city never paved it, it was barely wide enough for a car. No one knew who's property it belonged to, no one really used it except for spare parking during the holidays. It was also a safe place for our kids/neighbor's kids to play on bikes and such.\n\nAt some point a guy in a Tahoe found it and started using it as a shortcut from my street to the next street over instead of going all the way down the street to the stop sign, which saved him all of 45 seconds. Never saw him parked anywhere in my neighborhood, he just came through a few times a week. \n\nWouldn't have been a big deal, but he liked to floor it, kick up gravel, and go as fast a possible right between our houses.\n\nMy neighbor bought a couple of small traffic cones and placed them halfway up the road so you'd have to do a slow wiggle to get around them in a vehicle. Couple of days go by and she comes over with her traffic cones, which had been obliterated, and says she saw the same guy run them over.\n\nI go out and buy a couple of more cones, maybe 18\" tall. And an 80lb bag of concrete. Flipped them over, stopped up the tops of the cones with duct tape and filled them to the brim with concrete. Once they dried I put the two 40lb cones in the same places my neighbor had hers, and let the neighbors know what was up.\n\nUnfortunately I missed it, but my neighbor didn't. Tahoe boy did his usual gravel spinout and absolutely nailed one of my cones. She heard the impact and saw him get out, check his vehicle and drive away. I never saw him again after that, but I like to think I left a reminder on his vehicle to not Dukes-of-Hazard a tiny access road inbetween houses.",
        "created_utc": 1678139729,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is Marilyn Manson a dangerous Cult leader?",
        "author": "Forsaken_Ring_6470",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/11kf71i/is_marilyn_manson_a_dangerous_cult_leader/",
        "text": "[removed]",
        "created_utc": 1678139299,
        "upvote_ratio": 1.0
    },
    {
        "title": "Jeopardise our grades? We’ll jeopardise your reputation.",
        "author": "DankestDrew",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/11ke5xv/jeopardise_our_grades_well_jeopardise_your/",
        "text": "[removed]",
        "created_utc": 1678137109,
        "upvote_ratio": 1.0
    },
    {
        "title": "I have an email and a phone number. help me melt them down",
        "author": "TruthBomb2112",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/11kcaqa/i_have_an_email_and_a_phone_number_help_me_melt/",
        "text": "[removed]",
        "created_utc": 1678133194,
        "upvote_ratio": 1.0
    },
    {
        "title": "petty on corporate level",
        "author": "riosader69",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/11k9m00/petty_on_corporate_level/",
        "text": "English not my first language, so on, so on... \n\nI really hope this fits the sub, immediately thought of this when I finished reading up on this. \n\nSo, this is obviously not my story. It's about a german chain of grocery stores and Mars... Like \"Mars bar\" Mars. It's big and in my opinion deliciously petty.\n\nA few months ago Mars raised the prices for all of their products. Sweets, cat food, everything. They justified this with increased costs in energy and ingredients. At first glance totally fair.\n\nEdeka is a german chain of grocery stores who also produce their own products in pretty much every category of food stuff (and also other things), so they kinda know about production costs and the like. Of course they also sold Mars products in their stores.\n\nMars informed them about the raised prices and Edeka told them they were too high. In their opinion the increases were much too steep and couldn't be justified by energy and other costs. They felt that Mars was using the current situation as an excuse to increase prices overall and take advantage of their customers. So they started negotiations.\n\nRoughly half a year later they realized that they will not be able to reach a compromise and ended all contracts. That applies to brands like Whiskas or sweets like Snickers, Bounty, Mars and... M&amp;Ms. That's important. Checovs candy. \n\nTo fill the gaps on the store shelfes they had to form new contracts with other manufacturers. One of those is Katjes, a german candy manufacturer who was then contracted to supply a substitute for M&amp;Ms called Treets.\n\nTreets is pretty much the same as peanut M&amp;Ms but old as hell. They were first produces in the 1960s by Mars! They were discontinued in '88 and briefly reintroduced in 2009 but unlimately Mars decided to sell the brand to Katjes, a german company who restarted production in 2018... and is now supplying Edeka with a brand that used to be owned by the former contract holder Mars. \n\nSo basically what happened is this:\n1. Supermarket chain was pissed off with Mars because they felt they were trying to rip them off.\n2. They terminated the contracts with Mars and replaced one of their bestselling products with a brand they sold a few years ago.\n3. Profit! \n... For Treets. Because Edeka is a huge chain and that shit is delicious so they're gonna swim in cash. \n\nNever seen a middle finger on this kinda scale before. Absolutely stunning.",
        "created_utc": 1678128026,
        "upvote_ratio": 1.0
    },
    {
        "title": "Am I right or just petty?",
        "author": "Queasy-Guard3426",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/11k8y70/am_i_right_or_just_petty/",
        "text": "[removed]",
        "created_utc": 1678127207,
        "upvote_ratio": 1.0
    },
    {
        "title": "my petty little revenge",
        "author": "CreepyOptimist",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/11k8mly/my_petty_little_revenge/",
        "text": "Just done with work for the day I went to the bakery to get bread, there was a line, so I stayed in line behind the others , and one woman with her kid (about 10 years old give or take). They were behind me and I could see her out of the corner of my eye looking at the respectful distance I was keeping from the person ahead of me, I could feel her breathing down my neck and I could hear her kid wanting a specific type of bread, by the time I was next in line she had gone through the other door the bakery has and jumped the line and when she tried to step ahead of me but I was faster. To my amusement there was only one piece left of what the kid wanted. So I bought that, smiled to the cashier and left.",
        "created_utc": 1678126835,
        "upvote_ratio": 1.0
    },
    {
        "title": "Oops I broke Rule 1. Sorry for being an idiot",
        "author": "jleile02",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/11k6w0k/oops_i_broke_rule_1_sorry_for_being_an_idiot/",
        "text": "[removed]",
        "created_utc": 1678124879,
        "upvote_ratio": 1.0
    },
    {
        "title": "Oops I broke Rule 1. Sorry for being an idiot",
        "author": "jleile02",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/11k6vfa/oops_i_broke_rule_1_sorry_for_being_an_idiot/",
        "text": "",
        "created_utc": 1678124859,
        "upvote_ratio": 1.0
    },
    {
        "title": "Late Night Text Message",
        "author": "iacceptthecookies",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/11k4req/late_night_text_message/",
        "text": "[removed]",
        "created_utc": 1678122431,
        "upvote_ratio": 1.0
    },
    {
        "title": "Exlax brownies",
        "author": "whizewhan",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/11k4q81/exlax_brownies/",
        "text": "[removed]",
        "created_utc": 1678122364,
        "upvote_ratio": 1.0
    },
    {
        "title": "I got my revenge on a guy who demanded a free kick after purposely hurting someone.",
        "author": "Public_Tension_6639",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/11k3l82/i_got_my_revenge_on_a_guy_who_demanded_a_free/",
        "text": "[removed]",
        "created_utc": 1678120364,
        "upvote_ratio": 1.0
    },
    {
        "title": "Triggered?",
        "author": "Tubist61",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/11k2vze/triggered/",
        "text": "A little bit of context for you here if you're not from the UK. There is a slang word that is reported to have originated in prison that is used to describe sex offenders, the word is nonce. It is actually a much older word that's been around for meany years and in the dicrionary it's used to describe something that is a throwaway, a word used once and once only. It is also a word used in cryptography to describe a random number used once in a cryptographic communication, a system establishing a secure connection will start by asking a server to send a nonce and then that is used in the cryptographic handshake between machines.\n\nNow we have that set out, I arranged a tutorial for a group of my students the other day and I sent out  a meeting invite to the group with the meeting title \"Nonces and why we need them\". All but one of the group accepted the meeting request (a surprise in itself) but one did not and when I chased them up for a response I got nothing back. A few hours passed and my head of department popped in and said she had a complaint about me from a student. I was a bit surprised by this but asked what the complaint was. She showed me the email with a huge grin, my meeting request was there and the email was all in upper case demanding I was disciplined for daring to support paedophiles. \n\nMy head of department had explainied that my student had completely misunderstood and explainined what a cryptographic nonce was. I wasn't going to let this opportunity go by and sat down to set a selection of assignment questions for the end of this block. Question 1 needs a discussion of the TLS nonce replay attacks, question 2 is the role of nonces in blockchain, question 3 is an essay on how to mitigate XSS with a nonce based strict content security policy. Petty, yes, but amusing all the same.",
        "created_utc": 1678118810,
        "upvote_ratio": 1.0
    },
    {
        "title": "Advice on Revenge (nothing too crazy)",
        "author": "jleile02",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/11k2ekd/advice_on_revenge_nothing_too_crazy/",
        "text": "my grubhub account was hacked and I had $200 charged to my account.  My email, password etc were changed.  I have since fixed the situation and charges were reversed and i now have my account back BUT...the person had the food sent to their house.  I have their address and phone number.  I looked up the address and the house is really nice ($450,000 home).  I feel like some kid bought some accounts from the dark web or something and was able to use mine...Sucks on my part for not changing my password BUT...\n\n&amp;#x200B;\n\nI have their house address and phone number.  Any advice for some petty revenge?  I dont want to do anything major but he/she/they caused me considerable time and stress for this.",
        "created_utc": 1678117723,
        "upvote_ratio": 1.0
    },
    {
        "title": "I left a landlord and property management company with a loss because they tried to nickel and dime me.",
        "author": "TheBreakUp2013",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/11k2d45/i_left_a_landlord_and_property_management_company/",
        "text": " \n\nI know the title is bad, but hear me out. This happened a while ago after I relocated to a new city. I signed a new 1-year lease for a townhouse in the downtown core and really enjoyed where I lived. The townhouse was OK, but a little less nice that I anticipated during my showing. Caveat emptor I suppose. The only other relevant background is the Lease said the security deposit would be used for the last month's rent and would not be held as a damage deposit.\n\nThe year passed with very few problems. The water heater went out in the dead of winter, but I stayed in a hotel for 3 nights and offset that cost against the rent after verbally agreeing with the landlord to do so. At the end of the year, the landlord asked if I wanted to renew. I said yes. I was presented with a 1-year extension for the same rent, I signed it and sent it back.\n\nI waited about 2 weeks and hadn't received the landlord-signed version back, so I inquired with the management company. They said the landlord was mad because they didn't get rent on the first of the month most of the time. I asked what they were talking about because I always paid on or ahead of time, and they said that while I paid the management company on time (as required by the Lease), the management company hadn't gotten it into landlord's hands in time. I said that wasn't my problem per the Lease, but the management company requested $100 more per month on the extension to make up for the inconvenience. They said they would send me a new lease reflecting the $100 increase, which they did.\n\nI immediately went out and found a condo in a similarly ideal location which was much nicer that rented for $75 a month less than my existing rent. I went through the background check with them and they sent me a lease to sign. Before signing the new lease I sent a certified letter to landlord and the management company of the old location saying my previous signature on the new lease, which had not yet been counter-signed, was revoked and ineffective because of their counter-offer and no longer capable of acceptance. I then signed the new Lease.\n\nAt that point, i had about 10 days left on the existing lease. The management company and landlord called me freaking out because they wouldn't be able to find a new tenant in time and would lose revenue. I said not my problem, hired a moving company, cleaned up the old place and returned it to them in the same condition I received it.",
        "created_utc": 1678117629,
        "upvote_ratio": 1.0
    },
    {
        "title": "Halloween and my neighbour shouted to make me jump i payed him back in poo!",
        "author": "Direct-Awareness7155",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/11k1oqw/halloween_and_my_neighbour_shouted_to_make_me/",
        "text": "[removed]",
        "created_utc": 1678116103,
        "upvote_ratio": 1.0
    },
    {
        "title": "Petty ex finally received his dose of Karma",
        "author": "asep1990",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/11k0fw4/petty_ex_finally_received_his_dose_of_karma/",
        "text": "[removed]",
        "created_utc": 1678113099,
        "upvote_ratio": 1.0
    },
    {
        "title": "you hurt me I hurt you",
        "author": "Minimum-Animator-584",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/11jwk7f/you_hurt_me_i_hurt_you/",
        "text": "[removed]",
        "created_utc": 1678102935,
        "upvote_ratio": 1.0
    },
    {
        "title": "What's your name again?",
        "author": "QuixiQuirk",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/11jvdyo/whats_your_name_again/",
        "text": "Names changed to protect the innocent and the very, very stupid. \n\nMany moons ago, I worked at a now defunct convenience store/gas station in the midwest. I was initially a bit reticent to take a job at a convenience store because it was just the sort of place that you always hear about getting robbed. However, it was new, brightly lit, clean, and on a very busy road. Also, I needed a second job pronto cause university is expensive and girl's gotta eat. Ramen and peanut butter only goes so far.\n\nAfter I started working there, I quickly realized that my worries about being robbed were probably unfounded as my store was somehow the meeting point for ALL of the police. The local city cops, the county sheriff, and even detectives all wandered into my store multiple times a day. They would stand around and chat with the staff or just stop in for a snack or drink on the way to work. This comes into play later.\n\nSo, while I didn't have to worry about robbers and I actually kind of enjoyed the job, there was one major annoyance. I got along well with all of the employees but one, his name was Branson. Branson was in his early twenties, fairly well spoken and intelligent but wouldn't you know it, he just knew everything. Since he knew everything it was obvious that The Lord Almighty had put him on this earth to tell everyone else about... everything. No matter what you were talking about, he knew more and better than you - even on matters involving your own history. You wouldn't think that was possible but by god he had an opinion about the cafeteria in the hospital my mother worked in when I was a child (not a joke, he really did).\n\nWhile he wasn't the first know-it-all I'd met, he had an even more annoying personality trait. Branson was a tattle-tale. You didn't stock the coolers before he got there? Tattle. Didn't clean the bathrooms before he came in? Tattle. Didn't make more coffee? Tattle. No matter how minor or downright wrong he was, he just had to run and tell management. As such, they were just as annoyed by him as the lowly cashiers.\n\nOnce he almost got me fired by telling the managers that I allowed one of my friends to steal from the store. Luckily, we were absolutely lousy with cameras. So after a few minutes of desperate pleading for the manager to check the CCTV footage, they discovered that Branson was, in fact, full of it if not lying for his own amusement.\n\nWhen it was proved he was wrong, did he apologise? Of course not, he was never wrong in all of his live long days because he - of course - knew everything. I was, as they say, not remotely fond of Branson.\n\nOne day, the store was filled with law enforcement as per usual, two sheriffs and four or five local city cops. It was at shift change over and me and my co-worker were ready to hand off our shift to Branson. There were no other customers so we were all standing around talking and just enjoying the banter. It just so happened that the sheriff supervisor was there, his name was Bucky.\n\nBucky was a good old boy, salt of the earth and one of the nicest guys you'd ever wanna meet. He'd give you the shirt off of his back if he thought you looked a bit chilly. Now, while I was chatting with some of the other boys in blue, Bucky was talking to Branson. I wasn't entirely listening to their conversation until it started to go a bit pear shaped. Bucky was talking about something and Branson, in his usual way just had to start arguing with him that he was wrong because Branson just *knew* that it was x instead of y. Then he took it a step further and suggested that as a law man, Bucky didn't have the schooling that Branson did and it was only natural that Branson would know more about the subject.\n\nBucky just smiled and rather than argue, he removed himself from the conversation and walked around the counter to the other side. He caught my eye and motioned me over. He then asked me what Branson's last name was and not seeing any reason not to, I told him. He thanked me and drifted off into the store. I honestly didn't think anything more about it and went back to my conversation with the others. After a few minutes, Bucky walked up with a vaguely puzzled look on his face and asked Branson, \"Hey buddy, what was your name again?\"\n\nBranson, sounding a little annoyed and as if he were schooling a child, answered him. Again, Bucky walked back off into the store. When Bucky returned, he had a big old grin on his face, he motioned Branson to come to him from behind the counter and said, \"Your name was Branson &lt;Last Name&gt;, right?\"\n\nBranson confirmed it was and Bucky's grin widened further as he reached for the handcuffs on his belt, \"I am so happy to hear that because there's a warrant out for your arrest and I'm going to have to take you in. I'm going to need you to turn around for me and put your hands behind your back.\"\n\nAt that, all of the conversation died entirely. I exchanged a well earned shocked Pikachu face with my co-worker. The shocked expressions on our faces melted away into absolute delight as our most annoying co-worker was handcuffed and taken out of the store.\n\nI never did see Branson again but Bucky was back later that evening and apologised to me for making me stay late. I told him I didn't mind and it was all worth it for the show. I'd have done it all over again just to see an idiot sabotage himself.\n\nLife tip, if you've got a warrant out for your arrest, probably best if you don't annoy a cop he might just take out his own petty revenge.\n\n\\*cross posted from entitledpeople\\*",
        "created_utc": 1678099332,
        "upvote_ratio": 1.0
    },
    {
        "title": "Excel",
        "author": "MrSparklesan",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/11jv044/excel/",
        "text": "[removed]",
        "created_utc": 1678098105,
        "upvote_ratio": 1.0
    },
    {
        "title": "Snow Shoveling",
        "author": "Suitable-Pirate-4164",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/11jsmfw/snow_shoveling/",
        "text": "This happened years ago but I think it needs to be said. One particular Winter a blizzard had hit our area and while the snow plowers cleared the road they did not clear parking spaces. My family decided to shovel out snow in the freezing cold for my mothers car while neighbors did nothing. One day as we went to a doctor's appointment we went back and lo and behold our neighbor has OUR parking spot we worked in the cold for. It took hours to dig out.\n\nAfter finally finding a different parking spot my mom, my sister and me were pissed but we came up with an idea. We quickly grabbed our shovels and covered BOTH sides of the car doors. Looking out the window my sister saw the neighbor angrier than a bull and dug their car out and left. We weren't done yet though.\n\nWe grabbed our shovels again while they were gone and since my sister knew which neighbor parked in our spot she put as big of a snow pile on their door as possible while me and my mother covered the spot back up with more snow, which was easy since the other neighbors didn't shovel their parking spots making it even terrain taking it about 5 minutes to cover our spot again entirely. We saw the neighbor try to get back in only to get stuck, unstuck and find another parking spot after about 10 minutes.",
        "created_utc": 1678090101,
        "upvote_ratio": 1.0
    },
    {
        "title": "So, I gave a certain member of our handball group her just deserts.",
        "author": "Cartoonmanuniverse",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/11jmmex/so_i_gave_a_certain_member_of_our_handball_group/",
        "text": "So, I might have to make this short since I’m having to email this to myself, my phone is flat, and I must do something else.\n\nHere’s the story.\nSo, every day at my school me and my friends sometimes play handball (if anyone doesn’t know what it is, it is a game we play that we bounce a ball within squares and if you hit it right into someone else’s square or hit it out of the squares you’re out) every morning tea and lunch but we have someone they just invites herself in the game but every time she gets out she attempts to kick the ball onto the roof of the library and this wasn’t the first time something like this happened because on the last week of the school last year some jerks tried to do whatever they could do to try and steal our handball but they got in trouble for it but this girl always tried to get the ball onto the roof so we had enough but we knew that if we told her to leave she would say that “we’re sexist or homophobic” since she was a lesbian so we could kick her out since she would make us the bad guy so we had to deal with her, but today she comes into our handball game at lunch and got a piece of sweet bread with chocolate on it so while I was waiting in line with her for our turn I slapped the bottom of her hand hard enough for the sweet bread to jump out of her hand and the chocolate got onto her face, hair and hand so she had to leave us to wash of the chocolate and to make it better I took the sweetbread before she even had a chance to eat it, even if she was mad It was well worth it\n\n \n\nPs to rslash if you read hope you enjoy reading this and sorry if you couldn’t read this as well I’m bad at typing stuff",
        "created_utc": 1678072160,
        "upvote_ratio": 1.0
    },
    {
        "title": "Make my mum cry? Bring it",
        "author": "ButterMyParsnip",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/11jm4tn/make_my_mum_cry_bring_it/",
        "text": "[removed]",
        "created_utc": 1678070842,
        "upvote_ratio": 1.0
    },
    {
        "title": "Accused of \"Stealing\" food.",
        "author": "huffle-elve2729",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/11jllo0/accused_of_stealing_food/",
        "text": "Yesterday I was alone in the house and I decided to order myself a snack. I decided to order from a certain restaurant because I had discount coupon codes. The restaurant said the miminum order should be $7 and I made my order $7. Then I decided to use a discount code, which put my order below $7. I pressed \"Credit Card Scan (Driver will bring a credit card swipe machine)\" as my payment as I only had $4 in my wallet. Most of my money is online. I was notified my order will come in 30 minutes.\n\n20 minutes later, I got a call from the delivery manager (DM) saying my order is below minimum. I told the manager that I applied the discount code and the order without the discount is over $7 but the D said it has to be $7, even with discount. I decided to just take out the discount just deal with it. Then the DM asked \"Change for How much\". I sternly told the DM i chose credit card scan as I had $4 in my wallet. He said \"but we have none at the moment\" and I told him I should have been reminded. I decided to give him a warning. He should cancel my order or provide a Credit Card Swipe at my delivery. He said okay then the call ended and I waited. \n\nWhen the driver came, he had no Credit Card Swipe Machine. I was so pissed and mad. The DM lied to me. I decided to do something. My country has an e-wallet app where you can send money just by knowing the person's number, as long as they are members of the app. SInce the DM called me, I have his number. using the DM's number, I checked the e-wallet app if he is a member. He is and I decided to send the payment online to his e-wallet. I did, told the driver about it and got my order. I finally enjoyed it. \n\n30 minutes later the DM called and he was angry. He told me my payment is not a valid one and I should have given the driver cash. I told the DM \"You lied to me and you should deal with the consequences.\" he threatend to report me for \"Stealing\" the food but I just paid him in the most inconvenient way possible. I jsut told him \"Go ahead because I have proof that you lied to me and made so many difficulties in my order\".",
        "created_utc": 1678069395,
        "upvote_ratio": 1.0
    },
    {
        "title": "hypothetical poll",
        "author": "Nearby-Flatworm1628",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/11jitos/hypothetical_poll/",
        "text": "[removed]",
        "created_utc": 1678062148,
        "upvote_ratio": 1.0
    },
    {
        "title": "I Tap",
        "author": "Putrid-Back-2636",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/11jdiwt/i_tap/",
        "text": "[removed]",
        "created_utc": 1678049798,
        "upvote_ratio": 1.0
    },
    {
        "title": "Laundry Room Payback",
        "author": "redditmodsthroat",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/11j9f5b/laundry_room_payback/",
        "text": "After reading about other laundry revenge, I was reminded of a story from long ago.\n\nI had a former highschool classmate (Cringelord) that just didn't like me, I honestly think he was angry because he was handicapped and used crutches while I was a student athlete. He was pretty cruel and treated most guys with contempt so it wasn't just me. I went out of my way to be kind to this person.\n\nAfter highschool he had befriended my younger sister and since she was a pain in the ass, it was a match made in heaven. I was selling a performance car and he offered to purchase it. I was very hesitant but my sister promised he was \"good for it\" since he had received a payment of some sort. He wrote me a check and drove it away. \n\nAbout a week later I get a call from the police department regarding the impending towing and parking tickets of my car. He never filed the title paperwork and ran it out of fuel while doing burnouts before leaving it with the keys in it on the side of a city street. I went to my bank and the check had been cancelled by him the same day he picked up the car. I managed to talk to the police and explain the situation, they allowed me to retrieve the car and eventually removed the parking tickets since they could see the check with the chassis number written on it. \n\nMy first instinct was to track him down and beat the money out of him, but my parents calmed me down.\n\nA year later I was still living at home while attending  college. My younger sister and a friend of mine also lived with my parents. My sister started bringing this ass around and he had the nerve to mock me and laugh about screwing me over for the car. I could practically feel my hands squeezing his neck but once again took the high road.\n\nA couple weeks later I'm doing laundry in the basement and my sister and Cringelord show up demanding to use the laundry room. Apparently his washing machine had broken and he NEEDED to use ours instead of me. \n\n\"Too bad, I'm already using it\" was my reply.\n\nAn hour or so later I went down to dry my clothes only to find them in a soaking wet soapy pile on the basement floor drain. (It only takes about 30 or 40 minutes to wash in the USA) Meanwhile his jeans are sitting in the washing machine and all his other clothes are neatly sorted ready to wash.\n\nI sprinted upstairs ready to beat this guy and throw him out the door... They had left for a relaxing coffee shop visit. How nice for you two!\n\nI went downstairs again and found a few bottles of Rit dye (permanent clothing dye) in a disgusting hot pink, green and orange. I took ALL the light colored clothing and soaked it with the pink dye. While it soaked I took all his jeans, cut the front pockets out and hung them over some cross beams in the ceiling then tied them into the most impossibly tight knots. \n\nAfter the pink dye treatment I sprinkled straight green and orange dye in everything then washed it to set the colors. \n\nI took my clothes upstairs and made sure there was nothing they could damage.\n\nAnother hour passed and I hear the door open. The screaming I heard through the laundry chute was absolutely delicious. I went down and found him there alone, my sister dropped him off, went somewhere else and gave him permission to just walk into my house and do laundry all day. After LAUGHING in his face during his little temper tantrum and threats he finally took a trash bag and loaded his pink and somehow brown spotted? clothes into it. He couldn't reach the jeans which caused another tirade. My sister arrived and helped him remove his jeans (it took almost an hour) then he noticed the pockets were all cut off. I can't describe the satisfaction in seeing him attempt to attack me physically. I just repeatedly pushed him away and took his crutches away when he swung them at me. \n\nI held the door open so he could leave and this little bastard spit in my face which I rewarded by shoving him out the door and down onto the sidewalk. I reminded him he wasn't welcome here again or I wouldn't be so restrained.\n\nHe managed to enter the house one day when I wasn't home, unfortunately for him my friend who lived with us heard him and basically dragged him out the front door.\n\n\nI enjoyed seeing him in pink tie-dye clothes for the next year or so.",
        "created_utc": 1678044784,
        "upvote_ratio": 1.0
    },
    {
        "title": "You don't want us to use that profile picture, we will be using it",
        "author": "Party-Artichoke-58",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/11j7hwj/you_dont_want_us_to_use_that_profile_picture_we/",
        "text": "It all started at the beginning of the year 2023 in January, when my best friend and I decided to be open with our feelings to this one girl in our high school. Honesty is a thing we value in our friend group, and maybe the fact that we said it via voice messages was not the greatest thing, but at every point we specified it was our opinions and not the all mighty truth.\n\nShe had done a lot of things that we could find problematic, for example at lunch she will leave without telling anything or all the time she stops talking to us and later in the day she'll become mad because we didn't say anything.  There were a lot that were said, and expectedly she took it very badly, she started crying saying: \"Friendship isn't like we (my friend and I) describe it\" we couldn't be honest with her, and it's very sad I think. She said we have to accept all of our friends flaws and live with it without saying anything. \n\nA lot of drama ensued. My friend and I were forced to apologize to that girl because people were saying we are the bad people for saying it that way, so we did, but with the idea in mind that nothing will ever change. And guess what noting changed she became mad at us for thing that she did, so I decided to cut contact my friend remained \"friend\" with her. \n\nOne night I was going to bed mad because the next day I had an exam, my friend sent me screenshots of a conversation she had with that same girl saying the following: \"You can't put that profile picture (1 she doesn't own it she took it from Pinterest so does my friend and 2 my friend didn't put that picture has profile picture) because I know I could be inspiring but X and I already have it\" So the reason is pretty dumb and childish but when I saw that I was exhausted, I decided I have a petty revenge, but I'll let my exams pass before anything.\n\nYou need to know that my friend and I belong to a group of four people, and \"together we're nobody\", if you declare war to one of us you need to know that you also started a World War to the four of us. Remember that profile picture she said she doesn't want us to use, so we used it in all of our accounts and during and to this day we send her petty phrases with the wonderful new functionality of Instagram \"THE NOTES\" she posts something don't worry because we repost the same phrase but pettier for example she said once on her note \"feeling lonely\" I posted \"Sorry Hun you are alone, it's what you get by betraying your friends\" or I'll say \"Quick reminder, but we're in geocentric referential not an egocentric referential\".\n\nLooking back at it, I find it funny, but I'm still bitter, so I think my petty revenge doesn't end here.",
        "created_utc": 1678042230,
        "upvote_ratio": 1.0
    },
    {
        "title": "Who would be down to send cringe to my friends number.",
        "author": "SnooGoats8860",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/11j70ds/who_would_be_down_to_send_cringe_to_my_friends/",
        "text": "[removed]",
        "created_utc": 1678041321,
        "upvote_ratio": 1.0
    },
    {
        "title": "Cheating ex gets petty revenge hehe :)",
        "author": "Daisy_Person123",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/11j5ila/cheating_ex_gets_petty_revenge_hehe/",
        "text": "[removed]",
        "created_utc": 1678039381,
        "upvote_ratio": 1.0
    },
    {
        "title": "Want to get in my way on the playground? Well your desk pet is mine.",
        "author": "Sad-Adhesiveness-793",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/11j4gw9/want_to_get_in_my_way_on_the_playground_well_your/",
        "text": "[removed]",
        "created_utc": 1678038171,
        "upvote_ratio": 1.0
    },
    {
        "title": "You get a tiki torch, you get a tiki torch. You all get tiki torches!!",
        "author": "ihaveaidsaskmehow",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/11j4c1c/you_get_a_tiki_torch_you_get_a_tiki_torch_you_all/",
        "text": "Tldr: next door neighbor calls the fire department on me for legal tiki torches so I decked the neighborhood out in them.\n\nI'm on phone btw.\n\nThis happened a couple years ago. I rent an apartment, in a duplex. The lease says no smoking inside which isn't a problem for me. But smoking outside does lead to two problems. One, being the mosquitos. The other being my neighbor, let's just call her Karen. \n\nWhen I first moved in Karen came right up to me as I was moving boxes and followed me around to ask me questions and lay down the rules of the neighborhood as if she's the homeowners association. She told me that fire pits and bonfires (this will come into play later) arent allowed because the street has had a gas leak before, it's actually a city ordinance that nobody really listens to.  Anyways at first I thought the questions was just a friendly neighbor getting to know me but it quickly felt like an interrogation. Where are you coming from, where do you work, wife? Kids? Family in the area? It was just one question after the other then she started telling me about everyone in the neighborhood too. That was enough for me to not like her. If she's telling me, basically a stranger all the details she can think of, of everyone around us then nothing I tell her would ever be private. \n\nAnyways I just kept my head down and kept conversations kind of limited whenever I saw her. I was mean or cold to her but definitely not as friendly as I could've been. But a few months go by and summer starts to pick up as do the mosquitoes in my area. At first I tried sprays but they don't work great at repelling. Then I tried citronella candles but because I would blow them out when I was done smoking the wax wouldn't melt evenly and I would waste a lot. So I landed on tiki torches. I bought a glass table top tiki torch set it up on the brick patio near my bench and it worked great! For an hour or so.\n\nSo I'm sitting on my bench when I hear firetruck sirens. I live near a firestation so that's not unusual. Until they turn down my street. I'm watching as they pull up to my house. It's a narrow street so my first though was that my car and my neighbor across the street were parked in a way blocking them from going down the street. So I run inside to grab my keys and dash to my car. But right as I'm at the side walk half a dozen fire fighters rush by me to my front yard, to the tiki torch. I have no clue what's going on and with sirens going I can't hear them. \n\nOne of them leans up close to me and yells in my ear \"WHAT IS THAT\" A tiki torch! I replied still confused. \"WHAT ARE YOU BURNING\" it's a tiki torch! i repeated exasperated and confused. A few of them go back and turn off the siren and tell me one of my neighbors must hate me. They were called for an out of control firepit. What they saw was a tiki torch with no flammable material around it, being watched by an adult. They said it's fine to have a tiki torch and they went on their way.\n\nNOW imagine my surprise when the very next day. I'm on my porch, tiki torch going and I hear sirens again! I think they can't be me, but lo and behold they turn down my street! I calmly cap the torch and wait for them. And now they were mad! They didn't know who called because they were dispatched by 911 but they told me if it happens again they were going to file miss use of emergency service charges against \"whoever\". Now I'm annoyed too. I'm not in the wrong, this one neighbor doesn't like me, because I don't like her. Literally all my neighbors who've met me, wave to me, we move each other's packages to a more hidden place on porches, help shovel driveways, I'm invited to multiple bbqs every summer and we still manage to stay out of each others business. Not her.\n\nSo my petty revenge plan came almost immediately. I went back to the grocery store I bought the tiki torch a few days earlier and cleaned them out. I bough 8 and tons of citronella oil. I think the stockpile of citronella I have is more of a fire hazard than an actual fire pit. But yeah I handed out them all to the neighbors in view of Karen and explained why I'm giving it and if they ever need the fluid to just text me. They all thought it was hilarious! So within the coming months my neighbors had the tiki torches proudly displayed on their porches whenever they had company over. They raised torches and cheersed me from across the street with a grin. Maybe not as serious as others here but it always gives me a smile.",
        "created_utc": 1678038017,
        "upvote_ratio": 1.0
    },
    {
        "title": "Sociopathic Roommate? Meet your biggest misidentification of a victim....",
        "author": "maroongrad",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/11izniq/sociopathic_roommate_meet_your_biggest/",
        "text": "Way back in college, I had a friend out in Colorado whose roommate was moving out, and who needed to rent the other room out for the summer. I wanted to get out-of-state for the summer, so, win! Called ahead to a chain restaurant I'd worked at before in my own state, got a job from the recommendation from my previous manager, made sure my car was in good shape, and took out an $800 loan for emergency cash just-in-case (about $1600 nowadays). Drove out there to discover that my friend (now called AH) was leaving for a two-week vacation the next day and I'd be alone in the apartment with his current roommate, a guy I barely knew. I figured it was a combination of him knowing the roomie was trustworthy and just forgetting to mention it because he was busy planning the vacation, taking finals, etc. The roomie and I were fine together, really nice guy, really sweet fiancee, we had no problems at all. But, I went to pay my share of the rent for the month. Roomie had paid his quarter, I was paying my half...and AH hadn't paid HIS section before leaving AND was behind from the previous month! There was a really good shot we'd be evicted before he got back to pay it. Once again, I figured that since he'd left the day after his last class finished, it was just an oversight. I hadn't been warned by the roomie that this was NOT accidental but as soon as he found out, he let me know that this was NORMAL for AH...and I'd never get the money back.  \nWell, I had car problems. Nothing terrible but it ate up the remainder of the emergency cash between repair and towing. I picked up a second job and was working something like 70 hours a week, with 5 hours off each night and a couple each afternoon. I was trying very hard to pay bills now that my safety cushion was gone. AH came back to no job, as he'd not bothered to tell them he was going to be gone for two weeks instead of starting immediately and he got replaced. He contacted another person we were both friends with and she moved out there with us. That helped, but for several weeks I was exhausted. Those two hours each afternoon? AH would play his euphonium in the hallway outside the bedrooms.   \nWeeks go on. I'm exhausted, he's spending money right and left (took his boyfriend to Denver for the opening of Independence Day and stayed overnight in a nice hotel, dropped a load of money at RenFest, went to Estes Park, you name it) and hasn't repaid a cent of the $400+. He's also borrowed $500 from another mutual friend that I knew couldn't afford it (I saw the check out on the cabinet) and sucked money from the newest roomie. She'd decided AH could do no wrong and I was ridiculous, so I just let her learn the hard way.  \nLast day I'm there. I haven't talked to either of them for a few weeks; not hard when I'm almost never home except to sleep. They don't know which day I'm leaving. Sold all the little things I'd bought for the room (inflatable mattress, cheap thrift store table and lamp, fan, etc.) to a coworker, packed up, and was ready to go early the next morning with the last of my rent and bills to pay.   \nWait.  \nAll those bills are in HIS NAME.  We have no written contract, either. They are due the first of the next month, which is tomorrow.  \nI took the amount I owed in bills, subtracted what he owed me, and left him $4.86 and a note that \"now he owes people who can collect.\"   \nI am the only person who ever got their money back from him. I don't know how he came up with the equivalent of a thousand or more current dollars in 24 hours, but I bet it was interesting!!! Wish I'd been there to see his face when he found that little pile of cash instead of a big check or wad of money!",
        "created_utc": 1678029906,
        "upvote_ratio": 1.0
    },
    {
        "title": "Fire me? Never eat your favourite pastries again.",
        "author": "Open_Pool_9145",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/11iyjxv/fire_me_never_eat_your_favourite_pastries_again/",
        "text": "[removed]",
        "created_utc": 1678026879,
        "upvote_ratio": 1.0
    },
    {
        "title": "Ruin the feelings of my bestfriend? Let me do the same.",
        "author": "SquareBeautiful6574",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/11ivm1p/ruin_the_feelings_of_my_bestfriend_let_me_do_the/",
        "text": "Before we get into the story im on my phone so sorry for the bad format(and my english)\n\nSo this happened couple of weeks ago. My bestfriend is kinda attractive but i am more. This would be relevant later. So this \"popular\" girl(you know the type rich gossips all the time thinks she is superior etc.) invited my bestfriend(Andrew) to a date. Andrew had a crush on her since 8th grade so he gladly accepted. I drive him to the restaurant(he isnt 18 yet) because she said she will be already there. I leave to go get some weird snacks that most of you probably never heard(i get weird food cravings). Anyway im near the checkout when i get a call from Andrew. He in tears calls me to come pick him up since the popular girl(Ana) didnt want to date him just wanted to play a rude prank on him.S( i am at a loss of better words).When he called her she just laughed at him with her friends. I confort him and we go back to my place and watch a comedy i know he loves. Me and Andrew go a long way back he was with me when i nearly went blind. So i have to get back at that b*tch.\nI know that Ana has a crush on me. So i decide to pull the same sh*t on her.(a few weeks apart so she would not be suspicous). She accepts to go out with me at this fancy restaurant. She gets there all fancy and dressed up(just like my bestfriend) and he waits for me. Me and a couple of my mates were hiding in a bush and i yell\"NO WAY SHE FELL FOR IT HOW DUMB IS SHE??\" We all broke out laughing and came from the bush. When she realised what happened she started crying and running away(like we were some sort of monsters lmao) and she even tripped and ripped a part of her dress. She lost her popular status and she didnt come to school for like a week.\nYes i might be an a**-hole but hey dont mess with my frienda",
        "created_utc": 1678018095,
        "upvote_ratio": 1.0
    },
    {
        "title": "CLOSENESS AND FAMILARITY DEVELOPS NEGLIGENCE",
        "author": "unityofreligions",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/11iqi16/closeness_and_familarity_develops_negligence/",
        "text": "[removed]",
        "created_utc": 1678000197,
        "upvote_ratio": 1.0
    },
    {
        "title": "Text me on Telegram @Kingteen37 to get Teen/cp Deep fucking is available over 3000+videos which includes mom&amp;son, black cp, daddy&amp; daughter,cp rape cp car sex and more with cp ......teen group chat full 759 girls&amp;boys available too dm telegram and ask for preview and price @kingteen37",
        "author": "telegramteens",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/11ipz54/text_me_on_telegram_kingteen37_to_get_teencp_deep/",
        "text": "",
        "created_utc": 1677998418,
        "upvote_ratio": 1.0
    },
    {
        "title": "worst coworkers will be working together",
        "author": "GH0571N6",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/11io1zc/worst_coworkers_will_be_working_together/",
        "text": "[removed]",
        "created_utc": 1677992291,
        "upvote_ratio": 1.0
    },
    {
        "title": "You won't clean up after yourself, now you'll have to",
        "author": "BlackbirdNamedJude",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/11ilco9/you_wont_clean_up_after_yourself_now_youll_have_to/",
        "text": "So this is definitely a small petty win, but it made me very happy.  Also I apologize if I'm long-winded I just want to make sure I explain this as best as I can. \n\nI currently work in a retail pharmacy. While working production, as we fill we put the drugs into the two baskets (two different parts of the pharmacy) to be put back later. If the people working pick up or drive thru are free they will put drugs back so production can just fill, but for the most part the responsibility falls on production.\n\nThere is one technician(tech a) that will NEVER clean up after herself unless someone asks her to.  I'm not even talking about the drugs; I'm talking about papers, candy wrappers, bags from prescriptions being filled (something we are all supposed to do) and stuff like that.\n\nWell the other day someone (tech b) cleaned up all the drugs and bags before they left. The pharmacy looked amazing. I was unfortunately stuck on drive thru the entirety of the next hour, but this means all the drugs and bags for this one hour were from Tech A. There wasn't even that many, but she left them all when she clocked out.\n\nWell here's my revenge.  I worked with both Tech A and B today. Tech B left first and she of course cleaned up EVERYTHING again. After that I made sure to keep all my drugs separated from the drugs Tech A had filled. \n\nToday was a whole lot busier, and Tech A was filling quite a lot in the time span from when Tech B left and when I was gonna leave. I noticed her baskets getting piled higher and higher, and I just kept filling my own baskets and putting them to the side. When my time came, I put all the drugs from my baskets away and cleaned my station very nicely. I then looked at the pharmacist and said, \"Well all my stuff is cleaned up, anything else you want me to do before I leave?\"  They said no, so I smiled at Tech A and happily walked out.",
        "created_utc": 1677984432,
        "upvote_ratio": 1.0
    },
    {
        "title": "Revei",
        "author": "positivelyundaed",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/11iksyt/revei/",
        "text": "[removed]",
        "created_utc": 1677982922,
        "upvote_ratio": 1.0
    },
    {
        "title": "You mildly inconvenience my laundry schedule? I'll mildly inconvenience yours.",
        "author": "someusername47",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/11ik78k/you_mildly_inconvenience_my_laundry_schedule_ill/",
        "text": "I was doing laundry in my dorm building. I had two loads in the washers, and I went down to switch them to the dryers. I opened both of my washers, and luckily there were two empty dryers left (the rest were full cause people leave their shit in for ages). I opened both dryers. I put one load of laundry into one dryer, shut the door, and started it. \n\nI began to gather my other load of laundry and just as I was about to carry it over to the dryer, a guy walked in. He took one (1) single jacket out of a washer and cut in front of me to toss it into the one dryer I had opened and was walking towards to put my laundry in.\n\nI stood there for a second with my laundry in my arms, expecting him to notice and be like \"Oh my bad, were you using that one?\" (simple dorm laundry etiquette in my experience) but he just walked out.\n\nSo after stopping my previous dryer and rearranging my clothing and taking some out to air-dry so both loads would fit in the one dryer, I went over to his dryer and pressed \"stop\" before leaving. Now when he goes down to get his one (1) jacket in 40 minutes, it'll still be wet. Fuck you, dude. \n\nTL;DR: A guy took the last dryer that I was about to use. I turned it off. Yes, this is tiny and petty.",
        "created_utc": 1677981301,
        "upvote_ratio": 1.0
    },
    {
        "title": "Qualifications? Right here.",
        "author": "vampyrewolf",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/11ijt67/qualifications_right_here/",
        "text": "Just reminded about this by another post...\n\nI have been an Electronics Technician since 2006.  Worked at a telecom OEM for 4.5 years, we sold direct to head-end providers (Cisco, Motorola, Cox-Phoenix, Spectrum, Shaw...).\n\nSpent a year in production building video on demand equipment and boards for large scale cable routers (300 in a box)...  moved to warranty for two years doing point to point wireless data networks... then QA for 18 months working on everything BUT the Cisco products (20-25 products depending on how you count a couple lines).\n\nI moved into the oilsands for another international telecom company, running a 2-way radio repair shop for 1 customer.  Officially the \"client services manager\", essentially the regional manager with 7 direct reports and my manager being 7hrs away.\n\nI was the first manager up there in 25yrs that was a Technician filling the role rather than a manager that had to be trained on the technical side.  So I could do my tech's jobs when needed, but had spent some time playing bureaucratic bullshit games already in my previous 2 positions.\n\n\nThe wireless engineer for that oilsands company didn't like me having more wireless experience than he did.  \n\n\nA year into working there, I learned that there was a local amateur radio group and they were looking to do a class.  Signed up right away, and had my amateur license 15 months after starting the job.\n\n18 months into the job, the wireless engineer tried saying there was a problem with coverage when there was a problem with expectations...  trying to get a signal through 300' of dirt.  Which is where we get to the whole issue of experience...\n\nWhen I got my license I didn't tell either my boss or the customer that I had it.  Basic with Honours, and Advanced...  which legally allows me to do repair, design, modifications, build from scratch, build repeaters (the issue with coverage), and up to 1000W.  The customer was using 50W mobile radios.\n\nThe customer brought up in the next meeting that I \"wasn't qualified to make conclusions on the issue\"... I came back that afternoon for the next meeting with a copy of my certificate for them.  They didn't argue with me about the system for the remaining year I was there.\n\nMy boss tried telling me my 1000W amateur license wasn't as good as the 50W commercial license, until I pointed out that none of our other Canadian employees even had an amateur license (Industry Canada has a searchable database for other HAM radio folks).",
        "created_utc": 1677980232,
        "upvote_ratio": 1.0
    },
    {
        "title": "little story",
        "author": "AdLate3030",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/11ij0dc/little_story/",
        "text": "[removed]",
        "created_utc": 1677978100,
        "upvote_ratio": 1.0
    },
    {
        "title": "0985225760@cty_tri Dịch vụ hải quan, 0985225760 Gửi hàng đi Mỹ giá Rẻ, Cam kết giá rẻ nhất thị trường, Dịch vụ Door to Door. Giao Hỏa Tốc. Nhận Gửi Hàng Từ Việt Nam Sang Các Nước Mỹ Úc Canada. Bảo Hiểm 100%. Đóng Gói Miễn Phí. An toàn #newyork, #california",
        "author": "Fit_Flounder5537",
        "url": "https://www.reddit.com/r/pettyrevenge/comments/11ihtj1/0985225760cty_tri_dịch_vụ_hải_quan_0985225760_gửi/",
        "text": "[removed]",
        "created_utc": 1677975026,
        "upvote_ratio": 1.0
    }
]