[
    {
        "title": "Understanding fire?",
        "author": "CaptainVJ",
        "url": "https://www.reddit.com/r/Physics/comments/zly4p8/understanding_fire/",
        "text": "I’m still trying to wrap my mind around how a fire works. Unfortunately, I took a bunch of Math courses in undergrad, but one semester of chemistry and no physics, heck I dropped out of physics in high school 😂. \n\nBut the general idea of fire is that to ignite it needs three things: heat, fuel and oxygen. \n\nBut the heat part kinda confuses me since it also produces heat. So I kind of created an anology comparing it to a car engine. To work it needs gasoline, kinetic energy and oxygen too. So a car sitting there with a full tank of gas won’t just start operating, but once you turn start that ignition the starter gets the engine moving until it gets to an idle and can sustain itself. \n\nIs that the same idea with a fire, I have a room filled with pallets and paper but it won’t get started it needs a match. Is the match somewhat analogous to a car’s starter. \n\nAs for how much heat needs for start a fire is that the same as activation energy in chemistry?",
        "created_utc": 1671041794,
        "upvote_ratio": 1.0
    },
    {
        "title": "Calc tricks on the F=ma?",
        "author": "trqzn",
        "url": "https://www.reddit.com/r/Physics/comments/zlxj87/calc_tricks_on_the_fma/",
        "text": "Hi,\nWhen studying for the F=ma, are there any tricks I should know that will help me solve the problems? My math knowledge extends up to Multi.\nThanks!",
        "created_utc": 1671040407,
        "upvote_ratio": 1.0
    },
    {
        "title": "Quick simple question guys",
        "author": "Benjocar",
        "url": "https://www.reddit.com/r/Physics/comments/zlwex4/quick_simple_question_guys/",
        "text": "Can wood become a conductor if, for instance, I rub it with a conductive material?",
        "created_utc": 1671037779,
        "upvote_ratio": 1.0
    },
    {
        "title": "physics principle",
        "author": "True_Ad_1815",
        "url": "https://www.reddit.com/r/Physics/comments/zlvf1s/physics_principle/",
        "text": "Hello everone i want a physics book that explain the physic principle from beginning to one who have a very weak knowlage in physics science i hope you can help me",
        "created_utc": 1671035376,
        "upvote_ratio": 1.0
    },
    {
        "title": "Preparation for my bachelor's degree in physics",
        "author": "MrBullish55",
        "url": "https://www.reddit.com/r/Physics/comments/zluz00/preparation_for_my_bachelors_degree_in_physics/",
        "text": "Do you have any recommendations as to how I can best prepare for my upcoming studies in physics? (books, videos, etc.)\n\nMany thanks in advance!",
        "created_utc": 1671034283,
        "upvote_ratio": 1.0
    },
    {
        "title": "Magnetic field direction",
        "author": "OK__Impression",
        "url": "https://www.reddit.com/r/Physics/comments/zlrefu/magnetic_field_direction/",
        "text": "How do I know the magnetic field direction knowing that the current is moving anti clockwise horizontally",
        "created_utc": 1671025696,
        "upvote_ratio": 1.0
    },
    {
        "title": "Rocket equation",
        "author": "MyDearDoughnut",
        "url": "https://www.reddit.com/r/Physics/comments/zlqaxf/rocket_equation/",
        "text": "Hey everyone, could someone explain the Tsiolkovsky rocket equation? And how you can apply that to a normal rocket? Thanks a lot!",
        "created_utc": 1671022726,
        "upvote_ratio": 1.0
    },
    {
        "title": "I am having problem with this concept",
        "author": "sarthak989",
        "url": "https://www.reddit.com/r/Physics/comments/zloror/i_am_having_problem_with_this_concept/",
        "text": "If acceleration is constant for any free falling object with any mass then why is it not constant if its mass is changing while it's falling\nEx : - A raindrop gaining mass by falling through mist will not fall with a constant acceleration (10m/s^2) but if its mass does not change then it will fall with a constant acceleration.",
        "created_utc": 1671018037,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can anyone explain Inertial Confinement Fusion.",
        "author": "mr_house7",
        "url": "https://www.reddit.com/r/Physics/comments/zloljh/can_anyone_explain_inertial_confinement_fusion/",
        "text": "Given the recent news about the Lawrence Livermore national laboratory, reaching net positive energy with Inertial Confinement Fusion could anyone explain with detail. From the laser to the chamber?",
        "created_utc": 1671017461,
        "upvote_ratio": 1.0
    },
    {
        "title": "Article on how honeybees move in turbulent environments",
        "author": "bardhej",
        "url": "https://iopscience.iop.org/article/10.1088/1367-2630/ac9cc4/meta",
        "text": "",
        "created_utc": 1671017407,
        "upvote_ratio": 1.0
    },
    {
        "title": "How honeybees fly in windy conditions",
        "author": "bardhej",
        "url": "https://www.aps.org/publications/apsnews/202301/honeybees.cfm",
        "text": "",
        "created_utc": 1671017341,
        "upvote_ratio": 1.0
    },
    {
        "title": "[Question] Magnets decay. How come magnetic confinement fusion would ever be economic?",
        "author": "mr_house7",
        "url": "https://www.reddit.com/r/Physics/comments/zlojla/question_magnets_decay_how_come_magnetic/",
        "text": "I know magnets decay over time and with use. Those huge magnets that are used to keep the plasma in rotation on a magnetic confinement fusion reactor, how often would they need to be replaced if in constant use? What is the decay rate? \n\nIt seems to me that if you need to keep replacing those magnets and the walls that interact with the projected neutrons, it makes it very difficult to ever be economically fixable.",
        "created_utc": 1671017278,
        "upvote_ratio": 1.0
    },
    {
        "title": "why when i breath too hard no oxyen",
        "author": "FLOYDING311111",
        "url": "https://i.redd.it/4ecigt3ghu5a1.jpg",
        "text": "",
        "created_utc": 1671015487,
        "upvote_ratio": 1.0
    },
    {
        "title": "Questions about the Simulation Hypothesis",
        "author": "Arkelao",
        "url": "https://www.reddit.com/r/Physics/comments/zlo0d0/questions_about_the_simulation_hypothesis/",
        "text": "Good morning everyone,\n\nI’m in no way a scientists, and my ignorance is big, so sorry if I don’t convey property my thoughts.\n\nRecently I’ve read a lot about the simulation hypothesis but I don’t quite understand what it means. The majority of articles I’ve read are more philosophical than mathematical. So these are my questions.\n\nWhat does it mean that we live in a simulation? How can that be explained from a mathematical standpoint?\n\nIf we accept that we are in an infinitely complex computer and we are beings made of data, how does consciousness fit in? Isn’t artificial consciousness impossible?\n\nThank you",
        "created_utc": 1671015385,
        "upvote_ratio": 1.0
    },
    {
        "title": "MaMa=PaPa",
        "author": "Assignment-nerd",
        "url": "https://www.reddit.com/r/Physics/comments/zlm93i/mamapapa/",
        "text": "Someone kindly derive that for me. I want to see something",
        "created_utc": 1671008833,
        "upvote_ratio": 1.0
    },
    {
        "title": "What experiment can we do to study the connection between gravity and QM",
        "author": "MetabolicPathway",
        "url": "https://www.reddit.com/r/Physics/comments/zll6a6/what_experiment_can_we_do_to_study_the_connection/",
        "text": "Is there an actual experiment we can do, or will be able to do in the next few years, to study the relationship between the two?",
        "created_utc": 1671004757,
        "upvote_ratio": 1.0
    },
    {
        "title": "Any goodreads on physics ??",
        "author": "datt_dixit_",
        "url": "https://www.reddit.com/r/Physics/comments/zlju6w/any_goodreads_on_physics/",
        "text": "",
        "created_utc": 1670999851,
        "upvote_ratio": 1.0
    },
    {
        "title": "Spinning Magnets?",
        "author": "zxvq623",
        "url": "https://www.reddit.com/r/Physics/comments/zljcxz/spinning_magnets/",
        "text": "OK, I was just reading about a helicon double-layer thruster prototype and it reminded me I've been dying to ask a physicist this question.\n\nFrom what I've read and understand, plasma confinement seems to be one the most difficult challenges of a sustained fusion reaction. I believe the magnets are all fixed position and software controlled or have variable output so adjustments can be made.\n\nQuestion: \nHas anyone theorized what spinning the magnets might do to the plasma field of a nuclear fusion reaction?\n\nMy theory is to have the magnets switched on to full power and spinning at the highest possible rpm around the central axis of a tokamak type fusion reactor to help contain/stabalize the plasma. In my head, this will create fluid motion of the plasma itself which will naturally stabalize at the systems resonant frequency which, in my head, could be found by tuning the magnets rpm. Perhaps this is something that could already be achieved using current designs and pulsing the magnets to try and create plasma rotation?\n\nThis is something I've been debating about posting on here for many months. I think I've starting writing this same post twice before actually. Each time I feel like I know the answers I'm going to get. But now, I'm also hoping this helps physicists think outside the box a little bit.",
        "created_utc": 1670998219,
        "upvote_ratio": 1.0
    },
    {
        "title": "just dropped",
        "author": "ppiywblossy",
        "url": "https://www.grocafrica.com/download?link=An3kJCLwRMBDs7z",
        "text": "",
        "created_utc": 1670996661,
        "upvote_ratio": 1.0
    },
    {
        "title": "HOT TAKE: The Universe is Coming Together and there is only One Fundamental Particle",
        "author": "WisdomHappy333",
        "url": "https://www.reddit.com/r/Physics/comments/zlimls/hot_take_the_universe_is_coming_together_and/",
        "text": "",
        "created_utc": 1670995849,
        "upvote_ratio": 1.0
    },
    {
        "title": "The Universe is Coming Together and there is only One Fundamental Particle",
        "author": "WisdomHappy333",
        "url": "https://www.reddit.com/r/Physics/comments/zlil30/the_universe_is_coming_together_and_there_is_only/",
        "text": "",
        "created_utc": 1670995726,
        "upvote_ratio": 1.0
    },
    {
        "title": "Bose letter to Einstein which accompanied his paper describing the first developments towards Bose-Einstein statistics",
        "author": "detour2modemv",
        "url": "https://i.imgur.com/5dEe46z.jpg",
        "text": "",
        "created_utc": 1670994741,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can it be said that an electron transfer between two neutral atoms comes from the neutral atomic electric field?",
        "author": "RevealExact8889",
        "url": "https://www.reddit.com/r/Physics/comments/zlekjh/can_it_be_said_that_an_electron_transfer_between/",
        "text": "Let us consider the example of Na and Cl. Both atoms are called \"neutral\" simply because they have the same total number of protons as electrons, yet they have a very weak electric field which is hardly measurable. The electron transfer between two neutral atoms is ultimately driven by the electrostatic force.\n\nArguments like: This is because atoms and molecules are always trying to achieve the most stable, lowest energy state that they can don't really adress my problem, \"lower energy\" is not a fundamental force but the outcome of a process caused by electrostatic force.\n\nSo, in the end, can we say that this very weak electric field of a neutral atom is the main cause that it can attract electrons of other neutral atoms? Simply because the electrons are not classically like point charges in the same place as the protons?\n\nIs there a more detailed book that deals with this in particular? Because I think this is fundamentally important.",
        "created_utc": 1670984160,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can anyone explain in simple terms how this works?",
        "author": "Samyron1",
        "url": "https://i.redd.it/frct6lx1rr5a1.png",
        "text": "",
        "created_utc": 1670982431,
        "upvote_ratio": 1.0
    },
    {
        "title": "Interesting essay from 2019",
        "author": "cainejay93",
        "url": "https://aeon.co/essays/post-empirical-science-is-an-oxymoron-and-it-is-dangerous",
        "text": "",
        "created_utc": 1670982190,
        "upvote_ratio": 1.0
    },
    {
        "title": "Changing the paradox as I walk in between worlds … understanding my existence is one thing… but being apart of a matrix …. FUCK NO",
        "author": "Last-Amoeba-5620",
        "url": "https://www.reddit.com/r/Physics/comments/zldml5/changing_the_paradox_as_i_walk_in_between_worlds/",
        "text": "The butterfly effect",
        "created_utc": 1670981672,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why volume?",
        "author": "Cs-MoP",
        "url": "https://www.reddit.com/r/Physics/comments/zld2wh/why_volume/",
        "text": "[removed]",
        "created_utc": 1670980254,
        "upvote_ratio": 1.0
    },
    {
        "title": "Would you feel g force on a car treadmill?",
        "author": "BeastlyWaffles",
        "url": "https://www.reddit.com/r/Physics/comments/zld1pf/would_you_feel_g_force_on_a_car_treadmill/",
        "text": "Lets suppose you had a treadmill large enough to fit a car and was able to match the wheel speed of said car. If you were to launch 0-60, would you get thrown to the back of the seat? The car would stay stationary but would also be accelerating so I have no clue.",
        "created_utc": 1670980174,
        "upvote_ratio": 1.0
    },
    {
        "title": "Since we can now produce net positive energy from fusion -- can this device produce enough power to power itself?",
        "author": "af_throwaway1337",
        "url": "https://www.reddit.com/r/Physics/comments/zld05x/since_we_can_now_produce_net_positive_energy_from/",
        "text": "With today's announcement of a significant amount of net positive energy from fusion; can we use this (or similar devices) to make something that can power itself to create ever increasing amounts of energy?  I know there is MUCH more to this so please ELI5.\n\nFollow up question to that -- could we at some point create something that could generate a black hole (with enough energy input) and potentially create our own wormholes?  I know this last question is far beyond what today's discovery revealed.",
        "created_utc": 1670980061,
        "upvote_ratio": 1.0
    },
    {
        "title": "Neighbors Using Infrasonic/Ultrasonic Devices to Disrupt My Sleep",
        "author": "Hypomanic_69",
        "url": "https://www.reddit.com/r/Physics/comments/zlbghz/neighbors_using_infrasonicultrasonic_devices_to/",
        "text": "I don't know where to post this that can give a logical explanation, but this should be a good start since physics involves sound waves.\n\nI'm a college student living nearby my school. Our apartment is old. Like really old that everyone can hear everyone because it is thin-walled. For instance, I can hear my neighbor stomps and their footsteps upstairs. I can hear my neighbor next to me going to the bathroom. I wouldn't say I hate it, but I can tolerate it when I am about to sleep. All I need is an ear plug then I cannot hear them. I confronted my neighbor upstairs when the noise became unbearable due to the stomping every 7 am. It became fine, and everything was okay until these past three weeks. I cannot sleep due to the excruciating high pitch noise that is slightly audible when I lay down but completely inaudible when recorded. I cannot hear it, but I can feel it. I tried wearing noise-canceling headphones, listening to white noise, and changing position, but it became really hard to sleep. I woke up with a ringing in my ear, thinking i had tinnitus. Not only that, I think they are using 2 separate devices because when i lay down in my bed, I feel my body from head to toe vibrating. Worse, my heart is so elevated that I cannot sleep. Not enough noise-canceling headphones can relieve me from this vibration because all i can hear is my heartbeat and rapid breathing. When I was about to fall asleep, I woke up gasping for breath as if someone was controlling some device that stopped or started the vibration. Not only that, but every time I felt the vibration, I moved that body part, then I heard something falling upstairs, followed by them coming to \"fix\" it. I don't know what's that, but it's just a pattern I noticed. I thought it was just the room, so I moved to sleep on the couch. I don't know how to explain this, but I hear them coming above me, plugging in something, followed by vibrations in my body. Then, I moved back to my bed, then they came following me. How did they know where I am in the apartment? I was miserable to the point that I cried, letting them know I'm suffering hoping it would stop. It didn't. All I heard from upstairs were giggles and intensified vibration + high frequency. All of these incidents told me that this is not an accident. They are harassing me. Today, I talked to my landlord about it. I plan to buy an ultrasonic detector for proof, but it's too expensive. No matter how crazy I sounded, I couldn't tolerate my neighbor, so I told my landlord. Ofc, he gave me the looks. I tried explaining to him as sane as possible. I don't know what to do, I need help. I can't move out. It's too much work, and it will be my last resort. My roommates are away for Christmas, and my neighbors enjoy torturing me.\n\n&amp;#x200B;\n\nThe directed device that they might be using reminded me of LRAD. But it's impossible to get one of those. But can it be built by a college student?",
        "created_utc": 1670976113,
        "upvote_ratio": 1.0
    },
    {
        "title": "can anyone tell me the physics behind this?",
        "author": "UnderstandingBorn227",
        "url": "https://v.redd.it/a6v9m7u92r5a1",
        "text": "",
        "created_utc": 1670974132,
        "upvote_ratio": 1.0
    },
    {
        "title": "Fusion energy breakthrough by US scientists produces more energy than it consumes",
        "author": "Wanda-Fleker",
        "url": "https://www.guardianmag.us/2022/12/fusion-energy-breakthrough-by-us.html",
        "text": "",
        "created_utc": 1670973128,
        "upvote_ratio": 1.0
    },
    {
        "title": "So light doesn't have mass?",
        "author": "Tiehan1872",
        "url": "https://www.reddit.com/r/Physics/comments/zla7bp/so_light_doesnt_have_mass/",
        "text": "   I read light is a packet of radiant energy called protons. But I also read about the Mass-energy equivalence, saying that mass and energy are one of the same. I also heard of ideas using a light sail for space travel, wouldn't that require light to have mass? I know very little about this, just learned about electromagnetic radiation, so help would be appreciated.",
        "created_utc": 1670973074,
        "upvote_ratio": 1.0
    },
    {
        "title": "In the Northern hemisphere, does you car use more fuel when going north?",
        "author": "Different_Accident91",
        "url": "https://www.reddit.com/r/Physics/comments/zl84cr/in_the_northern_hemisphere_does_you_car_use_more/",
        "text": "[removed]",
        "created_utc": 1670968271,
        "upvote_ratio": 1.0
    },
    {
        "title": "Newton's Second Law means nothing... Kind of.",
        "author": "Dorfinus",
        "url": "https://www.reddit.com/r/Physics/comments/zl79ot/newtons_second_law_means_nothing_kind_of/",
        "text": "[removed]",
        "created_utc": 1670966324,
        "upvote_ratio": 1.0
    },
    {
        "title": "just dropped",
        "author": "osynschy",
        "url": "https://www.grocafrica.com/download?link=3UMZQV0Os7phoeW",
        "text": "",
        "created_utc": 1670965536,
        "upvote_ratio": 1.0
    },
    {
        "title": "Today the National Ignition Facility announced, for the first time, a fusion reactor gave out more energy than it put in. However, Argentina announced the same in the 1950s but it was all a hoax.",
        "author": "sciencekenyon",
        "url": "http://inquestion.co.uk/2022/10/30/milk-bottles-of-unlimited-power/",
        "text": "",
        "created_utc": 1670960831,
        "upvote_ratio": 1.0
    },
    {
        "title": "How would I direct gravity?",
        "author": "Spartanguy1031",
        "url": "https://www.reddit.com/r/Physics/comments/zl4vrs/how_would_i_direct_gravity/",
        "text": "",
        "created_utc": 1670960697,
        "upvote_ratio": 1.0
    },
    {
        "title": "The 12/22 NIF Fusion Milestone as Reported by the American Institute of Physics (hype-free)",
        "author": "Minovskyy",
        "url": "https://physicstoday.scitation.org/do/10.1063/PT.6.2.20221213a/full/",
        "text": "",
        "created_utc": 1670960176,
        "upvote_ratio": 1.0
    },
    {
        "title": "Simulation: Falling into a Schwarzschild Blackhole (Me - Dec 2022)",
        "author": "TheBacon240",
        "url": "https://v.redd.it/xggga6k9wp5a1",
        "text": "",
        "created_utc": 1670960143,
        "upvote_ratio": 1.0
    },
    {
        "title": "Nuclear fusion reactor core produces more energy than it consumes in world-first demonstration",
        "author": "meanmarzi",
        "url": "https://blog.scientiststudy.com/2022/12/nuclear-fusion-reactor-core-produces.html",
        "text": "",
        "created_utc": 1670957077,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to know if you are good enough?",
        "author": "sourcandydx",
        "url": "https://www.reddit.com/r/Physics/comments/zl38qw/how_to_know_if_you_are_good_enough/",
        "text": "[removed]",
        "created_utc": 1670956810,
        "upvote_ratio": 1.0
    },
    {
        "title": "I recently learned that part of the reason we know dark matter exists is because the velocities of stars within the galaxies should, theoretically be enough for them to fall apart. However, there seems to be another layer of matter stopping this from happening. Which of these statements is false?",
        "author": "Queenish_",
        "url": "https://i.redd.it/bgaonx8uwq5a1.jpg",
        "text": "",
        "created_utc": 1670954238,
        "upvote_ratio": 1.0
    },
    {
        "title": "This is above and beyond that I expected.",
        "author": "CheckProfessiona",
        "url": "https://i.redd.it/95ufdzdjdp5a1.jpg",
        "text": "",
        "created_utc": 1670953681,
        "upvote_ratio": 1.0
    },
    {
        "title": "The information paradox",
        "author": "Creative-Tooth3953",
        "url": "https://www.reddit.com/r/Physics/comments/zl1uno/the_information_paradox/",
        "text": "[removed]",
        "created_utc": 1670953602,
        "upvote_ratio": 1.0
    },
    {
        "title": "I'm obsessed with this!!",
        "author": "EastConcentrat",
        "url": "https://i.redd.it/kno2ja4f7p5a1.png",
        "text": "",
        "created_utc": 1670951596,
        "upvote_ratio": 1.0
    },
    {
        "title": "Eureka! A true achievement for humanity!",
        "author": "SaishDawg",
        "url": "https://www.reddit.com/r/Physics/comments/zkz67q/eureka_a_true_achievement_for_humanity/",
        "text": "[removed]",
        "created_utc": 1670947369,
        "upvote_ratio": 1.0
    },
    {
        "title": "Source for magnetic permeability of water",
        "author": "krydddda",
        "url": "https://www.reddit.com/r/Physics/comments/zkyor4/source_for_magnetic_permeability_of_water/",
        "text": "[removed]",
        "created_utc": 1670946014,
        "upvote_ratio": 1.0
    },
    {
        "title": "Assuming the fusion breakthrough news of 120% is true...here is my question...",
        "author": "Crixusgannicus",
        "url": "https://www.reddit.com/r/Physics/comments/zkxn5z/assuming_the_fusion_breakthrough_news_of_120_is/",
        "text": "I figured I'd ask the pros here.\n\nCan we not, link 4 such reactors together generating 20 percent more than the input energy and then get over double the energy?\n\n1.2\\^4=2.0736",
        "created_utc": 1670943201,
        "upvote_ratio": 1.0
    },
    {
        "title": "deja vu",
        "author": "allinthename1",
        "url": "https://www.reddit.com/r/Physics/comments/zkxaem/deja_vu/",
        "text": "[removed]",
        "created_utc": 1670942288,
        "upvote_ratio": 1.0
    },
    {
        "title": "Physics Questions - Weekly Discussion Thread - December 13, 2022",
        "author": "AutoModerator",
        "url": "https://www.reddit.com/r/Physics/comments/zkwfgr/physics_questions_weekly_discussion_thread/",
        "text": "This thread is a dedicated thread for you to ask and answer questions about concepts in physics.\n\nHomework problems or specific calculations may be removed by the moderators. We ask that you post these in /r/AskPhysics or /r/HomeworkHelp instead.\n\nIf you find your question isn't answered here, or cannot wait for the next thread, please also try /r/AskScience and /r/AskPhysics.",
        "created_utc": 1670940008,
        "upvote_ratio": 1.0
    },
    {
        "title": "Help with de-orbit burn math",
        "author": "Kat_337",
        "url": "https://www.reddit.com/r/Physics/comments/zkvi2i/help_with_deorbit_burn_math/",
        "text": "I've been having some trouble focusing lately, so things have been going in one ear and out the other. Does anyone have some sources or good explanations/examples of a de orbit math calculation? Responses would really help, Thx in advance! :)",
        "created_utc": 1670937333,
        "upvote_ratio": 1.0
    },
    {
        "title": "The Definition of \"Space\"",
        "author": "KingHooblah",
        "url": "https://www.reddit.com/r/Physics/comments/zkvart/the_definition_of_space/",
        "text": "I'm sure the word \"Space\" has different meanings or can be defined in different manners?\n\nHow would one define space in relation to \"Physics\"?",
        "created_utc": 1670936770,
        "upvote_ratio": 1.0
    },
    {
        "title": "where to start",
        "author": "Several_Zone295",
        "url": "https://www.reddit.com/r/Physics/comments/zkr5y9/where_to_start/",
        "text": "Hi everyone, I'm a junior IBDP student, and I'm taking physics as one of my hl courses. Recently I have been very much into physics, but the textbook alone does not offer me satisfaction. I want to start reading books about physics, from the very basic level if possible. What are your recommendations?",
        "created_utc": 1670922023,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is 2 cars crashing head on at 30mph the same as 1 car crashing into a stationary car at 60mph?",
        "author": "Bjn201",
        "url": "https://www.reddit.com/r/Physics/comments/zkqzxv/is_2_cars_crashing_head_on_at_30mph_the_same_as_1/",
        "text": "If so why in real life?",
        "created_utc": 1670921353,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is there a site to ask physics questions and get the answer like within certain minutes? - Numerical questions",
        "author": "Effective-Composer-2",
        "url": "https://www.reddit.com/r/Physics/comments/zkqa5s/is_there_a_site_to_ask_physics_questions_and_get/",
        "text": "LIke some experts solvingn questions.",
        "created_utc": 1670918600,
        "upvote_ratio": 1.0
    },
    {
        "title": "please help me derive the expression for the electric field due to a semi ring on it's axis.",
        "author": "PIYU_1911",
        "url": "https://www.reddit.com/r/Physics/comments/zkpcsb/please_help_me_derive_the_expression_for_the/",
        "text": "",
        "created_utc": 1670915238,
        "upvote_ratio": 1.0
    },
    {
        "title": "Someone help",
        "author": "dhanashreekelkar",
        "url": "https://i.redd.it/9xelp7o7on5a1.jpg",
        "text": "",
        "created_utc": 1670915014,
        "upvote_ratio": 1.0
    },
    {
        "title": "Lal Singh Chaddha was way better than Forest Gump and if he ever goes into physics",
        "author": "TMS456Calm",
        "url": "https://www.reddit.com/r/Physics/comments/zknfx6/lal_singh_chaddha_was_way_better_than_forest_gump/",
        "text": "[removed]",
        "created_utc": 1670909172,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can you help me with this problem, I can't solve it for the life of me. I know the answer is B but I have no idea how to get there. Please help me Reddit, you're my only hope.",
        "author": "Lord_FuzzyBear",
        "url": "https://i.redd.it/1k5xpma4nl5a1.png",
        "text": "",
        "created_utc": 1670908463,
        "upvote_ratio": 1.0
    },
    {
        "title": "i need help on this question:’)))",
        "author": "heeeena",
        "url": "https://i.redd.it/tcgqypl90n5a1.jpg",
        "text": "",
        "created_utc": 1670906960,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can somebody help me with this problem? I don't know how to utilize the constant speed",
        "author": "Arop_",
        "url": "https://www.reddit.com/r/Physics/comments/zklvwj/can_somebody_help_me_with_this_problem_i_dont/",
        "text": "&amp;#x200B;\n\nhttps://preview.redd.it/nohkmoiobl5a1.png?width=739&amp;format=png&amp;auto=webp&amp;s=00c37879960e6dfa7965cefa4d38d850ebc77028",
        "created_utc": 1670904627,
        "upvote_ratio": 1.0
    },
    {
        "title": "Help",
        "author": "DetroitDrycleaning",
        "url": "https://www.reddit.com/r/Physics/comments/zklg32/help/",
        "text": " Can someone explain how to solve this using Malus's law? What percentage of light intensity is transmitted through a polarizer-analyzer combination if the angle between their axes is 0°? 30.0°? 50.0°? 70.0°? \\[answer: 50%, 37.5%, 20.7%, 5.85%\\]",
        "created_utc": 1670903385,
        "upvote_ratio": 1.0
    },
    {
        "title": "70-year-old quantum prediction comes true, as something is created from nothing",
        "author": "corona_virus_is_dead",
        "url": "https://blog.scientiststudy.com/2022/09/70-year-old-quantum-prediction-comes.html",
        "text": "",
        "created_utc": 1670903068,
        "upvote_ratio": 1.0
    },
    {
        "title": "Hello guys, can anyone help me?",
        "author": "franks12345678",
        "url": "https://i.redd.it/zy9sar8fmm5a1.jpg",
        "text": "",
        "created_utc": 1670902305,
        "upvote_ratio": 1.0
    },
    {
        "title": "Scientists are using lasers in order to undergo an efficient Nuclear Fusion reaction, creating major implications towards a new cleaner energy alternative.",
        "author": "pfrancisco_",
        "url": "https://www.cnet.com/science/climate/a-fusion-energy-breakthrough-major-announcement-expected-from-us-scientists/",
        "text": "",
        "created_utc": 1670899523,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is the correlation between magnetism and radiation exactly?",
        "author": "Cswell",
        "url": "https://www.reddit.com/r/Physics/comments/zkhyjl/what_is_the_correlation_between_magnetism_and/",
        "text": "Kind of weird question, but I was just curious if, for example, a material radiating alpha particles could alter an electromagnetic fields’ strength or even its flux? I know that electromagnetic radiation is made up of essentially waves, traveling at the speed of light, which are caused by some sort of “electric and magnetic disturbance,” but I’m just not sure how radiation ties in with that. Maybe I just need a more simple translation of what radiation is? I don’t know. Back to the original question, I was also wondering if there would be an equation for (if an effect would actually be in place) radiations effect on magnetism?",
        "created_utc": 1670894046,
        "upvote_ratio": 1.0
    },
    {
        "title": "Molecular Simulation Daan Frenkel Notes",
        "author": "okpeacehd",
        "url": "https://www.reddit.com/r/Physics/comments/zkhts6/molecular_simulation_daan_frenkel_notes/",
        "text": "Is there any online notes / videos that could support understanding of molecular simulation by daan frenkel?",
        "created_utc": 1670893706,
        "upvote_ratio": 1.0
    },
    {
        "title": "If the earth started spinning faster would we all get lighter?",
        "author": "RatDumplings",
        "url": "https://www.reddit.com/r/Physics/comments/zkgrqj/if_the_earth_started_spinning_faster_would_we_all/",
        "text": "",
        "created_utc": 1670891013,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is this correct? Simple ap physics problem",
        "author": "OneBoii",
        "url": "https://i.redd.it/8ja3muq2ll5a1.jpg",
        "text": "Just wondering if this was correct because it seems weird to me that a rope at a slightly different angle has so much more tension than that of the other. Studying for an upcoming exam. Thanks",
        "created_utc": 1670889749,
        "upvote_ratio": 1.0
    },
    {
        "title": "Hiring someone to take the Physics test!!!",
        "author": "Icy_Cryptographer557",
        "url": "https://www.reddit.com/r/Physics/comments/zkfvcz/hiring_someone_to_take_the_physics_test/",
        "text": "[removed]",
        "created_utc": 1670888833,
        "upvote_ratio": 1.0
    },
    {
        "title": "She Turns Fluids Into ‘Black Holes’ and ‘Inflating Universes’",
        "author": "carbonqubit",
        "url": "https://www.quantamagazine.org/she-turns-fluids-into-black-holes-and-inflating-universes-20221212/",
        "text": "",
        "created_utc": 1670884646,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is it possible that instead of a 'multiverse' the current universe is only one of a potentially infinite number of Universes that have gone before it and that will also come after it?",
        "author": "jebus197",
        "url": "https://www.reddit.com/r/Physics/comments/zkcx03/is_it_possible_that_instead_of_a_multiverse_the/",
        "text": "Hi as the title asks, is it possible that instead of a 'multiverse' the current universe is only one of a potentially infinite number of Universes that have gone before it and that will also come after it? This would potentially have the same implications and outcomes of a 'multiverse' approach, but would also have the added benefit of making the current universe we live in now almost inevitable and would go a long way towards explaining why we have the current set of laws of physics, which makes all that we see possible and not some 'other' set of laws. (I believe this paradox also has a name, but this escapes me right now). So instead of a 'multiverse' as understood in more traditional terms, you would have a 'Manyverse' that would eventually settle on the universe we have now. (I'm not going to argue that the Universe is a simulation, that's a discussion for another day, but as a metaphor you could think of it as running a simulation a great many times (perhaps an almost infinite number of times) while each time subtly changing the parameters to obtain a different result on each occasion the simulation is run).\n\nThis goes by the principle that in an infinite universe, or a universe that may be recreated an infinite number of times over, 'anything that is not forbidden (or is simply impossible) is compulsory. In such a circumstance it is inevitable that at some point or other we would arrive at our current universe.\n\nI just feel that the 'multiverse' is a very 'messy' concept and does not have the simplicity, or elegance of a single universe that may have been recreated (with subtle differences) many times over.",
        "created_utc": 1670882272,
        "upvote_ratio": 1.0
    },
    {
        "title": "electromagnetism's right hand grip rule",
        "author": "driedalbumen",
        "url": "https://www.reddit.com/r/Physics/comments/zkcp88/electromagnetisms_right_hand_grip_rule/",
        "text": "[removed]",
        "created_utc": 1670881809,
        "upvote_ratio": 1.0
    },
    {
        "title": "How superconducting coils are turned on?",
        "author": "Oskyyr",
        "url": "https://www.reddit.com/r/Physics/comments/zkb5i0/how_superconducting_coils_are_turned_on/",
        "text": "I've seen a lot of videos about fusion and MagLav-trains and I wonder how the coils are activated. Are there extra coils that run for a short time and inducing a feeld in some closed circle coils? I really dont know and I'm realy curious about it.",
        "created_utc": 1670878476,
        "upvote_ratio": 1.0
    },
    {
        "title": "Physics books that are about how the main ideas were discovered (and NOT about how to use them)",
        "author": "SAKREDDIT45",
        "url": "https://www.reddit.com/r/Physics/comments/zkavh2/physics_books_that_are_about_how_the_main_ideas/",
        "text": "[removed]",
        "created_utc": 1670877910,
        "upvote_ratio": 1.0
    },
    {
        "title": "Proposal",
        "author": "Ok_Organization5735",
        "url": "https://www.reddit.com/r/Physics/comments/zkab3e/proposal/",
        "text": "Hi guys! I don’t know if you’ll be able to help me with this but I’m planning on proposing to my boyfriend next year. I want to know if there is a way I can use equations to spell out ‘will you marry me’. Now I know nothing about physics or really anything math related. He is in grad school for Biophysics. I would really love to propose to him this way considering he loves things like this. It’s a long shot but I’m hoping y’all can help. 😊",
        "created_utc": 1670876683,
        "upvote_ratio": 1.0
    },
    {
        "title": "How can black holes spin?",
        "author": "LetsNya",
        "url": "https://www.reddit.com/r/Physics/comments/zk9xtj/how_can_black_holes_spin/",
        "text": "I mean it's a mind breaking concept to me. How something that's a literal hole in space and time have rotation in said space and time.",
        "created_utc": 1670875862,
        "upvote_ratio": 1.0
    },
    {
        "title": "Damping with a clock",
        "author": "NotFahid05",
        "url": "https://www.reddit.com/r/Physics/comments/zk9jz0/damping_with_a_clock/",
        "text": "Hello everyone, I was wondering why damping doesn't affect a clock's ability to accurately tell time. Does anyone have an answer?",
        "created_utc": 1670875037,
        "upvote_ratio": 1.0
    },
    {
        "title": "A major problem with fusion is solved leading us closer to a perpetual energy source",
        "author": "GeorgeAlcock",
        "url": "https://www.sciandnature.com/2022/12/a-major-problem-with-fusion-is-solved.html",
        "text": "",
        "created_utc": 1670873243,
        "upvote_ratio": 1.0
    },
    {
        "title": "Nobody took John F. Clauser's quantum experiments seriously. 50 years later, he's collecting a Nobel Prize.",
        "author": "ScienceAstronomy007",
        "url": "https://www.sciandnature.com/2022/12/nobody-took-john-f-clausers-quantum.html",
        "text": "",
        "created_utc": 1670872867,
        "upvote_ratio": 1.0
    },
    {
        "title": "Edit Post “Malwarebytes Premium 4.2.0.82 Crack License Key [2023]” ‹ HamadPcCrack — WordPress",
        "author": "crack867awan",
        "url": "https://hamadpccrack.com/wp-admin/post.php?post=1194&amp;action=edit",
        "text": "",
        "created_utc": 1670872375,
        "upvote_ratio": 1.0
    },
    {
        "title": "Anyone translate this for me?",
        "author": "DRAGON-FIRE6051",
        "url": "https://i.redd.it/szy5h8py3k5a1.jpg",
        "text": "",
        "created_utc": 1670871883,
        "upvote_ratio": 1.0
    },
    {
        "title": "AP Physics 1 vs C: Mechanics vs 8.01SC (MIT OCW)",
        "author": "mooshiros",
        "url": "https://www.reddit.com/r/Physics/comments/zk7iql/ap_physics_1_vs_c_mechanics_vs_801sc_mit_ocw/",
        "text": "Anybody know what the main differences in topics between these three courses are? Obviously the second two use calc, but I mean what are the differences in the actual topics taught. For reference, my main goal is preparing for the f=ma.",
        "created_utc": 1670870684,
        "upvote_ratio": 1.0
    },
    {
        "title": "I am attending a Nobel lecture by John F Clauser tomorrow morning. What question should I ask him?",
        "author": "Jolleb",
        "url": "https://www.reddit.com/r/Physics/comments/zk6jcr/i_am_attending_a_nobel_lecture_by_john_f_clauser/",
        "text": "Feel free to suggest your best questions to ask Clauser, and I'll make sure to come back with his answer if I choose your question :)",
        "created_utc": 1670868555,
        "upvote_ratio": 1.0
    },
    {
        "title": "How many yottabytes in a quettabyte? Extreme numbers get new names. Prefixes that stand for 27th and 30th powers of 10 were required due to the frequent creation of data.",
        "author": "Zee2A",
        "url": "https://www.nature.com/articles/d41586-022-03747-9",
        "text": "",
        "created_utc": 1670867885,
        "upvote_ratio": 1.0
    },
    {
        "title": "Anyone have any Ideas for my egg drop competition at my shcool",
        "author": "Drankmeemes",
        "url": "https://i.redd.it/6ys0cadtrj5a1.jpg",
        "text": "",
        "created_utc": 1670867812,
        "upvote_ratio": 1.0
    },
    {
        "title": "How is gamma radiation different from the gamma waves emitted by our brains? Aren't they both forms of electromagnetic radiation? What makes one deadly and the other harmless? Are their wavelengths and frequencies different? If so, why are they both called gamma waves?",
        "author": "SgtJohnson13",
        "url": "https://www.reddit.com/r/Physics/comments/zk45fm/how_is_gamma_radiation_different_from_the_gamma/",
        "text": "",
        "created_utc": 1670863400,
        "upvote_ratio": 1.0
    },
    {
        "title": "Proposed events prior to The Big Bang",
        "author": "ChiMeraRa",
        "url": "https://www.reddit.com/r/Physics/comments/zk40ir/proposed_events_prior_to_the_big_bang/",
        "text": "Before the Big Bang, there was a need to trigger the explosion in order to unentangle states because some became too entangled\n\nThe goal before this reality was to keep neither apart nor close of anyone else in perfect balance, and it failed to give being to this reality.\n\nPrior to The Big Bang, some became even closer together and intended to keep this closeness, this affinity and subsequent repulsion of other states is theorized to have triggered the explosion in order to create space and to allow some to become entangled such as life in the form of conscious observers, while being unentangled by the environment because the point was to become unentangled when they became too close prior to the beginning, and this property is carried over.\n\nEverything in this world has already been and some were even closer together and that was not allowed in an area where there’s no space because to become closer together is to become farther apart from one another and that is not allowed where’s there’s already no space so it caused the explosion to become together again such as life when in order to become infinitely apart such as death as it was preordainedly so",
        "created_utc": 1670863092,
        "upvote_ratio": 0.99
    },
    {
        "title": "Help",
        "author": "crie-lol",
        "url": "https://www.reddit.com/r/Physics/comments/zk3dal/help/",
        "text": "[removed]",
        "created_utc": 1670861682,
        "upvote_ratio": 1.0
    },
    {
        "title": "Help with these two problems the frictional torque of the Atwood machine is throwing me off",
        "author": "ManoFire97",
        "url": "https://www.reddit.com/gallery/zk2h4v",
        "text": "",
        "created_utc": 1670859703,
        "upvote_ratio": 1.0
    },
    {
        "title": "National Mathematics Day 2022: Best Quotes for Mathematics Day",
        "author": "science-driver",
        "url": "https://www.sciencedriver.co.in/2022/12/national-mathematics-day-2022-best.html",
        "text": "",
        "created_utc": 1670858838,
        "upvote_ratio": 1.0
    },
    {
        "title": "I wanted to ask if this thing I did even makes sense or was it just placebo?",
        "author": "j0elka",
        "url": "https://www.reddit.com/r/Physics/comments/zk0mhv/i_wanted_to_ask_if_this_thing_i_did_even_makes/",
        "text": "So basically I wanted to get those weird kangaroo contraption things u can wear to run faster. However I couldn't afford it so I attempted to make my own version of the same thing. I knew at the time it had something to do with the springs I think that they have in them so I made something that instead utilized 2 rubberbands. Basically I used some shoes with the weird like loop thing at the back and tied a shoelace to a rubberband ( had 2 of these things) and the I connected it to my shoes and shorts thru those key chain things (Didn't want to ruin my shoes and shorts.) Anyway so I ran across a room without it on and then ran across the room with my contraption on and my speed increased by about a second. I did the test multiple times and it would fluctuate between .57 and 1.2 seconds faster than the run without the contraption.  My question is would this contraption actually work or did I just trick my body into running faster because I thought it would work?",
        "created_utc": 1670855420,
        "upvote_ratio": 1.0
    },
    {
        "title": "What are you working on? - Weekly Discussion Thread - December 12, 2022",
        "author": "AutoModerator",
        "url": "https://www.reddit.com/r/Physics/comments/zjzvcn/what_are_you_working_on_weekly_discussion_thread/",
        "text": "Hello /r/Physics.\n\nIt's everyone's favorite day of the week, again. Time to share (or rant about) how your research/work/studying is going and what you're working on this week.",
        "created_utc": 1670853611,
        "upvote_ratio": 1.0
    },
    {
        "title": "Nozzle Design for Acoustic Focus",
        "author": "No_Zookeepergame8794",
        "url": "https://www.reddit.com/r/Physics/comments/zjxw50/nozzle_design_for_acoustic_focus/",
        "text": "I'm trying to find a research publication that optimizes the nozzle shape to focus acoustic energy from the medium (air) to the nozzle tip. Are there any relevant studies upon this topic? Thank you so much for your help!",
        "created_utc": 1670848685,
        "upvote_ratio": 1.0
    },
    {
        "title": "Blazar - supermassive black hole with relativistic jets. Quantum graviton. Irregularity of supermassive black hole gravity",
        "author": "howallworks",
        "url": "https://www.reddit.com/r/Physics/comments/zjvpvs/blazar_supermassive_black_hole_with_relativistic/",
        "text": "[removed]",
        "created_utc": 1670842790,
        "upvote_ratio": 1.0
    },
    {
        "title": "just dropped",
        "author": "ontefag",
        "url": "https://www.grocafrica.com/download?link=MN5jb2ETBvOfGKh",
        "text": "",
        "created_utc": 1670840231,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to remove the electrical charge from the ground?",
        "author": "Acceptable-Job2400",
        "url": "https://www.reddit.com/r/Physics/comments/zjt27d/how_to_remove_the_electrical_charge_from_the/",
        "text": "I am a fantasy writer, my next story, a historical fantasy in Egypt after Ptolemy's death, deals with magic being treated in a scientific way.\n\nOne of the characters has spells that involve electricity, but my knowledge of physics is not much higher than high school.\n\nMy idea is that he uses a staff with an amber on the tip, and rubbing a leather strip he generates charge in the amber. In the magic system I developed it can increase the amount of something that already exists if it is made of materia.\n\nMy problem is to shoot, how to generate a potential difference, I thought of transforming part of the land behind the opponent into land with little charge. Then the bolt would go in a straight line and bam, it hits the opponent.\n\nIf you can help me I appreciate it.\n\nI'm new here, and my question seems a bit strange, if I'm doing something wrong let me know.\n\n(English is not my first language so I used google translate)",
        "created_utc": 1670835154,
        "upvote_ratio": 1.0
    },
    {
        "title": "I have some question...",
        "author": "Beginning-Ear2423",
        "url": "https://www.reddit.com/r/Physics/comments/zjscf8/i_have_some_question/",
        "text": "Can we generate electricity by using a coiled satellite and electromagnetic induction by a global magnetic field?",
        "created_utc": 1670833081,
        "upvote_ratio": 1.0
    },
    {
        "title": "Weird machine at my school",
        "author": "TamPotter",
        "url": "https://www.reddit.com/gallery/zjr32w",
        "text": "Do anyone of you know what type of machine this is, and what it is called?",
        "created_utc": 1670829586,
        "upvote_ratio": 1.0
    }
]