[
    {
        "title": "Im writing a book about black holes, are my understanding of Einsteins relativity theory, special relativity theory and equivalence principle correct?",
        "author": "Lillchris113",
        "url": "https://www.reddit.com/r/Physics/comments/10b1ztw/im_writing_a_book_about_black_holes_are_my/",
        "text": "Hello. Im suffering from ADHD and dyslexia and im having a hard time understanding relativity theory and all that kind of stuff.  Im writing a book about black holes which is kinda funny because I cant even understand basic physics, but ive learned alot these last weeks about black holes. \n\nMy question is, are these statements correct:\n\n*The principle of equivalence* = **If I drop a rock on earth it hits the ground, and if im in a spaceship accelerating in a speed of 9.8 m/s from earth, and drop a rock, it will also hit the ground just as fast. If no one told me I was in a spaceship, I might as well think im standing at the earths surface, I cant tell the difference.**\n\nIs this a correct statement so to say?\n\n*Theory of relativity=* **If I point a laser or a flashlight strong enough to be visible in another star system, the light beam from the laser/flashlight will not go in a straight line, but a curved line because the mass of the sun is curving my lightbeam.**\n\n*Special relativity theory=* **A rock and a feather will have the exact same speed if dropped to the ground on earth. This is because of the earths gravitational pull and not the mass of the feather/rock.**\n\n  \nThanks in advance for helping me out!",
        "created_utc": 1673635321,
        "upvote_ratio": 1.0
    },
    {
        "title": "A question from a non-physician to physicians",
        "author": "Tibtoubtib",
        "url": "https://www.reddit.com/r/Physics/comments/10b1r2v/a_question_from_a_nonphysician_to_physicians/",
        "text": "Hello !\n\nFirst of all, sorry if this is not the right sub to ask.\n\nA couple years ago, I read somewhere that the experiences with the LHC in 2012 that led to prove the Higgs Boson existence also showed that atoms weren't able to move if there wasn't any consciousness looking at them. Meaning atoms need to be observed by a consciousness to be able to move.\n\nThis discovery was supposed to open the doors to God existence.\n\nI can't find that explanation anywhere anymore. Again, I'm no physician at all and I may totally be talking about a fasle theory, that's why I thought I'd ask here if what I read back then was true and sorry if it's not and seems absurd.\n\nDid atoms need to be observed to be able to move and that was proven with the LHC experiences in 2012 ?\n\nThanks !",
        "created_utc": 1673634750,
        "upvote_ratio": 1.0
    },
    {
        "title": "Intrinsic Carrier Density of Ge",
        "author": "MatheusPese",
        "url": "https://www.reddit.com/r/Physics/comments/10b1kal/intrinsic_carrier_density_of_ge/",
        "text": "I am trying to solve this problem i was given and could not complete in due. \n\nhttps://preview.redd.it/rfs8jt5aruba1.png?width=493&amp;format=png&amp;auto=webp&amp;v=enabled&amp;s=bc99e3e45c87a4598549b615efd756707c845057\n\nFor now, this is all of what i did:  \n\n\nhttps://preview.redd.it/pvjpqcdlruba1.png?width=1056&amp;format=png&amp;auto=webp&amp;v=enabled&amp;s=aabe4885426a2f26d3cb11303b973154106ec1ad\n\nBut i don't know how to find the Fermi Level. At all.  \nDoes someone know what i need to do? I really don't know if i should be asking this here, but i don't know where i could ask help for, considering this is from a class of \"Semiconductor Devices Physics\" at the master's degree i am doing in Microelectronics.",
        "created_utc": 1673634300,
        "upvote_ratio": 1.0
    },
    {
        "title": "You are all superheroes!",
        "author": "Theeintellectua1",
        "url": "https://www.reddit.com/r/Physics/comments/10b1j47/you_are_all_superheroes/",
        "text": "I just wanted to come on this thread to show some love lol. \n\nI’ve always been fascinated by the universe and Albert Einstein is one of my heroes (I read his book in my later years at a young age) I love to watch documentaries on YouTube or Netflix about wormholes etc. Unfortunately, I’ve never really had the capacity to fully understand physics (not skilled enough to major in it for college or even be exceptional at it in high school) but I’ve always thought to myself the people contributing to this field are heroes of the world in their own way. It saddens me that my schools always taught physics as almost a gruelingly boring subject that introduction classes were overly difficult (if you can’t explain something simply then you don’t understand it well enough Einstein said it first lol) which played a role in myself and some of my peers passing it off. But all of you who have this knowledge and understand the depths of it are a little more connected to the world than everyone else and that’s something very special. Also, don’t judge me but I just watch ingress on Netflix and started looking up stuff about exotic matter lol. If you got anything on the subject I’d love to hear more!\nHappy to be on this sub.",
        "created_utc": 1673634218,
        "upvote_ratio": 1.0
    },
    {
        "title": "how?",
        "author": "vkr1212",
        "url": "https://i.redd.it/d7cofv36yvba1.jpg",
        "text": "",
        "created_utc": 1673630323,
        "upvote_ratio": 1.0
    },
    {
        "title": "how?",
        "author": "vkr1212",
        "url": "https://i.redd.it/3gd6p63zxvba1.jpg",
        "text": "",
        "created_utc": 1673630242,
        "upvote_ratio": 1.0
    },
    {
        "title": "Will this work? Thinking about building it.",
        "author": "Zealousideal-Try-784",
        "url": "https://i.redd.it/r3zul3tefuba1.jpg",
        "text": "",
        "created_utc": 1673629894,
        "upvote_ratio": 1.0
    },
    {
        "title": "Rare ‘dark lightning’ might briefly touch passengers when flying",
        "author": "Galileos_grandson",
        "url": "https://www.sciencenews.org/article/dark-lightning-gamma-rays-touch-passengers-flying",
        "text": "",
        "created_utc": 1673628265,
        "upvote_ratio": 1.0
    },
    {
        "title": "Gravitational spike wave?",
        "author": "Siji33",
        "url": "https://www.reddit.com/r/Physics/comments/10axok3/gravitational_spike_wave/",
        "text": "Ever since i saw this video [https://www.youtube.com/watch?v=iWKFPTgkpXo&amp;t=161s](https://www.youtube.com/watch?v=iWKFPTgkpXo&amp;t=161s), i was wondering what would happen if you had enough energy to generate a gravitational spike wave? LIGO proved they exist, so is it theoretically possible?\n\nHear me out, this might be sci-fi but what if there was a point in space where multiple gravitational waves combined to form a spike like the one in the video. But instead of waves in water, it's in the \"fabric\" of space. What would happen? Would it open a wormhole? Create something that acts like a black hole? i'm curious to know what you think will happen.",
        "created_utc": 1673624768,
        "upvote_ratio": 1.0
    },
    {
        "title": "Best tablets for note taking or working out problems that you guys have used",
        "author": "doublebubble459",
        "url": "https://www.reddit.com/r/Physics/comments/10axkuw/best_tablets_for_note_taking_or_working_out/",
        "text": "Im an undergrad student in physics and I’m reaching my limit on hand written notes when it comes to writing out a million graphs so I was wondering if any people here have good suggestions for a tablet that is good for notes and problem solving. I would prefer it cheaper if one is known. If this isn’t appropriate for this sub my apologies.",
        "created_utc": 1673624514,
        "upvote_ratio": 1.0
    },
    {
        "title": "Delayed Choice Quantum Eraser, is it real?",
        "author": "Nova-Physics",
        "url": "https://www.reddit.com/r/Physics/comments/10axidv/delayed_choice_quantum_eraser_is_it_real/",
        "text": "[removed]",
        "created_utc": 1673624341,
        "upvote_ratio": 1.0
    },
    {
        "title": "Two helicopters",
        "author": "PerfectAttention9225",
        "url": "https://www.reddit.com/r/Physics/comments/10awzl6/two_helicopters/",
        "text": "Two helicopters exist in a perfect world, constant gravity, and no air resistance. One hovers in middair, and another moves up at constant velocity. Both helicopters' rotors exert the same force, because none are accelerating, and both are using fuel at the same rate. However, one is adding gravitational potential energy to itself and one is not. Where did the energy of the hovering helicopter go?",
        "created_utc": 1673623003,
        "upvote_ratio": 1.0
    },
    {
        "title": "Textbooks roadmap for those who know nothing about physics with poor mathematics background",
        "author": "mgbsher",
        "url": "https://www.reddit.com/r/Physics/comments/10awtkc/textbooks_roadmap_for_those_who_know_nothing/",
        "text": "Hi,\n\nI searched for a basic plain text roadmap to learn physics but found many books recommended in the subreddit.\n\nI do not know what I do not know.\n\nIf someone wants to learn physics from scratch with a poor mathematics background, till the step before joining a college.\n\nSo, does there is a roadmap for such a thing or I am mistaken and it does not exist?\n\nThanks",
        "created_utc": 1673622565,
        "upvote_ratio": 1.0
    },
    {
        "title": "Textbooks &amp; Resources - Weekly Discussion Thread - January 13, 2023",
        "author": "AutoModerator",
        "url": "https://www.reddit.com/r/Physics/comments/10av84a/textbooks_resources_weekly_discussion_thread/",
        "text": "This is a thread dedicated to collating and collecting all of the great recommendations for textbooks, online lecture series, documentaries and other resources that are frequently made/requested on /r/Physics.\n\nIf you're in need of something to supplement your understanding, please feel welcome to ask in the comments.\n\nSimilarly, if you know of some amazing resource you would like to share, you're welcome to post it in the comments.",
        "created_utc": 1673618411,
        "upvote_ratio": 1.0
    },
    {
        "title": "It’s literally as cool as I expected to be.",
        "author": "Campded",
        "url": "https://i.redd.it/0zcd17vfgtba1.jpg",
        "text": "",
        "created_utc": 1673618136,
        "upvote_ratio": 1.0
    },
    {
        "title": "To those who “failed” academia, what made you finally quit?",
        "author": "saaer_",
        "url": "https://www.reddit.com/r/Physics/comments/10auzw1/to_those_who_failed_academia_what_made_you/",
        "text": "I’m graduating high school this year and will probably pursue a Bachelor’s in physics in one of the colleges i get accepted. The thing is.. even though academia has been a dream of mine for a long time I’m encountering increasing amounts of people who dropped out due to extremely toxic community, inhumane working hours, all the politics and the “game” bla bla.. I just want to hear your honest opinions, and if you could have done something different what would it be.",
        "created_utc": 1673617780,
        "upvote_ratio": 1.0
    },
    {
        "title": "Questions about lightspeed",
        "author": "Ok-Neighborhood7371",
        "url": "https://www.reddit.com/r/Physics/comments/10auuab/questions_about_lightspeed/",
        "text": "Imagine you had a lightbulb right over your head and youre looking into a mirror x miles away from you. When turning the light above your head, how would you calculate the speed the reflected light reaches your eyes? I assume one has to factor in medium it travels throught aswell? Fog/rain/etc\n\nWould it always take the reflected light hitting your eyes double the amount of the time it takes for it to be reflected back to you?",
        "created_utc": 1673617336,
        "upvote_ratio": 1.0
    },
    {
        "title": "a²+b²=E/m",
        "author": "NoUnderstandins",
        "url": "https://i.redd.it/wss2wltn8tba1.jpg",
        "text": "",
        "created_utc": 1673615523,
        "upvote_ratio": 1.0
    },
    {
        "title": "How does physics research (BS) work?",
        "author": "AirOne4159",
        "url": "https://www.reddit.com/r/Physics/comments/10atdhm/how_does_physics_research_bs_work/",
        "text": "[removed]",
        "created_utc": 1673612965,
        "upvote_ratio": 1.0
    },
    {
        "title": "how much energy does a thunder have? I don't mean the electric energy in lightning, I mean the energy in the sound.",
        "author": "Apprehensive_Kick463",
        "url": "https://www.reddit.com/r/Physics/comments/10as3gj/how_much_energy_does_a_thunder_have_i_dont_mean/",
        "text": "",
        "created_utc": 1673608764,
        "upvote_ratio": 1.0
    },
    {
        "title": "Interdisciplinary studies",
        "author": "11bucksgt",
        "url": "https://www.reddit.com/r/Physics/comments/10arion/interdisciplinary_studies/",
        "text": "Due to a short timeline I am unable to receive a degree in my intended major, AstroPhysics and instead have to opt for interdisciplinary studies so I can enroll in some of the Physics classes. \n\nCurrently a junior. \n\nI am however taking nearly similar classes and I am curious how this might affect Grad school. \n\nI am finishing Calc1-3, differential Equations and Linear Algebra. \n\nPhysics 1&amp;2\n\nThermodynamics \n\nIntro to Astrophysics \n\n20th Century Physics \n\nAnd I am TRYING to get into Survey of Quantum Mechanics but I don’t think I’ll be able to. \n\nI understand that’s not the full fledged Physics curriculum of an undergrad but it’s almost identical to what my school requires for an undergrad in Astrophysics, minus the astronomy courses. \n\nWhat do you guys think? My intentions are to apply to Arizona State University. I think studying for and taking the GRE might strengthen my bid for acceptance but maybe I am over thinking this as well.",
        "created_utc": 1673606727,
        "upvote_ratio": 1.0
    },
    {
        "title": "Approaching optimal entangling collective measurements on quantum computing platforms - Nature Physics",
        "author": "lfuwebred",
        "url": "https://www.nature.com/articles/s41567-022-01875-7",
        "text": "",
        "created_utc": 1673603366,
        "upvote_ratio": 1.0
    },
    {
        "title": "is this equation coherent? matter, frequancy, time, entropy, energey",
        "author": "Spiritual_Navigator",
        "url": "https://i.redd.it/0i2viysccsba1.jpg",
        "text": "",
        "created_utc": 1673586649,
        "upvote_ratio": 1.0
    },
    {
        "title": "I love this",
        "author": "MaximumFishings",
        "url": "https://i.redd.it/uvtwgel8sqba1.jpg",
        "text": "",
        "created_utc": 1673585826,
        "upvote_ratio": 1.0
    },
    {
        "title": "How does it look",
        "author": "InsideDefinitione",
        "url": "https://i.redd.it/03ak6obolqba1.png",
        "text": "",
        "created_utc": 1673583688,
        "upvote_ratio": 1.0
    },
    {
        "title": "Best book to learn about theoretical physics for a newbie?",
        "author": "Night_Sky02",
        "url": "https://www.reddit.com/r/Physics/comments/10akocs/best_book_to_learn_about_theoretical_physics_for/",
        "text": "Hi,\n\nI have a curious mind, I'm interested to learn about the cosmos and how the Universe works.\n\nI have an interest in learning about theoretical physics, topics such as string theory and quantum physics.\n\nI only have a basic high school and I'm 34 years old.\n\nDo you any some good books to recommend? That are not too math-heavy and are easy to comprehend?",
        "created_utc": 1673582831,
        "upvote_ratio": 1.0
    },
    {
        "title": "Just wanted to share my most fav one!!",
        "author": "SuspiciousCres",
        "url": "https://i.redd.it/mc01plf97qba1.png",
        "text": "",
        "created_utc": 1673578737,
        "upvote_ratio": 1.0
    },
    {
        "title": "Winds exiting high pressure spiral in one orientation (Coriolis) but spiral in the other orientation going into low pressure, why? shouldn't Coriolis continue to deflect in same direction?",
        "author": "JustSlowDowns",
        "url": "https://i.redd.it/86fgps9gorba1.jpg",
        "text": "",
        "created_utc": 1673578609,
        "upvote_ratio": 1.0
    },
    {
        "title": "Looking for resources recommendation to learn how to write down equations of motion and solve dynamic systems analytically",
        "author": "Playertee",
        "url": "https://www.reddit.com/r/Physics/comments/10aioxo/looking_for_resources_recommendation_to_learn_how/",
        "text": "I am an engineer, and I have recently been working on lots of wacky mechanisms like an inverted pendulum mounted on a car kind of thing. I need to draw the free body diagrams, and write down the equations of motion which usually uses Newton’s second law, then solve them using Matlab or other tools. Is there a course or a textbook I can use to get better at this kind of analysis?",
        "created_utc": 1673577225,
        "upvote_ratio": 1.0
    },
    {
        "title": "Interesting phenomina when a laser passes through sugar water.",
        "author": "Western-Gazelle1574",
        "url": "https://i.redd.it/qnidir7zppba1.jpg",
        "text": "",
        "created_utc": 1673572913,
        "upvote_ratio": 1.0
    },
    {
        "title": "Do superconductors have electric fields around and/or inside them?",
        "author": "QuickNature",
        "url": "https://www.reddit.com/r/Physics/comments/10ag6h9/do_superconductors_have_electric_fields_around/",
        "text": "Pretty much the title. Doing a little research, and I can't find a definitive answer. A fairly simple breakdown of the topic would be greatly appreciated.\n\nAlso, for reference, I do have an electrical background. I have taken calculus, circuit analysis, and general physics 2 so I will understand some of the terminology.\n\nThanks in advance.",
        "created_utc": 1673570623,
        "upvote_ratio": 1.0
    },
    {
        "title": "A problem about buoyancy",
        "author": "baltspiens",
        "url": "https://www.reddit.com/r/Physics/comments/10afara/a_problem_about_buoyancy/",
        "text": "[removed]",
        "created_utc": 1673568370,
        "upvote_ratio": 1.0
    },
    {
        "title": "Physics Help PM please for S",
        "author": "melbehesy",
        "url": "https://www.reddit.com/r/Physics/comments/10aeq6c/physics_help_pm_please_for_s/",
        "text": "",
        "created_utc": 1673566952,
        "upvote_ratio": 1.0
    },
    {
        "title": "how long does it typically take to become a theoretical physicist",
        "author": "zacharydelrio",
        "url": "https://www.reddit.com/r/Physics/comments/10aegeh/how_long_does_it_typically_take_to_become_a/",
        "text": "Hopefully this is the right subreddit to ask this but how long does it typically take to become a theoretical physicist? Also, does it matter which degree you choose to become one?",
        "created_utc": 1673566284,
        "upvote_ratio": 1.0
    },
    {
        "title": "Book with guided exercises for undergraduate classical mechanics?",
        "author": "reartu99",
        "url": "https://www.reddit.com/r/Physics/comments/10aee39/book_with_guided_exercises_for_undergraduate/",
        "text": "Pretty much title, I am looking for a swath of complex exercises regarding circular motion and pulleys in particular since my next test will be on those and my professor has a known love for those kind of exercises.  \nThanks in advance!",
        "created_utc": 1673566131,
        "upvote_ratio": 1.0
    },
    {
        "title": "I am struggling with some basic Physics homework, and wanted to check if AI could help me. However I get a different answers from chat GPT every time, do you know of another free AI website that could work?",
        "author": "Relevant-Amoeba-6189",
        "url": "https://www.reddit.com/r/Physics/comments/10adk7e/i_am_struggling_with_some_basic_physics_homework/",
        "text": "",
        "created_utc": 1673564172,
        "upvote_ratio": 1.0
    },
    {
        "title": "Blackholes and singularities",
        "author": "After_Lab_3730",
        "url": "https://www.reddit.com/r/Physics/comments/10actc0/blackholes_and_singularities/",
        "text": "As far as my understanding goes:\n\n\\- Each blackhole is theorized to have a singularity \n\n\\- There are millions ( if not bill or trill) of blackholes\n\nSo, if the universe originated from a singularity that contained everything to create the universe and exploded with enough energy to create it - how come the singularities within blackholes dont do that? Like why aren't they exploding? and why wouldn't that cause a greater rate of expansion? Im not sure if my terminology is correct by a singularity is an infinitely dense point??? So is it the nature of the blackhole that prohibits any expansion? \n\nIn the Big Bang Theory is the singularity a blackhole?\n\nThe main problem here may just be my understanding of the fundamentals of blackholes tbh.",
        "created_utc": 1673562389,
        "upvote_ratio": 1.0
    },
    {
        "title": "XMM-Newton spies black holes eating the same stars again and again",
        "author": "Galileos_grandson",
        "url": "https://www.esa.int/Science_Exploration/Space_Science/XMM-Newton_spies_black_holes_eating_the_same_stars_again_and_again#.Y8CAnwT-ntc.link",
        "text": "",
        "created_utc": 1673560559,
        "upvote_ratio": 1.0
    },
    {
        "title": "Day of Theoretical Physicist?",
        "author": "ziyaagunes",
        "url": "https://www.reddit.com/r/Physics/comments/10abm5h/day_of_theoretical_physicist/",
        "text": "As a prospective physics undergraduate student, i wonder what is theoratical physicists' daily routine? What is research like? Just solving some random equations and wishing something worthy come out? That one was for kidding but it might be true though.",
        "created_utc": 1673559658,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does not observable light even exist?",
        "author": "lyudyna",
        "url": "https://www.reddit.com/r/Physics/comments/10ab4pm/does_not_observable_light_even_exist/",
        "text": "So there is a theory that we live in a simulation because when we dont observe light it behaves like a wave, and then theory make an example that In video games your computer only render objects or location that you look at, then I asked myself \"Does it mean that wave of light is made of nothing? how can it be possible? waves of light arent made of photons?\" \n\nplease explain this thing to me\n\nSorry for a poor explanations and my bad english",
        "created_utc": 1673558553,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is the a catalogue of things that physics has yet to provide an explanation for?",
        "author": "Maurichio1",
        "url": "https://www.reddit.com/r/Physics/comments/10ab1cx/is_the_a_catalogue_of_things_that_physics_has_yet/",
        "text": "I like to think of any science as a map and the edges that are yet to be drawn out are things that we encounter in reality for which we have yet no explanation. Is there a type of list or catalogue where such things are kept in regard to physics?\n\nFor example, assuming the phenomenon described as ball lightning is real, it would be part of that list as it is unexplained. It sounds like it would be a good tool to intrigue people to look into different things, especially scientists who may have no clue about things and problems outside of their own particular field or subfield.",
        "created_utc": 1673558344,
        "upvote_ratio": 1.0
    },
    {
        "title": "hight",
        "author": "Fragrant-Age5442",
        "url": "https://www.reddit.com/r/Physics/comments/10aabp4/hight/",
        "text": "[removed]",
        "created_utc": 1673556670,
        "upvote_ratio": 1.0
    },
    {
        "title": "What does a sphere in the 4th dimension look like?",
        "author": "Alternative-Share68",
        "url": "https://www.reddit.com/r/Physics/comments/10a9m8h/what_does_a_sphere_in_the_4th_dimension_look_like/",
        "text": "I haven't found anything on the internet about this topic. I only see animations of a 4D sphere entering and leaving 3D space. Are there any good animations/photos of a 4D sphere model like the 4D cube?",
        "created_utc": 1673554985,
        "upvote_ratio": 1.0
    },
    {
        "title": "The time dimension",
        "author": "CYM_YGS",
        "url": "https://www.reddit.com/r/Physics/comments/10a8qax/the_time_dimension/",
        "text": "First and foremost, My understanding of Physics is basic middle-school physics. I'm just curious to understand my thoughts after not finding anything relevant online.\n\n\\--------------------------------\n\nSo, my question regards the space-time dimensions.\n\nFrom 10 minutes of wiki-surfing, I realized that basically we live in a world of 4 dimensions:\n\nSpace, containing length (x), height (y), and width/depth (z)   \n(I might already be terribly wrong here so please correct me if I do)\n\nand the 4th dimension is time.\n\nNow, if we always 'continue' down the timeline, we can never be 100% accurate if we would like to pinpoint our exact location in a given second. \\*\n\nBasically, my question is, are we closer to the next second, or the previous one?  \nIf we can't pinpoint our exact location, we can never understand it. no?\n\n\\----------------------------------  \nThanks for reading, and sorry for any bad English or scientific mistakes.\n\n&amp;#x200B;\n\n\\*My basic thought here was based on \"  **Heisenberg's uncertainty principle** \" which I've learned about a couple of months ago regarding the Atomic orbital.",
        "created_utc": 1673552839,
        "upvote_ratio": 1.0
    },
    {
        "title": "What happens when an object (b) exits the sphere of observation on another object (a)?",
        "author": "nostrangertolove69",
        "url": "https://www.reddit.com/r/Physics/comments/10a85f0/what_happens_when_an_object_b_exits_the_sphere_of/",
        "text": "Inspired by [this recent post](https://www.reddit.com/r/Physics/comments/10a33v1/does_the_force_of_gravity_between_two_objects/?utm_source=share&amp;utm_medium=android_app&amp;utm_name=androidcss&amp;utm_term=1&amp;utm_content=share_button) and [this awesome video by Fermilab](https://youtube.com/watch?v=vIJTwYOZrGU&amp;feature=shares), I have a kind of follow-up question. If  an object (b) exits the sphere of observation of another object (currently about 15 billion light years)(a), what happens to the gravitational force exerted by a on b?\n\nI know the force is very low when reaching object b, but will it just vanish?",
        "created_utc": 1673551449,
        "upvote_ratio": 1.0
    },
    {
        "title": "How Do I Learn Physics - From The Start?",
        "author": "That_3D_Guitar",
        "url": "https://www.reddit.com/r/Physics/comments/10a7gbp/how_do_i_learn_physics_from_the_start/",
        "text": "Hi All,\n\nPlease remove if not allowed.\n\nI'm 13 years old, and extremely interested in the universe and space. I've been pondering the philosophy of parallel universes and extra-terrestrial life, and realised that to truly understand the universe I should learn physics.\n\nI have a basic understanding of forces but not much else.\n\nWhat would the best way to learn physics, from start to finish? I'm most interested in metaphysics, quantum physics and string theory.\n\nThank you for reading :)",
        "created_utc": 1673549814,
        "upvote_ratio": 1.0
    },
    {
        "title": "I made a tiny library for quantum optimal control!",
        "author": "RustyBamb00",
        "url": "https://www.reddit.com/r/Physics/comments/10a798v/i_made_a_tiny_library_for_quantum_optimal_control/",
        "text": "[https://github.com/RustyBamboo/Pulses.jl](https://github.com/RustyBamboo/Pulses.jl)\n\nThe library finds \"pulses\" that manipulate the quantum dynamics of a system in the best way possible. For example, good pulses are needed to realize efficient and robust gates on quantum computers.\n\nPlease feel free to play around with the code -- my goal was to make it tiny and relatively readable. Let me know of any suggestions!\n\nHere is an example generated pulse:\n\nhttps://i.redd.it/z9r4m43qpnba1.gif",
        "created_utc": 1673549342,
        "upvote_ratio": 1.0
    },
    {
        "title": "Our physics teacher gave us a puzzle in electrical circuits and it had me bummed out.",
        "author": "its_zack",
        "url": "https://www.reddit.com/r/Physics/comments/10a706z/our_physics_teacher_gave_us_a_puzzle_in/",
        "text": "The puzzle goes as the following: \n\n10 resistors of 50 ohm each. Arrange them to get 50 ohm equivalent resistance.",
        "created_utc": 1673548728,
        "upvote_ratio": 1.0
    },
    {
        "title": "So, if something were to travel faster than light it would cause paradoxes. But what happens when you make a scaled down simulation of faster than light travel?",
        "author": "Damian-WorldDevourer",
        "url": "https://www.reddit.com/r/Physics/comments/10a6tu3/so_if_something_were_to_travel_faster_than_light/",
        "text": "",
        "created_utc": 1673548293,
        "upvote_ratio": 1.0
    },
    {
        "title": "If you are in a \"vehicle\" traveling at the speed of light...",
        "author": "friendandmachine",
        "url": "https://www.reddit.com/r/Physics/comments/10a654g/if_you_are_in_a_vehicle_traveling_at_the_speed_of/",
        "text": "If you are in a \"vehicle\" traveling at the speed of light while shooting a light beam, will it decrease in speed or stay neutral?",
        "created_utc": 1673546645,
        "upvote_ratio": 1.0
    },
    {
        "title": "Gyroscope and its mystery",
        "author": "kidane444",
        "url": "https://www.reddit.com/r/Physics/comments/10a4f9a/gyroscope_and_its_mystery/",
        "text": "**Where does a gyroscope get its precessional kinetic energy from?**\n\n&amp;#x200B;\n\n[Gyroscopic flywheel](https://preview.redd.it/k4c59obb7nba1.jpg?width=293&amp;format=pjpg&amp;auto=webp&amp;v=enabled&amp;s=41a39d3c25e32feff16a482a625dbf98ff303bb6)\n\nNormally, when a flywheel spins at a higher **ω\\_s**, it precesses with **Ω**\\_z   without falling to the ground. The only input energy to the system  here  is spin kinetic energy. Since the wheel is rotating at a constant **ω\\_s,**   the spin  kinetic energy will not be transferred to precessional   kinetic energy. Additionally, other form of energy we have is the   potential energy due to gravity, this will not change also due to the   fact that the flywheel will always maintain its height from the   ground. Therefor, the energy should have come from a non mechanical   source…what source?. I would like to hear other explanations on it if   there is one.",
        "created_utc": 1673542478,
        "upvote_ratio": 1.0
    },
    {
        "title": "Please help me solve an airflow argument !",
        "author": "Subject-Cricket2381",
        "url": "https://www.reddit.com/r/Physics/comments/10a40zk/please_help_me_solve_an_airflow_argument/",
        "text": "I’m trying to convince gf that leaving the bathroom door open gets more moisture out than the fan \n\nSo my bathroom is 400 cubic feet, and the bathroom fan is about 40 cfm so ~10 minutes to clear our room. \n\nDoor is 6.5 x 3, so how would you estimate the airflow leaving the bathroom out of the door ? I’m sure apartment pressure is involved, bathroom opens to a small hallway \n\nAny input would be great :)",
        "created_utc": 1673541522,
        "upvote_ratio": 1.0
    },
    {
        "title": "How can I see haidiger’s brush on any screen including LED or any white surface when tilting head when it’s supposed to be visible only in polarized light sources ? (LCD)",
        "author": "Fluffy-Crow-1700",
        "url": "https://i.redd.it/exqq8auploba1.jpg",
        "text": "",
        "created_utc": 1673541374,
        "upvote_ratio": 1.0
    },
    {
        "title": "Physics Today: Nazis, émigrés, and abstract mathematics",
        "author": "dem676",
        "url": "https://physicstoday.scitation.org/doi/full/10.1063/PT.3.5158",
        "text": "",
        "created_utc": 1673541353,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does the force of gravity between two objects ever reach zero?",
        "author": "MomICantPauseReddit",
        "url": "https://www.reddit.com/r/Physics/comments/10a33v1/does_the_force_of_gravity_between_two_objects/",
        "text": "Suppose we have a completely empty universe, except for two small bodies of matter. Is there a distance at which one could place these objects such that their gravitational force was absolutely zero, rather than being effectively zero? Can we say that two objects, given enough time, will accelerate toward one another and eventually touch in this system, even if \"eventually\" means millions of times longer than our universe's lifespan?",
        "created_utc": 1673539280,
        "upvote_ratio": 1.0
    },
    {
        "title": "Love smart women!",
        "author": "gxeh",
        "url": "https://i.redd.it/lvzwlsi2doba1.jpg",
        "text": "",
        "created_utc": 1673538461,
        "upvote_ratio": 1.0
    },
    {
        "title": "Heinrich Päs discusses new book — The Boston Globe",
        "author": "GlobeOpinion",
        "url": "https://www.bostonglobe.com/2023/01/12/opinion/how-many-things-are-there-entire-universe-this-is-trick-question/",
        "text": "",
        "created_utc": 1673538201,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can anyone tell me the answer to this I got marked 1 out of 2 which means I missed a point",
        "author": "Big-Pair-8941",
        "url": "https://i.redd.it/57mqcybi1oba1.jpg",
        "text": "",
        "created_utc": 1673534576,
        "upvote_ratio": 1.0
    },
    {
        "title": "Careers/Education Questions - Weekly Discussion Thread - January 12, 2023",
        "author": "AutoModerator",
        "url": "https://www.reddit.com/r/Physics/comments/10a0bmv/careerseducation_questions_weekly_discussion/",
        "text": "This is a dedicated thread for you to seek and provide advice concerning education and careers in physics.\n\nIf you need to make an important decision regarding your future, or want to know what your options are, please feel welcome to post a comment below.\n\nA few years ago we held a graduate student panel, where many recently accepted grad students answered questions about the application process.  That [thread is here](https://www.reddit.com/r/Physics/comments/3i5d4u/graduate_student_panel_fall_2015_1_ask_your/), and has a lot of great information in it.\n\nHelpful subreddits: /r/PhysicsStudents, /r/GradSchool, /r/AskAcademia, /r/Jobs, /r/CareerGuidance",
        "created_utc": 1673532024,
        "upvote_ratio": 1.0
    },
    {
        "title": "Two Discs Attached to Eachother by a bar - resolving this using a classic method.",
        "author": "KronosTP",
        "url": "https://www.reddit.com/r/Physics/comments/109zejd/two_discs_attached_to_eachother_by_a_bar/",
        "text": "Hi Guys!  \n\n\nI have this problem set I've been working on for university (not homework, not exam, just a problem set!) - the exercise asks me to use the Lagrange method, which I have done and for which I have found the solution (the teacher has given us the resolution, so I'm confident its right).\n\nWhat I'm now wondering (and what I've tried) is: could this be done using a more \"classical\" method, with sum of forces, moments, and polar coordinates?  \n\n\nHere is the exercise:\n\n [https://imgur.com/a/aIKeL2U](https://imgur.com/a/aIKeL2U) \n\nBoth discs have the same radius (R) and same mass (m); they're kept in contact by the bar (length: 2R, mass: M) - which connects at both discs' rotation centers. Both discs can freely turn around their rotation center. The first disc is fixed at its rotation center to a wall, while the other can move freely (attached to the bar, of course). The contact between both discs doesn't slide (slip-free bearing?) basically, the speed at each point of contact should be equal.\n\n&amp;#x200B;\n\nI'd like to find the equation of movement, same as you would with Lagrange. (so the angular acceleration)\n\nI've tried \"separating\" the system into 3 elements, looking at the different forces there, but I stumble across multiple issues:\n\n1. to my understanding, the first disc has angular speed - I have no idea how to move around this. It isn't a force so it doesn't really enter my equations (except for cinematic moment, but that should be null given the force moment is constant?) except it does affect the movement of the second disc, so it has to come in play somewhere?\n2. I'm not completely sure \"what\" I'm supposed to find - I know the equation I'm getting at since I already have it with Lagrange, but with the information I have of this system (i.e. the different forces) I'm quite lost.\n3. The actual movement: the movement of the objects will make the forces be displaced: for example the effect of the weight of the second disc is not the same depending on the position of disc 1, and I have no idea how to deal with it.\n\nIf anyone wants the solution using the Lagrange method, here it is:\n\n[https://imgur.com/a/OSquaXM](https://imgur.com/a/OSquaXM)\n\nApologies if some words are incorrect, I'm translating them from french!",
        "created_utc": 1673529360,
        "upvote_ratio": 1.0
    },
    {
        "title": "Study of photoelectric effect",
        "author": "Jeswin_Amos_Philip",
        "url": "https://i.redd.it/4m8qhew5jnba1.jpg",
        "text": "",
        "created_utc": 1673528405,
        "upvote_ratio": 1.0
    },
    {
        "title": "My most favorite mug.",
        "author": "Kindly_Resolutio",
        "url": "https://i.redd.it/wj3w67lh1mba1.png",
        "text": "",
        "created_utc": 1673528369,
        "upvote_ratio": 1.0
    },
    {
        "title": "V=IR. Voltage = current * Resistance. Understanding the equation,",
        "author": "Obvious-Shake5761",
        "url": "https://www.reddit.com/r/Physics/comments/109yuwr/vir_voltage_current_resistance_understanding_the/",
        "text": "Hey folks, \n\nHaving some confusion on this.  I understand the voltage drop decreases, and the current stays the same. I am not understanding. So the flow of positive charge stays the same? But the Joules/ Coulomb is decreasing across the resistor? I feel like I'm just memorizing a formula, but I would like to understand this topic on a deeper level. Can someone provide some insight?",
        "created_utc": 1673527709,
        "upvote_ratio": 1.0
    },
    {
        "title": "I assume, there was a time when we didn't have machines for winding, how did they then get accurate readings or even something close?",
        "author": "bhaandariii",
        "url": "https://www.reddit.com/r/Physics/comments/109y421/i_assume_there_was_a_time_when_we_didnt_have/",
        "text": "How does the capacity of a pickup coil change when it is wound by hand?",
        "created_utc": 1673525301,
        "upvote_ratio": 0.99
    },
    {
        "title": "Urgent advice needed, please help!",
        "author": "f3sicA_A",
        "url": "https://www.reddit.com/r/Physics/comments/109xmay/urgent_advice_needed_please_help/",
        "text": "[removed]",
        "created_utc": 1673523581,
        "upvote_ratio": 1.0
    },
    {
        "title": "Condensed Matter Physics",
        "author": "WastePass",
        "url": "https://youtu.be/v7kg5SbszDk",
        "text": "",
        "created_utc": 1673521470,
        "upvote_ratio": 1.0
    },
    {
        "title": "The Amazing Connection of Physics and Geometry",
        "author": "Geometry_Manim",
        "url": "https://youtube.com/watch?v=u-AJ5aY-AyU&amp;feature=share",
        "text": "",
        "created_utc": 1673518249,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can someone please explain how in vertical motion, at the top of a circle, if the centripetal force and the force due to gravity are both pointing downwards, how can they cancel each other out and not cause an object to fall at the top of the circle.",
        "author": "Person_975",
        "url": "https://i.redd.it/8nld6lconmba1.jpg",
        "text": "",
        "created_utc": 1673517816,
        "upvote_ratio": 1.0
    },
    {
        "title": "I'm obsessed with this!!",
        "author": "Profgzsg",
        "url": "https://i.redd.it/w56tj4k9mkba1.png",
        "text": "",
        "created_utc": 1673511141,
        "upvote_ratio": 1.0
    },
    {
        "title": "Quantum winter - may be permanent",
        "author": "RaiSama69",
        "url": "https://www.reddit.com/r/Physics/comments/109qxp9/quantum_winter_may_be_permanent/",
        "text": "With so much hype and over promises surrounding quantum computing. The onset of the dreaded Quantum winter seems inevitable is what I have heard from many people in the physics community.\n\nBut, I belive if work in hardware for quantum computers persists somehow, it won't be the death of quantum computing. Not much unlike the AI winter of the 80's.\n\nThis is also where the difficulty lies though. Work in quantum computing hardware seems too niche while the hardware that made AI and ML's promises possible were but a byproduct of advances in classical computer made to satisfy a multitude of purposes. If anyone is aware, please enlighten me, if there any other such purposes that the hardware of quantum computers can be utilised for.",
        "created_utc": 1673499856,
        "upvote_ratio": 1.0
    },
    {
        "title": "How is the answer in pascals if there’s no s^2 in the bottom???",
        "author": "melbehesy",
        "url": "https://i.redd.it/octj5ot5rkba1.jpg",
        "text": "",
        "created_utc": 1673494773,
        "upvote_ratio": 1.0
    },
    {
        "title": "Directed energy against incoming missles",
        "author": "xeanaex",
        "url": "https://www.reddit.com/r/Physics/comments/109p63f/directed_energy_against_incoming_missles/",
        "text": "Is there the possibility that directed energy (like high intensity microwave radiation) could alter air in front of a tactical missile, or, the missile itself, to alter it's trajectory, or ground it altogether?\n\nJust a physics noob who's curious.  This would seem more effective than Patriot Missiles.\n\nCurious.  I would think heating the air in front would cause an updraft, while heating the air below would cause a downdraft, this controlling the ultimate trajectory.",
        "created_utc": 1673494594,
        "upvote_ratio": 1.0
    },
    {
        "title": "any textbooks or apps that give you physics assignments to do?",
        "author": "ComprehensiveYard166",
        "url": "https://www.reddit.com/r/Physics/comments/109oez0/any_textbooks_or_apps_that_give_you_physics/",
        "text": "This is not a post about homework assistance. I've pretty much run out of hobbies, I'm depressed as is without anything to do and I'm interested in basic physics. I'm by no means smart, I'm in high-school and never even went to school when I had physics as a class so my knowledge is limited to a loose grasp of gravity, wind resistance, mass, velocity, etc. Literally just sitting alone with my pets in the dark with minimal humam interaction when I leave the house for school and thats pretty much it. I'm not sure how much longer I can do this so I just need something to keep myself not bored and this is the only thing I can think of right now. An answer key would be nice to see if I'm doing anything wrong.",
        "created_utc": 1673492476,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can motion of particles in gas clouds consider to be brownian motion ?",
        "author": "Obvious-Membership90",
        "url": "https://www.reddit.com/r/Physics/comments/109nzwu/can_motion_of_particles_in_gas_clouds_consider_to/",
        "text": "Given the number density of gas cloud (Approx. 100 - 300 molecules per cubic centimetre) is almost 10^17 times smaller than the number density of air on earth (spprox. 10^19 molecules per cubic centimetre).\n\nThis means the mean free path of particles would be much more.\n\nSo, can we still use brownian motion to describe the motion of gas particles in gas clouds or nebula or given the externally low density, the brownian discription would not be accurate?",
        "created_utc": 1673491333,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is there a usage for statistical mechanics in cosmology?",
        "author": "actopozipc",
        "url": "https://www.reddit.com/r/Physics/comments/109ncl7/is_there_a_usage_for_statistical_mechanics_in/",
        "text": "Title. I am looking for something monte carlo like in cosmology. Maybe something with phase transitions thats used in cosmology?",
        "created_utc": 1673489595,
        "upvote_ratio": 1.0
    },
    {
        "title": "Odo from DS9",
        "author": "becidgreat",
        "url": "https://www.reddit.com/r/Physics/comments/109n9iu/odo_from_ds9/",
        "text": "Why am I wrong thinking of quantum fields and entanglement like when Odo renters the link. Odo is still odo but he’s also the link",
        "created_utc": 1673489370,
        "upvote_ratio": 1.0
    },
    {
        "title": "what are the skills needed, beside a good GPA, to help a physics student get a PhD scholarship easily after graduating?",
        "author": "Ok_Alternative_3743",
        "url": "https://www.reddit.com/r/Physics/comments/109mlbv/what_are_the_skills_needed_beside_a_good_gpa_to/",
        "text": "I am undergrad physics student and I intend to pursue my grad studies abroad, so I have read tons of advices regarding the process of applying and how competitive it is. and I wanna ask if anyone gets into this process, what are the skills that I can master in my undergrad that may represent an extra advantage to my application and increase my chances of getting a PhD scholarship.",
        "created_utc": 1673487581,
        "upvote_ratio": 1.0
    },
    {
        "title": "how much of a formal math background is necessary for Physics?",
        "author": "ayPapi69sexosexo",
        "url": "https://www.reddit.com/r/Physics/comments/109mjo4/how_much_of_a_formal_math_background_is_necessary/",
        "text": "So I am currently an undergraduate that did a fair amount of Physics and EE (majoring in EE); as such, I took all the \"entry-level\" math available (Calculus, Differential Equations, Linear Algebra, etc.).\n\nHowever, as I took the upper-level physics classes (Waves and Optics, QM 1 and 2, and so on) I noticed that the level of expertise over this math got much... complex? Like, even while understanding the math a lot of it comes off as unintuitive and/or handwavy —often, because the techniques get introduced as *tools* and not for what they truly are (e.g. tensor operations in QM vs. their full meaning behind).\n\nWhile I have been excited to learn stuff so far, I notice myself limited by this understanding. I feel like I just \"black-box\" all the math and only aspire to understand the physics. I also notice many of my classmates that are doing double major in math and physics have a much easier time. I worry I won't be a good physicist if I don't really get the math.\n\nIs a very formal math background necessary for research? Or is a rather superficial level enough?",
        "created_utc": 1673487459,
        "upvote_ratio": 1.0
    },
    {
        "title": "Writing a Science Fiction Novel - any models of the universe or quantum mechanics loopholes that could hypothetically allow for \"perpetual motion\"",
        "author": "razbodan0012",
        "url": "https://www.reddit.com/r/Physics/comments/109mhv6/writing_a_science_fiction_novel_any_models_of_the/",
        "text": "Im writing a novel, and I was wanting to research some of the ways the dreadedly impossible perpetual motion machine could be made, or energy generation methods that would violate the laws of physics, ideally I want to create something unique, not just something that qoutes the usual tropes like Zero Point energy, something that looks like its actually using momentum and spin to generate energy.   \n\n\nAny suggestions ?",
        "created_utc": 1673487323,
        "upvote_ratio": 1.0
    },
    {
        "title": "History of physics article \"Tea, Earl Grey, Hot\"",
        "author": "dem676",
        "url": "https://www.aip.org/history-programs/niels-bohr-library/ex-libris-universum/tea-earl-grey-hot",
        "text": "",
        "created_utc": 1673480223,
        "upvote_ratio": 1.0
    },
    {
        "title": "Help me find a very particular kind of physics text",
        "author": "Nickleback769",
        "url": "https://www.reddit.com/r/Physics/comments/109ifls/help_me_find_a_very_particular_kind_of_physics/",
        "text": "Hello!\n\nI don't feel this question fits with the weekly physics question thread, but mods can let me know if I should just post it there.\n\nI'm a philosopher, mostly religious studies but I do quite a bit in philosophy of science and probability theory. I have an extremely rudimentary knowledge of physics. I am trying to learn more, and am currently pursuing another degree in STEM education. **I really, really need help finding books to learn physics from that don't suffer from major historical errors, and which actually explain how certain conclusions were reached. I want a textbook that actually helps me reason to the conclusions, and without massive anachronism (some anachronism is fine, but the content of the anachronism should be faithful to the sources; example below). Can anyone suggest a book/books for me? Thanks!**\n\n&amp;#x200B;\n\nExamples of my frustrations:\n\nThe physics courses I'm taking are awful. It is mindless memorization of formulas and basic mathematical models. Currently I am looking at Newton's laws and universal gravitation, so I'm going to use that as an example of the sorts of frustrations I have. All the books I can find say \"Newton discovered this,\" and then proceed to give a modern formulation of law with the gravitational constant. That gravitational constant was not in Newton, from what I have read. This is an anachronism in CONTENT, not just in symbolism or form. \n\nFurther, as I try to understand how Newton logically moved from defining the visible effects of gravity (acceleration as an inverse square law) to defining the force of gravity as (m1\\*m2)/distance\\^2, I am given NO explanation for why he even brought in mass in the first place. Why not just define gravity via acceleration, since acceleration is the only empirical effect of gravity? Further, many textbooks say that Newton used his 3rd law (N3) to SOMEHOW reach the conclusion that the force of gravity is a function of both mass and acceleration. The earth is pulling on the object and causing it to accelerate, and thus, by N3, the object is pulling on the earth reciprocally. But how does mass relate to that? And also, this application of N3 only follows is we assume that Newton rules out impetus or inherent motion! For if gravity is really inherent motion, there is no force pulling on an object that is reciprocated! So now just trying to learn about the simplest equation is dragging me into a thousand rabbit holes! AND THE TEXTBOOKS DONT HELP! HELP!",
        "created_utc": 1673477030,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does the Earth’s atmosphere allow any other types of radiation besides infrared, visible light, and UV rays to hit the Earth’s surface?",
        "author": "YoungKing_00",
        "url": "https://www.reddit.com/r/Physics/comments/109gyeu/does_the_earths_atmosphere_allow_any_other_types/",
        "text": "",
        "created_utc": 1673473481,
        "upvote_ratio": 1.0
    },
    {
        "title": "STEREO experiment confirms anomalous neutrino measurements and rules out hypothesis of a light sterile neutrino",
        "author": "marketrent",
        "url": "https://arstechnica.com/science/2023/01/oddities-in-nuclear-reactor-measurements-not-due-to-a-new-particle/",
        "text": "",
        "created_utc": 1673472809,
        "upvote_ratio": 1.0
    },
    {
        "title": "Ultimate temperature of the universe",
        "author": "GamerViennaHD",
        "url": "https://www.reddit.com/r/Physics/comments/109gfh9/ultimate_temperature_of_the_universe/",
        "text": "What would be the temperature of the universe when the highest entropy is reached? If everything is turned into heat energy and spread equally over the universe.",
        "created_utc": 1673472238,
        "upvote_ratio": 1.0
    },
    {
        "title": "Time dilation",
        "author": "Infj6w5-1w9-4w5",
        "url": "https://www.reddit.com/r/Physics/comments/109ga78/time_dilation/",
        "text": "In the twin paradox lets say there is no perspective, no watcher, no measurment, no conscious being, and replace the twins with two bags of meat that age. Will the two bags of meat have the same age in this case?from my understanding overall time doesn't change, is only the perspective and a watcher or measurer that causes a delusional change in time is that right?",
        "created_utc": 1673471905,
        "upvote_ratio": 1.0
    },
    {
        "title": "will this create a theoretical black body considering there is no heat loss through radiation?",
        "author": "arnaaa",
        "url": "https://www.reddit.com/r/Physics/comments/109g99c/will_this_create_a_theoretical_black_body/",
        "text": "hello, i am a 17 year old, high school graduate student from India, while we were being taught ray optics in class, i thought of creating a layout from which light could only enter and not come out, i ended up making this. So if we theoretically take a glass setup and pass a beam of light exactly perpendicular to the ridge on top so that it falls exactly at an angle of incidence of 42 degrees on the glass air interface, which in turn will cause the light beam to graze through the surface and hit the corner which is inclined at an angle of 135 degrees from the horizontal axis, hence the new angle of incidence would be 45 which is greater than the critical angle of 42 so total internal reflection will occur and this cycle will continue, so will this create a theoretical black body (if we coat the covering with lamp black, will it reduce loss of heat via radiation?)\n\nhttps://preview.redd.it/xxtbgjs5chba1.png?width=1261&amp;format=png&amp;auto=webp&amp;v=enabled&amp;s=62b67346ef5ae9a999f4d54d820de2af9121dbb0",
        "created_utc": 1673471846,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is there a satisfactory interpretation of quantum mechanics?",
        "author": "KhazixMain4th",
        "url": "https://www.reddit.com/r/Physics/comments/109g8j5/is_there_a_satisfactory_interpretation_of_quantum/",
        "text": "If yes, what is it? I want to start learning quantum mechanics but I’m quite confused seeing all sorts of ideas on what quantum mechanics is.",
        "created_utc": 1673471797,
        "upvote_ratio": 1.0
    },
    {
        "title": "I've been bombarded with info of vibrations and its frequencies, and there are some questions I have about the topic.",
        "author": "_fourtress",
        "url": "https://www.reddit.com/r/Physics/comments/109fpkj/ive_been_bombarded_with_info_of_vibrations_and/",
        "text": "[removed]",
        "created_utc": 1673470581,
        "upvote_ratio": 1.0
    },
    {
        "title": "Heisenberg's Uncertainty Principle: new video by PhysicsExplained (2nd re-upload, I think this is final...)",
        "author": "ednl",
        "url": "https://youtu.be/FRP4AqZR3UU",
        "text": "",
        "created_utc": 1673468843,
        "upvote_ratio": 1.0
    },
    {
        "title": "Legit or just a bunch of BS?",
        "author": "Excellent-Concert243",
        "url": "https://youtube.com/@TheMachian",
        "text": "",
        "created_utc": 1673468700,
        "upvote_ratio": 1.0
    },
    {
        "title": "How does Hawking radiation lead to black hole evaporation?",
        "author": "RubenCadete",
        "url": "https://www.reddit.com/r/Physics/comments/109ed5q/how_does_hawking_radiation_lead_to_black_hole/",
        "text": " Hello guys,\n\nI recently read Stephen Hawking's book \"Black Holes\", and when he starts to explain Hawking Radiation he uses an analogy that doesn't make sense to me.\n\nBasically, he explains what virtual particles are, and that when a particle of the pair falls into the black hole, the other manages to escape and so it seems that the black hole emitted this particle.\n\nBut this makes no sense to me, because initially those particles were not part of the black hole, nor of its mass, and only when a particle of this pair enters the event horizon does it become part of its mass, so this one never loses, even if the other particle escapes into space, it gains the mass of a particle that initially was not its own.\n\nSo how can I assume that it is possible for a black hole to evaporate in this way?\n\nI apologize for my English as this is not my main language.",
        "created_utc": 1673467376,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can objects exist at more than one place at the same time?",
        "author": "isti44",
        "url": "https://www.reddit.com/r/Physics/comments/109ebpa/can_objects_exist_at_more_than_one_place_at_the/",
        "text": "",
        "created_utc": 1673467280,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can electricity be used to induce light emission in a liquid?",
        "author": "ShanusMcShan",
        "url": "https://www.reddit.com/r/Physics/comments/109e59k/can_electricity_be_used_to_induce_light_emission/",
        "text": "I would like to generate localized light/glow at various points in some kind of liquid solution using only locally delivered electricity or even electrically induced heat, without leds etc.\n\nI know this isn't how fluorescence / photoluminescence works, but looking for a similar process if one exists?",
        "created_utc": 1673466884,
        "upvote_ratio": 1.0
    },
    {
        "title": "Should I take the quals if I plan to leave PhD?",
        "author": "Any_Car99",
        "url": "https://www.reddit.com/r/Physics/comments/109chcz/should_i_take_the_quals_if_i_plan_to_leave_phd/",
        "text": "Hi all, I'm a second year physics PhD student (in the USA) and I'm about to retake the qualification exams (failed my first time last year). I've actually decided a few months ago that I do not wish to continue on with the PhD after I finish the Masters part of the program. I am eligible for the MS at the end of this coming spring semester, but the qual is being administered this month. My question is, do I retake the quals (even though admittedly I have not been preparing as I should have (probably because I know I will not carry on to PhD) ) or would it be best to avoid failing the qual a second time and just talk to the programs advisor and communicate my interest in leaving the program after completion of the MS? Any insight is appreciated! Thanks in advance!",
        "created_utc": 1673462965,
        "upvote_ratio": 1.0
    },
    {
        "title": "Should I take the quals if I plan to leave?",
        "author": "JAstropie",
        "url": "https://www.reddit.com/r/Physics/comments/109cfrl/should_i_take_the_quals_if_i_plan_to_leave/",
        "text": "[removed]",
        "created_utc": 1673462858,
        "upvote_ratio": 1.0
    },
    {
        "title": "Should I take quals if I plan to leave PhD?",
        "author": "JAstropie",
        "url": "https://www.reddit.com/r/Physics/comments/109cdu4/should_i_take_quals_if_i_plan_to_leave_phd/",
        "text": "[removed]",
        "created_utc": 1673462731,
        "upvote_ratio": 1.0
    },
    {
        "title": "Should I take the quals if I plan to leave PhD?",
        "author": "JAstropie",
        "url": "https://www.reddit.com/r/Physics/comments/109ccp7/should_i_take_the_quals_if_i_plan_to_leave_phd/",
        "text": "[removed]",
        "created_utc": 1673462661,
        "upvote_ratio": 1.0
    },
    {
        "title": "Calculator for calc based physics",
        "author": "someperson_132",
        "url": "https://www.reddit.com/r/Physics/comments/109c5xo/calculator_for_calc_based_physics/",
        "text": "Hey everyone! I’m trying to figure out what calculator to get for calculus based physics. I’m between the TI 84 plus CE and the TI Nspire CX2. Which one should I get? They are very similar in price",
        "created_utc": 1673462216,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why exactly is this negative energy. Can’t find anything bc it’s associated with bad vibes, which makes it really impossible to find anything about it",
        "author": "Jus_existing",
        "url": "https://www.reddit.com/r/Physics/comments/109b9p5/why_exactly_is_this_negative_energy_cant_find/",
        "text": "Is that the negative strength of something like is there a give or take related to it? Positive energy is the strength of something holding. Is there a negative strength until it gives into a positive. Positive means somethings there the negative means nothing is there, so if nothing is there is there a nothing strength? Does that mean there’s a strength on nothing if positive can collapse in the negative can collapse into a positive and positive collapses into a negative",
        "created_utc": 1673460179,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can someone explain the physics in this(if there are any)?",
        "author": "madlina344",
        "url": "https://v.redd.it/tvz9u89puhba1",
        "text": "",
        "created_utc": 1673459644,
        "upvote_ratio": 1.0
    }
]