[
    {
        "title": "My dad gave me this. I don’t know what it is. Can anyone help explain what it is and what it’s used for?",
        "author": "Final_Boysenberry102",
        "url": "https://i.redd.it/nq0ycjktgcia1.jpg",
        "text": "",
        "created_utc": 1676463384,
        "upvote_ratio": 1.0
    },
    {
        "title": "If the Lorentz symmetry broke, would the fundamental laws change for different observers, or would they stay the same?",
        "author": "stifenahokinga",
        "url": "https://www.reddit.com/r/Physics/comments/112wn4d/if_the_lorentz_symmetry_broke_would_the/",
        "text": "I have read multiple times that if the Lorentz symmetry was broken, then it would be possible that different observers in different frames of reference may experience different fundamental laws of physics (as the Lorentz symmetry says that the fundamental laws should be the same to all observers independently of their frame of reference)\n\nHowever, I was discussing this with a physicist and he told me that the laws of physics would be the same for all observers, the only thing that would change is their \"observations\". He specifically said:\n\nI would say that fundamental laws still hold, but an ambiguity can arise in some definitions. A clear example is that of CP symmetry. This symmetry states that particles and anti-particles can be interchanged and everything would remain the same. In a curved spacetime, however, there is an ambiguity in which mode functions are interpreted as particles and which as antiparticles (this doesn’t occur in Minkowski). So the same state might be interpreted as vacuum and as containing pairs of particle-antiparticle by different observers. CP still holds, but they observe different scenarios\n\nBut is this true? If the Lorentz symmetry was broken wouldn't this violate fundamental principles and laws like the principle of relativity? How could they be unaffected? And if he is right, could there be any way where the breaking of Lorentz symmetry (or any other fundamental symmetry) would really change the fundamental laws of physics?",
        "created_utc": 1676463269,
        "upvote_ratio": 1.0
    },
    {
        "title": "Gravitational field - speed of time relationship",
        "author": "Excellent_Value7392",
        "url": "https://www.reddit.com/r/Physics/comments/112w46n/gravitational_field_speed_of_time_relationship/",
        "text": "Hi, as I was thinking about time dilation and how the speed of time changes regarding the altitude of where you're at (more precisely the gravitational force you're exposed to in your location). So if that's the case,  what altitude/gravitational force needs to be there so that time passes by at exactly 60 seconds per minute like we are all told. \n\nAlthough I know that the concept of time being at that speed is relative and man made. But wouldn't we need a set speed of time in order to discover the speed of time in other parts of the universe? \n\nSorry if I wasn't clear. Just trying to get my head around this concept.",
        "created_utc": 1676461374,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can someone help me with this questions?",
        "author": "Camouflage87",
        "url": "https://www.reddit.com/r/Physics/comments/112vaea/can_someone_help_me_with_this_questions/",
        "text": "[removed]",
        "created_utc": 1676458186,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can someone pls help me find these sources ive been looking for ages",
        "author": "0____Pixel____0",
        "url": "https://www.reddit.com/r/Physics/comments/112ummg/can_someone_pls_help_me_find_these_sources_ive/",
        "text": " \n\n1. A 2017 paper published in the journal Nuclear Fusion titled \"A comparative study of D-D, D-T and D-3He fusion power plants\" compares the potential power output of Deuterium-Deuterium (D-D), Deuterium-Tritium (D-T), and Deuterium-Helium-3 (D-He3) fusion reactions. According to the paper, D-He3 fusion has the potential to produce the highest power output per unit of fuel, with an estimated net power output of about 2.6 times higher than D-T fusion and about 8.6 times higher than D-D fusion.\n2. A 2015 paper published in the journal Fusion Science and Technology titled \"Energy Production and Radiation Aspects of Helium-3 Fusion\" compares the energy output and radiation characteristics of Helium-3 fusion to other fusion reactions. The paper notes that Helium-3 fusion has the potential to produce more energy per reaction than other fusion reactions, and also has the advantage of producing fewer high-energy neutrons, which reduces the risk of radiation damage to reactor materials.\n\nSources:\n\n1. Pacher, H. D., et al. \"A comparative study of D-D, D-T and D-3He fusion power plants.\" Nuclear Fusion, vol. 57, no. 1, 2017, 016048.\n2. Kulcinski, G. L., et al. \"Energy Production and Radiation Aspects of Helium-3 Fusion.\" Fusion Science and Technology, vol. 68, no. 1, 2015, pp. 59-64.",
        "created_utc": 1676455582,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to test the bounciness of a pattern in cork material?",
        "author": "qiuhong_yu",
        "url": "https://www.reddit.com/r/Physics/comments/112ubja/how_to_test_the_bounciness_of_a_pattern_in_cork/",
        "text": "Hi, I'm a design student with very little knowledge in stem. \n\nI'm developing some patterns in cork utilizing its compressibility. \n\nMy goal is to have the **bouncy pattern (**Idk what the technical term is...) be alternative protective packaging or protective sporting gear. \n\nThe first couple of patterns I've tried aren't very bouncy but it's sturdy and strong. \n\n&amp;#x200B;\n\nhttps://preview.redd.it/vnrdh0zrpbia1.jpg?width=1280&amp;format=pjpg&amp;auto=webp&amp;v=enabled&amp;s=b9cd9ec0ae1b69a8a73ef76997a287948dc26f22\n\nhttps://preview.redd.it/am5s81zrpbia1.jpg?width=1280&amp;format=pjpg&amp;auto=webp&amp;v=enabled&amp;s=29e260049a6ad4450dba61d0214d310c0a99e665\n\nHow do I make the pattern more bouncy, or are there any existing patterns that I could try to reproduce in cork? \n\nHow do I test the bounciness of my cork patterns comparing to foam which is widely used for protection purposes. \n\nWhich matters more in terms of cushioning for protection? how compressible a material is, or how compressible the material that's touching the protected object is?  Say I want to use this pattern in a camera pelican case to replace the foam but the cork surface will always be harder than foam so does that mean it will hit the camera harder even if the cork pattern is just as bouncy as foam?\n\n&amp;#x200B;\n\nAny information would help! Thank you!",
        "created_utc": 1676454324,
        "upvote_ratio": 1.0
    },
    {
        "title": "How does 0.84 kg (1l) diesel become 2.7 kg Carbon Dioxide?",
        "author": "KungFuViking7",
        "url": "https://www.reddit.com/r/Physics/comments/112u6dh/how_does_084_kg_1l_diesel_become_27_kg_carbon/",
        "text": "Countless sites indicate this is this ratio.",
        "created_utc": 1676453737,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to perform energy efficient ultrafast light-induced magnetization reversal at nanoscale ? Check this issue in Advanced Science",
        "author": "TheFrenchyPhysicist",
        "url": "https://doi.org/10.1002/advs.202204683",
        "text": "",
        "created_utc": 1676453736,
        "upvote_ratio": 1.0
    },
    {
        "title": "Da Vinci’s Visualization of Gravity was Centuries Ahead of His Time",
        "author": "davinci-code",
        "url": "https://www.guardianmag.us/2023/02/leonardo-da-vincis-visualization-of.html",
        "text": "",
        "created_utc": 1676451981,
        "upvote_ratio": 1.0
    },
    {
        "title": "why did we take the surface charge density as negative while calculating the electric field outside the plates and why did we take the surface charge density as positive when while calculating the Electric field between the plates?",
        "author": "ifeltspecialTWICE",
        "url": "https://www.reddit.com/gallery/112tfy6",
        "text": "",
        "created_utc": 1676450651,
        "upvote_ratio": 1.0
    },
    {
        "title": "Need help",
        "author": "Great-Ad5922",
        "url": "https://www.reddit.com/r/Physics/comments/112t8tp/need_help/",
        "text": "Anybody know how to convert MPa to N/15mm? Thank yall",
        "created_utc": 1676449834,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is this true? I asked chat gpt top physicist for this decade",
        "author": "jgod_1",
        "url": "https://www.reddit.com/r/Physics/comments/112t38e/is_this_true_i_asked_chat_gpt_top_physicist_for/",
        "text": "[removed]",
        "created_utc": 1676449189,
        "upvote_ratio": 1.0
    },
    {
        "title": "Dynamics question please help",
        "author": "burnthistrashh",
        "url": "https://i.redd.it/y0rg6wif6cia1.jpg",
        "text": "",
        "created_utc": 1676441882,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do I become a polymath?",
        "author": "burneraccount57837",
        "url": "https://www.reddit.com/r/Physics/comments/112oqnw/how_do_i_become_a_polymath/",
        "text": "[removed]",
        "created_utc": 1676433038,
        "upvote_ratio": 1.0
    },
    {
        "title": "Matter density at Big bang compared to today",
        "author": "Engineerju",
        "url": "https://www.reddit.com/r/Physics/comments/112l2bn/matter_density_at_big_bang_compared_to_today/",
        "text": "Today we see billions of stars and millions of galaxies in the universe. We also see that star and galaxy formation is not great today.\n\nNow Rewind the clock 13 billion years. is it proven that the matter density back then equates what we see today? According to energy preservation principle there should be as much normal matter today as back when CMB was created right? (Since stars and planets are not popping out from empty space)\n\nI have never seen evidence of that the matter volume in the universe today equates to that of the early stages. And if its not equal, how does that effect energy conservation? If it were a lot less back then, from where did all these billions of galaxies arise from?",
        "created_utc": 1676421703,
        "upvote_ratio": 1.0
    },
    {
        "title": "I need help better understanding this:",
        "author": "New_Language4727",
        "url": "https://www.reddit.com/r/Physics/comments/112l22n/i_need_help_better_understanding_this/",
        "text": "So a few days ago, I came across a Reddit post regarding what the consensus among physicists on Stephen Wolfram and his physics project. I was reading a comment and I saw something about it not being able to violate Bell's theorem. But I saw a reply that said Stephen's model has the option to both violate and not violate Bell's theorem under this thing called rule 30. This reminds me of the Scientific American article where Scott Aaronson says it's\n\"an infinitely flexible model\". Would something like this not be taken seriously in physics?\n\nA reply I got after asking someone for clarification:\n\nMy takeaway is he's saying that depending on the number and type of hypergraph connections, Bells inequality - which is incompatible with other local hidden variable theorems - has the potential to be satisfied.\n\nHere is the original comment:\n\nIt can allow for both, actually. All that's required is for otherwise distant nodes to have some connections to each other in the hypergraph. So imagine that there are typically 30 connections between clusters of nodes which make up space.\nEntangled particles may have 31 connections, so they are 'distant' spatially yet can influence each other via that extra connection. When one takes the state of up, the other becomes down.\n\nI’m not very knowledgeable in physics and even less is computer science, but would a mechanism like this be applicable to physics? Does this give any credit on the validity of his theory?",
        "created_utc": 1676421684,
        "upvote_ratio": 1.0
    },
    {
        "title": "The Neo-Cognitron",
        "author": "Ccceptaple_Trix_6127",
        "url": "https://clips.twitch.tv/FragileClumsyParrotRickroll-z0VnAvXE2LrlDP1d?tt_medium=redt",
        "text": "",
        "created_utc": 1676421413,
        "upvote_ratio": 1.0
    },
    {
        "title": "Imagine that you are immortal and are gifted with a mind that retains its peak performance (in terms of memory and speed) once reached. How long do you think it will take to fully master all aspects of Physics as it is today?",
        "author": "alwayswalking1302",
        "url": "https://www.reddit.com/r/Physics/comments/112kh31/imagine_that_you_are_immortal_and_are_gifted_with/",
        "text": "Inspired from [this post](https://www.reddit.com/r/math/comments/1127tse/imagine_that_you_are_immortal_how_long_do_you/) on r/math with an added twist.",
        "created_utc": 1676420069,
        "upvote_ratio": 1.0
    },
    {
        "title": "Worries about university faculties' research areas",
        "author": "ziyaagunes",
        "url": "https://www.reddit.com/r/Physics/comments/112ieyq/worries_about_university_faculties_research_areas/",
        "text": "Faculty of university that I want to go (undergraduate) is mainly focused on condensed matter physics both theoretically and experimentally. Nevertheless I want to focus on qft and theoretical particle physics. If its limit my requests and gonna cause a problem for PhD or MSc applications?",
        "created_utc": 1676414597,
        "upvote_ratio": 1.0
    },
    {
        "title": "Anti-matter interacting with matter that isnt a perfect match",
        "author": "No-ItsPatrick",
        "url": "https://www.reddit.com/r/Physics/comments/112gwgd/antimatter_interacting_with_matter_that_isnt_a/",
        "text": "[removed]",
        "created_utc": 1676410695,
        "upvote_ratio": 1.0
    },
    {
        "title": "High School Physics Research ideas?",
        "author": "Mighty_Nile3100",
        "url": "https://www.reddit.com/r/Physics/comments/112fjem/high_school_physics_research_ideas/",
        "text": "It can’t be very straight forward, an exemple of something that’s way too straightforward would be “the effect of temperature on viscosity?”\nThe math involved can not be way too advance, it can be though outside the high school general curriculum. \nAlso it can involve multiple aspects (units) of physics (for example forces and temperature) and it can be anything in physics. \nAn exemple is “How does the speed of sound in a material vary with temperature?”\n\nThank you, any ideas would really help!",
        "created_utc": 1676407206,
        "upvote_ratio": 1.0
    },
    {
        "title": "Which Pulley Would Move In The Diagram Below?",
        "author": "Icy_Lettuce6145",
        "url": "https://i.redd.it/s7tjkv0cp7ia1.png",
        "text": "",
        "created_utc": 1676405780,
        "upvote_ratio": 1.0
    },
    {
        "title": "Someone help me understand what’s going on with these leaves",
        "author": "Decent_Preference_95",
        "url": "https://v.redd.it/k3dsbygoy8ia1",
        "text": "",
        "created_utc": 1676402961,
        "upvote_ratio": 1.0
    },
    {
        "title": "I want this mug where can I get it.....?",
        "author": "DeepWrongdoe",
        "url": "https://i.redd.it/8mamtrq877ia1.jpg",
        "text": "",
        "created_utc": 1676399671,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to merge ultrafast magnetism and plasmonics: \"Energy Efficient Single Pulse Switching of [Co/Gd/Pt]N Nanodisks Using Surface Lattice Resonances\"",
        "author": "TheFrenchyPhysicist",
        "url": "https://doi.org/10.1002/advs.202204683",
        "text": "",
        "created_utc": 1676398587,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can someone help me identify the material wich is used in this picture ? More context below.",
        "author": "SnooKiwis2323",
        "url": "https://www.reddit.com/r/Physics/comments/1129v2g/can_someone_help_me_identify_the_material_wich_is/",
        "text": "https://preview.redd.it/uhi88tfrl6ia1.jpg?width=600&amp;format=pjpg&amp;auto=webp&amp;v=enabled&amp;s=32a194eecd9ab1c2e0ff6afa80dc112f771a8a90\n\nSo me and my friend need to explain the propagation of electromagnetic waves for a \"science festival\" at school. To present that, we decided to present Guglielmo Marconi who has invented the first wireless telegraph. We thought it was cool and we wanted to remake it. The problem is that there are very few remakes of his telegraph. This is the only one (wich we think is doable) we found but we don't now what the person used. If you want more details on the experiment I redirect you to this link : [http://kor.pe.kr/make/electromagnetic/coherer/?ckattempt=1](http://kor.pe.kr/make/electromagnetic/coherer/?ckattempt=1) \n\nThanks already to those who will help us !",
        "created_utc": 1676392925,
        "upvote_ratio": 1.0
    },
    {
        "title": "If the universe is expanding infinitely, what is it expanding into?",
        "author": "Psychological-Leg317",
        "url": "https://www.reddit.com/r/Physics/comments/1129egw/if_the_universe_is_expanding_infinitely_what_is/",
        "text": "",
        "created_utc": 1676391754,
        "upvote_ratio": 1.0
    },
    {
        "title": "can anyone explain where I went wrong? how do I get the uncertainty/deviation? is there a formula?",
        "author": "kinderlad1",
        "url": "https://i.redd.it/o5o49jr6x7ia1.jpg",
        "text": "",
        "created_utc": 1676390347,
        "upvote_ratio": 1.0
    },
    {
        "title": "homework question: what are the answers to these/are my answers correct?",
        "author": "sayamortandire",
        "url": "https://i.redd.it/9sy95uf4w7ia1.jpg",
        "text": "",
        "created_utc": 1676389989,
        "upvote_ratio": 1.0
    },
    {
        "title": "tried to do a made up problem to review myself is my answer correct??",
        "author": "frobiepotatooo-64",
        "url": "https://i.redd.it/oad56nweu7ia1.jpg",
        "text": "",
        "created_utc": 1676389416,
        "upvote_ratio": 1.0
    },
    {
        "title": "The Greatest Story Ever Told in 2 mins",
        "author": "2coolth",
        "url": "https://m.youtube.com/watch?v=prCRhDmwWmk&amp;feature=youtu.be",
        "text": "",
        "created_utc": 1676389252,
        "upvote_ratio": 1.0
    },
    {
        "title": "Question: So if air gets \"heavier\" when it's colder, is that because the cold influences the water vapor? and if so, does that mean that water is a different substance depending on its temperature?",
        "author": "flyingdutchmen2020",
        "url": "https://www.reddit.com/r/Physics/comments/1127p2c/question_so_if_air_gets_heavier_when_its_colder/",
        "text": "",
        "created_utc": 1676387460,
        "upvote_ratio": 1.0
    },
    {
        "title": "dy/dx is a special kind of quotient.",
        "author": "Cool-Anteater8432",
        "url": "https://www.reddit.com/r/Physics/comments/1127jcw/dydx_is_a_special_kind_of_quotient/",
        "text": "[removed]",
        "created_utc": 1676387066,
        "upvote_ratio": 1.0
    },
    {
        "title": "How will the harmonic observed be 3rd? Wont it be 1/3 of the fundamental frequency?",
        "author": "Yahya_8055",
        "url": "https://i.redd.it/7x47kns1s5ia1.png",
        "text": "",
        "created_utc": 1676382427,
        "upvote_ratio": 1.0
    },
    {
        "title": "A bunch of my teachers were scratching their heads on this. Does anybody know the answer?",
        "author": "WIGGLE-KING",
        "url": "https://i.redd.it/68bgot9577ia1.jpg",
        "text": "",
        "created_utc": 1676381593,
        "upvote_ratio": 1.0
    },
    {
        "title": "Chiral detection of biomolecules based on reinforcement learning, a research by Peking University",
        "author": "Badatu",
        "url": "https://www.oejournal.org/article/doi/10.29026/oes.2023.220019",
        "text": "",
        "created_utc": 1676379809,
        "upvote_ratio": 1.0
    },
    {
        "title": "Alternative Navier-Stokes model",
        "author": "wargreymon_messatsu",
        "url": "https://msvard.w.uib.no/sample-page/alternative-navier-stokes-model/explanation-of-new-model/",
        "text": "",
        "created_utc": 1676377576,
        "upvote_ratio": 1.0
    },
    {
        "title": "L3- Celestial Mechanics",
        "author": "OutrageouslyHuge",
        "url": "https://www.reddit.com/r/Physics/comments/1123k52/l3_celestial_mechanics/",
        "text": "How can I derive to the equation for L3 (LaGrange point)?",
        "created_utc": 1676375544,
        "upvote_ratio": 1.0
    },
    {
        "title": "dy/dx is a special kind of quotient.",
        "author": "Cool-Anteater8432",
        "url": "https://www.reddit.com/r/Physics/comments/11238ia/dydx_is_a_special_kind_of_quotient/",
        "text": "[removed]",
        "created_utc": 1676374408,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is this article about liquid light true ?",
        "author": "iudex_xed",
        "url": "https://www.sciencealert.com/scientists-create-fifth-state-of-matter-liquid-light",
        "text": "",
        "created_utc": 1676372102,
        "upvote_ratio": 1.0
    },
    {
        "title": "Could someone please solve this or tell me what is it about?",
        "author": "FishyMonday",
        "url": "https://photos.app.goo.gl/rm6SBZz5DT3xtqPS6",
        "text": "",
        "created_utc": 1676371004,
        "upvote_ratio": 1.0
    },
    {
        "title": "Grad school",
        "author": "chochangg",
        "url": "https://www.reddit.com/r/Physics/comments/11215vo/grad_school/",
        "text": "I'm doing a BS in applied/engineering physics right now. However, I failed two classes and got a C in first year. The classes I failed are calculus 2 and electricity and magnetism physics. The C that I got was in chemistry. I'm now in second year and getting A and B range grades. If I keep this up, is it reasonable for me to aim for grad school? I'd like to do a MS in engineering.",
        "created_utc": 1676369470,
        "upvote_ratio": 1.0
    },
    {
        "title": "Are there any dangers to creating radio active elements",
        "author": "No-Main-5363",
        "url": "https://www.reddit.com/r/Physics/comments/111y6lc/are_there_any_dangers_to_creating_radio_active/",
        "text": "",
        "created_utc": 1676365316,
        "upvote_ratio": 1.0
    },
    {
        "title": "Inflated this mega flamingo and after, like, 21 hours it's like this. I read It could be due to the air temperature, could that be the case?",
        "author": "L3mon_drop",
        "url": "https://i.redd.it/3wt6mworp5ia1.png",
        "text": "",
        "created_utc": 1676363639,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why do most synthetic radioactive elements half lives so short?",
        "author": "No-Main-5363",
        "url": "https://www.reddit.com/r/Physics/comments/111xnae/why_do_most_synthetic_radioactive_elements_half/",
        "text": "",
        "created_utc": 1676363116,
        "upvote_ratio": 1.0
    },
    {
        "title": "Boomerang level 9999",
        "author": "Realistic_Leopard569",
        "url": "https://v.redd.it/8wuegrpwu3ia1",
        "text": "",
        "created_utc": 1676359448,
        "upvote_ratio": 1.0
    },
    {
        "title": "Setting-up a wine glass, so a mere whisper will shatter it?",
        "author": "Vex_RDM",
        "url": "https://www.reddit.com/r/Physics/comments/111w4im/settingup_a_wine_glass_so_a_mere_whisper_will/",
        "text": "",
        "created_utc": 1676357075,
        "upvote_ratio": 1.0
    },
    {
        "title": "What are the risks in creating synthetic radio active elements?",
        "author": "No-Main-5363",
        "url": "https://www.reddit.com/r/Physics/comments/111s0k9/what_are_the_risks_in_creating_synthetic_radio/",
        "text": "",
        "created_utc": 1676343552,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can synthetic radio active element be used to power nuclear reactors and what are the main risks that synthetic element cause that natural elements don’t?",
        "author": "No-Main-5363",
        "url": "https://www.reddit.com/r/Physics/comments/111rzma/can_synthetic_radio_active_element_be_used_to/",
        "text": "",
        "created_utc": 1676343470,
        "upvote_ratio": 1.0
    },
    {
        "title": "Hiking and potential energy.",
        "author": "uldouche",
        "url": "https://www.reddit.com/r/Physics/comments/111rnia/hiking_and_potential_energy/",
        "text": "Let's say we have a person who:\n\n* weighs 100kg;\n* carries a pack of 20kg pack;\n* moves 800 meters with an elevation gain of 150 meters; and\n* traverses that distance and then goes back to where they started.\n\nSeems like a rough approximation of the potential energy bottom to top is straight forward. Although my question is really about the downhill. I am assuming there is some work needed by the muscles over time to gracefully hike down. What factors should be considered?\n\nThis is all to help me understand my training better. Sorry if this is the wrong sub. Let me know if this should go somewhere else.",
        "created_utc": 1676342474,
        "upvote_ratio": 1.0
    },
    {
        "title": "Career prospects for Physics major",
        "author": "xverdsf",
        "url": "https://www.reddit.com/r/Physics/comments/111p1w1/career_prospects_for_physics_major/",
        "text": "I've read some of the posts on this thread and they're seriously making me rethink my choices. Unfortunately, I'm stuck seeing this through, so transferring into another program is not an option for me. \n\nI am so anxious about the future, but I've planned my degree to be as 'applied' as it can be. I'm focusing on taking all the lab courses I can (computational physics, electronics lab, time series analysis), and plan on taking courses in optics, laser physics, and condensed matter physics. If I can manage doing a research project in quantum optics or something closely related to electrical engineering, and take part in design teams related to engineering, that I could somehow get a job in it after undergrad? I know that I'm at a disadvantage without an engineering degree, but I've heard some people say that it is possible to, while others insist its far too competitive to do so without a Master's degree or even a PhD.\n\nOutside of engineering, what could I reasonably expect to get into? More and more, I regret pursuing physics and honestly wish I'd pursued something more applicable, but what's done is done. I'd really appreciate any advice you may have. Thank you!",
        "created_utc": 1676335059,
        "upvote_ratio": 1.0
    },
    {
        "title": "Parabolic movement, similarity with the uses that ancient civilizations gave it",
        "author": "TheSebasKing",
        "url": "https://www.reddit.com/r/Physics/comments/111oqsk/parabolic_movement_similarity_with_the_uses_that/",
        "text": "&amp;#x200B;\n\n[Hello how are you, I have a physics presentation for tomorrow, I played the parabolic movement and I have seen resources such as that the Greek civilizations used it and the Chinese civilizations too, but I can't find what they used it for.](https://preview.redd.it/cfgdy4ems1ia1.jpg?width=200&amp;format=pjpg&amp;auto=webp&amp;v=enabled&amp;s=d0ec099f3c89a0ce4733abfc51071e1f239ad71e)\n\nI was thinking like the trajectory of some siege weapons like the catapult and trebuchet.\n\n&amp;#x200B;\n\nplease help",
        "created_utc": 1676334227,
        "upvote_ratio": 1.0
    },
    {
        "title": "visualization of quantum models applied to molecular models?",
        "author": "Bezbozny",
        "url": "https://www.reddit.com/r/Physics/comments/111ohus/visualization_of_quantum_models_applied_to/",
        "text": "Ok so we've seen quantum models of atoms (where atoms have orbitals that can be shaped like donuts and interconnected balloons) and we have models of molecules (where each atom is simplified to be just a sphere connected by tubes).  \nMy question is, is there anyone out there who's made a visualizations of molecules that uses the correct shapes of the orbitals of each atoms and not just spheres and tubes? It feels strange that I have never once seen the quantum mechanical model of atoms extrapolated into a whole molecule, only representations showing a single atom.",
        "created_utc": 1676333565,
        "upvote_ratio": 1.0
    },
    {
        "title": "Flat mars society",
        "author": "Malesdb",
        "url": "https://i.redd.it/9m8ddpv5j1ia1.jpg",
        "text": "",
        "created_utc": 1676330994,
        "upvote_ratio": 1.0
    },
    {
        "title": "Hey, is it possible that my nichrome wire isn’t heating up because it’s resistance is to high ?",
        "author": "BobSmithTheRockeeter",
        "url": "https://www.reddit.com/r/Physics/comments/111n1lt/hey_is_it_possible_that_my_nichrome_wire_isnt/",
        "text": "I tried building a hot wire cutter however my wire isn’t heating up. It’s 40awg and it’s resistance is 214 ohms, I’ve calculated that to heat it up it doesn’t need a lot of power but also the resistance doesn’t need to be nearly as high",
        "created_utc": 1676329800,
        "upvote_ratio": 1.0
    },
    {
        "title": "Do electromagnetic waves accelerate?",
        "author": "Plav9999",
        "url": "https://www.reddit.com/r/Physics/comments/111lsdz/do_electromagnetic_waves_accelerate/",
        "text": "When light or any other electromagnetic waves are generated do they immediately travel at the speed of light or do they accelerate from zero?",
        "created_utc": 1676326697,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to evenly distribute weight, support/lift the back, and feel lightweight? 1. Notches have large increments. Required height gives this bad angle 2. Would giant wheels or pivoting wheels be better?",
        "author": "Verolee",
        "url": "https://i.redd.it/pifh6chtj2ia1.jpg",
        "text": "",
        "created_utc": 1676325315,
        "upvote_ratio": 1.0
    },
    {
        "title": "I’ve got a U-Haul going from South West Florida to Boston(1470 miles). The one way price is $155 plus tax etc so let’s say $180. Or $15 a day if I return it. I’m driving a 2022 Silverado and towing a 4x8 box trailer. Between the loss in gas $ and the one way rate, which option do I save the most on?",
        "author": "SeekingYaweh",
        "url": "https://www.reddit.com/r/Physics/comments/111k72a/ive_got_a_uhaul_going_from_south_west_florida_to/",
        "text": "I believe the average loss for mileage while towing the trailer is 7 miles per gallon (this is what I googled, but I’m guessing you guys would estimate better). It’s a 4x8 trailer behind a Silverado, I’m wondering if I’d actually lose that much in gas mileage? Because that goes from $350 in gas (no trailer and one way) to $600.",
        "created_utc": 1676322867,
        "upvote_ratio": 1.0
    },
    {
        "title": "Moment of Inertia Help!",
        "author": "Crawfordking",
        "url": "https://www.reddit.com/r/Physics/comments/111jm9y/moment_of_inertia_help/",
        "text": "What would the moment of inertia be of a disc that has a denser disk inside of it?",
        "created_utc": 1676321450,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is calculus based physics hard?",
        "author": "AlternativeNo5023",
        "url": "https://www.reddit.com/r/Physics/comments/111il4n/is_calculus_based_physics_hard/",
        "text": "Hi. I’m going to be taking 2 calculus based physics courses for my next 2 semesters at my college as a part of my associates in computer science. And I just wanted to know if it’s harder than the algebra based physics courses. I took calculus 1 and passed with a B, and in Calc 2 I passed with an -A. Will Calc based physics be hard for me? I also have combined ADHD as well, so it’ll be harder for me to retain the info that I’ll learn in my classes.",
        "created_utc": 1676318872,
        "upvote_ratio": 1.0
    },
    {
        "title": "Physicst",
        "author": "SectorSignificant252",
        "url": "https://www.reddit.com/r/Physics/comments/111i029/physicst/",
        "text": "who is your favourite physicst ?",
        "created_utc": 1676317429,
        "upvote_ratio": 1.0
    },
    {
        "title": "New to the world of physics and astronomy. Had a random thought in mind, Please help",
        "author": "OkAstronomer119",
        "url": "https://www.reddit.com/r/Physics/comments/111hq78/new_to_the_world_of_physics_and_astronomy_had_a/",
        "text": "So, I am new to the world of physics and astronomy. While going through an article, I read that if we have a telescope powerful enough to look into a planet a few light years away what we’d actually be seeing would be the past (probably a few million years) because light takes time to reach your telescope. Firstly, I wanted to know if this is true. Secondly, hypothetically speaking if this is true and we somehow create a spacecraft that can achieve light-speed and send it say 100million light years away, would we be able to see dinosaurs walking on earth through the telescope?",
        "created_utc": 1676316737,
        "upvote_ratio": 1.0
    },
    {
        "title": "was the big bang the beginning of time, space, and matter?",
        "author": "youreminants",
        "url": "https://www.reddit.com/r/Physics/comments/111gtby/was_the_big_bang_the_beginning_of_time_space_and/",
        "text": "I saw a video once talking about this on YT but not sure if it stands true.",
        "created_utc": 1676314498,
        "upvote_ratio": 1.0
    },
    {
        "title": "physics experiments/working models",
        "author": "googogoj",
        "url": "https://www.reddit.com/r/Physics/comments/111flvg/physics_experimentsworking_models/",
        "text": "I'm currently a senior in highschool, and my friends and I want to do a physics project. We can basically do whatever we want (so long as it's safe to do on a school campus), but we've had extremely limited experience with experimental physics and have no idea what to do. any feedback or suggestions are welcome, thank you in advance :))",
        "created_utc": 1676311497,
        "upvote_ratio": 1.0
    },
    {
        "title": "Scientists present a new method for imaging individual electrons",
        "author": "Vailhem",
        "url": "https://phys.org/news/2023-02-scientists-method-imaging-individual-electrons.html",
        "text": "",
        "created_utc": 1676310669,
        "upvote_ratio": 1.0
    },
    {
        "title": "Electric conductivity through shower head water.",
        "author": "ModulusGauss",
        "url": "https://www.reddit.com/r/Physics/comments/111ewjo/electric_conductivity_through_shower_head_water/",
        "text": "I saw a picture today of a shower head with an electrical heating unit on top. I thought at first this was pretty dangerous, and probably is, but in second thought, I wondered about whether or not electricity would conduct through the water falling out of the shower head? Suppose the electric current was delivered to the water pipe, would you get shocked by the falling water?\n\nIn general, how densely does the water have to fall to conduct electricity to an extent that would shock you?",
        "created_utc": 1676309731,
        "upvote_ratio": 1.0
    },
    {
        "title": "What if you had the power to generate and manipulate different types of energy?",
        "author": "JP869",
        "url": "https://www.reddit.com/r/Physics/comments/111e73i/what_if_you_had_the_power_to_generate_and/",
        "text": "Hello! \n\nI'm writing a story and would like to understand the potential of a person capable of spontaneously generating and manipulating different types of energy. \n\nThere are seven types, to my understanding - \n\nChemical, mechanical, gravitational, electrical, thermal, sound, and nuclear. \n\nImagine a person could control one of those types. How would this manifest? For each, what might they be capable of? \n\nSorry if this is a stupid question that can't be answered. If it can, I'd really appreciate the help.",
        "created_utc": 1676307952,
        "upvote_ratio": 1.0
    },
    {
        "title": "Please help me get the answer! Plz show work!!",
        "author": "Holiday_Geologist_68",
        "url": "https://i.redd.it/ykhaf8r0x0ia1.jpg",
        "text": "",
        "created_utc": 1676305542,
        "upvote_ratio": 1.0
    },
    {
        "title": "Inspire future quantum scientists in your own classroom!",
        "author": "APSphysics",
        "url": "https://www.reddit.com/r/Physics/comments/111d4b7/inspire_future_quantum_scientists_in_your_own/",
        "text": "Attention Physics Educators - An official message from the American Physical Society (APS):\n\nJoin the Quantum To-Go program that matches scientists, engineers, and professionals in the field of #quantum science, #engineering, and #technology with your classroom! \n\nIntroduce the importance of quantum science and technologies and increase student interest in pursuing quantum fields to enter the quantum workforce. \n\nSign up by February 17 to participate. \n\nLearn more: [https://www.aps.org/programs/outreach/physiciststogo.cfm](https://www.aps.org/programs/outreach/physiciststogo.cfm).",
        "created_utc": 1676305291,
        "upvote_ratio": 1.0
    },
    {
        "title": "Sitting is bad, and here's why",
        "author": "SniperMan16420",
        "url": "https://www.reddit.com/r/Physics/comments/111d2m3/sitting_is_bad_and_heres_why/",
        "text": "Newton's third law states each force has an opposite but equal force back into it, which applies when sitting too. When you sit you are putting a lot of your weight into the chair, which is applying that much force back into you. Probably more than half your body weight is going back up into your spine... Every kid who goes through the education system has to go through this torture of having half their weight pressed up against their spine for hours at a time",
        "created_utc": 1676305181,
        "upvote_ratio": 1.0
    },
    {
        "title": "What the spin does exactly?",
        "author": "Infj6w5-1w9-4w5",
        "url": "https://www.reddit.com/r/Physics/comments/111ca6m/what_the_spin_does_exactly/",
        "text": "[removed]",
        "created_utc": 1676303241,
        "upvote_ratio": 1.0
    },
    {
        "title": "[SERIOUS]If in the future multiverses came out to be true is it possible Humans can travel to other multiverses or it can't be possible as it would Break laws of physics?",
        "author": "000genshin000",
        "url": "https://www.reddit.com/r/Physics/comments/1119t6f/seriousif_in_the_future_multiverses_came_out_to/",
        "text": "This question is asked in a genuine scientific temperament so please clear my doubt. \n\nAlso, do travelling to other multiverses breaks laws of physics?",
        "created_utc": 1676298616,
        "upvote_ratio": 1.0
    },
    {
        "title": "(Serious) What is an experiment that definely PROVES that the Earth is moving?",
        "author": "loko_de_pedra",
        "url": "https://www.reddit.com/r/Physics/comments/11197iy/serious_what_is_an_experiment_that_definely/",
        "text": "I can only find links and articles about the Foucault Pendulum, and I've seen some physicists saying it's not the best way to prove the Earth is moving. So, what are some OTHER experiments/obverservations that PROVES the movements of the Earth",
        "created_utc": 1676297659,
        "upvote_ratio": 1.0
    },
    {
        "title": "What are you working on? - Weekly Discussion Thread - February 13, 2023",
        "author": "AutoModerator",
        "url": "https://www.reddit.com/r/Physics/comments/1118w0h/what_are_you_working_on_weekly_discussion_thread/",
        "text": "Hello /r/Physics.\n\nIt's everyone's favorite day of the week, again. Time to share (or rant about) how your research/work/studying is going and what you're working on this week.",
        "created_utc": 1676296812,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why is my shower making zap sounds?",
        "author": "bruhmomentm1",
        "url": "https://v.redd.it/90j3m58woyha1",
        "text": "",
        "created_utc": 1676296647,
        "upvote_ratio": 1.0
    },
    {
        "title": "A guide to (not) understanding quantum mechanics",
        "author": "filosoful",
        "url": "https://arstechnica.com/science/2023/02/a-guide-to-not-understanding-quantum-mechanics/",
        "text": "",
        "created_utc": 1676295766,
        "upvote_ratio": 1.0
    },
    {
        "title": "https://www.youtube.com/watch?v=cBFbKznRL68",
        "author": "Inevitable_Spare_777",
        "url": "https://www.reddit.com/r/Physics/comments/11170q0/httpswwwyoutubecomwatchvcbfbkznrl68/",
        "text": "[removed]",
        "created_utc": 1676291135,
        "upvote_ratio": 1.0
    },
    {
        "title": "How does levering work? Please answer [? kg].",
        "author": "Competitive-Sleep368",
        "url": "https://i.redd.it/aawne9mwlxha1.png",
        "text": "",
        "created_utc": 1676283488,
        "upvote_ratio": 1.0
    },
    {
        "title": "what is the space-time continuum in simple words?",
        "author": "Rude-Perception-6186",
        "url": "https://www.reddit.com/r/Physics/comments/11132d9/what_is_the_spacetime_continuum_in_simple_words/",
        "text": "",
        "created_utc": 1676275878,
        "upvote_ratio": 1.0
    },
    {
        "title": "I feel like my physics joke went unappreciated in the class discord, so now I’m posting it here for fake internet points",
        "author": "Murky-Remove-1414",
        "url": "https://i.redd.it/z122r6aexwha1.jpg",
        "text": "",
        "created_utc": 1676275244,
        "upvote_ratio": 1.0
    },
    {
        "title": "2nd Edition of International Research Awards on High Energy Physics | 24...",
        "author": "Victoriaanisa1",
        "url": "https://youtube.com/watch?v=2sG1mCO-M5M&amp;feature=share",
        "text": "",
        "created_utc": 1676269602,
        "upvote_ratio": 1.0
    },
    {
        "title": "An Analysis of the Proxima Centauri Radio Signal",
        "author": "[deleted]",
        "url": "",
        "text": "[removed]",
        "created_utc": 1676268880,
        "upvote_ratio": 1.0
    },
    {
        "title": "Stacked boxes - why doesn't sum of weight forces and reaction forces equal zero?",
        "author": "orthogonal123",
        "url": "https://www.reddit.com/r/Physics/comments/11116ly/stacked_boxes_why_doesnt_sum_of_weight_forces_and/",
        "text": "Was hoping somebody could help me understand why the downwards and upwards forces don't sum to zero. I mean, I know this should be basic for me as an engineer but I just can't seem to figure this one out. Thanks.",
        "created_utc": 1676268643,
        "upvote_ratio": 1.0
    },
    {
        "title": "Next move after undergrad",
        "author": "Squixzy",
        "url": "https://www.reddit.com/r/Physics/comments/110yyss/next_move_after_undergrad/",
        "text": "Hello, as title reads I've just graduated with my undergrad in physics and mathematics. Been interviewing for a few engineering jobs but ultimately my long term goal is to be a scientist in some regard. I went to a pretty prestigious school, didn't do honors because I struggled abit with the content. Nor did I make many connections within science. I feel like I have squandered alot of opportunities that came with the degree. Most masters programs in my area are purely mathematics. Feeling sort of stuck, not knowing what to do next. And I'm missing doing physics. I don't have anyone in my family with a science background so don't know how I should progress. Anyone have a similar experience or any advice. Much appreciated!",
        "created_utc": 1676261277,
        "upvote_ratio": 1.0
    },
    {
        "title": "What's Going Wrong in Particle Physics? (This is why I lost faith in science.)",
        "author": "skyersjet",
        "url": "https://www.youtube.com/watch?v=lu4mH3Hmw2o",
        "text": "",
        "created_utc": 1676257292,
        "upvote_ratio": 1.0
    },
    {
        "title": "Hi, anyone know what kind of \"theorem\" can it be?",
        "author": "Snoo89130",
        "url": "https://i.redd.it/61g9i256fvha1.jpg",
        "text": "",
        "created_utc": 1676257006,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is there any point in joining APS?",
        "author": "niknik_66",
        "url": "https://www.reddit.com/r/Physics/comments/110x9az/is_there_any_point_in_joining_aps/",
        "text": "I'm a postdoc at a major US university and was wondering if there's any value in an APS membership. I talked to a colleague who is a member. He said that he just gets some newsletters that he doesn't read and discounted conference registration fees which doesn't matter to him since the university pays all the fees anyway. When I asked why he keeps renewing his membership, he just shrugged and said why not. So, are there any benefits in joining APS? Do APS members get anything out of their membership, or do y'all just treat the dues like a yearly charity donation?",
        "created_utc": 1676255875,
        "upvote_ratio": 1.0
    },
    {
        "title": "Newtonian Gravity as compared to Einstein's Model Of Gravity",
        "author": "DaVinciGH",
        "url": "https://www.reddit.com/r/Physics/comments/110wdr5/newtonian_gravity_as_compared_to_einsteins_model/",
        "text": "Hey all,\n\nI would really like to be educated on this matter.\n\nAccording to Einstein, gravity is the effect of the warping of space-time itself, against Newton's idea of gravity being a force active towards the center of a body, if Einstein's model is correct, then how come people on the earth especially on the non \"upper\" direction do not fall of into space since \"gravity\" does not really hold them towards the center like Newton proposed but \"pulls them down\" effectively.\n\nCorrect me if I am wrong. Thanks",
        "created_utc": 1676253173,
        "upvote_ratio": 1.0
    },
    {
        "title": "What makes gravity capable of curving space time while the other forces can't ?",
        "author": "Kaomet",
        "url": "https://www.reddit.com/r/Physics/comments/110v4gu/what_makes_gravity_capable_of_curving_space_time/",
        "text": "Einstein assumes the complete physical equivalence of a gravitational field and a corresponding acceleration of the reference system.\n\nGravity is attractive, in order to make the thought experiment of acceleration of the reference system we need some other repulsive force.\n\nLet's assume there exists some repulsive force (not necessarily unique) that can be used to build rockets.\n\nThe equivalence principle asserts those are... equivalent. So what makes gravity special in a way it's capable of curving space time ?",
        "created_utc": 1676249230,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is the best part of the EM spectrum for interstellar communication?",
        "author": "Independent_3",
        "url": "https://www.reddit.com/r/Physics/comments/110to4j/what_is_the_best_part_of_the_em_spectrum_for/",
        "text": "Any ideas which parts of the electromagnetic spectrum (radio, microwave, terahertz, infrared, visible, ultraviolet, x-ray and Gamma ray) would make the most sense for interstellar communication? Assuming sender and receivers have space based infrastructure. Also what kind of power levels and directivity is best?",
        "created_utc": 1676244963,
        "upvote_ratio": 1.0
    },
    {
        "title": "Optical meta-waveguides for integrated photonics and beyond. Nature LSA.",
        "author": "NickYMeng94",
        "url": "https://www.nature.com/articles/s41377-021-00655-x",
        "text": "",
        "created_utc": 1676244632,
        "upvote_ratio": 1.0
    },
    {
        "title": "backfilling theoretical lift",
        "author": "FrazerIsDumb",
        "url": "https://www.reddit.com/r/Physics/comments/110sr7m/backfilling_theoretical_lift/",
        "text": "So theoretical lift is around 10m.\n\nMy question is if you backfilled say a pipe that's 15m between pump and water. Would you still be able to pump the water?... I understand stand only being able to achieve 10m from a vacuum but when it becomes water which doesn't really compress it throws my brain...",
        "created_utc": 1676242433,
        "upvote_ratio": 1.0
    },
    {
        "title": "Work done by air resistance",
        "author": "Turbulent_4885",
        "url": "https://www.reddit.com/r/Physics/comments/110s2jp/work_done_by_air_resistance/",
        "text": "[removed]",
        "created_utc": 1676240622,
        "upvote_ratio": 1.0
    },
    {
        "title": "Check it out",
        "author": "Sensitive_Age_2284",
        "url": "https://youtu.be/36J4e_lBi7w",
        "text": "",
        "created_utc": 1676240459,
        "upvote_ratio": 1.0
    },
    {
        "title": "DIFFERENT KIND OF TOOL HELP WITH HARD TO REACH BOLTS socket wrench extensionbest wrench extender",
        "author": "megaone2",
        "url": "https://youtu.be/kQZC-Os0O0U",
        "text": "",
        "created_utc": 1676237437,
        "upvote_ratio": 1.0
    },
    {
        "title": "Flat mars society",
        "author": "Birdedhjm",
        "url": "https://i.redd.it/v0a1bbw3rtha1.jpg",
        "text": "",
        "created_utc": 1676236817,
        "upvote_ratio": 1.0
    },
    {
        "title": "Teacher Burnout Research",
        "author": "zacharyapresearch",
        "url": "https://www.reddit.com/r/Physics/comments/110qj8r/teacher_burnout_research/",
        "text": "Hello!\n\nI am a current 11th grade student enrolled in AP Research. My research project entails discussing burnout and the perpetuation of it due to school administration, through the research question “How Do School Administrations Increase Burnout Levels in High School STEM Teachers in Florida?” I am trying to reach out to as many high school STEM teachers in Florida as possible, which is why I am reaching out in this subreddit. If possible please fill out this survey, as honestly as possible. This survey is also completely anonymous. This is a crucial part of my research study, and I will attach a link to the survey below. Again, please complete if possible! Thanks so much for your time! (This survey has been IRB approved)\n\nLink: [https://sprw.io/stt-2NQdPQ63dK9hNimrVhzXDa](https://sprw.io/stt-2NQdPQ63dK9hNimrVhzXDa)",
        "created_utc": 1676236609,
        "upvote_ratio": 1.0
    },
    {
        "title": "Layman question : if gravity is a force that can slow down time, why the other forces aren't also ?",
        "author": "Kaomet",
        "url": "https://www.reddit.com/r/Physics/comments/110py6i/layman_question_if_gravity_is_a_force_that_can/",
        "text": "The effect should be lesser since the force are weaker, but still...",
        "created_utc": 1676235120,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is pressure directly proportional to displacement?",
        "author": "Leonidassaasas",
        "url": "https://www.reddit.com/r/Physics/comments/110ox5a/is_pressure_directly_proportional_to_displacement/",
        "text": "Hello!! I am trying to describe the reason why a football with more air pressure would travel further than one with less air pressure, however, I don't know how to explain it. It travels further after going down a ramp ( not being kicked). I tried understanding a very large proportionality which led to force being directly proportional to acceleration, and acceleration being directly proportional to displacement. Is that correct?  Can anyone give me any help?\n\nThanks!!!",
        "created_utc": 1676232517,
        "upvote_ratio": 1.0
    },
    {
        "title": "physics homework",
        "author": "Info1994",
        "url": "https://www.reddit.com/r/Physics/comments/110ory8/physics_homework/",
        "text": "[removed]",
        "created_utc": 1676232147,
        "upvote_ratio": 1.0
    }
]