[
    {
        "title": "What type of graph is displacement vs initial velocity?",
        "author": "TheUltimateEntity",
        "url": "https://www.reddit.com/r/Physics/comments/10w4h9n/what_type_of_graph_is_displacement_vs_initial/",
        "text": "Is it linear or non linear",
        "created_utc": 1675783407,
        "upvote_ratio": 1.0
    },
    {
        "title": "How exactly does light work? How come we can still see light when it goes the same direction we look at it?",
        "author": "Natural-meme",
        "url": "https://www.reddit.com/r/Physics/comments/10w3zci/how_exactly_does_light_work_how_come_we_can_still/",
        "text": "",
        "created_utc": 1675782170,
        "upvote_ratio": 1.0
    },
    {
        "title": "Nuclear engeneering and particle physics",
        "author": "YeahIAmAGamer",
        "url": "https://www.reddit.com/r/Physics/comments/10w34iq/nuclear_engeneering_and_particle_physics/",
        "text": "I'm a Italian student studying a course of material engeneering and nanotechnologies and I think I'll get a master degree in Nuclear engeneering.\nI'm still in my first year of university so I can still move to other engeneering courses or pure physics without losing years or doing useless exams.\nMy main problem is that I realized how much I love particle physics and quantum mechanics so I was wondering if anyone here can tell me how close is nuclear engineering to my aforementioned passions.",
        "created_utc": 1675779966,
        "upvote_ratio": 1.0
    },
    {
        "title": "Physics Questions - Weekly Discussion Thread - February 07, 2023",
        "author": "AutoModerator",
        "url": "https://www.reddit.com/r/Physics/comments/10w2irm/physics_questions_weekly_discussion_thread/",
        "text": "This thread is a dedicated thread for you to ask and answer questions about concepts in physics.\n\nHomework problems or specific calculations may be removed by the moderators. We ask that you post these in /r/AskPhysics or /r/HomeworkHelp instead.\n\nIf you find your question isn't answered here, or cannot wait for the next thread, please also try /r/AskScience and /r/AskPhysics.",
        "created_utc": 1675778411,
        "upvote_ratio": 1.0
    },
    {
        "title": "My teacher said who ever gives me the reason why angle number 1 is always equal to angle number 2, would get a bonus point, and told us to do research online, the thing is idk what question do i tell google to help me, so please redditors help!",
        "author": "interstic_TM",
        "url": "https://i.redd.it/z907ae00dtga1.jpg",
        "text": "",
        "created_utc": 1675778214,
        "upvote_ratio": 1.0
    },
    {
        "title": "Need help for a bonus point",
        "author": "interstic_TM",
        "url": "https://i.redd.it/s17cuzjvctga1.jpg",
        "text": "",
        "created_utc": 1675778172,
        "upvote_ratio": 1.0
    },
    {
        "title": "I am mesmerised by physics (specially cosmology) but I've always sucked at maths. Would it be a good idea to enroll in a physics degree?",
        "author": "Bautzeman",
        "url": "https://www.reddit.com/r/Physics/comments/10w1hw8/i_am_mesmerised_by_physics_specially_cosmology/",
        "text": "[removed]",
        "created_utc": 1675775603,
        "upvote_ratio": 1.0
    },
    {
        "title": "flow in a microchannel",
        "author": "VEGEMASTER69",
        "url": "https://www.reddit.com/r/Physics/comments/10w034o/flow_in_a_microchannel/",
        "text": "[removed]",
        "created_utc": 1675771187,
        "upvote_ratio": 1.0
    },
    {
        "title": "Need general advice: Thinking about going into Physics Major",
        "author": "Pilot1922",
        "url": "https://www.reddit.com/r/Physics/comments/10vzdbr/need_general_advice_thinking_about_going_into/",
        "text": "For some context, I'm a 2nd-year undeclared student and within a few months, I must declare my major or face disqualification from my university.\n\nWithin my first year and a half at university I thought mechanical engineering was my passion, however, due to the competitiveness of the program I fell behind. I tried to switch to Civil Engineering but struggled immensely with topics such as coding courses and the required chemistry classes and have fallen behind to the point where I can no longer switch to those majors. I pretty much failed, D's and F's in the Fall of 2022 and I had to rethink a lot of what direction I wanted to go into. I struggled a lot mentally during this period as well which contributed to a bad academic performance. I kept lying to myself thinking I was passionate about engineering, but in truth- I was failing courses I didn't care much about.\n\nI've always had trouble with in my life being decisive and knowing what I want. That's originally why I wanted to go into engineering as I thought it was broad enough for me to be able to figure out what I wanna do throughout that journey. However, I've come to the fact that I need to accept engineering is no longer going to be an option for me. That's when the possibility of switching to a Physics Major became a plausible situation.\n\nI struggled immensely in engineering-related courses, struggled in chemistry, and even had to retake Math courses, however, the Physics classes I've taken so far I've come to love. I took AP Physics in my Junior year in High School, although the class was initially rough at first, I come to discover how interesting the topic was with its application in the real world- it was just a topic that made sense to me. Then going into college, it felt that the small world of Physics I knew was expanding, and whilst there was a struggle in some areas, I performed well in Physics courses, but more importantly, I learned I loved the topic.\n\nHowever, I know a single AP Physics course and a few lower-level Physics classes don't represent the scope of what a Physics major encompasses. I don't know what I want to do in life, but I've always known I wanted to contribute to the betterment of society and impact people's lives in a positive way, and I think a degree in Physics could be my stepping stone into that. \n\nRight now switching to a Physics major is the most appealing option on the table, but I wanted to get more insight from others on whether I should follow my heart and take the leap, or if the major is way too difficult. I understand that being mediocre in Math is troublesome, however, I've only ever seen topics such as Math and Chemistry be tools that can help in Physics and build that foundation more. For example, Math plays a crucial role in Physics as it's commonly known as \"the language of Physics\" and whilst I don't enjoy Math all as much, I'm willing to get better at it for the pure purpose of trying to do better in Physics.\n\nI think this is the general direction I want to go in, but is there anyone else with any advice? I know there will be an immense struggle, but is it worth it? Will passion and persistence be enough for this degree?",
        "created_utc": 1675768570,
        "upvote_ratio": 1.0
    },
    {
        "title": "Crackpot Physics",
        "author": "principia_physica",
        "url": "https://www.reddit.com/r/Physics/comments/10vxb5f/crackpot_physics/",
        "text": "[removed]",
        "created_utc": 1675760529,
        "upvote_ratio": 1.0
    },
    {
        "title": "Pursuing a PhD in physics",
        "author": "jabrilrobinson",
        "url": "https://www.reddit.com/r/Physics/comments/10vwql7/pursuing_a_phd_in_physics/",
        "text": "[removed]",
        "created_utc": 1675758259,
        "upvote_ratio": 1.0
    },
    {
        "title": "Accidently plotted line integral of an electric field vs its derivative with respect to time",
        "author": "ShadowViking47",
        "url": "https://i.redd.it/6e5uoycj3qga1.png",
        "text": "",
        "created_utc": 1675756713,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can anyone explain this, Professor provided the solution. However his work is confusing , can anyone explain this in steps , in case you doubt I have the final answer ( 59.05 N ) the work provide by my professor makes no sense.",
        "author": "Euphoric-Nobody-5862",
        "url": "https://i.redd.it/ra18t0fv6pga1.jpg",
        "text": "",
        "created_utc": 1675745737,
        "upvote_ratio": 1.0
    },
    {
        "title": "As Antarctic Fieldwork Ends, a Sexual Harassment Reckoning Looms",
        "author": "dem676",
        "url": "https://undark.org/2023/02/06/as-antarctic-fieldwork-ends-a-sexual-harassment-reckoning-looms/",
        "text": "",
        "created_utc": 1675741358,
        "upvote_ratio": 1.0
    },
    {
        "title": "How much energy does it take for a water molecule to chemically adsorb to a platinum catalyst and have its original bonds broken?",
        "author": "Few_Dragonfruit_3700",
        "url": "https://www.reddit.com/r/Physics/comments/10vre1p/how_much_energy_does_it_take_for_a_water_molecule/",
        "text": "I asked this question to chatGPT and received an answer of 30-50kJ/mol... but relying on chatGPT for accurate information is a sin.\n\nSeeing as the change in enthalpy for this process is 286kJ/mol, I was curious as to what the actual chemical adsorption energy is for water to be adsorbed on a platinum catalyst and have its initial bonds broken, and whether or not this number is higher or lower than 286kJ/mol.\n\nThanks",
        "created_utc": 1675740915,
        "upvote_ratio": 1.0
    },
    {
        "title": "is the lift force and force due to pressure are the same?",
        "author": "Silly_Humor_3076",
        "url": "https://www.reddit.com/r/Physics/comments/10vm59j/is_the_lift_force_and_force_due_to_pressure_are/",
        "text": "Hello, I know that question might seem witless but I am struggling to understand the aerodynamic principales, and I am asking this: since the drag force has  components one due to friction let's say Tf and another due to pressure let's say Tp, is the lift force L is the same force Tp? If not why? Explain like I am 5 and correct me please if I stated anything wrong or if my understanding is false. \nThank you in advance.",
        "created_utc": 1675727124,
        "upvote_ratio": 1.0
    },
    {
        "title": "European physics education seems much more advanced/mathematical than US, especially at the graduate level. Why the difference?",
        "author": "TakeOffYourMask",
        "url": "https://www.reddit.com/r/Physics/comments/10vledc/european_physics_education_seems_much_more/",
        "text": "Are American schools just much more focused on creating experimentalists/applied physicists? Is it because in Europe all the departments are self-contained so, for example, physics students don’t take calculus with engineering students so it can be taught more advanced?\n\nI mean, watch the Frederic Schuller lectures on quantum mechanics. He brings up stuff I never heard of, even during my PhD.\n\nOr how advanced their calculus classes are. They cover things like the differential of a map, tangent spaces, open sets, etc. My undergraduate calculus was very focused on practical applications, assumed Euclidean three-space, very engineering-y.\n\nOr am I just cherry-picking by accident, and neither one is more or less advanced but I’ve stumbled on non-representative examples and anecdotes?\n\nI’d love to hear from people who went to school or taught in both places.",
        "created_utc": 1675725204,
        "upvote_ratio": 1.0
    },
    {
        "title": "Resources for college students?",
        "author": "southiest",
        "url": "https://www.reddit.com/r/Physics/comments/10vl3hf/resources_for_college_students/",
        "text": "I'm looking for links or any good sites that teach you physics. It's hard to sit down and read 40 pages about vectors when I really don't like math anyway. I'm looking for some good recommendations if anyone has them.",
        "created_utc": 1675724470,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is having a 'background' in accounting beneficial for future physics-related job prospects?",
        "author": "stephchiii",
        "url": "https://www.reddit.com/r/Physics/comments/10vkvn8/is_having_a_background_in_accounting_beneficial/",
        "text": "I (20F) have been working at a public accounting firm since I was 18. I have no prior education in accounting but serve as a data entry specialist, bookkeeper/junior accountant. I essentially do the same work as our staff accountants minus meeting with clients and analyzing their financials. \n\nThis year, I decided to pursue a BA in physics and am attending school part-time. I'd really like to focus on either meteorology, astrophysics, or environmental physics. \n\nI've heard conflicting info on how employable physics majors are, and I am kinda worrying about how hard it'll be to get a job. Anyone know if my experience in accounting might help with job prospects in the future? Especially with the fields I'm thinking of going into? I'm trying to give myself the best chance of getting one of these jobs when I graduate.",
        "created_utc": 1675723962,
        "upvote_ratio": 1.0
    },
    {
        "title": "If it were possible for the human eye to zoom in so far that it can see past the wavelength of visible light, what would it look like as it approached it?",
        "author": "TERoust",
        "url": "https://www.reddit.com/r/Physics/comments/10vjzan/if_it_were_possible_for_the_human_eye_to_zoom_in/",
        "text": "I think of the human eye as fundamentally a \"visible light antenna.\" Radio antennas can be constructed to operate efficiently on different frequencies, and in our case the human eye is capable of \"receiving\" radiation from a *very specific* part of that same electromagnetic spectrum.\n\nSo if my analogy is correct, would that mean if a human eye were to \"zoom in\" to observe wavelengths smaller than in the visible light spectrum, it would be dark? Furthermore, if that is indeed the case, what would it look like as one approached those wavelengths? Would it get progressively \"noisier\" and/or darker, or would there be a sharp cutoff where all of a sudden the eye would see nothing?\n\nAnd one final thing: humans are capable of observing light in our \"normal\" reference frame, obviously; yet we cannot see radio frequency signals, infrared, or ultraviolet light without special tools. To use another radio analogy, this seems to me like we have incredibly finely tuned band-pass filters that attenuate signals above or below the visible light spectrum. Kind of interesting to think about.\n\nAnyway, thanks for indulging in my thought experiment! I'm interested to see what you all think.",
        "created_utc": 1675721799,
        "upvote_ratio": 1.0
    },
    {
        "title": "Where am I going wrong studying Mathematical Analysis for Physics?",
        "author": "alwayswalking1302",
        "url": "https://www.reddit.com/r/Physics/comments/10vjfx6/where_am_i_going_wrong_studying_mathematical/",
        "text": "Current degree: Integrated masters in my fourth year (out of five)\n\nModules undertaken: Classical Field Theory, Lagrangian and Hamiltonian Dynamics, Thermal and Stats, QM &amp; EM.\n\nCurrent modules: Adv QM, Group theory, Fluids and Advanced Condensed Matter Physics.\n\nFuture modules: QFT, GR, Higher Condensed Matter Physics, Advanced Groups and Rings and Fields and potentially measure theory.\n\nGoal: Theoretical Physicist (interested in alternative gravity theories and fundamental physics)\n\nI'm pretty good in the physics bit of things and have performed reasonably well in Lin Math and Groups but I struggle a lot with Analysis barely able to muster up any creative solutions (or get any creativity). I did okay-ish in Intro to Analysis but couldn't do as good in Real Analysis.\n\nI've usually been good at math for the large part of my life &amp; have gotten used to proofs in math. I still scored rather average in Real Analysis despite prepping myself up for it tons. I'm not saying I'm an excellent student but I definitely know something's wrong when I can barely even understand solutions. I studied with others, worked through it, wrote them down, prepped myself before classes, asked tons of questions &amp; focussed on the minutiae of things but still failed to get a hold of it. I'm not a perfect student but I definitely tried my best\n\nOut of fear, I dropped Functional &amp; Real And Abstract Analysis and figured I'd need a break and I'd just have to learn it better for longer periods of time. \n\nI'm a bit afraid of this choice since I understand that advanced mathematics like Topology and Measure Theory are immensely required to pursue higher physics. I also wish to carry mathematical rigour in all the works of physics I do. It's also quite scary being afraid of math for the first time. I definitely did poorly in math exams in the past (in fact, I did worse on Lin Math than analysis) but there's always been a reason (lack of prep, bad exam conditions, difficult paper, lack of time etc) but analysis had no such reason. You could give me all the time in the world and I'd prob still struggle with it.\n\nI like pure math but I'm just not able to get analysis and I'm afraid it'll keep decreasing my GPA at this rate. \n\nThis kinda turned into a rant ig but I also want some advice on a couple of questions:-\n\n1. Am I doing something wrong in how I study analysis?\n2. Is it an absolute requirement to study analysis, topology and measure theory (and other related fields) for physics?\n3. How can I proceed to learn it differently? Are there any resources I could use online?\n4. Is there a path into analysis from a physicists perspective?\n5. I'm pretty certain that my weakness in analysis is perhaps due to the lack of pure math I've done at an early age and now I simply don't think that way. How do I address this?\n6. Literally any other comment or anything.\n\n&amp;#x200B;\n\nThank you for listening through my fears. Do let me know if anyone needs more information. Thank you.",
        "created_utc": 1675720542,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is there a name for this or am I the first to \"invent\" this?",
        "author": "unclejoesrocket",
        "url": "https://www.reddit.com/r/Physics/comments/10vj7tj/is_there_a_name_for_this_or_am_i_the_first_to/",
        "text": "I was pondering about orbits and how Uranus \"rolls\" around the sun, so I started thinking about what it would look like if a planet actually rolled like a ball on a surface. Such that it moved the length of its circumference around its orbit for every rotation.\n\nExample: A planet with a circumference of 1 unit orbiting a star with an orbital circumference of 1000 units, while having a year that is 1000 days long.\n\nIt's different from tidal locking, so I think it deserves a name. I'll call it a \"static rolling orbit\"",
        "created_utc": 1675720016,
        "upvote_ratio": 1.0
    },
    {
        "title": "Physics of dimples on a golf ball - PLS help",
        "author": "Ethan_Wazzocking",
        "url": "https://www.reddit.com/r/Physics/comments/10vfqdg/physics_of_dimples_on_a_golf_ball_pls_help/",
        "text": "Hey everyone,\n\nI have to do this very important paper about a physics experiment we need to carry out.\n\nI've been thinking about investegating how the amount of dimples on a golf ball would affect the ball's aerodynamic drag. To do this, my teacher suggested I drop the balls in a bucket of water and measure the amount of time it takes for the balls to reach the bottom. From there I could do the calculations necessary to answer the question.\n\nHowever, the dimples on golf balls are made to improve trjectory in the air, so would the effect of the dimples be apparent when measuring how the balls travel through water? And does the aerodynamic advantage of dimples rely on the ball spinning?\n\nCan anyone help/ give me any advice?",
        "created_utc": 1675712013,
        "upvote_ratio": 1.0
    },
    {
        "title": "expansion of the universe",
        "author": "GodzeallA",
        "url": "https://www.reddit.com/r/Physics/comments/10vekdb/expansion_of_the_universe/",
        "text": "I heard that the universe is expanding faster and faster. As a math guy, I'm wondering how that's possible. \n\nThe difference between a 6 inch pizza and an 8 inch pizza is not the same as the difference between an 8 inch pizza and a 10 inch pizza. As the circle gets bigger, the rate of increase of the area accelerates. This means that the bigger the pizza gets, the more you need to put in the inside for it to get bigger. Naturally speaking, the universe should be slowing down its expansion. Why is it expanding faster and faster? Or was this a simple mistake and it's actually not expanding faster and faster?",
        "created_utc": 1675709331,
        "upvote_ratio": 1.0
    },
    {
        "title": "BSc help: How to decide the specialisation of theoretical physics to pursue?",
        "author": "CILLEDPHOENIX",
        "url": "https://www.reddit.com/r/Physics/comments/10ve6ly/bsc_help_how_to_decide_the_specialisation_of/",
        "text": "Hi, I'm a sixteen year old planning to pursue in theoretical physics research, and I have been looking into different BSc programs for the same (my search and knowledge is limited to Europe only).\n\nI'm not all too certain what specific specific branch of physics I want to do, and “theoretical physics” is way too broad a term to classify as a singular field (though I do want to steer closer to more theoretical stuff and research, and away from the application side of things).\n\nI was originally under the impression that a BSc was über-generalised, and just taught physics in (relatively) broader strokes, from where a specialisation could be taken up only in the master's program. My original plan, then, was to figure out which field I specifically want to do by the end of the BSc itself. But, as I've looked into colleges’ bachelor's program, it seems that they seem to ask you to choose a specialisation in the second or third year itself and that each college only has and seemes to be able to provide specialisations in only a few branches.\n\nWell, it then seems necessary that I know the specific branch I want to take up, no? I'm aware of most of the branches of physics to some base degree since I've always been fascinated by them, but I don't know about a single one in enough detail (and the right kind of detail) to know… What are the resources (books, lectures, etc.) that will properly inform me and help me make a decision as to which set of universities I apply to?",
        "created_utc": 1675708448,
        "upvote_ratio": 1.0
    },
    {
        "title": "Physics of dimples on a golf ball - PLS help",
        "author": "Ethan_Wazzocking",
        "url": "https://www.reddit.com/r/Physics/comments/10vdfhg/physics_of_dimples_on_a_golf_ball_pls_help/",
        "text": "Hey everyone,\n\nI'm a high school student, and I have to do this very important paper about a physics experiment we need to carry out.\n\nI've been thinking about investegating how the amount of dimples on a golf ball would affect the ball's aerodynamic drag. To do this, my teacher suggested I drop the balls in a bucket of water and measure the amount of time it takes for the balls to reach the bottom. From there I could do the calculations necessary to answer the question.\n\nHowever, the dimples on golf balls are made to improve trjectory in the air, so would the effect of the dimples be apparent when measuring how the balls travel through water? And does the aerodynamic advantage of dimples rely on the ball spinning?\n\nCan anyone help/ give me any advice?",
        "created_utc": 1675706752,
        "upvote_ratio": 1.0
    },
    {
        "title": "benefits of self-study?",
        "author": "dudeskater123",
        "url": "https://www.reddit.com/r/Physics/comments/10valb2/benefits_of_selfstudy/",
        "text": "Would like some feedback on the benefits of doing physics problems just for the fun of it. I graduated with a bachelor's degree in physics 2 years ago, however because i didn't want to forget the material i learned(and also because i liked the subject), i found myself doing problems as a way to self-study after graduating. Although i had the GPA for it, grad school didn't interest me because i found out how the academic system really works when i was and undergraduate researcher. Would like to know if there's any benefits to just solving physics problems just for the fun of it (without a goal of having of pass a class or test)",
        "created_utc": 1675700205,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why doesn't current flow to Earth in a circuit with only 1 earth connection?",
        "author": "Pubes_in_Your_OJ",
        "url": "https://www.reddit.com/r/Physics/comments/10vad0i/why_doesnt_current_flow_to_earth_in_a_circuit/",
        "text": "I  know that current will not flow into the earth in a circuit with only 1  earth connection but I do not understand why. An internet search has  yielded a bunch of answers basically saying \"because it doesn't\" and  \"because there is no complete circuit to allow the current to return to  the source\".\n\nCurrent doesn't need  to return to the source. Current will flow from areas of high potential  to areas of low potential. For example in electrostatic discharge during  lightning events or when you get a shock off a door knob. However, in  the case of static discharge, the current flow is only momentary because  current will only flow until the potentials between the two areas have  equalized (i.e. when there is no voltage difference there is no  current).\n\nIn the case of a voltage  source, a battery for example, the chemical/physical properties of the  source provide a constant voltage difference between the positive and  negative terminals of the source. If we connect a wire between the  positive and negative terminals of the source there will be a constant  current flow because there is a constant voltage difference. In this  case, the current does return to the source because a conductor is  providing a low resistance path back to the negative terminal of the  source but the current does not \"need\" to return to the source.\n\nA  \"ground\" is any source or sink of electric charge which can supply or  absorb so much charge that compared to the rest of the system, to a good   approximation, it is an infinite source or sink of charge. The literal  earth is the prime example of a ground, but it is not the only one. A   satellite can't be connected to the literal ground, but it operates just  fine because it can be connected to the object that is part of the  satellite, such as the frame, which acts like a ground.\n\nIn  the circuit shown below, I have the positive terminal of the source  connected directly to the earth (consider it as real earth i.e. infinite  sink, I know the electronics ground symbol really just means common  point).\n\nWhy does the current not  flow into the earth? The positive terminal of the source should be at a  higher potential than the earth and the earth should be large enough  that it will not equalize in potential with the positive terminal? Or in  this scenario does the positive terminal of the source equalize in  potential with the earth but the negative terminal of the source  maintains its negative potential with respect to the positive terminal?\n\n&amp;#x200B;\n\nhttps://preview.redd.it/2lp9a4eqdlga1.png?width=853&amp;format=png&amp;auto=webp&amp;v=enabled&amp;s=382938ca42891d2d0abbe3619de52e9b65c25f8c\n\nBonus question:\n\nIn  the case of a circuit that uses real earth as the reference, for  example a HVDC transmission system with earthing electrodes on either  end. Are the two circuits below equivalent (ignore the component values I  put in)? Does the current actually flow through 1000km of earth? Or  does the earth in the vicinity of the electrode maintain its 0V and  allow for infinite sinking of electrons? I.e. there is not actually a  1000km long current path through the ground?\n\nhttps://preview.redd.it/prcush6sdlga1.png?width=1373&amp;format=png&amp;auto=webp&amp;v=enabled&amp;s=38e242151a9833bff550e2a264e160486cf6bc5f",
        "created_utc": 1675699660,
        "upvote_ratio": 1.0
    },
    {
        "title": "If we harvest enough tidal energy, will the moon lose so much potential energy one day and come crashing down?",
        "author": "Exciting-Traffic-927",
        "url": "https://www.reddit.com/r/Physics/comments/10v91xw/if_we_harvest_enough_tidal_energy_will_the_moon/",
        "text": "The musings of your average sleep deprived student of physics",
        "created_utc": 1675696501,
        "upvote_ratio": 1.0
    },
    {
        "title": "I need your help with this exercise, thanks in advance",
        "author": "Rare-Childhood-9406",
        "url": "https://i.redd.it/9asgs1j62lga1.png",
        "text": "",
        "created_utc": 1675695735,
        "upvote_ratio": 0.99
    },
    {
        "title": "Does the reaction force of an object in a lift have to be greater than the weight of the object if it’s accelerating upwards?",
        "author": "Upbeat_Lawyer7923",
        "url": "https://www.reddit.com/r/Physics/comments/10v8qm9/does_the_reaction_force_of_an_object_in_a_lift/",
        "text": "[removed]",
        "created_utc": 1675695709,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can a 100 kg person break a display window of a shop if they crash on it ? If so after one minute can they stand up and walk?",
        "author": "Aledipiaz",
        "url": "https://www.reddit.com/r/Physics/comments/10v8lep/can_a_100_kg_person_break_a_display_window_of_a/",
        "text": "",
        "created_utc": 1675695376,
        "upvote_ratio": 1.0
    },
    {
        "title": "interesting enough.",
        "author": "freakingphysicist",
        "url": "https://v.redd.it/8hxhundv0lga1",
        "text": "",
        "created_utc": 1675695298,
        "upvote_ratio": 1.0
    },
    {
        "title": "exercice diode zener",
        "author": "Rare-Childhood-9406",
        "url": "https://www.reddit.com/r/Physics/comments/10v8ij6/exercice_diode_zener/",
        "text": "[removed]",
        "created_utc": 1675695173,
        "upvote_ratio": 0.99
    },
    {
        "title": "if you could only have 5 textbooks",
        "author": "Pleasant-Avocado4270",
        "url": "https://www.reddit.com/r/Physics/comments/10v7ijo/if_you_could_only_have_5_textbooks/",
        "text": "What would they be?",
        "created_utc": 1675692586,
        "upvote_ratio": 1.0
    },
    {
        "title": "What are you working on? - Weekly Discussion Thread - February 06, 2023",
        "author": "AutoModerator",
        "url": "https://www.reddit.com/r/Physics/comments/10v7ajm/what_are_you_working_on_weekly_discussion_thread/",
        "text": "Hello /r/Physics.\n\nIt's everyone's favorite day of the week, again. Time to share (or rant about) how your research/work/studying is going and what you're working on this week.",
        "created_utc": 1675692010,
        "upvote_ratio": 1.0
    },
    {
        "title": "I need academic papers recomendations",
        "author": "Art345",
        "url": "https://www.reddit.com/r/Physics/comments/10v68bd/i_need_academic_papers_recomendations/",
        "text": "Hello, I just started physics on college and I'm on my second semester. I would like to start reading more on the newest papers published and possibly even start writting academic papers myself. So any good international periodics, journals, etc would help me a lot to understand and get myself up to date to what is going on in the academic field right now, thanks in advance!",
        "created_utc": 1675689004,
        "upvote_ratio": 1.0
    },
    {
        "title": "Building a Proof for Holographic Principal. Feedback wanted",
        "author": "Engeljake00",
        "url": "https://www.reddit.com/r/Physics/comments/10v2168/building_a_proof_for_holographic_principal/",
        "text": " \n\nThe entropy of a black hole, S, can be related to its event horizon surface area, A, through the Bekenstein-Hawking entropy formula:\n\nS = k / 4 \\* A,\n\nwhere k is the Boltzmann constant.\n\nIn the context of conformal field theory, the central charge, c, can be calculated from the trace anomaly, Tr(T), of the energy-momentum tensor:\n\nc = Tr(T).\n\nThe number of states, N, in a conformal field theory can then be calculated using the Cardy formula:\n\nN = (c / 6) \\* (L / pi)\\^2 \\* T,\n\nwhere L is a length scale and T is the temperature.\n\nFinally, the entropy of a physical system is subject to the holographic entropy bound, which states that the entropy of a physical system is bounded by its boundary area:\n\nS &lt; (A / 4ħ).\n\nThese mathematical equations can be combined to connect the entropy of a black hole to the entropy of the associated conformal field theory and support the idea of the Holographic Principle.",
        "created_utc": 1675673912,
        "upvote_ratio": 1.0
    },
    {
        "title": "question",
        "author": "Miserable_Local_266",
        "url": "https://www.reddit.com/r/Physics/comments/10v1t9a/question/",
        "text": "If particles can behave as waves ( uncertainty principle) , and a huge amount of particles( mass) that are heavy can collapse on themselves and create black holes , what   a high quantity of waves( say gama rays) could do , or what they result in?",
        "created_utc": 1675672986,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is electrical engineering hard?",
        "author": "secretive_thought",
        "url": "https://www.reddit.com/r/Physics/comments/10v17ok/is_electrical_engineering_hard/",
        "text": "",
        "created_utc": 1675670561,
        "upvote_ratio": 1.0
    },
    {
        "title": "Universes colliding.",
        "author": "Duck_Dodgers1",
        "url": "https://www.reddit.com/r/Physics/comments/10v104n/universes_colliding/",
        "text": "What would be the situation of many universes each with different laws of physics smashing together?",
        "created_utc": 1675669770,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can anyone recommend me a Mathematical methods for physics book?",
        "author": "Black_cocoon",
        "url": "https://www.reddit.com/r/Physics/comments/10uyyal/can_anyone_recommend_me_a_mathematical_methods/",
        "text": "I used the book of Arfken and Weber, but I am interested in another books to complement it. And if someone recommend me a book to start with General relativity I'd be a happy student.",
        "created_utc": 1675662290,
        "upvote_ratio": 1.0
    },
    {
        "title": "If you create a new and important equation and you name it after yourself: are you a pretentious asshole? Do others have to name it after you? What's the cultural norm for such things?",
        "author": "shockwave6969",
        "url": "https://www.reddit.com/r/Physics/comments/10uwreu/if_you_create_a_new_and_important_equation_and/",
        "text": "",
        "created_utc": 1675655276,
        "upvote_ratio": 1.0
    },
    {
        "title": "Zero does not exist",
        "author": "Crazy-Doritos",
        "url": "https://www.reddit.com/r/Physics/comments/10uwmie/zero_does_not_exist/",
        "text": "",
        "created_utc": 1675654852,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can you lift something on a fixed pulley that weighs more than your bodyweight?",
        "author": "This-Season-2271",
        "url": "https://www.reddit.com/r/Physics/comments/10uwkfz/can_you_lift_something_on_a_fixed_pulley_that/",
        "text": "Can you lift something on a fixed pulley (1:1 ratio) that weighs more than your bodyweight? \n\nI think it’s impossible no matter how strong I am unless I am fixed to something or I pull down the rope on an angle to use friction with the ground as an advantage.\n\nIm guessing that I will just result in climbing up the rope rather than lifting up the object if I try to pull down no matter how strong I am(excluding acceleration force).\n\nex)\nme (has the strength of pulling down 100kg) = 60kg\nobject = 70kg~\n*Pulling down vertically*\n\nOh and can you please backup your answers with physical knowledge and terms? Thank you!",
        "created_utc": 1675654682,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can someone please explain to me when we have electric potential energy initial and final? Please help I’m confused.",
        "author": "Many_Line9136",
        "url": "https://www.reddit.com/r/Physics/comments/10uwbqg/can_someone_please_explain_to_me_when_we_have/",
        "text": "Please help I’m confused.",
        "created_utc": 1675653962,
        "upvote_ratio": 1.0
    },
    {
        "title": "Evidence of Gravity Manipulation. Video is not sped up.",
        "author": "AlienOnEarth303",
        "url": "https://youtube.com/shorts/FzSB6ZeEo-w?feature=share",
        "text": "",
        "created_utc": 1675652704,
        "upvote_ratio": 1.0
    },
    {
        "title": "Black hole fission and fusion",
        "author": "Brann-101",
        "url": "https://www.reddit.com/r/Physics/comments/10uvc7w/black_hole_fission_and_fusion/",
        "text": "[removed]",
        "created_utc": 1675651112,
        "upvote_ratio": 1.0
    },
    {
        "title": "an easier book on electrodynamics/electromagnetism",
        "author": "Pleasant-Avocado4270",
        "url": "https://www.reddit.com/r/Physics/comments/10uv4u7/an_easier_book_on_electrodynamicselectromagnetism/",
        "text": "I read a little bit of griffiths introduction to electrodynamics (online)but it was too hard for me(mathematically), also I found purcell to be very good but it is very expensive where I live. Can someone please recommend me some easier book on e&amp;m from which I can learn intuitively and which is not very hard mathematically",
        "created_utc": 1675650535,
        "upvote_ratio": 1.0
    },
    {
        "title": "Dialect's Rebuttal to common Twins Paradox Solutions",
        "author": "TheBlackUnicorn",
        "url": "https://www.reddit.com/r/Physics/comments/10uv14p/dialects_rebuttal_to_common_twins_paradox/",
        "text": "Not sure if this has been posted before but today I ran into this [YouTube playlist](https://www.youtube.com/watch?v=nRuVGOm7560&amp;list=PL__fY7tXwodlaZp8pCI-Snv6pad5RuSdQ&amp;index=1) arguing that most popular solutions to the Twins Paradox are wrong, including Einstein's.\n\nI mostly agree with his take here, but I feel like the [FermiLab solution](https://www.youtube.com/watch?v=noaGNuQCW8A) sounds correct? Like the traveling twin is the only one that experiences the force of acceleration, thus shifting from one inertial frame to the other.\n\nTo sum up Dialect's arguments, he rebuts the basic solutions by pointing out that acceleration is also relative, so the traveling twin could say \"Well, from my perspective the Earth twin accelerated and I stood still.\" So far so good, but then he goes on to argue that the FermiLab solution is wrong because the traveling twin would have to know basic physics to understand they were shifting from one inertial frame to another. And therefore the paradox still reigns because the traveling twin could not know any physics.\n\nI mean...huh? I kind of feel like I've lost the plot here. It seems like the asymmetry is indeed broken by virtue of the fact that only the space twin experiences the thrust of their rockets firing to turn around. So it seems to me that there's clearly an asymmetry. He also talks about Einstein's solution, which is flawed in that it postulates that the traveling twin is correct in interpreting their own rockets firing as a universal gravitational field magically appearing throughout space. But I feel like Einstein is right in that that is what it looks like to the traveling twin, obviously it can't be _real_ because that would be a nonlocal effect.\n\nFinally Dialect alludes in his last video to what I think is the most complete and correct answer. The twin who ages the least is the one who takes the shortest path through spacetime. One would assume the traveling twin would take the longer path, but I think because of length contraction the traveling twin sees themself going through less spacetime than the Earth twin.\n\nIn another of his videos he argues that the correct interpretation of GR is that, near the surface of the Earth, there is \"no gravity\", because the gravitational field is uniformly pointing down, and that the right way to describe why objects fall is that the ground accelerates upwards at 9.8m/s^2. I've seen similar interpretations of GR, so I don't think this is a fringe idea, but it kind of bakes my noodle. Is this a reasonable way to interpret GR or is this guy off his rocker?",
        "created_utc": 1675650231,
        "upvote_ratio": 1.0
    },
    {
        "title": "G Force Question",
        "author": "Responsible-Round643",
        "url": "https://www.reddit.com/r/Physics/comments/10uts49/g_force_question/",
        "text": "Hello, does anyone know the G force to the body of a 170lb man, that slips and falls onto his back/head? Just looking for average numbers for comparison. I have read online that a human can only sustain 9 Gs for a short period of time. But I know a fall impact is much higher than 9g's why is one worse than the other?",
        "created_utc": 1675646791,
        "upvote_ratio": 1.0
    },
    {
        "title": "WTF is a metre actually?",
        "author": "m1lk5200",
        "url": "https://www.reddit.com/r/Physics/comments/10ustkc/wtf_is_a_metre_actually/",
        "text": "I've always wondered what the actual definition of a metre is because the definition we see now is that a metre is the distance light travels in 1/299792458 of a second but this is derived I assume from the speed of light being 299792458m/s which is using a metre to define a metre",
        "created_utc": 1675644264,
        "upvote_ratio": 1.0
    },
    {
        "title": "Catapult is not launching accurately",
        "author": "GalaxyAvS",
        "url": "https://www.reddit.com/gallery/10us4yo",
        "text": "",
        "created_utc": 1675642507,
        "upvote_ratio": 1.0
    },
    {
        "title": "If you have a piece of wood a lightyear long and you pushed it (with inhuman theoretical strength) how fast would the wave pushing the wood along move?",
        "author": "jffrysith",
        "url": "https://www.reddit.com/r/Physics/comments/10urias/if_you_have_a_piece_of_wood_a_lightyear_long_and/",
        "text": "I assume your push would move like a wave, but would it move at the speed of light or the speed of sound in the wood?",
        "created_utc": 1675640960,
        "upvote_ratio": 1.0
    },
    {
        "title": "Researchers create an optical tractor beam that pulls larger objects",
        "author": "davinci-code",
        "url": "https://www.futurespacetech.com/2023/02/researchers-create-optical-tractor-beam.html",
        "text": "",
        "created_utc": 1675638417,
        "upvote_ratio": 1.0
    },
    {
        "title": "physics book from the ground up, sorta",
        "author": "monkeybini",
        "url": "https://www.reddit.com/r/Physics/comments/10ultw7/physics_book_from_the_ground_up_sorta/",
        "text": "I love math, it's so much like art but also the inverse in some aspects. it feels like the ideal subject to sacrifice your life for its pursuit. physics however I have no clue about. I really care much for it really, but I'm starting to see more and more reasons why I should learn more about it.\n\nI've been reading \"oil and marble\" and based off my own experiences drawing and painting I see I need to understand more about human anatomy in a medical sense and understand physics, in the way things work from light and sound to gravity and space.\n\ni see stories and people talking about the universe, it's glory and a bunch of other stuff of about space and I just can't bring myself to give a shit.\n\nbut recently I've been doing some weird shit. I'll ask myself what's gravity or what's light, derive properties it should than have and sort of tinker around with scenarios in my head and at some point end up with the definitions you learn in highschool, I'd still understand nothing about it really. it's like I'd walk around in a circle and end up at as point that was definitely not part of the circle in the beginning.\n\nI find sort of a macro look on things quite boring, so is the impact of technology. really just doing something for the sake of it is just the best way to do something in my opinion, irrelevant of its usefulness or cleverness.\n\nnow relating to my question, serge lang basic mathematics Is a great book. very enjoyable and informative. I was wondering if based of the before mentioned information you have any books that I'd enjoy but more importantly is their any book like that, where it explained the basic building blocks or rules of the game and builds up from there in this what if method, sort of starting with a few things and creating the universe from there or imagining what would happen in different situations. like for example explaining and figuring out what sound is and than seeing if could you actually use it as a weapon like in cartoons, could you make a echo across the earth etc. I'd prefer maths being included honestly\n\nTLDR books building up physics from the ground up In a theoretical way, the way serge lang did for mathematics in \"basic mathematics\"",
        "created_utc": 1675627212,
        "upvote_ratio": 1.0
    },
    {
        "title": "Regret dropping the Physics major only to come crawling back [A counter-experience]",
        "author": "bright-eyed-alien",
        "url": "https://www.reddit.com/r/Physics/comments/10ultha/regret_dropping_the_physics_major_only_to_come/",
        "text": "There's this rather popular post on this reddit sub, written by someone who dropped the physics major and wanted to share their experiences. It was a rather popular post. \n\nThat's all very cool, and I do not want to say that this person was wrong in any respect whatsoever. In fact, I commend anyone who has the courage to follow their hearts, even when their hearts sometimes tell them to give up on something for good reason. There's no right or wrong perspective or life experience. I just wanted to share my flip side of the story, nonetheless. My personal experience is that I dropped physics for engineering and later for English (with hopes of getting into law school). And then guess what? Years later, I had such deep regrets that I came crawling back to physics. I'm now a mid-20s student feeling older than most, but at the least the pain I'll feel now of being back in school and not in the workforce will hopefully be offset by the lesser pain I'll feel someday of knowing that I came back for a reason.\n\nPhysics can suck. The homework sets eat away at my sleep, and the volume we must master before exams can eat away at my spare time. However, there's something so beautiful and fulfilling about physics. It's a deep and vast subject. It's science that teaches us everything about how the world around us operates. It's mathematics exploring some of the most fascinating numbers-crunching out there.\n\nYes, most people studying physics intend on going all the way with it. Yes, some people cannot get a job in physics without a graduate degree. Who cares though. My other major is economics, and I could probably do less with an econ degree on its own than with a physics degree on its own. If I applied at a bank with an econ degree, I may or may not get a job. If I applied at a bank with a physics degree, however, I could almost certainly get some type of job in some type of capacity, because everyone respects the fact that you need to know a lot of math to master Physics at the undergraduate level. And there is a lot of versatility to the Physics degree indeed! I say this without much bias at all because I'm not making any funds nor commission when people enroll in the physics studies at my university.\n\nAnd if you do choose to go all the way with physics? You could land a beautiful job at one of the world's leading research facilities. These types of doors aren't open to everyone, but they certainly are closed to everyone who doesn't hold a physics education. \n\nPhysics and mathematics profs at my university have been the best around. I personally didn't enjoy the profs in business school or in economics school much because I only had 1 or 2 very good ones. Some of the others seemed very arrogant or uncaring about their students. In sciences, however, I found that many profs have been amazing and genuinely caring. (No, not all of them). \n\nAnyway, I'm at an age where I am always focused on my long-term goals and I very rarely do anything for the short-term decision-making. I don't want any older teens or younger twenties to read a post encouraging them to drop a physics major and then go, \"Oh that's awesome! I'm gonna drop this tough sh\\*t immediately!\" However, if you're genuinely losing interest in physics or you're genuinely not understanding why you'd study any of it to begin with - if you've got a genuine reason to want to drop out - then go for it. Life is too short, one way or another.",
        "created_utc": 1675627189,
        "upvote_ratio": 1.0
    },
    {
        "title": "Velocetly and pace",
        "author": "PSych0P7NDa",
        "url": "https://www.reddit.com/r/Physics/comments/10ukzn4/velocetly_and_pace/",
        "text": "The velocetly has two compounds the pace and the direction so is it right to say that the value of the velocety is equal to the pace?",
        "created_utc": 1675625166,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why does the sheriff say it's impossible to shoot down the Chinese balloon? I did the math, seems possible?",
        "author": "average_Taiwanese",
        "url": "https://www.reddit.com/r/Physics/comments/10ukj8a/why_does_the_sheriff_say_its_impossible_to_shoot/",
        "text": "&amp;#x200B;\n\nhttps://preview.redd.it/9oba0oal2fga1.png?width=640&amp;format=png&amp;auto=webp&amp;v=enabled&amp;s=7eb75907bc5fc7e27a206a2bbb6f5d098dd5878e\n\nSo Wikipedia says the muzzle velocity of modern rifles can exceed 1200m/s\n\nThe vertical velocity is vsin(theta), lets assume when they aim at the balloon, the angle theta is 45 degrees, so the vertical velocity vsin(theta)=848.5 m/s\n\n1/2m\\[vsin(theta)\\]\\^2 = mgh =&gt; h = \\[vsin(theta)\\]\\^2/(2g) = 36,710 m = 120,400 feet\n\nThat's a lot more than the 60,000+ feet they say, even with air resistance I think the bullet will be able to reach 60,000+ feet = 18,288 m, I don't know how to calculate that though, would love to see someone do that.\n\nQuestion 2, will the rifle bullet fired at the sky be dangerous when it falls down? I thought air resistance would make its terminal velocity slow enough to be not a big deal.",
        "created_utc": 1675624082,
        "upvote_ratio": 1.0
    },
    {
        "title": "Lightbulb to my eye acceleration?",
        "author": "New-Ad4391",
        "url": "https://www.reddit.com/r/Physics/comments/10ujkca/lightbulb_to_my_eye_acceleration/",
        "text": "I keep reading light only changes velocity in certain situations. My question is doesn’t it have to have some incredible acceleration from the moment the light is activated to the point it reaches our eyes?  How else could it reach its velocity, it has to accelerate, right???",
        "created_utc": 1675621810,
        "upvote_ratio": 1.0
    },
    {
        "title": "Bowling ball and rice question",
        "author": "Iupavol",
        "url": "https://www.reddit.com/r/Physics/comments/10ujfmf/bowling_ball_and_rice_question/",
        "text": "Hi everyone. Since I was a kid school taught me about gravity. Every teacher I met told me that everything exercise gravity related to his mass. My question is, in a space region where there are not planets, stars or everything else (immaginary region), a bowling ball can attract a grain of rice? Thanks",
        "created_utc": 1675621498,
        "upvote_ratio": 1.0
    },
    {
        "title": "I may be reading too far into this, but is this a good hypothesis to make about the universe or is it just a sh*t post? Referring to the second half of the tweet.",
        "author": "New_Language4727",
        "url": "https://i.redd.it/7olzj715dgga1.jpg",
        "text": "",
        "created_utc": 1675620872,
        "upvote_ratio": 1.0
    },
    {
        "title": "HOW TO MAKE A SCRAP WIRE STRIPPING TOOL/Best Wire Stripper",
        "author": "megaone2",
        "url": "https://youtu.be/LTZNCazM28c",
        "text": "",
        "created_utc": 1675619982,
        "upvote_ratio": 1.0
    },
    {
        "title": "what does this symbol mean in physics. I'm just developing an interest in this field..",
        "author": "bowmando421",
        "url": "https://i.redd.it/11m0oij29gga1.jpg",
        "text": "",
        "created_utc": 1675619501,
        "upvote_ratio": 1.0
    },
    {
        "title": "Something [SMBC]",
        "author": "dlgn13",
        "url": "https://www.smbc-comics.com/comic/something",
        "text": "",
        "created_utc": 1675619147,
        "upvote_ratio": 1.0
    },
    {
        "title": "Parsimony, Godel, Cultural Inertia, and the Limits of Science",
        "author": "Pedantc_Poet",
        "url": "https://www.reddit.com/r/Physics/comments/10uhxy9/parsimony_godel_cultural_inertia_and_the_limits/",
        "text": "Assume we represent an established fact about the Universe as a block with the letter \"A\" painted on it.  (Here, is \"established fact\" refers to something no credible scientist questions, such as the Second Law of Thermodynamics, Local Realism, the Theory of Evolution, etc.) (here \"credible scientist\" refers to someone society designates as \"justifiably able to be believed on matters of science\").\n\nLet's assume that, built entirely upon the established fact we've labelled \"A\", we can derive another established fact \"B,\" which is, itself, visualized as a block resting on top of \"A.\"  \n\nIn like manner, we have \"C,\" \"D,\" \"E,\" etc.\n\nNote that this model is being simplified by considering only those blocks which depend only on the blocks immediately below them, in a stack one block wide.  I don't believe that this will have any significant effect vs. n-blocks wide for the sake of my post.  It is done only to simplify.  Also, this is a discrete stack.  In reality, we might be able to insert an infinite amount of blocks between any two blocks and then relabel all the blocks from that point upward.  Again, I do not believe that this will affect the model for the sake of my post.  I use the model I do only to simplify.  However, it should be pointed out that, due to this ability to insert new blocks, the total stack can be infinitely high.\n\nIn this way, we have a mental image of a body of knowledge where each knowledge item is based on the items which rest beneath it.  This stack is subject to Godel's Incompleteness Theorem.   \"B\" is not the only possible choice of block to stack on top of \"A.\".  We could have chosen \"B prime\", but we didn't.\n\nHowever, let's create another stack, identical to the first, and this time, we'll switch out \"B\" for \"B prime.\"  But, now, we have to switch out all blocks on top of \"B prime\" with their equivalent prime.\n\n\"C\" and \"C prime\" may be so similar that we don't even notice immediately that the one has been switched out for the other.  In fact, let's generalize that.  For any particular block, we may not be able to distinguish it from it's prime immediately.\n\nAnd, so,we continue to stack blocks.  \"D prime\" stacks on top of \"C prime,\" \"E prime\" stacks on top of \"D prime,\" and, so,this continues.  We are unaware that the stack we ae now building is different from the stack we built previously.\n\nExcept, that the stack we are building now ends up taller than the first stack.\n\nThat surprises us, because we thought that these two stacks were identical.  We couldn't immediately detect any differences.\n\nBut, upon closer examination, we discover that we had switched \"B\" for \"B prime.\"  Well, that sucks, because we wanted the first stack to be at least as tall as the second stack.  But, now, we have to knock the first stack down and rebuild it using the prime versions of the blocks.\n\nAs mentioned before, this stack is a model of a body of knowledge.  Science is a body of knowledge.  Let's say that this stack represents science.\n\nDiscovering that the first stack doesn't go as high as we want refers to reaching the limits of science.  Upon closer examination, we discover that we need to replace \"B\" with \"B prime.\"  But, as soon as we consider doing that, we realized that we have to replace \"C\" with \"C prime\" and all the other blocks on top of it with their primes. This raises questions of parsimony and whether that replacement is a good idea.\n\nDoes any of this make sense or am I incoherent at this point?",
        "created_utc": 1675617936,
        "upvote_ratio": 1.0
    },
    {
        "title": "Personal Question: Principal Axes on the Flywheel of a Spaceship",
        "author": "astronometal",
        "url": "https://www.reddit.com/r/Physics/comments/10uhi76/personal_question_principal_axes_on_the_flywheel/",
        "text": "Hey all! I have a quick question, which is based on HW I've done but isn't the homework itself. It's more just me thinking about things. \n\nLets say you have a flywheel that lets a spaceship change its orientation. The torque from the wheel causes angular momentum to change, but because it's conserved, you're able to shift the spaceship (or at least, that's how I understand it). But lets say you pick principal axes on the flywheel so that there doesn't appear to be a torque in that frame. How do you explain the fact the spaceship rotates when you speed up or slow down the flywheel, if you've gotten rid of torque in that frame?",
        "created_utc": 1675616891,
        "upvote_ratio": 1.0
    },
    {
        "title": "Tips and tricks for studying physics",
        "author": "gabbolarity",
        "url": "https://www.reddit.com/r/Physics/comments/10uehrj/tips_and_tricks_for_studying_physics/",
        "text": "[removed]",
        "created_utc": 1675609289,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can Light Speed be slower depending on the side?",
        "author": "MasterReset7",
        "url": "https://www.reddit.com/r/Physics/comments/10uec51/can_light_speed_be_slower_depending_on_the_side/",
        "text": "[removed]",
        "created_utc": 1675608910,
        "upvote_ratio": 1.0
    },
    {
        "title": "does anyone know how to solve this? i have no idea",
        "author": "Character_Ad9041",
        "url": "https://i.redd.it/porl48hz5fga1.png",
        "text": "",
        "created_utc": 1675606395,
        "upvote_ratio": 1.0
    },
    {
        "title": "Many-Body",
        "author": "DanielB65",
        "url": "https://www.reddit.com/r/Physics/comments/10ubyvi/manybody/",
        "text": "Many-Body theory, is any one read lately an article on Many-Body? Thank you",
        "created_utc": 1675602205,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does any natural sound have multiple frequencies?",
        "author": "jalOo52",
        "url": "https://www.reddit.com/r/Physics/comments/10ub232/does_any_natural_sound_have_multiple_frequencies/",
        "text": "Hello,\n\nI was wondering if all sounds, wether musical or non musical, have multiple frequencies (even if they are quiet and subtle) or if there are objects that vibrate with only a single frequency.\n\nWould the following statement be correct?:  \n\"All sounds have waveforms that are complex because they are made up of multiple frequencies.\"  \n\n\nThanks in advance!",
        "created_utc": 1675599113,
        "upvote_ratio": 1.0
    },
    {
        "title": "What are the efficiency and flight implications of this paper on ionic propellers?",
        "author": "jawshuwah",
        "url": "https://www.sciencedirect.com/science/article/pii/S0304388619300890",
        "text": "",
        "created_utc": 1675584968,
        "upvote_ratio": 1.0
    },
    {
        "title": "Electric Flux",
        "author": "__moustache__",
        "url": "https://www.reddit.com/r/Physics/comments/10u77jh/electric_flux/",
        "text": "Why is Electric Flux = E\\*A but not E/A. Isn't Electric flux equals Electric Field per area in, like normal terms? (I am a beginner in Physics)",
        "created_utc": 1675583591,
        "upvote_ratio": 1.0
    },
    {
        "title": "Thermodynamic Jacuzzi (thermosyphon) analysis",
        "author": "coconut_maan",
        "url": "https://www.reddit.com/r/Physics/comments/10u6hph/thermodynamic_jacuzzi_thermosyphon_analysis/",
        "text": "Dear Physics community,\n\nI am a mentor at a local high school physics lab,\n\nwe have been investigating modes of heat transfer building up to a thermosyphon.\n\nI have included the specifc geometry, energy flow and material parameters in an attached image.\n\nwe  have been measuring the temperature at the outlet, mid and inlet ports  in different size containers and we wish to model these curves.\n\nboth  the outlet and mid temperature over time curves look like very small  squigly S curves, however the inlet temperature curve looks alot more  exponential until it reaches the maximum and all flatten out at the  maximum point.\n\nif anyone here has  any ideas how to form the differential equation governing these curves  or better yet the difference formula that would be really great.\n\nthis is a really complex flow with multiple modes of convection and conduction.\n\nwe  have decided to try and use dimensional analysis to find dimensionless  groups and try to compare two small models to show that our dimensional  analysis was correct.\n\nwe have two small models with different diameters and hights (see geometrical properties)\n\nthe problem is that there are so many parameters I am not sure how to proceede with the dimensional analysis.\n\nour  goal is to be able to either model or similutude analysis a large scale  thermosyphon or jacuzzi for 3-4 people to try and determine if this is  feasable in terms of how much fuel would be required, working  temperatures and the time it would take to heat up.\n\nOne last note:\n\nthe organizer of this physics lab does not permit FEA because he has decided that its \"not physics\".  (whatever that means)\n\nHas anyone here done anything similar and can shed light on how to proceed with this endevour?\n\nRegards,\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n[system parameters](https://preview.redd.it/ukiw3j0lkbga1.png?width=844&amp;format=png&amp;auto=webp&amp;v=enabled&amp;s=83370f9529377ddbf461dfc9f3b314bd54ce96ba)",
        "created_utc": 1675580848,
        "upvote_ratio": 1.0
    },
    {
        "title": "Gravity battery",
        "author": "Fit_Frame852",
        "url": "https://www.reddit.com/r/Physics/comments/10u69tn/gravity_battery/",
        "text": "[removed]",
        "created_utc": 1675580035,
        "upvote_ratio": 1.0
    },
    {
        "title": "LaTeX templates for physics lecture notes",
        "author": "StrikerSigmaFive",
        "url": "https://www.reddit.com/r/Physics/comments/10u2f1c/latex_templates_for_physics_lecture_notes/",
        "text": "What templates for typesetting lecture notes in physics are available online? I'm particularly interestesld in that template that David Tong uses.",
        "created_utc": 1675572936,
        "upvote_ratio": 1.0
    },
    {
        "title": "What’s the highest frequency man can modulate useful information onto and transmit?",
        "author": "TickletheEther",
        "url": "https://www.reddit.com/r/Physics/comments/10u0wpa/whats_the_highest_frequency_man_can_modulate/",
        "text": "We can modulate visible light but how high can we go on the spectrum? UV? XRay? Etc",
        "created_utc": 1675570653,
        "upvote_ratio": 1.0
    },
    {
        "title": "Researchers at University of Maryland Break Record for Laser Guided Light with Air Waveguide Experiment",
        "author": "CoherentPhoton",
        "url": "https://405nm.com/university-maryland-air-waveguides/?1",
        "text": "",
        "created_utc": 1675567635,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can you recommend a book on physics for a 13 year old?",
        "author": "rainwrapped",
        "url": "https://www.reddit.com/r/Physics/comments/10twhl8/can_you_recommend_a_book_on_physics_for_a_13_year/",
        "text": "",
        "created_utc": 1675558210,
        "upvote_ratio": 1.0
    },
    {
        "title": "Homework Help, Find Acceleration",
        "author": "VirgoInUtero",
        "url": "https://www.reddit.com/r/Physics/comments/10tvsgv/homework_help_find_acceleration/",
        "text": "[removed]",
        "created_utc": 1675556301,
        "upvote_ratio": 1.0
    },
    {
        "title": "Has anyone been looked upon because of the area of physics they have chosen?",
        "author": "QuestionPowerful7",
        "url": "https://www.reddit.com/r/Physics/comments/10tuvio/has_anyone_been_looked_upon_because_of_the_area/",
        "text": " I am in condensed matter physics. Both in grad and undergrad, a lot of my colleagues have easily dismissed my field as materials science or engineering. I don't mind being considered an applied physicist. However, a couple of people aren't that graceful enough.",
        "created_utc": 1675553851,
        "upvote_ratio": 1.0
    },
    {
        "title": "Vacuum in empty waterbottles",
        "author": "IntroductionFit1440",
        "url": "https://www.reddit.com/r/Physics/comments/10tu8cv/vacuum_in_empty_waterbottles/",
        "text": "I tried googling this but couldn't find anything at all.\nAll my water-/soda-bottles seem to lose the air inside them over time. Every now and then they scare me, the sound of the bottle suddenly compressing can be quite loud.\n\nWhy is there vacuum inside all of my empty bottles?\n\nI've never seen this before, until I moved to my current house. We got a substantial amount of Radon, could this be the reason? Just guessing wildly here.\nOr maybe it's normal, and I just haven't noticed it before.",
        "created_utc": 1675552187,
        "upvote_ratio": 1.0
    },
    {
        "title": "Help!",
        "author": "newbs4lyf",
        "url": "https://www.reddit.com/r/Physics/comments/10tu0nn/help/",
        "text": "So the story goes like this..\nIve been hella interested in theoretical physics and was keen on taking a self study project on the same. My supervisor hit me with finding \"the Hilbert Space for the Coulomb branch of 3d N=4 U(1) gauge theory with n flavors\". Ive just joined as a graduate and have barely made it through QFT and am kinda struggling to get a start. What would be a good starting point to lay the foundations from the ground up to the said topic?",
        "created_utc": 1675551628,
        "upvote_ratio": 1.0
    },
    {
        "title": "Light wavelength in phone screens",
        "author": "Jack_Smikki",
        "url": "https://www.reddit.com/r/Physics/comments/10ttjgq/light_wavelength_in_phone_screens/",
        "text": "Let’s start off with me having an irregular sleeping pattern\n\nI have a job that has me off at 10 pm and the next day have me there at 6 am, so I’m not able to sleep 7-8 hours every night. I have read online that red light can increase melatonin levels but only if the light emit red light wavelength and not if it’s just red dimmed. I was wondering if i can still increase melatonin levels if I turn on a colour filter on my phone so that it only emits red light and eliminates the blue and the green. Is this how it works because I couldn’t find anything about it online?\n\nTL;DR \nCan I increase melatonin levels if I eliminate the blue and green colors on my phone screen?",
        "created_utc": 1675550414,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is there a difference between permeance and permeability? Electromagnetics",
        "author": "Melanie_Tlharesagae",
        "url": "https://www.reddit.com/r/Physics/comments/10tt8ll/is_there_a_difference_between_permeance_and/",
        "text": "",
        "created_utc": 1675549638,
        "upvote_ratio": 1.0
    },
    {
        "title": "can observation causing the wave function to collapse destroy the universe",
        "author": "charlie1212121290",
        "url": "https://www.reddit.com/r/Physics/comments/10tseqw/can_observation_causing_the_wave_function_to/",
        "text": "I saw someone on reddit say this was a doomsday scenario was he talking out of his ass how would we even die from something like this",
        "created_utc": 1675547573,
        "upvote_ratio": 1.0
    },
    {
        "title": "Your Opinion on Two Largely Overlooked Classical Physics Papers",
        "author": "FulvaSofas",
        "url": "https://www.reddit.com/r/Physics/comments/10ts16b/your_opinion_on_two_largely_overlooked_classical/",
        "text": " [1903.pdf (krwjones.com)](http://krwjones.com/wordpress/wp-content/uploads/2013/08/1903.pdf) \n\n[http://krwjones.com/wordpress/wp-content/uploads/2013/08/1904.pdf](http://krwjones.com/wordpress/wp-content/uploads/2013/08/1904.pdf)\n\n&amp;#x200B;\n\nThese two papers, from the eminent British mathematician Whittaker, derive the electromagnetic wave from two scalar potential functions, which consist of infolded and bidirectional longitudinal waves. Any opinions on these papers?",
        "created_utc": 1675546637,
        "upvote_ratio": 1.0
    },
    {
        "title": "your relationship with classical electodynamics throught the Years",
        "author": "grasshopper4579",
        "url": "https://www.reddit.com/r/Physics/comments/10trc4o/your_relationship_with_classical_electodynamics/",
        "text": "Hello everyone \n\nAs I get older I'm wondering about the limits of human perception looking at em for the richness it holds and then seeing it as only one part of the standard model \nIs mind blowing \n\nHow do you deal with it ? With the idea that mastering just one force is bearly within human grasp and there for how should one strive to gain knowledge in the quest to fully understanding the universe ?",
        "created_utc": 1675544883,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do we know time is affected by gravity and not just he forces we use to measure them?",
        "author": "Aggravating-Pear4222",
        "url": "https://www.reddit.com/r/Physics/comments/10tqu6i/how_do_we_know_time_is_affected_by_gravity_and/",
        "text": "What if gravity only affects the forces used in measuring time and not just time itself? Are there ways to measure time that aren't just electromagnetic?",
        "created_utc": 1675543610,
        "upvote_ratio": 1.0
    },
    {
        "title": "Quantum phyiscs and living in a simulation",
        "author": "llewellyn47",
        "url": "https://www.reddit.com/r/Physics/comments/10tq8ae/quantum_phyiscs_and_living_in_a_simulation/",
        "text": "So this is probably a stupid idea, but I was in college, in a quantum programming course, and I got distracted.\n\nQuantum particles can be in more than one place at the same time(sorry for my lack of vocabulary), until you check them or measure them, then they get defined and stay in one place.\n\nIt reminded me of programs or videogames, let's say Minecraft for example, the character is in one square of the world, it only loads the next one when the character gets close to it. Before that the next chunk is a probability, it could be desert, jungle, forest, whatever, it's only when you get close that it defines into one of those and it never goes back to the probability, it stays loaded. This was mainly thought to optimize performance, you can have an enormous whole world and travel through it for years and you will only have discovered a very small part of it, it wouldn't be possible without this programming trick because  there would be too much to render and computers are not enough powerful.\n\nThinking about this, would it make any sense that quantum particles act that way to somewhat \"save\" performance and making it possible to render a universe because it only loads the quantum particles we measure?\n\nOf course I know this could be a stupidity due to a lack of knowledge on the matter, and I would apreciate if you said it.",
        "created_utc": 1675542098,
        "upvote_ratio": 1.0
    },
    {
        "title": "Physics homework question",
        "author": "shababb",
        "url": "https://i.redd.it/loui0udnu9ga1.jpg",
        "text": "[removed]",
        "created_utc": 1675542010,
        "upvote_ratio": 1.0
    },
    {
        "title": "how would you solve the task? I have a solved example in which the acceleration with 3 rollers is required, but to solve this one, I don't have roller number 1, but only 2 and 3, and the speed of the board is required.",
        "author": "TraditionalHumor6885",
        "url": "https://www.reddit.com/gallery/10tpk78",
        "text": "",
        "created_utc": 1675540503,
        "upvote_ratio": 1.0
    },
    {
        "title": "What do physicists think of people like Stephen Wolfram?",
        "author": "New_Language4727",
        "url": "https://www.reddit.com/r/Physics/comments/10tove9/what_do_physicists_think_of_people_like_stephen/",
        "text": "I’ve heard of his reputation among physicists in the past, but I’m curious to know if that’s changed, or if people have just stopped paying attention to him. I occasionally see him on podcasts like Tim Ferris or Lex Fridman, and these are fairly recent so I guess this is where my confusion steps in.",
        "created_utc": 1675538788,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can I please get some advice on what to study in quantum mechanics for a specific research project?",
        "author": "Zealousideal_Hat6843",
        "url": "https://www.reddit.com/r/Physics/comments/10tn510/can_i_please_get_some_advice_on_what_to_study_in/",
        "text": " I am a physics undergrad, and I am in a research project under a professor. Now, I have flunked most of my undergrad classes, but I took on the project anyway. The project is about using cold atoms to simulate graphene bilayers. The prof advised me to read up on QM from griffiths upto the hydrogen chapter as I didn't do well in my QM courses. The deadline was upto this monday, and I have only sunday to prepare as I have been slacking off. Chat GPT assured me I can ask advice here on what to study. Even upto hydrogen atoms, it's about 150 pages in griffiths, and I wanted to know if I can trim the fat in some way and study only the essentials.",
        "created_utc": 1675534561,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can someone help with this GCSE physics question",
        "author": "Williamdoesgaming",
        "url": "https://www.reddit.com/gallery/10tld3q",
        "text": "",
        "created_utc": 1675530350,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is psychology a proper science?",
        "author": "murram20",
        "url": "https://www.reddit.com/r/Physics/comments/10tlce5/is_psychology_a_proper_science/",
        "text": "Help me out here physics people. Had an argument with my dad there about whether adhd and various psychological problems really exist. I’m a physics graduate and am not convinced by the psychology studies or definitions of certain disorders/mental issues. I am completely open to any possibility but psychology tests are subjective where they ask a person questions and they are answered by what the person “thinks” or “feels”. This is very different to physics, chem and biology where physical measurements are what matters. If a doctor/psychologist/psychiatrist was to tell me i have for example adhd i would never trust their conclusion and they can not prove i have this “thing” wrong with me. They cannot prove it physically exists. Even if they put me in some new machine and measured my brain activity and showed my brain activity was abnormal and outside a range of a certain percentage of humans i would still not trust it because they made the arbitrary line on a spectrum to where people with adhd exist and where people without it exist. To me it is like making a definition whether someone is romantic or not and then making a set of questions to arbitrarily categorise people as romantic or not. \n\n\nAm i being rational here or not?",
        "created_utc": 1675530307,
        "upvote_ratio": 1.0
    },
    {
        "title": "How important is Quantum Field Theory for a master High Energy Physics",
        "author": "PabloXDark",
        "url": "https://www.reddit.com/r/Physics/comments/10tl94m/how_important_is_quantum_field_theory_for_a/",
        "text": "I an currently a physics bachelor student planning ahead on doing my master in particle physics.\n\nIn my university for the master in physics you can choose all the courses you want to take for yourself and none is mandatory. You only have to reach the maximum credit points. Im currently looking at the available courses and trying to make a rough plan on what to take for each semester. \n\nAll the courses are divided in their own categories (like astro, particle, laser, atom, biomedical,...) and each also divided in experimental an theoretical physics.\n\nFor context: I am leaning towards (experimental) high energy physics. I also already have taken the basic course on particle physics for bachelor students.\n\nThere are two advanced master courses for theoretical particle physics listed as QFT I and QFT II. \n\nWould you say a theoretical course on QFT is essential for an experimental particle physics carrier or should I push it more to the side an focus on more experimental physics courses?\n\nPS.: I also like theoretical physics so maybe I'll just end up taking the courses because they seem interesting. I only wanna know how important they are",
        "created_utc": 1675530083,
        "upvote_ratio": 1.0
    },
    {
        "title": "Rubber bands stretched produce heat and when released, they absorb heat. It's all about an entropy change.",
        "author": "freakingphysicist",
        "url": "https://v.redd.it/zm3bpup7d7ga1",
        "text": "",
        "created_utc": 1675529935,
        "upvote_ratio": 1.0
    }
]