[
    {
        "title": "Blast Chiller for the Quan­tum World - Institute for Quantum Optics and Quantum Information - Austrian Academy of Sciences",
        "author": "lfuwebred",
        "url": "https://iqoqi.at/en/current/news/864-blast-chiller-for-the-quan-tum-world",
        "text": "",
        "created_utc": 1674055259,
        "upvote_ratio": 1.0
    },
    {
        "title": "Question about the mechanics of radiation absorption.",
        "author": "yavitz",
        "url": "https://www.reddit.com/r/Physics/comments/10f9i64/question_about_the_mechanics_of_radiation/",
        "text": "While reading about wave-particle duality it made me wonder about the mechanics of what happens to the radiation when it is blocked or absorbed. For instance when a high energy wave interacts with a dense enough material is it a case where the properties of the matter cancel out the radiations waveform and negate its effects, as in destructive interference? Or is it that the matter is so densely packed that the radiation hits it like a wall and is stopped/deflected?",
        "created_utc": 1674054237,
        "upvote_ratio": 1.0
    },
    {
        "title": "Here’s a question for all you genius’. What does the red arrows do?",
        "author": "Large_Tip_8823",
        "url": "https://i.redd.it/0qs0fdbmtuca1.jpg",
        "text": "",
        "created_utc": 1674052517,
        "upvote_ratio": 1.0
    },
    {
        "title": "Hello, I have a few questions in regards to classical mechanics (and molecular physics) I still do not understand.",
        "author": "Communism_Doge",
        "url": "https://www.reddit.com/r/Physics/comments/10f67i4/hello_i_have_a_few_questions_in_regards_to/",
        "text": "1. Where does the gyroscopic force come from? Why do spinning’s objects not like changing the direction of the rotational axis?\n2. What does the tensor of deformation actually tell us? Does it say that “if you go into this infinitesimally small direction from this point, then after deformation, the distance between the two points after the deformation will be this much larger than before”? \n3. Why does the angular speed of a molecule not influence the temperature of the substance, but it’s translational velocity does? (Average kinetic energy of a molecule vs it’s degrees of freedom)\n\nThanks in advance",
        "created_utc": 1674044882,
        "upvote_ratio": 1.0
    },
    {
        "title": "would the laws of physics that apply to our universe also apply to a universe with maybe 2 or 4 geometric dimensions??",
        "author": "ExtensionAnybody467",
        "url": "https://www.reddit.com/r/Physics/comments/10f65fj/would_the_laws_of_physics_that_apply_to_our/",
        "text": "",
        "created_utc": 1674044696,
        "upvote_ratio": 1.0
    },
    {
        "title": "Fundamentals for Radiation Physics?",
        "author": "jsndxtr",
        "url": "https://www.reddit.com/r/Physics/comments/10f5qnn/fundamentals_for_radiation_physics/",
        "text": "I'm a doctor, planning to study Radiation Physics.  But I do not have a good foundation on basic physics. What fundamental topics should I learn first, in order to understand grasp this field better? Recommended resources are also highly appreciated!",
        "created_utc": 1674043377,
        "upvote_ratio": 1.0
    },
    {
        "title": "The fundamental nature of reality is…",
        "author": "okwaitno",
        "url": "https://www.reddit.com/r/Physics/comments/10f464d/the_fundamental_nature_of_reality_is/",
        "text": "\n\n[View Poll](https://www.reddit.com/poll/10f464d)",
        "created_utc": 1674037941,
        "upvote_ratio": 1.0
    },
    {
        "title": "Discharging of conductors",
        "author": "Additional-Dark2919",
        "url": "https://www.reddit.com/r/Physics/comments/10f3sti/discharging_of_conductors/",
        "text": "I read that insulators can be discharged through heating or humidity. However, why can’t we neutralise conductors with the same methods? Why wouldn’t the ions or polar water molecules remove excess charges from the conductor?",
        "created_utc": 1674036553,
        "upvote_ratio": 1.0
    },
    {
        "title": "So I have a question: is the inverted face thing just exaggerated?",
        "author": "Dapper-Force2193",
        "url": "https://www.reddit.com/r/Physics/comments/10f3hwb/so_i_have_a_question_is_the_inverted_face_thing/",
        "text": "About 2 months ago I literally had an identity crisis knowing that the face I look at in the mirror isn't what I really look like, I know it's ridiculous.\n\nWhen I took a group picture with everyone, and compared their faces to what I see in real life, theres barely any difference, maybe the face is a little bigger due to the lense of the camera distorting their faces, but beyond that I honestly don't see much difference at all!\n\nIs it true that we look FAR MORE DIFFERENT THAN WHAT WE ACTUALLY LOOK IN THE MIRROR? Or is it just an exaggeration?",
        "created_utc": 1674035432,
        "upvote_ratio": 1.0
    },
    {
        "title": "Quantum connections of genes for lizards with quantum particles relativity relations ...",
        "author": "RasoolFahad",
        "url": "https://www.reddit.com/r/Physics/comments/10f372g/quantum_connections_of_genes_for_lizards_with/",
        "text": "[removed]",
        "created_utc": 1674034269,
        "upvote_ratio": 1.0
    },
    {
        "title": "thoughts?",
        "author": "ConceptConstant1168",
        "url": "https://www.reddit.com/r/Physics/comments/10f2jn2/thoughts/",
        "text": "It seems difficult to deny that distance, as in the distance in space between two objects, and distance, as in the distance travelled or the length of a path taken are profoundly different concepts.\n\nHow do we make this distinction clear?",
        "created_utc": 1674031730,
        "upvote_ratio": 1.0
    },
    {
        "title": "Newton v. coulomb 😵‍💫",
        "author": "ConceptConstant1168",
        "url": "https://i.redd.it/8n2d4q6txsca1.jpg",
        "text": "",
        "created_utc": 1674029712,
        "upvote_ratio": 1.0
    },
    {
        "title": "Rudolf Ortvay Competition",
        "author": "sociopathicbehaviour",
        "url": "https://www.reddit.com/r/Physics/comments/10f016h/rudolf_ortvay_competition/",
        "text": "Anyone who has given the exam as an undergrad? How was the experience, resources used, tips for freshman?",
        "created_utc": 1674022470,
        "upvote_ratio": 1.0
    },
    {
        "title": "Hi r/physics, I have a fluid dynamics question I need help with…",
        "author": "Healthy-Bluebird9357",
        "url": "https://www.reddit.com/r/Physics/comments/10ezuzh/hi_rphysics_i_have_a_fluid_dynamics_question_i/",
        "text": "I am trying to design an instrument which fills a grid consisting of 96 wells with fluid derived from a single source positioned above the wells, either passively using gravity or actively using back pressure. The problem is basically this: if you have units of fluid positioned above 96 wells arranged in a grid (all on the same plane), can you design a pipe or canal system which evenly distributes the fluid such that 2 units is distributed into each well, without using valves or moving pieces whatsoever. \n\nDo you have any ideas about how to approach this problem, and is anybody aware of software which can simulate this system and AI which can generate designs based on given parameters? \n\nThanks for any input.",
        "created_utc": 1674021918,
        "upvote_ratio": 1.0
    },
    {
        "title": "It’s literally as cool as I expected to be.",
        "author": "Backsgh",
        "url": "https://i.redd.it/75y4g6kjcqca1.png",
        "text": "",
        "created_utc": 1674016362,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why the long spring?",
        "author": "TempUsername3369",
        "url": "https://www.reddit.com/r/Physics/comments/10ewkio/why_the_long_spring/",
        "text": "I'm probably overthinking this, but what is the actual difference between let's say a 5\" 8kg spring and a 7\" 8kg spring on auto otive applications? They both travel one inch with 8kg of force, right? So if the strut only has 3 inches of travel, that extra spring length is wasted, right? Is there any sort of benefit to longer/shorter springs at the same strength?",
        "created_utc": 1674012147,
        "upvote_ratio": 1.0
    },
    {
        "title": "4d coin",
        "author": "dinosaursandcavemen",
        "url": "https://www.reddit.com/r/Physics/comments/10ewiyy/4d_coin/",
        "text": "Hi,\n\nWhat would a 4d coin be like? What would be a possible second output of a 4d coin when flipped?",
        "created_utc": 1674012026,
        "upvote_ratio": 1.0
    },
    {
        "title": "what goes up, must come down. with added force?",
        "author": "PhyreTruk",
        "url": "https://www.reddit.com/r/Physics/comments/10evyxj/what_goes_up_must_come_down_with_added_force/",
        "text": "I have an idea of something id like to build, but im uncertain of qhere to begin... So i figured i better try to get some proper terms or slang so i can properly research it. I cant google it because i dont have the knowledge to form a \"Google question\"\n\nWhat i want to do sounds simple enough, or so i thought.\n\nI have a 30 ton bottle jack that i want to use to apply force onto some items. Well use a steel ball for example. To do this id have to have a structure built that can withstand more pressure than the ball can handle, so it remains intact....hard to do when you lack welding skill let alone that much steel.\n\nSo my alternative idea is to build a contraption that allows the bottle jack to apply force upwards, which allows the contraption to use that force, ( or a portion of the force) downawards. That way the earth would be used as the force that surrounds the object....\n\nI may have over explained. Or may jot have veen clear. So heres a super simple picture of what i want to happen.",
        "created_utc": 1674010489,
        "upvote_ratio": 1.0
    },
    {
        "title": "F=ma study resources?",
        "author": "mrmrsgoatman",
        "url": "https://www.reddit.com/r/Physics/comments/10evp4y/fma_study_resources/",
        "text": "I’m currently in high school, taking the f=ma exam in a little less than a month. i’m looking at the blue morin textbook right now, as well as doing problems from old tests. are there any other good resources? especially lecture videos?",
        "created_utc": 1674009705,
        "upvote_ratio": 1.0
    },
    {
        "title": "aspiring physicist- need advice!",
        "author": "brain485",
        "url": "https://www.reddit.com/r/Physics/comments/10eun6t/aspiring_physicist_need_advice/",
        "text": "Hello everyone!\n\nI'm a junior in high school currently, and I'm embarking on my journey into the grand professional world. I've changed my ideal major quite a bit, though I think I'm finally settled with physics. I'm not all too scared of undergrad, I'm asking more so on the career side of things. I'd love to go either into medical physics or design vehicles (planes or cars). I currently live in the US (Dallas), but would love to find work in the UAE or Chicago. I'd love information from people in the industry, or resources to find out more  about those two career choices like job availability, salary etc. I'm also open to other branches in the career world that you would recommend. Another thing I would be interested in is internship opportunities that I can find (experience is enough salary for me) to help expand my portfolio for college apps, scholarships, and others. I appreciate all of the help, thank you!",
        "created_utc": 1674006884,
        "upvote_ratio": 1.0
    },
    {
        "title": "Side project",
        "author": "LakjaaM",
        "url": "https://www.reddit.com/r/Physics/comments/10eqjrk/side_project/",
        "text": "I've worked on a video essay about neutrinos faster than light.\n\nI show u enjoy it!\n\n[https://www.youtube.com/watch?v=\\_cVVtQr4CYw](https://www.youtube.com/watch?v=_cVVtQr4CYw)",
        "created_utc": 1673996598,
        "upvote_ratio": 1.0
    },
    {
        "title": "What would happen if something vanished?",
        "author": "TheNectarineGuy",
        "url": "https://www.reddit.com/r/Physics/comments/10eokwe/what_would_happen_if_something_vanished/",
        "text": "What would happen to the universe if let’s say a coin disappeared/ceased to exist? Would the universe collapse due to missing matter or would it just fill the gap and nothing else will happen?",
        "created_utc": 1673991987,
        "upvote_ratio": 1.0
    },
    {
        "title": "I wrote a book specifically for /r/physics",
        "author": "csferrie",
        "url": "https://www.reddit.com/r/Physics/comments/10enkwp/i_wrote_a_book_specifically_for_rphysics/",
        "text": "8 years ago I posted the first book I wrote here: https://www.reddit.com/r/Physics/comments/1x6yh1/quantum_physics_for_babies_or_get_them_while/. The response is what encouraged me to continue, get it published, and write many more. \n\nIronically, after millions of readers, I discovered that Reddit's demographic is the polar opposite of my audience!\n\nBut today that changes! I wrote a book just for you. It's called \"Quantum Bullsh*t: How to Ruin Your Life With Advice From Quantum Physics\" and it's out today. I hope you enjoy it!",
        "created_utc": 1673989684,
        "upvote_ratio": 1.0
    },
    {
        "title": "Physics argument with my grade 11 physics teacher",
        "author": "YourMumIsADoorStop",
        "url": "https://www.reddit.com/r/Physics/comments/10emx10/physics_argument_with_my_grade_11_physics_teacher/",
        "text": "I was challenging him with one of the test’s theoretical questions which pretty much stated as; \n\nIf you had a frictionless truck going up a hill without any friction, would the power required to reach the top of the hill change if it took less or more time? \n\nI said that it didn’t matter since no matter how long it takes for the truck to climb the hill, it will take the same amount of energy. Sure, if you wanted to climb the hill in a short period of time, then it would require more power every second. But if you went slowly you’d be using less power per second but it would take a longer amount of time to reach the top. At the one of the day, it would use the same net energy. \n\nIt seems the argument is about power vs energy’s respective definitions.",
        "created_utc": 1673988165,
        "upvote_ratio": 1.0
    },
    {
        "title": "Physics Electrostatic Help",
        "author": "Impressive-Fox6401",
        "url": "https://www.reddit.com/r/Physics/comments/10emtpq/physics_electrostatic_help/",
        "text": "",
        "created_utc": 1673987954,
        "upvote_ratio": 1.0
    },
    {
        "title": "Aye I just need help with this junior physics work…. 😭",
        "author": "Inner-Ad-1016",
        "url": "https://i.redd.it/odp20p3hfpca1.jpg",
        "text": "",
        "created_utc": 1673987276,
        "upvote_ratio": 1.0
    },
    {
        "title": "Physicists made Light move Simultaneously Forward and Backward in Time using 'Quantum time flip'",
        "author": "davinci-code",
        "url": "https://www.guardianmag.us/2022/12/physicists-made-light-move.html",
        "text": "",
        "created_utc": 1673986780,
        "upvote_ratio": 1.0
    },
    {
        "title": "Help with STUPID thermodynamics project",
        "author": "Unhappy-Invite5681",
        "url": "https://www.reddit.com/r/Physics/comments/10em11h/help_with_stupid_thermodynamics_project/",
        "text": "Hello,\n\nAs a group of first year physics students we are doing a project where we need to cool down 200ml of water by using 2 steel bicycle pumps (hence STUPID; STUdent Powered Ice Device) and a copper connecting tube as far as possible in 30 mins. The gas being compressed and decompressed is only allowed to be air.\n\nWe were given a simulation (FEM) tool which outputs pressure and wall temperatures of 25 elements dividing the two pumps and tube. \n\nFrom thermodynamic principles we know we need to compress gas, remove heat and decompress it. When we use a 2.5 sec cycle with one pump compressing air, and the other pump decompressing it, the decompression pump walls cool down by 8 degrees Celsius (without water) and the compression pump gets quite warm according to Fem. \n\nProblem is: we build the exact same thing in practice and used the same cycle timings for compression and decompression speed. We know that Fem omits one big factor: friction (of course, why not as physicists). This friction even causes the expansion pump to warm up, wich shouldnt happen according to the Fem simulations. Interesting was, when we measured wall temperatures on various places around the expansion pump and connecting tube with thermocouples, we observed that the connection tube at the expansion pump side cools down by about 5 degrees Celsius. According to Fem, this shouldn't happen. We tried to place the water around this part of the connection tube, but the surface of this tube (only 6mm in diameter vs 30mm of the pump) is not sufficient to get significant cooling. \n\nSlower cycles result in less heat around the expansion pump (it stays constant)  we observed, but it causes less cooling with water around the tube. We know a group of last year achieved a cooling of 4 degrees Celsius after 30 mins, but we are at 0.5 degrees max right now. \n\nWe investigated how to get the hot sides cool down more (placing water reservoirs around them ) but didn't look into good cycle timings unfortunately. According to Fem, the faster a cycle is completed, the better the cooling is, but we know there is also an advantage of slow expansion: the gas will perform more work by pushing our Body weight up compared to rapid, non quasistatic expansion. \n\n\nAt this point we don't really know where to make real improvements, especially regarding the cycle timings of compression and decompression, so all of your input is welcome! \n\nWhen you need any additional information, please ask.",
        "created_utc": 1673986103,
        "upvote_ratio": 1.0
    },
    {
        "title": "What formula should I use: when I swipe fast, it will scroll faster, or when I swipe slow, it will scroll slowly like this?",
        "author": "Lumnu",
        "url": "https://v.redd.it/qcx6zu92jnca1",
        "text": "",
        "created_utc": 1673982238,
        "upvote_ratio": 1.0
    },
    {
        "title": "What does this mean",
        "author": "Additional-Relief-76",
        "url": "https://www.reddit.com/r/Physics/comments/10ek9tf/what_does_this_mean/",
        "text": "When Nikola Tesla said \" The day science begins to study non-physical phenomena, it will make more progress in one decade than in all the previous centuries of its existence\".What does this mean ,and how would win start.",
        "created_utc": 1673982021,
        "upvote_ratio": 1.0
    },
    {
        "title": "For school I am doing a project where we research and investigate something physics related (could be building something like a camera obscura etc.). Does anyone have any ideas? We have a budget of a couple hundred pounds and is of a level or slightly further difficulty.",
        "author": "Loud_Opportunity8349",
        "url": "https://www.reddit.com/r/Physics/comments/10ek8i2/for_school_i_am_doing_a_project_where_we_research/",
        "text": "",
        "created_utc": 1673981953,
        "upvote_ratio": 1.0
    },
    {
        "title": "Turn off the TV and Radio",
        "author": "Novel_Finger2370",
        "url": "https://www.reddit.com/r/Physics/comments/10ejcj4/turn_off_the_tv_and_radio/",
        "text": "&amp;#x200B;\n\nhttps://preview.redd.it/tcfokgtybnca1.png?width=640&amp;format=png&amp;auto=webp&amp;v=enabled&amp;s=bd01cf8b80555eb78d6e9edcbe4774eee7fdcc37",
        "created_utc": 1673979842,
        "upvote_ratio": 1.0
    },
    {
        "title": "What books would you recommend for someone who wants to learn more about the concepts in physics?",
        "author": "charley_warlzz",
        "url": "https://www.reddit.com/r/Physics/comments/10eix7v/what_books_would_you_recommend_for_someone_who/",
        "text": "This is just a soft question, and I’m not sure if this is the right sub, but i figured i’d try. My grandfather has been looking into trying to spend his free time learning stuff, and since I’m currently doing a Physics/Astrophysics degree, he wanted to look through some of my books. The only problem is we dont really use textbooks or have assigned reading on my course, and most of the resources i *am* aware of are about undergratuate maths. \n\nSo, I figured I’d ask here if anyone knew of any good books that would help/work for someone at an entry level to physics that he could look at (and i could peak at, lol).",
        "created_utc": 1673978845,
        "upvote_ratio": 1.0
    },
    {
        "title": "How long does a 12 volt 1.3 Ah battery power a 12 volt motor that a person put on a bicycle to spin the tire?",
        "author": "pizza_4_all_",
        "url": "https://www.reddit.com/r/Physics/comments/10ehw41/how_long_does_a_12_volt_13_ah_battery_power_a_12/",
        "text": "How long does a 12 volt 1.3 Ah battery power a 12 volt motor that a person put on a bicycle to spin the tire?",
        "created_utc": 1673976418,
        "upvote_ratio": 1.0
    },
    {
        "title": "Flashes on the Sun Could Help Scientists Predict Solar Flares",
        "author": "Galileos_grandson",
        "url": "https://www.nasa.gov/feature/goddard/2023/sun/flashes-on-the-sun-could-help-scientists-predict-solar-flares",
        "text": "",
        "created_utc": 1673976018,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why did it need the famous eclipse experiment to prove Einstein's theory of general relativity?",
        "author": "Rainmakerrrrr",
        "url": "https://www.reddit.com/r/Physics/comments/10ehgeg/why_did_it_need_the_famous_eclipse_experiment_to/",
        "text": "&amp;#x200B;\n\nhttps://preview.redd.it/2lpi71f4xmca1.png?width=848&amp;format=png&amp;auto=webp&amp;v=enabled&amp;s=f1a1b7ab23fa64ff81bc5d7ab419f27d133aaa79\n\nThis is the experiment I am refering to. \n\nFirstly a generic question: a) Why did it need a solar elcipse? In order to spectate the universe behind the sun which would have not been possible since the sun shines too bright?\n\nb)  if a) is true the following question might not be able to answer, but: If we imagine the acutal location fo the star moving in the directio of the apprant location of the star. And Earth rotating clockwise around the sun. Shouldnt in these cirumstances the apparant location of the start seem to \"stand still in space\" or at least \"move unnaturally slow\" until apprant location and actual location finally aligne?\n\nc) Was there never such case observed before? Or is a) the problem again?",
        "created_utc": 1673975377,
        "upvote_ratio": 1.0
    },
    {
        "title": "I found the Best Explanation on Electromagnetism!",
        "author": "chears2surfers",
        "url": "http://shorturl.at/gIXY3",
        "text": "",
        "created_utc": 1673974248,
        "upvote_ratio": 1.0
    },
    {
        "title": "First Demonstration of Energy Teleportation",
        "author": "ChickenTitilater",
        "url": "https://www.discovermagazine.com/the-sciences/first-demonstration-of-energy-teleportation",
        "text": "",
        "created_utc": 1673973648,
        "upvote_ratio": 1.0
    },
    {
        "title": "Need some help choosing where to do a masters program",
        "author": "IFeelKindaFreeeeee",
        "url": "https://www.reddit.com/r/Physics/comments/10ege64/need_some_help_choosing_where_to_do_a_masters/",
        "text": "I'm currently in the final year of a theoretical physics degree in Ireland (expecting to graduate with a first), and I'm looking to apply to masters programs. My ultimate goal is to do a PhD, and while I would be happy to go straight into a PhD this year, a lot of the applications list a masters degree as a requirement, and those that don't didn't appeal to me. I also want to do a masters simply because I find physics really interesting and want to take some higher level courses.  \nSo far, I've narrowed the choice down to 4 options (but I am open to others):  \ni) University of Edinburgh Theoretical Physics MSc  \nii) Oxford MSc in Mathematical and Theoretical Physics  \niii) Cambridge MAst or MPhil in physics  \niv) Perimeter Institute PSI Masters program  \nI will likely apply to all of these, but hypothetically which would you recommend?  \nI would like to be able to do a dissertation (or at least have the option), and this is where the Cambridge program loses value for me, since I can either do a taught degree with no dissertation or a research degree but not both. I'm not big into the usual student social life so that isn't a huge issue for me in choosing where to study. Some manner of funding would also be nice but not strictly necessary.  \nAny help here would be hugely appreciated.",
        "created_utc": 1673972806,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can anyone tell me if the equations in the background are real or gibberish, please?",
        "author": "NykNak",
        "url": "https://i.redd.it/gllp3hfeqmca1.jpg",
        "text": "",
        "created_utc": 1673972616,
        "upvote_ratio": 1.0
    },
    {
        "title": "An Idea About The Arrow Of Time",
        "author": "jinx420666",
        "url": "https://www.reddit.com/r/Physics/comments/10ef43v/an_idea_about_the_arrow_of_time/",
        "text": "I had a thought  yesterday about time.  Instead of entropy  could the arrow of time be caused by the expansion of space?",
        "created_utc": 1673969612,
        "upvote_ratio": 1.0
    },
    {
        "title": "Calculating the mass of a lever.",
        "author": "spl0x",
        "url": "https://www.reddit.com/r/Physics/comments/10ef0sd/calculating_the_mass_of_a_lever/",
        "text": "The main point of this task was to use the Moment of a Force formula and the extra task is to calculate the mass of the lever used in this experiment still using Torque. But unfortunately I was unable to gather the needed measurements. \n\nThis is an example of the lever used in the experiment. Only F1 and F4 were used.\n\n[The contraption used to gather the data.](https://preview.redd.it/2ge4w0osgmca1.jpg?width=1728&amp;format=pjpg&amp;auto=webp&amp;v=enabled&amp;s=84eb31ed510098a8a626ee54b61681ae1dc903b4)\n\nSo now I'm wondering if its possible, using the already gathered data, to calculate the mass of the lever itself (not including the weights). The lever itself was about 40 cm long. The hanging constant weights did split the lever down the middle.\n\n&amp;#x200B;\n\nThis is all the data I have currently.\n\n[Calculations.](https://preview.redd.it/lshxr6isgmca1.jpg?width=3023&amp;format=pjpg&amp;auto=webp&amp;v=enabled&amp;s=2976594edff77144a1042c6811fada89d7e1922e)\n\n&amp;#x200B;\n\nCurrently in need of help. Will appreciate any response.",
        "created_utc": 1673969392,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can it be true? Or it’s just fake???",
        "author": "Fearless-Rest-1271",
        "url": "https://acrobat.adobe.com/link/track?uri=urn:aaid:scds:US:539f6f1b-f808-4345-bb31-42ab191ca622",
        "text": "",
        "created_utc": 1673968431,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can space-time exist without matter or energy within it?",
        "author": "Busy-Ad6502",
        "url": "https://www.reddit.com/r/Physics/comments/10eee0v/can_spacetime_exist_without_matter_or_energy/",
        "text": "I've been curious about this question and I found this answer: [https://einstein.stanford.edu/content/relativity/a11332.html](https://einstein.stanford.edu/content/relativity/a11332.html) which states:\n\n*\"No. Experiments continue to show that there is no 'space' that stands apart from space-time itself...no arena in which matter, energy and gravity operate which is not affected by matter, energy and gravity.* ***General relativity tells us that what we call space is just another feature of the gravitational field of the universe, so space and space-time can and do not exist apart from the matter and energy that creates the gravitational field. This is not speculation, but sound observation.\"***\n\nIt seems to come from a credible source, but the author doesn't elaborate the rationale, physics or math behind it.  Naturally, I'm aware that matter and energy bend affect space-time as I thought space-time was like an independent fabric that is warped by matter/energy.  However, the statement in bold states that space-time needs matter and energy to exist and that space-time is dependent on the gravitational field that the matter creates.  If you know of any websites that elaborate on this, I would greatly appreciate it.",
        "created_utc": 1673967760,
        "upvote_ratio": 1.0
    },
    {
        "title": "What would the kinetic energy of mars be both at perihelion and aphelion based on this data ? I know the equation is 1/2 mass x speed ^2 but I still can’t work it out",
        "author": "Short_Prompt692",
        "url": "https://i.redd.it/onxaetgklnca1.jpg",
        "text": "",
        "created_utc": 1673965085,
        "upvote_ratio": 1.0
    },
    {
        "title": "What would the kinetic energy of Mars be at aphelion and perihelion based on this data table ?",
        "author": "Short_Prompt692",
        "url": "https://i.redd.it/p38cgnh7lnca1.jpg",
        "text": "",
        "created_utc": 1673964952,
        "upvote_ratio": 1.0
    },
    {
        "title": "i am overjoyed because of this",
        "author": "[deleted]",
        "url": "",
        "text": "[removed]",
        "created_utc": 1673964743,
        "upvote_ratio": 1.0
    },
    {
        "title": "What would the kinetic energy of mars be based on this data ? I know the equation is kinetic energy = 1/2mass x speed^2 but I still can’t work it out",
        "author": "Short_Prompt692",
        "url": "https://i.redd.it/r6lghaeginca1.jpg",
        "text": "",
        "created_utc": 1673964022,
        "upvote_ratio": 1.0
    },
    {
        "title": "Physics Questions - Weekly Discussion Thread - January 17, 2023",
        "author": "AutoModerator",
        "url": "https://www.reddit.com/r/Physics/comments/10ecy42/physics_questions_weekly_discussion_thread/",
        "text": "This thread is a dedicated thread for you to ask and answer questions about concepts in physics.\n\nHomework problems or specific calculations may be removed by the moderators. We ask that you post these in /r/AskPhysics or /r/HomeworkHelp instead.\n\nIf you find your question isn't answered here, or cannot wait for the next thread, please also try /r/AskScience and /r/AskPhysics.",
        "created_utc": 1673964012,
        "upvote_ratio": 1.0
    },
    {
        "title": "Help",
        "author": "AdvertisingSilver908",
        "url": "https://i.redd.it/gq3b9103ymca1.jpg",
        "text": "",
        "created_utc": 1673957165,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does anyone know the answer to this",
        "author": "Individual-Sir9004",
        "url": "https://i.redd.it/4jgpetvk9lca1.png",
        "text": "",
        "created_utc": 1673954822,
        "upvote_ratio": 1.0
    },
    {
        "title": "Good day, I have a question for my finals research",
        "author": "Shhioiii",
        "url": "https://www.reddit.com/r/Physics/comments/10e8fmn/good_day_i_have_a_question_for_my_finals_research/",
        "text": "What is it like being a physicist? What is it like studying physics for a career? Is it really hard to be a physicist like others see in media?\n\nI'm sorry for some basic questions but I have to make my own questions for this research.\n\"Interview someone that's currently in a higher position or a job you're interested in in the future?\"",
        "created_utc": 1673949182,
        "upvote_ratio": 1.0
    },
    {
        "title": "This scientific news is creating a shock wave. https://www.digitaljournal.com/pr/is-everything-known-about-shape-and-size-of-the-universe-and-how-it-works-wrong",
        "author": "PhysicsWalla",
        "url": "https://www.reddit.com/r/Physics/comments/10e70fv/this_scientific_news_is_creating_a_shock_wave/",
        "text": "",
        "created_utc": 1673943875,
        "upvote_ratio": 1.0
    },
    {
        "title": "About nuclear explosions.",
        "author": "AndiNOTFROMTOYSTORY",
        "url": "https://www.reddit.com/r/Physics/comments/10e6pmv/about_nuclear_explosions/",
        "text": "Nuclear explosions cone from splitting the atoms of uranium right and the splitting of the atoms is what causes the energy right? So if other atoms such as oxygen were to be split would it cause the explosion but not the radiation?",
        "created_utc": 1673942726,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to find an angle my teacher said that it was 60 degree angle",
        "author": "Coraxon1245",
        "url": "https://i.redd.it/5faitkht5lca1.jpg",
        "text": "",
        "created_utc": 1673935552,
        "upvote_ratio": 1.0
    },
    {
        "title": "How does one create calorimetry graphs like these? I've been trying to do it on Excel and other online software but I just cannot find how to make it like this. Any help would be great.",
        "author": "Civil_Boss2290",
        "url": "https://i.redd.it/k39bm2uguica1.png",
        "text": "",
        "created_utc": 1673925523,
        "upvote_ratio": 1.0
    },
    {
        "title": "I had a physics/philosophy chat with GPT today. Any and all discussion is welcome.",
        "author": "IllVeterinarian3387",
        "url": "https://www.reddit.com/r/Physics/comments/10dzi2g/i_had_a_physicsphilosophy_chat_with_gpt_today_any/",
        "text": "[removed]",
        "created_utc": 1673920461,
        "upvote_ratio": 1.0
    },
    {
        "title": "Ice propulsion",
        "author": "Gloomy-Tip-6658",
        "url": "https://www.reddit.com/r/Physics/comments/10dyjd0/ice_propulsion/",
        "text": "If I had a huge ship filled with ice (usable areas inside the center of the ice) , built of a material that transfers heat very well, with a huge nozzel at the rear of the ship, could I fly it into the suns corona and use the heat transfer to turn the ice into fuel? Like a giant bottle rocket?",
        "created_utc": 1673917880,
        "upvote_ratio": 1.0
    },
    {
        "title": "if you agree with the multiverse theory..",
        "author": "Shinova64uni",
        "url": "https://www.reddit.com/r/Physics/comments/10dx5z5/if_you_agree_with_the_multiverse_theory/",
        "text": "[removed]",
        "created_utc": 1673914281,
        "upvote_ratio": 1.0
    },
    {
        "title": "Advice for a First year master student in need of help",
        "author": "thanath0s_99",
        "url": "https://www.reddit.com/r/Physics/comments/10dwfyv/advice_for_a_first_year_master_student_in_need_of/",
        "text": "Hello people of Reddit\n\nI am a physics student who is in his first year of master degree (3 + 2 system). I'm writing in order to receive some advice or maybe to hear from someone who was in my current situation and managed to get over it. \n\nIn order to pursuemy studies I've transferred to another country upon the completion of my bachelor degree. My problem is that ,although many sacrifices and my hard work, my bachelor degree didn't fully prepare me for the road ahead, what I mean by that is that even though in my previous university the programs were aligned with the admission's requirement for my new university, almost every course I had was very poor on the applicative side of things. To be more explicit: I've studied things like Fourier transform and complex analysis, in the second semester of my second year, but after that course we never had to apply those concepts on our own again, leaving them as a merely theoric notion (admittedly my course in higher mathematics was also very poorly taught, and what welearned was sufficient at best). Moreover in my home country we do not have weekly homeworks, and many of our courses were only based on an oral exam without any exercise whatsover.\n\nMoreover I often find that during classes many details and minutiae completely fly over my head, or that many pointsput forward by my peers to the lecturer are completely unintelligible for me, and that I've to spend extra time after class in order to understand what problem they were actually referring to.  Now in my current university homeworks play an important role for every exam. Although I manage to meet the minimumscore requirement (this is also thanks to the help my collegues who are far more kwnoledgable and smarter than me) I am notas proficient as I would like to be. I have to spend every single moment of my time studying in order to feel at least'adequate', and I've realized that I'm a lot slower than my peers in doing and understanding things, and also thatmany times the solution I propose for the exercises are completly wrong or inelegant. \n\nNow in my next semester I should already looking for a thesis topic to purse, but I don't feel to be ready for sucha task in the slightest. I'm trying to spend extra time and effort each day in order to get rid of my deficencies,but it's extremely hard with all the work I already have to do to be on top of the material.I also don't hang outor engage in any type of recreational activity outside the university (I only exercise at home in order to keepmyself fit) and I'm always trying to optimize my daily routine in order to study even more. \n\nI really don't know what to do at this point, I would like to pause and take care of my deficiencies,learn the local language and do something else outside studying (as a side note since the it is since the bachelor degreethat I've made many sacrifices in order to be able to get high grades, graduate on time, learn English for my master, and be able to purse my studies abroad, so in a certain sense this situation is starting to weight on me) but at the same timeI don't want to ask my parent to mantain me in a foreign country for more time than is strictly needed, and I wouldfeel guilty for that.Moreover I am afraid that If I won't be able to graduate on time I would be looked at badly.So I would like to ask you if you had similar experience, and how did you get through it. Thanks everybody for reading, I relly appreciate that.\n\nI wish you a good day, and better physics!",
        "created_utc": 1673912513,
        "upvote_ratio": 1.0
    },
    {
        "title": "Hypothetical: Is reversing a regular window air conditioner to pump the exhaust heat into your home more efficent than using an electric resistance heater during the winter to heat your home?",
        "author": "Intranetusa",
        "url": "https://www.reddit.com/r/Physics/comments/10dvcaa/hypothetical_is_reversing_a_regular_window_air/",
        "text": "My hypothetical is that if you have a regular window AC (without heating-reverse cycling ability), can you reverse the orientation (the panel side facing outwards and the exhaust side facing inwards into your home) and turn it on via panels or remote and use it as a heat pump to \n\nWould this be more efficent than using an electric resistance heater  in terms of Kwh to produce heat inside your home? \n\nNote: I know that dual heating/cooling reverse cycling ACs exist. Let's use a regular AC without this ability for this hypothetical. Let's assume I don't care about the potential condensation dripping from the AC coils either.",
        "created_utc": 1673909929,
        "upvote_ratio": 1.0
    },
    {
        "title": "Would high school physics students be interested in another textbook/resource?",
        "author": "FortitudeWisdom",
        "url": "https://www.reddit.com/r/Physics/comments/10dv690/would_high_school_physics_students_be_interested/",
        "text": "I've been considering writing a physics textbook and I'd finally be able to start later this year. Do high school physics students feel they have enough resources already or would you benefit from another one?\n\nSome things about the textbook... it would cover classical mechanics, electricity and magnetism, thermodynamics, quantum mechanics, and astrophysics. It would be free. It would be algebra-based.",
        "created_utc": 1673909520,
        "upvote_ratio": 1.0
    },
    {
        "title": "Scientists steer lightning bolts with lasers for the first time | Physics",
        "author": "ihthisham4me2",
        "url": "https://www.theguardian.com/science/2023/jan/16/scientists-steer-lightning-bolts-with-lasers-for-the-first-time?CMP=share_btn_link",
        "text": "",
        "created_utc": 1673909241,
        "upvote_ratio": 1.0
    },
    {
        "title": "Splitting the atomic scientists: how the Ukraine war ruined physics",
        "author": "42Raptor42",
        "url": "https://www.theguardian.com/science/2023/jan/15/scientists-ukraine-war-cern-physics-large-hadron-collider",
        "text": "",
        "created_utc": 1673908942,
        "upvote_ratio": 1.0
    },
    {
        "title": "Friendly reminder that we still don't know if QM is probabilistic or deterministic, and that nature of 'randomness' in QM is interpretation-dependent.",
        "author": "Individual-Sir9004",
        "url": "https://i.redd.it/ilt8ajd9chca1.png",
        "text": "",
        "created_utc": 1673907293,
        "upvote_ratio": 1.0
    },
    {
        "title": "Quantum Technology research project ideas suitable for an undergrad",
        "author": "mridul17109149",
        "url": "https://www.reddit.com/r/Physics/comments/10dt815/quantum_technology_research_project_ideas/",
        "text": "I am a third year physics major looking to do some summer research on Quantum Technology. I want to pursue this domain in grad school so I thought it was best to familiarize myself with it from as early as I can. I have a supervisor who is a prof at my university who is meant to guide me and give me ideas but he is very hard to get a hold of and we haven’t even had the chance to have a single proper communication even once. \n\nMy knowledge level isn’t too great, just what you would expect of an undergrad at my level, I have taken a Quantum Mechanics class, I am familiar with the general notions of Quantum Computing and Quantum Information through my own personal study. My coding skills are intermediate and nothing spectacular. But I am very enthusiastic and am willing to learn as much as I possibly can. I am really looking forward to engage myself with valuable research. Any ideas regarding what I could do would be immensely helpful.\n\nI have thought simulating  shor’s algorithm so far. Any other ideas would be deeply appreciated. Thanks 🙏",
        "created_utc": 1673905347,
        "upvote_ratio": 1.0
    },
    {
        "title": "\"Quantum 101 with Katie Mack\" (Trailer)",
        "author": "collywog",
        "url": "https://youtu.be/Xt1hO7YvNx0",
        "text": "",
        "created_utc": 1673904816,
        "upvote_ratio": 1.0
    },
    {
        "title": "what are some if the best books on general relativity for beginners?",
        "author": "LukeYourGuy",
        "url": "https://www.reddit.com/r/Physics/comments/10dry90/what_are_some_if_the_best_books_on_general/",
        "text": "",
        "created_utc": 1673903203,
        "upvote_ratio": 1.0
    },
    {
        "title": "Multiplied Units",
        "author": "Flaplexalender",
        "url": "https://www.reddit.com/r/Physics/comments/10dpni0/multiplied_units/",
        "text": "It's easy to visualize divided units. It seems more difficult for units when they are multiplied. For example, Kg\\*m is mass acted over a meter? Joules are kg\\*m\\^2/s\\^2. Does this mean that mass is accelerated over an area? What would that look like?",
        "created_utc": 1673898994,
        "upvote_ratio": 1.0
    },
    {
        "title": "not sure if this is for the physics sub but what is stopping me from flying when i’m pulling a chair on the ground up while i’m on it",
        "author": "disid222",
        "url": "https://i.redd.it/no2w5pr90ica1.jpg",
        "text": "",
        "created_utc": 1673897364,
        "upvote_ratio": 1.0
    },
    {
        "title": "Student looking for guidance in making a simulation",
        "author": "1234567890lmao",
        "url": "https://www.reddit.com/r/Physics/comments/10dom0a/student_looking_for_guidance_in_making_a/",
        "text": "[removed]",
        "created_utc": 1673896574,
        "upvote_ratio": 1.0
    },
    {
        "title": "First demonstration of technique using laser to guide lightning, that focused a laser beam at a spot around 150 metres in the air atop Swiss mountain",
        "author": "marketrent",
        "url": "https://www.rfi.fr/en/science-environment/20230116-scientists-use-laser-to-guide-lightning-bolt-for-first-time",
        "text": "",
        "created_utc": 1673896027,
        "upvote_ratio": 1.0
    },
    {
        "title": "electric field always perpendicular to equipotentialbsurface",
        "author": "Rakeshjonty",
        "url": "https://youtube.com/shorts/pgUQfFMSDWs?feature=share",
        "text": "",
        "created_utc": 1673894554,
        "upvote_ratio": 1.0
    },
    {
        "title": "Stupid Funny Video about Black Holes",
        "author": "danado807",
        "url": "https://v.redd.it/yg8wa9zy4gca1",
        "text": "",
        "created_utc": 1673892868,
        "upvote_ratio": 1.0
    },
    {
        "title": "😤",
        "author": "Popular-Discount8815",
        "url": "https://i.redd.it/46r640fq2gca1.jpg",
        "text": "",
        "created_utc": 1673891982,
        "upvote_ratio": 1.0
    },
    {
        "title": "[High school physics]. How do I solve this.",
        "author": "priyanshu200",
        "url": "https://i.redd.it/uvw0cve4khca1.png",
        "text": "",
        "created_utc": 1673891949,
        "upvote_ratio": 1.0
    },
    {
        "title": "Stupid Funny Video about Black Holes",
        "author": "danado807",
        "url": "https://v.redd.it/64sn7oee0gca1",
        "text": "",
        "created_utc": 1673891275,
        "upvote_ratio": 1.0
    },
    {
        "title": "Have we established that something that is intangible cannot apply force no matter how insignificant?",
        "author": "RestoredBrake47",
        "url": "https://www.reddit.com/r/Physics/comments/10dksey/have_we_established_that_something_that_is/",
        "text": "",
        "created_utc": 1673889748,
        "upvote_ratio": 0.99
    },
    {
        "title": "Calculate sun energy in a given point and day?",
        "author": "EggplantSudden1116",
        "url": "https://www.reddit.com/r/Physics/comments/10dkl35/calculate_sun_energy_in_a_given_point_and_day/",
        "text": "Is it possible to know approximately how much energy the sun radiated in a given point on earth based on the weather forecast? For instance, I wanna know how much energy the sun emitted in NYC on Jan 15th 2023. Is it possible?",
        "created_utc": 1673889455,
        "upvote_ratio": 1.0
    },
    {
        "title": "Future ways of detecting black holes?",
        "author": "Connn_96",
        "url": "https://www.reddit.com/r/Physics/comments/10djs68/future_ways_of_detecting_black_holes/",
        "text": "I was asked this question by a freind of mine and I didn't have the answer, does anyone have any interesting ideas/theories?",
        "created_utc": 1673888298,
        "upvote_ratio": 1.0
    },
    {
        "title": "How long till my tea is room temperature?",
        "author": "mainamedoesntmatter",
        "url": "https://www.reddit.com/r/Physics/comments/10dhg9j/how_long_till_my_tea_is_room_temperature/",
        "text": "I've just boiled 1.5 liters of water. I'm sure there is a way of knowing how it'll take for the water to reach room temperature ( equation?), but i don't know how to.\n\nCan I get some help please?",
        "created_utc": 1673883113,
        "upvote_ratio": 1.0
    },
    {
        "title": "Série d'exercices RLC forcé avce correction",
        "author": "resume_bac2023",
        "url": "https://touneselyaoumm.blogspot.com/2023/01/serie-dexercices-rlc-force-avce.html",
        "text": "",
        "created_utc": 1673878732,
        "upvote_ratio": 1.0
    },
    {
        "title": "When can I drink my coffee? When should I add my milk? A simple model :)",
        "author": "TheoreticalOwl",
        "url": "https://www.desmos.com/calculator/evqmp0iset",
        "text": "",
        "created_utc": 1673877959,
        "upvote_ratio": 1.0
    },
    {
        "title": "What are you working on? - Weekly Discussion Thread - January 16, 2023",
        "author": "AutoModerator",
        "url": "https://www.reddit.com/r/Physics/comments/10df92p/what_are_you_working_on_weekly_discussion_thread/",
        "text": "Hello /r/Physics.\n\nIt's everyone's favorite day of the week, again. Time to share (or rant about) how your research/work/studying is going and what you're working on this week.",
        "created_utc": 1673877609,
        "upvote_ratio": 1.0
    },
    {
        "title": "Open or Close ?, just for fun",
        "author": "ThunderA_Sword",
        "url": "https://i.redd.it/w5urw03dbgca1.jpg",
        "text": "",
        "created_utc": 1673876882,
        "upvote_ratio": 1.0
    },
    {
        "title": "Atomic question",
        "author": "Acceptable-Trade-132",
        "url": "https://www.reddit.com/r/Physics/comments/10dex2i/atomic_question/",
        "text": "Do atoms have electro-magnetic fields?",
        "created_utc": 1673876711,
        "upvote_ratio": 1.0
    },
    {
        "title": "How were Mitchell and Laplace able to theorise the existence of black holes (independently) when Newton's law of Gravitation is applicable only for masses?",
        "author": "PrasoonJha5",
        "url": "https://www.reddit.com/r/Physics/comments/10ddokg/how_were_mitchell_and_laplace_able_to_theorise/",
        "text": "In 1783, Reverend John Mitchell proposed the existence of what he called dark stars (and now we call black holes). In 1796 (I think), the great French physicist Pierre-Simon Laplace came to the same result. Both argued for bodies so massive that light would not be able to escape them. The idea ofcourse was not be accepted and black holes had to be rediscovered in the 20th Century.\nNow I wonder, how these two men were able to predict black holes' existence with merely Newton's law of Gravitation? Newton's law works only for masses but light does not have mass (atleast not in Classical Physics) then how did Mitchell and Laplace perform such a spot on prediction?",
        "created_utc": 1673873168,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why isn't quantum gravity formulated as an interaction between mass and spacetime, rather than between masses?",
        "author": "TerranIV",
        "url": "https://www.reddit.com/r/Physics/comments/10dcu5n/why_isnt_quantum_gravity_formulated_as_an/",
        "text": "Einstein showed (via general relativity) that spacetime is curved by  mass and then mass moves in relation to this curvature. Gravitation only arises as a secondary effect of the curved spacetime paths. Why then are we looking for quantum gravity as a mass&lt;-&gt;mass interaction? Wouldn't the fundamental interactions better thought of as between mass and spacetime (i.e. mass&lt;-&gt;spacetime&lt;-&gt;mass)?\n\nIf gravitation is no more fundamental than the  centripetal force, why are we looking for a quantum form of gravity? Wouldn't the quantum interaction be momentum or impulse?",
        "created_utc": 1673870533,
        "upvote_ratio": 1.0
    },
    {
        "title": "Could you make a perpetual motion machine by using Bismuth and magnets",
        "author": "Competitive-Delay564",
        "url": "https://www.reddit.com/r/Physics/comments/10dcdz4/could_you_make_a_perpetual_motion_machine_by/",
        "text": "I was sat up the other night with this idea going through my head that if you place a magnet on top of bismuth with a hole in the centre and place another magnet Into said hole The centre magnet will levitate and spin could there be any way to transfer the energy from the spinning magnet into power. \n\n\n\nI would just like to add I am not a physicist and I was just curious about this idea and would like to know if there is any flaws to this.\n\nthank you kindly",
        "created_utc": 1673869064,
        "upvote_ratio": 1.0
    },
    {
        "title": "hello everyone, I am a new student in university and I like to know how the physics 1 exam can be like how is the question and what the mistakes did the older student fell into or if he have a physics online course it would be great",
        "author": "JumpyBake6143",
        "url": "https://www.reddit.com/r/Physics/comments/10dc400/hello_everyone_i_am_a_new_student_in_university/",
        "text": "",
        "created_utc": 1673868103,
        "upvote_ratio": 1.0
    },
    {
        "title": "People pressuring you about Jackson’s Electrodynamics being hard when this mf exists…",
        "author": "i_llama123",
        "url": "https://i.redd.it/5vomiu4aefca1.jpg",
        "text": "",
        "created_utc": 1673865755,
        "upvote_ratio": 1.0
    },
    {
        "title": "Feynman's math techniques and shortcuts",
        "author": "usmleman",
        "url": "https://www.reddit.com/r/Physics/comments/10daqhb/feynmans_math_techniques_and_shortcuts/",
        "text": "Feynman has mentioned many times about how using shortcuts and some \"tools\" helped him solve math faster - sometimes even skipping the calculation. \n\nIs there a book that educates people on such tools? Has Feynman ever wrote or mentioned books written by other authors on this matter? Is there a website/course on such visualization techniques?",
        "created_utc": 1673863169,
        "upvote_ratio": 1.0
    },
    {
        "title": "Project about grid based real time Physics Simulation (pixelPhysics), can be run in web Browser",
        "author": "photon_cruncher",
        "url": "https://v.redd.it/6m2yenngddca1",
        "text": "",
        "created_utc": 1673860016,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does this Malcolm Bendall new so-called free energy technology have a future??? - Molten Sea Ark Atomic Reconstruction Technology (MSAART) Strike Open Source Research — STRIKE FOUNDATION GUARANTEE LIMITED",
        "author": "Tichmazg",
        "url": "https://www.strikefoundation.earth/open-source-research",
        "text": "",
        "created_utc": 1673857538,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is Polish Journal of Science Legit?",
        "author": "inforcrypto",
        "url": "https://www.reddit.com/r/Physics/comments/10d91g3/is_polish_journal_of_science_legit/",
        "text": "Hi\n\nMy brother who is a undergrad student of physics is trying to submit a paper and his paper was accepted at [Polish Journal of Science](https://www.poljs.com/contacts/) and they are asking for payment. I understand its a low impact journal which is fine but I am not sure if this Journal is actually legit. Can someone please confirm if this is a legit Journal and basically not a scam? Thanks",
        "created_utc": 1673856758,
        "upvote_ratio": 1.0
    },
    {
        "title": "I feel like this will end up being a brain fart but - why is it Cos(65)? If Tvertical is A , I thought it’d be Sin(65) *opp/hyp* idk :/",
        "author": "wooperdo",
        "url": "https://i.redd.it/qxsjif74geca1.jpg",
        "text": "",
        "created_utc": 1673854265,
        "upvote_ratio": 1.0
    },
    {
        "title": "A Question About Entropy",
        "author": "Dazzling_Neck9369",
        "url": "https://www.reddit.com/r/Physics/comments/10d8bmm/a_question_about_entropy/",
        "text": "One way to look at entropy is that eventually all the energy in the universe will evenly spread out thus creating a total disorder. But on the other hand, the universe is also expanding. If the universe is expanding, will the universe ever be in total disorder? what is the rate of increase in entropy and is it greater than the rate of expansion of the universe?",
        "created_utc": 1673854204,
        "upvote_ratio": 1.0
    },
    {
        "title": "What are some good physics books to make on from noob to pro.",
        "author": "BornYoghurt8710",
        "url": "https://www.reddit.com/r/Physics/comments/10d7uxx/what_are_some_good_physics_books_to_make_on_from/",
        "text": "I am looking for recommended leads:\n\nIm inspired by Elon musk how he studies things outside of his field.",
        "created_utc": 1673852557,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is Quantum physics junk science?",
        "author": "trollingguru",
        "url": "https://www.reddit.com/r/Physics/comments/10d76e8/is_quantum_physics_junk_science/",
        "text": "Now before I get beaten down by people and their assumptions of my question. I would say first that I have knowledge of this subject matter. HOWEVER! It seems to me that physicists have over invested in the theory. And are providing erroneous or just outright junk information and conclusions. \n\nThe theory has not produced any relative substance maybe some conceptual ideas in transistors like quantum tunneling. Or we can predict or explain some effects of electromagnetism. \n\nBut that’s it. \n\nThis theory seems to be a hindrance on scientific progress. \n\nMostly due to the incorporation as quantum physics as fundamental reality. \n\nSchrodengers thought experiment, with a cat proves the absurd inconsistencies in the output of the equations, however I believe this has more to do with hilberts decidability problem in mathematics. \n\nThe real fun has come with the supposed higs boson particle that governments spent 10 billion dollars to find. Which is very questionable. But that aside they have still found no use for the machine. Expensive junk\n\nQuantum gravity sounds absurd and like patchwork to make the theory work with other theories. We don’t even understand real gravity but we have quantum gravity? \n\nQuantum computers are also supposed to use superposition? To defy the computation of regular computers by supernatural means?   How do you prove superposition even exist? The literature used to prove this doesn’t make sense. And the language to describe superposition is misleading.  Billions of dollars of funding to quantum computers to make a expensive paper weight with excuses.\n\nNuclear fusion is no better. As we hear promises of fusion reactions that seem defy intuition or has some supernatural elements  creating enormous energy with a small amount of an element? Doesn’t this violate the law of conservation of mass and energy We are always a couple years away from a fusion reactor but never materialized with excuses. \n\nBillions down the drain. \n\nWhy are we investing so much into a theory that is giving us nothing. \n\nEveryday I see multiverse theory listed as fact\nStating there are many universes. With no proof? \n\n\nOr how about Hawking radiation predicts black hole evaporations? Again how can I test this? Trust me bro is the new scientific method?\n\nSomebody has got to be playing a joke on us. Maybe I’m the only one not in on it. Are these people this incompetent? Something isn’t adding up here. Is it state sponsored meddling to waste our time? Why do we keep investing in this theory expecting breakthroughs when all we get is hype.\n\nWhoever is doing this is definitely a dirty little trickster.",
        "created_utc": 1673850290,
        "upvote_ratio": 1.0
    },
    {
        "title": "Solve",
        "author": "QuietStructure4164",
        "url": "https://www.reddit.com/r/Physics/comments/10d72h2/solve/",
        "text": "[removed]",
        "created_utc": 1673849933,
        "upvote_ratio": 1.0
    }
]