[
    {
        "title": "Deriving subliation radius",
        "author": "Abinashhhhhhh",
        "url": "https://www.reddit.com/r/Physics/comments/zfatxa/deriving_subliation_radius/",
        "text": "[removed]",
        "created_utc": 1670441003,
        "upvote_ratio": 1.0
    },
    {
        "title": "Deriving dust subliation radius",
        "author": "Abinashhhhhhh",
        "url": "https://www.reddit.com/r/Physics/comments/zfatas/deriving_dust_subliation_radius/",
        "text": "[removed]",
        "created_utc": 1670440969,
        "upvote_ratio": 1.0
    },
    {
        "title": "If there’s no information being transmitted when measuring an entangled particle, what mechanism causes the wavefunction of the other particle to collapse?",
        "author": "krishandop",
        "url": "https://www.reddit.com/r/Physics/comments/zf9jy7/if_theres_no_information_being_transmitted_when/",
        "text": "FYI: I’m an engineer and computer scientist with just a causal background in physics so this may be a stupid question. I’ve only read some quantum mechanics textbooks (undergrad level only) and watched some online lectures.\n\nI understand that since no physical information is transmitted when you measure an entangled particle (so nothing is going faster than the speed of light), but what is causing the wave function collapse then? \n\nIt seems that something has to be happening very fast or in a very strange way to cause instant effects over nearly infinite distances. Even if no “information” is being transmitted.",
        "created_utc": 1670438404,
        "upvote_ratio": 1.0
    },
    {
        "title": "If no information is transmitted during the measurement of an",
        "author": "krishandop",
        "url": "https://www.reddit.com/r/Physics/comments/zf9epz/if_no_information_is_transmitted_during_the/",
        "text": "",
        "created_utc": 1670438105,
        "upvote_ratio": 1.0
    },
    {
        "title": "If there’s no information being transmitted when an entangled is measured, what mechanism causes the wave function of the other particle to collapse?",
        "author": "krishandop",
        "url": "https://www.reddit.com/r/Physics/comments/zf9dcm/if_theres_no_information_being_transmitted_when/",
        "text": "",
        "created_utc": 1670438029,
        "upvote_ratio": 1.0
    },
    {
        "title": "Confusion about point mass (center of mass)",
        "author": "MF1_137",
        "url": "https://www.reddit.com/r/Physics/comments/zf9bi9/confusion_about_point_mass_center_of_mass/",
        "text": "In materials for my first semester physics course we were given a [formula](https://drive.google.com/file/d/1RzDBlMWwAcCNHQcjsIJW7X2Md0tZ0ShE/view?usp=drivesdk) defining the center of mass of a rigid body. Where r1 are position vectors of points of mass and rs is the positional vector of center of mass. I understand that if i had a coordinate system with a starting point in the center of mass the sum of all vectors multiplied by mass would cancel out because some vectors would point in exactly opposite directions so it makes sense. But what would happen if i chose a coordinate system at some other point or maybe outside of the rigid body? Wouldn't the vectors just add up to a very large vector that would be nowhere near the rigid body? Im imagining it like [this.](https://drive.google.com/file/d/1Sb13-cuAOeQqEiWRd5Z9qga3P2zyo63x/view?usp=drivesdk)\nSorry for bad english it's not my first language. Any help would be appreciated :).",
        "created_utc": 1670437921,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is it true that two objects colliding head on have a relative speed of the two speeds multiplied?",
        "author": "FrankTheBank25",
        "url": "https://www.reddit.com/r/Physics/comments/zf888v/is_it_true_that_two_objects_colliding_head_on/",
        "text": "I have heard that for example if two trains going at 10 miles an hour each on the same track in the same direction were to collide head on that the relative speed of the impact equivalent to a train moving at 100 mph hitting a parked train. Is this true, and if not what is the correct explanation?",
        "created_utc": 1670435789,
        "upvote_ratio": 1.0
    },
    {
        "title": "I'm not sure what \"useful\" means here and I don't have the correct answer, can anyone explain the solution to me?",
        "author": "Arteril",
        "url": "https://i.redd.it/f6bvls7tei4a1.jpg",
        "text": "",
        "created_utc": 1670433595,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is it possible for objects to teleport?",
        "author": "Theresa2422",
        "url": "https://www.reddit.com/r/Physics/comments/zf70my/is_it_possible_for_objects_to_teleport/",
        "text": "I saw a comment on an AskReddit thread about unexplained / paranormal experiences. One of them was a guy found a broken chicken's egg in his garage. He said he did have chickens but none of them laid white eggs, and the motion triggers did not go off. He said he lives in the middle of nowhere and since the egg was not frozen the egg had rolled off the garage ceiling very shortly before he came into the garage. He said the egg had teleported into his garage.\n\nCould this be an example of quantum tunnelling? I thought it only affected things on the quantum scale?",
        "created_utc": 1670433343,
        "upvote_ratio": 1.0
    },
    {
        "title": "maxlaughlin where is he and what do you think about him ?",
        "author": "Alive-Joke5132",
        "url": "https://v.redd.it/gbubs24f7i4a1",
        "text": "",
        "created_utc": 1670430986,
        "upvote_ratio": 1.0
    },
    {
        "title": "Do you think AI will ever replace the job of a physicist? To what extent?",
        "author": "nenni_docet",
        "url": "https://www.reddit.com/r/Physics/comments/zf35dy/do_you_think_ai_will_ever_replace_the_job_of_a/",
        "text": "",
        "created_utc": 1670425079,
        "upvote_ratio": 1.0
    },
    {
        "title": "Question about parallax effect.",
        "author": "Candid-Register-6718",
        "url": "https://www.reddit.com/r/Physics/comments/zf2c1m/question_about_parallax_effect/",
        "text": "I’m writing an essay about boxing and was wondering if my description is accurate: \n\n“Straight punches are harder to see coming because you only see them from the front. \n\nThis is because of the way how we perceive depth. Imagine a car coming straight towards you. It’s hard to tell the distance or speed. \n\nBut watching it from the side against a background it becomes easy to see how fast it is moving relative to the background.\n\nThis is called the Parallax Effect.”\n\nPlease let me know if you have any suggestions for improvement.",
        "created_utc": 1670422995,
        "upvote_ratio": 1.0
    },
    {
        "title": "Optical study: Brillouin scattering spectrum for liquid detection and applications in oceanography",
        "author": "Badatu",
        "url": "https://www.oejournal.org/article/doi/10.29026/oea.2023.220016",
        "text": "",
        "created_utc": 1670419880,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to correctly cite Nobel Prizes?",
        "author": "darockt",
        "url": "https://www.reddit.com/r/Physics/comments/zf015v/how_to_correctly_cite_nobel_prizes/",
        "text": "I'm currently writing the introduction to my thesis and want to cite some Nobel Prices in physics.  \nHowever, years of research made me overstrained when i can't click the \"export to BiBTex\"-Button.",
        "created_utc": 1670416364,
        "upvote_ratio": 1.0
    },
    {
        "title": "From calculus to string theory and QCD - all my notes from a 4 year",
        "author": "kathyescobar",
        "url": "https://i.imgur.com/oC2eesC.jpg",
        "text": "",
        "created_utc": 1670414674,
        "upvote_ratio": 1.0
    },
    {
        "title": "In a theory Can Microwaves get turned unto Electricity on long distance and used in multiple factories like this?",
        "author": "ease250",
        "url": "https://www.reddit.com/r/Physics/comments/zezhex/in_a_theory_can_microwaves_get_turned_unto/",
        "text": "",
        "created_utc": 1670414627,
        "upvote_ratio": 1.0
    },
    {
        "title": "Method generating multilayer thin film stacks of liquid layers (only a few hundreds of atoms thick) displays well-defined liquid–liquid interfaces, ideal for spectroscopy and scattering experiments",
        "author": "marketrent",
        "url": "https://www6.slac.stanford.edu/news/2022-11-30-shining-new-light-oil-slick-rainbows-and-other-thin-layer-physics",
        "text": "",
        "created_utc": 1670408431,
        "upvote_ratio": 1.0
    },
    {
        "title": "Rubik's cube",
        "author": "Aadarshj688",
        "url": "https://i.redd.it/jy48301zqh4a1.jpg",
        "text": "",
        "created_utc": 1670407452,
        "upvote_ratio": 1.0
    },
    {
        "title": "Perpetual Motion",
        "author": "Verdict44",
        "url": "https://i.redd.it/mksu11frlh4a1.jpg",
        "text": "",
        "created_utc": 1670405701,
        "upvote_ratio": 1.0
    },
    {
        "title": "How Do I Start A Career in Physics? (Your Advice is Greatly Appreciated!)",
        "author": "kayvon23",
        "url": "https://www.reddit.com/r/Physics/comments/zeu3il/how_do_i_start_a_career_in_physics_your_advice_is/",
        "text": "* **intro:**\n\nhi all\n\nWhile I studied premed to start college, I didn't finish with a stem degree - the medical field gave me \"asylum\" vibes and since i'd always been pretty business savvy, I opted to go in that direction. Actually ended up not finishing school because of a great opportunity that I ran with. I'm now a marketing professional in my late 20s and fairly accomplished for my level (thanks to the small head start).\n\nI was, however, always a math and science nerd growing up; they were always my strongest skillsets/subjects. Even when pivoting towards business, I took Physics in college and got an A (not that I'm saying that means much). I've just always held science and math, physics specifically, dear to my heart. I admittedly lost some passion for math when I got to college, but I think that's mostly due to not having any really great professors. I did have one for Calculus who was great and I did great in that. Science on the other hand I enjoyed throughout no matter what; no matter the type of science or whether it was theoretical or applied, I always enjoyed it. I didn't need to take bio, chem and physics after the chance in major but I did anyway just for fun. \n\nI'm at a stage now where I'm projecting years ahead and envisioning what I see for myself 2, 5, 10 years down the line, what I'll be doing and working towards and what my life will *feel* like. \n\n&amp;#x200B;\n\n* **question:**\n\nA deep part of me wonders how I could pursue a career in the field even if I wanted to:\n\n\\- going back to school?\n\n\\- specific degree? any type of engineering? physics engineering if applicable?\n\n\\- MOOCs/Certifications of any sort? bonus points for any that directly help get a foot in a door\n\n\\- mentor/intern/apprentice-ships, on the job training, or trade programs? (applied engineering and the sorts id assume but will gladly take any tips or pointers here)\n\n\\- what types of jobs? (I know this is quite vague but I guess i'd say more in the electrical/electromagnetic field\n\n\\- what does the roadmap kinda look like? \n\n\\- any suggested \"routes\" or subject matter/specializations?\n\n&amp;#x200B;\n\nI'm not 100% certain what the different areas of physics that can be specifically pursued all are, so im trying to get an idea of that and what a shift towards the sciences could look like both in the near future and in the not-so-near future after progressing in a certain direction (and what those certain directions might be).\n\nThank you greatly for any and all advice! \n\nAgain, it is **very** appreciated : )",
        "created_utc": 1670394504,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can anyone help us with our homework",
        "author": "Asian4Eyes",
        "url": "https://www.reddit.com/r/Physics/comments/zet8lp/can_anyone_help_us_with_our_homework/",
        "text": "[removed]",
        "created_utc": 1670391504,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can someone please help me out with my homework. my teacher gives very poor explanations and youtube has been carrying my grade so far . thanks (i just need to fill out the sheet on the right).",
        "author": "Great_was_taken",
        "url": "https://i.redd.it/umx8q3z0yf4a1.jpg",
        "text": "",
        "created_utc": 1670385612,
        "upvote_ratio": 1.0
    },
    {
        "title": "In a theory Can Microwaves get turned unto Electricity on long distance and used in multiple factories like this?",
        "author": "Championship3313",
        "url": "https://www.reddit.com/r/Physics/comments/zeqree/in_a_theory_can_microwaves_get_turned_unto/",
        "text": "",
        "created_utc": 1670383570,
        "upvote_ratio": 1.0
    },
    {
        "title": "AI Lex Fridman interviewing AI Richard Feynman",
        "author": "inglandation",
        "url": "https://podcast.ai/",
        "text": "",
        "created_utc": 1670382595,
        "upvote_ratio": 1.0
    },
    {
        "title": "Time Dilation in Space",
        "author": "Individual-Board3805",
        "url": "https://www.reddit.com/r/Physics/comments/zeprsj/time_dilation_in_space/",
        "text": "I’m watching the expanse right now and I’ve been wondering how time would pass differently if you lived on an asteroid in the belt vs on earth. Since gravity is so much weaker, would time move differently? Even if we tracked the passage of time based on earth days, how would the differing gravity change the experience of time? \n\nI apologize if my language is confusing. I have a limited science background and don’t fully understand the relationship between space and time, I just understand that there is one.",
        "created_utc": 1670380605,
        "upvote_ratio": 1.0
    },
    {
        "title": "Researchers adapt a Nobel Prize-winning method to design new, ultra-powerful X-ray systems",
        "author": "corona_virus_is_dead",
        "url": "https://blog.scientiststudy.com/2022/12/researchers-adapt-nobel-prize-winning.html",
        "text": "",
        "created_utc": 1670378900,
        "upvote_ratio": 1.0
    },
    {
        "title": "Strange New Phase of Matter Created in Quantum Computer Acts Like It Has Two Time Dimensions",
        "author": "meanmarzi",
        "url": "https://blog.scientiststudy.com/2022/08/strange-new-phase-of-matter-created-in.html",
        "text": "",
        "created_utc": 1670375226,
        "upvote_ratio": 1.0
    },
    {
        "title": "Frequency of radiation used in radiotherapy for cancer treatment?",
        "author": "3453452452",
        "url": "https://www.reddit.com/r/Physics/comments/zemski/frequency_of_radiation_used_in_radiotherapy_for/",
        "text": "I know that x-rays and gamma rays are used.  I cannot find the actual frequency or range of frequencies used.  Anyone have a link to an answer?",
        "created_utc": 1670372009,
        "upvote_ratio": 1.0
    },
    {
        "title": "MWI of Quantum Mechanics question",
        "author": "Unit1126PLL",
        "url": "https://www.reddit.com/r/Physics/comments/zekorc/mwi_of_quantum_mechanics_question/",
        "text": "I understand that MWI seems to posit that an observer, rather than collapsing the wave function, merely entangles with it in a large, unitary wave function that represents the universe. \n\nMy question is: why does an observer entering coherence with the observed system give the appearance of a system in a single state?\n\nNote: I am a curious layperson, so I apologize if the question is ignorant.",
        "created_utc": 1670366914,
        "upvote_ratio": 1.0
    },
    {
        "title": "I am graduating soon with a degree in physics and I have no idea what to do after I get it.",
        "author": "Brave-Dig-29",
        "url": "https://www.reddit.com/r/Physics/comments/zek0eg/i_am_graduating_soon_with_a_degree_in_physics_and/",
        "text": " The title pretty much sums it up. In may I will be graduating with my degree in physics and a double minor in mathematics and data science. I've been applying to grad schools because I just assumed that was my next goal but I'm starting to lean towards just going into the industry out of college and maybe going back to school later on after I've made a little money and possibly can get the company I work for to help pay for the degree. Having said this I have absolutely no idea what job I would be interested in getting. I guess my question is to those that felt they were in the same position, what did you do, and how did you decide what to do?",
        "created_utc": 1670365336,
        "upvote_ratio": 1.0
    },
    {
        "title": "Hi",
        "author": "Grandma_suey",
        "url": "https://www.reddit.com/r/Physics/comments/zejskb/hi/",
        "text": "[removed]",
        "created_utc": 1670364802,
        "upvote_ratio": 1.0
    },
    {
        "title": "Einstein vs Pythagoras",
        "author": "Few_Comman",
        "url": "https://i.redd.it/tukwi2xffc4a1.png",
        "text": "",
        "created_utc": 1670361073,
        "upvote_ratio": 1.0
    },
    {
        "title": "Duran Duran's Nick Rhodes and Particle Physicist Brian Cox discuss time travel, the intersection of politics and science and more!",
        "author": "ernestcummings",
        "url": "https://pod.link/singforscience/episode/e9a30d706d00bb927cebcb2dcdfeb7b1",
        "text": "",
        "created_utc": 1670358845,
        "upvote_ratio": 1.0
    },
    {
        "title": "Young's modulus",
        "author": "Junglie007",
        "url": "https://i.redd.it/wd2w7zftod4a1.png",
        "text": "What materials would have a stress/strain graph that is roughly this shape?",
        "created_utc": 1670358303,
        "upvote_ratio": 1.0
    },
    {
        "title": "I would like to learn how to approach these Problems ( centripetal force)",
        "author": "ACEofSASUKEY",
        "url": "https://www.reddit.com/r/Physics/comments/zegpiv/i_would_like_to_learn_how_to_approach_these/",
        "text": "&amp;#x200B;\n\nan object is on a metal spinning disc, its 20cm away from the centre (r=20cm) . the coefficient of static friction is 0.4.\n\nat what frequency will the object drop?\n\nat what speed will this happen?\n\nI understand that the coefficient basically tells me how much friction there is between Fn and the object, but I dont undestand how to calculate anything.  \nknowing that the coefficient has something to do with mass and gravitational pull i guess you could calculate the mass which would be needed for the speed, but these are just some ideas.",
        "created_utc": 1670357532,
        "upvote_ratio": 1.0
    },
    {
        "title": "Help!",
        "author": "Stacoopsky",
        "url": "https://www.reddit.com/r/Physics/comments/zef8gb/help/",
        "text": "[removed]",
        "created_utc": 1670354084,
        "upvote_ratio": 1.0
    },
    {
        "title": "What the \"baby wormhole in a lab\" experiment actually means",
        "author": "kzhou7",
        "url": "https://profmattstrassler.com/2022/12/06/how-do-you-make-a-baby-cartoon-wormhole-in-a-lab/",
        "text": "",
        "created_utc": 1670350606,
        "upvote_ratio": 1.0
    },
    {
        "title": "Cam someone find the deceleration. I've also attached the answer but don't know how we got it. Tia",
        "author": "CantaloupeOk1049",
        "url": "https://www.reddit.com/gallery/zedon7",
        "text": "",
        "created_utc": 1670350418,
        "upvote_ratio": 1.0
    },
    {
        "title": "I got an invitation to give a talk at the April APS meeting!!!",
        "author": "Andromeda321",
        "url": "https://www.reddit.com/r/Physics/comments/zecp5m/i_got_an_invitation_to_give_a_talk_at_the_april/",
        "text": "Holy crap!  Times like this all I can think about is how many exams and assignments I failed during my physics degree.  Good thing they didn't ask about that before confirming. :D\n\nMy talk is going to be about [Tidal Disruption Events \\(TDEs\\)](https://astronomy.com/magazine/news/2021/12/how-do-black-holes-swallow-stars) as part of a special session on them!  Never been to APS actually (or Minneapolis, where it's going to be held this year), so should be a cool experience!",
        "created_utc": 1670348039,
        "upvote_ratio": 1.0
    },
    {
        "title": "Easy Computation of Geodesics",
        "author": "maka89",
        "url": "https://www.reddit.com/r/Physics/comments/zec81v/easy_computation_of_geodesics/",
        "text": "Hi,   \nI made a C++ library that allows the user to easily specify their own metric and calculate geodesics.\n\n\\- 4-acceleration is easily calculated using automatic differentiation behind the scenes.\n\n\\- Built-in velocity-verlet method. + option to make your own integration scheme\n\n[https://github.com/maka89/AutoGeodesics](https://github.com/maka89/AutoGeodesics)",
        "created_utc": 1670346905,
        "upvote_ratio": 1.0
    },
    {
        "title": "What if nuclear fusion of hydrogen produced photons?",
        "author": "AggravatingCourse459",
        "url": "https://www.reddit.com/r/Physics/comments/zec3yd/what_if_nuclear_fusion_of_hydrogen_produced/",
        "text": "Just assume the light particles from sun is called thermons. Well we call all light particles as photons. For now assume that light particles from sun are called thermons. Well if there is already a theory from someone which justifies about the light coming from the sun, do let me know. Since the sun is mostly made up of hydrogen can it be that thermons (just an assumption) are produced from the nuclear fusion of hydrogen.",
        "created_utc": 1670346630,
        "upvote_ratio": 1.0
    },
    {
        "title": "Any active russian physics discord channel?",
        "author": "Worried_Bathroom7019",
        "url": "https://www.reddit.com/r/Physics/comments/zebf16/any_active_russian_physics_discord_channel/",
        "text": "[removed]",
        "created_utc": 1670344988,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can someone explain the significance of the double slit experiment and cookes interferometer? They seem like the same exact thing but rather then rotating the fins, the slits or silk etc resonant.",
        "author": "DarklyLlT",
        "url": "https://www.reddit.com/r/Physics/comments/ze9t2b/can_someone_explain_the_significance_of_the/",
        "text": "[removed]",
        "created_utc": 1670341105,
        "upvote_ratio": 1.0
    },
    {
        "title": "Any good book?",
        "author": "Krishlong",
        "url": "https://www.reddit.com/r/Physics/comments/ze9bvt/any_good_book/",
        "text": "So, I needed an physics book ncert is good but not that interesting I need book with good theory and problems any suggestion I am in class 9",
        "created_utc": 1670339882,
        "upvote_ratio": 1.0
    },
    {
        "title": "Explain ?",
        "author": "DatBoi_EAD",
        "url": "https://v.redd.it/5uwrwf7v2c4a1",
        "text": "",
        "created_utc": 1670338814,
        "upvote_ratio": 1.0
    },
    {
        "title": "World's simplest MICROSCOPE using just a WATER DROP || Simple but powerful !!!",
        "author": "Homemade-projects",
        "url": "https://youtu.be/YcLaDjf96aU",
        "text": "",
        "created_utc": 1670338565,
        "upvote_ratio": 1.0
    },
    {
        "title": "Thought experiment that hit me last night: Paradox or misconception?",
        "author": "I_spell_it_Griffin",
        "url": "https://www.reddit.com/r/Physics/comments/ze7iq9/thought_experiment_that_hit_me_last_night_paradox/",
        "text": "Consider [this](https://imgur.com/a/VkGgZnv) thought experiment.\n\nThe setup:\n\n1. A spaceship in uniform motion through a 0G environment.\n2. An passenger aboard.\n3. A contraption that bounces a ping-pong ball off of two (hypothetical) perfect reflectors of kinetic energy along the direction of the spaceship's motion, raising/lowering the passenger's arm on the ball's trip to the front/back respectively.\n\nTo the passenger, it would appear that their arm is raised and lowered in the same regular intervals corresponding to the ball's motion.\n\n**But what would the situation look like to an observer on Earth?**\n\nThe ball would appear to take longer to reach the front of the ship then it does to bounce back to the rear, and so it would trigger the arm-raising mechanism **arhythmically**.\n\nYet the passenger is taken to be in the same uniform motion as the ship, so would the observer on Earth still see their arm raised **rhythmically** or **arythmically**?",
        "created_utc": 1670335209,
        "upvote_ratio": 1.0
    },
    {
        "title": "Physics Questions - Weekly Discussion Thread - December 06, 2022",
        "author": "AutoModerator",
        "url": "https://www.reddit.com/r/Physics/comments/ze7iri/physics_questions_weekly_discussion_thread/",
        "text": "This thread is a dedicated thread for you to ask and answer questions about concepts in physics.\n\nHomework problems or specific calculations may be removed by the moderators. We ask that you post these in /r/AskPhysics or /r/HomeworkHelp instead.\n\nIf you find your question isn't answered here, or cannot wait for the next thread, please also try /r/AskScience and /r/AskPhysics.",
        "created_utc": 1670335209,
        "upvote_ratio": 1.0
    },
    {
        "title": "What happens to a wave below plancks length?",
        "author": "Vacilando_hd",
        "url": "https://www.reddit.com/r/Physics/comments/ze7ekr/what_happens_to_a_wave_below_plancks_length/",
        "text": "Lets take a wave, any wave, and just zoom in on the crest of the wave. And keep zooming in till we reach plancks length.\n\nPlancks length or constant is just a point of measurment, but when you go below it the concept of reality becomes warped. (Zenos paradox). But that does not mean nothing \"is\" in places smaller than plancks length. Because if nothing is smaller than plancks length, or things stop to appear when they reach that measurment, then nothing would exist at all.\n\nSo what happens to a wave when we zoom in to plancks length? \n\n\\*Picture\\* Its from some weird spiritual paper about quantum jumping, I dont believe in that stuff, but that illustration made me curious what the physics is like at that scale.\n\n(I hope this made just a slight sense)",
        "created_utc": 1670334906,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is the force of gravity between the sun and the quasar in the center of the Milky Way?",
        "author": "International_War296",
        "url": "https://www.reddit.com/r/Physics/comments/ze77qs/what_is_the_force_of_gravity_between_the_sun_and/",
        "text": "",
        "created_utc": 1670334400,
        "upvote_ratio": 1.0
    },
    {
        "title": "Explain?",
        "author": "Cheez-it_chicken",
        "url": "https://v.redd.it/50evhdsv0a4a1",
        "text": "",
        "created_utc": 1670331937,
        "upvote_ratio": 1.0
    },
    {
        "title": "Friction in space",
        "author": "vangen99",
        "url": "https://www.reddit.com/r/Physics/comments/ze5fdx/friction_in_space/",
        "text": "[removed]",
        "created_utc": 1670329678,
        "upvote_ratio": 1.0
    },
    {
        "title": "Dynamic soaring as a means to Cross Extraordinary Distances of Interstellar Space",
        "author": "Wanda-Fleker",
        "url": "https://www.futurespacetech.com/2022/12/dynamic-soaring-as-means-to-cross.html",
        "text": "",
        "created_utc": 1670322981,
        "upvote_ratio": 1.0
    },
    {
        "title": "How AM works",
        "author": "Alive_Upstairs340",
        "url": "https://www.reddit.com/r/Physics/comments/ze1uea/how_am_works/",
        "text": "I understand that AM is low frequency signal modulating a high frequency carrier, where the low frequency signal is amplitude modulated. How does just changing the amplitude of a signal carry information for example about the frequency and volume of a person's voice? How can both frequency and volume be encoded in changing amplitude of a constant frequency signal?",
        "created_utc": 1670319460,
        "upvote_ratio": 1.0
    },
    {
        "title": "pls read this i am putting this for increasing the number of views?",
        "author": "nitinmjpru",
        "url": "https://www.reddit.com/r/Physics/comments/ze0him/pls_read_this_i_am_putting_this_for_increasing/",
        "text": "[removed]",
        "created_utc": 1670315298,
        "upvote_ratio": 1.0
    },
    {
        "title": "Asymmetry Detected in the Distribution of Galaxies",
        "author": "mmaksimovic",
        "url": "https://www.quantamagazine.org/asymmetry-detected-in-the-distribution-of-galaxies-20221205/",
        "text": "",
        "created_utc": 1670313082,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to Calculate Capillary Action in a Double-Walled Capillary Tube?",
        "author": "InspClueso",
        "url": "https://www.reddit.com/r/Physics/comments/zdyz5d/how_to_calculate_capillary_action_in_a/",
        "text": "There is a video on Youtube (Glass Oil Wick  \"The Capillary Candle\" by Matt Jasa) that shows a glass-blower pulling one narrow glass capillary tube and inserting it into an oil bath where you can see the oil rise in the tube.  The end of the tube is then lit, and the oil burns at the end of the tube similar to how it would in a wicked oil lamp.\n\nThen a second, slightly wider tube is pulled.  A dye is added to the oil, and the larger diameter tube is slid over the narrower tube and down into the oil.  You can see the dyed oil rise rapidly in the interstitial space between the narrower and wider tubes.  I was quite surprised at the vigor with which the oil rose in between the two tubes.  To watch the video only from the point where the blue ink being added, start at 8:40.\n\nSo I'm wondering:\n\n1) Is there a unique name given to the effect of the rise of oil in the interstitial space between two tubes?\n\n2)  Is there a name given to this type of \"double-walled\" capillary tube?\n\n3) Does anyone sell this kind of tube off the shelf, or would it be a special order only item?  And finally,\n\n4) How would you  calculate the level of the rise of the oil in the interstitial space?",
        "created_utc": 1670310824,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why does an object in uniform circular motion not move to the centre of its path",
        "author": "tribore260419",
        "url": "https://www.reddit.com/r/Physics/comments/zdwf5f/why_does_an_object_in_uniform_circular_motion_not/",
        "text": "I am trying to understand the concept of uniform circular motion. I understand that in uniform circular motion, the speed is constant but velocity is changing due ever changing direction of the object. Since velocity is changing, there is an acceleration. All the explanations I have seen say that the acceleration of a body in uniform circular motion is towards the centre of the path of the body. I have even seen and understood vector diagrams proving this. One thing I don't understand is why the body in uniform circular motion does not move to the centre of its path when its acceleration is in that direction.\n\n&amp;#x200B;\n\nhttps://preview.redd.it/owvexjgap74a1.png?width=1568&amp;format=png&amp;auto=webp&amp;s=8a56c3664db1179dac1d7d3a79457933bb561d9d",
        "created_utc": 1670303820,
        "upvote_ratio": 1.0
    },
    {
        "title": "Angular correlation of coincident events from positron source 22 N a, Why we have the most total counts on 180?",
        "author": "KikkoMinggu",
        "url": "https://www.reddit.com/r/Physics/comments/zdvkn0/angular_correlation_of_coincident_events_from/",
        "text": "&amp;#x200B;\n\nhttps://preview.redd.it/hhycya3ri74a1.png?width=726&amp;format=png&amp;auto=webp&amp;s=3b0ab21739f327e817ea4a72cceaf75573ca482d",
        "created_utc": 1670301664,
        "upvote_ratio": 1.0
    },
    {
        "title": "Help",
        "author": "PoliticalMexican2005",
        "url": "https://i.redd.it/9qlxxeczz84a1.jpg",
        "text": "",
        "created_utc": 1670301524,
        "upvote_ratio": 1.0
    },
    {
        "title": "Help pt 2",
        "author": "PoliticalMexican2005",
        "url": "https://i.redd.it/k4xhinoot84a1.jpg",
        "text": "",
        "created_utc": 1670299405,
        "upvote_ratio": 1.0
    },
    {
        "title": "Help",
        "author": "PoliticalMexican2005",
        "url": "https://i.redd.it/ej2qd6ghn84a1.jpg",
        "text": "",
        "created_utc": 1670297320,
        "upvote_ratio": 1.0
    },
    {
        "title": "I wanna do a lab but I need some ideas",
        "author": "Acrobatic-Bluebird11",
        "url": "https://www.reddit.com/r/Physics/comments/zdsu5q/i_wanna_do_a_lab_but_i_need_some_ideas/",
        "text": "Something related to beginner grade 11 Kinematics or Energy / Work problems. Nothing game breaking just something to have fun making and writing a report with. Please and thank you!",
        "created_utc": 1670294980,
        "upvote_ratio": 1.0
    },
    {
        "title": "It’s literally as cool as I expected to be",
        "author": "NohecHagfu",
        "url": "https://i.redd.it/9a8kggddu64a1.png",
        "text": "",
        "created_utc": 1670293471,
        "upvote_ratio": 1.0
    },
    {
        "title": "Need help with questions. I would really appreciate if you guys could help me.",
        "author": "Proof_Profession_349",
        "url": "https://www.reddit.com/r/Physics/comments/zdr0t1/need_help_with_questions_i_would_really/",
        "text": "&amp;#x200B;\n\nhttps://preview.redd.it/5tybylm1l64a1.png?width=1450&amp;format=png&amp;auto=webp&amp;s=da5ae22e738a2411d6b6346cdff152d9761aafa5",
        "created_utc": 1670290290,
        "upvote_ratio": 1.0
    },
    {
        "title": "Need help with questions. I would really appreciate if you guys could help me.",
        "author": "Proof_Profession_349",
        "url": "https://www.reddit.com/r/Physics/comments/zdr0gk/need_help_with_questions_i_would_really/",
        "text": "&amp;#x200B;\n\nhttps://preview.redd.it/3yksf1bzk64a1.png?width=1468&amp;format=png&amp;auto=webp&amp;s=1611d8b648666b863a43ea0d8e055ddcd1e0b7f3",
        "created_utc": 1670290264,
        "upvote_ratio": 1.0
    },
    {
        "title": "Need help with questions. I would really appreciate if you guys could help me.",
        "author": "Proof_Profession_349",
        "url": "https://www.reddit.com/r/Physics/comments/zdqzfv/need_help_with_questions_i_would_really/",
        "text": "&amp;#x200B;\n\nhttps://preview.redd.it/e10vsxask64a1.png?width=1466&amp;format=png&amp;auto=webp&amp;s=42912f8662c7e1c076c84dd4f0c7dce827a89043",
        "created_utc": 1670290198,
        "upvote_ratio": 1.0
    },
    {
        "title": "Need help with questions. I would really appreciate if you guys could help me.",
        "author": "Proof_Profession_349",
        "url": "https://www.reddit.com/r/Physics/comments/zdqz75/need_help_with_questions_i_would_really/",
        "text": "&amp;#x200B;\n\nhttps://preview.redd.it/6hke4y6qk64a1.png?width=1460&amp;format=png&amp;auto=webp&amp;s=b73b50d04fe281a685f635b66ae676db787cd521",
        "created_utc": 1670290178,
        "upvote_ratio": 1.0
    },
    {
        "title": "Need help with questions. I would really appreciate if you guys could help me.",
        "author": "Proof_Profession_349",
        "url": "https://www.reddit.com/r/Physics/comments/zdqysy/need_help_with_questions_i_would_really/",
        "text": "&amp;#x200B;\n\nhttps://preview.redd.it/rhh48yxjk64a1.png?width=1444&amp;format=png&amp;auto=webp&amp;s=b8b94e1e5ac4c4e21be6b3b103e2f2921ea75f13",
        "created_utc": 1670290147,
        "upvote_ratio": 1.0
    },
    {
        "title": "Simulation scaling down units",
        "author": "Pardaleco",
        "url": "https://www.reddit.com/r/Physics/comments/zdqbkl/simulation_scaling_down_units/",
        "text": " Hello!  \n\n\nI am currently developing a simulation of the solar system and I wanted it to be realistic taking into account my current capabilities. At least gravity I want to be simulated accurately.  \nEverything needs to be scaled down (distances, masses).  \n\n\n**The scaling factor I am using for distance is 1 unit = 100000 (km).**  \n**And the mass scaling factor is 1 = 1,00e+25.**  \n\n\nWith this said, I am having difficulty figuring out how to scale the gravitational constant for Newtonian gravitation law.  \n**Its value is: 6.674e-11 (s\\^3 \\* kg\\^-1 \\* s\\^-2)**  \n\n\nConsidering my scaling factors how would I calculate the correct value for the gravitational constant for my simulation?  \n\n\nHopefully, the question is clear, For any clarification just ask and I will try to explain as best as possible.  \nThanks in advance!",
        "created_utc": 1670288442,
        "upvote_ratio": 1.0
    },
    {
        "title": "How can there be a current in a dipole antenna when it is not a closed circuit?",
        "author": "Spock8462",
        "url": "https://www.reddit.com/r/Physics/comments/zdpyzu/how_can_there_be_a_current_in_a_dipole_antenna/",
        "text": "[removed]",
        "created_utc": 1670287554,
        "upvote_ratio": 1.0
    },
    {
        "title": "I am dumb, but I have a question.",
        "author": "AACel",
        "url": "https://www.reddit.com/r/Physics/comments/zdptot/i_am_dumb_but_i_have_a_question/",
        "text": "Good evening. Please forgive me if this is dumb. I don't have a degree, suck at math, but am really curious about a dream I had and what would happen in such a situation.\n\n\n\nSo Assume for a second that einstein-rosen bridges are a thing and that black holes and white holes are a thing. -- I read there was a hypothetical 14 stars believed to possibly be anti-stars. Knowing matter and anti-matter destroy themselves, could this be what is happening at a singularity of a black hole?\n\nIn my dream, again not reality, I dreamt that as anti-matter or matter each reach the outter event horizon, partical acceleration occurred. At the inner event horizon quantum tunneling occurred, and as they passed into the \"Throat\" of their respective black / white holes, quantum entanglement occurred between some of the matter and dark matter, and those that didn't collided destroying themselves.\n\nThis reaction... assuming the above is plausible, would this create a dark-matter star? Again, sorry if this is all dumb for you guys",
        "created_utc": 1670287174,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is the in depth black hole theory",
        "author": "SnooRadishes8591",
        "url": "https://www.reddit.com/r/Physics/comments/zdppig/what_is_the_in_depth_black_hole_theory/",
        "text": "[removed]",
        "created_utc": 1670286876,
        "upvote_ratio": 1.0
    },
    {
        "title": "Should I double major in Computer science?",
        "author": "first_photon",
        "url": "https://www.reddit.com/r/Physics/comments/zdn2s4/should_i_double_major_in_computer_science/",
        "text": "I'm currently a freshman physics major and I also like software engineering. I've been thinking about how it would be beneficial for me to have both degrees and incase i change my mind about what I want to do after graduating college, I will have a CS degree inde my belt for a job as a software engineer. I know it will get difficult but is it worth it? Should I add CS as my second major? Or should I change my major to CS and minor in physics?",
        "created_utc": 1670281098,
        "upvote_ratio": 1.0
    },
    {
        "title": "Asymmetry Detected in the Distribution of Galaxies",
        "author": "B312B",
        "url": "https://www.quantamagazine.org/asymmetry-detected-in-the-distribution-of-galaxies-20221205/",
        "text": "",
        "created_utc": 1670279761,
        "upvote_ratio": 1.0
    },
    {
        "title": "How much more efficient are long boarding wheels than skateboarding wheels?",
        "author": "pizza_4_all_",
        "url": "https://www.reddit.com/r/Physics/comments/zdkh07/how_much_more_efficient_are_long_boarding_wheels/",
        "text": "How much more efficient are long boarding wheels than skateboarding wheels?",
        "created_utc": 1670275911,
        "upvote_ratio": 1.0
    },
    {
        "title": "Help with an exercise. Rolling without slipping.",
        "author": "ServerKeeper",
        "url": "https://www.reddit.com/r/Physics/comments/zdk7ju/help_with_an_exercise_rolling_without_slipping/",
        "text": "Hello everyone, I will leave a image of one exercise that i had to do today. Its about a wheel that is rolling without slipping. My question is: Does the force of friction always points towards direction? Because when i did my diagram of forces, initially i draw it pointing to the right, but when i do the rest of the calculations I get a negative value of the force of friction, which makes me doubt if i have something incorrect along the path or if there are cases when force of friction does not points towards direction of motion.\n\n&amp;#x200B;\n\nIm not a native english speaker, so maybe i need to do some clarifications about the exercise picture so not one gets confused. The wheel has a kind of hole where the string pulls from. Its the same rigid body, its not another wheel.\n\nThen, for the moment of inertia of the wheel, the letter suggest to use the moment of inertia of a cilinder (I=1/2MR\\^2). \n\n&amp;#x200B;\n\nI find out the acceleration of the block (hanging from the pulley), but when i find the force of friction, its a negative value, so im a bit confused about the direction, it always points towards direction of motion or not? it depends?\n\n&amp;#x200B;\n\nI tried my best to write this post without grammatical errors so you can understand everything about this exercise, but if you have any doubts let me know in the comments so i can explain differently so you can understand what im asking.\n\n&amp;#x200B;\n\nhttps://preview.redd.it/ztkske0cb54a1.png?width=1016&amp;format=png&amp;auto=webp&amp;s=da2f63225747600e775fb3ecc0d9781376ee3fc0",
        "created_utc": 1670275403,
        "upvote_ratio": 1.0
    },
    {
        "title": "Gravity force inside blackhole",
        "author": "kepler_96",
        "url": "https://www.reddit.com/r/Physics/comments/zdim7n/gravity_force_inside_blackhole/",
        "text": "I assume gravity is curvature of space time, if that is the case then when two blackholes are merging how matter(or whatever inside it) inside the event horizon of one blackhole is pulled by other blackhole where space/time is irrelevant?",
        "created_utc": 1670272208,
        "upvote_ratio": 1.0
    },
    {
        "title": "How much physics can you do without differential equations?",
        "author": "notoliberals",
        "url": "https://www.reddit.com/r/Physics/comments/zdhwt0/how_much_physics_can_you_do_without_differential/",
        "text": "[removed]",
        "created_utc": 1670270773,
        "upvote_ratio": 1.0
    },
    {
        "title": "Useful knowledge",
        "author": "Mokka21",
        "url": "https://v.redd.it/gd04scpdr44a1",
        "text": "",
        "created_utc": 1670270480,
        "upvote_ratio": 1.0
    },
    {
        "title": "I have a Final Cumulative Exam tomorrow and I am SO stressed and I never know how to get help!!",
        "author": "DuchessElDucky",
        "url": "https://www.reddit.com/r/Physics/comments/zdhce4/i_have_a_final_cumulative_exam_tomorrow_and_i_am/",
        "text": "",
        "created_utc": 1670269635,
        "upvote_ratio": 1.0
    },
    {
        "title": "arXiv vs. qarXiv: can you distinguish between real and fake quantum computing papers?",
        "author": "kzhou7",
        "url": "https://www.mit.edu/~azlokapa/qarxiv/index.html",
        "text": "",
        "created_utc": 1670267889,
        "upvote_ratio": 1.0
    },
    {
        "title": "how fast can steel travel before melting?",
        "author": "Competitive_Sir2561",
        "url": "https://www.reddit.com/r/Physics/comments/zdg4ab/how_fast_can_steel_travel_before_melting/",
        "text": "I am an aspiring writer working on a story, but the story features a weapon that can fire a projectile which flies at the speed of lightning. I assumed steel at first but then upon research I've learned that might not be on option. However I haven't found anything with a definitive answer. if someone could give me a definitive answer and help me out, I would appreciate it.",
        "created_utc": 1670267068,
        "upvote_ratio": 1.0
    },
    {
        "title": "If you’re climbing a rope and it’s cut at the top, would it be (not humanly possible) but physically legal to still climb upwards to the top before it falls?",
        "author": "Jumpy_Signature_5169",
        "url": "https://www.reddit.com/r/Physics/comments/zdfmuv/if_youre_climbing_a_rope_and_its_cut_at_the_top/",
        "text": "I’m thinking of modifying and converting a small micro RC car’s little motor into a speedy and lightweight little rope climber, going to hold a 20 ft top off of  a 20 ft ledge and positioning the climber 6 ft from the ground, and start the motor at as close to the exact second I drop the rope as I can and then see what happens. Do you guys think a chain might work better? Idk how to make a climber for that tho all my ideas center around it being circular.\n\nIm not a physicist.. obviously. Im not a student or anything either, I’m just an idiot with a question and idk any other way to personally solve it other than test it by my own means. Im sure there’s a formula or something that could help me but I’m not exactly sure what that would be, like I said I’m stuck beyond just building a little rope climber and testing it myself. \n\nI’d probably need like the weight of my  climber, the weight of the rope, the distance from the ground the climber starts, the rate at which it climbs the rope when not falling, and gravity? Am I missing something other than how I should mash all that together?\n\nIm sorry this all probably seems kinda stupid but it’s been on my mind a lot lately and it’s be cool to figure it out",
        "created_utc": 1670266091,
        "upvote_ratio": 1.0
    },
    {
        "title": "Tattoo help",
        "author": "Secure-Cricket7021",
        "url": "https://www.reddit.com/r/Physics/comments/zdex7s/tattoo_help/",
        "text": "Hi friends, \n\nI want to use the quote as a tattoo:\n\n\"YOUR DIRECTION IS MORE IMPORTANT\n THAN YOUR SPEED.” (RICHARD L. EVANS) \n\nSorry for the all caps. Any ideas on how to show this using symbols? \n\nThanks",
        "created_utc": 1670264662,
        "upvote_ratio": 1.0
    },
    {
        "title": "Prof. Lee’s example of colliding balls of unequal mass and Newtonian incompleteness",
        "author": "carlk22",
        "url": "https://www.reddit.com/r/Physics/comments/zdd9gn/prof_lees_example_of_colliding_balls_of_unequal/",
        "text": "*Summary:*\n\nProf. Lee’s simple Newtonian example--with balls of unequal mass--seems to show different results depending on whether the left ball hits first or the yellow ball hits first. He concludes that the Newtonian system is mathematically “incomplete” in the sense that it does not include its limits (Here, the limit as the time delta between the hits goes to zero).\n\n[Balls have unequal mass](https://preview.redd.it/yk5c4jnn544a1.png?width=213&amp;format=png&amp;auto=webp&amp;s=917dff97b6675f1f53e9949a5325d3f3320f84a1)\n\n*Details:*\n\nI’m interested in the mathematical properties of Newtonian physics and yesterday found this paper by Prof. Edward A. Lee of U. of California, Berkeley.\n\n[Fundamental Limits of Cyber-Physical Systems Modeling](https://dl.acm.org/doi/pdf/10.1145/2912149), November 2016, ACM Transactions on Cyber-Physical Systems 1(1):1-26 DOI:10.1145/2912149 [PDF](https://dl.acm.org/doi/pdf/10.1145/2912149)\n\nHe gives the example above in section 4, on page 17. I worked it out with his suggested masses of 1/5, 1, and 5 and before velocities 1, 0, -1 and, as he said, got different sets of after velocities. Specifically, I used my [simple physics engine](https://github.com/CarlKCarlK/perfect-physics/blob/main/part_5_plato_and_the_Nerd.ipynb) and got  &lt;-73/27, -40/27, -5/9&gt; vs &lt;-31/9, -7/9, -2/3&gt;.\n\nHe closes the paper with a discussion of issues such as interleaving, real-world behavior, and determinism. If interested, please see the paper (starting near page 18) for more details.\n\nI personally love this example. I find it much more compelling than other similar attempts to understand the mathematical structure of Newtonian physics (e.g. Norton’s dome, Suppes’ 2D symmetric 3-particle collision, and various 2D “game engine” collisions.)\n\nMeta:\n\nIf there is a discussion on this, please keep it very civil. I’m going to try to stay out of the discussion and leave it to others. I'll try to reply to any direct messages, but again, please be civil.\n\n\\- Carl",
        "created_utc": 1670261303,
        "upvote_ratio": 1.0
    },
    {
        "title": "Elastic collision problem? What is the second answer?",
        "author": "jyoonc94",
        "url": "https://www.reddit.com/gallery/zdclsa",
        "text": "",
        "created_utc": 1670259921,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do you determine the frequency when you are given m/s for time?",
        "author": "differentfolk",
        "url": "https://i.redd.it/do9oejzrs34a1.jpg",
        "text": "",
        "created_utc": 1670256566,
        "upvote_ratio": 1.0
    },
    {
        "title": "fundamental forces?",
        "author": "NeighborhoodLow3221",
        "url": "https://www.reddit.com/r/Physics/comments/zdatgh/fundamental_forces/",
        "text": " **if all the forces could be classified into 4 fundamental types....under which one does the daily day to day forces like pushing and pulling comes under?** ",
        "created_utc": 1670256175,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is this report correct?",
        "author": "saturnteo",
        "url": "https://i.redd.it/4vsx6bj4954a1.jpg",
        "text": "",
        "created_utc": 1670256168,
        "upvote_ratio": 1.0
    },
    {
        "title": "Which University has physics phd program with high acceptance rate (preferably in the u.s)?",
        "author": "makrobeki",
        "url": "https://www.reddit.com/r/Physics/comments/zd7kng/which_university_has_physics_phd_program_with/",
        "text": "[removed]",
        "created_utc": 1670249025,
        "upvote_ratio": 1.0
    },
    {
        "title": "What are you working on? - Weekly Discussion Thread - December 05, 2022",
        "author": "AutoModerator",
        "url": "https://www.reddit.com/r/Physics/comments/zd7gri/what_are_you_working_on_weekly_discussion_thread/",
        "text": "Hello /r/Physics.\n\nIt's everyone's favorite day of the week, again. Time to share (or rant about) how your research/work/studying is going and what you're working on this week.",
        "created_utc": 1670248811,
        "upvote_ratio": 1.0
    },
    {
        "title": "My absolute favorite purchases",
        "author": "Crafty_Letterhea",
        "url": "https://i.redd.it/7j2frqgq234a1.png",
        "text": "",
        "created_utc": 1670247839,
        "upvote_ratio": 1.0
    },
    {
        "title": "A question about dimensionality",
        "author": "Theevilesthashtag",
        "url": "https://www.reddit.com/r/Physics/comments/zd2pny/a_question_about_dimensionality/",
        "text": "I've heard from many places that existence may have a dozen or so dimensions. Is what we understand as existing objects limited to the dimensions we perceive? Do they extend into all of them? If an object could exist in only some dimensions, do they have to be the ones we perceive? If they exist exclusively in imperceptible dimensions, and we used a viewing device to translate their appearance for us, what might that look like?",
        "created_utc": 1670233995,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can the sphere of a van de graaff generator also be charged negatively if the triboelectric materials of the rollers are exchanged ?",
        "author": "CeddyTheDaddy",
        "url": "https://www.reddit.com/r/Physics/comments/zd2apm/can_the_sphere_of_a_van_de_graaff_generator_also/",
        "text": "Hi guys,\n\nI have found this hoover that uses the principle of a van de graaff generator. Normally the generator generates positive charges in the sphere. My question is... if you change the triboelectric materials of the rollers... can you charge the sphere negatively to attract positively charged dust?\n\nhttps://preview.redd.it/xiv9mkm7t14a1.png?width=437&amp;format=png&amp;auto=webp&amp;s=ff4c357be3ab0f409924408496fd8bab619d2215",
        "created_utc": 1670232503,
        "upvote_ratio": 1.0
    },
    {
        "title": "Just wanted to share my most fav one!!",
        "author": "Jackfruiti",
        "url": "https://i.redd.it/mgvhodx9n14a1.png",
        "text": "",
        "created_utc": 1670230511,
        "upvote_ratio": 1.0
    },
    {
        "title": "Building a home kiln",
        "author": "GrahznyMalchik",
        "url": "https://www.reddit.com/r/Physics/comments/zd0jjt/building_a_home_kiln/",
        "text": "Hello Physics Redditors,\n\nI am planning on building a home kiln for firing pottery.\n\nThis will be a simple red brick structure with a clay based mortar.\n\nMy question is...\n\nCan I use the Venturi effect to increase, on demand, airflow to the wood fuel to raise the temperature quickly?\n\nCheers",
        "created_utc": 1670226345,
        "upvote_ratio": 1.0
    },
    {
        "title": "books?",
        "author": "eliocopter",
        "url": "https://www.reddit.com/r/Physics/comments/zcz3yd/books/",
        "text": "I'm in 10th grade (italy) and doing physics. Since my teacher is a bit too complex to follow and our book is either too simple and shallow in some topics or too difficult to understand and read I would like some other book reccomedations.\nWe've just finished Fluid balance and should start either light or movement, I've understood the first quite good but I don't know if it will be the same for the new topics.",
        "created_utc": 1670221452,
        "upvote_ratio": 1.0
    },
    {
        "title": "Help with an imaginary physics question..",
        "author": "steinmann81",
        "url": "https://www.reddit.com/r/Physics/comments/zcz3ob/help_with_an_imaginary_physics_question/",
        "text": "If I could make 2 portals that are both 10ft radius, and one portal is 20 ft underwater, and the other is on land, what is the flow rate, and how would that change at different depths?",
        "created_utc": 1670221427,
        "upvote_ratio": 1.0
    }
]