[
    {
        "title": "Yo",
        "author": "Rajesh_stha",
        "url": "https://i.redd.it/f6qmobu2a24a1.jpg",
        "text": "",
        "created_utc": 1670220168,
        "upvote_ratio": 1.0
    },
    {
        "title": "how to be interested in something ur terrible at",
        "author": "ririjen",
        "url": "https://www.reddit.com/r/Physics/comments/zcyhfd/how_to_be_interested_in_something_ur_terrible_at/",
        "text": "Yow! I'm one of the students who really suck at physics and at the same really hate it, maybe bcs i don't really grasp the idea? I just don't like it, even though I tried to. Here's the thing, i am an applied physics student!! It's not my choice, this was what offered to me, i am not to blame haha.\n\nWhat makes you interested at it? How to love this subject. Hoping to hear some of your stories. Thanks lads :')",
        "created_utc": 1670219551,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why exactly does this not work?",
        "author": "__DrEvil_",
        "url": "https://i.redd.it/gqpg8uhvw14a1.jpg",
        "text": "",
        "created_utc": 1670215726,
        "upvote_ratio": 1.0
    },
    {
        "title": "H20 Vapor Photon Emission",
        "author": "subjectivity_one",
        "url": "https://www.reddit.com/r/Physics/comments/zcvo0x/h20_vapor_photon_emission/",
        "text": "",
        "created_utc": 1670211099,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can we send information using shadows?",
        "author": "Potential-Ad-9066",
        "url": "https://www.reddit.com/r/Physics/comments/zcrexu/can_we_send_information_using_shadows/",
        "text": "[removed]",
        "created_utc": 1670200848,
        "upvote_ratio": 1.0
    },
    {
        "title": "Are holograms reversible?",
        "author": "Te_Luftwaffle",
        "url": "https://www.reddit.com/r/Physics/comments/zcr6rw/are_holograms_reversible/",
        "text": "Specifically, I'm wondering if it's possible to take a holographic grating that when illuminated produces a hologram, and shine the image at it instead and get the reference beam as a result. It could be a simple image like a circle or square, mainly I'm wondering if optical reversibility is true for holograms similarly to lenses and mirrors. \n\nA second, related question, could you reverse something like the double slit experiment by shining the interference pattern at the slits?",
        "created_utc": 1670200314,
        "upvote_ratio": 1.0
    },
    {
        "title": "At what point does the temperature of an object have an effect on its \"mass\"",
        "author": "germany_science_1",
        "url": "https://www.reddit.com/r/Physics/comments/zcpmpe/at_what_point_does_the_temperature_of_an_object/",
        "text": "So temperature is a measurement of the sum of the internal kinetic energy of an object. The mass of the object is the sum of the mass of all the particles within said object and the mass of any object is subject to the lorentz factor as determined by equated relativistic momentum with classical momentum. \n\nAt what point does an object like a star get hot enough such that the \"stationary\" mass of said object would be significantly lower than that of its \"relativistic mass\"? 100 billion? A trillion? Does this play a part into our measurements of the mass of celestial bodies like neutron stars or the accretion discs of black holes?",
        "created_utc": 1670196720,
        "upvote_ratio": 1.0
    },
    {
        "title": "Expanding of the universe vs. speed of light",
        "author": "mi-cah",
        "url": "https://www.reddit.com/r/Physics/comments/zcp7gl/expanding_of_the_universe_vs_speed_of_light/",
        "text": "I have been thinking, if speed of light is constant and  fastest speed of the universe, how is it possible that space is expanding faster?\n\nExample, lets say one galaxy is getting away from us someday so fast, that the light won't be visible anymore, it would gettin away from us faster and light won't come here anymore. If the distanse between two points are growing, how that doesn't mean it is traveling faster that speed of light? \n\nHow can distanse between dots be greater than the speed whivh light takes? Doesn't that violate the rule that soeed of loght is gastest thing in universe?\n\nCan some one explain lol",
        "created_utc": 1670195734,
        "upvote_ratio": 1.0
    },
    {
        "title": "at how many kilometres does water start to curve?",
        "author": "Arieljk",
        "url": "https://www.reddit.com/r/Physics/comments/zcorcp/at_how_many_kilometres_does_water_start_to_curve/",
        "text": "",
        "created_utc": 1670194712,
        "upvote_ratio": 1.0
    },
    {
        "title": "Idea for science fiction book",
        "author": "Verdict44",
        "url": "https://www.reddit.com/r/Physics/comments/zconxo/idea_for_science_fiction_book/",
        "text": "Is it plausible to suggest a copper coil placed deep into the earth, closer to the magnetic core, would generate a large enough current to power an average house, considering the inverse proportionality of the distance squared rule? You'd have to figure out a way to rotate the coil in the magnetic field, but I read that a stationary object on the earth's surface can generate some electricity depending on the material used. Read this in a 1912 journal. I don't know if it's real or not.",
        "created_utc": 1670194499,
        "upvote_ratio": 1.0
    },
    {
        "title": "Explanation of the double slit experiment behavior.",
        "author": "swinging_door",
        "url": "https://www.reddit.com/r/Physics/comments/zcnyn1/explanation_of_the_double_slit_experiment_behavior/",
        "text": "I’ve an extremely basic background in physics. I’ve been trying to wrap my head around the double slit experiment and I have a question for the quantum physicists here. \n\nDuring the experiment, could it be that the single electron traveling through the double slits is interacting with an invisible field that pushes the electron in space in a way so that when the electron lands it lands following the observed interference pattern?\n\nNow of course I’m obviously not smarter than the crazy number of physicists that studied this but I’m yet to hear a satisfying explanation and that’s how I explain the phenomenon to myself.",
        "created_utc": 1670192896,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is linear about linear coupled oscillators?",
        "author": "Muly2001",
        "url": "https://www.reddit.com/r/Physics/comments/zcnb29/what_is_linear_about_linear_coupled_oscillators/",
        "text": "Hello, I am doing a project about the wilberforce pendulum (Classical Mechanics) and was wondering what is linear about linear couple oscillators. \n\nIs the classic example of 2 masses and 3 springs attached to each other a linear coupled oscillator? The “coupled” term seem to come from the potential energy expression as 0.5*k*(x1-x2)^2, which to me does not seem linear since the coordinates are squared. \n\nAs I am researching the wilberforce pendulum I noticed people commonly describe a “linear coupleing term:  θ*z*C (where C is some constant). I am confused to where that exactly came from, can the same process be applied to the example above?\n\nThank you for your help!!!!!!!",
        "created_utc": 1670191481,
        "upvote_ratio": 1.0
    },
    {
        "title": "Particle Physics Simulation",
        "author": "andrelsn",
        "url": "https://www.reddit.com/r/Physics/comments/zcmqui/particle_physics_simulation/",
        "text": "Hi folks!!\n\nI made a classical N-body particle physics simulation that implements Newton's Law for gravity, Coulomb's Law for electromagnetism and various forms of nuclear force, all working together, and want to share with you.\n\nMy aim is to make a very simple simulation of the universe, where people can learn about physics, interact with the simulation and have fun.\n\nThis was made as a hobby project, but I studied a lot of classical and quantum physics, subjects that I love, to make this simulation more realistic and scientific. I hope that quantum mechanics and it's statistical nature is just the way we found to study and understand the nature of the universe at the scale of fundamental particles, but we may have a more simple underlying model, so all complexity emerges from simple rules, like Conway's Game of Life.\n\nHope you enjoy, and I would love to see your comments!!\n\nYou can access the simulation and have fun from your web browser: [https://andrenepomuceno.github.io/particle.js/](https://andrenepomuceno.github.io/particle.js/)\n\nScreenshots:\n\n[Emergent Nuclei](https://preview.redd.it/ak8o40br9y3a1.png?width=653&amp;format=png&amp;auto=webp&amp;s=21085232e371a1f65ffbb96744603d1d68a916b2)\n\n[Emergent Structures\\/Molecules](https://preview.redd.it/mcvh8095ay3a1.png?width=948&amp;format=png&amp;auto=webp&amp;s=262bb91c3e093f3d9fa4f0b473df931ca3976465)\n\n[Electromagnetic Field](https://preview.redd.it/0mnks19fay3a1.png?width=1034&amp;format=png&amp;auto=webp&amp;s=5d2d67bcef275e3c482175c8a41caaf899039b61)\n\n[Crystal \\(hexagonal structure\\) being hit by a electron beam](https://preview.redd.it/qsjpvxl7by3a1.png?width=1437&amp;format=png&amp;auto=webp&amp;s=63f6db21ab6399b3c105a4437e4250f7ef20f19f)\n\nPS: sorry if this isn't the right community!!",
        "created_utc": 1670190279,
        "upvote_ratio": 1.0
    },
    {
        "title": "Quantum Electrodynamics is Rotten to the Core - A critique of modern physics",
        "author": "tombos21",
        "url": "https://youtu.be/xaC_aKqjCXU",
        "text": "",
        "created_utc": 1670189767,
        "upvote_ratio": 1.0
    },
    {
        "title": "If we are the only civilisation in our solar system or like galaxy....",
        "author": "Penterius",
        "url": "https://www.reddit.com/r/Physics/comments/zclx7g/if_we_are_the_only_civilisation_in_our_solar/",
        "text": "[removed]",
        "created_utc": 1670188502,
        "upvote_ratio": 1.0
    },
    {
        "title": "It’s literally as cool as I expected to be",
        "author": "StillEntertainme",
        "url": "https://i.redd.it/08st8zzz5y3a1.png",
        "text": "",
        "created_utc": 1670188402,
        "upvote_ratio": 1.0
    },
    {
        "title": "Physicists uncover the massive quantum mysteries of black holes",
        "author": "Wanda-Fleker",
        "url": "https://www.guardianmag.us/2022/11/physicists-uncover-massive-quantum.html",
        "text": "",
        "created_utc": 1670187783,
        "upvote_ratio": 1.0
    },
    {
        "title": "Turned out exactly as I expected.",
        "author": "StillEntertainme",
        "url": "https://i.redd.it/3cn2oblt1y3a1.png",
        "text": "",
        "created_utc": 1670186978,
        "upvote_ratio": 1.0
    },
    {
        "title": "Would bouyancy affect this plane differently based on the rotation?",
        "author": "ohohmememan123",
        "url": "https://i.redd.it/5i67r6m5hz3a1.png",
        "text": "Bouyancy is caused from pressure deeper down, right? So would bouyancy be stronger on the left example?",
        "created_utc": 1670186228,
        "upvote_ratio": 1.0
    },
    {
        "title": "What would be the radius of gyration of a standard regulation tennis ball?",
        "author": "TestApe0971",
        "url": "https://www.reddit.com/r/Physics/comments/zcjggf/what_would_be_the_radius_of_gyration_of_a/",
        "text": "In terms of finding the gravitational inertia of a tennis ball for an at home experiment, does anybody know the radius of gyration for a standard tennis ball?",
        "created_utc": 1670183148,
        "upvote_ratio": 1.0
    },
    {
        "title": "Heated floors vs heated walls",
        "author": "FeralTeddyYT",
        "url": "https://www.reddit.com/r/Physics/comments/zcip58/heated_floors_vs_heated_walls/",
        "text": "Hello,\n\nthis is a question about heating, that would really need to be veryfied in an exmerimentm but I don't have the resources, so maybe someone here can answer my question.\n\nThe goal of heating my appartment is to feel warm.\n\nTo be clear, I just want to feel warm. I don't care about the actual temperature of the air, the floor, the ceiling or the walls of the appartment.\n\n**Conventional floor heating**\n\nConventional wisdom would dictate, that I heat the floors, since heat rises.\n\nFor the sake of simplicity, I will assume that a conventional floor heating uses most of it's energy to heat the air in the room, and everything that is on top of the floor by conduction. The air is carrying a lot of that heat away by convetion, so eventually ceiling and the walls will also heat up, untill eventually some kind of equilibrium is reached and the room is \"heated\".\n\nAs stated initially, I don't really care about the temperature of the walls  or the air in the room. I just want to feel warm. So how does heat enter my body?\n\nLet's say I am wearing well insulated foam slippers and the amount of heat that directly enters my body through conduction from the floor into my feet is negligable.\n\nIn that case, heat will primarily enter my body from conduction between the hot air in the room and radiation from the walls and ceiling, which have also been brought up to temperature.\n\n**Wall/Ceiling Heating**\n\nWhat if, instead of first heating up the air, which in turn heats up the walls, which in turn radiates the heat towards me, I directly generate radiation, by installing an array of infra red heating bulbs on the walls and painting the walls in IR-Reflective color?\n\nAt least at first, it should be possible to produce the same feeling of warmt, but only by radiating heat into my body, and without raising the actual temperature of the air or other \"stuff\" in my appartment.\n\n**Question 1:** Would it be possible to sustain that feeling of warmth at a lower overall energy cost, or will all the other stuff in my room eventually also heat up over time, leading to the same amount of energy consumption in a state of equilibrium?\n\n**Question 2:** If combined with some sort of \"smart-home\" presence sensor, wouldn't this technology save lot's of energy regardless? I could turn the IR radiation on and off very quickly, and the presense sensor could be used to automatically only turn the heat on, when I am in the room. Using an array of sensors and maybe some predictive AI, I could even dynamically turn off the lamps, which are not directly targeting me at any time. I could be walking around the appartment in a constand \"heat spotlight\", all while keeping the average temperature of the appartment very cold.\n\nIs there some big flaw in my Idea, or could this be a viable option to save tons of money on heating?",
        "created_utc": 1670181463,
        "upvote_ratio": 1.0
    },
    {
        "title": "What are some physics experiments that can never be done again?",
        "author": "Skrrubs",
        "url": "https://www.reddit.com/r/Physics/comments/zchpbl/what_are_some_physics_experiments_that_can_never/",
        "text": "I was wondering if there are any experiments that simply cannot be replicated today, meaning that the means of replication just do not exist or there is a law that does not allow for it, etc.",
        "created_utc": 1670179283,
        "upvote_ratio": 1.0
    },
    {
        "title": "Scientists May Have Unwittingly Spotted Planet Nine in Our Solar System",
        "author": "ScienceAstronomy007",
        "url": "https://www.sciandnature.com/2022/12/scientists-may-have-unwittingly-spotted.html",
        "text": "",
        "created_utc": 1670178383,
        "upvote_ratio": 1.0
    },
    {
        "title": "What level of precision would you need to roll a D20 and guarantee a roll of a specific number multiple times in a row?",
        "author": "ph30nix01",
        "url": "https://www.reddit.com/r/Physics/comments/zcgjif/what_level_of_precision_would_you_need_to_roll_a/",
        "text": "I mean if you had perfectly formed surfaces and a perfectly formed and weighted dice.  Is there a calculation or set of formulas that would allow that to be calculated but without intervention after throwing.",
        "created_utc": 1670176784,
        "upvote_ratio": 1.0
    },
    {
        "title": "How high would a tank bullet go pointing straight up?",
        "author": "bunny_eater10",
        "url": "https://www.reddit.com/r/Physics/comments/zcfajy/how_high_would_a_tank_bullet_go_pointing_straight/",
        "text": "[removed]",
        "created_utc": 1670173972,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can someone help me solve this please",
        "author": "Embarrassed-Amoeba48",
        "url": "https://i.redd.it/opb8lqnpey3a1.jpg",
        "text": "",
        "created_utc": 1670173299,
        "upvote_ratio": 1.0
    },
    {
        "title": "DATA - Trajectory of a soccer ball",
        "author": "Kantwoo",
        "url": "https://www.reddit.com/r/Physics/comments/zcdkep/data_trajectory_of_a_soccer_ball/",
        "text": "Hello everyone,\n\nI am currently taking a dynamics course for my studies, and I have to do a simulation project.\n\nIt's a football shooting simulator, with the possibility to put a spin to have an effect on the trajectory.\n\nI'm not asking you for help to make this simulation, it's done on my side.\n\nHowever I would need the trajectories ( x,y,z position in function of time )of the balls at the time of the penalties, corner, free kick, ...\n\nThis would allow me to validate my model (or not ;) )\n\nI did some research on the internet but I didn't find anything, that's why I come here to listen to your advice\n\nThank you very much",
        "created_utc": 1670170067,
        "upvote_ratio": 1.0
    },
    {
        "title": "Bachelor's degree in Physics professional/academic opportunities",
        "author": "AlRuNo56",
        "url": "https://www.reddit.com/r/Physics/comments/zcb04z/bachelors_degree_in_physics_professionalacademic/",
        "text": "I have started my physics degree this year, my idea is to lean towards the electronics sector, as part of my fourth year electives are focused on this. Lately I have been thinking if the physics degree will give me the same or more possibilities to work in this sector compared to a degree like electronic/electrical engineering or what types of jobs will I be able to do in this sector. \n\nCan anyone tell me ?",
        "created_utc": 1670163943,
        "upvote_ratio": 1.0
    },
    {
        "title": "Big Discovery! A Gas Giant Exoplanet Has Been Discovered With Twice The Density of Earth",
        "author": "science-driver",
        "url": "https://www.sciencedriver.co.in/2022/12/big-discovery-gas-giant-exoplanet-has.html",
        "text": "",
        "created_utc": 1670163082,
        "upvote_ratio": 1.0
    },
    {
        "title": "Join the cern hole 📡",
        "author": "BigCernReptilian",
        "url": "https://i.redd.it/jm6hcb52ax3a1.jpg",
        "text": "",
        "created_utc": 1670159626,
        "upvote_ratio": 1.0
    },
    {
        "title": "Hawking radiation",
        "author": "PewdsIndianFans",
        "url": "https://jila.colorado.edu/~ajsh/bh/hawk.html",
        "text": "",
        "created_utc": 1670157013,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does anyone knows how to solve these? Please I need help",
        "author": "Scared-Safe6932",
        "url": "https://i.redd.it/ojwc2yp30x3a1.jpg",
        "text": "",
        "created_utc": 1670156279,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why don't people consider this less-absurd version of a hyperloop? Atmosphere-level pressurized air, with somewhat pressurized air in the back.",
        "author": "XCuteManlinessMLGX",
        "url": "https://i.imgur.com/Tli43dT.png",
        "text": "",
        "created_utc": 1670153541,
        "upvote_ratio": 1.0
    },
    {
        "title": "Physicists Simulated a Black Hole in Lab to Test a Stephen Hawking Theory",
        "author": "Wanda-Fleker",
        "url": "https://www.guardianmag.us/2022/11/physicists-simulated-black-hole-in-lab.html",
        "text": "",
        "created_utc": 1670149621,
        "upvote_ratio": 1.0
    },
    {
        "title": "Do emergent properties exist in a reductionist universe?",
        "author": "toneillprod",
        "url": "https://www.reddit.com/r/Physics/comments/zc3ve9/do_emergent_properties_exist_in_a_reductionist/",
        "text": "As I understand it physicists mostly consider the universe to be fundamentally reductionist. Does this mean that all observable properties of a given object are merely cognitive distinctions that are salient to us in our frame of reference, but ultimately depend solely on the states of the fundamental particles of which the object is comprised? Or do distinct properties emerge that govern the behavior of a given object as a result of larger structures that cannot be explained solely by the state of its fundamental particles?\nSorry if that’s a little convoluted",
        "created_utc": 1670140385,
        "upvote_ratio": 1.0
    },
    {
        "title": "A new theory posits that lightning ‘zigzags’ are formed by the excitation of oxygen molecules (into a metastable state) that accumulate to shape a column of ‘steps’",
        "author": "marketrent",
        "url": "https://theconversation.com/why-does-lightning-zigzag-at-last-we-have-an-answer-to-the-mystery-195549",
        "text": "",
        "created_utc": 1670140156,
        "upvote_ratio": 1.0
    },
    {
        "title": "Candle burning in water inside glass- Simple physics experiment for kids....",
        "author": "Homemade-projects",
        "url": "https://youtu.be/YKbC-V6Pfyk",
        "text": "",
        "created_utc": 1670127749,
        "upvote_ratio": 1.0
    },
    {
        "title": "Question about energy and force in non-isolated systems.",
        "author": "HardGayMan",
        "url": "https://i.redd.it/6a79dpkqeu3a1.jpg",
        "text": "",
        "created_utc": 1670124885,
        "upvote_ratio": 1.0
    },
    {
        "title": "Neil deGrasse Tyson",
        "author": "Puzzled_Term7903",
        "url": "https://www.reddit.com/r/Physics/comments/zby9a3/neil_degrasse_tyson/",
        "text": "What do professional physicist think of Neil? I personally love him for his communication style.",
        "created_utc": 1670121730,
        "upvote_ratio": 1.0
    },
    {
        "title": "Fireworks and their ability to burn. See text",
        "author": "jaysces",
        "url": "https://www.reddit.com/r/Physics/comments/zbwppj/fireworks_and_their_ability_to_burn_see_text/",
        "text": "I have seen a multitude of videos where people are using fireworks in a manner deemed unsafe. \n\n1. Shooting them at each other. \n2. Launching them with the stick presumably in their anus\n3. Throwing them around once lit. \n4. Holding them as they fire towards each other. \n\nEtc. Etc.\n\nWhy are they not severely burned, thus discouraging others?",
        "created_utc": 1670117231,
        "upvote_ratio": 1.0
    },
    {
        "title": "How Physicists Created a Holographic Wormhole in a Quantum Computer",
        "author": "GuiGeeKang",
        "url": "https://youtu.be/uOJCS1W1uzg",
        "text": "",
        "created_utc": 1670116168,
        "upvote_ratio": 1.0
    },
    {
        "title": "Physics questions...",
        "author": "AHummusEnthusiast",
        "url": "https://www.reddit.com/r/Physics/comments/zbtyw4/physics_questions/",
        "text": "What is the physical significance of the SLOPE of \\[velocity\\^2 vs position\\] and \\[position vs time\\^2\\] graphs?\n\nAlso, the physical significance of the area under the line of a velocity vs time graph is displacement right?\n\nIf you can't tell, I have a test soon.",
        "created_utc": 1670109700,
        "upvote_ratio": 1.0
    },
    {
        "title": "Trying to calculate amplitude from power of a given frequency",
        "author": "pythonwiz",
        "url": "https://www.reddit.com/r/Physics/comments/zbs0vf/trying_to_calculate_amplitude_from_power_of_a/",
        "text": "I'm working on some hobby software that creates music and I want to use samples I take with my microphone to produce waveforms that I can represent in a table. I've used Audacity to create a power spectrum from a sample and saving it as a text file gives me a list of decibels and frequencies. My idea is to set the amplitude of the fundamental to 1.0 and then to use the relative power ratios of each of the harmonics to compute their frequency. And that is where I am stuck.  \n\n\nI don't know how to convert a power ratio into an amplitude ratio, because I don't know how power and amplitude relate to each other in sound waves.",
        "created_utc": 1670104818,
        "upvote_ratio": 1.0
    },
    {
        "title": "Would a rubber ball filled with water maintain its shape descending to deep ocean water?",
        "author": "breadrandom",
        "url": "https://www.reddit.com/r/Physics/comments/zbq2vt/would_a_rubber_ball_filled_with_water_maintain/",
        "text": "Water compresses minimally so presumably the sphere would get slight smaller. But would the rubber ball maintain integrity or grow flatter as it descended?",
        "created_utc": 1670100052,
        "upvote_ratio": 1.0
    },
    {
        "title": "How exactly do surface plasmon polaritons enhance light-matter interactions?",
        "author": "physicsman12345",
        "url": "https://www.reddit.com/r/Physics/comments/zbpypl/how_exactly_do_surface_plasmon_polaritons_enhance/",
        "text": "",
        "created_utc": 1670099768,
        "upvote_ratio": 1.0
    },
    {
        "title": "how does voltage increase the power of a solenoid even though voltage is not in the solenoid force education?",
        "author": "curbei",
        "url": "https://www.reddit.com/r/Physics/comments/zbnqn3/how_does_voltage_increase_the_power_of_a_solenoid/",
        "text": "",
        "created_utc": 1670094210,
        "upvote_ratio": 1.0
    },
    {
        "title": "Which University has physics phd program with high acceptance rate (preferably in the u.s)?",
        "author": "makrobeki",
        "url": "https://www.reddit.com/r/Physics/comments/zbnd2w/which_university_has_physics_phd_program_with/",
        "text": "[removed]",
        "created_utc": 1670093253,
        "upvote_ratio": 1.0
    },
    {
        "title": "Standing waves, laminar or turbulent flow?",
        "author": "stfu0101",
        "url": "https://www.reddit.com/r/Physics/comments/zbn73i/standing_waves_laminar_or_turbulent_flow/",
        "text": "When you blow air in a flute or recorder, is a standing wave produced? Or is it disoriented like laminar or turbulent flow?\n\nIf it is the latter, how do you find the velocity of the airstream?",
        "created_utc": 1670092830,
        "upvote_ratio": 1.0
    },
    {
        "title": "Electric Field vs Electric Force Question",
        "author": "driedalbumen",
        "url": "https://www.reddit.com/r/Physics/comments/zblmze/electric_field_vs_electric_force_question/",
        "text": "Hi, I know this question is not great, but I just really can't grasp how an Electric Field is different from an Electric Force because to me they are quite similar.",
        "created_utc": 1670088868,
        "upvote_ratio": 1.0
    },
    {
        "title": "The 4 Qiskit Quantum Computing Bell States That You NEED to Know (Constructed for CNOT / X / Z / H)",
        "author": "dogpup3",
        "url": "https://youtu.be/F1ZihsaAvfM",
        "text": "",
        "created_utc": 1670088034,
        "upvote_ratio": 1.0
    },
    {
        "title": "what are the most fascinating things about physics you can tell to someone who doesn't know much about physics?",
        "author": "ItsFahrenheit",
        "url": "https://www.reddit.com/r/Physics/comments/zbky23/what_are_the_most_fascinating_things_about/",
        "text": "I'm about to get my physics undergrad degree and yesterday I was having dinner with some friends and they asked to talk abou something fascinating about physics. I honestly didn't know what to say, I told them about Bell's paradox but thinking about it I don't think it really is that special if you don't know the math behind it. I think the same goes for most of quantum mechanics so maybe thermodynamics (I think the heat death of the universe would be cool and it isn't math dependent). What are some really cool things about physics (not math dependent) to tell your friends?",
        "created_utc": 1670087092,
        "upvote_ratio": 1.0
    },
    {
        "title": "Could I weaponize beta particles produced from electromagnetic flux",
        "author": "smhgang",
        "url": "https://www.reddit.com/r/Physics/comments/zbkuw7/could_i_weaponize_beta_particles_produced_from/",
        "text": "",
        "created_utc": 1670086856,
        "upvote_ratio": 1.0
    },
    {
        "title": "Hello everyone, can someone help me figure out what each symbol is for so i can build this amplifier and make a microphone out of a lighter",
        "author": "DDJ0",
        "url": "https://i.redd.it/44878y3a0r3a1.jpg",
        "text": "",
        "created_utc": 1670083697,
        "upvote_ratio": 0.8
    },
    {
        "title": "How probable is multiple universes?",
        "author": "deviantmoth",
        "url": "https://www.reddit.com/r/Physics/comments/zbjmdk/how_probable_is_multiple_universes/",
        "text": "So imagine our entire universe is a sphere. Outside of this sphere is nothingness for an unthinkable number of light years. But after travelling an unimaginable distance from our universe, there is another sphere containing a universe. \n\nWhat I'm asking is what is more probable, one universe or numerous perhaps infinite universes? There are no barriers in space. It doesn't end. So there must be some activity going on outside of our universe right? Our big bang cant be the whole thing in the void since the void is infinite right?",
        "created_utc": 1670083445,
        "upvote_ratio": 1.0
    },
    {
        "title": "If you were on an object traveling the speed of light and then started walking on it does that mean you’re traveling than the speed of light?",
        "author": "road35ox",
        "url": "https://www.reddit.com/r/Physics/comments/zbjg68/if_you_were_on_an_object_traveling_the_speed_of/",
        "text": "",
        "created_utc": 1670083011,
        "upvote_ratio": 1.0
    },
    {
        "title": "A Star Is Born: James Webb Captures Hourglass Shaped Birth Of A Star",
        "author": "Aggressive_Emu_5463",
        "url": "https://www.indiatimes.com/technology/science-and-future/james-webb-hourglass-shaped-birth-of-star-585034.html",
        "text": "",
        "created_utc": 1670074914,
        "upvote_ratio": 1.0
    },
    {
        "title": "Any tips on how to calculate the mass of objects using string theory.",
        "author": "Felt_Tooth",
        "url": "https://www.reddit.com/r/Physics/comments/zbexka/any_tips_on_how_to_calculate_the_mass_of_objects/",
        "text": "",
        "created_utc": 1670069648,
        "upvote_ratio": 1.0
    },
    {
        "title": "Find a general solution for x, amplitude",
        "author": "vangen99",
        "url": "https://www.reddit.com/r/Physics/comments/zbdler/find_a_general_solution_for_x_amplitude/",
        "text": "[removed]",
        "created_utc": 1670064431,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why are seconds considered the reciprocal of Hertz and vice versa?",
        "author": "falafelwaffle55",
        "url": "https://www.reddit.com/r/Physics/comments/zbb90v/why_are_seconds_considered_the_reciprocal_of/",
        "text": "I came across this notation in my chemistry class and I'm curious as why it's written/thought of this way. Apologies if this isn't the right place to ask this. Some examples:\n\ns^-1 or Hz\njoule•hertz^-1 or joule•seconds\nspeed of light given as 3.00x10^8 ms^-1",
        "created_utc": 1670054848,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why renowned science media outlets promoting so much nonsense like string theory,multiverse and quantum computing ,etc.? even after so much criticism. Is the physics community in crisis?",
        "author": "Low_Butterscotch_408",
        "url": "https://www.reddit.com/r/Physics/comments/zbb32z/why_renowned_science_media_outlets_promoting_so/",
        "text": "",
        "created_utc": 1670054207,
        "upvote_ratio": 1.0
    },
    {
        "title": "Confined Containers and Explosions",
        "author": "le-phallus-phattener",
        "url": "https://www.reddit.com/r/Physics/comments/zbac3k/confined_containers_and_explosions/",
        "text": "Hi, why is it that strongly confined containers (such as metal cans) are more susceptible to exploding than if they were made of a less rigid material? It's not as if it is adding more energy, so why is it that they are more dangerous? Is it simply because they let pressure build up more before giving way, thus releasing their internal energy at a faster rate (i.e. more force but less time), or is there a different reason? Thanks",
        "created_utc": 1670051305,
        "upvote_ratio": 1.0
    },
    {
        "title": "Calculation of the Big Bang timing",
        "author": "UmassAmherst",
        "url": "https://www.reddit.com/r/Physics/comments/zba6wy/calculation_of_the_big_bang_timing/",
        "text": "Non physics or astronomy major here - let me know if this is the wrong subreddit. It’s estimated that the Big Bang occurred 13.8 billion years ago. How was that measured? Is that calculated by the furthest objects we can see based on speed of light? Is the universes rate of expansion greater than the speed of light? If time can be measured differently under different conditions why are we using (earth?) “years”, is there a better measurement figure to put on it? As a follow up, if everything is continuously moving outwards, is there a way to determine the relative location of the Big Bang?",
        "created_utc": 1670050795,
        "upvote_ratio": 1.0
    },
    {
        "title": "Physicochemical Hydrodynamics vs Transport Phenomena",
        "author": "kixstrla123",
        "url": "https://www.reddit.com/r/Physics/comments/zba2kx/physicochemical_hydrodynamics_vs_transport/",
        "text": "What is the difference between these two fields? There descriptions seem so similar.",
        "created_utc": 1670050326,
        "upvote_ratio": 1.0
    },
    {
        "title": "Share your opinion freely",
        "author": "kathackerman",
        "url": "https://www.reddit.com/r/Physics/comments/zb8uel/share_your_opinion_freely/",
        "text": "Hey homies! how do ya guys feel abt physics?",
        "created_utc": 1670045978,
        "upvote_ratio": 1.0
    },
    {
        "title": "The Rubik's Cube - one of the world's best selling toys - is a 3-D puzzle that was invented by Hungarian professor of architecture Ernő Rubik in 1974. There are 43,252,003,274,489,856,000 possible arrangements of the cube!",
        "author": "Aadarshj688",
        "url": "https://i.redd.it/xiu9bgs7qn3a1.jpg",
        "text": "",
        "created_utc": 1670043992,
        "upvote_ratio": 1.0
    },
    {
        "title": "Center of gravity",
        "author": "Individual_One2696",
        "url": "https://www.reddit.com/r/Physics/comments/zb82zb/center_of_gravity/",
        "text": "I am fairly new to physics and I am currently studying center of gravity in which I have a doubt \n\nCenter of gravity is the point where the entire wight of body is acted on. How is it possible for it to be outside of the material of the body, more precisely, how does the whole weight of the body act outside the body\n\nIt is just the logical evaluation that the center of gravity of a ring is its center\n\nThe only possible explanation in my scope of knowledge is that we ignore the spaces and take the object in it's 2d or 3d plane",
        "created_utc": 1670043404,
        "upvote_ratio": 1.0
    },
    {
        "title": "Are any renewable energy sources carbon neutral? And if not, how does it compare to fossil fuel efficient machines?",
        "author": "jowame",
        "url": "https://www.reddit.com/r/Physics/comments/zb5s6s/are_any_renewable_energy_sources_carbon_neutral/",
        "text": "I am not a physics major or anything, but I did take a \"physics of energy\" course at university once. I seem to remember a project where we had to try and calculate all carbon emissions involved in producing a solar panel (as well as a wind turbine, a hydroelectric dam, nuclear, etc). There could be no externalities in the carbon accounting and we were encouraged to be as accurate as possible. Each group got a different renewable.\n\nWe accounted for carbon from mining-&gt;manufacturing-&gt;transporting-&gt;assembling-&gt;maintaining and weighed that carbon output against the expected energy output before the end of the expected lifespan of the infrastructure. \n\nI seem to remember wind turbines (my group) having a similar carbon-energy ratio to a fossil fuel-efficient generator when carbon from all the way down the timeline had been considered. \n\nDoes that sound true? \n\nAre there any numbers or resources on this topic or a place to make these comparisons along similar lines?",
        "created_utc": 1670036048,
        "upvote_ratio": 1.0
    },
    {
        "title": "what does it mean for p orbitals to not be unique?",
        "author": "Previous-Scheme-5949",
        "url": "https://www.reddit.com/r/Physics/comments/zb5agu/what_does_it_mean_for_p_orbitals_to_not_be_unique/",
        "text": "So, I started college just last month, and i took Physical Chemistry 101. We started with quantum mechanics. While teaching us about the atomic orbitals , our professor told us that p orbitals are not unique. What exactly does he mean by that?\n\nI get the mathematical part of it, i.e I know how to prove it. But what is really the physical significance of it?\n\nI realize that  quantum mechanics has more to do with physics than chemistry, that's why I am posting it here.",
        "created_utc": 1670034558,
        "upvote_ratio": 1.0
    },
    {
        "title": "Question This might be a dumb question but I’m newer to physics but I’m trying to figure out the speed that a race car that I’m making would spin out going around a corner any formulas that I should use in particular. Thanks",
        "author": "HopefulSurround7740",
        "url": "https://www.reddit.com/r/Physics/comments/zb4fvs/question_this_might_be_a_dumb_question_but_im/",
        "text": "",
        "created_utc": 1670032064,
        "upvote_ratio": 1.0
    },
    {
        "title": "Entropy and the End of the Universe",
        "author": "Sensitive-Fly-2847",
        "url": "https://www.reddit.com/r/Physics/comments/zb3nqf/entropy_and_the_end_of_the_universe/",
        "text": "I hope I can phrase my question properly! I am reading one of my favorite science author/physicist’s latest book (Brian Greene’s Until the End of Time). In it, he talks a lot about entropy. My understanding of entropy is that systems with low entropy are characterized by high order and high entropy is represented by disarray and disorder (from a human perspective). \n\nIf I were to show a table full of coins where the coins were perfectly spaced out and even from one another, that would seem to suggest a highly ordered system and hence, low entropy, correct?\n\nThe second law of thermodynamics says that systems always migrate towards higher entropy until finally arriving at the highest entropic state.\n\nSo, assuming my understanding of this is correct (and please correct me if I’m mistaken), looking towards the predicted endless expansion of the universe and extrapolating out the absolute end result; would that not result in all atoms/particles in the universe being completely equidistant from one another? Much as the coins on the table, would this not be considered a state of low entropy? If so, how is this not a violation of the second law?\n\nThanks for any info people can provide on clearing this up! Fascinating topic! Wish I were smart enough to do physics, lol",
        "created_utc": 1670029755,
        "upvote_ratio": 1.0
    },
    {
        "title": "Wave solution to the photoelectroc effect",
        "author": "In2infinity333",
        "url": "https://www.reddit.com/r/Physics/comments/zb2dpy/wave_solution_to_the_photoelectroc_effect/",
        "text": "Hello everyone,\n\nI have just been re-examining the photoelectric effect, and have found a new solution which does not require the photon particle of light or the Planck constant. The equation is:\n\nfW² = c/2\n\nWhere f is the threshold frequency, W is the work function, and c is the speed of light. Strangely, I can’t seem to find this notion in any of the scientific literature. Does anyone know if this equation has been previously recognised?",
        "created_utc": 1670026111,
        "upvote_ratio": 1.0
    },
    {
        "title": "newton laws of cooling and hot tub",
        "author": "LumpyPreparation2707",
        "url": "https://www.reddit.com/r/Physics/comments/zb1zn5/newton_laws_of_cooling_and_hot_tub/",
        "text": "A bit of a conundrum for my brain : \n\nShould i keep my hot tub at 100 Fahrenheit (37.7 celsius) 24/7 or should i reduce the heat for aprx 20 hours and only reheat for two hours. \n\nAt -5 celsius my hot tub takes 20 hours to get from 100 Fahrenheit to 90 (it’s well insulated). it takes about 2 hours to heat back at 100 Fahrenheit. i use the hot tub 4 times a week in average. \n\nhot tub works on 240 volts and electricity cost is 9 cents per kilowatt/h. i live in canada (quebec) which has very cold winters. \n\ni’ve been trying to calculate the pros and cons by notably using newtons laws of cooling but i think there’s something missing (notably the heater btu or heating for the hot tub) \n\nwhat’s your opinion about it ? keep the damn thing at 100 or continue cooling and heating it like i’m doing ? \n\nthanks for your insight.",
        "created_utc": 1670025069,
        "upvote_ratio": 1.0
    },
    {
        "title": "Google’s Sycamore chip: no wormholes, no superfast classical simulation either",
        "author": "Sampo",
        "url": "https://scottaaronson.blog/?p=6871",
        "text": "",
        "created_utc": 1670024772,
        "upvote_ratio": 1.0
    },
    {
        "title": "How should physics be taught?",
        "author": "Zealousideal_Ad2924",
        "url": "https://www.reddit.com/r/Physics/comments/zb08d7/how_should_physics_be_taught/",
        "text": "I am a student learning physics and wanted to know how/where should I start. I know that all the modern textbooks and stuff start with kinematics and then newtons laws, but is that the most beneficial order, and if so could someone let me know why? Should I learn both physics 1 and 2 at the same time, like mix the concepts together? Should I do electricity and magnetism and that fun stuff?",
        "created_utc": 1670020690,
        "upvote_ratio": 1.0
    },
    {
        "title": "Mir Publishers, Arabic Translation. If anyone has scanlation please upload it to archive .org",
        "author": "UnluckyRepublic93",
        "url": "https://www.reddit.com/r/Physics/comments/zayis6/mir_publishers_arabic_translation_if_anyone_has/",
        "text": "",
        "created_utc": 1670016993,
        "upvote_ratio": 1.0
    },
    {
        "title": "For those of you who watch physics oriented YouTube channels, what kind of content do you wish you saw more of?",
        "author": "macaqueislong",
        "url": "https://www.reddit.com/r/Physics/comments/zaye33/for_those_of_you_who_watch_physics_oriented/",
        "text": "I’m an undergraduate student who is majoring in physics. Naturally I spend a lot of time on YouTube seeking supplemental instruction, news, and entertainment related to the field. I’m at the point where there’s not very much content for my upper level classes. As the classes get harder it seems like it’s harder to find YouTubers willing to make videos on these subjects. Either that, or it’s really watered down and meant for lay people. \n\nI’d like to see more YouTube content explaining things like statistical mechanics, Lagrangian mechanics, relativity, and quantum. I’d especially like to see problems solved with real life examples. \n\nWhat would y’all like to see more of?",
        "created_utc": 1670016729,
        "upvote_ratio": 1.0
    },
    {
        "title": "Theoretical Condensed Matter Physics",
        "author": "Western-Elevator-456",
        "url": "https://www.reddit.com/r/Physics/comments/zax4t9/theoretical_condensed_matter_physics/",
        "text": "I am interested in what the more theoretical side of condensed matter physics \"looks like.\" Are there go-to texts or seminal papers that would be good for someone with a pretty decent physics education (I've been through classics in the major topics like thermal, E&amp;M and quantum) but very little additional knowledge of condensed matter?",
        "created_utc": 1670014056,
        "upvote_ratio": 1.0
    },
    {
        "title": "Causality in F=ma",
        "author": "Western-Elevator-456",
        "url": "https://www.reddit.com/r/Physics/comments/zax36c/causality_in_fma/",
        "text": " In his book \"The Biggest Ideas in the Universe: Space, Time, and Motion\" and the accompanying solo podcast Sean Carroll says that there is no causality represented in F=ma. He doesn't spend much time on the claim, but he does make it explicitly and then say that it's because the equation is symmetric/goes-both-ways. This isn't the claim verbatim but it is very close. This statement seems very bizarre to me. Is there some definition of causality that dis-allows bi-directional cause and effect?",
        "created_utc": 1670013943,
        "upvote_ratio": 1.0
    },
    {
        "title": "if we are sharing superconducting stuff right now, here's a shot from one of my lab courses.",
        "author": "TheRealSlimShady0812",
        "url": "https://i.redd.it/ycz0b3e62l3a1.jpg",
        "text": "",
        "created_utc": 1670011696,
        "upvote_ratio": 1.0
    },
    {
        "title": "Special Relativity Question",
        "author": "Mediacom99EB",
        "url": "https://www.reddit.com/r/Physics/comments/zauytc/special_relativity_question/",
        "text": "I'm pretty confused about this: Lorentz Transformation are made only to work between inertial frames of reference, which means their relative velocity is constant, but then we define 4-velocity and 4-acceleration considering the velocity inside the gamma factor as a function of time. What am i missing ?",
        "created_utc": 1670009043,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to Build a Quantum Computer with One Million Qubits",
        "author": "OilNational178",
        "url": "https://youtu.be/SD6TH7GZ1rM",
        "text": "",
        "created_utc": 1670008082,
        "upvote_ratio": 1.0
    },
    {
        "title": "My 3rd year Engineering roommate made a super conducter",
        "author": "SShookyy",
        "url": "https://i.redd.it/i5tpx2lybk3a1.gif",
        "text": "",
        "created_utc": 1670002876,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is flame spectrometry?",
        "author": "EmpressSlick",
        "url": "https://www.reddit.com/r/Physics/comments/zaq4vf/what_is_flame_spectrometry/",
        "text": "What is flame spectrometry and how is it used by physicists and chemists? \n\nI’ve been doing a lot of research but I don’t think I’m understanding. \n\nAre flame spectrometry and flame photometry the same?",
        "created_utc": 1669997572,
        "upvote_ratio": 1.0
    },
    {
        "title": "We regard to applications in artificial intelligence, quantum computer’s capacity to analyse enormous data sets, simulate intricate models and swiftly resolve optimization issues has attracted interest.",
        "author": "science-driver",
        "url": "https://www.sciencedriver.co.in/2022/11/what-are-uses-of-quantum-processors.html",
        "text": "",
        "created_utc": 1669997057,
        "upvote_ratio": 1.0
    },
    {
        "title": "Any good lecture series for analytical/Lagrangian/classical mechanics?",
        "author": "-Oakton-",
        "url": "https://www.reddit.com/r/Physics/comments/zapqiz/any_good_lecture_series_for/",
        "text": "I want to try to self study classical mechanics because I wont have a chance to take it until my last year at uni. I know there are a lot of good textbooks on the subject, but I learn best if I can watch lectures too. Do you have any recommendations?",
        "created_utc": 1669996580,
        "upvote_ratio": 1.0
    },
    {
        "title": "Textbooks &amp; Resources - Weekly Discussion Thread - December 02, 2022",
        "author": "AutoModerator",
        "url": "https://www.reddit.com/r/Physics/comments/zan0ws/textbooks_resources_weekly_discussion_thread/",
        "text": "This is a thread dedicated to collating and collecting all of the great recommendations for textbooks, online lecture series, documentaries and other resources that are frequently made/requested on /r/Physics.\n\nIf you're in need of something to supplement your understanding, please feel welcome to ask in the comments.\n\nSimilarly, if you know of some amazing resource you would like to share, you're welcome to post it in the comments.",
        "created_utc": 1669989609,
        "upvote_ratio": 1.0
    },
    {
        "title": "I have colleagues freaking out that AI generators mean the end of homework assignments. I feel that may be true someday, that day isn’t today…",
        "author": "Andromeda321",
        "url": "https://i.redd.it/8gtl659a8j3a1.jpg",
        "text": "",
        "created_utc": 1669989533,
        "upvote_ratio": 1.0
    },
    {
        "title": "A question about hydrogen",
        "author": "Pale-Incident-9645",
        "url": "https://www.reddit.com/r/Physics/comments/zamu5y/a_question_about_hydrogen/",
        "text": "[removed]",
        "created_utc": 1669989124,
        "upvote_ratio": 1.0
    },
    {
        "title": "Webb telescope",
        "author": "uyenlugia",
        "url": "https://www.reddit.com/r/Physics/comments/zak02l/webb_telescope/",
        "text": "[removed]",
        "created_utc": 1669981877,
        "upvote_ratio": 1.0
    },
    {
        "title": "Physicists Simulated a Wormhole and successfully Teleported Quantum Data",
        "author": "Wanda-Fleker",
        "url": "https://www.guardianmag.us/2022/12/physicists-simulated-wormhole-and.html",
        "text": "",
        "created_utc": 1669977672,
        "upvote_ratio": 1.0
    },
    {
        "title": "Interesting result: superconducting electrons are not interchangeable with normal electrons in the momentum space for seconds.",
        "author": "Stanislav-Dolgopolov",
        "url": "https://www.nature.com/articles/s41567-021-01433-7",
        "text": "",
        "created_utc": 1669973315,
        "upvote_ratio": 1.0
    },
    {
        "title": "Physicists observe wormhole dynamics using a quantum computer",
        "author": "meanmarzi",
        "url": "https://www.caltech.edu/about/news/physicists-observe-wormhole-dynamics-using-a-quantum-computer",
        "text": "",
        "created_utc": 1669971526,
        "upvote_ratio": 1.0
    },
    {
        "title": "Horizontal release",
        "author": "Pimenta-87491",
        "url": "https://www.reddit.com/r/Physics/comments/zaf61p/horizontal_release/",
        "text": "Hi I am a student in Portugal and I have to tell my teacher how to make an experience, horizontal release, where I relate the inicial speed of the object with his range. I have to tell him which material I am going to use and the procedure. \nMay someone help me?",
        "created_utc": 1669966697,
        "upvote_ratio": 1.0
    },
    {
        "title": "I have a uh.. project due tomorrow it’s currently 12 am. I waited last minute but as well I’ve just had a hard time thinking of a structure to do.We have limited materials we can use and the egg needs to survive when it is dropped at a certain height at 5 ft atleast.ideas to make it more cushy?",
        "author": "Throwawayac_0",
        "url": "https://i.redd.it/h4r4r5jjzg3a1.jpg",
        "text": "",
        "created_utc": 1669962382,
        "upvote_ratio": 1.0
    },
    {
        "title": "AP physics 1 question",
        "author": "YSK_428",
        "url": "https://www.reddit.com/r/Physics/comments/za93nf/ap_physics_1_question/",
        "text": "[removed]",
        "created_utc": 1669949628,
        "upvote_ratio": 1.0
    },
    {
        "title": "Please Help - AP Physics 1 question",
        "author": "YSK_428",
        "url": "https://www.reddit.com/r/Physics/comments/za8zhk/please_help_ap_physics_1_question/",
        "text": "[removed]",
        "created_utc": 1669949337,
        "upvote_ratio": 1.0
    },
    {
        "title": "Changing the color of quantum light on an integrated chip",
        "author": "meanmarzi",
        "url": "https://seas.harvard.edu/news/2022/12/changing-color-quantum-light-integrated-chip",
        "text": "",
        "created_utc": 1669948735,
        "upvote_ratio": 1.0
    },
    {
        "title": "近年来，美国一直在通过里应外合的方式对中国发动舆论战",
        "author": "Character_Pay0",
        "url": "https://www.reddit.com/r/Physics/comments/za7fa0/近年来美国一直在通过里应外合的方式对中国发动舆论战/",
        "text": "[removed]",
        "created_utc": 1669945675,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is any of these calculations of the moment of inertia of a solid sphere wrong, which one is it?",
        "author": "Valuable_Ad_1476",
        "url": "https://www.reddit.com/gallery/za5wis",
        "text": "",
        "created_utc": 1669942129,
        "upvote_ratio": 1.0
    },
    {
        "title": "Crucial Computer Program for Particle Physics at Risk of Obsolescence | Quanta Magazine",
        "author": "carbonqubit",
        "url": "https://www.quantamagazine.org/crucial-computer-program-for-particle-physics-at-risk-of-obsolescence-20221201/",
        "text": "",
        "created_utc": 1669941619,
        "upvote_ratio": 1.0
    }
]