[
    {
        "title": "Can someone explain what physicists mean by information?",
        "author": "LN2Guru",
        "url": "https://www.reddit.com/r/Physics/comments/zrdxet/can_someone_explain_what_physicists_mean_by/",
        "text": "Can someone please explain to me in a simple and clear way what physicists mean by information, specifically as it relates to black holes. I have heard the term mentioned when referring to how information can or can’t be lost in a black hole but I guess I’ve never heard a straight forward answer about what that means.",
        "created_utc": 1671608955,
        "upvote_ratio": 1.0
    },
    {
        "title": "Hire me! Hire me for all of your online classes exams assignments and quizzes at a fair price and guaranteed good results. I am proficient in the following areas",
        "author": "Marcus-Elvis1557",
        "url": "https://www.reddit.com/r/Physics/comments/zrdt0g/hire_me_hire_me_for_all_of_your_online_classes/",
        "text": "digitutor#4015\n\nMATHS\nPrecalculus -Polynomials, Rational functions, Trigonometry - Absolute value functions and inequalities.\n\tCalculus (I, II, III, IV) -Differential, -Integral\n\tApplication in Calculus such in Business, volume, surface, length.\n\t Ordinary differential equations\n\tMatrices manipulation\nCHEMISTRY-\n\tGen chem 1&amp;2\n\tOrganic Chem1&amp;2\n\tAnalytical Chemistry\n\tBiochemistry \nPHYSICS \n\tMechanics\n\tThermal physics \n\tWaves \n\tElectricity and Magnetism \n\tCircular motion and Gravitation \n\tLight \nBUSINESS RELATED \n•\tMicroeconomics\n•\tMacroeconomics\n•\tAccounting and finance \n•\tBusiness law 1&amp;2\nEconometrics; RStudio, SPSS, Stata, ANOVA.\nOTHERS \n\tResearch articles\n\tComputer Science (java)\n\tCreative essays \n\tCase studies \n\tLogic and Logisim exams \n\tSummaries",
        "created_utc": 1671608522,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can someone with an average IQ get a PhD in physics?",
        "author": "throwaway186736",
        "url": "https://www.reddit.com/r/Physics/comments/zrbr74/can_someone_with_an_average_iq_get_a_phd_in/",
        "text": "",
        "created_utc": 1671601648,
        "upvote_ratio": 1.0
    },
    {
        "title": "Looking for a good book on special relativity a step above pop explanation",
        "author": "dbqpdb",
        "url": "https://www.reddit.com/r/Physics/comments/zravx2/looking_for_a_good_book_on_special_relativity_a/",
        "text": "I have a few technical degrees.  My dad is generally intelligent, but uneducated although tries to relate.  I've known for a while that he is interested in physics, etc, at least from a lay perspective, but I think he's curious enough to read the right text book if I give it to him, and I think special relativity is the right topic as its both unusual/interesting and also has real but relatively trivial math.  \n\nSo I'm really looking for whatever recommendations you have for what might be a good non-pop, but also no more than introductory book on the topic.  Not quite what you'd recommend to a sharp teenager, but to a dedicated adult.",
        "created_utc": 1671598877,
        "upvote_ratio": 1.0
    },
    {
        "title": "Are the most accurate clocks on Earth still atomic clocks?",
        "author": "PrehistoricPun",
        "url": "https://www.reddit.com/r/Physics/comments/zracvc/are_the_most_accurate_clocks_on_earth_still/",
        "text": "",
        "created_utc": 1671597244,
        "upvote_ratio": 1.0
    },
    {
        "title": "Force direction.",
        "author": "silver_ai",
        "url": "https://www.reddit.com/r/Physics/comments/zraadv/force_direction/",
        "text": "I am building a lifting platform for wheelchair. It has 4 poles, each pole has a winch to lift a corner of the platform. I want to mount the bottom poles on a plywood instead of on the ground, but I worry the joint between the poles and base plywood is not strong enough, and cause the poles collapse toward the center of the platform. \n\nDoes the lifting force of the pole point vertically downward or point toward the center of the platform?\n\nhttps://preview.redd.it/90k01kume67a1.png?width=903&amp;format=png&amp;auto=webp&amp;s=fcc5318710871f0b07a12457fb3a06af952237de\n\n&amp;#x200B;\n\nhttps://preview.redd.it/j4nsmfcoe67a1.png?width=903&amp;format=png&amp;auto=webp&amp;s=3c001b4843b9d8b70c6c6aeabef0e1750fad9a61",
        "created_utc": 1671597031,
        "upvote_ratio": 1.0
    },
    {
        "title": "The illusion of distance",
        "author": "Nihili66",
        "url": "https://www.reddit.com/r/Physics/comments/zr7p13/the_illusion_of_distance/",
        "text": "Imagine reality as consisted of single points of singular energy \n\nElementary particles are nothing but a process of keeping a bunch of that singular energy together which gives it mass because of clumped energy \nE = mc^2\n\nEach elementary particle has a future cone and past cone of relativity that cone is how they interact with other points of radiation by sending radiation which is that singular energy\n\nIf a particle had nothing to interact with alone in it's observable universe it will quickly die out by sending its energy radiation into the void quickly dying out\n\nThis is entropy \n\nBut when a particle has another particle to interact with \nMeaning that their cones overlap\nSo they create a feedback loop of energy \nWhich makes them lose less energy over time\n\nSpace is an illusion \n\nWe perceive the speed of light and time it takes to reach us as distance\n\nThis is translated as the angle of the cone and distance in the 4th dimension \n\nWhen a lot of particles are in a feedback loop of energy the angle of their cone is big and their radiation as well\n\nAny particles nearby also get stuck in a feedback loop with them \nBut because of the imbalance in radiation levels \n\nThe way the particle's angle get bigger is in a curved way towards the lump of particles\nWhich makes it look like to observes as the particle going closer to the lump\nThis is gravity\n\nAnd the curve is why general relativity is described as a bending and a curve\n\nNow imagine when two galaxies are alone in a observable universe \nThey are stuck in a feedback loop but because of radiation and entropy the angle of their cones and diminishing \nSo to observer's it will seem like the galaxies are moving away from each other \nThis is expansion \n\n\nWhen taking all of this into consideration that distance is an illusion of cones exchanging energy and changing angles and curve \n\nIt explains why when a black hole happens We can observe this singularity of 0 distance in full show",
        "created_utc": 1671589562,
        "upvote_ratio": 1.0
    },
    {
        "title": "Weird question couldn’t find an answer online",
        "author": "Imaginary-Sign-2068",
        "url": "https://www.reddit.com/r/Physics/comments/zr5kdy/weird_question_couldnt_find_an_answer_online/",
        "text": "A 1000kg torpedo dropped at terminal velocity how much steel could that go through",
        "created_utc": 1671583949,
        "upvote_ratio": 1.0
    },
    {
        "title": "Flight Physics question",
        "author": "kamberoFF",
        "url": "https://www.reddit.com/r/Physics/comments/zr4vvp/flight_physics_question/",
        "text": "I'm trying to make a flight sim as a project but I need someone to explain the physics\n\nI know there are weight, drag, thrust and lift, but there is also induced drag\n\nSo for the force opposing the plane which one should I consider the drag or induced drag\n\nor should I add them together because the drag is calculated D = (1/2) \\* rho \\* v\\^2 \\* CD \\* S\n\nwhereas induced drag is D\\_induced = (1/2) \\* rho \\* v\\^2 \\* CL\\^2 / (pi \\* AR \\* e) could\n\nsomebody explain which should I include",
        "created_utc": 1671582705,
        "upvote_ratio": 1.0
    },
    {
        "title": "Boiling water to generate steam is the basis of most of our power production. Would a lower boiling point liquid like ethanol be more efficient as it requires less energy to convert to a gas?",
        "author": "Acceptable-One-6953",
        "url": "https://www.reddit.com/r/Physics/comments/zr4s36/boiling_water_to_generate_steam_is_the_basis_of/",
        "text": "If this is the case, why don’t power plants use other liquids? Is it purely due to waters convenience (being easily accessible and cheap).",
        "created_utc": 1671582487,
        "upvote_ratio": 1.0
    },
    {
        "title": "First semester of physics at university",
        "author": "DawningDefiance",
        "url": "https://www.reddit.com/r/Physics/comments/zr3ll8/first_semester_of_physics_at_university/",
        "text": "So I have been studying physics/math for three months now, and I don't know what to think about it all anymore. I feel like all the topics in linear algebra/calculus/classical mechanics need a much deeper knowledge if I want to understand them fully. From what I've heard, most of my colleagues simply accept what they are told but my mind doesnt work that way. And whenever I question what im learning i run into a wall at some point where I know what I'm expected to know but the deeper connections elude me. This has led to a continously mounting frustration. Basically I feel like I'd be getting better grades if I stopped questioning everything, which feels wrong. It also doesn't help that my classical mechanics professor purposefully covers topics in a way that is above our level just to use that as an excuse for his terrible explanations/teaching.\n\nSo finally my question/TLDR: Should I stop overthinking details and let some things be resolved later on in my studies or am I just incompetent if I keep finding myself in dead ends whenever I try to get a gapless understanding of something?",
        "created_utc": 1671579770,
        "upvote_ratio": 1.0
    },
    {
        "title": "HW~~ how is the voltage law applied to the circuit below?",
        "author": "throwaway6638934",
        "url": "https://i.redd.it/1uzqd0bch67a1.png",
        "text": "",
        "created_utc": 1671578587,
        "upvote_ratio": 1.0
    },
    {
        "title": "When to call yourself Physicist",
        "author": "dudeskater123",
        "url": "https://www.reddit.com/r/Physics/comments/zr327s/when_to_call_yourself_physicist/",
        "text": "I wanted to share my opinion on this topic because i've seen some forums talk about this; although i have a BS in physics, i work in patents and my colleagues refer to me as a physicist. It used to bother me a little because i always thought a physicists was someone who did research. However i think this is a very narrow, reductionist definition of a physicist. A more apt definition would be someone who's been trained to solve problems. Although you can say that this definition applies to engineers, it's not quite. Engineers use known concepts/formulas to solve problems while physicist derive them to solve a broad range of problems/systems. This sort of thinking its whats taught very early on in an undergrad physics course and personally think it's the core of what makes a physicist regardless of what degree(BS, MS or PhD)/job they have (a physicist by training who has a job in engineering is not going to approach problems an engineer by training would), yet it seems like its the main argument for this type of question, which might not be the right way to look at it.",
        "created_utc": 1671578450,
        "upvote_ratio": 1.0
    },
    {
        "title": "Moving faster than light, how do/do we know we would age 'slower'?",
        "author": "EthanEverhart",
        "url": "https://www.reddit.com/r/Physics/comments/zr2e5u/moving_faster_than_light_how_dodo_we_know_we/",
        "text": "So I'm currently studying special/general relativity via wikipedia and I'm grasping it pretty well, but the title question occurred to me. I understand the concept of time moving 'slower' for a person as they move close to the speed of light than it does for time on earth. But how do/do we know our bodies would age slower?  \nIt's very possible that I'm misunderstanding a very elementary concept, but take for example if you were to be slapped by someone moving faster than the speed of light, ignoring the atomic bomb that would be set off and the vaporizing of your molecules, you would hypothetically feel the slap before you saw the slap hit you. But the slap would still happen nonetheless.  \nSo moving faster than the speed of light, you would experience time slower than those on Earth but wouldn't your body still age the same way? The same way the slap still happens despite the slapped person not seeing it?",
        "created_utc": 1671576853,
        "upvote_ratio": 1.0
    },
    {
        "title": "Physics in James Bond",
        "author": "Low_Armadillo6780",
        "url": "https://www.reddit.com/r/Physics/comments/zr1vqv/physics_in_james_bond/",
        "text": "Can someone explain the physics behind this train fight on whether it is or is not possible the real world?! I'm very curious. Can two people really fight on top of a train like that?\n\n[https://www.youtube.com/watch?v=eZ\\_Ki2yfkKQ](https://www.youtube.com/watch?v=eZ_Ki2yfkKQ)",
        "created_utc": 1671575584,
        "upvote_ratio": 1.0
    },
    {
        "title": "Where to find lecture notes/slides for college physics",
        "author": "professor_formula1",
        "url": "https://www.reddit.com/r/Physics/comments/zr17dh/where_to_find_lecture_notesslides_for_college/",
        "text": "Hello all, I am a first year Physics teacher and while my skills in mechanics/E and M are quite strong (especially for high school). I lack some of the other knowledge beyond this, starting with modern physics my classes were online due to the pandemic and while I obviously passed them, I feel as though did not retain knowledge properly. This is due to some of the not so great lectures given digitally. Where is the best place to look, like an open courseware of sorts? NJIT has some but they are not all there. Any help would be greatly appreciated.",
        "created_utc": 1671573973,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can someone help me understand time dilation?",
        "author": "peaceofmine101",
        "url": "https://www.reddit.com/r/Physics/comments/zqzyak/can_someone_help_me_understand_time_dilation/",
        "text": "I’ve seen some stuff on time dilation recently and I am struggling to fathom how time can pass differently depending on your speed or if you were on a different planet.\n\nI’d like to start with the interstellar insane gravity concept of time dilation first. Let’s suppose that extraordinary rotation and gravity can affect time. If I were to travel to a planet with these characteristics, where one day is equal to a hundred earth days, theoretically, I don’t believe my concept of time has changed. The time it would take me to build a house, plant a garden, and go through the motions of life would just take many more days than they would on earth, but would they not feel like the same amount of time? Meaning, if sleeping eight hours on earth is equal to eight hundred on this theoretical planet, then I will have slept for a few weeks of that planets time, but I would still perceive it as being my usual eight hours of earth time. Where am I wrong in this thought process?\n\nI also don’t understand how time moves slower as you move faster in general. I perceive the music I listen to the same when I drive a hundred miles an hour vs ten miles an hour, unless it’s not noticeable at that change.  \n\nCan anyone provide some explanation on these concepts? I’m super fascinated by this, thank you",
        "created_utc": 1671571008,
        "upvote_ratio": 1.0
    },
    {
        "title": "Any sources to make sense of modern physics to a newbie?",
        "author": "WarbossPepe",
        "url": "https://www.reddit.com/r/Physics/comments/zqzpi7/any_sources_to_make_sense_of_modern_physics_to_a/",
        "text": "My physics understanding stopped unfortunately after school, but i've always been a fan from a distance (i pursued an engineering degree). \n\nI've been trying to understand [this quanta article](https://www.quantamagazine.org/a-new-map-of-the-standard-model-of-particle-physics-20201022/) that illustrates a new standard map of physics. Even though i find it fascinating (its nothing like i've seen before), i'm having some difficulty understanding it in relation to my everyday life. The last place i left off with physics was: _Atoms are comprised of neutrons, protons, and electrons_. Very basic stuff.\n\nAre there any good quick resources that can explain what im trying to get at, without having to study an entire course? \n\n[The annotated map](https://d2r55xnwy6nx47.cloudfront.net/uploads/2020/10/SM_graphic-FINAL-16-Annotated.jpg) is a sight to behold, but i haven't a clue what it all means.\n\nNow all of sudden, there are: Quarks, Bosons, Leptons, Colours, Charms, Up/Down, Positive/Negative, Fields, etc.\n\nWhat do they all mean? 😂",
        "created_utc": 1671570438,
        "upvote_ratio": 1.0
    },
    {
        "title": "Question regarding air quality and particles",
        "author": "SequenceStar",
        "url": "https://www.reddit.com/r/Physics/comments/zqyp5e/question_regarding_air_quality_and_particles/",
        "text": "Let me know if I am posting in the wrong subreddit, but given that this is about air particles I presume it could be the right one.\n\nI recently started taking air quality measurements at a relatives place using an Airthings View Plus device. Everything looked to be good for some time, with Radon, PM2.5, PM1, Co2, VOC and temp all being within normal ranges. However, I noticed that humidity was an issue (falling down to 17% on some days), so I invested in an ultrasonic humidifier for their place.\n\nFast forward, and shortly after receiving the device and setting it up I noticed that PM2.5 and PM1 levels started increasing. In fact, the levels went from &lt;10 μg / m3 to 30-45 μg / m3.\n\nAt first I didn't realiy think much of it as I know the humidifier is spewing out a lot of very small water droplets into the air, and I figured the reading were likely high because the sensor was picking up on the h2o particles.\n\nBut I Googled this eventually, and found that ultrasonic humidifiers have a tendency to also spew out the minerals and chemicals found in tap water, which could also significantly increase the particles found in indoor air. I'm a bit puzzled by this, because there is a ceramic filter in the device, and it also uses a plamsa function which uses electricity to create both positive and negative ions (deactivating viruses, mold, etc). But I also read it could have an effect on dust.\n\nWe live in a place with pretty good tap water, no harsh treatments or anything. I guess my question here is - are these readings anything to be worried about? Could it simply the water droplets causing for the readings to spike?",
        "created_utc": 1671568024,
        "upvote_ratio": 1.0
    },
    {
        "title": "Interesting time dilation question",
        "author": "lucissjustiss",
        "url": "https://www.reddit.com/r/Physics/comments/zqxba2/interesting_time_dilation_question/",
        "text": "So I understand how time dilation works - the closer to the speed of light you get the slower time moves for you. So (easy numbers) you could age like 10 years while those moving slower aged like 100 years. However I was wondering if it’s possible to speed up that time. Like say a planet was moving so slowly that they were the ones who aged 100 years while the rest of the galaxy aged 10 years. Obviously the math would be different and an entire galaxy wouldn’t age uniformly but could there be a planet that ages that much slower than the average of other planets?",
        "created_utc": 1671564673,
        "upvote_ratio": 1.0
    },
    {
        "title": "Hypothetical physics question: Why do wormholes lead to time travel?",
        "author": "Mach10vector",
        "url": "https://www.reddit.com/r/Physics/comments/zqwys2/hypothetical_physics_question_why_do_wormholes/",
        "text": "Wouldn't wormholes also be affected by time dilation? Like, let's say there's a wormhole between a ship going at 99% of C and the Earth, wouldn't the crew from the ship see the people of earth moving much faster and the people from earth see the crew of the ship move much more slower?",
        "created_utc": 1671563849,
        "upvote_ratio": 1.0
    },
    {
        "title": "NASA Gets Unusually Close Glimpse of Black Hole Snacking on Star",
        "author": "fiziks4fun",
        "url": "https://www.jpl.nasa.gov/news/nasa-gets-unusually-close-glimpse-of-black-hole-snacking-on-star",
        "text": "",
        "created_utc": 1671562190,
        "upvote_ratio": 1.0
    },
    {
        "title": "Question about pulleys: Gravitational potential energy",
        "author": "Obvious-Shake5761",
        "url": "https://www.reddit.com/r/Physics/comments/zqw6k6/question_about_pulleys_gravitational_potential/",
        "text": "Hey everyone, I am confused on a concept. \n\nMy book states \" Simply lifting a heavy object of mass m to a height h will result in an amount of work equal to mgh- its change in gravitational potential energy. If, however, the distance through which the displacement is achieved is greater than the displacement (the indirect path), then the applied force will be less than mg\". \n\nMy understanding of this is that basically the less displacement you have, the less amount of force required to move the object. However, can I get some clarification on this topic, I feel like I'm missing something. \n\nBy the way this concept was in relation to pulleys.\n\nThanks, you for your help",
        "created_utc": 1671562002,
        "upvote_ratio": 1.0
    },
    {
        "title": "What are some good resources to self study physics after finishing general physics 1 &amp; 2?",
        "author": "thewiseoldmen",
        "url": "https://www.reddit.com/r/Physics/comments/zqw1jv/what_are_some_good_resources_to_self_study/",
        "text": "Hi y'all, \n\nI used to be a physics major in my first year but decided to instead go into economics and then medicine. Learning medicine increased my interest in physics again where I'd like to devote 6 months to studying it for fun before medical school starts.\n\nAny good resources or videos you recommend? I've completed up to Calc 3 and would just like to learn physics without the high level mathematics aspect of it's even possible. Learning most of the general overview of the laws and equations rather than the math behind them which I know isn't the best way to study physics considering the laws are determined from the equations. Is it possible or would I need to commit to learning the math first then understand the laws.\n\nThank you",
        "created_utc": 1671561666,
        "upvote_ratio": 1.0
    },
    {
        "title": "Relativity light analogy question, please",
        "author": "walros462",
        "url": "https://www.reddit.com/r/Physics/comments/zqvx50/relativity_light_analogy_question_please/",
        "text": "Hello.  I'm new here and am not a scientist.    \n\n\nI was reminded recently of the famous explanation or relativity.  The one where a person has a light shining up and down as a way to measure time and another situation where that person is moving quickly relative to another observer who instead of seeing the light go up and down, sees a sin wave or something along those lines.\n\nSuddenly it made me wonder, what if instead of light, there was another \"objective\" timepiece traveling up and down at the speed of light.  Say, a decomposing element (sorry if wrong terminology).  \n\nIf this was discussed already, I'd love a link - or any conversation here, of course  \n\nThank you!!",
        "created_utc": 1671561371,
        "upvote_ratio": 1.0
    },
    {
        "title": "The theory of predicting the future. And mind reading",
        "author": "Ok-Promotion658",
        "url": "https://www.reddit.com/r/Physics/comments/zqvknu/the_theory_of_predicting_the_future_and_mind/",
        "text": "[https://drive.google.com/file/d/1uTihqhxt9kB9Ad8TTBmeYOQCzc8lsN-k/view?usp=sharing](https://drive.google.com/file/d/1uTihqhxt9kB9Ad8TTBmeYOQCzc8lsN-k/view?usp=sharing)\n\nIf you read this theory and thought that it was some kind of stupid, then you were right in thinking that every person who read this article said that I am stupid, but later someone started to check it and after making sure that it is real work, they say that I am a genius. I am ready for criticism because I understand that it will be because the theory seems too simple to be true, but if you really read it carefully and want to check it, you will be very surprised. And I also apologize for possible mistakes in the text because I do not know English perfectly.",
        "created_utc": 1671560544,
        "upvote_ratio": 1.0
    },
    {
        "title": "about signal processing",
        "author": "jgs4omen",
        "url": "https://www.reddit.com/r/Physics/comments/zqvhte/about_signal_processing/",
        "text": "hello all, \n\nI suppose this will be a little different from most daily posts here but as I've seen theres a plenty diverse community here with rich backgrounds, and as I've seen most here share pretty realistic views, which I kind of would benefit from now.\n\nI really would appreciate if I could hear some insights from you guys on the discipline of signal processing, one of the focuses of electrical engineering. surely, physics is the root of most- but would you people say it would be possible for physics grads to be involved in signal processing and the technologies based on this discipline? would the physics route be too theoretical to allow one in this route? should one that wants to focus on this seek no other way but electrical engineering?\n\nI hope this community has some people that has experience on this matter, and hopefully it's an appopriate post..",
        "created_utc": 1671560363,
        "upvote_ratio": 1.0
    },
    {
        "title": "The theory of predicting the future and reading minds!",
        "author": "Ok-Promotion658",
        "url": "https://drive.google.com/file/d/1uTihqhxt9kB9Ad8TTBmeYOQCzc8lsN-k/view?usp=sharing",
        "text": "",
        "created_utc": 1671560091,
        "upvote_ratio": 1.0
    },
    {
        "title": "Conductive thick spherical shell with a dipole",
        "author": "Max127189",
        "url": "https://i.redd.it/3l2oxotdc37a1.png",
        "text": "",
        "created_utc": 1671558605,
        "upvote_ratio": 1.0
    },
    {
        "title": "Evaporation of water by reducing pressure",
        "author": "Password_Number_1",
        "url": "https://www.reddit.com/r/Physics/comments/zqu9qj/evaporation_of_water_by_reducing_pressure/",
        "text": "Hello,\n\nIf you have a container closed by a piston and you pull on it to increase the volume, reducing the pressure, and forcing more water to be become a gaz to maintain P=Psat , do you consider that the water vapour is receiving or producing work while the volume is increasing ?\n\nI started with the usual work formula but, the gas isn’t pushing the piston…. It is being « generated » to compensate the lower pressure… And if I consider that it receives work, it also bothers me as no compression is happening. Is the Work = 0, then?\n\nThank you so much to anyone willing to help! :)",
        "created_utc": 1671557414,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can something be born from nothing?",
        "author": "PerfectHuckleberry48",
        "url": "https://www.reddit.com/r/Physics/comments/zqu5qo/can_something_be_born_from_nothing/",
        "text": " Modern physics  \n\n\nThe zero-energy universe hypothesis states that the amount of energy in the universe minus the amount of gravity is exactly zero. In this kind of universe, **matter could be created from nothing through a vacuum fluctuation**, assuming such a zero-energy universe already is nothing.",
        "created_utc": 1671557142,
        "upvote_ratio": 1.0
    },
    {
        "title": "The Universe Is Not Locally Real, and the Physics Nobel Prize Winners Proved It",
        "author": "kmrbillya12",
        "url": "https://blog.scientiststudy.com/2022/10/the-universe-is-not-locally-real-and.html",
        "text": "",
        "created_utc": 1671556106,
        "upvote_ratio": 1.0
    },
    {
        "title": "Interesting drop test of laptop and falling rock shows applied force and mass",
        "author": "PalmettoSteve",
        "url": "https://www.youtube.com/watch?v=YlGPUSKF7Vg",
        "text": "",
        "created_utc": 1671554958,
        "upvote_ratio": 1.0
    },
    {
        "title": "\"What is Reality\" Needs to be Retired",
        "author": "earthloaf",
        "url": "https://www.reddit.com/r/Physics/comments/zqrqdt/what_is_reality_needs_to_be_retired/",
        "text": "I'm tired of opening books or turning on docs that start with a dude asking, \"What is Reality?\"",
        "created_utc": 1671551184,
        "upvote_ratio": 1.0
    },
    {
        "title": "I need help understanding time as a dimension",
        "author": "Pristine-Simple689",
        "url": "https://www.reddit.com/r/Physics/comments/zqrci1/i_need_help_understanding_time_as_a_dimension/",
        "text": "Hello!\n\nPlease correct me if anything I say is wrong, since I am not a physicist, nor do I study or work on anything related to physics. I am just an enthusiastic amateur seeking help.\n\nI am trying to understand how science is looking into time. As far as I understood prior, time passes forward, and left and right could be understood as different choice possibilities, so in 2D.\n\nI found several 3D animations trying to explain 4 dimensions with 4D cubes. Further explanations reveal the animated tesseract only represents the shadow of a 4D cube and how time is represented as a new dimension that expands over W to make this tesseract. So XYZ is the cube and  W is time. \n\nI started wondering about how time could \"move up\", but it doesn't make any sense to me.\n\nThis led me back to general relativity, which of course I've heard about before, but obviously don't understand either. \n\nReading about tensors and spacetime curvature right now, but I have to do work elsewhere soon, so any help regarding sources on \"theoretical time\" (maybe?) would be appreciated.\n\n&amp;#x200B;\n\nSorry to bother you with my lack of knowledge of physics and thank you for your time!",
        "created_utc": 1671550211,
        "upvote_ratio": 1.0
    },
    {
        "title": "If you’re from Allen Chandigarh message me ASAP!",
        "author": "Ishanaaaa",
        "url": "https://www.reddit.com/r/Physics/comments/zqqtqn/if_youre_from_allen_chandigarh_message_me_asap/",
        "text": "",
        "created_utc": 1671548886,
        "upvote_ratio": 1.0
    },
    {
        "title": "Improved lepton universality measurements show agreement with the Standard Model",
        "author": "dukwon",
        "url": "https://lhcb-outreach.web.cern.ch/2022/12/20/improved-lepton-universality-measurements-show-agreement-with-the-standard-model/",
        "text": "",
        "created_utc": 1671547179,
        "upvote_ratio": 1.0
    },
    {
        "title": "F",
        "author": "SGTMFT",
        "url": "https://www.reddit.com/r/Physics/comments/zqq29u/f/",
        "text": "",
        "created_utc": 1671546809,
        "upvote_ratio": 0.99
    },
    {
        "title": "Robert Kolenkow (who also wrote 'An Introduction to Mechanics' with Kleppner) recently published an introductory book on groups and matrices!",
        "author": "just_arandomrussian",
        "url": "https://www.amazon.com/Introduction-Groups-Matrices-Science-Students/dp/1108831087",
        "text": "",
        "created_utc": 1671546354,
        "upvote_ratio": 1.0
    },
    {
        "title": "Physics Questions - Weekly Discussion Thread - December 20, 2022",
        "author": "AutoModerator",
        "url": "https://www.reddit.com/r/Physics/comments/zqp9jx/physics_questions_weekly_discussion_thread/",
        "text": "This thread is a dedicated thread for you to ask and answer questions about concepts in physics.\n\nHomework problems or specific calculations may be removed by the moderators. We ask that you post these in /r/AskPhysics or /r/HomeworkHelp instead.\n\nIf you find your question isn't answered here, or cannot wait for the next thread, please also try /r/AskScience and /r/AskPhysics.",
        "created_utc": 1671544810,
        "upvote_ratio": 1.0
    },
    {
        "title": "Quantum Bits Tunneled - Wormhole Created in Quantum Computer",
        "author": "TheCnt23",
        "url": "https://science-news.co/quantum-bits-tunneled-wormhole-created-in-quantum-computer/",
        "text": "",
        "created_utc": 1671540986,
        "upvote_ratio": 1.0
    },
    {
        "title": "Those working in theoretical physics, what pathway did you take to get your postdoc?",
        "author": "ReindeerBrief561",
        "url": "https://www.reddit.com/r/Physics/comments/zqnipr/those_working_in_theoretical_physics_what_pathway/",
        "text": "This post is more for me to see my options as I go forward with my education. I’ve got an auto mechanic certification diploma and a community college associates degree. While my dream is to work on quantum gravity (I know that’s a massive goal), I also want to make sure my degree pathway opens up as many doors as possible because it’s looking like a long expensive road ahead. Thank you!",
        "created_utc": 1671540297,
        "upvote_ratio": 1.0
    },
    {
        "title": "What to do if I have theories?",
        "author": "billybob3011",
        "url": "https://www.reddit.com/r/Physics/comments/zql7p1/what_to_do_if_i_have_theories/",
        "text": "I contacted Oxford and they ignored me",
        "created_utc": 1671532820,
        "upvote_ratio": 1.0
    },
    {
        "title": "Where does 2 x acceleration x distance equation come from?",
        "author": "Comrade750",
        "url": "https://www.reddit.com/r/Physics/comments/zqk5fr/where_does_2_x_acceleration_x_distance_equation/",
        "text": "I was trying to figure out how to calculate at what speed the weight hit the ground from 0.66m height in a freefall. Then I met this equation (2 x acceleration x distance) which seems to be correct.",
        "created_utc": 1671528961,
        "upvote_ratio": 1.0
    },
    {
        "title": "Apocalyptic scenarios",
        "author": "jes_chr",
        "url": "https://www.reddit.com/r/Physics/comments/zqjxay/apocalyptic_scenarios/",
        "text": "I'm looking for a good educational book that could describes in a quite decent way some of the drastic scenarios that would end the world. For instance what would happen if a global nuclear war would happen, but described in a quite realistic and scientifically accurate way. Of course I know these can be only speculations and there isn't any scientific acclaimed theory but I'd be happy on nice reasoning about this from a nuclear physicist. It doesn't have to be an essay, even a nice romance would be nice but I don't know where to look for and I thought maybe some of you have some book suggestions.",
        "created_utc": 1671528189,
        "upvote_ratio": 1.0
    },
    {
        "title": "Special relativity and Middle-Earth",
        "author": "frogjg2003",
        "url": "https://terrytao.wordpress.com/2022/12/18/special-relativity-and-middle-earth/",
        "text": "",
        "created_utc": 1671527397,
        "upvote_ratio": 1.0
    },
    {
        "title": "Physicist Eric Smith On The Origin and Nature of Life on Earth",
        "author": "SkepticSalamander",
        "url": "https://www.youtube.com/watch?v=ARZkYwT-H20",
        "text": "",
        "created_utc": 1671525978,
        "upvote_ratio": 1.0
    },
    {
        "title": "NEED PUNS",
        "author": "TheBaconHah",
        "url": "https://www.reddit.com/r/Physics/comments/zqi39u/need_puns/",
        "text": "My AP Physics 1 teacher told us that we would get extra credit if we submitted puns about kinematics, dynamics, circular motion, or gravity please help, im too braindead to think of any.",
        "created_utc": 1671521899,
        "upvote_ratio": 1.0
    },
    {
        "title": "How Does a Microwave Work?",
        "author": "VrobleBlog",
        "url": "https://www.vroble.com/2022/12/how-does-microwave-work.html",
        "text": "",
        "created_utc": 1671519095,
        "upvote_ratio": 1.0
    },
    {
        "title": "Universe.",
        "author": "aljabrak",
        "url": "https://youtu.be/sYqV80SiEP0",
        "text": "",
        "created_utc": 1671518116,
        "upvote_ratio": 1.0
    },
    {
        "title": "In 1954, the Atomic Energy Commission revoked Dr. Oppenheimer’s security clearance through a flawed process that violated the Commission’s own regulations - U.S. DOE, 16 Dec. 2022",
        "author": "marketrent",
        "url": "https://www.energy.gov/articles/secretary-granholm-statement-doe-order-vacating-1954-atomic-energy-commission-decision",
        "text": "",
        "created_utc": 1671517180,
        "upvote_ratio": 1.0
    },
    {
        "title": "In 1954, the Atomic Energy Commission revoked Dr. Oppenheimer’s security clearance through a flawed process that violated the Commission’s own regulations - U.S. DOE, 16 Dec. 2022",
        "author": "marketrent",
        "url": "https://www.npr.org/2022/12/17/1143896431/j-robert-oppenheimer-security-clearance",
        "text": "",
        "created_utc": 1671517095,
        "upvote_ratio": 1.0
    },
    {
        "title": "Parallel Universe without String Theory",
        "author": "Brilliant-Age8818",
        "url": "https://www.reddit.com/r/Physics/comments/zqfjez/parallel_universe_without_string_theory/",
        "text": "[removed]",
        "created_utc": 1671513994,
        "upvote_ratio": 1.0
    },
    {
        "title": "Parallel universes without the need for string theory",
        "author": "Brilliant-Age8818",
        "url": "https://www.reddit.com/r/Physics/comments/zqfhhq/parallel_universes_without_the_need_for_string/",
        "text": "[removed]",
        "created_utc": 1671513854,
        "upvote_ratio": 1.0
    },
    {
        "title": "https://soundcloud.com/charles-harrington-jr/louisvilles-living-legend_1?ref=clipboard&amp;p=i&amp;c=1&amp;si=15108EF767154BECB82296499D34FD56&amp;utm_source=clipboard&amp;utm_medium=text&amp;utm_campaign=social_sharing",
        "author": "Charlesalive12",
        "url": "https://www.reddit.com/r/Physics/comments/zqf9ji/httpssoundcloudcomcharlesharringtonjrlouisvillesli/",
        "text": "",
        "created_utc": 1671513189,
        "upvote_ratio": 1.0
    },
    {
        "title": "Here's my High School Physics Course for FREE! -Happy Holidays :)",
        "author": "rmathisen",
        "url": "https://www.reddit.com/r/Physics/comments/zqdcte/heres_my_high_school_physics_course_for_free/",
        "text": "Teacher of High School Physics for 7 Yrs.  \n\n\nIf anyone wants my High School Physics cours, I'd like to share them with you for Free!   \n(only 1000 free redemptions!)  \n[https://www.udemy.com/course/the-complete-physics-course/?couponCode=HAPPY\\_HOLIDAYS\\_1000](https://www.udemy.com/course/the-complete-physics-course/?couponCode=HAPPY_HOLIDAYS_1000)  \n\n\nAll I ask...  \n1) please let me &amp; others know what you think of the notes in the comments section of this post  \n2) please give a rating &amp; a review!  \n3) share this post with anyone you think would benefit with this course!\n\n&amp;#x200B;\n\nBest of luck with your studies!  \nRobert Mathisen",
        "created_utc": 1671507882,
        "upvote_ratio": 1.0
    },
    {
        "title": "In defense of \"stoner-physics,\" and a proposed method to address these posts",
        "author": "Feisty-Ad396",
        "url": "https://www.reddit.com/r/Physics/comments/zqcr61/in_defense_of_stonerphysics_and_a_proposed_method/",
        "text": "**TLDR**\n\nAdd the tag \"speculative physics\" or something else, and also add a questions mega thread geared towards existential/metaphysical implications. Don't remove the posts.\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\n**Introduction**\n\nI saw the recent \"stoner physics topic\" and was interested in it because I personally enjoy reading a lot of them, including crackpot theories, etc even as a someone more involved in physics (I don't want to say professional yet since I haven't gotten my Ph.D. yet)\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\n**Problem Statement**\n\nAnyways, I don't want them to be removed because I think it'll cut out a lot of people interested in this topic. And a lot of times, these topics are good scaffolding for discussion or have interesting ideas that get dismissed outright.\n\nI realize the problem is that these posts can potentially mislead other non-physics people who come to this sub. I've talked personally with a lot of people that have these ideas, and a lot of times they also recognize it as uninformed and speculative. But they can't find anyone to ask about what's wrong with their thought process.\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\n**Real World Example**\n\nAPS had this problem with gatekeeping enthusiasts a while ago, which eventually led to someone getting murdered. So, they removed all submission barriers and just put all their crackpot theorists in a special conference forum. And it's not all crackpot, one of them turned out to be legit and got a Nobel Prize.\n\nSo, I personally don't think the crackpot posts should be taken down but rather given some kind of designation/put in some other category like - \"speculative physics,\" or \"lay theory\" etc. That way if people want to look for fun/weird talk they'd still have a place. And for people looking for more detailed established topics, they also have a place.\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\n**Proposed \"Simple\" Solution**\n\nSo, I was thinking we could have members tag their own posts as something like \"speculative physics\" or something like that. And untagged posts that seem like they can be flagged so that moderators can add that tag. That way these questions and theories are still accessible but with the added knowledge of how much backing they have. There can be other solutions, but the point of Reddit is to provide a wild-west conversation forum.\n\nIn addition, I don't think we should have another subreddit for these kinds of posts. This is\n\n1. Very difficult to keep telling new visitors (you can already see this with the whole r/askphysics problem here (more so with crackpot physics since the line is greyer).\n2. a potential echo chamber if you do so. If you check out r/holofractal you'll see that a completely normal string theory sub devolve into pseudo mysticism and self-help.\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\n**Additional comment about the nature of crackpot physics, from Quora:**\n\nTo attract crackpots, a subject needs to have these characteristics:\n\n**It should sound sexy enough**. With whacky implications of Quantum Physics and Relativity, Physics gives great raw material for making plausible-sounding, yet ludicrous claims. Imagine a subject which has black holes, time dilation, wave-particle duality... A Deepak Chopra would be drooling at all this raw material, as would a science fiction writer.\n\n**It should be accessible enough, yet retain some mystery**: As an example, even a layman can relate to an equation like E = mc2. But people know that they don’t know enough to challenge others. So if some spiritual guru claims that since soul is nothing but energy, and energy is equivalent to matter (E=mc2), all the universe is made of Holy spirit, many people will believe that. Try making a story out of dreary math topics like Riemann Hypothesis or Hilbert Transform and you will lose your audience in 5 minutes.\n\n**It should deal with questions people are curious about**: How did the universe begin? Why does anything exist? Why do tides happen? How is rainbow formed? For a long time, religion had a monopoly over these answers, but Physics has grabbed a lot of market share over the centuries. But since religious zealots can’t give up without losing relevance, they keep trying to distort ideas or find some gaps and play with it.\n\nPhysics is the mother of all sciences. Everything else is built on it (e.g., Chemistry) or is in its service (e.g., Math). I am going to get a lot of grief from Mathematicians for saying this :)\n\n[https://www.quora.com/Why-does-physics-attract-so-many-crackpots](https://www.quora.com/Why-does-physics-attract-so-many-crackpots)",
        "created_utc": 1671506274,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why can particles absorb other particles if they are made out of nothing?",
        "author": "Correct_Speaker_1003",
        "url": "https://www.reddit.com/r/Physics/comments/zqbtsm/why_can_particles_absorb_other_particles_if_they/",
        "text": "An electron and a photon are elemental particles, right? That means they are made out of nothing else, so how does the electron absorb the photon??",
        "created_utc": 1671503810,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is the event horizon a perfect blackbody?",
        "author": "Either_Speed_9828",
        "url": "https://www.reddit.com/r/Physics/comments/zq9xda/is_the_event_horizon_a_perfect_blackbody/",
        "text": "Excluding the synchrotron radiation around the schwarzschild radius.",
        "created_utc": 1671499095,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why Relativity and QM Are False by Michael Huemer",
        "author": "HyperConnectedSpace",
        "url": "https://www.reddit.com/r/Physics/comments/zq9l3i/why_relativity_and_qm_are_false_by_michael_huemer/",
        "text": "[http://www.owl232.net/](http://www.owl232.net/)",
        "created_utc": 1671498231,
        "upvote_ratio": 1.0
    },
    {
        "title": "Beginning my undergraduate physics course next year in Western Australia, got any tips?",
        "author": "ronin_shogun",
        "url": "https://www.reddit.com/r/Physics/comments/zq9kgy/beginning_my_undergraduate_physics_course_next/",
        "text": "I am really nervous about the course but I’m also very excited. I’m just looking for some advice I can consider while I’m working at the course. Thanks",
        "created_utc": 1671498180,
        "upvote_ratio": 1.0
    },
    {
        "title": "Need a little help with a couple of questions in my physics textbook. Not sure if my answers are correct. Might be hard to see. Any input would be greatly appreciated. Thanks again",
        "author": "ShoegazeDreamer",
        "url": "https://www.reddit.com/gallery/zq7x13",
        "text": "",
        "created_utc": 1671494200,
        "upvote_ratio": 1.0
    },
    {
        "title": "someone can help",
        "author": "MIMO-BH-20",
        "url": "https://i.redd.it/ifoztqzpux6a1.jpg",
        "text": "",
        "created_utc": 1671492188,
        "upvote_ratio": 1.0
    },
    {
        "title": "Recommended podcasts for beginners/with a learning focus",
        "author": "mileseverett",
        "url": "https://www.reddit.com/r/Physics/comments/zq4zpa/recommended_podcasts_for_beginnerswith_a_learning/",
        "text": "Hello, I am interested in learning more about physics and have a lot of time spent driving. I find a lot of videos about physics require a lot of visual attention, which obviously isn't possible while driving. So was wondering if anyone has podcast recommendations which teach concepts from the ground up.\n\nI searched this subreddit briefly, but couldn't find anything similar to my question, but if I am wrong please feel free to link me to the correct posts.",
        "created_utc": 1671487310,
        "upvote_ratio": 1.0
    },
    {
        "title": "Advice for geniuses",
        "author": "shockwave6969",
        "url": "https://www.reddit.com/r/Physics/comments/zq4uvk/advice_for_geniuses/",
        "text": "I've been thinking about making a post like this but haven't had the courage- questions like this tend to go straight to r/iamverysmart. But I'm hoping this community might be more open. I want to ask for the wisdom of fellow scientists more experienced than I am. It is abundantly clear to me from the speed at which I learn, the way that I think, the connections I draw, that I am in the top 0.01% for raw intellectual power. Although I'm a sophomore undergrad, I'm friends with many of the grad students, and they have a lot of respect for me. I'm on track to finish graduate quantum field theory before I begin my senior thesis. I can't prove that I'm not just a delusional narcissist, so for the sake of argument, you'll have to trust me. I only have at best probably 80 years left and there are a lot of problems that need to be solved. I am fully committed to dedicating my life in service to the prosperity of mankind, I see my genetic gift as a moral obligation to do so. If anyone can understand me, I'm hoping I might find them here. To the brightest among my future colleagues: if my story resonates with you, what advice would you give to a younger version of yourself, or to a very bright young physicist who has yet to take any major steps into the real scientific world?",
        "created_utc": 1671487024,
        "upvote_ratio": 1.0
    },
    {
        "title": "Neil deGrasse Tyson - My Letter From Carl Sagan",
        "author": "freedompact",
        "url": "https://youtube.com/shorts/MLxSfH5Qqgg?feature=share",
        "text": "",
        "created_utc": 1671485631,
        "upvote_ratio": 1.0
    },
    {
        "title": "Where does causality arises from?",
        "author": "hunumum",
        "url": "https://www.reddit.com/r/Physics/comments/zq46ib/where_does_causality_arises_from/",
        "text": "Whenever we encounter some solutions in class to something the prof. always says something like \"Because off causality we ignore this solution\"\n\nIt makes sense to ignore that because we are used to causality in the classical world. But is there some deeper level of physics, or math which states that the world most \"obey\" causality?\n\nSomething like how energy conservation arises from the Lagrangian being invariant.\n\nOr is it one of those things we just observed always happening?",
        "created_utc": 1671485454,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why's the water muddy after the rain falls?",
        "author": "No_Contribution_3465",
        "url": "https://www.reddit.com/r/Physics/comments/zq44z3/whys_the_water_muddy_after_the_rain_falls/",
        "text": "Similar to the vortices that  develop in the drain of the bathtub, the same happens in underground or  surface water canals. If there are too many disturbances, the vortices  will develop with less certainty proportionally to the disturbance  entropy. Those vortices have a centripetal force on mass similar to  gravity in still water, so they channel and lose their heterogeneousness  with water.",
        "created_utc": 1671485357,
        "upvote_ratio": 1.0
    },
    {
        "title": "Physics discord",
        "author": "hufhtyhtj",
        "url": "https://www.reddit.com/r/Physics/comments/zq3tlh/physics_discord/",
        "text": "Hey everyone, I made a physics discord recently in hopes of finding people to study with and learn from. I recently graduated with my BS in physics and I have a bit of time before graduate school so I want to focus on getting better at physics/math/coding. If you’re interested in joining, I’ll put the link here. Also feel free to pm if the link expires.\n\nhttps://discord.gg/CdCQKBZ3",
        "created_utc": 1671484610,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why does gravity act without respect to time?",
        "author": "galactacaster",
        "url": "https://www.reddit.com/r/Physics/comments/zq3kkd/why_does_gravity_act_without_respect_to_time/",
        "text": "And if most of the universe is “dark matter” (or something we can’t measure), what’s the point of relying so heavily on time in our calculations?\n\nTime helps us describe our experience, but does it really help us understand the principle physics? \n\ndisclaimer: i’m familiar with Einsteins ideas, but we also know these only apply in some circumstances.  Hard for me to accept these ideas as “truth” if they don’t universally apply.",
        "created_utc": 1671484018,
        "upvote_ratio": 1.0
    },
    {
        "title": "Which book can you recommend?",
        "author": "kingkyli",
        "url": "https://www.reddit.com/r/Physics/comments/zq317h/which_book_can_you_recommend/",
        "text": "I wanna learn more about Physics. I don’t have much knowledge about it so I wanna try and learn even just the “basics” and maybe if I like it enough, I can continue and learn advanced stuff. Can you recommend a book that will introduce me to physics? \n\n\nThanks.xx",
        "created_utc": 1671482773,
        "upvote_ratio": 1.0
    },
    {
        "title": "Recently graduated with a Bachelor’s degree in physics and have been struggling with employment.",
        "author": "Masshole0617",
        "url": "https://www.reddit.com/r/Physics/comments/zq1zzq/recently_graduated_with_a_bachelors_degree_in/",
        "text": "I’ll start off with my college experience, the professors in my department have a heavy bias on what the image of intelligence is and someone from my background to them should not be in the field of science. I was doubted and never given any opportunities the other students were given despite making great marks (As and Bs) and when I graduated I had listed them as references for a job that a small business owner and MIT graduate reached out to me for (the position was for a Photonics Design Engineer) and after speaking with my references I was offered a lower position with a lower salary. After working with this company for a few months the co-founder decided to bring in a new hire with less education and experience than I had for a higher position. I quit as I felt I was being taken advantage of doing a bulk of the companies work to barely make enough to take care of myself. Now I’m left struggling to find employment with all “bridges” (that were never actually built) being burned. I have decided to share my story here with any suggestions as to what I should do. I don’t have any connections but I’m damn good at what I do, can’t afford grad school but I’d kill it there.",
        "created_utc": 1671480330,
        "upvote_ratio": 1.0
    },
    {
        "title": "In Quantum physics, double slit experiment, what does it mean when a wave is measured but only a particle is observed. How to they measure the wave before it collapses?",
        "author": "BrooklynBuffalo",
        "url": "https://www.reddit.com/r/Physics/comments/zq1s89/in_quantum_physics_double_slit_experiment_what/",
        "text": "Stoner here. \nI heard the experiment explained a few times. But I don’t know how they do it. What are the differences in the two measurements? \n\nAnd why did some physicists say that consciousness effects the observation? I mean, what about the experiment allowed them to think this?\nThanks",
        "created_utc": 1671479855,
        "upvote_ratio": 1.0
    },
    {
        "title": "Terminal velocity",
        "author": "Ok_Manufacturer_5184",
        "url": "https://www.reddit.com/r/Physics/comments/zq0vaw/terminal_velocity/",
        "text": "Hello\nI have to write a lab report about the affect of mass on terminal velocity, and according to my data as the mass of an object increases, the rate at which terminal velocity increases is less. For example, at 6-8g the terminal velocity increased by 4.1%. However at 4-6g, it was 6.6%. This meant that the rate of increase decreased by 2.5%. Does anyone have any idea why about the science behind why?\nThank you",
        "created_utc": 1671477762,
        "upvote_ratio": 1.0
    },
    {
        "title": "please I need help with this. Anybody?",
        "author": "Zestyclose_Long1638",
        "url": "https://i.redd.it/eyolohd95y6a1.jpg",
        "text": "",
        "created_utc": 1671477664,
        "upvote_ratio": 1.0
    },
    {
        "title": "No physics school analogy explaining gravity. Does it make any sense guys?",
        "author": "nightcitywatch03",
        "url": "https://www.reddit.com/r/Physics/comments/zq0ps1/no_physics_school_analogy_explaining_gravity_does/",
        "text": "[removed]",
        "created_utc": 1671477420,
        "upvote_ratio": 1.0
    },
    {
        "title": "does space go infinitely in?",
        "author": "smackin-my-shmackle",
        "url": "https://www.reddit.com/r/Physics/comments/zq05fb/does_space_go_infinitely_in/",
        "text": "This sounds like an odd question, but if we could shrink a human down infinitely, how long until he runs out of particles to observe? Would there be a point where an elementary particle is found?",
        "created_utc": 1671476153,
        "upvote_ratio": 1.0
    },
    {
        "title": "At relativistic speed, can any journey be made within the human lifespan?",
        "author": "Dark_Raiden_",
        "url": "https://www.reddit.com/r/Physics/comments/zpze24/at_relativistic_speed_can_any_journey_be_made/",
        "text": "For example, a planet is 1500 light years away, or light would take 1500 years by our counting to get there.\n\nIf I am going 0.9999c, I would approximately arrive there just over 21 years of my counting, while 1500 years have passed on earth. \n\nWhich leads me to ask two questions:\n\n1. Would you function normally, as in your thoughts and day to day functioning since everything is normal in your reference?\n\n2. If you could magically travel at speed of light, and time should stop for you, does this mean you would never age? And would you be 'functioning' as normal?\n\nThanks",
        "created_utc": 1671474482,
        "upvote_ratio": 1.0
    },
    {
        "title": "Doubting about my capacity to be a good physicist. Need some career advise or maybe just talk abt it",
        "author": "Illustrious_Pepper61",
        "url": "https://www.reddit.com/r/Physics/comments/zpyy5j/doubting_about_my_capacity_to_be_a_good_physicist/",
        "text": "I'm in my second year of physics, I aspire to become a particle physicist and be able to work in research, only lately I've been a little stressed thinking about whether I can really contribute something to physics. \n\nWe recently went on vacation at my university and I feel the need to continue advancing in my studies. This is consuming me and I really don't know what to do, it's a mixture of fear and stress that I don't like. Thank you very much for reading haha, if someone answers this, I will be reading your comments \\^\\^",
        "created_utc": 1671473496,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why Are Metals Magnetic?",
        "author": "VrobleBlog",
        "url": "https://www.vroble.com/2022/12/why-are-metals-magnetic.html",
        "text": "",
        "created_utc": 1671468582,
        "upvote_ratio": 1.0
    },
    {
        "title": "Guys i would love to know what i can do to make this content better",
        "author": "AlarmingItem4959",
        "url": "https://www.youtube.com/watch?v=WknAE4LN1VU",
        "text": "",
        "created_utc": 1671467253,
        "upvote_ratio": 1.0
    },
    {
        "title": "Hawking Radiation, where do the particles come from?",
        "author": "eric_dh",
        "url": "https://www.reddit.com/r/Physics/comments/zpvyct/hawking_radiation_where_do_the_particles_come_from/",
        "text": "I am reading Brief History of Time and he writes that according to the theory particles and anti-particles form just outside the event horizon. And in those instances where the anti-particle gets pulled back into the event horison the remaining particle will be ejected as Hawking Radiation.\nI read the Wiki page on this and it says there is a \"thermal bath\" near the event horizon where particles pop in and out?\nMy question is, do these particles exist before being outside the event horizon or do they just appear, being formed from energy(?). \nI'm just an average Joe interested in physics.",
        "created_utc": 1671466882,
        "upvote_ratio": 1.0
    },
    {
        "title": "90% sure i just failed my midterm lol",
        "author": "givemeabookpls",
        "url": "https://www.reddit.com/r/Physics/comments/zpvr96/90_sure_i_just_failed_my_midterm_lol/",
        "text": "who else is taking exams rn??? I didn’t know half the FRQ’s :)",
        "created_utc": 1671466427,
        "upvote_ratio": 1.0
    },
    {
        "title": "why is half of my clothesline vibrating?",
        "author": "stonedfishing",
        "url": "https://v.redd.it/xcz6rbs5ov6a1",
        "text": "",
        "created_utc": 1671465767,
        "upvote_ratio": 1.0
    },
    {
        "title": "Could someone help me with this projectiles Qs",
        "author": "vChxrliee",
        "url": "https://i.redd.it/3xv6k2rpuw6a1.jpg",
        "text": "",
        "created_utc": 1671462010,
        "upvote_ratio": 1.0
    },
    {
        "title": "how to learn physics at home? I want to learn physics. Please leave any courses that helped you and recommend all the books. Also, any college level course.",
        "author": "Reasonable_Drawer_57",
        "url": "https://www.reddit.com/r/Physics/comments/zptlp9/how_to_learn_physics_at_home_i_want_to_learn/",
        "text": "",
        "created_utc": 1671461448,
        "upvote_ratio": 1.0
    },
    {
        "title": "Job outlook/experience in biophysics",
        "author": "Funky-polarbear1126",
        "url": "https://www.reddit.com/r/Physics/comments/zpt0fv/job_outlookexperience_in_biophysics/",
        "text": "Hey everyone! \n\nI’m curious if anybody here is in the biophysics profession? \n\nWhats your experience in it and in how is the job outlook in your area? \n\nI was a biophysics at my university but had to drop out back in 2017 for financial reasons. \n\nI took up being an electrician for these last few years but really felt like I sold myself short of being a year away from having my bachelors in biophysics. \n\nI’m planning to come back to school next term, and have already arranged it with my university. \n\nI’ll still be planning to work full time as an electrician and plan to finish out my last year or so as a part time student at my university. \n\nI’m just wanted to get an idea how the field of biophysics looks like as a work profession.",
        "created_utc": 1671460002,
        "upvote_ratio": 1.0
    },
    {
        "title": "What are you working on? - Weekly Discussion Thread - December 19, 2022",
        "author": "AutoModerator",
        "url": "https://www.reddit.com/r/Physics/comments/zpsc2v/what_are_you_working_on_weekly_discussion_thread/",
        "text": "Hello /r/Physics.\n\nIt's everyone's favorite day of the week, again. Time to share (or rant about) how your research/work/studying is going and what you're working on this week.",
        "created_utc": 1671458410,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can a neutron capture an electron?",
        "author": "servermeta_net",
        "url": "https://www.reddit.com/r/Physics/comments/zpriqj/can_a_neutron_capture_an_electron/",
        "text": "If a proton captures an electron it becomes a neutron. Can then the neutron capture another electron, with a different spin from the first one?\n\n&amp;#x200B;\n\nSince the two electrons have different spin it should not cause a problem with pauli's exclusion principle, still I couldn't find any mention of this in the literature I searched (maybe I'm using the wrong terms?)",
        "created_utc": 1671456321,
        "upvote_ratio": 1.0
    },
    {
        "title": "if screen separation in Young's double slit experiment decreases by 25% its effect on fringe width?",
        "author": "Playful-Meal-3093",
        "url": "https://www.reddit.com/r/Physics/comments/zprdwe/if_screen_separation_in_youngs_double_slit/",
        "text": "",
        "created_utc": 1671455975,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can we please be more vigilant about posts asking about, at best, stoner physics?",
        "author": "AdventurousJeweler23",
        "url": "https://www.reddit.com/r/Physics/comments/zpqy70/can_we_please_be_more_vigilant_about_posts_asking/",
        "text": "I love this subreddit and the people here.\n\nIt’s a wonderful community of people who all appreciate physics, the work that goes into it, and the understanding it brings us.\n\nI have noticed, however, a surge in what I would describe as “stoner physics” posts. Posts suggesting crackpot astronomical theories that have no place in a real physics subreddit.\n\nI think the mods are generally doing a good job - these posts are all taken down eventually. Would it be possible, however, to restrict the posting of new content, e.g., to accounts who have been members for X days?",
        "created_utc": 1671454823,
        "upvote_ratio": 1.0
    },
    {
        "title": "Physics",
        "author": "tay_h70",
        "url": "https://www.reddit.com/r/Physics/comments/zpp64y/physics/",
        "text": "[removed]",
        "created_utc": 1671449592,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can someone tell the answers of these questions",
        "author": "p4st4_sauce",
        "url": "https://www.reddit.com/gallery/zplwt1",
        "text": "",
        "created_utc": 1671437755,
        "upvote_ratio": 1.0
    },
    {
        "title": "New movie about Oppenheimer",
        "author": "carbonqubit",
        "url": "https://www.youtube.com/watch?v=ZxslGy6yg4Y",
        "text": "",
        "created_utc": 1671437138,
        "upvote_ratio": 1.0
    },
    {
        "title": "Calculate for the H (maximum height of AB). Calculate for the flight time from point A to Point C. Calculate for the Range from point A to Point C.",
        "author": "Adventurous_Income98",
        "url": "https://i.redd.it/29g1qd8ght6a1.jpg",
        "text": "",
        "created_utc": 1671421235,
        "upvote_ratio": 1.0
    },
    {
        "title": "Un-Polarized board game?",
        "author": "Slavic_DocBrown",
        "url": "https://www.reddit.com/r/Physics/comments/zpg8e3/unpolarized_board_game/",
        "text": "So I came across a video of a guy removing the polarizer from a computer monitor to make a hidden monitor that only he could see with polarized glasses.\n\nAnd I was wondering if it would even be possible to create a board game using an LCD for the tile that hides what is being shown and only emits that bright white light unless you’re wearing such glasses?",
        "created_utc": 1671419193,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to discharge static on a crystal ball ornament?",
        "author": "agamenong",
        "url": "https://www.reddit.com/r/Physics/comments/zpfty0/how_to_discharge_static_on_a_crystal_ball_ornament/",
        "text": "We got a Christmas ball ornament that has small foam balls that are charged and clinging to the glass. Any ideas on how to discharge it?\n\nhttps://preview.redd.it/qtly742hqr6a1.jpg?width=3024&amp;format=pjpg&amp;auto=webp&amp;s=648056b21481b380113abff4ea2f8f9533d1a152",
        "created_utc": 1671418055,
        "upvote_ratio": 1.0
    },
    {
        "title": "If you were the first to eat/drink a specific food/beverage, what would it be?",
        "author": "Salty-Physics-7904",
        "url": "/r/AskReddit/comments/zpfp7w/if_you_were_the_first_to_eatdrink_a_specific/",
        "text": "",
        "created_utc": 1671417807,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is something we all do but is considered morally wrong?",
        "author": "Salty-Physics-7904",
        "url": "/r/AskReddit/comments/zpfnkn/what_is_something_we_all_do_but_is_considered/",
        "text": "",
        "created_utc": 1671417657,
        "upvote_ratio": 1.0
    }
]