[
    {
        "title": "If you have money to buy just one book of classical mechanics wich one would you take?why?",
        "author": "x_Ghostemane_x",
        "url": "https://www.reddit.com/r/Physics/comments/zw20aa/if_you_have_money_to_buy_just_one_book_of/",
        "text": "\n\n[View Poll](https://www.reddit.com/poll/zw20aa)",
        "created_utc": 1672102076,
        "upvote_ratio": 1.0
    },
    {
        "title": "Thoughts?",
        "author": "hdaamamam",
        "url": "https://www.reddit.com/gallery/zw1xin",
        "text": "",
        "created_utc": 1672101862,
        "upvote_ratio": 1.0
    },
    {
        "title": "Electrocution myth around ungrounded wire contact?",
        "author": "Mastian91",
        "url": "https://www.reddit.com/r/Physics/comments/zw1q40/electrocution_myth_around_ungrounded_wire_contact/",
        "text": "I've been studying electricity (especially. AC/mains) and there seems to be a myth (?) that you can safely touch an arbitrarily high voltage power line as long as you don't also touch a lower potential object (i.e. \"ground\").\n\nI don't understand this unless it's meant to be an idealization. Why doesn't the current just travel through the human body as well as the hot wire, especially since the human body would be at a much lower potential than the wire?\n\nPeople like to give glib answers about needing to complete a circuit, but a human is certainly not a single point - we have trillions upon trillions of atoms touching the wire, even on a single hand.\n\nEven with the relatively high resistance of skin, wouldn't the high voltage just push AC waves back and forth through the body, which has now become part of the \"hot\" transmission wire?\n\nOn a related note, is this why the linemen need to bring themselves &amp; the helicopter up to potential with the conducting wand? Or is there a more advanced explanation around capacitors?\n\nNot sure if I'm communicating right, but it bothers me when people idealize everything as if currents can only flow on dedicated circuits or through the earth. What makes the earth any different from a human body when you're talking about 700K volts on the hot line(s)?",
        "created_utc": 1672101294,
        "upvote_ratio": 1.0
    },
    {
        "title": "If the infinite multiverse exists does that mean the majority blink out of existence?",
        "author": "newdad1244567",
        "url": "https://www.reddit.com/r/Physics/comments/zw0mcr/if_the_infinite_multiverse_exists_does_that_mean/",
        "text": "If that's true it means our universe must have survived infinite deaths to continue right?",
        "created_utc": 1672098396,
        "upvote_ratio": 1.0
    },
    {
        "title": "I think it's fair to say Mitch Halley has passion.",
        "author": "Suhn-Sol-Jashin",
        "url": "https://youtu.be/KmfdeWd0RMk",
        "text": "",
        "created_utc": 1672097964,
        "upvote_ratio": 1.0
    },
    {
        "title": "Photoelectric Effect",
        "author": "pessimisticRhino",
        "url": "https://www.reddit.com/r/Physics/comments/zw05yk/photoelectric_effect/",
        "text": "for the equation \n\nhf= work function + 1/2 mv\\^2\n\n&amp;#x200B;\n\nif im trying to find the velocity, why do i need to multiply the 1/2 by 2? \n\nwhy cant i directly divide with the 1/2?\n\n&amp;#x200B;\n\nThankyou",
        "created_utc": 1672097168,
        "upvote_ratio": 1.0
    },
    {
        "title": "Copernicus or al-Biruni??",
        "author": "bids88",
        "url": "https://www.reddit.com/r/Physics/comments/zvzqqg/copernicus_or_albiruni/",
        "text": "Hello all- \n\nSo from the title you can see this is more of a phsycis history question lol. (I'm not someone that knows A LOT about physics or anything for that matter, but I do love to learn so forgive my ignorance if I'm basically talking shite here).\n\nI'm currently reading the Silk Roads by Peter Frankopan (great read if you like a bit of history) and in it he briefly mentions Abu Rayhan al-Biruni  \"who establishes that the world revolves around the sun and rotates on an axis\".\n\nI thought Copernicus was the fella who established the earth revolving around the sun, but he wasn't born til like 450ish years later.\n\nDid a bit of googling but I'm none the wiser.  Am I picking this up wrong, can anyone help me out? \n\nApologies if I'm posting in the wrong place. Any info/pointers in the right direction/ help would be much appreciated 🙂👍",
        "created_utc": 1672096067,
        "upvote_ratio": 1.0
    },
    {
        "title": "The Gaze - Cost and Ability Of Impact",
        "author": "schoolofsoul",
        "url": "https://www.reddit.com/r/Physics/comments/zvzdcz/the_gaze_cost_and_ability_of_impact/",
        "text": "WHAT Is the true cost to the human/soul to have another gaze upon them?\n\nIF as the Observer Effect is correct that the human eye can change/adjust/effect the result of moving atoms. And we are made of atoms - then..\n\nWHAT is the effect of having others gaze upon us daily on social media?",
        "created_utc": 1672095114,
        "upvote_ratio": 1.0
    },
    {
        "title": "Where would an potentially infinite universe expand into? (No idea of physics)",
        "author": "EmergencySea8201",
        "url": "https://www.reddit.com/r/Physics/comments/zvynww/where_would_an_potentially_infinite_universe/",
        "text": "This literally bothers me: I already read about the definition of space, vacuum etc and how infinite + x is still infinite. Let me put my idea into simple words: if the universe is a piece of paper on the table and it’s infinite ( doesn’t need to be), the room I sit in would need to be infinite so the paper can be. The  earth would need to be infinite so the room can be infinite. You can my point. This would lead to infinite numbers of “spaces”, as I would call it.  How should that work, in theory",
        "created_utc": 1672093300,
        "upvote_ratio": 1.0
    },
    {
        "title": "Crystal tech",
        "author": "Creative_Security_65",
        "url": "https://www.reddit.com/r/Physics/comments/zvwgbt/crystal_tech/",
        "text": "I have a niece who is interested in fantasy. Crystal wands /staffs, wizzards etc... so naturally i've tried to expain some real life examples of crystals used in todays' tech. Mainly lasers, then piezo watches + rubies/saffires in mechanical watches. Do you guys have any other real life examples of \"fantasy crystal tech\" for me to tell her about?",
        "created_utc": 1672087575,
        "upvote_ratio": 1.0
    },
    {
        "title": "Toroidal Field Theory + The Impact Of The Spoken Word",
        "author": "schoolofsoul",
        "url": "https://www.reddit.com/r/Physics/comments/zvwfex/toroidal_field_theory_the_impact_of_the_spoken/",
        "text": "If the heart has a Toroidal Field and our words form Toroidal Fields as we speak - What is the impact when the two collide?",
        "created_utc": 1672087509,
        "upvote_ratio": 1.0
    },
    {
        "title": "Boring doubt",
        "author": "prokp3",
        "url": "https://www.reddit.com/r/Physics/comments/zvvngi/boring_doubt/",
        "text": "Hello I have a very easy doubt in physics but could not find it anywhere listed on google so here it goes.\n\nas you know when light enters from rarer to denser it slows down because of the density of molecules present there but when it gets from denser to rarer it gets fast again. my doubt is how can something increase its speed if there is no other external forcing acting on it. like there is no nothing pushing or accelerating the photons then how can it get faster??\n\nthanks in advance even if you just read till here.\n\nI know it is a pretty easy one but I just can't understand I don't know why",
        "created_utc": 1672085433,
        "upvote_ratio": 1.0
    },
    {
        "title": "How can I encourage my younger brother’s interest in physics and math?",
        "author": "jozwikmattribute",
        "url": "https://www.reddit.com/r/Physics/comments/zvv0n0/how_can_i_encourage_my_younger_brothers_interest/",
        "text": "Some context: For a few years now, my 16-year old brother (Junior in HS) has been considering engineering as a possible undergraduate major because he thought that would be a good way to continue to use math (our dad is an engineer), as math has been his favorite subject thus far in his schooling. \n\nHowever, I recently discussed major choices with him and mentioned that both physics and math could be other options to consider in addition to engineering. He seemed to light up at the idea, and I think physics is what he’s leaning towards over pure mathematics.\n\nI am just finishing my undergraduate studies (in an unrelated STEM field) and have seen plenty of people during my time in college discourage physics due to its difficulty, etc, and would hate for him to be discouraged by this. \n\nI have no personal stake in what specific direction he goes—I just want to encourage him to study what he’s passionate about. Do you all have any ideas about how to do so in regard to physics? Any interesting podcasts, books, documentaries, interviews, etc that I can suggest to him? Or other ideas! I’m open to whatever :)\n\nThanks so much in advance for your help!",
        "created_utc": 1672083733,
        "upvote_ratio": 1.0
    },
    {
        "title": "Existence of Superposition",
        "author": "RoTakY",
        "url": "https://www.reddit.com/r/Physics/comments/zvu257/existence_of_superposition/",
        "text": "I'm reading a book describing the quantum field theory (What is the difference between a child and a laptop?, by Cristian Presură)\n\nIn the book, I've learned about the existence of the Dirac field, which collapses whenever an observer observes a quantum event.\nThrough my understanding, whenever I observe an event, the entire Dirac field suffers a quantum collapse, and so everything that had been in quantum superposition collapses.\n\nWell, then, does this not mean that, because I am constantly observing some event or other, no particle in the Dirac Field could be, at any time, in superposition? Does this not mean that superposition should not actually exists?\n\nI'd love to learn why my understanding is wrong, thank you very much!",
        "created_utc": 1672081177,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is heat death disputed?",
        "author": "3d54s2",
        "url": "https://www.reddit.com/r/Physics/comments/zvtiq0/is_heat_death_disputed/",
        "text": "",
        "created_utc": 1672079750,
        "upvote_ratio": 1.0
    },
    {
        "title": "Pulling Energy from the Vacuum (Lt. Col. Thomas Bearden) - What's your opinion on his claims?",
        "author": "Big_carrot_69",
        "url": "https://www.youtube.com/watch?v=eNU3MLqyzPk",
        "text": "",
        "created_utc": 1672079020,
        "upvote_ratio": 1.0
    },
    {
        "title": "New community @ destinedspiritually",
        "author": "44414442444",
        "url": "https://www.reddit.com/r/Physics/comments/zvsiig/new_community_destinedspiritually/",
        "text": "r/destinedspiritually",
        "created_utc": 1672077093,
        "upvote_ratio": 1.0
    },
    {
        "title": "Doesn't Gravitons are the culprit of time dilation ?",
        "author": "METALGEARLX",
        "url": "https://www.reddit.com/r/Physics/comments/zvrbyg/doesnt_gravitons_are_the_culprit_of_time_dilation/",
        "text": "According GR space and time are a continum structure.\n\nLets go near a black hole, the gravitational field of the black hole produce signifiant time dilation. \n\nGravity and Time dilation are obviously linked thanks to Einstein. \n\nWait a second... is that mean that theory like Strings Theory have a Graviton in the spectrum , **a Graviton on a background space-time ?** Seems a little bit weird to me.\n\nThanks for eventual answers.",
        "created_utc": 1672073852,
        "upvote_ratio": 1.0
    },
    {
        "title": "Weight depending on altitude",
        "author": "DefendThem",
        "url": "https://www.reddit.com/r/Physics/comments/zvqxcb/weight_depending_on_altitude/",
        "text": "Hello,  \nI was currently reading a german article about the mount everest:  \n[https://www.geo.de/natur/nachhaltigkeit/22236-rtkl-alpinismus-der-kampf-gegen-muell-und-massen-muessen-wir-die-berge](https://www.geo.de/natur/nachhaltigkeit/22236-rtkl-alpinismus-der-kampf-gegen-muell-und-massen-muessen-wir-die-berge)\n\nThere it says, that each gram is a kilogram at 8500m...  \nThat would mean that everything gets heavier at altitude up to 1000x...\n\n&amp;#x200B;\n\nI can't imagine that this corresponds to reality, especially since everything should actually be lighter at higher altitudes, right?\n\nHow could a normal person with a weight of about 70kg continue to climb when he weighs 70 tons?",
        "created_utc": 1672072699,
        "upvote_ratio": 1.0
    },
    {
        "title": "Virtual Particles",
        "author": "nightwolf171",
        "url": "https://www.reddit.com/r/Physics/comments/zvpi1p/virtual_particles/",
        "text": "If we cannot observe virtual particles because they would break the laws of conservation of energy, then how can we say that they exist? Do you guys think that there's some other explanation for their existence??\n\nAnd I've also wondered why we can't say that the graviton exists when we've already predicted its properties, as I thought virtual particles were based on prediction?\n\nSorry for my confused understanding, I'm a college student trying to wrap my head around this concept 😅",
        "created_utc": 1672068659,
        "upvote_ratio": 1.0
    },
    {
        "title": "Radius of the Trinity explosion as analyzed by GI Taylor",
        "author": "natures-numbers",
        "url": "https://i.redd.it/plqsbssne98a1.gif",
        "text": "",
        "created_utc": 1672067919,
        "upvote_ratio": 1.0
    },
    {
        "title": "Just kidding pass physics with a 85 😅",
        "author": "flashy_lineup",
        "url": "https://v.redd.it/crefv1rvra8a1",
        "text": "Stay in the loop on all the best memes by subscribing to our account😅",
        "created_utc": 1672066401,
        "upvote_ratio": 1.0
    },
    {
        "title": "Philosophy of science",
        "author": "higgsbosonneutrino",
        "url": "https://www.reddit.com/r/Physics/comments/zvokps/philosophy_of_science/",
        "text": "Can someone suggest books on philosophy of science?",
        "created_utc": 1672065925,
        "upvote_ratio": 1.0
    },
    {
        "title": "On the occasion of his birthday, the United Nations (UN) in year 2015 had declared 15 October as World Student’s Day.",
        "author": "science-driver",
        "url": "https://www.sciencedriver.co.in/2022/12/abdul-kalam-unknown-facts.html",
        "text": "",
        "created_utc": 1672064992,
        "upvote_ratio": 1.0
    },
    {
        "title": "What are you working on? - Weekly Discussion Thread - December 26, 2022",
        "author": "AutoModerator",
        "url": "https://www.reddit.com/r/Physics/comments/zvnpcn/what_are_you_working_on_weekly_discussion_thread/",
        "text": "Hello /r/Physics.\n\nIt's everyone's favorite day of the week, again. Time to share (or rant about) how your research/work/studying is going and what you're working on this week.",
        "created_utc": 1672063209,
        "upvote_ratio": 1.0
    },
    {
        "title": "Elective subjects choose",
        "author": "AlRuNo56",
        "url": "https://www.reddit.com/r/Physics/comments/zvmqbk/elective_subjects_choose/",
        "text": "Good morning, everyone,\n\nWhat can I do in terms of graduate work or studies if I choose electronics and communications as my electives  subjects?\n\n&amp;#x200B;\n\nThanks in advance",
        "created_utc": 1672059872,
        "upvote_ratio": 1.0
    },
    {
        "title": "J. Robert Oppenheimer cleared of “black mark” against his name after 68 years",
        "author": "mgodoysi",
        "url": "https://arstechnica.com/science/2022/12/j-robert-oppenheimer-cleared-of-being-suspected-soviet-spy-after-68-years/",
        "text": "",
        "created_utc": 1672052093,
        "upvote_ratio": 1.0
    },
    {
        "title": "i was trying to learn \"canonical transformation\" all by myself. but i can't understand those 2 lines... how did they do that ??? i can't understand there Right or Wrong.If you understand can you please Elaborate those red lines.",
        "author": "Alin1260",
        "url": "https://i.redd.it/3v5no48xh98a1.jpg",
        "text": "",
        "created_utc": 1672050956,
        "upvote_ratio": 1.0
    },
    {
        "title": "ummm.... basically i was trying to learn \"canonical transformation\" all by myself. so i took some mathematical problem but I'm stuck her 😞😞 i mean you saw those 2 Red lines .... there .... can you please Elaborate those two lines. I'm stuck here pretty badly...",
        "author": "Alin1260",
        "url": "https://i.redd.it/j2bkavucd98a1.jpg",
        "text": "",
        "created_utc": 1672049413,
        "upvote_ratio": 1.0
    },
    {
        "title": "Find My New Article On Statistical Physics here",
        "author": "souparnorik",
        "url": "https://physicsus.com/2022/12/statistical-mechanics-the-physics-of-how-systems-work/",
        "text": "",
        "created_utc": 1672039587,
        "upvote_ratio": 1.0
    },
    {
        "title": "Very old video of a simple electric motor I made",
        "author": "samara_040",
        "url": "https://v.redd.it/p1pecr9ob88a1",
        "text": "",
        "created_utc": 1672036741,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does the relative strength of an object decay with this formula as the size?",
        "author": "Atmo_reetry",
        "url": "https://www.reddit.com/r/Physics/comments/zvfus0/does_the_relative_strength_of_an_object_decay/",
        "text": " I remember that I've heard this formula at someplace : The strength of an object grows as its the square of its cross-sectional area, or the square of this object grow on it's two axis; But its mass increase as the three powered of its length of three axis increase on its three axis, so its mass increase faster than its cross-sectional area as x\\^(3-2),which means that the relative strongness decrease to the object as the increase of its size. \n\n According to this formula,I calculated that if we pin a 10cm pencil with 5mm in diameter on a desk it could hold 500g of mass on its end,If we do the same thing to a 1m stick with 5cm in diameter it could hold 50kg of mass — Does the relative strength of an object decay like this?",
        "created_utc": 1672032062,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can we derive special relativity from one postulate instead of two?",
        "author": "vdark777",
        "url": "https://www.reddit.com/r/Physics/comments/zvews9/can_we_derive_special_relativity_from_one/",
        "text": "The internet seems to claim that special relativity is based on two postulates:\n\nA. The laws of physics are invariant in all inertial frames of reference.\n\nB. The speed of light in a vacuum is the same for all observers, regardless of the motion of the light source or the observer.\n\nHowever, some other sources claim that A may encompass B, and I was wondering if there was any way to structure the postulates to create one more fundamental statement.\n\nIf not, is there any more satisfactory postulate than just \"c is constant?\" It seems like there should be something deeper behind that.\n\nThank you!",
        "created_utc": 1672028659,
        "upvote_ratio": 1.0
    },
    {
        "title": "Quantum Entanglement- Hypothesis",
        "author": "NeverLetItCatch",
        "url": "https://www.reddit.com/r/Physics/comments/zvetao/quantum_entanglement_hypothesis/",
        "text": "This is based on the belief that a particles positional certainty can be 0%. I give a brief summary on how this could make sense and what would happen as a result. \n\n\nA particles position and momentum can not be observed without counter-acting effects. The more precise we know the position of a particle, the less we know of its momentum and vice versa. The more certain we become about a particles momentum, the more uncertain its position is. This means a particle has the ability to exist anywhere in the universe based on its probability of position. This is Heisenberg's Uncertainty Principle. Particles in an uncertain state can also still be affected by an external force. If the particles position or momentum is uncertain, it can still be affected by external force without \"collapsing\" or being \"observed.\" I do not believe two different particles are entangled, rather it's the same particle physically existing in two places upon being in its particle state. Particles can also experience particle properties and \"wave\" properties non-simultaneously. This can be possible because of something called wave-particle duality. So if a particle were in its \"wave\" state, it really just means either its position or its momentum is uncertain. So if a particles positional probability is 0% certain, it means theres no probability that it can be in one precise spot. This can happen when a particles momentum is 100% certain. If it's positional certainty was 0%, it would not have an exact spot to go to when being observed or affected by external force that causes it to collapse and appearing in multiple places. This process would not require any travel of information or matter in general. Simply, if Particle A in one location hits another particle in which observes Particle A. Particle A in a completely different location is still affected because it's the same particle. This can also be known as Quantum Entanglement.",
        "created_utc": 1672028298,
        "upvote_ratio": 1.0
    },
    {
        "title": "High Physics Thoughts",
        "author": "Plantsbirdsrockss",
        "url": "https://www.reddit.com/r/Physics/comments/zvejjh/high_physics_thoughts/",
        "text": "If you were buried in sand or something which would prevent you from visually knowing which way is up, could you determine which way us up?",
        "created_utc": 1672027324,
        "upvote_ratio": 1.0
    },
    {
        "title": "Centripetal force (I know this is overdone, but I got confused about something when talking to someone)",
        "author": "jffrysith",
        "url": "https://www.reddit.com/r/Physics/comments/zvb1zj/centripetal_force_i_know_this_is_overdone_but_i/",
        "text": "Consider a scenario where I'm spinning a ball on a string around my hand. The ball is being accelerated inwards due to the centripetal force I'm applying with my hand. However, according to newton's third law, an equal and opposite reaction force must occur in the string. Because the force on the ball from the string points towards the center of curvature, wouldn't this mean there would be a centrifugal force acting on the string away from the center of curvature? (As in the ball's force on the string)  \nObviously, the string has a net force towards the center of the circle - as - if we took any point on the string, the string follows a similar path as the ball.",
        "created_utc": 1672015721,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why is the relationship between space and time a better definition for space time than the relationship between matter and entropy?",
        "author": "Bewareiago",
        "url": "https://www.reddit.com/r/Physics/comments/zvan35/why_is_the_relationship_between_space_and_time_a/",
        "text": "",
        "created_utc": 1672014385,
        "upvote_ratio": 1.0
    },
    {
        "title": "why there cannot be hidden variables in Bell's inequality?",
        "author": "Thraling",
        "url": "https://www.reddit.com/r/Physics/comments/zv75ov/why_there_cannot_be_hidden_variables_in_bells/",
        "text": "As amateur, I've seen many times the explanation:\n\n\"Well, if we measure along 3 different axes the spin of a particle, all the possible results are 111, 110, 101, etc.\" So basically scrambling all the possible combinations without favouring anyone.\n\n\"But QT says that if we place the measuring axes at an angle (not 90°), the first measure will give us an idea already of what the next axis will be (not always, but with a probability)\".\n\nAnd then they go \"well, you see, if we pick this and that from the combinations of the first example we get x, instead of we pick them from the second we get y, which is closer to the predictions of QT\".\n\nOk, but why we didn't include the rule of \"influencing axes\" in example 1? That would still count as hidden variables even with a probabilistic element in it. Or?",
        "created_utc": 1672003793,
        "upvote_ratio": 1.0
    },
    {
        "title": "Gravity? What the heck is it? Everything particle/wave has some? Do the activity of electrons spinning have gravitational relationships?",
        "author": "congojack8119",
        "url": "https://www.reddit.com/r/Physics/comments/zv6xdf/gravity_what_the_heck_is_it_everything/",
        "text": "Common lay it on me Christmas style",
        "created_utc": 1672003098,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is Electromagnetism possible in 2D universe?",
        "author": "photon_cruncher",
        "url": "https://www.reddit.com/r/Physics/comments/zv6fww/is_electromagnetism_possible_in_2d_universe/",
        "text": "Is it possible for electromagnetism to exist in a 2D universe, given that the Maxwell equations involve the curl of the fields, which implies a minimum of three dimensions?\nIf it is possible, what do the equations look like that describe the EM field in this universe?",
        "created_utc": 1672001637,
        "upvote_ratio": 1.0
    },
    {
        "title": "Help for Momentum conservation",
        "author": "reizzit",
        "url": "https://www.reddit.com/r/Physics/comments/zv5h0l/help_for_momentum_conservation/",
        "text": "Does anyone know why in problems with a bob and bullet we can apply linear momentum conservation but when a rod is hinged we can't apply linear/angular momentum conservation why?\n\nAnother question when we take massless pulley and string, tension across the string remains same when we take a massive string the tension isn't constant and when we take a massive pulley on which the massless string rotates on then again the tension isn't constant. What happens in the last 2 cases? Why tension isn't constant?",
        "created_utc": 1671998680,
        "upvote_ratio": 1.0
    },
    {
        "title": "Are the problems I do in class going to be similiar to the ones in the textbook? (more info inside)",
        "author": "CompanyOpossum",
        "url": "https://www.reddit.com/r/Physics/comments/zv4mpz/are_the_problems_i_do_in_class_going_to_be/",
        "text": "They have problems like  \n\n&gt; \"Estimate the number of dentists (a) in San Francisco and (b) in your town or city\"\n\nIs this what a physics course would be like? I can't imagine myself doing very well in a class where I have to do so much guesswork.",
        "created_utc": 1671996131,
        "upvote_ratio": 1.0
    },
    {
        "title": "Agree or disagree, if you make predictions about the universe based on todays knowledge you are almost certain to get it wrong, because we are very unclear about whats going on currently?",
        "author": "Serious_Final_989",
        "url": "https://www.reddit.com/r/Physics/comments/zv45ed/agree_or_disagree_if_you_make_predictions_about/",
        "text": "So while there is some respectable science and progress taking place, we are not anywhere near a TOE, and its very clear we have massive holes in our knowledge today. \n\n&amp;#x200B;\n\nIf we didnt have massive holes (dark matter dark energy, quantum theory, general relativity gravity time probability based universe string theory multiverses  singularities etc) we could ponder and predict  well using the most respected current theories, but we do have holes massive holes so any kind of predictions or musings you have unless very carefully selected are likely hog wash?",
        "created_utc": 1671994713,
        "upvote_ratio": 1.0
    },
    {
        "title": "does anyone know how to make a generator that works off magnets?",
        "author": "TRECT0",
        "url": "https://www.reddit.com/r/Physics/comments/zv43nj/does_anyone_know_how_to_make_a_generator_that/",
        "text": " \n\nI have a good project idea in mind and it involves a generator made out of magnets. I have been searching for a way to make one but all the youtube videos I found seem a bit sketchy, thus I came here to ask for your assistance.\n\nHere is the only video I found reasonable  \n[https://www.youtube.com/watch?v=Scaggwv8Cms&amp;t=124s](https://www.youtube.com/watch?v=Scaggwv8Cms&amp;t=124s)\n\nAll I need it a simple working generator that works off magnets and can output at least 9V\n\nit is fine if a part of it has to be powered by electricity, would be crazy to ask for a free energy generator.  \nThank you",
        "created_utc": 1671994560,
        "upvote_ratio": 1.0
    },
    {
        "title": "What classes should I take?",
        "author": "slapface741",
        "url": "https://www.reddit.com/r/Physics/comments/zv3bug/what_classes_should_i_take/",
        "text": "I’m a high school junior, next year will be my last year of high school and I’ll be taking AP physics 1, pre-calculus, and maybe college algebra. I was wondering when I go to college (which I’m planning to very soon after gushy school) what physics and physics related classes should I take on my road to a phd. I’m already planning on taking physics 2, and 3, calculus 1, 2, and 3, linear algebra, but what else is there to take for a physics major? Help please!",
        "created_utc": 1671992169,
        "upvote_ratio": 1.0
    },
    {
        "title": "is there a herpes/STI expert available I needed to ask a question if you can call me at 3138284318",
        "author": "tonytone313",
        "url": "https://www.reddit.com/r/Physics/comments/zv355c/is_there_a_herpessti_expert_available_i_needed_to/",
        "text": "",
        "created_utc": 1671991593,
        "upvote_ratio": 1.0
    },
    {
        "title": "People of the physics community I need help",
        "author": "TRECT0",
        "url": "https://www.reddit.com/r/Physics/comments/zv32jb/people_of_the_physics_community_i_need_help/",
        "text": "I have a good project idea in mind and it involves a generator made out of magnets. I have been searching for a way to make one but all the youtube videos I found seem a bit sketchy, thus I came here to ask for your assistance.\n\nHere is the only video I found reasonable   \n[https://www.youtube.com/watch?v=Scaggwv8Cms&amp;t=124s](https://www.youtube.com/watch?v=Scaggwv8Cms&amp;t=124s)\n\nAll I need it a simple working generator that works off magnets and can output at least 9V  \nThank you",
        "created_utc": 1671991367,
        "upvote_ratio": 1.0
    },
    {
        "title": "Do any contemporary physicists dispute heat death?",
        "author": "3d54s2",
        "url": "https://www.reddit.com/r/Physics/comments/zuwlkc/do_any_contemporary_physicists_dispute_heat_death/",
        "text": "",
        "created_utc": 1671968504,
        "upvote_ratio": 1.0
    },
    {
        "title": "Quantum (photon interact with electron) level explanation for RF portion of the EMS spectrum resource(s)?",
        "author": "DinoBay",
        "url": "https://www.reddit.com/r/Physics/comments/zuwhqj/quantum_photon_interact_with_electron_level/",
        "text": "I already posted this in the r/amateurradio , but was told this might be the better place to find an answer. I guess this is the best subreddit to find the answer ( if not please refer me to somewhere else)\n\nI want to know the answer for a particular situation right now, but I'd also be interested in any resources for how different weather/terrain affects RF on both smaller and biggger scale.\n\nFurther detail on what I'm trying to figure out :\n\nI want to know what happens on the really small scale level in RF propagation. In particular HF skywaves ( in case you don't know, 3 to 30 MHz is HF).\n\nHigher frequencies more easily pass through the ionoized layer than lower does, and lower refracts more easily. I've recently learned that photons are the force carrier for EM &amp; electrons emit photons and can kind of bounce away from each other. I think that is going somewhere? But I'm not sure about after that. I think somehow electric fields are involved. I would assume if a layer is ionized then it would have a greater E field ?\n\nSo I think that as the RF waves get towards this layer the E field charge pushes the RF away? But also I heard that photons don't interact with E fields so I'm not sure what stops the RF.\n\nAnd then the 2nd part to this that i do not understand is : Why can higher frequencies shoot through energized gas layers, but lower can't? It's all photons, is there a certain property or equation in physics that would exlpain this? Are higher energy photons less likely to interact with electrons ( which would likely result in it being pushed back)?\n\nThank you",
        "created_utc": 1671967999,
        "upvote_ratio": 1.0
    },
    {
        "title": "Explaining Thermodynamics",
        "author": "sabhandari",
        "url": "https://www.reddit.com/r/Physics/comments/zuvw4o/explaining_thermodynamics/",
        "text": "One topic in physics that is often overlooked but critical is the study of thermodynamics.\n\nThermodynamics is the physics branch that studies heat and its relationship to work and energy. It is a fundamental science that underlies many of the technologies we rely on daily, from the internal combustion engine in our cars to the refrigerators in our homes.\n\nOne of the critical principles of thermodynamics is the first law, which states that energy cannot be created or destroyed, only converted from one form to another. This means that in any energy conversion process, there will always be some waste energy that is lost to the environment.\n\nAnother important concept in thermodynamics is the second law, which states that the total entropy (a measure of the disorder or randomness of a system) will always increase in any energy conversion process. This means that energy conversions will always be less efficient over time and that it is impossible to create a perpetual motion machine that can operate indefinitely without any external energy input.\n\nThermodynamics has many practical applications, including the design of engines, refrigeration systems, and power plants. It is also essential for understanding the behavior of gases and how they expand and contract in response to changes in temperature and pressure.\n\nDespite its importance, thermodynamics is often a neglected topic in physics, with many students and laypeople finding it needs clarification and more abstract. However, understanding the principles of thermodynamics is crucial for anyone interested in the science behind the technologies that power our world.",
        "created_utc": 1671965342,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is so special about the second law?",
        "author": "Loose_Basket_9459",
        "url": "https://www.reddit.com/r/Physics/comments/zuvgmb/what_is_so_special_about_the_second_law/",
        "text": "Originally it said heat cannot move from cold to hot. Then after kinetic theory of gases became a thing, it became apparent that heat constantly moves from cold to hot during particle collisions, but with large collections of particles, the original second law becomes an emergent phenomena wherein heat on average moves from hot to cold. \n\nSo, we got it wrong from the beginning, what evidence do we have that the second law is a thing? After all, we can just as easily argue that perfect oscillators are perpetual motion, and fundamental forces are perpetual motion. In which case maybe we do not need nine dimensions to describe physics.\n\nAny conversation questioning the fundamental nature of the second law is met with hate and ridicule, similar to what one would expect from religious zealots, when a tenant of their faith is questioned. What am I missing?",
        "created_utc": 1671963378,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is so special about the 2nd law?",
        "author": "Loose_Basket_9459",
        "url": "https://www.reddit.com/r/Physics/comments/zuvbsm/what_is_so_special_about_the_2nd_law/",
        "text": "Originally it said heat cannot move from cold to hot. Then after kinetic theory of gases became a thing, it became apparent that heat constantly moves from cold to hot during particle collisions, but with large collections of particles, the original second law becomes an emergent phenomena wherein heat on average moves from cold to hot. \n\nSo, we got it wrong from the beginning, what evidence do we have that the second law is a thing? After all, we can just as easily argue that perfect oscillators are perpetual motion, and fundamental forces are perpetual motion. In which case maybe we do not need nine dimensions to describe physics.\n\nWhat am I missing?",
        "created_utc": 1671962787,
        "upvote_ratio": 1.0
    },
    {
        "title": "‘We could write our signatures on a red blood cell with this thing’ — Danish physicists use 3D nanolithography tool to inscribe Christmas song into polymer film, creating world’s smallest record",
        "author": "marketrent",
        "url": "https://arstechnica.com/science/2022/12/danish-physicists-give-the-gift-of-worlds-smallest-christmas-record-in-stereo/",
        "text": "",
        "created_utc": 1671961536,
        "upvote_ratio": 1.0
    },
    {
        "title": "Turned out exactly awesome.",
        "author": "Aggressg",
        "url": "https://i.redd.it/1awsfjzck08a1.jpg",
        "text": "",
        "created_utc": 1671960810,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can a broking a Prince Rupert drop create population in a vacuum?",
        "author": "RukeDCoin",
        "url": "https://www.reddit.com/r/Physics/comments/zutp3z/can_a_broking_a_prince_rupert_drop_create/",
        "text": "",
        "created_utc": 1671955474,
        "upvote_ratio": 1.0
    },
    {
        "title": "My absolute favorite purchases",
        "author": "Moist_Informati",
        "url": "https://i.redd.it/msf4krmhqz7a1.jpg",
        "text": "",
        "created_utc": 1671950765,
        "upvote_ratio": 1.0
    },
    {
        "title": "Question about Fusion reactors",
        "author": "Melonslice115",
        "url": "https://www.reddit.com/r/Physics/comments/zusd6j/question_about_fusion_reactors/",
        "text": "Not sure if this is the right sub, but I don't really know where else to ask.\n\nSo a fusion reactor needs tritium for fuel, tritium is quite rare but luckily we can make it in the reactor by letting the high energy neutrons hit Li-6 which is an endothermic reaction splitting into helium and tritium.\n\nWhat confuses me is that I read somewhere that using this process to create tritium greatly reduces the amount of thermal energy we can absorb from the reactor for generating electricity. How come an endothermic reaction decreases the energy we are left with in the end? \n\nI'm completely new to this stuff so anything I said could be wrong so please do correct me.",
        "created_utc": 1671949728,
        "upvote_ratio": 1.0
    },
    {
        "title": "Hello, guys.",
        "author": "TheGhoustRain",
        "url": "https://www.reddit.com/r/Physics/comments/zuqcmi/hello_guys/",
        "text": "[removed]",
        "created_utc": 1671941798,
        "upvote_ratio": 1.0
    },
    {
        "title": "aaaaaaa",
        "author": "[deleted]",
        "url": "",
        "text": "[removed]",
        "created_utc": 1671941728,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can you help me with this case?",
        "author": "TheGhoustRain",
        "url": "https://www.reddit.com/r/Physics/comments/zuqbtk/can_you_help_me_with_this_case/",
        "text": "[removed]",
        "created_utc": 1671941711,
        "upvote_ratio": 1.0
    },
    {
        "title": "Help me create a power related to physics.",
        "author": "TheGhoustRain",
        "url": "https://www.reddit.com/r/Physics/comments/zuqa8g/help_me_create_a_power_related_to_physics/",
        "text": "[removed]",
        "created_utc": 1671941538,
        "upvote_ratio": 1.0
    },
    {
        "title": "Could a perfectly insulated computer run for ever?",
        "author": "neb12345",
        "url": "https://www.reddit.com/r/Physics/comments/zuoezn/could_a_perfectly_insulated_computer_run_for_ever/",
        "text": "Say I made a computer that could perfectly recycle it’s waste energy and no energy could leave the system. (Physically impossible ofc). Could it for eternity calculate something for me? (Say prime numbers). Ofc to output this information I would need energy but that could be given when I decided to collect the data. \n\n\nOriginally I didn’t consider if the factor of saving the answers but only the pure act of calculating. However if you have insight on this point that would be great. \n\nThis is abit of a branch question of ‘does information cost energy?’(consider: Does a CPU heat the room the same as the heater with the same energy inputed)",
        "created_utc": 1671934472,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can the universe be explained in classical or quantum computational terms?",
        "author": "New_Language4727",
        "url": "https://www.reddit.com/r/Physics/comments/zuo0us/can_the_universe_be_explained_in_classical_or/",
        "text": "I’ve been thinking about this for a few weeks now, and it’s been getting under my skin. I should however elaborate. Given the current knowledge physicists have of the universe, would one of the types of simulation related theories be even remotely viable to explain the universe (such as a unifying theory of physics)? Or are there things in the universe that are just flat out not computable and therefore renders these theories useless?",
        "created_utc": 1671933027,
        "upvote_ratio": 1.0
    },
    {
        "title": "Would it be possible to create a permanent magnet by exposing molten metal to a magnetic field while it solidifies?",
        "author": "Horror_in_Vacuum",
        "url": "https://www.reddit.com/r/Physics/comments/zuntmb/would_it_be_possible_to_create_a_permanent_magnet/",
        "text": "I know you can polarize solid metal by exposing it to a magnetic field, but the particles eventually reorganize themselves in a way that the metal is no longer polarized. But would it still happen if you did this while the metal is in it liquid form? I have no actual reason to believe it would, I just got this idea from hearing that the magnetic field of the Earth exists due to the movement of charged particles in the liquid portion of the Earth's core. Also, what keeps the charges from reorganizing in a permanent magnet? How are they formed in nature?",
        "created_utc": 1671932286,
        "upvote_ratio": 1.0
    },
    {
        "title": "To those who didn’t go to graduate school and just finished with your bachelor’s (or people you know) and entered the workforce, what do you do?",
        "author": "Bitterblossom_",
        "url": "https://www.reddit.com/r/Physics/comments/zunh7i/to_those_who_didnt_go_to_graduate_school_and_just/",
        "text": "",
        "created_utc": 1671931042,
        "upvote_ratio": 1.0
    },
    {
        "title": "Taking physics 1- really struggling to understand vector addition/subtraction and when to use cos/sin/tan.",
        "author": "yey209",
        "url": "https://www.reddit.com/r/Physics/comments/zum1f2/taking_physics_1_really_struggling_to_understand/",
        "text": "If anyone has notes on this that are “easy”to understand, or able to tutor me for $, please help!",
        "created_utc": 1671926113,
        "upvote_ratio": 1.0
    },
    {
        "title": "Hamiltonian of electron moving in uniform magnetic field",
        "author": "physicsman12345",
        "url": "https://www.reddit.com/r/Physics/comments/zulmot/hamiltonian_of_electron_moving_in_uniform/",
        "text": "[removed]",
        "created_utc": 1671924766,
        "upvote_ratio": 1.0
    },
    {
        "title": "How is it possible that kinetic friction does not depend on the area of contact?",
        "author": "siliconvallii",
        "url": "https://www.reddit.com/r/Physics/comments/zujz1p/how_is_it_possible_that_kinetic_friction_does_not/",
        "text": "",
        "created_utc": 1671919546,
        "upvote_ratio": 1.0
    },
    {
        "title": "Quantum experiments add weight to a fringe theory of consciousness",
        "author": "kmrbillya13",
        "url": "https://blog.scientiststudy.com/2022/04/quantum-experiments-add-weight-to.html",
        "text": "",
        "created_utc": 1671917435,
        "upvote_ratio": 1.0
    },
    {
        "title": "Quantum experiments add weight to a fringe theory of consciousness",
        "author": "kmrbillya13",
        "url": "https://blog.scientiststudy.com/2022/04/quantum-experiments-add-weight-to.html",
        "text": "",
        "created_utc": 1671917329,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do electrons not “fall” to the nucleus?",
        "author": "JGZT",
        "url": "https://www.reddit.com/r/Physics/comments/zuhzu5/how_do_electrons_not_fall_to_the_nucleus/",
        "text": "I thought electrons orbit the nucleus and that keeps it from falling down then i learned it’s actually a probability cloud..so what keeps it from falling in?\n\nAlso in plasma the electrons are stripped from the nucleus so is it still a probability cloud?does it have a shape?or is it equal probability anywhere on the plasma?\n\nThank you..Merry Christmas / Happy Holidays",
        "created_utc": 1671913546,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does there still have something to research on Bright muon beams? Actually I'm looking for an experimental particle physics research topic which will include uses of colliders or beams used in CERN.",
        "author": "ukiyo_zar10",
        "url": "https://www.reddit.com/r/Physics/comments/zuhhzg/does_there_still_have_something_to_research_on/",
        "text": "",
        "created_utc": 1671912053,
        "upvote_ratio": 1.0
    },
    {
        "title": "There’s no sound in a vacuum, what about a near vacuum?",
        "author": "khswart",
        "url": "https://www.reddit.com/r/Physics/comments/zuhgy6/theres_no_sound_in_a_vacuum_what_about_a_near/",
        "text": "I’ve always heard that there’s no sounds in outer space because there’s no atmosphere. Does this mean if we hook up a speaker and make it play a note at 100 decibels and slowly suck the air out of the room, would the speaker sound quieter and quieter as the atmosphere in the room is removed? Until it eventually becomes a complete vacuum at which point the speakers sound is no longer there? \n\nSecondly, if we have some way to keep two separate pockets of “atmosphere” in a room with complete vacuum between the two, can the sound waves travel through the vacuum and be heard in the other atmosphere chamber? Or does the vacuum between the two completely suppress any sound from passing through it?",
        "created_utc": 1671911988,
        "upvote_ratio": 1.0
    },
    {
        "title": "Famous Physics Theories",
        "author": "WastePass",
        "url": "https://youtu.be/7B5qAX7LOCs",
        "text": "",
        "created_utc": 1671905534,
        "upvote_ratio": 1.0
    },
    {
        "title": "Fluid Mechanics",
        "author": "WastePass",
        "url": "https://youtu.be/BsQQU1BofuI",
        "text": "",
        "created_utc": 1671905482,
        "upvote_ratio": 1.0
    },
    {
        "title": "Thermodynamics",
        "author": "WastePass",
        "url": "https://youtu.be/DGj84qyUqM0",
        "text": "",
        "created_utc": 1671905450,
        "upvote_ratio": 1.0
    },
    {
        "title": "Mechanics",
        "author": "WastePass",
        "url": "https://youtu.be/qBcOZBAjcrE",
        "text": "",
        "created_utc": 1671905411,
        "upvote_ratio": 1.0
    },
    {
        "title": "Physics Concepts",
        "author": "WastePass",
        "url": "https://youtu.be/kzy-zuKTTX8",
        "text": "",
        "created_utc": 1671905329,
        "upvote_ratio": 1.0
    },
    {
        "title": "Bernoulli's Equation",
        "author": "Obvious-Shake5761",
        "url": "https://www.reddit.com/r/Physics/comments/zucshe/bernoullis_equation/",
        "text": "Why does an increase in velocity of a fluid result in a decrease in pressure? This seems very counterintuitive. \n\nCan we break the equation down and really understand why this happens.   \nThanks.",
        "created_utc": 1671898070,
        "upvote_ratio": 1.0
    },
    {
        "title": "How is the power different in these cases?",
        "author": "SatisfactionDizzy580",
        "url": "https://www.reddit.com/r/Physics/comments/zubj79/how_is_the_power_different_in_these_cases/",
        "text": "It’s given that power = 100W and voltage = 220V and we have to calculate the power when voltage is 110V. P=VI so solving for I we should get I = 5/11 and now if we apply the formula again we get P= 110*5/11 which is 50W\n\nbut if we apply the formula P=V^2/R and then solve for V=110 we get P=25W\n\nwhy is the answer different for different formulas?",
        "created_utc": 1671894149,
        "upvote_ratio": 1.0
    },
    {
        "title": "Physics Opportunities for High Schoolers?",
        "author": "zesh_s",
        "url": "https://www.reddit.com/r/Physics/comments/zube1n/physics_opportunities_for_high_schoolers/",
        "text": "I'm a junior in a nyc high school and I've been heavily considering pursing physics in college and as a career so I wanted to connect with a professor to be able to learn how their research is conduected and how physics is like outside of the classroom environment. \n\nHowever I'm interested in particle physics and I'm pretty sure that is very hard to convince professors in that feild to accept a high schooler to help in their research. So I was wondering if there were anything more attainable but still relevant to particle physics or am I being a bit too ambitious here?Also does anyone have any advice for approaching these professors via email, I heard that understanding their research is good but I'm not sure how to start (finding research and learning what their research is about seems a bit difficult). \n\nI apologize if this should've been posted elsewhere and please let me know if it should. I thank everyone in advance! I am very excited about physics but it just seemed a bit daunting with how ambitious it is to aim for particle physics research opportunities.",
        "created_utc": 1671893712,
        "upvote_ratio": 1.0
    },
    {
        "title": "What causes these patterns?",
        "author": "magda711",
        "url": "https://www.reddit.com/gallery/zub9i6",
        "text": "",
        "created_utc": 1671893306,
        "upvote_ratio": 1.0
    },
    {
        "title": "Never seen ice crystals like these before, anyone know how they are formed?",
        "author": "Ok-Elk-3801",
        "url": "https://i.redd.it/xfoop2c8vv7a1.jpg",
        "text": "",
        "created_utc": 1671885927,
        "upvote_ratio": 1.0
    },
    {
        "title": "mass distribution",
        "author": "Informal-Tower-5091",
        "url": "https://www.reddit.com/r/Physics/comments/zu7gda/mass_distribution/",
        "text": "If a person weighs 80 kilograms and he jumps up and down on a metal surface for 1 min how much force would be distributed on the metal? let's say he jumps with 80kg per second would that mean 80kg x 60 seconds\n\nWould that mean 80kg x 60sec = 4800\n\nWhy does it feel like I'm still missing something?",
        "created_utc": 1671878783,
        "upvote_ratio": 1.0
    },
    {
        "title": "mass distribution",
        "author": "Informal-Tower-5091",
        "url": "https://www.reddit.com/r/Physics/comments/zu7ekh/mass_distribution/",
        "text": "If a person weighs 80 kilograms and he jumps up and down on a metal surface for 1 min how much force would be distributed on the metal? let's say he jumps with 80kg per second would that mean 80kg x 60 seconds\n\nWould that mean 80kg x 60sec = 4800\n\nWhy does it feel like I'm still missing something?",
        "created_utc": 1671878563,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why Does Water Evaporate at Room Temperature?",
        "author": "VrobleBlog",
        "url": "https://www.vroble.com/2022/12/why-does-water-evaporate-at-room.html",
        "text": "",
        "created_utc": 1671874540,
        "upvote_ratio": 1.0
    },
    {
        "title": "Very feel grateful that this student had this improvement, his examination in school last sem is 14, this sem improved to 70!!! taught him about 3 months time.",
        "author": "plaz-physics",
        "url": "https://i.redd.it/5mzhjs71bt7a1.jpg",
        "text": "",
        "created_utc": 1671872923,
        "upvote_ratio": 1.0
    },
    {
        "title": "got this as a tribute to my teacher in his handwriting, what do y'all think?",
        "author": "InfamousGuava5939",
        "url": "https://i.redd.it/lirdpu60su7a1.jpg",
        "text": "",
        "created_utc": 1671872736,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is \"strong driving\" in physics? As in a \"strongly driven\" system?",
        "author": "natureintheory",
        "url": "https://www.reddit.com/r/Physics/comments/zu5fer/what_is_strong_driving_in_physics_as_in_a/",
        "text": "In simple terms please. I've only been able to find papers using these terms, but no definition.",
        "created_utc": 1671870030,
        "upvote_ratio": 1.0
    },
    {
        "title": "Clarification for those who don't understand simple physics here...",
        "author": "Dinkle_D",
        "url": "https://www.reddit.com/r/Physics/comments/zu2ybq/clarification_for_those_who_dont_understand/",
        "text": "A bunch of people on this reddit board don't understand some physics concepts. This explanation is for those who don't understand some physics concepts.\n\nPi (π) is a mathematical constant that represents the ratio of the circumference of a circle to its diameter. It is an important mathematical concept that has numerous practical applications in fields such as geometry, engineering, and science.\n\nBlack holes are objects in space that are so massive and dense that they have a gravitational field so strong that nothing, not even light, can escape from it. They are formed when a star collapses at the end of its life and its core becomes so dense that it creates a gravitational field so strong that it sucks in everything around it.\n\nGravity is a force that exists between any two objects with mass. It is the force that gives weight to physical objects and is what holds the planets in orbit around the sun. Gravity is caused by the mass of an object and is directly proportional to the mass of that object and inversely proportional to the distance between the objects.\n\nLight speed is the speed at which light travels through a vacuum. It is a constant value, approximately 299,792,458 meters per second, and is the maximum speed at which information can be transmitted. It is also the speed at which massless particles, such as photons, travel.\n\nI hope this helps to clarify these concepts for those who don't understand them on this reddit board",
        "created_utc": 1671860610,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does it violate Newton's third law?",
        "author": "Random-_-guy-_-",
        "url": "https://www.reddit.com/r/Physics/comments/zu2qzf/does_it_violate_newtons_third_law/",
        "text": "Consider an infinite wire with current I flowing in it and a small wire with current i flowing in it which is perpendicular to the infinite wire and is at a distance x from it. We know that conductors exert a force on each other due to the magnetic field generated due to current. Now in the case I mentioned above if we use integration to calculate the force on the smaller wire by considering an element we can arrive at a definite answer.\nIf for example the infinite wire is along X axis and the small wire along Y axis and current as (-î) for I and (+j) for i, then the force direction exerted by the infinite wire on the small wire is (-î)[ by RHT rule]. If we think of this force as an action then it must have an equal and opposite reaction however if the infinite wire has a force along(î) then it will make the length element L and B antiparallel which will make the force nil.\nSo does Newton's 3rd law get violated?\n\nI'm sorry if I'm unable to explain very well but the question intrigued me so much I had to ask",
        "created_utc": 1671859854,
        "upvote_ratio": 1.0
    },
    {
        "title": "How many balls can you use in a Newton’s Cradle?",
        "author": "qualamazoo",
        "url": "https://www.reddit.com/r/Physics/comments/zu2mmx/how_many_balls_can_you_use_in_a_newtons_cradle/",
        "text": "I’ve got two that are both impossibly tangled. So I thought I’d build a new structure that combines them. I understand that they have to have an odd number of balls. I see ads for ones with 7 balls. It seems like the sort of thing that someone should have tested before, but all I found was Mythbusters trying to make it bigger. Has anyone else built one of those with 9 13, 77, 8,765 balls?",
        "created_utc": 1671859423,
        "upvote_ratio": 1.0
    },
    {
        "title": "Best *self teaching* PDE/ODE text book for undergraduate senior and above.",
        "author": "Quick-Beautiful-9142",
        "url": "https://www.reddit.com/r/Physics/comments/zu17v3/best_self_teaching_pdeode_text_book_for/",
        "text": "[removed]",
        "created_utc": 1671854583,
        "upvote_ratio": 1.0
    },
    {
        "title": "when 3 heat engines are connected in parallel and it is given that the efficiency of the third engine is 30% of the combined efficiency of the other two engines, what is the minimum efficiency of the system as a whole?",
        "author": "Specialist_Glove_914",
        "url": "https://www.reddit.com/r/Physics/comments/zty7jb/when_3_heat_engines_are_connected_in_parallel_and/",
        "text": "",
        "created_utc": 1671845054,
        "upvote_ratio": 1.0
    },
    {
        "title": "The worrying lack of tests and evidence for Redshift equalling expansion.",
        "author": "MasterDefibrillator",
        "url": "https://www.reddit.com/r/Physics/comments/ztve0g/the_worrying_lack_of_tests_and_evidence_for/",
        "text": "Many Astrophysicists seem to assume that redshift equals expansion. Even though this was not what Hubble measured. He measured a correlation between redshift and distance, and he at the time was cautious to interpret this redshift as expansion. I've linked a paper with the handful of independent tests of redshift equaling expansion, and their overall inconclusive nature. I've done this because many people here seem to be totally unaware how shaky the assumption that cosmological redshift equal expansion is: \n\n&gt; Nobody has ever directly observed a galaxy distance being increased with time. The\nmotion of the putative expansion of the Universe is so slow that it is unmeasurable.\nThe variation in the redshift of a galaxy is also very slow and difficult to measure.\nSandage [75] proposed in 1962 to measure the expected dz\ndt = (1 + z)H0 − H(z) (∼1\ncm/s/year), but it has not hitherto been possible to meassure such a low acceleration.\nIt would be possibly observable with a 40 m telescope over a period of ∼20 year using\n4000 h of observing time [76]. So, unfortunately, apart from the actual redshift of the\ngalaxies, there are at present no direct proofs of the expansion. However, there are\ndifferent indirect tests to verify whether the Universe is expanding or static:\n\nhttps://philpapers.org/archive/LPETAP.pdf",
        "created_utc": 1671836906,
        "upvote_ratio": 1.0
    },
    {
        "title": "Force through water",
        "author": "dunculo",
        "url": "https://www.reddit.com/r/Physics/comments/ztuxv5/force_through_water/",
        "text": "I'm trying to calculate, out of curiosity, roughly how much force is added to a swimmer if holding a flat surface out in front of them?\n\nSomething roughly 1sq/ft or .088 sq/m?\n\nCould it be likened to pushing Xkg over your head?\n\nKinda want I'm talking about https://youtu.be/rS0oGJ5qnWQ",
        "created_utc": 1671835697,
        "upvote_ratio": 1.0
    },
    {
        "title": "Probably a stupid question but why is the energy negative?",
        "author": "Muon8025",
        "url": "https://i.redd.it/itl405dcpp7a1.png",
        "text": "",
        "created_utc": 1671829337,
        "upvote_ratio": 1.0
    },
    {
        "title": "do subatomic particles truly exist?",
        "author": "cumassnation",
        "url": "https://www.reddit.com/r/Physics/comments/ztshlt/do_subatomic_particles_truly_exist/",
        "text": "the fact that subatomic particles are point-like (i.e. zero-dimensional), indivisible and have some counterintuitive properties (e.g. spin, superposition) lead me to believe that they aren’t true physical entities but tools used in mathematical models of physics. are subatomic particles real objects or just convenient models used to explain properties of the universe?",
        "created_utc": 1671829194,
        "upvote_ratio": 1.0
    }
]