[
    {
        "title": "I invented a super efficient generator. Read carefully",
        "author": "Rare-Birthday4527",
        "url": "https://www.reddit.com/gallery/11dsft8",
        "text": "",
        "created_utc": 1677545975,
        "upvote_ratio": 1.0
    },
    {
        "title": "Every morning with Einstein &amp; Pythagoras",
        "author": "Indkb",
        "url": "https://i.redd.it/lqg6fbwaptka1.png",
        "text": "",
        "created_utc": 1677544050,
        "upvote_ratio": 1.0
    },
    {
        "title": "Computational Physics Project",
        "author": "swagmoneytb",
        "url": "https://www.reddit.com/r/Physics/comments/11dq0qe/computational_physics_project/",
        "text": "[removed]",
        "created_utc": 1677539627,
        "upvote_ratio": 1.0
    },
    {
        "title": "My new favorite hoodie",
        "author": "Emotiondgh",
        "url": "https://i.redd.it/9q4y13oh9tka1.jpg",
        "text": "",
        "created_utc": 1677538452,
        "upvote_ratio": 1.0
    },
    {
        "title": "Black Holes as evidence of Advanced Civilizations which successfully harnessing all energy from nearby star systems",
        "author": "GrandonPaul",
        "url": "https://www.reddit.com/r/Physics/comments/11dpdsj/black_holes_as_evidence_of_advanced_civilizations/",
        "text": "If an advanced civilization learned to fully harness 100% of the energy radiating from their home star; then wouldn't all light have been consumed by their technology such that no light escapes the civilizations network of energy capturing technology?\n\nIf this is the case, there would be zero electromagnetic radiation escaping to make the civilizations stellar system visible to a distant observer.\n\nAssuming this hypothetical advanced civilization grew expansive enough to fully harness 100% of the energy produced by many stars; wouldn't it be possible for this situation to appear to distant observers as a black hole?\n\nAnd because engineering and other physical issues would be capable of occurring within any massive network of energy harnessing technological devices; the energy usage would likely hit a limit and never truly realize 100% energy capture, leading to Hawking-like radiation.",
        "created_utc": 1677538043,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do we know the Big Bang had no cause?",
        "author": "Merest_Plagiarist",
        "url": "https://www.reddit.com/r/Physics/comments/11do564/how_do_we_know_the_big_bang_had_no_cause/",
        "text": "A common answer I see online to the question of \"What caused the Big Bang?\" is that it is meaningless to speak of a time \"before\" the Big Bang. An analogy thrown around is that asking what came \"before\" the Big Bang is like asking what lies \"north\" of the North Pole.\n\nHowever, from what little understanding I have of physics, I have likewise been taught that our models break down at that point in time, and that we can only really make claims of what occurred moments AFTER the Big Bang.\n\nHow can these facts co-exist? If our models break down at the singularity, how can we say with any confidence anything about what could or could not hypothetically have existed before the Big Bang (or whether a \"before\" is even possible)?\n\nThe idea that the Big Bang simply occurred without cause or reason has never sat well with me, and so I have always preferred hypothetical cyclic models of the universe. Some mainstream examples being the Big Crunch or the idea that black holes themselves contain their own observable universes, in both of which cases our universe and the Big Bang are products of previous universes or more generally caused by previous events.\n\nHowever, I'm willing to acknowledge that intuition shouldn't be too relevant in science, and how I \"feel\" about certain claims isn't evidence at all. So what evidence is there actually that these cyclical models are wrong? More specifically, as previously stated, what evidence is there that time itself truly began at the Big Bang without cause?",
        "created_utc": 1677535019,
        "upvote_ratio": 1.0
    },
    {
        "title": "Help me end this Physics debate",
        "author": "Grouchy-Map-6946",
        "url": "https://www.reddit.com/r/Physics/comments/11dnzbl/help_me_end_this_physics_debate/",
        "text": "The word problem is:\n\nA deep sea ocean vessel uses SONAR to detect the ocean's bottom. Sound waves are emitted from the surface of the ocean and travel through the water at 1450 m/s. The ocean bottom is 1630 m below the surface. Determine the amount of time that passes before the sound waves are reflected on the surface.\n\nNow my answer and the answer of some of my classmates as well my Physics teacher is 1.12s Before the sound waves a reflected on the surface.\n\nMy other classmates and colleagues from other sections argued the answer double the time so its 2.24s. Why? Because they argued that the question also asked for the time back on the surface as well.\n\nI think this is an argument misperception of the situation so I would to hear you guys opinions as well.",
        "created_utc": 1677534616,
        "upvote_ratio": 1.0
    },
    {
        "title": "thermodynamics question",
        "author": "zaxariadis",
        "url": "https://www.reddit.com/r/Physics/comments/11dnthf/thermodynamics_question/",
        "text": "\"Heat flows from hot to cold objects. When a hot and a cold body are in thermal contact, they exchange heat energy until they reach thermal equilibrium, with the hot body cooling down and the cold body warming up.\"\n\nSo why doesn't everything in the universe have the same temperature?",
        "created_utc": 1677534224,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is temporal relativity related to the speed of light?",
        "author": "BreathAway7817",
        "url": "https://www.reddit.com/r/Physics/comments/11dnozv/is_temporal_relativity_related_to_the_speed_of/",
        "text": "[removed]",
        "created_utc": 1677533917,
        "upvote_ratio": 1.0
    },
    {
        "title": "is there a way to find the viscous drag acting on a compound pendulum?",
        "author": "diamondrunner2002",
        "url": "https://www.reddit.com/r/Physics/comments/11dnb2c/is_there_a_way_to_find_the_viscous_drag_acting_on/",
        "text": "There must be a way to do this? What measurements would I need to take?",
        "created_utc": 1677532983,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why is there so much pseudoscience in physics these days?",
        "author": "trollingguru",
        "url": "https://www.reddit.com/r/Physics/comments/11dn8v6/why_is_there_so_much_pseudoscience_in_physics/",
        "text": "Everytime I read a science journal or see a news article about science There’s some hyperbolic or outright unrealistic breakthroughs. Some weird discovery in quantum mechanics that sounds bizarre. Or some discovery in particle physics that turns out to be misleading. \n\nSome of the stuff put out these days are just assumptions which cannot be tested. \n\nThe problem I have is they are pushing the narrative that these are factually correct and reasechers are just some magical wizards that can solve any problem that exist. \n\nWe have made little progress in science besides modern computers. We are actually stagnant as far as breakthroughs. \n\nNow pop science is into Astrophysics and space and I almost go schizophrenic reading the nonsense posted daily. \n\nWhat the heck is going on?",
        "created_utc": 1677532838,
        "upvote_ratio": 1.0
    },
    {
        "title": "Should I pursue a Masters in Material Science?",
        "author": "tensed_wolfie",
        "url": "https://www.reddit.com/r/Physics/comments/11dmwsj/should_i_pursue_a_masters_in_material_science/",
        "text": "Disclaimer: I don’t particularly enjoy Chemistry and haven taken only a single course during my undergraduate as a physics major. Should I be looking into a Material Sciences masters or not?",
        "created_utc": 1677532052,
        "upvote_ratio": 1.0
    },
    {
        "title": "An engineer with a passion for physics looking for book rec",
        "author": "These_Literature",
        "url": "https://www.reddit.com/r/Physics/comments/11dmrlz/an_engineer_with_a_passion_for_physics_looking/",
        "text": "Hello, as the title suggests I am currently in my junior year of undergrad pursing aerospace engineering. I have just finished my main calculus and physics courses and now only have engineering ones left.\n\nI really love math and physics (much more then engineering) but I don’t think I want to go right into grad school for it. As an aerospace engineer (I like to think) I have a strong understanding of mathematics and was looking for book recommendations where I can study the topics on my own time.\n\nMy favorite area of study is nuclear power but am open to anything that was fundamental to your physics understanding.",
        "created_utc": 1677531706,
        "upvote_ratio": 1.0
    },
    {
        "title": "ChatGPT just solved the Universe. Maybe. Just maybe. :)",
        "author": "Nopsies",
        "url": "https://www.reddit.com/r/Physics/comments/11dlvkk/chatgpt_just_solved_the_universe_maybe_just_maybe/",
        "text": "I asked ChatGPT for alternatives to the theory of General Relativity. It told me about  Modified Newtonian Dynamics (MOND) and  theory of modified gravity (MOG) and the problems of both \"theories\". Afterwards I asked it to combine both theories to help alleviate the problem(s) of both. This was its answer. Maybe someone can tell me if it´s complete BS or if it´s a genuine idea worth thinking about. :)\n\n&gt;While there is no official combination of MOG and MOND, one possible way to combine the two theories is to propose that the scalar field in MOG also modifies the gravitational force law in a way that is similar to MOND.  \n&gt;  \n&gt;In this modified version of MOG, the scalar field would not only modify the gravitational force at large scales, but it would also introduce an acceleration scale below which the gravitational force law deviates from Newton's law and scales as the square root of acceleration, similar to MOND. This modification would allow the theory to explain the observed phenomena that MOND seeks to explain, such as the rotation curves of galaxies, without the need for dark matter.  \n&gt;  \n&gt;While this combination of MOG and MOND is highly speculative and would require significant modifications to both theories, it is an interesting idea to explore and could provide a new perspective on the nature of gravity at large scales. However, it is important to note that this combination is not an official theory, and further research and testing would be needed to determine its validity and usefulness in explaining the observed phenomena in the universe.",
        "created_utc": 1677529595,
        "upvote_ratio": 1.0
    },
    {
        "title": "Confusing physics book",
        "author": "G-rizzly",
        "url": "https://www.reddit.com/r/Physics/comments/11dlqwj/confusing_physics_book/",
        "text": "Hello all, I am currently studying for a physics a-level qualification in the UK, I use the AQA specification and I am having trouble understanding this image representing a scenario I found in my textbook. The first image in the three part diagram shows this rotating coil and to me, it makes absolutely no sense how from that image, you arrive at the side view in the second picture (I understand the physics of the side view image). Is this a poorly drawn diagram, or am I missing something, as to me it appears that not only is the coil at an angle to the field but also the axis itself, wouldn't this fundamentally change how the magnetic field  interacted with it? How can the first image turn into the second if the axis isn't aligned at pi/2 rads?\n\nAny advice or guidance is much appreciated, as this has had me stuck. \n\n[Confusing diagram](https://preview.redd.it/d7u6xlc5hska1.jpg?width=1512&amp;format=pjpg&amp;auto=webp&amp;v=enabled&amp;s=f757ab936f4dac7a6c6615b7b495780475df95e4)",
        "created_utc": 1677529277,
        "upvote_ratio": 1.0
    },
    {
        "title": "Scientists Levitate a Glass Nanosphere, Controlling Quantum State for an Object for the First Time",
        "author": "indigenous_apache",
        "url": "https://www.guardianmag.us/2023/02/scientists-levitate-glass-nanosphere.html?m=1",
        "text": "",
        "created_utc": 1677528628,
        "upvote_ratio": 1.0
    },
    {
        "title": "Ions in a plasma",
        "author": "SemiEmployedTree",
        "url": "https://www.reddit.com/r/Physics/comments/11dlgzf/ions_in_a_plasma/",
        "text": "My (limited) understanding of a plasma is that it is made up of both electrons and ions. My impression is that the ions are all going to be cations but I haven’t found anything clearly stating that.\n\nMy question is whether or not negative ions are found in a plasma.",
        "created_utc": 1677528624,
        "upvote_ratio": 1.0
    },
    {
        "title": "Languages in Physics",
        "author": "Arthurmaga",
        "url": "https://www.reddit.com/r/Physics/comments/11dl37f/languages_in_physics/",
        "text": "What language would you guys recommend to learn (besides english) , to get opportunities in the astrophysical community.  \n\n\nI'm currently an undergraduate student going to my masters program on stellar astrophysics.",
        "created_utc": 1677527711,
        "upvote_ratio": 1.0
    },
    {
        "title": "Undergrad textbooks for particle physics?",
        "author": "Ethan-Wakefield",
        "url": "https://www.reddit.com/r/Physics/comments/11dkq95/undergrad_textbooks_for_particle_physics/",
        "text": "I'm interested in learning more about the Standard Model. Are there any good undergrad-level textbooks that I should be looking at? I'm preferably looking for something that's going to have problems to work through, and either provided solutions or a book that's popular enough that solutions are easily available.",
        "created_utc": 1677526818,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is Gravity a force or just the bending of spacetime?",
        "author": "PhoneRoutine",
        "url": "https://www.reddit.com/r/Physics/comments/11djnet/is_gravity_a_force_or_just_the_bending_of/",
        "text": "Apart from basic education in physics, most of my physics knowledge comes from watching educational videos. In these videos, gravity is explained in two forms - one that gravity is actually not a force but is just a fold/bending in the spacetime that objects move through. And another that gravity is the 4th force (after EM, weak &amp; strong nuclear forces) and may be it is transmitted via gravitons. \n\nWhich one of these is correct or are both these true?",
        "created_utc": 1677524241,
        "upvote_ratio": 1.0
    },
    {
        "title": "why can't we travel faster than the speed of light?",
        "author": "Exact-Pilot-9633",
        "url": "https://www.reddit.com/r/Physics/comments/11djey6/why_cant_we_travel_faster_than_the_speed_of_light/",
        "text": "",
        "created_utc": 1677523668,
        "upvote_ratio": 1.0
    },
    {
        "title": "I have a theory on free will. Is it physically possible to have free will?",
        "author": "yrys88",
        "url": "https://www.reddit.com/r/Physics/comments/11diyrb/i_have_a_theory_on_free_will_is_it_physically/",
        "text": "You choose everything you do or is it predetermined? Based on what happened before, like domino's, İf one falls you know the other will fall next. I know life is a little more complex than that but if you had the right formula and enough computer power to calculate it you can predetermine what will happen next. We do this upto a certain point with the weather for example. So logically speaking it isn't possible to have free will.\n\nBut. What if infinite possibilities already existed and we are mere observers of these possibilities. So the choices we make determine the timeline we experience among infinite timelines. So that's where free will comes into play. And that is why only when we observe an object takes form and position. Because we are choosing which timeline we want to experience.",
        "created_utc": 1677522593,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can Jupiter become a star if we ignite it ourselves?",
        "author": "EcstaticBicycle",
        "url": "https://www.reddit.com/r/Physics/comments/11diydq/can_jupiter_become_a_star_if_we_ignite_it/",
        "text": "I read online that \"Jupiter does not have enough mass to initiate a fusion reaction to become a star\", that's the line I read everywhere.\n\nThey all have the word \"initiate\".\n\nDoes this mean that, if we somehow started the fusion ourselves, it would continue? Kind of like how gasoline is super flammable, but doesn't burn until we heat it up, or light it on fire?\n\nI'm not sure the physics on any of this at all, but humans have fusion reactors, so if we, like, somehow ejected a fusion reactor into Jupiter's atmosphere, and before it got crushed from the pressure or whatever, and start a fusion reaction, and ignite the gasses Jupiter has, would it become a star?\n\nPlease feel free to share your thoughts.",
        "created_utc": 1677522566,
        "upvote_ratio": 1.0
    },
    {
        "title": "Isobaric process in political economy",
        "author": "IvanBourbaki",
        "url": "https://drive.google.com/file/d/13T5P6DcV1xP9g3vNTGd2WGWg0o_3XIRw/view?usp=share_link",
        "text": "",
        "created_utc": 1677520810,
        "upvote_ratio": 1.0
    },
    {
        "title": "Physics vs Chemistry",
        "author": "Dry_Onion2478",
        "url": "https://www.reddit.com/r/Physics/comments/11dhvun/physics_vs_chemistry/",
        "text": "In physical thermodynamics, we take work done\ndW=P.dV, where P is the pressure of gas\n\nIn chemical thermodynamics, we take work done\ndW=-P'.dV, where P' is the external pressure\n\nThe physics one seems intuitively correct but the chemistry one seems a bit odd. Why do we take external pressure for work done, if pressure of gas pushes the piston?",
        "created_utc": 1677520010,
        "upvote_ratio": 1.0
    },
    {
        "title": "Question: If something explodes above water, would being underwater protect you or hurt you?",
        "author": "Valuable-Pen5700",
        "url": "https://www.reddit.com/r/Physics/comments/11dh6oa/question_if_something_explodes_above_water_would/",
        "text": "Please redirect me if I’m in the wrong subreddit (sorry if that’s the case)! \n\nSay, for instance, that your house is about to explode and you have the opportunity to dive into the swimming pool. Would you be more likely to survive or risk being more hurt? I’m thinking of bodily harm as well as hearing etc.\n\nThank you!",
        "created_utc": 1677518299,
        "upvote_ratio": 1.0
    },
    {
        "title": "momentum is not kidding...",
        "author": "anotomygunpowder",
        "url": "https://youtube.com/shorts/rYi350vku9M?feature=share",
        "text": "",
        "created_utc": 1677518195,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does anyone know some great videos on solving problems in General Physics 2 (Electromagnetism) on university level?",
        "author": "tasteofash",
        "url": "https://www.reddit.com/r/Physics/comments/11dfjuf/does_anyone_know_some_great_videos_on_solving/",
        "text": "[removed]",
        "created_utc": 1677514231,
        "upvote_ratio": 1.0
    },
    {
        "title": "what is the name of the theory in physics which says that the universe is an illusion?",
        "author": "thepathfinder88",
        "url": "https://www.reddit.com/r/Physics/comments/11de41l/what_is_the_name_of_the_theory_in_physics_which/",
        "text": "",
        "created_utc": 1677510607,
        "upvote_ratio": 1.0
    },
    {
        "title": "Physicists Use Quantum Mechanics to Pull Energy out of Nothing",
        "author": "Zee2A",
        "url": "https://www.quantamagazine.org/physicists-use-quantum-mechanics-to-pull-energy-out-of-nothing-20230222/",
        "text": "",
        "created_utc": 1677508166,
        "upvote_ratio": 1.0
    },
    {
        "title": "What are you working on? - Weekly Discussion Thread - February 27, 2023",
        "author": "AutoModerator",
        "url": "https://www.reddit.com/r/Physics/comments/11dcir8/what_are_you_working_on_weekly_discussion_thread/",
        "text": "Hello /r/Physics.\n\nIt's everyone's favorite day of the week, again. Time to share (or rant about) how your research/work/studying is going and what you're working on this week.",
        "created_utc": 1677506420,
        "upvote_ratio": 1.0
    },
    {
        "title": "Are PDEs always reconductible to a system of ODEs?",
        "author": "alesaso2000",
        "url": "https://www.reddit.com/r/Physics/comments/11dc1bu/are_pdes_always_reconductible_to_a_system_of_odes/",
        "text": "One could always rewrite a pde dx/dt=f(x,t) as a system of 2 odes dx1/dt=f(x1,x2) dx2/dt=1. Am I wrong?\n\nIf not, then why study PDEs?",
        "created_utc": 1677505055,
        "upvote_ratio": 1.0
    },
    {
        "title": "Joe Rogan: The Magnetic Poles Are Shifting!",
        "author": "mysticmuzic",
        "url": "https://www.youtube.com/watch?v=wfaM19nffYM",
        "text": "",
        "created_utc": 1677503913,
        "upvote_ratio": 1.0
    },
    {
        "title": "what exactly is the universal gravitational constant?",
        "author": "Ok_Entrepreneur8865",
        "url": "https://www.reddit.com/r/Physics/comments/11dbbmn/what_exactly_is_the_universal_gravitational/",
        "text": "i know how to use it in formulas but i don’t understand the concept of it. why is it measured in N m^2/kg^2 and what exactly is it measuring. i’d appreciate it if someone could provide an in depth response",
        "created_utc": 1677502919,
        "upvote_ratio": 1.0
    },
    {
        "title": "The Life on Europa theory",
        "author": "kc5eie",
        "url": "https://youtu.be/s8FJI5fmzFU",
        "text": "",
        "created_utc": 1677501693,
        "upvote_ratio": 1.0
    },
    {
        "title": "The Discovery That Gave a New Way to Look at Gravity",
        "author": "Aashutosh0",
        "url": "https://www.reddit.com/r/Physics/comments/11daj6g/the_discovery_that_gave_a_new_way_to_look_at/",
        "text": " \n\n**Gravitational waves** are ripples in the fabric of spacetime that propagate outward from a source, like a stone thrown into a pond creating ripples on the water's surface. They were first predicted by Albert Einstein's theory of general relativity, which describes gravity as the curvature of spacetime caused by the presence of massive objects.\n\nGravitational waves are extremely difficult to detect because they are incredibly faint and interact very weakly with matter. It wasn't until 2015 that scientists were finally able to detect them directly, using a network of extremely sensitive instruments called LIGO (Laser Interferometer Gravitational-Wave Observatory).\n\nLIGO consists of two detectors, one in Louisiana and one in Washington state, that use laser beams to measure tiny changes in the distance between mirrors caused by passing gravitational waves. When a gravitational wave passes through the detectors, it causes the mirrors to move by a tiny amount, which can be detected by the laser beams.\n\nThe first gravitational wave detected by LIGO was generated by the collision of two black holes, each about 30 times the mass of the sun, more than a billion light-years away from Earth. Since then, LIGO has detected several more gravitational waves, including those generated by the collision of neutron stars.\n\nGravitational waves provide a new way to study the universe and test our understanding of gravity. They allow us to observe phenomena that are invisible to traditional telescopes, such as the collision of black holes and neutron stars. They also provide a new tool for studying the fundamental nature of gravity and the structure of spacetime itself.\n\n# How it changed the way we look at gravity... \n\n The discovery of gravitational waves has already changed our perspective toward gravity in a significant way. Until the detection of gravitational waves, our understanding of gravity was based on the observations of the motion of objects in space, such as planets orbiting the sun. Gravitational waves offer a completely new way of observing the universe and testing our understanding of gravity.\n\nBy detecting the ripples in the fabric of spacetime caused by massive objects like black holes and neutron stars, gravitational waves have confirmed Einstein's theory of general relativity and demonstrated that gravity is indeed a fundamental force of nature. They have also provided new insights into the behaviour of black holes, the structure of spacetime, and the nature of the early universe.\n\nGoing forward, detecting more gravitational waves will likely lead to even more profound changes in our understanding of gravity. For example, it could shed light on the nature of dark matter and dark energy, which are still poorly understood despite being believed to make up the majority of the universe's mass and energy.\n\nFurthermore, the continued development of gravitational wave observatories and technology could eventually lead to the development of new technologies and applications, such as precision navigation and communication systems that are not affected by atmospheric interference.\n\nOverall, the discovery of gravitational waves has opened up a whole new field of research and has the potential to revolutionize our understanding of the universe and the fundamental forces that govern it.\n\n**Comment if want me to post an image with my posts too**",
        "created_utc": 1677500429,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why is the magnetic field inside a bar magnet zero?",
        "author": "Sanccu",
        "url": "https://www.reddit.com/r/Physics/comments/11d9ubc/why_is_the_magnetic_field_inside_a_bar_magnet_zero/",
        "text": "Our textbook mentioned this fact in passing, but was vague and didn't give answers. Could someone explain it in a way comprehensible to an interested high school student?",
        "created_utc": 1677498087,
        "upvote_ratio": 1.0
    },
    {
        "title": "Hi knowledge and reality are corrupting my mind, help me",
        "author": "kratosgod55",
        "url": "https://www.reddit.com/r/Physics/comments/11d9bqa/hi_knowledge_and_reality_are_corrupting_my_mind/",
        "text": "I already posted this on the philosophy group, but part of the post also questions things related to science/physics and I would like that type of observation as well. I hope this post is published here and not removed by a modder, anyway thanks and take it seriously please, if not just skip it don't bother to comment. Thanks!\n\n&amp;#x200B;\n\nI would like to question a series of ideas that have been bothering me lately... they say that knowledge is crucial to fight ignorance but it seems that in my case reading only gave me new existential anxieties about which I can't come up with a reasoning that heals them… that heals me…\n\nBut well, you probably already have well over 10 years of career, a life that’s yours, a job, a routine, wife and children or not, goals and a series of things that you have to do. The question is how do you see any meaning in that given all you know ? Why so much work and so much suffering and joy for, in a flash, everything to disappear in a few years, or tomorrow if something tragic happens, or never if you never find true happiness or the true love you always seek? Everyone lives for those goals really, at least for one of them. A teacher of philosophy that I have said that he enjoyed teaching students and awakening something in them, but what is the outcome of something like that? (And I seek that) A few more who will undoubtedly be important people, others less so, but in the long run, in the \"divine flow” of life, what is the purpose? It frustrates me that there is not a magical meaning for we, for the people, for we don’t know everything, so how can we be sure of anything.\n\nPhilosophy has already helped me with loads of false ideas I had and other reasoning bullshit, but when I put together everything I learned in my journey as a student and person: Philosophy, Politics, Ethics, Science, Physics, Chemistry, etc., so many things, but at the same time nothing really (not figuratively, I only met this themes with general good information I believe); everything seems to me like a series of contents and articles that only save those who dedicate themselves to them blindly… from insanity, and that's basically what they are almost unconsciously designed for. To occupy our minds. Because if the human being is an animal like all the others and only thinks/has consciousness, that fact is almost like a curse, because while in ancient times there was no science to justify a series of divinities of things, nowadays everything is studied and everything is a bunch of chemicals and hormones in your body. The literal animal is lucky enough to only do what it instinctively does but the Human does not, the Human does it thinking, but why? Without it being of interest to literally nothing in the end, just for self-satisfaction perhaps. Even the love that I feel, either for someone or for things, is nothing more but a positive (in my view) result than a path that I had as a child and that was more or less tumultuous. I had love and affection from my parents, great. If I had been abused and assaulted, I'm an unstable person and I can be criminal maybe, there's always a logic and a pattern, and a repetition across history. There was one incredible mind here, another one there, today there are 4 or 5 more, it’s this but ad infinitum, it never stops, what’s the goal? My core urges me to have meaning. Also in the matter of I, we, every human being, being unique. It is just differentiated by what my parents showed me in life, teached me in life, what I lived, etc, but nowadays I can almost point out two people who are practically the same in the way of living, of doing things, and of Being... they are literally copies. Am I really unique? I like to read, to walk, to do exercise, and Im a good person, good, more 30% of the population in my country is like this. 20% more is like this but don’t like reading they like videogames, etc. How can I be me? If I devote do meditation I become a monk, if I devote to Cristianism I become a Christian, If I devote do anything I become them and not me. Where is the One in this? And even if there are different people, if the path of virtuousness and Love is the only one and everyone should follow it; or if in the case of religion, and assuming that Christians are the best way (for example), everyone should be Christian, in fact, with this scenario, everything would be \"perfect\" if it got to that point, but deep down everyone would be equal, so if we are all different and we cannot be equal, what is the point of fighting for a group/community that wants to bring people together for the same cause in the world? Even if EVERYONE adhered, it would be denying the supposed magic of the Human Being and of each being as it is, Unique. On the other side, its a paradox, because the way things are, people in general want everyone to be good. There no true solution then.\n\nRight now I don't know what I'm going to do in the future, and that was something that always bothered me a little, and that opened up a lot of space to wander in a void of goals. Adding to this this conflict that I have between Science and Philosophy/Religion/others that now fail me, and the world seems to me a joke where everyone tries to find something to cling to and live, believers find something that is not known and they believe in it, scientists cling to a Nobel Prize in the fight against cancer that has saved millions of people, they cling to family when they least have it, the rich people to this, the buddhas people to that, other people to other things. Cuz without that goal or thing to do there is nothing? A brain that needs to find a motive, a goal, a passion? But we are animals really..  \n Returning to the other topic that bothers me the most, and which is one of the foundations of everyone, Love. I can't reassure myself when I question myself daily if what I feel for x person is a bunch of synapses and hormones working... but when all around me are divorced adult couples, guys my age starting and ending relationships on a regular basis, I believe in it the most, what is Loving deeply then? Is it me faithfully blinding myself to a person to justify a greater life or divine importance than my sad and vague work that means nothing if I don’t have the family of my dreams to justify it with? But deep down I'm the same as someone who got divorced, except that this one got upset because of an argument and that's the end of the problem, and I'm a masochist and I keep fighting for the poetic and the magical, maybe I'm more sentimental and the chemicals in my body act more intensely... So many things, so many things, and tomorrow the world ends because a meteor extinguishes the tireless and important human who lived in its space of 0.01 % of the Universe and nothing else will matter. Any classical philosopher didn't even know how big the Universe really would be, nor did he even know the depth of Science at the size we know it today, so there's an excuse, but today we already have everything. It's a question of more and more or better things, of extinguishing diseases, of cars flying, and that's it, you continue to want better for what will be current.\n\nI've already wondered if Suicide wouldn't be the Human's great final work of art, when he realizes its uselessness, and therefore willingly and happily assumes this deed as what must be done given the misfortune of having to think and reason when that is perhaps just a means to an infinite restlessness until death. Or else I stop learning and live in the simplicity of being an idiot. Maybe I'd rather die from the tobacco I smoke not knowing that smoking kills than be permanently unhappy deep down and pretend I'm not.",
        "created_utc": 1677496265,
        "upvote_ratio": 1.0
    },
    {
        "title": "Fundamental look on structure of proton and neutron - answer in logic of \"Möbius strip\" (quarks exist)",
        "author": "Begitton",
        "url": "https://www.youtube.com/watch?v=khEdShU2bdM",
        "text": "",
        "created_utc": 1677489648,
        "upvote_ratio": 1.0
    },
    {
        "title": "relation between geodesics, world-line, momentum, spin",
        "author": "mitrazar2145",
        "url": "https://www.reddit.com/r/Physics/comments/11d74k1/relation_between_geodesics_worldline_momentum_spin/",
        "text": "hello, I'm a Ph.D researcher on philosophy who's working on the meaning of orientation across the organic and the inorganic. I'm currently trying to understand the various meaning orientation gets in physics, and I've been fascinated by the notion of geodesics, worldline, momentum and spin. I think I have a decent conceptual grasp of the notion of momentum, angular momentum and spin, and I believe I also understand fairly well the meaning of a geodesics and of a worldline. \n\nYet, I have a hard time wrapping my head around the relationship between worldline and momentum in particular. It seems to me the two concepts should be related, yet google is not really helping me in founding a connection between the two, so I'm doubting - my intuition is that a worldline is a stand-alone concept for a particle yet knowing the particle's momentum can provide more specific information about the worldline itself?\n\nthx a lot for your help!",
        "created_utc": 1677488085,
        "upvote_ratio": 1.0
    },
    {
        "title": "SUPER SKY CBD GUMMIES And Love - How They Are The Same",
        "author": "Wide-Physics-6022",
        "url": "https://www.reddit.com/r/u_Wide-Physics-6022/comments/11d6iw2/super_sky_cbd_gummies_and_love_how_they_are_the/",
        "text": "[removed]",
        "created_utc": 1677485737,
        "upvote_ratio": 1.0
    },
    {
        "title": "could anyone help me with brilliant.org",
        "author": "Initial-Ad8339",
        "url": "https://www.reddit.com/r/Physics/comments/11d5mrk/could_anyone_help_me_with_brilliantorg/",
        "text": "[removed]",
        "created_utc": 1677482377,
        "upvote_ratio": 1.0
    },
    {
        "title": "People with just a B.S. in Physics/Astronomy, How did you acquire a job after graduating?",
        "author": "UrMomsMom__",
        "url": "https://www.reddit.com/r/Physics/comments/11d4ouy/people_with_just_a_bs_in_physicsastronomy_how_did/",
        "text": "",
        "created_utc": 1677478904,
        "upvote_ratio": 1.0
    },
    {
        "title": "Feedback requested about a 4th grade science test question",
        "author": "Lobstrosity1248",
        "url": "https://www.reddit.com/r/Physics/comments/11d3lkh/feedback_requested_about_a_4th_grade_science_test/",
        "text": "My daughter was recently given the following exam question on a test that determines a large percentage of her grade, and I think she was improperly marked wrong.  The teacher is standing by it because \"it came directly from the course materials\".  I was hoping to get some qualified feedback to see if my annoyance is justified.  Here is the question verbatim (students are only allowed to select one answer):\n\n**Which term means that light changes direction?**\n\n[View Poll](https://www.reddit.com/poll/11d3lkh)",
        "created_utc": 1677475112,
        "upvote_ratio": 1.0
    },
    {
        "title": "Should I go to school for physics?",
        "author": "Agitated_Tone2665",
        "url": "https://www.reddit.com/r/Physics/comments/11d0rxy/should_i_go_to_school_for_physics/",
        "text": "I was a moronic highschool student and didn't come near close to my potential. I was in love with Astronomy  I aced earth space then astronomy the following year. It's what I want my life to be. Problem being, I didn't take math seriously and thought I hated math (like many highschool students.) The highest math I've ever completed was geometry and I hardly remember any. I'm still young, and really want to go to school for physics. So my question is, with practically no background in math (besides a good grasp on algebra) could I realistically succeed and learn everything I need through physics? Or do I need to go back, learn calculus , chemistry? Other classes?",
        "created_utc": 1677466383,
        "upvote_ratio": 1.0
    },
    {
        "title": "Null's Complexion: Theory of Everything by a Youtube Physicist",
        "author": "vEncrypted",
        "url": "https://www.reddit.com/r/Physics/comments/11d070q/nulls_complexion_theory_of_everything_by_a/",
        "text": "**Warning!**\n\nI would firstly like to state that I have no scientific background and this theory can most probably be easily debunked, but I think it might be interesting to some. I will make mistakes and there will be inaccuracies. This most probably has already been theorized hundreds of years ago and I am naive to it. But anyways.. here it is feel free to close the window if ever this becomes too unbearable to read.\n\n**Intro**\n\nHow does anything exist? This question is not new and scientists cannot seem to agree on a solution. In this paper, I will try and describe what could be the beginning of a theory of everything. To do so, I believe we should try and begin from the start instead of working backwards. What was there in the beginning?\n\n**Null Theory**\n\nI do not believe anything exists. Let's put religious beliefs aside for a moment. Science gives us laws of conservation that I believe are objectively logical enough to apply to everything in the universe. So something cannot come out of nothing. Therefore the universe must have, and somehow still is, equal to nothing\n\n*Universe = 0 (nothing)*\n\nThis human way of visualizing things that is extremely simple. But for the sake of this theory, this is the reality of the universe.\n\n**What is Nothing?**\n\nIf we know that the universe is nothing, but everything we can observe is “real”, then it doesn’t quite make sense does it? This leads me to the following question: how does the universe describe nothing? This might be hard to comprehend, but let me put it this way:\n\n*0 = cat - cat*\n*cat - cat = 502 - 502*\n*Etc*\n\nYou get the point. How can we know how the universe describes nothing? The answer to this question is impossible to know, instead we can only use the hints we can observe to theorize on this.\f\n\n**Universe’s Version of Nothing**\n\nQuantum physics has demonstrated phenomenons such as superposition and entanglement that can possibly help us describe nothing. We know that particles can exist in many states at the same time due to superposition. These states are described by wave functions and when measured, it collapses into one of two opposite states.\n\nEntanglement is possibly the second piece of the puzzle here. We have been able to prove that when entangled particles are measured, they will always be opposites. Regardless of where they are, the universe forces the opposition of these two particles.\nThis is fascinating as it gives us an explanation for how the universe was possibly composed of everything and nothing at the same time. Nothing does not have to be nothing as long as there is something that when put together, will always make nothing.\n\n**The God Particle and it’s Complexion**\n\nWe know that all elementary particles were, supposedly, created during the big bang. Additionally, we know that elementary particles can decay into bosons such as photon. This would suggest that not all particles once existed and they came to be progressively.\nThis is not a new idea in science at all, it is already known but it gives up further insight on how particles as we know them could have came to be.\n\nIf the universe indeed had a method of describing itself using neutral pairs, in a manor that conserves its nothingness. Then what were these pairs made out of? These can be referred to as the “god particle”. We have seen that name be used for bosons but I believe, for absolutely no good reason, that bosons are still too complex.\nAll particles as we know we’re created through what I call \"complexions\", such as the Big Bang.\n\n**Conclusion**\n\nSchrödinger's cat never existed to begin with, but that does not prevent you from finding him in the box.\n\nAs stated initially, I have no background in science other than the internet. Feel free to correct me, easily disprove this, leave feedback or even hate. Under you can find other pieces of this theory that are not canon to the story.\f\n\n**There can be infinite energy and mass in the universe**\n\nInfinite anything has always seemed to be impossible. But since the universe is nothing, don’t we know that:\n\n*0 x infinity = 0*\n\nTherefore, if the universe describes nothing in a different manner we do not yet comprehend and there is no end to the universe, then it is entirely possible that in its complexion process it created infinites amount of energy and mass.",
        "created_utc": 1677464657,
        "upvote_ratio": 1.0
    },
    {
        "title": "If symmetries in the universe do not hold globally, what does that mean?",
        "author": "stifenahokinga",
        "url": "https://www.reddit.com/r/Physics/comments/11cz0qf/if_symmetries_in_the_universe_do_not_hold/",
        "text": "Perhaps this is a stupid question but, if Lorentz symmetry and time translational symmetry are not global in an expanding universe, wouldn't that mean that is possible that other Hubble spheres outside our observable universe could have other symmetries or an absence of the Lorentz symmetry? I mean, does this mean that the Lorentz symmetry could hold in our local region of spacetime (that is, our observable universe) but, as it does not hold globally, there could be other regions where it would not hold?",
        "created_utc": 1677461282,
        "upvote_ratio": 1.0
    },
    {
        "title": "Do nearsighted people see things in the distance clearly when looking at them via a mirror which is close to them?",
        "author": "beschimmeld_brood",
        "url": "https://www.reddit.com/r/Physics/comments/11cvzcg/do_nearsighted_people_see_things_in_the_distance/",
        "text": "This might be very obvious to some but i cannot really reason through it without thinking i am wrong. I would say, Yes they could because they have to focus their eyes on the mirror, but that doesn’t seem right.",
        "created_utc": 1677453332,
        "upvote_ratio": 1.0
    },
    {
        "title": "Got to see another quantum computer today!",
        "author": "Adventurous-Cloud863",
        "url": "https://i.redd.it/hy8q1ivy5mka1.jpg",
        "text": "",
        "created_utc": 1677452500,
        "upvote_ratio": 1.0
    },
    {
        "title": "Physics Tinder?!",
        "author": "americanarizona",
        "url": "https://www.reddit.com/r/Physics/comments/11csue5/physics_tinder/",
        "text": "[removed]",
        "created_utc": 1677445908,
        "upvote_ratio": 1.0
    },
    {
        "title": "How did the matter on earth make it to this point in space before light from the big bang?",
        "author": "BlueMANAHat",
        "url": "https://www.reddit.com/r/Physics/comments/11csfb7/how_did_the_matter_on_earth_make_it_to_this_point/",
        "text": "If we can see light from the big bang doesnt that mean that we made it to this point in space first? How is it possible that matter made it to a point in space before light? Both matter and light from the big bang came from the same point, so it seems to me that we shouldn't be able to see those light particles because they would have long passed the point in space we occupy long before the matter that we are made of.",
        "created_utc": 1677444954,
        "upvote_ratio": 1.0
    },
    {
        "title": "Came across this clip from Lex Fridman. What do physicists think of theories of everything? Is it possible?",
        "author": "New_Language4727",
        "url": "https://www.reddit.com/r/Physics/comments/11cs41f/came_across_this_clip_from_lex_fridman_what_do/",
        "text": "https://youtu.be/kK8oKwBb9eM",
        "created_utc": 1677444242,
        "upvote_ratio": 1.0
    },
    {
        "title": "Wondering if anyone can help me answer a question about the force put on an object by the suction from a fan",
        "author": "RelationshipMany3844",
        "url": "https://www.reddit.com/r/Physics/comments/11cok5f/wondering_if_anyone_can_help_me_answer_a_question/",
        "text": "I have been trying to find out how to calculate how heavy of an object a fan can move using suction. I’m familiar with maximum airflow and static pressure being how much air the fan can move in a certain amount of time and static pressure being its ability to push air against resistance. Although I know how I can measure these, I don’t know how to relate anything measurable to how heavy of an object the fan could move using suction (assuming there are no other forces acting on the object). I think that I am probably missing the concept about how to relate these, but I could also be in the completely wrong direction. I would appreciate any help.",
        "created_utc": 1677435772,
        "upvote_ratio": 1.0
    },
    {
        "title": "Wormholes Bend Light Like Black Holes Do — and That Makes it Possible to Find Them, New Study",
        "author": "indigenous_apache",
        "url": "https://www.guardianmag.us/2023/02/wormholes-bend-light-like-black-holes.html?m=1",
        "text": "",
        "created_utc": 1677435402,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can you send information from within a massive blackhole",
        "author": "enderboyVR",
        "url": "https://www.reddit.com/r/Physics/comments/11co6py/can_you_send_information_from_within_a_massive/",
        "text": "\nOk the basic information is that nothing and escapes black holes when it get pass the EH, even light but that doesn’t means the blackout are pulling things at the speed of light (I don’t really know how to express this) like how in a massive black hole, when a photon get pass the EH, it won’t immediately change direction and go straight to the black hole center but it gradually curve its path to the center(like a falling satellite). So let say you just get pass the EH, can you just turn on the light pointing opposite to the center, the force that pull the photon are not strong enough to beat its speed. I assume the BH is big enough that it won’t turn you into dust immediately, can you do that? And why not?",
        "created_utc": 1677434883,
        "upvote_ratio": 1.0
    },
    {
        "title": "Could mass/gravity be the result of matter consuming space-time?",
        "author": "Expensive_Internal83",
        "url": "https://www.reddit.com/r/Physics/comments/11co6ma/could_massgravity_be_the_result_of_matter/",
        "text": "Or just space?\n\nWe imagine gravity as a force, accelerating an object through space but, what if mass is a measure of how much space an amount of matter/energy density (or just energy... but time tho) will consume in a given amount... of ..time..?  The point at which spacetime moves at the speed of light would be an event horizon?",
        "created_utc": 1677434876,
        "upvote_ratio": 1.0
    },
    {
        "title": "I made a python package that can plot electric fields from drawings and point charges, and plot the EM fields after Lorentz boosting to a moving frame (video and jupyter notebook in comments)",
        "author": "OldImagination2534",
        "url": "https://i.redd.it/2y89x8ck2kka1.png",
        "text": "",
        "created_utc": 1677427139,
        "upvote_ratio": 1.0
    },
    {
        "title": "Wondering if anyone can help answer this- Could someone with a parachute be able to pull someone else falling “up”?",
        "author": "touchedbyacat",
        "url": "https://www.reddit.com/r/Physics/comments/11ckip4/wondering_if_anyone_can_help_answer_this_could/",
        "text": "I’m having a hard time figuring out how to research the answer to this question because I’m not sure exactly what the proper terms for the laws of physics in play here would be. But here is my hypothetical question:\n\nIf two people are falling - one person with a parachute and one without - could the person with the parachute theoretically be able to pull the other person up (so actually increasing their elevation) by pulling on a rope the other was holding?\n\nAir is still, no upward gusts. People are both similar in mass.",
        "created_utc": 1677426811,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can we determine if a random particle has entanglement?",
        "author": "fruitydubbie",
        "url": "https://www.reddit.com/r/Physics/comments/11cjxzk/can_we_determine_if_a_random_particle_has/",
        "text": "I'm understanding what the material is saying for a \" pair of photons\". What I am attempting to find information on is when/ how to determine a single element could be entangled?\n\nI'm a mathematician so forgive my ignorance is it's a strange question. I'm looking for a quantum analysis. Is that even a thing?",
        "created_utc": 1677425377,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is movie-style explosive decompression entirely Hollywood physics?",
        "author": "Fanghur1123",
        "url": "https://www.reddit.com/r/Physics/comments/11cigl7/is_moviestyle_explosive_decompression_entirely/",
        "text": "Does anyone know whether the sort of dramatic explosive decompression frequently seen in movies where the hull of a spacecraft gets breached and all of a sudden everything and everyone is being violently sucked out of the ship is at all realistic? Or is it entirely just Hollywood physics? 🤔",
        "created_utc": 1677421546,
        "upvote_ratio": 1.0
    },
    {
        "title": "Student here, how is the formula for net force in a pendulum created?",
        "author": "YeeterSkeeterFeet",
        "url": "https://www.reddit.com/r/Physics/comments/11ch47l/student_here_how_is_the_formula_for_net_force_in/",
        "text": "We were taught that the net for of a pendulum Bob at any point is F = -m x g x sin(Theta). But we were never told how it is derived, like how do you get that from the original equation and combining it with the other variables?",
        "created_utc": 1677417999,
        "upvote_ratio": 1.0
    },
    {
        "title": "a theory I made",
        "author": "Public-Suspect8573",
        "url": "https://www.reddit.com/r/Physics/comments/11cgwsx/a_theory_i_made/",
        "text": "[removed]",
        "created_utc": 1677417455,
        "upvote_ratio": 1.0
    },
    {
        "title": "found this in my physics textbook",
        "author": "spike_kun",
        "url": "https://i.redd.it/xt71xtwkikka1.jpg",
        "text": "",
        "created_utc": 1677414519,
        "upvote_ratio": 1.0
    },
    {
        "title": "any ideas on how to put a formula like this onto an excel file?",
        "author": "Dizzy_Situation7817",
        "url": "https://www.reddit.com/gallery/11cf8ob",
        "text": "",
        "created_utc": 1677412536,
        "upvote_ratio": 1.0
    },
    {
        "title": "Need help with my thesis (mostly the excel part)",
        "author": "Dizzy_Situation7817",
        "url": "https://www.reddit.com/r/Physics/comments/11cf5ip/need_help_with_my_thesis_mostly_the_excel_part/",
        "text": "[removed]",
        "created_utc": 1677412397,
        "upvote_ratio": 1.0
    },
    {
        "title": "Career Confusion",
        "author": "xxriana",
        "url": "https://www.reddit.com/r/Physics/comments/11cc9di/career_confusion/",
        "text": "I have used the search feature but couldn’t exactly find what i want to ask. Apologies in advance if that has been asked before.\n\n Hey! 17 y/o senior high school student here. I am going to apply collages this summer. I have a great deal of interest in physics for years now but I am not sure about whather my dreams are realistic or not regarding the field, so I have doubts about choosing a major in physics. \n There is also a lot diversity of opinions regarding a career of physics ,which makes it pretty hard to distinguish the realistic one’s. \n\n\n\nSo here are my questions:\n\nI know that physics major’s are not always employed in physics but also engineering,computer science,teaching,finance. \nSo is remaining in the field of physics that minor? \n\nIs a career of research plausible? \nI would like to conduct researches ,which i think is only possible in academy, is it a slim chance? \n\nWhole reason i want to study physics is because i want to spend my life learning about it,but is it really the case in real life?\n\n\n\nThank you all in advance. \n\nPlease excuse my grammatical errors or if I have worded some sentences badly. I am not a native speaker, so dont hesistate to ask if something is not clear.",
        "created_utc": 1677407236,
        "upvote_ratio": 1.0
    },
    {
        "title": "need some help with GW's",
        "author": "Sufficient-Try8159",
        "url": "https://www.reddit.com/r/Physics/comments/11cblwc/need_some_help_with_gws/",
        "text": "hello everyone, I'm making a small presentation about Gravitational waves. \n\nwhile doing research about them, I found the following formula-\n\n&amp;#x200B;\n\nhttps://preview.redd.it/uym9lxmibika1.png?width=511&amp;format=png&amp;auto=webp&amp;v=enabled&amp;s=8ab45d0f7d6ec3c13145228d2da5c184d1c180d8\n\nand I want to know how we get this formula, what I mean is what is the proof? where does it come from? any help would be appreciatedd",
        "created_utc": 1677406108,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is engineering the right choice for me?",
        "author": "Altruistic_Victory28",
        "url": "https://www.reddit.com/r/Physics/comments/11ca94z/is_engineering_the_right_choice_for_me/",
        "text": "I’m in engineering college, and honestly, I’m not sure if engineering will be the right choice for me and I’m not quite sure if I want to be an engineer. I’m very good at math and physics, and I used to have an interest in physics when I was in high school but when I graduated I don’t know what happened. I feel like I’m lost and I don’t know if I have made the wrong choice. Also, I don’t know if being an engineer is fine for a person like me, I'm highly introverted, and socializing always drains me.\n\nWhat should I do?",
        "created_utc": 1677403985,
        "upvote_ratio": 1.0
    },
    {
        "title": "I’m obsessed with this!! It’s incredible!",
        "author": "Desperahgj",
        "url": "https://i.redd.it/mr34qyzq4ika1.jpg",
        "text": "",
        "created_utc": 1677403660,
        "upvote_ratio": 1.0
    },
    {
        "title": "Ignorant hungry for answers. Could you explain to me?",
        "author": "GarLuck4",
        "url": "https://www.reddit.com/r/Physics/comments/11c9w0y/ignorant_hungry_for_answers_could_you_explain_to/",
        "text": "Not sure if this is the right place to ask this, but here I go. I am a writer. Not that I have published anything yet, but I am always writing, and I have lots of drafts. I love sci-fi, and for a certain part of a story, there is a character underwater and I realized that if I wanted to depict this part realistically I would have to explain how he deals with preassure. What led me to think more about this topic, which has always intrigued me and I know little about. \"If you go too deep into the sea, preassure will kill you.\" \nHow does it work? What does preassure exactly mean? What happens when you are exposed to that pressure? What kills you exactly? What would happen if you were too deep without a diving suit? What happens to your body? Why does pressure exist?  I realized I dont really understand it. What is the limit? How deep can a submarine go without breaking? And a human with a diving suit? And without it? Explain EVRYTHING about preassure underwater and the reason why it occurs. \nOf course, I have a vague idea about all I am asking, I mean, I know more or less where the answers are going, but still I want certainties and science based answers.",
        "created_utc": 1677402960,
        "upvote_ratio": 1.0
    },
    {
        "title": "How does one learn from Graduate level texts? Did I miss something in my undergrad?",
        "author": "AyTheGamer",
        "url": "https://www.reddit.com/r/Physics/comments/11c89zr/how_does_one_learn_from_graduate_level_texts_did/",
        "text": "Hello,  \n\n\nI'm struggling to read any and all graduate level textbooks. (Sakurai for Quantum, Pathria for Stat Mech, etc).   \n\n\nI understand that what I am about to write is likely 100% fault on my end, and hopefully that disclaimer helps it from coming off wrong. However, it feels like these textbooks will introduce a concept and then spend 10x the amount of pages going off on a mathematical tangent for a very specific example or something (honestly, I can't even tell). I can spend hours trying to figure out what these authors are doing, but considering I'm taking 3 of these classes, I simply don't have the time. But then, when it comes to actually solving problems from these books from the homework, they, again, seem to be going off on some random mathematical tangent that wasn't even discussed in the book.  \n\n\nIn short, I'm so lost reading these. It feels like these authors are writing these books for themselves and no one else. I can't figure out what's important and what's not, let alone understand what I should be learning or not. In short, I can't learn from this level of textbook.  \n\n\nHow does one actually learn from graduate level texts? Does anyone have any advice? Clearly, I must be doing something wrong, or I failed to learn something as an undergrad, if these are the standards professors are teaching from.  \n\n\nAll help is appreciated, thank you.  \n\n\nNote: I'm not asking for help specifically with these subjects. I'm pretty much struggling with the textbooks for all of my graduate classes, and I think if I could figure out how to read these books, that would help me the most.",
        "created_utc": 1677396514,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is temporal relativity related to the speed of light being absolute?",
        "author": "BreathAway7817",
        "url": "https://www.reddit.com/r/Physics/comments/11c73pu/is_temporal_relativity_related_to_the_speed_of/",
        "text": "[removed]",
        "created_utc": 1677392058,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is this true or is it just more pop science bs?",
        "author": "New_Language4727",
        "url": "https://www.reddit.com/r/Physics/comments/11c6mbc/is_this_true_or_is_it_just_more_pop_science_bs/",
        "text": "Came across this article where it states that multiple dimensions and parallel universes might actually exist, but I’m not certain about it.\n\nArticle:\n\nhttps://www.pastchronicles.com/a-new-find-suggests-that-other-dimensions-and-parallel-universes-might-really-exist/",
        "created_utc": 1677390320,
        "upvote_ratio": 1.0
    },
    {
        "title": "Mass Vs Weight",
        "author": "WindFuel",
        "url": "https://www.reddit.com/r/Physics/comments/11c6k3y/mass_vs_weight/",
        "text": "[https://youtu.be/glIUbiw8WB8](https://youtu.be/glIUbiw8WB8)",
        "created_utc": 1677390098,
        "upvote_ratio": 1.0
    },
    {
        "title": "Force Vs Pressure",
        "author": "WindFuel",
        "url": "https://www.reddit.com/r/Physics/comments/11c6jum/force_vs_pressure/",
        "text": "[https://youtu.be/4Kuy7eJrvmU](https://youtu.be/4Kuy7eJrvmU)",
        "created_utc": 1677390072,
        "upvote_ratio": 1.0
    },
    {
        "title": "Area Vs Volume",
        "author": "WindFuel",
        "url": "https://www.reddit.com/r/Physics/comments/11c6jlw/area_vs_volume/",
        "text": "[https://youtu.be/wb8QL2XWeqI](https://youtu.be/wb8QL2XWeqI)",
        "created_utc": 1677390049,
        "upvote_ratio": 1.0
    },
    {
        "title": "I made a 3D Projectile Visualizer",
        "author": "Downtimed",
        "url": "https://v.redd.it/0bqbqb6ongka1",
        "text": "",
        "created_utc": 1677386056,
        "upvote_ratio": 1.0
    },
    {
        "title": "Did you try to discuss physics with ChatGPT?",
        "author": "CaterpillarAny8669",
        "url": "https://www.reddit.com/r/Physics/comments/11c3swe/did_you_try_to_discuss_physics_with_chatgpt/",
        "text": "I discussed a brand-new theory today with ChatGPT, it did not make fun of me (like what people on this form will do), it pinpointed the inconsistencies of the theory, it helped me refine it, and it wrote an article about my theory, just wow\n\nDid you try ChatGPT in physics? What do you think?",
        "created_utc": 1677380903,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do we show the translational symmetry of the vertex function?",
        "author": "AyanaYagura",
        "url": "https://www.reddit.com/r/Physics/comments/11c3r5s/how_do_we_show_the_translational_symmetry_of_the/",
        "text": "In quantum field theory, n-point vertex function (Γ\\^n) is defined as the expansion coefficient of the effective action (Γ):  Γ\\[φ\\]=sum\\_{n=0}\\^infty (1/n!) int dx\\_1...dx\\_n Γ\\^n(x\\_1...x\\_n) φ(x\\_1)...φ(x\\_n)\n\nI want to show that Γ\\^n has translational symmetry.  Γ\\^n(x\\_1,...,x\\_n)=Γ\\^n(x\\_1+a,...,x\\_n+a)  (for all a)\n\nTranslation symmetry is equivalent to the delta function hanging in the Fourier transform. I want to use this to see how it relates to the connected Green's function in momentum space.\n\nI would like to ask for your help.",
        "created_utc": 1677380754,
        "upvote_ratio": 1.0
    },
    {
        "title": "Job Ideas?",
        "author": "Alicussy",
        "url": "https://www.reddit.com/r/Physics/comments/11c30hj/job_ideas/",
        "text": "Hi y’all,\n\nSo just to give some background info, I’m a 16y/o Girl who currently lives in Ontario Canada (with no desire to leave Canada). I’ve been wondering what to do for my career for a hot minute now, but I just finished my 11 U level Physics course, which I absolutely adored!\n\nFinishing that course I knew that I wanted to do something with physics but… I have no idea what that would be right now (so far high school teacher i think???) and I’d LOVE to hear some of the jobs y’all here do!\n\nI should mention as a final tid bit that I am trans so it would be great if you could mention if you have heard about any bad experiences with queer folk in your line of work.\n\n- Allison :)",
        "created_utc": 1677378559,
        "upvote_ratio": 1.0
    },
    {
        "title": "Research vs Internship for Physics Major",
        "author": "Pilot1922",
        "url": "https://www.reddit.com/r/Physics/comments/11c2yq1/research_vs_internship_for_physics_major/",
        "text": "Title is self explanatory. I plan to change my major into Applied Physics and wanted more information\n\nI originally wanted to major in Engineering and within that field there’s a lot of stress within getting experience through internships before graduation.\n\nHowever, I wanted to ask is this same need for an internship as stressed when it comes to Physics. My grades aren’t really at the best right now and an internship in the near future seems unlikely, however, my university provides plenty of research opportunities.\n\nAs a physics major is research more important than an internship? Any insight would be great!",
        "created_utc": 1677378407,
        "upvote_ratio": 1.0
    },
    {
        "title": "Umm.... i personally think something is missing here. Need some help here.",
        "author": "Alin1260",
        "url": "https://i.redd.it/7vbuj9nwihka1.png",
        "text": "",
        "created_utc": 1677378315,
        "upvote_ratio": 1.0
    },
    {
        "title": "What new properties do strings have in String Theory?",
        "author": "l---BATMAN---l",
        "url": "https://www.reddit.com/r/Physics/comments/11c2ejx/what_new_properties_do_strings_have_in_string/",
        "text": "Sub-atomic particles have strange properties like superposition and Quantum tunneling. In String Theory the fundamental strings are smaller than sub-atomic particles and have more spatial dimensions. So, what new properties arise in a system with strings?\nCould we (if ST is true) some day in a very far future use this new properties to build a new type of computer like Quantum computers are built to use superposition to calculate faster?\n(Sorry for my english)",
        "created_utc": 1677376770,
        "upvote_ratio": 1.0
    },
    {
        "title": "What new properties do strings have in String Theory",
        "author": "l---BATMAN---l",
        "url": "https://www.reddit.com/r/Physics/comments/11c2dn8/what_new_properties_do_strings_have_in_string/",
        "text": "Sub-atomic particles have strange properties like superposition and Quantum tunneling. In String Theory the fundamental strings are smaller than sub-atomic particles and have more spatial dimensions. So, what new properties arise in a system with strings?\nCould we (if ST is true) some day in a very far future use this new properties to build a new type of computer like Quantum computers are built to use superposition to calculate faster?\n(Sorry for my english)",
        "created_utc": 1677376690,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do transistors work?",
        "author": "QAQ_Jack",
        "url": "https://www.reddit.com/r/Physics/comments/11c2cwu/how_do_transistors_work/",
        "text": "  \n\n\nhttps://preview.redd.it/i18ectxcwfka1.png?width=1025&amp;format=png&amp;auto=webp&amp;v=enabled&amp;s=b3afdeeee2f72f9c857b0779179718d59c675a89\n\nI always thought I knew how transistors work, at least before a friend of mine asked me about an NPN-switch under strange conditions and I'm confused now:\n\nThe drawing shows a normal NPN-switch, and the arrows show the direction of electrons (hope I didn't draw anything wrong.)\n\n1. How does it work? The electrons are provided from the base circuit turn the transistor on, then the emitter emits charge carriers (e- in this case,) then some go back to the base, the majority go to the collector, forming a stronger (why?) collector circuit? (This is what I know about this.)\n2. If my description on Q1 is correct, then how is the transistor \"turned on?\" I saw this term being used somewhere.\n3. From my understanding, the collector circuit is reverse biased to prevent electrons from flowing back to the base (from the collector.) Won't it be blocking the electrons' path from the base to collector too?\n4. How can the collector circuit be \"reverse biased?\" The positive terminal of the battery connects to N (reverse biased) but another pole is forward biased. (Negative pole to N)\n5. What happens when either side of the battery (potential difference) increases? I know if I add a cell to the base circuit, then the collector circuit will be amplified proportionally, but what if I add a cell to the collector circuit. Does anything happen?\n6. What will happen if I switch the position of E and C in this diagram? Will anything change?\n7. What will happen if I switch the collector circuit to reverse biased by switching the poles of the collector cell.\n\nI believe there is some fundamental knowledge or big misunderstanding I'm having here. I have done some google searching but nothing worked (or I'm just very confused, I don't know.)\n\nFor the sake of explanation, you can take the battery on the base circuit (above) as BAT A and another one as BAT B.",
        "created_utc": 1677376628,
        "upvote_ratio": 1.0
    },
    {
        "title": "what new properties do strings have in string theory",
        "author": "l---BATMAN---l",
        "url": "https://www.reddit.com/r/Physics/comments/11c2cjh/what_new_properties_do_strings_have_in_string/",
        "text": "Sub-atomic particles have strange properties like superposition and Quantum tunneling. In String Theory the fundamental strings are smaller than sub-atomic particles and have more spatial dimensions. So, what new properties arise in a system with strings?\nCould we (if ST is true) some day in a very far future use this new properties to build a new type of computer like Quantum computers are built to use superposition to calculate faster?\n(Sorry for my english)",
        "created_utc": 1677376599,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why does my phone charger make a strange hiss noise?",
        "author": "Atmo_reetry",
        "url": "https://v.redd.it/lrjuavy5vfka1",
        "text": "",
        "created_utc": 1677376381,
        "upvote_ratio": 1.0
    },
    {
        "title": "Dumb physics question",
        "author": "Th30negardian",
        "url": "https://www.reddit.com/r/Physics/comments/11bzzdw/dumb_physics_question/",
        "text": "If you kick a ball at 15 fps or ~4.57mps at      45 degrees , will it travel. Assuming no air resistance and delta y is zero, can you use the equation d = (v^2 * cos(45))/32 to solve for distance? If so does 4.97 ft or 1.51m. It just doesn’t seem right, it’s roughly 10 miles an hour, and it goes just under 5 ft??? Does this math check out with you guys?",
        "created_utc": 1677369923,
        "upvote_ratio": 1.0
    },
    {
        "title": "A really cool free simulator for easily modeling and playing with optics.",
        "author": "Zenquin",
        "url": "https://opticexplorer.sharedigm.com/",
        "text": "",
        "created_utc": 1677368696,
        "upvote_ratio": 1.0
    },
    {
        "title": "A really cool free optics and lens simulator.",
        "author": "Zenquin",
        "url": "https://opticexplorer.sharedigm.com/",
        "text": "",
        "created_utc": 1677368570,
        "upvote_ratio": 1.0
    },
    {
        "title": "Could our spacetime change so much (through some physical process) that it would be transformed into a spacetime with different fundamental symmetries?",
        "author": "stifenahokinga",
        "url": "https://www.reddit.com/r/Physics/comments/11byehh/could_our_spacetime_change_so_much_through_some/",
        "text": "Our universe (and thus our spacetime) is described by the theory of relativity which assumes that the universe has some fundamental symmetries (at least locally) like Poincaré invariance (including Lorentz invariance) and diffeomorphism invariance. All solutions to Einstein's equations include spacetimes that respect all these symmetries.\n\nHowever, I was reading this book (https://www.cambridge.org/core/books/abs/an-introduction-to-relativity/spacetime-symmetries/195942D4233600E9A1943C4C3DA54AAA) where it says:\n\n&gt;A completely general spacetime arising from an arbitrary distribution of gravitating objects will not have any symmetries at all. Such cases are difficult to solve as solutions of Einstein's gravitational equations.\n\nThen, could some physical process (like some specific distribution of gravitating matter as the book says, or anything else) alter the structure, the geometry or the metric of spacetime so much that it would violate all the fundamental symmetries assumed by relativity (such as the ones I mentioned earlier) leaving the universe in a state where the theory of relativity (GR &amp; SR) would not hold?",
        "created_utc": 1677365835,
        "upvote_ratio": 1.0
    },
    {
        "title": "where to begin?",
        "author": "ObsidianHypnosis",
        "url": "https://www.reddit.com/r/Physics/comments/11bxfbl/where_to_begin/",
        "text": "I'm 14 and want to start studying physics outside of school, I've studied the basics using online YouTube videos but I don't know where to progress to the area that I'm most interested in which is theoretical physics and astrophysics, I've also not answered many problems as I'm not sure where to find them. Is there any books that would seem useful?",
        "created_utc": 1677363361,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why is Mars's Moon Traveling the Wrong Way?",
        "author": "azeemb_a",
        "url": "https://azeemba.com/posts/mars-phobos-wrong-way-moon.html",
        "text": "",
        "created_utc": 1677359382,
        "upvote_ratio": 1.0
    },
    {
        "title": "The Peculiar Math That Could Underlie the Laws of Nature.",
        "author": "marchingbandd",
        "url": "https://www.quantamagazine.org/the-octonion-math-that-could-underpin-physics-20180720/",
        "text": "",
        "created_utc": 1677353181,
        "upvote_ratio": 1.0
    },
    {
        "title": "Question about going faster than the speed of light/backwards time travel",
        "author": "zRedemptionz",
        "url": "https://www.reddit.com/r/Physics/comments/11bs65q/question_about_going_faster_than_the_speed_of/",
        "text": "[removed]",
        "created_utc": 1677350290,
        "upvote_ratio": 1.0
    },
    {
        "title": "Pilot didn't land because someone wasn't sitting in their assigned seat?",
        "author": "NPRnoose",
        "url": "https://www.reddit.com/r/Physics/comments/11brmo1/pilot_didnt_land_because_someone_wasnt_sitting_in/",
        "text": "I was flying into Chicago yesterday on a snowy night on E-175 aircraft. Right as we were about to land, the pilot pulled the plane back up and said that because someone was not in their assigned seat, they could not land. Can someone explain the math behind this? I get that it is a small plane but to what extent is the landing effected by one person not being in an assigned seat?  \n\n\nThis person also switched from first class to economy, so I have no idea why they decided to do that was the right move to make.",
        "created_utc": 1677348940,
        "upvote_ratio": 1.0
    },
    {
        "title": "What does this text exactly mean? What's the relation between gravitational force and light if any?",
        "author": "_Shadow_Prince",
        "url": "https://i.redd.it/bwt7dhycjdka1.png",
        "text": "",
        "created_utc": 1677348090,
        "upvote_ratio": 1.0
    },
    {
        "title": "I have concluded: You can fit 1.52 Quintillion cows on top a black hole (Sag A)",
        "author": "RandyBoBandy___",
        "url": "https://www.reddit.com/gallery/11bqc6r",
        "text": "",
        "created_utc": 1677345804,
        "upvote_ratio": 1.0
    }
]