[
    {
        "title": "I'm trying to get lightcones, i think it may have clicked is this right?",
        "author": "Joanta11111",
        "url": "https://www.reddit.com/r/Physics/comments/ywnvyi/im_trying_to_get_lightcones_i_think_it_may_have/",
        "text": "So the light cone before event A (present) is all possible things that could have influenced A. Something outside the past cone could never have an influence because it would need to travel faster than light. And the future cone represents everything A could affect, since for A to interact with something outside its light cone A would need to travel FTL. Is this correct? I understand there's probably more to it but is this the basics?",
        "created_utc": 1668586802,
        "upvote_ratio": 1.0
    },
    {
        "title": "Artemis I, the most powerful rocket engine ever flown to space, just got launched, marking the dawn of a new era for the Future of Humanity, finally going back to the Moon and beyond. : )",
        "author": "My_Redditor_Username",
        "url": "https://i.redd.it/zfdcix8m3b0a1.jpg",
        "text": "",
        "created_utc": 1668583564,
        "upvote_ratio": 1.0
    },
    {
        "title": "i want to learn everything about physics on my own",
        "author": "going_berserk_777",
        "url": "https://www.reddit.com/r/Physics/comments/ywlqm2/i_want_to_learn_everything_about_physics_on_my_own/",
        "text": "is there any material that can help me? books? youtube videos? channels? that i could watch or read that covers up everything about physics. i am new, as in literally new, any help will be much appreciated, thanks!",
        "created_utc": 1668579292,
        "upvote_ratio": 1.0
    },
    {
        "title": "How can potential energy be stored and used in everyday life as a source of power?",
        "author": "twxtwxtwxtwx",
        "url": "https://www.reddit.com/r/Physics/comments/ywijrx/how_can_potential_energy_be_stored_and_used_in/",
        "text": "In physics we always learn about potential energy and how it exists in earth-object systems, but how does it actually exist in real life, and how can we take advantage of it?",
        "created_utc": 1668569654,
        "upvote_ratio": 1.0
    },
    {
        "title": "Theoretically if you had a pump rated for 20psi you increased atmospheric pressure by 10psi would the pump now only be rated for 10psi or would it still pump to 20psi above atmospheric pressure? I’m thinking of doing an experiment but I would like to discuss it first",
        "author": "GuaranteeUnable2033",
        "url": "https://www.reddit.com/r/Physics/comments/ywihzl/theoretically_if_you_had_a_pump_rated_for_20psi/",
        "text": "",
        "created_utc": 1668569516,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can Someone Help Regarding Starter Books?",
        "author": "silvertrix",
        "url": "https://www.reddit.com/r/Physics/comments/ywh87x/can_someone_help_regarding_starter_books/",
        "text": "Looking for a book with lots mechanical pictures and diagrams of inventions like pulley, waterwheels, seesaws etc. To get me started. I seem to be more interested in practical applications.\n\nAlso looking for some books from around gr.6+? Are there any good all around books that cover gr. 6-12 ontario curriculum? Ive tried asking in one of the threads but havent gotten a response. Would appreciate any help thanks.",
        "created_utc": 1668566042,
        "upvote_ratio": 1.0
    },
    {
        "title": "galera entrem no meu server pls",
        "author": "Fantastic-Brick-9139",
        "url": "https://www.reddit.com/r/Physics/comments/ywdvn4/galera_entrem_no_meu_server_pls/",
        "text": "",
        "created_utc": 1668556888,
        "upvote_ratio": 1.0
    },
    {
        "title": "What is the name of this mechanism?",
        "author": "Remarkable_Mixture77",
        "url": "https://i.redd.it/rzb0sob6l80a1.jpg",
        "text": "",
        "created_utc": 1668553150,
        "upvote_ratio": 1.0
    },
    {
        "title": "Physics question",
        "author": "MaximumAd4825",
        "url": "https://www.reddit.com/r/Physics/comments/ywc8d8/physics_question/",
        "text": "I have a physics problem I can’t solve that’s due tomorrow… it deals with constant acceleration and solving for height. If you can help me out please lmk and I’ll send you the question!!!",
        "created_utc": 1668552774,
        "upvote_ratio": 1.0
    },
    {
        "title": "Improving in Computational Physics",
        "author": "Grogroda",
        "url": "https://www.reddit.com/r/Physics/comments/ywbpdg/improving_in_computational_physics/",
        "text": "So, this questions has already been asked, but the most recent I've seen of this was around 9 years ago, so I think answers might change a lot so I'm going to ask again. Basically I'm a physics grad student, midway through my master's, my area of study is cosmology and I've been constantly using my programming knowledge to work, I only code in Python as of now (though I'm planning on learning C++ starting next month) and honestly that has been enough for now, I've been using modules such as CAMB and Healpix (the python versions) for a while, as well as some of my advisor's codes (in C++), which I usually just need to compile and run, maybe sometimes adapting a few simple lines. I make a few codes just for the purposes of making the simulations according to CAMB, organizing the data, maybe making a few alterations and calculations with the results, and plot the results, but I do like the idea of one day being the type of person who works on making these amazing softwares and making simulations from scratch. I also use Linux (currently using Ubuntu 22.04) and I've recently learned bash scripting to help me automate a few workflows I was trying to do. I've also studied a few numerical methods and a few algorithms (that honestly I mostly don't remember). I've barely learned Git too, but almost nothing about multiprocessing and how to use clusters, for instance (another thing I'm planning to learn in the near future).  \n\n\nDespite all of this, I feel like a noob in computation, and I feel like there is a lot I still have to learn to call myself a computational physicist, and honestly I find it hard to find in the internet some kind of \"roadmap for computational physicists\", so I want to know what you people think I can learn to improve in this way, I know it's a broad question, but honestly I think a broad spectrum of answers will help me get a scope of everything there is to learn, and with some research upon your suggestions, I can think of a roadmap tailored for me. One specific question I want to ask though is if there is a better distro to use, I like Ubuntu but I started with it because it was simple and the most user friendly a few years ago, but now I'm willing to test out new distros if they have a meaningful advantage over Ubuntu (for instance, I'm thinking of changing my personal laptop from an ubuntu+windows 10 dual boot to a Pop!\\_OS single boot, since I basically only use Windows to play a few games).",
        "created_utc": 1668551504,
        "upvote_ratio": 1.0
    },
    {
        "title": "Are we an Electron Type Civilization?",
        "author": "nahigugmakongella777",
        "url": "https://www.reddit.com/r/Physics/comments/yw9gx6/are_we_an_electron_type_civilization/",
        "text": "Hear me out, Among the Elementary Particles we only Harness the Flow of Electrons to a Higher degree that we can't live without it, we use electron to power our Smartphone devices, Appliances,  and even Chemical Reaction rely on the Transfer of Electron, Internet Cannot Run without  Data Center that is Connected through a copper Wire that gets their flow of Electron from Power Station that Acts like a Fountain of Electrons so it keeps the Server Running. My Question is, is it Possible to Harness the Power of other Elementary Particles like Down Quark up Quark if we just have the Right Materials?\nSimilar to how we Transition from fossil fuels to renewable Energy,  but even renewable energy, or Nuclear Energy have the same End goal of Producing Electron and make it flow to a Wire. Can we make other Elementary Particles as an Alternative to Electron? So we can move away from it. Because we are too dependent from it.",
        "created_utc": 1668546175,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is it worth pursuing MSc in Physics at this stage of my life/career?",
        "author": "ConsiderationSame351",
        "url": "https://www.reddit.com/r/Physics/comments/yw8u6z/is_it_worth_pursuing_msc_in_physics_at_this_stage/",
        "text": "My background: I’m 44 years old, married and have 1 kid. And don’t have so strong schooling foundation, my schooling was done in local low grade school. Could barely understand anything in my first year of collage, just passed the first year. From that, completed my undergraduate degree in mathematics major, completed masters in computer science and currently working in the biotech industry in Technology strategic team. Total 18+ years in software engineering. Pretty average happy life. \n\nOver the last couple of years, I couldn’t stop reading physics books/literature/lectures from great physics minds from last few centuries. And strongly thinking of going for MSc in physics. I will plan to take general and physics GRE. \n\nDo you think is it worth at this stage of my life?",
        "created_utc": 1668544691,
        "upvote_ratio": 1.0
    },
    {
        "title": "Styrofoam Crane",
        "author": "Dependent_Help_7861",
        "url": "https://www.reddit.com/r/Physics/comments/yw8thd/styrofoam_crane/",
        "text": "[removed]",
        "created_utc": 1668544645,
        "upvote_ratio": 1.0
    },
    {
        "title": "Acceleration up to over two million g's",
        "author": "Pablo42088",
        "url": "https://www.youtube.com/watch?v=kM1RIdsEv7s",
        "text": "",
        "created_utc": 1668543023,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can someone explain the physics behind this?",
        "author": "JoeDiBou",
        "url": "https://v.redd.it/pzx8vwtaz50a1",
        "text": "",
        "created_utc": 1668539592,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is this true? Something from nothing",
        "author": "SahilGhosh111",
        "url": "https://www.reddit.com/r/Physics/comments/yw6e0n/is_this_true_something_from_nothing/",
        "text": "https://bgr.com/science/scientists-create-matter-from-nothing-in-groundbreaking-experiment/ ?",
        "created_utc": 1668538932,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can someone help, I know newtons laws but can’t visualize them like these questions",
        "author": "Preparation_Negative",
        "url": "https://i.redd.it/2benvhkkl50a1.jpg",
        "text": "",
        "created_utc": 1668535066,
        "upvote_ratio": 1.0
    },
    {
        "title": "Bending spacetime with electromagnetism",
        "author": "maka89",
        "url": "https://www.reddit.com/r/Physics/comments/yw0ja5/bending_spacetime_with_electromagnetism/",
        "text": "Hi, \n\nPhysicist here. After watching some shady docs on Netflix I have some \"that-guy\" questions that is a bit too theoretical for my \"paygrade\"...\n\n\\- Is it possible to \"cancel\" gravity with electromagnetism? If you assume a schwarzchild metric as the default, could you make a region where the metric in the r-direction is flat/constant?  \n\n\n\\- How would you configure the EM field? what would be the directions of the E and B fields?  \n\n\n\\- How many MegaWatts would be required ? (assuming earth mass and radius)\n\n\\- If you were able to genereate this field , could you use it to \"propell\" yourself? seemingly breaking newtons third law (but requiring vast amounts of energy)?",
        "created_utc": 1668526537,
        "upvote_ratio": 1.0
    },
    {
        "title": "physics constants graphs",
        "author": "Interesting-Canary82",
        "url": "https://www.reddit.com/r/Physics/comments/yw0i8q/physics_constants_graphs/",
        "text": "Hello, I have kind of a tricky question I was hoping someone could help me with.  I'm trying to graph (wt\\^2) vs (cosθ) however I have 3 other  variables with unknown variables: K,  *γ  and* β. I'm wondering how I would be able to graph the function with each constant taken into consideration.  Essentially im trying to graph multiple graph which each variable taken into consideration so I can mesh them into one final graph at the end. Issue is, I'm not sure how to do that witch  this equation. Any help would be greatly appreciated.\n\n&amp;#x200B;\n\nwt = terminal angular velocity\n\n&amp;#x200B;\n\nwt\\^2 = (k)/(*γ+*βcosθ)",
        "created_utc": 1668526486,
        "upvote_ratio": 1.0
    },
    {
        "title": "Physics Questions - Weekly Discussion Thread - November 15, 2022",
        "author": "AutoModerator",
        "url": "https://www.reddit.com/r/Physics/comments/yvy1j4/physics_questions_weekly_discussion_thread/",
        "text": "This thread is a dedicated thread for you to ask and answer questions about concepts in physics.\n\nHomework problems or specific calculations may be removed by the moderators. We ask that you post these in /r/AskPhysics or /r/HomeworkHelp instead.\n\nIf you find your question isn't answered here, or cannot wait for the next thread, please also try /r/AskScience and /r/AskPhysics.",
        "created_utc": 1668520812,
        "upvote_ratio": 1.0
    },
    {
        "title": "I need a hand with a project. Light fraction and layering/mixing",
        "author": "Apricity_and_Hiraeth",
        "url": "https://www.reddit.com/r/Physics/comments/yvw7wp/i_need_a_hand_with_a_project_light_fraction_and/",
        "text": "Hello, I'm an art student in my second year. I have a problem and I need help with its execution. \nI'm basic with the laws of physics and light fractions. The idea is that I need to create three images that when layered on top of one another create one piece. I was thinking of using glass and painting on the desired image, the problem is that one of the outcomes I hope for is that when one layer is removed, the other two make a new, distinct image. Sort of animation, like onion skins. Would that be possible? \n\nMy initial idea was that it would work sort of like layering colors onto one another to create movement, as 3d movie glasses do. Is this even possible or will I need to create something else? \n\nThank you in advance for the help.",
        "created_utc": 1668516437,
        "upvote_ratio": 1.0
    },
    {
        "title": "Experimental Value For Boiling Water.",
        "author": "Kozaary",
        "url": "https://www.reddit.com/r/Physics/comments/yvw2ah/experimental_value_for_boiling_water/",
        "text": " Dear Math Redditors! I am trying to create an expected value formula for how long a certain amount of water will take to boil in a metal saucepan. I did an experiment and found that 500 mL of water (500 g) in a 506g pan took around 241 s to boil on my gas stove. I am trying to create the expected value formula using the equation Pt=mc(Tf-Ti). The power is 3611 W (converted from 13 MJ/h which was on the spec sheet for my gas stovetop), mass is 1006 g (506 g for the pan plus 500 g for the water), c is 0.466 J g\\^-1 K\\^-1 (from wikipedia), and change in temperature is 74 c from 100 c - 26 c. When I solve for time I get 9.61 s, when in my experiment it was found to be around 241. What am I doing wrong? Please note this calculation is then multiplied by 0.4 as that is the usual efficiency of a gas stovetop. Thank you for your help.",
        "created_utc": 1668516049,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can particles emerge from fluid/wave dynamics?",
        "author": "Dotrez",
        "url": "https://www.reddit.com/r/Physics/comments/yvuuun/can_particles_emerge_from_fluidwave_dynamics/",
        "text": "Can particles emerge from fluid/wave dynamics?\n\nFor example this paper claims that vortices resembling particles emerge from superfluid dark energy substance.",
        "created_utc": 1668512856,
        "upvote_ratio": 1.0
    },
    {
        "title": "Got this shirt at the mall yesterday! Y'all like it?",
        "author": "Wonderffg",
        "url": "https://i.redd.it/227rfctnd30a1.jpg",
        "text": "",
        "created_utc": 1668508111,
        "upvote_ratio": 1.0
    },
    {
        "title": "Neighbor Play: High Frequency Sound at Night? Is this 8000hz sustained? Is the decibels appropriate for me to hear or did I develop tinnitus? Help",
        "author": "Weekly_Swordfish4433",
        "url": "https://v.redd.it/b1c8qrp7c30a1",
        "text": "",
        "created_utc": 1668507612,
        "upvote_ratio": 1.0
    },
    {
        "title": "best bachelor programs for theoretical physics in Germany",
        "author": "ARALEZZ",
        "url": "https://www.reddit.com/r/Physics/comments/yvrke3/best_bachelor_programs_for_theoretical_physics_in/",
        "text": "I'm studying physics in Armenia(currently 3-rd semester) and what to continue my study process abroad.Im looking for universities in Germany , what universities can u advice me?",
        "created_utc": 1668503065,
        "upvote_ratio": 1.0
    },
    {
        "title": "Cleaning our schools physics department. does anyone know what the heck this is? Best regards!",
        "author": "SomeDudeFlynn",
        "url": "https://i.redd.it/1wfbldso940a1.jpg",
        "text": "",
        "created_utc": 1668500859,
        "upvote_ratio": 1.0
    },
    {
        "title": "3 Poorly Conceived Questions about Photons and Gravity.",
        "author": "EternalAutist",
        "url": "https://www.reddit.com/r/Physics/comments/yvps0w/3_poorly_conceived_questions_about_photons_and/",
        "text": "I have a few questions I haven't been able to find answers to. Feel free to give me a rough time! I know this is gonna be rough for actual physicists to read but I was hoping to learn a few things by asking!\n\n&amp;#x200B;\n\n1\\\\The first, is a photon a surface of a sphere that expands/propagates stepwise in planck units of time from its source and seeks out a quantum state in the EM field that allows it to be absorbed? The surface is like a multi colored bubble. One side could be blue shifted and deformed as it passes by massive objects while another area might be red shifted and unperterbed by massive objects.(I'm imagining it would be a closed surface which seems pixelated, every pixel a quantum state. Every tick it gets bigger, so more complex, so it loses energy in some way?) This is probably crazy talk. Next question...\n\n&amp;#x200B;\n\n2\\\\What would happen to a photon if the universe kept expanding until its cosmic horizon was the same size as its wavelength? Pretty simple question?\n\n&amp;#x200B;\n\n3\\\\Third, are Modified Newtonian gravity theories basically theories where there is an intrinsic gravitational curvature to spacetime \"baked\" into the universe in the same way that mass/energy densities were quantum fluctuations frozen in the Inflaton Field? Intrinsic gravity meaning 'spacetime curvature that is not caused by mass/energy'. Extrinsic gravity would be all of the curvature due to mass/energy? Voids would be divergences in the structure (like a zero point, not nessessarily like a white hole or something with anti gravity, but just low or no intrinsic curvature), and the pockets with higher curvature is where all of the galaxies formed and mostly stay (except when they collide and jump out like the bullet cluster).\n\n&amp;#x200B;\n\nSorry if these are half baked ideas. Just been mulling them over a while and have no idea how to find anything in xarchives. Any hints or articles are appreciated!",
        "created_utc": 1668496389,
        "upvote_ratio": 1.0
    },
    {
        "title": "Physics and relationships",
        "author": "mismaree",
        "url": "https://www.reddit.com/r/Physics/comments/yvnw2d/physics_and_relationships/",
        "text": "[removed]",
        "created_utc": 1668489913,
        "upvote_ratio": 1.0
    },
    {
        "title": "Aspiring theoretical physicist.",
        "author": "Space-guy_",
        "url": "https://www.reddit.com/r/Physics/comments/yvndb3/aspiring_theoretical_physicist/",
        "text": "[removed]",
        "created_utc": 1668488330,
        "upvote_ratio": 1.0
    },
    {
        "title": "Has finasteride (propecia) affected your ability to do physics well?",
        "author": "faithforever5",
        "url": "https://www.reddit.com/r/Physics/comments/yvm7iq/has_finasteride_propecia_affected_your_ability_to/",
        "text": "This is what I'm afraid of...",
        "created_utc": 1668484840,
        "upvote_ratio": 1.0
    },
    {
        "title": "How much “weight” do you gain in terminal velocity",
        "author": "tombom789",
        "url": "https://www.reddit.com/r/Physics/comments/yvm5fk/how_much_weight_do_you_gain_in_terminal_velocity/",
        "text": "I know your weight remains unchanged in a literal sense, but a 200lb man moving 20 mph would hit a hell of a lot harder than one moving 5mph. I’m nothing of a physics genius which is why I’m here.\n\nMy real question, and I know this sounds really stupid, but how high of a fall could a person survive if they simply landed in a push up or squat position? How much weight could their bodies absorb depending on the speed they’re falling.",
        "created_utc": 1668484692,
        "upvote_ratio": 1.0
    },
    {
        "title": "Anyone know what formula this calculator is using?",
        "author": "avatarAttr",
        "url": "https://www.reddit.com/r/Physics/comments/yvjjyw/anyone_know_what_formula_this_calculator_is_using/",
        "text": "[https://www.progressiveautomations.com/pages/calculator](https://www.progressiveautomations.com/pages/calculator)\n\nI want to understand how it's able to figure out where the mounting positions are.",
        "created_utc": 1668477424,
        "upvote_ratio": 1.0
    },
    {
        "title": "Arrived the mail few days ago",
        "author": "PreviousSurprissd",
        "url": "https://i.redd.it/m4550rx9e00a1.jpg",
        "text": "",
        "created_utc": 1668471979,
        "upvote_ratio": 1.0
    },
    {
        "title": "would it be possible to discover a new energy on earth as important as the discovery of electricity?",
        "author": "mikehouard",
        "url": "https://www.reddit.com/r/Physics/comments/yvh84e/would_it_be_possible_to_discover_a_new_energy_on/",
        "text": "",
        "created_utc": 1668471105,
        "upvote_ratio": 1.0
    },
    {
        "title": "nice work?",
        "author": "nitinkyutech",
        "url": "https://www.reddit.com/r/Physics/comments/yvh0fv/nice_work/",
        "text": "[removed]",
        "created_utc": 1668470551,
        "upvote_ratio": 1.0
    },
    {
        "title": "Testing Outlet with Multimeter",
        "author": "arkie87",
        "url": "https://www.reddit.com/r/Physics/comments/yvgzy7/testing_outlet_with_multimeter/",
        "text": "I've seen in a few places (e.g. [https://youtu.be/kH2Rbh\\_m6rM?t=105](https://youtu.be/kH2Rbh_m6rM?t=108)) that when testing an outlet with a multimeter, one should always plug in the neutral wire first, since if done in reverse, the neutral probe would become energized to 120V and could shock you.\n\nHowever, it seems to me that while the voltage is 120V, the output impedance due to current traveling through the multimeter would be huge, so you would be safe, but might receive a small shock depending on the capacitance between the multimeter and the probe. Is that true, or am I missing something?",
        "created_utc": 1668470515,
        "upvote_ratio": 1.0
    },
    {
        "title": "I don’t fully understand time dilation",
        "author": "shwillybilly",
        "url": "https://www.reddit.com/r/Physics/comments/yvgqvy/i_dont_fully_understand_time_dilation/",
        "text": "I understand in practice if you go fast time moves slower for you than the people observing you. Or at least I think that’s how it works, but lets say I watch you travel from earth to mars at 99.99% the speed of light. It should take you about 3 minutes to get there, so in 3 minutes I know you should be on mars. I saw a video saying that 3 minutes would pass for the person traveling but 187000 yrs would pass on earth. So how is it possible that on earth from my point of view in 186000 years you haven’t got to mars even though it should have taken only 3 minutes for you to get there",
        "created_utc": 1668469864,
        "upvote_ratio": 1.0
    },
    {
        "title": "How come electrons can create light and light can create electrons but they are too different things",
        "author": "Decent_Preference_95",
        "url": "https://www.reddit.com/r/Physics/comments/yvf6ur/how_come_electrons_can_create_light_and_light_can/",
        "text": "",
        "created_utc": 1668465990,
        "upvote_ratio": 1.0
    },
    {
        "title": "High-Temperature Superconductors Finally Understood",
        "author": "ScienceDiscussed",
        "url": "https://youtu.be/JzoUlidjm3c",
        "text": "",
        "created_utc": 1668463771,
        "upvote_ratio": 1.0
    },
    {
        "title": "If light has no mass, why is it affected by gravity?",
        "author": "LifeisALove",
        "url": "https://www.reddit.com/r/Physics/comments/yvcu4z/if_light_has_no_mass_why_is_it_affected_by_gravity/",
        "text": "",
        "created_utc": 1668460445,
        "upvote_ratio": 1.0
    },
    {
        "title": "what would happen?",
        "author": "MPtoast",
        "url": "https://i.redd.it/1lm89o0o9zz91.png",
        "text": "",
        "created_utc": 1668458335,
        "upvote_ratio": 1.0
    },
    {
        "title": "Created my first discrete fourier transform programme in excel!",
        "author": "DntDlteSandals",
        "url": "https://www.reddit.com/gallery/yvbu9e",
        "text": "",
        "created_utc": 1668458172,
        "upvote_ratio": 1.0
    },
    {
        "title": "The perfect mug doesn't exist-",
        "author": "PastObligatiog",
        "url": "https://i.redd.it/9ajd0gbf6zz91.jpg",
        "text": "",
        "created_utc": 1668457252,
        "upvote_ratio": 1.0
    },
    {
        "title": "Refraction of light",
        "author": "HaurentiuFer",
        "url": "https://www.reddit.com/r/Physics/comments/yv9s1f/refraction_of_light/",
        "text": "Can anyone explain me în how incident, refracted ray and normal are în the same plan în snell's first law? \n\nI imagine how normal and incident ray are în the same plan but refracted ray passted the incident point from air to water let's say..",
        "created_utc": 1668453951,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to pass college Physics 1",
        "author": "Dasiy200021",
        "url": "https://www.reddit.com/r/Physics/comments/yv9q49/how_to_pass_college_physics_1/",
        "text": "I have been chronically sick and have been unable to meet the demands of my physics course. I am starting to feel a little better and my physics professor is giving me a month to make up everything (which I am grateful for). I have my unit test 1 exam next Tuesday but I am afraid I am going to fail. What are some study tips that I could use to help me get through this? I’m trying my best regardless of my circumstances. Anyone have a good reference sheet that I can use? I’ve been trying to study but I’m having trouble with the concepts. I have also tried YouTube videos. Anything helps! Thanks.",
        "created_utc": 1668453848,
        "upvote_ratio": 1.0
    },
    {
        "title": "Conjugation between pupil planes of O1 and O2!",
        "author": "Amir-Rahmani",
        "url": "https://www.reddit.com/r/Physics/comments/yv9gqn/conjugation_between_pupil_planes_of_o1_and_o2/",
        "text": "A wide-filed fluorescence microscopy detection path consists of a primary objective lens (O1) and a tube lens (TL1). In OPM, a de-magnifying optical system consisting of a tube lens (TL2) and a secondary objective lens (O2) is used to produce an intermediate image plane. TL1 and TL2 can be set up to form a relay pair. O1 &amp; O2 make a 4f system. In order to have an aberration-free intermediate image at the front focal space of the O2, the back focal planes (BFP) of both objective lenses should be conjugated. \n\nTo verify this conjugation, the \"beam wobble\" method was suggested by Sapoznik et al. By sending a sinusoidal signal to the galvo and adjusting the axial position of the objective lens until the outcoming beam in the front focal space of O1 is stationary. When both objective lenses are conjugated to the galvo, they're conjugated to each other. See appendix 4 in \\[1\\] for detailed information on the method. \n\nIn the DaXi paper, Yang et al, use the same approach to conjugate the galvo to the BFP of the O1. After having this conjugation, they try to image a calibration grid onto the camera using a white light source. For the next step, they suggest \"moving O3 200 μm away/closer to O2, then measuring the magnification of the system with the grid. The goal is to have the same magnification regardless of the relative position of O3 to O2. Move O2 and O3 together axially until at one point the magnification is uniform. The pupil plane of O2 is then conjugate to that of O1\" \\[2\\]. See Supplementary information/Supplementary Note 2/ Detailed alignment procedure/ in \\[2\\]. \n\n**Questions:**\n\n1. Does this method work for a Scandreas-based OPM? \n2. Among these two procedures, which one do you recommend? \n3. How do you make sure of the conjugation without having a galvo? \n4. Can someone follow the procedure explained in \\[2\\] directly for the tilted version? \n\nReferences:\n\n1. [Sapoznik et al, A versatile oblique plane microscope for large-scale and high-resolution imaging of subcellular dynamics | eLife | 2021](https://doi.org/10.7554/eLife.57681)\n2. [Yang et al, DaXi—high-resolution, large imaging volume and multi-view single-objective light-sheet microscopy | Nature Methods | 2022](https://www.nature.com/articles/s41592-022-01417-2)",
        "created_utc": 1668453295,
        "upvote_ratio": 1.0
    },
    {
        "title": "A letter to theoretical high energy physics PhD students on career prospects",
        "author": "kzhou7",
        "url": "https://guangyuxu.com/assets/pdfs/NOTE-2022-1105-1431.pdf",
        "text": "",
        "created_utc": 1668452503,
        "upvote_ratio": 1.0
    },
    {
        "title": "Our Universe is Not Locally Real",
        "author": "Lord_Mithras",
        "url": "https://youtu.be/OvVNpEY41n8",
        "text": "",
        "created_utc": 1668451943,
        "upvote_ratio": 1.0
    },
    {
        "title": "Physics homework help &gt;.&lt;",
        "author": "ButterflyRadiant8299",
        "url": "https://www.reddit.com/r/Physics/comments/yv75w9/physics_homework_help/",
        "text": "[removed]",
        "created_utc": 1668448609,
        "upvote_ratio": 1.0
    },
    {
        "title": "Need help with this step",
        "author": "North-Top-595",
        "url": "https://i.redd.it/vhmgd9zdbyz91.jpg",
        "text": "",
        "created_utc": 1668446788,
        "upvote_ratio": 1.0
    },
    {
        "title": "The Mathematics of Burger Flipping and the Optimization of Cooking Times - An Interview with Dr. Jean-Luc Thiffeault",
        "author": "redhairinthesun",
        "url": "https://youtu.be/2W-lnmDmPl0",
        "text": "",
        "created_utc": 1668445714,
        "upvote_ratio": 1.0
    },
    {
        "title": "Interesting website with TOE",
        "author": "Tomdraug",
        "url": "https://theoryofeverything.info",
        "text": "",
        "created_utc": 1668444824,
        "upvote_ratio": 1.0
    },
    {
        "title": "Space blob...",
        "author": "Particular_You3818",
        "url": "https://www.reddit.com/r/Physics/comments/yv4ht4/space_blob/",
        "text": "[removed]",
        "created_utc": 1668443333,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is temperature relative ?",
        "author": "gkl1201",
        "url": "https://www.reddit.com/r/Physics/comments/yv4e4t/is_temperature_relative/",
        "text": "As temperature is the measure of kinetic energy of the atoms in a body, will the measured temperature change when an observer and the body is in a vibrating system and to a second external observer ?",
        "created_utc": 1668443121,
        "upvote_ratio": 1.0
    },
    {
        "title": "References for Computational Quantum Physics",
        "author": "alienated_stardust",
        "url": "https://www.reddit.com/r/Physics/comments/yv4cux/references_for_computational_quantum_physics/",
        "text": "[removed]",
        "created_utc": 1668443059,
        "upvote_ratio": 1.0
    },
    {
        "title": "Never thought I could be so captivated and astonished by the double slit experiment again. I first heard about over 20 years ago and watched many iterations since but this felt so fresh and new! Looking Glass Universe video.",
        "author": "iCANNcu",
        "url": "https://www.youtube.com/watch?v=v_uBaBuarEM",
        "text": "",
        "created_utc": 1668443024,
        "upvote_ratio": 1.0
    },
    {
        "title": "Gyroscopic Precession of a Bike Wheel",
        "author": "Zealousideal-Link-24",
        "url": "https://www.reddit.com/r/Physics/comments/yv3kmy/gyroscopic_precession_of_a_bike_wheel/",
        "text": "https://youtu.be/ayjC1E3lNKc\n\nIn the gyroscopic precession of a bike wheel, what is the force on the wheel’s axle that acts against the weight of the wheel for net torque to be zero? \n\nWhen just considering the axle itself: before spinning the wheel, the tension of the string pulls up and the weight pulls down resulting in a net torque. What changes?",
        "created_utc": 1668441490,
        "upvote_ratio": 1.0
    },
    {
        "title": "Cinematic Musical Philosophical Theater,\"Socrates\"The Wisest Humans Admi...",
        "author": "Ok_Pop7586",
        "url": "https://youtube.com/watch?v=v7qONXSlOgs&amp;feature=share",
        "text": "",
        "created_utc": 1668440166,
        "upvote_ratio": 1.0
    },
    {
        "title": "Webinar today (Mon, Nov 14) on Nuclear Weapons Treaties",
        "author": "tonyfleming",
        "url": "https://www.reddit.com/r/Physics/comments/yv20n5/webinar_today_mon_nov_14_on_nuclear_weapons/",
        "text": "Webinar today (Monday, Nov 14) on \"New Developments in International Treaties on Nuclear Weapons: the Nuclear Nonproliferation Treaty and the Treaty on the Prohibition of Nuclear Weapons\"\n\nmore details at [https://physicistscoalition.org/events/npt-tpnw-webinar/](https://physicistscoalition.org/events/npt-tpnw-webinar/)",
        "created_utc": 1668438271,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is it possible to make analog-style computers purely based on photons?",
        "author": "NomadAvian",
        "url": "https://www.reddit.com/r/Physics/comments/yv1gtn/is_it_possible_to_make_analogstyle_computers/",
        "text": "I was wondering, what properties of photons could be used to complete optical computations like analog computers. Obviously, digital signals are easy to communicate. But analog computers use magnitude of voltage for computations, also utilizing the relation between ampere, voltage and resistance for multiplication. Could photons be used this way with, lets say, wavelength conveying some information and interference patterns serving some sort of additive function? Has anything similar been done before?",
        "created_utc": 1668437109,
        "upvote_ratio": 1.0
    },
    {
        "title": "Regenerative breaking",
        "author": "Kopikitkat",
        "url": "https://www.reddit.com/r/Physics/comments/yv0isw/regenerative_breaking/",
        "text": "So, a kinda complicated and long winded question, however me and my friend have decided to try and theoretically build an iron man suit, and I thought about applying the concept of regenerative breaking to grant excess power to the suit, is there a concept within theoretical science that would accommodate our needs? Or w concept that would work? (I’m a sixteen year old who passed physics with a six, so any simplification would be appreciated)",
        "created_utc": 1668435047,
        "upvote_ratio": 1.0
    },
    {
        "title": "What are you working on? - Weekly Discussion Thread - November 14, 2022",
        "author": "AutoModerator",
        "url": "https://www.reddit.com/r/Physics/comments/yv07w7/what_are_you_working_on_weekly_discussion_thread/",
        "text": "Hello /r/Physics.\n\nIt's everyone's favorite day of the week, again. Time to share (or rant about) how your research/work/studying is going and what you're working on this week.",
        "created_utc": 1668434409,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is it worth pursuing?",
        "author": "No_Most_7008",
        "url": "https://www.reddit.com/r/Physics/comments/yuyuqw/is_it_worth_pursuing/",
        "text": "My grades for it aren’t the best but I still really like it. Is it worth continuing physics?",
        "created_utc": 1668431229,
        "upvote_ratio": 1.0
    },
    {
        "title": "A new paper on carnivorous plants-inspired shape-morphing slippery surfaces, fabricated via femtosecond laser direct writing",
        "author": "Badatu",
        "url": "https://www.oejournal.org/article/doi/10.29026/oea.2023.210163",
        "text": "",
        "created_utc": 1668429487,
        "upvote_ratio": 1.0
    },
    {
        "title": "Dark Photons Could help Solve a Grand Challenge Facing Modern Physics",
        "author": "Wanda-Fleker",
        "url": "https://www.guardianmag.us/2022/11/dark-photons-could-help-solve-grand.html",
        "text": "",
        "created_utc": 1668422224,
        "upvote_ratio": 1.0
    },
    {
        "title": "I can't really describe how much I love it!!",
        "author": "BeneficiaYT",
        "url": "https://i.redd.it/enrpry3yyvz91.jpg",
        "text": "",
        "created_utc": 1668418432,
        "upvote_ratio": 1.0
    },
    {
        "title": "MIDTERMS",
        "author": "franks12345678",
        "url": "https://www.reddit.com/r/Physics/comments/yurq11/midterms/",
        "text": "[removed]",
        "created_utc": 1668409915,
        "upvote_ratio": 1.0
    },
    {
        "title": "High-temperature superconductivity",
        "author": "BodiesSafeToShore",
        "url": "https://www.reddit.com/r/Physics/comments/yupq57/hightemperature_superconductivity/",
        "text": "Quick question, why are materials in question for researches in High-temperature superconductivity have absurd molecular formulas such as  YBa2Cu3O7−*x?*",
        "created_utc": 1668403058,
        "upvote_ratio": 1.0
    },
    {
        "title": "The devil possessed my sausage.",
        "author": "kingdizzle",
        "url": "https://v.redd.it/qfy7zul9nuz91",
        "text": "",
        "created_utc": 1668402360,
        "upvote_ratio": 1.0
    },
    {
        "title": "Question about a video",
        "author": "SGKXLNP",
        "url": "https://www.reddit.com/r/Physics/comments/yuoybf/question_about_a_video/",
        "text": "[removed]",
        "created_utc": 1668400561,
        "upvote_ratio": 1.0
    },
    {
        "title": "Question about a video",
        "author": "SGKXLNP",
        "url": "https://www.reddit.com/r/Physics/comments/yunn9l/question_about_a_video/",
        "text": "[removed]",
        "created_utc": 1668396618,
        "upvote_ratio": 1.0
    },
    {
        "title": "What do you do when you can't reach the pivot?...",
        "author": "deadmoby5",
        "url": "https://www.reddit.com/r/Physics/comments/yunegs/what_do_you_do_when_you_cant_reach_the_pivot/",
        "text": "You hang on a moment...",
        "created_utc": 1668395919,
        "upvote_ratio": 1.0
    },
    {
        "title": "A Brain-Inspired Chip Can Run AI With Far Less Energy | Quanta Magazine",
        "author": "carbonqubit",
        "url": "https://www.quantamagazine.org/a-brain-inspired-chip-can-run-ai-with-far-less-energy-20221110/",
        "text": "",
        "created_utc": 1668394723,
        "upvote_ratio": 1.0
    },
    {
        "title": "Chandelier Spin help",
        "author": "RainbowSprinkles124",
        "url": "https://www.reddit.com/gallery/yumqan",
        "text": "",
        "created_utc": 1668393971,
        "upvote_ratio": 1.0
    },
    {
        "title": "the relation of QM &amp; GR for photon. https://t.co/QQDE3WpISs",
        "author": "omo11onyiro",
        "url": "https://www.reddit.com/r/Physics/comments/yulmw9/the_relation_of_qm_gr_for_photon/",
        "text": "",
        "created_utc": 1668390912,
        "upvote_ratio": 1.0
    },
    {
        "title": "can someone please solve this?",
        "author": "To_Hi_2_Try",
        "url": "https://i.redd.it/44als11gftz91.jpg",
        "text": "",
        "created_utc": 1668387619,
        "upvote_ratio": 1.0
    },
    {
        "title": "Pull-up bars not being used for their intended purpose",
        "author": "Otherwise-Art6031",
        "url": "https://www.reddit.com/r/Physics/comments/yujnv4/pullup_bars_not_being_used_for_their_intended/",
        "text": "So, an old friend of mine committed suicide by hanging himself from a pull-up bar. I was just wondering how the doorframe didn't break or the pull-up bar didn't fall. \\*I assume my friend weighed about 220 pounds, he was a big guy may he rest in peace. I'm just curious about the whole science of the process.",
        "created_utc": 1668385381,
        "upvote_ratio": 1.0
    },
    {
        "title": "If an atomic explosion could somehow be contained in an area the size if a living room... what would that room be like after a minute, hour, week etc...?",
        "author": "NewMusicSucks2",
        "url": "https://www.reddit.com/r/Physics/comments/yujivo/if_an_atomic_explosion_could_somehow_be_contained/",
        "text": "[removed]",
        "created_utc": 1668384998,
        "upvote_ratio": 1.0
    },
    {
        "title": "Practical application of wetting angle: Figuring out if your glasses is coated or not!",
        "author": "BERMJS-5",
        "url": "https://youtu.be/LR9hNtRmmiI?t=86",
        "text": "",
        "created_utc": 1668378231,
        "upvote_ratio": 1.0
    },
    {
        "title": "Rotational kinetic Energy",
        "author": "AccomplishedLet9884",
        "url": "https://www.reddit.com/r/Physics/comments/yues8v/rotational_kinetic_energy/",
        "text": "So I'm doing an essay on how PSI affects the velocity of the ball and in doing research on finding equations for velocity of a soccer ball I get multiple similar equations but different fractions because the moment of inertia is different for different rotating objects. My question is is a ball more like a hoop or a disc? I was thinking it was more like a hoop because most of the mass is on the outer shell rather than a disc which has all its mass distributed evenly",
        "created_utc": 1668374665,
        "upvote_ratio": 1.0
    },
    {
        "title": "can someone help? how do I get 2.4 cm from this?",
        "author": "itdoesntmatterfor5",
        "url": "https://i.redd.it/hft1idguttz91.jpg",
        "text": "",
        "created_utc": 1668374467,
        "upvote_ratio": 1.0
    },
    {
        "title": "Experimental Breeder Reactor 1 Core Disassembly After EBR-1 Nuclear Reactor Meltdown",
        "author": "Moon-dog44",
        "url": "https://youtube.com/watch?v=eLsD9XZEjEk&amp;feature=share",
        "text": "",
        "created_utc": 1668373584,
        "upvote_ratio": 1.0
    },
    {
        "title": "why do electrons produce magnetism when they move?",
        "author": "im_in_your_walls_0",
        "url": "https://www.reddit.com/r/Physics/comments/yudsng/why_do_electrons_produce_magnetism_when_they_move/",
        "text": "I apologize if this question is not allowed on this subreddit. I have had this question ever since i studied electromagnets and magnetism, and i have ways had one question: Why? Why do electrons produce magnetism? Why do MAGNETS produce a magnetic field? What is the reason? I have searched a lot, online, but all the sites only state that the movement of electrons produce magnetism, never WHY  they do so. Please someone help",
        "created_utc": 1668372704,
        "upvote_ratio": 1.0
    },
    {
        "title": "can anybody solve #4 for me?",
        "author": "To_Hi_2_Try",
        "url": "https://i.redd.it/gzsx09q03sz91.jpg",
        "text": "",
        "created_utc": 1668371333,
        "upvote_ratio": 1.0
    },
    {
        "title": "Chirped Pulse Amplification for Arc Lamp",
        "author": "subjectivity_one",
        "url": "https://www.reddit.com/r/Physics/comments/yuc4j0/chirped_pulse_amplification_for_arc_lamp/",
        "text": "Is there any reason why CPA cannot somehow be configured with incoherent light sources like an arc lamp or flash lamp? If so, what type of setup would you need to mimic a CPA laser configuration in order to generate extremely high amplitude waves (e.g. terrawatts per picosecond) in the form of a \"spotlight\" beam, possibly with a 179 degree wide angle, rather than a highly focused laser beam like a CPA laser? New geometries of oscillators, amplifiers, diffraction gratings, etc?\n\nI would also like to understand if it is possible to tune the emission to non-ionizing wavelengths outside of the visible spectrum yet powerful enough to briefly align/orient polar molecules (like H2O in a cloud) at a great distance (10km), all without the transfer of heat/work to the polar molecule.\n\nI had this idea after reading this article: https://www.sciencedirect.com/science/article/abs/pii/S1386142521002390\n\nThanks in advance!",
        "created_utc": 1668369330,
        "upvote_ratio": 1.0
    },
    {
        "title": "Zapping tiny metal drops with sound creates wires for soft electronics",
        "author": "Galileos_grandson",
        "url": "https://www.sciencenews.org/article/metal-sound-flexible-electronics",
        "text": "",
        "created_utc": 1668360494,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does all acceleration warp spacetime?",
        "author": "NathanielRoosevelt",
        "url": "https://www.reddit.com/r/Physics/comments/yu7wxo/does_all_acceleration_warp_spacetime/",
        "text": "I was under the impression that because of the equivalence principle that basic acceleration and centrifugal acceleration warped spacetime from the frame of reference of an observer experiencing that acceleration in the same why that gravity does. Is this line of reasoning wrong? I spent a ton of time looking through as much as I could online but there doesn’t really seem to be anyone other than random people on quora talking about it.",
        "created_utc": 1668360114,
        "upvote_ratio": 1.0
    },
    {
        "title": "Please can I have help with my homework I don’t understand it",
        "author": "LukeAv2009",
        "url": "https://i.redd.it/uzozxq7srqz91.jpg",
        "text": "",
        "created_utc": 1668355447,
        "upvote_ratio": 1.0
    },
    {
        "title": "Today, I noticed a very strange phenomenon and I don't understand how it works. basically, there was a circle shape of casted light even though I couldn't find any circular light source.does anyone know what this is called?",
        "author": "wweater",
        "url": "https://www.reddit.com/gallery/yu5apz",
        "text": "",
        "created_utc": 1668354354,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to solve this ? Wouldnt the acceleration = G when the 5 kg is released?",
        "author": "yungsohaib",
        "url": "https://i.redd.it/d2gwoqba8qz91.jpg",
        "text": "",
        "created_utc": 1668348894,
        "upvote_ratio": 1.0
    },
    {
        "title": "Everything we now know about the Milky Way’s supermassive black hole",
        "author": "tellusomeday",
        "url": "https://link.medium.com/HEpI3xmlVub",
        "text": "",
        "created_utc": 1668348761,
        "upvote_ratio": 1.0
    },
    {
        "title": "Can someone explain how virtual images work",
        "author": "Dismal-Negotiation-5",
        "url": "https://www.reddit.com/r/Physics/comments/yu18mz/can_someone_explain_how_virtual_images_work/",
        "text": "",
        "created_utc": 1668344984,
        "upvote_ratio": 1.0
    },
    {
        "title": "Angular Momentum.",
        "author": "Haunting_Job7374",
        "url": "https://www.reddit.com/r/Physics/comments/yu18h5/angular_momentum/",
        "text": "There's a famous experiment on angular Momentum which is hand in and hand out but does that mean the radius is inversely proportional to the angular momentum because when you expand you're hands while spinning the rate of momentum gets lower and by doing that you're expanding the radius. \n\nAnd do my question actually makes sense?",
        "created_utc": 1668344973,
        "upvote_ratio": 1.0
    },
    {
        "title": "Best Books for Advances Quantum Mechanic?",
        "author": "Spin_Force_9907",
        "url": "https://www.reddit.com/r/AskPhysics/comments/yu0k8g/best_books_for_advanced_quantum_mechanics/?utm_source=share&amp;utm_medium=web2x&amp;context=3",
        "text": "",
        "created_utc": 1668343337,
        "upvote_ratio": 1.0
    },
    {
        "title": "Matter-Antimatter Annihilation of different size atoms",
        "author": "Hyperion5634",
        "url": "https://www.reddit.com/r/Physics/comments/yu079l/matterantimatter_annihilation_of_different_size/",
        "text": "When I've heard about Annihilation, I've only heard of it occurring between atoms of the same size (IE Hydrogen and Anti-Hydrogen). Would both atoms still be annihilated if perhaps there was an anti-hydrogen and a Neon atom?   \n\n\nThinking about it, I'm pretty sure that both atoms would still end up being annihilated, but I know very little about the subject, so, as far as I'm aware, it might be possible that the neon only uses a few electrons or protons. I know how stupid that sounds now that I'm writing it, but I figure it's worth asking.",
        "created_utc": 1668342283,
        "upvote_ratio": 1.0
    },
    {
        "title": "Hl Physics to Physics Major...",
        "author": "TA_PrimeDark",
        "url": "https://www.reddit.com/r/Physics/comments/ytzxhk/hl_physics_to_physics_major/",
        "text": "Hello!\n\nI am currently a junior in high school. Im currently passing HL Physics with straight 7s. I am consider a double major of CS and Physics, my only concern is that the physics will be too difficult. Others with experience going from HL Physics to a physics major, how is the transition?",
        "created_utc": 1668341558,
        "upvote_ratio": 1.0
    },
    {
        "title": "What's the physics behind indoor skydiving?",
        "author": "Electronic_Throat189",
        "url": "https://www.reddit.com/r/Physics/comments/ytzlog/whats_the_physics_behind_indoor_skydiving/",
        "text": "For those who doesn't know what that means, watch this video :\n\nhttps://vm.tiktok.com/ZMF5h12H6/",
        "created_utc": 1668340667,
        "upvote_ratio": 1.0
    },
    {
        "title": "Confused Physics student here, when strings are compressed (negative displacement), is the force negative or positive?",
        "author": "stewpeedboi",
        "url": "https://i.redd.it/j8ivl3t30rz91.jpg",
        "text": "",
        "created_utc": 1668340249,
        "upvote_ratio": 1.0
    },
    {
        "title": "Should I change my ways of solving or thinking about circuits based on veritasium's electricity video?",
        "author": "UAForever21",
        "url": "https://www.reddit.com/r/Physics/comments/ytxkzx/should_i_change_my_ways_of_solving_or_thinking/",
        "text": "I'm referring to this video called \"Energy/electricity does not follow through wires\" which is actually a real eye opening video. Because my whole life when I solved electronics or electrical circuits I used to tell myself the current/electrons split into this parallel branch etc...\n\nSo should I change that entire thought process and do you think it would really make a difference in our perception of electricity as such??\n\nThanks",
        "created_utc": 1668334521,
        "upvote_ratio": 1.0
    }
]