[
    {
        "title": "I (34M) cheated on my (31F) Girlfriend 5 years ago, Unsure how to deal with the situation after this long.",
        "author": "Grouchy9296",
        "url": "https://www.reddit.com/r/relationships/comments/11rj38b/i_34m_cheated_on_my_31f_girlfriend_5_years_ago/",
        "text": " \n\nI'm  having a heavy internal dilemma.  I believe it is keeping me from  continuing my spiritual growth but I am unsure how to move forward with  the situation.\n\n5  years ago, when I was 6 months into a relationship with my Girlfriend I  had a one night stand while at a bachelor party with friends.  I deeply  regret it.  Most of the time I can forget about it, but sometimes like  these past days the guilt overcomes me.  I am trying to lead a spiritual  life of truth but feel this is weighing on me heavy.  I do want to stay  with her, and feel terrible for having lied for this long.  There's the  option of telling her, or continue to just hold it in and eventually  find a way to forgive the event at a heart level.  This is very  difficult for me as I do not want to lose her.  When it happened I felt  terrible I knew it was possibly one of the worst things I'd ever done.   The constant beat up about it is weighing on me.\n\nIn  the terms of spirituality, and relationship, how can I proceed with  this in a spiritual manner?  Like I mentioned there are two main  options, tell her, or hold onto it and learn to forgive myself for it.   Overall I have not been a bad partner, but this of course has built the  relationship on a lie.  I'm worried it would break her at this point  since it's gone on for so long.  It feels like telling her would also be  selfish of me to do that to her.  On the other hand telling her feels  like it would set a place for truth.\n\nTL;DR:  Was unfaithful in my relationship 5 years ago at 6 months into the  relationship.  Unsure how to continue to leave a spiritual life in this  manner as it weighs heavy from time to time.\n\nAlso,  please I'm not looking to be berated.  I know I don't deserve sympathy, but I berate myself constantly.  I'm  looking for help and opinions with helpful answers.  I want to be  better.",
        "created_utc": 1678846576,
        "upvote_ratio": 1.0
    },
    {
        "title": "24f 4m lonely and horny asf 💦",
        "author": "amelia_george44",
        "url": "https://www.reddit.com/r/relationships/comments/11rj1d1/24f_4m_lonely_and_horny_asf/",
        "text": "[removed]",
        "created_utc": 1678846456,
        "upvote_ratio": 1.0
    },
    {
        "title": "I (m30) am not sure I'll find a partner worth dating?",
        "author": "Alone_Month9946",
        "url": "https://www.reddit.com/r/relationships/comments/11rj05r/i_m30_am_not_sure_ill_find_a_partner_worth_dating/",
        "text": " A  few months ago I got out of a long term relationship. Things were great  most of the time and I felt she understood me (haven't felt that  before) she was very ambitions, successful, and I found her physically  attractive too! I saw a future with her and we made a lot of plans  (buying a house etc)\n\nI've been on  the dating market for a few months and either through people setting me  up with friends, or any of the online dating apps/sites I didn't really  find anyone I connected with on more than 1 level. (ex, pretty but not  ambitious, or personalities didn't mesh)\n\nThere  are a lot of things I want out of life (kids/starting a family, someone  I can travel with) and it's feeling a bit scary to think I won't find a  partner that's compatible.\n\nI'm  starting to come to terms with this but it's very scary to think of  being on your own potentially forever, though settling for someone not  right seems at least somewhat worse. How did other people deal with  these fears?\n\nTLDR: Despite a lot of effort, and working on self love I might not end up with someone. Not sure how other people have dealt with this?",
        "created_utc": 1678846376,
        "upvote_ratio": 1.0
    },
    {
        "title": "I (m30) am not sure I'll find a partner worth dating?",
        "author": "Alone_Month9946",
        "url": "https://www.reddit.com/r/relationships/comments/11riyej/i_m30_am_not_sure_ill_find_a_partner_worth_dating/",
        "text": "[removed]",
        "created_utc": 1678846263,
        "upvote_ratio": 1.0
    },
    {
        "title": "Feel like having completely self sabotaged our (24m, 21w) sex life (2,5 year relationship), ever heard of something alike?",
        "author": "Halvv",
        "url": "https://www.reddit.com/r/relationships/comments/11riwt7/feel_like_having_completely_self_sabotaged_our/",
        "text": "Hello,\n\nthis was the first relationship for both of us. I feel like, for feelings of shame, inadequacy, insecurity, ego and down right narcisissm, I have worked hard on completely shutting down any sexual desires in her by constant pressure (in case you are alarmed, we are both in therapy, seeking external help).  \n\n\nThere is just something about it, which makes me so sad, since somehow I really, really love(d) her above all other women (especially towards the last 1,5 years) and wanted her to desire me more than anything. I often wish we would have met just now, with all the experience gained from this relationship but without all its super destructive, instantaneously down spiraling triggers.\n\nI actually don't really know what I am posting this here for, but I guess I am just hoping for some input (even if its just dislike, maybe helps me reflecting). I am especially so confused about the fact that I always wanted a girlfriend and then when I had one, I really went deep into the self sabotage. I feel like I horribly failed at realizing my dreams (which actually became true in times, but never for long), and at being a boyfriend that makes himself and his girlfriend happy.\n\nTbh., I just feel like a disgusting loser always projecting his deep feelings of sexual inadequacy onto his girlfriend\n\nThis might all be a bit undifferentiated, but I am self righteous often enough, so this might very well help the balance\n\n&amp;#x200B;\n\nTL;DR: I feel like I completely self sabotaged the sex life in my relationship while always longing so deeply for it",
        "created_utc": 1678846171,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to compromise on quality time with my (27F) boyfriend (29M) *crosspost from r/relationship_advice*",
        "author": "ThrowRAnanka",
        "url": "https://www.reddit.com/r/relationships/comments/11riuem/how_to_compromise_on_quality_time_with_my_27f/",
        "text": "I've been struggling with spending quality time with my bf lately. We've been together for 1.5 years and don't live together. The quality of the relationship is great overall &amp; we have fun together. Generally, we spend one weeknight together and Friday/Saturday night together. On Saturdays we'll go out to coffee, hike, watch a movie, etc. However he's started working extremely long hours, which leaves him with about 1 day off per week; on his 1 day off  he's usually completely exhausted and wants time alone to recuperate (understandable). \n\nThe problem, to me, is a lack of quality time is developing. For example today we were both coincidentally off. I knew I wouldn't have a full day with him for a couple of weeks so I suggested that we hang. He said no, that he wanted time alone to rest (I will see him tomorrow). I told him I understand but that I felt upset at our lack of recent time together. He basically told me he's trying his best, but he understands, and he'll continue to try to make time for me, and reassured me that he loved to spend time with me but needs time to himself to rest.\n\nThe other issue is that he never initiates said time together. It has actually been this way from the beginning. I like to plan stuff, but I'm always the one initiating plans. I always say, \"should I come over?\" Or \"Let's go to this place I want to go.\" It's making me anxious to be the initiator and take charge of the plans constantly. I told him that I understand he's burnt out from work, but that I need him to do something small to show he wants to actually spend time with me, that he appreciates me. (I make him meals, give him massages, do little things around his house to show him I support him during this time). \n\nHis work schedule is not permanent, but he doesn't know when it will end and it is stressful. We're going to discuss all of this tomorrow. How can we compromise and move forward in a way that meets both of our needs? I want to be totally honest about my feelings but also understanding of his needs. \n\nTldr: my boyfriend is working like crazy and is exhausted so needs alone time on his rare time off, which I want to spend with him. He also never initiates our plans. I want to find a solution that meets both our needs.",
        "created_utc": 1678846008,
        "upvote_ratio": 1.0
    },
    {
        "title": "My partner (26M) lied to me (25F) multiple times in the past.",
        "author": "goddessgalxx",
        "url": "https://www.reddit.com/r/relationships/comments/11riscr/my_partner_26m_lied_to_me_25f_multiple_times_in/",
        "text": "[removed]",
        "created_utc": 1678845881,
        "upvote_ratio": 1.0
    },
    {
        "title": "My (F20) roommate (F22) is terrified of me to the point of illness, I don’t know what to do",
        "author": "chifeiend1827",
        "url": "https://www.reddit.com/r/relationships/comments/11rikvf/my_f20_roommate_f22_is_terrified_of_me_to_the/",
        "text": "\nI am F20, my roommate is F22. \n\nI am currently in housing program in an eastern state in the US. I don’t want to go into specifics but basically this program is for underprivileged youth, you get discounted rent/utilities as long as you’re in some sort of trade or working. This lasts until about 25, then you get kicked out. You live in a dorm building, each “dorm” is like a two bedroom apartment and you get your own room, and you get assigned a roommate. You also get assigned a counselor who checks on you once a week. I didn’t get to meet my roommate before I moved in. \n\nMy counselor warned me before I moved in (literally a couple hours beforehand) that my roommate is very nervous, as she’s had very scary experiences with her previous roommate and could be a bit on the shyer side. I asked about it more and apparently the previous roommate was “psychotic”, threatening to harm my NR (now roommate) over small things, refusing to do chores, sneaking in people to scare my NR, breaking all the rules, stealing/breaking NR’s things, getting violent when she got angry (like slamming doors, punching walls, throwing her body against my NR’s walls), refusing to pay bills and damaging my NR’s credit, and basically making my NR afraid to even be inside her own home because she was terrified of her. They said because of “rules” they didn’t kick her out for two years, until the neighbors called the police enough times for the program to take action. I was horrified, I asked why they didn’t kick her out sooner and she ignored that, but said later she was new to the program as a counselor so she only knew what her colleagues told her. \n\nSo I tried to approach my roommate as nicely as I could at first, she is a no-bs type person, she was kind but made it clear she wasn’t going to be bullied in her own house, and told me what rules were in place and were to be expected to follow. They weren’t strict or anything, so I agreed and things were fine. \n\nHowever she is very cautious around me to where I feel uncomfortable. I feel selfish for that considering what she went through. She lets me use her silverware/plates etc but if she sees me using it she will go to her room to write down what I’m using, at what time, etc. She doesn’t speak to me other than stuff regarding the house, she will get uncomfortable if I’m in the same room and leave. I tried to make friends with her but she says she’s too uncomfortable with the idea of being friends with somebody she lives with, and wants to keep it professional.\n\nThe other day I overheard her appointment with her therapist, they were talking in her room. She didn’t know I was home. She was bawling her eyes out, telling her therapist she hates me, how she realizes I’m not like her past roommate but she just hates having a stranger so close to her, that I could snap and change at any moment and attempt to harm her like her previous roommate did. How she’s throwing up constantly from the stress of being near me (which is true, she is really sick all the time and I have heard her throw up before). How even her friends refuse to come over because of how scary the previous roommate was and “I could be like that.” I left and went to my boyfriend’s house for a couple of days. He got angry and said she shouldn’t talk about me like that. \n\nI can’t afford to live on my own currently and I can’t live with my boyfriend or family. But I feel so uncomfortable, knowing i make her so miserable. I know I didn’t do anything wrong but the way she was crying, she sounded terrified, I hated making someone feel like that. I brought it up with my counselor and she just says they can’t do anything about it and can’t move me so I should just leave her alone. \n\nIm really stuck on what to do. I feel miserable. \n\nTl;dr: roommate had scary previous roommate, has severe trauma and is terrified of me now",
        "created_utc": 1678845418,
        "upvote_ratio": 1.0
    },
    {
        "title": "My boyfriend (26M) lied to me (25F) multiple times in the past, how can we bring back trust into our relationship?",
        "author": "goddessgalxx",
        "url": "https://www.reddit.com/r/relationships/comments/11rih6y/my_boyfriend_26m_lied_to_me_25f_multiple_times_in/",
        "text": "[removed]",
        "created_utc": 1678845187,
        "upvote_ratio": 1.0
    },
    {
        "title": "how do i get these consuming thoughts out of my head?",
        "author": "fluffysaggitarius",
        "url": "https://www.reddit.com/r/relationships/comments/11rigfw/how_do_i_get_these_consuming_thoughts_out_of_my/",
        "text": "me (F18) and my bf (M18) have been together since May of 2022. we both are on the same sports team so we practice together almost everyday. when we first got together he told me he liked a girl (F17) on our team in december of 2021 for a “week” and they had a thing for a little. some people on the team know about it. at first i didn’t really care but then people started to say stuff to me like “isn’t it weird you both mingled with him?” or “they had a thing”\n\nthis girl in my opinion is prettier than me and has bigger boobs than me and a big butt . there’s other girls with big boobs and butt but something about this specific girl makes me feel sick. we have to see her everyday at practice and everytime i look at her i just feel sick to my stomach. it makes me feel sick knowing they had something and i know he loves me , but i keep overthinking that what if he’s only with me because he couldn’t have her? sometimes i see him look at her and it makes me overthink so much. me and my bf have had some arguments about it before too. \n\nit’s to the point where i have to see if he’s looking at her all the time or even try to go on birth control so i can get big boobs like her so that my bf will appeal to me more. i always feel like if we broke up that she would be his second option \n\nand when i leave for college he’ll still be here and seeing her almost everyday and it makes me feel sick to my stomach \n\nhow do i stop letting this get to my head? it’s consuming me and idk what to do. sometimes i cry myself to sleep about it \n\n\ntldr; very insecure about a girl and idk how to get it out of my head",
        "created_utc": 1678845136,
        "upvote_ratio": 1.0
    },
    {
        "title": "i feel consumed by these thoughts and idk how to get them out",
        "author": "fluffysaggitarius",
        "url": "https://www.reddit.com/r/relationships/comments/11riehn/i_feel_consumed_by_these_thoughts_and_idk_how_to/",
        "text": "[removed]",
        "created_utc": 1678845013,
        "upvote_ratio": 1.0
    },
    {
        "title": "Anyone holding any secret from their partner?!",
        "author": "bropill101",
        "url": "https://www.reddit.com/r/relationships/comments/11rie5p/anyone_holding_any_secret_from_their_partner/",
        "text": "[removed]",
        "created_utc": 1678844994,
        "upvote_ratio": 1.0
    },
    {
        "title": "My (23F) boyfriend (27M) is refusing to learn my language",
        "author": "New_Cable_273",
        "url": "https://www.reddit.com/r/relationships/comments/11ridsb/my_23f_boyfriend_27m_is_refusing_to_learn_my/",
        "text": "So I 23f have been with my boyfriend for almost 2 years and things are pretty serious. He is a very good boyfriend and is just all around very caring and great and I'm very lucky to be with him. But...\n\nI'm half Arab and my dad does not speak English, he's already not happy about the fact that I'm with a non-Arab so the fact that my boyfriend can't even converse with him is really hindering his integration into my family. I've asked him at least to just try it on duolingo and he's like we'll its like the hardest language ever so me learning it is basically pointless because I'll never be fluent, and I'm just like what you can't just learn the basics? My god it's so annoying since I'll just be stuck as translator forever \n\nAnd I get that it's a big ask, and I would probably drop it if I didn't dedicate myself to learning Spanish so I could be a part of his family (they're Argentinian), but they understand English so I could've just spoken English to them forever but I think it is way better to be able to connect with them through their language and show them how devoted I am to my boyfriend and being apart of his family. I'm conversational at this point I have really given it my all and I did that through TV shows, music, podcasts and duolingo.\n\nI get Arabic is a 1000% more complicated and harder to learn because there aren't as many ressources and he is more into numbers wheareas languages come naturally to me but the fact that he's not even trying with what's available is really irking me. I'm not going to break up with him or anything since this is our only issue but I'm very disappointed. How am I supposed to be happy at family gatherings if he's just sitting in the corner not understanding anything not being able to participate. \n\nI haven't nagged him since I know that it's pointless to because if he wanted to he would be doing it already.\n\nAnyway do I just let it go and move on or go on translation strike and make him learn it lol?\n\nTldr: my boyfriend is refusing to learn my language to be able to speak with my family when I did it for him.",
        "created_utc": 1678844968,
        "upvote_ratio": 1.0
    },
    {
        "title": "At what age did u meet ur soulmate ?",
        "author": "Tight-Vegetable330",
        "url": "https://www.reddit.com/r/relationships/comments/11rib08/at_what_age_did_u_meet_ur_soulmate/",
        "text": "[removed]",
        "created_utc": 1678844788,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is there potential for him to come back? Or should I just move on completely?",
        "author": "throwninthetrash16",
        "url": "https://www.reddit.com/r/relationships/comments/11riaer/is_there_potential_for_him_to_come_back_or_should/",
        "text": "I started to go on dates again (went through a bad break up a year ago, and used that time to work on myself) and I started talking to this guy and we went on a date, it was great lots of laughs and we went for a walk on the beach after for about an hour, planned for another date, etc. when we both got home he made sure I got home safe and thanked me for coming out &amp; had a good time. Then his texts started to get sporadic, I told him I hope he's doing well, and it turned to 5 days not hearing from him.\n\nThen he texted “It’s been a pretty terrible week lol. But thanks for checking in. Hope the week is going well and if not I hope the weekend is better” and I asked him what was going on and he responded later in the day and said “I take antidepressants and I ran out and it fucked me up” so I said “Damn. That’s all bad. :( Were you able to get a refill? And do you feel better?” He read the message Sunday &amp; hasn’t responded. I don’t judge cause I’ve taken antidepressants in the past and I’ve been reclusive from depression, but idk I feel like he’s not interested, but he responds just super late and idk if it’s just cause of his meds. But idk if I should just move on or be understandingBut the sporadic replies are just kinda meh to me.. could it be he's just slowly ghosting or going through a rough time? Should I give it time or just cut my losses and move on? I'm still actively going on dates/talking to others, I just really liked his energy, he's a attractive and successful, and we had good chemistry.\n\n&amp;#x200B;\n\ntl;dr - Went on a great date, planned to hang out again, he disappeared for 5 days and says he had a terrible week because he ran out of antidepressants but still was pleasant, disappeared again. Is there hope or should I move on?",
        "created_utc": 1678844750,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is there potential for him to come back? Or should I just move on completely?",
        "author": "throwninthetrash16",
        "url": "https://www.reddit.com/r/relationships/comments/11ri6j5/is_there_potential_for_him_to_come_back_or_should/",
        "text": "[removed]",
        "created_utc": 1678844504,
        "upvote_ratio": 1.0
    },
    {
        "title": "What are your personal thoughts?",
        "author": "chrysalim_",
        "url": "https://www.reddit.com/r/relationships/comments/11ri3ct/what_are_your_personal_thoughts/",
        "text": "[removed]",
        "created_utc": 1678844299,
        "upvote_ratio": 1.0
    },
    {
        "title": "Me(25F) and my boyfriend(28M) of almost 3 years have a good relationship but are struggling to feel close to another right now! Please help…",
        "author": "jnn117",
        "url": "https://www.reddit.com/r/relationships/comments/11ri0in/me25f_and_my_boyfriend28m_of_almost_3_years_have/",
        "text": "[removed]",
        "created_utc": 1678844114,
        "upvote_ratio": 1.0
    },
    {
        "title": "Me(25F) and my boyfriend(28M) have a good relationship, but we’re struggling with feeling close to one another. Advice!",
        "author": "jnn117",
        "url": "https://www.reddit.com/r/relationships/comments/11rhwl3/me25f_and_my_boyfriend28m_have_a_good/",
        "text": "[removed]",
        "created_utc": 1678843872,
        "upvote_ratio": 1.0
    },
    {
        "title": "My partner (26M) lied to me (25F) multiple times in the past, how can we bring back trust into the relationship?",
        "author": "goddessgalxx",
        "url": "https://www.reddit.com/r/relationships/comments/11rhsk5/my_partner_26m_lied_to_me_25f_multiple_times_in/",
        "text": "[removed]",
        "created_utc": 1678843618,
        "upvote_ratio": 1.0
    },
    {
        "title": "Dating my ex's new partners, ex",
        "author": "Ok_Growth_2223",
        "url": "https://www.reddit.com/r/relationships/comments/11rhpd7/dating_my_exs_new_partners_ex/",
        "text": "[removed]",
        "created_utc": 1678843425,
        "upvote_ratio": 1.0
    },
    {
        "title": "Bf gets mad when I turn down sex",
        "author": "AdOne168",
        "url": "https://www.reddit.com/r/relationships/comments/11rhp4v/bf_gets_mad_when_i_turn_down_sex/",
        "text": "(Sorry if I don’t write good my English is not that good) Long story short; my bf (26) m and I (22)f have been together for three years and we always had an amazing sex life, 2-4 times a day if we could and it’s amazing for the both of us. But recently l’ve been feeling like we just do it to get it over with because he always wants to do it when we’re in public for example in the car, in a public bathroom etc. and it’s been a long time since we’ve made “love” like In a bedroom. So recently I’ve been saying no when he asks because I iust don’t want to do it in public anymore and I’ve told him I don’t want to do it in public areas anymore and his response to this is getting mad and saying “but it never bothered you before” and “ you don’t enjoy our sex that’s why you never want to have sex with me anymore” and goes on saying “I just won’t ask vou to have sec with me anvmore since I’m so terrible” and starts this whole argument how I don’t love him anymore and how I’ve changed etc. idk what to do anymore because this is a constant thing now. I just need some advice how to go about this.\n  \n  ---   \n  **tl;dr**: my bf get mad at me everytime I don’t want to have sex",
        "created_utc": 1678843410,
        "upvote_ratio": 1.0
    },
    {
        "title": "My boyfriend is driving me crazy",
        "author": "Necessary_Wave_9480",
        "url": "https://www.reddit.com/r/relationships/comments/11rhnxj/my_boyfriend_is_driving_me_crazy/",
        "text": "My boyfriend is an alcoholic and he’s been through ups and downs like you wouldn’t believe we have been dating eight months and he is 24 years old and so am I and we have been through the worst of the worst and still got through it but he does have some mental problems in January. He had spiraled and relapsed and he cheated on me and I for gave him because I know that’s not him. And he proved to me that that wasn’t him however, he still does have some mental battles going on. Anyway, he told me on my birthday that he cheated on me and so the day after I had gone on bumble, because I had the app the whole time we were dating, but I was using bumble, BFF, the day after all, I had done was go on the dating portion, and changed my profile picture, and I didn’t talk to anybody I didn’t want to. I even felt awful that I even did that, even though he just did what he did to me and then fast forward we make up and everything’s fine and then he finds out about the bumble shit and he makes it so I have to feel like I have to lie to him about so many different things because he grills me so hard…. Even though I didn’t do anything wrong so fast forward to now he broke up with me for many other different reasons, but he’s screaming at me telling me that I just can’t ever tell him the truth and he doesn’t believe me about anything I say, and I told him I could tell him the sky is blue and he wouldn’t believe me and he was like that’s because I know you’re lying. I don’t do bullshit, I will feel better, and we will probably have a chance down the road if you just tell me the truth, and I was like, but I am telling you the truth. Finally, I did tell him a lot of the truth and I did tell him that I only used it to change my profile picture and I didn’t talk to anyone and he doesn’t believe me, because when I screen shared this originally he thinks that I deleted some of the messages, but there were no messages to delete since I didn’t talk to anyone and coincidentally the first time this happened right after he found out I had the app I was like oh my God I don’t wanna deal with this because I know how he is so I deleted the app and he told me that there is no logical reason as to why someone would delete the app they always have a reason because they were doing something wrong and I was like I literally deleted it because I wasn’t doing anything wrong besides changing my profile picture and I didn’t want to deal with your Bullshit so that’s the only reason why and he was like I swear to god if you don’t tell me the truth I will never speak to you again, and I was like, but I am telling you the truth…. This whole conversation stemmed from me telling him that I loved him and that I wanted him to fix his mental and get better and come back to me and then that’s when this happened because he doesn’t trust me..\n\nTLDR: how the hell do I fix this, he is so insecure and won’t believe a thing I said.",
        "created_utc": 1678843337,
        "upvote_ratio": 1.0
    },
    {
        "title": "Struggling to get past my wife's lies about sexual history",
        "author": "AioliDiligent6413",
        "url": "https://www.reddit.com/r/relationships/comments/11rhnms/struggling_to_get_past_my_wifes_lies_about_sexual/",
        "text": "My (38m) wife (38F) and I met in our late 20's at a mutual friend's birthday party. She left soon after I arrived but we chatted briefly and there was clearly a spark. I organised a few social events with the friend group and ensured the invite was extended to her. Over the course of the following few weeks, we attended a couple of social functions and talked....and talked...and talked. One night, we found ourselves talking for hours at a pub after our friends had left. We kissed, agreed to meet for a dinner date and then went back to our respective apartments. The dinner date was awesome and we've been together ever since. This was over 15 years ago.  \n\n\nDuring the early dating period we basically followed a \"traditional\" path - dining, courting, weekends away, etc. Regarding sex, she seemed quite conservative so I let her set the pace. We discussed it early and she said she wanted to go slow. Fine by me - I'm confident we'll get there when she's ready, and like many guys I enjoy getting to know a girl before getting down to business. After 3 weeks of dating (6 weeks after meeting), we finally had sex. It was worth the wait. Very intimate, close, sensual....etc.   \n\n\nFast forward 2 months and we're enjoying a romantic weekend away. The dreaded \"past partners\" conversation comes up. Full disclosure: it was me who brought it up and views around sex and intimacy are an important consideration for me in a committed relationship. To me, the number itself doesn't matter much, but \"cheap\" (eg. ONS - one night stand) or immoral (eg. cheating/abusive/deceptive) encounters do. It's not like I have a zero-tolerance policy - I've made as many mistakes as the next person - but it sends up red flags. Anyway, the conversation was tough but we got through. She says she's had 4 sexual partners, two of which were boyfriends. She also says she hadn't slept with anyone in two years. I'm quite surprised as this was significantly less experience than me. I told her I basically had a whole bunch of mini-relationships - 2-3 week flings and the like. I used to travel constantly for work so LTRs were tough in my few years out of college. I had 30-40 partners before meeting her. After hearing she'd only had 4, I responded accordingly (going slower than normal, getting to know her, long talks...basically The Notebook). The relationship continues and everything is dandy.\n\nTwo months later the first lie comes out. We're on a couples retreat with her friends when a story comes out about a party they all attended a few months before my wife and I got together. The story revolves around this guy who is seemingly famous within the group for his massive appendage (his mates referred to it as \"The Gherkin\" - a reference to the skyscraper in London). As her friend is telling the story, my now-wife quietly gets up and walks out of the room, tearing up. I'm a bit confused, and after a while it hits me - this is one of the 4 guys she's slept with, but rather than it being a brief relationship that happened years ago, it was a ONS that happened a few months ago. The story wasn't about him having sex with my wife but all 12 people at the table knew they hooked up that night. I'm feeling absolutely humiliated finding out about the lie in such a public setting, and furious that her best friend wasn't shutting down a public conversation which was clearly inappropriate in front of a new partner. It was not a comfortable evening. We fought that night, made up, had a long, painful-but-insightful conversation, bonded even deeper, and then decided to just throw everything on the table. Further tough conversations, more feelings of betrayal...it was tough on both of us. But literally every other aspect of the relationship is perfect. Our friends gel, our families gel; it all just works. Obviously we have fights but we're good communicators, both happy to compromise, and there's not a night we go to bed angry at each other. We moved in together at around 6 months. I've always hated thinking more than a month ahead in life, but all of a sudden the concept of marriage doesn't seem too bad. Where I used to envisage myself getting dragged to the alter as a 50 year old, I'm now suddenly (and fleetingly) entertaining the notion of settling down. This chick is amazing. \n\nA few months after moving in, another story comes out. She had a one night stand 6 months before we met and dated the guy for a few weeks. Alarm bells start ringing so we sit down and have the chat again. A few more stories come out - all one night stands (or at least starting that way). I'm floored by the new info because I genuinely thought she'd been honest after our previous experience. But we take the opportunity to start from scratch, put everything on the table, rebuild trust and move on. We talk for hours, ask many questions, and end the conversation in a good place. She can tell I'm disgusted by the large number of one night stands, but I'm also open with her about the fact that it's an emotional issue for me, not a rational one, and that I want to work through it. Weeks turn to months and we move on. \n\nQuick sidenote: I've had a few one night stands when young and drunk (or right after a bad breakup). I hate them. I feel dirty. But I know, rationally, that two consenting adults having safe sex causes no harm. And if it causes no harm I can't find an ethical fault. On the other hand, I view sex like a conservative Christian even though I'm a secular atheist.  I'm puritanical on a few other issues too, namely cheating: it's a massive dealbreaker, even if in the past. Anyway, I told her I was willing to explore this in therapy and invited her to come as, and when, she wanted. I genuinely wanted this to work and didn't want some puerile, animalistic urge to ruin everything. \n\nBy this stage we're facing some major life challenges (family sickness/death, redundancies, moving cities, etc). This is relationship trial-by-fire. We manage through by openly and continuously supporting each other through thick and thin. Sounds corny but it's true. Keep in mind, we were in our late 20s so we both knew what we wanted in life. We knew we were heading towards marriage and settling down. But it's tough when your dad has terminal cancer and lives out of town. I had also been open about my \"shameful\" history (mental health challenges leading to destructive and self-harming behaviours). The summation is that this period was very, very hectic and we were both each other's emotional rocks. \n\nOver the next few years more stories come out. Each time, she swears black and blue that she can't remember any other guys she's been with. Two months before we get married she drops another bombshell: 3 more ONS with complete strangers, and a ONS where she cheated on her only serious boyfriend with her best friend's boyfriend (10 years prior to us meeting). What's more, we're going to meet her best-friend's-former-boyfriend at an upcoming event. It's clear to me that I'm hearing about this because I'm soon to meet the guy and she doesn't want it to slip out. At this stage the trust is broken. I give up on being honest and basically cease to talk about the issue with her. She is absolutely sobbing, saying how she's ruined everything. She's ashamed of herself and she thinks she's a terrible person. It's something that happened when she was 20 and it's eaten away at her since. She's never done anything like it since and is still disgusted with herself. It's all clearly genuine. I take a few days to mull it over and make the decision to never discuss the issue of past sexual behaviour again. Ever (except on this reddit throwaway!). I tell her that I love her, I'm still committed to her, and - though I'm still struggling with the information - I want to focus on literally every other part of our life. We had a lovely wedding a few months later and have been married for just over 10 years.   \n\n\nThe problem is, I have a fundamentally different view of my wife now. Sex and intimacy are deeply connected and important to me. I find the values that lead to casual sex to be extremely unattractive. There's no judgement about the act itself - I couldn't care less what consenting adults do - it's just something I can't relate to, so I struggle relating to a partner who has those values. Plenty of my close friends are hooking up on Tinder on a weekly basis. I just don't care about the issue unless there is a genuine romantic interest, in which case it becomes critically important. It is seriously impacting how we express intimacy in the relationship.  \n\n\nWe've now been together for 15 years and have a wonderful family. We communicate well, operate well as a parental team and generally have a loving family life. I should be happy, but I just can't get over her history. Her past would have been a dealbreaker if I'd known, and clearly this is why she repeatedly lied. But the repeated lying has just shattered trust in the relationship. I don't talk to her about this issue at all anymore as it angers me and hurts her. She probably prefers it that way, but on some level I think she's aware of how much damage it has done to the relationship. It tends to build in my head and every few months I just go quiet for days as my internal dialogue goes into overdrive. She often picks up on it and tries to talk, but when I refuse she can deduce it's about this issue (we talk openly about everything else). For the last few years she's mainly been oblivious, but either I'm getting worse at hiding it or she's figuring me out. My rational mind just cannot find a problem, yet this issue eats away at me daily. I know the lies are bad but I also know it is tough for a woman to put herself out there and risk being judged in a new relationship. I can see both sides. But even removing the lies, it's still emotionally soul crushing to know that I'm literally the only person she's slept with that didn't start with a one night stand. Who knows what her count actually is but after 5 years it went from 4 to 12 (I'm really hoping the \"rule of 3\" does me proud and there's no more surprises in the pipeline!). In my mind, 12 sexual partners is actually low for the late 20s. But 12 one night stands - and the fact that everything was sex-on-first-meet for the 10 years before we met - is well beyond what I'm comfortable with. It shouldn't be but it is. I should also note that I've read through 100s of reddit posts on this subject, and the issue is not feelings of inadequacy. I couldn't care less if she slept with 50 guys, each hung like a horse. The issue is judgement - I think that behaviour is deeply unattractive and not aligned to the \"traditional\" family values I hold. To reiterate, I only judge these behaviours as they relate to people I am sexually intimate with - for literally anyone else I don't care. Has anyone been through this journey and come out the other side? I love my wife and I genuinely want to get past this. What can I do?\n\nTl:Dr \n\nMy wife is amazing and has been honest and open about everything except her sexual past. I found out a few dealbreakers well after I was hooked on her. Everything else over 15 years has been perfect but I'm really struggling to move past this. \n\nI have two beautiful kids and a lovely wife. I should be happy. But I can't get past this issue. Has anyone been in a similar spot? How do I move forward?",
        "created_utc": 1678843320,
        "upvote_ratio": 1.0
    },
    {
        "title": "Dating my ex's new spouses ex",
        "author": "Ok_Growth_2223",
        "url": "https://www.reddit.com/r/relationships/comments/11rhnkd/dating_my_exs_new_spouses_ex/",
        "text": "[removed]",
        "created_utc": 1678843316,
        "upvote_ratio": 1.0
    },
    {
        "title": "Boyfriend mourning lashed out on me",
        "author": "cokepepsi7up",
        "url": "https://www.reddit.com/r/relationships/comments/11rhmh7/boyfriend_mourning_lashed_out_on_me/",
        "text": "My boyfriend 26 lost his father six days ago. Since then, he became so hard to talk to even in small things and simple questions. It seems to me that he is kind of dissociating from too much thoughts. 90% of the time I'd talk to him about something or ask him a question, but he won't respond and it feels like I am being ignored. It hurts - yes, but I try not to bring it up because I feel like among all the people around him, I should be the one who must understand his feelings the most given what he is going through right now and I worry that it will make him more stressed if we talk about it as he is a kind of person who likes to argue a lot even before. \n\nThis morning, I went home from work and I told him I love him as I prepare to take a shower. He won't respond and kept on trying to sleep. I told him jokingly, \"I love you too\" as my response to myself. I guess it sounded sarcastic to him that it made him annoyed to the point he shouted \"Go home.\" There were instances in the past that he would shout at me, but earlier was so loud and can be heard outside the bedroom. I told him, \"I am trying to be patient with your attitude lately.\" He then repeated \"Go home\" but less louder than the first one. While I was packing my things up, my tears won't stop and before I exit the room, I told him calmly while silently crying, \"I know you're going through something right now, but that should not justify you being rude.\"\n\nHe didn't say anything after then continued pretended sleeping. As for me, I went home alone crying. \n\nHow do I deal with this? :'(\n\nTL;DR: Boyfriend lost his father six days ago, acting cold and dismissive and lashed out on me as I jokingly said he's responding back from my \"I love you.\"",
        "created_utc": 1678843253,
        "upvote_ratio": 1.0
    },
    {
        "title": "My boyfriend gets mad/starts argument every time I turn him down for sEx",
        "author": "AdOne168",
        "url": "https://www.reddit.com/r/relationships/comments/11rhke7/my_boyfriend_gets_madstarts_argument_every_time_i/",
        "text": "[removed]",
        "created_utc": 1678843132,
        "upvote_ratio": 1.0
    },
    {
        "title": "I have a second date woth a girl and I really don't want to fuck this up",
        "author": "BabyNickels",
        "url": "https://www.reddit.com/r/relationships/comments/11rhjra/i_have_a_second_date_woth_a_girl_and_i_really/",
        "text": "I met this girl (let's call her Q) around 5 years ago, my freshman year of college. I first saw her during freshman orientation and fell for her immediately. A lot of people would call it a \"love at first sight\" situation. A month or 2 after classes had started. I ran into Q and her friend with one of my friends at a football game and we spent most of the game hanging out with each other. Q and I had matching shoes which I commented on. By the end of it, everyone exchanged snapchats/instagrams/etc. I found out she had a boyfriend and none of us really reconnected much after that. Q and I ran into each other here and there throughout the years, but it was just conversations you would have with an acquaintance.  \n\nA few years down the road, Q and her bf broke up. I found this out via Tinder. We matched and I made a flirty line and dropped the ball. Nothing ever came from it. Through the years, we would respond to each other's stories every now and then but they never lasted more than a few messages. This happened again more recently where I responded to a selfie of her story responding with some flirty talk and we exchanged a few messages but then it fell off. About 2 weeks ago, she responded to my story and ever since we've been chatting.  \n\nAfter chatting for a few days, I decided to be straight forward with Q and told her that I've always found her really cute and asked of she would be interested in catching up over a drink. We went to a barcade over the weekend and I think things went really well. We both had quite a bit of fun and it was really good to see each other and talk in person. There was some awkwardness on both ends, but it's a little unavoidable for a first date.  \n\nAfter we went our seperate ways from the barcade, she told me she had fun and would be interested in doing it again. I followed her up on that and now we have another date set up for this weekend. I'm estatic and know a second date is a good sign, but I can't help but feeling like I'm going to fuck this up somehow. I know I get attached extremely easily in relationships and it's taken every ounce in me to show restraint and remain composed. I mentioned \"love at first sight\" above, but it's felt more like the Japanese term \"Koi No Yokan\" or the feeling that you know you're going to fall in love. I only say this because I've experienced only once before and it feels very similar. However, that relationship resulted in heartbreak over someone who I thought was \"the one\".  \n\nI have a second date with Q this weekend, and I am over the moon for it. I really like my chances but I feel like I'm constantly telling myself to not fuck this up because I know I get attached way too easily. She's not a very big texter from what I gather. Which I'm partially grateful for because sometimes I feel like the next message I get from her could be the last. I want her to know how I feel about her, but I also feel like I might be coming on strong. I know it's not smart to feel like this over a girl I really barely know, but the thrill of possibility is overwhelming.  \n\nI apologize for such a long post, but it's something I've needed to get off my chest. Has anyone been in a similar situation before? How did you manage and how did it turn out? I really don't know what I'm looking for with this post, but it feels good to finally get it out there.  \n\nTL;DR I have a second date with a girl I've been crushing on and off again for the past 5 years, and I'm afraid I might be coming off a bit too strong.",
        "created_utc": 1678843097,
        "upvote_ratio": 1.0
    },
    {
        "title": "Prenup",
        "author": "Due_Moose_3258",
        "url": "https://www.reddit.com/r/relationships/comments/11rhj9q/prenup/",
        "text": "[removed]",
        "created_utc": 1678843068,
        "upvote_ratio": 1.0
    },
    {
        "title": "Boyfriend mourning - lashed out on me",
        "author": "cokepepsi7up",
        "url": "https://www.reddit.com/r/relationships/comments/11rhi8c/boyfriend_mourning_lashed_out_on_me/",
        "text": "[removed]",
        "created_utc": 1678843007,
        "upvote_ratio": 1.0
    },
    {
        "title": "My (F18) boyfriend (M18) isn’t prioritizing me and I feel unimportant.",
        "author": "ThrowRA_strawberrym",
        "url": "https://www.reddit.com/r/relationships/comments/11rhi4w/my_f18_boyfriend_m18_isnt_prioritizing_me_and_i/",
        "text": "My (F18) boyfriend (M18) of 1.5 years is in a really demanding program in university and is very busy studying. I’m so proud of him for how hard he’s working to achieve his dreams but I’ve been feeling really unimportant to him lately. He doesn’t have time to call me for even a couple minutes a day when we’re not together, and barely makes time to see me. When we do see eachother, he’s studying the majority of the time and mostly wants to have sex, watch shows, and play video games together and not go on any dates. Even on his breaks, he says my date suggestions would be a “waste” of his limited free time and he only wants to do things that he likes, even if I don’t like them (but I still try them because I value him and his interests). It’s important to me that he tries activities I enjoy and learns about my interests, but he only seems to care about his own. I know he has to study and take his time to do well, and school is his main priority right now, but I feel like I’m not even in the ballpark of his priorities right now. I feel used for my body sometimes because he “doesn’t have time” to emotionally connect and I just want him to make me feel like I’m important to him. There are so many little things adding up to make me feel unimportant lately and it’s really starting to hurt my feelings. I’ve talked to him a bit about this but usually when I try to have longer conversations or try talking to him about how I’m feeling, he says it will ruin his mood and stress him out when he already doesn’t have much time to spend outside of studying. Any advice on what I should do and how to cope with this until he’s on summer break? Thanks in advance :)\n\nTLDR: my boyfriend is busy studying and is making me feel unimportant and used.",
        "created_utc": 1678843001,
        "upvote_ratio": 1.0
    },
    {
        "title": "(M19) (F18) This girl decided to cut me off after our first hookup even tho things seemed they went well",
        "author": "EmiBuendia17",
        "url": "https://www.reddit.com/r/relationships/comments/11rhged/m19_f18_this_girl_decided_to_cut_me_off_after_our/",
        "text": "I have recently been talking to this girl for a few weeks after I slid into her dms on insta. After, this the conversation moved onto snap and everything was going well - quick replies, good convo funny and deep. Then last weekend we both went out and met in a club. Danced for a bit and left with a kiss. A few minutes after leaving she messaged me to go round, so I did. The car journey was good held hands and done some intimate touching. Now you have to hate in mind this was my first time - so I was kinda nervous about having sex. We went to room and we quickly started. It lasted around 30 minutes and this was because I couldn’t cum 😂 however even tho it was my first time I thought it went well. Afterwards we cuddled up and she went to sleep. In the morning she woke and again she started to cuddle up to me, laying on me and started stroking my head. So I then started to tickle her back as well, this probably hit me harder then me losing my virginity for some reason. A few hours later she took me back and kinda agreed to meet up during the week. After a few hours, I received a snap saying ‘I don’t want a boyfriend btw, so I don’t think we can meet as I don’t want to catch feelings’. At first I was understandable but I was confused on why she didn’t tell me before we started messaging or had sex. As I already started having false thoughts about the future cause of how well it went in my head. So then I questioned if she enjoyed last night - which she said she did. Then she added ‘I could see myself falling for u in the future, so I don’t want this to continue’. At this point my heart had dropped, I felt confused because I thought this was leading somewhere positive. She then said we ‘can still talk if u want but it’s up to u’ clearly suggesting she didn’t want to. I decide to say I wanted to keep messaging, which only lasted til later that night when she ghosted me and then eventually removed me. \n\nIt’s now been a few days after the hookup and I can still can’t stop thinking about it and what she said. Overthinking about what could have made her want to cut me off. I know it may sound daft, but I did like her from our conversations and obviously the fact I lost my virginity to her. Also, a problem I have when I talk to a girl, my focus is only on them not any others, this could have an affect on why I miss speaking to her already.\n\nTLDR: basic info - male 19 female 18, recently started taking. Does anyone have any idea why she decide to cut me off and how I deal with my emotions currently? Thanks x",
        "created_utc": 1678842900,
        "upvote_ratio": 1.0
    },
    {
        "title": "Prenup",
        "author": "Due_Moose_3258",
        "url": "https://www.reddit.com/r/relationships/comments/11rhg5k/prenup/",
        "text": "[removed]",
        "created_utc": 1678842883,
        "upvote_ratio": 1.0
    },
    {
        "title": "Am I (F25) wrong for calling my friend out for her behavior after breaking up with her (F26) boyfriend (M31)?",
        "author": "LoveHealsButHurts1st",
        "url": "https://www.reddit.com/r/relationships/comments/11rhek5/am_i_f25_wrong_for_calling_my_friend_out_for_her/",
        "text": "I have (had) a good friend named “Sara” (26F) who is funny, interesting, very attractive and charismatic. She is notorious for getting so many men to fall in love with her and not committing to them. She’s the type who can strike up an interesting conversation with anyone and gives off warm energy, which leads guys to fall in love with her. She also has a history of multiple past partners and being able to build romantic connections easily. \n\nI, (F25), on the other hand, am quite different. I’ve never had a relationship before and there are only two men I’ve felt a genuine romantic connections with. This information is important, because it seems like our morality is not aligned. I’m decisive and loyal, while she cannot seem to commit to one person.\n\nAnyway, Sara started talking to this guy (her now ex) around last July. He was a coworker (who lives in another state since they are remote workers) and she swore to only see him as a friend. They would talk for hours on the phone and after awhile he did express romantic interest in her. She was always confused about the connection because she loved talking to him and had feelings at one point, but he wasn’t her “usual type” and she didn’t feel strong butterflies like she did with her previous ex. Before they were set to meet in person, she told him that she wasn’t sure they had a romantic connection but that she enjoys a friendship. Basically, she would run away, express her confusion about the connection to him and he would still chase her hardcore. \n\nI’ve been trying hard not to be annoyed about her indecisiveness about him, but it’s difficult when she reminds me of this guy I used to sleep with (they’re both friends and get along very well since they’re similar). But I understood in the beginning because they haven’t met in person yet. Anyways, they meet in his hometown and she doesn’t say the best things about him (“he’s so short”) and even said she was on Tinder during the trip. Nonetheless, when she flies back, she says she misses him and decides to delete her dating apps and be exclusive to him “out of respect for him.” \n\nIt takes forever for her to commit to a relationship with him (5 months) since they were long distance, and would even say sometimes she felt like she would lose feelings for him and then it would come back. She also started hanging out with a guy friend she had chemistry with (she never cheated though), and said it makes it difficult to sometimes maintain her feelings towards her boyfriend but that she loves her boyfriend and eventually cut the guy friend off. In between the time she decides to commit, she tries to break it off again but they get back together because he is set on being with her. \n\nAnyway, she visits him again last month and decides to breakup with him the final time because she was “unsure and waiting to see if she fell in love” and didn’t want to waste his time. The problem is, she stayed at his place and even CUDDLED with him after the breakup. \n\nI proceed to call her selfish for that (since she could cuddle with other people), and she said that’s “messed up” of me to say because it’s not an easy decision for her, plus he asked to cuddle with her after. I told her that it isn’t “messed up” and that I’m allowed to critique her and that she’s sensitive for not handling feedback. \n\nShe proceeds to give me an uncalled for response and wrote verbatim, “You know, there are many things you do that I can say are selfish, but I don’t go there because I recognize that we have different perspectives in life and I respect that. If you were in this exact situation, I would never call you selfish but rather I would be a listening ear. I don’t appreciate this at all.” Because she can’t understand my POV or ethics, I write “k” and  I remove her from seeing my Snapchat and “Find my Friend” locations after her response. \n\nAnyhow, I’ve told a couple friends about this and they say we are fighting over something dumb and that something like this isn’t worth throwing a close relationship away (I’ve known her since we were 10). IMO, if she wants to work it out then she could call me. I’m not bending over backwards when I’m not in the wrong for expressing the truth. I think that she *is* selfish, immoral, and can’t handle the truth. \n\nTl;dr: My friend (26F) has been stringing along her boyfriend (M31) and cuddled with him after breaking up; I (25F) cut contact with her but am curious about others’ input?",
        "created_utc": 1678842786,
        "upvote_ratio": 1.0
    },
    {
        "title": "My boyfriend gets mad and starts arguing with me every time I turn him down for sex.",
        "author": "AdOne168",
        "url": "https://www.reddit.com/r/relationships/comments/11rhe54/my_boyfriend_gets_mad_and_starts_arguing_with_me/",
        "text": "[removed]",
        "created_utc": 1678842758,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is my (21F) 2.5 year relationship (21M) over?",
        "author": "Key-Rub-3047",
        "url": "https://www.reddit.com/r/relationships/comments/11rhcke/is_my_21f_25_year_relationship_21m_over/",
        "text": "[removed]",
        "created_utc": 1678842662,
        "upvote_ratio": 1.0
    },
    {
        "title": "My BF of 6 Months Hasn’t Said “I Love You”",
        "author": "Low_Resolution7370",
        "url": "https://www.reddit.com/r/relationships/comments/11rhc9g/my_bf_of_6_months_hasnt_said_i_love_you/",
        "text": "I (25F) have dated my bf (29M) for just over 6 Months, I can’t tell if I’m being crazy or not but given that I have BPD (Borderline Personality Disorder) it’s hard for me to tell if I’m coming on too strong or not strong enough sometimes. Just a little background, I’ve known him for almost 3 years. We were friends before we started dating (talked about our personal lives/pasts, hung out on a semi weekly basis). He has had a pretty terrible history with women and I don’t have a great history with men either. We have talked to each other about our previous relationships and that’s never been something he’s tried to hide from me and vice versa. He’s really been the only relationship I’ve been in where I was comfortable talking about my mental health issues and been open about my sexuality (I am Bisexual). Given that we were friends first, we knew most of the “get to know you” stuff before we even got together. We both have been very clear about what we want for our relationship (eventual marriage/kids yadayada) and he even plans things/trips for us months in advance meaning he sees us having a future. I just don’t understand why he hasn’t said I love you yet. I said it 3 months in just in the spur of the moment because it felt right and he didn’t say it back, and now it’s months later and I kinda feel cheated? I know he cares about me, I know he sees a future, I just don’t know if this is just my BPD and the fact that I feel things so strongly or if he needs more time? \n\nTLDR; I said I Love you to my bf of 6 Months and he didn’t say it back, what do I do?",
        "created_utc": 1678842643,
        "upvote_ratio": 1.0
    },
    {
        "title": "My partner (26M) lied to me (25F) multiple times in the past, how can we bring back trust into the relationship?",
        "author": "goddessgalxx",
        "url": "https://www.reddit.com/r/relationships/comments/11rhbbx/my_partner_26m_lied_to_me_25f_multiple_times_in/",
        "text": "[removed]",
        "created_utc": 1678842591,
        "upvote_ratio": 1.0
    },
    {
        "title": "(M19 ) (F18) This girl decided to cut me off after our first hookup even tho it seemed to be going well.",
        "author": "EmiBuendia17",
        "url": "https://www.reddit.com/r/relationships/comments/11rhavg/m19_f18_this_girl_decided_to_cut_me_off_after_our/",
        "text": "[removed]",
        "created_utc": 1678842563,
        "upvote_ratio": 1.0
    },
    {
        "title": "Navigating Friend Group Dynamics: Lost a Friend After Starting a Relationship, Need Advice",
        "author": "ddioeshriu48374983",
        "url": "https://www.reddit.com/r/relationships/comments/11rha33/navigating_friend_group_dynamics_lost_a_friend/",
        "text": "I (44M) started dating a woman (47F) from my friend group, and she is now my girlfriend. Shortly after we began dating, a married male friend from the group stopped talking to me, leaving me hurt and confused as there seems to be no apparent reason for this. My girlfriend continues to see this friend weekly for a standing event, and although it didn't bother me initially, it has started to make me upset with her. I could potentially move on and never see my friend again, but my girlfriend's ongoing interactions with him prevent me from doing so. I don't want to be upset with my girlfriend, but I'm unsure of what to do. What steps can I take to address this issue without causing further tension in our relationship?\n\nTLDR: I (44M) started dating a woman (47F), and a male friend from our group stopped talking to me. Girlfriend still sees him weekly, making it hard for me to move on. Looking for suggestions on how to address this situation.\n\nBasic Info: Ages 44M and 47F, relationship length: 1 year",
        "created_utc": 1678842515,
        "upvote_ratio": 1.0
    },
    {
        "title": "Prenup",
        "author": "Due_Moose_3258",
        "url": "https://www.reddit.com/r/relationships/comments/11rh8ad/prenup/",
        "text": "[removed]",
        "created_utc": 1678842409,
        "upvote_ratio": 1.0
    },
    {
        "title": "First Cold Approach",
        "author": "jycu",
        "url": "https://www.reddit.com/r/relationships/comments/11rh1cy/first_cold_approach/",
        "text": "[removed]",
        "created_utc": 1678842027,
        "upvote_ratio": 1.0
    },
    {
        "title": "How soon is too soon for someone to tell you they love you?",
        "author": "unsurechannel",
        "url": "https://www.reddit.com/r/relationships/comments/11rgzkm/how_soon_is_too_soon_for_someone_to_tell_you_they/",
        "text": "[removed]",
        "created_utc": 1678841930,
        "upvote_ratio": 1.0
    },
    {
        "title": "My boyfriend (27m) gets defensive when someone tells him about himself",
        "author": "AbrocomaEasy9994",
        "url": "https://www.reddit.com/r/relationships/comments/11rgzci/my_boyfriend_27m_gets_defensive_when_someone/",
        "text": "My boyfriend (27) is currently struggling to find his niche in life that gives him financially stability and work from home opportunities. He is on a quest to find side jobs that will help him quit his job and “freelance”.  He has also been studying for months to be a financial professional (life insurance). \nI (26f) have been working since I was 18. I am very big on stability and working to provide for myself and have insurance and a 401k. I try to be supportive, but I see his daily habits and it bothers me how lazy he is. \nWe just moved in with each other last month, and I’m 10 weeks pregnant. \nHe works overnight and we were talking on the phone this morning and he says he wants to find something online so he can go down to working 3 days a week. \nI sent him this message: \nI don’t run to ig wherever something is bothering me, grow up. \nYou want to make money, and have your own business. Yes, I’m all for it. But you need to take a look at your daily life and your habits. \nHave you been constantly studying? No. \nYou can’t even tell Ben about the financial thing because you haven’t retained any information at all. And that’s why you got so defensive. The way you truly know you’ve learned something is by being able to talk about it and explain it knowledgeably. \nYou would think with the last 2 months you would be able to explain shit better, but you simple can’t because you don’t have the motivation to learn. You just want to get rich.  \nMaybe if you got some motivation you wouldn’t sleep all the time, or have to nap constantly. \nI’ll be your biggest supporter Austin , but c’mon. \nIf it was so easy, everyone would work from home on their own schedule and be rich. \n\nHe then replies telling me because I stress him out he hasn’t been able to study. That if we didn’t have a kid on the way, he would’ve already given up on me. \nHe then brings up his ex telling me how she respected him and thought he was a genius. He tells me I take his love for granted. \nWhat really got me was this message: “ I believe some of the shit you say will make us not get there, all the shit u say u want as a family u will be the one not to have it cause of your actions, this ungratefulness, this self centeredness will be your down fall the you try to make it seem like your helping me after or your excuses for your actions is in my benefit gtfoh. The only thing that humbles woman is when they see what you wanted to do for them, you doin it for someone else &amp; more &amp; more u showin me that u need to be humbled” \nAm I the asshole because I want to see him do better and have more motivation? \nHe came home, didn’t talk to me and I am assuming he’s been talking to his ex. \nAm I the asshole? \n\n\n\nTL;DR— boyfriend (27m) gets upset because I send him a message about being lazy and he brings up his ex and that we wouldn’t be together if I wasn’t pregnant",
        "created_utc": 1678841916,
        "upvote_ratio": 1.0
    },
    {
        "title": "My partner (26M) of 6 years lied to me (27F) in the past, how can we bring back trust into the relationship?",
        "author": "goddessgalxx",
        "url": "https://www.reddit.com/r/relationships/comments/11rgx2f/my_partner_26m_of_6_years_lied_to_me_27f_in_the/",
        "text": "[removed]",
        "created_utc": 1678841786,
        "upvote_ratio": 1.0
    },
    {
        "title": "If there’s a will, your ex will find a way 😭",
        "author": "user242020",
        "url": "https://www.reddit.com/r/relationships/comments/11rgwid/if_theres_a_will_your_ex_will_find_a_way/",
        "text": "So this ex was my very very first official relationship I was 18 freshman in college and we broke up when I was 19. LSS he cheated on me the whole year we were together and even though I found evidence all throughout the relationship he gaslit me until I had solid proof which was the girl herself. I broke up with him and moved on. For about year he begged for me back he made new socials added me on old socials but I blocked him. I am now 25 with an almost 3 year old and I live 1,000+ miles away. He’s now 27 (?) has a girlfriend and a fresh new born he reached out to me on Facebook but I never responded. I forgot I had him on there because I literally never get on Facebook. I saw he moved on and I didn’t feel any type of way I just went about my day. Today I’m on TIK TOK of all places and he sends me a follow request 😂😂 I truly don’t know how he found me because I don’t post anything and he doesn’t have my new number. Anyway he sends me a ‘hey stranger” message I ss and send to my best friends who were there when everything went down. They just laugh and say wow. Once again no hard feelings about that relationship because i was literally a child and not emotionally mature and neither was he. I just think it’s funny how 6 years later hes still thinking about me 😂\n\n\nAlso! When I was pregnant I served as a second job and I had a best friend that worked with me. They were on tinder and I was pretty much like let me see your matches I want to choose someone for you (they had really bad taste in guys so far lol) my ex shows up as somebody who super liked them! I just laughed and said this is my ex. No surprise he was on tinder I was surprised because my best friend is a gay man 😊\nTL;DR: ex from 6 years ago found my tik tok after being blocked on all my social media. He decided to message me but he now has a girlfriend a newborn baby.",
        "created_utc": 1678841756,
        "upvote_ratio": 1.0
    },
    {
        "title": "My boyfriend(27M) gets angry at me (26F) for calling him on his shit— am I the asshole for how I brought it up?",
        "author": "AbrocomaEasy9994",
        "url": "https://www.reddit.com/r/relationships/comments/11rgs6f/my_boyfriend27m_gets_angry_at_me_26f_for_calling/",
        "text": "[removed]",
        "created_utc": 1678841516,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is it possible for us (22F 22M) to “rebuild” and “rekindle” our relationship?",
        "author": "Comfortable-Paper209",
        "url": "https://www.reddit.com/r/relationships/comments/11rgoxr/is_it_possible_for_us_22f_22m_to_rebuild_and/",
        "text": "My boyfriend (22m) and I (22f) have been together for 3 years and in the last months, due to major life/routine changes, we went through a lot and our relationship has been rocky.\n\nAfter months trying to work on the issues and failing over and over again, we are finally getting better and relearning how to communicate peacefully, how to be kind and patient as we have always been.\n\nBut I feel like we have lost the foundation of the relationship and our passion for each other, even though things are better.\n\nI find myself picking up on things I usually wouldn’t, noticing his “flaws” a lot more. It’s a bad habit I have developed in the last months and it seems to be the hardest one to get rid of.\n\nWe wanna rekindle and rebuild our relationship and to feel “in love” with each other again. We still love each other more than anything, but we have spent too much time “destroying” the good parts of our relationship and our emotional connection/intimacy is now weak.\n\nHow could we start to heal from these things and find the spark again? We don’t wanna lose each other but we both agree there’s something missing and we want it back. \n\nIt’s been just a few weeks since we have been getting better and some arguments still happen here and there, could it be because it’s still too recent? \n\ntl;dr: My relationship has been rocky and we are having a hard time reconnecting and recreating emotional connection.",
        "created_utc": 1678841331,
        "upvote_ratio": 1.0
    },
    {
        "title": "I (17M) gave my stepsister (19F) attitude cause she interrupted me playing with my friends and everyone is saying I need to apologize.",
        "author": "wromble_strumble",
        "url": "https://www.reddit.com/r/relationships/comments/11rgnav/i_17m_gave_my_stepsister_19f_attitude_cause_she/",
        "text": "So my mom and stepdad are out of town for a couple days on their honeymoon, I go to school and take the train home from school, my stepsisters both work full time so I usually just have the house to myself. Last night it was around 7:30 and I really wasn't feeling any dinner cause I had a later lunch and decided to skip it.\n\nLater I was playing with my friends when I guess my stepsister was yelling for me. I had headphones on and didnt hear her. She walked into my room and I did notice her and thought she was just saying high but she got right in front of me and blocked the TV and then tried to take off my headphones. I will admit I wasn't the nicest after this and asked what she wanted. I guess she didnt like my tone and got kinda snippy with me asking if I ate anything. I said no again not in the nicest way and that I think got her a bit more mad as she went on a tangent about how I had \"all day\" and how I could've \"done the dishes once I got home\" or how \"I need to be more observant when home alone\"\n\n(This is where I might be TA) I got pretty annoyed and told her to fuck off which got her really mad and she told me to drop the attitude and stop acting like a dick. She left and I thought that was that, my oldest stepsister came in later in the night when I was getting ready for bed asking what happened. When I explained the full story she said I was \"acting like a brat and should just apologize\" I don't think I did anything wrong\n\nthoughts and advice on this whole mess?\n\nTL;DR:I was giving my stepsister attitude when she got home from work cause she interrupted me playing with my friends and my other stepsister is taking her side saying I need to apologize.",
        "created_utc": 1678841237,
        "upvote_ratio": 1.0
    },
    {
        "title": "I (25F) got block by my co-worker (25M) for no reason ?",
        "author": "Large_Bar_7032",
        "url": "https://www.reddit.com/r/relationships/comments/11rgn4o/i_25f_got_block_by_my_coworker_25m_for_no_reason/",
        "text": "[removed]",
        "created_utc": 1678841229,
        "upvote_ratio": 1.0
    },
    {
        "title": "did he block me because he has feelings for me ?",
        "author": "Large_Bar_7032",
        "url": "https://www.reddit.com/r/relationships/comments/11rgjzm/did_he_block_me_because_he_has_feelings_for_me/",
        "text": "[removed]",
        "created_utc": 1678841055,
        "upvote_ratio": 1.0
    },
    {
        "title": "My boyfriend [50M] got a job out of state and doesn’t seem to care if me [29F] moves with him? Dating 6 months.",
        "author": "Dependent-Still2613",
        "url": "https://www.reddit.com/r/relationships/comments/11rgfh0/my_boyfriend_50m_got_a_job_out_of_state_and/",
        "text": "[removed]",
        "created_utc": 1678840815,
        "upvote_ratio": 1.0
    },
    {
        "title": "Smelly housemate",
        "author": "No_Needleworker8477",
        "url": "https://www.reddit.com/r/relationships/comments/11rgerj/smelly_housemate/",
        "text": "\nMe (22F) and my boyfriend (25m) live with a housemate (25m). The housemate is a friend of my boyfriends and he’s a pretty nice guy. However, there are a few problems I’ve noticed recently.\n\n1. He STINKS. Like really bad. I can’t be in the kitchen/living space when he’s there because it’s so bad. I am pretty sensitive to smells, but my boyfriend notices it too it just doesn’t seem to affect him as bad as me.\n\n2. He never leaves the living space. We have a kitchen/dining/living room all in one and he is always there. He works from home mostly so he sits on the couch with the tv on from 8/9am everyday and then stays there until the evening. If me and my boyfriend want to watch an ep of something we have to ask, and he always says yes but tells us he wants to watch a show of his right after (even though he’s been at the tv all day!!). We all pay an equal amount for our tv every month (including the actual physical tv, the box and our wifi) so I just think it’s really unfair.\n\nHe hasn’t got a desk or room for a desk in his bedroom, so I understand he doesn’t want to work from bed. However! We do have a perfectly good kitchen table and also a co-working space just below our apartment that is included in our rent. So it’s a little frustrating when he’s constantly on the couch on front of the tv.\n\nI also mostly work in the evenings so he has the tv the whole time before I leave for work and then he’s always there when I come home.\n\nAny advice on how to handle this? It’s also really bothering my boyfriend.\n\nTldr; my housemate stinks and is constantly (literally from morning to night) in front of the tv, what do I do?",
        "created_utc": 1678840775,
        "upvote_ratio": 1.0
    },
    {
        "title": "I (43M) want to subscribe to the OnlyFans of an acquaintance (21F)",
        "author": "pubpubchub",
        "url": "https://www.reddit.com/r/relationships/comments/11rgdvx/i_43m_want_to_subscribe_to_the_onlyfans_of_an/",
        "text": "[removed]",
        "created_utc": 1678840728,
        "upvote_ratio": 1.0
    },
    {
        "title": "Smelly housemate",
        "author": "No_Needleworker8477",
        "url": "https://www.reddit.com/r/relationships/comments/11rgcqv/smelly_housemate/",
        "text": "[removed]",
        "created_utc": 1678840663,
        "upvote_ratio": 1.0
    },
    {
        "title": "I’m not sure if this guy 24M wants to actually hang out with me 24F. We hung out once and he expressed interested about me to myself and my friend, but he’s been inconsistent and distant recently. He hasn’t coordinated another hang out yet.",
        "author": "National_Lab_8669",
        "url": "https://www.reddit.com/r/relationships/comments/11rgc55/im_not_sure_if_this_guy_24m_wants_to_actually/",
        "text": "[removed]",
        "created_utc": 1678840630,
        "upvote_ratio": 1.0
    },
    {
        "title": "I (43M) want to subscribe to the OnlyFans of an acquaintance (21F)",
        "author": "pubpubchub",
        "url": "https://www.reddit.com/r/relationships/comments/11rga8j/i_43m_want_to_subscribe_to_the_onlyfans_of_an/",
        "text": "[removed]",
        "created_utc": 1678840527,
        "upvote_ratio": 1.0
    },
    {
        "title": "My boyfriend (50M) got a job out of state and isn’t really concerned about me (27F) moving with him?",
        "author": "Dependent-Still2613",
        "url": "https://www.reddit.com/r/relationships/comments/11rg7wr/my_boyfriend_50m_got_a_job_out_of_state_and_isnt/",
        "text": "[removed]",
        "created_utc": 1678840404,
        "upvote_ratio": 1.0
    },
    {
        "title": "I (23m) have always thought I was gay but really want to date a woman (23) I study with.",
        "author": "seeking-jamaharon",
        "url": "https://www.reddit.com/r/relationships/comments/11rg54o/i_23m_have_always_thought_i_was_gay_but_really/",
        "text": "I have literally always identified as gay and had zero interest in women until recently. This past year I started to realize that I am bisexual but haven’t really seen myself being in a relationship with a woman. I generally prefer men, my only previous relationship was with a man, and I have had all of my sexual encounters with men. I’ve been with all types of guys in lots of different situations, so I’d consider myself pretty experienced with men. It’s been a little nerve-wracking thinking about moving away from a strictly homosexual identity but I figured I would have lots of time to adjust and navigate it since I don’t have very deep attraction for women, nor do I experience it frequently.  \n  \nLast semester, I started grad school on the other side of the country. There is a woman in my program who started at the same time. Last semester we hung out with mutual friends a few times and it was fun but I didn’t really know her that well. This semester she is in two of my classes and has started playing pub trivia with me and two of my (straight male) friends. She’s super fucking smart and very pretty. I’ve started to realize that I really like her and want to try dating her, but quite frankly, girls scare me. I’m not sure if she knows me as gay or bisexual since I usually just call myself gay, but when she once referred to me as gay I said “I’m like a four on the Kinsey scale” because for some reason I didn’t feel like I could just fucking say I’m bisexual. I know she is attracted to men. She is very open to spending time with me and has studied and eaten lunch with me when I’ve asked her, plus she’s asked me if she could join our trivia night before. She laughs at almost everything I say, which I know is supposed to be a sign of interest but I haven’t seen how she interacts with men outside of our trivia team, so I don’t know if that’s just how she is.  \n  \nI know women are just people and direct communication still works perfectly fine, but I’m just really nervous. I don’t know how to flirt very well with men, much less women. I would feel REALLY bad if she finds me non-threatening because she thinks I’m gay and then I turn around and hit on her. I also don’t want to make classes awkward. But I also really like her. I know she’s actively dating, so I would hate to miss my chance because I couldn’t figure out what to do or how to explain my sexuality. What do I do!?!?  \n \nTL;DR For the last five years I have been confidently gay but my sexuality is more fluid than I thought and I met a woman I want to be with a lot sooner than I thought I would. I don’t know how to navigate explaining this situation to her and asking her out.",
        "created_utc": 1678840261,
        "upvote_ratio": 1.0
    },
    {
        "title": "Always arguing",
        "author": "ShubShar",
        "url": "https://www.reddit.com/r/relationships/comments/11rg0z3/always_arguing/",
        "text": "Relationship advice\n\nI am 27M and my gf is 25F and we have been dating for 5 months now. Before starting to date we became good friends with no intention of dating each other but then she started having feelings for me and finally we started dating. We were having very good conversations in the beginning and then it started to fade away. She just says no to everything I propose for instance a day trip, swimming, ice skating etc etc. In the beginning i found it annoying but finally i came to realize she just wants to play hard to get.\n\nThe reason of our first major argument was probably very silly. My friend who also know my gf and they get along well asked me to go for ice skating. I asked my gf and she responded, she doesn't know, maybe not. Now i could have asked her again and beg but it just turned my mood off so i changed the topic. Next day my friend asked me if my gf is coming or not i jokingly said ask her maybe she will listen to you. When he asked she said yes immediately but then she realized, oops that was too quick so she told my friend to ask me first. Anyways, i went with her without any argument.\n\nShe goes to denial mode very quickly on small things like if I say please lets not cook oily food my cholesterol is messed (which really is). One might think that's no big deal, but she has to give me a reason of how i have been mislead about oil being unhealthy. I know for sure she doesn't believe in anything during that moment. But she has to oppose. \n\nSo I addressed the issue of not having good conversation lately and she just thought in her mind i m telling her that it's her fault. I didn't lose my calm and explained it to her that i want to genuinely know who do you have good conversations with? So i was expecting she would say her best friend or sister or someone who she knows for a long time but she responded one of our mutual friends. If it was the truth, I suck or if she wanted me to make jealous, why would you do it? So stick to that comment for long but finally moved on.\n\nTl;dr! Anyways, I am also stubborn, doesn't really let go of the things easily but I m quite easy going, I enjoy spending time with my gf so i just say yes to everything she asks for.\nShe is loving, caring and gentle but we have different understanding for almost everything. \n\nPlease advise how can i deal with this situation, how can i work on me to let go of small things? Am i acting like immature?\nShould i end this relationship?",
        "created_utc": 1678840045,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is my relationship with my friend too intimate, or is my ex just delusional?",
        "author": "Petty_Fact_Checker",
        "url": "https://www.reddit.com/r/relationships/comments/11rfxj3/is_my_relationship_with_my_friend_too_intimate_or/",
        "text": "**TL;DR:**\n\nMy girlfriend of three years thought I was too close with my best friend of 21 years, accused me of cheating and then tried to bribe my best friend to stay away from me, I broke up with her.\n\n**Not TL;DR:**\n\nMy (26F) ex-girlfriend (Rachel, 27, together for 3 years) and I broke up just over a month ago over this.\n\nOne of my friends (Andrea, 26F, friends for 21 years) and I are occasionally mistaken for a couple - people don’t seem to think that two lesbians could possibly be platonic.\n\nIn school we used to get bullied an awful lot (we both came out at similar times, we were the only known lesbians in the school and were very close friends, so people assumed that we were dating, and of course showered us in a number of slurs and other colourful language).\n\nThe two of us frequently hug, hold hands, and go out together (which are things that I’m pretty sure most people would do with their friends).\n\nI’ve told her that I loved her multiple times, because I do - platonically. I understand that a lot of people might find this a bit odd but if I can say that I love my brother, why can’t I also say that I love my friend when it’s the exact same type of love?\n\nWe never kiss or do anything sexual, and I wouldn’t consider having friends to be cheating, but Rachel apparently does. She never really liked Andrea, and for some reason saw her as some kind of opposition or competitor. I have no romantic or sexual interest in Andrea, and she has expressed that the feeling is mutual.\n\nAndrea rang me while Rachel’s brother had visited and we were chatting with him, so I left the room to answer the call. When I came back their conversation stopped abruptly, which I took as a signal that they were talking about me.\n\nThis was confirmed when that evening, after her brother had left, Rachel confronted me. She demanded to know exactly how I felt about Andrea, and said that her brother had told her that my ‘she’s just a friend’ sounded exactly like how his ex used to talk about the man she was cheating on him with. Rachel wanted me to cut of communication with Andrea because my friendship with her made her uncomfortable.\n\nI would probably understand if there was something specific that she wanted me not to do, but I won’t even consider shutting off any contact to Andrea.\n\nShe and I have been friends since we were 5, and my friendship with her is one of the most important things to me.\n\nAutistic women (I am one) tend to have one or two very close, intense friendships. That is the kind of relationship I have with Andrea - nothing more.\n\nI love Andrea just as much as I did Rachel, but in very different ways and I would never cheat on Rachel.\n\nI didn’t want to make Rachel feel uncomfortable, but I also thought that she was being incredibly unreasonable, and I told her as much. She didn’t say anything, just left the room, and didn’t bring it up again so I assumed she had decided it wasn’t an issue.\n\nBut then she told Andrea to stay away from me, even offering to pay her for it, and as soon as Andrea told me this had happened (she obviously declined Rachel’s oh so generous offer) I broke up with Rachel, as I considered this to be going much too far.\n\nWould you consider my relationship with Andrea to be cheating? Am I being stupid and not seeing something blatantly obvious that I was doing wrong?\n\nThere have been some situations in the past where I was apparently flirting with someone without realising that I was doing so, maybe this is a similar situation?",
        "created_utc": 1678839863,
        "upvote_ratio": 1.0
    },
    {
        "title": "I (m22) was ghosted by a girl (22) now she’s messaged me again",
        "author": "Sa_Supreme",
        "url": "https://www.reddit.com/r/relationships/comments/11rfvnh/i_m22_was_ghosted_by_a_girl_22_now_shes_messaged/",
        "text": "This girl I’d met from tinder, we got on with things quite quickly. We’d speak every day and called each other for about week then she stayed over at my place (We didn’t have sex because she didn’t want to but cuddled and that other stuff). Ever since that night I knew something changed between us because we didn’t have the same vibe as we did before she stayed over. Her energy over messaging had died off, dead responses and one sided conversations. I gave her space for a few days but still the same energy afterwards. We had a plan to go get coffee which she said she’d let me know if she could make it. Yes, you guessed it nothing happened she didn’t even let me know at all. I didn’t even bother to let her know how I felt because it was clear how much she wasn’t interested in me. About 2 weeks have gone and shes just messaged me “fuck sorry I’ve had so much drama I’m trying to help out with how have you been”. What do y’all think about this?\n\nTL;DR! I’m gonna keep messaging but I’m not interested in her as I once was",
        "created_utc": 1678839762,
        "upvote_ratio": 1.0
    },
    {
        "title": "I[M23] developed incredibly serious feelings to me FWB[F37]",
        "author": "Bombardaroma",
        "url": "https://www.reddit.com/r/relationships/comments/11rfvbc/im23_developed_incredibly_serious_feelings_to_me/",
        "text": "[removed]",
        "created_utc": 1678839745,
        "upvote_ratio": 1.0
    },
    {
        "title": "My boyfriend (29m) of 8 years hardly helps me (29f) with daily household chores. Now he’s using being “sick” as his excuse for not helping.",
        "author": "Moist-Television6411",
        "url": "https://www.reddit.com/r/relationships/comments/11rfuzv/my_boyfriend_29m_of_8_years_hardly_helps_me_29f/",
        "text": "[removed]",
        "created_utc": 1678839730,
        "upvote_ratio": 1.0
    },
    {
        "title": "When affection feels like love but it isn’t.",
        "author": "jamsylm",
        "url": "https://www.reddit.com/r/relationships/comments/11rfrfe/when_affection_feels_like_love_but_it_isnt/",
        "text": "It’s been nine months of him (23) and I (23) being more than friends, but not quite a relationship, which I’m fine with. I’m graduating soon, he’s going off to grad school soon, a relationship just doesn’t rank very high on either of our priority lists. \n\nI don’t understand, though, how I’m the one he calls when something exciting happens or something upsets him; or how he can breathe the biggest sigh of relief when he sees me and latch on to me and refuse to let go; or how when we sleep together, he anticipates my every toss and turn and moves his body to best accommodate me; but he doesn’t actually love me. \n\nHis friends tell me this is the happiest he’s been. I’ve seen how, over time, he’s turned from being almost touch averse to the most affectionate anyone’s been with me. He told me that he’s never felt more comfortable around anyone, his best friends included. And he even wonders if he should go to a school closer so we can give this a try. But he just doesn’t have those feelings for me. \n\nI guess I’m just curious to hear anyone else’s story who’s been in this position. I know a relationship would be out of the question right now (and shouldn’t I be glad there’s nothing complicating this?) but, man, I just feel so thrown. How can it feel so much like love if it isn’t?\n\nTL;DR: Been seeing a guy and the affection feels more intense than a regular fling but it isn’t. Curious to hear similar stories for support.",
        "created_utc": 1678839550,
        "upvote_ratio": 1.0
    },
    {
        "title": "I really need help guys (LDR)",
        "author": "unfit_fool",
        "url": "https://www.reddit.com/r/relationships/comments/11rfhx3/i_really_need_help_guys_ldr/",
        "text": "[removed]",
        "created_utc": 1678838979,
        "upvote_ratio": 1.0
    },
    {
        "title": "Former FWB reached out to me",
        "author": "rustedpineapple58",
        "url": "https://www.reddit.com/r/relationships/comments/11rfhdm/former_fwb_reached_out_to_me/",
        "text": "[removed]",
        "created_utc": 1678838945,
        "upvote_ratio": 1.0
    },
    {
        "title": "I (18M) seem to be completely romantically and platonically incompatible with anyone my age.",
        "author": "Embarrasment1312",
        "url": "https://www.reddit.com/r/relationships/comments/11rfesx/i_18m_seem_to_be_completely_romantically_and/",
        "text": "[removed]",
        "created_utc": 1678838750,
        "upvote_ratio": 1.0
    },
    {
        "title": "How can you tell if he sees you as someone to be with?",
        "author": "[deleted]",
        "url": "",
        "text": "[removed]",
        "created_utc": 1678838704,
        "upvote_ratio": 1.0
    },
    {
        "title": "I (23M) think I'm in love with my best friend (23F), I need help with how to proceed",
        "author": "middleeasternboxer",
        "url": "https://www.reddit.com/r/relationships/comments/11rfand/i_23m_think_im_in_love_with_my_best_friend_23f_i/",
        "text": "[removed]",
        "created_utc": 1678837334,
        "upvote_ratio": 1.0
    },
    {
        "title": "My (35f) bf (38m) complains about everything",
        "author": "idbdhduwbx",
        "url": "https://www.reddit.com/r/relationships/comments/11rfa6v/my_35f_bf_38m_complains_about_everything/",
        "text": "My bf is very kind and gentle and pretty much does whatever I want to do on dates but he complains about everything allllll the time. \n\nNow I have a joke that complaining is my favorite hobby, and I enjoy it sometimes, but I’m actually a pretty optimistic person most of the time. \n\nMy bf complains about literally everything. He complains about his parents, his pets, everything about his job, his apartment. He’s complaining about like little things that we all have to do like buying furniture or going to the store. \n\nWe go on dates together but there are things he refuses to do. He won’t dance. He won’t go to concerts. He doesn’t really like comedies but he’ll watch them when I do. He likes very bland foods without sauce. Everything we watch or learn he’s like mildly impressed or predicts the ending before it happens. Probably like 20% of the time he’ll be genuinely impressed with a show we see. \n\nIt’s kind of starting to drain my energy and I know this sounds very spiritual but I’m worried it’s lowering my vibration. I have a very stressful life and I have been through a lot and I have gratitude. Whereas, I feel like he hasn’t been through any real hardships and doesn’t have perspective. What should I say to him? \n\nTl;dr bf complains about literally everything",
        "created_utc": 1678837019,
        "upvote_ratio": 1.0
    },
    {
        "title": "Girl (21) ghosted then messaged me (22) again",
        "author": "Sa_Supreme",
        "url": "https://www.reddit.com/r/relationships/comments/11rfa24/girl_21_ghosted_then_messaged_me_22_again/",
        "text": "[removed]",
        "created_utc": 1678836925,
        "upvote_ratio": 1.0
    },
    {
        "title": "If there’s a will , your ex will find a way 😭",
        "author": "user242020",
        "url": "https://www.reddit.com/r/relationships/comments/11rf98q/if_theres_a_will_your_ex_will_find_a_way/",
        "text": "[removed]",
        "created_utc": 1678836310,
        "upvote_ratio": 1.0
    },
    {
        "title": "Unusual to want a long term partner at 26?",
        "author": "narixis234",
        "url": "https://www.reddit.com/r/relationships/comments/11rf94c/unusual_to_want_a_long_term_partner_at_26/",
        "text": "So I’m 26M. I’m trying to date casually right now as I’m still moving around a bit and can’t really commit to one place for the long term yet. Nor do I want to. \n\nBut if I’m totally honest. What I really want is someone long term. Someone who wants to travel with me. Someone who wants to get a place and live with me. Someone who won’t just cut and run after 5 dates. Or just be there for the sex. \n\nI feel too young to feel this way as the average age of first marriage in the uk is almost 38. But I’m also tired of rocking up to dates with girls who smash cocaine on the weekends and only want casual sex with multiple dudes at a time. \n\nI’m tired of being lonely. But also tired of dating girls who are just there for the dick. \n\nWhere do I find this? \n\nTl;dr tired of dating girls that aren’t going anywhere.",
        "created_utc": 1678836215,
        "upvote_ratio": 1.0
    },
    {
        "title": "I 37F posted a personals ad/R4R to see if bf 59M was still responding to them after he swore he'd stopped",
        "author": "WormsOfWhiteFlame",
        "url": "https://www.reddit.com/r/relationships/comments/11rf3rs/i_37f_posted_a_personals_adr4r_to_see_if_bf_59m/",
        "text": "[removed]",
        "created_utc": 1678820485,
        "upvote_ratio": 1.0
    },
    {
        "title": "he used to date a stripper",
        "author": "sabrinasnow16",
        "url": "https://www.reddit.com/r/relationships/comments/11rf36h/he_used_to_date_a_stripper/",
        "text": "[removed]",
        "created_utc": 1678820454,
        "upvote_ratio": 1.0
    },
    {
        "title": "I 24F hung out with a guy 24M and it went well and he said how much he wanted to see me again but is now being distant. He told me and my friend how much he “liked” me but now is giving mixed signals and I’m confused.",
        "author": "National_Lab_8669",
        "url": "https://www.reddit.com/r/relationships/comments/11rf2ea/i_24f_hung_out_with_a_guy_24m_and_it_went_well/",
        "text": "[removed]",
        "created_utc": 1678820416,
        "upvote_ratio": 1.0
    },
    {
        "title": "I 37F posted a personals ad/R4R to see if bf 59M was still responding to them after he swore he'd stopped",
        "author": "ScrewwLoose",
        "url": "https://www.reddit.com/r/relationships/comments/11rezan/i_37f_posted_a_personals_adr4r_to_see_if_bf_59m/",
        "text": "[removed]",
        "created_utc": 1678820230,
        "upvote_ratio": 1.0
    },
    {
        "title": "I (21F) an afraid to confront my sister (23F) over money issues",
        "author": "Jolly_Sun_8184",
        "url": "https://www.reddit.com/r/relationships/comments/11reyzw/i_21f_an_afraid_to_confront_my_sister_23f_over/",
        "text": "This is a bit of a long/confusing story so I’m just going to go with the basic information. This has been an ongoing issue for a while now and I wanted some outside opinions on how to go about dealing with it. \n\nSo, my sister (23F) just recently moved back into our 2 bed family home with her new partner (22F) after quitting they’re jobs in the city they used to live in. I (21F) also live in the family home as I have recently finished University and I plan to stay here until I can get a full-time job and support myself. \n\nIt’s quite cramped and that in itself has caused quite a few issues but the main issue we keep running into is the topic of money. My sister constantly requires more money than my parents and I can afford to give her. They’ve racked up numerous expenses for my mum from constantly changing their minds about what they plan to do next or for getting them out of overdrafts (despite the fact they’ve both claimed to have savings) \n\nAfter looking at bank statements my parents found out that for the past three years they’ve been spending around £500 more on supporting my sister, who at the time was in a full time manager position, compared to me, the student they considered themselves fully financially responsible for. So things have become strained between them because of that. \n\nMy sister will often ask me for money as well. While admitting I am a little better off than her, supposedly, I am by no means able to support her by myself and if I deny her or just offer to buy whatever she needs the money for (within reason) she can get quite aggressive with me, due to my history with her I’m usually to scared to say no when she does. She will call me horrible names or guilt me into the giving her the money, always with the promise of paying me back. Recently she took money out of my account after I gave her my card to pay for an emergency vet bill.\n\nMy parents and I both find this behaviour unacceptable but none of us know how to talk to her about it due to her temper being as bad as it is. \n\nTldr: my sister (23F) gets very aggressive in order to get money and none of us know how to confront her",
        "created_utc": 1678820212,
        "upvote_ratio": 1.0
    },
    {
        "title": "where do I go from here?",
        "author": "Isthisnotmyalt",
        "url": "https://www.reddit.com/r/relationships/comments/11rexsv/where_do_i_go_from_here/",
        "text": "Me(25M), her (25F)\nIt started 10 years ago, the beginning of senior secondary. I've had just moved into a new school to attend cram school in parallel with regular tuition.\n\nMy friend Sam who stayed at my hostel, has this good friend Sarah. Sarah and I go to the same school. Sam and Sarah used to exchange letters, Sam had a crush on Sarah's best friend, I was basically the delivery guy for their letters. Now Sarah, and I were nothing more than acquaintances despite the fact that we went to the same high school.\n\n(our cram schools and hostels strictly forbid mobile phones, hence the letters) \n\nFor certain reasons, halfway through the year Sarah had to shift to another school, but since she stayed in the same boarding as most of the girls in my class the delivery job continued. But, this time a letter or two once in a while, were addressed to me. I found it amusing, she called me a brother and I considered her as a sister.\n\nBut things where not as simple as it seemed, she would often make these grand gestures of love and I'd take it as purely platonic, while reciprocating them however I could. Our schooling years passed, and was quite uneventful except for girls in my class often shipping us as couples while we denied any thing of that sorts. The last day of school, she gave me a huge chart paper with one side covered with \"I love you\" witten in a small handwriting maybe a thousand times, and the other side of the paper addressing me as her brother. I couldn't be more confused, but innocently assumed it was just another one of her weird letters, and kept it with me while we moved onto different colleges.\n\nWe remained in touch for the first few months but soon enough life got in the way. \n\n6 years passed. \n\nCovid hit, my final year at college was completely online and I was back home. She was too, we lived only a mile from each other but had never been to the others home. Despite this, one day out of the blue she texted me asking how I was doing. We hit it off and was on the phone 24*7, talking through the night, calling each other after class reminding the other about the stuff that they had to do, talking about everything under the sun from what was for lunch to what our deepest fantasies were. Eventually, she asked me. \"Do you like me?\". \n\nBy this time I was hanging on to every word she spoke and hoping that she saw me as something more than a brother. Though I hadn't admitted it to her yet, I've had a crush on her from high school, I was afraid of ruining our friendship and had decided not to act on it, or maybe I was just too stupid to spot the obvious signs.\n\nBut anyways, I confessed and she happily rejected, saying \"we are best friends\". I thought to myself that's better than being her brother. We continued our daily phone calls. This went on for an year, until her college had opened back up and I had graduated mine. Now the calls and chat became more infrequent, we had made plans to meetup for a coffee but hadn't seen each other for 7 years now. Except for half an hour when I visited her dad. After I left, she texted me \" I wish we had some time for ourselves\"\n\nMy work, business and her medschool got in between we barely had any contact for an year after things got busy. We sometimes made plans, but nothing ever materialised.\n\nThat was until, last month.\n\nAlmost 3 years after we had begun texting and calling each other. She texted me, \"we make plans, but nothing really works out, right?\". I offered to pick her up from her college and drop her off at her mom's place where she was heading. It'd be a five hour drive and we'd have plenty of time to catchup, get lunch etc.\n\nThe drive was soothing, peaceful, listening to her made all my worries melt away. I realised, though I was thoroughly friend zoned I couldn't help myself from falling for her.\n\nAfter that day, I'd drop her off or pick her up from college almost every weekend. Until, one day she planned an evening out. We grabbed some dinner, and a couple of beer (my first time trying alcohol) and went to her aperment. Suffice to say things got physical.\n\nNext day she said, she was confused and things just happened.\n\nI didn't know what to think, I was taken by surprise. The drive home I felt completely numb. She knew that I had a crush on her, I had even confessed once, yes it was three years ago, but still. Did she just use me?\n\nAnyways, after the initial shock wore off I was completely and madly in love with her. I just could not resist anymore. I continued our weekend drives, because I couldn't stand to be away from her, but I couldn't tell her anything about what I was feeling because I was once again afraid that this time things could go horribly wrong.\n\nAnd she asked me \"do you still have feelings for me?\"\n\nI mean, she knew the answer, I was behaving completely like a man who fell head over heels.\n\nI told her \" it's not that simple, I'll write everything down in a letter\". Before long she was making plans for a trip to a beach, 3.5 hrs from her residency and 6 hrs from my home. There was no way I could get back home the same day. \n\nSo I'm sitting here, writing her letter. I really do love her, but I've no idea what she wants, again she is giving the signs that she is interested in me, but often makes remarks that suggests things are mostly platonic. I can't bear this anymore, I'm agonizing over my own inaction. We don't text or call like before, but we do spend quality time together. I don't want to lose her, but I don't think I can continue being a friend.\n\nTldr; Crush of ten years is also my best friend. I confessed once, three years ago, she rejected me. Last month, we reconnect. One thing leads to another, we makeout. Now she wants to know if I have feelings for her. I'm scared I'll lose her for real this time. How should I move forward?",
        "created_utc": 1678820142,
        "upvote_ratio": 1.0
    },
    {
        "title": "I (29M) was seeing this girl(25F) but she ended it due to being overwhelmed. Suffering from anxiety and depression.",
        "author": "Kitchen_Fancy",
        "url": "https://www.reddit.com/r/relationships/comments/11rex1v/i_29m_was_seeing_this_girl25f_but_she_ended_it/",
        "text": "Tl, dr:I want to be respectful and giver her space but I fell for her hard, the sparks were intense, maybe too intense.\n\nThis is going to be a rant but I would appreciate some advice as it is weighing me down. Be honest!\n\nAs the title states, I (29M) was seeing the truly beautiful girl for a little over two months. We clicked from the Hello and it honestly went from 0-100 so quickly but I didn't think much of it at the time after a series of quite disastrous relationships over the past few years. She was incredible open and honest which honestly brought me out of my shell way faster than I typically would.\n\nShe has mentioned once she thought things were going very fast between us and she liked me but was unsure about her current life situation. Hated her job, previous boyfriend was a right COCK by the sounds of it and was considering leaving the country. I said that's fine, we can just go with the flow and see what happens.\n\nEverything was great for the following two weeks. We often spoke about depression and anxiety, battles with it, causes and how it has affected us but the last weekend I spent with her may have ruined it? Perhaps I am overthinking it, I do that a lot.\n\nFriday was amazing, all night in bed, sex, talking and laughing. Sunday we were both very hungover so we spent the day in bed watching movies and cuddling. She was feeling incredible anxious about work the following day. Monday rolls around, I left early for work and later on she texts me saying the world is falling out from underneath her, she cant breathe and is feeling lost. I tried to soothe her, saying the hangover is probably contributing, only a couple more hours and you'll be done for the day etc.\n\nNow Valentines day was the following Tuesday, I am not a fan of it personally. If you want to do something for someone, do it! Not because the calendar says so. Unsure how she felt about it I said I better do something? She kept mentioning how she wanted me to cook for her sometime so I suggested that...be it at her place because I currently live with my family ( the joys of Ireland). Perhaps this was pushy.\n\nI feel this triggered something for her, she went from instantly replying to taking a few hours. Eventually she did reply saying that's so sweet but she already had plans. Okay no worries?\n\nThe following two days her texts were sparse and dry but I didn't push her in anyway, no point in that right?\n\nSo I rang her on the way home from work to check in, went over to hers, we got take away and had a long chat. She seemed visible distressed and awkward. Eventually said she doesn't think she can keep seeing me, this is getting too serious for her and that this was really bad timing. Knowing it was pointless to try convince her otherwise as much as I wanted too I respected that, had one big final hug, told her she will figure it all out and that I had a lot of fun with her. Said our goodbyes.\n\nWe did text briefly afterwards and I checked in on her a week later to see how she was getting on, said she was doing a bit better and had been thinking about me.\n\nNow at this stage my mind was playing tricks, between work, family and this i was stressed out of my mind. Beyond belief. My therapist suggest I ask her for a cup of coffee, which I thought was And idea but did it anyway and she said she had gone home to visit family.\n\nSo it has been a month since I last seen her, I have somewhat gathered myself back together after a break from work and have come to the conclusion I really liked her, more so than maybe anyone I have met in my 10 years of dating. While we were dating so briefly, I enjoyed every minute of it.\n\nI want to reach out to her, not now but in another month or so. Is that wise? I know giving her space is important.\n\n\\-  Should I leave her be?\n\n  Or is sending a voice note along the lines of:\n\n\\- \"Hey... , I was thinking about you recently, I know things were really overwhelming for you then and I   \n  hope I didn't contribute to that. I just wanted to say I had a had a great time hanging out with you!   \n  You are a lot of fun to be around and I hope things are going better for you! If you ever feel like   \n  grabbing a drink or a bite to eat...I would like to see you again!\"\n\n\\- Or Keep it simple \" Hey I was thinking about you recently and I hope things are going well for you!\"\n\nI don't want to be pushy, perhaps she just wasn't feeling it but honestly if that was the case she is an incredible actress and someone should give her an award.\n\nLet me know what you wise folks think, timeframe, wording, situation, whatever. I really like her, more than any girl I have ever met. I honestly never understood what the spark was.",
        "created_utc": 1678820100,
        "upvote_ratio": 1.0
    },
    {
        "title": "I posted a personal ad/R4R to see if bf was still responding to those posts after he promised he'd stopped",
        "author": "ScrewwLoose",
        "url": "https://www.reddit.com/r/relationships/comments/11revvm/i_posted_a_personal_adr4r_to_see_if_bf_was_still/",
        "text": "[removed]",
        "created_utc": 1678820030,
        "upvote_ratio": 1.0
    },
    {
        "title": "My favorite (29M) said maybe to me (27F).",
        "author": "Familiar_Spot_3867",
        "url": "https://www.reddit.com/r/relationships/comments/11reve6/my_favorite_29m_said_maybe_to_me_27f/",
        "text": "[removed]",
        "created_utc": 1678820001,
        "upvote_ratio": 1.0
    },
    {
        "title": "Broke up with gf due to behavior.",
        "author": "Dentist-Severe",
        "url": "https://www.reddit.com/r/relationships/comments/11reulg/broke_up_with_gf_due_to_behavior/",
        "text": "[removed]",
        "created_utc": 1678819951,
        "upvote_ratio": 1.0
    },
    {
        "title": "Sudden change in girlfriends behavior",
        "author": "yungegg59",
        "url": "https://www.reddit.com/r/relationships/comments/11reuiu/sudden_change_in_girlfriends_behavior/",
        "text": "My girlfriend (F20) and me (M20), have been together for about a year now. We’ve had a healthy relationship and a great time together, and no fights other than small discussions. After Christmas, we’ve had 1 small and 2 bigger fights.\n\nFirst off. My girlfriend studies in a town which is a 40min drive away from me. She moved to the city to study after the summer. Since I work and she studies, we don’t get to see each other often in the workdays(mon-fri), mostly the weekends.\n\nThe weekend before the problem occurred, we had a talk about how we need to get better to bring up relationshipstuff we are thinking about.\n\nThe last fight we had came up because I felt that she swapped our plans out for her friends. This was the third time this happened. She told me all week how much she misses me and want to be with me, and we made plans for me to come and stay the weekend at her. When the Thursday came, she said: \"I’m going to the club on Saturday\". \n\nThis led to me telling her that I don’t appreciate how she swaps me out so easily and that she would snap if I did the same to her.\n\nShe got angry at me, told me how I have no right to get mad at her for wanting to be with her friends. She continued by saying she is living in the city now with new friends and needs to maintain her social life. She said I limit her and if she can’t be \"spontaneous\" when we are in a relationship, she can’t be together with me.\n\nI felt my heart drop because I have been so clear about how okay I’m with her going out with friends to the club or just to hang out. From the start, I was the one pushing her to be social and spontaneous.\n\nThe Friday came, the club on Saturday got cancelled because of her work, and I picked her up. We got to talk face to face, and got to an agreement. Problem solved.\n\nThe weekend was great as usual, only good vibes. \n\nMonday, she started being dry. We have three weeks of summer vacation together, and had made great plans together. One concert, a week in Spain, a few days on her family’s boat with her parents, and a few days in the mountains with my parents. She totally dropped all of our plans except the trip to Spain, so she could work and be able to afford a 10 day trip with her friends to Marbella. All of this without giving me a heads up. \n\nWe had made plans for me to come visit on Wednesday after work. When I arrived she cried.\n\nShe told me the same stuff as before. How I limit her, that she is living in the city and wants to live the \"university life\", which consist of hanging out with friends and partying. She didn’t know if having me as a boyfriend could match with the lifestyle she wanted. She didn’t want to move back to the suburbs to live in my new apartment, because I wouldn’t move to the city for her. She told me this has been a problem since Christmas, but I haven’t had a single clue.\n\n^Let me just throw in that she has been more hyped about moving in together in the suburbs than me which have been saving for an apartment for 3 years. Just an over a month ago, she was looking for apartments we could rent together but I said no to renting.\n\nLong story short, she wanted a break over the weekend for her to think things through. She went on a school trip with no access to phone. On Friday when she came back, she texted me right away and told me to come and be together. \n\nWe discussed and agreed that she needs to get better at talking about our problems to me and that I should be even more clear about how fine I am that she rather wants to be with her friends than staying home with me. \n\nWe had such a good time this weekend after making up. \n\nThe problem, is that I feel something is up. Her behavior is different. She doesn’t give me as much attention, she don’t reply to me compliments anymore. Even the small things like a try-on haul of her new clothes are weird. She didn’t reply to any of my replies of the clothes she got. It was like my opinion didn’t matter.\n\nI don’t know what to think, and I find it hard to talk to any of my friends about this, since they most likely would take my side. I need replies and perspectives from total strangers. \n\nThank you\n\nTL;DR: Girlfriend wanted break out of nowhere. We \"fixed\" the problem, but her behavior is different.",
        "created_utc": 1678819947,
        "upvote_ratio": 1.0
    },
    {
        "title": "Car Accident",
        "author": "Admirable_Potential7",
        "url": "https://www.reddit.com/r/relationships/comments/11res1d/car_accident/",
        "text": "[removed]",
        "created_utc": 1678819805,
        "upvote_ratio": 1.0
    },
    {
        "title": "Sudden change in girlfriends behavior",
        "author": "yungegg59",
        "url": "https://www.reddit.com/r/relationships/comments/11rero4/sudden_change_in_girlfriends_behavior/",
        "text": "[removed]",
        "created_utc": 1678819782,
        "upvote_ratio": 1.0
    },
    {
        "title": "I(27m) think my gf(27f) is pole dancing at her work.",
        "author": "Froyobuttcheeks",
        "url": "https://www.reddit.com/r/relationships/comments/11reqfc/i27m_think_my_gf27f_is_pole_dancing_at_her_work/",
        "text": "\nWe’ve been together for about a year, living together for 5 months. So she works at a fancy restaurant. She’s part of the kitchen staff, the only female with mainly dudes. Lot of girl and dude servers though. \n\nWe’ve had some arguments about her relationships with these men. She’s flirted at work and been “harassed” gotten crushes apparently etc. \n\nSo when she started the job here she mentioned way back that there was a dancing pole in the back somewhere that the cute servers sometimes use. Also a lot of drug use a beer going around. \n\nIt’s been a looong time since I thought about it and I’m starting to see the signs. \n\nShe used to tell me that there would be “dance breaks” and she would get everyone involved, but she made it sound like innocent dancing. Like flossing or doing a weird dance. Not pole dancing. \n\nRecently though I brought up that she used to have fun little dance breaks with her coworkers, and she got weirdly defensive about it. Saying she doesn’t do that anymore, and when she did that was when we weren’t official and she was working somewhere else. \n\nI thought it was strange to add that context, so I reminded her it was about the ‘innocent’ fun dancing breaks during work, like just doing a funny dance or something. She remembered I guess and said oh yeah that’s right or whatever. \n\nThen I started remembering things\n\nI generally drive her to work in the morning usually, now she does night shifts so I don’t. But only a few months ago while driving her to work I noticed she was wearing fishnet. I mentioned it and she said it just “holds things together” that’s all. I didn’t think much about it, but I’ve also noticed she has been buying a bunch of Victoria secret thongs and such. And not telling me. Doing her make up and hair for work when she works at a kitchen but not doing it for me on the days we have off together. \n\nI feel like I might be reading into this too much but I feel like i should bring it up. What should I do here because I don’t have solid proof? \n\nTLDR; suspicious my girlfriend is pole dancing at work for her coworkers. How should I approach this with the ‘proof’ I have which isn’t a whole lot?",
        "created_utc": 1678819705,
        "upvote_ratio": 1.0
    },
    {
        "title": "Feeling Unsafe with Partner",
        "author": "Admirable_Potential7",
        "url": "https://www.reddit.com/r/relationships/comments/11req7a/feeling_unsafe_with_partner/",
        "text": "[removed]",
        "created_utc": 1678819692,
        "upvote_ratio": 1.0
    },
    {
        "title": "We hung out and he seemed into it but now there’s mixed signals, 24M 24F. Does he actually want to hang out?",
        "author": "National_Lab_8669",
        "url": "https://www.reddit.com/r/relationships/comments/11reohe/we_hung_out_and_he_seemed_into_it_but_now_theres/",
        "text": "[removed]",
        "created_utc": 1678819587,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does he actually want to hangout with me? 24M 24F",
        "author": "National_Lab_8669",
        "url": "https://www.reddit.com/r/relationships/comments/11rejps/does_he_actually_want_to_hangout_with_me_24m_24f/",
        "text": "[removed]",
        "created_utc": 1678819304,
        "upvote_ratio": 1.0
    },
    {
        "title": "How would you feel about this",
        "author": "westcoastbambi",
        "url": "https://www.reddit.com/r/relationships/comments/11reizl/how_would_you_feel_about_this/",
        "text": "[removed]",
        "created_utc": 1678819261,
        "upvote_ratio": 1.0
    },
    {
        "title": "This girl (25F) ended it with me (29M) due to feelings of anxiety, depression and being overwhelmed. What should I do?",
        "author": "Kitchen_Fancy",
        "url": "https://www.reddit.com/r/relationships/comments/11rehgv/this_girl_25f_ended_it_with_me_29m_due_to/",
        "text": "This is going to be a rant but I would appreciate some advice as it is weighing me down. Be honest!\n\nAs the title states, I (29M) was seeing the truly beautiful girl for a little over two months. We clicked from the Hello and it honestly went from 0-100 so quickly but I didn't think much of it at the time after a series of quite disastrous relationships over the past few years. She was incredible open and honest which honestly brought me out of my shell way faster than I typically would.\n\nShe has mentioned once she thought things were going very fast between us and she liked me but was unsure about her current life situation. Hated her job, previous boyfriend was a right COCK by the sounds of it and was considering leaving the country. I said that's fine, we can just go with the flow and see what happens.\n\nEverything was great for the following two weeks. We often spoke about depression and anxiety, battles with it, causes and how it has affected us but the last weekend I spent with her may have ruined it? Perhaps I am overthinking it, I do that a lot.\n\nFriday was amazing, all night in bed, sex, talking and laughing. Sunday we were both very hungover so we spent the day in bed watching movies and cuddling. She was feeling incredible anxious about work the following day. Monday rolls around, I left early for work and later on she texts me saying the world is falling out from underneath her, she cant breathe and is feeling lost. I tried to soothe her, saying the hangover is probably contributing, only a couple more hours and you'll be done for the day etc.\n\nNow Valentines day was the following Tuesday, I am not a fan of it personally. If you want to do something for someone, do it! Not because the calendar says so. Unsure how she felt about it I said I better do something? She kept mentioning how she wanted me to cook for her sometime so I suggested that...be it at her place because I currently live with my family ( the joys of Ireland). Perhaps this was pushy.\n\nI feel this triggered something for her, she went from instantly replying to taking a few hours. Eventually she did reply saying that's so sweet but she already had plans. Okay no worries?\n\nThe following two days her texts were sparse and dry but I didn't push her in anyway, no point in that right?\n\nSo I rang her on the way home from work to check in, went over to hers, we got take away and had a long chat. She seemed visible distressed and awkward. Eventually said she doesn't think she can keep seeing me, this is getting too serious for her and that this was really bad timing. Knowing it was pointless to try convince her otherwise as much as I wanted too I respected that, had one big final hug, told her she will figure it all out and that I had a lot of fun with her. Said our goodbyes.\n\nWe did text briefly afterwards and I checked in on her a week later to see how she was getting on, said she was doing a bit better and had been thinking about me.\n\nNow at this stage my mind was playing tricks, between work, family and this i was stressed out of my mind. Beyond belief. My therapist suggest I ask her for a cup of coffee, which I thought was And idea but did it anyway and she said she had gone home to visit family.\n\nSo it has been a month since I last seen her, I have somewhat gathered myself back together after a break from work and have come to the conclusion I really liked her, more so than maybe anyone I have met in my 10 years of dating. While we were dating so briefly, I enjoyed every minute of it.\n\nI want to reach out to her, not now but in another month or so. Is that wise?\n\n\\- Should I leave her be?\n\nOr is sending a voice note along the lines of:\n\n\\- \"Hey... , I was thinking about you recently, I know things were really overwhelming for you then and I hope I didn't contribute to that. I just wanted to say I had a had a great time hanging out with you! You are a lot of fun to be around and I hope things are going better for you! If you ever feel like grabbing a drink or a bite to eat...I would like to see you again!\"\n\n\\- Or Keep it simple \" Hey I was thinking about you recently and I hope things are going well for you!\"\n\nI don't want to be pushy, perhaps she just wasn't feeling it but honestly if that was the case she is an incredible actress and someone should give her an award.\n\nLet me know what you wise folks think, timeframe, wording, situation, whatever.\n\n Tl, dr: I really like her, more than any girl I have ever met. I honestly never understood what the spark was.",
        "created_utc": 1678819172,
        "upvote_ratio": 1.0
    },
    {
        "title": "I need advice about my breakup",
        "author": "Dentist-Severe",
        "url": "https://www.reddit.com/r/relationships/comments/11ref7g/i_need_advice_about_my_breakup/",
        "text": "[removed]",
        "created_utc": 1678819033,
        "upvote_ratio": 1.0
    },
    {
        "title": "This girl (25F) ended it with me(29M) due to feelings of anxiety, depressing and being overwhelmed. What should I do?",
        "author": "Kitchen_Fancy",
        "url": "https://www.reddit.com/r/relationships/comments/11reagf/this_girl_25f_ended_it_with_me29m_due_to_feelings/",
        "text": "[removed]",
        "created_utc": 1678818744,
        "upvote_ratio": 1.0
    },
    {
        "title": "Am I the the bad person?",
        "author": "Dentist-Severe",
        "url": "https://www.reddit.com/r/relationships/comments/11re9k4/am_i_the_the_bad_person/",
        "text": "[removed]",
        "created_utc": 1678818694,
        "upvote_ratio": 1.0
    },
    {
        "title": "I’m a very lost 26 yo man",
        "author": "TomHaydenStan",
        "url": "https://www.reddit.com/r/relationships/comments/11re8v4/im_a_very_lost_26_yo_man/",
        "text": "[removed]",
        "created_utc": 1678818653,
        "upvote_ratio": 1.0
    }
]