[
    {
        "title": "My (32m) girlfriend (27f) quit stripping after we started dating and needs to go back to make some extra money",
        "author": "planetfartboy",
        "url": "https://www.reddit.com/r/relationships/comments/11ormv5/my_32m_girlfriend_27f_quit_stripping_after_we/",
        "text": "When  we first met, she told me up front that she is a stripper and had been  doing it for 4 years to help pay for school etc. As our relationship  progressed, it caused a lot of problems between us (jealously etc.) and  she ended up quitting for good a few months ago because the place she  worked at was really seedy and a terrible environment.\n\nShe  ended up getting a part time hostess job which she really enjoys as  well as doing freelance work that can pay decently but it takes a while  to get her paycheck and it's not consistent. She's really made a huge  effort and has changed everything.\n\nOver  the past few months, she's been working almost daily trying to play  catch up and not be behind on rent. She doesn't live a lavish life, just  wants to be able to pay her bills, but is still struggling at the  moment even with two jobs. She told me she wants to go to Vegas to strip  for a night or two and if she could just make even $700 or anything to  help catch her up and not be behind on rent it would be a huge relief.  She's never done \"extras\" by the way and says it's a lot lighter and  stricter in Vegas. She cares about my feelings and knows how I feel  about the situation, but I also want to support her so I'm in a dilemma  about it because I thought she had given it up for good. She assures me  that Vegas is very strict compared to where we're from and she will  basically be in a bikini (pasties and underwear on) Still makes me  uncomfortable and I wish the two jobs she had didn't make her resort to  falling back on stripping.\n\nTL;DR -  Girlfriend used to be a stripper, gave it all up and has been working  two jobs but it's not enough. She wants to strip in Vegas for a night or  2 to earn some extra cash and play catch up on her bills, but it still  makes me very uncomfortable",
        "created_utc": 1678560295,
        "upvote_ratio": 1.0
    },
    {
        "title": "Should I cut my losses and walk away or be patient?",
        "author": "s00ntobefit",
        "url": "https://www.reddit.com/r/relationships/comments/11orm48/should_i_cut_my_losses_and_walk_away_or_be_patient/",
        "text": "[removed]",
        "created_utc": 1678560249,
        "upvote_ratio": 1.0
    },
    {
        "title": "Should I cut my losses and walk away or be patient?",
        "author": "s00ntobefit",
        "url": "https://www.reddit.com/r/relationships/comments/11orkvr/should_i_cut_my_losses_and_walk_away_or_be_patient/",
        "text": "[removed]",
        "created_utc": 1678560168,
        "upvote_ratio": 1.0
    },
    {
        "title": "My gf [20F] saying some things that breaks my [22M] heart a little. I don’t if I should feel like this. It’s affecting my self esteem a little bit.",
        "author": "realOFM",
        "url": "https://www.reddit.com/r/relationships/comments/11orjub/my_gf_20f_saying_some_things_that_breaks_my_22m/",
        "text": "[removed]",
        "created_utc": 1678560099,
        "upvote_ratio": 1.0
    },
    {
        "title": "My fiancé (m29) converted to Islam (f24)",
        "author": "Rose200000000",
        "url": "https://www.reddit.com/r/relationships/comments/11orix2/my_fiancé_m29_converted_to_islam_f24/",
        "text": "[removed]",
        "created_utc": 1678560038,
        "upvote_ratio": 1.0
    },
    {
        "title": "is this considered a red flag? M 23 jealous of GF 24 previous hookups and ex boyfriends",
        "author": "chemicallover929",
        "url": "https://www.reddit.com/r/relationships/comments/11orhhz/is_this_considered_a_red_flag_m_23_jealous_of_gf/",
        "text": "Hello, My GF (24) and I, M (23) had an argument. The argument is that I found out that the people she has been talking to online are her ex-lovers and her previous hookups. Before we started dating my GF had plenty of hookups and she has openly told me about it. I accepted that. However these so-called past hookups she would still continue to talk with them online saying that these are just her friends. But I understand that I shouldn't be butting into her private conversations and I accepted that but I got worried when I saw that one of those hookups referred to her as babe.  When I asked her about it she responded that the guy was her ex-lover but the last time they met was a year ago and I shouldn't worry about him anymore and I am in the wrong for overreacting and being jealous of her ex bfs and hookups\n\n&amp;#x200B;\n\nTL DR; \n\nIs it wrong that Im jealous and possessive whenever my gf talks to her previous lovers and hookups",
        "created_utc": 1678559944,
        "upvote_ratio": 1.0
    },
    {
        "title": "My fiancé (M29) converted to Islam (F24 here)",
        "author": "Rose200000000",
        "url": "https://www.reddit.com/r/relationships/comments/11orgw2/my_fiancé_m29_converted_to_islam_f24_here/",
        "text": "[removed]",
        "created_utc": 1678559902,
        "upvote_ratio": 1.0
    },
    {
        "title": "My (F18) situationship/best friend (m19) sent me an explicit picture and I don’t know what I’m feeling",
        "author": "LopsidedCodfish",
        "url": "https://www.reddit.com/r/relationships/comments/11orgdy/my_f18_situationshipbest_friend_m19_sent_me_an/",
        "text": "[removed]",
        "created_utc": 1678559865,
        "upvote_ratio": 1.0
    },
    {
        "title": "F29 M31 \"Boyfriend\" lied about working, only for me to find out he attended an event i was at without me.",
        "author": "CMYK--",
        "url": "https://www.reddit.com/r/relationships/comments/11orfb6/f29_m31_boyfriend_lied_about_working_only_for_me/",
        "text": "TLDR For General  and cultural information. I am an American Female (29) and he is a Moroccan Man (31) living here in the states. dating over a year. Wabted to know what was general view of actions that happed\n\nWe have been dating, and when we first started dating, he was the nice person he could be and we moved decently well in the relationship. He was a total sweet heart, and I realise he might have been \"love bombing\" me. either way, it was great. I would be equally affectionate back to him, as it was hard to do all the same things he did for me for a few reasons - this including him having a shared appt and thus i personally didnt have access to the kitchen so i couldnt return the favor and cook for him at times and he always declined coming to my place.\n\nI thought things were going alright, i know i can be annoying sometimes when i get excited and text him, and since learned to only text him somewhat- like good morning everyday and at the end of the day to see how his day was. he always was bad with texts to me. I would also end up always being the one to set up date night as well. we would go out to restaurants like a normal couple and do normal couple things. i never denied bedroom activities when he wanted them either. \n\nHe also repeatedly emphasized his value of privacy, and i respected that, he stated repeatedly he hated anyone asking to many questions. i didnt understand about 3 months into the relationshop why i still was only on a texting app with him and not even texting on the phone. i wasnt even added to his socials and when i asked. he sais its not that big of a deal. so i chopped it up to his personality and maybe a bit of hos cultural upbringing to have such high importance for privacy and learned to respect it. \n\nThen out of no where he blocked me completely from all socials, and the one texting app we were using. No message- no nothing- just completely blocked and ghosted. I was rather upset for a while and tried to move on- only for him about two months later calling me at 3am repeatedly saying how he needs me. I completely abd repeatedly told him off on the phone and in the text app he unblocked me from. and i was rather vuglar to him but he presisted.  \n\nso eventually i agreed to talk to him in person and for that entire night he walked on eggshells around me but was being the utmost polite. we sat in slience and he attempted to kiss me which i blocked him and told him no, to which we sat in more silence, i then got up, and sat next to him and had to talk to him to get an apology out of him, but when I talked to him and explained how the only way i would take him back was if he was willing to be in an actual realtionship.  \n\nhe agreed and looked completly relieved.\n\n\nso things get back on tracl and for a while its good. He threw me a surpise bday little thing at his appt with just me and him and even got me a present. the date after that he wanted to help me get my bike together.\n\nthen shortly after he starts saying he doesnt have time to see me, and i was understanding. he said he couldnt see me every week he was very busy. and i understood. eveually though multiple attempts to try and see him always resulted in him saying no. at that time its been a month since i saw him in person and i always the one reaching out. so i became rather irritated in him. i couldnt understand how in an entire month he couldnt see me for a few hours out of one day. i wasnt asking to see him everyday. once every two weeks or so wouldve been fine. but he even put going to the gym above seeming me at all for an entire month. I always respected his personal life/ privacy/ goals etc. but it hurt he couldnt even move around a gym day to see me. \n\nso out of bordom i found his socials were public but i was personally blocked from them.\n\ni saw one thing that personally irriated me. i invited him to watch the new years ball drop before my birthday in the city- he explained he couldnt as he had to go to work. I once again understood- people dont have always off on the holiday. so i texted him during the day in the city and he explained during nee years eve day- he decided to work from home- but he still had to work. i texted him a bit and thought nothing of it. even after at my birthday i showed him video of the balldrop and he asked questions, questions from someone who wasnt there. such as was it cold, what were the performers, etc.  \nlong story short i saw on his public profile- HE WAS THERE A HALK BLOCK AWAY FROM ME WATCHING THE BALL DROP- and i had the video proof. It extremely irriated me, if you didnt want to hang out, fine, but why lie and say you were working from home and send false photos of 'working from home' showing only his laptop. and the problem he was willing to continue the lie from the questions he asked on my bday. \n\ni confronted him- and all he ad to say was he wasnt with friends watching the ball drop. and now its been over a week since i texted him and he hasnt texted me at all. so now i cant lie and say im not hurting and i dont know what to do.\nthanks!\n\nTLDR UPDATE- Its been over two months since i saw him in person and hes posting happy pictures of himself(taken either by tripod or other person) . i think its clear he does not care at all about me; except as a bedroom toy.",
        "created_utc": 1678559788,
        "upvote_ratio": 1.0
    },
    {
        "title": "I’m (m25) having a hard time trusting a girl or anybody really…",
        "author": "coco-vanish",
        "url": "https://www.reddit.com/r/relationships/comments/11orf75/im_m25_having_a_hard_time_trusting_a_girl_or/",
        "text": "I’m 25 years old. Never been in a relationship. Never kissed a girl. Never had sex. It hasn’t been without trying. I wasn’t the most attractive dude growing up. I’m average looking at best I guess.  I don’t know what I did in my past life to struggle with women but I haven’t any luck. I got bullied really badly all through school. Didn’t go to prom, didn’t have a date. I watched all my friends have girlfriends and have sex in high school and in college. It’s hard not to get resentful when you’re trying your best and have nothing to show for it. I’ve tried the self improvement route. I’ve put myself out there a bit more. Still no luck. Here I am, 25 still no relationship. It’s getting frustrating. I’m really starting ti give up for good. I still feel extremely bad about being a virgin. I know I’ll get bullied for being a virgin but I really don’t care anymore. I’ve had maybe one or two situations that didn’t work out. One girl I ended up ghosting because I found out she had been with 9 guys. I admit it was a bad thing to do but I don’t regret it. It’s frustrating to know pretty much every girl in your age range has been with guys and you won’t be anybody’s first. It’s intimidating and pathetic to have your first time at my age. I feel robbed. I feel robbed of experiences I feel like pretty much everyone else got. I just want a normal life. I’m having a hard time trusting because of this. \n\nTL;DR- Feeling bad about being a 25 year old virgin.",
        "created_utc": 1678559780,
        "upvote_ratio": 1.0
    },
    {
        "title": "Boyfriend (26M) still liking photos of scantily clad women on social media, despite my clear objections",
        "author": "blublahblup",
        "url": "https://www.reddit.com/r/relationships/comments/11ordbf/boyfriend_26m_still_liking_photos_of_scantily/",
        "text": "\nMy boyfriend (26M) and I (30F) have been together almost 3 years, and 3 years on, we still are discussing why he’s liking thirst traps of women on social media that he finds or used to find attractive (he has shown photos of some of these women to me before when we were friends). To me, it is a form of acknowledgement if nothing else that - yes, I see you, and keeps some form of communication open… I really can’t rationalise it to myself in any other way and have found it to be disrespectful not just in this relationship, but with men, who I knew were in relationships and liking my posts or trying to flirt with me before.\n\nHis responses have ranged from, I like a lot of photos to it’s just my friends. But now I see him liking bikini photos of his ‘friends’ from 2019.. I’m really not a jealous type and I don’t want to doubt his intentions either but I haven’t received any half decent explanation in the past year I’ve seen him liking explicit photos or thirst traps and now I don’t know how to bring this conversation up again.\n\ntl;dr: boyfriend who claims to be in a serious relationship can’t seem to stop liking/looking at women on social media",
        "created_utc": 1678559658,
        "upvote_ratio": 1.0
    },
    {
        "title": "Girl (24F) I'm (25M) talking to seems to care but is throwing me off",
        "author": "ThrowRA9474736",
        "url": "https://www.reddit.com/r/relationships/comments/11orbr9/girl_24f_im_25m_talking_to_seems_to_care_but_is/",
        "text": "So a few weeks back, I asked a girl I like to hang out (wasn't the first time). She was happy to do so and asked me whether she should come over to my house or if we should head out. I told her that one of my roommates was having a party (which was a mistake looking back, but can't change anything now) and that we should head out instead. But she proceeded to essentially self-invite herself, and told me we should check out the party and then we can go out. So I said ok, but then she declined to go out once she got here.\nShe then proceeded to have fun and ruthlessly ignored me all night. Then she proceeded to ignore me the next few days, before starting to text me again. Turns out, she's now good friends with the people she met at the party, and she's just ignoring me now. She claims that her feelings about me haven't changed (she rejected me earlier but claims she still values me), but that's such a lie. I just don't know where to go from here, should I cut her off or do something else? I've wasted so much time overthinking. Any help is appreciated, thanks!\n\nTl;dr: invited girl to hang out but things went sideways and we ended up at a party together. Now she just ignores me. Need advice on what to do.",
        "created_utc": 1678559552,
        "upvote_ratio": 1.0
    },
    {
        "title": "F29 M31 Boyfrend lied about having to work only for him to appear at the same event i was at, without going with me",
        "author": "CMYK--",
        "url": "https://www.reddit.com/r/relationships/comments/11or9vt/f29_m31_boyfrend_lied_about_having_to_work_only/",
        "text": "[removed]",
        "created_utc": 1678559424,
        "upvote_ratio": 1.0
    },
    {
        "title": "Girl (24F) I'm (25M) talking to seems to care but is throwing me off",
        "author": "ThrowRA9474736",
        "url": "https://www.reddit.com/r/relationships/comments/11or9ce/girl_24f_im_25m_talking_to_seems_to_care_but_is/",
        "text": "[removed]",
        "created_utc": 1678559393,
        "upvote_ratio": 1.0
    },
    {
        "title": "Boyfriend (26M) still liking photos of scantily clad women on social media, despite my clear objections",
        "author": "blublahblup",
        "url": "https://www.reddit.com/r/relationships/comments/11or8qk/boyfriend_26m_still_liking_photos_of_scantily/",
        "text": "[removed]",
        "created_utc": 1678559348,
        "upvote_ratio": 1.0
    },
    {
        "title": "My (36F) boyfriend (41M) chose weekend chores over visiting my family.",
        "author": "destinationxreached",
        "url": "https://www.reddit.com/r/relationships/comments/11or6u0/my_36f_boyfriend_41m_chose_weekend_chores_over/",
        "text": "My (36F) boyfriend (41M) chose weekend chores over visiting my family. \n\nBackground: We’re together a year and a half; both divorced. I have two kids 4 and 8; he has one, 15- both split time. I have my kids this weekend, minus Friday… he does not. We don’t live together.\n\nWe went out to dinner Fri eve and I mentioned possibly going to my hometown to visit my folks and sisters (hr and half away). This morning I confirmed that’s what I was going to do; my kids want to see their grandparents. We don’t go often - last time was Xmas. I invited him along, of course. \n\nHe declined, saying he wanted to stay back and work on weekend chores. (Errands,post office, oil change, groceries and etc).\n\nI’m annoyed and I’m deeply hurt. I realize I kind of sprung it on him last minute, but I really don’t feel like a priority at this point. I don’t know how to communicate this to him. I don’t even think I want to. I’m a silent and hold it in type and I think this might ruin us. \n\nWhy is it such a big deal? He has accepted this offer only one time. He has met my mother once, never met my father or sisters. I have visited his family multiple times - his moms side twice and his dads side 3 times. I keep saying I’m going to stop asking him so I’m not let down anymore, but I keep finding myself asking.\n\nHe did offer to come over and do something fun tomorrow “if the weather is nice”. I’m skeptical.\n\nAm I expecting too much? \n\nHow do I take a step back and slow things down? We clearly aren’t in the same place. I love this man dearly but wtf. Is he actually just clueless? \n\nTL; DR: My (36F) boyfriend (41M) chose weekend chores over visiting my family. I’m hurt and don’t know what to do.",
        "created_utc": 1678559208,
        "upvote_ratio": 1.0
    },
    {
        "title": "I (18M) have been dating my gf (17F) for about a month now. Where should our relationship be at?",
        "author": "Secure_Philosopher38",
        "url": "https://www.reddit.com/r/relationships/comments/11or355/i_18m_have_been_dating_my_gf_17f_for_about_a/",
        "text": "[removed]",
        "created_utc": 1678558959,
        "upvote_ratio": 1.0
    },
    {
        "title": "Am I overreacting?",
        "author": "Low_Masterpiece2350",
        "url": "https://www.reddit.com/r/relationships/comments/11or2sq/am_i_overreacting/",
        "text": "\nMy boyfriend (20M) went clubbing today with his friends. One of his friends posted a story. In that story my boyfriend was there dancing and then he was playing with a girl’s hair. Her was beautiful unlike my plain brown hair. Hers was dyed and had brown highlights. My boyfriend was playing with her hair and touching it while he was dancing. I started crying after seeing that story. I feel so hurt. He never done it to me before. He never touched my hair that way. But somehow he’s enjoying touching and playing with a random girl’s hair in a club. I feel so sad and betrayed.  But I feel like I’m overthinking it.\n\nTDLR: he said he won’t do anything that’ll hurt my feelings and when I confronted the friend about that story he removed it immediately.",
        "created_utc": 1678558937,
        "upvote_ratio": 1.0
    },
    {
        "title": "My (23M) girlfriend (21f) is struggling with her mental health and it’s starting to affect mine.",
        "author": "jmckrd",
        "url": "https://www.reddit.com/r/relationships/comments/11or1vu/my_23m_girlfriend_21f_is_struggling_with_her/",
        "text": "TLDR: my gf is going through it, and I’m afraid I’m getting dragged down as well.\n\nMy girlfriend and I have been together for almost 2 years. We’ve been each others first serious relationships, and I love her very much. She and I have always had our fair share of mental health issues (depression + anxiety) but the past 6 months she’s really been in a rough spot with her depression. She’s having trouble taking care of herself, and It’s gotten to the point where she’s having depressive episodes when we’re together about once a week. I want to be compassionate and caring towards her, but it’s really starting have an effect on me as well. I try to be the happy and funny guy to put a smile back on her face, but that can only go so far. Moods are infectious, I guess. When we used to hang out, I’d always leave her place feeling better than when I had come over. Now it’s the opposite. I always feel terrible post-her episodes, riddled with feelings of guilt, inadequacy, and self—loathing. By the time I get back to my place, I feel like I’m in a rut. How can I be a good lover if half the time we hang out she ends up sobbing and spiraling? I love her so much and miss the times when spending time with her was a source of joy and happiness. But it seems like our relationship has turned into a feedback loop of sadness and depression. We’ve talked about this quite a bit and I’ve tried to be as supportive as possible. But at the same time I feel that I can’t let her know the extent to which this is affecting me as it could make her feel worse. Just wanted to put this out to the universe as I feel I don’t have many people I can talk to about this.",
        "created_utc": 1678558875,
        "upvote_ratio": 1.0
    },
    {
        "title": "Am I overreacting?",
        "author": "Low_Masterpiece2350",
        "url": "https://www.reddit.com/r/relationships/comments/11or1fp/am_i_overreacting/",
        "text": "[removed]",
        "created_utc": 1678558849,
        "upvote_ratio": 1.0
    },
    {
        "title": "My (20M) boyfriend went clubbing and his friends posted a story. In the story my boyfriend was playing and touching a girl’s hair while dancing. I feel so betrayed and sad. Am I overreacting?",
        "author": "Low_Masterpiece2350",
        "url": "https://www.reddit.com/r/relationships/comments/11or0bd/my_20m_boyfriend_went_clubbing_and_his_friends/",
        "text": "[removed]",
        "created_utc": 1678558776,
        "upvote_ratio": 1.0
    },
    {
        "title": "What to do",
        "author": "Soft-Huckleberry2629",
        "url": "https://www.reddit.com/r/relationships/comments/11oqx5z/what_to_do/",
        "text": "[removed]",
        "created_utc": 1678558557,
        "upvote_ratio": 1.0
    },
    {
        "title": "Cheating ex",
        "author": "Soft-Huckleberry2629",
        "url": "https://www.reddit.com/r/relationships/comments/11oquqs/cheating_ex/",
        "text": "[removed]",
        "created_utc": 1678558401,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is it realistic to want a relationship where familial obligations are kept to a bare minimum?",
        "author": "stonehallow",
        "url": "https://www.reddit.com/r/relationships/comments/11oqlpd/is_it_realistic_to_want_a_relationship_where/",
        "text": "[removed]",
        "created_utc": 1678557779,
        "upvote_ratio": 1.0
    },
    {
        "title": "I (27F) got back together with ex (33M) and am having trouble trusting him",
        "author": "greenbeens95",
        "url": "https://www.reddit.com/r/relationships/comments/11oqk3p/i_27f_got_back_together_with_ex_33m_and_am_having/",
        "text": "For some context, my boyfriend and I were together for about 2 years. He was very hot and cold, occasionally avoidant, never told me he loved me during that time even though I had told him. He was never mean, abusive, etc, but he did have a tendency to pull away every time we got close. Eventually I got tired of being pushed away and ended the relationship, although it was immensely painful. \n\n\nWe went NC for several months. He contacted me once during that period asking to meet up, to which I declined. A month later, he reached back out telling me he does love me and always has and was very apologetic which was a side I hadn’t seen from him, ever. \n\n\nI agreed to come back and we’ve been together for about 3 months now. He is being wonderful. He tells me he loves me several times a day, is open about his feelings, drives 2 hours one way to see me, calls me if he can’t see me, texts me consistently and if he’s busy he will communicate that, and in person he’s always been wonderful but here lately everything is just so passionate and amazing. I can be open about my feelings and he never gets mad or impatient, and he no longer pulls away when I communicate I’m upset. He has all but begged me to give him a chance to fix things, and he has admitted I have no reason to trust him. \n\n\nAnd that’s exactly my problem. I don’t trust him. I don’t trust that how he is acting is sustainable. It is like I’m dating a whole new man. When I explained my concerns to him he stated the last time he was open with someone he got really hurt, and that he knew early on he loved me but he was scared to express how he really felt. \n\n\n That sounds sweet and I want to believe him, but I don’t want to get hurt again. When he was hot and cold previously, those cold periods were devastating. Just as an example, I would go from hearing “good morning gorgeous”, to “good morning”, to “morning”, to radio silence even if I reached out. Those simple little words were my first indication that he was slipping away. There were so many times I felt him pulling away from me and I knew it was coming but I couldn’t do anything to stop it. And every time I lost him it hurt more than the last. So as much as I want to believe him, love him, and be happy, I just want to run. \n\n\nI don’t know what to do. \n\n\nTLDR; Boyfriend seems to have changed after period of no contact, but due to previous behavior I’m concerned this is temporary and I will get hurt again.",
        "created_utc": 1678557682,
        "upvote_ratio": 1.0
    },
    {
        "title": "astheist woman living in Muslim country I need to escape please help",
        "author": "Far-Foot-376",
        "url": "https://www.reddit.com/r/relationships/comments/11oqk30/astheist_woman_living_in_muslim_country_i_need_to/",
        "text": "[removed]",
        "created_utc": 1678557681,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is there any chance left for us?",
        "author": "Kind_Cat_1274",
        "url": "https://www.reddit.com/r/relationships/comments/11oqiia/is_there_any_chance_left_for_us/",
        "text": "Hey reddit! This is going to be a lengthy post so I apologize…\n\nSo me (29f) and my bf (30m) have been together for 9 months now. We met online and first months our communication was amazing. Meaning that he would express his feelings and I did the same and we talked about the past and everything very openly. It truly felt amazing and our energies matched completely. But during autumn, we had our first bigger fight. It was due to him spending one on one time with one of his female friends when I was on the trip. he used to have feelings for this woman in the past but nothing romantic ever happened between them. I know it because during this “amazing time” he told me this himself because we were talking about our past crushes etc. Now, this unfortunately made me react really badly. I said some terrible things and later apologized many times and was very remorseful as this reaction stemmed purely from my past serious relationship with a guy whom I was supposed to marry and who cheated on me with at least 10 women (his supposed friends) I finally told the story to my boyfriend to make him understand my reaction and trust issues. It was the hardest thing because it opened up these past wounds and made me so vulnerable. At first, he seemed to understand, held my hand and there was even a tear on his cheek. \n\nHowever, ever since that things started to change somehow. Our communication dynamics. Maybe it was that I needed some more reassurance or feeling that he understands me after this long and painful story that almost no one has heard but since he never had a serious relationship before me, I realized he probably he felt helpless and clueless. I noticed that after this fight he never mentioned this girl anymore, even though I know they still talk. But it felt like my boyfriend was too afraid to open this can of worms again and so was I. It started some distance between us. It’s like whenever we are together we don’t want to go to these scary conversations. We don’t live together. We see each other max twice a week. Sometimes more, sometimes even less because he is also very busy. He works full time and goes to school as well. So when we meet each other we just want to have fun, enjoy our time and forget about the world. Which unfortunately has created this issue that we almost never talk about this deeper issues in our relationship.\n\nNow, these few final weeks have been absolutely terrible for us. Since autumn (like mentioned earlier) I noticed that he doesn’t talk to me as much or if he does it’s nothing like in the summer. I know it was a honeymoon period and all but he would say nice things to me all the time which made me feel safe, seen and understood. Now he is barely saying anything like this. I don’t feel this emotional connection as I did before. During work he almost never says anything like good morning etc. Before I never had to ask for that. It felt like he was proud of us and I was constantly on his mind. We finally had a huge fight again because there were days of silence and finally I snapped and told him that I can’t function like this in a relationship and again some toxic things like “go to your friends and online dating sites etc” (out of these past wounds and insecurities) to which he basically told me that he cannot see the future for us any longer because of my insecurities and he cannot prove himself endlessly to me. That we enjoy each other’s company but we don’t work as a relationship. This felt absolutely terrible as I actually never imagined him to end this as he has always been the one who says let’s talk about this (even if he doesn’t know how to talk) I started to apologise the next day and told him please let’s talk. He was very hesitant but agreed. He told me that he doesn’t want to break up but has lost the hope on us. And that saying this makes him extremely sad.\n\nYesterday we finally met and even cried together. We decided that we would give it one more chance but things are extremely fragile right now. I feel like when we text each other it’s sooo difficult, like almost a burden to say anything at all. It feels like we already grieved for the BU but are still together now? So hard to describe. I really want this to work. I really want to be able to trust him completely. He feels that he cannot reassure me as much as I need (when in fact i would be totally fine if he did it even a littttle bit sometimes because during summer he told me sweet things every single day) but me asking this reassurance makes both of us feel like it’s not sincere and before we get there, for him to start to feel and express himself more, I’m already insecure again and making a problem (so we are back to square one) thinking that he might want someone else, thinking about this girl and how he is about to abandon me soon because it honestly feels so cold some days. His communication. Every time when we are physically together it feels amazing but as soon as we are apart, I start to worry. I absolutely hate that I feel this way. Especially when at first it was the very thing that drew me in. How easy it was to communicate without having to “ask” for simple communication. He has done nothing to really make me not believe him except that he has this friend and his communication style has changed compared to the first months. I really REALLY want to be able to trust him and believe his intentions are good. I am thinking about starting therapy as well because I know these trust issues are my responsibility. But I can’t shake this feeling or question will this ever work? If he basically almost left me. I mean, he said it out. We had never said it out. This BU thing. I am feeling so hopeless at the moment. It didn’t help that I noticed that he suddenly had a passcode on his phone all of a sudden. I feel like he doesn’t believe in me he cannot open himself to me anymore because he is constantly feeling on the edge or is scared of my reactions. I would like to be comfortable with the fact that he has female friends or whatever. I just don’t know if we can ever see each other again with the same innocence and spark as we did at first when we talked about anything and everything without this emotional distance. Is it realistic that he will ever see me again in the same light as he did at first? Or is it gone forever?\n\nI am very sorry for this long rant. I just wanted to get it off my chest so badly. Thanks for anyone who read it and/or answered!\n\nTL;DR: my bf and I are at the end of our rope. We don’t want to break up but we can’t seem to find that lost spark due to my trust issues and him not being as talkative and open as first.",
        "created_utc": 1678557582,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is my (19M) girlfriend (18F) even interested ?",
        "author": "Mayek83",
        "url": "https://www.reddit.com/r/relationships/comments/11oqi0y/is_my_19m_girlfriend_18f_even_interested/",
        "text": "I’ve been dating this girl for 3 months now. I really like her but something bothers me since the start. \n\nFirst of all, she never plans anything. No dates, no hangouts. Nothing. I always have to initiate. \n\nThen, when I ask her why she doesn’t initiate plans, she says that she doesn’t feel the need to see me more than 1-2 times per week. She told it the first month of our relationship. \n\nI always plan dinner, or other activities, but she never does. \n\nI think she asked me to come to her house 4-5 times. Since the start of our relationship. \n\nEven intimacy, I mostly start everything. It’s the same with conversation topics. \n\nOther than that, she is really sweet with me, texts me everyday, calls me, tells me she loves me, reassures me… She also is really shy\n\nIs she really into me ? Am I just having high expectations ?\n\nTL;DR : My gf doesn’t really seem to like me\n\nEdit : I’m starting to feel resentment towards her. It’s hard carrying the relationship and feeling like it wouldn’t work if I stopped putting in effort.",
        "created_utc": 1678557550,
        "upvote_ratio": 1.0
    },
    {
        "title": "I (27F) rekindled relationship with (33M) boyfriend but having lingering trust issues",
        "author": "greenbeens95",
        "url": "https://www.reddit.com/r/relationships/comments/11oqhus/i_27f_rekindled_relationship_with_33m_boyfriend/",
        "text": "[removed]",
        "created_utc": 1678557538,
        "upvote_ratio": 1.0
    },
    {
        "title": "Should I meet up with an Ex-friend?",
        "author": "Obvious-Test5423",
        "url": "https://www.reddit.com/r/relationships/comments/11oqfhi/should_i_meet_up_with_an_exfriend/",
        "text": "[removed]",
        "created_utc": 1678557375,
        "upvote_ratio": 1.0
    },
    {
        "title": "Please talk some sense into me",
        "author": "Bean_Chillin_",
        "url": "https://www.reddit.com/r/relationships/comments/11oqfbp/please_talk_some_sense_into_me/",
        "text": "TW: violence \n\nI need some serious help. I am enrolled in therapy, but it isn’t helping with my attachment to my ex fiancé. My parents did not set a good example of what I should accept from people because they were violent and derogatory. The same goes for my partners in every other long term relationship I’ve had. This is just the one that’s taken the longest to get this bad. \n\nWe spent three and a half years together but in the last 6 months, the frequency with which he lies to me has dramatically increased and the severity of the lies has only gotten worse. Recently, one of those lies was in order to hide a week long vacation with a set of nearly all female colleagues. It’s created a cycle where I can’t trust him, don’t feel important, and constantly question what I’ve done wrong - he then makes it clear that my distrust just discourages him further from being honest. I just wish things were different and better but I know things like that don’t happen overnight. \n\nHe has repeatedly said that he can’t bring me around his friends/colleagues anymore because we had a disagreement in front of them, but they told me that none of them feel that way. When I brought it up to him, he admitted that he just didn’t want me around them. \n\nWhen he gets upset, he has massive aggressive outbursts that generally include insults, screaming and threats. On one of those occasions, he repeatedly called me stupid. I told him that if he called me that again, I would have to remove him from my life. Yesterday, I got my wisdom teeth removed and he was supposed to be taking care of me. I said I wanted to play board games and that Id appreciate if he would ask his friends to play since all my games require more than two people but he mentioned once again that his friends didn’t want me around. \n\nSo, I asked him if I could see the texts they sent him that implied that. When he said I could look, I instead saw that he had told a secret that I was given by my only Alexei to his friend Lauren, who had treated Alexei poorly in the past. \n\nWhen I asked him not to tell my friends’ secrets in the future, he said I was “too stupid” to understand people. So, I kicked him out of the apartment. He’s been living with his parents for the last month, anyway, so I knew he had somewhere else to stay. He blew up - over the course of him leaving, he threw a chair, grabbed my wrist, shoved me, slammed me into the wall, and closed the door while I was still standing in it. Even after he started the behavior, I told him that if he just apologized for calling me stupid, we could worry about the rest later. He said “I have nothing to apologize for” and that he was going to ruin my life. \n\nEssentially, after this course of events, I am well aware that I should never talk to or want to talk to this person again, but I am honestly so incredibly confused why he treats me this way. He turns into a completely different person when he’s angry, but he gets angry so often that I can’t tell which side of him is real anymore. I know I won’t get it, but I guess I want closure or answers. What I really wish is that he would just stop treating me that way \n\nSo, here I am for you guys to tell me how stupid I’m being. Any advice on how to not care about someone in a scenario like this? \n\nTLDR; I grew up being abused, have been in multiple abusive relationships, and am now unable to stop caring about someone who, truthfully, is just less abusive than the other people I’ve had in my life. Now I want tips and to be reminded that being better than some bad people doesn’t make you good.",
        "created_utc": 1678557364,
        "upvote_ratio": 1.0
    },
    {
        "title": "Types of relationship dynamics?",
        "author": "Background_Ad1234",
        "url": "https://www.reddit.com/r/relationships/comments/11oq9jc/types_of_relationship_dynamics/",
        "text": "My girlfriend (26f) of 4 years and I (30m) are trying to figure out whether our relationship goals and what we're looking for align long-term after the most recent falling out. We're basically looking for some pop-sci here. Is there some kind of list of different dynamics or patterns that romantic relationships can follow? Doesn't need to be scientifically grounded, we need vocabulary to talk about our goals. Examples of what a relationship dynamic could be:\n\n* Two people that are both capable of living their own life and are fairly independent, but decide to stick together for companionship and for the security of knowing that someone will have their back in times of crisis.\n* Couples that want to experience new things *together* and thrive of being close to each other.\n* A \"provider\" who enjoys supporting their partner and said partner who feels secure in being taken care of.\n\nHopefully it's clear what I'm trying to get at. As I said, we're very much in need of vocabulary and other potential models.\n\nTL;DR: I'm not sure how much shorter to keep this, sorry.",
        "created_utc": 1678556961,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does he like my friend or am I overthinking?",
        "author": "Dnttalkifudntlikecat",
        "url": "https://www.reddit.com/r/relationships/comments/11oq97b/does_he_like_my_friend_or_am_i_overthinking/",
        "text": "I’ve(f21) been dating my boyfriend (m22) for few months now. He says he really like me and always stays with me but sometimes I feel like he’s interested in my friend(F20). He cheers for her when she sings like he’s so proud about it and even notices when she’s in a bad mood. Last one we went for an outing together. He asked if I wanted his jacket, I didn’t accept it thinking he would get coke he said fine and when I went to the wash room and came back he gave his jacket to my friend. Am I overthinking it all or is he interested in my friend?\n\nTLDR: the guy I’m dating seems interest in my friend(he gives her his jacket, notices her moods)",
        "created_utc": 1678556939,
        "upvote_ratio": 1.0
    },
    {
        "title": "Types of relationship dynamics?",
        "author": "Background_Ad1234",
        "url": "https://www.reddit.com/r/relationships/comments/11oq7sk/types_of_relationship_dynamics/",
        "text": "[removed]",
        "created_utc": 1678556832,
        "upvote_ratio": 1.0
    },
    {
        "title": "I (22M) have this feeling that relationships and the idea of love is pretty... sad...?",
        "author": "ken_kaen",
        "url": "https://www.reddit.com/r/relationships/comments/11oq7qc/i_22m_have_this_feeling_that_relationships_and/",
        "text": "About two years ago, I left the girl who broke up with me. Of course, I still had feelings for her after the break up. I can't completely remember what the feeling tasted like - desperately craving the tiniest affection from someone who could never feel for me the way I felt about her. It wasn't until something snapped inside me when she wanted to reconnect with her toxic ex who messaged her after a year that I pulled myself away. I didn't want to get hurt. I couldn't keep hurting myself - \"I love her\" didn't justify the pain anymore. So I left, and never really looked back.\n\nThe relationship had already become toxic - we were bringing the worst out of each other even though we cared deeply about each other. I was desperate and needy, she was constantly hooking up with and talking about other guys (not to mention lying about it).\n\nAnyway - after I walked away (blocked her because - it was the pandemic), I took the time to process it through therapy, journaling, understanding how one sided love can be selfish and atoning for it. Getting my sh\\\\\\*t together.\n\nToday, I casually asked a friend's girlfriend in her class (she's also a junior in my college) what she's been up to. When I asked it, I meant academically or professionally, but her reply was - \"Oh, she's not into relationships\" - which I knew. She'd always been more into hooking up and flings, and the time that we were together was the exception. Nothing had changed, except... I thought about it again later that evening.\n\nWhy does knowing that she's not into relationships upset me? Is it the idea that she's mature and has a life of her own where she makes her own choices? Is it that I can't respect her choices? Do I want her to feel guilt and remorse for me? What do I want from her? Do I want her to still feel something for me? What is it that I'm feeling?\n\nI think the real tragedy of one-sided love isn't one person loving someone who will never love them back - it's the reality of one person *being loved by someone who they can never love back*.\n\nRemembering that relationship today, I feel sorry for her. Being attractive in the way she is, she'd naturally attracted multiple boys over the years, most of whom she simply didn't have feelings for, or caught feelings for too late. She hated people leaving her.\n\nI can't imagine having to be the one who breaks people's hearts because you just don't feel what they do. I can't comprehend what it's like to bring upon someone the kind of heartbreak I've been through twice so far - no matter how respectful I may be when telling them the truth (not that I've ever had to - I'm more of the post-breakup therapist friend when it comes to girls). I'm not trying to be egoistic here when I put myself in her shoes - I don't see myself as someone who's going to attract so many women at once that it becomes a problem that doesn't allow me to have platonic relationships.\n\nI simply know what it's like to never be the one someone else falls for.\n\nBesides a few moments in that one \"relationship\" I had, I've never been desired by a woman. I've never known what it's like to spend some time alone with someone you have feelings for, I've never done any \"couple stuff\", let alone had my first kiss. And fortunately, I feel that I'm fine with it - I'm used to not having a girl in my life. I mean - I have other things to do for now that I like doing, responsibilities to tend to. It genuinely doesn't bother me as much as it once did.\n\nBut if something's changed, it's that the idea of love scares me. Not because I'm afraid of getting hurt again, but because I wouldn't know what to do. Even if I happened to feel the same way about some girl who likes me, what could I do? Where would it go?\n\nLove is emotional, and compatibility is logical. The realization that it takes both kind of sucks, to be honest. But I'm understanding that adulting is like that. Because, even if it's the ideal kind of love - where you don't need each other but want to be together and choose to be together - there's some level of responsibility. Forget about marriage and family - some might call it an obligation but it takes effort in some places, right?\n\nI'm not sure what to think of love for now, and that's okay. It felt like an intriguing direction of thought and - worth discussing. Even if I don't find answers - I get to experience this idea of love before it changes again. Part of growing up, right?\n\nP.S. Not sure if this was the right sub to post this on - any redirects to a more relevant sub is appreciated!\n\nTL;DR - I don't really feel that great about the idea of love anymore, looking for any advice that might make me and people who relate think differently.",
        "created_utc": 1678556828,
        "upvote_ratio": 1.0
    },
    {
        "title": "Soulmates - Ring Ring 💘 Anticipating Your Loving Embrace! - Psychic Tarot #soulmate #allsigns 2023",
        "author": "Sandy4real",
        "url": "https://www.reddit.com/r/relationships/comments/11oq5wb/soulmates_ring_ring_anticipating_your_loving/",
        "text": "[removed]",
        "created_utc": 1678556705,
        "upvote_ratio": 1.0
    },
    {
        "title": "Me [34M] with my GF [27F] almost 2 years, having marriage/proposal doubts.",
        "author": "fuzedmind",
        "url": "https://www.reddit.com/r/relationships/comments/11oq2fn/me_34m_with_my_gf_27f_almost_2_years_having/",
        "text": "Hey there! We've been together for 21 months, living together for about 6 of those months.\n\nWhen we started getting more serious, my gf told me she had a deadline in her mind of about 2 years of dating before she would need to know whether a marriage was coming or not so she can make plans. For better understanding, she is an immigrant in the US on a work visa, so she does have pressure for marriage, not just from family but also from her situation in that she wants some assurance on where and how she is going to live. Living in the US on a work visa is not a stable arrangement as many recently laid off H1-b tech workers can tell you.\n\nI am empathetic to these needs, and as a 34 year old man (33 when she told me this) I do not have forever either, so I understood this. As we get closer to this deadline though, I am beginning to feel more and more pressure and the thoughts that a marriage that we would have would not be based on a strong enough foundation and wouldn't be for the right reasons. \n\nI love her, make no mistake. She treats me like a king, almost to a fault. We have similar interests and goals. She puts a lot of work and energy into me and I have actually told her it feels like I have a mother sometimes lol. When I have concerns, she listens and takes action to correct things. She is into mindfulness and health and supports me in those goals as well.\n\nShe does not have a demanding career, works maybe 20-25 hours a week as a therapist. I know she wants to do more, but maybe is waiting until marriage where she can legally start her own business to make more. That is part of the problem though, because I feel pressure there to marry her and that I am marrying more of an \"idea\" of her than who she is now. We have a value mismatch around money as well, as her parents have money via inheritance to give her and thus is not as motivated as me to work for my own money which we sometimes fight about. I like working, I enjoy it. She does not.\n\nI also sometimes feel that she was just looking for a man to marry, and I was the safest choice. That doesn't exactly inspire confidence in me that this is right. Maybe this is all an act she is putting on now and then when we get married and she gets her green card then she will change? Again, shaky foundation.\n\nI think to add to this, however embarrassing, is that I am feeling pressure to marry in my own heart and not for the best reasons. I am 34. I am now the oldest child/grandchild in my family to be unmarried. All my friends are getting married and having babies. I am feeling a bit like the music is stopping and if I don't settle now I will end up alone. This fear has been a bit consuming as of late.\n\nI am reasonably good looking, in good health, and make good money in a large metro area. I would probably have a good time dating tbh, but I just don't want to. Modern dating is a hellscape and I am not excited about the prospect of dating other older single people who are afraid of commitment and got left out just like me.\n\nI don't trust my own feelings at times. I can't tell if these are legitimate concerns or if it's just my noncommittal past and fear preventing me from experiencing true happiness. I'm trying to prevent the situation where I marry her for the wrong reasons and then in 5 years we are both miserable. I take marriage very seriously and would rather be alone than in a marriage I hate and have to get a divorce.\n\nI wrote this post because her Mom came to visit from a far away country and they took a road trip for a few days and I've had some alone time to think deeply about all this for the first time in a while. They are back now and I actually expressed a lot of this to my gf last night and she was empathetic and is willing to listen to me as I work this out in my head. That alone I feel is worth a lot.\n\nApologies if this is a bit disjointed I am probably not communicating this so well and of course I cannot encapsulate an entire relationship in a form like this as it's quite complex. But here it is. \n\n---\n**tl;dr**: Having doubts about continuing this relationship into marriage due to pressure and fears. Not sure what to do.",
        "created_utc": 1678556457,
        "upvote_ratio": 1.0
    },
    {
        "title": "I feel like therapy is putting up an emotional wall between my boyfriend and I? 28F and 30M.",
        "author": "Sea-Outcome4157",
        "url": "https://www.reddit.com/r/relationships/comments/11oq0zy/i_feel_like_therapy_is_putting_up_an_emotional/",
        "text": "[removed]",
        "created_utc": 1678556361,
        "upvote_ratio": 1.0
    },
    {
        "title": "[24F] Girlfriend keeps running into her ex on nights out",
        "author": "FractionPrism",
        "url": "https://www.reddit.com/r/relationships/comments/11oq06g/24f_girlfriend_keeps_running_into_her_ex_on/",
        "text": "Hi All,\n\n24M, in a 7 month long-distance relationship, My girlfriend lives in the US. She told me she had a relationship for 4-5 years and he cheated on her they finished 2 years ago.\n\nWhen she went back home one time last night and was out she admitted her ex was in the extended friend group since then she has ran into him multiple times, tonight she said she was going out but text me and said her friends told her last minute he will be going out for the day and night with them and she didn’t know, but she told me last week she wasn’t sure about the “People” going to this party today.\n\nNow that’s all fine but she told me she hates the fact that I have an ex (Jokingly) and she knows I avoid the bars my ex frequents, I always say an ex is an ex for a reason.\n\nIs it strange she keeps running into her ex all the time “unexpectedly”.\n\ntl;dr \n\nGirlfriend keeps running into ex.",
        "created_utc": 1678556303,
        "upvote_ratio": 1.0
    },
    {
        "title": "My (35M) wife (34F) wants to go on a trip to find herself. We have a daughter and I don't know how to deal with this situation.",
        "author": "ThrowRAWorriedHus",
        "url": "https://www.reddit.com/r/relationships/comments/11opxaw/my_35m_wife_34f_wants_to_go_on_a_trip_to_find/",
        "text": "Fake names for privacy.\n\nI (35M) have been married with Charlie (34F) for 6 years and we dated for 3 before the wedding. We have a daughter, Aria, she is 5. I don't exactly know how many details I should include to give you a full picture so I will try to write as many useful informations as possible.\n\nBoth me and Charlie work: I work full time in my family business , while she work part time in an antique shop ( she loves that place). We live in a small town where everybody know each other.\n\nWe have always been a good couple. We rarely argued and we never forgot any kind of festivity or anniversary. We tried to spend as much time with each other as possible, both having fun and dealing with problems.\n\nAfter Aria's birth, Charlie wasn't sure if going back to work or not. I told her that I was fine with both. I earn enough for the whole family so if she wanted to stay at home and I would have found a nanny for Aria if she wanted to go back to work. I didn't want to push her in any way, I wanted it to be her own choice and in the end she choose to go back to work.\n\nMy old nanny, Lara (58F), was still in the business and she was a good nanny/baby sitter and she is a family friend, so we decided to hire her for Aria too. Lara has a daughter, Jane (33F). We are childhood friend and, while we are not as close as we were as children, we are still good friends; she sometimes come to our house with her husband and son for dinner. She is the one who found Charlie her job at the antique shop.\n\nAria is the cutest girl in the world ( yes, I'm a doting father and yes, I may have a bias toward my own daughter.). She is kind, soft spoken, she is shy with strangers but she makes friends easily. She is our little angel.\n\nWe have a good house ( not huge but it's not small) and we split chores equally.\n\nCharlie has a group of friends she hang out with at least once a week. I don't know all of them but the one I know, excluding Lara, are: Linda, Nina and Rachel. Linda and Nina are her old friends from high school, while Rachel is a friend from work. They are all good people.\n\nI don't have any other detail to add so I will simply explain what happened.\n\nRecently ( since 2 weeks ago more or less.) Charlie has been gloomy and absent minded. I tried asking her if something was wrong but she denied. I tried to cheer her up by organizing a weekend trip to the sea ( she loves swimming.) but it was useless.\n\n2 days ago she finally opened up: she said she doesn't know what she want from life anymore, that she loves me and Aria but wants some time away from us to clear her mind. I offered her to go back to college ( she didn't finish it and she regret it) but she said she is not sure that's what she wants to do. Linda and Nina are organizing a trip to France and she decided to join them for two weeks and then maybe keep traveling. She didn't tell me when she will be back or even if she will be back and I'm simply confused. I tried talking with her again but she is dismissive and distant.\n\nI don't know what I should do.\n\nTL;DR : My wife is confused about what she wants from life. She decided to go on a trip with her friends and I'm not sure what I'm supposed to do.",
        "created_utc": 1678556105,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is getting married to split costs sensible and effective? What about wanting to live with a certain someone and wanting to have kids?",
        "author": "LarsLaestadius",
        "url": "https://www.reddit.com/r/relationships/comments/11opwnn/is_getting_married_to_split_costs_sensible_and/",
        "text": "[removed]",
        "created_utc": 1678556061,
        "upvote_ratio": 1.0
    },
    {
        "title": "Living together + Breaking Up = Issues?",
        "author": "TortoisesSlap",
        "url": "https://www.reddit.com/r/relationships/comments/11opreg/living_together_breaking_up_issues/",
        "text": "[removed]",
        "created_utc": 1678555700,
        "upvote_ratio": 1.0
    },
    {
        "title": "[29M][28F] Divorce immediately after marriage",
        "author": "ThrowRA_Kenny",
        "url": "https://www.reddit.com/r/relationships/comments/11opp9a/29m28f_divorce_immediately_after_marriage/",
        "text": " Me (29M) and my wife (28F) married at the end of last year after 6 years of healthy and loving relationship. We had our ups and downs but our views on major values, hobbies and passions aligned. We had many good memories and fun days/nights together.\n\nNo emotional, physical abuse, alcohol use or any other similar things were present during relationship. Please note that several traumatic events (loss in family) happened in her life and she was under a lot of stress a work during 2022. I was trying my best to support her, but perhaps she expected different kind of support.\n\nSeveral months after the wedding wife separated and asked to divorce me stating that she does not love me anymore and was dead inside/lonely for a while, even during our wedding. That I am not the right person to meet her needs. Even my friends are saying that whatever I say (especially positive words), she is turning to a negative perspective. In addition, some facts are changed to fit this divorce narrative or even stating that we were \"rebound\" relationship in a way.\n\nBeing separated for several months, she is stating that she feels alive again and she is enjoying life. Yet when I ask her if she is happy, the answer is no. She has been threatening to divorce several times now, but has not taken any real action (file papers, hire lawyers, sell our assets or take her things). She is not willing to try, go to therapy or do anything to save the relationship.\n\nI've read through many topics in reddit where divorce happened in less than a year and most of those stories had some sort of critical event - infidelity, abuse or addiction. There are no financial or other benefit to gain from marrying and divorcing. Many people have stated that this could be due to infidelity but she is saying that there is no other man. I believe her. I am truly devastated, lost and deeply looking for an answer what happened... At this point, I am indecisive if I should continue fighting for us or start moving on.\n\nPerhaps anyone have a similar story and could share it? Did you end up back together or divorced?\n\nAny other ideas on what could be happening/how should I react would be truly appreciated.\n\nThank you, god bless you!\n\nTL;DR: wife wants to divorce immediately after wedding.",
        "created_utc": 1678555543,
        "upvote_ratio": 1.0
    },
    {
        "title": "Bf (27m) mad at me bc I (21f) can’t stand up for myself",
        "author": "AdTechnical7973",
        "url": "https://www.reddit.com/r/relationships/comments/11opl66/bf_27m_mad_at_me_bc_i_21f_cant_stand_up_for_myself/",
        "text": "Hi.. idk where to start.. \nI’m in a long distance relationship of 3 years. My mom (53f) is overbearing so much so that I have ptsd from it and struggle with trying to do adult things because I have fear it’ll make her mad. In the past 3 years my bf and me have gotten to see each other a total of two times, once when he visited me and once when i snuck out of my families hotel room to visit him while in his state. We most recently made plans for a trip.. no one’s out any money I don’t think.. but when I approached my mom about me going on the trip she told me it couldn’t happen next weekend because she wanted me to go through safety courses. I told this to my bf and he insists that now is the time that I need to reiterate I’m not asking her if I can go that I am going. \nAnd I can’t do it.. I’m having a meltdown over it and can’t find the courage to just push that I’m going.\nSo I asked him if he’d wait just a little longer and I’d go through whatever safety things my mom wanted me to do and when I got there I’d make it up to him.\n\nHe’s very upset about it.. and I understand how he feels.. but I just feel almost helpless. Everytime I do try to stand up for myself with my mom it never works. I just don’t know what to do.. my mom is interfering with a relationship that’s important to me and to him it’s coming off as it’s not important to me because I can’t find the courage to be firm that I’m going to go see him. What can I do?\n\nTl;dr bf (27m) upset with me (21f) for not standing up to my mom (53f), what can I do? I feel helpless.",
        "created_utc": 1678555254,
        "upvote_ratio": 1.0
    },
    {
        "title": "My (27f) boyfriend (30m) has physically attacked me twice in 7 months, I need to stay away from him at the minimum right? I am scared I will go back to him",
        "author": "brokenandconfusedxo",
        "url": "https://www.reddit.com/r/relationships/comments/11opi63/my_27f_boyfriend_30m_has_physically_attacked_me/",
        "text": "TL; DR; my boyfriend of 7 months has attacked me twice in seven months the first time he told me it was all in my head and I believed him after some serious guilt tripping. He's a narcissist and i'm scared I will end up back with him by the end of the week.\n\nTW: Domestic Violence \n\nAlso I'm using my mobile to write this and I am a wreck rn so please excuse any mistakes, this may be pretty long so if you manage to read this thank you 🙏🏻 \n\nAbout me: I'm a 27 year old living in the UK, I have a home I rent and I live with my two cats that are basically what are keeping me from just taking my life right now. I am disabled (heart condition, fibromyalgia, anemia) and I have borderline personality disorder and agoraphobia. I very rarely leave my home the last time I went out was probably about 2 months ago now, I do everything online. I have no friends and my family rarely contact me and due to trauma growing up it's hard for me to talk to them about the weather let alone my general feelings on anything at all. I am overweight, I had to have most of teeth out due to the fact I got so depressed after my last break up I would sleep all day and not wash or make proper food for myself let alone brush my teeth, I hate how I look I think I am physically repulsive especially now I'm overweight and have lost most of my teeth and wear dentures, I have support workers who come each day for an hour who I love so much. It's physically and mentally difficult for to leave my home.\n\nRelationship background info:\nMe and my boyfriend have been together 7 months I have previously been in a 4 year long relationship (20-24) and it's cliche asf but I have never felt this way about anyone or even come close for that matter, I love him with everything I have. On November 19 2022 he came to mine really drunk and he immediately started screaming at me because I asked him to sleep on the couch instead of in my bed or I would sleep on the couch and he could have my bed, I remember him putting his arms around my neck (I'm 5'10  and overweight and he's 5'3 and skinny) he jumped up and I fell on top of him he wouldn't get off me straight away then I screamed at him to leave and I called the police and he was arrested, the police said he was abusive and narcissistic I didn't make a statement or press charges but he got an order put in place (DVPO) and he couldn't see me for 30 days. We got back together and we've been pretty happy but he told me the night of him attacking me I had got it wrong and he can't believe I did that to him and he was in a police cell for 24 hours which has traumatised him he was making me feel so guilty and due to my fibro I have memory problems so I thought I got it wrong and believed him, he hasn't hurt me physically since then but he has been very manipulative and emotionally abusive.\n\n\nThe attack which happened 3 days ago:\nI had my support and he isn't allowed to be here when they are for insurance purposes and because he didn't live with me they won't pay for him to have a criminal record check. He hates the majority of them (2/3) despite me really liking them. He went to the pub for a drink with a mutual friend whilst she was here and he said he'd be an hour he was there for 3+ hours and we got into an argument because he was trying to pressure me into inviting our mutual friend home so they could probably get more drunk and I kept saying no. But he said he wasn't pressuring me (he asked me 3 times after the first time I said no) I decided to voice record when he came home because I was anxious about his return. He started screaming at me the moment I disagreed with me and he put his hand around the back of my neck and the other scarily close to my throat until I screamed, he went into the back room and I asked him to leave calmly as he was screaming at me, he refused so I took his phone and put it outside so he would leave, as I was going to the door he was grabbing and pushing me back and throwing me on the floor I was desperate to make it to the door and as he was grabbing me I screamed help at the top of my lungs and my neighbours from upstairs immediately came to help and got him off me. He left on foot. They didn't call the police as I begged them not too.\n\nSince the incident:\nHe's assuming we will get back together and he has my key, if I get upset about what I did he refuses to come and post my key through my door or get his Mother (who hates me) too atleast. I am feeling terrified to tell the police because he's telling me he will get me arrested for 'lying' to the police last time and I'm black mailing him for my key because I've said I'll call the police to get it back if he doesn't give it back by tonight. My support workers manager for safeguarding reasons had to call the police which he did 2 days ago but they are yet to even call me. \n\n\nPlease stop me going back to him, I just feel like if I don't go back to him I'm going to be alone of the rest of my life and spend 24 hours a day all day by myself.",
        "created_utc": 1678555044,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does my (24F) boyfriend (24M) see a future with us?",
        "author": "Glad_Relation5962",
        "url": "https://www.reddit.com/r/relationships/comments/11opga1/does_my_24f_boyfriend_24m_see_a_future_with_us/",
        "text": "Me and my boyfriend have been together for 9 months now; we've met friends and family and get on really well. Everything seems to be going well.\n\nExcept when ideas on the future come up. He has anxieties because of past relationships, which I completely understand and have compromised for. This is my first relationship so really I'm just anxious with it all being new to me.\n\nI'm the one who usually brings up things in the future, and recently we've spoken about moving in. We both live in our parents' houses and the idea has come up before though vaguely. He has mentioned wanting to get his own flat, which I wasn't fussed about because he'd had this idea before we met so I just thought he can do that and I'm saving for my own house anyway so I'll either move in with him later on the line or we'll get a place together later.\n\nRecently, he's said he's worried I'd \"be offended\" if he got his own place. He's joked sometimes that I'm a bit clingy - and I guess I can be, but I'm an extrovert and he's an introvert, so I guess it's just a difference in personality. I made it clear I wouldn't be bothered, since I thought that was his plan anyway. I've not been super clingy that I don't let him have his own life, either, so I was a bit confused by this statement. Then he was saying he didn't know anyway because he didn't know if made sense to move out by himself, so maybe he used the first thing as a joke/excuse?\n\nThen he was saying he wouldn't want to move in together until he would feel comfortable doing stuff while I do my own thing - which again makes me think he has this idea that I won't leave him alone if we move in together. I've told him before I have my own life, and when I see him I'm all over him - but we see each other once a week, and then we're apart and I do my own thing.\n\nI don't know what to do, whether he loves me but doesn't see a future and is denying it?\n\nTl;dr - my boyfriend keeps making comments that makes me thinks he worries about my clinginess and so he won't want to have a future with me",
        "created_utc": 1678554916,
        "upvote_ratio": 1.0
    },
    {
        "title": "My fiancé (30f) doesn’t prioritize me.",
        "author": "brunomars1992",
        "url": "https://www.reddit.com/r/relationships/comments/11opd5u/my_fiancé_30f_doesnt_prioritize_me/",
        "text": "My fiancé and I have been together for 5.5 years, during which we have lived in two different countries. Last year, I proposed to her. However, for the past 5 months, we have been living apart due to her decision to work in her current company and wait for a transfer before moving closer to me. Even when we were together, she prioritized her work and friends over our relationship.\n\nNow that we have a 7-hour time difference, it has become even harder to find time for each other. Even on weekends, she often prioritizes work or other activities over spending time with me. I have tried to express my concerns to her, but she seems more interested in her career and friends than our relationship.\n\nDespite this, there are qualities that I value in her, such as her positive attitude, trustworthiness, and our ability to avoid arguments. However, I can't help but feel that she doesn't give me the time and attention that I need in a partner.\n\nI am unsure whether to proceed with the wedding or to wait, as I fear that these issues will persist even after we are married.\n\nTLDR; I am in a 5.5-year relationship with my fiancé and proposed last year. We have been living apart for the past 5 months due to work, and even when we were together, my partner prioritized work and friends over the relationship. My partner still does not give enough time or attention to the me, but I am unsure whether to proceed with the wedding.",
        "created_utc": 1678554696,
        "upvote_ratio": 1.0
    },
    {
        "title": "My (27f) boyfriend (30m) has physically harmed me for a second time. I have nobody and i'm scared I'll go back to him.",
        "author": "brokenandconfusedxo",
        "url": "https://www.reddit.com/r/relationships/comments/11opcwa/my_27f_boyfriend_30m_has_physically_harmed_me_for/",
        "text": "[removed]",
        "created_utc": 1678554678,
        "upvote_ratio": 1.0
    },
    {
        "title": "My friend (M21) wants to work at the same place that I (F23) work at but I don’t know if it’s a great idea",
        "author": "Witty_Gate1192",
        "url": "https://www.reddit.com/r/relationships/comments/11opcut/my_friend_m21_wants_to_work_at_the_same_place/",
        "text": "Basically, I have this friend that got fired from his current job for taking stuff without paying for it first and his previous job before that one, he got warnings about him not working properly and coming late and just slacking around. He would also drugs while on his shift. If it was one of my friends that I knew would be reliable and not mess about then I wouldn’t have a problem with it.\n\nBut I don’t know, his past with holding jobs is not great at all and I really like my job and i feel like if he works where I’m at then it will reflect really badly on me and risk my job. Am I just being selfish about this? I want the best for him he’s honestly not responsible right now and I don’t know what to do.\n\ntldr; friend wants same job as me, but i don't want him to because of his reputation with other jobs",
        "created_utc": 1678554676,
        "upvote_ratio": 1.0
    },
    {
        "title": "(20M bf. He went clubbing and I saw his friend’s story. He was touching and playing with a girl‘s hair while dancing. I feel betrayed and hurt.Am I overreacting?",
        "author": "Low_Masterpiece2350",
        "url": "https://www.reddit.com/r/relationships/comments/11opcb7/20m_bf_he_went_clubbing_and_i_saw_his_friends/",
        "text": "[removed]",
        "created_utc": 1678554640,
        "upvote_ratio": 1.0
    },
    {
        "title": "My friend (M21) wants to work at the same place that I (F23) work at but I don’t know if it’s a great idea",
        "author": "Witty_Gate1192",
        "url": "https://www.reddit.com/r/relationships/comments/11opbck/my_friend_m21_wants_to_work_at_the_same_place/",
        "text": "[removed]",
        "created_utc": 1678554578,
        "upvote_ratio": 1.0
    },
    {
        "title": "My fiancé (30f) doesn’t seems to prioritize her time for me anymore.",
        "author": "brunomars1992",
        "url": "https://www.reddit.com/r/relationships/comments/11op858/my_fiancé_30f_doesnt_seems_to_prioritize_her_time/",
        "text": "[removed]",
        "created_utc": 1678554348,
        "upvote_ratio": 1.0
    },
    {
        "title": "(20M) bf went clubbing, his friends posted a story and in the story I saw him playfully touching a girl’s hair while dancing . I’m mad and betrayed. Am I overreacting?",
        "author": "Low_Masterpiece2350",
        "url": "https://www.reddit.com/r/relationships/comments/11op811/20m_bf_went_clubbing_his_friends_posted_a_story/",
        "text": "[removed]",
        "created_utc": 1678554339,
        "upvote_ratio": 1.0
    },
    {
        "title": "My (30f) brother (34m) is a deadbeat dad",
        "author": "throwra22567",
        "url": "https://www.reddit.com/r/relationships/comments/11op2t9/my_30f_brother_34m_is_a_deadbeat_dad/",
        "text": "[removed]",
        "created_utc": 1678554011,
        "upvote_ratio": 1.0
    },
    {
        "title": "Just found out she (f24) cheated on me (m25)",
        "author": "runners-blade",
        "url": "https://www.reddit.com/r/relationships/comments/11op1te/just_found_out_she_f24_cheated_on_me_m25/",
        "text": "\nI hadn’t dated anybody before her.  I was bullied alot during my childhood and developed social anxiety. My girlfriend and I have been dating for five months now.  We get along rather well and share common interests.  Despite that, I learned something that has caused me alot of trouble the past few weeks.  She told me that before me she had been with 13 guys.  I know that she had been with guys before me but I didn’t expect 13. She told me that most of them were hookups that didn’t mean anything.  I honestly didn’t believe her. Every time I think about it, it’s just a reminder of what I failed at in life and how she got to have these fun experiences that I didn’t.  I also feel like my first time wasn’t special since it wasn’t hers. However, I’ve come to find out that she has been cheated on me the past two weeks with one of her exes…. I should’ve seen it coming based on her past. This is why I can’t trust women how have slept around. Can’t say I’m hurt because I should’ve known better. She doesn’t know that I know. I’m debating on whether I should tell her or just ghost her.\n\nTL;DR - Found out she cheated on me with one of her exes.",
        "created_utc": 1678553946,
        "upvote_ratio": 1.0
    },
    {
        "title": "Just found out she (f24) cheated on me (m25)",
        "author": "greater-hope",
        "url": "https://www.reddit.com/r/relationships/comments/11oott2/just_found_out_she_f24_cheated_on_me_m25/",
        "text": "\nI hadn’t dated anybody before her.  I was bullied alot during my childhood and developed social anxiety. My girlfriend and I have been dating for five months now.  We get along rather well and share common interests.  Despite that, I learned something that has caused me alot of trouble the past few weeks.  She told me that before me she had been with 13 guys.  I know that she had been with guys before me but I didn’t expect 13. She told me that most of them were hookups that didn’t mean anything.  I honestly didn’t believe her. Every time I think about it, it’s just a reminder of what I failed at in life and how she got to have these fun experiences that I didn’t.  I also feel like my first time wasn’t special since it wasn’t hers. However, I’ve come to find out that she has been cheated on me the past two weeks with one of her exes…. I should’ve seen it coming based on her past. This is why I can’t trust women how have slept around. Can’t say I’m hurt because I should’ve known better. She doesn’t know that I know. I’m debating on whether I should tell her or just ghost her.\n\nTL;DR - Found out she cheated on me with one of her exes.",
        "created_utc": 1678553384,
        "upvote_ratio": 1.0
    },
    {
        "title": "i (30M) broke up with my first girlfriend (32F).",
        "author": "Sigourn",
        "url": "https://www.reddit.com/r/relationships/comments/11ooref/i_30m_broke_up_with_my_first_girlfriend_32f/",
        "text": " She's been in many relationships. This was my first at 29. I was a kissless virgin.\n\nWe  met in college 10 years ago. The day I met her I thought there was  something special about her. Something about how quickly we hit it off  and became friends. Then a few months later, I told her I liked her. She  said I was confused. Not long after she got a boyfriend, and seeing  their pictures on Facebook proved to be too much for me and dropped all  contact with her.\n\nWe started  talking again on July 2022 after she messaged me. We talked so much,  like I haven't done with anyone until then. She hadn't been with her  boyfriend in 6 years. A few days later I went to pick her up at college  and had a drink.\n\nAs days passed,  conversation turned more and more sexual. Less than two weeks later, I  lost my virginity to her. And yet, even though I *thought* I was in love... I felt like shit after sex. I remember watching her, so in love with me. I just didn't reciprocate.\n\nWe got back together a week later. These feelings, of feeling like shit after sex, *never*  went away. This went on until New Year, when I told her we couldn't be  together anymore because I couldn't stand feeling like this. And this  wasn't *after* sex anymore. More like, I felt like this after any demostration of intimacy. Even kissing her didn't felt comfortable anymore.\n\nRight  after breaking up I regretted my decision, dearly. But it was not the  regret of someone who knew they had fucked up. More like, the regret of  someone who didn't know if they had fucked up.\n\nTwo  weeks later, we got back together again. Sort of. She would stay with  me until I figured out how I felt about her. That didn't last two weeks,  when I again had a breakdown.\n\nA  month passed by since the last time I had seen her. With each day that  passed, I grew more and more confident I wanted to spend my life with  her. Why wouldn't I? She was smart, funny, pretty, we shared many of the  same tastes and opinions. Even though there were some ugly things about  her, which I won't elaborate on, I knew what I wanted. She was  confident, however, that this certainty of mine would wear off if we got  back together, and asked me for **assurance** this wasn't going to be the case.\n\nBut,  sadly, I proved to be more persuasive than I would have liked to... She  came home a week ago, and after an evening of playing games, we kissed  for the first time in two whole months. That's when it happened. It came  back to me. That uncertainty.\n\nYesterday  I went to the house she is taking care of for a month, having arranged a  whole weekend together. From time to time that anxiety disappeared. But  today it was, again, too much to bear. And we agreed to split up, and,  as she had explained to me before, never to talk again.\n\nI  felt relieved. Then sadness came to me, and just now I was in the verge  of tears. I think I finally realized that all I wanted, for the past 9  or so months, was for her to be happy. And the realization she wasn't  meant to be happy with me. That's why I was never jealous of her talking  about past boyfriends. She had not been happy with any one of them. And  what always brought me back to her was thinking I could finally make  her happy this time.\n\nNow she is in  that house, alone, afraid of the night. And I'm here at home writing  this, feeling like the piece of shit I am. I lost what would have been a  dear friend if not because I just didn't know what I wanted to be  around her.\n\nTL;DR \n\nBroke up with my first girlfriend after being a kissless virgin at 29. I think I should have broken up sooner and it breaks my heart for things to have ended like this.",
        "created_utc": 1678553202,
        "upvote_ratio": 1.0
    },
    {
        "title": "Does the stress of moving your family cause you to be rude/annoying?",
        "author": "throwRApido1",
        "url": "https://www.reddit.com/r/relationships/comments/11oopoe/does_the_stress_of_moving_your_family_cause_you/",
        "text": "My \\[24M\\] best friend \\[24M\\] is moving away with his family. Things have been stressful for him and he's run into a bunch of problems.\n\nRecently he'd do things like get distracted with housing prices while we're talking, and announce to coworkers that I got upset at him for not paying attention to me while I'm speaking. When I asked him about this and tried to tell him my feelings, he pulled up his phone to text to a group chat about jokes/memes and said it was \"funny\" to do so. I told him it was rude and disrespectful, and he left the room when I asked him if he was seriously doing that when I was trying to tell him how I was feeling.\n\nHe doesn't usually do things like this, and mostly is very attentive when he isn't stressed. Last time he was very stressed he did a similar thing, get distracted with something tangentially relevant to what was stressing him out and end up making me feeling ignored in the process.\n\nI get that his mind is occupied, but is being a little rude part of it?\n\ntl;dr best friend very stressed, is distracted, acts rude/disrespectful all of a sudden",
        "created_utc": 1678553084,
        "upvote_ratio": 1.0
    },
    {
        "title": "my bf says he can’t be happy until he is famous",
        "author": "plumpkinnss",
        "url": "https://www.reddit.com/r/relationships/comments/11ooouq/my_bf_says_he_cant_be_happy_until_he_is_famous/",
        "text": "First time posting but I’d really appreciate some opinions. My boyfriend (22 M) and myself (22 F) have been together for 2 years and living together for 1 year.\n\nMy boyfriend has always wanted to become a famous rapper and I have always been supportive of his dreams. I’ve been to his studio sessions, helped him write songs, been through it all with him and his music. \n\nBit of extra background, he grew up in a wealthy loving family with parents who have always supported his dreams, even him becoming a rapper. I grew up in a middle class household with a toxic family dynamic.\n\nI’m at the point in my life where I have a really good job, I’m earning a comfortable amount and I have great family and friends supporting me. I also love my boyfriend so much, there are so many amazing qualities about him and I can honestly see myself marrying him someday.\n\nHowever, my boyfriend has always said that he can’t be happy until he is rich and famous. He works an average part time job and expresses how much he hates this. He has tried to move into other industries however has been unsuccessful. I desperately want him to be happy however I do not know if his dreams will come true and this worries me.\n\nI tell him that from my point of view, there isn’t anything wrong with having dreams and being ambitious, but in the end as long as I have a roof over my head, food on the table and him by my side, that is all I need. I try to explain to him the classic, ‘money and fame can’t buy you happiness’ but he is certain that becoming rich and famous is the only way he will become happy.\n\nIt honestly makes me feel like I’m not good enough for him. I have sacrificed a lot in our relationship including moving cities, away from my family and friends to be with him. It is exhausting and upsetting that what we have isn’t enough for him. What should I do? Am I being a bad girlfriend? Why is he like this? Is there anything I can say to him to change his perspective? Thank you!\n\n\nTL;DR: Boyfriend insists he cannot be happy until he is a famous rapper and this makes me upset",
        "created_utc": 1678553024,
        "upvote_ratio": 1.0
    },
    {
        "title": "how to start a healthy relationship?",
        "author": "finstersardinster",
        "url": "https://www.reddit.com/r/relationships/comments/11oolhy/how_to_start_a_healthy_relationship/",
        "text": "Hey guys! To make it short: In my life, I (27f) was r*+%d two times, never really emotional came close to someone and my first love bullied me through school and turned out as a narcissist later on. Safe to say, I'm very insecure about myself, I often only can let loose drunk. Now the last time I drank a little too much, I met a guy (28m) and we got along great. We then landed in my bed together and spent the night, I don't remember much unfortunately. But in the morning after we really connected and talked for hours. We decided to switch numbers and are chatting and he's a great guy so far. Now we've got our first sober date on Monday and I'm very anxious about it. I've been in therapy for my anxiety and got a few mechanisms to use, but this is so new to me. I tend to overthink a lot and to end such \"relationships\" early just to be alone with myself again just to wish to be close to someone a little later. I'm afraid to lose myself in this relationship or to lose my freedom, even though nothing even really happened yet and it's all in my head. Do you have any advice on how I should approach the situation this time? I really would like to grow :) thank you. ♥️\n\nTldr: I don't know how to approach a possible romance due to bad experiences in the past",
        "created_utc": 1678552784,
        "upvote_ratio": 1.0
    },
    {
        "title": "I've (28/M) been on a few dates with someone (30/F) and I feel I've gotten many mixed signals from her",
        "author": "LostInHisOwnWorld",
        "url": "https://www.reddit.com/r/relationships/comments/11ookgv/ive_28m_been_on_a_few_dates_with_someone_30f_and/",
        "text": "Full disclosure, I'm not very experienced at dating. I've only slept with a few people and just started taking dating seriously recently.\n\nWe matched on a dating app and met for drinks 2 days later. I noticed she was a pretty mixed texter, sometimes texting a lot, other times responding with 2 or 3 words. Anywho, our first date went well, ended with a kiss, and we both wanted to meet again.\n\n2nd date went good and we ended up back at her place, though she made it clear she wanted to take things slow. We did some touching but she stopped things before anything very sexual happened. I stayed over, we scheduled the next date, and she texted me a LOT the day after, despite saying on the date that she wasn't a big texter in general.\n\nWe had a 3rd date. Ended up at hers again and we sorta had sex, as in I managed to get it in for 2 seconds before going soft, after which we did hand stuff though neither of us finished. She made it clear that me going soft didn't bother her and she knew it could happen. We cuddled like crazy and I suggested going steady, which she agreed to. Next day, I got quite a few chit-chatty texts from her like last time.\n\nThis last week though, she's been weird. I initiated contact both times, and while she's responded and without delay, her replies have been short. I scheduled another date which she agreed to, although her messages were short and seemed pretty cold, and she got a bit pissed off that I didn't buy the tickets for both of us to the event we planned to go to; I'd assumed we'd get our own. She canceled the next day cus a storm hit our part of the country, but my gut told me that she wasn't that enthused to go to begin with. She did mention having a shitty week at work, which is probably a factor but still, why agree to go in the first place then if you're in a bad mood?\n\nI've gone on a trip to another country for the weekend. After she cancelled our date I said we'd do something when I get back, to which she replied with just a smile emoji, which I found very mixed. That was 4 days ago; she hasn't text me at all, meaning re-initiating contact will again be up to me. I feel that after you've been on a few dates, a girl should be initiating contact at least now and again, although maybe it can differ... Again, lack of experience showing here.\n\nI dunno, Reddit. Has she lost interest, or are mixed messages like this normal? I'll admit, this is the first time I've gotten past a 3rd date in quite a few months, so I am acting kinda anxious. I checked my dating app (I currently have my profile turned off) and I've noticed that her location still changes time to time, so she definitely still opens it.\n\nWould like some advice on whether I still have a shot and what I should do. Thanks.\n\nTl;dr -- Been on 3 dates with a girl. She seemed reasonably enthusiastic until the last week, when she agreed to a 4th date but her responses have been way shorter and colder than normal. She cancelled due to bad weather and I said we'd do something when I get back from my trip, which she replied to with just a smile emoji. I'm pretty sure she still checks her dating apps despite us going steady. We got somewhat sexual on our 3rd date. Would like to know whether I should still pursue her.",
        "created_utc": 1678552710,
        "upvote_ratio": 1.0
    },
    {
        "title": "how to start a healthy relationship?",
        "author": "finstersardinster",
        "url": "https://www.reddit.com/r/relationships/comments/11oojrb/how_to_start_a_healthy_relationship/",
        "text": "[removed]",
        "created_utc": 1678552655,
        "upvote_ratio": 1.0
    },
    {
        "title": "how can I start a healthy relationship?",
        "author": "finstersardinster",
        "url": "https://www.reddit.com/r/relationships/comments/11oohma/how_can_i_start_a_healthy_relationship/",
        "text": "[removed]",
        "created_utc": 1678552504,
        "upvote_ratio": 1.0
    },
    {
        "title": "I (m25) found out she (f24) she slept with two dudes at one time.",
        "author": "greater-hope",
        "url": "https://www.reddit.com/r/relationships/comments/11oogdv/i_m25_found_out_she_f24_she_slept_with_two_dudes/",
        "text": "My girlfriend and I have been dating for about half a year.  We get along great and share a number of things in common.  She’s my first girlfriend and first sexual partner I’ve ever had.  I never really put forth much effort into dating because of constant rejection and poor self-esteem. However, I recently learned something about my girlfriend’s past that has me seriously reconsidering our relationship.  I recently discovered that she engaged in a MFM threesome in the past.  I know it’s foolish to let something of the past mess up the present but it’s really bothering me. After sitting and thinking about it for a week, I’ve decided that this relationship is not worth the mental exhaustion I’ve been dealing with the past few days.  I have decided that it is best we both go our separate ways so she can find someone who can accept her fully and I can find someone I’m 100% comfortable being with.  How do I go about handling this so nobody gets hurt?\n\nTL;DR - Found out my girlfriend slept with two guys at once.",
        "created_utc": 1678552412,
        "upvote_ratio": 1.0
    },
    {
        "title": "I'm (28/M) getting mixed messages from a girl (30/F) I've been seeing, I'm not sure if she's interested",
        "author": "LostInHisOwnWorld",
        "url": "https://www.reddit.com/r/relationships/comments/11oog5z/im_28m_getting_mixed_messages_from_a_girl_30f_ive/",
        "text": "[removed]",
        "created_utc": 1678552396,
        "upvote_ratio": 1.0
    },
    {
        "title": "[29M][28F] Divorce immediately after marriage",
        "author": "ThrowRA_Kenny",
        "url": "https://www.reddit.com/r/relationships/comments/11ooff2/29m28f_divorce_immediately_after_marriage/",
        "text": "Me (29M) and my wife (28F) married at the end of last year after 6 years of healthy and loving relationship. We had our ups and downs but our views on major values, hobbies and passions aligned.  We had many good memories and fun days/nights together. \n\nNo emotional, physical abuse, alcohol use or any other similar things were present during relationship. Please note that several traumatic events happened in her life and she was under a lot of stress a work during 2022. I was trying my best to support her, but perhaps she expected different kind of support. \n\nSeveral months after the wedding wife separated and asked to divorce me stating that she does not love me anymore and was dead inside/lonely for a while, even during our wedding. That I am not the right person to meet her needs. Even my friends are saying that whatever I say (especially positive words), she is turning to a negative perspective. In addition, some facts are changed to fit this divorce narrative or even stating that we were \"rebound\" relationship in a way. \n\nBeing separated for several months, she is stating that she feels alive again and she is enjoying life. Yet when I ask her if she is happy, the answer is no. She has been threatening to divorce several times now, but has not taken any real action (file papers, hire lawyers, sell our assets or take her things). She is not willing to try, go to therapy or do anything to save the relationship. \n\nI've read through many topics in reddit where divorce happened in less than a year and most of those stories had some sort of critical event - infidelity, abuse or addiction. There are no financial or other benefit to gain from marrying and divorcing. Many people have stated that this could be due to infidelity but she is saying that there is no other man. I believe her. I am truly devastated, lost and deeply looking for an answer what happened... At this point, I am indecisive if I should continue fighting for us or start moving on. \n\nPerhaps anyone have a similar story and could share it? Did you end up back together or divorced? \n\nAny other ideas on what could be happening/how should I react would be truly appreciated. \n\nThank you, god bless you! \n\nTl;dr: wife wants to divorce immediately after wedding.",
        "created_utc": 1678552340,
        "upvote_ratio": 1.0
    },
    {
        "title": "How to make my (32 F) partner (29 M) understand why his comments about my family pet hurt me",
        "author": "sunmoonstars_217",
        "url": "https://www.reddit.com/r/relationships/comments/11oofdg/how_to_make_my_32_f_partner_29_m_understand_why/",
        "text": "My family’s beloved dog is about 11 at this point, and we just found out she has cancer. We caught it in the early stages and it’s expected to be treatable, just expensive.\n\nMy partner did initially say he was sorry to hear about the cancer and gave me a hug when I told him I was sad about it but then made a comment about how Americans are so silly with their pets and treat them as part of the family, and how his family would never spend money on medical expenses for an animal.\n\nHe was literally born in and grew up in the US, and two of his sisters have dogs who they are obsessed with and consider part of the family and spend tons of money on so I’m not even sure what he’s referring to. I guess he is referring to his grandparents who lived in Mexico for most of their lives.\n\nI told him that this was hurtful to hear as it’s something my family is dealing with and all pitching in money for, but he doesn’t understand why it’s hurtful and says that if we have kids he would want to teach them that animals get sick and die and they shouldn’t get attached.\n\nI’m at a loss as to how to make him understand why his comments have hurt me? Is there anything I can say to get through to him?\n\nTl;Dr My boyfriend (M 29) doesn’t understand why I (F 32) am hurt by his comments about my family paying to take care of our dogs cancer.",
        "created_utc": 1678552337,
        "upvote_ratio": 1.0
    },
    {
        "title": "how can I start a healthy relationship?",
        "author": "finstersardinster",
        "url": "https://www.reddit.com/r/relationships/comments/11ooey9/how_can_i_start_a_healthy_relationship/",
        "text": "[removed]",
        "created_utc": 1678552307,
        "upvote_ratio": 1.0
    },
    {
        "title": "[29M][28F] Divorce immediately after marriage",
        "author": "ThrowRA_Kenny",
        "url": "https://www.reddit.com/r/relationships/comments/11ooe43/29m28f_divorce_immediately_after_marriage/",
        "text": "[removed]",
        "created_utc": 1678552255,
        "upvote_ratio": 1.0
    },
    {
        "title": "i need help understanding this",
        "author": "SignalOk1843",
        "url": "https://www.reddit.com/r/relationships/comments/11ooe1k/i_need_help_understanding_this/",
        "text": "[removed]",
        "created_utc": 1678552250,
        "upvote_ratio": 1.0
    },
    {
        "title": "i dont know what to do",
        "author": "SignalOk1843",
        "url": "https://www.reddit.com/r/relationships/comments/11oodl6/i_dont_know_what_to_do/",
        "text": "[removed]",
        "created_utc": 1678552223,
        "upvote_ratio": 1.0
    },
    {
        "title": "possible pregnancy",
        "author": "dittosquirtle",
        "url": "https://www.reddit.com/r/relationships/comments/11oobmp/possible_pregnancy/",
        "text": "Hi all, just wanna start this post off with saying im not exactly looking for advice, i dont know what im looking for. Me (20M) and my girlfriend (18F) have not had sex, but we've done the \"just the tip\" thing to leave her hymen in tact. We've done it multiple times and ive never came in her, nor reinserted after i came. Problem is, the last time we did it was on her 7th day of ovulation, just over a week ago. Now shes overseas in a climate she's not used to, experiencing nausea, vomiting, breast swelling and a late period. Her periods are almost never regular, but the combination of symptoms are very worrying. She cant take a pregnancy test now either due to circumstances.\n\nI love her very much, ill never leave her even if it ends up true. But we arent ready for a kid and she doesnt like kids, we're both very stressed about this, especially her. Im lost on what to do, how to support her through this, what can i possibly do. I know its a mistake not to use contraceptives when ever any kind of penetration is involved, and its a mistake i will not repeat. But im just hoping for some comment or answer or anything to give us hope, i guess.\n\nTL;DR\ni need to give her hope",
        "created_utc": 1678552090,
        "upvote_ratio": 1.0
    },
    {
        "title": "help me understand this",
        "author": "SignalOk1843",
        "url": "https://www.reddit.com/r/relationships/comments/11ooalv/help_me_understand_this/",
        "text": "[removed]",
        "created_utc": 1678552016,
        "upvote_ratio": 1.0
    },
    {
        "title": "Need relationship advise",
        "author": "whatkindoflifeisthat",
        "url": "https://www.reddit.com/r/relationships/comments/11oo9wg/need_relationship_advise/",
        "text": "[removed]",
        "created_utc": 1678551959,
        "upvote_ratio": 1.0
    },
    {
        "title": "Possible pregnancy",
        "author": "dittosquirtle",
        "url": "https://www.reddit.com/r/relationships/comments/11oo7uq/possible_pregnancy/",
        "text": "[removed]",
        "created_utc": 1678551814,
        "upvote_ratio": 1.0
    },
    {
        "title": "My friend (M21) wants to work at the same place that I (F23) work at but I don’t know if it’s a great idea",
        "author": "Witty_Gate1192",
        "url": "https://www.reddit.com/r/relationships/comments/11oo6jy/my_friend_m21_wants_to_work_at_the_same_place/",
        "text": "[removed]",
        "created_utc": 1678551720,
        "upvote_ratio": 1.0
    },
    {
        "title": "Possible pregnancy",
        "author": "dittosquirtle",
        "url": "https://www.reddit.com/r/relationships/comments/11oo6hk/possible_pregnancy/",
        "text": "[removed]",
        "created_utc": 1678551715,
        "upvote_ratio": 1.0
    },
    {
        "title": "My (18F) boyfriend (18M) makes a lot of mistakes and I don’t know if I can stand it.",
        "author": "Mindbulk",
        "url": "https://www.reddit.com/r/relationships/comments/11oo3t6/my_18f_boyfriend_18m_makes_a_lot_of_mistakes_and/",
        "text": "I’ve been dating him for 3 months now. I am his first girlfriend, first love, first sexual relationship, etc. He used to be a player, and had a bad reputation. No one thought him like he is with me. \n\nNormally he is easygoing, really comfortable with girls, and really friendly. \nWith me, he is really shy, and is really bad at flirting lol. But I find it cute. \n\nHe started really fast with our relationship. He took me to dinner for our first month, I met his mother and his close friends. He told me he loved me at our first month, and talked about a future with me. \nIt kinda scared me because I thought he was love bombing me, but I think it is because no one ever treated me like that. I had  two relationships before, but they never really cared about me. On the other hand, he takes care of me, takes me on a lot of dates, and tries to spend as much time with me as he can. When he isn’t when his friends or studying , he tries to see me. \nIf he could he would see me everyday, but I personally don’t need to see him more than 1-2 times a week. So we see each other 4 times a week. He almost always initiates and organizes our dates. \n\nI thought that first relationships for guys were abusive, but he really treats me like a queen. \n\nBut last week, he moved cities, because he was changing schools. I don’t know why, but he was really anxious and therefore more irritable. \nSo one time he picked up a fight with me because I didn’t answer his text for two hours because I was with my family. He told me I didn’t put effort in the relationship and we argued for 3 hours. \nNext day he apologized and told me he didn’t have to react like that. He corrected his mistakes and doesn’t ever bother me when i don’t answer his texts. But still, I feel stressed when i’m busy and i can’t answer him because of his past mistake. \n\nTwo days later he misunderstood what I said to him and we argued again, and he said the same things to me. \nHe really apologized again and asked me later that day to tell me if i would like to change things in our relationship so I could feel better. I told him that nothing had to be changed. \n\nHe then left me more space since that two incidents and reassures me that I shouldn’t be apologizing when i can’t answer and that he made a mistake. \n\nHe has never been mean but he made me cry that two times. I now can’t see him the same and I’m worried about a future with him. \n\nAre his mistakes red flags ? Will I suffer much more in this relationship ?\n\nTL;DR : My boyfriend made mistakes and i’m scared for the future.",
        "created_utc": 1678551529,
        "upvote_ratio": 1.0
    },
    {
        "title": "Am I the wanker?",
        "author": "Potential-Mouse588",
        "url": "https://www.reddit.com/r/relationships/comments/11oo2p6/am_i_the_wanker/",
        "text": "[removed]",
        "created_utc": 1678551444,
        "upvote_ratio": 1.0
    },
    {
        "title": "broke and todays my anniversary",
        "author": "sandritauchiha",
        "url": "https://www.reddit.com/r/relationships/comments/11onqla/broke_and_todays_my_anniversary/",
        "text": "bf and i (f) both 21 started dating a year ago today, only thing is ive  been the only one with reliable income majority of the time. when we met it was thru social media, the things he posted insinuated a life he does not live. jobless, no financial support whatsoever, on the other hand i was making good money at my commission job. once i found out how things were btwn us i kinda shook it off, bad times dont last forever right? not only being financially responsible for everything, i was able to take us on three dates. i could have took us out more but like i said i was responsible for everything. i lost that job, was chilling for a while he finally got a job back in october, only last two months. i know money is not everything but it definitely helps. its our anniversary, i cant stop thinking about how we cant do anything today because where’s the money at ? i have 20 dollars to my name, i sent him 8 hoping he gets me flowers or something. ive never made it to a year with someone so im happy for that but everything else weighs heavy on me\n\ntldr- ive always had the financial advantage in my relationship but today its bothering me.",
        "created_utc": 1678550590,
        "upvote_ratio": 1.0
    },
    {
        "title": "my younger sister (15f) and her bf (16m) want to take their relationship further. i think they are a bit too young. would you agree?",
        "author": "livi_sage",
        "url": "https://www.reddit.com/r/relationships/comments/11onqbr/my_younger_sister_15f_and_her_bf_16m_want_to_take/",
        "text": "[removed]",
        "created_utc": 1678550573,
        "upvote_ratio": 1.0
    },
    {
        "title": "39F doesn't prioritize me 42M enough",
        "author": "ARandomAnt80",
        "url": "https://www.reddit.com/r/relationships/comments/11onnja/39f_doesnt_prioritize_me_42m_enough/",
        "text": "Hello, first time poster, long time reader here.\nI am 42m a few months ago i met this woman about my age and she ticks all the boxes, we had an incredible month until honeymoon effect ended for her and suddenly she started needing her time alone, followed by her saying she feels sick(psychosomatic?) And i as i teehee to react in an anxious way about it.\nSince then we still see each other and still quite a lot but not as inseparable as before, we have amazing sex and always after that she says she loves me and how incredible i am.\nBut i still want more and more of her, and the more i want her the farther she seems to get.\nI know with my attachment style i tend to panic every time she takes her time, but I'm wondering is this type of relationship good for me?\nWe share many common interests, but i feel inferior to get knowledge, sometimes we argue but we did decide we will always overcome our arguments no matter what we of in a mature way.\nWe do try to push each other up morally, giving advices got self improvement, it's only that i feel I'm not important enough in her life.\nOn one hand this relationship is already making me grow as a person and invest more in myself, on the other hand i don't walk around feeling happy most of the time, i have a lot to improve about myself, and I'm quite objective about it, not low self esteem thing.\n\nSo, should i stay or should i go now?\n\nTLDR, GF of few months makes me feel unworthy or doesn't prioritize me enough",
        "created_utc": 1678550400,
        "upvote_ratio": 1.0
    },
    {
        "title": "I (m25) cheated on her (f24) with a girl from the gym.",
        "author": "keep-it-g",
        "url": "https://www.reddit.com/r/relationships/comments/11onn65/i_m25_cheated_on_her_f24_with_a_girl_from_the_gym/",
        "text": "\nSo I've been seeing my now girlfriend for about 4 months. A few weeks back we talked about our dating history and such. Turns out I'm her tenth boyfriend and she is only my first girlfriend. We shared how many people we have each slept with, my number was 1 and hers was much higher in at 17. Turns out she has had lots of casual relationships and flings throughout her in her early 20’s. Long story short, I'm looking back and realizing I never really had that phase in my life. I've always been a more introverted guy and not so confident about my looks. I've started getting into shape recently and have had more luck in dating.\nIt made me think I could have my own \"phase\" or whatever you want to call it. This girl I trained with started hitting on me and I just gave in. I ended up sleeping with her a few days ago. My girlfriend doesn’t know and I don’t really plan on telling her. \n\nTL;DR - I cheated on her with a girl I train with.",
        "created_utc": 1678550373,
        "upvote_ratio": 1.0
    },
    {
        "title": "its my anniversary and im sad",
        "author": "sandritauchiha",
        "url": "https://www.reddit.com/r/relationships/comments/11onmbj/its_my_anniversary_and_im_sad/",
        "text": "[removed]",
        "created_utc": 1678550314,
        "upvote_ratio": 1.0
    },
    {
        "title": "Riding solo (Staying single)",
        "author": "EstimateIcy2981",
        "url": "https://www.reddit.com/r/relationships/comments/11onkrm/riding_solo_staying_single/",
        "text": "[removed]",
        "created_utc": 1678550207,
        "upvote_ratio": 0.99
    },
    {
        "title": "is he being genuine or am i an idiot",
        "author": "Pleasant_Middle641",
        "url": "https://www.reddit.com/r/relationships/comments/11onj89/is_he_being_genuine_or_am_i_an_idiot/",
        "text": "i’m in a bit of a sticky situation with a guy atm and i’d like some outside perspective advice on what you think i should do… \n\nfor some background context me and this guy started seeing each other last summer - our first date was on my birthday and he made the day so perfect. i’d never been treated so well by a guy before in my life and it was fair to say i fell for him. we saw each other for a couple of months or so after that but for the most part it was long distance (i lived in the north of england and he lived in london). it became what felt pretty serious pretty quickly; i met his grandmother and brother and would stay over at his (i’ve been told this is a big deal for an arab family). later in the summer he left to go back to his home country to spend the rest of summer there and he basically cut me off - we weren’t officially dating but still it hurt. before he officially cut me off i soon realised he was seeing another girl he’d met back home; before the end of summer i was blocked and he told me he now had a gf and they were doing long distance. \n\ni was crushed to say the least - when he cut me off after a while i tried dating again but i couldn’t stop thinking about him, it was even worse when i moved to london and knew i was close to him. come winter last year i had had a couple of drinks and decided to call him and tell him that i missed him (i had a hunch that he wasn’t in a relationship anymore) - i was right and he unblocked me. about a month went by and we hadn’t spoken until one night he texted me saying he was in london for a couple days before going home for christmas (in this time he’d started uni up north so wasn’t in london all that often since in breaks he also usually flies home). i was going on a trip so didn’t have time to see him but we carried on texting pretty frequently. \n\nfast forward to about a month ago i saw him again for the first time in over 6 months. it was so nice and he felt like home. we both said how much we missed each other and it felt like no time had passed we were laughing and joking like usual and he was being his usual gentle and caring self. it was hard because he was headed back up to uni for the next month and knew we weren’t going to get to see each other. two weeks went by and i decided to drive up and stay with him for a night and this is where my feelings got so confused. \n\nbefore i went to see him he asked me “what are we?” so i told him it was a conversation we should have in person and to wait till i got there. he basically told me that he loves me and wants a relationship with me but can’t because it would be long distance (i don’t really consider it that because we could easily see each other once a week or two weeks). he said because when he was in a ldr over summer he got bored and they ran out of things to text about and it ruined everything. he said he doesn’t want a relationship with me over facetime because i don’t deserve that but then he was also saying things like he could see us living together in the future and he can’t see his life without me in it. it confused me because when we are together we act like we are in a relationship and yet don’t even have that security when we aren’t together. i told him i can’t stay in limbo forever and just wait and he said he wasn’t asking me to and just wants me to be happy. \n\ni have a couple options here- i can either cut the entire thing off and save another heartbreak like the one last year or i can carry on in this weird grey area with him. \n\ni see him again in two weeks when he gets back to london and i feel like i need to have made my mind up by then as to not drag it out. if it was my decision i’d at least want to try a ldr with him because then if it doesn’t work at least we tried? - when i’m in love with someone i will do anything to see them so if it’s that he’s worried about he shouldn’t. \n\ni know this is super long but any advice would really help rn &lt;3 \n\nTL;DR: my summer situationship came back and now i’m stuck in another relationshipless situation- do i wait it out or leave?",
        "created_utc": 1678550099,
        "upvote_ratio": 1.0
    },
    {
        "title": "My girlfriend (23F) of 9 months has been lying to me (22M) constantly and It's been stressing me out.",
        "author": "ThrowRAineedhelp268",
        "url": "https://www.reddit.com/r/relationships/comments/11onizm/my_girlfriend_23f_of_9_months_has_been_lying_to/",
        "text": "I (22M) have been dating my girlfriend (23F) for 9 months, and it was going smoothly for 8 months. We had our little bumps but we sorted them out. It was until recently, she redownloaded discord. \n\nWe share our passwords with each other, she has all of my socials besides reddit, same for me. One day, we were on facetime with each other, and she was muted, which was abnormal. I asked how come, she shrugged. I asked her to unmute so we can talk, but she ignored me. I was then suspicious and i opened discord, since she was using it much more often. \n\nShe had ignored and turned me down to talk to a couple guys she found through a \"Make Friends\" server. I immediately hung up the call. After i did, she asked what was wrong and such, and i told her. She then tried to dodge us from talking and began to cry instead and take every blame instead of talking it out. \n\nOver time, she continued to find more guys to talk to through the server. This is the only time I've looked through her socials because i felt she was cheating, but i have never been able to find anything. \n\nThere was another incident, we said our goodnights and i had gone to bed. Instead of going to bed like she said, she went onto discord to talk with one specific guy, and did her crying thing when i asked about it again, and refused to answer, just cried. \n\nThis morning, i found that they have started deleting messages. I haven't spoken with this to her yet, because i guarantee i won't get answers. I need help, what do i do, and how do I go about this with her? I want this relationship to work out, but it's been getting stressful.\n\n\n\nTLDR: my girlfriend has been hiding that she's been talking to guys",
        "created_utc": 1678550081,
        "upvote_ratio": 1.0
    },
    {
        "title": "is he being genuine or am i an idiot",
        "author": "Pleasant_Middle641",
        "url": "https://www.reddit.com/r/relationships/comments/11onfqq/is_he_being_genuine_or_am_i_an_idiot/",
        "text": "[removed]",
        "created_utc": 1678549856,
        "upvote_ratio": 1.0
    },
    {
        "title": "Should i stay or should i go",
        "author": "ARandomAnt80",
        "url": "https://www.reddit.com/r/relationships/comments/11one0k/should_i_stay_or_should_i_go/",
        "text": "[removed]",
        "created_utc": 1678549739,
        "upvote_ratio": 1.0
    },
    {
        "title": "looking for love",
        "author": "angelaeyes3",
        "url": "https://www.reddit.com/r/relationships/comments/11ond8n/looking_for_love/",
        "text": "[removed]",
        "created_utc": 1678549684,
        "upvote_ratio": 1.0
    },
    {
        "title": "Unfair chores",
        "author": "Material_Me",
        "url": "https://www.reddit.com/r/relationships/comments/11oncys/unfair_chores/",
        "text": "I'm a 15f and my brother is also 15. I know the title may sound like I'm just spoiled and complaining but I'm really not. For my chores I have to clean the kitchen everyday, clean the bathroom every Saturday and do the laundry. I also clean the room me and my brother both share. My brother's chores are literally just to take out the garbage and half the time he forgets. The other half he just doesn't do it, and my dad does it. We share the same room and his socks are always on the floor! How do I bring this up to my parents. The stress is really getting to me, I got mad over pancakes today! \n\nTl;dr - Unfair chores, how do I tell my parents that things are unfair",
        "created_utc": 1678549663,
        "upvote_ratio": 1.0
    },
    {
        "title": "My girlfriend (23F) of 9 months has been lying to me (22M) constantly and It's been stressing me out",
        "author": "ThrowRAineedhelp268",
        "url": "https://www.reddit.com/r/relationships/comments/11on9x8/my_girlfriend_23f_of_9_months_has_been_lying_to/",
        "text": "[removed]",
        "created_utc": 1678549455,
        "upvote_ratio": 1.0
    },
    {
        "title": "my gf s mother doesn t like me",
        "author": "Kjartan7",
        "url": "https://www.reddit.com/r/relationships/comments/11on9ac/my_gf_s_mother_doesn_t_like_me/",
        "text": " Hello there\n\nI’m incredibly sorry for the long text, I'm currently in a relationship going south entirely because of my relation to my girlfriend's mother. But first I will grant you some backstory in order to make it as unbiased as possible! Also excuse my english, I'm from france so that english is not my first language! :)  and this is the second acc so she won t notice\n\nFirst off I want to start off by saying that I m deaf 22m, I’ve been dating my girlfriend 21f for coming up on 5 months, we hit it off INSANELY well and we both felt like we had found the love of our lives within hours. We got to know eachother very well and we basicly spent all the time and just loved every second of it. We could just talk for hours and hours on. we are absolutely crazy for one another and it feels like its the one. Anyways It's story time! This occurred a while ago. Her mom calls my phone because my girlfriend was sick at his ex-house; boyfriend's well, backstory, I had no idea she attempted suicide the day we met, and I was shocked. She had been dumped by her abusive ex boyfriend, and her mother is unaware of all her dark secrets for what her ex did to her; it was so fkin horrible; he hit her and fucked her up, forced her, he dated her when she was 16, she was a fk minor, and he was 25, he destroyed her life and abused her, and he made her his puppet, he is a drug addict and enraged and he only wants sex and he doesn t want her to meet her friends and he force her in to stay in her room, she has been stayed at his room etc too many stories to tell and I’ve helped and i have tried everything to make her the best verison of herself and start doing her passion and learn to appreciate herself, without me being her sole source of happiness and confidence. and her mother find out that they broke up and her mother keeps talking about him and started to try to find reasons for her to not see me. I think that this is largely because they broke up ? just because I am far from her, and just because she is protective ? I find it incredibly odd how prejudiced people, I’ve shown my girlfriend love, helped her become an outgoing person again, and I’ve tutored her with everthing that she hasn t experienced yet and adviced her like therapist, yet her mom doesn’t want me to date her and doesn t like me for no reason bcs she is overprotective. I’m probably the reason that she’s still alive, since she attempted suicide 14 times and self harming before meeting me, and hasn’t since.\n\nI did everything for her to be happy, and it's really too hard, and she suffers every day and I did my best to find herself happiness and love self,\n\nanyway so this week when her ex-boyfriend brought my girlfriend's stuff back to her house and he came home to talk and they both decided to date every weekend just bcs, the other day her ex-boyfriend start talking to her like he's trying to ask her that he changed and they show the pictures of the change in her room and shit ! he is trying to manipulate her, and her friends and me tried to explain her not to come back ! and she was cold and quiet then yesterday before dating him, she sent me a screenshot of him of the date plan, and what he said \"btw nick called me about tmr about the car and i told him that we have plan so if you don t mind i come after work there i get u and nick we bring him back to his city he take his car and we if you don t mind go home so i can take a quick shower and then we go our date to walk if you want we can return after home make some eggs ( cause today i m gonna clean the whole sink no matter how long it takes me) and after i take u back home or something you think you want all that ?\" what actually the fuck this kind of date ? and wtf he wants her ? i told her decline and its a red flag ! and she did and she said that she ll only bring her stuffs and won t see him tonight and start a new life, and this morning her mom asked her go date with him and stop talking with me ? i m so disappointed man, fk this shit her mother is tryna to force her what to do yet she doesn t know nothing about what happened, her friends and her brother hate him about everything but her mom needs to fk understand !\n\nI told her that she shouldn t be sorry and i told her to give her time if her mother start getting some no respect this relationship will not continue i m afraid bcs i rly care about her a lot. This is an unnecessary stress. She of course was devastated.\n\nOn the other hand, I can see why I shouldn't care what her parents think of me. I know my self worth and I know how to achieve what I want. Haters are gonna hate, and maybe I should just accept the fact that they hate me and just live with it. and i don t know how to explain her about her mother i\n\ni ve gone on to long as it is. There is so much more context but it would take forever to explain clearly. I don't know how to handle this situation anymore, Should I just keep on trying to ignore her and what should i tell her to understand this situation ? I feel that if I try to stand up for myself she will just twist my words and try to make me look like the bad guy to everyone she knows. Help ? I'm lost.\n\ni ll meet her in within less 4 months\n\n    **TL;DR;** : my gf s mother doesn t like me and I make 2 questionable, possibly her mother is trying to force her and she hates me bcs we haven t meet yet. What do reddit?",
        "created_utc": 1678549407,
        "upvote_ratio": 1.0
    },
    {
        "title": "My(23f) bf(24m) is being distant and not as affectionate as before, what should I do ?",
        "author": "boldeststroke21",
        "url": "https://www.reddit.com/r/relationships/comments/11on3bh/my23f_bf24m_is_being_distant_and_not_as/",
        "text": "For context my bf is usually really sweet and affectionate towards me, but three weeks ago he got the news that his job offered him a job abroad and he has decided to go ( we live in a Middle East country and he got offered a job in a western country with much better pay and lot of advantages ). We talked A LOT about the future of our relationship and I kept telling him that if he doesn't want to be in a long distance relationship it's totally understandable but he insisted he wants to try so we decided to stay together. He should be leaving in about two months. But ever since that news he is insisting on spending more time with his family which I understand but the problem is the time he spent with his family he completely ignores me, doesn't answer my texts for hours , doesn't check up on me all day if I doesn't text, doesn't say I love you etc... It has come to a point if Im not affectionate towards him he just won't be affectionate, I always have to do the first step. I tried to bring up the subject multiple times but he just gets mad and say im ungrateful for all he does and I always just focus on the negative and that I'm asking too much from him. Now the thing is I am a really anxious person and he knows that and use it against me every single time we have a conflict, he says \" stop asking for reassurance always it's bad for you\" when all I asked was for him to be a little more affectionate in general ( which he were I have no idea what changed ).\n\n\nNow a week ago after a big fight on that same subject I had a panic attack and the whole situation is making me even more anxious than usual, to the point where I'm overthinking all day it has become unbearable for me, he suggested we should take a little break to focus on ourselves more, we're basically not talking except just texting a bit at night to check on each other, it's been good I have been more productive and less anxious, but last time we called and at the end I said I love you and he didn't answer, and again I had a panic attack and I woke up feeling like shit today. \nShould I just give up on the relationship all together or should I talk to him about it and try to fix it ?( again this post is only highlighting a problem we're going through rn, but usually we have a great connection, we care deeply about each and before that I felt I was in very healthy relationship)\n\ntldr: My bf is being distant and not as affectionate as before, I wonder if I should break it off or try to work on things to solve the problem",
        "created_utc": 1678548974,
        "upvote_ratio": 1.0
    },
    {
        "title": "I (22F) will most likely see my ex bf (23M) at the gym we used to go to together.",
        "author": "justagirlhere11",
        "url": "https://www.reddit.com/r/relationships/comments/11on2kb/i_22f_will_most_likely_see_my_ex_bf_23m_at_the/",
        "text": "We broke us last week so it’s been 7 days exactly with no contact with him. We used to go to the same gym and want to start going to the gum regularly again this week. I am sure I will see him. I miss him so much too and I hope to see him too but if he ignored me? I will be devastated if he ignored at the gym honestly. \n\nShould I say something or just keep working out without acknowledging him? \n\nI really want to reconcile with him though but is one week enough? \n\nTD;LR: I go to the same gym as my ex bf what will happen?",
        "created_utc": 1678548920,
        "upvote_ratio": 1.0
    },
    {
        "title": "I (25F)know stupid shit happens sometimes, this one is sticking with me though and I need advice",
        "author": "sadcacahuate",
        "url": "https://www.reddit.com/r/relationships/comments/11on1ca/i_25fknow_stupid_shit_happens_sometimes_this_one/",
        "text": "[removed]",
        "created_utc": 1678548838,
        "upvote_ratio": 1.0
    },
    {
        "title": "How do I (m25) tell her (f24) that I want to break up to sleep with other women?",
        "author": "blessing4110",
        "url": "https://www.reddit.com/r/relationships/comments/11on0k0/how_do_i_m25_tell_her_f24_that_i_want_to_break_up/",
        "text": "So I've been seeing my now girlfriend for about 4 months. A few weeks back we talked about our dating history and such. Turns out I'm her tenth boyfriend and she is only my first girlfriend. We shared how many people we have each slept with, my number was 1 and hers was much higher in at 17. Turns out she has had lots of casual relationships and flings throughout her in her early 20’s. Long story short, I'm looking back and realizing I never really had that phase in my life. I've always been a more introverted guy and not so confident about my looks. I've started getting into shape recently and have had more luck in dating.\nIt makes me think I could have my own \"phase\" or whatever you want to call it. I've never been able to casually date and maybe now is that time. I mean it’s not fair that she got to have these experiences and I wasn’t awarded the same opportunity. She’s made it clear that she has strong feelings for me but I don’t think I can commit to anyone until I’ve slept around with different women.\n\nTL;DR - I want to break up with her to have sex with other women",
        "created_utc": 1678548779,
        "upvote_ratio": 1.0
    },
    {
        "title": "feeling lost",
        "author": "dontevenknow26",
        "url": "https://www.reddit.com/r/relationships/comments/11omxux/feeling_lost/",
        "text": "my husband (m21) and i (f21) have been together since we were 18. before him i had been in long term relationships my entire dating life, since i was 12 years old. in total i think i’ve only been single for a few months in about 9 years. recently it’s really been starting to get to me, and i feel like i missed out on being single and going out and having fun and just living my life. he knows kind of how i feel, that i feel like i missed out on having fun, but not the single part. so i’ve been going out with friends a lot in the last month and i’m having a great time but obviously still need to give him my time too. i find myself just wishing i was out almost everytime im home with him and i don’t know what to do about it. because i do believe he’s the person i’m meant to be with, he’s perfect in every way and we get along so well. but there’s so many people on the planet and we’re both so young. i just don’t know what to do. any advice or words of wisdom are appreciated. \n\ntl;dr \n21F married, feeling like i never got the chance to be single and have fun.",
        "created_utc": 1678548592,
        "upvote_ratio": 1.0
    }
]