[
    {
        "title": "Should I date my Neighbor? (Comprehensive Guide developed by someone with Experience)",
        "author": "imtraumatisednow2023",
        "url": "https://www.reddit.com/r/relationships/comments/11mjj6o/should_i_date_my_neighbor_comprehensive_guide/",
        "text": "[removed]",
        "created_utc": 1678338779,
        "upvote_ratio": 1.0
    },
    {
        "title": "Should I date my Neighbor? (Comprehensive Guide from someone with Experience)",
        "author": "imtraumatisednow2023",
        "url": "https://www.reddit.com/r/relationships/comments/11mjfpd/should_i_date_my_neighbor_comprehensive_guide/",
        "text": "[removed]",
        "created_utc": 1678338472,
        "upvote_ratio": 1.0
    },
    {
        "title": "My boyfriends ex unblocked and reached out to him",
        "author": "Anxious-Optimist12",
        "url": "https://www.reddit.com/r/relationships/comments/11mjd0x/my_boyfriends_ex_unblocked_and_reached_out_to_him/",
        "text": "\n Its kind of a long one\n\nMy boyfriend and I are about 6 months into a relationship...and things have been going pretty great. We went to the Renaissance Fair last Saturday...and he told me he loved me for the first time...when we got back we posted all of our pictures together and everything was good. \n\nFast forward to last night, we were talking about past relationships we'd been in...and we must've said boogeyman too many times or something, cause the ex we were talking about in particular, unblocked and sent a friend request to my boyfriend on every platform. Which she's had a pattern of doing...like every 4 or so months from what he's told me...some back story for them is they've been broken up for almost a year...she cheated on him and dumped him as he was getting on a plane to go home. (They were together 7 months?)\n\nSo he accepted her requests to see what she wanted..and she came out saying how pretty she thought I was and how she is excited for him to have found someone and that he deserves all the love..\nWhich struck me as odd. But he told her he didn't really have anything to say to her, but she kept texting him ...and was talking about wanting to mend what was left of their relationship...and that they both messed up and can move passed what happened...and when he was telling her that's not what he wanted she just kept repeating \"oh you're a catch.\" \"I lost my chance\" \"no one has ever loved me like you did\" at that point I was getting pretty irritated...cause my boyfriend didn't wanna be mean to her...and tell her how it was. \n\nAt the end when he said he would rather go separate ways, she told him that she loved him...and that she always will. She said it a couple times and even used the phrase \"always and forever\"  \n\nAll in all...it makes me wildly uncomfortable...he doesn't wanna block her or be mean. And I don't have enough of a backbone to tell him he needs to block her...how do I get over the fear of being left for someone else? He told me he wasn't ever going back to her...but there's still that voice in my head that's scared about it. \nIt feels like she unblocked him...saw we were together ...and then decided to try and destroy what we've been building...she started out saying how happy she was ....and kept reiterating it to the point where she was like guilt tripping him for moving on. \nIt's so frustrating! My boyfriend and I havent talked about it since last night...and its just awkward! \nThis is more of a rant than anything...all thoughts and comments are appreciated. \n\nTLDR:MY boyfriends ex saw us post pictures together and reached out ...acting nice as pie...and then slowly started guilt tripping him for moving on, and then told him that she will love him always and forever...my boyfriend doesnt wanna be blunt/mean nor does he wanna block her..and it's caused alot of internal turmoil for me!",
        "created_utc": 1678338247,
        "upvote_ratio": 1.0
    },
    {
        "title": "My husband (36 m) refuses to let me (35f) travel with a gf or alone to see family if he’s not invited. What could I do to get him to be ok with me going on solo trips occasionally?",
        "author": "Old-Werewolf9246",
        "url": "https://www.reddit.com/r/relationships/comments/11mj9hr/my_husband_36_m_refuses_to_let_me_35f_travel_with/",
        "text": "I want to take a girls weekend trip and he changes the subject or gets short with me everything I bring it up. I feel I should be able to take a trip without a guilt trip or it being about me “not wanting to be with him”. We’re married, I’m with him everyday.\n\nAlso this is not the first time. I took a trip to Puerto Rico and to my sisters and it was the worst trips because he was negative when I checked in and rude so I couldn’t chill and have fun. I felt like a child who was doing something wrong. \n\nLooking to work this out so I can travel once in awhile with my friends to get some autonomy.\n\nTL;DR husband gets irate over me leaving for a few days without him. I need advice on how to navigate this healthily.",
        "created_utc": 1678337978,
        "upvote_ratio": 1.0
    },
    {
        "title": "Need A girlfriend. I am single.😔",
        "author": "Mr_xkot",
        "url": "https://www.reddit.com/r/relationships/comments/11mj6bd/need_a_girlfriend_i_am_single/",
        "text": "[removed]",
        "created_utc": 1678337702,
        "upvote_ratio": 1.0
    },
    {
        "title": "Really need someone to talk to...",
        "author": "LivingPotatoo",
        "url": "https://www.reddit.com/r/relationships/comments/11mj48z/really_need_someone_to_talk_to/",
        "text": "[removed]",
        "created_utc": 1678337524,
        "upvote_ratio": 1.0
    },
    {
        "title": "Should I date my neighbour? (Comprehensive Guide from Experience)",
        "author": "imtraumatisednow2023",
        "url": "https://www.reddit.com/r/relationships/comments/11mj31g/should_i_date_my_neighbour_comprehensive_guide/",
        "text": "[removed]",
        "created_utc": 1678337422,
        "upvote_ratio": 1.0
    },
    {
        "title": "I avoid having conversations with my partner during the week because of work",
        "author": "New-Ease-4833",
        "url": "https://www.reddit.com/r/relationships/comments/11mj1xn/i_avoid_having_conversations_with_my_partner/",
        "text": "I don't like to text my partner during the week because of work and studies (busy schedule) but I sent a text after 4 days to show him something (I don't expect a response straight away or for him to acknowledge) I did think a lot about him for the past 24hours Hence why I messaged too\nHe just replied 'I'm at work'\n\nI personally respond to people when I have the chance and time to. \n\nI didn't expect for him to respond \n\nShould I just not message him during the weekdays? Honestly, didnt mean to intrude - I never expect a response straight away\nDid I do something wrong? What should I do?\n\nTLDR: we usually speak on the weekends, but I messaged him after four days to show him something via text and he replied that he is at work. \nIt's perfectly fine as I didn't expect a response straight away. It just makes me feel a bit guilty. I didn't want to start a conversation - I personally reply when I've thought about that person a lot or when I have that free time. I believe you don't need to attend to messages straight away \nShould I avoid sending him a text during the week all together?",
        "created_utc": 1678337337,
        "upvote_ratio": 1.0
    },
    {
        "title": "I avoid having conversations with my partner during the week because of work",
        "author": "New-Ease-4833",
        "url": "https://www.reddit.com/r/relationships/comments/11miyu5/i_avoid_having_conversations_with_my_partner/",
        "text": "[removed]",
        "created_utc": 1678337081,
        "upvote_ratio": 1.0
    },
    {
        "title": "Grace",
        "author": "sunriseandme",
        "url": "https://www.reddit.com/r/relationships/comments/11miu1e/grace/",
        "text": "[removed]",
        "created_utc": 1678336687,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why does working with family seem to go wrong 99% of the time?",
        "author": "CatLadyZnaiux",
        "url": "https://www.reddit.com/r/relationships/comments/11mis2f/why_does_working_with_family_seem_to_go_wrong_99/",
        "text": "[removed]",
        "created_utc": 1678336522,
        "upvote_ratio": 1.0
    },
    {
        "title": "First relationship unsure about feelings, should I break up ?",
        "author": "partyactivism",
        "url": "https://www.reddit.com/r/relationships/comments/11mirzj/first_relationship_unsure_about_feelings_should_i/",
        "text": "Hello, I (23F) am currently dating a 25(M). We met in school, and it’s my first relationship. He is very caring and attentive, and it has only been about 5 months, but I am just not passionate about him and I think he deserves more. I know passion isn’t everything but if it’s this early in the relationship where I am having doubts about being interested in him even though he is so kind, I don’t think that is a good sign. I think he is really wonderful, but I just don’t want to date him and waste his time, and I also don’t want to hurt his feelings and make him think he did something wrong. Some of my friends and mom say that what I’m feeling is normal in relationships and I should just wait awhile before I do anything rash, but I don’t think that is fair to him if I feel this way? I need some advice, any help. \n\nTdlr: unsure if I should break up with nice guy, care about him but I’m also not sure about him.",
        "created_utc": 1678336516,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why does working with family seem to go wrong 99% of the time? What's your story, do you still keep in contact afterwards?",
        "author": "CatLadyZnaiux",
        "url": "https://www.reddit.com/r/relationships/comments/11mip7i/why_does_working_with_family_seem_to_go_wrong_99/",
        "text": "[removed]",
        "created_utc": 1678336286,
        "upvote_ratio": 1.0
    },
    {
        "title": "I need advice!!",
        "author": "thro-w-away2884",
        "url": "https://www.reddit.com/r/relationships/comments/11mike3/i_need_advice/",
        "text": "Hello! 21 M here trying to figure seek advice from someone smarter than me about relationships. I am autistic and relationships are a little hard for me to initiate. I don't always know when it's appropriate to make a move. I need help with a message that I would like to send to someone (20 M) to possibly pursue a relationship. \n\nHere is the message:\n\n\nHey (name). I met you at a party awhile ago and then followed you on Instagram, I've kinda always had a small crush on you. And I saw you on bumble the other day, you might've swiped left on me which is cool but I'd kick myself everyday for not trying to reach out. You seem grand and I'd love to get to know you better. \n\n\n\n\nTLDR: I am socially inept and wanna message someone to possibly date them.",
        "created_utc": 1678335891,
        "upvote_ratio": 1.0
    },
    {
        "title": "Am i overreacting??",
        "author": "GwegJenNinGz",
        "url": "https://www.reddit.com/r/relationships/comments/11mihrz/am_i_overreacting/",
        "text": "Me (25M) and my friend (24F) have been friends for 5 years with the same small group of friends. She was in a 4 year relationship until she broke up with her ex in August. Me and her started hooking up in October and we both said from the start that we could be FWB.\n\nShe started catching feelings a month into it and i told her i liked her a lot too but she was still communicating to her ex which felt to me like her words were not matching her actions. She hung out with his family on Christmas Eve and that pissed me off. When i called her out on that she said let’s just take a step back. 2 days after she said let’s take a step back she tells me to come over. \n\nWe hangout for 2 more weeks after i called her out and we were talking still pretty much everyday. Then she just starts distancing herself and stopped replying so i got the hint to leave her alone.\n\n2 weeks go by with no contact and on Valentine’s day that night she calls and texts me she’s drunk and about to drive home and needs someone to talk to. I don’t answer to either. 2 more weeks go by after that and she asks me if i can keep a secret (we’ve told each other deep things in the past) so i responded yeah and she tells me whatever. Meanwhile i haven’t talked to her in a month since she distanced herself and i told her i thought it was disrespectful that she couldn’t be honest with me and say she didn’t want to continue talking/ hanging out. \n\nShe apologized for it and said she thought she was handling it the best way by just ghosting me? She still wants to see me but i told her i want space.\n\nAm i overreacting here or am i right to be upset about how she handled things??\n\nTLDR: Friend of 5 years and FWB for 4 months cut me off but then 2 weeks later is texting me to talk to her and last week she calls and tells me she misses me and keeps thinking about me. I haven’t seen her in over a month now and kind of miss her but also feel like i was disrespected and don’t know if i’m overreacting since we technically didn’t date and i knew it was FWB from the start. should i see her again?",
        "created_utc": 1678335666,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why don’t men like their girlfriend spontaneously dying her hair",
        "author": "BIackie_Chan",
        "url": "https://www.reddit.com/r/relationships/comments/11mih0z/why_dont_men_like_their_girlfriend_spontaneously/",
        "text": "[removed]",
        "created_utc": 1678335605,
        "upvote_ratio": 1.0
    },
    {
        "title": "I M25 have been fighting with my girlfriend F23 for 3 days",
        "author": "melbpal",
        "url": "https://www.reddit.com/r/relationships/comments/11mif1f/i_m25_have_been_fighting_with_my_girlfriend_f23/",
        "text": "I (M25) have been fighting with my girlfriend (F23) for 3 days. \n\nBack story:\nWe’ve been together for 4 years and both have stable jobs. most fights would occur about once a month, last about an hour and we’d both get over it and be cuddling again. Each fight would be different and we would grow from it. We moved in together into a rental in October last year to take our relationship to the next level and I guess give it a test to see how strong we are and we’ve adapted pretty well. \n\nRecently we’ve been on the hunt to purchase our first home together seeing that we work well together and have similar goals. She recently has access to inheritance money and she wanted to put some of that towards a deposit for the home loan (we’ve discussed that if anything were to go pear shaped she’d get that money back and are having a contract drawn). Through the process of getting a Pre approval we’ve realised that we aren’t able to borrow the amount that we would like. This is due to me having a car and student loan. Her parents suggested that she pays the car loan off and that I pay her back monthly so on book I have less debt. At first I was reluctant but I agreed since we would be able to get a nicer home and she deserves to be in a nice home.\n\nTwo days ago we were sitting on the couch and she asked for a naked massage and specifically to massage her butt and honestly this turned me on a lot and I got my hopes up since this is usually our foreplay. Mid massage she turned around and said she wanted to pay off the loan and once she did I said thank you and told her I said it feels weird to be free from a loan. I told her that I’ve never been in a position where I’ve never had to bust my ass like this so I’m in debt to her. Playfully I said I’ll start by doing the dishes. After I did the dishes we hugged and kissed a little and I asked for a handjob (since I was still turned on from before) and she said no and I said “I’m sorry i came on too strong” she then laughed at me and said she can’t believe I’d ask for that after what she just did for me. She also said that she was hoping I’d be more grateful. I apologised for my actions saying I should be able to do something nice without thinking it’s sexual and then said I promise I’m grateful because she’s not only helped me out she’s put us in a better position to buy a new home. We’ve been back and forth with me apologising and her saying “I don’t think you’re sorry” and “it’s not that you wanted sex it’s the lead up to it” or “you just cared about whipping it out of your pants”. \n\nYesterday we had the same fight, I asked what it would mean to her if roles were reversed and If I paid. She said “ I have a big day tomorrow at work I can’t be fucked answering your questions ”. I I asked again and She stated everything I said I was grateful for. I then said that’s exactly what I said and that I couldn’t be more grateful and sorry. She then said “I’m sick of these mind games”” I’m sleeping on the couch and I’m going to my parents tomorrow”. After I apologise and the fight seems to cool off a bit she says” it’s not the fact that you wanted to get some it’s the build up to it” and from there it starts again. I stepped out of the room I broke down crying not knowing what else I could possibly say. \n\nI’m lost and hurt and feel like I’m ruining this relationship. I don’t want this to be the end\n\n- apologies for how this is written, my mind is all over the place\n\n\nTL;DR me M25 and my girlfriend F23 have been fighting for 3 days now, I’ve apologised multiple times but I feel I may be approaching things the wrong way",
        "created_utc": 1678335435,
        "upvote_ratio": 1.0
    },
    {
        "title": "A coworker (mid 20s/F) with ASD has been making me (25/F) uncomfortable at work. Unsure if reporting to HR is the right move",
        "author": "megathrowswayphia",
        "url": "https://www.reddit.com/r/relationships/comments/11mic33/a_coworker_mid_20sf_with_asd_has_been_making_me/",
        "text": "for context I work at a vet clinic with a very casual culture. we all have a lot of laughs and jokes with each other throughout the day and I have met many close friends through work\n\nIve worked here for about three years, and am someone who generally has a great rapport with all my coworkers and other depts and have never had a real conflict before\n\n\"D\" started working at our clinic right before halloween. Immediately it was rough. she tried way too hard to force friendships with several people way too quickly and made several people uncomfortable, including me. \n\nthe first shift I worked with her was one on one, me training her. she unprompted started telling me about how she has ASD, and talking about her trips in a psych ward. and she said \"I noticed the scars on your arm, you seem like someone who understands and gets it\" and it made me wildly uncomfortable. I had just been promoted to a role which included training, so I felt too insecure to really reprimand her and just went \"uuuuh I guess\" and tried moving on\n\nseveral days later she asked if I wanted to bring her a key to my apartment so she could come over to feed my cat during my upcoming vacation (convo she overheard, I never told her) despite my roommate. I was weirded out. tried telling her no and avoided her while being nice as I am with anyone at work, resulting in her following me around constantly. annoying, but I tried giving her the benefit of the doubt in being neurodivergent she didnt get this stuff is inappropriate\n\nwe dress up at work for halloween. my costume was a dress, cute but not something outrageous to wear to work. unprompted D tells me how great my ass looks in the dress. I am really non confrontational so I tried to brush it off. I didnt report her, despite two people in the room who also felt it was bizarre. that was a mistake\n\nin the months since D has done and said a lot of little things here and there that rub a lot of people the wrong way as far as the social climate at work. but as far as the work, she has also been caught lying after making a mistake to save face multiple times, inflating her past work experience, and doing things that result in poor patient care because she is so focused on herself. just one example being poking a poor cat over and over in the leg for a blood draw because she couldnt find the vein and getting upset when being told to stop and let someone more experienced do it to minimize stress to the cat. her not caring that patient care is the priority, not her ego\n\noff the clock after work in the back area I was chatting with two of my coworkers/friends. I mainly date men but have attraction to women. but Im just getting more comfortable with this and not sure if being labeled as bi fits me. anyways, was telling them about this lumberjack girl on YT and how into her arms I am. D was walking by and stops on the edge of our group but none of us acknowledged her. she then yells \"are you bisexual?\" I ignore her. she repeats the question, except louder. I ignore her again. she goes \"I knew it, I had a feeling you were bisexual. I could TOTALLY tell!\"\n\nAll of us just kind of gave her a \"what the fuck\" look and she started going on about \"oh sorry!\" but I didnt respond and just left because it was weirdly upsetting to me. I know she has some level of ASD (I dont grill her about it though because I want to give her more respect than she gives me) and I feel horrible for being so frustrated and having such a strong dislike of her. I got home and just burst down crying and I dont know why. Grilling someone about how they label their sexuality just seems so universally wrong\n\nI am very close friends with my manager, so I vented to her over text. she told me that she backs me up 100% with it being wrong, but for anything to be \"done\", HR has to get involved and it's up to me. the two other people who were there want me to report as well. but to be completely honest, everyone at work has a pretty strong dislike of her, so Im not sure how objective that opinion is\n\nhow should I handle this? Is there realistically a way to resolve this without involving HR? am I a horrible person for having such a strong dislike of someone who probably cant help being the way they are?\n\nTLDR; coworker with ASD makes me really uncomfortable and I dont know what to do",
        "created_utc": 1678335199,
        "upvote_ratio": 1.0
    },
    {
        "title": "I 30(M) have been feeling insecure in my new relationship of 3 months with my 31(F) GF and am looking for advice on how to handle how I am feeling?",
        "author": "Rororo11",
        "url": "https://www.reddit.com/r/relationships/comments/11mibnz/i_30m_have_been_feeling_insecure_in_my_new/",
        "text": "[removed]",
        "created_utc": 1678335165,
        "upvote_ratio": 1.0
    },
    {
        "title": "I might be pregnant and am not sure I want to keep it.",
        "author": "Wildflowers57",
        "url": "https://www.reddit.com/r/relationships/comments/11mhw3j/i_might_be_pregnant_and_am_not_sure_i_want_to/",
        "text": "[removed]",
        "created_utc": 1678333908,
        "upvote_ratio": 1.0
    },
    {
        "title": "i’m tired of being scared and losing him but i also don’t want to ruin our friendship",
        "author": "niknolietesla",
        "url": "https://www.reddit.com/r/relationships/comments/11mht3d/im_tired_of_being_scared_and_losing_him_but_i/",
        "text": "so i (25f) am terrible at relationships. i’ve never had a boyfriend, only been on a handful of dates (all of them terrible), the last time i was kissed i was 7 years old (by a guy i’m still friends with), and i’m waiting until marriage. all that being said i have had 2 full blown situationships, one when i was 19 and the guy was 27 he never kissed me or took me on a date and it was really weird (he also told me he loved me) and the last one being for like 4 or 5 months last year. \n\nlosing the situationship when i was 19 really messed me up because i never got the affection i wanted from it and it ended so suddenly, however right after i thought realized i had feelings for a mutual friend of mine (i think i was lonely). that was never a situationship or anything as he blocked me and changed his entire personality and moved out of state, which again messed me up. \n\nquarantine wasn’t as rough as i thought it’d be, i used all the around the world options on the dating apps and got the most attention i had ever received from the opposite sex i’m my life. that new found confidence helped as i went into a job in my dream career field and that’s when i met my last situationship. this last situationship didn’t really mess me up as bad as my other one in the sense i ended it on my terms, but it was rough as he wouldn’t even kiss me or anything because he was intimidated by my virginity (although i am still a very sexual person). basically he would drunk text me and we would send each other sexts and risky pictures.\n\na few days after i broke it off with my situationship, i met my now soon to be ex boss (35m) (i know, i know). immediately i found him attractive, he’s almost exactly my type, but there was no way i was gonna act on that as he’s my boss and wayyyy out of my league. working with him for a few weeks i quickly learned he was going through a few really rough patches and my heart went out for the guy. he had also just broken up with his long term girlfriend amongst other things but i still didn’t want to make any moves, honestly i just became his friend and i liked that. \n\nsoon enough we became close to a few other coworkers and had a few group texts going on in which we’d talk on a lot. a few different coworkers expressed to me that they thought that he had a thing for me but i pushed all that away because i didn’t want to get hurt again. eventually he got back with his girlfriend and i was happy for him; until i found out how toxic she is. one day after work a group of us went to a bar and i spent most of the night with my other manager explaining to him why he and his girlfriend are not right for each other (in which he responded with “this is what everyone tells me”). during this times he started texting me more and more on my own number and he became even closer, i’ve never had someone know how to read and understand me so well and he feels the same. he was actually thinking about breaking up with her and all of us were supportive, but then he got in a bad accident. it seems this accident has pushed them back together and he’s scared to leave her, but something else that has happened from the accident is i realized i have feelings for him. i told him i was there for him and that turned into us texting and talking EVERY SINGLE DAY in the past 4 months since it happened. we’ve become a support system in a way. \n\nwell, now he’s moving across the country with his girlfriend (who doesn’t like me) (the feeling is mutual) and i’m scared i’m gonna lose him forever. i wanna tell him how i feel but i’m scared that’ll really make me lose him for good what should i do?\n\nTL;DR: i (25f) who’s terrible at relationships caught feelings for my soon to be ex boss (35m) in a toxic relationship and is about to move across the country. we hav a support system within each other and he’s about to move and i wan to tell him how i feel but i’m scared it’ll make me lose him for good.",
        "created_utc": 1678333663,
        "upvote_ratio": 1.0
    },
    {
        "title": "i’m tired of being scared and losing him but i also don’t want to ruin our friendship",
        "author": "niknolietesla",
        "url": "https://www.reddit.com/r/relationships/comments/11mht1w/im_tired_of_being_scared_and_losing_him_but_i/",
        "text": "so i (25f) am terrible at relationships. i’ve never had a boyfriend, only been on a handful of dates (all of them terrible), the last time i was kissed i was 7 years old (by a guy i’m still friends with), and i’m waiting until marriage. all that being said i have had 2 full blown situationships, one when i was 19 and the guy was 27 he never kissed me or took me on a date and it was really weird (he also told me he loved me) and the last one being for like 4 or 5 months last year. \n\nlosing the situationship when i was 19 really messed me up because i never got the affection i wanted from it and it ended so suddenly, however right after i thought realized i had feelings for a mutual friend of mine (i think i was lonely). that was never a situationship or anything as he blocked me and changed his entire personality and moved out of state, which again messed me up. \n\nquarantine wasn’t as rough as i thought it’d be, i used all the around the world options on the dating apps and got the most attention i had ever received from the opposite sex i’m my life. that new found confidence helped as i went into a job in my dream career field and that’s when i met my last situationship. this last situationship didn’t really mess me up as bad as my other one in the sense i ended it on my terms, but it was rough as he wouldn’t even kiss me or anything because he was intimidated by my virginity (although i am still a very sexual person). basically he would drunk text me and we would send each other sexts and risky pictures.\n\na few days after i broke it off with my situationship, i met my now soon to be ex boss (35m) (i know, i know). immediately i found him attractive, he’s almost exactly my type, but there was no way i was gonna act on that as he’s my boss and wayyyy out of my league. working with him for a few weeks i quickly learned he was going through a few really rough patches and my heart went out for the guy. he had also just broken up with his long term girlfriend amongst other things but i still didn’t want to make any moves, honestly i just became his friend and i liked that. \n\nsoon enough we became close to a few other coworkers and had a few group texts going on in which we’d talk on a lot. a few different coworkers expressed to me that they thought that he had a thing for me but i pushed all that away because i didn’t want to get hurt again. eventually he got back with his girlfriend and i was happy for him; until i found out how toxic she is. one day after work a group of us went to a bar and i spent most of the night with my other manager explaining to him why he and his girlfriend are not right for each other (in which he responded with “this is what everyone tells me”). during this times he started texting me more and more on my own number and he became even closer, i’ve never had someone know how to read and understand me so well and he feels the same. he was actually thinking about breaking up with her and all of us were supportive, but then he got in a bad accident. it seems this accident has pushed them back together and he’s scared to leave her, but something else that has happened from the accident is i realized i have feelings for him. i told him i was there for him and that turned into us texting and talking EVERY SINGLE DAY in the past 4 months since it happened. we’ve become a support system in a way. \n\nwell, now he’s moving across the country with his girlfriend (who doesn’t like me) (the feeling is mutual) and i’m scared i’m gonna lose him forever. i wanna tell him how i feel but i’m scared that’ll really make me lose him for good what should i do?\n\nTL;DR: i (25f) who’s terrible at relationships caught feelings for my soon to be ex boss (35m) in a toxic relationship and is about to move across the country. we hav a support system within each other and he’s about to move and i wan to tell him how i feel but i’m scared it’ll make me lose him for good.",
        "created_utc": 1678333659,
        "upvote_ratio": 1.0
    },
    {
        "title": "Weird mental obsession with girl who is t my girlfriend",
        "author": "Solobeatz_",
        "url": "https://www.reddit.com/r/relationships/comments/11mhox6/weird_mental_obsession_with_girl_who_is_t_my/",
        "text": "Hey y’all. First time posting in here and starting to get in the swing of Reddit. This will be pretty long so here goes. Last year I (17m) moved to a new school after I moved in with my grandmother. Absolutely love the school, the people, and all my teachers. I wouldn’t consider myself popular but I will say that I’m pretty known due to complications I had with people last year. There are a lot of pretty girls there and I’ve dipped my toes into relationships with a couple of them but there was always this one girl that I just knew I wanted. She’s the typical pretty girl popular type but not in the bad way. She’s actually really nice and I’ve spoken to her a few times. She’s a model and has guys drooling to even have a chance with her, rightfully so. Now, I’m not a bad looking kid. I’ve had a significant glow up and my personality is pretty decent if you get to know me well enough so I believe if given the chance, I’d be able to succeed in making her my gf. I sit pretty close to her in class and each day when she walks in, I can’t help but just admire how beautiful she is. The problem is, she has a lot of guys that want her and it’s hard to get an opportunity to Talk to her. One day, (when I was still single), I got the courage to Talk to her and ask her on a date so I texted her to meet in the lunch room and she agreed. Well I found out she was talking to someone but I still put it out there that I would love to take her out if it doesn’t work out. Haven’t heard anything from her since then but from my understanding, she is still talking to them. In the past 3 months or so I started talking to someone through an app and we instantly clicked. We are pretty similar and I ended up taking her on a pretty expensive date. Needless to say I had a great time and ended up asking her to be my girlfriend on new years. Everything has been going great and our communication is amazing. She’s making me wait 6 months for sex but that doesn’t bother me much. Overall a pretty good relationship. Problem is, I often find myself dreaming about this other girl from school more than I’d like to admit and I can’t control it. And everytime she walks into class I can’t help but look. I have never cheated nor been cheated on and I plan to keep it that way but the thoughts of this other girl make me feel guilty. It sucks because I don’t know what to do about it but does anyone have thoughts?\n\nTL;DR: I have a mental obsession with a girl from school even though I have a girlfriend",
        "created_utc": 1678333327,
        "upvote_ratio": 1.0
    },
    {
        "title": "Weird mental obsession with a girl that isn’t my girlfriend",
        "author": "Solobeatz_",
        "url": "https://www.reddit.com/r/relationships/comments/11mhn1n/weird_mental_obsession_with_a_girl_that_isnt_my/",
        "text": "[removed]",
        "created_utc": 1678333180,
        "upvote_ratio": 1.0
    },
    {
        "title": "Did I mess up by getting a gift",
        "author": "Chris5843",
        "url": "https://www.reddit.com/r/relationships/comments/11mhj6l/did_i_mess_up_by_getting_a_gift/",
        "text": "[removed]",
        "created_utc": 1678332867,
        "upvote_ratio": 1.0
    },
    {
        "title": "should I say sorry, can I?? me(M20) her(F20)",
        "author": "BIGGYBEAN_33",
        "url": "https://www.reddit.com/r/relationships/comments/11mhi1o/should_i_say_sorry_can_i_mem20_herf20/",
        "text": "\nlost a good friend\n\nThere was a girl I liked for a few years but was never in the right shape to talk to her. I'm gonna be straight up, I'm in college right now. When I finally had a class with her I decided it was the time to get better to talk to her. I wanted her so bad I started working out to atleast look better, I was fat before and lost nearly 40lbs. I mean, I was an atheist before and I wanted to talk to her so badly I started praying for an opportunity to talk to her, of course it was all in vain because i wasnt saved at the time. I never really went for anybody, I simply didn't have an interest in anyone but her. She's very introverted and quiet so I'm not really sure why she stood out so much. My brothers girlfriend got me and her to start talking finally but honestly I wasn't ready. The first week went great. We got to know eachother and would text everyday for about a week. We still texted a few days after but it slowed down as im sure she didn't want to talk 24/7. After about 3-4 weeks in she told me she didn't want a relationship with anybody, I didn't ask her out or anything, I think she didn't want to lead me on which was fine I could be patient, she said she wanted to be friends still. Then came 2 week Christmas break and I did the dumbest thing I could and texted her over break even though she didn't want a relationship. Of course she didn't answer. Since then I got a little pushy and asked things I shouldn't have because we were just friends. I thought she was mad at me when she wasn't and asked her over text and she said she wasn't mad and she's just introverted so prefers to be alone most of the time but it doesn't mean we can't be friends still. About a week after that I started seeing things a little more clearly and thought it would be best to slow it down, but I was too late. I asked her if we could talk on just 2 days a week. She said it was fine with her. Next day came and she wasn't there. At this point I think there's something wrong. I did another dumb thing and instead of just letting her be her and not interfering I just asked her where she was and said sorry if I'm being pushy, I just don't want to go back to being strangers again. Very weird thing to say to a friend I know. Then she told me verbatim \"I’m gonna be honest when I  first started talking to you I kinda felt a little pressured into being friends with you and I also heard there is a girl interested in talking to you but you don’t want to talk to her because of me and I don’t want to be the reason for that so I think it would be best if we stopped being friends because I don’t fully believe you when you say you understand when I tell you that I am not interested like that. I’m sorry.\"  I never talked to the other girl simply because I wasnt interested. She was right I didn't understand fully at the time. We were good friends, the conversations were nice, she stayed engaged. It was my first time ever trying with anyone so I didn't do the right things, I was too pushy. She was the nicest person I ever knew and I screwed it up. She had such a friendly smile and voice but now she just gives me the side eye, I don't think she necessarily hates me, I was never rude to her but I hate seeing her like that. More than anything I just want to tell her I'm sorry and ask her to forgive me. Which I think she could forgive me but I'm not sure if she'd give me another chance at being her friend. She wants to be left alone I'm sure but she helped me so much I can't let her go. I want to tell her im sorry but I'm afraid she wants to be left alone and I'd just lower her opinion of me if I told her. I don't know what to do. I thought I moved on at a time but I didn't. I couldn't ever forget her because of what she did for me even though unintentionally.\n\nTL;DR: Was good friends with someone and got too clingy  and pushy in the end. She left. I want to tell her im sorry.\n\nFor additional context we talked for exactly 2 months. Started on the 9th of November, ended on the 11th of January. About a month of that was two different breaks so it wasnt in person. I've now missed her longer than I've known her.",
        "created_utc": 1678332780,
        "upvote_ratio": 1.0
    },
    {
        "title": "I [15m] am looking for dating/relationship advice with a [15f] girl.",
        "author": "BigBrainT123",
        "url": "https://www.reddit.com/r/relationships/comments/11mhh7h/i_15m_am_looking_for_datingrelationship_advice/",
        "text": "I am a \\[15m\\] and and there is this girl \\[15f\\] in my social study's class and She is SO HOT and I'm super nervous around her so I need advice for talking to girls. I've had a crush around her for around a few months now and One thing to note i'm super awkward around girls just wondering if there are any girls here that have advice about how I can talk to her and approaching her and maybe even asking her out??? A little bit of context about me, I'm a professional snowboarder and I compete in International level events and I have ADHD. A little bit of context about her, she moved to Vancouver from Toronto and I'm pretty sure she likes skiing because her parents love the mountains. TL;DR looking for dating advice\n\nPlease Help this girl is super hot.",
        "created_utc": 1678332717,
        "upvote_ratio": 1.0
    },
    {
        "title": "What do you consider cheating?",
        "author": "RevolutionaryArm2449",
        "url": "https://www.reddit.com/r/relationships/comments/11mhh47/what_do_you_consider_cheating/",
        "text": "[removed]",
        "created_utc": 1678332710,
        "upvote_ratio": 1.0
    },
    {
        "title": "Should I say sorry, can I? me (M20) her (F20)",
        "author": "BIGGYBEAN_33",
        "url": "https://www.reddit.com/r/relationships/comments/11mhefx/should_i_say_sorry_can_i_me_m20_her_f20/",
        "text": "[removed]",
        "created_utc": 1678332508,
        "upvote_ratio": 1.0
    },
    {
        "title": "Absolutely terrible when it comes to picking up women.",
        "author": "ano700000",
        "url": "https://www.reddit.com/r/relationships/comments/11mhdtv/absolutely_terrible_when_it_comes_to_picking_up/",
        "text": "[removed]",
        "created_utc": 1678332460,
        "upvote_ratio": 1.0
    },
    {
        "title": "Looking for relationship advice",
        "author": "BigBrainT123",
        "url": "https://www.reddit.com/r/relationships/comments/11mhdk4/looking_for_relationship_advice/",
        "text": "[removed]",
        "created_utc": 1678332438,
        "upvote_ratio": 1.0
    },
    {
        "title": "I M25 have been fighting with my girlfriend F23 for 3 days",
        "author": "melbpal",
        "url": "https://www.reddit.com/r/relationships/comments/11mhc17/i_m25_have_been_fighting_with_my_girlfriend_f23/",
        "text": "[removed]",
        "created_utc": 1678332318,
        "upvote_ratio": 1.0
    },
    {
        "title": "Ever broke up with someone you love? Why?",
        "author": "LivingPotatoo",
        "url": "https://www.reddit.com/r/relationships/comments/11mhazd/ever_broke_up_with_someone_you_love_why/",
        "text": "[removed]",
        "created_utc": 1678332240,
        "upvote_ratio": 1.0
    },
    {
        "title": "looking for dating/relationship advice",
        "author": "BigBrainT123",
        "url": "https://www.reddit.com/r/relationships/comments/11mhai6/looking_for_datingrelationship_advice/",
        "text": "[removed]",
        "created_utc": 1678332199,
        "upvote_ratio": 1.0
    },
    {
        "title": "Constant Patterns 25F &amp; 26M —Melodramatic or AITA for considering Divorce",
        "author": "ReallyFruitTart",
        "url": "https://www.reddit.com/r/relationships/comments/11mh7z4/constant_patterns_25f_26m_melodramatic_or_aita/",
        "text": "[removed]",
        "created_utc": 1678332010,
        "upvote_ratio": 1.0
    },
    {
        "title": "Someone I Used to Like Shared My Text and I Don't Know How To Feel",
        "author": "Some-Phrase7777",
        "url": "https://www.reddit.com/r/relationships/comments/11mh7pv/someone_i_used_to_like_shared_my_text_and_i_dont/",
        "text": "[removed]",
        "created_utc": 1678331990,
        "upvote_ratio": 1.0
    },
    {
        "title": "My (32F) bf (38M) has many toxic friends in his life that tried to destroy our relationship and he has weird, questionable friendship with his female friends",
        "author": "ThrowRA7765167",
        "url": "https://www.reddit.com/r/relationships/comments/11mh4m9/my_32f_bf_38m_has_many_toxic_friends_in_his_life/",
        "text": "We were together more than 1.5 years. In the beginning, he came off as an amazing, successful, loving guy. We had a great time together. However, there are several issues: \n\n_He has a group of toxic friends (all in their 30s), who are rich, spoiled, mean, and condescending. All they do are spending their family money, party, do drugs. They tried to break up several couples in the past to show that they are powerful and can control other people's lives.  They tried to break my bf and I up as well. They ambushed him several times, called and pressured him everyday.  They gave him an ultimate \"break up with your gf or we won't be friends with you anymore\". They went as far as kidnap him and took his phone away from him, blocked me on everything, deleted our photos on social media, changed password of our shared streaming service. He is afraid of those people but he likes to be with them because he thinks they are elite. He took on a huge amount of debt (as much as other people  mortgage trying to keep up with those people.  After the kidnapping happened, I told him to distance himself from them because they are bullies. He did that for a bit, but getting right back to them after a few months. \n\n\n_He has a female friend (37F). Let's call her L. She lives in another state. She is bisexual. They knew each other for more than 10 year from the kink community. She liked him but he turned her down bc she isn't his type. However, they still have a very inappropriate relationship. They video called each other for hours everyday. He called her hun, texted her \"I love you hun. I missed you hun. I care about you hun.\" Etc... he hires her to work for him bc she doesn't make enough money for a living even though she is very incompetent, doesn't have any degree in the field and no experience. She got jealous and gave him an ultimatum \"break up with your gf or I won't be friend with you anymore\" when she knew the toxic friend group did that to put more pressure on him. She joined his therapy session, talked to the therapist and convinced her to tell him to break up with me. She had so much control over him, and he lost the ability to speak for himself. He said that he didn't know how he felt but she knew. She cried, yelled, threw a tantrum on the phone with him to force me to leave his place at certain time of her liking, forced him to cancel vacation with me (but he didn't), asked him to come visit her for 2 weeks right after our vacation so that he would miss my birthday, which he did. He came back after that, we made up. He distanced himself from her. They still talked, but less. Months later, he reversed back to his old way, hired her to work for him bc she is unemployed. She asked and he wrote her a fake letter of recommendation to make her a manager of his company so that she could find a job. \n\n\n_He has another female friend from high school.  Let's call her B (38F). They dated a few months back in high school but it didn't work out. They stay friend. B hates women. She said women are catty. She doesn't have any friend aside from him. She is jealous of her sister and doesn't have a good relationship with her mom. She hates her job and very unhappy in her relationship bc she pursued a guy for 5, 6 years but he didn't love her. She also has a big amount of debt from overspending.  My bf is her only friend. They call each other several times a day. Sometimes they talk for hours.  She hates my gut even though we never met and didn't have any interaction. I wanted to get to know her but she refused. She is very hostile towards me, threatens that if I ever reach out to her she would call the police. She sent my bf many selfies and photos of her, wanted him to send his photos back but specifically said that she just wanted to see photos of him and not photos of us together as a couple. She demands him to call her everyday or she would go crazy.  When I stayed at my bf's place for 9 days or so, of course he couldn't call her (only texted and emailed her behind my back), she went crazy and called his father to trash talked me and made a lot of false accusations towards me, saying I cut off all his friends and that I'm controlling and abusive. It's a huge lie bc we hung out with several friends of his and mine. The only friends I told him to distance himself are that toxic friend group and L and that's for good reasons. \n\n\n_He has depression and bipolar disorder. He is unstable and mentally weak. He is also a people pleaser and unable to set any boundaries. That's why he allow those people to walk all over him and over me. \n\n\n_His work ethic is horrible. He hates working, like spending. He has a huge amount of debt and his only hope is his parents would help him out because they are very wealthy. If not, he will have to move back home with his parents and file bankruptcy. \n\n\n_He isn't exactly a loyal type. He attempted to cheat on me in the past. He went to a kink party (which he lied to me and said he went to work). He met a kinky girl there, flirted with her, took her number and tried to set up a double date with another kinky couple but it didn't happen bc of schedule conflict. He hid the fact he was kinky from me in the beginning. I only figured out much later into the relationship. \n\n\n_He is a two-faced person. He lies a lot. When those toxic friends attacked and trash talked me behind my back, he didn't stand up for me but pretended to agree with them. They hate his former roommate, and he made fun of his roommate to entertain them. He isn't a man with integrity. He deleted texts and phone calls between him and L, him and B so that I wouldn't see them. When B trash talked me with him, he made himself a victim to get more sympathy and attention from her. He told me he couldn't stand up for me in front of those people because he is weak. When he distanced himself from L and the group of toxic friends that kidnapped him, he gaslit and blamed it on me that because of me he lost his friends. He said that he chose to be with me because he loves me but blamed it on me later. \n\n\n-The last 2 months of our relationship, he fully went back to the toxic friends, fully went back to L, still had no boundaries with B, went back to kink parties. He called me during the trip he took with the toxic friends crying, saying he loves me, misses me, and that he wishes he was with me and not with them.  He asked me to be patient with him because he was going through a very hard time. I was very confused. \n\n\n-I tried my best to help him out with his business and his mental health, convinced him to go see a psychiatrist for his depression and bipolar disorder and the medication really helps with his mood swing. Still, he went back to his old ways. \n\n\n-I decided to talk to his father about all the issues so that his father can take care of him. I could no longer see myself being in this relationship. It took a toll on me. He gave me an ultimatum to never talk to his parents or his friends (He lied too much and afraid the truth will come out if I talk to them). I met his parents before and have a really good relationship with them until B called his father lying about me, smearing my name. I don't know how it was handled. I can't trust a word that come out of my bf's mouth. Talking to his father gave me the closure I needed. He was really mad that I talked to his father.  We broke up after that, which is fine. It's for the best. I deserve better! \n\n\n- I do miss him. We shared a lot of good memories. The bad was really bad but the good was really good. I hope I made the right decision to leave. \n\n\nIs it just me or his \"friendship\" with L and B is very abnormal?\nWhat do you think about those toxic friends? About him and the situations? What would you do if you were me?\nHe completely hid the \"friendship\" with L and B from me in the beginning.  I figured it out much later after getting into the relationship. \n\n\nTdlr: bf has many toxic friends that tried to ruin our relationship and he has very inappropriate friendship with female friends.",
        "created_utc": 1678331747,
        "upvote_ratio": 1.0
    },
    {
        "title": "found bf on bumble?",
        "author": "CharacterKing7809",
        "url": "https://www.reddit.com/r/relationships/comments/11mh2jw/found_bf_on_bumble/",
        "text": "[removed]",
        "created_utc": 1678331592,
        "upvote_ratio": 1.0
    },
    {
        "title": "found bf on bumble?",
        "author": "CharacterKing7809",
        "url": "https://www.reddit.com/r/relationships/comments/11mh1rn/found_bf_on_bumble/",
        "text": "[removed]",
        "created_utc": 1678331525,
        "upvote_ratio": 1.0
    },
    {
        "title": "i (18F) told my bf (19M) a conversation i had with one of my friends (18F) and now he’s quite upset with me.",
        "author": "Academic_Platform935",
        "url": "https://www.reddit.com/r/relationships/comments/11mgz5t/i_18f_told_my_bf_19m_a_conversation_i_had_with/",
        "text": "we’re going on our third month now and i told him about a conversation i had with my friend(18F). basically she said “your bf has a really nice ass” and i replied by saying “yea it’s bigger than both of a combined” as a joke. i told him this and he got very upset with me, leaving me on seen/delivered or responding in a dry way. \ndo guys not like complements on their butt area? or does it depend. cause i now realised that he doesn’t like it so obviously i won’t do it again but he left me on seen when i asked him “are you still upset with what happened?” \n this is my first relationship so i’m very hesitant on everything. these past few days even before the “joke” he’s been off. not replying to me for hours or going out without telling me which i’m usually used to. it’s okay if you don’t want to tell me i don’t mind but it’s because he usually calls and tells me is what threw me off when he stopped. same with exams, turns out he had finals this week and he didn’t tell me until his third day of finals. i assumed he didn’t reply to me yesterday for 3 hours because he was studying for finals and when i told him he said “i have nothing tomorrow” he was clearly awake cause he was posting stories of reels and stuff so i don’t know what’s going on honeslty. i don’t expect him to talk to me everyday all the time because i do tell him if you’re not free then it’s okay. or he tells me i’m not going to be free today and that’s it, a simple message basically. \n\nTLDR- it’s just confusing and upsetting to be honest, i’ve been having mixed feelings a lot and i don’t know to do. nor do i want to ruin what’s between us over a joke and being left on seen and stuff like that. \ni don’t think i’m going to text him anything else until later on in the day.",
        "created_utc": 1678331322,
        "upvote_ratio": 1.0
    },
    {
        "title": "Dont like the way my boyfriend eats",
        "author": "themindmaster9",
        "url": "https://www.reddit.com/r/relationships/comments/11mgp5v/dont_like_the_way_my_boyfriend_eats/",
        "text": "tl;dr \nI am F21 and my boyfriend is M22, we have been dating for 4 years. I don’t know this sounds mean but I don’t like the way my boyfriend eats. He eats very slow and most of the time when I finish the bowl, he still chews the food slowly or shovels around the plate. It didn’t bother me at first but as four years passed, it still bothers me whenever I see him eat. I tried to ignore it a couple times because I love him and I don’t want to be mean but most of the time when looking at him eating, it makes me enjoy my food less. Also, because he has a small appetite so he doesn’t eat much and he is very picky on eating. \n\nNow it comes to the point where i am less attracted to him and i guess i gradually feel out of love because of it. What should I do? Will i be an asshole if i break up with him because of this?",
        "created_utc": 1678330574,
        "upvote_ratio": 1.0
    },
    {
        "title": "26M dating 33F?",
        "author": "Dashed12",
        "url": "https://www.reddit.com/r/relationships/comments/11mgp1r/26m_dating_33f/",
        "text": "TLDR: is it okay for 26 year old to date a 33 year old female or should i ditch it? \n\nI’m 26 and met this amazing girl on Hinge. We have intense dating and sexual chemistry. We have very similar personalities, mutual physical attraction. She’s super smart, articulate, ambitious and just honestly an amazing woman. Only real issue is that she isn’t sure she wants kids whereas I def do but it’s early days. She’s open to it down the line if it works out. \n\nI haven’t been in a proper relo ever. I had a fling with a girl when I was 18 that lasted a few months. I’ve slept around a fair bit and have had multiple FWB but never found true chemistry until now. I only now at 26 understand what true chemistry is. There was no second guessing or waiting for her to reply - it’s just been amazing since I met her 2 months ago. \n\nMy biggest concern is the age gap - id always seen my partner to be younger or the same age, or a few years older, not 7.\n\nMost of my mates say go for it, because true organic chemistry is hard to come by. But one mate said it’ll be hard to keep the attraction when you’re say 32 and she’s 39. Also brought up issue of having kids at 38-40 could pose issues. I’m confused and part of me is like why bother if she’s unsure if she wants kids because it will end if she doesn’t…but it’s such early days and so many other things apart from children could end this relo \n\nThoughts ?",
        "created_utc": 1678330565,
        "upvote_ratio": 1.0
    },
    {
        "title": "My partner [16F] and I [17M] disagree about a person in our lives and it's causing a lot of trouble for us.",
        "author": "throwaway-5-5-5",
        "url": "https://www.reddit.com/r/relationships/comments/11mgozz/my_partner_16f_and_i_17m_disagree_about_a_person/",
        "text": "For context, my partner and I have been together for a year and about two months. This person has been there for her through thick and thin before I knew her, and then abandoned her multiple times, and they fluctuate. She's very forgiving. I've always disliked him as he's always treated me horribly, and every time I've confronted him about it he shifts the blame on to me and tells me that he's going to off himself because of me.\n\nRecently my partner has decided that she likes him again and wants to rekindle that, but it's becoming very detrimental to my mental health and causing arguments every time I bring it up to her. I really, genuinely love her, and some of you might think I'm too young to know that I do, but I do. I really love her, and I don't know how to come to a compromise. On one hand, she rips off the leech and cuts him off, yay I get what I want, but she's unhappy so I'm unhappy and guilty. On the other hand, she keeps talking to him and it hurts my mental health, which she then feels guilty about. I don't know what to do.\n\nTL;DR my partner and I are struggling to deal with our individual relationships with a toxic person.",
        "created_utc": 1678330561,
        "upvote_ratio": 1.0
    },
    {
        "title": "26M dating 33F…any issues?",
        "author": "Dashed12",
        "url": "https://www.reddit.com/r/relationships/comments/11mgo37/26m_dating_33fany_issues/",
        "text": "[removed]",
        "created_utc": 1678330494,
        "upvote_ratio": 1.0
    },
    {
        "title": "Dont like the way my boyfriend eats",
        "author": "themindmaster9",
        "url": "https://www.reddit.com/r/relationships/comments/11mgnhf/dont_like_the_way_my_boyfriend_eats/",
        "text": "[removed]",
        "created_utc": 1678330447,
        "upvote_ratio": 1.0
    },
    {
        "title": "My girlfriend (17F) can't deal with a relationship right now with me (18M)",
        "author": "OfficerBanjo",
        "url": "https://www.reddit.com/r/relationships/comments/11mgmj0/my_girlfriend_17f_cant_deal_with_a_relationship/",
        "text": " Hey Reddit,\n\nMe and my ex are both in high school, I'm a senior and she's a junior. Recently, over a very heart felt (and heart-breaking) half hour talk in her car, she told me that even though I had been the sweetest person she had ever met and that I had been the best boyfriend she ever had, she couldn't deal with a relationship right now due to stress and anxiety, ending a month-long relationship. I've been through a break-up before but this one has hit me hardest in the gut because I made such a strong connection with her so quickly. Her reasoning makes sense as she's in band, she does rowing, she is always stressed and anxious about school work, and all the other things she's involved in. What I want to get across here is that it makes sense, and I respect her decision. I can see how much she cares for me, because if not, she wouldn't have told me about this problem. However, I'm a little confused on where to go from here.\n\nMutually, we made sort of agreed to meet up again sometime in the future when she was not as stressed or loaded down with work, as we're probably going to the same college. However, right now, we still remain friends. Usually, I'll see her once a day in the hallway and talk to her about this or that. I'm not sure this is mentally healthy for me, even if it does bring solace to my mind. The question in my head is that, should we completely break it off or should we remain connected because we agreed we were going to eventually bring it back together in the future? I'm concerned about how this will effect our healing processes if we see each other everyday.\n\nThis break-up hit hard and I'd be incredibly grateful for any and all advice. Thanks.\n\n TL;DR: High school senior (me) and junior (her) recently broke up due to the junior's stress and anxiety. Agreed to meet up in the future but remain friends for now, which may not be mentally healthy for me. I'm unsure whether to completely break it off or stay connected for the eventual reunion. Seeking advice on how to handle the situation.",
        "created_utc": 1678330372,
        "upvote_ratio": 1.0
    },
    {
        "title": "Dont like the way my boyfriend eats",
        "author": "themindmaster9",
        "url": "https://www.reddit.com/r/relationships/comments/11mgmad/dont_like_the_way_my_boyfriend_eats/",
        "text": "[removed]",
        "created_utc": 1678330355,
        "upvote_ratio": 1.0
    },
    {
        "title": "I (21M) stared an argument w my girlfriend (21F) that I shouldn’t have started. Now I feel like a POS :/",
        "author": "rv2626",
        "url": "https://www.reddit.com/r/relationships/comments/11mgj2h/i_21m_stared_an_argument_w_my_girlfriend_21f_that/",
        "text": "[removed]",
        "created_utc": 1678330121,
        "upvote_ratio": 1.0
    },
    {
        "title": "My girlfriend (17F) can't deal with a relationship right now with me (18M)",
        "author": "OfficerBanjo",
        "url": "https://www.reddit.com/r/relationships/comments/11mgirh/my_girlfriend_17f_cant_deal_with_a_relationship/",
        "text": "[removed]",
        "created_utc": 1678330097,
        "upvote_ratio": 1.0
    },
    {
        "title": "Need some relationship advice",
        "author": "john373713",
        "url": "https://www.reddit.com/r/relationships/comments/11mgi1g/need_some_relationship_advice/",
        "text": "Looking for some advice\n\nI am a 29 year old guy. My girlfriend is 25. We have been dating for almost 5 years and things are going well… out of the bedroom.\n\nFor a little backstory, I was her first and was completely okay waiting for a bit. Well, we did it and have been semi regularly for years. Being her first, I fully understood and am okay with the fact that some things may take longer to be open to or be willing to try if she wasn’t comfortable. I have been very very accommodating and have never forced her into anything and always verbally ensure she is okay with what we are doing or planning on doing.\n\nHere’s where my issue lies. Not once in these 5 years has sex been initiated by her. Not once has any of the fantasies or desires that I have expressed ever played out. It’s taking a toll on me emotionally and in our relationship. I have tried every way under the sun to initiate as well as to initiate conversation about this. She gets very uncomfortable talking about sex in general. I’ve tried in person, FaceTime, and texting to see if we could have more of a deeper conversation regarding this (both about the issue and to initiate sex itself)\n\nWe recently had a real sit down conversation regarding this and how to move forward. She told me she does get nervous at the thought of initiating. I fully understand this and have explained many times that it’s important to me and how I feel our connection. I also said the literal only time I can actually imagine saying no would be in the 5 minutes following a personal disaster.. think someone dying. She also mentioned that she enjoys our sex when we are in the middle of stuff, but never gets horny or turned on in the slightest until she’s in the middle of it. This seems to explain the never initiating portion. She’s even gone as far as saying that she in general is not a very sexual person, doesn’t tend to think about it, and has never tried any solo fun with herself either. Basically she could go her whole life without sex, while I am sitting here wanting her to initiate once and a while, want to have more adventurous sex, and just want to have more sex in general. \n\nJust as a side note, she doesn’t really reject my advances in person, but I am feeling pretty undesirable after being never the one to have it initiated with them, and the fact that things I want to try just get left on the table.\n\nOur short term fix is for me to initiate MORE sex so maybe she will feel a bit more comfortable initiating, but this feels like bandaid at best right now.\n\nHave any of you ever been in this situation or have any advice about moving forward?\n\nI just love her so much, don’t want to hurt her, but also embrace the fact that as a human, I need my needs met as well.\n\nTL;DR: long story short, our sex drives are different and we have talked but are trying to find a way to push forward",
        "created_utc": 1678330041,
        "upvote_ratio": 1.0
    },
    {
        "title": "with a partner that rarely says \"I love you\", normal? (26m) (23f)",
        "author": "jufklps12",
        "url": "https://www.reddit.com/r/relationships/comments/11mggj5/with_a_partner_that_rarely_says_i_love_you_normal/",
        "text": "Girlfriend and me have a healthy, steady relationship. My girlfriend isn't the most openly affectionate person, however, and this is also the case for how often she says she loves me. I'm used to affectionate girlfriends and I often hear how loved up couples say I love you a lot. We just don't do that.\n\nWe're long distance so we often only voice call and chill together. When we're together in person I can tell she loves me (even if she still doesn't say it too much), but when we're apart she typically won't say she loves me unless I say it first.\n\nI can honestly count how often she says it first. Before we met for the first time in person she was the first person to say \"I love you\". I didn't say it back because I wasn't ready, but once I was I have been good at telling her I love her.\n\nSeveral months after she first told me she loved me she told me she cried that evening because I didn't say it back. Once I did start saying it myself we both said our I love yous at a decent rate. Then we met in person for the first time, both showed our love in many ways, and then I returned home.\n\nI've since visited her again, and we're having a third trip to a neutral country very soon, but since after I returned home from the first trip I've heard her say \"I love you\" literally four times on her own accord. Once after we watched a movie, and three times in 4 days when I returned home after Christmas. Since then, she's reverted back to type. She did say she loved me on our anniversary 5 days ago, but again I said it first.\n\nIs this just nothing to worry about? Is it even normal? She still talks about vacations together next month, in 4 months time, and when I next visit her country (whenever that could be), so should I assume things are still good?\n\n**TL;DR: girlfriend rarely says I love you first. Wondering if it's normal and/or a problem**",
        "created_utc": 1678329927,
        "upvote_ratio": 1.0
    },
    {
        "title": "18F who doesn't go to school, how do I find friends who are also 18F with my interests?",
        "author": "ldclab",
        "url": "https://www.reddit.com/r/relationships/comments/11mgers/18f_who_doesnt_go_to_school_how_do_i_find_friends/",
        "text": "\ni feel extremely lonely\n\nI only have 1 friend, she's my best friend but I feel like she doesn't care about listening to me often and likes to talk about her own interests more.\n\nI spend everyday playing videogames (nintendo/anime games), watching anime and working.\n\nI have trouble making friends at work because they don't share the same interests as me and I can't continue a conversation because I know no pop culture or sports. There is also only 1 person I work with who is around my age.\n\nI considered getting into contact with my old friends but they also don't share my interests and they're also gossips so I don't trust them much.\n\nI was considering playing a sport, but I don't know if I'd actually make a friend since most people who like anime don't play sports. (atleast females who watch anime.)\n\nwhere can i meet new people who like anime and jrpgs/anime games?\n\nTLDR i don't go to school and i want new friends my age but i don't know where to meet people who like the things i like (anime)",
        "created_utc": 1678329801,
        "upvote_ratio": 1.0
    },
    {
        "title": "Texting games?",
        "author": "AwkwardInterview6669",
        "url": "https://www.reddit.com/r/relationships/comments/11mgdyf/texting_games/",
        "text": "[removed]",
        "created_utc": 1678329735,
        "upvote_ratio": 1.0
    },
    {
        "title": "Odd Interaction",
        "author": "EmoIceCream",
        "url": "https://www.reddit.com/r/relationships/comments/11mgcwh/odd_interaction/",
        "text": "[removed]",
        "created_utc": 1678329654,
        "upvote_ratio": 1.0
    },
    {
        "title": "me [24/f] unsure if I should be concerned about my partner [30/m]",
        "author": "sailawaymoon",
        "url": "https://www.reddit.com/r/relationships/comments/11mga06/me_24f_unsure_if_i_should_be_concerned_about_my/",
        "text": "So we have been together for over 5 years and we are very happy like absolutely in love and best friends.\n\nAnyways I worry about things and it consumes me. Most days when we're chilling he gets extremely solid hard but we won't have sex which is fine. However when we casually do get intimate and I get on top or whatever most times he isn't as solid. He's still erected but it doesn't feel solid if that makes sense? Yet he ejaculates really quickly.\n\nIs this because he's not attracted to me or is this normal ? He doesn't struggle to actually ejaculate he last about 5-20 mins. (Most of the time I'd say 5 to 15minutes.) He tells me he's completely satisfied with me and I am the best he has had. He doesn't smoke or drink and eats relatively healthy. I don't have a problem with anything at all I just feel like maybe there's something I can't do for him sexually even though he seems satisfied?\n\nI have never been with anyone else and so I don't know what is expected is this completely normal or what should I do?\n\nTl;Dr - my boyfriend isn't completely solid during sex. Erected and ejaculates really quickly but not throbbing hard is this normal ?",
        "created_utc": 1678329436,
        "upvote_ratio": 1.0
    },
    {
        "title": "Any advice on how I [22f] can move on from a guy [24m] who almost became my boyfriend?",
        "author": "filo-babo",
        "url": "https://www.reddit.com/r/relationships/comments/11mg9kk/any_advice_on_how_i_22f_can_move_on_from_a_guy/",
        "text": "Hi everyone,\n\nI need some advice on how to move on from the sweetest and most caring guy I've ever met. \n\nWe first met in October and hit it off right away. We saw each other every week and even had trips together. He eventually had to go back to his hometown in the west coast after our third date. We kept in touch every day, even though we didn't see each other for almost two months.\n\nIn January, things got pretty serious when he flew from the west coast to the east coast just to be with me for ten days. We did all kinds of relationship stuff. But this was also the time when he also told me that he was still talking to a girl he had gone on dates with last November. That was fine with me because we never had the DTR talk until he visited me. He assured me that they were just friends and that he already \"broke up with her\" before flying in to see me. So I brushed it off. \n\nWe became exclusive a month after, but decided to hold off on making it official until we knew which state we'd end up in (since I just recently graduated and would have to move). Now that it's March, and that we know we'll end up in different states, we decided to end things. It was the most mature and amicable break up. \n\nBut what's bothering me is that he stopped initiating conversations with me. It's hard for me to understand why he continued to talk to her every day even after they had the \"break up talk\" back in December, but stopped talking to me right after we split. I have a feeling that he might pursue her now that we're done. \n\nI understand that it is none of my business now and that they are free to do what they want. But it makes me wonder why he did all of those things for me while he was still in contact with her everyday (even as friends) and if he ever enjoyed my company as much as he did hers. \n\nI'm struggling to move on because I lost someone who I know would be the best boyfriend. I'm jealous of the girl because I know he'll treat her as special as how he did to me. Should I even bring it up to him and ask him for my own peace of mind? Any advice on how to get over him would be appreciated. \n\nThank you.\n\nTLDR: Met a great guy, did all kinds of relationship stuff, but he still talked to a girl he had gone on dates with (but he told me they broke up in December). We became exclusive in February, but held off on making it official until we knew which state they'd end up in. Decided to end things amicably in March. However, he stopped initiating conversations with me after the breakup, which makes me sad  because he continued talking to the girl even when they \"broke up\" last December.",
        "created_utc": 1678329400,
        "upvote_ratio": 1.0
    },
    {
        "title": "It feels like I can never please her help please",
        "author": "Omario02",
        "url": "https://www.reddit.com/r/relationships/comments/11mg8x7/it_feels_like_i_can_never_please_her_help_please/",
        "text": "I 19m and my gf 18f have been together for a little over 7 months now and until now things have been going well.\n\nRecently I have started to workout with a couple of my friends and I work quite a bit along with school. I am working 2 jobs trying to support the two of us around 55 hours a week,(she also works part time). As well as school. \n\nI only workout 2 days a week when I get off work before 8 which is my typical time I get off work. I’m out of the house from 7 am until 8 pm 3 days a week. This time is both jobs and school.\n\nShe only works weekend from 7-3 and we spend Saturday and Sunday together the rest of the day as well as every night.\n\nShe’s been getting very upset with me when I workout after work and get home from 9-10pm although at first she was totally supportive of it. \n\nI know I work a lot but I do it for the both of us, and we spend plenty of time together. Am I being selfish with my time or is she too entitled to it? \n\nTLDR! Please help.",
        "created_utc": 1678329349,
        "upvote_ratio": 1.0
    },
    {
        "title": "I (35F) offended my friend (35F) and now she is ignoring me. Is there a way to make it better?",
        "author": "dondi4444",
        "url": "https://www.reddit.com/r/relationships/comments/11mg69w/i_35f_offended_my_friend_35f_and_now_she_is/",
        "text": "One of my good friends of 20+ years stopped talking to me about something I did. She is a journalist working on a project for a while. I have decent computer skills. Last week she sent me some photos and asked if I could blur the faces on those photos and I said totally. Her project was due on Monday. I actually did half of it but then I got busy with work. Last week has been crazy for me, my work picked up (it includes a lot of fieldwork) and I had family visiting so I had to rush to the hotel we were all staying after work. \n\nOn top of everything I got pretty sick. So I totally forgot, no excuses. To make it worse, she sent me a reminder on Saturday but I was driving the family around and my googlemaps was on, so I ended up not seeing the message. I know I messed up and these are all excuses but this is the situation. As soon as I realized it on Monday, I texted her to apologize and asked if she still have time to submit it. She never answered. I tried calling the next day and she hung up - I texted her asking if everything was alright. She said that she doesn't want to talk to me because this project was very important to her, those photos were critical and I didn't even have the courtesy of letting her know that I was rude and irresponsible. I replied by apologizing again but also told her that nothing like this ever happened in the past, so it is unfair of her to blame me for being irresponsible and rude without giving me the benefit of the doubt - I actually did stuff for her similar to this often in the past and always delivered on time. I tried calling/texting a couple more times but never got a response. I feel pretty bummed but she is not talking. I know I messed up but do you think I messed up royally? Is there a way to salvage this or should I give her space?\n\nI should also mention that we had some disaggrements in the past. The biggest one being about her not reaching out to me when my mom was on a ventilator for 3 months when she had covid. She knew about the situation but never called, she was in a new relationship. I eventually told her that I was hurt and she called and apologized profusely. I actually gave her the opportunity to apologize and make it up. We eventually moved forward. We have an ongoing issue of me feeling that our friendship is one sided. I always reach out to her, when I visit my hometown (I live abroad), I always go to her to visit. So this giving me the silent treatment makes me question a lot of stuff about our friendship. Am I only useful when I do stuff for her? Am I that easy to cut off? What do you think reddit? Is it worth trying to salvage this?\n\nTL;DR! I said that I would do something for my friend and totally forgot. Now she is not talking to me.",
        "created_utc": 1678329150,
        "upvote_ratio": 1.0
    },
    {
        "title": "My [25M] therapist says I should stop being so upfront and let feelings develop overtime",
        "author": "feinosh895",
        "url": "https://www.reddit.com/r/relationships/comments/11mg4mz/my_25m_therapist_says_i_should_stop_being_so/",
        "text": "So I’ve never had a relationship before despite really wanting one. I’ve gone on a few first dates but unfortunately that never led to anything more.\n\nBefore, I would try to meet a girl (through hobbies, class, etc.) and talk to them. I followed the general Reddit advice of letting your intentions be known upfront and not try to pretend to be friends first. I would have a conversation and then invite them to coffee. If coffee goes well I invite them on a formal date. They have always said no.\n\nMy therapist says I am rushing into it too fast and that I need to slow down and let feelings develop overtime. This really confuses me because it seems to go against the “upfront” approach Reddit proposes so much. He seems to suggest being friends and seeing if things develop further, but not asking them on a direct date right away.\n\nIs he right? Should I try to just be friends first and not ask them on a date so soon? I mean, the direct approach hasn’t been working for me so well\n\nTLDR: I have tried to be direct and upfront with my intentions when asking girls out, but my therapist tells me to slow down and let feelings develop over time. Is he right?",
        "created_utc": 1678329027,
        "upvote_ratio": 1.0
    },
    {
        "title": "what’s allowed in relationship Tldr",
        "author": "Maleficent-Farm-5057",
        "url": "https://www.reddit.com/r/relationships/comments/11mg3uo/whats_allowed_in_relationship_tldr/",
        "text": "[removed]",
        "created_utc": 1678328971,
        "upvote_ratio": 1.0
    },
    {
        "title": "Slowly falling out of love",
        "author": "chaotic_in_black",
        "url": "https://www.reddit.com/r/relationships/comments/11mg3u8/slowly_falling_out_of_love/",
        "text": "[removed]",
        "created_utc": 1678328970,
        "upvote_ratio": 1.0
    },
    {
        "title": "Should I (26F) be Concerned that my bf (26M) mentioned he wants full custody during hypothetical discussion about divorce?",
        "author": "Spacequest89",
        "url": "https://www.reddit.com/r/relationships/comments/11mg1vy/should_i_26f_be_concerned_that_my_bf_26m/",
        "text": "We were recently discussing how one of my friends is going through a divorce. Luckily, my friend doesn't have kids. I was telling the situation to my bf, and we started talking about that subject. \n\nWe then jokingly talked about if we were in that situation. He then said that he would probably want to have full custody of the kids where they would live with him, and that I could periodically visit from time to time. I then said it would be ideal to at least share custody, but then he said he would not want that and would definitely want them full time. He said he would probably fight with me on that if I wanted to split custody...\n\nI personally think it's a bit selfish on his part to think that way. Do you all think this is a potential red flag? \n\nTDLR: Bf and I discussed hypothetical divorce situation, and he said he would want full custody of the (hypothetical) kids regardless of the situation, simply because he wants them and is willing to fight over it. Is this a red flag?",
        "created_utc": 1678328807,
        "upvote_ratio": 1.0
    },
    {
        "title": "Someone Is Starting A Rumor About Me That is True. What do I do?",
        "author": "Some-Phrase7777",
        "url": "https://www.reddit.com/r/relationships/comments/11mg1oh/someone_is_starting_a_rumor_about_me_that_is_true/",
        "text": "[removed]",
        "created_utc": 1678328790,
        "upvote_ratio": 1.0
    },
    {
        "title": "slowly falling out of love",
        "author": "chaotic_in_black",
        "url": "https://www.reddit.com/r/relationships/comments/11mfzuo/slowly_falling_out_of_love/",
        "text": "[removed]",
        "created_utc": 1678328649,
        "upvote_ratio": 1.0
    },
    {
        "title": "My (25F) boyfriend (27M) forgets to tell me things, but firmly believes he did.",
        "author": "No_Disaster_4495",
        "url": "https://www.reddit.com/r/relationships/comments/11mfy2v/my_25f_boyfriend_27m_forgets_to_tell_me_things/",
        "text": "My boyfriend and I have been together for almost 7 months now. He is a very sweet, kind, and caring person; I really want to make this work.\n\nThere is a common issue in our relationship where on his end, he believes he tells me details about things (e.g. when a lunch with his family will be, when his family is coming over, etc.), but on my end, I'm always blindsided with the details. I find it odd because I am a very time-sensitive person and put everything into my calendar as soon as I hear about things. I feel like he thinks he tells me, but doesn't, and tries to convince me that he did. On the other hand, he feels like I forget everything he tells me. It's problematic because we feel like the other is trying to \"gaslight\" the other when I know that on both our ends, we firmly believe that the other person is forgetting.\n\nTo provide some background, I have anxiety and he has ADHD. I don't really want to blame his ADHD for forgetting to tell me things; however, the reason why I feel it may be a contributing factor is because my mom has ADHD and is very forgetful when it comes to sharing important details or updates about things. Even if it *is* his ADHD, I don't know how to bring it up respectfully without offending him. I do want to note that sometimes my mind is frazzled and not super present all the time because I'm always overthinking about my busy/overworked schedule.\n\nI know there is a communication issue somewhere, but I don't know where to start. I feel like I am going crazy because I've always been very detail-oriented when it comes to scheduling, but my boyfriend makes me feel like I'm forgetful. I will often remember both my boyfriend's and my appointments (I felt really anxious when he forgot his last hair appointment), where his belongings are in his apartment, and feel this nagging feeling like I have to help him \"manage\" his life due to the amount of anxiety I feel about him forgetting things.\n\nThanks in advance for your help.\n\ntl;dr Am I the gaslighter or the gaslit?",
        "created_utc": 1678328514,
        "upvote_ratio": 1.0
    },
    {
        "title": "My (25F) boyfriend (27M) forgets to tell me things, but firmly believes he did.",
        "author": "No_Disaster_4495",
        "url": "https://www.reddit.com/r/relationships/comments/11mfwtw/my_25f_boyfriend_27m_forgets_to_tell_me_things/",
        "text": "[removed]",
        "created_utc": 1678328419,
        "upvote_ratio": 1.0
    },
    {
        "title": "Odd Interaction",
        "author": "EmoIceCream",
        "url": "https://www.reddit.com/r/relationships/comments/11mfshi/odd_interaction/",
        "text": "[removed]",
        "created_utc": 1678328089,
        "upvote_ratio": 1.0
    },
    {
        "title": "What does my male friend want to indicate when he sends me dirty memes related to sex?",
        "author": "Charming_Object1327",
        "url": "https://www.reddit.com/r/relationships/comments/11mfehy/what_does_my_male_friend_want_to_indicate_when_he/",
        "text": "Hello, I (25 F) am in a committed relationship with my boyfriend and I love him a lot. We both study and live in Europe but in different countries. Days ago, I met this guy (25 M) through my mutuals and we became good friends in less time. We had deep talks, opened up about lots of things, got free to talk to in front of each other. We got that comfort level and discussed about our past relationships. He knows that I'm in a relationship. What I have for this guy is nothing but friendship. I mean, even if I was single, I wouldn't consider to move things forward with him romantically. He on the other hand, sometimes try innocent flirting, texts me everyday without fail and tries hard to impress. What bothers me about this guy is he sends me dirty memes which are related to sex. The one meme which he sent me which totally blew my mind off was: \n\"F*ck her hard until she screams the name of her real boyfriend\".\n\nWhat does this meme really mean and what does this friend want to indicate? I called him out on this.\n\nTL;DR my guy friend sends me dirty memes.",
        "created_utc": 1678327062,
        "upvote_ratio": 1.0
    },
    {
        "title": "Why does my male friend want to indicate when he sends me dirty memes related to sex?",
        "author": "Charming_Object1327",
        "url": "https://www.reddit.com/r/relationships/comments/11mfd4y/why_does_my_male_friend_want_to_indicate_when_he/",
        "text": "Hello, I (25 F) am in a committed relationship with my boyfriend and I love him a lot. We both study and live in Europe but in different countries. Days ago, I met this guy (25 M) through my mutuals and we became good friends in less time. We had deep talks, opened up about lots of things, got free to talk to in front of each other. We got that comfort level and discussed about our past relationships. He knows that I'm in a relationship. What I have for this guy is nothing but friendship. I mean, even if I was single, I wouldn't consider to move things forward with him romantically. He on the other hand, sometimes try innocent flirting, texts me everyday without fail and tries hard to impress. What bothers me about this guy is he sends me dirty memes which are related to sex. The one meme which he sent me which totally blew my mind off was: \n\"F*ck her hard until she screams the name of her real boyfriend\".\n\nWhat does this meme really mean and what does this friend want to indicate? I called him out on this.\n\nTL;DR my guy friend sends me dirty memes.",
        "created_utc": 1678326957,
        "upvote_ratio": 1.0
    },
    {
        "title": "My male friend sends me dirty memes about sex",
        "author": "Charming_Object1327",
        "url": "https://www.reddit.com/r/relationships/comments/11mfba4/my_male_friend_sends_me_dirty_memes_about_sex/",
        "text": "[removed]",
        "created_utc": 1678326818,
        "upvote_ratio": 1.0
    },
    {
        "title": "My ex (23M) is talking to his ex (23F)",
        "author": "Decent-Safe-2330",
        "url": "https://www.reddit.com/r/relationships/comments/11mf9kf/my_ex_23m_is_talking_to_his_ex_23f/",
        "text": "[removed]",
        "created_utc": 1678326684,
        "upvote_ratio": 1.0
    },
    {
        "title": "I(25M) am going on a trip with some friends(25 Ms and Fs). There are certain topics they bring up which I have not done enough in life to experience and I feel horrible, How can I excuse myself in these situations?",
        "author": "RefrigeratorKey1518",
        "url": "https://www.reddit.com/r/relationships/comments/11mf8a9/i25m_am_going_on_a_trip_with_some_friends25_ms/",
        "text": "[removed]",
        "created_utc": 1678326588,
        "upvote_ratio": 1.0
    },
    {
        "title": "New open relationship issues...",
        "author": "No-Sherbet7595",
        "url": "https://www.reddit.com/r/relationships/comments/11mf7rb/new_open_relationship_issues/",
        "text": "So my boyfriend (M28) and I (F23) have been together for almost three years. We're both very adventurous and spoke early about opening things up. However we have only just begun adding in partners.  \nI have had one experience with him watching, and one other failed attempt. He was supposed to meet a girl alone before this, but we got into a fight (I was just starting my period and it ended up being really bad timing, I was too emotional in general), and the second girl was for a threesome. She ticked all the physical boxes, but we had a ft and I didn't gravitate to her, although I was still open to doing it.  \nI don't know if this is an issue though? Do i need to like the girl particulary? I don't always need to like the man im playing with...  \nI spoke to my boyfriend about this, but he was really ready to shut it down. He is worried I will feel bad etc. which I totally understand, but I think on some level I just need a bit of a push to get going (I had some concerns before we did things the other way around too).  \nI also feel like maybe he's not saying how he feels incase he hurts me, he's very sensitive to my feelings, but I also want to make sure he's happy!  \nHis conclusion that night was that we wasn't being open anymore, and he said he wanted to close the relationship. Since, we have discussed that we could do things in a more organic manor, and sort of not put much emphasis on it for now...  \nThis was good for me, and a few days later I deleted the chat messages I had with the other guy wee successfully saw.  \nIm very curious about playing with other girls, and open to anything my partner wants to indulge in. However I feel really bad that I have not been into the most recent girl and the timing issue with the girl before. I feel like im letting him down and not being a good partner. I want him to be happy and enjoy himself, that gives me joy (and turns me on)! And we haven't had any of these kinds of issues with him, although he did say with some of the male options I had that he wasn't interested in them, but it was before a ft call etc.\n\nToday he asked me if I still had the guys number and if I wanted to message him. I said I didn't, but I could find it if he wanted to still do this. He said he would like to if I would. I did enjoy what we did together, but it wasn't a massively significant point in my life. My conclusion was that it was just a different sexual experience, I thought it would feel more... naughty/ bad? I'm happy in my relationship, and I enjoy that my partner gets something out of this dynamic. I do too, I mean its just sex for me, that my partner gets a lot out of. But I'm not sure why he wants to keep doing this when he was quite adamant about closing the relationship up (I never said it). I think nows a good time to mention that the focus was on me sleeping with other men in the first place. He was interested in that and I was too, however he felt that it would be unbalanced if he wasn't able to too (which I was totally fine with and curious about). It was all a very exciting fantasy at first.  \nSo is it fair to conclude he enjoys this mostly?\n\nSO heres a few summary questions\n\n\\- Do I need to really like the girl?  \nWhat I've learnt from this is that its a different game for men and women.  \nIm a girl that doesn't need connection for sex and some men dont either (i dont want to generalise), so the process of hooking up is quite straight forward.  \nIm not huge into texting these men, so again it's not massively a thing in regards to connecting.  \nA little bit of sexting and photos sporadically. My boyfriend LOVES this btw... It turns him on a lot!\n\nFor him it seems to have been quite different.  \nHe likes to connect (in general), and it seems that most girls like to have a bit of connection too. So he has been building up these connections, chatting more regularly.  \nThe girl we FT he wanted to pick up and have drinks first... but in some ways i see this being part of his communication style? And this girl seemed to be like that herself. She was also very into me and exploring her bi side.  \nI saw their messages and was totally fine with this, but I just didn't gravitate to her on the call. I don't think we'd be friends in real life, but that would be the same with some men ive been with, so does it really matter? Plus I was happy to go forward, he wasn't.  \nI think he wanted me to be more friendly with the girl, which made sense, but I didn't expect it from him. Again different dynamic though, right?\n\n\\- Should I push him to explore with girls a little more?  \nI really discussed with him after that I still want to do it, im really curious, but he seemed to have made his decision.  \nIt's almost as though, because I don't get the same thing out of it he isnt happy. I think thats a little unreasonable, as its not exactly the same [thing](https://thing.do/). Do I just need to be a little more accommodating and encouraging, so he feels good about doing it? I dont want it to be the things im doing/ saying thats making him feel bad.  \nOr do you think that maybe he's much more into the other stuff and not really into this as much, but just wants to keep it even. He said himself it's a lot of work with girls. He feels he has to host and keep everyone happy. That is feeling a little stressful for him.\n\nOpen relationships are hard... they require a lot of communication lol! Any insight would be great x  \n\n\nTL;DR! - what should I do about my boyfriend wanting to close the relationship, yet still wanting me to see other men?",
        "created_utc": 1678326546,
        "upvote_ratio": 1.0
    },
    {
        "title": "New open relationship problems...",
        "author": "No-Sherbet7595",
        "url": "https://www.reddit.com/r/relationships/comments/11mf692/new_open_relationship_problems/",
        "text": "[removed]",
        "created_utc": 1678326425,
        "upvote_ratio": 1.0
    },
    {
        "title": "Should I (21m) cut this guy off indefinitely (25m)",
        "author": "RFantasy20",
        "url": "https://www.reddit.com/r/relationships/comments/11mf44k/should_i_21m_cut_this_guy_off_indefinitely_25m/",
        "text": "I started talking to this guy around December and things were great. Then he made a comment about giving his barber h*ad and I blew up. He said it was a joke but I didn’t believe him and cut him off because I just thought it was weird. Anyways we ended up moving past it. \n\nFast forward and we get into another argument because I forgot we were hanging out one day. I apologized profusely and he ignored me all night and the following day. We got past it and made up again. Because of all of these things we decided not to have s*x for a little while and to focus on us. \n\nUnfortunately one night when we were hanging out he was sending shirtless pictures of himself to a guy right in-front of me and I flipped and got extremely hurt.  He ignored me for days because he said I should’ve brought it up in the moment and I shouldn’t blow up on him . I do wanna say that he told me that he had his options open. I told him that I can’t keep hanging around him if he doesn’t wanna focus on me. He agreed and I forgave him. \n\nAbout 2 weeks ago I asked if he has been intimate with that other guy and he said he has been for a month. To be perfectly honest I would’ve respected him more if he told me he was gonna pursue this other guy but he straight up lied to me. I just don’t know what to do I like him a lot, and he keeps reaching out but he hasn’t even tried to apologize or anything. I just don’t know what to do I’ve never been in a situation like this. All criticism is appreciated!\n\nTL;DR\nI’ve been having multiple issues with this guy and I need to know if I should cut him off for good",
        "created_utc": 1678326265,
        "upvote_ratio": 1.0
    },
    {
        "title": "should I (20nb) break up with my bf (32m) or talk about it?",
        "author": "anonuser20174829",
        "url": "https://www.reddit.com/r/relationships/comments/11mf0dc/should_i_20nb_break_up_with_my_bf_32m_or_talk/",
        "text": "[removed]",
        "created_utc": 1678325986,
        "upvote_ratio": 1.0
    },
    {
        "title": "Should I (21m) cut this guy off indefinitely (25m)",
        "author": "RFantasy20",
        "url": "https://www.reddit.com/r/relationships/comments/11mf08y/should_i_21m_cut_this_guy_off_indefinitely_25m/",
        "text": "[removed]",
        "created_utc": 1678325976,
        "upvote_ratio": 1.0
    },
    {
        "title": "My neighbor (30M) talked me(28F) into going out with him and now I regret it",
        "author": "latinblonde17",
        "url": "https://www.reddit.com/r/relationships/comments/11mesuf/my_neighbor_30m_talked_me28f_into_going_out_with/",
        "text": "Basically, this guy (30M) who I (28F) was somewhat friends with tried pursing me for a bit, but I avoided it/said no because :\n\n1.) We live in the same apartment complex, and\n\n2.) He was also involved in a strange situation with a 48-year old divorced woman who also lives in the complex....this fact really weirded me out and made me uncomfortable. However, he kept being persistent about it and I like to be pursued (and honestly had a slight crush on him) so I ended up caving eventually and agreeing.\n\nThe date went super well minus the fact that said 48 year old flipped out at him for taking me out and tried to sabotage our date. I ended up really liking the guy, but I could not deal with that, so I ended things with him and told him she was the reason why. He was understanding about it, but a little upset still, and I was upset because as I said, I ended up liking the guy. I deep down had hoped he would cut things off with her and try to make it work with me (since he was romantically interested in me), and because I know he wants to get married and have kids eventually.\n\nBut instead, he went right back to her, and now is flaunting it in my face basically (she is as well). I am very hurt and upset by this and I don’t know what to do. When I initially ended things, I told him if I saw them together it would be weird for me, which he understood, but when I confronted him about what he was doing, he acted dumb and said I “friendzoned” him, and he wasn’t going to apologize for “making up” with this woman. I don’t want this to bother me but it does, it makes me feel like I meant nothing now. I know it was very short, and I was the one who ended things, but I did actually feel a connection too, so this has just been a lot. \n\n&amp;#x200B;\n\n\\*\\*TL;DR;\\*\\* : I am in an uncomfortable situation because of going out with my neighbor and I need advice",
        "created_utc": 1678325426,
        "upvote_ratio": 1.0
    },
    {
        "title": "my partner [26nb] and I [31nb] have hit problems - is it time to call time on an 8 year relationship?",
        "author": "Relationshipanon354",
        "url": "https://www.reddit.com/r/relationships/comments/11mer72/my_partner_26nb_and_i_31nb_have_hit_problems_is/",
        "text": " \n\ntl;dr - I've been in a relationship for 8 years and we've become less compatible, and I don't know what to do.\n\nAnonymous account because I think my partner watches my reddit account.\n\nWe've been together for 8 years, we're poly, we married during lockdown, and we get along well, we are very much in love and virtually never argue.\n\nOne ongoing issue has been physical intimacy - I have a lot of past trauma that relates to sex, which a couple of years was made much worse by a further incident (not with my partner). For a long time, I've been grappling with the fact that while I'm not actually \"asexual\" in the most conventional sense, that the truma has made me what I think of as \"functionally asexual\". I really don't care it, and whenever I engage in sex it feels like I'm playing russian roulette with the risk of an hours long episode that makes me want to kill myself. Just not worth it.\n\nMy partner has a high libido and is definitely frustrated by this, though they do pursue sex with other people by virtue of us being poly.\n\nA couple of weeks ago, I came out to my partner as asexual (insofar as I am). A day later, my partner sat me down and read me a letter in which they spell out that they accept that I am asexual, but that not having physical intimacy makes them feel very distant from me. They listed a number of issues with the relationship - that we don't spend enough time together, go on dates, engage in physical intimacy, and that they feel that I generally don't 'pull my weight' in the relationship - and then they set out that while they're not presenting me with an ultimatum, that these things need to change for our marriage to continue. My partner also revealed that they have been seeing a therapist secretly for months, that they talk to their therapist about me and about our relationship, and that their therapist doesn't seem to like me.\n\nIn response, I talked a little more about how physical intimacy is difficult for me, but that now that we were on the same wavelengh about sex being off the table, that engaging in it might seem a lot less daunting to me. I also set out that I don't really agree that I don't 'pull my weight', that they also don't put much effort into organising dates, and that they are often incredibly rude to me - something that I attribute not to malice but to accident - but I pointed out that it does hurt me and that I just let it go unmentioned every time.\n\nWe didn't really arrive at a definitive conclusion, but rather an honest expressiion of our various issues, with the implication being that we would both work on them. Since then, we've spent more time around each other, I've voiced when I thought something rude was said (and my partner promptly apologised). Things definitely feel a little better, but it feels like a mild improvement, rather than some kind of relationship renaissance.\n\nI'm a bit torn about what to do going forward. On the one hand, I love my partner dearly, and often have these nice little moments with them where I feel really grateful to have them in my life and to be married to them. On the other hand, I think the reality is that I'm just not the person I was when we got together, and frankly I don't really think I'm the partner they really ought to have. I don't mean like I have these big shortcomings that I could fix - I think we're just less compatible people now than we were back then. One thought experiment I keep playing over in my mind is \"if our lives won't so closely interwoven, and had we only been together for 6 months, would we stay together?\" and frankly - I'm not sure.\n\nIf we were both very old, maybe the interia of life would suggest that staying together is the obvious outcome. When I'm concerned about is that we're both young, we have long lives ahead, and I don't want intertia to be the reason we're together. I don't want to get 8 years in the future and realise that the same problems exist and have gotten worse, and that we wasted our 30s when we should have called it much sooner. Equally, I don't want to throw away a loving 8 year long relationship, with the person I love and cherish most in the world. I have no idea what the correct route is.",
        "created_utc": 1678325308,
        "upvote_ratio": 1.0
    },
    {
        "title": "My neighbor (30M) talked me (28F) into going out with him and now I regret it",
        "author": "latinblonde17",
        "url": "https://www.reddit.com/r/relationships/comments/11mepw8/my_neighbor_30m_talked_me_28f_into_going_out_with/",
        "text": "[removed]",
        "created_utc": 1678325205,
        "upvote_ratio": 1.0
    },
    {
        "title": "Is watching porn considered cheating?",
        "author": "iwillnamemypugyoda",
        "url": "https://www.reddit.com/r/relationships/comments/11mepv7/is_watching_porn_considered_cheating/",
        "text": "[removed]",
        "created_utc": 1678325202,
        "upvote_ratio": 1.0
    },
    {
        "title": "My gf 18F is best friends with my ex 18F who hates me 18M",
        "author": "Not-hav-2",
        "url": "https://www.reddit.com/r/relationships/comments/11menzr/my_gf_18f_is_best_friends_with_my_ex_18f_who/",
        "text": "[removed]",
        "created_utc": 1678325060,
        "upvote_ratio": 1.0
    },
    {
        "title": "Patience Wearing Thin",
        "author": "carbtheway",
        "url": "https://www.reddit.com/r/relationships/comments/11memgb/patience_wearing_thin/",
        "text": "I (22F) am dating a 31M. We met in November of 2022 and went to a gig together, and then to a bar with his friends after but we had a great date that ended up lasting the whole weekend. To clarify we are both not dating anyone else. For Christmas, I got him a print designed by a local artist of that very first bar we went together, but he actually didn’t realise where or what the bar was because he was so drunk and stoned. \n\nFast forward to March 2023 and we are still dating. We meet almost every weekend, have dates, and went away together in January to see my friends and for another concert. We barely had sex for the whole weekend and he kept going soft during sex, an issue that we never experienced beforehand.\n\nThis issue persisted into February where he kept going soft during sex and one night he said he felt I should be with someone more sexually compatible. He opened up about feeling insecure as I never cum during sex and he thought this meant I wasn’t enjoying it and faking it.\n\nAs a partner, I’m very selfless and reassuring and will invest any amount of energy into convincing someone otherwise when it comes to their own insecurities. It worked and our sex life essentially is back on track, but he occasionally still goes soft during sex as he still overthinks. I’m starting to feel a little burnt out.\n\nDespite all of this, I recently realised that I love him and have never felt so infatuated with someone. He said that being in a relationship is a very serious step for him as he has previously been hurt and cheated on in the past. Initially, I was understanding of this and was happy to go at his pace as I couldn’t be more comitted to the man and open about my feelings, but he treats me like his girlfriend without the commitment.\n\nHowever, I went to Berlin with a friend and wanted clarity on what we were before going, he essentially told me his ex had cheated on him there and I was a “free agent” in Berlin and could do anything I wanted. I felt so hurt by this because once again, he reminded me that a relationship is a big commitment and very serious to him and implied he wasn’t ready, right after I had literally told this man I wanted to be with him and loved him. I couldn’t give more to this man if I tried.\n\nIn a drunk rage at KitKat and a big chat with a man I’ll never meet again about everything above, I ended up having sex with him in the bathrooms. I don’t feel guilty for it because we aren’t in a relationship (as reminded). I feel like I deserve more but I’m also TA for sleeping with someone else incase he was “testing” me.\n\nTDLR; Slowly losing patience and growing tired and burnt out of waiting for this man to become comitted to me. He says a relationship is a serious step but has a trip booked away with me, has met my friends, and is overly publicly affectionate and treats me like his girlfriend.",
        "created_utc": 1678324937,
        "upvote_ratio": 1.0
    },
    {
        "title": "GF [27f] spends too much time on her phone. I [29m] addressed the issue but it wont change",
        "author": "cthaehh",
        "url": "https://www.reddit.com/r/relationships/comments/11meljn/gf_27f_spends_too_much_time_on_her_phone_i_29m/",
        "text": "The title pretty much says it all.\nShe works from home and has a bit of a tight schedule, and recently she started being more active on social media to try to sell some product, or earn some extra money from it.\nShe is partnering with a couple whos good friend of ours and they speak about this project almost all day long in a whatsapp group we have.\nThe thing is, she has been spending a lot of time on the phone, like if we arr going to or coming back from some place, when she is taking a shower, or even when she is coming home she spends some time on the car sending messages work or project related.\nI have addressed the issue, it didnt go very well at first, then things seemed to improve a little bit. However, recently they have invested some money and a lot of time on this project, so they are always planning the next post/analysing the last one.\nIm a low profile person, have 0 posts on social media and have no interest in becoming a public person, nor spending this much time on social media.\nIdk how to addres the issue, this may sound like taking stuff of my chest, but I think Im afraid this will end our relationship, cuz I theres a decent chance things will be even worse in this matter as this project matures.\n\nTl;Dr - girlfriend increased her time on screen significantly and there's a decent chance it will get worse.\nAfraid this might end our relationship. Have addressed the issue but didnt help as much as I d like.",
        "created_utc": 1678324869,
        "upvote_ratio": 1.0
    },
    {
        "title": "I (28f) texted my boyfriends (33m) old friend",
        "author": "Relevant_Pen_2502",
        "url": "https://www.reddit.com/r/relationships/comments/11meku3/i_28f_texted_my_boyfriends_33m_old_friend/",
        "text": "This past weekend, my boyfriend (33m) told me (28f) about an old friend that “recently” came back into his life. He used to be in love with this girl, but she didn’t want him romantically. While telling me about it, I told him I’ve had similar situations occur where people from my past come back around and how timing is weird, etc. Basically I tried to relate to his situation and reassured him that life is weird. We had this conversation as he drove.  After reaching our destination, we didn’t talk about it again. We watched a show and cuddled on the couch. At around midnight, he got a text and I asked him who it was. He said it was the girl (the old friend), so I asked what she said, since it was around midnight on Saturday. He instantly got weird and hid his phone. I remember being weirded out and asking him, but he literally hid the phone in his pockets. \n\nAfter arguing about it for a while, with me asking why he was afraid to show me, he finally agreed and showed me. I went into his recently deleted messages and there were 34 messages deleted, all with her. I recovered them and read the conversation, all with him next to me. Honestly, the conversation wasn’t THAT bad, aside from some comments about him feeling pressured to propose, sending a Valentine’s Day msg, her asking him what he looks for in a partner, etc. \n\nIf that had been the end of the story, I wouldn’t be making this post. Like I said, the texts themselves weren’t that bad. However, it continued to be weird after that. I felt hurt that he would delete texts and try to hide anything from me. He also lied about when they started talking again. He said it was a few weeks ago, but it’s actually been since September, which is early into when we started talking.\n\nFast forward through a restless night, we were driving again the next day. During the ride, I asked him to block her - not necessarily because of their messages, but because he felt the need to delete texts / hide it from me, and also to see if he would make a fuss about blocking her (if so, why?)\n\nHe said no and that I was being controlling. That response honestly told me a lot. After a whole day or arguing and going back and forth, I decided to text her. I apologized for messaging her, but told her I just wanted to know if there was anything between them before I get engaged to this person. She said no and basically told me they’re just friends who talk periodically. I felt reassured and thought maybe we would be able to move forward.\n\nHowever, he keeps insisting that it was controlling of me to ask him to block her. He says the people of Reddit agree. The issue is, he’s making it out to be like he told me about an old friend and I instantly told him to block her. He’s missing the whole deleting texts part. \n\nI have never texted a boyfriends ex or friends, so I also feel weird about doing that. However, I feel like I was pushed to that point. Like I said, I didn’t even bring it up or ask her name or anything after he told me about her initially. It was only after he started being weird and dodgy after she texted him at midnight, and after I discovered he had deleted their messages. \n\nI’d be grateful to hear your thoughts and opinions.\n\n\nTLDR; My boyfriend tried to hide messages with an old friend / crush of his. I texted her and asked her if there was anything between them.",
        "created_utc": 1678324819,
        "upvote_ratio": 1.0
    },
    {
        "title": "my partner [25nb] and I [30nb] have been together for 8 years, but we may be growing apart.",
        "author": "Relationshipanon354",
        "url": "https://www.reddit.com/r/relationships/comments/11mekfl/my_partner_25nb_and_i_30nb_have_been_together_for/",
        "text": " tl;dr - I've been in a relatiosnip for 8 years and we've become less compatible, and I don't know what to do.\n\nAnonymous account because I think my partner watches my reddit account.\n\nWe've been together for 8 years, we're poly, we married during lockdown, and we get along well, we are very much in love and virtually never argue.\n\nOne ongoing issue has been physical intimacy - I have a lot of past trauma that relates to sex, which a couple of years was made much worse by a further incident (not with my partner). For a long time, I've been grappling with the fact that while I'm not actually \"asexual\" in the most conventional sense, that the truma has made me what I think of as \"functionally asexual\". I really don't care it, and whenever I engage in sex it feels like I'm playing russian roulette with the risk of an hours long episode that makes me want to kill myself. Just not worth it.\n\nMy partner has a high libido and is definitely frustrated by this, though they do pursue sex with other people by virtue of us being poly.\n\nA couple of weeks ago, I came out to my partner as asexual (insofar as I am). A day later, my partner sat me down and read me a letter in which they spell out that they accept that I am asexual, but that not having physical intimacy makes them feel very distant from me. They listed a number of issues with the relationship - that we don't spend enough time together, go on dates, engage in physical intimacy, and that they feel that I generally don't 'pull my weight' in the relationship - and then they set out that while they're not presenting me with an ultimatum, that these things need to change for our marriage to continue. My partner also revealed that they have been seeing a therapist secretly for months, that they talk to their therapist about me and about our relationship, and that their therapist doesn't seem to like me.\n\nIn response, I talked a little more about how physical intimacy is difficult for me, but that now that we were on the same wavelengh about sex being off the table, that engaging in it might seem a lot less daunting to me. I also set out that I don't really agree that I don't 'pull my weight', that they also don't put much effort into organising dates, and that they are often incredibly rude to me - something that I attribute not to malice but to accident - but I pointed out that it does hurt me and that I just let it go unmentioned every time.\n\nWe didn't really arrive at a definitive conclusion, but rather an honest expressiion of our various issues, with the implication being that we would both work on them. Since then, we've spent more time around each other, I've voiced when I thought something rude was said (and my partner promptly apologised). Things definitely feel a little better, but it feels like a mild improvement, rather than some kind of relationship renaissance.\n\nI'm a bit torn about what to do going forward. On the one hand, I love my partner dearly, and often have these nice little moments with them where I feel really grateful to have them in my life and to be married to them. On the other hand, I think the reality is that I'm just not the person I was when we got together, and frankly I don't really think I'm the partner they really ought to have. I don't mean like I have these big shortcomings that I could fix - I think we're just less compatible people now than we were back then. One thought experiment I keep playing over in my mind is \"if our lives won't so closely interwoven, and had we only been together for 6 months, would we stay together?\" and frankly - I'm not sure.\n\nIf we were both very old, maybe the interia of life would suggest that staying together is the obvious outcome. When I'm concerned about is that we're both young, we have long lives ahead, and I don't want intertia to be the reason we're together. I don't want to get 8 years in the future and realise that the same problems exist and have gotten worse, and that we wasted our 30s when we should have called it much sooner. Equally, I don't want to throw away a loving 8 year long relationship, with the person I love and cherish most in the world. I have no idea what the correct route is.",
        "created_utc": 1678324790,
        "upvote_ratio": 1.0
    },
    {
        "title": "My partner [26nb] revealed they had been seeing a therapist in secret and presented me [31nb] with a laundry list of issues with our marriage.",
        "author": "Relationshipanon354",
        "url": "https://www.reddit.com/r/relationships/comments/11meix1/my_partner_26nb_revealed_they_had_been_seeing_a/",
        "text": "[removed]",
        "created_utc": 1678324679,
        "upvote_ratio": 1.0
    },
    {
        "title": "I (28f) texted my boyfriends (33m) old friend",
        "author": "Relevant_Pen_2502",
        "url": "https://www.reddit.com/r/relationships/comments/11meid2/i_28f_texted_my_boyfriends_33m_old_friend/",
        "text": "[removed]",
        "created_utc": 1678324642,
        "upvote_ratio": 1.0
    },
    {
        "title": "Should I stop pursuing or stay patient?",
        "author": "carbtheway",
        "url": "https://www.reddit.com/r/relationships/comments/11mef58/should_i_stop_pursuing_or_stay_patient/",
        "text": "[removed]",
        "created_utc": 1678324413,
        "upvote_ratio": 1.0
    },
    {
        "title": "If a Man Doesn't Want to Pay For You on a Date, Does He Respect You?",
        "author": "[deleted]",
        "url": "",
        "text": "[removed]",
        "created_utc": 1678324367,
        "upvote_ratio": 1.0
    },
    {
        "title": "My gf(39f) was too upset to see me(40m) after an \"argument\" we had.",
        "author": "kinkyelefante",
        "url": "https://www.reddit.com/r/relationships/comments/11me9h0/my_gf39f_was_too_upset_to_see_me40m_after_an/",
        "text": "So we've been dating for 9 months. Has been great. I was actually planning on proposing later this year. Normally, we communicate great. We've never had a fight or even an argument that got heated. But then this came along...\n\nShe planned a birthday weekend getaway for me this past weekend. She cancelled it because of weather. We went from big weekend plans to her going to a show with her mom Saturday. Sunday morning we texted normal morning hellos. Then I asked her when was a good time to come over. She said I needed to figure out what we were doing. The tone of her text felt a little aggressive. I came up with an idea that she shot down. I  ended up going to her place and in person she attacked me with a pretty stern tone saying \"you don't ever make plans for us. It's always me doing all the work.\" I wasn't expecting this. She's never came at me like that. I shut down. We ended up not talking for like an hour, when she suggested I go home. I went home. A couple hours later realized I handled that poorly. I texted her that I was sorry about shutting down like that and explained to her that I felt attacked. She texted me back a few lines, nothing that suggested she was angry/upset about what happened earlier.\n\nMonday I worked so we didn't see each other. Usually on my off days during the week we hang out after she gets off work. I texted asking what time I should come over. She responded with something like \"I'm really upset right now and need time to process. Tonight isn't a good night for you to come over.\" I sat on that for a bit then let her know if she was upset then we should talk sooner rather than later. She said she understood.\n\nFast forward to today. I hadn't heard a thing from her. Early afternoon I tried calling and left her a voice mail voicing my desire to talk today. I left an ultimatum there saying we needed to talk today. In hindsight that was probably the wrong move. She called me back and there was a lot of yelling/arguing. Eventually we went silent and ended the call. This was the first time I've ever heard her upset. Ever. I texted her a couple angry things after the call. Honestly things that did not belong in text. I then realized those were mistakes if I wanted this relationship to continue and basically poured my heart out in the final text.\n\n*my big frustration is that we've never fought. Not even close to it. And suddenly she's too upset to see me or even talk to me. I had no idea what was going on. My mind went off the deep end and assumed the worst and it made me incredibly anxious. She told me she needed time. I get that...but days? It isn't like I deliberately wronged her in some awful way. I didn't even know what was wrong. In the past when I've seen sudden behavior shift like this it meant the person was cheating both times. I don't think she would do that, but I believe her mind was made up before we talked at all today. At one point today her text read **\"if we talked yesterday I was so angry I probably would've broken up with you\"** am I wrong in being hella suspect about that statement? I had never once considered that...and this is where she was going? Ready to break up?*\n\nI texted some things after our call that were not good. I asked her when I could come pick up my stuff. I assumed at that point she was done. Then I doubled back and poured my heart out in the final text that she hasn't responded to. She put me at such a point of anxiety/anger for not even letting me know what was going on.\n\n**Tldr; girlfriend verbally attacked me, then took days to \"resolve\" her feelings. I forced them today and we probably broke up. But not sure.**",
        "created_utc": 1678324008,
        "upvote_ratio": 1.0
    },
    {
        "title": "My high school boyfriends new girlfriend just followed me on Instagram",
        "author": "40belowbitch",
        "url": "https://www.reddit.com/r/relationships/comments/11me71k/my_high_school_boyfriends_new_girlfriend_just/",
        "text": "So my (21F) high school boyfriend (20M) and I haven’t spoken to each other in years. Yesterday his now girlfriend(20F) (I’m guessing) followed me on instagram. I DMed her to ask if I knew her and she saw it but didn’t respond. I live in a totally different state and have never met this girl in my life. \nThe reason I find this notable is because the last time this happened, his now ex texted me to say the he 1) compared me and her while they were dating and 2) still had nude photos of me from when I was 16. Supposedly he deleted these photos afterward. The difference is that I went to high school with her but not this new girl. Anyhow, strange situation. Questions and suggestions welcome.\n\nTL;DR: high school boyfriend’s girlfriend followed me on Instagram after years of not talking.",
        "created_utc": 1678323843,
        "upvote_ratio": 1.0
    },
    {
        "title": "My high school boyfriends girlfriend followed me on Instagram",
        "author": "40belowbitch",
        "url": "https://www.reddit.com/r/relationships/comments/11me3c2/my_high_school_boyfriends_girlfriend_followed_me/",
        "text": "[removed]",
        "created_utc": 1678323604,
        "upvote_ratio": 1.0
    }
]